{
  "articles": [
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA, SAMY MAGDY",
      "description": "Israel has delayed a Cabinet vote on the long-awaited ceasefire deal that would pause the fighting in the Gaza Strip and release dozens of hostages. Prime Minister Benjamin Netanyahu says a last-minute dispute with Hamas is holding up Israeli approval. Hamas denied the claims. Netanyahu postponed the Cabinet vote on the agreement that had been scheduled for Thursday until Friday, at the earliest. Netanyahu signaled complications with the deal shortly after U.S. President Joe Biden and key mediator Qatar announced it was complete. Meanwhile, Israeli airstrikes killed at least 72 people in the war-ravaged territory.",
      "publishedAt": "2025-01-16T08:43:40Z",
      "title": "Israel PM Netanyahu says Cabinet won't meet over Gaza ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-16-2024-dc0ef64dd52db395c5a54328518e8efd",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1728b8/2147483647/strip/true/crop/3426x1927+0+178/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2Ff7%2Fc60a54009fad2b224c70ed5c6b16%2Fa54bae01200f4a988ef59fd63292f800"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Prime Minister Benjamin Netanyahu said that a “last minute crisis” with Hamas was holding up Israeli approval of the agreement to pause the fighting in the Gaza Strip and release dozens of hostages.",
      "publishedAt": "2025-01-15T11:50:00Z",
      "title": "Israel-Hamas ceasefire: Netanyahu says deal to return hostages reached",
      "url": "https://apnews.com/live/israel-hamas-ceasefire-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c6bfa1/2147483647/strip/true/crop/4965x2793+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F03%2Fc18e3d2b4ca395fd1281299abcf5%2Fap25016513897703.jpg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "The Israel-Hamas war has devastated the Gaza Strip. Satellite photos offer some sense of the destruction in the territory. Some of the images have illustrated a likely buffer zone, wanted by Israel despite international objections. It would take some 60 square kilometers out of the enclave. In all, the strip of land along the Mediterranean Sea is about 360 square kilometers. Palestinians hope it will be part of a future state, along with the West Bank and east Jerusalem. Other images tell the story of how Palestinians’ lives have changed during the war. Gaza City has been decimated, with buildings destroyed and roads filled with rubble. The images have also helped relief agencies and experts make estimates regarding the extent of the damage.",
      "publishedAt": "2025-01-16T16:57:28Z",
      "title": "Before and after satellite photos of the Gaza Strip",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-destruction-satellite-photos-90093bca75d28af6193c21b9d1b5eaed",
      "urlToImage": "https://dims.apnews.com/dims4/default/b483047/2147483647/strip/true/crop/6040x3398+0+315/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2F36%2F7891359760cde23e3d2d07e29833%2F25f24490519342f787329a50f1288e31"
    },
    {
      "author": "VICTORIA EASTWOOD, SAMY MAGDY",
      "description": "Egypt’s chief diplomat is calling on Israel and Hamas to implement a Gaza ceasefire plan “without any delay.” The message by Foreign Minister Badr Abdelatty on Thursday raises pressure on Israeli Prime Minister Benjamin Netanyahu to accept the deal. Abdelatty spoke to The Associated Press at a sensitive time. A day after President Joe Biden and other international mediators announced the ceasefire agreement, Netanyahu insisted there still was no deal. Abdelatty declined to comment on Netanyahu’s claims that Hamas has “reneged” on certain pledges in the agreement. He said “we have a deal” and that it was time to move forward.",
      "publishedAt": "2025-01-16T21:16:04Z",
      "title": "AP Exclusive: Egypt's chief diplomat urges Israel and Hamas to enact ceasefire 'without any delay'",
      "url": "https://apnews.com/article/ceasefire-egypt-gaza-hamas-israel-eu-war-3e434d5612f62ee5b188acf74f65f1fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7cb79e/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fb2%2Fdbf26d9373db9e1b37b3a9bae45b%2F2ca2db62997542b685c1b09dc637a348"
    },
    {
      "author": null,
      "description": "Antony Blinken was interrupted as he gave his final comments State Department’s briefing room. As he touted the Biden administration’s help brokering a ceasefire deal in Gaza, two journalists accused him of complicity in Israeli violence.",
      "publishedAt": "2025-01-16T18:43:01Z",
      "title": "Blinken confident Gaza ceasefire deal as he's interrupted by shouting journalists at briefing",
      "url": "https://apnews.com/video/antony-blinken-israel-hamas-war-middle-east-gaza-strip-gaza-bcd4013893c24bf8a064f53845c8dc6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/776009c/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F62%2Fd9bca6721574e7eb7421d2b8a20c%2Fus-state-blinken-mideast-20250116cr-1920x1080.jpg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "President Joe Biden is commuting the sentences of almost 2,500 people convicted of nonviolent drug offenses. Friday's clemency actions give Biden the presidential record for most individual pardons and commutations issued. The Democrat says he is seeking to undo “disproportionately long sentences compared to the sentences they would receive today under current law, policy, and practice.” Biden has said more could yet be coming. He has promised to use the time before President-elect Donald Trump is inaugurated Monday to “continue to review additional commutations and pardons.” That could potentially include preemptive pardons for officials and allies who the White House fears could be unjustly targeted by Trump’s administration.",
      "publishedAt": "2025-01-17T10:00:29Z",
      "title": "Biden sets record by commuting sentences of nearly 2,500 people convicted on nonviolent drug charges",
      "url": "https://apnews.com/article/biden-commutes-2500-nonviolent-drug-offenders-83174cd0602a0bf5d491aa60184f3568",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c68c26/2147483647/strip/true/crop/5178x2913+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Fd3%2F71a9dce734a2069ba03164d33628%2Fd8c2eabbfc1644d8b6d2944f72ae3775"
    },
    {
      "author": "JON GAMBRELL",
      "description": "A mysterious airstrip being built on a remote island in Yemen is nearing completion, according to satellite photos analyzed by The Associated Press. The runway is likely built by the United Arab Emirates, which has long been suspected of expanding its military presence in the region and has backed a Saudi-led war against the Houthis. The construction comes as Yemen’s Iranian-backed Houthi rebels have continued their attacks on commercial shipping, U.S. warships and Israel over the war on Hamas in the Gaza Strip. Experts worry a ceasefire in Gaza may not be enough to see the Houthis halt a campaign that’s drawn them global attention.",
      "publishedAt": "2025-01-17T05:33:22Z",
      "title": "Mystery airstrip built on Yemeni island as Houthi attacks go on",
      "url": "https://apnews.com/article/yemen-island-airstrip-houthis-israel-hamas-war-gaza-8f1e8b70ddff7ca25842509ca7f0f2b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/739c2cf/2147483647/strip/true/crop/9448x5315+0+492/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F90%2F80862868223b6e8dfdc1b1ba39b1%2Fd7957c0dbcae496db93d71f5255aafdc"
    },
    {
      "author": null,
      "description": "Hundreds of people have been ordered to evacuate and part of Highway 1 in Northern California has been closed due to a major fire at one of the world’s largest battery storage plants. The fire erupted Thursday afternoon, sending up towering flames and black smoke and showed no sign of easing by Thursday night. The Mercury News reported that 1,500 people have been instructed to leave Moss Landing and the Elkhorn Slough area. The Moss Landing Power Plant is about 77 miles south of San Francisco and is owned by Texas-company Vistra Energy. It contains tens of thousands of lithium batteries.",
      "publishedAt": "2025-01-17T06:25:42Z",
      "title": "Fire at one of the world's largest battery plants in California forces mass evacuation",
      "url": "https://apnews.com/article/battery-storage-plant-fire-california-moss-landing-7c561fed096f410ddecfb04722a8b1f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bef694/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F4f%2F0dfff13c590b41ef9c9a42df2496%2Fus-ca-battery-storage-plant-fire-20250117cr-1920x1080.jpg"
    },
    {
      "author": "SAM MEDNICK, SAMY MAGDY",
      "description": "Israel’s security cabinet convened to decide whether to approve a deal that would release dozens of hostages held by militants in Gaza and pause the 15-month-war. If the cabinet approves, the deal will then go to the government for final sign off before the ceasefire goes into effect. Friday's meeting comes after Prime Minister Benjamin Netanyahu’s office said earlier there were last minute snags in finalizing the agreement. However, a pre-dawn statement Friday by Israel’s government, appeared to clear the way for Israeli approval for the deal. U.S. President Joe Biden and key mediator Qatar announced the deal on Wednesday, which is aimed at releasing scores of hostages held in Gaza and winding down the war that has destabilized the Middle East and sparked worldwide protests.",
      "publishedAt": "2025-01-17T09:47:47Z",
      "title": "Israel's security cabinet convenes to approve deal to release hostages and pause the 15-month war",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-01-17-2025-9a97e6c7b2badb3d3e278ab090d6ad15",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1728b8/2147483647/strip/true/crop/3426x1927+0+178/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2Ff7%2Fc60a54009fad2b224c70ed5c6b16%2Fa54bae01200f4a988ef59fd63292f800"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Palestinians in the Gaza Strip are eager to leave miserable tent camps and return to their homes if a long-awaited ceasefire agreement halts the Israel-Hamas war. But many will find there is nothing left and no way to rebuild. Israel’s bombardment and ground operations have transformed entire neighborhoods in several cities into charred wastelands. Blackened shells of buildings and mounds of rubble stretch away in all directions. Major roads have been plowed up. Critical water and electricity infrastructure is in ruins. Most hospitals no longer function. And it’s unclear when — or even if — much of it will be rebuilt.",
      "publishedAt": "2025-01-16T18:55:29Z",
      "title": "Palestinians in Gaza are eager to return home in a ceasefire but many will find nothing left",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-damage-reconstruction-d120f8a0dc8b728c0d8332046a524a92",
      "urlToImage": "https://dims.apnews.com/dims4/default/7571bb6/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F32%2F05f9cb8f630e54f05f090223470c%2F0ef35a78895445338d5b4a2dd521213a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}