{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump are poised to move much closer to winning their party's nominations during the biggest day of the primary campaign on Tuesday, setting up a historic rematch that many voters would rather not endure.",
      "publishedAt": "2024-03-05T05:06:26Z",
      "title": "Coast-to-coast Super Tuesday contests poised to move Biden and Trump closer to November rematch",
      "url": "https://apnews.com/e36971a222a2b50d35cb0a2c603ce4d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0b0f2fa81734d45be637f1e852a9165/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — Former President Donald Trump gained a clear win at the U.S. Supreme Court on Monday, which unanimously ruled that states don't have the ability to bar him — or any other federal candidates — from the ballot under a rarely-used constitutional provision that prohibits those who “engaged in insurrection” from holding office.",
      "publishedAt": "2024-03-04T17:50:32Z",
      "title": "Takeaways from Trump's Supreme Court win: He stays on ballot, but his legal peril is just starting",
      "url": "https://apnews.com/2390f3204e3ecaad3c617f9db0ff9d2e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/199bf3c1cb054ba9a4b18db323164846/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli airstrike killed at least 17 people in the southern Gaza city of Khan Younis on Tuesday, Palestinian officials said, adding that a total of 97 people had died in the last 24 hours.First responders with the Civil Defense circulated footage of rescuers pulling dead and wounded people from the rubble of a house, including a child with blood on his face who was not moving.",
      "publishedAt": "2024-03-05T09:15:39Z",
      "title": "The Latest | At least 17 killed in an Israeli airstrike in southern Gaza",
      "url": "https://apnews.com/c9ad820cf1011b72a9a5318552c540f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc46e79ce7294290adabf2c40beaa7ac/2406.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "BEIJING (AP) — China's Premier Li Qiang promoted an image of confidence as he announced modest economic growth goals for the world's second largest economy, at one of the country's most important political gatherings.",
      "publishedAt": "2024-03-05T06:53:55Z",
      "title": "What you should know from the opening of China's legislature",
      "url": "https://apnews.com/76ee304ab3fcafb45c0af9a2968e8d5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40f0e337086d47a4b637c758fabdcb02/3000.jpeg"
    },
    {
      "author": "EVENS SANON and PIERRE-RICHARD LUXAMA",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Heavily armed gangs tried to seize control of Haiti’s main international airport on Monday, exchanging gunfire with police and soldiers in the latest attack on key government sites in an explosion of violence that includes a mass escape from the country’s two biggest prisons.",
      "publishedAt": "2024-03-04T05:06:37Z",
      "title": "Gangs in Haiti try to seize control of main airport in newest attack on key government sites",
      "url": "https://apnews.com/105ca137aa337b9e6681cf87add9a5c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4454225a32e74d11bdda57b467680fc6/1920.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Alabama lawmakers, who face public pressure to get in vitro fertilization services restarted, are nearing approval of immunity legislation to shield providers from the fall out of a court ruling that equated frozen embryos to children.",
      "publishedAt": "2024-03-05T05:34:08Z",
      "title": "Alabama lawmakers aim to approve immunity laws for IVF providers",
      "url": "https://apnews.com/68d773d6ee89107c9a2e569110e7e31f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa7ead41a36240629dfd00f11f7fb6a7/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO and LINDSAY WHITEHURST",
      "description": "AUSTIN, Texas (AP) — Texas’ plans to arrest migrants who enter the U.S. illegally and order them to leave the country is headed to the Supreme Court in a legal showdown over the federal government’s authority over immigration.",
      "publishedAt": "2024-03-04T21:51:18Z",
      "title": "Supreme Court temporarily blocks Texas law that allows police to arrest migrants",
      "url": "https://apnews.com/fd9e25f3a49a67eb735a12fa7938fdfa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30710ba13544459797f4a8d4b41fe93c/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korea called the ongoing South Korean-U.S. military drills a plot to invade the country, as it threatened Tuesday to take unspecified “responsible” military steps in response.",
      "publishedAt": "2024-03-05T00:27:42Z",
      "title": "North Korea threatens to take military moves in response to US-South Korean drills",
      "url": "https://apnews.com/c34f927220ccac9c677ffcba5d5f820d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d59a3ca346d487cbde9e000f179be13/3000.jpeg"
    },
    {
      "author": null,
      "description": "NASHVILLE, Tenn. (AP) — Several people aboard a single-engine plane died Monday when the aircraft crashed near an interstate highway in Nashville, Tennessee, authorities said.The pilot made an emergency call to John C.",
      "publishedAt": "2024-03-05T04:03:53Z",
      "title": "Small plane with several aboard crashes in Nashville and all were killed",
      "url": "https://apnews.com/08899b682acde5713ee72920405a2457",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15e37880fcc7470780d932a5a0c17c47/3000.jpeg"
    },
    {
      "author": null,
      "description": "CLINTON TOWNSHIP, Mich. (AP) — A fire raging at an industrial facility caused multiple explosions that rocked suburban Detroit on Monday night and sent debris shooting far into the air, prompting police to implore residents to stay inside.",
      "publishedAt": "2024-03-05T05:12:46Z",
      "title": "Industrial fire and multiple explosions shoot debris into the air in Detroit suburb",
      "url": "https://apnews.com/3f13867de5df191b4a34118e796a7d4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/150c4c7a9d504f39a7b2b8865f6c8922/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}