{
  "articles": [
    {
      "author": "Annie Ma, Collin Binkley",
      "description": "Secretary of State Marco Rubio says the U.S. will begin revoking the visas of Chinese students, “including those with connections to the Chinese Communist Party or studying in critical fields.” His announcement on X added to the uncertainty for America’s international students, who have faced intensifying scrutiny from President Donald Trump’s administration. In a cable sent Tuesday to U.S. embassies and consulates, Rubio halted the scheduling of new visa interviews for international students until the department releases guidelines for increased vetting of their activity on social media. Existing appointments may be kept and will proceed under current review guidelines, the cable said, but new guidance is expected in the coming days.",
      "publishedAt": "2025-05-28T18:58:14Z",
      "title": "US to begin revoking visas of some Chinese students",
      "url": "https://apnews.com/article/international-students-visas-trump-guidance-social-media-a1f5180ce83560aff66dd65534906697",
      "urlToImage": "https://dims.apnews.com/dims4/default/8af7d7d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F99%2F082c0e419ad8c01d6a33099f3029%2F78331a270cb94138b93d9eb4b4f4c61d"
    },
    {
      "author": "Lindsay Whitehurst",
      "description": "A federal trade court is blocking President Donald Trump from imposing sweeping tariffs on imports under an emergency-powers law. The ruling from a three-judge panel came after several lawsuits arguing Trump has exceeded his authority, left U.S. trade policy dependent on his whims and unleashed economic chaos. At least seven lawsuits are challenging the levies, the centerpiece of Trump’s trade policy. Trump has says he has the power to act because the country’s trade deficits amount to a national emergency. The court found the 1977 International Emergency Economic Powers Act does not authorize the use of tariffs.",
      "publishedAt": "2025-05-28T23:16:48Z",
      "title": "Federal court blocks Trump's sweeping tariffs, citing economic chaos",
      "url": "https://apnews.com/article/trump-tariffs-trade-court-0392dbd59f548e49ad4f64254ae3f94a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1719f6/2147483647/strip/true/crop/3829x2154+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F83%2F443ca7d88a3514462cb659512235%2F1609dbb91dd24cbc9d508c0368e675c2"
    },
    {
      "author": "Chris Megerian, Kevin Freking",
      "description": "Elon Musk is leaving his government role as a top adviser to President Donald Trump after spearheading efforts to reduce and overhaul the federal bureaucracy. The billionaire entrepreneur posted Wednesday about his decision on X, his social media website. “As my scheduled time as a Special Government Employee comes to an end, I would like to thank President @realDonaldTrump for the opportunity to reduce wasteful spending,” he wrote. A White House official, who requested anonymity to talk about the change, confirmed that Musk was leaving. Musk’s departure comes one day after he criticized the centerpiece of Trump’s legislative agenda, saying he was “disappointed” by what the president calls his “big beautiful bill.”",
      "publishedAt": "2025-05-28T14:06:19Z",
      "title": "Elon Musk is leaving the Trump administration",
      "url": "https://apnews.com/article/elon-musk-donald-trump-big-beautiful-bill-aa2bc70b0ebdb219b5dd3e9f8fae03af",
      "urlToImage": "https://dims.apnews.com/dims4/default/f161287/2147483647/strip/true/crop/5442x3061+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Ff5%2Ff06015417d7248d1246561ae996a%2Fab50885507a94869b2eaa2e8a418204e"
    },
    {
      "author": "Jon Gambrell",
      "description": "President Donald Trump says he has told Israeli Prime Minister Benjamin Netanyahu to hold off on an Iran strike to give his administration more time time to push for new nuclear deal with Tehran. Trump told reporters at the White House that he told Netanyahu a strike “would be inappropriate to do right now because we’re very close to a solution.” Trump's comments on Wednesday came as the head of the U.N.'s atomic watchdog group said that “the jury is still out” on negotiations between Iran and the U.S. over Tehran’s rapidly advancing nuclear program. But Rafael Mariano Grossi described the continuing negotiations as a good sign.",
      "publishedAt": "2025-05-28T10:50:15Z",
      "title": "Trump says he warned Netanyahu to hold off on Iran strike to give US more time for nuclear talks",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-0613bd70b6a47ed2f583177e54473a21",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4a3fa7/2147483647/strip/true/crop/8297x4667+0+432/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F6c%2Feff989ae4299eb40ecd524d5f064%2F3c3348f272d244db9a332110ae89721d"
    },
    {
      "author": null,
      "description": "Israel said Thursday it would establish 22 new Jewish settlements in the occupied West Bank. They would include new settlements and the legalization of outposts already built without government authorization. Israel captured the West Bank in the 1967 Mideast war and the Palestinians want it to be the main part of their future state.",
      "publishedAt": "2025-05-29T05:17:05Z",
      "title": "Israel to establish 22 new Jewish settlements in West Bank",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-05-29-2025-f68c800d2f85933e5cb27e5d8ccd8742",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6f342/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ff1%2F01784acd98fe5fbb6381bbc362f0%2F419377a7ba8643cb87ee439505810f17"
    },
    {
      "author": "Jeff Martin, Safiyah Riddle, Andrew DeMillo",
      "description": "There are plenty of hideouts in the rugged terrain of the Ozark Mountains where searchers are hunting for an ex-lawman known as the “Devil in the Ozarks.” Others are not only off the grid but beneath it, in the hundreds of caves that lead to vast subterranean spaces. A spokesman for the Arkansas Department of Corrections says caves in the area have been a priority for searchers. He said they present one of multiple challenges for authorities searching for Hardin. He escaped Sunday from the North Central Unit — a medium-security prison also known as the Calico Rock prison — by impersonating a corrections officer.",
      "publishedAt": "2025-05-28T20:46:03Z",
      "title": "Caves, other hideouts in mountains are part of hunt for fugitive known as 'Devil in the Ozarks'",
      "url": "https://apnews.com/article/arkansas-prison-escape-police-chief-grant-hardin-441d37501f2ab0de8af27501546dfb13",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a4081e/2147483647/strip/true/crop/2736x1539+0+671/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F94%2Fc4caf5e0c6d0fe7c2e4d6a2687e6%2F9a809d998a6a4748ab10af715f88f542"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A federal judge has immediately rejected a defense request for a mistrial at the sex trafficking trial of music mogul Sean “Diddy” Combs. This was the first such request at Combs’ trial, which is in its third week of testimony in Manhattan. A defense lawyer said Wednesday that prosecutors posed questions to a Los Angeles Fire Department investigator which could imply to the jury that Combs interfered in the probe of another rapper's firebombed luxury car. After a break, the judge instructed the jury to disregard questions related to destroyed fingerprint cards. Combs has pleaded not guilty to leading a racketeering conspiracy that relied on fear and violence to get what he wanted.",
      "publishedAt": "2025-05-28T17:23:58Z",
      "title": "Judge quickly rejects mistrial request at Sean 'Diddy' Combs trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-kid-cuddi-9c419869ad6d18e71fdb22841684088a",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae00258/2147483647/strip/true/crop/1879x1057+0+94/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fd5%2F7af57f8c87679d031e2680d30d86%2F249bea85eb6f449ba3e66eae1f3f6dbb"
    },
    {
      "author": "Stefanie Dazio",
      "description": "Ukrainian President Zelenskyy will visit Berlin to meet with new German Chancellor Friedrich Merz. The talks on Wednesday come amid an escalation in Russia’s bombing campaign despite U.S.-led attempts at peace talks. Germany has been the second-biggest supplier of military aid to Ukraine after the United States. Zelenskyy’s visit on Wednesday comes two days after Merz said his country and other major allies are no longer imposing any range restrictions on weapons supplied to Ukraine as it fights the Russian invasion. Russian forces launched an attack overnight on Ukraine using five Iskander ballistic missiles, one guided air-launched missile and 88 drones.",
      "publishedAt": "2025-05-28T07:31:44Z",
      "title": "Zelenskyy visits Berlin as he seeks more support for Ukraine in the war against Russia",
      "url": "https://apnews.com/article/russia-ukraine-war-germany-zelenskyy-merz-35c583e769bfd89eed738125802637ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/829835a/2147483647/strip/true/crop/5329x2998+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fa3%2F20e193887e906c968ccb0854af34%2F195290eadef14d819bd2077b3ddb36b5"
    },
    {
      "author": "Cliff Brunt",
      "description": "Shai Gilgeous-Alexander scored 34 points, and the Oklahoma City Thunder routed the Minnesota Timberwolves 124-94 on Wednesday night to win the Western Conference finals series 4-1 and advance to the NBA Finals for the first time since 2012. Chet Holmgren had 22 points, seven rebounds and three blocks and Jalen Williams added 19 points and eight rebounds for the Thunder. Oklahoma City will play the Indiana Pacers or New York Knicks in the finals. Indiana leads the Eastern Conference finals series 3-1 with Game 5 to be played in New York City on Thursday.",
      "publishedAt": "2025-05-28T13:49:54Z",
      "title": "Shai Gilgeous-Alexander scores 34 as Thunder top Timberwolves 124-94 to advance to NBA Finals",
      "url": "https://apnews.com/article/nba-playoffs-2025-thunder-timberwolves-2f61e620afce27bb2b267976bcd60cf9",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a7da0c/2147483647/strip/true/crop/4937x2777+0+258/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2Fec%2Fd8950f3a036a378317ee15dd8dd0%2F43370b7cb196445ebe0d5412b64e67f3"
    },
    {
      "author": "Aaron Beard",
      "description": "Carter Verhaeghe broke a tie off a feed from Aleksander Barkov with 7:39 left and the defending champion Florida Panthers advanced to their third straight Stanley Cup Final, beating the Carolina Hurricanes 5-3 on Wednesday night in Game 5. The Panthers beat the Hurricanes in the Eastern Conference final for the second time in three seasons. The Panthers will face the winner of the Western final between Dallas and Edmonton, with the Oilers up 3-1 to put them within a win of a rematch with Florida for the Cup. Sam Bennett added an empty-net goal with 54 seconds left by skating down a loose puck straight out of the penalty box after Florida had held up against a critical late power play for the Hurricanes.",
      "publishedAt": "2025-05-28T14:47:54Z",
      "title": "Defending champion Panthers head back to Stanley Cup Final with 5-3 Game 5 win over Hurricanes",
      "url": "https://apnews.com/article/nhl-playoffs-panthers-hurricanes-score-da931755f62fe0e8dca992f3b961d6b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/5021f44/2147483647/strip/true/crop/3974x2235+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Ffb%2Ffbe6fc85803666ebf9ac040c88bc%2F55a289df1dfd43809ec28dad033c8656"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}