{
  "articles": [
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — Music fans, it is time to bid adieu to the sunny, slow summer months, and welcome fall — historically, one of the busiest times in the calendar year for new albums, EPs, and mixtapes.",
      "publishedAt": "2023-09-06T14:47:40Z",
      "title": "Fall music releases: Pop powerhouses, country classics, hip-hop heavyweights and beyond",
      "url": "https://apnews.com/54ba7b26d469d99984e418b154aad5f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7067c492b425438d8802f07a35446827/3000.jpeg"
    },
    {
      "author": "SAM METZ and MOSA'AB ELSHAMY",
      "description": "MARRAKECH, Morocco (AP) — A rare, powerful earthquake struck Morocco, sending people racing from their beds into the streets and toppling buildings in mountainous villages and ancient cities not built to withstand such force.",
      "publishedAt": "2023-09-08T23:08:13Z",
      "title": "Powerful quake in Morocco kills more than 1,300 people and damages historic buildings in Marrakech",
      "url": "https://apnews.com/7f4a503009dede0dec0208c08d6b100b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68345c7edd824682bdceaed37931f7cc/1920.jpeg"
    },
    {
      "author": null,
      "description": "Follow live updates of a deadly, powerful earthquake that struck Morocco, killing more than 1,000 people and causing widespread damage in and around the city of Marrakesh.",
      "publishedAt": "2023-09-09T14:22:23Z",
      "title": "Live Updates: Morocco struggles after rare, powerful earthquake kills and injures scores of people",
      "url": "https://apnews.com/eab8c4fb1709772071d7d93557f8a272",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64d70a5e85304cc6a2b81baa9029ed07/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "NEW DELHI (AP) — President Joe Biden and his allies on Saturday announced plans to build a rail and shipping corridor linking India with the Middle East and Europe, an ambitious project aimed at fostering economic growth and political cooperation.",
      "publishedAt": "2023-09-09T03:58:54Z",
      "title": "Biden, Modi and G20 allies unveil rail and shipping project linking India to Middle East and Europe",
      "url": "https://apnews.com/eb8988dfbd6c9c6f2c411c893d548333",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92e8c71ecaf24d4b90d6deac4a272e67/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN and HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — The cost of building an artificial intelligence product like ChatGPT can be hard to measure. But one thing Microsoft-backed OpenAI needed for its technology was plenty of water, pulled from the watershed of the Raccoon and Des Moines rivers in central Iowa to cool a powerful supercomputer as it helped teach its AI systems how to mimic human writing.",
      "publishedAt": "2023-09-09T13:14:43Z",
      "title": "Artificial intelligence technology behind ChatGPT was built in Iowa -- with a lot of water",
      "url": "https://apnews.com/f551fde98083d17a7e8d904f8be822c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c363406331a4942848999df02e84f49/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and HANNAH FINGERHUT",
      "description": "AMES, Iowa (AP) — Donald Trump crossed paths with several Republican rivals Saturday as he attended Iowa's in-state college football grudge match, one of the former president's few visits so far to the state that holds the first nominating caucus next year.",
      "publishedAt": "2023-09-09T04:19:13Z",
      "title": "Trump, DeSantis and other 2024 GOP prospects vie for attention at the Iowa-Iowa State football game",
      "url": "https://apnews.com/f398a634ce11048c5e49b207263994c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1db4df514e2249e1a8ffdb0aea65a67f/3000.jpeg"
    },
    {
      "author": null,
      "description": "TASELI PLATEAU, Turkey (AP) — Rescue teams began the arduous process Saturday of extricating an American researcher who became seriously ill while he was 1,000 meters (3,000 feet) below the entrance of a cave in Turkey, officials said.",
      "publishedAt": "2023-09-09T15:27:49Z",
      "title": "Rescue begins of ailing US researcher stuck 3,000 feet inside a Turkish cave, Turkish officials say",
      "url": "https://apnews.com/59f047d7ba9ea3c4f5d7543d9011a222",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fff03649cea4d3baa7d5920505d51c4/3000.jpeg"
    },
    {
      "author": "NOREEN NASIR, AARON MORRISON and AISHA I. JEFFERSON",
      "description": "The racist motivations of the white shooter who targeted and fatally shot Black people in Jacksonville, Florida, two weeks ago have revived concerns about the threat of hate violence and domestic terrorism against African Americans.",
      "publishedAt": "2023-09-09T14:02:37Z",
      "title": "As Jacksonville shooting victims are eulogized, advocates call attention to anti-Black hate crimes",
      "url": "https://apnews.com/92e8e5fd940276c8dd6d90b6f89acd32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e1d015fdb884afd90185f2909eaa674/3000.jpeg"
    },
    {
      "author": "EVELYNE MUSAMBI, FARNOUSH AMIRI, CARA ANNA and ELLEN KNICKMEYER",
      "description": "NAIROBI, Kenya (AP) — The graves at the edge of the orphanage tell a story of despair. The rough planks in the cracked earth are painted with the names of children, most of them dead in the 1990s. That was before the HIV drugs arrived.",
      "publishedAt": "2023-09-09T04:34:49Z",
      "title": "Republican opposition to abortion threatens global HIV/AIDS program that has saved 25 million lives",
      "url": "https://apnews.com/d9ef380acba1a0e96409197b39dea7fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bdf86cca729418597967eba915e3e96/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — Updated COVID-19 vaccines are coming soon, just in time to pair them with flu shots.",
      "publishedAt": "2023-09-09T04:29:29Z",
      "title": "Updated COVID shots are coming. They're part of a trio of vaccines to block fall viruses",
      "url": "https://apnews.com/2a55728638c1c0879ce58deeeb0196bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61d547d06bbb419bb16f1cc8fce3bc18/2945.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}