{
  "articles": [
    {
      "author": "Eric Tucker, Michael R. Sisak, Alanna Durkin Richer",
      "description": "The Justice Department says it's releasing more than 3 million pages of documents in the latest Jeffrey Epstein disclosure. The documents were disclosed Friday under a law intended to reveal what the government knew about the millionaire financier’s sexual abuse of young girls and his interactions with the rich and powerful. The files include some of the several million pages of records officials said were withheld from an initial release of documents in December. Hundreds of department attorneys have been reviewing files to black out material that could reveal the identities of victims. Epstein killed himself in a New York jail in 2019 while awaiting trial.",
      "publishedAt": "2026-01-30T16:07:39Z",
      "title": "Justice Department releases more Epstein files",
      "url": "https://apnews.com/article/epstein-files-justice-department-trump-ed743598c320b94bd9d91631618678d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d9b633/2147483647/strip/true/crop/4790x3192+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2F88%2F13679738e5005c6e0a3c5709eb10%2Fee8342af102640afae1f5bd047f029be"
    },
    {
      "author": "Christopher Rugaber",
      "description": "President Donald Trump says he'll nominate former Federal Reserve governor Kevin Warsh to be the next Fed chair. Friday's pick is likely to result in sharp changes to the powerful agency that could bring it closer to the White House and reduce its longtime independence from day-to-day politics. Warsh would replace Jerome Powell when his term expires in May. Trump chose Powell to lead the Fed in 2017 but recently has assailed him for not cutting interest rates quickly enough. Warsh's appointment requires Senate confirmation. Warsh was on the Fed’s board from 2006 to 2011. He's a fellow at the right-leaning Hoover Institution and a lecturer at the Stanford Graduate School of Business.",
      "publishedAt": "2026-01-30T11:52:28Z",
      "title": "Trump names Kevin Warsh as the next Federal Reserve chair",
      "url": "https://apnews.com/article/warsh-trump-federal-reserve-chair-6b4441263c1b7ecb40b96adf17adeea2",
      "urlToImage": "https://dims.apnews.com/dims4/default/ffb514c/2147483647/strip/true/crop/3276x2183+0+52/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F3e%2F9853a51008ca9ff7174abb034b72%2F0e83997dd48347a4afdfb93a358e24d6"
    },
    {
      "author": "Alanna Durkin Richer, Eric Tucker",
      "description": "Journalist Don Lemon has been arrested after he entered a Minnesota church and recorded anti-immigration enforcement protesters who disrupted a service. The protest Jan. 18 increased tensions between residents and the Trump administration. It is unclear what charge or charges Lemon is facing. The arrest came after a magistrate judge last week rejected prosecutors’ initial bid to charge the journalist. Lemon was taken into custody by federal agents in Los Angeles, where had been covering the Grammy Awards. His lawyer said Lemon will \"fight these charges vigorously and thoroughly in court.”",
      "publishedAt": "2026-01-30T13:23:24Z",
      "title": "Journalist Don Lemon arrested in protest at Minnesota church",
      "url": "https://apnews.com/article/don-lemon-arrest-minnesota-church-service-d3091fe3d1e37100a7c46573667eb85c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d9751f7/2147483647/strip/true/crop/3500x2332+0+22/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2F20%2F083e9aa645905585d6f1eb2dc101%2Fbf9fd1c15d924e358d2e60acd56da164"
    },
    {
      "author": "Michael Biesecker, Rebecca Santana",
      "description": "Deputy Attorney General Todd Blanche says the Justice Department has opened a federal civil rights probe into the death of Alex Pretti. Blanche said Friday the department is \"looking at everything that would shed light on that day.”",
      "publishedAt": "2026-01-30T16:09:24Z",
      "title": "DOJ opens federal civil rights probe into death of Alex Pretti",
      "url": "https://apnews.com/article/minneapolis-ice-fbi-alex-pretti-immigration-65a963816603a08bbc9db83961dd173f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7688bd2/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F5e%2F8ad6aa031cb03a86306823e06148%2F605f5532982e4de4a7fbd26a6507f057"
    },
    {
      "author": "Mary Clare Jalonick",
      "description": "Senate leaders were scrambling to save a bipartisan spending deal and avert a partial government shutdown at midnight Friday as Democrats have demanded new restrictions on federal immigration raids across the country. Democrats struck a rare deal with President Donald Trump Thursday to separate funding for the Homeland Security Department from a broad government spending bill and fund it for two weeks while Congress debates curbs on the U.S. Immigration and Customs Enforcement agency. The deal came as irate Democrats had vowed to vote against the entire spending bill and trigger a shutdown in the wake of the deaths of two protesters at the hands of federal agents in Minneapolis.",
      "publishedAt": "2026-01-30T05:31:16Z",
      "title": "Senate leaders scramble to avert partial government shutdown",
      "url": "https://apnews.com/article/congress-budget-immigration-trump-homeland-security-39fd7917e39aaf9e4e78e89f3449a587",
      "urlToImage": "https://dims.apnews.com/dims4/default/413ab51/2147483647/strip/true/crop/4822x3213+89+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2Fbf%2F7daf3eb6c7507182928afb032793%2F9c37e91ed1534493b975bc9ced89a8ba"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A judge has ruled that federal prosecutors can’t seek the death penalty against Luigi Mangione in the killing of UnitedHealthcare CEO Brian Thompson. U.S. District Judge Margaret Garnett's ruling Friday foiled the Trump administration’s bid to see Mangione executed for what it called a “premeditated, cold-blooded assassination that shocked America.” Garnett dismissed a federal murder charge against Mangione, finding that it was technically flawed. She left in place stalking charges that carry a maximum punishment of life in prison.",
      "publishedAt": "2026-01-30T15:18:06Z",
      "title": "Federal murder charge against Luigi Mangione dismissed, death penalty off the table",
      "url": "https://apnews.com/article/mangione-unitedhealthcare-death-penalty-dismissed-killing-1d17a30d0297acda29fc82dbf54d2677",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4a09af/2147483647/strip/true/crop/4888x3257+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2Fa3%2Ff0d310e44fea2314f402fedbf571%2F0e02ce17bc4b48579a0ba4e313c39847"
    },
    {
      "author": null,
      "description": "Israel says it will reopen Gaza’s border crossing with Egypt in both directions over the weekend. The move announced on Friday will allow Palestinians to enter and leave the territory after nearly two years of closure. The Israeli military body in charge of coordinating aid to Gaza said in a statement on Friday that “limited movement of people only” would be allowed. The reopening of the Rafah crossing on Sunday will mark an important step forward for U.S. President Donald Trump’s Gaza ceasefire plan. The crossing is Gaza’s main gateway to the outside world. It has been largely closed since May 2024.",
      "publishedAt": "2026-01-30T11:48:02Z",
      "title": "Israel will reopen Gaza’s border crossing with Egypt on Sunday, after nearly 2 years of closure",
      "url": "https://apnews.com/article/israel-palestinians-gaza-rafah-border-crossing-reopening-823d4b0aef641c3f19d4cc7b527325b1",
      "urlToImage": "https://dims.apnews.com/dims4/default/ccb67aa/2147483647/strip/true/crop/5049x3364+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2Fdd%2Fb4655751b571179c3d6fd93b0fde%2F2641c77df46747c4bcfe89c05112e656"
    },
    {
      "author": "Sophie Bates, Sudhin Thanawala, Russ Bynum",
      "description": "Tens of thousands of people are entering their sixth day with no electricity as the Carolinas and Virginia prepare for a significant winter storm that could bring more snowfall than some parts of North Carolina have seen in years. The National Weather Service says arctic air moving into the Southeast will cause already frigid temperatures to plummet into the teens Friday night in cities like Nashville, Tennessee. With another wave of dangerous cold heading for the U.S. South, experts say the risk of hypothermia heightens for people in parts of Mississippi and Tennessee trapped at home without power in subfreezing temperatures.",
      "publishedAt": "2026-01-30T05:01:12Z",
      "title": "Dangerous cold wave heightens hypothermia risk in Mississippi and Tennessee",
      "url": "https://apnews.com/article/freezing-temperatures-hypothermia-mississippi-tennessee-6ae30d4be75522f7c0cd3566ba664957",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d45947/2147483647/strip/true/crop/4076x2716+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Fcd%2Fb737353f5b3094836c9bcb819260%2Fbd23362c440545c59bba1fcb1dde6367"
    },
    {
      "author": null,
      "description": "Catherine O'Hara has died at 71. The was Emmy-winning actor known for her roles in \"Home Alone\" and \"Schitt's Creek.\" Her agency, CAA, announced she died Friday at her Los Angeles home after a brief illness. O'Hara was a Canadian-born actor who gained fame through Toronto's Second City Theatre. She was also one of the creators of the sketch comedy show \"SCTV.\" Her career spanned decades, and she was celebrated for her comedic brilliance.",
      "publishedAt": "2026-01-30T18:32:59Z",
      "title": "Catherine O'Hara dies at 71",
      "url": "https://apnews.com/article/catherine-ohara-dies-9fdc89411b4961c1d599f836503a6203",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a2acf5/2147483647/strip/true/crop/5787x3856+77+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2F4f%2Fc09f5210dcba6971c8a1d5da26cc%2F265871b567524a6c87a538ecf05b1871"
    },
    {
      "author": "Stan Choe",
      "description": "Financial markets are churning as investors try to figure out what President Donald Trump’s new nominee to lead the Federal Reserve will mean. The initial reactions have been sometimes quick to change because of the uncertainty, and U.S. stocks fell modestly Friday. The S&P 500 dipped 0.2%. The Dow Jones Industrial Average fell 111 points, and the Nasdaq composite slipped 0.2%. The value of the U.S. dollar initially sank against other currencies following Trump’s announcement of Kevin Warsh before bouncing back. Some of the wildest action was again in the precious metals markets, where gold's price swung.",
      "publishedAt": "2026-01-30T02:54:29Z",
      "title": "US stocks dip and gold swings as markets react to Trump's choice to lead the Federal Reserve",
      "url": "https://apnews.com/article/stocks-markets-gold-rates-oil-7f0eadba91bc2e550945eb49bc1085f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c5ac93/2147483647/strip/true/crop/6813x4540+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F6f%2F0d4e0d649061703813bd99e873ba%2Fc5b5ff14edde41c5a22514cb299f9889"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}