{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli troops and tanks pushed deeper into Gaza on Monday, freeing a soldier held captive by Hamas militants and advancing on two sides of the territory’s main city.",
      "publishedAt": "2023-10-30T07:19:07Z",
      "title": "Israeli troops push deeper into Gaza and free Hamas captive, as Palestinian civilian toll rises",
      "url": "https://apnews.com/131e9537aaad8e74586cc114d2668e5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43d18f9f0c624c7daf1de0b1c19f34d0/1920.jpeg"
    },
    {
      "author": "AMY TEIBEL",
      "description": "JERUSALEM (AP) — An Israeli government ministry has drafted a wartime proposal to transfer the Gaza Strip's 2.3 million people to Egypt's Sinai peninsula, drawing condemnation from the Palestinians and worsening tensions with Cairo.",
      "publishedAt": "2023-10-30T18:54:00Z",
      "title": "An Israeli ministry, in a 'concept paper,' proposes transferring Gaza civilians to Egypt's Sinai",
      "url": "https://apnews.com/5f99378c0af6aca183a90c631fa4da5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5665b4ef02574f35ada6d47be61c5e88/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Facing the loss of another $200 million this week to a lengthy strike, General Motors CEO Mary Barra wrapped up her weekend by going to the United Auto Workers' Detroit headquarters intent on getting a new contract.",
      "publishedAt": "2023-10-30T12:21:39Z",
      "title": "General Motors reaches tentative agreement with UAW, potentially ending six-week strike",
      "url": "https://apnews.com/34f6f0d7ca32a671783594722b20fb24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7681eb2a4a1a4e5eaf4cddb9e1785eda/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — Lawyers for a group of Colorado voters on Monday focused on the January 2021 assault on the U.S. Capitol and former President Donald Trump’s role, opening a trial that could determine whether the Constitution’s insurrection clause bars Trump from running again for the White House.",
      "publishedAt": "2023-10-30T04:03:43Z",
      "title": "Lawyers argue whether the Constitution’s ‘insurrection’ clause blocks Trump from the 2024 ballot",
      "url": "https://apnews.com/f5d6c6174476ec414208323785df6e15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c494628094d84bfba37737c94b0be08e/1920.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — U.S. health regulators are warning consumers not to use more than two dozen varieties of over-the-counter eyedrops because of the risk of infections that could lead to blindness.",
      "publishedAt": "2023-10-30T15:23:30Z",
      "title": "Eyedrops from CVS, Rite Aid and others carry possible infection risk, FDA says",
      "url": "https://apnews.com/a9471104de34efd152137d3fdba9c260",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f136037a732d474e835c0d79aa5955f9/2742.jpeg"
    },
    {
      "author": "DAVID SHARP, ROBERT F. BUKATY, JAKE BLEIBERG and PATRICK WHITTLE",
      "description": "LEWISTON, Maine (AP) — Authorities in Maine spent Monday piecing together the events that led to the worst mass shooting in the state's history — with the suspect's record of interaction with police and warning signs involving mental illness and violent threats emerging as key threads.",
      "publishedAt": "2023-10-30T04:44:45Z",
      "title": "Maine mass shooter had numerous run-ins with authorities, showed warning signs long before shooting",
      "url": "https://apnews.com/35e78383dfb4fd84bfe07bcfc63760ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22e184252c6c477983676bb836f272a2/1920.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "JOLIET, Ill. (AP) — A man accused of murder, attempted murder and a hate crime in an attack on a Palestinian American woman and her young son pleaded not guilty Monday following his indictmen t by an Illinois grand jury.",
      "publishedAt": "2023-10-30T04:18:33Z",
      "title": "Illinois man pleads not guilty to hate crime and murder charges in attack on Muslim mother and son",
      "url": "https://apnews.com/2e63edb587176bd85f7e3f8428a90ad1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b48e9a7714f4496aafae6ddf3d58c26/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russian President Vladimir Putin called a meeting of security and law enforcement officials Monday, the day after a mob stormed the airport in the southern region of Dagestan after a flight from Israel landed there.",
      "publishedAt": "2023-10-29T19:26:58Z",
      "title": "Putin calls meeting after mob storms Dagestan airport looking for Israelis on jet from Tel Aviv",
      "url": "https://apnews.com/fa06b16131ed41c0c789981cdcaac84f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e7e37169503474eb4ff23594248fa54/3000.jpeg"
    },
    {
      "author": "CURT ANDERSON",
      "description": "ST. PETERSBURG, Fla. (AP) — Shootings across the U.S. over the weekend before Halloween have left at least 11 people dead and more than 70 injured, authorities said.The deaths between Friday and Sunday included two in Tampa, Florida, three in Texarkana, Texas, and two each in Dodge City, Kansas; San Antonio, Texas; and Mansfield, Ohio, according to police.",
      "publishedAt": "2023-10-30T16:39:15Z",
      "title": "Halloween weekend shootings across US leave at least 11 dead, scores injured",
      "url": "https://apnews.com/b6b7647ee65985792f632ebe81b5bfd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91f0bc6810fe4e2f9db962c413f6722f/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel expanded its military incursion deeper into the northern part of the Gaza Strip on Monday as the U.N.",
      "publishedAt": "2023-10-30T07:19:50Z",
      "title": "Live updates | Israel deepens military assault in the northern Gaza Strip",
      "url": "https://apnews.com/d33ac65b49723b9715ebf47041ac5f66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43d18f9f0c624c7daf1de0b1c19f34d0/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}