{
  "articles": [
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — The Washington chattering class, often unsure what to make of outsiders, dubbed Rosalynn Carter the “Steel Magnolia” when she arrived as first lady.A devout Baptist and mother of four, she was diminutive and outwardly shy, with a soft smile and softer Southern accent.",
      "publishedAt": "2023-11-19T20:29:25Z",
      "title": "Rosalynn Carter: Advocate for Jimmy Carter and many others, always leveraging her love of politics",
      "url": "https://apnews.com/69fadff26354d26bdda94c5d52558a7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/674cbce379d34819a1fd8f3820dcb541/2469.jpeg"
    },
    {
      "author": null,
      "description": "ATLANTA (AP) — Reactions to the death of Rosalynn Carter, former first lady and global humanitarian:___",
      "publishedAt": "2023-11-19T21:37:49Z",
      "title": "Reactions to the death of Rosalynn Carter, former first lady and global humanitarian",
      "url": "https://apnews.com/6d13e96cc89924a08895b200c10090c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2914b74c08d24735b785efb8928f18b3/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI and DAVID BILLER",
      "description": "BUENOS AIRES, Argentina (AP) — Populist Javier Milei resoundingly won Argentina's presidential election Sunday, swinging the country to the right following a fiercely polarized campaign in which he promised a dramatic shake-up to the state to deal with soaring inflation and rising poverty.",
      "publishedAt": "2023-11-19T05:12:12Z",
      "title": "Fiery right-wing populist Javier Milei wins Argentina's presidency and promises 'drastic' changes",
      "url": "https://apnews.com/a4811c5229d35551f8dbf7056d87aae6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58eb82b303a045c9a13f593e02d73451/1920.jpeg"
    },
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Health officials said 31 premature babies in “extremely critical condition” were transferred safely Sunday from Gaza’s main hospital and will go to Egypt, while over 250 patients with severely infected wounds and other urgent conditions remained stranded days after Israeli forces entered the compound to look for Hamas operations.",
      "publishedAt": "2023-11-19T07:14:03Z",
      "title": "31 premature babies are evacuated from Gaza's largest hospital, but scores of trauma patients remain",
      "url": "https://apnews.com/08a2f441a9ea03bf0bb3db0de6fc5408",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9b3bfa036c54ede916e9988f3ce9e92/1920.jpeg"
    },
    {
      "author": "JILL COLVIN, PAUL J. WEBER and MICHELLE L. PRICE",
      "description": "EDINBURG, Texas (AP) — Donald Trump picked up the Texas governor’s endorsement Sunday during a visit to a U.S.-Mexico border town and promised that his hard-line immigration policies in a second presidential term would make Greg Abbott’s “job much easier.”",
      "publishedAt": "2023-11-19T12:50:06Z",
      "title": "Trump picks up the endorsement of Texas Gov. Greg Abbott during a visit to a US-Mexico border town",
      "url": "https://apnews.com/85b331c3e58fc2a016614ce733f0f492",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4dc0e70f48934cf09be8f98519a4f75c/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "NORFOLK, Va. (AP) — President Joe Biden visited naval installations in Virginia on Sunday to kick off the Thanksgiving holiday week, introducing an early screening of the upcoming movie “Wonka” and sharing a “friendsgiving” meal with service members and their relatives.",
      "publishedAt": "2023-11-19T16:52:13Z",
      "title": "The Bidens start Thanksgiving early by serving dinner and showing 'Wonka' to service members",
      "url": "https://apnews.com/4453eee2e8194cf767d47b1b7e12c563",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe15ebef715045229e2087378a99a12d/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and CHRISTINE FERNANDO",
      "description": "COLUMBUS, Ohio (AP) — The statewide battles over abortion rights since the U.S. Supreme Court overturned a constitutional right to abortion have exposed another fault line: the commitment to democracy.",
      "publishedAt": "2023-11-19T12:40:52Z",
      "title": "Voters back abortion rights, but some foes won’t relent. Is the commitment to democracy in question?",
      "url": "https://apnews.com/3d6e2f0d0f5993ddd75522b662d2eb34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1cf7986b44524062841469295305c269/3000.jpeg"
    },
    {
      "author": "LUCAS DUMPHREYS and DIANE JEANTET",
      "description": "POCONE, BRAZIL (AP) — Firefighters in Brazil's Pantanal wetlands earlier this month celebrated the end of the fire season on Facebook, saying in a Nov. 7 post that “it is a relief for everyone who lives in the region.”",
      "publishedAt": "2023-11-19T18:49:58Z",
      "title": "Fires in Brazil threaten jaguars, houses and plants in the world's largest tropical wetlands",
      "url": "https://apnews.com/184ec2a029e6d5e9a784accfc7c4bd9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56e0b24241774728a8fc039511974551/3000.jpeg"
    },
    {
      "author": "MICHAEL HILL",
      "description": "ALBANY, N.Y. (AP) — For a year, a special New York law has cleared the way for a wave of headline-grabbing lawsuits against famous men accused of sexual misconduct, including former President Donald Trump, hip hop mogul Sean “Diddy” Combs and the comedian and actor Russell Brand.",
      "publishedAt": "2023-11-19T06:57:39Z",
      "title": "The Adult Survivors Act launched over 2,500 sex abuse suits. Now, it’s expiring",
      "url": "https://apnews.com/6fd16aa4cc992c089e91c6fef064f375",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b02ee2b5f8d24b27b7f075b5e7733767/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Ohio State passed Michigan and moved up to No. 2 in The Associated Press college football poll Sunday, a week before the Big Ten rivals play another top-five matchup, and No.",
      "publishedAt": "2023-11-19T19:02:02Z",
      "title": "AP Top 25: Ohio State jumps Michigan, moves to No. 2. Washington, FSU flip-flop at Nos. 4-5",
      "url": "https://apnews.com/b89dc67c10896b7f2b65f715d8a4534b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f6d5f5e3417459695f61d6c3733531c/2488.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}