{
  "articles": [
    {
      "author": "DAVID RISING, JON GAMBRELL",
      "description": "President Donald Trump’s proposal that the United States “take over” the Gaza Strip and permanently resettle its Palestinian residents has been swiftly rejected and denounced by American allies and adversaries alike. Saudi Arabia weighed in quickly, noting the kingdom's long call for an independent Palestinian state was a “firm, steadfast and unwavering position.” Similarly, Australian Prime Minister Anthony Albanese told reporters that his country has long supported a two-state solution in the Middle East and that nothing has changed. the militant Hamas group, which sparked the war with its attack on Israel, called the proposal a “recipe for creating chaos\" in the region.",
      "publishedAt": "2025-02-05T05:55:42Z",
      "title": "Allies, adversaries reject Trump's suggestion for US 'take over' of Gaza Strip",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-trump-netanyahu-db2c407baf803291a4acf6edfd708c48",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba11785/2147483647/strip/true/crop/8528x4797+0+445/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2F97%2F3e0c005850b164e9f9cb7d0c303b%2F9f2bee9f910548aa9e1c16c1aee1dac9"
    },
    {
      "author": "WILL WEISSERT, MICHELLE L. PRICE, ZEKE MILLER",
      "description": "President Donald Trump offered a jaw-dropping performance during his joint news conference with Israeli Prime Minister Benjamin Netanyahu, suggesting that Palestinian refugees from the Gaza Strip could be permanently resettled elsewhere. He suggested on Tuesday that the U.S. could stage a long-term takeover of the vacated region, even leading redevelopment efforts to make it a seaside paradise in waiting. He also refused to rule out sending U.S. troops in to seal the deal and said he himself — ever the real estate developer — might pay a personal visit. The suggestions will be non-starters for Hamas, though. And they could jeopardize the continuation of a tenuous ceasefire in Gaza and the release of hostages the group is still holding.",
      "publishedAt": "2025-02-05T05:02:13Z",
      "title": "Trump talks Gaza takeover and other takeaways from his appearance with Netanyahu",
      "url": "https://apnews.com/article/trump-netanyahu-gaza-strip-israel-palestinians-a97ea5e16419ba33c815801a24b8909c",
      "urlToImage": "https://dims.apnews.com/dims4/default/3be1423/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F7c%2Fca89cbbe1ba5ea4bc02866757ada%2Ff5b85b7a1fee4e1b90d90a77215bd083"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Palestinians will mark this year the 77th anniversary of their mass expulsion from what is now Israel. It's an event that is at the core of their national struggle. Palestinians refer to it as the Nakba, Arabic for catastrophe. Some 700,000 Palestinians — a majority of the prewar population — fled or were driven from their homes before and during the 1948 war that followed Israel’s establishment. But in many ways, that experience pales in comparison to the calamity now faced in the Gaza Strip — particularly as President Donald Trump has suggested that displaced Palestinians in Gaza be permanently resettled outside the war-torn territory and the U.S. take “ownership” of the enclave.",
      "publishedAt": "2025-02-05T08:50:07Z",
      "title": "Palestinians remember their 1948 exodus after Trump's Gaza remarks",
      "url": "https://apnews.com/article/israel-hamas-war-nakba-gaza-strip-trump-a36215ea11cdbae42680ce9ed9febc14",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ccc32c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F5e%2F297fde535f6a0462697d3e008ad5%2F295690a11a2446f29f4f1acc5480df4f"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "Gaza has long been a powder keg, and it exploded after Hamas fighters stormed southern Israel on Oct. 7, 2023, and began killing and abducting people, sparking a crushing Israeli military operation there that’s only recently reached an uneasy ceasefire. President Donald Trump’s suggestion Tuesday that that displaced Palestinians in Gaza be permanently resettled outside the war-torn territory and the U.S. take “ownership” may spark new tension over the enclave against the Mediterranean Sea.",
      "publishedAt": "2025-02-05T04:50:39Z",
      "title": "The history of the Gaza Strip after Trump's remarks",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-trump-history-6db716f4d924f0a14321e6e68cd50ac4",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ccc32c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F5e%2F297fde535f6a0462697d3e008ad5%2F295690a11a2446f29f4f1acc5480df4f"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "President Donald Trump has announced that the United States will withdraw from the U.N.’s top human rights body and will not resume funding for the U.N. agency helping Palestinian refugees. The U.S. left the Geneva-based Human Rights Council last year. And it stopped funding the agency assisting Palestinian refugees, known as UNRWA, after Israel accused it of harboring Hamas militants who participated in the attacks in southern Israel on Oct. 7, 2023, which UNRWA denies. Trump’s announcement Tuesday came on the day he met with visiting Israeli Prime Minister Benjamin Netanyahu, whose country has long accused both the rights body and UNRWA of bias against Israel and antisemitism.",
      "publishedAt": "2025-02-05T00:34:28Z",
      "title": "Trump announces withdrawal from UN human rights body and halt to funding for Palestinian refugees",
      "url": "https://apnews.com/article/trump-un-human-rights-palestinian-refugees-israel-05e1d57bbb41df38771d1ab69adb21a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/16413f1/2147483647/strip/true/crop/4883x2747+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F95%2F62506e1570751c41acdc794a7461%2Fd11d670e495d4205b980380e6607343a"
    },
    {
      "author": "MICHELLE L. PRICE, AAMER MADHANI, ZEKE MILLER",
      "description": "President Donald Trump says he’s given his advisers instructions to obliterate Iran if it assassinates him. Trump adds that \"there won’t be anything left” if Iran kills him. He made the remarks in an exchange with reporters Tuesday while signing an executive order calling for the U.S. government to impose maximum pressure on Tehran. The Justice Department announced in federal charges in November that an Iranian plot to kill Trump before the presidential election had been thwarted. The department alleged Iranian officials had instructed Farhad Shakeri, 51, in September to focus on surveilling and ultimately assassinating Trump. Shakeri is still believed to be at large in Iran.",
      "publishedAt": "2025-02-04T20:21:32Z",
      "title": "Trump says he's given advisers instructions for Iran to be 'obliterated' if it assassinates him",
      "url": "https://apnews.com/article/trump-iran-assassination-88c9b1a0754165125d59d378bf4af477",
      "urlToImage": "https://dims.apnews.com/dims4/default/68c4242/2147483647/strip/true/crop/3658x2058+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F53%2F36a0bf0e4e03d624ce6c4eb946e4%2F97fb492e00534bd084a905d98321f9d1"
    },
    {
      "author": "STEFANIE DAZIO, SERGEI GRITS",
      "description": "Sweden’s worst mass shooting has left at least 11 people dead, including the gunman, at an adult education center as officials warned that the death toll could rise. Police believe the perpetrator acted alone but haven't said if he was a student or what his motive may have been. Tuesday's violence occurred at a school on the outskirts of Orebro west of Stockholm. It offers primary and secondary educational classes for adults, Swedish-language classes for immigrants, vocational training and programs for people with intellectual disabilities. Gun violence at schools is very rare in Sweden.",
      "publishedAt": "2025-02-05T06:57:46Z",
      "title": "Sweden mass shooting leaves at least 11 dead at adult education center",
      "url": "https://apnews.com/article/sweden-shooting-adult-education-center-fa26e8064a0708ddc213c7cd9f50267c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2726627/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2Fef%2F4c9972aa0d8833ca969849e5bf9a%2Ff063f6966f0a4bb6921e55cd5b16e2d6"
    },
    {
      "author": "PRABHJOT GILL",
      "description": "A U.S. military plane carrying 104 deported Indian migrants has arrived in a northern Indian city, the first such flight to the country as part of a crackdown ordered by the Trump administration, airport officials said. The Indians who returned home Wednesday had illegally entered the United States over the years and came from various Indian states. India has been cooperative with the U.S. and says it is ready to accept the deported Indians after verification. An Indian External Affairs minister told India’s Parliament that 519 Indian nationals were deported to India between November 2023 and October 2024, citing U.S. government data.",
      "publishedAt": "2025-02-05T09:21:46Z",
      "title": "Amritsar: More than 100 Indian migrants deported by the US arrive home",
      "url": "https://apnews.com/article/indian-illegal-immigrants-deportation-from-united-states-eb43d6fb6ba1f78febdd78b77bd36196",
      "urlToImage": "https://dims.apnews.com/dims4/default/d99b4f7/2147483647/strip/true/crop/2825x1589+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F92%2F4246e56ffaa4143ec618ae938f58%2F37ca9c3e212842c9bbb5a0ce46dda596"
    },
    {
      "author": "ZEN SOO",
      "description": "The U.S. Postal Service said it was temporarily suspending inbound parcels from China and Hong Kong, effective Tuesday. The move comes a day after an additional 10% tariff on Chinese goods imposed by U.S. President Donald Trump came into effect. Canada and Mexico, which face 25% tariffs, managed to negotiate a month-long reprieve with the U.S. The USPS move will likely impact Chinese e-commerce companies like Shein and Temu, which have in recent years gained e-commerce market share in the U.S for selling affordable clothing and other goods mostly from China. Costs are kept low as these firms often ship products to consumers directly from China, using a “de minimis” exemption that allowed shipments to go tax-free if the value is under $800.",
      "publishedAt": "2025-02-05T08:29:52Z",
      "title": "What USPS suspension of parcels from Hong Kong and China mean for Shein and Temu",
      "url": "https://apnews.com/article/usps-china-hongkong-shein-temu-b456d7b6d66780090bd5bef862dfda13",
      "urlToImage": "https://dims.apnews.com/dims4/default/251522b/2147483647/strip/true/crop/4363x2454+0+227/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2Ff6%2F4aa965c1893cb2e8499547140f5c%2F1049410b8384414f86767aedae669838"
    },
    {
      "author": "AAMER MADHANI, TIA GOLDENBERG, ZEKE MILLER",
      "description": "President Donald Trump’s Middle East envoy Steve Witkoff says that a three to five year timeline for reconstruction of Gaza, as set out in a temporary truce agreement, is not viable. The U.S. administration reiterated its call on Tuesday for Arab nations to relocate displaced Palestinians in the war-torn territory. Witkoff said “it is unfair to explain to Palestinians that they might be back in five years.” He added that such a timeline is “preposterous.” The administration renewed its call on Arab nations to relocate displaced Palestinians as Trump is set to meet with Israeli Prime Minister Benjamin Netanyahu. Egypt and Jordan, as well other Arab nations, have rejected calls by Trump to relocate the territory’s 2.3 million Palestinians during post-war rebuilding.",
      "publishedAt": "2025-02-04T05:02:26Z",
      "title": "Trump envoy calls Gaza rebuilding timeline in Israel-Hamas truce 'preposterous'",
      "url": "https://apnews.com/article/trump-netanyahu-washington-ceasefire-1c8deec4dd46177e08e07d669d595ed3",
      "urlToImage": "https://dims.apnews.com/dims4/default/10c0012/2147483647/strip/true/crop/3561x2003+0+185/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F73%2F261701097e5bf920278eb42123cf%2F82252b5244164906b2302c8f396c5940"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}