{
  "articles": [
    {
      "author": "Brian Melley",
      "description": "British Prime Minister Keir Starmer says Britain, France and Ukraine have agreed to work on a ceasefire plan to present to the United States. Starmer says the plan emerged after talks among the four countries’ leaders following Ukrainian President Volodymyr Zelenskyy’s Oval Office blowout with U.S. President Donald Trump. The prime minister told the BBC he believes the U.S. president wants a durable peace in Ukraine. He repeated his assertion that American security guarantees will be needed to make it stick. Starmer is hosting a summit of European leaders in London on Sunday to discuss Ukraine.",
      "publishedAt": "2025-03-02T05:01:32Z",
      "title": "Russia-Ukraine war: UK, France and Ukraine agree to work on ceasefire plan",
      "url": "https://apnews.com/article/ukraine-britain-zelenskyy-europe-starmer-trump-russia-b980170ead74a1a7914c565f14ee6cc9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1ea44d/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2Fb7%2F0f29019031ad0bd0874f8b28f899%2F280eb400a7294951a92c77d7daf3a8b7"
    },
    {
      "author": "Jonathan J. Cooper",
      "description": "President Donald Trump’s senior aides and allies are lashing out at Ukrainian leader Volodymyr Zelenskyy. Their criticism from Washington came as he attended a European summit Sunday in London to rally international support for his military’s fight against the Russian invasion. Following Trump’s lead, White House officials and Republicans in Congress are demanding that Zelenskyy display more gratitude for U.S. support and an openness to potential war-ending concessions to Russia. Some suggested Zelenskyy should consider resigning. But they offered little clarity as to what Zelenskyy and Ukraine could do after Friday’s Oval Office meeting in which Trump and Vice President JD Vance berated him.",
      "publishedAt": "2025-03-02T20:00:50Z",
      "title": "Trump allies lash out at Ukraine's Zelenskyy and suggest he may need to resign",
      "url": "https://apnews.com/article/trump-zelenskyy-resign-ukraine-russia-war-f258a45da0b3d990d3b2f566c2ff8139",
      "urlToImage": "https://dims.apnews.com/dims4/default/8569b92/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fca%2F1d91ab81b92e53bd1b644d5e75c1%2Fdf25e9ad306d4c858891dc3dfb5356c6"
    },
    {
      "author": "The Associated Press",
      "description": "Britain is hosting a summit of European leaders to shore up support for Ukrainian President Volodymyr Zelenskyy after an astonishing Oval Office blowout with President Donald Trump that left many uncertain where the once staunch allies stood. The London meeting on Sunday has now taken on greater importance in defending the war-torn ally and boosting the continent’s defenses. British Prime Minister Keir Starmer, who will welcome leaders of more than a dozen countries and other officials to the gathering, embraced Zelenskyy on his arrival in London, saying he is determined to find an end to Russia’s war on Ukraine.",
      "publishedAt": "2025-03-02T09:23:24Z",
      "title": "Kremlin spokesman says Russia’s and US foreign policies are in alignment",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-london-summit-7ce3c65b90b9618d9877372514e90c77",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6e7672/2147483647/strip/true/crop/4613x2595+0+240/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F46%2F0f5a18397cdb43221e9125095fa0%2F4c7bff1fdf6e4e49ac4dbf8696adafe1"
    },
    {
      "author": "The Associated Press",
      "description": "Key Republicans and Democrats have been stalwart supporters of Ukrainian President Volodymyr Zelenskyy. But a blowup between the Ukrainian leader and President Donald Trump is threatening to change that. Zelenskyy had traveled to Washington to sign a deal Friday that would give the U.S. access to its mineral riches as Trump attempts to pressure Ukraine into a deal to end the war with Russia. Instead, the fallout from a heated Oval Office exchange between Trump, Zelenskyy and Vice President JD Vance further splintered American political support for Ukraine. Sen. Lindsey Graham, who has backed Ukraine, called the meeting a “complete, utter disaster.\"",
      "publishedAt": "2025-02-28T20:36:21Z",
      "title": "What US lawmakers are saying about the White House clash between Trump and Zelenskyy",
      "url": "https://apnews.com/article/republicans-trump-zelenskyy-meeting-64ec4a67fce4f04a2d189a1e0204b023",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb2a819/2147483647/strip/true/crop/5486x3086+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F70%2F8d4d345a334f1f6406ca4e6cf9bb%2F48c8bd586cbb436ab7967789d563bb64"
    },
    {
      "author": "Josh Boak",
      "description": "Commerce Secretary Howard Lutnick says he could take government spending out of his agency's reports on gross domestic product. There are growing questions about whether the spending cuts pushed by Elon Musk’s Department of Government Efficiency could cause a recession. Speaking on Fox News, Lutnick said he would change GDP to make it “transparent.” The commerce secretary was echoing Musk’s arguments, made Friday on X, his social media platform, that government spending doesn’t create value for the economy.",
      "publishedAt": "2025-03-02T17:36:42Z",
      "title": "Trump administration may change how GDP is calculated amid DOGE cuts",
      "url": "https://apnews.com/article/trump-gdp-economy-government-spending-lutnick-7414ba1bd441bd4bf64620bfd66923b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/879ca22/2147483647/strip/true/crop/8223x4625+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F16%2F3bca9f27154d34ad3d594b0d9ed0%2F0454e586822a4a9caed14a45c9000fd0"
    },
    {
      "author": "Rob Gillies",
      "description": "Canadian Prime Minister Justin Trudeau will meet with King Charles III on Monday where he will discuss U.S. President Donald Trump’s threats to make Canada the 51st state. The king has come under criticism in Canada after Buckingham Palace declined to comment on Trump’s threats to annex Canada. Trudeau says he will discuss matters of importance to Canadians and said “nothing seems more important to Canadians right now than standing up for our sovereignty and our independence as a nation.” Charles is the head of state in Canada, which is a member of the British Commonwealth of former colonies.",
      "publishedAt": "2025-03-02T21:22:54Z",
      "title": "Trudeau to bring up Trump's threat to annex Canada in meeting with King Charles",
      "url": "https://apnews.com/article/trudeau-canada-king-charles-trump-5140e841c40e394bba21c2619534aa7c",
      "urlToImage": "https://dims.apnews.com/dims4/default/b8d4eff/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F2a%2F8584a3335c7d390f7acd70d7ecb2%2F6236c66943d44860879e4b2b41262e79"
    },
    {
      "author": "Stephen Whyno",
      "description": "A star-studded group of some of the best U.S. figure skaters of the past and present took the ice in the nation's capital to remember and raise money for the victims of the midair collision outside Ronald Reagan Washington National Airport. Olympic champions Brian Boitano and Kristi Yamaguchi emceed the Legacy on Ice benefit event, which included performances by the likes of Ilia Malinin, Amber Glenn and Johnny Weir, as well as poignant tributes to the 67 people who died when an Army helicopter collided with an American Airlines flight and crashed into the Potomac River. That included 28 members of the figure skating community.",
      "publishedAt": "2025-03-02T22:42:11Z",
      "title": "Tears flow at a poignant figure skating event in Washington benefiting victims of the DC plane crash",
      "url": "https://apnews.com/article/dc-helicopter-jet-crash-figure-skaters-58511d50373d7c3910fea82edc676078",
      "urlToImage": "https://dims.apnews.com/dims4/default/f9ee23f/2147483647/strip/true/crop/5584x3141+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2Fde%2F5b8d424b0effd7924dfb97de21c1%2Fe4183f867c6843bca2f315f294bd1fe7"
    },
    {
      "author": "Jake Coyle",
      "description": "\"Anora,” a strip-club Cinderalla story without the fairy tale ending, was crowned best picture at the 97th Academy Awards on Sunday, handing Sean Baker’s gritty, Brooklyn-set screwball farce Hollywood’s top prize. Adrien Brody won best actor for his performance in “The Brutalist.” Mikey Madison won best actress for “Anora.” The Oscars spread the love around, dishing out awards to “Conclave,” “Wicked” and “The Substance.\" Eight of the 10 movies nominated for best picture came away with at least one award at the Dolby Theatre on Sunday. Zoe Saldaña won best supporting actress, delivering a heartfelt speech thanking her family. The night’s first award, presented by Robert Downey Jr., went to Kieran Culkin for best supporting actor.",
      "publishedAt": "2025-03-02T05:00:10Z",
      "title": "Oscars 2025: 'Anora,' 'Conclave,' 'Wicked' and more notch wins",
      "url": "https://apnews.com/article/2025-oscars-academy-awards-show-aba51f1388c77c6a9b302a6798f3fef7",
      "urlToImage": "https://dims.apnews.com/dims4/default/be6bd80/2147483647/strip/true/crop/3271x1840+0+167/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2F31%2Fcc4c25df44398db308d8d8b5c444%2Fada66ffa30ca4b8aaa805325c9ecfce3"
    },
    {
      "author": "Tia Goldenberg, Samy Magdy",
      "description": "Israel says it's stopping the entry of all goods and supplies into the Gaza Strip. It warned of “additional consequences” if Hamas doesn't accept what Israel says is a U.S. proposal for a ceasefire extension. Hamas accused Israel of trying to derail the fragile truce and said its decision to cut off aid was “cheap extortion, a war crime and a blatant attack\" on the existing agreement. The first phase of the Israel-Hamas ceasefire, which included a surge in humanitarian assistance, expired on Saturday. The two sides have yet to negotiate the second phase, when Hamas is to release dozens of remaining hostages in return for Israel's pullout and a lasting ceasefire.",
      "publishedAt": "2025-03-02T06:58:54Z",
      "title": "Gaza ceasefire: Israel stops entry of all aid and supplies into Gaza Strip",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-02-2025-99402570996dcf33239d0492d99909e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/fdabdc0/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F6d%2Fcbf1d770f29b09bc69180fdd9fcb%2F4c0bb2fb3e7f4b48a4508e123b2ced92"
    },
    {
      "author": "Cara Anna",
      "description": "Israel has cut off the entry of all food and other goods into Gaza in an echo of the siege it imposed in the earliest days of its war with Hamas. The United Nations and other humanitarian aid providers are sharply criticizing the decision and calling it a violation of international law. Israel is trying to pressure the Hamas militant group to agree to what Prime Minister Benjamin Netanyahu’s government describes as a U.S. proposal to extend the ceasefire’s first phase instead negotiating its second phase. Here’s a look at what Israel’s decision means and the reactions.",
      "publishedAt": "2025-03-02T19:18:57Z",
      "title": "Israel has cut off all supplies to Gaza. Here's what that means",
      "url": "https://apnews.com/article/gaza-israel-hamas-palestinians-aid-explainer-ecc0e70d5ff1120a04bf36626dfd96f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b37ff9/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F2a%2Fe7bf969bcf911ef73fc8802b4d88%2Ffa20088a1a2e490fb1ad0d3c8a512595"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}