{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Ukrainian President Volodymyr Zelenskyy has thanked the American people and leadership and voiced hope for “strong relations,” a day after an astonishing Oval Office blowout with U.S. President Donald Trump that left many uncertain where the once staunch allies stood. Zelenskyy on Saturday arrived in London for a summit organized by British Prime Minister Keir Starmer with other European leaders. The summit on Sunday will also include leaders from France, Germany, Denmark, Italy, Netherlands, Norway, Poland, Spain, Turkey, Finland, Sweden, Czechia and Romania, as well as the NATO secretary-general and the presidents of the European Commission and European Council.",
      "publishedAt": "2025-03-01T12:23:36Z",
      "title": "Zelenskyy is in crisis talks in London after Oval Office blowup",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-london-bf158d8f9e10a7c049ea90f8fd917ab6",
      "urlToImage": "https://dims.apnews.com/dims4/default/2af3bfe/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2F26%2Fa59ed05f02a23070a0945db3ea8f%2F08a6463a7a8742d5a1786e58c80d93be"
    },
    {
      "author": "Zeke Miller",
      "description": "President Donald Trump’s Oval Office thrashing of Ukraine’s Volodymyr Zelenskyy has laid bare the limits of a full-court press by America’s allies aimed at reshaping Trump’s determination to end Russia’s invasion even if the terms are not to Ukraine’s liking. It also shows the profound ways Trump feels emboldened to redirect U.S. foreign policy priorities toward his “America First” agenda in ways that extend well beyond those of his tumultuous first term. The episode has left in doubt the future of the U.S.-Ukraine relationship, and Kyiv’s ability to defend itself in the brutal conflict with Russia.",
      "publishedAt": "2025-03-01T05:02:31Z",
      "title": "Trump's Oval Office thrashing of Zelenskyy shows limits of Western allies' ability to sway US leader",
      "url": "https://apnews.com/article/trump-zelenskyy-oval-office-ukraine-russia-blowup-8aa63e55c859e8fea963911478c376ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/da358e0/2147483647/strip/true/crop/3889x2188+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F78%2Fa90e4688c7e28534410a87cf704b%2Fff78f74835e4497ebd26f9ffc7d865c9"
    },
    {
      "author": "The Associated Press",
      "description": "Key Republicans and Democrats have been stalwart supporters of Ukrainian President Volodymyr Zelenskyy. But a blowup between the Ukrainian leader and President Donald Trump is threatening to change that. Zelenskyy had traveled to Washington to sign a deal Friday that would give the U.S. access to its mineral riches as Trump attempts to pressure Ukraine into a deal to end the war with Russia. Instead, the fallout from a heated Oval Office exchange between Trump, Zelenskyy and Vice President JD Vance further splintered American political support for Ukraine. Sen. Lindsey Graham, who has backed Ukraine, called the meeting a “complete, utter disaster.\"",
      "publishedAt": "2025-02-28T20:36:21Z",
      "title": "What US lawmakers are saying about the White House clash between Trump and Zelenskyy",
      "url": "https://apnews.com/article/republicans-trump-zelenskyy-meeting-64ec4a67fce4f04a2d189a1e0204b023",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb2a819/2147483647/strip/true/crop/5486x3086+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F70%2F8d4d345a334f1f6406ca4e6cf9bb%2F48c8bd586cbb436ab7967789d563bb64"
    },
    {
      "author": "Adriana Gomez Licon",
      "description": "President Donald Trump and Vice President JD Vance had a heated exchange with Ukrainian President Volodymyr Zelenskyy in the Oval Office over the war in Ukraine, accusing him of not showing gratitude after he challenged Vance on the question of diplomacy with Russia’s Vladimir Putin. The argument, broadcast globally on Friday, was perhaps unique in American history. It led to the rest of Zelenskyy’s White House visit being canceled and called into question how much the U.S. will still support Ukraine in its defense against Russia’s 2022 invasion.",
      "publishedAt": "2025-02-28T20:58:30Z",
      "title": "A transcript of Trump and Zelenskyy's Oval Office argument",
      "url": "https://apnews.com/article/trump-zelenskyy-vance-transcript-oval-office-80685f5727628c64065da81525f8f0cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c9e3b4/2147483647/strip/true/crop/3000x1688+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F49%2Fd2ae134e0b373d79553f54764f30%2F8fd972c8997a4122bb7524d4a3c3b60e"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Zelenskyy embraced by British prime minister a day after White House clash",
      "url": "https://apnews.com/article/zelenskyy-starmer-uk-british-white-house-trump-a05e6ec1c37aabdbb5067d8ce87d6d1e",
      "urlToImage": null
    },
    {
      "author": "Susan Montoya Bryan",
      "description": "Actor Gene Hackman and his wife made Santa Fe their home decades ago. The northern New Mexico city has a reputation of being a refuge for actors and authors seeking to escape the spotlight. Nestled among piñon- and juniper-scented foothills, it's far from the glitz of Los Angeles or New York City. The normally laid back city was in collective shock this week as news spread that Hackman and his wife, Betsy Arakawa, had been found dead inside their home. Other acclaimed artists who live in Santa Fe include the actors Shirley MacLaine and Ali MacGraw, and “Game of Thrones” author George R. R. Martin.",
      "publishedAt": "2025-03-01T05:02:51Z",
      "title": "For Gene Hackman, Santa Fe was a refuge from limelight",
      "url": "https://apnews.com/article/gene-hackman-santa-fe-new-mexico-1ad28385c861861f289516767410267f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c68ebe4/2147483647/strip/true/crop/1926x1083+0+89/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F20%2F4432d950148d788a070c06b48b14%2F0c2e703cb29240a0b3411c9ebc46d3d8"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "US auto industry could be collateral damage in Trump’s trade wars",
      "url": "https://apnews.com/article/tariffs-cars-automakers-trump-canada-mexico-7d34c3ba8b96864ea77c6b16780cf349",
      "urlToImage": null
    },
    {
      "author": "Samy Magdy, David Rising",
      "description": "A senior Hamas official says no progress has been made in the latest round of talks on the second phase of the ceasefire between Israel and the Palestinian militant group Hamas. It remained unclear whether the talks would resume. The first phase of the ceasefire, which paused 15 months of fighting, saw the release of 33 hostages, including eight bodies, in exchange for nearly 2,000 Palestinian prisoners. Phase one expires on Saturday, but under the terms of the deal, fighting is not to resume while negotiations are underway on the second phase, which could end the war in Gaza and see the remaining living hostages returned home.",
      "publishedAt": "2025-03-01T10:45:57Z",
      "title": "Hamas says 'no progress' on second ceasefire phase in indirect talks with Israel",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-03-01-2025-943564ec594b1246c7690d2560a65498",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ffe9e0/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2Fe8%2F6d819feb42a177f14da64274d288%2Fee2313152a394984b08698c7fdeb49af"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "During his first six weeks in office, President Donald Trump has worked to tear down the federal government and attack long-standing institutions. He's undertaken a purge at the FBI and Department of Justice. He's forced out federal officials who are responsible for overseeing ethics and protecting whistleblowers. He's declared control over independent agencies such as the Federal Elections Commission. And he's gone after the arts and the media. Trump says he's the one who's saving American democracy. Yet his actions have raised alarms that the country's 240-year-old form of democratic government is under threat.",
      "publishedAt": "2025-03-01T12:56:06Z",
      "title": "Trump tests limits of executive power and US democracy",
      "url": "https://apnews.com/article/trump-democracy-autocrats-authoritarian-constitution-threat-542ac437a58880e81c052f8f2df1643f",
      "urlToImage": "https://dims.apnews.com/dims4/default/382ebd4/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2Fa7%2F433d6d7b0a1c912915d24e2681b3%2Ff9a69a28fd5a4dbc9842a8c4e75aab44"
    },
    {
      "author": "Nicole Winfield, Giovanna Dell'orto",
      "description": "Pope Francis has had coffee and read the papers after an alarming setback in his two-week recovery from double pneumonia. The Vatican said doctors had to put him on noninvasive mechanical ventilation on Friday afternoon following a coughing fit in which he inhaled vomit that needed to then be extracted. Doctors said it would take a day or two to evaluate how and if the episode impacted Francis’ overall clinical condition. His prognosis remains guarded, meaning he isn’t out of danger. Saturday morning he had coffee for breakfast and was reading the newspapers. That suggests that he is not dependent on a ventilation mask to breathe and can still eat on his own.",
      "publishedAt": "2025-03-01T07:42:46Z",
      "title": "Pope rests after setback in recovery",
      "url": "https://apnews.com/article/pope-vatican-pneumonia-e9c1fda0c5db42ac6e4eda47e9bb2fc3",
      "urlToImage": "https://dims.apnews.com/dims4/default/e23613e/2147483647/strip/true/crop/6459x3633+0+336/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F76%2Faa4ca47927ff5dc72a0acb5004b9%2F4fdf4c2047bb421b8e50c595606214f3"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}