{
  "articles": [
    {
      "author": "FADI TAWIL and JACK JEFFERY",
      "description": "BEIRUT (AP) — The Israeli military on Thursday warned people to evacuate communities in southern Lebanon that are outside a U.N.-declared buffer zone, signaling that it may widen a ground operation launched earlier this week against the Hezbollah militant group.",
      "publishedAt": "2024-10-03T08:57:22Z",
      "title": "Israel extends evacuation warnings in Lebanon, signaling a wider offensive",
      "url": "https://apnews.com/5fad98f56ebcc7e1751388b608c7c8dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd866f2f78c1457c88b1aa9bfe09348f/1920.jpeg"
    },
    {
      "author": "LEO CORREA and MELANIE LIDMAN",
      "description": "Lilach Almog walks past the remains of a police station seized by Hamas militants and buildings pockmarked by bullets in her southern Israeli town multiple times a day.",
      "publishedAt": "2024-10-04T04:12:20Z",
      "title": "A year later, Israeli survivors reflect on the lingering toll of Oct. 7",
      "url": "https://apnews.com/fb65aa677e344a873566dc948d6bf52a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0355e63fc0948f4befb48fd97c77bb3/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "PENSACOLA, N.C. (AP) — The search for victims of Hurricane Helene dragged into its second week on Friday, as exhausted rescue crews and volunteers continued to work long days — navigating past washed out roads, downed power lines and mudslides — to reach the isolated and the missing.",
      "publishedAt": "2024-10-04T04:11:07Z",
      "title": "As search for Helene's victims drags into second week, sheriff says rescuers 'will not rest'",
      "url": "https://apnews.com/1a2255b9d1dd5cd9554a76b45c7a695c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39f0eb071b6a420ea7be832d122c06a8/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — The union representing 45,000 striking U.S. dockworkers at East and Gulf coast ports reached a deal Thursday to suspend a three-day strike until Jan. 15 to provide time to negotiate a new contract.",
      "publishedAt": "2024-10-03T22:40:53Z",
      "title": "Dockworkers' union to suspend strike until Jan. 15 to allow time to negotiate new contract",
      "url": "https://apnews.com/86fac07d1189e11ca4816b2cbf37affb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c5f8381d49c44848cbc34ec323feca7/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "DETROIT (AP) — Vice President Kamala Harris will visit the union stronghold of Flint on Friday as she battles with Donald Trump for working-class voters who could tip the scales in this year's election.",
      "publishedAt": "2024-10-04T04:05:18Z",
      "title": "Harris and Trump battle for labor support as dockworkers suspend strike",
      "url": "https://apnews.com/98eee32bc975ed5bc284d3e0785e5d7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45c5908aff3a427a958eebe0cd75de16/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Days before rioters roamed the halls of the U.S. Capitol threatening to “hang Mike Pence,” Donald Trump told his vice president that people are going to “hate your guts” and “think you're stupid” if he failed to stop the 2020 election certification.",
      "publishedAt": "2024-10-04T04:06:00Z",
      "title": "Filing in Trump case details remarkable schism with Pence over rejecting 2020 election loss",
      "url": "https://apnews.com/f78cf222187b271e0ba0bb684110455e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b3ef9748cd349e6829e9c6ac0a121ea/2852.jpeg"
    },
    {
      "author": "ALAN SUDERMAN",
      "description": "WASHINGTON (AP) — The future was once dazzling for IronNet.Founded by a former director of the National Security Agency and stacked with elite members of the U.S.",
      "publishedAt": "2024-10-04T04:03:03Z",
      "title": "Collapse of national security elites' cyber firm leaves bitter wake",
      "url": "https://apnews.com/eddd67f3a1b312face21c29c59400e05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/149189d76e36448f9bad71d8604fb901/3000.jpeg"
    },
    {
      "author": "CLAIRE GALOFARO and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Dozens of South Korean adoptees, many in tears, have responded to an investigation led by The Associated Press and documented by Frontline (PBS) last week on Korean adoptions.",
      "publishedAt": "2024-10-03T23:33:35Z",
      "title": "Did this happen to me also? Korean adoptees question their past and ask how to find their families",
      "url": "https://apnews.com/b0ea88142b9dea6064ce408486b29961",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ab7b23a23ca4857abd6223436c9ced4/3000.jpeg"
    },
    {
      "author": "ADRIAN SAINZ, KRISTIN M. HALL and JONATHAN MATTISE",
      "description": "MEMPHIS, Tenn. (AP) — Three former Memphis police officers were convicted Thursday in the 2023 fatal beating of Tyre Nichols, but were acquitted of the harshest charges they faced for a death that sparked national protests and calls for broad changes in policing.",
      "publishedAt": "2024-10-03T15:23:36Z",
      "title": "Mixed verdict for 3 Memphis officers convicted in Tyre Nichols' fatal beating",
      "url": "https://apnews.com/5e19e800cd5017c89cb652cfc8235ea2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/729139282b8a4530bfdc0a1c17e74d76/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER WEBER and JAIMIE DING",
      "description": "LOS ANGELES (AP) — Prosecutors in Los Angeles are reviewing new evidence in the case of Erik and Lyle Menendez to determine whether they should be serving life sentences for killing their parents in their Beverly Hills mansion more than 35 years ago, the city's district attorney said Thursday.",
      "publishedAt": "2024-10-03T22:15:43Z",
      "title": "Los Angeles prosecutors to review new evidence in Menendez brothers' 1996 murder conviction",
      "url": "https://apnews.com/488b0f0faf3ad86264e0d80036a6d37c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4df8e19cd52f48f58e4b3905fce2d6f9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}