{
  "articles": [
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden was indicted on nine tax charges in California on Thursday as a special counsel investigation into the business dealings of President Joe Biden's son intensifies against the backdrop of the looming 2024 election.",
      "publishedAt": "2023-12-08T01:31:36Z",
      "title": "Hunter Biden indicted on nine tax charges, adding to gun charges in special counsel probe",
      "url": "https://apnews.com/75b2aa05f247535677454ff2dfa7c71f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8753e67b1d524cc2b664bbbea08c5eaa/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, KAREEM CHEHAYEB and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Desperation grew Thursday among Palestinians largely cut off from supplies of food and water as Israeli forces engaged in fierce urban battles with Hamas militants. Strikes in the southern Gaza town of Rafah sowed fear in one of the last places where civilians could seek refuge.",
      "publishedAt": "2023-12-07T09:40:33Z",
      "title": "Desperation grows among Palestinians trapped with little aid as Israel battles Hamas in Gaza",
      "url": "https://apnews.com/174f470c9e3d3c6ea5adb59d7e523425",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3ea423af5ba467f9f99458071750ae4/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and ISABEL DEBRE",
      "description": "MUWASI, Gaza Strip (AP) — Israel has designated a small slice of mostly undeveloped land along Gaza's Mediterranean coast as a safe zone — a place where waves of people fleeing the war can find protection from airstrikes and receive humanitarian supplies for their families.",
      "publishedAt": "2023-12-07T22:19:24Z",
      "title": "Israel designates safe zone in Gaza. Palestinians and aid groups say it offers little relief",
      "url": "https://apnews.com/ca3860fafed03cb2333ad0bdf2379e31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/622753835ac444328512712e4202e596/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and BILL BARROW",
      "description": "TUSCALOOSA, Ala. (AP) — As Donald Trump faces growing scrutiny over his increasingly authoritarian and violent rhetoric, Fox News host Sean Hannity gave his longtime friend a chance to assure the American people that he wouldn't abuse power or seek retribution if he wins a second term.",
      "publishedAt": "2023-12-08T00:58:52Z",
      "title": "Trump's vow to only be a dictator on 'day one' follows growing worry over his authoritarian rhetoric",
      "url": "https://apnews.com/f27e7e9d7c13fabbe3ae7dd7f1235c72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2840d5c5e2847ad81c23bfda8b5b29f/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House members voted again Thursday to punish one of their own, targeting Democratic Rep. Jamaal Bowman for triggering a fire alarm in a U.S.",
      "publishedAt": "2023-12-07T05:14:21Z",
      "title": "House votes to censure Democratic Rep. Bowman for pulling a fire alarm in a Capitol office building",
      "url": "https://apnews.com/a313aa51be66ba52e690d50d8564eaf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/076823404ba24f049f086922b42dc006/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and BEN FINLEY",
      "description": "LAS VEGAS (AP) — The 67-year-old gunman who killed three faculty members and wounded a fourth in a roughly 10-minute rampage at the University of Nevada, Las Vegas, had a list of targets at the school and 150 additional rounds of ammunition, police said Thursday.",
      "publishedAt": "2023-12-07T05:30:57Z",
      "title": "UNLV gunman had list of targets at the university and 150 rounds of ammunition, police say",
      "url": "https://apnews.com/0b12656a801e227d6aa2b9ccee56d9f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f83257e295754f8d8314b133b337205d/1920.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — A Texas judge on Thursday gave a pregnant woman whose fetus has a fatal diagnosis permission to get an abortion in an unprecedented challenge over bans that more than a dozen states have enacted since Roe v.",
      "publishedAt": "2023-12-07T05:19:51Z",
      "title": "Texas judge grants pregnant woman permission to get an abortion despite state’s ban",
      "url": "https://apnews.com/568c09dc8794c341095189362ece9004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3e647f9d0ce447ab9fa6a4f7ada7840/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Former President Donald Trump is appealing a ruling that found he is not immune from criminal prosecution as he runs out of opportunities to delay or even derail an upcoming trial on charges that he plotted to overturn the results of the 2020 election.",
      "publishedAt": "2023-12-07T17:26:22Z",
      "title": "Trump appeals ruling rejecting immunity claim as window narrows to derail federal election case",
      "url": "https://apnews.com/9528a29b2dbebb6ee4a4ebd26780f98c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a05dd2c4c6dd4429bc46cbce3b14032f/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — When the U.S. military took the extraordinary step of grounding its entire fleet of V-22 Ospreys this week, it wasn’t reacting just to the recent deadly crash of the aircraft off the coast of Japan.",
      "publishedAt": "2023-12-07T20:31:11Z",
      "title": "Ospreys had safety issues long before they were grounded. A look at the aircraft's history",
      "url": "https://apnews.com/5d81b361e3d1e43402f6727341515668",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/914163ce71564a4fa2ad9c38af89b4a3/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY and CLAIRE RUSH",
      "description": "PEARL HARBOR, Hawaii (AP) — Ira “Ike” Schab had just showered, put on a clean sailor's uniform and closed his locker aboard the USS Dobbin when he heard a call for a fire rescue party. He went topside to see the USS Utah capsizing and Japanese planes in the air.",
      "publishedAt": "2023-12-07T05:07:37Z",
      "title": "Centenarian survivors of Pearl Harbor attack return to honor those who perished 82 years ago",
      "url": "https://apnews.com/cdfd14ffccf0299305d90b61921fc95d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7257a274c44247d9b457ffa2e94b76fc/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}