{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "With no end to the war sight, Palestinians in Gaza began fasting Monday for the holy month of Ramadan as hunger worsens across the strip and pressure is raised on Israel over the growing humanitarian crisis.",
      "publishedAt": "2024-03-11T11:56:39Z",
      "title": "The Latest | Israeli strikes kill at least 67 Palestinians in Gaza as Ramadan begins",
      "url": "https://apnews.com/901fe27035ebf516ccc54fa6ae62b7c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/565d64992c95471786774dec22c83cfc/3000.jpeg"
    },
    {
      "author": "MOHAMMED JAHJOUH and SAMY MAGDY",
      "description": "MUWASI, Gaza Strip (AP) — It was a somber scene as Randa Baker and her family sat on the ground in their tent in southern Gaza at sunset Monday for their meal breaking their first day of fasting in the Muslim holy month of Ramadan.",
      "publishedAt": "2024-03-12T03:41:56Z",
      "title": "A Gaza family uprooted by war and grieving their losses shares a somber Ramadan meal in a tent",
      "url": "https://apnews.com/4a0a2043e7d6b5f9a70a70ba089d973b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40e0cfaf646c48a7b815d806e8f3428b/3000.jpeg"
    },
    {
      "author": "DANICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haitian Prime Minister Ariel Henry announced early Tuesday that he would resign once a transitional presidential council is created, capitulating to international pressure that seeks to save the country overwhelmed by violent gangs that some experts say have unleashed a low-scale civil war.",
      "publishedAt": "2024-03-12T04:33:00Z",
      "title": "Haiti's premier says he'll resign once a transitional council is created",
      "url": "https://apnews.com/28acaecc1d80d993c99fe43a5e1e1f7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/261a6294b6bb4f65b5511b1b294fc659/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — Joe Biden and Donald Trump hope to clinch their parties' presidential nominations with dominant victories in a slate of state primaries on Tuesday as the 2024 fight for the White House moves into a new phase.",
      "publishedAt": "2024-03-12T04:05:50Z",
      "title": "Biden and Trump could clinch nominations in Tuesday's contests, ushering in general election",
      "url": "https://apnews.com/15bb0084ad656903ffef14cfae822abd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/106c5589330a4caa93df31a5b09f72f0/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and KEVIN FREKING",
      "description": "NEW YORK (AP) — House Republicans are moving ahead with a bill that would require Chinese company ByteDance to sell TikTok or face a ban in the United States even as former President Donald Trump is voicing opposition to the effort.",
      "publishedAt": "2024-03-11T17:28:54Z",
      "title": "House Republicans move ahead with TikTok vote even as Trump voices opposition to possible ban",
      "url": "https://apnews.com/72768a92439de45b38e88cc255504ab5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/278fa2fb7ef04292a90d7bfd54e557b5/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "WASHINGTON (AP) — Just days after installing his new leadership team at the Republican National Committee, Donald Trump's lieutenants are cutting dozens of staff across key departments in an aggressive move that further cements the former president's takeover of the GOP's political and fundraising machinery.",
      "publishedAt": "2024-03-12T02:10:54Z",
      "title": "Trump's team is slashing Republican National Committee staff amid takeover, AP sources say",
      "url": "https://apnews.com/46bc8afcc152aecfd471161a59b74005",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11fe975500994a09a567fbd68ab930f0/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump is seeking to delay his March 25 hush money trial until the Supreme Court rules on the presidential immunity claims he raised in another of his criminal cases.",
      "publishedAt": "2024-03-11T18:03:18Z",
      "title": "Donald Trump wants New York hush money trial delayed until Supreme Court rules on immunity claims",
      "url": "https://apnews.com/7a5030cd4f7b6364cd1a8a599cea025d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c265ec5459e4619b0c4bfe594d3990b/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "ORLANDO, Fla. (AP) — Students and teachers can discuss sexual orientation and gender identity in Florida classrooms, provided it’s not part of instruction, under a settlement reached Monday between Florida education officials and civil rights attorneys who had challenged a state law which critics dubbed “Don't Say Gay.”",
      "publishedAt": "2024-03-11T20:46:58Z",
      "title": "Florida teachers can discuss sexual orientation and gender ID under 'Don't Say Gay' bill settlement",
      "url": "https://apnews.com/987904b3e19122d719cf468034746b6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b798489b15da468fb959db1c01b79d89/3000.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Sixteen years ago, mass protests in Nepal forced then-King Gyanendra Shah to give up the throne and clear the way for a republic. Now, a new wave of protest is trying to bring him back.",
      "publishedAt": "2024-03-12T04:04:39Z",
      "title": "Protests drove Nepal's king off the throne 16 years ago. Now, protests are trying to bring him back",
      "url": "https://apnews.com/4809490a618a8d2ff4d0aca9f24f1537",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cfbe035c8214fc7a9463096bba5a70a/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Kate, Princess of Wales, apologized Monday for “confusion” caused by her altering of a family photo released by the palace — an image of Kate and her children that was intended to calm concern and speculation about the British royal's health, but had the opposite effect.",
      "publishedAt": "2024-03-11T10:54:27Z",
      "title": "Kate, Princess of Wales, apologizes for altering family photo that fueled rumors about her health",
      "url": "https://apnews.com/482fda64281b4a63ccf30364d96b2622",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f63dae2f0fd048a9af8a10d78d61cce8/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}