{
  "articles": [
    {
      "author": "Aamer Madhani",
      "description": "Deputy Attorney General Todd Blanche is defending the Justice Department’s decision to release just a fraction of the Jeffrey Epstein files by the congressionally mandated deadline. Blanche is pledging that the Trump administration will eventually meet its obligation required by law. But he tells NBC's “Meet the Press” that his department was obligated to act with caution as it goes about releasing thousands of documents that can include sensitive information. Friday’s partial release of the Epstein files has led to a new crush of criticism from Democrats. They accuse the Trump administration of trying to hide information. Blanche calls the pushback disingenuous.",
      "publishedAt": "2025-12-21T17:15:38Z",
      "title": "No. 2 Justice Department official defends partial release of Epstein files",
      "url": "https://apnews.com/article/blanche-epstein-trump-justice-department-files-democrats-85450de690a7e17ebe208f30db49b68e",
      "urlToImage": "https://dims.apnews.com/dims4/default/92952b7/2147483647/strip/true/crop/7481x4208+0+389/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F92%2F59f7539635230e5d3b6f9bacca7d%2Fc44b669a86c7471089936251a81e8ce0"
    },
    {
      "author": "Aamer Madhani",
      "description": "The U.S. Coast Guard is pursuing another sanctioned oil tanker in the Caribbean Sea. Word of the pursuit comes as the Trump administration appears to be intensifying its targeting of such vessels connected to Venezuelan government. The tanker pursuit Sunday was confirmed by a U.S. official. On Saturday, the U.S. administration said it had seized a tanker for the second time in less than two weeks.",
      "publishedAt": "2025-12-21T17:52:46Z",
      "title": "Coast Guard is pursuing another tanker off Venezuela, US official says",
      "url": "https://apnews.com/article/venezuela-trump-blockade-ship-intercepted-coast-guard-00056eed8071c51ca681fc74528d66f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/69e4ec5/2147483647/strip/true/crop/3058x1720+0+159/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2Fee%2Ffe48a8d845ea9b573d4a0b125694%2Ffc6d377a64104b88a9151cc89fcfc2fa"
    },
    {
      "author": "The Associated Press",
      "description": "A Kremlin envoy says peace talks on a U.S.-proposed plan to end the nearly four-year war in Ukraine are proceeding “constructively” in Florida, while the Ukrainian president said they were moving ”quickly.” The talks are part of the Trump administration’s push for peace. On Saturday, Kirill Dmitriev told reporters the discussions “began earlier and will continue.” Russian state news agency RIA Novosti reported that Dmitriev met with U.S. President Donald Trump’s envoy Steve Witkoff and Trump’s son-in-law Jared Kushner in Miami. The French presidency on Sunday welcomed Russian President Vladimir Putin’s willingness to speak with President Emmanuel Macron.",
      "publishedAt": "2025-12-21T07:55:31Z",
      "title": "Russia says talks on US peace plan for Ukraine 'are proceeding constructively'",
      "url": "https://apnews.com/article/russia-ukraine-war-witkoff-dmitriev-kushner-talks-trump-1ad3b82d8a2b5c449968d8c62e818a04",
      "urlToImage": "https://dims.apnews.com/dims4/default/acb7be1/2147483647/strip/true/crop/4833x2719+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2F1a%2Fdbc2aa9c4100a251845212516a8d%2Fafa522265baf440abe25783880a61d2d"
    },
    {
      "author": null,
      "description": "Israel's Cabinet has approved a proposal for 19 new settlements in the occupied West Bank. The far-right finance minister, Betzalel Smotrich, announced the decision on Sunday. The settlements include two that were previously evacuated during a 2005 disengagement plan. Smotrich, who supports settlement expansion, noted that this brings the total number of new settlements over the past two years to 69. According to Peace Now, an anti-settlement group, this approval increases the number of settlements by nearly 50% during the current government's tenure. Settlements are widely considered illegal under international law.",
      "publishedAt": "2025-12-21T10:52:48Z",
      "title": "Israel's Cabinet approves 19 new settlements in occupied West Bank",
      "url": "https://apnews.com/article/israel-palestinians-settlements-west-bank-6923448a5956ff4d90b240d871db33e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/3012f56/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F86%2F18bed41b1c1509240a16273af30b%2Fa4551589943542038095c78fd0370367"
    },
    {
      "author": "Charlotte Kramon",
      "description": "Christian influencers are reaching hundreds of thousands of young people online. They share podcasts and videos with biblical advice on tough questions that aren't always answered in Sunday sermons. Followers relate to millennial and Generation Z influencers more than the buttoned-up pastors of their parents' generation. And these influencers open up about past and present mistakes. Some have theological training and some don't. Some experts worry that they aren't equipped to teach such large audiences and threaten to replace church with podcasts, but many faithful are hopeful that this new group of Christian influencers will galvanize young people who are looking for meaning.",
      "publishedAt": "2025-12-21T13:27:06Z",
      "title": "A new generation of Christian influencers attracts young adults",
      "url": "https://apnews.com/article/christian-influencers-girls-gone-bible-megan-ashley-1241a2e0e54fc9fb828734ea911dd77d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f518156/2147483647/strip/true/crop/6128x3447+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2Ff4%2F417ce210484e60397933d77c547c%2Fe5357b2174b54c82902a6739324f2d1b"
    },
    {
      "author": null,
      "description": "Thousands of people have gathered at Stonehenge to celebrate the winter solstice. On Sunday, they cheered and danced as the sun rose over the prehistoric stone circle. Many wore costumes and arrived before dawn in southwest England. Some sang and beat drums, while others reflected among the huge stone pillars. The ancient monument was built to align with the sun's movement on the winter and summer solstices, important dates for ancient farmers. Sunday marks the shortest day of the year north of the equator. Many celebrate it as a time of renewal, as the days will now start getting longer.",
      "publishedAt": "2025-12-21T11:03:24Z",
      "title": "Thousands cheer as the sun rises on winter solstice at Stonehenge",
      "url": "https://apnews.com/article/winter-solstice-stonehenge-f85dd1e06b4496788e3fb5b669cd8b80",
      "urlToImage": "https://dims.apnews.com/dims4/default/2621ea3/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2F16%2F66f26dbeb5f4eb120b502479498c%2F4648b7c4243a4b7db0fc2eadfccca460"
    },
    {
      "author": "Jonathan J. Cooper, Sejal Govindarao",
      "description": "Turning Point USA has endorsed Vice President JD Vance as the Republican nominee for the next presidential election. Erika Kirk leads the conservative youth organization and she drew cheers when she announced the endorsement at the group's convention in Phoenix. But the event also highlighted the challenges for Vance and other potential successors to President Donald Trump. The “Make America Great Again movement” is fracturing as Republicans consider a future without Trump, and there's no clear path to holding his coalition together as different factions jockey for influence. Trump hasn't officially chosen a successor.",
      "publishedAt": "2025-12-21T13:18:40Z",
      "title": "Turning Point showcases the discord that Republicans will need to navigate",
      "url": "https://apnews.com/article/turning-point-charlie-kirk-vance-republicans-2028-e28a332d7f55eb44346ef9d47e8906e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1a6756/2147483647/strip/true/crop/6516x3665+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F89%2F5a49f945ab49902c21b69d1257ad%2F7868a1db2d1f47ea9a1491e2feecec29"
    },
    {
      "author": "Jaimie Ding",
      "description": "Power has been restored to most of the 130,000 homes and businesses in San Francisco affected by a massive outage on Saturday. Pacific Gas and Electric Co. reported more than 20,000 customers still without electricity as of early Sunday morning. The outage began shortly after 1 p.m. on Saturday, affecting a large part of the city. Social media and local reports highlighted mass closures of restaurants and shops, along with darkened street lights. The San Francisco Department of Emergency Management reported significant transit disruptions. A fire at a PG&E substation contributed to the blackouts, but the full cause is under investigation.",
      "publishedAt": "2025-12-21T01:54:20Z",
      "title": "About 20,000 still without electricity in San Francisco as crews work to restore",
      "url": "https://apnews.com/article/power-outage-san-francisco-pge-4e92a586ce4d71865fa9f1f4fd057df3",
      "urlToImage": "https://dims.apnews.com/dims4/default/911b257/2147483647/strip/true/crop/7514x4227+0+391/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F79%2Fbb2afbeac31420e0b36f99db258b%2Febbdd4ff930f4b638e357e47051d12bf"
    },
    {
      "author": "Albert Stumm",
      "description": "They say laughter is the best medicine. Michael Miller, a cardiologist and medical professor at the University of Pennsylvania, says they’re right. Laughter is an obvious stress reliever. But Miller says it’s even good for your heart. Madan Kataria — a physician in Mumbai and the founder of laughter yoga — agrees. Laughter yoga involves breathing exercises, light stretches, and silly movements and sounds that force you to laugh. Kataria suggests bringing laughter into your daily life, even at things that might not seem funny. Recently, he demonstrated what he calls \"credit-card-bill laughter.” He held out his hand as if looking at a statement, and burst into a roiling, infectious laughter.",
      "publishedAt": "2025-12-21T18:44:40Z",
      "title": "Laughter is great medicine even if it's forced",
      "url": "https://apnews.com/article/laughter-health-benefits-1821b672f574a445e2fa9763452979c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/1052b74/2147483647/strip/true/crop/1920x1080+0+100/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2F6d%2F64cc1c89fcd9c187f9d743599a1c%2F84bb3c05c8c04094a8c6fb644e489aad"
    },
    {
      "author": "Howard Fendrich",
      "description": "The Philadelphia Eagles have won their second straight NFC East title. Jalen Hurts and Saquon Barkley led the Eagles to a 29-18 win over the Washington Commanders on Saturday night. The game included a late brawl after Barkley tacked on a 2-point conversion to increase the Eagles’ lead to 19 points. Hurts completed 22 of 30 throws for 185 yards, two touchdowns and no turnovers. Barkley had a 12-yard TD run as part of his 21-carry, 132-yard performance. It wasn't a terrific performance by the Eagles, who had a fumble on the opening kickoff and a pair of penalties on the tush push.",
      "publishedAt": "2025-12-21T01:16:46Z",
      "title": "Hurts, Eagles beat Commanders for 2nd straight NFC East title",
      "url": "https://apnews.com/article/eagles-commanders-score-7ea8f81fff69281158f19917e8021857",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf076bd/2147483647/strip/true/crop/5600x3150+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2Fae%2Ff29873620b98e718f95b6e68d096%2F539615d9d5f246358ce6e1cbe1af034a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}