{
  "articles": [
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA, SAMY MAGDY",
      "description": "Prime Minister Benjamin Netanyahu said Thursday that a “last minute crisis” with Hamas was holding up Israeli approval of a long-awaited agreement to pause the fighting in the Gaza Strip and release dozens of hostages. Israeli airstrikes meanwhile killed dozens of people across the war-ravaged territory. Netanyahu’s office said his Cabinet won’t meet to approve the agreement until Hamas backs down, accusing it of reneging on parts of the agreement in an attempt to gain further concessions. U.S. President Joe Biden and key mediator Qatar announced the deal on Wednesday, which is aimed at releasing scores of hostages held in Gaza and winding down a 15-month war that has destabilized the Middle East and sparked worldwide protests.",
      "publishedAt": "2025-01-16T08:43:40Z",
      "title": "Israel PM Netanyahu says Cabinet won't meet over Gaza ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-16-2024-dc0ef64dd52db395c5a54328518e8efd",
      "urlToImage": "https://dims.apnews.com/dims4/default/cd11b00/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F59%2F59296f6b288a051cf8c9c7dcfe0e%2F146026970d744e6bae6cfc5ea3be8137"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Israel and Hamas agreed to a ceasefire deal to pause the devastating war in the Gaza Strip, the United States and Qatar said Wednesday.",
      "publishedAt": "2025-01-15T11:50:00Z",
      "title": "Live updates: Israel-Hamas ceasefire in Gaza is confirmed by the US and Qatar",
      "url": "https://apnews.com/live/israel-hamas-ceasefire-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/3640203/2147483647/strip/true/crop/4896x2754+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F1f%2Fb17353394048ad7dfd58e856f48a%2Fap25015706056455.jpg"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Israel and Hamas agreed to a ceasefire deal to pause the devastating war in the Gaza Strip, the United States and Qatar said Wednesday.",
      "publishedAt": "2025-01-15T11:50:00Z",
      "title": "Live updates: Israel-Hamas ceasefire in Gaza is confirmed by the US and Qatar",
      "url": "https://apnews.com/live/israel-hamas-ceasefire-updates#00000194-6c22-dc66-a1bf-eeeae72a0000",
      "urlToImage": "https://dims.apnews.com/dims4/default/3640203/2147483647/strip/true/crop/4896x2754+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F1f%2Fb17353394048ad7dfd58e856f48a%2Fap25015706056455.jpg"
    },
    {
      "author": "MELANIE LIDMAN, SAM MEDNICK, WAFAA SHURAFA",
      "description": "The ceasefire announced between Israel and Hamas gives hope to families of hostages and war-weary Palestinians — but their nightmare is far from over. Families of the hostages do not know whether their loved ones are alive or dead, and many will have to wait for a subsequent phase of the agreement that has yet to be negotiated. In war-ravaged Gaza, many displaced Palestinians do not know if their homes are still standing. Thousands are still buried under rubble and dozens are missing after encounters with Israeli forces. Vast areas appear uninhabitable, and it could take decades to rebuild. In the tense leadup to the announcement of the deal, relatives of the hostages were afraid to get their hopes up and agonizing over the unknown.",
      "publishedAt": "2025-01-15T14:55:38Z",
      "title": "Families in Israel and Gaza awaited truce in agony",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-displaced-waiting-5a4fde9e5527b682dccb6466cb48ce83",
      "urlToImage": "https://dims.apnews.com/dims4/default/d258437/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F79%2F54ddd25e1ac4a32f6fe5c66fa723%2F4d3c837f50a74ea683919171a231b313"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "The United Nations says it’s ready to ramp up the delivery of desperately needed humanitarian aid to Gaza after a ceasefire agreement and urged the removal of major security and political obstacles so it can reach all those in need. U.N. Secretary-General Antonio Guterres called Wednesday's announcement of a deal to pause the fighting “a critical first step.” He told reporters that the U.N.’s top priority must be to ease the tremendous suffering caused by the conflict triggered by Hamas’ Oct. 7, 2023, attacks in southern Israel. U.N. humanitarian chief Tom Fletcher said aid agencies have been mobilizing supplies in preparation for a ceasefire.",
      "publishedAt": "2025-01-16T01:33:02Z",
      "title": "UN says it's ready to ramp up delivery of desperately needed aid to Gaza",
      "url": "https://apnews.com/article/un-gaza-ceasefire-humanitarian-aid-palestinians-israel-cfb07cfde1e4f3c2f62537a12d2eb5a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a30bb2/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2Ff3%2F377f8a076d97cbf2aaca3512f2c7%2Feb97bc961b2e4722bd0117497b385ee6"
    },
    {
      "author": "RYAN PEARSON",
      "description": "He left his Los Angeles-area home to cover the wildfires, but the flames were barreling toward his front door. A Los Angeles-based entertainment video editor for The Associated Press, Ryan Pearson's home was among the thousands that burned in the California wildfires last week.",
      "publishedAt": "2025-01-16T05:10:43Z",
      "title": "He left his LA-area home to cover the wildfires. But the flames were barreling toward his front door",
      "url": "https://apnews.com/article/california-wildfires-house-burn-loss-bde3a056407fcd639fbf7cfdeb26ab8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ea00e9/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2Fee%2Ff5706d7fcd25591750238e04f270%2Fa4110e05b73646979a8f978d66ca6ffa"
    },
    {
      "author": "ANDREW DEMILLO",
      "description": "Efforts to ban students' cellphones at school is gaining rare bipartisan consensus in Republican and Democrat-led states. At least eight states have enacted such bans in recent years and proposals are being considered in several more states this year. The push for restrictions on cellphones at schools is being fueled by concerns about the impact screen time is having on children's mental health and the distraction they're posing in the classroom. But the bans are facing pushback from some parents and students who say the devices are needed to communicate in case of an emergency.",
      "publishedAt": "2025-01-16T06:06:41Z",
      "title": "Banning cellphones in schools gains popularity in red and blue states",
      "url": "https://apnews.com/article/school-cell-phone-bans-states-e6d1fe8ddfde33f086d5cd2a19f4c148",
      "urlToImage": "https://dims.apnews.com/dims4/default/ab4d2f1/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2Fb6%2F12b9cbb5556a132e46ac64a3d848%2F1b17b908fdc241c187a23d2c035dc9ae"
    },
    {
      "author": "MARCIA DUNN",
      "description": "Blue Origin has launched its massive new rocket on its first test flight. Thursday’s liftoff from Florida carried an experiment meant to orbit thousands of miles above Earth. The 320-foot New Glenn rocket is designed to haul spacecraft and eventually astronauts to orbit and also the moon. Founded 25 years ago by Amazon founder Jeff Bezos, Blue Origin has been launching customers to the edge of space since 2021. The short hops from Texas use smaller rockets named after the first American in space, Alan Shepard. New Glenn is named after the",
      "publishedAt": "2025-01-16T07:04:50Z",
      "title": "Jeff Bezos’ Blue Origin launches massive New Glenn rocket on first test flight",
      "url": "https://apnews.com/article/blue-origin-new-glenn-rocket-jeff-bezos-2466fb0e114a09d88a46f71a1e647d50",
      "urlToImage": "https://dims.apnews.com/dims4/default/bcc61f9/2147483647/strip/true/crop/5234x2944+0+273/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F12%2Fa893947c27886d27c80154ccb460%2F6c4371c4283746b5bbc3bbd576aaa789"
    },
    {
      "author": "CHRIS MEGERIAN, ZEKE MILLER, COLLEEN LONG",
      "description": "President Joe Biden has used his farewell address to the nation to warn of an “oligarchy” of the ultra-wealthy taking root in the country and of a “tech-industrial complex” that is infringing on Americans’ rights and the future of democracy. Speaking Wednesday from the Oval Office as he prepares to hand over power to President-elect Donald Trump, Biden sounded alarm over the accumulation of power and wealth among a small few. Biden also called for a constitutional amendment to end immunity for sitting presidents, after the Supreme Court granted Trump sweeping protections last year from criminal liability over his role in trying to undermine his 2020 defeat to Biden.",
      "publishedAt": "2025-01-15T21:01:37Z",
      "title": "Biden farewell address: Watch live speech from Oval Office",
      "url": "https://apnews.com/article/joe-biden-farewell-address-oval-office-8bc6051c20adc1bc212cdd8be2578624",
      "urlToImage": "https://dims.apnews.com/dims4/default/3be01fc/2147483647/strip/true/crop/4199x2362+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2Feb%2Fe5a5fdbed64f8ceef386e5db42ce%2F331f9b7de52841329f6f39462022f4f2"
    },
    {
      "author": "LISA MASCARO",
      "description": "One by one, President-elect Donald Trump's hoped-for Cabinet is falling into place. Defense Secretary pick Pete Hegseth was back on track after a fiery Senate confirmation hearing that probed his drinking, allegations of sexual assault and qualifications to lead the U.S. military. And Trump’s other nominees pushed Wednesday through a gauntlet of confirmation hearings. Sen. John Barrasso of Wyoming predicted the Senate will begin start voting on Inauguration Day, Jan. 20, to confirm some of Trump’s picks. But Trump’s more controversial choices of Kash Patel, Tulsi Gabbard and Robert F. Kennedy, Jr., have yet to come before senators and face more uncertainty ahead.",
      "publishedAt": "2025-01-15T22:47:27Z",
      "title": "Trump's outsider Cabinet picks are rapidly gaining support",
      "url": "https://apnews.com/article/trump-cabinet-confirmation-hearings-e12dcbc5d26d675414331d9a35cab6a6",
      "urlToImage": "https://dims.apnews.com/dims4/default/a4ea777/2147483647/strip/true/crop/4114x2314+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2Fdb%2F33e850a4c95c58bbcdde47e54b2b%2Fada267207cc14c109609926d5e26d826"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}