{
  "articles": [
    {
      "author": "ZEKE MILLER, STEVE PEOPLES, DARLENE SUPERVILLE and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — President Joe Biden forcefully tried on Friday to quell Democratic anxieties over his unsteady showing in his debate with former President Donald Trump, as elected members of his party closed ranks around him in an effort to shut down talk of replacing him atop the ticket.",
      "publishedAt": "2024-06-28T15:28:07Z",
      "title": "Biden concedes debate fumbles but declares he will defend democracy. Dems stick by him -- for now.",
      "url": "https://apnews.com/b93d7ffaad75fd423ea3953fe16287f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c3baee31bae43c09fe6d94315d14d4b/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden's halting debate performance has led some in his own party to begin questioning whether he should be replaced on the ballot before November.",
      "publishedAt": "2024-06-28T04:58:33Z",
      "title": "Here's why it would be tough for Democrats to replace Joe Biden on the presidential ticket",
      "url": "https://apnews.com/7aa836b0ae642a68eec86cc0bebd3772",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4d0a13cc21046849fb97c2e2b24fe10/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Friday made it harder to charge Capitol riot defendants with obstruction, a charge used in hundreds of prosecutions and also faced by former President Donald Trump.",
      "publishedAt": "2024-06-28T14:48:31Z",
      "title": "Supreme Court makes it harder to charge Capitol riot defendants with obstruction, charge Trump faces",
      "url": "https://apnews.com/2cdba47baa5cea8177d651de751760a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e3c481b59374f29884c42fdbda498ee/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Friday upended a 40-year-old decision that made it easier for the federal government to regulate the environment, public health, workplace safety and consumer protections, delivering a far-reaching and potentially lucrative victory to business interests.",
      "publishedAt": "2024-06-28T14:24:58Z",
      "title": "The Supreme Court weakens federal regulators, overturning decades-old Chevron decision",
      "url": "https://apnews.com/5173bc83d3961a7aaabe415ceaf8d665",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28e6b41976cf49d89f356914c289d771/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court cleared the way for cities to enforce bans on homeless people sleeping outside in public places on Friday, overturning a California appeals court ruling that found such laws amount to cruel and unusual punishment when shelter space is lacking.",
      "publishedAt": "2024-06-28T14:06:46Z",
      "title": "Supreme Court allows cities to enforce bans on homeless people sleeping outside",
      "url": "https://apnews.com/506ac68dc069e3bf456c10fcedfa6bee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51db8aaf61e1491a807201691a4a7384/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO",
      "description": "AUSTIN, Texas (AP) — The police chief for schools in Uvalde, Texas, failed to identify an active shooting, did not follow his training and made critical decisions that slowed the law enforcement response to stop a gunman who was “hunting” victims and ultimately killed 21 people at Robb Elementary, according to an indictment unsealed Friday.",
      "publishedAt": "2024-06-28T15:10:08Z",
      "title": "Indictment accuses former Uvalde schools police chief of delays while shooter was 'hunting' children",
      "url": "https://apnews.com/7be185f9a43cf3b88069e33103fd8983",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b21607d205d8498cb9eb9891f0e18178/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Prosecutors rested on Friday after presenting evidence for seven weeks at the bribery trial of Sen. Bob Menendez, enabling the Democrat and two New Jersey businessmen to begin calling their own witnesses next week to support defense claims that no crimes were committed and no bribes were paid.",
      "publishedAt": "2024-06-28T17:27:43Z",
      "title": "Prosecutors rest in seventh week of Sen. Bob Menendez's bribery trial",
      "url": "https://apnews.com/505c90e0014b7b87f591e65d78d4a809",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f9efd779fc2413682a8d7404f8199d6/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO and ANDREW DeMILLO",
      "description": "AUSTIN, Texas (AP) — The Texas Supreme Court upheld the state’s ban on gender-affirming care for transgender youths Friday, rejecting pleas from parents that it violates their right to seek medical care for their children.",
      "publishedAt": "2024-06-28T15:06:29Z",
      "title": "Texas Supreme Court upholds ban on gender-affirming care for transgender youths",
      "url": "https://apnews.com/6386fcdff6c62818812655e79990735b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1afe689311ad4582bd858453404e3487/1600.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — The Iowa Supreme Court said Friday the state’s strict abortion law is legal, telling a lower court to dissolve a temporary block on the law and allowing Iowa to ban most abortions after about six weeks of pregnancy — before many women know they are pregnant.",
      "publishedAt": "2024-06-28T04:12:25Z",
      "title": "Iowa’s Supreme Court tells lower court to let strict abortion law go into effect",
      "url": "https://apnews.com/6eb5d7a15748ae532d4cdcdf471d9e1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a8d1e102b924b6bb9913af35009e048/3000.jpeg"
    },
    {
      "author": "JAKE COYLE and LINDSEY BAHR",
      "description": "The movie year, jumbled a bit by 2023’s strikes, might feel like it’s only just getting going. The box office is, finally, booming thanks to “Inside Out 2.” But at the year’s midway point, a lot of terrific movies have already come out – more, maybe, than you might realize.",
      "publishedAt": "2024-06-28T15:45:00Z",
      "title": "AP picks 2024's best movies so far, from 'Furiosa' to 'Thelma,' 'I Saw the TV Glow' to 'Challengers'",
      "url": "https://apnews.com/2982d41f744ea3081ab7d0463f63a1cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ddde6922c07443a887b87ecc2f6ae99/2574.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}