{
  "articles": [
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The federal government is heading toward a shutdown that will disrupt many services, squeeze workers and roil politics as Republicans in the House, fueled by hard-right demands for deep cuts, force a confrontation over federal spending.",
      "publishedAt": "2023-09-23T04:31:47Z",
      "title": "The federal government is headed into a shutdown. What does it mean, who's hit and what's next?",
      "url": "https://apnews.com/f1b06964cf549b09977677e5f70bf9ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/651572dbee60409781592ab59700c7df/3000.jpeg"
    },
    {
      "author": "JOSH BOAK, STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — The White House on Friday directed federal agencies to get ready for a shutdown after House Republicans left town for the weekend with no viable plan to keep the government funded and avert politically and economically costly disruption of federal services.",
      "publishedAt": "2023-09-22T17:03:58Z",
      "title": "White House preparing for government shutdown as House Republicans lack a viable endgame for funding",
      "url": "https://apnews.com/637d4209f1a7ab786459f3a0bbd60296",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77582b41bcb64adc8849b5a293b30fce/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Why Yevgeny Prigozhin's private jet plummeted into a field northwest of Moscow is still a mystery. The Russian military leaders he tried to oust with his armed rebellion remain in power. His mercenary army is under new management.",
      "publishedAt": "2023-09-23T04:05:21Z",
      "title": "A month after Prigozhin’s suspicious death, the Kremlin is silent on his plane crash and legacy",
      "url": "https://apnews.com/03a8797d0c923d3db3f1dd8f604e9a38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37ec7977c4d341c1bbdbb7782f48f146/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — In late 2020, Sen. Bob Menendez met with Philip Sellinger, a private practice lawyer and former fundraiser for the senator, to assess his potential fit as the next U.S. Attorney for the state of New Jersey — and to discuss one case in particular.",
      "publishedAt": "2023-09-23T04:40:25Z",
      "title": "Bribery case against Sen. Menendez shines light on powerful NJ developer accused of corruption",
      "url": "https://apnews.com/b533417693a82f83865ce9df26253708",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a76a36971104fbab68396ace3d9b58c/2819.jpeg"
    },
    {
      "author": "SARAH BRUMFIELD and BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — Tropical Storm Ophelia made landfall on the North Carolina coast early Saturday, lashing coastal areas with damaging winds and dangerous surges of water, the U.S. National Hurricane Center said.",
      "publishedAt": "2023-09-23T05:30:10Z",
      "title": "Tropical Storm Ophelia makes landfall in North Carolina as coastal areas lashed with heavy rain",
      "url": "https://apnews.com/f6c9d5e3a9a5b0258543cc92b609c12e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1a582487caa4731890d91ea71610155/1920.jpeg"
    },
    {
      "author": "JAMEY KEATEN, MATTHEW LEE and VANESSA GERA",
      "description": "WARSAW, Poland (AP) — Once rock-solid, the support that Ukraine has gotten from its biggest backers for its fight against Russia is showing cracks. Political posturing in places like Poland and Slovakia, where a trade dispute with Ukraine has stirred tensions, and Republican reticence in the United States about Washington’s big spending to prop up Ukraine’s military have raised new uncertainties about the West’s commitment to its efforts to expel Russian invaders more than 18 months into the war.",
      "publishedAt": "2023-09-23T04:02:55Z",
      "title": "Cracks in Western wall of support for Ukraine emerge as Eastern Europe and US head toward elections",
      "url": "https://apnews.com/2870e5e7652ea673c9d8fb352d123471",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f8af3e5fc794f8dafc8e40390e48fe7/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and ELLIOT SPAGAT",
      "description": "MEXICO CITY (AP) — From a White House podium in May, U.S. Homeland Security Secretary Alejandro Mayorkas outlined new legal pathways to the United States for Venezuelans and others, along with a “very clear” message for those come illegally.",
      "publishedAt": "2023-09-23T05:06:03Z",
      "title": "With temporary status for Venezuelans, the Biden administration turns to a familiar tool",
      "url": "https://apnews.com/2fa052ceacb020b861bb82332912bc92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f341183c843c4a048da17e26218268a3/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — As a state representative running a longshot campaign for South Carolina governor, Nikki Haley would often explain her opposition to abortion with a story about her family.“I’m strongly pro-life, very pro-life, and not because my party tells me to be, but my husband was adopted, and so every day I know the blessings of having him there,” she said in 2010.",
      "publishedAt": "2023-09-23T04:07:57Z",
      "title": "Nikki Haley's approach to abortion is rooted in her earliest days in South Carolina politics",
      "url": "https://apnews.com/1827870a52349f3ee2f0c2b50e110b3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02dc2ffa24614480b0f962e3dfd8340d/3000.jpeg"
    },
    {
      "author": "DAVID HAMILTON",
      "description": "For Lachlan Murdoch, this moment has been a long time coming. Assuming, of course, that his moment has actually arrived.On Thursday, his father Rupert Murdoch announced that in November he'll step down as the head of his two media companies: News Corp.",
      "publishedAt": "2023-09-23T04:03:12Z",
      "title": "Meet Lachlan Murdoch, soon to be the new power behind Fox News and the Murdoch empire",
      "url": "https://apnews.com/a5100d8bd20f72efe5a83eec32823f1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dfb00e58d5248fda58d1b51eeaa592f/2100.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Ronald Acuña Jr. joined baseball’s exclusive 40-40 club Friday night by hitting his 40th home run of the season for the Atlanta Braves to go along with his 68 stolen bases.“I am extremely happy,” Acuña said through a translator after Atlanta's 9-6 victory over the Washington Nationals. “Honestly, rounding the bases, I don’t know if I was more nervous or excited.\"",
      "publishedAt": "2023-09-22T23:42:20Z",
      "title": "Ronald Acuña Jr. joins exclusive 40-40 club with 40th home run of the season for Braves",
      "url": "https://apnews.com/4e119caab248a549056f471716f01ab8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ad26c2a765b4c20b8d5781bc147f43d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}