{
  "articles": [
    {
      "author": "WILL WEISSERT and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Kamala Harris said Wednesday that she disagrees “with any criticism of people based on who they vote for,” reacting after President Joe Biden's reference to Donald Trump's supporters and “garbage.”",
      "publishedAt": "2024-10-30T14:26:29Z",
      "title": "Harris promises to 'represent all Americans' after Biden's remark on Trump supporters and 'garbage'",
      "url": "https://apnews.com/3d2ea66e3027ddc4bc2b30c13bf7b554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe343534a4cf4465b5c181ca71b74e5e/3000.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS",
      "description": "Donald Trump and Kamala Harris will crisscross several swing states on Wednesday, passing each other in Wisconsin, where the former president is scheduled to appear in Green Bay with a onetime local icon, retired NFL quarterback Brett Favre.",
      "publishedAt": "2024-10-30T11:26:43Z",
      "title": "Trump will campaign in Wisconsin with Brett Favre, who's linked to a Mississippi welfare scandal",
      "url": "https://apnews.com/ebc6e53c292588ef218915eadc0b4ba4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa27c51d6c024def9a5ce1e0b273cf07/2085.jpeg"
    },
    {
      "author": "BASSEM MROUE, JULIA FRANKEL and SAMY MAGDY",
      "description": "BEIRUT (AP) — The United States and other mediators are ramping up efforts to halt the wars in Lebanon and the Gaza Strip, circulating new proposals to wind down the regional conflict during the Biden administration’s final months.",
      "publishedAt": "2024-10-30T14:01:57Z",
      "title": "A new push to wind down the Middle East wars faces familiar challenges",
      "url": "https://apnews.com/4fdcf546eb73faf26717b76b4bb3a919",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84a691ddc3c241cf91c03040e35ceccf/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — The U.S. economy grew at a healthy 2.8% annual rate from July through September, with consumers helping drive growth despite the weight of still-high interest rates.Wednesday’s report from the Commerce Department said the gross domestic product — the economy’s total output of goods and services — did slow slightly from its 3% growth rate in the April-June quarter.",
      "publishedAt": "2024-10-30T04:01:18Z",
      "title": "US economy grew at a solid 2.8% pace last quarter on strength of consumer spending",
      "url": "https://apnews.com/6a3fbfb5790b07434d656a95865b7435",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56ce4c44724e42d9b14a8097bd23d7d5/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court's conservative majority on Wednesday allowed Virginia to resume its purge of voter registrations that the state says is aimed at stopping people who are not U.S.",
      "publishedAt": "2024-10-30T14:04:35Z",
      "title": "Supreme Court's conservative justices allow Virginia to resume its purge of voter registrations",
      "url": "https://apnews.com/ba3d785d9d2d169d9c02207a42893757",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ece78a6ee8741b3b29ac285718373fe/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "DULUTH, Ga. (AP) — No scene has dominated U.S. politics since 2015 quite like Donald Trump on stage, waxing on for an hour-plus in front of a chorus of red “Make America Great Again” hats.",
      "publishedAt": "2024-10-30T04:16:33Z",
      "title": "Inside 'the weave': How Donald Trump's rhetoric has grown darker and windier",
      "url": "https://apnews.com/a4ac05f3c67c80e8536c7ebe0e664866",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4115ae312e32413bba69ac8fa2cd5999/2806.jpeg"
    },
    {
      "author": "JOSEPH WILSON and TERESA MEDRANO",
      "description": "BARCELONA, Spain (AP) — Flash floods in Spain swept away cars, turned village streets into rivers, disrupted rail lines and highways and killed at least 72 people in the worst natural disaster to hit the European nation in recent memory.",
      "publishedAt": "2024-10-30T08:03:44Z",
      "title": "At least 72 people die in devastating flash floods in eastern Spain",
      "url": "https://apnews.com/ef0dffabe1a106a05c239dca4dfec1ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3eb992d9c3174c229030b59489ee7788/1920.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — Prosecutors plan to argue that a Massachusetts Air National Guard member who pleaded guilty to leaking highly classified military documents about the war in Ukraine should serve nearly 17 years in prison.",
      "publishedAt": "2024-10-30T15:22:46Z",
      "title": "Prosecutors seek a 17-year prison term for Pentagon secrets leaker Jack Teixeira",
      "url": "https://apnews.com/7e62523340c7c081491943353f44d36d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8e648fdd3b944ca9aa4098334967398/2556.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — Scientists have discovered the oldest-known fossil of a giant tadpole that wriggled around over 160 million years ago.",
      "publishedAt": "2024-10-30T16:00:54Z",
      "title": "This ancient tadpole fossil is the oldest ever discovered",
      "url": "https://apnews.com/e59f5b95d2e35ff6d66b3bd2c4304ed4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d335269da64b4f13997bbceeee1a668b/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "BILLINGS, Mont. (AP) — America's golden eagles face a rising threat from a black market for their feathers used in Native American powwows and other ceremonies, according to wildlife officials, researchers and tribal members.",
      "publishedAt": "2024-10-30T04:03:16Z",
      "title": "Poachers are exploiting the high demand for eagle feathers that are sacred among Native Americans",
      "url": "https://apnews.com/4994822dc54da0b3b94a1a2e2c286768",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9b6be373474457f8816ba2ff43b62d2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}