{
  "articles": [
    {
      "author": "MENELAOS HADJICOSTIS",
      "description": "LARNACA, Cyprus (AP) — A ship bearing humanitarian aid was making preparations to leave Cyprus and head for Gaza, the European Commission president said Friday as international donors launched a sea corridor to supply the besieged territory that is facing widespread hunger after five months of war.",
      "publishedAt": "2024-03-08T08:01:57Z",
      "title": "A ship with Gaza aid is preparing to inaugurate a sea route from Cyprus to the war-ravaged strip",
      "url": "https://apnews.com/196b1e1bdef8ce28449799759c797d39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0229be12972e429aa83d65135509db66/1920.jpeg"
    },
    {
      "author": "JACK JEFFERY",
      "description": "JERUSALEM (AP) — On the eve of the Muslim fasting month of Ramadan, Jerusalem’s Old City bears few of its usual hallmarks of festivity.Nearly half of the grotto-shaped gift shops are sealed behind metal shutters.",
      "publishedAt": "2024-03-09T15:42:41Z",
      "title": "On eve of Ramadan, Jerusalem’s Old City offers little festivity as Gaza war rages",
      "url": "https://apnews.com/cf7294094882fc11f0c599e6dad0886a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/058409633b0a432a8424b20250cf472e/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Eleven-year-old Domonic Davis was not far from his mom's Cincinnati home when a hail of gunfire sprayed out from a passing car. Nearly two dozen rounds hurtled through the night at a group of children in the blink of an eye.",
      "publishedAt": "2024-03-09T12:49:29Z",
      "title": "A surge of illegal homemade machine guns has helped fuel gun violence in the US",
      "url": "https://apnews.com/ddc2e9b6602ee1eb62e75732bbd54784",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f44da44d2c54c81811d55476bc293f1/1920.jpeg"
    },
    {
      "author": "BILL BARROW and JEFF AMY",
      "description": "ATLANTA (AP) — The 2024 presidential election campaign will pick up Saturday where the 2020 contest left off. Or, more precisely, in a place where it never actually ended.",
      "publishedAt": "2024-03-09T05:00:47Z",
      "title": "The Biden-Trump rematch comes into view with dueling visits to Georgia",
      "url": "https://apnews.com/5ae87db6c20f95eae55d7f3c603144e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7b78856c6bc4f629b392a4a164e64a8/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and KATIE MARIE DAVIES",
      "description": "TALLINN, Estonia (AP) — Russian President Vladimir Putin is expected to secure his fifth term in power this month on the heels of opposition leader Alexei Navalny's death in prison, which devastated Kremlin critics and spurred concerns about the safety of other imprisoned dissidents.",
      "publishedAt": "2024-03-09T05:57:09Z",
      "title": "Who are the Russian dissidents still serving time after Alexei Navalny died behind bars?",
      "url": "https://apnews.com/f4a70f0275e41748a39630a6c9ae3aa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6e50624b52844b39f848b857634752a/1920.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM and KIMBERLEE KRUESI",
      "description": "CHARLESTON, W.Va. (AP) — Democrat Kayla Young and Republican Patricia Rucker frequently clash on abortion rights and just about everything else in West Virginia's Legislature, but they agree on one thing: Too few of their colleagues are women, and it's hurting the state.",
      "publishedAt": "2024-03-09T05:12:49Z",
      "title": "Female representation remains low in US statehouses, particularly Democrats in the South",
      "url": "https://apnews.com/08affa16ae0a26049745ae8e05b324c1",
      "urlToImage": ""
    },
    {
      "author": "MICHAEL KEALY and BRIAN MELLEY",
      "description": "DUBLIN (AP) — Irish Prime Minister Leo Varadkar conceded defeat Saturday as two constitutional amendments he supported that would have broadened the definition of family and removed language about a woman’s role at home were headed toward rejection in early vote tallies.",
      "publishedAt": "2024-03-09T15:44:25Z",
      "title": "Irish prime minister concedes defeat in vote over constitutional amendments about family and women",
      "url": "https://apnews.com/8eead7fd4ee13e76d77e8322bf348d0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dce5819dfc2442f3a42b51e361aca1b8/3000.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "TUBA CITY, Ariz. (AP) — Melissa Blackhair is not eager to spring forward Sunday. “I’m dreading it. I just don’t want to see how much we have to adjust,\" Blackhair said while sitting in her home office in Tuba City on the Navajo Nation, the only area in Arizona that follows daylight saving time.",
      "publishedAt": "2024-03-09T05:05:04Z",
      "title": "The US is springing forward to daylight saving. For Navajo and Hopi tribes, it's a time of confusion",
      "url": "https://apnews.com/a1016ce873b772ffae544de9fbcd29d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2776aebe35449888a994ae4527f493b/3000.jpeg"
    },
    {
      "author": "TOM ODULA",
      "description": "NAIROBI, Kenya (AP) — Njeri Migwi’s phone buzzes incessantly. Phone calls and messages keep coming in from women seeking help to escape life-threatening situations. A mother and her remaining child are looking for a place to stay after her partner allegedly raped and killed her two other children, including a 6-month old.",
      "publishedAt": "2024-03-09T05:24:49Z",
      "title": "Kenyan activists are on a mission to end gender-based violence as attacks on women surge",
      "url": "https://apnews.com/2c54cc83e369083437bee15404627a22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03d879028b3e4a7089f3bb611ea4dd82/3000.jpeg"
    },
    {
      "author": "TOM MURPHY",
      "description": "Lou Gehrig’s disease took away Grace Armant’s ability to speak, but the 84-year-old still has plenty to say about her insurance.UnitedHealthcare has rejected several requests from her doctors for coverage of a machine Armant needs to breathe as she deals with the fatal illness.",
      "publishedAt": "2024-03-09T13:01:43Z",
      "title": "Insurer delays and denials hamper patients seeking at-home breathing machines",
      "url": "https://apnews.com/fa9c90c675a8755dcf30ebde824268e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/772a962771324d5f8f1d44e587b1769d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}