{
  "articles": [
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — The Middle East was bracing for a potential flare-up in violence on Sunday after Israeli authorities said a rocket from Lebanon struck a soccer field in the Israeli-controlled Golan Heights, killing 12 children and teens in what the military said was the deadliest attack on civilians since Oct.",
      "publishedAt": "2024-07-28T09:54:36Z",
      "title": "A strike from Lebanon killed 12 youths. Could that spark war between Israel and Hezbollah?",
      "url": "https://apnews.com/e9430da6eefada8e2f833f5f914190aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e1256eed2de4d6dbb32175ece24d24d/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAM METZ",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes hit a school used by displaced Palestinians in central Gaza on Saturday, killing at least 30 people including several children, as the country’s negotiators prepared to meet international mediators about a proposed cease-fire.",
      "publishedAt": "2024-07-27T07:11:58Z",
      "title": "An Israeli airstrike hits a school sheltering people in Gaza, killing at least 30 including children",
      "url": "https://apnews.com/c95e8effebd9d4e4ba7e69bfbae61e04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fc37b1ca64246d49382c97217486fe9/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris' campaign has raised $200 million since she emerged as the likely Democratic presidential nominee last week, an eyepopping haul in her race against the Republican nominee, former President Donald Trump.",
      "publishedAt": "2024-07-28T09:02:00Z",
      "title": "Harris raised $200M in first week of White House campaign and signed up 170,000 volunteers",
      "url": "https://apnews.com/5db5d7c5001c87377e4ba11250fff597",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca2f138bb1904265888b88de73ab395b/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and ALI SWENSON",
      "description": "ST. CLOUD, Minn. (AP) — As the presidential campaign enters a critical final 100 day stretch, Republican nominee Donald Trump and his running mate, JD Vance, rallied supporters on Saturday in a state that hasn’t backed a GOP candidate for the White House since 1972.",
      "publishedAt": "2024-07-27T04:04:41Z",
      "title": "Trump and Vance team up to campaign in Minnesota, a state that hasn't backed the GOP in 52 years",
      "url": "https://apnews.com/22aee6ecb821032328c1e3d210b27733",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/192b13338f914822920790ba4456242c/3000.jpeg"
    },
    {
      "author": "NIC COURY, EUGENE GARCIA and OLGA R. RODRIGUEZ",
      "description": "FOREST RANCH, Calif. (AP) — Thousands of firefighters battling a wildfire in Northern California received some help from the weather hours after it exploded in size, scorching an area greater than the size of Los Angeles.",
      "publishedAt": "2024-07-28T04:01:48Z",
      "title": "Firefighters helped by cooler weather battle blaze that has scorched area larger than Los Angeles",
      "url": "https://apnews.com/5f4325a97727eb2fbd3d59ab8ec6b877",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be27656fd5524ee0bc99e1b3ae36fe21/3000.jpeg"
    },
    {
      "author": "DAKE KANG",
      "description": "BEIJING (AP) — Lawmakers from at least six countries say Chinese diplomats are pressuring them not to attend a China-focused summit in Taiwan, in what they describe as efforts to isolate the self-governed island.",
      "publishedAt": "2024-07-28T06:20:52Z",
      "title": "Lawmakers from 6 countries say Beijing is pressuring them not to attend summit in Taiwan",
      "url": "https://apnews.com/a4dc59a25bce5315f8446587bab0d652",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d877672f18f4d22a94149b3577a3cc3/3000.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — At least 12 people were killed after a mudslide hit a homestay house in a tourist area in southeastern China on Sunday as heavy rains from what remained of a tropical storm drenched the region, state media said.",
      "publishedAt": "2024-07-28T04:19:10Z",
      "title": "At least 12 killed by mudslide in China as heavy rains from tropical storm Gaemi drench region",
      "url": "https://apnews.com/3fdd5c362596193f3c7b1cabad3bce56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85e83c8caef94b8ea36b9c3f425447d6/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Polls have opened in Venezuela, where people are voting Sunday in a presidential election whose outcome will either lead to a seismic shift in politics or extend by six more years the policies that caused the world’s worst peacetime economic collapse.",
      "publishedAt": "2024-07-28T04:03:03Z",
      "title": "Venezuelan election could lead to seismic shift in politics or give President Maduro six more years",
      "url": "https://apnews.com/5ce255ae90614162590bfe1207d2e1d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/126588dfb9df4963afc6ffdffe07f04f/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — Simone Biles didn't let some leg discomfort slow her down.The American gymnastics superstar posted an all-around total of 59.566 during Olympic qualifying on Sunday inside a packed and star-studded Bercy Arena despite complaining of a left calf injury that had her limping.",
      "publishedAt": "2024-07-28T09:40:03Z",
      "title": "Simone Biles shakes off leg injury to dominate during Olympic gymnastics qualifying",
      "url": "https://apnews.com/590bfce552aef32cb12fb0e3bb64ecd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/227190123e304f299af0c65023b8ba1d/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — A 2024 Olympics pre-race triathlon event planned for Paris' Seine River was canceled Sunday as concerns persist over water quality.",
      "publishedAt": "2024-07-28T07:45:53Z",
      "title": "Olympics pre-race triathlon event in Seine River canceled over water quality concerns",
      "url": "https://apnews.com/34d1ddb3a49b7c45a4dbadc4a1b43a68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a007950bf0bd47c1abfc2469c04fa074/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}