{
  "articles": [
    {
      "author": "COLLEEN LONG, ZEKE MILLER and THOMAS BEAUMONT",
      "description": "WASHINGTON (AP) — President Joe Biden's family used a Sunday gathering at Camp David to urge him to stay in the race and keep fighting despite his dreadful debate performance, and some members criticized how his staff prepared him for the faceoff, according to four people familiar with the discussions.",
      "publishedAt": "2024-06-30T17:33:49Z",
      "title": "Gathered at Camp David, Biden's family tells him to stay in the race and keep fighting",
      "url": "https://apnews.com/01bd3586a2f2da9217a04d031ddd7934",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b118780888d9487db547ac5d94f1b72c/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER and BARBARA SURK",
      "description": "PARIS (AP) — France's National Rally surged into the lead in the first round of legislative elections, according to results released early Monday, bringing the far-right party to the brink of power and dealing a major blow to President Emmanuel Macron’s centrists in an election that could set the country, and Europe, on a starkly different course.",
      "publishedAt": "2024-07-01T09:51:08Z",
      "title": "French far right leads after legislative elections' 1st round but rivals hope to deny it a majority",
      "url": "https://apnews.com/d03ea9af865b1f1f4ee6044194a305fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/687aad457e854431a9ccd893b3a826a1/1920.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Alfred Handley leaned back in his wheelchair alongside a major Phoenix freeway as a street medicine team helped him get rehydrated with an intravenous saline solution dripping from a bag hanging on a pole.",
      "publishedAt": "2024-07-01T04:11:36Z",
      "title": "Street medicine teams search for homeless people to deliver lifesaving IV hydration in extreme heat",
      "url": "https://apnews.com/c57bbafdc936a36248be593df9036f13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41f722727b114e50be47dcbaa4d375d5/3000.jpeg"
    },
    {
      "author": null,
      "description": "ARLINGTON, Va. (AP) — Boeing announced plans to acquire key supplier Spirit AeroSystems for $4.7 billion, a move that it says will improve plane quality and safety amid increasing scrutiny by Congress, airlines and the Department of Justice.",
      "publishedAt": "2024-07-01T05:07:28Z",
      "title": "Under pressure on plane safety, Boeing is buying stressed supplier Spirit for $4.7 billion",
      "url": "https://apnews.com/c6956d6f22355c95aa39a79eb384ff41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fc8fd73cfef43aa91f02e30533c35c8/2212.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — European Union regulators accused social media company Meta Platforms on Monday of breaching the bloc's new digital competition rulebook by forcing Facebook and Instagram users to choose between seeing ads or paying to avoid them.",
      "publishedAt": "2024-07-01T10:03:13Z",
      "title": "European Union accuses Facebook owner Meta of breaking digital rules with paid ad-free option",
      "url": "https://apnews.com/c0019ea93e7b8b8205fab27d071d15d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9796f4d4db724a3ca06df43f413b7182/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — It’s hard to refer to someone as “Hitler” and end up in their good graces, let alone potentially become the person they choose to help lead the country. But Ohio Sen. JD Vance’s shifting position on Donald Trump over the years from one-time critic of the former president to staunch ally is a metamorphosis shared by many of Trump’s potential running mates.",
      "publishedAt": "2024-07-01T04:06:47Z",
      "title": "The Republicans who want to be Trump's VP were once harsh critics with key policy differences",
      "url": "https://apnews.com/11ec39b0da11152ad110ff987d4eaeee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f95d9a5e00c41cc9472367dfbca3e82/1920.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — French voters face a decisive choice on July 7 in the runoff of snap parliamentary elections that could see the country’s first far-right government since the World War II Nazi occupation — or no majority emerging at all.",
      "publishedAt": "2024-06-30T22:24:33Z",
      "title": "French far right ahead in 1st round of snap elections. Here's how runoff works and what comes next",
      "url": "https://apnews.com/193233ade08821a71731980d8a17eb4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d5a6d164bc64aa4a3b65f93da02099c/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Longtime Trump ally Steve Bannon is scheduled to report to a federal prison in Connecticut on Monday to serve a four-month sentence on contempt charges for defying a subpoena in the congressional investigation into the U.S.",
      "publishedAt": "2024-07-01T04:14:48Z",
      "title": "Trump ally Steve Bannon will report to federal prison to serve 4-month sentence on contempt charges",
      "url": "https://apnews.com/77353a10250c36f77b2c1b7d188c5250",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7c2a860164244e89efae654f56366a3/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY and PAOLA FLORES",
      "description": "LA PAZ, Bolivia (AP) — Signs reading “I'm buying dollars” line the doors of Víctor Vargas’ shoe shop in the heart of Bolivia’s biggest city, a desperate attempt to keep his family business alive.Just a few years ago, the 45-year-old Vargas would unlock the doors at 8 a.m.",
      "publishedAt": "2024-07-01T05:14:47Z",
      "title": "Economic turmoil in Bolivia fuels distrust in government and its claim of a 'failed coup'",
      "url": "https://apnews.com/cdb4672eb26c68d130df924fa2913403",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f884ed87c8240399a3cc18ce500c344/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "HARTLEPOOL, England (AP) — A lot of politicians have promised change to voters in Hartlepool, a wind-whipped port town in northeast England. For decades, Labour Party representatives said they would fight for working people, even as well-paid industrial jobs disappeared.",
      "publishedAt": "2024-07-01T04:13:55Z",
      "title": "In a proud and troubled UK town, voters wonder whether their election choice will make a difference",
      "url": "https://apnews.com/a2e217caa7c14b39908f88b7ff1f545a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34b8661460324364841ab9fa3fba3396/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}