{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Millions of Southern Californians were on edge as a final round of dangerous fire weather was forecast for the region on Wednesday, along with a rare warning of a “Particularly Dangerous Situation” for an area near where two massive blazes have killed at least 25 and destroyed thousands of homes.",
      "publishedAt": "2025-01-15T08:02:00Z",
      "title": "Los Angeles wildfires live updates: A final round of dangerous fire weather and dry conditions is in the forecast",
      "url": "https://apnews.com/live/california-wildfires-updates-1-15-25",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2c57bf/2147483647/strip/true/crop/5104x2871+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2F82%2Ff9655ca1309bc0b9574f7948eecc%2Fb82688e071d741e28c64fd6e53633156"
    },
    {
      "author": null,
      "description": "Fires that have been burning homes and businesses in Los Angeles for a week have killed at least 25 people, displaced thousands of others and destroyed more than 12,000 structures. Nearly 30 people are missing. The blazes started early last week and have been powered by gusts from the Santa Ana winds, which strengthened Tuesday. Investigators have not determined what sparked the fires. Estimates suggest they could be the nation's costliest ever. The National Weather Service issued a rare warning about a “particularly dangerous situation” related to severe fire conditions.",
      "publishedAt": "2025-01-08T14:58:14Z",
      "title": "Los Angeles wildfires: What to know about evacuations and burned homes",
      "url": "https://apnews.com/article/california-fires-things-to-know-winds-f93d41dc901e352b63e86ab67ef7790e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a01ab3d/2147483647/strip/true/crop/4209x2368+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F47%2F447facc06dc807fa62be9d381dee%2F31812c5942a94ee2925dd5a22d16dbe7"
    },
    {
      "author": "HOLLY RAMER",
      "description": "The National Weather Service's warning about the “particularly dangerous situation” in which any new fire could explode in size in the Los Angeles area didn’t mention fire tornadoes. But meteorologist Todd Hall says they're possible given the extreme conditions. Fire whirl, fire devil, fire tornado or even firenado — scientists, firefighters and regular folks use multiple terms to describe similar phenomena, and they don’t always agree on what’s what. Some say fire whirls are formed only by heat, while fire tornadoes involve clouds generated by the fire itself. In 2018, a fire tornado the size of three football fields killed a firefighter near Redding, California.",
      "publishedAt": "2025-01-15T05:08:04Z",
      "title": "Fire tornadoes a risk under California extreme wildfire conditions",
      "url": "https://apnews.com/article/firenado-fire-tornado-california-wildfire-dd53971839343ff6737156af3b983d0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/38f09bd/2147483647/strip/true/crop/3000x1688+0+23/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F66%2Fed622c4cd8e8bc640140dced8f8f%2Fc90c3346e6b444ebbb83fbb2e36e27a6"
    },
    {
      "author": "MATT SEDENSKY",
      "description": "As California’s massive wildfires burn, thousands of GoFundMe campaigns for victims have become an outlet for onlookers transfixed by the blazes and eager to do something to help. Often plastered with photos of the people at the center of the plea, the appeals are personalizing a tragedy so big it can be hard to comprehend. GoFundMe says more than $100 million has already been raised for wildfire victims on the platform. Ella Marx from Michigan is among those who chipped in. She came across an appeal from a woman who said the houses of her grandmother and three aunts were all destroyed by the Eaton Fire and quickly donated $20.",
      "publishedAt": "2025-01-15T05:11:18Z",
      "title": "Relief, 21st-century style: As wildfires burn, GoFundMe becomes a repository of harrowing stories",
      "url": "https://apnews.com/article/california-wildfires-gofundme-01bc1eaec701d862f442c35a8438519f",
      "urlToImage": "https://dims.apnews.com/dims4/default/594afd1/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fee%2F51fb6d784efb6eb041c6ee7d8345%2Ff8ccde04df0041298bb7beab4c5b9898"
    },
    {
      "author": "JAKE COYLE, LINDSEY BAHR",
      "description": "When the Palisades Fire broke out in Los Angeles, Hollywood’s awards season was in full swing. The Golden Globes had transpired less than 48 hours earlier and a series of splashy awards banquets followed in the days after. But the enormity of the destruction in Southern California has quickly snuffed out all festiveness in the movie industry’s high season of celebration. The fires have struck at the very heart of a movie industry still trying to stabilize itself after years of pandemic, labor turmoil and technological upheaval. Not for the first time this decade, the Oscars are facing the question of: Should the show go on? And if it does, what do they mean now?",
      "publishedAt": "2025-01-15T05:20:27Z",
      "title": "As Los Angeles burns, Hollywood's Oscar season turns into a pledge drive",
      "url": "https://apnews.com/article/wildfires-oscars-los-angeles-academy-awards-da8cd994872ac6c1c65dcd4bc8721cc5",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d4cbbe/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2F32%2Fa8f9e1d136f35a5cd7244e0e3c24%2Fccf7700d80d84194a66be903cd130395"
    },
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY, JOSEF FEDERMAN",
      "description": "Negotiations between Israel and Hamas hit a last-minute snag, delaying the expected announcement of a ceasefire agreement to pause the devastating 15-month war in the Gaza Strip. Israel accused Hamas of trying to make changes to already agreed upon arrangements along Gaza’s border with Egypt and said it strongly rejected the move. Hamas called the claims “nonsense.” The finger-pointing forced Qatar, which has been mediating weeks of painstaking negotiations, to delay an expected announcement of a deal. The sides have been working on a phased agreement that would include the release of dozens of hostages held by Hamas, the return of displaced Palestinians in Gaza to what remains of their homes and an influx of desperately needed humanitarian aid into the besieged territory.",
      "publishedAt": "2025-01-15T16:35:52Z",
      "title": "Gaza ceasefire negotiations hit last-minute snag, delaying anticipated deal to pause war",
      "url": "https://apnews.com/article/gaza-israel-hamas-ceasefire-334ecc4420fe3b6fce9f7a27ca886b65",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7d5d77/2147483647/strip/true/crop/4493x2527+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F38%2F365fe78aafb565cf9bfe3979973e%2F1b49f715a44c40b89a44f0d9d7570911"
    },
    {
      "author": "MOGOMOTSI MAGOME, GERALD IMRAY",
      "description": "Rescuers and volunteers have pulled at least 78 dead miners and more than 160 survivors from an abandoned South African gold mine. They have languished there for over two months during a standoff with authorities who demanded they surrender to police because they were mining illegally. Hundreds are still believed to be trapped Wednesday. The disaster has focused criticism on the South African government’s decision to try to “smoke them out” by cutting off food and other supplies for a time. Civic groups claim authorities also removed the ropes and pulley systems that the miners used to enter and exit at least one shaft and send down supplies. A rescue is now underway after a court order.",
      "publishedAt": "2025-01-15T13:45:51Z",
      "title": "South Africa tried to pressure informal gold miners by cutting off food. Now it's pulling out bodies",
      "url": "https://apnews.com/article/south-africa-miners-illegal-gold-mine-trapped-stilfontein-b0efe6ded81f2a96eba7374cff2fe9ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/555d1f0/2147483647/strip/true/crop/9100x5119+0+475/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fbd%2Fe468b5d5c220a0b99f5299237f4a%2Ff4eb30663b254dbaa2c4b4f012fb3a25"
    },
    {
      "author": "ROD MCGUIRK",
      "description": "Best-selling British author Neil Gaiman has released a statement denying he has ever engaged in non-consensual sex after a magazine published allegations from several women, accusing him of sexual assault. The 64-year-old author of “The Sandman” comic book series and novel “American Gods” was responding on Wednesday to a New York Magazine article that detailed allegations of assault, abuse and coercion made by eight women. The allegations of four of them had been broadcast in July last year in a podcast and most relate to occasions when Gaiman was in his 40s or older and living in the United States, Britain and New Zealand.",
      "publishedAt": "2025-01-15T06:41:23Z",
      "title": "Neil Gaiman denies engaging in non-consensual sex as more accusers come forward",
      "url": "https://apnews.com/article/australia-neil-gaiman-sexual-assault-allegations-e25ce1b1fa8328c25b67b52477f8ef8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf62c1b/2147483647/strip/true/crop/3936x2214+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2Fd5%2F1370f580d53325cc7008e9032568%2F52fb25fa33ff4f16a2a5f46247d15ed5"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "The Palestinian prime minister says it's unacceptable for any entity other than the Palestinian Authority to run the Gaza Strip in the future. Mohammad Mustafa made the comments Wednesday on a visit to Norway as Israel and Hamas appear to be at the closest point yet to sealing a deal to end 15 months of war. Hamas seized power in Gaza in 2007, confining the Western-backed Palestinian Authority's limited self-rule to parts of the Israeli-occupied West Bank. The U.S. has called for a revitalized Palestinian Authority to govern both the West Bank and Gaza ahead of eventual statehood, which the Israeli government opposes.",
      "publishedAt": "2025-01-15T10:00:46Z",
      "title": "Middle East latest: Palestinian leaders in the West Bank say they should run Gaza",
      "url": "https://apnews.com/article/israel-hamas-war-syria-lebanon-news-01-15-2025-a2777c784e9f4b3b526971493b9b783e",
      "urlToImage": "https://dims.apnews.com/dims4/default/34ff48c/2147483647/strip/true/crop/7588x4268+0+395/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fe0%2F54fc208ceea3e20949fe02bdc5a7%2F754a8712ae3f4c259ee5622a0299c579"
    },
    {
      "author": "MELANIE LIDMAN, SAM MEDNICK, WAFAA SHURAFA",
      "description": "Officials now say they are closer than ever to reaching an agreement to pause the Israel-Hamas war and release hostages held in the Gaza Strip. But even if a deal is reached, the torment experienced by families of the hostages and war-weary Palestinians could be far from over. Families of the hostages do not know whether their loved ones are alive or dead, and many will have to wait for a subsequent phase of the agreement that has yet to be negotiated. In war-ravaged Gaza, many displaced Palestinians do not know if their homes or neighborhoods are still standing, and dozens are missing after encounters with Israeli forces. If negotiations over the second phase of the agreement break down, the war could resume this spring.",
      "publishedAt": "2025-01-15T14:55:38Z",
      "title": "Families in Israel and Gaza await truce in agony",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-displaced-waiting-5a4fde9e5527b682dccb6466cb48ce83",
      "urlToImage": "https://dims.apnews.com/dims4/default/8083cda/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F0b%2F75a7b0a2d3e5517cd683c9d74b32%2Fc51409e899b84a37a791d18e840df1a6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}