{
  "articles": [
    {
      "author": "JON GAMBRELL, LUJAIN JO and MATTHEW LEE",
      "description": "DOHA, Qatar (AP) — Five Americans detained for years in Iran walked off a plane and into freedom Monday, some arm-in-arm, as part of a politically risky deal that saw President Joe Biden agree to the release of nearly $6 billion in frozen Iranian assets owed by a third country, South Korea.",
      "publishedAt": "2023-09-18T07:40:35Z",
      "title": "Five Americans detained in Iran walk free, released in deal for frozen Iranian assets",
      "url": "https://apnews.com/4e1fa477f8e6af45fb764acd259c2f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb676d01944c41a3b07a1046479d6b9f/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "The auto workers' strike against Detroit's Big Three went into its fourth day with no signs of an early breakthrough and against the threat that the walkout could soon spread.A spokesman for General Motors said that representatives of the company and the United Auto Workers were continuing to negotiate on Monday.",
      "publishedAt": "2023-09-18T15:38:23Z",
      "title": "The strike by auto workers is entering its 4th day with no signs that a breakthrough is near",
      "url": "https://apnews.com/f948704cce3d6dc9ca484142c5d0d98e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db5c1f43c73749c5a449ba9b8111a2c1/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden sued the Internal Revenue Service on Monday, claiming that two agents publicly alleging tax-probe interference wrongly shared his personal information, a case that comes amid escalating legal and political struggles as the 2024 election looms.",
      "publishedAt": "2023-09-18T12:34:44Z",
      "title": "Hunter Biden sues the IRS over tax disclosures after agent testimony before Congress",
      "url": "https://apnews.com/08a6ecce30fcab3a2be5019be6464c76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4306b7c97b084d409fea6448d4a1240f/2160.jpeg"
    },
    {
      "author": "SARA BURNETT",
      "description": "Donald Trump is facing new blowback from anti-abortion activists for refusing to commit to national abortion restrictions and for calling Florida Gov. Ron DeSantis' signing of a six-week ban on the procedure a “terrible mistake.”",
      "publishedAt": "2023-09-18T16:03:20Z",
      "title": "Trump calls DeSantis abortion ban 'a terrible mistake,' sparking anger from some key Republicans",
      "url": "https://apnews.com/5bdbba55f9c2f328d49b5fbe9727677e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/834f04fc976b446894391847e8a98070/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Former Justice Department official Jeffrey Clark was acting within the scope of his official duties when he wrote a letter expressing concern about alleged problems with the 2020 election in Georgia, his lawyer said Monday as he sought to move charges against Clark to federal court.",
      "publishedAt": "2023-09-18T04:08:16Z",
      "title": "Ex-DOJ official Jeffrey Clark acted within the scope of official duties in Georgia case, lawyer says",
      "url": "https://apnews.com/4c7a2dfaa096033940d617bd2b7f1c88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0a6ab2b54fe4aae9a9e148dd1337412/3000.jpeg"
    },
    {
      "author": "MICHAEL TARM",
      "description": "CHICAGO (AP) — Ovidio Guzmán López, a son of former Sinaloa cartel leader Joaquin “El Chapo” Guzmán, pleaded not guilty in Chicago on Monday to U.S. drug trafficking, money laundering and other charges during his first court appearance since being extradited to the U.S. from Mexico.",
      "publishedAt": "2023-09-18T18:30:33Z",
      "title": "‘El Chapo’ son Ovidio Guzmán López pleads not guilty to US drug and money laundering charges",
      "url": "https://apnews.com/aa87d44a1290b6473006d4caf6220908",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5de1afb30e441da936aa0567d127c74/1941.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The commitments were far-reaching and ambitious. Among them: End extreme poverty and hunger. Ensure every child on Earth gets a quality secondary education. Achieve gender equality.",
      "publishedAt": "2023-09-18T05:05:22Z",
      "title": "As leaders convene, the UN pushes toward its crucial global goals. But progress is lagging",
      "url": "https://apnews.com/f738131544da7da506bce97db74b4149",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef5adb5929094830bd82ba800a2e7a36/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — The warnings were clear but went unheeded.Experts had long said that floods posed a significant danger to two dams meant to protect nearly 90,000 people in the northeast of Libya.",
      "publishedAt": "2023-09-18T04:35:29Z",
      "title": "Libya was mired in chaos and corruption. For years, warnings the Derna dams may burst went unheeded",
      "url": "https://apnews.com/45f76d2ac76be634865539a27b518ada",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9491fa188e594df3b20855249b1ecf9a/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "NEW YORK (AP) — Yelling that the future and their lives depend on ending fossil fuels, tens of thousands of protesters on Sunday kicked off a week where leaders will try once again to curb climate change primarily caused by coal, oil and natural gas.",
      "publishedAt": "2023-09-17T18:43:17Z",
      "title": "Tens of thousands march to kick off climate summit, demanding end to warming-causing fossil fuels",
      "url": "https://apnews.com/200f35470e1d6f34f238e9c3c3f7f137",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd4a61bf820249b5a3106a8c20e8401e/3000.jpeg"
    },
    {
      "author": "LARRY LAGE",
      "description": "Michigan State athletic director Alan Haller told suspended football coach Mel Tucker Monday that he will be fired without compensation for misconduct involving activist and rape survivor Brenda Tracy.",
      "publishedAt": "2023-09-18T20:07:29Z",
      "title": "Michigan State tells football coach Mel Tucker it will fire him for misconduct with rape survivor",
      "url": "https://apnews.com/246ff49e66a8a1a3f692d6710da791ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a0be51c1bf04c648333127c146a844c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}