{
  "articles": [
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK and JILL COLVIN",
      "description": "WASHINGTON (AP) — Republican Donald Trump has launched his general election campaign not merely rewriting the history of the Jan.",
      "publishedAt": "2024-03-19T04:12:04Z",
      "title": "Trump is making the Jan. 6 attack a cornerstone of his bid for the White House",
      "url": "https://apnews.com/2401ead35cb1402a7b289c2c99761373",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6bc9b5226d948e8a204238864556efb/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Qatari officials were “cautiously optimistic” after talks with Israel’s intelligence chief in Doha aimed at trying to reach a cease-fire, Qatari Foreign Ministry spokesperson Majed al-Ansari said Tuesday at a news conference, stressing that an Israeli ground operation in Rafah would set back any talks.",
      "publishedAt": "2024-03-19T10:15:48Z",
      "title": "The Latest | Qatar is 'cautiously optimistic' after cease-fire talks with Israeli intelligence chief",
      "url": "https://apnews.com/3b336d6e6e3bb9a568c34eb49e08a4df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3894c13f103f40b18b7a79e067a016bc/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump on Monday charged that Jews who vote for Democrats “hate Israel\" and hate “their religion,” igniting a firestorm of criticism from the White House and Jewish leaders.",
      "publishedAt": "2024-03-19T01:42:44Z",
      "title": "Trump says Jews who vote for Democrats 'hate Israel' and their religion",
      "url": "https://apnews.com/35bd1522edd64caf1dedbb10fddf0fcf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7301180c6ef34265a9b0f21b0bc92582/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is embarking on a three-day campaign swing aimed at shoring up his standing in the Sun Belt as part of an aggressive play to reenergize vital parts of his 2020 electoral coalition.",
      "publishedAt": "2024-03-19T09:03:35Z",
      "title": "Biden heads West to secure his standing in Nevada and Arizona",
      "url": "https://apnews.com/0f3a951e1201b35bf4cc7952905725bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65b3131feaec49df9d3ff72c4a64e3cc/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "JACKSON, Miss. (AP) — Six former Mississippi law enforcement officers who pleaded guilty to a long list of state and federal charges for torturing two Black men will be sentenced by a federal judge starting Tuesday.",
      "publishedAt": "2024-03-19T04:38:56Z",
      "title": "6 former Mississippi law officers to be sentenced for torture of 2 Black men",
      "url": "https://apnews.com/d2eb6ba7e2f337ac1f17035cc97f2934",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58d746d62c6c4f3880e1596524bcae9f/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "GENEVA (AP) — Illegal profits from forced labor worldwide have risen to the “obscene” amount of $236 billion per year, the U.N. labor agency reported Tuesday, with sexual exploitation to blame for three-fourths of the take from a business that deprives migrants of money they can send home, swipes jobs from legal workers, and allows the criminals behind it to dodge taxes.",
      "publishedAt": "2024-03-19T08:51:06Z",
      "title": "Sex trade to slavery: A UN agency says criminals reap $236B a year in profits from forced labor",
      "url": "https://apnews.com/e6a4910e246aa738810e937aac68d8aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1abae7a3222c43b7bdc3dfa2a4052e49/3000.jpeg"
    },
    {
      "author": "THOMAS ADAMSON",
      "description": "PARIS (AP) — The restoration of Notre Dame Cathedral in Paris following a tragic blaze in April 2019 is a story of dedication and recovery.The iconic medieval monument immortalized in history, film and literature has been gradually rebuilt over the past five years, through challenges that have included delays during the pandemic and the loss of the project's leader.",
      "publishedAt": "2024-03-19T05:15:22Z",
      "title": "Notre Dame Cathedral's restoration has been a 5-year journey of dedication and recovery",
      "url": "https://apnews.com/f6859b8ad959b35e35defa56dd582317",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6eaa2032772347b496ef49bf59b16085/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — Prince William and his wife Catherine have been filmed at a farm shop near their Windsor home, The Sun newspaper reported — the first footage of Kate since she had abdominal surgery for an unspecified condition two months ago.",
      "publishedAt": "2024-03-19T09:38:15Z",
      "title": "A newspaper says video of Prince William and Kate should halt royal rumor mill. That's a tall order",
      "url": "https://apnews.com/c7f3483e8850b859845897a1433b60c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d87a007b40c43e3ad12673582169d21/3000.jpeg"
    },
    {
      "author": "KANIS LEUNG",
      "description": "HONG KONG (AP) — Hong Kong lawmakers passed a new national security law on Tuesday that grants the government more power to quash dissent, widely seen as the latest step in a sweeping political crackdown that was triggered by pro-democracy protests in 2019.",
      "publishedAt": "2024-03-19T05:15:21Z",
      "title": "Hong Kong lawmakers pass new national security law, giving government more power to curb dissent",
      "url": "https://apnews.com/37e1aca2daef8a4f9f998f389ff3d7f5",
      "urlToImage": ""
    },
    {
      "author": "MITCH STACY",
      "description": "DAYTON, Ohio (AP) — A year ago, Fairleigh Dickinson landed in the First Four and by the following weekend became one of the most improbable bracket-busters in NCAA Tournament history.",
      "publishedAt": "2024-03-18T23:47:53Z",
      "title": "March Madness kicks off with First Four games and teams looking to do some bracket busting",
      "url": "https://apnews.com/447589747d3e6674fd75198550dfe8da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9be5996da774e5b8f7ce9aec1cb4ac2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}