{
  "articles": [
    {
      "author": "JULIE CARR SMYTH and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Ohio voters on Tuesday resoundingly rejected a Republican-backed measure that would have made it more difficult to change the state’s constitution, setting up a fall campaign that will become the nation’s latest referendum on abortion rights since the U.S.",
      "publishedAt": "2023-08-08T04:04:47Z",
      "title": "Voters in Ohio reject GOP-backed proposal that would have made it tougher to protect abortion rights",
      "url": "https://apnews.com/227cde039f8d51723612878525164f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbdc34f5de374e0fae8e0531c2cf889f/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Scientists are wondering if global warming and El Nino have an accomplice in fueling this summer’s record-shattering heat.The European climate agency Copernicus reported that July was one-third of a degree Celsius (six-tenths of a degree Fahrenheit) hotter than the old record.",
      "publishedAt": "2023-08-09T04:11:08Z",
      "title": "Scientists look beyond climate change and El Nino for other factors that heat up Earth",
      "url": "https://apnews.com/9c5151f2fca2cd77d92a1c7bc61a0035",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c22794e48e0c421e8455519a68c1e372/3000.jpeg"
    },
    {
      "author": "JAN M. OLSEN",
      "description": "COPENHAGEN, Denmark (AP) — Days of heavy rain triggered landslides and flooding in mountainous southern Norway, where authorities said Wednesday they were considering blowing up a dam at risk of bursting to prevent downstream communities from getting deluged.",
      "publishedAt": "2023-08-09T08:58:36Z",
      "title": "Heavy rain from unusual summer storm triggers landslides in Norway and floods Swedish harbor",
      "url": "https://apnews.com/659d9554e1c8b4957076a1904c16f2ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a634b68ef34f4f56b98823ef00c34573/3000.jpeg"
    },
    {
      "author": null,
      "description": "ROME (AP) — Forty-one people are believed dead after a migrant boat capsized off Tunisia, Italian state RAI television reported, citing four survivors who were rescued and brought to land Wednesday.",
      "publishedAt": "2023-08-09T09:27:33Z",
      "title": "Italian state TV says 41 dead in migrant shipwreck according to 4 survivors who set off from Tunisia",
      "url": "https://apnews.com/2f34218d67f1eff36189be7e75d9a9c0",
      "urlToImage": ""
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — The military junta that seized power in Niger two weeks ago has named new ministers and barred most international mediators from the country, in what analysts described as an attempt to consolidate power in the face of international pressure.",
      "publishedAt": "2023-08-09T07:23:13Z",
      "title": "Niger's military junta digs in with Cabinet appointments and rejects talks",
      "url": "https://apnews.com/28b2a1a1f8d6241d9a99f01d99045490",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/885a16720c204f379e3eb3a52d0fd00b/3000.jpeg"
    },
    {
      "author": "DARIA LITVINOVA and EMMA BURROWS",
      "description": "TALLINN, Estonia (AP) — An explosion Wednesday on the grounds a factory north of Moscow that makes optical equipment for Russia's security forces injured 45 people, six of them severely, officials said.",
      "publishedAt": "2023-08-09T08:26:52Z",
      "title": "Huge blast at Moscow area factory adds to Russian jitters as new drone attacks are blamed on Ukraine",
      "url": "https://apnews.com/41bd8dd4d4ddc0c56baf39f45728ade3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be761112d5fa4e39abf9fb0aa6cc235b/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and JOSH BOAK",
      "description": "ALBUQUERQUE, N.M. (AP) — Bringing back factory jobs is one of the most popular of White House promises — regardless of who happens to be the president.Donald Trump said he'd do it with tariffs.",
      "publishedAt": "2023-08-09T04:03:21Z",
      "title": "Biden is pitching his economic policies as a key to a manufacturing jobs revival",
      "url": "https://apnews.com/95700c62f45c3a69b03e550ebdcfa01b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f05f12f502bf4c37941a4a536a56c2ba/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — It was born in the break, all those decades ago — that moment when a song's vocals dropped, instruments quieted down and the beat took the stage. It was then that hip-hop came into the world, taking the moment and reinventing it.",
      "publishedAt": "2023-08-09T10:02:14Z",
      "title": "Hip-hop turns 50, reinventing itself and swaths of the world along the way",
      "url": "https://apnews.com/fbedc18c6b2a0448e23e2656292b4045",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34c1dc47ac8d4d249309bcb77508c292/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEPTUNE BEACH, Fla. (AP) — A single ticket sold in Florida is good for a $1.58 billion Mega Millions jackpot, ending a stretch of lottery futility that had stretched for nearly four months.",
      "publishedAt": "2023-08-08T04:05:40Z",
      "title": "A Mega Millions ticket sold in Florida wins $1.58 billion jackpot, the third-largest in US history",
      "url": "https://apnews.com/8397543de852fc4c716cc2ce940d9eac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c493af48f01c41ca89fd3bc9f4906ee4/3000.jpeg"
    },
    {
      "author": "STEPHEN McGRATH and VADIM GHIRDA",
      "description": "BUCHAREST, Romania (AP) — After receiving distressed text messages from a young man worried about the conditions his friend was living in at a social care home in central Romania, Georgiana Pascu arranged an impromptu visit to inspect the facility.",
      "publishedAt": "2023-08-09T05:40:24Z",
      "title": "Romanian care homes scandal spotlights abuse described as 'inhumane and degrading'",
      "url": "https://apnews.com/788423586ca8a8c413f1af0d0b0c2819",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7870c6b0dbd244b9b9c5ca0fef77c04a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}