{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and ISSAM ADWAN",
      "description": "JERUSALEM (AP) — The ruling Hamas militant group in the Gaza Strip carried out an unprecedented attack on Israel at daybreak Saturday, firing thousands of rockets as dozens of fighters infiltrated the heavily fortified border in several locations by air, land and sea, catching the country off guard on a major holiday.",
      "publishedAt": "2023-10-07T03:50:54Z",
      "title": "Hamas kills 22 in unprecedented, wide-ranging incursion into Israel. Netanyahu says 'we are at war'",
      "url": "https://apnews.com/11fb98655c256d54ecb5329284fc37d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f424deb1ad164448aade85d57a4d91de/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The militant Hamas rulers of the Gaza Strip have carried out an unprecedented, multi-front attack on Israel, firing thousands of rockets as dozens of Hamas fighters infiltrated the heavily fortified border in several locations and catching the country off-guard on a major holiday.",
      "publishedAt": "2023-10-07T10:28:19Z",
      "title": "Hamas attacked Israel and Netanyahu says his country is 'at war.' Follow live updates",
      "url": "https://apnews.com/82ab6376a215e48a1831604c2f6edf92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcdf784a00c34a0987575d2bad04488b/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and JILL COLVIN",
      "description": "WASHINGTON (AP) — Donald Trump is again testing the power of his endorsement.With an early morning social media post on Friday, Trump inserted himself into the chaotic race to replace Kevin McCarthy as House speaker by backing Ohio Rep.",
      "publishedAt": "2023-10-07T04:47:17Z",
      "title": "Trump is inserting himself into the messy race to become the next House speaker. Will it matter?",
      "url": "https://apnews.com/77b4f760ff5653344b982fbabeac6ec7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2104e3e52b54577ab6240b928583e1c/3000.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — Two 6.3 magnitude earthquakes have killed at least 15 and injured nearly 40 others in Herat province in Afghanistan, according to Mohammad Abdullah Jan, spokesman for the country's national disaster authority.",
      "publishedAt": "2023-10-07T10:43:22Z",
      "title": "Strong earthquake and several aftershocks reported in western Afghanistan",
      "url": "https://apnews.com/ba6f50c0cd0590f179756077f5f01393",
      "urlToImage": ""
    },
    {
      "author": "WILL WEISSERT and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The ad sounds like something out of the GOP 2024 playbook, trumpeting a senator’s work with Republicans to crack down on the flow of fentanyl and other illegal drugs into the U.S., getting tough on Chinese interests helping smugglers, and noting how he \"wrote a bill signed by Donald Trump to increase funding for Border Patrol.”",
      "publishedAt": "2023-10-07T04:59:52Z",
      "title": "Biden faces more criticism about the US-Mexico border, one of his biggest problems heading into 2024",
      "url": "https://apnews.com/646f656dbfecf268f0cb182c74ad47ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54a0bf698d9042b2982932e779f5e0af/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and LORI HINNANT",
      "description": "HROZA, Ukraine (AP) — The cafe had been closed throughout the war but reopened especially for a dead soldier’s wake, and almost every household in the village sent someone to mourn the native son.When the gathering to honor Andrii Kozyr was struck by a precision missile that Ukrainian officials said was fired by Russia, almost every household in Hroza in eastern Ukraine lost someone.",
      "publishedAt": "2023-10-06T21:28:31Z",
      "title": "Precision missile strike on cafe hosting soldier's wake decimates Ukrainian village",
      "url": "https://apnews.com/814c14c1e1d5f23041a55141fa82651e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f00068cffeb34dc59d22601ce3e59b26/3000.jpeg"
    },
    {
      "author": "WASBIR HUSSAIN and ANUPAM NATH",
      "description": "GANGTOK, India (AP) — Rescuers found more bodies overnight as they dug through slushy debris and ice-cold water in a hunt for survivors after a glacial lake burst through a dam in India’s Himalayan northeast, washing away houses and bridges and forcing thousands to flee.",
      "publishedAt": "2023-10-07T07:30:33Z",
      "title": "Deaths rise to 47 after an icy flood swept through India's Himalayan northeast",
      "url": "https://apnews.com/3abf5396cff5f33b2289bba343ca7b5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e28ac6e1805142ce80865beed9d339b9/1280.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM",
      "description": "PENFIELD, Pa. (AP) — In the heart of Pennsylvania elk country, Eric McCarthy and his client, Don Reichel, got up before sunrise to scour the forest floor for so-called “brown gold” — a rack of freshly shed antlers to add to Reichel’s collection back home.",
      "publishedAt": "2023-10-07T04:10:01Z",
      "title": "Witnesses to FBI hunt for Civil War gold describe heavily loaded armored truck, signs of a night dig",
      "url": "https://apnews.com/6b5feca00ebf3e04638a8bbce992809d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26a5c1767ab2468fb6c03b4bfddad1cc/3000.jpeg"
    },
    {
      "author": "TOM MURPHY",
      "description": "A dose of patience may come in handy at the pharmacy counter this fall.Drug and staffing shortages haven’t gone away.",
      "publishedAt": "2023-10-07T08:21:02Z",
      "title": "Pharmacist shortages and heavy workloads challenge drugstores heading into their busy season",
      "url": "https://apnews.com/c7a94430a2c9d11779a684c2bcfc4c2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ee9b928a8a4419896e88c65af621d04/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "PHOENIX (AP) — In fifth grade, Stella Gage's class watched a video about puberty. In ninth grade, a few sessions of her health class were dedicated to the risks of sexual behaviors. That was the extent of her sex education in school.",
      "publishedAt": "2023-10-07T04:04:43Z",
      "title": "Sex education classes often don't include LGBTQ+ students. New restrictions could make it worse",
      "url": "https://apnews.com/9b456dfbedb5d88f33311b65c7245519",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75466dc1145f438ca0fcb43c1126899a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}