{
  "articles": [
    {
      "author": "STEVE PEOPLES, JILL COLVIN and ZEKE MILLER",
      "description": "WASHINGTON (AP) — In battleground Pennsylvania, Kamala Harris warned that democracy and reproductive rights were at stake as she campaigned alongside a former Republican congresswoman.",
      "publishedAt": "2024-10-23T04:01:40Z",
      "title": "Trump targets hardcore partisans, Harris goes after moderates: Inside the campaign's final sprint",
      "url": "https://apnews.com/623cf25b673d7e875e69a904b93e8958",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcae50364a574100b5adf6d3611bed21/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Israeli military said Tuesday a top Hezbollah official who had been widely expected to be the group’s next leader was killed in an Israeli airstrike in southern Beirut in early October.Hashem Safieddine, a powerful cleric within the party ranks, was expected to succeed Hassan Nasrallah, who was killed in an Israeli airstrike in September.",
      "publishedAt": "2024-10-22T06:01:20Z",
      "title": "Middle East latest: Israel says it killed a Hezbollah official expected to be group's next head",
      "url": "https://apnews.com/9fc49430fd9824a0143b3ba6dd0f0d6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fc6633b7c904174a10b4331e2b9e36a/3000.jpeg"
    },
    {
      "author": "ZIMO ZHONG",
      "description": "HONG KONG (AP) — Asian stocks were mixed on Wednesday under pressure from a rising U.S. dollar and the uncertainties over the U.S. election. U.S. futures and oil prices fell due to escalating geopolitical tensions after Israel announced that an airstrike outside Beirut earlier this month killed a Hezbollah official who had been expected to succeed the group’s longtime leader after he died in an Israeli strike last month.",
      "publishedAt": "2024-10-23T04:45:07Z",
      "title": "Asian stocks are mixed following a quiet day on Wall Street",
      "url": "https://apnews.com/acd1c0b379dbe53978f2e3e6d05e588e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b945b189c79443498bdf3de6a893386/3000.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — Tens of thousands of devastated Swifties trading friendship bracelets, wearing sparkly dresses and singing songs in the streets of Vienna.",
      "publishedAt": "2024-10-23T04:05:31Z",
      "title": "With or without the far right in power, Austria's links with Russia cause concern among allies",
      "url": "https://apnews.com/a8e5e67808ad691d09e03fba10bacc4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f54c4db7a034b05b9b9b3ff2b54e9d4/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and FATIMA HUSSEIN",
      "description": "BELLEFONTE, Pa. (AP) — It was love at first sight when Ellen Matis pulled up to this small Pennsylvania borough on a dreary winter day almost eight years ago. The road into town curved along the creek and then climbed uphill to a historic square where she chatted with regulars over beers at the local pub.",
      "publishedAt": "2024-10-23T04:09:49Z",
      "title": "In Pennsylvania, an influx of college graduates could push a key county toward Harris",
      "url": "https://apnews.com/99648a481dcd5fca8580a86a271e14dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7407e1d3ee64effad80152f24a4badf/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — Fernando Valenzuela, the Mexican-born phenom for the Los Angeles Dodgers who inspired “Fernandomania” while winning the NL Cy Young Award and Rookie of the Year in 1981, has died.",
      "publishedAt": "2024-10-23T03:39:21Z",
      "title": "Fernando Valenzuela, Mexican-born pitcher whose feats for Dodgers fueled 'Fernandomania,' dies at 63",
      "url": "https://apnews.com/03caebce1554591aed06b4a1672334bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d18ab904abd14775a19dc4f352f39aa3/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and MANUEL VALDES",
      "description": "EVERETT, Wash. (AP) — Wednesday is shaping up as one of the most significant days in a volatile year for Boeing, which is expected to report a huge third-quarter loss, introduce its new CEO on his first earnings call, and learn if machinists will end a strike that has crippled the company’s aircraft production for more than a month.",
      "publishedAt": "2024-10-23T04:02:25Z",
      "title": "Boeing is expected to report a big Q3 loss, then wait for results of vote by striking workers",
      "url": "https://apnews.com/af6c6dab8747d5b8189df97a55e6b8d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c287d81eab0e424ba6cf07f584c4f39e/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "LOS ANGELES (AP) — LeBron James and Bronny James became the first father and son to play in the NBA together Tuesday night during the Los Angeles Lakers ' season opener.",
      "publishedAt": "2024-10-23T02:10:39Z",
      "title": "LeBron and Bronny James make history as the NBA's first father-son duo to play together",
      "url": "https://apnews.com/d7caaeb000ad736e9745b436ca123448",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c747e9b72e049e8a19623c8993dd5ce/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER and KATE PAYNE",
      "description": "BRADENTON BEACH, Fla. (AP) — The start of “snowbird” season in Florida is only weeks away, but many Florida Gulf Coast beaches, regularly voted some of the best in the United States, are closed to the public because of the devastation from Hurricane Milton two weeks ago.",
      "publishedAt": "2024-10-23T04:06:35Z",
      "title": "Hurricane Milton ravaged one of the most popular areas for 'snowbirds' on Florida's Gulf Coast",
      "url": "https://apnews.com/2c6c92ba9dd4a452ceaa7ce2e42c7bd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0bd64aafc034aabb0a47ca502ccf5a2/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — Torrential rain set off by an approaching tropical storm swamped eastern Philippine cities and towns overnight in widespread flooding that trapped people, some on their roofs, and sparked frantic appeals for rescue boats and trucks, officials said Wednesday.",
      "publishedAt": "2024-10-23T01:56:40Z",
      "title": "Tropical storm swamps Philippine provinces in widespread flooding and trap people, some on roofs",
      "url": "https://apnews.com/5a5d3261a0646aa2c233cc63b27e46c4",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}