{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and ABBY SEWELL",
      "description": "JERUSALEM (AP) — Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a pre-emptive strike on Hezbollah, as the militant group said it had launched hundreds of rockets and drones to avenge the killing of one of its top commanders last month.",
      "publishedAt": "2024-08-25T02:23:12Z",
      "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander",
      "url": "https://apnews.com/52056075daebc9aac6675043f64439ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da1b84d64f9e4edc849581c9d8e0606a/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and DAVID RISING",
      "description": "CAIRO (AP) — Israeli airstrikes killed at least three dozen Palestinians in southern Gaza, health workers said Saturday, as officials including a Hamas delegation gathered for high-level cease-fire talks in neighboring Egypt.",
      "publishedAt": "2024-08-24T10:08:49Z",
      "title": "Israeli airstrikes kill dozens in Gaza on the eve of high-level cease-fire talks in Egypt",
      "url": "https://apnews.com/2abd1983d176c6ea3d19a5ace02688b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc7c75c746d6454ea216f078d20a0095/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and STEPHANIE LIECHTENSTEIN",
      "description": "SOLINGEN, Germany (AP) — The Islamic State militant group on Saturday claimed responsibility for a knife attack that killed three people and wounded eight more at a crowded festival marking this city's 650th anniversary.",
      "publishedAt": "2024-08-24T06:38:10Z",
      "title": "Islamic State group claims responsibility for knife attack that killed 3 in Solingen, Germany",
      "url": "https://apnews.com/84ad7df23ca5ecc8c2145d57e75090d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f0c4339f1c04c8ab051114de363134f/1920.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — The European Union's top diplomat on Saturday said that Venezuelan President Nicolás Maduro has still “not provided the necessary public evidence” to prove he was the winner of July’s elections, days after the country’s Supreme Court backed the government’s disputed claims of victory.",
      "publishedAt": "2024-08-25T00:49:38Z",
      "title": "EU: Maduro has not shown 'necessary public evidence' to declare victory in Venezuela elections",
      "url": "https://apnews.com/b01349aaa4e7ca120dbb84aabebb51d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c69fbdaf4444c70b5e5d028a6d0980a/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "NEW YORK (AP) — Kamala Harris accepted the Democratic nomination “on behalf of everyone whose story could only be written in the greatest nation on Earth.” America, Barack Obama thundered, “is ready for a better story.” JD Vance insisted that the Biden administration “is not the end of our story,” and Donald Trump called on fellow Republicans to “write our own thrilling chapter of the American story.”",
      "publishedAt": "2024-08-25T04:01:31Z",
      "title": "Behind the rhetoric, a presidential campaign is a competition about how to tell the American story",
      "url": "https://apnews.com/68aad96e58a7786c2603544f606cf8ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f08b5e0399c4939969c3ba6af6e2b2c/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — NASA decided Saturday it’s too risky to bring two astronauts back to Earth in Boeing’s troubled new capsule, and they'll have to wait until next year for a ride home with SpaceX.",
      "publishedAt": "2024-08-24T17:17:24Z",
      "title": "NASA decides to keep 2 astronauts in space until February, nixes return on troubled Boeing capsule",
      "url": "https://apnews.com/e4e81e5a6c23dee2f8f72260ddea011c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5d1a79ee2204ec7b56881bd4eb1012a/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — Tropical Storm Hone, whose name is Hawaiian for “sweet and soft,” drew near the islands Saturday with breezes that were expected to intensify — and increase the wildfire risk for drier parts of the state even as memories are still fresh from last year's deadly blazes on Maui.",
      "publishedAt": "2024-08-24T04:08:51Z",
      "title": "Tropical Storm Hone steadily approaches Hawaii, threatening floods and fires",
      "url": "https://apnews.com/7c086ba23441e6e69177e3da3d703655",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4acb6d8fe0ee4b10a424cf9afa0c4fa2/2000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Russia and Ukraine exchanged over 100 prisoners of war each on Saturday as Kyiv marked its third Independence Day since Moscow's full-scale invasion.",
      "publishedAt": "2024-08-24T09:40:42Z",
      "title": "Moscow and Kyiv swap prisoners of war as Ukraine marks independence anniversary",
      "url": "https://apnews.com/a7b06472aa1d96f39e417379c6d1782c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51409cc2bb204a05968fef5046bcd0ee/2000.jpeg"
    },
    {
      "author": "JOSH FUNK and ROB GILLIES",
      "description": "TORONTO (AP) — The Canadian arbitrator appointed to resolve a messy railroad labor dispute to protect the North American economy has ordered employees at the country’s two major railroads back to work so both can resume operating.",
      "publishedAt": "2024-08-24T22:28:19Z",
      "title": "Back-to-work order issued for 2 major Canada railroads. Union will comply, but lawsuit planned",
      "url": "https://apnews.com/67b1be6e6a4d5e9535633e54767c5d82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46d2f76a13104bf08f1292182d30c2d3/3000.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON",
      "description": "Isabella Pires first noticed what she calls the “gradual apathy pandemic” in eighth grade. Only a handful of classmates registered for service projects she helped organize at her Massachusetts school.",
      "publishedAt": "2024-08-25T04:17:21Z",
      "title": "Schools are competing with cell phones. Here's how they think they could win",
      "url": "https://apnews.com/4d89f5b7fd7c8f1d5903f8c04f26da54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08aa409189dd4317bf54df0a1f76d18f/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}