{
  "articles": [
    {
      "author": "JULIA FRANKEL, NAJIB JOBAIN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Three Israeli hostages who were mistakenly shot by Israeli troops in the Gaza Strip had been waving a white flag and were shirtless when they were killed, military officials said Saturday, in Israel's first such acknowledgement of harming any hostages in its war against Hamas.",
      "publishedAt": "2023-12-16T08:27:42Z",
      "title": "3 hostages mistakenly killed by Israeli troops had been holding a white flag, military officials say",
      "url": "https://apnews.com/7df1ec6f336d1cd357903d6b848a1a1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f9c82efcedf4fbdaa8d62df177a5ac4/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES, LISA MASCARO and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — Prominent Latinos in Congress looked on quietly, at first, privately raising concerns with the Biden administration over the direction of border security talks.Democratic Sen.",
      "publishedAt": "2023-12-16T05:08:10Z",
      "title": "Latino Democrats shift from quiet concern to open opposition to Biden's concessions in border talks",
      "url": "https://apnews.com/66531bcefb908d5440a52b54c543b006",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2ef3ef486ee4e0ba928d64038907ccf/3000.jpeg"
    },
    {
      "author": null,
      "description": "COLUMBUS, Ohio (AP) — The Ohio Supreme Court has dismissed the state’s challenge to a judge’s order that has blocked enforcement of Ohio's near-ban on abortions for the past 14 months.",
      "publishedAt": "2023-12-16T17:26:55Z",
      "title": "Order blocking enforcement of Ohio abortion ban stands after high court dismisses appeal",
      "url": "https://apnews.com/9d8f9e75aecb1ce2dc98d2e9ff9b4071",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd4b52d8846d466d982eba16f781154f/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — Ohio was in the throes of a bitter debate over abortion rights this fall when Brittany Watts, 21 weeks and 5 days pregnant, began passing thick blood clots.",
      "publishedAt": "2023-12-16T13:05:43Z",
      "title": "A Black woman was criminally charged after a miscarriage. It shows the perils of pregnancy post-Roe",
      "url": "https://apnews.com/b8090abfb5994b8a23457b80cf3f27ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db051f5015a34a778b33012988b84790/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — Salsa music blares from the food court in a rundown Miami shopping center as Latinos head to a kiosk and an office showing signs for “ Obamacare,” where they hope to renew their health coverage plans before the year ends.",
      "publishedAt": "2023-12-16T05:20:16Z",
      "title": "As Trump threatens to repeal Obamacare, these 'insurance godmothers' are signing Florida Latinos up",
      "url": "https://apnews.com/89d5c33dc5761ab62dcdc680fca28446",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c2262606c3c41d186e0e5b358848374/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "LONDON (AP) — So much for women and children first.The phrase and its grave implications about who to save first in a catastrophe are rooted in the shipwrecks of centuries past and popularized by Hollywood's treatment of the Titanic disaster.",
      "publishedAt": "2023-12-16T05:03:34Z",
      "title": "Women and children first? Experts say that in most crises, it's more like everyone for themselves",
      "url": "https://apnews.com/24526080537db00a78945bfb2112f86d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bdfe2bf24384a1194909664ac18ea9f/1600.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — A Vatican tribunal on Saturday convicted a cardinal of embezzlement and sentenced him to 5 ½ years in prison in one of several verdicts handed down in a complicated financial trial that aired the city state’s dirty laundry and tested its justice system.",
      "publishedAt": "2023-12-16T05:15:11Z",
      "title": "Cardinal is convicted of embezzlement in big Vatican financial trial, sentenced to 5½ years",
      "url": "https://apnews.com/690128606e1e22534551b7f74b3d4814",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64758040ec4b429fad7ddab26dcd980e/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Sheikh Nawaf Al Ahmad Al Sabah, Kuwait’s ruling emir, died on Saturday after a three-year, low-key reign focused on trying to resolve the tiny, oil-rich nation's internal political disputes.",
      "publishedAt": "2023-12-16T09:57:06Z",
      "title": "Kuwait's ruling emir, Sheikh Nawaf Al Ahmad Al Sabah, dies at age 86",
      "url": "https://apnews.com/d4a0e02fd3e5aee29a220686c8df8654",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7e767fd7d7b43b5ae15851da4f8ccaa/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — It was the most painful inflation Americans had experienced since 1981, when “The Dukes of Hazzard” and “The Jeffersons” were topping the TV charts.",
      "publishedAt": "2023-12-16T05:01:23Z",
      "title": "Federal Reserve on cusp of what some thought impossible: Defeating inflation without steep recession",
      "url": "https://apnews.com/2e94988d686836926c0b7c617c5ff299",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c9b283bc0b54fc8bf0394e598c6b0ab/3000.jpeg"
    },
    {
      "author": "DAVID BRANDT",
      "description": "PHOENIX (AP) — Once the initial shock wore off on the price tag of Shohei Ohtani's record-shattering $700 million, 10-year deal with the Los Angeles Dodgers, details about the contract emerged that were nearly as stunning.",
      "publishedAt": "2023-12-16T14:35:32Z",
      "title": "Dodgers, Ohtani got creative with $700 million deal, but both sides still have some risk",
      "url": "https://apnews.com/f13c28215e986a24e84269186842191d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef14bf3d2ed7498980677c11992735c1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}