{
  "articles": [
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — Man sentenced to 25 years in prison for killing retired NFL star Will Smith during a confrontation following a car crash.",
      "publishedAt": "2024-04-25T17:24:29Z",
      "title": "Man sentenced to 25 years in prison for killing retired NFL star Will Smith during a confrontation following a car crash",
      "url": "https://apnews.com/1d837f59a9dfbcb7fdaf557a0a4ba901",
      "urlToImage": ""
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Thursday appeared likely to reject former President Donald Trump’s claim of absolute immunity from prosecution over election interference, but it seemed possible Trump could still benefit from a lengthy trial delay, possibly beyond November’s election.",
      "publishedAt": "2024-04-25T04:06:06Z",
      "title": "Supreme Court seems skeptical of Trump's claim of absolute immunity but decision's timing is unclear",
      "url": "https://apnews.com/72c885c07c77970d4380206f87b2d8ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d9ea67d6c74402f9aa024263f1fe39e/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Donald Trump returned to court Thursday for the third day of witness testimony in his hush money trial.",
      "publishedAt": "2024-04-25T10:11:34Z",
      "title": "The Latest | Ex-publisher in hush money trial recalls Trump as 'very upset'",
      "url": "https://apnews.com/73ec7fdc224c4cb2f2507cbd5a3d4094",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb0007a6b7494788bccd941ba3849271/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Catch and kill. Checkbook journalism. Secret deals. Friends helping friends.Even by National Enquirer standards, testimony by its former publisher David Pecker at Donald Trump's hush money trial this week has revealed an astonishing level of corruption at America's best-known tabloid and may one day be seen as the moment it effectively died.",
      "publishedAt": "2024-04-25T15:24:15Z",
      "title": "The National Enquirer was the go-to American tabloid for many years. Donald Trump helped change that",
      "url": "https://apnews.com/57f0c462af437fb07967a041b6f66022",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd17383287b749c4b19d95b2fa587c1e/2028.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and DAVE COLLINS",
      "description": "NEW YORK (AP) — New York’s highest court on Thursday overturned Harvey Weinstein ’s 2020 rape conviction, reversing a landmark ruling of the #MeToo era.",
      "publishedAt": "2024-04-25T13:09:34Z",
      "title": "Harvey Weinstein’s 2020 rape conviction overturned by NY appeals court",
      "url": "https://apnews.com/ed29faeec862abf0c071e8bd3574c4a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac7383804eed4459bfe8be96df90f5cb/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "ISTANBUL (AP) — A top Hamas political official told The Associated Press the Islamic militant group is willing to agree to a truce of five years or more with Israel and that it would lay down its weapons and convert into a political party if an independent Palestinian state is established along pre-1967 borders.",
      "publishedAt": "2024-04-25T04:26:28Z",
      "title": "Hamas official says group would lay down its arms if an independent Palestinian state is established",
      "url": "https://apnews.com/4912532b11a9cec29464eab234045438",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b42568b6d42f4aaf875a870328bb1ceb/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO, ACACIA CORONADO and NICK PERRY",
      "description": "AUSTIN, Texas (AP) — Some U.S. universities called in police to break up demonstrations against the Israel-Hamas war, resulting in ugly scuffles and dozens of arrests, while others appeared content to wait out student protests Thursday, as the final days of the semester ticked down and graduation ceremonies loomed.",
      "publishedAt": "2024-04-25T07:04:41Z",
      "title": "Some campuses call in police to break up pro-Palestinian demonstrations, while others wait it out",
      "url": "https://apnews.com/fbd7dd06431f32d24d0f8abcc8a56b8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22efbe3d18a440eba1b9f4396a73995e/1920.jpeg"
    },
    {
      "author": "DANICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Ariel Henry resigned Thursday as prime minister of Haiti, leaving the way clear for a new government to be formed in the Caribbean country, which has been wracked by gang violence that killed or injured more than 2,500 people from January to March.",
      "publishedAt": "2024-04-25T13:36:23Z",
      "title": "Ariel Henry resigns as prime minister of Haiti, paving the way for a new government to take power",
      "url": "https://apnews.com/22868c51b5f4c9ca5a8d69fcb5df376b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1329c3c54fb045e8b7ef5595da31bc90/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — Coal-fired power plants would be forced to capture smokestack emissions or shut down under a rule issued Thursday by the Environmental Protection Agency.New limits on greenhouse gas emissions from fossil fuel-fired electric plants are the Biden administration's most ambitious effort yet to roll back planet-warming pollution from the power sector, the nation’s second-largest contributor to climate change.",
      "publishedAt": "2024-04-25T09:08:48Z",
      "title": "Strict new EPA rules would force coal-fired power plants to capture emissions or shut down",
      "url": "https://apnews.com/5c96ca146e7f70b47806beb4bc3713e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aec8297bb8e140ffb735b5d8809ce977/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — Ever since college, Brad Jobling struggled with his weight, fluctuating between a low of 155 pounds when he was in his 30s to as high as 220. He spent a decade tracking calories on WeightWatchers, but the pounds he dropped always crept back onto his 5-foot-5-inch frame.",
      "publishedAt": "2024-04-25T09:52:24Z",
      "title": "What do weight loss drugs mean for a diet industry built on eating less and exercising more?",
      "url": "https://apnews.com/9df7a519d48e85f020151e291e982bea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40d631f8859a48d2ababe9c1f2837e08/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}