{
  "articles": [
    {
      "author": "DEE-ANN DURBIN",
      "description": "McDonald’s said Wednesday that customers should feel confident ordering from its restaurants despite a deadly E.",
      "publishedAt": "2024-10-23T15:13:35Z",
      "title": "McDonald's tries to reassure customers after deadly E. coli outbreak",
      "url": "https://apnews.com/d4a37726f2669016decedcf9f928a9d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbb750edea63475a9bcfc3334fdca8e5/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, JILL COLVIN and ZEKE MILLER",
      "description": "WASHINGTON (AP) — In battleground Pennsylvania, Kamala Harris warned that democracy and reproductive rights were at stake as she campaigned alongside a former Republican congresswoman.",
      "publishedAt": "2024-10-23T04:01:40Z",
      "title": "Trump targets hardcore partisans, Harris goes after moderates: Inside the campaign's final sprint",
      "url": "https://apnews.com/623cf25b673d7e875e69a904b93e8958",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcae50364a574100b5adf6d3611bed21/3000.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "NEW YORK (AP) — Foreign adversaries have shown continued determination to influence the U.S. election –- and there are signs their activity will intensify as Election Day nears, Microsoft said in a report Wednesday.",
      "publishedAt": "2024-10-23T16:34:26Z",
      "title": "Efforts by Russia, Iran and China to sway US voters may escalate, new Microsoft report says",
      "url": "https://apnews.com/ef9b5155349d496e00513e7b3bc3fc07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33790a2d5056446a811b76d4a6a225bc/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and FATIMA HUSSEIN",
      "description": "BELLEFONTE, Pa. (AP) — It was love at first sight when Ellen Matis pulled up to this small Pennsylvania borough on a dreary winter day almost eight years ago. The road into town curved along the creek and then climbed uphill to a historic square where she chatted with regulars over beers at the local pub.",
      "publishedAt": "2024-10-23T04:09:49Z",
      "title": "In Pennsylvania, an influx of college graduates could push a key county toward Harris",
      "url": "https://apnews.com/99648a481dcd5fca8580a86a271e14dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7407e1d3ee64effad80152f24a4badf/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Conservatives already have a supermajority on the Supreme Court as a result of Donald Trump's presidency. If Trump wins a second term, the right side of the court could retain control for several more decades.",
      "publishedAt": "2024-10-23T11:46:21Z",
      "title": "A Supreme Court reshaped by Trump has a low profile in this presidential campaign",
      "url": "https://apnews.com/ed91f084599d0f25b00f44bb71620528",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d3c3a2025bf45a5bdc610bb314b8a28/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and LOLITA C. BALDOR",
      "description": "SEOUL, South Korea (AP) — The U.S. defense secretary said Wednesday there is evidence that North Korea has sent troops to Russia, calling it a “very, very serious issue” if they join the war in Ukraine on Moscow's side and warning of possible consequences.",
      "publishedAt": "2024-10-23T09:00:48Z",
      "title": "US defense chief says there’s evidence North Korea has sent troops to Russia",
      "url": "https://apnews.com/b664f8c1164e9ef859b7a618ffa92140",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57db2e2afc4b45fb98b02542225341c8/3000.jpeg"
    },
    {
      "author": "MOHAMMED ZAATARI and KAREEM CHEHAYEB",
      "description": "TYRE, Lebanon (AP) — Israeli jets struck multiple buildings in Lebanon's southern coastal city of Tyre on Wednesday, sending up large clouds of black smoke, while Hezbollah confirmed that a top official widely expected to be the militant group's next leader had been killed in an Israeli strike.",
      "publishedAt": "2024-10-23T11:25:11Z",
      "title": "Israeli strikes pound Lebanese coastal city after residents evacuate",
      "url": "https://apnews.com/31162ca16468bc22cf0696535ea3f3f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c77139b450c943228983310744270fb9/3000.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "AVIGNON, France (AP) — They are, on the face of it, the most ordinary of men. Yet they’re all on trial charged with rape. Fathers, grandfathers, husbands, workers and retirees — 50 in all — accused of taking turns on the drugged and inert body of Gisèle Pelicot while her husband recorded the horror for his swelling private video library.",
      "publishedAt": "2024-10-23T07:13:42Z",
      "title": "Sensational mass trial shines a dark light on rape culture in France",
      "url": "https://apnews.com/b846c0258e90daed7989693ef308547c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/475d52e6fd054df5b0a06f446a6335db/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER and KATE PAYNE",
      "description": "BRADENTON BEACH, Fla. (AP) — The start of “snowbird” season in Florida is only weeks away, but many Florida Gulf Coast beaches, regularly voted some of the best in the United States, are closed to the public because of the devastation from Hurricane Milton two weeks ago.",
      "publishedAt": "2024-10-23T04:06:35Z",
      "title": "Hurricane Milton ravaged one of the most popular areas for 'snowbirds' on Florida's Gulf Coast",
      "url": "https://apnews.com/2c6c92ba9dd4a452ceaa7ce2e42c7bd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0bd64aafc034aabb0a47ca502ccf5a2/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — Fernando Valenzuela, the Mexican-born phenom for the Los Angeles Dodgers who inspired “Fernandomania” while winning the NL Cy Young Award and Rookie of the Year in 1981, has died.",
      "publishedAt": "2024-10-23T03:39:21Z",
      "title": "Fernando Valenzuela, Mexican-born pitcher whose feats for Dodgers fueled 'Fernandomania,' dies at 63",
      "url": "https://apnews.com/03caebce1554591aed06b4a1672334bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3fb580568234217a2a079f9ded9eebc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}