{
  "articles": [
    {
      "author": null,
      "description": "Texas Democrats have left the state in an attempt to prevent the state House from holding a vote Monday on new congressional maps that Republicans hope will net them several additional U.S. House seats in the 2026 midterm elections. The dramatic move Sunday could expose Democrats to fines and other penalties. Democrats have cast the decision to leave the state as a last-ditch effort to stop Republicans from pushing through a rare mid-decade redrawing of the congressional map. Republican Gov. Greg Abbott called a special session of the Legislature that started last month to take up the redistricting effort that President Donald Trump has urged.",
      "publishedAt": "2025-08-04T06:22:09Z",
      "title": "Texas governor threatens Democrats for leaving state to block vote on Trump-backed redistricting",
      "url": "https://apnews.com/article/us-election-2026-texas-redistricting-136cfeddc717f9fc69337bd3d39b1819",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f539c5/2147483647/strip/true/crop/5012x2819+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fcd%2Fb54dc5862635bcfd0ffb3a5750c2%2Fc069bc1f2bec4bbabe44b0a067830cb9"
    },
    {
      "author": null,
      "description": "The State Department is proposing requiring applicants for business and tourist visas to post a bond of up to $15,000 to apply to enter the United States. It's a move that may make the process unaffordable for many. In a notice to be published in the Federal Register on Tuesday, the department says it will start a 12-month pilot program under which people from countries deemed to have high overstay rates and deficient internal document security controls could be required to post bonds of $5,000, $10,000 or $15,000 when they apply for a visa. It says the countries affected will be listed once the program takes effect.",
      "publishedAt": "2025-08-04T15:31:27Z",
      "title": "US may require visa applicants to post bond of up to $15,000",
      "url": "https://apnews.com/article/state-department-visa-bond-d532b186abf6e39c621d1bd0995d7509",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4d8ade/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2F12%2Fe46c9f0292a867e51b3e1e391d5c%2F410eae8d24f74ee3bcd6229c15d54eb1"
    },
    {
      "author": null,
      "description": "Lawmakers have left Washington for the annual August recess, but a few weeks of relative quiet at the U.S. Capitol can’t mask the partisan tensions that are brewing on government funding and President Donald Trump’s nominees. It could make for a momentous September. On government funding, Senate Democratic leader Chuck Schumer and House Democratic leader Hakeem Jeffries sent their Republican counterparts a sharply-worded letter Monday calling for a meeting this week. They said it will take bipartisanship to avert a “painful, unnecessary shutdown.” On nominees, Republicans are considering changes to Senate rules to get more of Trump’s nominees confirmed.",
      "publishedAt": "2025-08-04T18:41:51Z",
      "title": "Tensions are ahead for Congress on spending and Trump nominations",
      "url": "https://apnews.com/article/government-shutdown-nominations-trump-schumer-thune-317726f1cf0b530a9543e866fd7d92f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e4487f/2147483647/strip/true/crop/5190x2919+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F00%2F512f7fd3b1b3a12fb15a28b3170c%2F5826bef126614b86b9007a4feabce401"
    },
    {
      "author": null,
      "description": "U.S. stocks rallied and won back most of their sharp loss from last week. The S&P 500 jumped 1.5% Monday to follow up its worst day since May with its best since May. The Dow Jones Industrial Average climbed 585 points, or 1.3%, and the Nasdaq composite leaped 2%. Gains for Tyson Foods and other companies following their better-than-expected profit reports helped offset a drop for Berkshire Hathaway. This upcoming week may have fewer fireworks on Wall Street than last week, which was punctuated by a disappointingly weak report on the U.S. job market.",
      "publishedAt": "2025-08-04T03:34:41Z",
      "title": "Dow leaps 585 points as US stocks recover most of Friday's wipeout",
      "url": "https://apnews.com/article/stocks-markets-tariffs-jobs-trump-f91c267abb95fbe2fecd0e29bde661a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4dbf088/2147483647/strip/true/crop/7585x4267+0+395/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2Fa5%2Fc017b4a72015e03c9e0e6bdda420%2F8f12ece77ff44bb1ba82d945e56b96d9"
    },
    {
      "author": null,
      "description": "The friendliness between Indian Prime Minister Narendra Modi and U.S. President Donald Trump was seen as a relationship like no other. The two men often shared bear hugs, showered flattering praise on each other and made appearances at stadium rallies — a boost in the arm for two populist leaders with ideological similarities. All appeared well until a series of events left the ties between them — and their countries — sour. From Trump’s tariffs and India’s purchase of oil from Russia to a U.S. tilt towards Pakistan, friction between New Delhi and Washington has been noticeable.",
      "publishedAt": "2025-08-04T20:29:18Z",
      "title": "Modi and Trump's relationship is strained after India buys Russian oil",
      "url": "https://apnews.com/article/india-us-modi-trump-tariffs-relationship-575af0f270713fa6b09f4ed4e2848f21",
      "urlToImage": "https://dims.apnews.com/dims4/default/462d2ed/2147483647/strip/true/crop/6564x3692+0+342/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Ff7%2Fd621db0bf8ba49e02a79a31631af%2Ff28cc56e213d44528cee459edd1b81aa"
    },
    {
      "author": null,
      "description": "A judge says Sean “Diddy” Combs can’t go home from jail to await sentencing on his prostitution-related conviction. The judge issued a decision Monday to deny the rap and style mogul’s latest bid for bail. Combs has been behind bars since his arrest in September. He faced federal charges of coercing girlfriends into having drug-fueled sex marathons with other men. He was acquitted last month of the top charges, which were racketeering and sex trafficking. Combs was convicted of two counts of a prostitution-related offense. He denied all the charges.",
      "publishedAt": "2025-08-04T21:41:41Z",
      "title": "Sean ‘Diddy’ Combs is denied release on bond to await sentencing",
      "url": "https://apnews.com/article/sean-diddy-combs-sentencing-bail-1be1b112e1296129baecf75a4b7a2d44",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Witnesses and health officials say dozens of Palestinians have been killed or wounded as desperate crowds headed toward food distribution points or airdrops in Gaza. Israel’s blockade and military offensive have made it nearly impossible to safely deliver aid. That's contributing to the territory’s slide toward famine nearly 22 months into the war with Hamas. Aid groups say Israel’s week-old measures to allow more aid in are far from sufficient. Families of hostages in Gaza fear starvation affects them too, but blame Hamas. The U.N. says several hundred Palestinians have been killed by Israeli fire since May while seeking food aid.",
      "publishedAt": "2025-08-04T15:54:17Z",
      "title": "Dozens killed as Palestinians in Gaza scramble for aid from air and land",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostages-gaza-08-04-2025-93bc19dab679685f995156b3619bd4a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/25f5979/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2F72%2F7edc4a596d5dd5f860c855789330%2F2aa56efdc795406f8337a79607b96f9d"
    },
    {
      "author": null,
      "description": "Tesla is awarding CEO Elon Musk 96 million shares of restricted stock valued at approximately $29 billion, just six months after a judge ordered the company to revoke his massive pay package. The electric vehicle maker said in a regulatory filing on Monday that Musk must first pay Tesla $23.34 per share of restricted stock that vests, which is equal to the exercise price per share of the 2018 pay package that was awarded to the company’s CEO. In December Delaware Chancellor Kathaleen St. Jude McCormick reaffirmed her earlier ruling that Tesla must revoke Musk’s multibillion-dollar pay package. She found that Musk engineered the landmark pay package in sham negotiations with directors who were not independent.",
      "publishedAt": "2025-08-04T11:12:58Z",
      "title": "Tesla awards CEO Musk millions of shares valued at about $29 billion",
      "url": "https://apnews.com/article/tesla-musk-1abc89c2a3a4f36c376788d8cab99728",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c808a5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F28%2Fe91629990a53bb14fe2bd91823cf%2F078ac54d9a424bf1bdca03dcab1ad0cb"
    },
    {
      "author": null,
      "description": "Brazil’s Supreme Court has ordered the house arrest for former President Jair Bolsonaro, who is on trial for an alleged coup plot after losing the 2022 election. Prosecutors accuse Bolsonaro of heading a criminal organization that plotted to overturn the election, including plans to kill President Lula and a Supreme Court justice. Monday’s order follows one from the top court, which last month ordered Bolsonaro to wear an electronic ankle monitor and imposed a curfew on his activities while the proceedings are underway.",
      "publishedAt": "2025-08-04T21:30:58Z",
      "title": "Brazil’s Supreme Court orders house arrest for former President Jair Bolsonaro",
      "url": "https://apnews.com/article/brazil-bolsonaro-house-arrest-coup-plot-trial-26e2be9eee08b7e6b9f006f0c5b706e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5445a72/2147483647/strip/true/crop/3744x2106+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F68%2Fdf12178979347f74c7f5623d142a%2F45e93e35abef4edfa7b000086cf12442"
    },
    {
      "author": null,
      "description": "Scientists have solved the mystery of what killed over 5 billion sea stars — also known as starfish — off the Pacific coast of North America. Starting in 2013, a wasting disease caused a mass die-off from Mexico to Alaska, devastating more than 20 species. The sunflower sea star was worst hit, losing around 90% of its population. Researchers have identified the culprit as a bacterium that also infects shellfish. The findings, published in Nature Ecology and Evolution, could help scientists intervene to save sea stars. This is crucial for Pacific ecosystems, as healthy starfish control sea urchin populations that threaten kelp forests.",
      "publishedAt": "2025-08-04T15:00:41Z",
      "title": "Scientists identify the killer of 5 billion starfish",
      "url": "https://apnews.com/article/sea-star-wasting-disease-epidemic-f2ab802ae8787618a5905c566d38e0c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/af0986c/2147483647/strip/true/crop/1698x955+0+89/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fe9%2Fd0b384aee8b7c758727940baafae%2F5d91d562d6544013a0310ca80547ea77"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}