{
  "articles": [
    {
      "author": "CHRIS MEGERIAN",
      "description": "Democrats are planning to fight President Donald Trump's efforts to pause federal grants and loans. The court battle will likely begin with a lawsuit from the New York attorney general. The funding freeze is scheduled to take effect Tuesday as Trump’s administration begins an across-the-board ideological review. Administration officials said the pause is necessary to ensure that spending complies with the president's executive orders. The Republican administration's decision could affect trillions of dollars and cause widespread disruption in health care research, education programs and other initiatives. Even grants that have been awarded but not spent are supposed to be halted. It’s unclear how sweeping the pause will be.",
      "publishedAt": "2025-01-28T12:44:43Z",
      "title": "Legal battle looms as Trump orders a funding freeze during a review of federal loans and grants",
      "url": "https://apnews.com/article/donald-trump-pause-federal-grants-aid-f9948b9996c0ca971f0065fac85737ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ebb43e/2147483647/strip/true/crop/5252x2954+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F6a%2F09123f0f5e13d9d5111301ac6cb1%2Fd6d49725e258467bbecd4048aeb09883"
    },
    {
      "author": "MARK SHERMAN, WILL WEISSERT",
      "description": "The Trump administration says it is offering buyouts to all federal employees who opt to leave their jobs by next week — an unprecedented move to shrink the U.S. government at breakneck speed. A memo Tuesday from the Office of Personnel Management, the government’s human resources agency, says it will begin subjecting all federal employees to “enhanced standards of suitability and conduct” and ominously warns of future downsizing. The email sent to employees says those who leave their posts voluntarily will receive about eight months of salary, but they have to chose to do so by Feb 6.",
      "publishedAt": "2025-01-28T22:59:33Z",
      "title": "President Trump offers buyout to all federal workers with 8 months' pay",
      "url": "https://apnews.com/article/trump-buyouts-to-all-federal-employees-f67f5751a0fd5ad8471806a5a1067b5e",
      "urlToImage": "https://dims.apnews.com/dims4/default/74bf431/2147483647/strip/true/crop/4143x2330+0+216/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Ff2%2F726063b1450f93f425992987800a%2Fe1317de814eb4c6084f4fe8c0e933802"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "Robert F. Kennedy’s famous name, populist stances and loyal following have earned him President Donald Trump’s support, but will that get him the votes he needs from the Republican-controlled Senate to become the nation’s top health official? If approved, Kennedy will control a $1.7 trillion agency that oversees food and hospital inspections, hundreds of health clinics, vaccine recommendations and health insurance for roughly half the country. His hearings are set before the Senate finance committee on Wednesday and the Health, Education, Labor and Pension committee on Thursday.",
      "publishedAt": "2025-01-29T05:09:25Z",
      "title": "What to know about RFK Jr.'s senate confirmation hearing to be health secretary",
      "url": "https://apnews.com/article/rfk-jr-nomination-when-where-to-watch-dacfabb9a43efac93bab058ad6a327d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad5e150/2147483647/strip/true/crop/3801x2138+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2Fdf%2F16a3b60fe660d834c6b2adf3a95b%2Fb4ec2d751b7942b49c8bf9a00d82da3f"
    },
    {
      "author": "KATE PAYNE",
      "description": "Florida lawmakers have passed a sweeping immigration bill, setting aside half a billion dollars in public funds to help carry out President Donald Trump’s crackdown on people in the country illegally. In a state where roughly one in every five residents is an immigrant, the legislation requires every level of government — as well as government contractors — to cooperate with federal immigration enforcement “to the fullest extent possible.” The passage of the bill sets up a showdown between Republican Gov. Ron DeSantis and the state’s legislative leaders, who have sparred over whose proposals would better carry out Trump’s immigration crackdown. DeSantis has called the bill “weak.”",
      "publishedAt": "2025-01-29T03:23:18Z",
      "title": "Florida lawmakers pass sweeping immigration bill to help with Trump crackdown",
      "url": "https://apnews.com/article/florida-immigration-bill-trump-crackdown-desantis-98ba7a205e71d308087f9861047fd7dd",
      "urlToImage": "https://dims.apnews.com/dims4/default/e57fe8f/2147483647/strip/true/crop/4899x2756+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F2a%2F6527881fe9b6e139bc62a8766141%2Fd845fa42d5824d04816d630d1d8e65fe"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "President Donald Trump has launched his second bid to oust all transgender troops from the military, and once again it will be headed to the courts to sort it out. Although the new order will affect only a tiny fraction of America’s 2.1 million service members, it has taken on oversized importance to Trump and his administration, who see transgender forces as a sign the military is “woke” or not focused on training and winning wars. But it was instantly condemned by a wide array of activist groups as exceptionally egregious and ultimately harmful to military readiness. They say transgender people have been serving successfully for years, including openly on and off for the past decade.",
      "publishedAt": "2025-01-29T05:02:16Z",
      "title": "Trump is looking to boot transgender troops from the military. Here's why that's complicated",
      "url": "https://apnews.com/article/military-transgender-ban-trump-courts-c66ae35b6b4a5a05731464d916557c4a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f60e378/2147483647/strip/true/crop/5202x2926+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F07%2Ff443c887d0275e14b890e0ac705b%2F81f18d2315ed45ddb6f6c59f4aecfca1"
    },
    {
      "author": "TARA COPP",
      "description": "Defense Secretary Pete Hegseth is pulling the security protections and clearance of retired Joint Chiefs chairman Gen. Mark Milley. He also ordered the Pentagon’s inspector general to review Milley’s actions while serving as the nation’s top uniformed officer to determine if a demotion is warranted, two defense officials confirmed late Tuesday. Milley served as chairman during President Donald Trump’s first term in office. While the relationship initially went well, it soured deeply and fast, as Milley tried to advise and contain the president on a host of issues. Hegseth’s chief of staff Joe Kasper said that the decision to strip Milley of his clearance and detail was taken because “undermining the chain of command is corrosive to our national security.\"",
      "publishedAt": "2025-01-29T09:49:02Z",
      "title": "Defense secretary pulls Trump critic Gen. Milley's security clearance and protective detail",
      "url": "https://apnews.com/article/milley-trump-security-detail-clearance-9bc8ebb7cd7cd2c334d00c97d4c142d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b12138/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F57%2Ffacd4ef8ac64a49c7c19537e34bd%2F469fd128916c4417ad8d3443e5a5db43"
    },
    {
      "author": "ABDEL KAREEM HANA, WAFAA SHURAFA, SAMY MAGDY",
      "description": "More than 375,000 Palestinians have made their way back to homes in northern Gaza after 15 months on the run because of war. The Abu Jarad family returned to Beit Lahiya Monday to find that the orange, olive and palm trees that once stood in front of their house were bulldozed away. The roses and jasmine flowers were also gone. The house itself was a hollowed-out shell. But it stood. At the sight of it, Ne’man Abu Jarad; his wife, Majida; and their six daughters dropped the bags they had been lugging since dawn, fell to their knees and prayed. After 477 days of hell — fleeing the length of the Gaza Strip, hiding from bombardment, scrounging for food and water – they were finally home.",
      "publishedAt": "2025-01-28T22:14:44Z",
      "title": "This is what one family in Gaza returned home to after 15 months of war",
      "url": "https://apnews.com/article/gaza-palestinians-return-home-ceasefire-2495de01d4581b92789171cad34b7dce",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a8f7fa/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F51%2Fcf454c01443a9be35c34f513196b%2F322fd2e0c4634dbbb8b34a0e73651a72"
    },
    {
      "author": "SAM MEDNICK",
      "description": "For more than 470 days, Eitan Gonen publicly pleaded with his daughter to stay alive while in Hamas captivity. He didn’t know if she would hear him, but he ended every interview he gave with the same hopeful message: Romi is coming home alive. When he finally got to speak to his daughter for the first time in 15 months after she and two other women were freed Jan. 19, he got his answer. “She said, ’Dad, I came home alive,‘” Eitan Gonen told The Associated Press on Tuesday in his first interview with an international news outlet since her release. As his daughter recuperates, Gonen is urging the Israeli government to continue working to free the remaining Israeli hostages.",
      "publishedAt": "2025-01-29T05:26:44Z",
      "title": "Israeli father says even in Hamas captivity, his daughter heard his pleas to come home alive",
      "url": "https://apnews.com/article/hostages-ceasefire-israel-romi-gonen-dc257f0138b02f1dc23168c8bd46bd11",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5d9822/2147483647/strip/true/crop/4416x2484+0+230/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F24%2F6093ca373800735529a9c6cbc5c8%2F1b2bab5c8af44bc4b2cbd3423d54d02d"
    },
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump plans to sign the Laken Riley Act into law as his administration's first piece of legislation. Trump will sign the immigrant detention measure on Wednesday. It mandates the detention and potential deportation of people in the U.S. illegally who are accused of theft and violent crimes before they have actually been convicted. The Laken Riley Act was named for a Georgia nursing student who was killed in 2024 while out for a run by a Venezuelan national in the U.S. illegally. The measure swiftly passed the Republican-controlled Congress with some Democratic support. Immigrant advocates say it could trigger mass roundups over offenses as minor as shoplifting.",
      "publishedAt": "2025-01-29T05:17:27Z",
      "title": "Trump plans to sign the Laken Riley Act into law as his administration's first piece of legislation",
      "url": "https://apnews.com/article/trump-signs-laken-riley-act-immigration-crackdown-30a34248fa984d8d46b809c3e6d8731a",
      "urlToImage": "https://dims.apnews.com/dims4/default/8559ad5/2147483647/strip/true/crop/8078x4544+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F9e%2F63e9875ec7293a1af5b2557dac65%2Ff1b47618dcd9498ab1f05d16bed47680"
    },
    {
      "author": "RAJESH KUMAR SINGH, SHEIKH SAALIQ",
      "description": "Several people are feared dead and many more injured as tens of thousands of Hindus rushed to take a holy bath in the river at the massive Maha Kumbh festival in India. Distressed families lined up outside a hospital inquiring about their relatives, rescuers were helping the injured as police tried to manage the crowds. Local reports said as many as 10 people had died. People had gathered to bathe at the confluence of the Ganges, the Yamuna and the mythical Saraswati rivers. Authorities expect 400 million people over the six weeks of the festival. A sprawling tent city was built for them, with 50,000 security personnel to maintain order and manage crowds.",
      "publishedAt": "2025-01-29T00:31:56Z",
      "title": "Maha Kumbh Mela India: Several feared dead in stampede at Prayagraj",
      "url": "https://apnews.com/article/india-maha-kumbh-hinduism-stampede-da4a3423bf2fd1c06f7c730e65dc1350",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb5a8ce/2147483647/strip/true/crop/5590x3144+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2Ffc%2Fca47ab69e00c2ce1ca09ac9f80e3%2F656be9035ab54285b57b63dd554aa379"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}