{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The tense cease-fire between Israel and Hamas appeared to be back on track early Sunday after the release of a second group of militant-held hostages and Palestinians from Israeli prisons, but the swap followed an hourslong delay that underscored the truce's fragility.",
      "publishedAt": "2023-11-26T07:30:14Z",
      "title": "Fragile Gaza truce is back on track after hourslong delay in hostage-for-prisoner swap",
      "url": "https://apnews.com/556b251fadc25a234a499e957edd218d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af79a97536404f8fbdcd2a4689b129d1/1920.jpeg"
    },
    {
      "author": "MAJDI MOHAMMED and TIA GOLDENBERG",
      "description": "JENIN REFUGEE CAMP, West Bank (AP) — Israeli forces operating in the occupied West Bank killed at least eight Palestinians, including at least one militant, in a 24-hour period, Palestinian health officials said Sunday, as a fragile pause in fighting between Israel and Hamas in the Gaza Strip entered its third day.",
      "publishedAt": "2023-11-26T07:53:57Z",
      "title": "Israeli forces kill at least 8 Palestinians in surging West Bank violence, health officials say",
      "url": "https://apnews.com/3deed25c4c14a5e3048778cbc79523c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d406ff4b26174d24a51c853e2273835f/3000.jpeg"
    },
    {
      "author": "ERIKA KINETZ",
      "description": "In audio intercepts from the front lines in Ukraine, Russian soldiers speak in shorthand of 200s to mean dead, 300s to mean wounded. The urge to flee has become common enough that they also talk of 500s — people who refuse to fight.",
      "publishedAt": "2023-11-26T05:47:42Z",
      "title": "Dead, wounded or AWOL: The voices of desperate Russian soldiers trying to get out of the Ukraine war",
      "url": "https://apnews.com/d2418788051731a32689feb821cd29ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f48793f42794a7897c3ff5be7632563/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — In a city known for its excesses, whether reaching toward the sky with the world's tallest building or hard partying at its beach resorts and bars, Dubai has pulled off another record-breaking feat in the rolling dunes of its desert outskirts.",
      "publishedAt": "2023-11-26T05:05:27Z",
      "title": "Skyscraper-studded Dubai has flourished during regional crises. Could it benefit from hosting COP28?",
      "url": "https://apnews.com/113f2b2c75431d2ab0d3d54be1681239",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a48108703c346b7a0c4d42faf791c96/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — One of the world’s largest icebergs is drifting beyond Antarctic waters, after being grounded for more than three decades, according to the British Antarctic Survey.The iceberg, known as A23a, split from the Antarctic's Filchner Ice Shelf in 1986.",
      "publishedAt": "2023-11-25T17:16:31Z",
      "title": "One of world's largest icebergs drifting beyond Antarctic waters after it was grounded for 3 decades",
      "url": "https://apnews.com/b6fcfc99939659aaa26fdba0b3e17f1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/604dcad693c74a548c1096df36774ed6/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and BILL BARROW",
      "description": "COLUMBIA, S.C. (AP) — Donald Trump used college football rivalry weekend to bask among his supporters in a state and region that are key to his presidential fortunes, while trying to upstage his Republican opponent Nikki Haley on her home turf at the Clemson-South Carolina football game.",
      "publishedAt": "2023-11-25T05:03:54Z",
      "title": "Donald Trump draws cheers, some boos in Haley's backyard at Clemson-South Carolina football game",
      "url": "https://apnews.com/62ca25d5ad44bb8f1fb352805b3bcd2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6d4fc6622734642b8dcee1ba2757c9b/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — The top diplomats from South Korea, Japan and China met Sunday to discuss when to resume their leaders’ trilateral summit after a four-year hiatus and how to strengthen cooperation among the three Northeast Asian neighbors.",
      "publishedAt": "2023-11-26T07:07:52Z",
      "title": "Top diplomats of South Korea, Japan and China meet to restart trilateral summit, revive cooperation",
      "url": "https://apnews.com/5914cd54c2c3ce247d6872dd32a41dae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31700338da9945058d5e7fc5acfecb0a/3000.jpeg"
    },
    {
      "author": "SHONAL GANGULY",
      "description": "NEW DELHI (AP) — More than 2,000 people took part in a gay pride event in New Delhi, waving rainbow flags and multicolored balloons as they celebrated sexual diversity in India but also raised concerns over the country's restrictive laws.",
      "publishedAt": "2023-11-26T10:57:27Z",
      "title": "India's LGBTQ+ community holds pride march, raises concerns over country's restrictive laws",
      "url": "https://apnews.com/c9e8093f47409253e6fa2277fd55854e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d68f9d229ca740ee9b36a21f39c3cf89/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK AND TRISHA AHMED",
      "description": "MINNEAPOLIS (AP) — An attorney for Derek Chauvin, the former Minneapolis police officer convicted of murdering George Floyd, said Saturday that Chauvin's family has been kept in the dark by federal prison officials after he was stabbed in prison.",
      "publishedAt": "2023-11-25T19:18:57Z",
      "title": "Derek Chauvin's family has received no updates after prison stabbing, attorney says",
      "url": "https://apnews.com/23c704a8cd441d270b7b542e835b69fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadee3019ddf47ebae68c654d55f1e30/2540.jpeg"
    },
    {
      "author": "FRANK BAJAK",
      "description": "NATIONAL HARBOR, Md. (AP) — Artificial intelligence employed by the U.S. military has piloted pint-sized surveillance drones in special operations forces’ missions and helped Ukraine in its war against Russia.",
      "publishedAt": "2023-11-25T15:50:10Z",
      "title": "Pentagon's AI initiatives accelerate hard decisions on lethal autonomous weapons.",
      "url": "https://apnews.com/0773b4937801e7a0573f44b57a9a5942",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01a19ae6ec0b451a85cf81f10fc5ff34/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}