{
  "articles": [
    {
      "author": "TIA GOLDENBERG, JON GAMBRELL and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — The White House on Sunday said U.S. President Joe Biden had again spoken with Israeli Prime Minister Benjamin Netanyahu as pressure builds on Israel and Hamas to reach a deal that would free some Israeli hostages and bring a cease-fire in the nearly seven-month-long war in Gaza.",
      "publishedAt": "2024-04-28T08:41:07Z",
      "title": "Biden and Netanyahu speak as pressure's on Israel over planned Rafah invasion and cease-fire talks",
      "url": "https://apnews.com/78410c1eaf671008cd60dccc00b44ee4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3f9f3af5ae84fb0991f98b03c70e762/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER WEBER, CAROLYN THOMPSON and MARGERY BECK",
      "description": "LOS ANGELES (AP) — Protests are roiling college campuses across the U.S. as upcoming graduation ceremonies are threatened by disruptive demonstrators, with students and others sparring over Israel's military offensive in Gaza and its mounting death toll.",
      "publishedAt": "2024-04-29T04:57:22Z",
      "title": "Demonstrations roil US campuses ahead of graduations as protesters spar over Gaza conflict",
      "url": "https://apnews.com/19ed919ff6ff9573a8add4ec67e26181",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bcb323897a14437893b2a4f380489de/1920.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — College students taking up space and making demands for change. University administrators facing pressure to get things back under control. Police brought in to make arrests. At other schools: students taking note, and sometimes taking action.",
      "publishedAt": "2024-04-29T04:05:21Z",
      "title": "How Columbia University's complex history with the student protest movement echoes into today",
      "url": "https://apnews.com/505f9da3aef5ce7a9f7d6eb962dacb5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ce050936b594e83881ae7cdca0ab04c/2913.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "RIYADH, Saudi Arabia (AP) — U.S. Secretary of State Antony Blinken on Monday begins his seventh diplomatic mission to the Middle East since the Israel-Hamas war began more than six months ago.",
      "publishedAt": "2024-04-29T04:02:50Z",
      "title": "Blinken is back in the Middle East this week. He has his work cut out for him",
      "url": "https://apnews.com/c0425791dc59e745021d3dd726dc8f09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b19f3a3f83b46d1820d73a2ec542653/3000.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "SULPHUR, Okla. (AP) — Small towns in Oklahoma began a long cleanup Monday after tornadoes flattened homes and buildings and killed four people, including an infant, widening a destructive outbreak of severe weather across the middle of the U.S.",
      "publishedAt": "2024-04-29T05:02:50Z",
      "title": "Oklahoma towns hard hit by tornadoes begin long cleanup after 4 killed in weekend storms",
      "url": "https://apnews.com/5fa3a64e552ab91e8d76dabe21f70fd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef4b5e6696bf47d69a869102f5b7a441/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden is out to win votes by scoring some laughs at the expense of Donald Trump, unleashing mockery with the goal of getting under the former president's thin skin and reminding the country of his blunders.",
      "publishedAt": "2024-04-28T14:03:19Z",
      "title": "Have you heard the one about Trump? Biden tries humor on the campaign trail",
      "url": "https://apnews.com/936815b539a3e541a03db16ba0807c6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0881bf3a342d4698893c2dd1fbd2d7e0/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — U.S. intelligence officials have determined that Russian President Vladimir Putin likely didn’t order the death of imprisoned opposition leader Alexei Navalny in February, according to an official familiar with the determination.",
      "publishedAt": "2024-04-28T20:17:20Z",
      "title": "Putin likely didn’t order death of Russian opposition leader Navalny, US official says",
      "url": "https://apnews.com/0ed248bbe00a707b1a1b4ce1d61fcc9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fe1f7dab9324034b11d51d20f646ce9/2985.jpeg"
    },
    {
      "author": "RIAZAT BUTT and ADIL JAWAD",
      "description": "KARACHI, Pakistan (AP) — Born and raised in Pakistan to parents who fled neighboring Afghanistan half a century ago, an 18-year-old found himself at the mercy of police in Karachi who took his cash, phone and motorbike, and sent him to a deportation center.",
      "publishedAt": "2024-04-29T04:07:14Z",
      "title": "Millions of Afghans made Pakistan home to escape war. Now many are hiding to escape deportation",
      "url": "https://apnews.com/9928247ac8cbfe9efe33e60564937121",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d3ca0468e4b4014b6bbd6d49e5d2dfb/3000.jpeg"
    },
    {
      "author": "CIARÁN GILES",
      "description": "MADRID (AP) — Spain is in nail-biting suspense Monday as it waits for Prime Minister Pedro Sánchez to announce whether he will continue in office or not.",
      "publishedAt": "2024-04-29T04:10:36Z",
      "title": "Spain is in suspense waiting for Pedro Sánchez to say whether he will resign or stay in office",
      "url": "https://apnews.com/f69907e614c0558b9709d09c5d75967c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c363db71a50046208a510e48123562aa/3000.jpeg"
    },
    {
      "author": "VICTORIA MILKO",
      "description": "JAKARTA, Indonesia (AP) — From trees felled in protected national parks to massive swaths of jungle razed for palm oil and paper plantations, Indonesia had a 27% uptick in primary forest loss in 2023 from the previous year, according to a World Resources Institute analysis of deforestation data.",
      "publishedAt": "2024-04-29T02:06:27Z",
      "title": "Deforestation in Indonesia spiked last year, but resources analyst sees better overall trend",
      "url": "https://apnews.com/48a4503e383a52e4dbbee81209c87887",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ded3fa3b74845caaf189f63afd583f7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}