{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "President Donald Trump confirmed tariffs on goods from Mexico paused by a month for negotiations, hours before they were to take effect.",
      "publishedAt": "2025-02-03T11:18:00Z",
      "title": "Live updates: Trump agrees to pause tariffs on Mexico for a month",
      "url": "https://apnews.com/live/trump-presidency-updates-day-15",
      "urlToImage": "https://dims.apnews.com/dims4/default/ecefae1/2147483647/strip/true/crop/5416x3047+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F43%2Fdebb99ab4269a7bd810785132ef3%2Fap25034030462557.jpg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "Staffers of the U.S. Agency for International Development have been instructed to stay out of its Washington headquarters after billionaire Elon Musk announced President Donald Trump had agreed with him to shut the agency. That's according to a notice distributed to the staffers early Monday. USAID staffers say they tracked 600 employees who reported being locked out of the agency’s computer systems overnight. Those still in the system received emails saying “at the direction of Agency leadership” the headquarters building “will be closed to Agency personnel on Monday, Feb. 3.” The developments come after Musk said he'd spoken with Trump about the U.S. aid and development agency and the Republican president agreed they should shut it.",
      "publishedAt": "2025-02-03T11:29:28Z",
      "title": "USAID notice instructs staffers to stay out of its headquarters",
      "url": "https://apnews.com/article/trump-musk-usaid-c0c7799be0b2fa7cad4c806565985fe2",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ab7c96/2147483647/strip/true/crop/3766x2118+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2Fee%2F0997bcaf57345565945c51712359%2Fd3a4fab52dc143bc9473fc6c9b40ff39"
    },
    {
      "author": "YURI KAGEYAMA, MATT OTT",
      "description": "Worries about President Donald Trump’s tariffs are hurting U.S. stocks. The S&P 500 sank 1.4% in early Monday trading following similar losses for markets across Asia and Europe. The Dow Jones Industrial Average fell 435 points, and the Nasdaq composite dropped 1.8%. Everything from bitcoin to the Mexican peso fell, not just stocks of the U.S. companies expected to be the first to feel pain from tariffs on goods imported from Canada, Mexico and China. Some of the sharpest losses hit Big Tech and stocks that would be hurt most by higher interest rates and the worse inflation that could result from tariffs. Oil rose.",
      "publishedAt": "2025-02-03T03:38:46Z",
      "title": "Wall Street drops as Trump's tariffs hit markets worldwide; Dow down 435 points",
      "url": "https://apnews.com/article/stock-market-trump-tariffs-5f365936ea9bdf45a0460556f3a5f4e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/29f769e/2147483647/strip/true/crop/5323x2994+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F50%2Fd55790e81b49c6ac6eb1ddbf36c3%2Fe52136739eca462c8e97b0fbfc4c204b"
    },
    {
      "author": "BILL BARROW",
      "description": "President Donald Trump has taken executive action to impose new tariffs on imports from Canada, China and Mexico. The move fulfills campaign promises but also sparked retaliatory moves that could signal an extended trade war with key trading partners and, in the case of Mexico and Canada, the closest U.S. neighbors and allies. Unlike during the 2024 campaign, when Trump billed his economic agenda as a sure-fire way to reduce the cost of living for American workers, the president now is acknowledging what many economists have long forecasted: the levies could yield higher prices and lower supplies across the market.",
      "publishedAt": "2025-02-02T19:20:39Z",
      "title": "What to know about Trump's tariffs targeting Canada, Mexico and China",
      "url": "https://apnews.com/article/trumps-tariffs-canada-mexico-china-taxes-910cf9a18fce654597a30dbaaa8d1576",
      "urlToImage": "https://dims.apnews.com/dims4/default/25d1b64/2147483647/strip/true/crop/3000x1688+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F6e%2F8edc95838ac17634cbd62e9139ad%2F1c83fbaab2e84da4998433ecac6f262e"
    },
    {
      "author": "Maria Cheng, JAMEY KEATEN",
      "description": "The World Health Organization chief is asking global leaders to lean on Washington to reverse President Donald Trump’s decision to withdraw from the U.N. health agency. WHO Director-General Tedros Adhanom Ghebreyesus said in a closed-door meeting with diplomats last week that the U.S. will be hurt by a lack of access to critical information about global disease outbreaks. Internal materials obtained by The Associated Press show countries pressed WHO about how it might cope with the exit of its biggest donor. A confidential budget document showed WHO’s health emergencies program has a “heavy reliance” on American cash and that emergency operations in the Middle East, Ukraine and Sudan would be the most affected.",
      "publishedAt": "2025-02-03T06:00:06Z",
      "title": "WHO chief asks countries to push Washington to reconsider its withdrawal",
      "url": "https://apnews.com/article/who-trump-tedros-global-health-a2eafc341cd2200e8800a2421d30bdfc",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd9d482/2147483647/strip/true/crop/4310x2424+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2Fd0%2Fade71f06400ed6e3a067e21d0fd6%2F06c689833bfc412892938bd88f9e463a"
    },
    {
      "author": "JIM MUSTIAN, BRETT MARTEL",
      "description": "Hundreds of internal emails show executives of the New Orleans Saints were far more involved than previously known in providing public relations help to Catholic church leaders as they confronted a clergy sex abuse crisis. The emails sharply undercut assurances the Saints provided five years ago when they asserted they had provided only “minimal” assistance to the Archdiocese of New Orleans. Survivors of clergy abuse say they're disgusted by the team's involvement. The Saints said in a statement Friday that the team does not condone sex abuse. They also criticized the media for using leaked emails to misconstrue what they called “a well-intended effort.”",
      "publishedAt": "2025-02-03T11:46:52Z",
      "title": "NFL emails reveal extent of Saints' damage control for clergy sex abuse crisis",
      "url": "https://apnews.com/article/new-orleans-saints-catholic-church-sex-abuse-77f92deb50e6333fa04a9db1897f8171",
      "urlToImage": "https://dims.apnews.com/dims4/default/36c6e1e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fd4%2Fc421d3fedae058c2734626f37801%2Fd06dd9217ee5435b81773f886fc22f38"
    },
    {
      "author": "DAVID R. MARTIN, MICHAEL R. SISAK, CLAUDIA LAUER",
      "description": "Crews are on the scene on the Potomac River to retrieve the submerged wreckage of an airliner and an Army helicopter that collided midair in the deadliest U.S. air disaster since 2001. Col. Francis B. Pera of the Army Corps of Engineers says portions of the aircraft will be loaded onto flatbed trucks and taken to a hangar for further investigation. Crews are expected to begin the work of lifting the wreckage on Monday and at daybreak they could be seen aboard a vessel with a crane. Authorities say they have recovered the remains of 55 of the 67 people killed in Wednesday's collision.",
      "publishedAt": "2025-02-03T13:27:33Z",
      "title": "Crews return to the Potomac River to recover wreckage from DC midair collision",
      "url": "https://apnews.com/article/washington-plane-crash-helicopter-recovery-958ac5e48c5061625718a5a4280608f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c181b5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F24%2Ffc914a2b778b198a2966c495d40f%2F5a2a313e5cb24c67ad4cd67035458354"
    },
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump says Americans could feel “some pain” from the emerging trade war triggered by his tariffs against Canada, Mexico and China. He's also claiming that Canada would “cease to exist” without its trade surplus with the United States. The trade penalties that Trump signed Saturday at his Florida resort are causing a mix of panic, anger and uncertainty. And they're threatening to rupture a decades-old partnership on trade in North America while further straining relations with China. But by following through on a campaign pledge, Trump may have simultaneously broken his promise to voters in last year’s election that his administration could quickly reduce inflation. The tariffs are set to launch on Tuesday.",
      "publishedAt": "2025-02-02T15:59:51Z",
      "title": "Trump says Americans could feel 'some pain' from his new tariffs",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-trade-surplus-3010e6368545e2976feb5ac6b41e528e",
      "urlToImage": "https://dims.apnews.com/dims4/default/cae9348/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2Fda%2F725a80e73ebfe411d5ef8d4f098c%2Fb7a0362c4822401e89edc6f790ef7897"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "Early Monday, billionaire Trump advisor Elon Musk held a live session on X Spaces, previously known as Twitter Spaces, and said that he spoke in detail about USAID with the president. The Trump administration has already placed two top security chiefs at the U.S. Agency for International Development on leave after they refused to turn over classified material in restricted areas to Musk’s government-inspection teams. That's according to a current and a former U.S. official with knowledge of the incident who spoke on condition of anonymity. The former official says members of Musk’s Department of Government Efficiency — known as DOGE — eventually did gain access Saturday to the agency’s classified information, which includes intelligence reports.",
      "publishedAt": "2025-02-02T17:31:31Z",
      "title": "USAID security chiefs put on leave after trying to keep DOGE from classified info",
      "url": "https://apnews.com/article/doge-musk-trump-classified-information-usaid-security-35101dee28a766e0d9705e0d47958611",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ab7c96/2147483647/strip/true/crop/3766x2118+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2Fee%2F0997bcaf57345565945c51712359%2Fd3a4fab52dc143bc9473fc6c9b40ff39"
    },
    {
      "author": "KAREEM CHEHAYEB, OMAR ALBAM",
      "description": "Hospitals workers say at least 19 people were killed all but one of them women when a car bomb exploded on the outskirts of a northern Syrian city. The car detonated Monfay next to a vehicle carrying mostly female agricultural workers on the outskirts of the city of Manbij. A nurse said the dead included 18 women and one man. Another 15 women were wounded, some of them in critical condition. No group immediately claimed responsibility for the explosion. Manbij in northeastern Aleppo province continues to witness violence even after the downfall of President Bashar Assad in December.",
      "publishedAt": "2025-02-03T07:31:34Z",
      "title": "At least 19 killed mostly women in a car bomb explosion in northern Syria",
      "url": "https://apnews.com/article/syria-manbij-bombing-assad-c75d54d0361f6a474b69c6d813eb5c70",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c130dd/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F35%2F190e109f99f3d233e2d3fc06a32c%2F9a219116bd4e4d8a8de5b89c7de98929"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}