{
  "articles": [
    {
      "author": "KIRSTEN GRIESHABER, GEIR MOULSON and VANESSA GERA",
      "description": "MAGDEBURG, Germany (AP) — A 9-year-old was among five people killed when a Saudi doctor drove into a Christmas market teeming with holiday shoppers in the German city of Magdeburg, an official said Saturday, as people mourned the victims and their shaken sense of security.",
      "publishedAt": "2024-12-21T07:18:27Z",
      "title": "A 9-year-old is among 5 killed in the Christmas market attack in Germany",
      "url": "https://apnews.com/32ec923f21cccb2a34e287da42ced921",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44b8338506c14b2cbc4273b509a3dd17/3000.jpeg"
    },
    {
      "author": "SARA ABOUBAKR",
      "description": "CAIRO (AP) — Authorities have not formally named the suspect in the car ramming in the city of Magdeburg that killed at least five people and wounded hundreds, saying only that he is a Saudi doctor who has lived in Germany for nearly two decades and that he acted alone.",
      "publishedAt": "2024-12-21T11:43:10Z",
      "title": "What we know about the suspect behind the German Christmas market attack",
      "url": "https://apnews.com/31987cebcd72ab6781da2edf15dc6538",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ec0a4eb451648269554d0cf7c01c06b/1566.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and MATT BROWN",
      "description": "WASHINGTON (AP) — President Joe Biden signed a bill into law Saturday that averts a government shutdown, bringing a final close to days of upheaval after Congress approved a temporary funding plan just past the deadline and refused President-elect Donald Trump’s core debt demands in the package.",
      "publishedAt": "2024-12-21T16:20:54Z",
      "title": "Biden signs bill that averts government shutdown and brings a close to days of Washington upheaval",
      "url": "https://apnews.com/5a78b3c8c7aedc9384842fae83d78f5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bdd22bd00b1447794c23adea2607bd5/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and WAAFA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — A rocket fired from Yemen hit an area of Tel Aviv overnight, leaving 16 people injured by shattered glass, the Israeli military said Saturday, days after Israeli airstrikes hit Houthi rebels who have been launching missiles in solidarity with Palestinians in Gaza.",
      "publishedAt": "2024-12-21T07:39:32Z",
      "title": "A rocket from Yemen strikes Tel Aviv, injuring 16, and Palestinians mourn a dozen children in Gaza",
      "url": "https://apnews.com/bffc2f7ae556942e2e6760720d63038c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27ebbf20e5784e2094accca1f247bde7/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A nearly two-year investigation by Democratic senators of Supreme Court ethics details more luxury travel by Justice Clarence Thomas and urges Congress to establish a way to enforce a new code of conduct.",
      "publishedAt": "2024-12-21T12:09:19Z",
      "title": "Senate review of Supreme Court ethics finds more luxury trips and urges enforceable code of conduct",
      "url": "https://apnews.com/5669f8f02b843be31d474a075cd50666",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ceeed4af9b404f0f977295136f507107/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — The U.S. flu season is underway, with cases surging across much of the country, health officials said Friday.",
      "publishedAt": "2024-12-20T17:34:56Z",
      "title": "US flu season is underway, as cases surge in some areas and vaccinations lag",
      "url": "https://apnews.com/1d44ab79d0c3172981397a62767680be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95c9975d2e134ccb83c748d0b81bf313/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The Senate passed legislation early Saturday to boost Social Security payments for millions of people, pushing a longtime priority for former public employees through Congress in one of its last acts for the year.",
      "publishedAt": "2024-12-21T01:49:06Z",
      "title": "Senate passes Social Security benefits boost for many public service retirees",
      "url": "https://apnews.com/565aaf221de6d607f207e286655eef25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03a47f808fb344119a0f3100b6348269/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "DAMASCUS, Syria (AP) — The toppling of Bashar Assad has raised tentative hopes that Syrians might live peacefully and as equals after a half century of authoritarian rule.While there have been bursts of deadly sectarian violence in the days since Assad was ousted, it’s nothing close to what was feared after nearly 14 years of civil war.",
      "publishedAt": "2024-12-21T05:00:05Z",
      "title": "Sectarian violence in Syria has been less intense than feared since Assad's ouster",
      "url": "https://apnews.com/6fef01639ed9833f9421c1a88abc61cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e26d1850b8604673862507d33607475b/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis is suffering from a cold and will deliver his Sunday blessing from indoors, the Vatican said, announcing the precautions ahead of a busy Christmas period and launch of the Holy Year that will sorely test Francis' stamina and health.",
      "publishedAt": "2024-12-21T09:49:34Z",
      "title": "Pope has a cold and will skip outdoor Sunday prayer ahead of a busy week",
      "url": "https://apnews.com/5ac7663e90e382a7f2f11644a31598ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc8f24edff954024bc88969b559e33ad/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Holiday lights are everywhere – and everywhere they look a little different. In recent weeks, Associated Press photographers have captured glistening scenes around the globe.In Jemez Springs, New Mexico, traditional luminarias, also known as farolitos, flickered through the Jemez Historic Site during last week’s annual Lights of Gisewa event.",
      "publishedAt": "2024-12-21T14:07:52Z",
      "title": "AP PHOTOS: Holiday lights illuminate the world",
      "url": "https://apnews.com/f3bab9c5c7b9cfeb43a126a6d84d7cc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70aabcac230f4b959ddfa57cdbd0d42d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}