{
  "articles": [
    {
      "author": null,
      "description": "PHILADELPHIA (AP) — AP sources: Beyoncé, whose song 'Freedom' is Harris campaign anthem, is expected to be at Harris' Houston rally Friday.",
      "publishedAt": "2024-10-24T15:19:11Z",
      "title": "AP sources: Beyoncé, whose song 'Freedom' is Harris campaign anthem, is expected to be at Harris' Houston rally Friday",
      "url": "https://apnews.com/9ab13dc5e84ddee925dea99b180253ec",
      "urlToImage": ""
    },
    {
      "author": "WAFAA SHURAFA, FARNOUSH AMIRI and FATMA KHALED",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike on a school where displaced people were sheltering in the central Gaza Strip killed at least 17 people on Thursday, nearly all women and children, Palestinian medical officials said.",
      "publishedAt": "2024-10-24T10:28:17Z",
      "title": "Israeli strike on Gaza shelter kills 17 as Blinken says cease-fire talks will resume",
      "url": "https://apnews.com/ab2b634abca70923712a655cd097a421",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ad6cd6334c64c03a216fd65a5d08fa2/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Inside what was once one of Beirut’s oldest and best-known cinemas, dozens of Lebanese, Palestinians and Syrians displaced by the Israel-Hezbollah war spend their time following the news on their phones, cooking, chatting and walking around to pass the time.",
      "publishedAt": "2024-10-24T04:17:01Z",
      "title": "Massive displacement from Israel-Hezbollah war transforms Beirut’s famed commercial street",
      "url": "https://apnews.com/582c617d6d3b8639c8c8ddec4a6916b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ce45511877f4b938965742aaea4001f/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — An international conference for Lebanon in Paris on Thursday raised $1 billion in pledges for humanitarian aid and military support to help the country where war between Hezbollah militants and Israel has displaced a million people, killed over 2,500, and deepened an economic crisis, French organizers said.",
      "publishedAt": "2024-10-24T04:15:58Z",
      "title": "The Paris conference for Lebanon raises $1 billion in pledges for humanitarian and military support",
      "url": "https://apnews.com/30a97f88d2ec8dc138385d18a31dbb69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7489d2f670ed4a0fb67a5ea3f1ccbff6/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Among the legacy news outlets that have come up empty in their efforts to interview Kamala Harris and Donald Trump during the general election campaign: NPR, The New York Times, PBS and The Washington Post.",
      "publishedAt": "2024-10-24T04:05:13Z",
      "title": "By moving to podcasts, Harris and Trump are turning away from legacy media to spread their messages",
      "url": "https://apnews.com/a5a0870943177ea9320389748fe2fa5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e352c884f25042f9a2ed9129473563c9/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The last time Donald Trump ran for president, the lawyers most directly involved in his efforts to overturn the election wound up sanctioned, criminally prosecuted or even sued for millions of dollars.",
      "publishedAt": "2024-10-24T04:08:59Z",
      "title": "The RNC is rebuilding its legal operation after Trump allies' failed effort to undo the 2020 race",
      "url": "https://apnews.com/13d24822cc4899e5934a07661fe649e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5188ae37741a4996bfcc60323ee699fb/2717.jpeg"
    },
    {
      "author": "HOLLY RAMER",
      "description": "CONCORD, N.H. (AP) — One of the nation's most competitive gubernatorial races has also become intensely personal.None of the nation’s 12 female governors are up for reelection, but five women are running as major party gubernatorial nominees in four states.",
      "publishedAt": "2024-10-24T04:08:48Z",
      "title": "With 2 women running, the New Hampshire governor's race is both close and personal",
      "url": "https://apnews.com/7278f7ce2528cbecf492185cc5130ddb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9168a1bf4d3748e7b1a381383b6cb9bd/3000.jpeg"
    },
    {
      "author": null,
      "description": "KAZAN, Russia (AP) — Russian President Vladimir Putin on Thursday presided at the closing session of a summit of the BRICS bloc of developing economies, praising its role as a counterbalance to what he called the West's “perverse methods.\"",
      "publishedAt": "2024-10-24T09:21:59Z",
      "title": "Putin presides over BRICS summit seeking to expand Russia's clout",
      "url": "https://apnews.com/31a4a4af22e9475aee322f2045701fc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4613529747164a3aaf2007e7f0bbea2c/1920.jpeg"
    },
    {
      "author": "RODNEY MUHUMUZA and GASPARD MAHEBURWA",
      "description": "NGOZI, Burundi (AP) — The hug between the two women looked like it would last forever. A spirited 85-year-old had embraced a younger woman she hadn’t seen for months, and she chanted a number of questions in the peculiar yodeling routine of her ancestors.",
      "publishedAt": "2024-10-24T04:43:48Z",
      "title": "A melodic greeting between women in Burundi is at risk of being lost",
      "url": "https://apnews.com/74675c26a8ce968cac945885604b38d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdcf84c4b6a3496eb8835639f1c419ef/1920.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA",
      "description": "For baseball fans, “Fernandomania” marked a flash of pitching brilliance, the emergence of a unique talent in the history of one of the sport's most storied franchises.",
      "publishedAt": "2024-10-24T10:00:24Z",
      "title": "Dodgers pitcher Fernando Valenzuela served as a cultural ambassador for Mexican Americans, Mexicans",
      "url": "https://apnews.com/238af9e66beb0b32c3ab81d75dfb0d09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/167aa5f3eb1d4a8d95b050dc74e466c2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}