{
  "articles": [
    {
      "author": "DAVID SHARP",
      "description": "LEWISTON, Maine (AP) — A man shot and killed at least 16 people at a restaurant and a bowling alley in Lewiston, Maine, on Wednesday and then fled into the night, sparking a massive search by hundreds of officers while frightened residents stayed locked in their homes.",
      "publishedAt": "2023-10-26T00:24:51Z",
      "title": "At least 16 dead in Maine mass killing and police hunt for the shooter as residents take shelter",
      "url": "https://apnews.com/49da6d06a8b5a15d3b619b3927bc33ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfdae8680cbb4451b3b88976b7d4cf86/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The latest mass killing in the U.S. happened Wednesday night in Lewiston, Maine, when a man opened fire at a bowling alley and a bar, killing at least 16 people, two law enforcement officials told The Associated Press.",
      "publishedAt": "2023-10-26T03:44:32Z",
      "title": "A list of mass killings in the United States since January",
      "url": "https://apnews.com/8eea3427796229eb127e052b3c66c691",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a6ea23d333241e096e4ad276b2b9e01/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and AMY TEIBEL",
      "description": "RAFAH, Gaza Strip (AP) — Israeli troops and tanks launched an hourslong ground raid into northern Gaza overnight into Thursday, the military said, striking several militant targets in order to \"prepare the battlefield\" before a widely expected ground invasion after more than two weeks of devastating airstrikes.",
      "publishedAt": "2023-10-26T05:41:33Z",
      "title": "Israeli troops carry out an hourslong ground raid into Gaza before an expected wider incursion",
      "url": "https://apnews.com/2964c54724e0e80382dd29756b3427bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa3c7f1fe6f4430f968c6f9d4252c4a9/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and WAFAA SHURAFA",
      "description": "DEIR AL BALAH, Gaza Strip (AP) — Mahmoud Shalabi did not evacuate his home in northern Gaza despite the frightful Israeli warnings of a looming, far more brutal assault to come as it presses ahead with its war against the Hamas militant group.",
      "publishedAt": "2023-10-26T03:59:39Z",
      "title": "Fearing airstrikes and crowded shelters, Palestinians in north Gaza defy Israeli evacuation orders",
      "url": "https://apnews.com/36109635f7bc90f403f0383d53a352e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44847505a81d4e5a9bb831cae53696d8/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "The new leader of one of the chambers of Congress that will certify the winner of next year's presidential election helped spearhead the attempt to overturn the last one, raising alarms that Republicans could try to subvert the will of the voters if they remain in power despite safeguards enacted after the 2021 attack on the U.S.",
      "publishedAt": "2023-10-26T04:04:21Z",
      "title": "New US House speaker tried to help overturn the 2020 election, raising concerns about the next one",
      "url": "https://apnews.com/8cd7c5a9e6ae69635bbb4624cc78e5c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f05679f2bcbd46299375087703fcfcb0/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, ERIC TUCKER and JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump isn’t used to constraints.The former president ignores and antagonizes anyone who tells him no. He built a business — and later political — brand as someone who says and does what he wants, largely without consequence.",
      "publishedAt": "2023-10-26T04:24:54Z",
      "title": "Trump isn't accustomed to restrictions. That's beginning to test the legal system",
      "url": "https://apnews.com/c410cf264d8e29e8edead6c1f7c0bd3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e9b620e984f49e59f57a59d8024cf50/1920.jpeg"
    },
    {
      "author": "MARK STEVENSON and MARÍA VERZA",
      "description": "ACAPULCO, Mexico (AP) — A day after Hurricane Otis roared ashore in Acapulco, unleashing massive floods and setting off looting, the resort city of nearly 1 million descended into chaos, leaving residents without electricity or internet service as the toll remained uncertain.",
      "publishedAt": "2023-10-26T05:15:46Z",
      "title": "Acapulco residents are left in flooded and windblown chaos with hurricane's toll still unknown",
      "url": "https://apnews.com/17b4b34147a2fe5acbe980a0b5b06aa7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01d554b4a91540e4ae826d793c1a6f92/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KRAMATORSK, Ukraine (AP) — In a city where damaged buildings are everywhere, a destroyed pizzeria stands out as a painful reminder of lives and livelihoods dashed in an instant.",
      "publishedAt": "2023-10-26T04:09:39Z",
      "title": "Business owners in a Ukrainian front-line city adapt even as 'a missile can come at any moment'",
      "url": "https://apnews.com/31db3fb8c8d628f6803e1ddbc8c504b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a739300794445ab9215f746d79cdf7d/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER",
      "description": "Muslim and Jewish civil rights groups say they’ve seen large increases in reports of harassment, bias and sometimes physical assaults against members of their communities since the Oct.",
      "publishedAt": "2023-10-26T04:16:29Z",
      "title": "An increase in harassment against Jewish and Muslim Americans has been reported since Hamas attacks",
      "url": "https://apnews.com/f5a3e969f5a213625c224f8ac25538e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d1edeab6738401cbe34ab3aff1fdad6/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — The United Auto Workers union said Wednesday it has reached a tentative contract agreement with Ford that could be a breakthrough toward ending the nearly 6-week-old strikes against Detroit automakers.",
      "publishedAt": "2023-10-25T17:24:17Z",
      "title": "Autoworkers reach a deal with Ford, a breakthrough toward ending strikes against Detroit automakers",
      "url": "https://apnews.com/08a81503d72e44d4efa40549f684d5a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b36d130cce04d7096f85c64efc63152/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}