{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and JACK JEFFERY",
      "description": "RAFAH, Gaza Strip (AP) — Tens of thousands of Palestinians streamed into an already crowded town at the southernmost end of Gaza in recent days, fleeing Israel’s bombardment of the center of the strip, as a senior U.N.",
      "publishedAt": "2023-12-29T08:58:55Z",
      "title": "Palestinians stream into a southern Gaza town as Israel expands its offensive in the center",
      "url": "https://apnews.com/d36675194a22db54970f38c1c2ed3937",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c94ee577fdb4a109789cc9205a115f4/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — For the second time this month the Biden administration is bypassing Congress to approve an emergency weapons sale to Israel as Israel continues to prosecute its war against Hamas in Gaza under increasing international criticism.",
      "publishedAt": "2023-12-29T20:01:45Z",
      "title": "The Biden administration once again bypasses Congress on an emergency weapons sale to Israel",
      "url": "https://apnews.com/1dc77f20aac4a797df6a2338b677da4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2089ef411214c5e903c971676971211/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "SAN FRANCISCO (AP) — Google has agreed to settle a $5 billion privacy lawsuit alleging that it spied on people who used the “incognito” mode in its Chrome browser — along with similar “private” modes in other browsers — to track their internet use.",
      "publishedAt": "2023-12-30T01:11:19Z",
      "title": "Google settles $5 billion privacy lawsuit over tracking people using 'incognito mode'",
      "url": "https://apnews.com/8b30c9397f678bc4c546ab84191f7a9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c243664688224f96aaaa8bbfa0356038/3000.jpeg"
    },
    {
      "author": "MARCIO SANCHEZ and JOHN ANTCZAK",
      "description": "VENTURA, Calif. (AP) — Bulldozers built giant sand berms Friday to protect beachfront homes in one of California's coastal cities hit hard this week by extraordinary waves generated by powerful swells from Pacific storms.",
      "publishedAt": "2023-12-29T19:38:42Z",
      "title": "Powerful Pacific swell brings threat of more dangerous surf to California",
      "url": "https://apnews.com/b2fe8915fbb5be60781daf1d11a60d85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32c0d3880d514536998814911e114895/1920.jpeg"
    },
    {
      "author": "MANUEL RUEDA",
      "description": "BOGOTA, Colombia (AP) — A British warship arrived in Guyana on Friday afternoon amid rising tensions from a border dispute between the former British colony and Venezuela.The HMS Trent's visit led Venezuela to begin military exercises a day earlier in the eastern Caribbean near its border with Guyana as the Venezuelan government presses its claim to a huge swath of its smaller neighbor.",
      "publishedAt": "2023-12-29T18:24:01Z",
      "title": "British warship arrives in Guyana as tensions heat up in border dispute with Venezuela",
      "url": "https://apnews.com/f1a425e6a42f63ab100961851947aac5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c51ee1023f8449681076a01009a17e6/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Russia launched 122 missiles and dozens of drones against Ukrainian targets, officials said Friday, killing at least 30 civilians across the country in what an air force official called the biggest aerial barrage of the war.",
      "publishedAt": "2023-12-29T08:42:21Z",
      "title": "Russia launches the biggest aerial barrage of the war and kills 30 civilians, Ukraine says",
      "url": "https://apnews.com/fe3fb596cdea0035573a6a677f17070c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80b5834dba3a43f9893553e0691e3e7d/1920.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI",
      "description": "An Idaho judge on Friday denied a request by the state's top legal chief to throw out a lawsuit seeking to clarify the exemptions tucked inside the state's broad abortion ban.Instead, 4th District Judge Jason Scott narrowed the case to focus only on the circumstances where an abortion would be allowed and whether abortion care in emergency situations applies to Idaho's state constitutional right to enjoy and defend life and the right to secure safety.",
      "publishedAt": "2023-12-30T00:48:39Z",
      "title": "Judge allows lawsuit that challenges Idaho's broad abortion ban to move forward",
      "url": "https://apnews.com/a2527ef0df708876228a21e94ca474b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ad6b76fc9b94f5da39d4eecd2d4d3b8/3000.jpeg"
    },
    {
      "author": null,
      "description": "DES MOINES, Iowa (AP) — A federal judge on Friday temporarily blocked key parts of an Iowa law that bans some books from school libraries and forbids teachers from raising LGBTQ+ issues.",
      "publishedAt": "2023-12-29T23:09:17Z",
      "title": "Judge blocks most of an Iowa law banning some school library books and discussion of LGBTQ+ issues",
      "url": "https://apnews.com/2b53b6c361bad54e94626a8a26b7f034",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb3f245c58cf4ee98aa0910dca1956b2/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "PORTLAND, Maine (AP) — Maine’s top election official could face an impeachment attempt in the state Legislature over her decision to keep former President Donald Trump off the Republican primary ballot.",
      "publishedAt": "2023-12-29T21:26:34Z",
      "title": "Maine secretary of state who opted to keep Trump off primary ballot is facing threat of impeachment",
      "url": "https://apnews.com/b8e3db656909ca047cff14e80ac4decd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f78bd5e6c4bf4d2794f3edeed5c4cae8/3000.jpeg"
    },
    {
      "author": "DAMIAN J. TROISE",
      "description": "NEW YORK (AP) — The S&amp;P 500 closed out 2023 with a gain of more than 24% and the Dow finished near a record high,",
      "publishedAt": "2023-12-29T14:43:18Z",
      "title": "Resilient economy energizes investors, as financial markets end 2023 up 24%",
      "url": "https://apnews.com/3ecd014f695998c4e89d0529339946b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86d3de344ca44c1a94401e3b597dd198/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}