{
  "articles": [
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Russian President Vladimir Putin and North Korean leader Kim Jong Un signed a new partnership that includes a vow of mutual aid if either country is attacked, during a Wednesday summit that came as both face escalating standoffs with the West.",
      "publishedAt": "2024-06-19T04:14:41Z",
      "title": "Russia and North Korea sign partnership deal that appears to be the strongest since Cold War",
      "url": "https://apnews.com/a6b8d2c12de7ee2ab6716d4747c9850e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f1b10d643ca4a589edc683070b575a5/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and JON GAMBRELL",
      "description": "ABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA (AP) — The combat markings emblazoned on the F/A-18 fighter jet tell the story: 15 missiles and six drones, painted in black just below the cockpit windshield.",
      "publishedAt": "2024-06-19T10:42:31Z",
      "title": "A US aircraft carrier and its crew have fought Houthi attacks for months. How long can it last?",
      "url": "https://apnews.com/87e18d297b24e173da01b0ae1182ab6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05cc162bf78341c9a564bea53a3f6568/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli strikes in southern Lebanon killed three Hezbollah fighters on Wednesday, the militant group said, as a U.S. envoy tasked with avoiding a devastating regional war returned to Israel after meeting officials in Lebanon.",
      "publishedAt": "2024-06-19T09:00:14Z",
      "title": "The Latest | Hezbollah says Israeli strikes kill 3 fighters as US envoy tries to calm tensions",
      "url": "https://apnews.com/0683f3e1b28dd6afe5451dafc07edb7e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05ee5ac2a5da4941a29bf1110d741b02/1920.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Hundreds of thousands of immigrants had reason to rejoice when President Joe Biden unveiled a highly expansive plan to extend legal status to spouses of U.S. citizens but, inevitably, some were left out.",
      "publishedAt": "2024-06-19T05:06:18Z",
      "title": "Immigrant families rejoice over Biden's expansive move toward citizenship, while some are left out",
      "url": "https://apnews.com/376a0a568c85dac1ff856af2157f677f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7526319ba6684dd89db3c77bbfeea3dc/1920.jpeg"
    },
    {
      "author": "RENATA BRITO",
      "description": "AMBLETEUSE, France (AP) — The rising tide crept above their waists, soaking the babies they hugged tight. Around a dozen Kurds refused to leave the cold waters of the English Channel in a futile attempt to delay the inevitable: French police had just foiled their latest attempt to reach the United Kingdom by boat.",
      "publishedAt": "2024-06-19T04:40:16Z",
      "title": "Strict asylum rules and poor treatment of migrants are pushing people north to the UK",
      "url": "https://apnews.com/0c6042f4baaa68ac2d1bb9a0cc696aa5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/011fc55b4fd840629b71f3e0650e773d/3000.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "Willie Mays, the electrifying “Say Hey Kid” whose singular combination of talent, drive and exuberance made him one of baseball’s greatest and most beloved players, has died.",
      "publishedAt": "2024-06-19T01:07:31Z",
      "title": "Willie Mays, Giants’ electrifying ‘Say Hey Kid,’ has died at 93",
      "url": "https://apnews.com/33b31cc2d6382676ed54517d20ea36a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9515e35a92dc4664a75517debae0549f/1920.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDRÉS LEIGHTON",
      "description": "ROSWELL, N.M. (AP) — Cooler weather — and the chance of rain — could bring some relief this week to firefighters battling blazes in southern New Mexico that killed one person, damaged hundreds of structures and forced thousands to evacuate.",
      "publishedAt": "2024-06-19T05:34:15Z",
      "title": "Cooler temps and rain could help corral blazes that forced thousands to flee New Mexico village",
      "url": "https://apnews.com/7d367792f6ea70d4fdb1248c15e6899d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3fd2182203f4d86bf03e3b8c4bb1ca4/1920.jpeg"
    },
    {
      "author": "JOHN SEEWER and PATRICK ORSAGOS",
      "description": "TOLEDO, Ohio (AP) — A blast of heat and humidity in the Midwest and Northeast days before the official start of summer put a wet blanket on outdoor activities from festivals to sports camps as officials urged people to take precautions.",
      "publishedAt": "2024-06-19T05:02:56Z",
      "title": "Early blast of heat and humidity leaves millions sweltering across the US",
      "url": "https://apnews.com/f4877dd84b047cdb7f4b5f2ae61da106",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cab5591a3d444ba0b7dd7cc703ab43ff/1920.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Maryland this week became the latest state to announce mass pardons for people convicted of marijuana-related crimes as the nation wrestles with how to make amends for the lives disrupted in the decadeslong war on drugs.",
      "publishedAt": "2024-06-19T04:17:30Z",
      "title": "With pardons in Maryland, 2.5 million Americans will have marijuana convictions cleared or forgiven",
      "url": "https://apnews.com/614dcf167f6bc19d80661c4eb11b869c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbf1fbafeec64fe68e94b8abb7a354b0/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — Oh, you thought going to a WNBA basketball game might be an escape from the arguments and polarization that are so common in American life these days? Ha, good one.Some of the atmosphere in the public and media that has swirled around the professional women's league since the season started last month has been less fun time and more culture war, with rookie Caitlin Clark as the unwilling eye of the storm.",
      "publishedAt": "2024-06-19T04:10:10Z",
      "title": "Caitlin Clark and the WNBA are getting a lot of attention. It's about far more than basketball",
      "url": "https://apnews.com/9a98ef0d8f6db68923b3cf3577e700d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf068cfa88384cc3a69cefbdadbf1343/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}