{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and RAVI NESSMAN",
      "description": "RAFAH, Gaza Strip (AP) — The second aid convoy destined for desperate Palestinian civilians reached Gaza on Sunday, as Israel widened its attacks to include targets in Syria and the occupied West Bank and the Israeli prime minister warned Lebanon’s Hezbollah militant group that if it launches its own war, “we will cripple it with a force it cannot even imagine.”",
      "publishedAt": "2023-10-22T06:48:25Z",
      "title": "Second aid convoy reaches Gaza as Israel attacks targets in Syria and occupied West Bank",
      "url": "https://apnews.com/916edd66e3af095d49e5ba1c59d90c2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/011d7e51367d4537ba781a0a5d3ee1fc/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and SAMYA KULLAB",
      "description": "DEIR AL BALAH, Gaza Strip (AP) — A premature baby squirms inside a glass incubator in the neonatal ward of al-Aqsa Hospital in the central Gaza Strip. He cries out as intravenous lines are connected to his tiny body.",
      "publishedAt": "2023-10-22T21:14:56Z",
      "title": "Dwindling fuel supplies for Gaza's hospital generators put premature babies in incubators at risk",
      "url": "https://apnews.com/9ec2e404e16a132821dac644af110ef6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a08fbb2466a948f99b5092580a2e7053/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "REHOBOTH BEACH, Del. (AP) — Secretary of State Antony Blinken and Defense Secretary Lloyd Austin said Sunday that the United States expects the Israel-Hamas war to escalate through involvement by proxies of Iran, and they asserted that the Biden administration is prepared to respond if American personnel or armed forces become the target of any such hostilities.",
      "publishedAt": "2023-10-22T17:21:22Z",
      "title": "Blinken, Austin say US is ready to respond if US personnel become targets of Israel-Hamas war",
      "url": "https://apnews.com/1d630d162c413383d91fc535904c854a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14e3e18c00164e70b335b4dafd8ea7e2/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI and DAVID BILLER",
      "description": "BUENOS AIRES, Argentina (AP) — Economy Minister Sergio Massa surprised Sunday night by finishing on top in the first round of Argentina's presidential election, reflecting voters' wariness about handing the presidency to his chief rival, a right-wing populist who upended national politics and pledged to drastically diminish the state.",
      "publishedAt": "2023-10-22T04:09:35Z",
      "title": "Economy minister wins surprise finish ahead of right-wing upstart in Argentina's presidential vote",
      "url": "https://apnews.com/cead0d423f2e51444b48770af618940b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d931c98f7531401fbe52cd3ed3c8f464/1920.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Fans decked in red streamed into the Lahainaluna High School football stadium, snacking on nachos and venison chili, bopping to the high school band’s rendition of “Sweet Caroline,” and exchanging long hugs with neighbors and classmates.",
      "publishedAt": "2023-10-23T00:34:39Z",
      "title": "Football provides a homecoming and hope in Lahaina, where thousands of homes are gone after wildfire",
      "url": "https://apnews.com/76ff3ea949edc81e21f3b3fde3f6107d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5893fd9c02894202bd204fef3feb5398/2000.jpeg"
    },
    {
      "author": "PATRICK ORSAGOS",
      "description": "CIRCLEVILLE, Ohio (AP) — As Jadarrius Rose drove his 18-wheeler through rural Ohio, a simple missing mudflap caught the highway patrol’s eye. The trip ended with a police dog’s powerful jaws clamping down on Rose even as he tried to surrender.",
      "publishedAt": "2023-10-22T04:04:05Z",
      "title": "A police dog attacked a Black trucker on his knees. An Ohio city is dealing with the aftermath",
      "url": "https://apnews.com/4fd3d4806a71cca6f1667d8dbe58ded0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d268c5535ef40129b1ed87c01bf591f/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "WILKES-BARRE, Pa. (AP) — The polls had just opened for last year’s midterms in Pennsylvania when the phones began ringing at the election office in Luzerne County.Polling places were running low on paper to print ballots.",
      "publishedAt": "2023-10-22T12:24:59Z",
      "title": "Turnover has plagued local election offices since 2020. One swing state county is trying to recover",
      "url": "https://apnews.com/8497130b5bbeae503d8f675e3b809d4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25159c942eb24d58b82f9387c9da7c0a/3000.jpeg"
    },
    {
      "author": "IGNACIO MARTÍNEZ and FERNANDO LLANO",
      "description": "CABO SAN LUCAS, Mexico (AP) — Norma strengthened slightly and dumped heavy rain after being downgraded to a tropical storm Sunday as it moved into mainland Mexico, while Hurricane Tammy left the Caribbean island of Barbuda with minor damage.",
      "publishedAt": "2023-10-22T10:24:18Z",
      "title": "Norma downgraded to a tropical storm in Mexico as Hurricane Tammy leaves Barbuda",
      "url": "https://apnews.com/ce64c32ee8c2108fd1d3d7f85ce58054",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a75a5fcce1240bc9ecb37c52c0b61b4/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — An ambitious 2021 agreement by more than 140 countries and territories to weed out tax havens and force multinational corporations to pay a minimum tax has been weakened by loopholes and will raise only a fraction of the revenue that was envisioned, a tax watchdog backed by the European Union has warned.",
      "publishedAt": "2023-10-22T22:00:28Z",
      "title": "Deal to force multinational companies to pay a 15% minimum tax is marred by loopholes, watchdog says",
      "url": "https://apnews.com/5449a9ca89b86d108eb7300000c7d240",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d040a8c7f5af4c41a81d5c8a08103b50/3000.jpeg"
    },
    {
      "author": "KRISTIE RIEKEN",
      "description": "HOUSTON (AP) — Nathan Eovaldi remained perfect this postseason, and Mitch Garver and Jonah Heim homered early before a ninth-inning grand slam by Adolis García helped the Texas Rangers avoid elimination with a 9-2 win over the Houston Astros in Game 6 of the AL Championship Series on Sunday night.",
      "publishedAt": "2023-10-23T03:27:28Z",
      "title": "Eovaldi remains perfect, Rangers slug their way to 9-2 win over Astros to force Game 7 in ALCS",
      "url": "https://apnews.com/0df6aba847e52ab62d8ba3572eb1e007",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5e434d626664feeb85dcab200e5066a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}