{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "LIVE OAK, Fla. (AP) — President Joe Biden got a look Saturday from the sky at Hurricane Idalia's impact across a swath of Florida before setting out on a walking tour of a city recovering from the storm.",
      "publishedAt": "2023-09-02T04:03:22Z",
      "title": "Biden surveys hurricane's toll from the sky and ground in Florida. DeSantis won't see him",
      "url": "https://apnews.com/3ff2f44e6a314dfaf1e329fa10ac1b5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/296105569acb4a539f0ed632fa04bbbf/1920.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and CHRISTINE FERNANDO",
      "description": "COLUMBUS, Ohio (AP) — The wording of a proposed constitutional amendment on Ohio's fall ballot to ensure abortion rights seems straightforward: It would enshrine the right “to make and carry out one's own reproductive decisions.”",
      "publishedAt": "2023-09-02T12:25:46Z",
      "title": "An Ohio ballot measure seeks to protect abortion access. Opponents' messaging is on parental rights",
      "url": "https://apnews.com/7cff281bd9d719038218a2fd9491e47a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7607348777394defaaa71881d8a7693e/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Singer-songwriter Jimmy Buffett, who popularized beach bum soft rock with the escapist Caribbean-flavored song “Margaritaville” and turned that celebration of loafing into a billion-dollar empire of restaurants, resorts and frozen concoctions, has died.",
      "publishedAt": "2023-09-02T08:15:33Z",
      "title": "'Margaritaville' singer Jimmy Buffett, who turned beach-bum life into an empire, dies at 76",
      "url": "https://apnews.com/4295f355b39237f40663d485c4c6d557",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81fbe6ab63db4405a27addec43e85323/1920.jpeg"
    },
    {
      "author": "PAUL J. WEBER and JAKE BLEIBERG",
      "description": "AUSTIN, Texas (AP) — Billionaires, burner phones, alleged bribes: The impeachment trial of Texas Attorney General Ken Paxton is going to test the will of Republicans senators to oust not only one of their own, but a firebrand who has helped drive the state's hard turn to the right for years.",
      "publishedAt": "2023-09-02T04:04:10Z",
      "title": "Texas AG Ken Paxton's impeachment trial is in the hands of Republicans who have been by his side",
      "url": "https://apnews.com/c5680e445a9663d5c3958892f68e4c88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e3d2672707441948d78875efa491c8a/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Bill Richardson, a two-term Democratic governor of New Mexico and an American ambassador to the United Nations who also worked for years to secure the release of Americans detained by foreign adversaries, has died.",
      "publishedAt": "2023-09-02T16:39:49Z",
      "title": "Bill Richardson, a former governor and UN ambassador who worked to free detained Americans, dies",
      "url": "https://apnews.com/c1e6ed9705564452824d537293945662",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db9c1aa330534286a10b3f236a143b01/1904.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russia said Saturday its forces destroyed three Ukrainian naval drones being used in an attempt to attack a key bridge linking Russia to the Moscow-annexed Crimean Peninsula, forcing its temporary closure for a third time in less than a year.",
      "publishedAt": "2023-09-02T08:24:16Z",
      "title": "Russia says it thwarted attacks on Crimea bridge. Shelling and strikes leave at least 3 dead",
      "url": "https://apnews.com/be0a8f3cb98c278aa4cbb14f8588cae4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2c839dd2872495ebd5f01996a89d23e/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "They were the kids most disrupted by the pandemic, the ones who were still learning to write their names and tie their shoes when schools shut down in the spring of 2020.",
      "publishedAt": "2023-09-02T04:06:50Z",
      "title": "Children hit hardest by the pandemic are now the big kids at school. Many still need reading help",
      "url": "https://apnews.com/53b0f3de56de526ead7a356bd7b853e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6288b43c27548cea9fb5fe78e5452b7/3000.jpeg"
    },
    {
      "author": "KATHY McCORMACK",
      "description": "GOFFSTOWN, N.H. (AP) — A group of friends and neighbors meets for a weekly meal, choosing from a special menu of nutritious foods paid for by social programs meant to keep older adults eating healthy.",
      "publishedAt": "2023-09-02T12:08:37Z",
      "title": "More than a meal: Restaurant-based programs feed seniors' social lives",
      "url": "https://apnews.com/704da5411cd104b6e05bddc9ee4842eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35e58397e31f4441801514691d95b555/3000.jpeg"
    },
    {
      "author": "FERNANDA PESCE",
      "description": "SAN FRANCISCO TEPEYACAC, Mexico (AP) — One family in central Mexico is struggling to preserve the production of cochineal dye, an intense, natural red pigment so prized that, after gold and silver, it was probably the most valuable thing the Spaniards found in Mexico after the 1521 conquest.",
      "publishedAt": "2023-09-02T04:07:10Z",
      "title": "This red dye was so valuable it built cities. One family in Mexico is still making it the old way",
      "url": "https://apnews.com/6e6b998a78deb12e2b99a42f23358f08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fb0417fb4d34b4b852428dc27b6f952/1920.jpeg"
    },
    {
      "author": "STEPHEN HAWKINS",
      "description": "FORT WORTH, Texas (AP) — After nine months of hype, Deion Sanders had Colorado ready for prime time in his much-anticipated debut as Buffaloes coach.Shedeur Sanders, the coach’s son, threw for 510 yards with four touchdowns — the game-winner a 46-yard catch-and-run by freshman Dylan Edwards with 4:25 left —- and the Buffs pulled off an opening shocker with a 45-42 win Saturday over 17th-ranked TCU, last year’s national runner-up.",
      "publishedAt": "2023-09-02T20:05:15Z",
      "title": "Prime shocker: Colorado upsets No. 17 TCU 45-42 in Deion Sanders' debut as Buffs coach",
      "url": "https://apnews.com/a806ace03d4859f9f41bfcc70a98ac84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60b63214c8ee4c5b80b0ad5299078415/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}