{
  "articles": [
    {
      "author": null,
      "description": "When Jeffrey Epstein died in prison, then-President Donald Trump speculated that authorities might be wrong in ruling it a suicide. Many of his allies in the pro-Trump media went further, casting Epstein's death as a murder meant to continue a decades-long coverup of pedophilia by elites. Now back in the White House, Trump has elevated prominent proponents of Epstein conspiracies to senior law enforcement roles, and they’re struggling to contain a fire that they spent years stoking. Much of Trump’s base is choosing to believe the president’s earlier claims about Epstein over his latest contention that there’s nothing of substance in government files.",
      "publishedAt": "2025-07-17T04:05:23Z",
      "title": "In their own words: Trump, Patel, Bongino and Bondi on Epstein scandal",
      "url": "https://apnews.com/article/trump-epstein-their-words-bondi-patel-bongino-70176344eeab6f66e015bc294afbbf59",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec10b2b/2147483647/strip/true/crop/2186x1230+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2Fea%2Fdd445deabc0a2e761f16a61f7ee4%2Ff40bc507d7d54672a4d4aceed3a2e01f"
    },
    {
      "author": null,
      "description": "President Donald Trump says he's “highly unlikely” to fire Federal Reserve Chair Jerome Powell. His public statement Wednesday came less than 24 hours after suggesting in a private meeting that he was leaning in favor of dismissing Powell. Trump confirmed to reporters that in a White House meeting Tuesday night with about a dozen House Republicans, he'd discussed the “concept” of dismissing Powell. The Fed chair has long been a target because of his refusal to lower interest rates as Trump wants. Trump's team recently has accused Powell of mismanaging a $2.5 billion renovation project at the Fed. Trump said Wednesday he's “highly unlikely” to dismiss Powell — ”unless he has to leave for fraud.”",
      "publishedAt": "2025-07-16T17:44:04Z",
      "title": "Trump says he's 'highly unlikely' to fire Fed's Powel",
      "url": "https://apnews.com/article/trump-powell-federal-reserve-firing-interest-rates-b235d01f01f9762bc66a577d16ddeff2",
      "urlToImage": "https://dims.apnews.com/dims4/default/3520cd4/2147483647/strip/true/crop/6252x3517+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2F21%2F5787a918f9f039d128b0c00e7617%2F66c34c252b7140759307fb59f91cf515"
    },
    {
      "author": null,
      "description": "A U.S. Army veteran arrested during an immigration raid at a California marijuana farm says he was sprayed with tear gas and pepper spray before being dragged from his vehicle on his way to work. George Retes, a native of Ventura City, California, says he was pinned to the ground by ICE officials on his back and his neck after getting caught between protesters and authorities last week at Glass House Farms in Camarillo. Retes was held for three days before being release without charges and without being allowed to contact a lawyer. He said Wednesday he plans to sue the federal government over his ordeal.",
      "publishedAt": "2025-07-17T00:15:34Z",
      "title": "Army veteran detained by ICE in California farm raid speaks out",
      "url": "https://apnews.com/article/us-army-veteran-immigration-raid-53cb22251a01599a0c4d1a8d5650d050",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d89c44/2147483647/strip/true/crop/5804x3265+0+299/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F4e%2F7de573f02e9dd8c93b789a909bdc%2Fd1fa5e2a2f624286a087d087a59ac370"
    },
    {
      "author": null,
      "description": "A bill to cancel about $9 billion in foreign aid and public broadcasting spending is nearing passage in the Senate. It's an action that would have a tiny impact on the nation’s debt but could have major ramifications for future spending fights in Congress. The legislation would claw back nearly $1.1 billion from the Corporation for Public Broadcasting and about $8 billion in foreign aid spending that Republicans describe as wasteful. Senate passage of the spending cuts would send the bill back to the House for final approval. Trump must sign the bill into law by midnight Friday for the cuts to take effect.",
      "publishedAt": "2025-07-16T17:22:44Z",
      "title": "Trump bid to claw back $9 billion nears Senate vote",
      "url": "https://apnews.com/article/trump-republicans-budget-cuts-pepfar-pbs-npr-486f0f5871068f14d97eb4c4d7f9bb88",
      "urlToImage": "https://dims.apnews.com/dims4/default/a75d8bd/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F23%2F03e52b317d6513296c7c22afe6ba%2Fba94f35c954c43a1a26f098800a68f27"
    },
    {
      "author": null,
      "description": "Federal Reserve Chair Jerome Powell is gaining some key backing on Capitol Hill from Republican senators. They fear the repercussions if President Donald Trump follows through with threats to try and remove the politically independent central banker. As Trump seemingly waffled back and forth between moving to dismiss the Fed chair this week, some Republicans in Congress began to speak up to warn that such a move would be a mistake. Still, plenty of other Republicans think that dismissing Powell is a fine idea.",
      "publishedAt": "2025-07-17T04:09:31Z",
      "title": "Senate Republicans warn Trump against firing Fed chair Jerome Powell",
      "url": "https://apnews.com/article/trump-powell-congress-federal-reserve-2b6f104028489d8051d7ac27492298eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef14e4b/2147483647/strip/true/crop/2312x1301+0+120/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F7b%2F23f63fb9f86eb7ae92b58bcac633%2F95fdde905e5e423e9966ddf8f0c34904"
    },
    {
      "author": null,
      "description": "A federal judge in Tennessee could rule on whether to release Kilmar Abrego Garcia from jail as he awaits trial on human smuggling charges. A decision to free the Maryland construction worker could allow President Donald Trump's administration to try to deport him for a second time. A hearing to review the matter is scheduled for Wednesday in Nashville. Abrego Garcia became a flashpoint over the Republican administration’s immigration policies when he was wrongfully deported to his native El Salvador in March. The U.S. returned Abrego Garcia last month to face the federal smuggling charges. Abrego Garcia’s lawyers say the case is preposterous.",
      "publishedAt": "2025-07-16T16:00:52Z",
      "title": "Kilmar Abrego Garcia faces hearing on Tennessee jail release",
      "url": "https://apnews.com/article/abrego-garcia-jail-release-deportation-trump-trial-d3f4eccb04dbd087efdcb0be4acd0b72",
      "urlToImage": "https://dims.apnews.com/dims4/default/9591a8b/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F80%2F0236bd058f8b627c092f5ab94862%2Ff6908b2c90b84a938a23fb4762876cf7"
    },
    {
      "author": null,
      "description": "Prince Harry has followed in his late mother’s footsteps by wearing a flak jacket and walking down a path in an active land mine field in Angola to raise awareness for a charity’s work clearing explosives from old war zones. The Duke of Sussex is in the southern African country with the Halo Trust organization. It's the same group Princess Diana worked with when she went to Angola in January 1997. She was killed in a car crash in Paris seven months later. Diana’s advocacy and the images of her walking through a minefield helped mobilize support for a land mine ban treaty.",
      "publishedAt": "2025-07-16T19:19:32Z",
      "title": "Prince Harry retraces Diana's footsteps by walking through a land mine field in Angola for charity",
      "url": "https://apnews.com/article/prince-harry-angola-land-mines-diana-royal-969a283834e3975252aab7536a62c56e",
      "urlToImage": "https://dims.apnews.com/dims4/default/ce402f9/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2F65%2F5fa6c70b017bae81be9167fdeb6f%2Fc86af6e6dd3b4345ad0a324d2ba8056f"
    },
    {
      "author": null,
      "description": "The United States has deported five immigrants from Vietnam, Jamaica, Cuba, Yemen and Laos to Eswatini, a small country in southern Africa where the king still holds absolute power. Eswatini says it is holding the men in correctional facilities until they can be sent back to their home countries. Eswatini is one of a handful of countries in the world that are still absolute monarchies, and the only one in Africa. That means the king has absolute power over government and is not just a figurehead or a ceremonial position. The country was previously known as Swaziland but changed to Eswatini in 2018.",
      "publishedAt": "2025-07-16T17:47:24Z",
      "title": "What to know about the African kingdom of Eswatini where the US sent 5 deportees",
      "url": "https://apnews.com/article/eswatini-migrants-deportees-trump-540d544fd85dcd3ebc3719f7ba4a009a",
      "urlToImage": "https://dims.apnews.com/dims4/default/77ae275/2147483647/strip/true/crop/4500x2531+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2Fe6%2F36e25ee7ceeaa8a3e53d72512a05%2Fa9dcc5801f05412e9a9948680ed36fe7"
    },
    {
      "author": null,
      "description": "Authorities say three current or former Louisiana police chiefs have been arrested following a federal investigation into an alleged scheme that involved false police reports being sold to immigrants lacking permanent legal status and used to try to secure a visa. U.S. Attorney Alexander C. Van Hook said at a news conference Wednesday that the forged police reports would indicate that the immigrant was a victim of a crime. He said the police officials were paid $5,000 for each name they provided falsified reports for, and that there were hundreds of names. He and other officials said the case does not mean the police chiefs' departments are corrupt.",
      "publishedAt": "2025-07-16T15:19:40Z",
      "title": "Feds charge 5 in Louisiana, including 3 current or ex-police chiefs, over alleged visa fraud scheme",
      "url": "https://apnews.com/article/louisiana-visa-fraud-police-chiefs-charges-5b186fac2a61cb7266087c8cd7f00621",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Two university hospitals are pioneering new ways to expand access to the lifesaving heart transplants for adults and babies. They aim to overcome some barriers to retrieving hearts donated after circulatory death, when the heart stops beating after withdrawal of life support. Surgeons at Duke and Vanderbilt universities say they've separately devised some simpler approaches. In the New England Journal of Medicine, they describe small but early successes, transplanting an infant at Duke and three men at Vanderbilt. These are the kinds of transplantable hearts that too often aren’t retrieved depending on how would-be organ donors die.",
      "publishedAt": "2025-07-16T21:00:32Z",
      "title": "DCD heart transplants: Two hospitals try new ways to use more donated organs",
      "url": "https://apnews.com/article/heart-transplants-donation-dcd-11a296d03631aef6ff6d84099463a586",
      "urlToImage": "https://dims.apnews.com/dims4/default/593475a/2147483647/strip/true/crop/4729x2660+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2F82%2F30b79557636b971eba69ce0eeaed%2Fedae0f6a6ae447c3b0a00ca761059ff4"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}