{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — A Texas judge ruled Friday the state’s abortion ban has proven too restrictive for women with serious pregnancy complications and must allow exceptions without doctors fearing the threat of criminal charges.",
      "publishedAt": "2023-08-05T01:42:55Z",
      "title": "A judge has ruled Texas' abortion ban is too restrictive for women with pregnancy complications",
      "url": "https://apnews.com/d90f3bce68d86e5eafe3ba4ba5939188",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/853185e1ef6a486da15d13abb35669f2/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — When the Justice Department was announcing the highest-profile prosecution in its history in Washington, Attorney General Merrick Garland was 100 miles away, meeting with local police in Philadelphia.",
      "publishedAt": "2023-08-05T04:11:25Z",
      "title": "Justice Department faces biggest test in its history with election conspiracy case against Trump",
      "url": "https://apnews.com/0e7658920132697a8b7a20de0260f4fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02ce669f8fce4858abf0eadb6635e466/1920.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "TALLINN, Estonia (AP) — On the battlefields of Ukraine, the fog of war plagues soldiers. And far from the fighting, a related and just as disorienting miasma afflicts those who seek to understand what's happening in the vast war.",
      "publishedAt": "2023-08-05T04:04:40Z",
      "title": "Russia's war with Ukraine has generated its own fog, and mis- and disinformation are everywhere",
      "url": "https://apnews.com/f8ee274890cd62362be3dd75fbc7dd6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21faeae0b5b143b68de5a8a622b460ec/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "In the two-and-a-half years since the Jan. 6 assault on the U.S. Capitol, Congress passed a bipartisan law closing loopholes in the complex process of choosing a new president that Donald Trump tried to exploit in his push to stay in office after losing the 2020 election.",
      "publishedAt": "2023-08-05T04:06:57Z",
      "title": "Trump and allies boost calls for Justice Dept. takeover in new attack on democratic institutions",
      "url": "https://apnews.com/7b399ab628db7330ed99fac8c3784170",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89f30fe23dbc4b17b8c91d17a7422478/3000.jpeg"
    },
    {
      "author": "LISA RATHKE",
      "description": "MONTPELIER, Vt. (AP) — A beloved bookstore in Vermont's small capital city moved across the street to a new spot farther from the Winooski River after an ice jam sent river water into the store in 1992.",
      "publishedAt": "2023-08-05T04:56:39Z",
      "title": "Vermont’s flood-wracked capital city ponders a rebuild with one eye on climate change",
      "url": "https://apnews.com/5f93b8e799f9ddd005e505df2865ed9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/114dc9adc79242cf983d90bf1ee9fb52/1920.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "HARTFORD, Conn. (AP) — As state lawmakers rush to get a handle on fast-evolving artificial intelligence technology, they're often focusing first on their own state governments before imposing restrictions on the private sector.",
      "publishedAt": "2023-08-05T04:19:33Z",
      "title": "Artificial intelligence is gaining state lawmakers' attention, and they have a lot of questions",
      "url": "https://apnews.com/d22212c9242e9b86100d431717d76b0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e35665bc86274e58855471163d80553f/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "The Justice Department on Friday asked a federal judge overseeing the criminal case against former President Donald Trump in Washington to step in after he released a post online that appeared to promise revenge on anyone who goes after him.",
      "publishedAt": "2023-08-05T02:59:03Z",
      "title": "Prosecutors ask judge to issue protective order after Trump post appearing to promise revenge",
      "url": "https://apnews.com/71cd642e876c47fff4e1283c15f8ca01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f7955bd9fa14f9d84d6d7d56691e48d/2915.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — The political future of Pakistan’s former Prime Minister Imran Khan was thrown into doubt Saturday when police arrested him at home after a court handed him a three-year jail sentence for asset concealment.",
      "publishedAt": "2023-08-05T08:20:28Z",
      "title": "Pakistani police arrest former Prime Minister Imran Khan after court conviction",
      "url": "https://apnews.com/e44842d4880c581ee093ff680a9a09d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1ab2c7e7d0b45099560931e36422476/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "ABUJA, Nigeria (AP) — Regional mediation efforts to reverse the coup in Niger and restore its democracy collapsed as soon as they started. Tensions have escalated as the Sunday deadline nears for possible military intervention by other West African countries.",
      "publishedAt": "2023-08-05T08:48:03Z",
      "title": "Niger's junta isn't backing down, and a regional force prepares to intervene. Here’s what to expect",
      "url": "https://apnews.com/f8156256f8a7e496263e4acc70c5fa79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4c9f1ec47c2410ba37c33fdba52a527/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}