{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — Israeli warplanes struck targets across Gaza overnight and into Sunday, as well as two airports in Syria and a mosque in the occupied West Bank allegedly used by militants, as the two-week-old war with Hamas threatened to spiral into a broader conflict.",
      "publishedAt": "2023-10-22T06:48:25Z",
      "title": "Israel strikes Gaza, Syria and West Bank as war against Hamas threatens to ignite other fronts",
      "url": "https://apnews.com/916edd66e3af095d49e5ba1c59d90c2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f2bb5e994c44d72be840bd536e0e646/1920.jpeg"
    },
    {
      "author": "AMY TEIBEL",
      "description": "JERUSALEM (AP) — Deadly violence has been surging in the West Bank as the Israeli military pursues Palestinian militants in the aftermath of the Hamas attack from Gaza, with at least 90 Palestinians killed in the Israeli-occupied territory in the past two weeks, mainly in clashes with Israeli troops.",
      "publishedAt": "2023-10-22T09:05:36Z",
      "title": "Palestinian death toll in West Bank surges as Israel pursues militants following Hamas rampage",
      "url": "https://apnews.com/25b93d7eda4f2972360fe384d381bbff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/382456cfed2e44d98efef98f4d7779d9/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The only thing worse than the screams of a patient undergoing surgery without enough anesthesia are the terror-stricken faces of those awaiting their turn, a 51-year-old orthopedic surgeon says.",
      "publishedAt": "2023-10-21T20:24:01Z",
      "title": "Little light, no beds, not enough anesthesia: A view from the 'nightmare' of Gaza's hospitals",
      "url": "https://apnews.com/63d00d907f5469c81f49c0201801c997",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/caa1135feaa343a3a7eaa0a0ce84ba2a/3000.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER",
      "description": "Shortly before 7 p.m. Tuesday, a volley of rockets lit up the darkened sky over Gaza. Videos analyzed by The Associated Press show one veering off course, breaking up in the air before crashing to the ground.",
      "publishedAt": "2023-10-21T04:13:10Z",
      "title": "AP visual analysis: Rocket from Gaza appeared to go astray, likely caused deadly hospital explosion",
      "url": "https://apnews.com/e0fa550faa4678f024797b72132452e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a6c873727204a0599e411cf404fc5d5/3000.jpeg"
    },
    {
      "author": "PATRICK ORSAGOS",
      "description": "CIRCLEVILLE, Ohio (AP) — As Jadarrius Rose drove his 18-wheeler through rural Ohio, a simple missing mudflap caught the highway patrol’s eye. The trip ended with a police dog’s powerful jaws clamping down on Rose even as he tried to surrender.",
      "publishedAt": "2023-10-22T04:04:05Z",
      "title": "Police dog's attack on Black trucker in Ohio echoes history",
      "url": "https://apnews.com/4fd3d4806a71cca6f1667d8dbe58ded0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d268c5535ef40129b1ed87c01bf591f/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "MOSHCHUN, Ukraine (AP) — In the humble backyard of a destroyed house, a 13-year-old chops firewood to get ready for winter. His mother, Tetiana Yarema, has been preparing for months as she remembers last winter’s Russian strikes on the energy infrastructure that plunged Ukraine into darkness.",
      "publishedAt": "2023-10-22T04:06:30Z",
      "title": "Ukrainians prepare firewood and candles to brace for a winter of Russian strikes on the energy grid",
      "url": "https://apnews.com/4f8c111942f5a4883626db1afae8c35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e4ea4f518d94b809c38181321f276d0/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — A missile strike on a mail depot in the eastern Ukrainian city of Kharkiv killed six people, Ukrainian officials said Sunday.A further 16 people were injured in the blast late Saturday, which is believed to have been caused by a Russian S-300 rocket, Kharkiv governor Oleh Syniehubov said on social media.",
      "publishedAt": "2023-10-22T09:14:47Z",
      "title": "6 dead in Russian rocket strike as Ukraine reports record bomb attack numbers",
      "url": "https://apnews.com/27c06116fd98988854a6b2bbacff380c",
      "urlToImage": ""
    },
    {
      "author": "IGNACIO MARTÍNEZ and FERNANDO LLANO",
      "description": "CABO SAN LUCAS, Mexico (AP) — Hurricane Norma came ashore near the Pacific resort of Los Cabos at the southern tip of Mexico’s Baja California Peninsula on Saturday afternoon. Hours later, Hurricane Tammy made landfall on the Caribbean island of Barbuda.",
      "publishedAt": "2023-10-22T10:24:18Z",
      "title": "Pacific and Atlantic hurricanes Norma and Tammy make landfall on Saturday in Mexico and Barbuda",
      "url": "https://apnews.com/ce64c32ee8c2108fd1d3d7f85ce58054",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/004c1dd10507497eaff39b7e6e791dd1/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — A Chinese coast guard ship and an accompanying vessel rammed a Philippine coast guard ship and a military-run supply boat Sunday off a contested shoal, Philippine officials said, in an encounter that heightened fears of an armed conflict in the disputed South China Sea.",
      "publishedAt": "2023-10-22T03:44:57Z",
      "title": "Philippines says a coast guard ship and supply boat were rammed by Chinese vessels at disputed shoal",
      "url": "https://apnews.com/64d4fad7bb42b44f991df183fb39fe1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a692f3d94de451ebc00cd1698910d00/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI and DAVID BILLER",
      "description": "BUENOS AIRES, Argentina (AP) — Argentines were going to the polls Sunday, as frustrated voters weigh handing the presidency to an anti-establishment, right-wing populist who has shaken up the political system and pledges to drastically overhaul the state.",
      "publishedAt": "2023-10-22T04:09:35Z",
      "title": "Polls open for Argentina election that could see right-wing populist win the presidency",
      "url": "https://apnews.com/cead0d423f2e51444b48770af618940b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aab4239d7b4b41abbf16d7710f508bae/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}