{
  "articles": [
    {
      "author": "Lindsay Whitehurst",
      "description": "A federal trade court is blocking President Donald Trump from imposing sweeping tariffs on imports under an emergency-powers law. The ruling from a three-judge panel came after several lawsuits arguing Trump has exceeded his authority, left U.S. trade policy dependent on his whims and unleashed economic chaos. At least seven lawsuits are challenging the levies, the centerpiece of Trump’s trade policy. Trump has says he has the power to act because the country’s trade deficits amount to a national emergency. The court found the 1977 International Emergency Economic Powers Act does not authorize the use of tariffs.",
      "publishedAt": "2025-05-28T23:16:48Z",
      "title": "Federal court blocks Trump's sweeping tariffs, citing economic chaos",
      "url": "https://apnews.com/article/trump-tariffs-trade-court-0392dbd59f548e49ad4f64254ae3f94a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1719f6/2147483647/strip/true/crop/3829x2154+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F83%2F443ca7d88a3514462cb659512235%2F1609dbb91dd24cbc9d508c0368e675c2"
    },
    {
      "author": "Annie Ma, Collin Binkley",
      "description": "Secretary of State Marco Rubio says the U.S. will begin revoking the visas of Chinese students, “including those with connections to the Chinese Communist Party or studying in critical fields.” His announcement on X added to the uncertainty for America’s international students, who have faced intensifying scrutiny from President Donald Trump’s administration. In a cable sent Tuesday to U.S. embassies and consulates, Rubio halted the scheduling of new visa interviews for international students until the department releases guidelines for increased vetting of their activity on social media. Existing appointments may be kept and will proceed under current review guidelines, the cable said, but new guidance is expected in the coming days.",
      "publishedAt": "2025-05-28T18:58:14Z",
      "title": "US to begin revoking visas of some Chinese students",
      "url": "https://apnews.com/article/international-students-visas-trump-guidance-social-media-a1f5180ce83560aff66dd65534906697",
      "urlToImage": "https://dims.apnews.com/dims4/default/8af7d7d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F99%2F082c0e419ad8c01d6a33099f3029%2F78331a270cb94138b93d9eb4b4f4c61d"
    },
    {
      "author": null,
      "description": "Israel said Thursday it would establish 22 new Jewish settlements in the occupied West Bank. They would include new settlements and the legalization of outposts already built without government authorization. Israel captured the West Bank in the 1967 Mideast war and the Palestinians want it to be the main part of their future state.",
      "publishedAt": "2025-05-29T05:17:05Z",
      "title": "Israel to establish 22 new Jewish settlements in West Bank",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-05-29-2025-f68c800d2f85933e5cb27e5d8ccd8742",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6f342/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ff1%2F01784acd98fe5fbb6381bbc362f0%2F419377a7ba8643cb87ee439505810f17"
    },
    {
      "author": "Michael Casey, Leah Willingham",
      "description": "Harvard University is holding it commencement Thursday. The nation's oldest and wealthiest school at the forefront of legal efforts to defend higher education in America from what increasingly seem like existential threats by President Donald Trump. Other schools also face the loss of federal funding and their ability to enroll international students if they don’t agree to the Trump administration’s changing demands. But Harvard is taking the lead on defying the White House in federal court. Trump frames his pressure as a defense against antisemitism. Sustained by a $53 billion endowment, Harvard is testing whether it can be a bulwark protecting the freedom to teach and learn nationwide.",
      "publishedAt": "2025-05-29T04:04:52Z",
      "title": "Harvard commencement held as Trump presses against antisemitism",
      "url": "https://apnews.com/article/harvard-graduation-trump-administration-679b6c5c1b9306aeaff4c175fabea76a",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5da8b3/2147483647/strip/true/crop/4116x2315+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F02%2F3cd783233bc8f3ceab3bdb499ecc%2Fe8636cc36f9e4a3db481cc812c7b423f"
    },
    {
      "author": "Fu Ting, Kanis Leung",
      "description": "Chinese students in the U.S. are scrambling to figure out their futures after U.S. Secretary of State Marco Rubio announced Wednesday some students would have their visas revoked. Many reacted with anger. A Chinese student at Johns Hopkins University described it as a “new version of Chinese Exclusion Act.\" Chinese students have seen rising rejection rates for visas in recent years amid strained U.S.-China relations. Hong Kong has said it would welcome students from all over who were impacted by the U.S.' changing policies to study in the city",
      "publishedAt": "2025-05-29T07:56:44Z",
      "title": "Chinese students scramble after Rubio vows to revoke visas",
      "url": "https://apnews.com/article/chinese-exclusion-act-student-visas-us-80fb4551d4d1139b29f6cbc4d172603a",
      "urlToImage": "https://dims.apnews.com/dims4/default/956fa36/2147483647/strip/true/crop/2687x1511+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2F7a%2Ff15d9a990abee347e0d628f4f24c%2F0246eb28903c44b289354229c86c6e25"
    },
    {
      "author": "Chris Megerian, Kevin Freking",
      "description": "Elon Musk is leaving his government role as a top adviser to President Donald Trump after spearheading efforts to reduce and overhaul the federal bureaucracy. The billionaire entrepreneur posted Wednesday about his decision on X, his social media website. “As my scheduled time as a Special Government Employee comes to an end, I would like to thank President @realDonaldTrump for the opportunity to reduce wasteful spending,” he wrote. A White House official, who requested anonymity to talk about the change, confirmed that Musk was leaving. Musk’s departure comes one day after he criticized the centerpiece of Trump’s legislative agenda, saying he was “disappointed” by what the president calls his “big beautiful bill.”",
      "publishedAt": "2025-05-28T14:06:19Z",
      "title": "Elon Musk is leaving the Trump administration",
      "url": "https://apnews.com/article/elon-musk-donald-trump-big-beautiful-bill-aa2bc70b0ebdb219b5dd3e9f8fae03af",
      "urlToImage": "https://dims.apnews.com/dims4/default/f161287/2147483647/strip/true/crop/5442x3061+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Ff5%2Ff06015417d7248d1246561ae996a%2Fab50885507a94869b2eaa2e8a418204e"
    },
    {
      "author": null,
      "description": "The U.S. flag has been hoisted outside of the long-shuttered ambassador’s residence in Damascus, in a signing of growing ties between Washington and the new Syrian government. Syrian state-run news agency SANA reported on Thursday that U.S. ambassador to Turkey Tom Barrack arrived to inaugurate the residence. He has also been appointed special envoy to Syria. Washington hasn’t formally reopened its embassy in Damascus which closed in 2012 after protests against the government of then President Bashar Assad. Assad was unseated in December in a lightning rebel offensive. But Barrack’s visit and the raising of the flag were a significant signal of warming relations.",
      "publishedAt": "2025-05-29T09:26:23Z",
      "title": "US ambassador's residence reopens in Damascus",
      "url": "https://apnews.com/article/syria-us-ambassador-residence-ties-f0e22df744565ad6a6503c9c7d90972c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Jeff Martin, Safiyah Riddle, Andrew DeMillo",
      "description": "There are plenty of hideouts in the rugged terrain of the Ozark Mountains where searchers are hunting for an ex-lawman known as the “Devil in the Ozarks.” Others are not only off the grid but beneath it, in the hundreds of caves that lead to vast subterranean spaces. A spokesman for the Arkansas Department of Corrections says caves in the area have been a priority for searchers. He said they present one of multiple challenges for authorities searching for Hardin. He escaped Sunday from the North Central Unit — a medium-security prison also known as the Calico Rock prison — by impersonating a corrections officer.",
      "publishedAt": "2025-05-28T20:46:03Z",
      "title": "Caves, other hideouts in mountains are part of hunt for fugitive known as 'Devil in the Ozarks'",
      "url": "https://apnews.com/article/arkansas-prison-escape-police-chief-grant-hardin-441d37501f2ab0de8af27501546dfb13",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a4081e/2147483647/strip/true/crop/2736x1539+0+671/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F94%2Fc4caf5e0c6d0fe7c2e4d6a2687e6%2F9a809d998a6a4748ab10af715f88f542"
    },
    {
      "author": null,
      "description": "China's space agency says it has launched a spacecraft that promises to return samples from a pair of asteroids near Mars and yield “groundbreaking discoveries and expand humanity’s knowledge of the cosmos.\" China National Space Administration says the Tianwen-2 probe launched early Thursday from southern China aboard the workhorse Long March 3-B rocket will collect samples from the near-Earth asteroid 2016HO3. The probe also will explore the main-belt comet 311P, which lies even further from the Earth than Mars. CNSA head Shan Zhongde says the Tianwen-2 mission represents a significant step in China’s journey of interplanetary exploration.",
      "publishedAt": "2025-05-29T10:19:54Z",
      "title": "China spacecraft could make 'groundbreaking discoveries,' agency says",
      "url": "https://apnews.com/article/china-space-probe-tianwen-asteroid-mars-earth-d265f9f3375754e77cea61de8ac925cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/adbbcfd/2147483647/strip/true/crop/1280x720+0+40/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2Fde%2Ff3b7963903f54d3ae18f5116a6a8%2F03af70a25acf4e0686bd25b32918a64d"
    },
    {
      "author": "Ed Williams Of Searchlight New Mexico, Susan Montoya Bryan Of The Associated Press",
      "description": "Natural gas has become a go-to fuel for power plants from coast to coast, sometimes replacing dirtier coal-fired plants and, by extension, improving air quality. In New Mexico, oil and gas companies employ thousands of workers, often in areas with few other opportunities, all while boosting the state’s budget with billions in royalty payments. But those benefits may come at a cost for thousands of students whose schools sit near oil and gas pipelines, wellheads and flare stacks. An Associated Press analysis of state and federal data found 694 oil and gas wells with new or active permits within a mile of a school in New Mexico.",
      "publishedAt": "2025-05-29T04:02:02Z",
      "title": "Oil, gas boom means schools deal with pollution, air quality concerns",
      "url": "https://apnews.com/article/school-air-quality-natural-gas-d2e9bb105c68a11bb5ae31564706d8e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/14e14a3/2147483647/strip/true/crop/3840x2160+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2Fc4%2Faef7740dd42fe39384d8a3e3f848%2Fa4e82bec238144bb834aae299ce7d1fe"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}