{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — As mediators expressed optimism for an imminent cease-fire deal, violence raged on Saturday in the Gaza Strip, where an Israeli airstrike killed at least 18 people, all from the same family.",
      "publishedAt": "2024-08-17T10:00:23Z",
      "title": "Deadly violence persists in Gaza despite mediators' hopes for a truce",
      "url": "https://apnews.com/07e5f3d968cb09613609eb1086e26e91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e3988c922524e99aa201f97a713bcb3/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and MOHAMMAD ZAATARI",
      "description": "NABATIEH, Lebanon (AP) — An Israeli strike in southern Lebanon early Saturday killed at least 10 Syrian nationals, according to Lebanon’s Health Ministry.The strike on Wadi al-Kfour in Nabatieh province is among the deadliest in Lebanon since the Hezbollah militant group and Israeli military started trading strikes on Oct.",
      "publishedAt": "2024-08-17T08:16:15Z",
      "title": "A woman and her 2 children are among 10 killed in an Israeli strike in southern Lebanon",
      "url": "https://apnews.com/3ad53afe0c650e77e70515e152e00f61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5175b68931834e558c490b6961bf09ae/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto made landfall on the tiny British Atlantic territory of Bermuda early Saturday as residents hunkered down.The wide category 1 storm was directly over the the wealthy territory at 6 a.m.",
      "publishedAt": "2024-08-17T09:06:25Z",
      "title": "Hurricane Ernesto makes landfall on Bermuda as a category 1 storm",
      "url": "https://apnews.com/c7dea3a54812e4353ee2dc2bd38b7e49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe65d1bf74f44221b8bbf7cd65ff8d32/1920.jpeg"
    },
    {
      "author": null,
      "description": "SUDZHA, Russia (AP) — A trail of destruction lies in the path that Ukrainian forces carved on their risky incursion into Russia, blasting through the border and eventually into the town of Sudzha, where Associated Press journalists traveled Friday on a Ukrainian government-organized trip.",
      "publishedAt": "2024-08-16T20:56:59Z",
      "title": "Ukrainian forces left a path of destruction in the Kursk operation. AP visited a seized Russian town",
      "url": "https://apnews.com/090f03d7f809af49ae9957e851525eb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39a31e55092c4cdea476e1f4ff42d887/3000.jpeg"
    },
    {
      "author": "FATMA KHALED",
      "description": "CAIRO (AP) — The threat of polio is rising fast in the Gaza Strip, prompting aid groups to call for an urgent pause in the war so they can ramp up vaccinations and head off a full-blown outbreak. One case has been confirmed, others are suspected and the virus was detected in wastewater in six different locations in July.",
      "publishedAt": "2024-08-17T07:39:19Z",
      "title": "Aid groups in Gaza aim to avert a polio outbreak with a surge of vaccinations",
      "url": "https://apnews.com/8cc05570b5b1af6c6adcedf8a6b36880",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27e58f4370e647bd9c7734a1a3495f69/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "DEARBORN, Mich. (AP) — Of the thousands of delegates expected to gather Monday at the Democratic National Convention, just 36 will belong to the “uncommitted” movement sparked by dissatisfaction with President Joe Biden's handling of the Israel-Hamas war.",
      "publishedAt": "2024-08-17T04:03:54Z",
      "title": "The pro-Palestinian 'uncommitted' movement is at an impasse with top Democrats as the DNC begins",
      "url": "https://apnews.com/93f9edb25a602c95ee226bd2645e4298",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f392c5cfd241491e95a867daf3acca89/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "CHICAGO (AP) — As the American city that has hosted more political conventions than any other, Chicago has pretty much seen it all.Presidential candidates have been made official in Chicago more than two dozen times since Abraham Lincoln in 1860, including the infamous 1968 convention, where police clashed with protesters, and Bill Clinton’s 1996 renomination.",
      "publishedAt": "2024-08-17T04:11:23Z",
      "title": "As political convention comes to Chicago, residents, leaders and activists vie for the spotlight",
      "url": "https://apnews.com/40a39d68d6e67cec4b0ea27dbab97511",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33202f3f437b4b49bd05339e9d67d9e4/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "Ron DeSantis' senior political aides were gathered last year at the Florida governor's campaign headquarters, an office across the street from a Red Lobster on Tallahassee's north side, planning the announcement of his candidacy for president.",
      "publishedAt": "2024-08-17T04:05:01Z",
      "title": "Strategist who ran DeSantis' ill-fated bid is working with Musk to help organize voters for Trump",
      "url": "https://apnews.com/93bf546bbf4082ca09dce62d43c4186a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/753f2fede2ff4fa781b89575f58b7544/2205.jpeg"
    },
    {
      "author": "RUTH ALONGA and CHINEDU ASADU",
      "description": "GOMA, Congo (AP) — Sarah Bagheni had a headache, fever, and itchy and unusual skin lesions for days, but she had no inkling that her symptoms might have been caused by mpox and that she might be another case in a growing global health emergency.",
      "publishedAt": "2024-08-17T04:08:49Z",
      "title": "Congo's humanitarian crisis helped mpox spiral again into a global health emergency",
      "url": "https://apnews.com/d8ce571543a9b5ed9bd4dbde4d1a5cae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87dd36ff258e4be1ab61457dfb427b7c/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — The arrest of five people in the overdose death of Matthew Perry has revealed key details about the final days of the “Friends” star, most of them spent in the throes of an addiction to the surgical anesthetic ketamine.",
      "publishedAt": "2024-08-17T04:01:52Z",
      "title": "'Shoot me up with a big one': A timeline of the last days of Matthew Perry",
      "url": "https://apnews.com/411a3365195c4b65bbb41cc510cb9341",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03f8837519ed4bb48c46da4ee6538d6d/2496.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}