{
  "articles": [
    {
      "author": "BOBBY CAINA CALVAN",
      "description": "By some measures, the city was making strides to emerge from its racist past. But the killing of three Black people Saturday by a young, white shooter was a painful and startling reminder that the remnants of racism continue to fester in Jacksonville, Florida.",
      "publishedAt": "2023-08-28T08:17:25Z",
      "title": "Jacksonville killings refocus attention on the city's racist past and the struggle to move on",
      "url": "https://apnews.com/89deb39815e7f319a19cf71536042010",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8a1ca5284e34dd6b5cd45bf9c2a2467/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT, EMILY SWANSON and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Old. Confused. Corrupt. Dishonest. Those are among the top terms Americans use when they’re asked to describe President Joe Biden and former President Donald Trump, the Republican best positioned to face him in next year’s election.",
      "publishedAt": "2023-08-28T10:34:57Z",
      "title": "Biden is 'old,' Trump is 'corrupt': AP-NORC poll has ominous signs for both in possible 2024 rematch",
      "url": "https://apnews.com/12b806876e2072790f9a67793761c688",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c7c09e8f01740d3919dda2aa3193eb1/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KUPIANSK, Ukraine (AP) — The thunder of mortar fire echoes in the distance as 5-year old David approaches his mother with an innocent request: Can he play with the baseball bat a relative gave him as a gift?",
      "publishedAt": "2023-08-28T06:03:00Z",
      "title": "An evacuation order finds few followers in northeastern Ukraine despite Russia's push in the region",
      "url": "https://apnews.com/d4c6d7e8f68906ed7c3abd7d9caa131a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d3faabcc9814ed7addde3ed27766f2f/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — The movie centers around a renowned violinist from Belgium arriving in Kyiv to perform. The date is February 2022, and his trip is upended as Russia starts bombing Ukraine. The musician survives a series of “inhuman crimes and bloody provocations by Ukrainian nationalists,” and he wants to tell the world “what it was really like.”",
      "publishedAt": "2023-08-28T04:51:07Z",
      "title": "The Ukraine war, propaganda-style, is coming to Russian movie screens. Will people watch?",
      "url": "https://apnews.com/16fa6ec7ac56641dd1b346d2b22e3e9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23ebc8bd21d049439002bbb0dc08fc66/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and JESSE BEDAYN",
      "description": "DENVER (AP) — Christian Glass was a geology geek, a painter and a young man beset by a mental health crisis when he called 911 for help getting his car unstuck in a Colorado mountain town last year.",
      "publishedAt": "2023-08-28T04:05:43Z",
      "title": "Many big US cities now answer mental health crisis calls with civilian teams -- not police",
      "url": "https://apnews.com/ca97971200c485e36aa456c04d217547",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f4909b3f7f948ad9266c1c480bd049c/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "CANBERRA, Australia (AP) — Eight U.S. Marines remained in a hospital in the Australian north coast city of Darwin on Monday after they were injured in a fiery crash of a tiltrotor aircraft that killed three of their colleagues on an island.",
      "publishedAt": "2023-08-28T05:01:18Z",
      "title": "8 US Marines remain in a hospital after a fiery aircraft crash killed 3 during drills in Australia",
      "url": "https://apnews.com/89a89b2ba580249f8cd6960909ca0dcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9727c9414652449e85c41cd5d974ae76/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, LINDSDAY WHITEHURST and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — Lawyers for Donald Trump are due back in court Monday as a federal judge considers radically conflicting proposals for a trial date in the case accusing him of working to overturn the results of the 2020 presidential election in the run-up to the Jan.",
      "publishedAt": "2023-08-28T04:05:32Z",
      "title": "Trump lawyers back in DC court as two sides differ over trial date in election subversion case",
      "url": "https://apnews.com/1a5ae1a0ea35492e1e347e28867a7d3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5da96a01115e4a3e91b353a5c94f08ab/3000.jpeg"
    },
    {
      "author": null,
      "description": "MIAMI (AP) — Tropical Storm Idalia was near the coast of Cuba Monday on a potential track to come ashore as a hurricane in the southern U.S., the National Hurricane Center said.At 4 a.m. CDT Monday, the storm was about 125 miles (200 kilometers) off the western tip of Cuba with maximum sustained winds of 65 mph (100 kmh).",
      "publishedAt": "2023-08-27T15:51:03Z",
      "title": "Tropical Storm Idalia takes aim at Gulf of Mexico on a possible track toward the US, forecasters say",
      "url": "https://apnews.com/13c620a00b54c97f10e97e01ec84ccb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20ba3e84299040db8d6139ca5bd5388d/3000.jpeg"
    },
    {
      "author": "JOE McDONALD",
      "description": "BEIJING (AP) — Commerce Secretary Gina Raimondo and her Chinese counterpart expressed a desire to improve trade conditions on Monday, as Raimondo began a visit to Beijing aimed at warming chilly relations, but neither side appeared willing to make concessions on the other’s main demands.",
      "publishedAt": "2023-08-28T03:14:46Z",
      "title": "Top US and Chinese commerce officials express support for easier trade, but deep differences remain",
      "url": "https://apnews.com/7ff71dfa3c58105964a4b2e3dd998285",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3de54f09b7942b39c9dbcf87023843f/1920.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "TAIPEI, Taiwan (AP) — Terry Gou, who founded Apple supplier Foxconn, said Monday he will run as an independent candidate in Taiwan's presidential election, ending months of speculation.At a news conference, Gou criticized the governing Democratic Progressive Party, saying its policies have “brought Taiwan into the risk of war” with China, which claims the self-ruled island democracy as part of its territory.",
      "publishedAt": "2023-08-28T04:01:47Z",
      "title": "Foxconn's Terry Gou will seek Taiwan presidency as an independent, but he'll need signatures to run",
      "url": "https://apnews.com/7eff9fbae7bb6cc255d5a0d65aabbabe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f89c56bd82ea4e51bdaf68d3e920303c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}