{
  "articles": [
    {
      "author": null,
      "description": "BAKU, Azerbaijan (AP) — Nations at UN climate talks agree on $300B a year for poor countries to curb and adapt to warming in a compromise deal.",
      "publishedAt": "2024-11-23T22:39:29Z",
      "title": "Nations at UN climate talks agree on $300B a year for poor countries to curb and adapt to warming in a compromise deal",
      "url": "https://apnews.com/ff7ce1e531e26708bb8257f18a83c363",
      "urlToImage": ""
    },
    {
      "author": "MIKE STOBBE",
      "description": "The team that President-elect Donald Trump has selected to lead federal health agencies in his second administration includes a retired congressman, a surgeon and a former talk-show host.",
      "publishedAt": "2024-11-23T17:30:42Z",
      "title": "A look at how some of Trump's picks to lead health agencies could help carry out Kennedy's overhaul",
      "url": "https://apnews.com/790e278105172aece70094bbe6c3064a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2ae26072bde4c7b9c9694b5af8c32c4/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump launched a blitz of picks for his Cabinet, but he took his time before settling on billionaire investor Scott Bessent as his treasury secretary nominee.",
      "publishedAt": "2024-11-23T05:03:18Z",
      "title": "Trump raced to pick many Cabinet posts. He took more time to settle on a treasury secretary",
      "url": "https://apnews.com/f01fc0bab029c10b453ee9afb2b41b24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19002ea6b1f54971926ab6bdc1ad8b7d/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and BASSEM MROUE",
      "description": "BEIRUT, Lebanon (AP) — Israeli airstrikes Saturday in central Beirut killed at least 20 people, officials said, as the once-rare attacks on the heart of Lebanon's capital continued without warning while diplomats scrambled to broker a cease-fire.",
      "publishedAt": "2024-11-23T08:51:22Z",
      "title": "Israeli strikes in central Beirut kill at least 20 as diplomats push for a cease-fire",
      "url": "https://apnews.com/60f383ef1f42ff9928770a77d27ec4b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c31c0067397425787556d3f98953cb0/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "JEFFERSON CITY, Mo. (AP) — Two weeks before Election Day, activists from across the country gathered for an online rally heralding the historic number of state ballot initiatives seeking to change the way people vote.",
      "publishedAt": "2024-11-23T05:03:39Z",
      "title": "Voters rejected historic election reforms across the US, despite more than $100M push",
      "url": "https://apnews.com/bc797f209e5f98a18afb2e5f784e63b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1456407b2cef4ea3be85bc3ca0e05f59/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — This past week has seen the most significant escalation in hostilities that Ukraine has witnessed since Russia's full-scale invasion and marks a new chapter in the nearly three-year war — one tinged with uncertainty and fear.",
      "publishedAt": "2024-11-23T11:32:09Z",
      "title": "The week that upped the stakes of the Ukraine war",
      "url": "https://apnews.com/0555d1af20edcb8dcf8aef47d868db22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bd8da0dcb594a22b03bfe16ea9946d9/1280.jpeg"
    },
    {
      "author": "GODOFREDO A. VASQUEZ and OLGA R. RODRIGUEZ",
      "description": "WINDSOR, Calif. (AP) — The U.S. was reeling from snow and rain on Saturday with a second round of bad weather threatening to disrupt holiday travel ahead of Thanksgiving. A person was found dead in a vehicle submerged in floodwaters in California, which braced for more precipitation while still grappling with flooding and small landslides from a previous storm.",
      "publishedAt": "2024-11-23T06:01:21Z",
      "title": "US reels from rain, snow as second round of bad weather approaches for Thanksgiving week",
      "url": "https://apnews.com/e0b787685ad719b1a99c722658f484f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b905d4e9e6054ca9a01faea5493952f1/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Unlike scores of people who scrambled for the blockbuster drugs Ozempic and Wegovy to lose weight in recent years, Danielle Griffin had no trouble getting them.",
      "publishedAt": "2024-11-23T13:55:31Z",
      "title": "Even with access to blockbuster obesity drugs, some people don't lose weight",
      "url": "https://apnews.com/9f8ab517f26ccc6d2d32ce3e829ba8ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0f4c31ef77a4db387bc5816a805baa2/3000.jpeg"
    },
    {
      "author": "RIAZ KHAN",
      "description": "PESHAWAR, Pakistan (AP) — Fighting between armed Sunni and Shiite groups in northwestern Pakistan killed at least 37 people and injured 25 others, a senior police officer from the region said Saturday.",
      "publishedAt": "2024-11-23T07:16:35Z",
      "title": "Fighting between armed sectarian groups in restive northwestern Pakistan kills at least 37 people",
      "url": "https://apnews.com/aec6e365dd13de8e381740008fbd14b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b2826e8ccd24879b66e26899affa434/3000.jpeg"
    },
    {
      "author": "KATHERINE ROTH",
      "description": "Travel can be stressful in the best of times. Now add in the high-level anxiety that seems to be baked into every holiday season and it's clear that travelers could use some help calming frazzled nerves.",
      "publishedAt": "2024-11-23T05:05:27Z",
      "title": "Hydrate. Make lists. Leave yourself time. And other tips for reducing holiday travel stress",
      "url": "https://apnews.com/db5e5d819b6251bd415a9ad204baa03a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fe0aa9456ed4952a6ef4843535f8bde/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}