{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "ASHRAF KHALIL and JEFFREY COLLINS",
      "description": "WASHINGTON (AP) — At least two people died, thousands of U.S. flights were canceled or delayed, and more than 1.1 million homes and businesses lost power Monday as severe storms, including hail and lightning, moved through the eastern U.S.",
      "publishedAt": "2023-08-07T20:31:02Z",
      "title": "Powerful storm kills 2 people and leaves 1.1 million without power in eastern US",
      "url": "https://apnews.com/31b54effe7bd180bb22d5bd422b9f98b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b5de8ef7bf44021acd97bf4cd66b3b0/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Now that July's sizzling numbers are all in, the European climate monitoring organization made it official: July 2023 was Earth's hottest month on record by a wide margin.",
      "publishedAt": "2023-08-08T08:02:04Z",
      "title": "European scientists make it official. July was the hottest month on record by far",
      "url": "https://apnews.com/8baaa159c413ec31939e99206f2be644",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a28189dc5474ba5a6185fad85b016e5/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Ohio concludes a hastily called and highly charged special election Tuesday, a contest that could determine the fate of abortion rights in the state and fuel political playbooks nationally heading into 2024.",
      "publishedAt": "2023-08-08T04:04:47Z",
      "title": "A proposed constitutional change before Ohio voters could determine abortion rights in the state",
      "url": "https://apnews.com/227cde039f8d51723612878525164f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbdc34f5de374e0fae8e0531c2cf889f/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Carrying huge backpacks and water bottles, tens of thousands of Scouts began arriving at university dormitories, government and corporate training centers, and hotels around Seoul and other inland cities on Tuesday afternoon as the South Korean government evacuated the World Scout Jamboree ahead of a tropical storm.",
      "publishedAt": "2023-08-08T02:26:28Z",
      "title": "South Korea evacuates thousands of Scouts from coastal campsite as tropical storm nears",
      "url": "https://apnews.com/c9bd4500515ed0ae7c45460d2c50b56a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b75dd14cf17945f18505216c17c59b99/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — The death toll from two Russian missile strikes that hit apartment blocks and other buildings in an eastern Ukrainian city climbed to seven, with 81 people injured, authorities said Tuesday, as officials accused the Kremlin's forces of targeting rescue workers.",
      "publishedAt": "2023-08-08T07:53:15Z",
      "title": "Russian missiles kill 7 in Ukrainian city and Kyiv accuses Moscow of targeting rescue workers",
      "url": "https://apnews.com/6fa27eed10747b7daa85d7518e99d5ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/580c8b5cd6c3440ab2595a826e520582/2000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and TERRY TANG",
      "description": "TUSAYAN, Ariz. (AP) — President Joe Biden will use his visit to Arizona on Tuesday to formally announce a national monument designation for the greater Grand Canyon, making Native American tribes' and environmentalists' decades-long vision to preserve the land a reality.",
      "publishedAt": "2023-08-08T04:16:27Z",
      "title": "Biden will announce a historic Grand Canyon monument designation during his Arizona visit",
      "url": "https://apnews.com/9382960f18408dce7aec52f103404e11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d446d26d220644beaa9ecdc8286ba109/3000.jpeg"
    },
    {
      "author": "BECKY BOHRER and MARK THIESSEN",
      "description": "JUNEAU, Alaska (AP) — The gray, two-story home with white trim toppled and slid, crashing into the river below as rushing waters carried off a bobbing chunk of its roof. Next door, a condo building teetered on the edge of the bank, its foundation already having fallen away as erosion undercut it.",
      "publishedAt": "2023-08-08T06:15:10Z",
      "title": "Bursting ice dam in Alaska highlights risks of glacial flooding around the globe",
      "url": "https://apnews.com/95f06f4e0d82445705d3126aac004f5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ab007aeb2594936bfe2586e5989a948/1920.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Thousands of Los Angeles city employees, including sanitation workers, lifeguards and traffic officers, walked off the job Tuesday for a 24-hour strike alleging unfair labor practices.",
      "publishedAt": "2023-08-08T08:03:19Z",
      "title": "Thousands of Los Angeles city workers walk off job for 24 hours alleging unfair labor practices",
      "url": "https://apnews.com/689eaa21d729694d8fa91080ddaa01df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14b6a8933eea4c868b29bb522c945ee3/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — Throngs of fans lined the streets of Sinead O’Connor’s former hometown in Ireland to bid farewell to the gifted singer as her funeral procession passed by Tuesday following a private memorial service.",
      "publishedAt": "2023-08-08T09:39:23Z",
      "title": "Mourners in Ireland pay their respects to singer Sinead O'Connor at funeral procession",
      "url": "https://apnews.com/43cb43298ffd5df4883e42cf7ca326a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e8e23128d8241ca89de372964be5cb0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}