{
  "articles": [
    {
      "author": "JOSEPH KRAUSS",
      "description": "The latest flurry of Gaza cease-fire talks — the back-and-forth over now-familiar sticking points and appeals from around the world — obscures a grim truth about the monthslong efforts to end the Israel-Hamas war and free scores of hostages.",
      "publishedAt": "2024-08-28T04:05:52Z",
      "title": "Two sworn enemies hold the key to ending the war in Gaza. Does either man want a deal?",
      "url": "https://apnews.com/c00b30d31ac8d25592ce63c2398097a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9203c48a20f84a39b3ad37d17d563cef/1920.jpeg"
    },
    {
      "author": "SAM McNEIL and MELANIE LIDMAN",
      "description": "BEERSHEBA, Israel (AP) — Qaid Farhan Alkadi was alone underground Tuesday after 326 days of captivity in Gaza when Israeli forces scouring Hamas’ vast tunnel network found and freed him.",
      "publishedAt": "2024-08-27T12:33:09Z",
      "title": "A hostage in Gaza is rescued by Israel after 326 days of captivity",
      "url": "https://apnews.com/696f8ee830207815efd31320976ef118",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78acd2a4793c4f96b6f3ac33288ede8b/1600.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Born into the devastating Israel-Hamas war, 10-month-old Abdel-Rahman Abu El-Jedian started crawling early. Then one day, he froze — his left leg appeared to be paralyzed.",
      "publishedAt": "2024-08-27T21:13:48Z",
      "title": "A 10-month-old Palestinian baby suddenly stopped crawling. Polio had struck Gaza",
      "url": "https://apnews.com/59a09fbb2257dd9fcfaac0878dc3fe58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dddb8971db6f45c784d684b343b1ecc3/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith filed a new indictment Tuesday against Donald Trump over his efforts to undo the 2020 presidential election that keeps the same criminal charges but narrows the allegations against him following a Supreme Court opinion that conferred broad immunity on former presidents.",
      "publishedAt": "2024-08-27T20:24:21Z",
      "title": "Feds file new indictment in Trump Jan. 6 case, keeping charges intact but narrowing allegations",
      "url": "https://apnews.com/186c874404912578e44d5781c8267e2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3aaf3aa525d249afa9df2802924727be/1920.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — As Vice President Kamala Harris begins her fall campaign for the White House, she can look to history and hope for better luck than others in her position who have tried the same.",
      "publishedAt": "2024-08-28T04:04:18Z",
      "title": "Kamala Harris' election would defy history. Just 1 sitting VP has been elected president since 1836",
      "url": "https://apnews.com/defc726ac5a8db8ef0ba9a756fd8eec5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d443b214a11746beb474a9fdf6774195/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Ukraine's daring ground offensive has taken the fight to Russia, but not nearly as much as its leaders would like because, they say, the United States won’t let them.",
      "publishedAt": "2024-08-28T04:01:17Z",
      "title": "Ukraine's Russia offensive is risky. To get a boost, it wants less US caution on weapons",
      "url": "https://apnews.com/7e59c745b4bff79802454f0b660b0d0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8090a73dda944949bfc10112b0be7945/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "CHICAGO (AP) — As a second straight day of hot soupy temperatures approaching triple digits hung over much of the Midwest on Tuesday, residents looked for ways to stay cool and indoors.",
      "publishedAt": "2024-08-27T17:34:07Z",
      "title": "From cold towels to early dismissal, people are finding ways to cope with a 2nd day of heat wave",
      "url": "https://apnews.com/e800296c8fa3e89164d4f46c67f1183c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9725733931440939bf5021ab5ea2eee/1920.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "JENA, Germany (AP) — When electrical engineer Preetam Gaikwad first moved to Jena in 2013, she was smitten by what the eastern German city had to offer: a prestigious university, top research institutions, and cutting-edge technology companies, global leaders in their field.",
      "publishedAt": "2024-08-28T04:42:51Z",
      "title": "As the far right rises in eastern Germany, companies struggle to attract skilled foreign workers",
      "url": "https://apnews.com/c3fdba1942bb8959c9f92eb321466a47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85412c2223a040ecaffaa82532153cbc/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI, DAVID RISING and NICOLE WINFIELD",
      "description": "DILI, East Timor (AP) — When the Vatican acknowledged in 2022 that the Nobel Peace Prize-winning, East Timorese independence hero Bishop Carlos Ximenes Belo had sexually abused young boys, it appeared that the global clergy sexual abuse scandal that has compromised the Catholic Church’s credibility around the world had finally arrived in Asia’s newest country.",
      "publishedAt": "2024-08-28T04:30:39Z",
      "title": "Pope Francis is visiting East Timor after a clergy abuse scandal, but will he address it?",
      "url": "https://apnews.com/403444937a155db9dafc947607183aee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/934967f5e14549e2bf631aac6fc8586d/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — A year ago, still on maternity leave and still unsure when she would play elite tennis again, Naomi Osaka visited the U.S.",
      "publishedAt": "2024-08-27T18:59:25Z",
      "title": "US Open: Naomi Osaka gets her first top-10 win in more than four years by defeating Ostapenko",
      "url": "https://apnews.com/1a647ffda4587179368b9425dff73f4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/045a4410fe8d4eac9c4180468eb31b17/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}