{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "The funeral of an Iranian Revolutionary Guard general killed alongside Hezbollah leader Hassan Nasrallah drew the largest crowd of top leaders in the paramilitary organization together Tuesday for the first time since Tehran launched a ballistic missile attack on Israel.",
      "publishedAt": "2024-10-15T06:25:02Z",
      "title": "Middle East latest: Top leaders attend an Iranian Revolutionary Guard general's funeral",
      "url": "https://apnews.com/05d950e5e8f20e154aef36cab210c054",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7a8c258c9924134b5b62c4f440b498a/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.N. Security Council expressed “strong concern” Monday as Israel has fired on and wounded U.N.",
      "publishedAt": "2024-10-14T23:59:13Z",
      "title": "UN Security Council voices 'strong concern' for UN peacekeepers after Israeli attacks",
      "url": "https://apnews.com/e391d8ffe57eebcf8bc294310bb922bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f97b1b73f8b495d8f996bcf5e7db029/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — Relations between India and Canada are at a low point as the countries expelled each other's top diplomats over an ongoing dispute about the killing of a Sikh activist in Canada.",
      "publishedAt": "2024-10-15T05:30:34Z",
      "title": "How did a killing at a Sikh temple lead to Canada and India expelling each other's diplomats?",
      "url": "https://apnews.com/67c6ee375f883a81b501cdf2c5bc2b8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0333ab1164f3458091fabf5d08843c51/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Democratic vice presidential nominee Minnesota Gov. Tim Walz on Tuesday will unveil his ticket's plans to improve the lives of rural voters, as Vice President Kamala Harris looks to cut into former President Donald Trump's support.",
      "publishedAt": "2024-10-15T10:23:22Z",
      "title": "Walz to unveil Harris' plan for rural voters as campaign looks to cut into Trump's edge",
      "url": "https://apnews.com/291214562d083593f29f8972429a9bec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b31e8d5138346229ae776446a1d092d/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN and CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — With characteristic bravado, Donald Trump has vowed that if voters return him to the White House, “inflation will vanish completely.\"It’s a message tailored for Americans who are still exasperated by the jump in consumer prices that began 3 1/2 years ago.",
      "publishedAt": "2024-10-15T04:01:23Z",
      "title": "Trump's economic plans would worsen inflation, experts say",
      "url": "https://apnews.com/a18de763fcc01557258c7f33cab375ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d30c8be3e80489e835e5f77a3ef2f85/3000.jpeg"
    },
    {
      "author": "GARY D. ROBERTSON and SARAH BRUMFIELD",
      "description": "RALEIGH, N.C. (AP) — Federal disaster workers paused and then changed some of their hurricane-recovery efforts in North Carolina, including abandoning door-to-door visits, after receiving threats that they could be targeted by a militia, officials said, as the government response to Helene is targeted by runaway disinformation.",
      "publishedAt": "2024-10-14T18:15:44Z",
      "title": "FEMA workers change some hurricane-recovery efforts in North Carolina after receiving threats",
      "url": "https://apnews.com/dbb6b5727eaa12e79f307bf38a4b6256",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b10312fe0c7486dad334c885a8d5211/3000.jpeg"
    },
    {
      "author": "ANITA SNOW, CHRISTOPHER L. KELLER and MORGAN LEE",
      "description": "ALBUQUERQUE, N.M. (AP) — Ten times as many migrants died in New Mexico near the U.S.-Mexico border in each of the last two years compared with just five years ago as smuggling gangs steer them — exhausted, dehydrated and malnourished — mostly into the hot desert, canyons or mountains west of El Paso, Texas.",
      "publishedAt": "2024-10-15T04:04:43Z",
      "title": "Migrant deaths in New Mexico have increased tenfold",
      "url": "https://apnews.com/677a6b57e729ca076a0d12dba31c3b70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0b939c1ab55430db19e4d1360f62737/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — In a symbolic display of anger, North Korea on Tuesday blew up the northern section of unused roads that once linked it with the South, with the rivals exchanging threats days after the North claimed that its rival flew drones over its capital Pyongyang.",
      "publishedAt": "2024-10-15T03:28:22Z",
      "title": "North Korea blows up parts of inter-Korean roads in a symbolic display of anger",
      "url": "https://apnews.com/0672f5baf033cf0c4ecb2f1e1b958a41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66ca9970273b46ac875cf4ea44ba13ac/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG, FOSTER KLUG and CLAIRE GALOFARO",
      "description": "SEOUL, South Korea (AP) — Rebecca Kimmel sat in a small room, stunned and speechless, staring at the baby photo she had just unearthed from her adoption file.It was a black-and-white shot of an infant, possibly taken at an orphanage in Gwangju, the South Korean city where Kimmel had heard all her life that she’d been abandoned.",
      "publishedAt": "2024-10-15T01:48:06Z",
      "title": "Who am I? A South Korean adoptee finds answers about the past — just not the ones she wants",
      "url": "https://apnews.com/c1a432ae1c0c3557b27004215c8ef3b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9a470913c9c4cacb1a0989a02fb5c52/3000.jpeg"
    },
    {
      "author": "NICK PERRY, MICHAEL CASEY and PATRICK WHITTLE",
      "description": "MEREDITH, N.H. (AP) — New England leaf-watching season is in full swing, as people from as far as Florida and Berlin flock to the region for scenic drives, train rides and bus tours to soak in the splendid hues of red, orange and bronze.",
      "publishedAt": "2024-10-15T04:07:13Z",
      "title": "Leaf-peepers are flocking to see New England's brilliant fall colors",
      "url": "https://apnews.com/93e9e67391855cebff5ac2a9c846588d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ab2c16f2aad4dc1a0708b8f50405506/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}