{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump's comments that the U.S. should take long-term control of war-shattered Gaza and that the area's residents should be permanently resettled have been contradicted by top people in his administration. Secretary of State Marco Rubio said Wednesday that the area’s residents would only be relocated on an interim basis as the U.S. rebuilds Gaza. White House press secretary Karoline Leavitt says U.S. taxpayers won’t finance rebuilding Gaza and insisted that Trump had “made it clear” that the people of Gaza would be moved out of the area only temporarily.",
      "publishedAt": "2025-02-06T01:08:57Z",
      "title": "In their own words: What Trump said about Gaza and how top administration officials contradicted him",
      "url": "https://apnews.com/article/trump-rubio-leavitt-gaza-permanent-temporary-funding-53d3c737d24dd8ea290e0e7962546575",
      "urlToImage": "https://dims.apnews.com/dims4/default/f65ec3e/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F02%2F6dd641b6daaf0771be15c4a13286%2Fa993841eb8c0462cbce98ba5668386f3"
    },
    {
      "author": "MATTHEW LEE, ZEKE MILLER",
      "description": "President Donald Trump’s top diplomat and his main spokesperson are walking back the idea that he wants the permanent relocation of Palestinians from Gaza, after American allies and even Republican lawmakers rebuffed his suggestion that the U.S. take “ownership” of the territory. Trump had called for “permanently” resettling Palestinians from war-torn Gaza and left open the door to deploying American troops there as part of a massive rebuilding operation. But Secretary of State Marco Rubio and White House press secretary Karoline Leavitt said Wednesday he only sought to move roughly 1.8 million Gazans temporarily to allow for reconstruction. Even that proposal has drawn criticism from Palestinians and Arab nations that Trump has called on to take them in.",
      "publishedAt": "2025-02-05T18:07:08Z",
      "title": "US officials now say Trump only wants to displace Palestinians from Gaza temporarily",
      "url": "https://apnews.com/article/rubio-immigration-guatemala-trump-border-deportation-f928f64eec96b46a880069cbd5580d34",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb4e3dc/2147483647/strip/true/crop/5430x3054+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F7c%2F8d3c8958a89e92cc81ce3095d6ce%2F7c025b74ee8d4b179bd323de6e7b934b"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, JULIA FRANKEL",
      "description": "Stunned Palestinians rejected President Donald Trump's proposal to expel them from the Gaza Strip so that the U.S. could take over the territory and rebuild it for others. Many saw the comments as an effort to erase them from their homeland, a continuation of the “Nakba,” or “Catastrophe,\" their name for the expulsion and displacement of hundreds of thousands of Palestinians from what is now Israel during the 1948 war. Palestinians displaced during the Israel-Hamas war have shown a powerful determination to return to their homes, with hundreds of thousands during the current ceasefire flooding back to neighborhoods devastated by Israeli bombardment and offensives.",
      "publishedAt": "2025-02-05T17:42:24Z",
      "title": "'I won't leave. Put that in your brain.' Palestinians reject Trump's call to expel them from Gaza",
      "url": "https://apnews.com/article/gaza-trump-nakba-israel-netanyahu-f8d1a4f840d4c440cfddb03987fa53cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/4840ad5/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F4f%2F33b8ff158ef327b4e25da2a54925%2F561a3006781c4b72877d5363a0a05e63"
    },
    {
      "author": "JOEY CAPPELLETTI, MIKE HOUSEHOLDER",
      "description": "Arab Americans in Michigan are reacting more cautiously to President Donald Trump’s remarks on the Israel-Hamas war than they did to Democratic candidates during the 2024 presidential campaign. Trump said Tuesday that he wanted to remove Palestinians from Gaza and impose a U.S. takeover in the region. But some leaders in the nation's largest Arab American community in Dearborn, Michigan, treaded cautiously on Wednesday. Imad Hamad, executive director of the Dearborn-based American Human Rights Council, said it was “too early to render a judgement.” Trump was the first Republican presidential candidate in over two decades to win Dearborn. His top diplomat and main spokesperson on Wednesday walked back the idea that he wants to permanently relocate Palestinians from Gaza.",
      "publishedAt": "2025-02-05T22:59:59Z",
      "title": "Michigan's Arab American community offers muted response to Trump's Gaza takeover plan",
      "url": "https://apnews.com/article/trump-arab-americans-michigan-gaza-plan-6014edae5196aa5bc2c1681452ec4cf8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e1fde5/2147483647/strip/true/crop/3532x1987+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F4e%2Fb6aa0d0cd66baf5dbaec19121563%2Ff1ddbe3c8469483a9c1739ad71439166"
    },
    {
      "author": "AAMER MADHANI, ZEKE MILLER",
      "description": "President Donald Trump promised voters an administration that wouldn’t waste precious American lives and taxpayer treasure on far-off wars and nation building. But just weeks into his second go-around in the White House, the Republican leader laid out plans to use American might to “take over” and reconstruct Gaza, threatened to reclaim U.S. control of the Panama Canal and floated the idea that the U.S. could buy Greenland from Denmark, which has shown no interest in parting with the island. The rhetorical shift from America First to America Everywhere is leaving even some of his allies slack-jawed — and wondering if he’s really serious.",
      "publishedAt": "2025-02-05T22:12:36Z",
      "title": "With Gaza rehab and other global policy ideas, Trump goes from America First to America Everywhere",
      "url": "https://apnews.com/article/trump-gaza-mideast-foreign-policy-1b792bd4d12cb3895b5a26b98ad63f2b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee3c5e5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2Ffc%2F83a7cdad650195775d8310878b69%2Ff6f5b5d087934df8a8a79056c02aebbe"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "Witnesses who survived Sweden’s worst mass shooting have described horror and panic that gripped an adult education center west of Stockholm as the gunman killed at least 10 people. They said they scrambled for cover as quickly as they could as shots rang out Tuesday. The gunman also was killed. One survivor with children feared she might never see them again. Another student said she performed first aid on a man who was shot in the shoulder. The carnage also left at least five seriously wounded in the Scandinavian nation where gun violence at schools is very rare.",
      "publishedAt": "2025-02-05T13:38:38Z",
      "title": "Witnesses describe chaos and bloodshed in Sweden’s worst mass shooting",
      "url": "https://apnews.com/article/sweden-school-shooting-orebro-828d3f50a4add0e658d7517d9eef6724",
      "urlToImage": "https://dims.apnews.com/dims4/default/e499666/2147483647/strip/true/crop/8214x4620+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2F14%2F07f2016d3dc2239bc5cb2c56b2af%2F2b0fa0138e644780864c0d1faa075912"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "A line of Mexican National Guard and Army trucks are rumbling along the border separating Ciudad Juárez and El Paso, Texas, among the first of 10,000 officers Mexico has sent to its northern frontier following tariff threats by President Donald Trump. Masked and armed National Guard members picked through brush running along the border barrier on the outskirts of Ciudad Juárez, pulling out makeshift ladders and ropes tucked away in the trenches.. It comes after a turbulent week along the border after Trump announced he would delay imposing crippling tariffs on Mexico for at least a month. In exchange, Mexican President Claudia Sheinbaum promised she would send the country’s National Guard to reinforce the border.",
      "publishedAt": "2025-02-06T01:08:50Z",
      "title": "Mexico deploys the first of 10,000 National Guard to US border after Trump's threat of tariffs",
      "url": "https://apnews.com/article/national-guard-mexico-border-ciudad-juarez-sheinbaum-b26e9d359f4f17b60925bd3935d169d3",
      "urlToImage": "https://dims.apnews.com/dims4/default/627d4af/2147483647/strip/true/crop/3105x1747+0+162/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F27%2F8c78b7ffd7ba1bf66ef763f2dae8%2F5064afdf63d746dd90b930d9ed906963"
    },
    {
      "author": "DAVID BAUDER",
      "description": "CBS' “60 Minutes” on Wednesday released a full, unedited transcript of its October interview with Democratic presidential candidate Kamala Harris. The network's editing of that interview last October is the centerpiece of CBS' dispute with President Donald Trump, who sued the network for $10 billion, contending that it was done to make Harris look good. CBS says its unedited transcripts prove what it has contended all along, that its broadcast was not “doctored or deceitful.” CBS News' parent company Paramount has reportedly been involved in settlement discussions with Trump lawyers. Paramount is seeking government approval for its planned merger with Skydance.",
      "publishedAt": "2025-02-05T22:33:19Z",
      "title": "'60 Minutes' publicly releases transcripts of interview at heart of its dispute with Trump",
      "url": "https://apnews.com/article/trump-60-minutes-harris-lawsuit-514b0ccbc4a4f120e4db810c6a00e259",
      "urlToImage": "https://dims.apnews.com/dims4/default/49caead/2147483647/strip/true/crop/6021x3387+0+314/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F39%2F8219d5620b2bb517ebd12af57ea9%2F22cc5180e74c465ca5ab9d50dbb67178"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "The European climate service Copernicus says the world warmed to yet another monthly heat record in January, despite an abnormally chilly United States, a cooling La Nina and predictions of a slightly less hot year. The surprising January 2025 heat record coincides with a new study by a climate science heavyweight, former top NASA scientist James Hansen, and others arguing that global warming is accelerating. That's a claim that is dividing the research community. January 2025 globally was warmer than January 2024. And it was 1.75 degrees Celsius, or 3.15 degrees Fahrenheit, warmer than it was before industrial times.",
      "publishedAt": "2025-02-06T03:03:33Z",
      "title": "US is freezing and La Nina usually eases warming. Earth just set another heat record anyway",
      "url": "https://apnews.com/article/record-hot-january-climate-change-cold-2c44da947d4b892448d18b61202a1457",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe66d41/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fa7%2Fd8a60e89de7d3951a8190d1cffca%2F4382abea178b46d68c11f44f7756f9d9"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER",
      "description": "A top Justice Department official has accused the FBI’s acting leaders of “insubordination” in a memo in which he sought to soothe anxiety inside the bureau over the potential for a broad purge of agents involved in investigating the Jan. 6 riot at the U.S. Capitol. The memo Wednesday from acting Deputy Attorney General Emil Bove said agents “who simply followed orders and carried out their duties in an ethical manner” while investigating the Capitol attack face no risk of being fired. But it also provided no reassurances for any agents found to have “acted with corrupt or partisan intent” and suggests those employees, if there any, are at risk of discipline or even termination as part of a highly unusual review process the Trump administration Justice Department is embarking upon.",
      "publishedAt": "2025-02-05T17:08:34Z",
      "title": "Justice Dept. official accuses FBI leaders of 'insubordination'",
      "url": "https://apnews.com/article/trump-fbi-justice-department-jan-6-ff003e46ea48c4e8be710d1ba2eb2d02",
      "urlToImage": "https://dims.apnews.com/dims4/default/5688acc/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fd2%2Fdbafab1b6c61cd45b33c040a85e6%2F06d1369792c24a9e9353588fcedb52d8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}