{
  "articles": [
    {
      "author": "Colleen Slevin, Eric Tucker",
      "description": "Authorities say a man who wounded 12 people in an attack on a group holding their weekly demonstration for the release of Israeli hostages in Gaza had planned to kill them all but appeared to have second thoughts. They say Mohamed Sabry Soliman had 18 Molotov cocktails but threw just two during Sunday’s attack in which he yelled “Free Palestine. The two incendiary devices he did throw into the group of about 20 people were enough to wound more than half of them, and authorities say he expressed no regrets about the attack. Federal and state prosecutors have filed separate criminal cases against Soliman, charging him with a hate crime and attempted murder, respectively.",
      "publishedAt": "2025-06-03T05:03:34Z",
      "title": "Boulder attacker planned to kill demonstrators but got scared, police say",
      "url": "https://apnews.com/article/molotov-cocktails-boulder-attack-injured-f2af62386989f6b79a5e1844a2c9dce5",
      "urlToImage": "https://dims.apnews.com/dims4/default/05b23bd/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F40%2Fb4aa5fe3bf11f5ae8518bbec1ff7%2F523bb0e61f474bcab0871746f0b0c143"
    },
    {
      "author": "Mohammad Jahjouh, Samy Magdy",
      "description": "Palestinian health officials and witnesses say Israeli forces fired on people as they headed toward an aid distribution site Tuesday, killing at least 27, in the third such incident in three days. The army said it fired “near a few individual suspects” who left the designated route, approached its forces and ignored warning shots. The near-daily shootings have come after an Israeli and U.S.-backed foundation established aid distribution points inside Israeli military zones, a system it says is designed to circumvent Hamas. The United Nations has rejected the new system, saying it doesn’t address Gaza’s mounting hunger crisis and allows Israel to use aid as a weapon. The Israeli military said it was looking into reports of casualties on Tuesday.",
      "publishedAt": "2025-06-03T05:15:25Z",
      "title": "Gaza officials say Israeli forces killed 27 heading to aid site. Israel says it fired near suspects",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-03-2025-24ce3d395c7058362e650f2330a6476f",
      "urlToImage": "https://dims.apnews.com/dims4/default/002d4b4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F0d%2F28bb1c8d93e97cd8c5f4db07f75e%2F5da0ac1f57204ac9ba1c2df2b06dc25f"
    },
    {
      "author": "Hyung-Jin Kim, Kim Tong-hyung",
      "description": "Millions of South Koreans are voting for a new president in a snap election triggered by the ouster of Yoon Suk Yeol, a conservative who faces a criminal trial over his short-lived imposition of martial law in December. Pre-election surveys suggest liberal Lee Jae-myung appears headed for an easy win in Tuesday’s election, riding on deep public frustration over the conservatives in the wake of Yoon’s martial law debacle. Conservative candidate Kim Moon Soo has struggled to restore public confidence. The winning candidate will be immediately sworn in as president Wednesday for a full, single five-year term.",
      "publishedAt": "2025-06-02T21:06:57Z",
      "title": "South Koreans vote for new president in wake of Yoon's ouster over martial law",
      "url": "https://apnews.com/article/south-korea-election-da088cf36a61641e23795688df01ee01",
      "urlToImage": "https://dims.apnews.com/dims4/default/76f35dc/2147483647/strip/true/crop/7635x4295+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F82%2Fc476c0e4304ebd399d5a35a7114b%2Fa3567d0a111e4554b2d565c2948fb367"
    },
    {
      "author": "Illia Novikov",
      "description": "Ukraine President Volodymyr Zelenskyy described a Russian attack on Sumy city center as “brutal.” “That’s all you need to know about Russia’s ‘desire’ to end this war,” Zelenskyy wrote in a post on Telegram. The attack on Tuesday came a day after direct peace talks made no progress on ending the 3-year war. Sumy authorities said at least three people were killed when a barrage of rockets struck apartment buildings and a medical facility. The war has killed more than 12,000 Ukrainian civilians, according to the United Nations, as well as tens of thousands of soldiers on both sides.",
      "publishedAt": "2025-06-03T10:09:37Z",
      "title": "Zelenskyy condemns 'brutal' Russian rocket attack after 3 killed in Ukrainian city",
      "url": "https://apnews.com/article/russia-ukraine-sumy-attack-zelenskyy-a6a513e388768e1d5179498302945bd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/a3b67b5/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F13%2Fb388154d2f84e234aeb2228a80f3%2Fa57e3bbc50b34c3ead49c4c57bf51efc"
    },
    {
      "author": "Rebecca Santana",
      "description": "A former Homeland Security official during President Donald Trump’s first administration is calling on independent government watchdogs to investigate after Trump ordered Homeland Security to look into his government service. Miles Taylor was the author of an anonymous op-ed in 2018 in The New York Times that was sharply critical of Trump. In an April 9 memorandum, the Republican president accused Taylor of making up stories to sell his book and directed government agencies to investigate Taylor and strip him of any security clearances. Taylor tells The Associated Press he spent the last few weeks debating what to do after the Trump memorandum and decided to fight back.",
      "publishedAt": "2025-06-03T10:35:05Z",
      "title": "Ex-Homeland Security official fights Trump's investigation order",
      "url": "https://apnews.com/article/trump-retaliation-miles-taylor-chris-krebs-b4f13e61b84afce7874c6500e8b891bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6e2de1/2147483647/strip/true/crop/2884x1622+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2F3e%2F03a9e46c26fa4a0387ff91d03d1d%2Fcda42db21b634dceb8bd9d9043a13763"
    },
    {
      "author": "Joseph Falzetta",
      "description": "Aid groups and opposition politicians in South Sudan say that dozens of civilians have been killed or badly injured in airstrikes in recent weeks as the country’s army clashes with militia groups across the country. The government denies that any civilians have been targeted. Many of the wounded are being transported to a Red Cross hospital in Akobo near the border with Ethiopia. The fighting began in March when a militia called the White Army overran a military barracks in the northeastern town of Nasir. The government blamed the attack on the opposition party of First Vice President Riek Machar and placed him under house arrest. It has launched offensives against militias across the country.",
      "publishedAt": "2025-06-03T03:45:34Z",
      "title": "Civilian casualties mount in South Sudan as the army clashes with local militias",
      "url": "https://apnews.com/article/south-sudan-fighting-war-crimes-killed-injured-7932d4af8b576f9e28770193116c63a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/da3a815/2147483647/strip/true/crop/3780x2126+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Ff4%2F38d4954f2db52fdce2932d82b317%2F5f19b41f5245498ca787ee5256b52a6d"
    },
    {
      "author": "The Associated Press",
      "description": "A surprise Ukrainian drone attack that targeted Russian air bases hosting nuclear-capable strategic bombers was unprecedented in its scope and sophistication, and dealt a heavy blow to the Russian military. Ukraine said more than 40 bombers were damaged or destroyed Sunday. That's about a third of Russia's strategic fleet. The Russian military said only several planes were damaged. The conflicting claims couldn’t be independently verified. But the bold attack demonstrated Ukraine’s capability to hit high-value targets anywhere on Russian territory, dealing a humiliating blow to the Kremlin and inflicting significant losses to Moscow’s arsenal in the 3-year-old war.",
      "publishedAt": "2025-06-02T16:45:37Z",
      "title": "Ukraine's attack on Russian warplanes was a blow to Kremlin's strategic arsenal",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-attack-bomber-d9078d989efcec36ec65ddfedfd2b3a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/f781b7b/2147483647/strip/true/crop/4200x2363+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Fef%2F1d8ba48c8d47724794bda034efe4%2Fc3caa7fbcb414ae2b335b615f6dfc688"
    },
    {
      "author": "Mike Corder",
      "description": "Far-right lawmaker Geert Wilders has pulled his party out of the ruling four-party Dutch coalition in dispute over a crackdown on migration. Wilders announced his decision Tuesday in a message on X after a brief meeting in parliament of leaders of the four parties that make up the 11-month-old administration. It was not immediately clear what Wilders’ decision will mean for the government of Prime Minister Dick Schoof. After years in opposition, Wilders’ party won the last election on pledges to slash migration. He has grown increasingly frustrated at what he sees as the slow pace of the coalition’s efforts to implement his plans.",
      "publishedAt": "2025-06-03T07:28:47Z",
      "title": "Far-right lawmaker Wilders pulls his party out of ruling Dutch coalition in dispute over migration",
      "url": "https://apnews.com/article/netherlands-wilders-coalition-withdraws-685e5ebe6b88313a0af68365fe741cd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/e0b9ef7/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2Fc7%2F422944cab94ef36c0555c1d47126%2F7603f6b552db4cc499b6f8027fcfa9de"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "Shares are mostly higher in Asia after U.S. stock indexes drifted closer to records. Oil prices rose and U.S. futures slipped. Markets in China advanced despite a report showing a deterioration in manufacturing activity in May, even after China and the U.S. paused tariff hikes to allow time for talks. The survey of purchasing managers, or PMI, by the financial media group Caixin showed factory output, new export orders, purchasing activity and staffing all declined. On Monday, the S&P 500 rose 0.4% and the Dow Jones Industrial Average edged up 0.1%. The Nasdaq composite added 0.7%. Treasury yields rose.",
      "publishedAt": "2025-06-03T02:18:00Z",
      "title": "World shares gain as Wall St nears records",
      "url": "https://apnews.com/article/stocks-markets-tariffs-trump-china-e2b0968cc5f496fa0dd1cdb33d30a7c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/23d57c2/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F47%2F4ab034174e33f3ea60a66adb3697%2F703c44efc9814a3fb1be06c65d50b4b3"
    },
    {
      "author": "Adithi Ramakrishnan",
      "description": "Scientists say a new planetarium show about the Milky Way has helped them unlock one of the solar system’s many secrets. Experts at the American Museum of Natural History in New York were fine-tuning a scene about the Oort Cloud that's far beyond Pluto. Scientists have never glimpsed this region, but when museum experts projected their scene onto the planetarium dome, created using simulation data, they saw a spiral shape. They published their findings in The Astrophysical Journal earlier this year. The planetarium show “Encounters in the Milky Way” opens to the public on Monday.",
      "publishedAt": "2025-06-03T09:00:09Z",
      "title": "How a new planetarium show helped scientists unlock a cosmic secret",
      "url": "https://apnews.com/article/museum-planetarium-oort-cloud-b0050c65ebff830812b505cdd8c476ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/b8fb152/2147483647/strip/true/crop/3000x1688+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F41%2F44d7972a8b78b35aa59892922cfa%2Fe5226997a00249c48df7927f92857a64"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}