{
  "articles": [
    {
      "author": "ZEKE MILLER, SEUNG MIN KIM, LISA MASCARO and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden used his closely watched news conference Thursday to deliver a forceful defense of his foreign and domestic policies and batted away questions about his ability to serve another four years, declaring: “I’m not in this for my legacy.",
      "publishedAt": "2024-07-11T15:42:43Z",
      "title": "Biden says during news conference he's going to 'complete the job' despite calls to bow out",
      "url": "https://apnews.com/9e1781a17b3313f525ef70f8a00c310a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5e345b969f148bab75389bada4ad79a/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — Joe Biden faced a test Thursday that he had avoided so far this year — a solo news conference with questions from the White House press corps.",
      "publishedAt": "2024-07-12T00:55:46Z",
      "title": "Key takeaways from Biden's news conference: Insistence on staying in the race and flubbed names",
      "url": "https://apnews.com/0d9f4936484ff71295e2b088e5c525dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcdcf2c1fc7f4092bf12de3ce8f9b62e/1920.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — Joe Biden's tribulations were previewed in Hollywood days before he got on the debate stage.",
      "publishedAt": "2024-07-12T04:33:19Z",
      "title": "Two weeks that imperiled Biden's presidency left him on probation in the court of Democratic opinion",
      "url": "https://apnews.com/2c426f98063ab30143a7675cba10a5b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bee2913342fc4de7b9fcc99ca1341627/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI, ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Four years ago, candidate Joe Biden stood before supporters at a Detroit high school, flanked by Kamala Harris and other rising Democratic stars, and called himself a bridge to the next generation of leaders.",
      "publishedAt": "2024-07-12T09:01:30Z",
      "title": "Biden pushes on 'blue wall' sprint with Michigan trip as he continues to make the case for candidacy",
      "url": "https://apnews.com/e0f71b95bc8761b1a39083b1b9af6e1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84b49eb118d44feb9fb22a7c190cf0aa/3000.jpeg"
    },
    {
      "author": null,
      "description": "SHIJAIYAH, Gaza Strip (AP) — Palestinians returned to breathtaking scenes of destruction in the Gaza City district of Shijaiyah after Israeli troops withdrew, ending a two-week offensive there. Civil defense workers said Thursday that so far, they had found the bodies of 60 people in the rubble.",
      "publishedAt": "2024-07-11T22:24:40Z",
      "title": "'We have nothing': Palestinians return to utter destruction in Gaza City after Israeli withdrawal",
      "url": "https://apnews.com/6bd730f8c5638e3f1981b91a7b8ab32c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9a63b4f195f482e898ff21a5a1f7ac9/1763.jpeg"
    },
    {
      "author": "ODED BALILTY and MELANIE LIDMAN",
      "description": "KIBBUTZ NIR OZ, Israel (AP) — The empty bedrooms of Israelis kidnapped by Hamas on Oct. 7 remain frozen in time.Nine months into their captivity in Gaza, some hostages’ bedrooms still show signs of that day’s violence and struggle: blood-stained floors, bullet-riddled walls, scorched and toppled furniture.",
      "publishedAt": "2024-07-12T06:19:38Z",
      "title": "Time is frozen in the empty bedrooms of Israelis kidnapped by Hamas",
      "url": "https://apnews.com/cc4c96578eed50fb3bda1dccd7602ef6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81f644558c244a6e8393ce6232fb26af/3000.jpeg"
    },
    {
      "author": "BINAJ GURUBCHARYA",
      "description": "KATHMANDU, Nepal (AP) — A landslide swept two passenger buses carrying more than 50 people into a swollen river in central Nepal early Friday, while continuous rain and more landslides were making rescue efforts difficult.",
      "publishedAt": "2024-07-12T03:10:18Z",
      "title": "2 buses carrying more than 50 people were swept into a river by a landslide in Nepal",
      "url": "https://apnews.com/d137967a9a0975f45cf8ff75f812fed4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4edfafb78994b6cb05896063545aed1/2800.jpeg"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "A security breach in 2022 compromised the data of nearly all of AT&amp;T’s cellular customers, customers of mobile virtual network operators using AT&amp;T’s wireless network, as well landline customers who interacted with those cellular numbers.",
      "publishedAt": "2024-07-12T11:30:30Z",
      "title": "AT&T 2022 security breach hits nearly all cellular customers and landline accounts with contact",
      "url": "https://apnews.com/b5cdc8d6c9e1b980cb2163f34b297dad",
      "urlToImage": ""
    },
    {
      "author": "BILL BARROW",
      "description": "For all the usual stagecraft, the Republican National Convention that opens Monday is different from Donald Trump's previous nominating affairs.",
      "publishedAt": "2024-07-12T05:03:32Z",
      "title": "Republicans are gathering in Milwaukee to nominate Donald Trump again. Here's what to expect",
      "url": "https://apnews.com/702139084873df3d633ee19d1b82e5f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c96ea90a852441e5aa250170e36bdc7b/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — Relatively few Americans fully endorse the idea that a fertilized egg should have the same rights as a pregnant woman. But a significant share say it describes their views at least somewhat well, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-07-12T04:12:43Z",
      "title": "More than 6 in 10 U.S. adults support protecting access to IVF, AP-NORC poll finds",
      "url": "https://apnews.com/3adcb634d5d99d9ebfcc7a28530b1487",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7531cb555c964167ae75ffda073f6017/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}