{
  "articles": [
    {
      "author": "SEUNG MIN KIM and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — The crowds are psyched. The campaign donations are flooding in.",
      "publishedAt": "2024-08-04T02:02:09Z",
      "title": "After smooth campaign start, Kamala Harris faces a crucial week ahead",
      "url": "https://apnews.com/65477e459afb6290467aeb57cac3b622",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4e7412c7d2f4ae2a6e1e14fdc4f02ff/3000.jpeg"
    },
    {
      "author": "BILL BARROW and MEG KINNARD",
      "description": "ATLANTA (AP) — Donald Trump picked a new fight Saturday with Georgia's Republican governor as he campaigned in the key swing state where he's looking to avenge his narrow 2020 loss — a defeat he continues to blame on GOP officials for not giving into his false theories of election fraud.",
      "publishedAt": "2024-08-03T04:06:03Z",
      "title": "Trump again tears into Georgia's Republican governor on the same day he campaigns in the state",
      "url": "https://apnews.com/b21c25bbbfafdd0343c8812f6c3d7c9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dd2bf54fd9c4b06acf334b3142dab1d/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and MELANIE LIDMAN",
      "description": "FARDIS, Lebanon (AP) — Alma Ayman Fakhr al-Din, a lively 11-year-old who loved basketball and learning languages, was playing on a soccer field a week ago in Majdal Shams, a Druze town in the Israeli-occupied Golan Heights, when the rocket hit.",
      "publishedAt": "2024-08-03T16:22:27Z",
      "title": "Horror at deaths of 12 children unites Druze across borders. But Mideast's wars tear at their bonds",
      "url": "https://apnews.com/cd1005be55b3893f0852e431643899bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2825540bfc640e8a81b838f830cf6d4/3000.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — Israeli police and medics say a woman in her 70s was killed and three other people were wounded in a stabbing attack in a suburb of Tel Aviv. The police said the attacker was a resident of the West Bank, suggesting that Sunday's attack was carried out by a Palestinian militant.",
      "publishedAt": "2024-08-04T05:44:53Z",
      "title": "A woman was killed and 3 others were wounded in a stabbing attack in Israel",
      "url": "https://apnews.com/5b480a3b22538edec9fa05908f28303f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b40fe6d64f6a42a881e58a2f6d1adc27/3000.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ",
      "description": "CARACAS, Venezuela (AP) — Thousands of people rallied in the streets of Venezuela's capital Saturday, waving the national flag and singing the national anthem in support of an opposition candidate they believe won the presidential election by a landslide.",
      "publishedAt": "2024-08-03T18:08:52Z",
      "title": "Opposition leader joins rally calling for Venezuela presidential election results to be overturned",
      "url": "https://apnews.com/d6e70bd88ee9511298a4850c224a12e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66f26ed4e3ca4ee09cae4e58bc5791ee/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "CHAPIN, S.C. (AP) — Donald Trump says he is pulling out of a scheduled September debate with Vice President Kamala Harris on ABC and wants them to face off on Fox News, making it increasingly unlikely that the candidates will confront each other on stage before the November election.",
      "publishedAt": "2024-08-03T17:57:07Z",
      "title": "Trump says he'll skip an ABC debate with Harris in September and wants them to face off on Fox News",
      "url": "https://apnews.com/0d0be341bbe7877a71bfc4bed40610fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ea84cf4bdb446e9a00f6a65dcd552ce/3000.jpeg"
    },
    {
      "author": null,
      "description": "MIAMI (AP) — A tropical depression strengthened into Tropical Storm Debby north of Cuba on Saturday and was predicted to become a hurricane as it moves through the Gulf of Mexico on a collision course with the Florida coast.",
      "publishedAt": "2024-08-03T14:07:45Z",
      "title": "Tropical Storm Debby moving through Gulf toward Florida with hurricane warnings",
      "url": "https://apnews.com/dce34e4d691b2c12a386964f86215220",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb13807cfec3455d8839a845ac8b88a3/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — They have combed the ashes for mementos, worried about where they would sleep, questioned their faith and tried to find a way to grieve amid the great, unsettling devastation.",
      "publishedAt": "2024-08-04T04:05:57Z",
      "title": "'We're going to survive and it's going to come back': A year after Maui wildfire, survivors press on",
      "url": "https://apnews.com/6170a7a96e0944dbe7444c0783912656",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbe6134b08b34dba808b8b111864f91f/3000.jpeg"
    },
    {
      "author": "VANESSA GERA",
      "description": "WARSAW, Poland (AP) — When Russia invaded Ukraine in February 2022, reporters from around the world rushed to the Polish-Ukrainian border to cover an exodus of refugees fleeing Russian bombs.",
      "publishedAt": "2024-08-04T03:04:05Z",
      "title": "Spanish journalist or Russian spy? The mystery around Pablo González's double life",
      "url": "https://apnews.com/dbd435bad5a1a435922550d09026b45d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5423528d07b348f4ac8b4f107d201dab/3000.jpeg"
    },
    {
      "author": "PAUL NEWBERRY",
      "description": "NANTERRE, France (AP) — Every year on Aug. 3, Katie Ledecky is reminded of her first Olympic gold medal.She was just 15 years old, a reserved high schooler who had surprisingly made the U.S. swim team for the London Games.",
      "publishedAt": "2024-08-03T18:53:49Z",
      "title": "Katie Ledecky swims into history with 800 freestyle victory at the Paris Olympics",
      "url": "https://apnews.com/46342b7abd636282da995d1b0b9c4aff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddbb01425e504402b6c999b90cc25451/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}