{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and JON GAMBRELL",
      "description": "JERUSALEM (AP) — Booms and air raid sirens sounded in Jerusalem early Sunday after Iran launched dozens of drones and ballistic missiles toward Israel in an unprecedented revenge mission that pushed the Middle East ever closer to a regionwide war.",
      "publishedAt": "2024-04-13T08:20:12Z",
      "title": "Booms and sirens in Israel after Iran launches ballistic missiles and drones in unprecedented attack",
      "url": "https://apnews.com/33fcffde2d867380e98c89403776a8ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9129643b36ea4db5a56435c908a50fd1/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — President Joe Biden cut short a weekend stay at his Delaware beach house to meet with his national security team at the White House Saturday and monitor the situation in the Middle East as Iran launched an attack against Israel.",
      "publishedAt": "2024-04-13T17:52:29Z",
      "title": "Biden meeting with his national security team as US pledges 'support' for Israel against Iran",
      "url": "https://apnews.com/c57e89a9cbe178b20b53bac404a86728",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/266aea3cb0ee4408a3de9af124120a46/3000.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — An incoming attack by Iranian drones and ballistic missiles poses the latest challenge to Israel’s air defense system, which already has been working overtime to cope with incoming rocket, drone and missile attacks throughout the six-month war against Hamas.",
      "publishedAt": "2024-04-13T23:19:13Z",
      "title": "Israel has deployed a multilayered air-defense system. It faces big test with Iranian drone strike.",
      "url": "https://apnews.com/bbf6330918da036f2e000360556a81f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68a04247432f4db5858784141ed38125/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Iran launched its first direct military attack against Israel on Saturday. The Israeli military says Iran fired more than 100 bomb-carrying drones toward Israel. Hours later, Iran announced it had also launch much more destructive ballistic missiles.",
      "publishedAt": "2024-04-13T21:38:19Z",
      "title": "The Latest | Iran launches its first direct military attack against Israel",
      "url": "https://apnews.com/e9f591255451b2a9f666846cf1b8e64b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c63123aa74946a1981e59f48baba231/3000.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI and CHRISTINE FERNANDO",
      "description": "NASHVILLE, Tenn. (AP) — For decades, only three people knew Gloria Johnson had had an abortion.But a year of watching women and doctors agonize under Tennessee's strict abortion ban kicked up a fire in the longtime Democrat.",
      "publishedAt": "2024-04-13T14:49:28Z",
      "title": "Progressive candidates are increasingly sharing their own abortion stories after Roe's demise",
      "url": "https://apnews.com/1fc9f35dd526fa61c9252d4c88f215db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a79b53faa5734b50951acfa7206e64e9/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and ERIC TUCKER",
      "description": "NEW YORK (AP) — It was the kind of tawdry tale that Donald Trump might have relished before politics: a porn actor claiming they had had sex.But on the eve of the 2016 presidential election, Trump feared the story, which he says is false, would cost him votes.",
      "publishedAt": "2024-04-13T04:01:09Z",
      "title": "How a hush money scandal tied to a porn star led to Trump’s first criminal trial",
      "url": "https://apnews.com/e40532d3bce7768e296fdaf9591ef05b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bbac647cf8e4be5b65e28196d65ba53/2000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — No woman has appeared more often before the Supreme Court than Lisa Blatt, who will make her 50th argument this month. No lawyer, male or female, has done it with quite the same mix of humor, passion and style.",
      "publishedAt": "2024-04-13T13:12:02Z",
      "title": "Nearing 50 Supreme Court arguments in, lawyer Lisa Blatt keeps winning",
      "url": "https://apnews.com/4e3a5042d299eab80a0577f8c81eb189",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/134958e02d7d44f4850cbb9e0d8cdca0/3000.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "The Ford Bronco initially was conceived and designed for rugged outdoorsy types, a two-door means of escape to nature from the bustling cities of mid-century America. But it had already been tamed and polished for suburbanites, with cruise control and air conditioning, by 1994, when O.J.",
      "publishedAt": "2024-04-13T04:46:29Z",
      "title": "How O.J. Simpson burned the Ford Bronco into America's collective memory",
      "url": "https://apnews.com/71bfec2bf12112bceb004e6dcfd321df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9075c4c25164462ca13c5aa3b40f59da/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Faith Ringgold, an award-winning author and artist who broke down barriers for Black female artists and became famous for her richly colored and detailed quilts combining painting, textiles and storytelling, has died.",
      "publishedAt": "2024-04-13T23:23:50Z",
      "title": "Faith Ringgold, pioneering Black quilt artist and author, dies at 93",
      "url": "https://apnews.com/d246c574578149b49edb5f612fd8310f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c769020cf8b433cb0d763fd513d99e5/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "AUGUSTA, Ga. (AP) — The 60 players who survived one of the most wind-blown, grueling days at the Masters were greeted by an Augusta National that appeared to be far more agreeable on Saturday.",
      "publishedAt": "2024-04-13T14:35:01Z",
      "title": "Masters weekend has three-way tie and more forgiving conditions. It also has Tiger Woods",
      "url": "https://apnews.com/dbafb7b5d205767df5239fc3383a7a55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5321837ba0c64e68b2b7e2dad4fc0180/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}