{
  "articles": [
    {
      "author": null,
      "description": "British Prime Minister Keir Starmer is meeting with Ukrainian President Volodymyr Zelenskyy in London. The visit Thursday follows Zelenskyy's virtual meetings with U.S. President Donald Trump and European leaders a day earlier. Trump assured the leaders he would prioritize a ceasefire in Ukraine during his meeting with Russian President Vladimir Putin in Alaska on Friday. European leaders, including German Chancellor Friedrich Merz and French President Emmanuel Macron, called the discussions constructive. However, some Ukrainians remain skeptical about achieving meaningful progress. Meanwhile, Russian strikes in Ukraine's Sumy and Kherson regions have injured several people, including children.",
      "publishedAt": "2025-08-14T08:17:22Z",
      "title": "Zelenskyy and Starmer meet in London ahead Trump-Putin summit",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-starmer-trump-putin-838f844639657d51dd4b195d8c2f417c",
      "urlToImage": "https://dims.apnews.com/dims4/default/3eaff54/2147483647/strip/true/crop/4368x2457+0+228/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Ff1%2Fbb57d0c21e4c04ba3cfae30a5a0b%2F3c9311f961ec4a54a789e0eec1df7c76"
    },
    {
      "author": null,
      "description": "President Donald Trump’s meeting in Alaska with Vladimir Putin could be a decisive moment in the war in Ukraine and in the U.S. leader’s anomalous relationship with his Russian counterpart. Trump has long boasted that he’s always gotten along well with Putin and spoken admiringly of him, even praising him as “pretty smart” for invading Ukraine. But in recent months, he’s expressed open frustrations with Putin and called him “CRAZY” while threatening to impose sanctions on Russia. Still, Trump’s self-imposed deadline for sanctions came and went without any announced penalties or explanation from the White House and the Republican president, tempering expectations for their Friday summit.",
      "publishedAt": "2025-08-14T04:06:00Z",
      "title": "Trump's relationship with Putin is spotlighted in Alaska amid Ukraine war",
      "url": "https://apnews.com/article/trump-putin-relationship-over-years-d7a6c5400d9ec88127d16278be07a145",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcce3f3/2147483647/strip/true/crop/5121x2881+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F4f%2Fdf82e1cb246260425f733ae75fb3%2Fe3e41cac1bc44ccb9b330b84a665cc11"
    },
    {
      "author": null,
      "description": "Israel’s far-right finance minister has announced a contentious new settlement construction in the Israeli-occupied West Bank, which Palestinians and rights groups worry will scuttle plans for a future Palestinian state by effectively cutting the West Bank into two separate parts. The announcement comes as many countries said they would recognize a Palestinian state in September. Finance Minister Bezalel Smotrich said, “This reality finally buries the idea of a Palestinian state, because there is nothing to recognize and no one to recognize.”",
      "publishedAt": "2025-08-14T09:34:16Z",
      "title": "Israel announces West Bank settlement that rights groups say could imperil Palestinian state",
      "url": "https://apnews.com/article/israel-west-bank-settlement-smotrich-palestinian-state-3b048633b41ac2c61206675fbf73d197",
      "urlToImage": "https://dims.apnews.com/dims4/default/3842f63/2147483647/strip/true/crop/3844x2162+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2F35%2F66312b84824005dfce471e9132dc%2F55e13543b0e146edbc8c38519c01a5e0"
    },
    {
      "author": null,
      "description": "For most of his quarter-century rule, President Vladimir Putin visited places like Paris, London, Vienna and New York. Since Moscow invaded Ukraine, however, his destinations have been Beijing, Pyongyang, Hanoi and Minsk as the West sought to turn Russia into a pariah. The trip to Alaska will be Putin’s first to the U.S. since 2015, when he attended the U.N. General Assembly in New York. Russia has countered Western attempts to isolate it by bolstering its ties with ex-Soviet allies and other developing countries. Putin’s travel also has been limited by an International Criminal Court arrest warrant from 2023 that prompted him to avoid visits to places that recognize the court’s authority.",
      "publishedAt": "2025-08-13T14:15:43Z",
      "title": "Putin's trip to Alaska is his first to the US in a decade",
      "url": "https://apnews.com/article/russia-putin-trump-alaska-summit-foreign-trips-ad552c9b56d9b37bf0f29fd9841c256d",
      "urlToImage": "https://dims.apnews.com/dims4/default/300a359/2147483647/strip/true/crop/6390x3594+0+334/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fc7%2F30b09051a5914fee44bbf2a7602b%2Fc9aa9db7bee2456ca61334f2c6f2db31"
    },
    {
      "author": null,
      "description": "President Franklin D. Roosevelt signed the Social Security Act into law 90 years ago this week, aiming to provide economic stability for older Americans. Today, the program supports nearly 69 million people monthly but faces significant challenges. Social Security is projected to run out of money to pay full benefits by 2034. Recent legislation and tax changes have accelerated this timeline. Discussions about privatizing Social Security have resurfaced, with some experts suggesting benefit reductions for wealthier retirees. Public confidence in the program's future is waning, and debates continue about potential reforms to ensure its sustainability.",
      "publishedAt": "2025-08-14T10:51:23Z",
      "title": "Social Security may be more threatened than ever as it marks 90th year",
      "url": "https://apnews.com/article/trump-social-security-90th-anniversary-shortfall-9552a6b2d862bda0f553cc5d349ba469",
      "urlToImage": "https://dims.apnews.com/dims4/default/51f535b/2147483647/strip/true/crop/1945x1094+0+101/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2Fb9%2Ffada138528e7ffcbeb9912422d8f%2Fcc8a1cab56874dfab365365a67521ebf"
    },
    {
      "author": null,
      "description": "As National Guard troops deploy across her city as part of President Donald Trump’s efforts to clamp down on crime, D.C. Mayor Muriel Bowser is responding with relative restraint. She’s called Trump’s takeover of the city’s police department and his decision to activate 800 members of the guard “unsettling and unprecedented” and gone as far as to cast his efforts as part of an “authoritarian push.” But Bowser has so far declined to respond with the kind of biting rhetoric and personal attacks typical of other high-profile Democratic leaders. The approach underscores the reality of Washington, D.C.’s precarious position under the thumb of the federal government and limited legal options.",
      "publishedAt": "2025-08-14T04:03:44Z",
      "title": "DC Mayor Bowser responds to Trump with relative restraint",
      "url": "https://apnews.com/article/trump-bowser-dc-home-rule-national-democrats-8e262a15267bdae66049201a4cc4a6a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/f78127f/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2Fa8%2F33d7583dc3cc883c5e70244db943%2Ff24450b987c54cda9edf35fd2fef1ac0"
    },
    {
      "author": null,
      "description": "A Rhode Island man accused of faking his death and fleeing the United States to evade rape charges has been found guilty of sexually assaulting a former girlfriend in his first of two Utah trials. A jury in Salt Lake County found Nicholas Rossi guilty of a 2008 rape after a three-day trial. He is to be sentenced on Oct. 20. An obituary published online claimed Rossi had died on Feb. 29, 2020, of late-stage non-Hodgkin lymphoma. But police in his home state of Rhode Island, along with his former lawyer and a former foster family, cast doubt on whether he was dead. He was arrested in Scotland the following year and extradited to Utah in January 2024.",
      "publishedAt": "2025-08-14T04:12:05Z",
      "title": "Man accused of faking his death to avoid rape charges is found guilty of sexual assault in Utah",
      "url": "https://apnews.com/article/nicholas-rossi-rape-trial-utah-guilty-4c9dd5588110e42847a3b9fbcf6f6657",
      "urlToImage": "https://dims.apnews.com/dims4/default/b33b25b/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2Fae%2Fcf7a5d2662790946b0ec64018c72%2Fafa82378de7b4bda93a605e10333011b"
    },
    {
      "author": null,
      "description": "Florida shifted to virtual learning for youth in juvenile detention — and parents and students say it's been a disaster. The state adopted this approach for incarcerated youth, despite evidence that online learners struggled during the pandemic. Officials said they chose Florida Virtual School, known for its rigorous standards, in part to help students reintegrate into public schools. But students find the coursework difficult to understand. They say they have little support from qualified teachers, and their special education plans aren't being met. This frustration often leads to behavioral issues, extending students' time in detention, sometimes by months or more.",
      "publishedAt": "2025-08-14T04:15:55Z",
      "title": "Online school in juvenile detention: Incarcerated teens say they aren't learning",
      "url": "https://apnews.com/article/school-juvenile-detention-online-feb1368304e42855017af229890bff4c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d9ce233/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F7c%2F80e7d7f30b51baf6859285ac5f90%2F244ceb7aa6eb490faa816f1c05850125"
    },
    {
      "author": null,
      "description": "World shares are mixed ahead of a key meeting between U.S. President Donald Trump and Russian leader Vladimir Putin at the week's end. Oil prices rose, while U.S. futures were little changed as investors awaited an update later Thursday on U.S. inflation at the wholesale level. Bitcoin briefly rose more than 3% to a new record of over $123,000 but then gave up some of those gains. On Wednesday, U.S. stocks again ticked higher, with the S&P 500 adding 0.3% to a fresh record. The Dow Jones Industrial Average climbed 1%, while the Nasdaq composite added 0.1% to its own record set the day before.",
      "publishedAt": "2025-08-14T04:24:12Z",
      "title": "World shares are mixed ahead of meeting between Trump and Putin",
      "url": "https://apnews.com/article/asia-shares-japan-bessent-wall-street-02e8aa1fa772ad3570249dc81f917325",
      "urlToImage": "https://dims.apnews.com/dims4/default/507990d/2147483647/strip/true/crop/5750x3234+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2F6c%2F65302e59680e1e9dd0167a657fad%2Ffbbefeb75ad548bb82b4e3a756c12b15"
    },
    {
      "author": null,
      "description": "Some cottontail rabbits in Fort Collins, Colorado, have been drawing attention because they have wart-like growths on their faces that look like horns. The rabbits are infected with the relatively common Shope papillomavirus. The virus likely inspired the centuries-old jackalope myth. It also helped scientists learn about the connection between viruses and cancer, such as the human papillomavirus that causes cervical cancer. Experts say the virus cannot spread to other species. The growths don’t harm rabbits unless they grow on their eyes or mouths and interfere with eating. Rabbits’ immune systems are able to fight the virus. And once they do, the growths will disappear.",
      "publishedAt": "2025-08-13T22:24:40Z",
      "title": "Rabbits with virus-caused 'horns' have been spotted in Colorado",
      "url": "https://apnews.com/article/rabbits-with-horns-virus-colorado-tentacles-papillomavirus-98b1ad95ba3a0f308bf884d79d1eea7c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2962219/2147483647/strip/true/crop/3024x1701+0+158/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F8b%2F60798fbfb37a0d05de748346ab73%2F173745755c92432e8ac866bcd433afeb"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}