{
  "articles": [
    {
      "author": "JOHNSON LAI, CHRISTOPHER BODEEN and SIMINA MISTREANU",
      "description": "HUALIEN, Taiwan (AP) — The strongest earthquake in a quarter-century rocked Taiwan during the morning rush hour Wednesday, killing nine people, stranding dozens of workers at quarries and sending some residents scrambling out the windows of damaged buildings.",
      "publishedAt": "2024-04-03T00:24:07Z",
      "title": "Strongest earthquake in 25 years rocks Taiwan, killing 9 people and stranding 70 workers in quarries",
      "url": "https://apnews.com/f086aac0c3082036d1ca77c01828fb28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4226cac03b246cfa1c1ae621a660386/1920.jpeg"
    },
    {
      "author": "SIMINA MISTREANU",
      "description": "TAIPEI, Taiwan (AP) — Taiwan was struck Wednesday by its most powerful earthquake in a quarter of a century.",
      "publishedAt": "2024-04-03T10:22:19Z",
      "title": "Why is Taiwan so exposed to earthquakes and so well prepared to withstand them?",
      "url": "https://apnews.com/8c3de7d63c964ae460424aa7e52581a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a2edde03cd04ae180de4bbb6554e43b/3000.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — The bodies of six foreign aid workers killed in Israeli airstrikes began the journey back to their home countries Wednesday as they were transported out of the Gaza Strip and into Egypt, Egyptian state television reported.",
      "publishedAt": "2024-04-03T12:30:29Z",
      "title": "Bodies of 6 foreign aid workers slain in Israeli strikes are transported out of Gaza",
      "url": "https://apnews.com/3e379f56a6153c347179e3e99823c407",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b61aaf6421004bad91582a68a7f7d7ed/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli airstrikes that killed seven aid workers in Gaza reverberated around the world, as friends and relatives mourned the losses of those who were delivering food to besieged Palestinians with the charity World Central Kitchen.",
      "publishedAt": "2024-04-02T18:40:33Z",
      "title": "Family and friends recall dedication of World Central Kitchen aid workers killed in Gaza",
      "url": "https://apnews.com/f79eccaf93e34e36d39ae16c848dde92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27f84080751545e28f22a51e6671ab73/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Federal prosecutors chided the judge presiding over former President Donald Trump's classified documents case in Florida, warning her off potential jury instructions that they said rest on a “fundamentally flawed legal premise.”",
      "publishedAt": "2024-04-03T11:20:02Z",
      "title": "Prosecutors in Trump's classified documents case sharply rebuke judge's unusual and 'flawed' order",
      "url": "https://apnews.com/a99a6bc9fd9b44ffddecf979f8e1baa9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4c8081b0dbd419ea6b7a2f7c6fb5823/3000.jpeg"
    },
    {
      "author": "GARY FIELDS and AMELIA THOMSON DEVEAUX",
      "description": "WASHINGTON (AP) — Despite the country's deep political polarization, most Americans share many core beliefs about what it means to be an American, according to a new poll.The poll from The Associated Press-NORC Center for Public Affairs Research found that about 9 in 10 U.S.",
      "publishedAt": "2024-04-03T04:03:20Z",
      "title": "Yes, we're divided. But new AP-NORC poll shows Americans still agree on most core American values",
      "url": "https://apnews.com/b1047da72551e13554a3959487e5181a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0123ba172e4448f0ae9694e929ade7e2/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Federal Reserve officials will likely reduce their benchmark interest rate later this year, Chair Jerome Powell said Wednesday, despite recent reports showing that the U.S.",
      "publishedAt": "2024-04-03T16:11:05Z",
      "title": "Powell: Fed still sees rate cuts this year; election timing won't affect decision",
      "url": "https://apnews.com/f9c65fb1b8116168f825657bc5f5c117",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05552354cdb2489d8762de355612a4c9/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukraine lowered its draft-eligible age for men from 27 to 25 on Wednesday, reflecting the strain that more than two years of war with Russia has put on its military and the need to infuse its depleted ranks with new conscripts.",
      "publishedAt": "2024-04-03T07:52:41Z",
      "title": "Ukraine lowers its conscription age to 25 to replenish its beleaguered troops",
      "url": "https://apnews.com/251058a942a253f3eaec2c53373adf03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d2ef137726b4e989ec412d69a2e06a5/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and CLAUDIA LAUER",
      "description": "In the moments before the cargo ship Dali rammed into the Francis Scott Key Bridge and sent it crumbling into the water, a flurry of urgent warnings crackled over radios and enabled police to block traffic from getting on the span, likely saving lives.",
      "publishedAt": "2024-04-03T04:11:02Z",
      "title": "Workers had little warning as Maryland bridge collapsed, raising concerns over safety, communication",
      "url": "https://apnews.com/f907ab712588d9ef0fdb58d85022bd95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d987555257b40a0b9808fa6f9242cce/3000.jpeg"
    },
    {
      "author": "TOM WITHERS",
      "description": "CLEVELAND (AP) — Long before Caitlin Clark broke records, packed arenas across the country like a Taylor Swift in sneakers and inspired young girls to be like her, women's basketball looked very different than it does today.",
      "publishedAt": "2024-04-03T16:02:34Z",
      "title": "Caitlin Clark's path to stardom paved by pioneering players who changed trajectory for women's hoops",
      "url": "https://apnews.com/1ef8916fdef204fc5243cfd5dce15591",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cc10ba3a92849ce96675450b40ac797/1884.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}