{
  "articles": [
    {
      "author": "FRANK BAJAK and DAKE KANG",
      "description": "Chinese police are investigating an unauthorized and highly unusual online dump of documents from a private security contractor linked to the nation's top policing agency and other parts of its government — a trove that catalogs apparent hacking activity and tools to spy on both Chinese and foreigners.",
      "publishedAt": "2024-02-21T19:29:41Z",
      "title": "An online dump of Chinese hacking documents offers a rare window into pervasive state surveillance",
      "url": "https://apnews.com/aac38c75f268b72910a94881ccbb77cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87e1ff6f878742c58e935429ba8de08a/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Kateryna Dmytryk had been waiting for this moment for almost two years — nearly all of her young son’s life.",
      "publishedAt": "2024-02-21T05:13:11Z",
      "title": "For many Ukrainians, life is split in two: Before and after the war. This is one family's story",
      "url": "https://apnews.com/9af6c5f03ca93a2f96dbcffbdea42f40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32fd5cf8b37a4b358d66335f9e79f18c/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Earlier this month, when Tucker Carlson asked Vladimir Putin about his reasons for invading Ukraine two years ago, Putin gave him a lecture on Russian history.",
      "publishedAt": "2024-02-21T05:27:32Z",
      "title": "How the Kremlin weaponized Russian history — and has used it to justify the war in Ukraine",
      "url": "https://apnews.com/80cb70fff9820357eddb83170695bdbb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2ffb03ba67445c78526afe8bbc854c0/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "From the earliest days of the Israel-Hamas war, the United States and much of the international community have pressed Israel to allow more humanitarian aid into the Gaza Strip.",
      "publishedAt": "2024-02-21T19:16:49Z",
      "title": "Why isn't desperately needed aid reaching Palestinians in Gaza?",
      "url": "https://apnews.com/1ce556a8a839803c8a1624b1b69b0a13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f54ea39872e40a6bf0661c5530ba986/3000.jpeg"
    },
    {
      "author": null,
      "description": "SEATTLE (AP) — Boeing said Wednesday that the head of its 737 jetliner program is leaving the company in an executive shake-up weeks after a door panel blew out on a flight over Oregon, renewing questions about safety at the company.",
      "publishedAt": "2024-02-21T19:17:15Z",
      "title": "Boeing ousts head of 737 jetliner program weeks after panel blowout on a flight over Oregon",
      "url": "https://apnews.com/fafcceb3a58aaded9c3afe96cf7a9fce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/969b8d60f89d47279c102c66ef4b8026/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — A large Alabama hospital has paused in vitro fertilization treatments as health care providers weigh the impact of a state court ruling that frozen embryos are the legal equivalent of children.",
      "publishedAt": "2024-02-21T20:48:13Z",
      "title": "Alabama hospital puts pause on IVF in wake of ruling saying frozen embryos are children",
      "url": "https://apnews.com/4cf5d3139e1a6cbc62bc5ad9946cc1b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/716b6b7041c04ff68452d83dc0f0f8aa/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "For as long as schools have policed hairstyles as part of their dress codes, some students have seen the rules as attempts to deny their cultural and religious identities. Nowhere have school rules on hair been a bigger flashpoint than in Texas, where a trial this week is set to determine whether high school administrators can continue punishing a Black teenager for refusing to cut his hair.",
      "publishedAt": "2024-02-21T15:48:01Z",
      "title": "School dress codes promote discipline. But many Black students see traces of racism",
      "url": "https://apnews.com/c70448fd65670eed79ca902e30834b41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47c4616b818f42cea7ed152315dee867/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Occupants of the White House have grumbled over news coverage practically since the place was built. Now it's Joe Biden's turn: With a reelection campaign underway, there are signs that those behind the president are starting to more aggressively and publicly challenge how he is portrayed.",
      "publishedAt": "2024-02-21T05:19:09Z",
      "title": "It's an election year, and Biden's team is signaling a more aggressive posture toward the press",
      "url": "https://apnews.com/3bda702e68181e58ead973e7c8eae0c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/750e8c1343b04f069020ccac79349b2b/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and SYLVIA HUI",
      "description": "LONDON (AP) — WikiLeaks founder Julian Assange won't find out until next month at the earliest whether he can challenge extradition to the U.S. on spying charges, or if his long legal battle in Britain has run out of road.",
      "publishedAt": "2024-02-21T09:05:02Z",
      "title": "WikiLeaks’ Assange faces wait to find out whether he can challenge extradition to the U.S.",
      "url": "https://apnews.com/25a5f66df1e8d94d0db1e9d6bb323ea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26770385cef44dfa880ff431197d39a3/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — Alzheimer’s quietly ravages the brain long before symptoms appear and now scientists have new clues about the dominolike sequence of those changes — a potential window to one day intervene.",
      "publishedAt": "2024-02-21T22:16:38Z",
      "title": "Silent brain changes precede Alzheimer's. Researchers have new clues about which come first",
      "url": "https://apnews.com/b31db4ce15caf8b5c9c722b6240b2951",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f9613dac6da4fd9a66f3cb18039f141/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}