{
  "articles": [
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Joe Biden's name wasn't on the ballot, but history will likely remember Kamala Harris' resounding defeat as his loss too.",
      "publishedAt": "2024-11-07T05:01:54Z",
      "title": "Biden gets blamed by Harris allies for the vice president's resounding loss to Trump",
      "url": "https://apnews.com/5588bafd05471d4c4fb0145db21291d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ba51477b042455ebb01cd81f4b36e2a/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, WILL WEISSERT and JILL COLVIN",
      "description": "WEST PALM BEACH, Fla. (AP) — Donald Trump spent his first day as president-elect receiving congratulatory phone calls from his defeated opponent, world leaders and President Joe Biden as he began the process of turning his election victory into a government.",
      "publishedAt": "2024-11-06T20:58:12Z",
      "title": "Trump receives congratulations and an invitation to the White House as Biden nudges on transition",
      "url": "https://apnews.com/f33e3d9f1647ee62709046993ffa082a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/191427a8518a4877965e40abc3361f7f/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT and GISELA SALOMON",
      "description": "SAN DIEGO (AP) — “Build the Wall” was Donald Trump's rally cry in 2016, and he acted on his promise by tapping military budgets for hundreds of miles of border wall with Mexico. “Mass Deportation” was the buzzword that energized supporters for his White House bid in 2024.",
      "publishedAt": "2024-11-06T22:24:57Z",
      "title": "Trump's return to White House sets stage for far-reaching immigration crackdown",
      "url": "https://apnews.com/a681c4980ef25e2b3a7ae670c9094f4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43623efa3d0347b3af7d9b37ca24f8b3/3000.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — American presidential elections are a moment when the nation holds up a mirror to look at itself. They are a reflection of values and dreams, of grievances and scores to be settled.",
      "publishedAt": "2024-11-06T22:14:41Z",
      "title": "Trump has vowed to shake some of democracy's pillars",
      "url": "https://apnews.com/4bf1465b465ea1da92fb7474f2f9becd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c09c8358d3d74687a8b12b47ad5091bc/3000.jpeg"
    },
    {
      "author": "MEHDI FATTAHI and JON GAMBRELL",
      "description": "TEHRAN, Iran (AP) — Iranians, like many around the world, are divided on what Donald Trump's next presidency will bring: Some foresee an all-out war between Tehran and Washington, particularly as other conflicts rage in the region.",
      "publishedAt": "2024-11-07T13:53:31Z",
      "title": "For many Iranians, Trump’s return intensifies worries about war. Yet some see reasons for hope",
      "url": "https://apnews.com/9a8012fdfabc3cb0fd2340bf99c0aaf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc48d06e80534bc183385beaddb23576/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — Hungary's fiery, right-wing leader says Donald Trump’s victory will help his own battle against immigration and multiculturalism and restore traditional family values.In Argentina, a president who once bear-hugged Trump at a political conference in Maryland is attacking his critics as rats and parasites, ranting against what he calls a corrupt elite and calling climate change “a socialist lie.”",
      "publishedAt": "2024-11-07T05:19:03Z",
      "title": "Trump's second term could realign US diplomacy toward authoritarian leaders",
      "url": "https://apnews.com/ff69aeab1d5a357848d5ee4001dc1591",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21b0ea2ea5294bd3b331f67645a5ff4b/3000.jpeg"
    },
    {
      "author": null,
      "description": "CHILI, N.Y. (AP) — A bus with dozens of passengers aboard rolled over on a highway in upstate New York on Thursday morning, critically injuring one person and sending others to hospitals, police said.",
      "publishedAt": "2024-11-07T14:16:05Z",
      "title": "1 person is critically injured after bus overturns on upstate New York highway",
      "url": "https://apnews.com/3f04d5a27e2fd9985c6ba9a44bd1aa19",
      "urlToImage": ""
    },
    {
      "author": "LAURA UNGAR",
      "description": "When a volcanic eruption buried the ancient city of Pompeii, the last desperate moments of its citizens were preserved in stone for centuries.",
      "publishedAt": "2024-11-07T16:02:38Z",
      "title": "New DNA evidence rewrites long-told stories of people in ancient Pompeii",
      "url": "https://apnews.com/e238247d5b24d74aaa1b8e26465bb546",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0752d0e01a34f0f9d99b53c74f240e1/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Federal Reserve officials are poised Thursday to reduce their key interest rate for a second straight time, responding to a steady slowdown of the inflation pressures that exasperated many Americans and contributed to Donald Trump's presidential election victory.",
      "publishedAt": "2024-11-07T05:01:27Z",
      "title": "Federal Reserve is set to cut interest rates again as post-election uncertainty grows",
      "url": "https://apnews.com/e6b837fd85cff5ad71d4e40939b97237",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5c24f0db3db429c901dd2fab25e70f8/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Carbon pollution from private jets has soared in the past five years, with most of those small planes spewing more heat-trapping carbon dioxide in about two hours of flying than the average person does in about a year, a new study finds.",
      "publishedAt": "2024-11-07T16:07:31Z",
      "title": "Carbon pollution from high flying rich in private jets soars",
      "url": "https://apnews.com/0a2d1d2cd81906381953346bfdb879e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08652d567a214803b8a5a4e82009ef52/2900.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}