{
  "articles": [
    {
      "author": null,
      "description": "TALLINN, Estonia (AP) — Russian aviation agency says mercenary chief Yevgeny Prigozhin was aboard the plane that crashed, leaving no survivors.",
      "publishedAt": "2023-08-23T20:32:06Z",
      "title": "Russian aviation agency says mercenary chief Yevgeny Prigozhin was aboard the plane that crashed, leaving no survivors",
      "url": "https://apnews.com/bc8150f2bbf9fff84e6785dddad579c7",
      "urlToImage": ""
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Mercenary leader Yevgeny Prigozhin, who led a brief armed rebellion against the Russian military earlier this year, was aboard a plane that crashed north of Moscow on Wednesday, killing all 10 people on board, according to Russia’s civil aviation agency.",
      "publishedAt": "2023-08-23T17:20:45Z",
      "title": "Russian agency says mercenary leader Prigozhin was aboard plane that crashed, leaving no survivors",
      "url": "https://apnews.com/a7859e4e57f2efa2547dfbe5bdbaa1b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d80bd403d7a46a7b268efe64edccfc4/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Rudy Giuliani turned himself in at a jail in Atlanta on Wednesday on charges related to efforts to overturn then-President Donald Trump's loss in the 2020 presidential election in Georgia.",
      "publishedAt": "2023-08-23T13:26:37Z",
      "title": "Giuliani turns himself in on Georgia 2020 election charges after bond is set at $150,000",
      "url": "https://apnews.com/203b1e69cbff227a0bf8cc59a6bb645f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a89b0162aa7c4b579ec70f8c644b6e5e/2000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — Donald Trump won't be on the Republican debate stage Wednesday.",
      "publishedAt": "2023-07-30T12:03:16Z",
      "title": "Who's in, who's out, who's boycotting: The 8 candidates expected onstage for the first GOP debate",
      "url": "https://apnews.com/863ffb85147072c4e9cf021e85d4ba1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5432c4dbe1d40e4ba900bad5ea2f303/1920.jpeg"
    },
    {
      "author": "REBECCA BOONE, HEATHER HOLLINGSWORTH, CLAUDIA LAUER and CHRISTOPHER L. KELLER",
      "description": "As flames tore through a West Maui neighborhood, car after car of fleeing residents headed for the only paved road out of town in a desperate race for safety.",
      "publishedAt": "2023-08-23T04:53:19Z",
      "title": "In deadly Maui fires, many had no warning and no way out. Those who dodged a barricade survived",
      "url": "https://apnews.com/c8522222f6de587bd14b2da0020c40e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0925d20d5b049929b9494599a9653bb/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — India became the first country to land a spacecraft near the moon’s south pole on Wednesday — a historic voyage to uncharted territory that scientists believe could hold vital reserves of frozen water, and a technological triumph for the world’s most populous nation.",
      "publishedAt": "2023-08-23T07:23:23Z",
      "title": "India lands a spacecraft near the moon's south pole, a first for the world as it joins elite club",
      "url": "https://apnews.com/b31109bb08197f33b829e7a6e4edfc6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a2290b648354db88685cc27f9ebfcc8/1920.jpeg"
    },
    {
      "author": "JAMES POLLARD",
      "description": "COLUMBIA, S.C. (AP) — South Carolina’s new all-male Supreme Court reversed course on abortion Wednesday, upholding a law banning most such procedures except in the earliest weeks of pregnancy.The continued erosion of legal abortion access across the U.S.",
      "publishedAt": "2023-08-23T14:24:54Z",
      "title": "South Carolina's new all-male highest court reverses course on abortion, upholding strict 6-week ban",
      "url": "https://apnews.com/f4e0d8ef8187fdd1e8db54dd464011b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36c22c0186e84e3fb028c38298177c60/3000.jpeg"
    },
    {
      "author": "MARTÍN ADAMES ALCÁNTARA and DÁNICA COTO",
      "description": "SANTO DOMINGO, Dominican Republic (AP) — Tropical Storm Franklin unleashed heavy floods and landslides in the Dominican Republic on Wednesday after making landfall in the country's southern region, killing at least one person and injuring two others.",
      "publishedAt": "2023-08-23T04:12:21Z",
      "title": "At least 1 dead, 1 missing as Tropical Storm Franklin batters Dominican Republic",
      "url": "https://apnews.com/9172b46177a80fec91340478f235586d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d419634027f4d039000c08de320d5ba/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and SUMMER BALLENTINE",
      "description": "The BTK serial killer has been named the “prime suspect” in at least two unsolved cases, including one in Oklahoma that led authorities to dig this week near his former Kansas property in Park City, authorities announced Wednesday.",
      "publishedAt": "2023-08-23T19:10:18Z",
      "title": "Oklahoma authorities name the BTK killer as the ‘prime suspect’ in at least two unsolved cases",
      "url": "https://apnews.com/161ee1a8d405a0a2d6ae87db85d643af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75e630649c9b48cc8721ad5cbab343e1/2000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korea launched a long-range rocket in a southern direction on Thursday, South Korea's military said, in the North's likely second attempt to put a spy satellite into orbit.",
      "publishedAt": "2023-08-23T19:31:27Z",
      "title": "North Korea conducts rocket launch in likely 2nd attempt to put spy satellite into orbit",
      "url": "https://apnews.com/d9d686ca04466c3069ed2f07b2cd70d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fc2168274c34845bcbd5e2e4147de46/2105.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}