{
  "articles": [
    {
      "author": "ADRIANA MORGA",
      "description": "NEW YORK (AP) — Between finding openings, sending out your resume and interviewing, looking for a job is tough. Now a growing trend of scammers impersonating recruiters is making it even harder.",
      "publishedAt": "2024-10-28T15:00:00Z",
      "title": "How to protect yourself from scammers offering fake jobs",
      "url": "https://apnews.com/d5613d3264485b6f606dababdaf6c45b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9816971b90134f2db1785f8c6938c64f/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, JILL COLVIN and DARLENE SUPERVILLE",
      "description": "CHARLOTTE, N.C. (AP) — Democrat Kamala Harris and Republican Donald Trump zeroed in on the Sun Belt on Saturday as they embarked on one last weekend quest to sway every undecided voter in the battleground states.",
      "publishedAt": "2024-11-02T14:31:19Z",
      "title": "Harris and Trump are zeroing in on Sunbelt states as they embark on a final weekend push for votes",
      "url": "https://apnews.com/437e0faf54c19bee5944650166383bfb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49bc3d01e8694577b0e0c5382786a5fa/1920.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The final doors are being knocked, ads are blaring and candidates are making a last pitch to voters. Even with the high-energy final push, the races for control of Congress are at a stalemate, essentially a toss-up for the House and fight to the finish for the Senate.",
      "publishedAt": "2024-11-02T13:07:26Z",
      "title": "It's a fight to the finish in races that will determine control of Congress",
      "url": "https://apnews.com/219b09af4634e1a47f70082995085203",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77dc8633eee14f7e93999e7901507006/3000.jpeg"
    },
    {
      "author": "LUJAIN JO and BASSEM MROUE",
      "description": "BATROUN, Lebanon (AP) — Israeli naval forces captured a senior Hezbollah operative in north Lebanon, an Israeli military official said Saturday, as the conflict between the Iran-backed group and Israel showed few signs of easing.",
      "publishedAt": "2024-11-02T13:51:00Z",
      "title": "Israeli forces capture senior Hezbollah operative in north Lebanon, Israeli military official says",
      "url": "https://apnews.com/e4c2f600d821e8208069703aa1e8a00a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dde7885412f4ee099bbb045b11b4033/3000.jpeg"
    },
    {
      "author": "ADAM SCHRECK and SAMY MAGDY",
      "description": "JERUSALEM (AP) — An attack on a central Israeli town early Saturday injured 11 people as Iran's supreme leader vowed a punishing response to Israel's attack last week and Israeli airstrikes continued in Gaza and Lebanon.",
      "publishedAt": "2024-11-02T10:55:38Z",
      "title": "Attack on central Israel injures 11 as Iran's leader promises a punishing response",
      "url": "https://apnews.com/f7a3c3f1d6b6ea2c54615a367ffb6ac1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2046a43cfcd24c689ee5c525aa04aa22/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "PAIPORTA, Spain (AP) — The pictures of the smiling toddlers on the wall somehow survived.Most everything else in the daycare — the cradles, the highchairs, the toys — was ruined when a crushing wall of water swept through Paiporta, turning the Valencia municipality of 30,000 into the likely epicenter of Spain's deadliest natural disaster in living memory.",
      "publishedAt": "2024-11-02T10:50:37Z",
      "title": "'It is all in ruins.' The shattered lives of Paiporta at the epicenter of Spain's floods",
      "url": "https://apnews.com/f52e40c9fdf2af44814617948afdb920",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ac00c89b3f249baa1813a2d16c1b068/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump has spent months laying the groundwork to challenge the results of the 2024 election if he loses — just as he did four years ago.",
      "publishedAt": "2024-11-02T04:03:08Z",
      "title": "Trump is using election lies to lay the groundwork for challenging 2024 results if he loses",
      "url": "https://apnews.com/52832138394282b8a3355b45c0b913a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01897aa06cf0434ea695e942cece638b/3000.jpeg"
    },
    {
      "author": "SAFIYAH RIDDLE",
      "description": "MONTGOMERY, Ala. (AP) — The FBI is investigating the death of a Black man in Alabama, who was found hanging in an abandoned house, following a request from a local sheriff amid fears among community members who accuse local law enforcement of longstanding, unchecked misconduct.",
      "publishedAt": "2024-11-02T04:03:57Z",
      "title": "Local sheriff asks FBI to investigate death of Black man found hanging in Alabama",
      "url": "https://apnews.com/2e2222fe1ce9d5e37b67837734fb4339",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e446d733580c481caa03136d3c345b20/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukraine's President Volodymyr Zelenskyy urged its allies to stop “watching” and take steps before North Korean troops deployed in Russia reach the battlefield, and the country's army chief warned that his troops are facing “one of the most powerful offensives” by Moscow since the all-out war started more than two years ago.",
      "publishedAt": "2024-11-02T11:40:44Z",
      "title": "Ukraine's Zelenskyy urges allies to act before North Korean troops reach the front",
      "url": "https://apnews.com/912e5e54ad3170bd77580405c6f97018",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc03e63b9e8942e8a4130ab94aa98da7/3000.jpeg"
    },
    {
      "author": "STEPHEN WADE",
      "description": "Irv Rubenstein holds a doctorate in exercise science and has run a personal fitness training studio for 35 years in Nashville, Tennessee. Obviously, he speaks positively about the benefits of using a personal trainer, and this goes for grizzled-gym goers as well as beginners.",
      "publishedAt": "2024-11-02T13:35:00Z",
      "title": "How to choose the best personal trainer for your fitness goals — and budget",
      "url": "https://apnews.com/c94f4f6625d2d6a5a77537946d1518b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e02494da5ee04e49bea36e5877aed408/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}