{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and KAREEM CHEHAYEB",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli strikes pounded Gaza City overnight into Thursday as ground forces battled Hamas militants in dense urban neighborhoods from which tens of thousands have fled in recent days.",
      "publishedAt": "2023-11-09T09:31:04Z",
      "title": "Israeli strikes pound Gaza City, which tens of thousands have fled in recent days",
      "url": "https://apnews.com/49a2cfaf0c0856f6f6c32151d6b64226",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6845a7d4b164b9b80de981f2ea59fda/1920.jpeg"
    },
    {
      "author": "BILL BARROW and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Nearly half of Democrats disapprove of how President Joe Biden is handling the Israel-Hamas conflict, according to a new poll from The Associated Press-NORC Center for Public Affairs Research — showing a deep divide within his party over the war.",
      "publishedAt": "2023-11-09T05:06:12Z",
      "title": "Nearly half of Democrats disapprove of Biden's response to the Israel-Hamas war, AP-NORC poll shows",
      "url": "https://apnews.com/42b195c5a577a40ff981d26afbff9997",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77098b38576b4a8eba7476a29b00807f/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and STEVE PEOPLES",
      "description": "WASHINGTON (AP) — As they face an increasingly urgent task to emerge as a clear alternative to former President Donald Trump, five Republican presidential candidates gathered Wednesday for the party's latest debate.",
      "publishedAt": "2023-11-09T05:01:45Z",
      "title": "GOP candidates hit Trump and back Israel. Here are highlights from the Republican debate",
      "url": "https://apnews.com/21f8ada0e04f7e1cc003fc00c0b6d1b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb8cb92910614524879d8d0c696d747a/3000.jpeg"
    },
    {
      "author": null,
      "description": "GRAND RAPIDS, Mich. (AP) — A judge in Michigan is expected to hear arguments Thursday on whether Secretary of State Jocelyn Benson has the authority to keep Donald Trump’s name off state ballots for president.",
      "publishedAt": "2023-11-09T05:10:48Z",
      "title": "A judge is set to hear arguments as Michigan activists try to keep Trump off the ballot",
      "url": "https://apnews.com/b8bc335683968025ff25a807b820efd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1fabe58e5b14c0984720033139e7145/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — French President Emmanuel Macron opened a Gaza aid conference on Thursday with an appeal for Israel to protect civilians as it fights Hamas, saying “all lives have equal worth” and that fighting terrorism “can never be carried out without rules.”",
      "publishedAt": "2023-11-09T05:17:32Z",
      "title": "French President Macron opens Gaza aid conference with appeal to Israel to protect civilians",
      "url": "https://apnews.com/ce36fc88cf99e69fc7d80ab421c44682",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d53add4899c442cf88738ba7375dc7dc/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Prime Minister Benjamin Netanyahu didn't elaborate when he said this week that Israel would maintain indefinite “overall security responsibility” in Gaza once it removes Hamas from power in response to a deadly Oct.",
      "publishedAt": "2023-11-08T22:13:30Z",
      "title": "Israel says it will maintain 'overall security responsibility' for Gaza. What might that look like?",
      "url": "https://apnews.com/b86055806b733f41b6d7b4e2f0974985",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a25404da9234532ac326c611a88e34b/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Britain’s interior minister has accused the country’s largest police force of being more lenient toward pro-Palestinian demonstrators than other groups, deepening a political feud sparked by the Israel-Hamas war.",
      "publishedAt": "2023-11-09T10:16:33Z",
      "title": "The UK's interior minister accuses police of favoring pro-Palestinian protesters",
      "url": "https://apnews.com/06b91314bd0555d19c1140cdc7034c23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/569b0dd5fac54d4ea3db81794e37d8fe/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO and ELLIOT SPAGAT",
      "description": "AUSTIN, Texas (AP) — Eight people died Wednesday when the driver of a car suspected of carrying smuggled migrants fled police and smashed into an oncoming vehicle on a South Texas highway.The crash happened around 6:30 a.m.",
      "publishedAt": "2023-11-08T23:13:21Z",
      "title": "8 dead in crash after police chased a suspected human smuggler, Texas officials say",
      "url": "https://apnews.com/2eee4b9725a3de7646c83bbea7da9f8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31abd28bfd5e4f378a18954e6cb2f2fa/2000.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Missed your favorite actors? After nearly four months of striking, they're coming back.Wednesday's deal between striking actors and studios and streaming services won't immediately restore filming to its full swing.",
      "publishedAt": "2023-11-09T08:06:37Z",
      "title": "The Hollywood strikes are over. Here's when you could see your favorite stars and shows return",
      "url": "https://apnews.com/8ddd7026baad90dc9a97be7f21591df9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f95db78ecae46f5a13a573d5e2f6346/1920.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Treasury Secretary Janet Yellen and her Chinese counterpart will meet in San Francisco on Thursday for two days of talks aimed at making progress on a slew of economic issues at a time when competition has markedly intensified between the two countries.",
      "publishedAt": "2023-11-09T05:12:12Z",
      "title": "The US and Chinese finance ministers are opening talks to lay the groundwork for a Biden-Xi meeting",
      "url": "https://apnews.com/04e57bc5256b3e71cb00b2d4ea1ae7d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c22d56f241da479da5685af6f951a4ff/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}