{
  "articles": [
    {
      "author": "WILL WEISSERT and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — At the top of his first speech as her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-12T04:04:41Z",
      "title": "Harris is pushing joy. Trump paints a darker picture. Will mismatched moods matter?",
      "url": "https://apnews.com/ff1818feee5c8661decaa9d48f6927af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f1aeb0a6b4e4ba6afb40da7764733de/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — The great inflation spike of the past three years is nearly spent — and economists credit American consumers for helping slay it.",
      "publishedAt": "2024-08-12T07:00:24Z",
      "title": "Americans' refusal to keep paying higher prices may be dealing a final blow to US inflation spike",
      "url": "https://apnews.com/c69408f05baeffac0023ceb76b747999",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78358c3b1e5947eea0819993bae4c203/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The leaders of France, Germany and Britain in a joint statement have endorsed the latest push by mediators United States, Qatar and Egypt to broker an agreement to end the 10-month Israel-Hamas war.",
      "publishedAt": "2024-08-12T06:24:00Z",
      "title": "Israel-Hamas war latest: Leaders of France, Germany and Britain endorse push for cease-fire in Gaza",
      "url": "https://apnews.com/ea8cb6224cd789e7b19f6130a6201026",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52937ea7862b47d39f6204c886fec4a1/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has repeatedly taunted her opponent's seeming reluctance to debate, telling a series of raucous audiences about Donald Trump's criticisms of her: “As the saying goes, if you’ve got something to say, say it to my face.”",
      "publishedAt": "2024-08-12T04:01:42Z",
      "title": "From Biden to Gabbard, here's what Harris' past debates show before a faceoff with Trump",
      "url": "https://apnews.com/09741696abe9d4217e51d94ac0af553e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6db0d2301a76459c940a7813e7ecf326/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "Donald Trump is returning — at least for one night — to do a live interview Monday on X, the platform from which he was banned for nearly two years following the Jan. 6, 2021, storming of the U.S. Capitol.",
      "publishedAt": "2024-08-12T14:19:34Z",
      "title": "Donald Trump is returning to X for a live interview with the platform's owner, Elon Musk",
      "url": "https://apnews.com/83d6d07fc0ffef4151c96fc56aeec9ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/753f2fede2ff4fa781b89575f58b7544/2205.jpeg"
    },
    {
      "author": "ELENA BECATOROS",
      "description": "ATHENS, Greece (AP) — A major wildfire raged out of control in the northern suburbs of Athens on Monday, triggering evacuations of several areas as swirling winds hampered efforts of hundreds of firefighters and dozens of water-dropping planes.",
      "publishedAt": "2024-08-12T06:58:33Z",
      "title": "Hundreds of firefighters battle a major wildfire raging out of control on fringes of Greek capital",
      "url": "https://apnews.com/4d6a07dc7e0fa61d2e1bb2d6549f8974",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0d716a42fd747ff8c61ddf88fdd7aa2/1920.jpeg"
    },
    {
      "author": "ERIC GAY and JAMIE STENGLE",
      "description": "SUTHERLAND SPRINGS, Texas (AP) — Crews on Monday began to tear down a Texas church where a gunman killed more than two dozen worshippers in 2017, using heavy machinery to raze the small building even after some families sought to preserve the scene of the deadliest church shooting in U.S.",
      "publishedAt": "2024-08-12T16:06:37Z",
      "title": "Crews begin demolishing Texas church where gunman killed more than two dozen in 2017",
      "url": "https://apnews.com/7a18441382c4c29e10b92fedbebf7a6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/715042913424430fbf320bbc52d5e4b6/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — Bleeding and in pain, Kyleigh Thurman didn’t know her doomed pregnancy could kill her.Emergency room doctors at Ascension Seton Williamson in Texas handed her a pamphlet on miscarriage and told her to “let nature take its course\" before discharging her without treatment for her ectopic pregnancy.",
      "publishedAt": "2024-08-12T13:19:25Z",
      "title": "Dozens of pregnant women, some bleeding or in labor, being turned away from ERs despite federal law",
      "url": "https://apnews.com/edd66276d2f6c412c988051b618fb8f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09a23d91a4a8433a9527b2413d34e3e0/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring Kursk region, the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.",
      "publishedAt": "2024-08-12T09:24:25Z",
      "title": "Top Ukrainian commander says his forces now control 1,000 square kilometers of Russia's Kursk region",
      "url": "https://apnews.com/afa42b9613323901bef07800ac2cae9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49d29b18e72848adb4fc8e97e1d62a71/1920.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Georgia is No. 1 in The Associated Press Top 25 preseason college football poll for the second straight year as the superconference era begins with the SEC and Big Ten dominating the top 10 of the rankings.",
      "publishedAt": "2024-08-12T15:57:33Z",
      "title": "Georgia No. 1 in preseason AP Top 25 and Ohio State No. 2 as expanded SEC, Big Ten flex muscles",
      "url": "https://apnews.com/323197827d27ddb07c94dc4bad680bf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c595f4589312430690c2dc130d367902/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}