{
  "articles": [
    {
      "author": "BILL BARROW",
      "description": "WASHINGTON (AP) — A presidential campaign that has careened through a felony trial, an incumbent president being pushed off the ticket and multiple assassination attempts comes down to a final push across a handful of states on the eve of Election Day.",
      "publishedAt": "2024-11-04T05:07:07Z",
      "title": "Harris and Trump will both make a furious last-day push before Election Day",
      "url": "https://apnews.com/0429c35a84739bd90d9e5bb92fe803de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66888d13c0f04ae0856b23caa5ac10b8/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — It's the election that no one could have foreseen. Not so long ago, Donald Trump was marinating in self-pity at Mar-a-Lago after being impeached twice and voted out of the White House.",
      "publishedAt": "2024-11-04T05:09:15Z",
      "title": "A presidential campaign unlike any other ends on Tuesday. Here's how we got here",
      "url": "https://apnews.com/5190456906435fa1ce481e6863ef5d81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f80cac969c2c496cb0bd4128f5f1c64d/3000.jpeg"
    },
    {
      "author": "MATT BROWN and FREIDA FRISARO",
      "description": "MIAMI (AP) — Concerts and carnivals hosted at polling precincts. “Souls to the Polls” mobilizations after Sunday service. And star-studded rallies featuring Hollywood actors, business leaders, musical artists and activists.",
      "publishedAt": "2024-11-04T00:58:47Z",
      "title": "Harris, Obamas and voting rights leaders work to turn out Black voters in run-up to Election Day",
      "url": "https://apnews.com/0f2d15b252fa68557e94d943da1e7624",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/553dd1f4bb394aaabe48d0879ef818db/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and JONATHAN J. COOPER",
      "description": "GASTONIA, N.C. (AP) — Donald Trump says he will be the “protector” of women, whether they like it or not.",
      "publishedAt": "2024-11-03T16:48:26Z",
      "title": "Trump wants to narrow his deficit with women but he's not changing how he talks about them",
      "url": "https://apnews.com/c4ba3f564e981aec7cd12f24d390aced",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fce644f26abb4bb68ec96a5af82cc368/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "WASHINGTON (AP) — Election Day is nearly upon us. In a matter of hours, the final votes in the 2024 presidential election will be cast.In a deeply divided nation, the election is a true toss-up between Democrat Kamala Harris and Republican Donald Trump.",
      "publishedAt": "2024-11-04T05:11:33Z",
      "title": "Here's what to watch as Election Day approaches in the U.S.",
      "url": "https://apnews.com/6dc879eef5e056c2b5dbee86773b09ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8755a030d304969b6562171cbed18e6/3000.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "Quincy Jones, the multi-talented music titan whose vast legacy ranged from producing Michael Jackson's historic \"Thriller\" album to writing prize-winning film and television scores and collaborating with Frank Sinatra, Ray Charles and hundreds of other recording artists, has died at 91.",
      "publishedAt": "2024-11-04T07:47:27Z",
      "title": "Quincy Jones, music titan who worked with everyone from Frank Sinatra to Michael Jackson, dies at 91",
      "url": "https://apnews.com/a9e31c7e39c448d8971519f47a22dd21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56d3e35a258f444fa8549af419916271/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel said Monday it had terminated the agreement facilitating the work of the U.N. agency for Palestinian refugees, the main aid provider in Gaza, in what appeared to be a step to implement legislation passed last month that would sever ties with the agency and prevent it from operating in Israel.",
      "publishedAt": "2024-11-04T07:46:23Z",
      "title": "Middle East latest: Israel ends agreement with UN agency providing aid in Gaza",
      "url": "https://apnews.com/faf4d814fe58b18f1e6176b4f274c3fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2630edea4d043b48c6216f85d1e48ab/3000.jpeg"
    },
    {
      "author": "BISWAJEET BANERJEE",
      "description": "LUCKNOW, India (AP) — A poorly maintained and overcrowded bus veered off the road and plunged into a deep gorge in northern India on Monday, killing at least 36 people and injuring several others, officials said.",
      "publishedAt": "2024-11-04T05:56:47Z",
      "title": "At least 36 dead after overcrowded and dilapidated bus skids into a deep gorge in northern India",
      "url": "https://apnews.com/94ce6d90557fc78bb59f002d37b87b7a",
      "urlToImage": ""
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Germany’s top diplomat arrived Monday in the Ukrainian capital Kyiv on an unannounced visit, in what appeared to be a show of European support for Ukraine on the eve of a U.S. presidential election that could bring far-reaching changes in Washington’s policy toward Russia’s all-out invasion of its neighbor.",
      "publishedAt": "2024-11-04T09:32:28Z",
      "title": "Germany's top diplomat in Kyiv as Ukraine girds for impact of US election on the war",
      "url": "https://apnews.com/ebccb34322560ea412f9115d0d14938f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5acda609210d4ea194f6bcafb78e91ad/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Unionized factory workers at Boeing are voting Monday whether to accept a contract offer or to continue their strike, which has lasted more than seven weeks and shut down production of most Boeing passenger planes.",
      "publishedAt": "2024-11-04T05:01:32Z",
      "title": "Boeing machinists are holding a contract vote that could end their 7-week strike",
      "url": "https://apnews.com/614c4d5afd97d1f50ab9cfe1f4f94255",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99121482b2294f209f1e798f8249533a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}