{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel said Tuesday that its troops had entered Gaza’s second-largest city as intensified bombardment sent streams of ambulances and cars racing to hospitals with wounded and dead Palestinians, including children, in a bloody new phase of the war.",
      "publishedAt": "2023-12-05T07:53:17Z",
      "title": "Israel moves into Gaza's second-largest city and intensifies strikes in bloody new phase of the war",
      "url": "https://apnews.com/8f171da297b565e28156b88d1fc250b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61184714085445a288f0b9aeeedf11c7/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "JERUSALEM (AP) — A man hiding in a pit during the Oct. 7 Hamas assault on an outdoor music festival in Israel said he heard someone nearby screaming she was being raped. Elsewhere in the area, a combat paramedic saw the body of a young woman with her legs open, her pants pulled down, and what looked like semen on her lower back.",
      "publishedAt": "2023-12-05T23:59:01Z",
      "title": "'Widespread' sexual and gender-based crimes committed during Hamas attack, Israeli officials say",
      "url": "https://apnews.com/bb06b950bb6794affb8d468cd283bc51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dc7f5577c8d422399a279f417200772/3000.jpeg"
    },
    {
      "author": "LORI HINNANT and SAM McNEIL",
      "description": "NIR OZ, Israel (AP) — The engineer and his family cowered in the safe room, dark except for a red remote-control light because they feared the gunmen outside the door would notice anything brighter.",
      "publishedAt": "2023-12-05T05:20:55Z",
      "title": "'We are officially hostages.' How the Israeli kibbutz of Nir Oz embodied Hamas hostage strategy",
      "url": "https://apnews.com/0c14750240138853a70e38b0c09ef157",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfac1841f142408e9512b5a2bc83c638/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The Senate in a single stroke Tuesday approved about 425 military promotions after Sen. Tommy Tuberville of Alabama ended a monthslong blockade of nominations over his opposition to a Pentagon abortion policy.",
      "publishedAt": "2023-12-05T18:36:08Z",
      "title": "Senate approves hundreds of military promotions after Republican senator ends blockade of nominees",
      "url": "https://apnews.com/b4d4fe19bada70a085208c9d82c35cb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/562771e2673d424c81a844d038ca93e5/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — A Donald Trump ally who worked in his Justice Department said Tuesday that if the former president is elected again, his administration will retaliate against people in the media “criminally or civilly.”",
      "publishedAt": "2023-12-05T23:59:35Z",
      "title": "A second Trump administration will 'come after' people in the media in the courts, an ally says",
      "url": "https://apnews.com/b892fd6f3ce721016eb1176e82aa51c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c0fb0e59f954881b071c2bf24c70222/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "BOSTON (AP) — President Joe Biden told campaign donors Tuesday that he wasn’t sure he’d be running for reelection if Donald Trump wasn’t also in the race, warning that democracy is “more at risk in 2024” and that the former president and his allies are out to “destroy” democratic institutions.",
      "publishedAt": "2023-12-05T05:05:13Z",
      "title": "Biden tells donors: 'If Trump wasn’t running I’m not sure I’d be running. We cannot let him win'",
      "url": "https://apnews.com/82caceab4df5ba3ee3112a8991a24fea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8419ed18cb9648cc86047274b7f28265/3000.jpeg"
    },
    {
      "author": null,
      "description": "LIMA, Peru (AP) — Peru’s constitutional court ordered an immediate humanitarian release Tuesday for imprisoned former President Alberto Fujimori, 85, who was serving a 25-year sentence in connection with the death squad slayings of 25 Peruvians in the 1990s.",
      "publishedAt": "2023-12-05T21:43:06Z",
      "title": "Peruvian constitutional court orders release of former President Alberto Fujimori",
      "url": "https://apnews.com/4a9c8a0159ac9bf170a15338fa860937",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4929351bd8544a719b4a1d90cc8c294f/3000.jpeg"
    },
    {
      "author": "MATTHEW BARAKAT and BEN FINLEY",
      "description": "ARLINGTON, Va. (AP) — The owner of a Virginia house that exploded as police tried to execute a search warrant is believed to have died in the blast, officials said Tuesday, as details emerged about numerous grievances he expressed against neighbors and others on social media and in lawsuits.",
      "publishedAt": "2023-12-05T12:52:36Z",
      "title": "Man believed to have fired shots before a Virginia house exploded died in the blast, police say",
      "url": "https://apnews.com/b73119f6aa7a54d3bae81f868e9d78c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96150bed16e94d33923e16ab16e1103b/1920.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "A Texas high school sent a Black student back to in-school suspension Tuesday for refusing to change his hairstyle, renewing a monthslong standoff over a dress code policy the teen's family calls discriminatory.",
      "publishedAt": "2023-12-05T19:24:23Z",
      "title": "Texas high school sends Black student back to in-school suspension over his locs hairstyle",
      "url": "https://apnews.com/929f38ec279b672efd78ba61422f4ca8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/836c7948c3034806898e2a10223d9ca7/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "LAS VEGAS (AP) — NCAA President Charlie Baker is asking members to make one of the most dramatic shifts in the history of college sports by allowing highly resourced schools to pay some of their athletes.",
      "publishedAt": "2023-12-05T15:36:38Z",
      "title": "NCAA President Charlie Baker calls for new tier of Division I where schools can pay athletes",
      "url": "https://apnews.com/c26542c528df277385fea7167026dbe6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be55da34c52348cab585417b986a8375/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}