{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel's government faced calls for a cease-fire from some of its closest European allies on Sunday after a series of shootings, including the mistaken killing of three Israeli hostages, fueled global concerns about the conduct of the 10-week-old war in Gaza.",
      "publishedAt": "2023-12-17T07:44:45Z",
      "title": "Israel faces new calls for truce after killing of hostages raises alarm about its conduct in Gaza",
      "url": "https://apnews.com/22e6e6ac2098dbf29c89c1a49980907b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ca2348661144405bce8421c095e8f2e/1920.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — Some of Israel’s closest European allies pressed for a cease-fire in the war with Hamas on Sunday, underscoring growing international unease with the devastating impact of the conflict on Gaza’s civilian population.",
      "publishedAt": "2023-12-17T12:00:34Z",
      "title": "European diplomacy steps up calls for Gaza cease-fire",
      "url": "https://apnews.com/d7020465c33872363795c1bcbee86077",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd66b1467e4e47a4b3996dc7a854b9cf/3000.jpeg"
    },
    {
      "author": "NOREEN NASIR and AARON MORRISON",
      "description": "Cydney Wallace, a Black Jewish community activist, never felt compelled to travel to Israel, though “Next year in Jerusalem” was a constant refrain at her Chicago synagogue.The 39-year-old said she had plenty to focus on at home, where she frequently gives talks on addressing anti-Black sentiment in the American Jewish community and dismantling white supremacy in the U.S.",
      "publishedAt": "2023-12-17T05:02:29Z",
      "title": "Black American solidarity with Palestinians is rising and testing longstanding ties to Jewish allies",
      "url": "https://apnews.com/966a5eb8f0fb5b34beced29c4dda7331",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d09d1ca576849aeb3a571a638c60632/3000.jpeg"
    },
    {
      "author": "KARL RITTER",
      "description": "KYIV, Ukraine (AP) — Russia and Ukraine reportedly launched mass drone attacks at each other’s territories for a second straight day Sunday, one of which apparently targeted a Russian military airport.",
      "publishedAt": "2023-12-17T11:32:10Z",
      "title": "Russia and Ukraine launch numerous drone attacks targeting a Russian air base and Black Sea coast",
      "url": "https://apnews.com/2e64d1970d7318256f98e3e7880d2832",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c3b3837b2944793bcacabffbb34e101/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER SHERMAN",
      "description": "MEXICO CITY (AP) — Once nearly impenetrable for migrants heading north from Latin America, the jungle between Colombia and Panama this year became a speedy but still treacherous highway for hundreds of thousands of people from around the world.",
      "publishedAt": "2023-12-17T05:09:40Z",
      "title": "The jungle between Colombia and Panama becomes a highway for migrants from around the world",
      "url": "https://apnews.com/712d00c90114568fe8a1b5c9e26fdadd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4294f14f09a24ca0beeba0b14dc0120f/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — A boat carrying dozens of migrants trying to reach Europe capsized off the coast of Libya, leaving more than 60 people dead, including women and children, the U.N. migration agency said.",
      "publishedAt": "2023-12-17T05:39:05Z",
      "title": "Over 60 people have drowned in the capsizing of a migrant vessel off Libya, the UN says",
      "url": "https://apnews.com/8c2f45c6a54e09fe4f234f9f60398b4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7739307da4ed460cb01f56b2ea9c2292/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — Ohio was in the throes of a bitter debate over abortion rights this fall when Brittany Watts, 21 weeks and 5 days pregnant, began passing thick blood clots.",
      "publishedAt": "2023-12-16T13:05:43Z",
      "title": "A Black woman was criminally charged after a miscarriage. It shows the perils of pregnancy post-Roe",
      "url": "https://apnews.com/b8090abfb5994b8a23457b80cf3f27ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db051f5015a34a778b33012988b84790/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — The scene: A crowded shopping center in the weeks before Christmas. Or a warehouse store. Or maybe a packed airport terminal or a commuter train station or another place where large groups gather.",
      "publishedAt": "2023-12-17T05:05:58Z",
      "title": "As 2023 holidays dawn, face masks have settled in as an occasional feature of the American landscape",
      "url": "https://apnews.com/8337bc3f9c5d99192d7bf58a7c2e7cf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a144e3937ef34ebea990ff5653bc5141/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "ALBANY, N.Y. (AP) — New York's highest court last week gave Democrats a chance to redraw the state's congressional districts, a major victory as the party tries to win control of the U.S.",
      "publishedAt": "2023-12-17T15:37:30Z",
      "title": "How much gerrymandering is too much? In New York, the answer could make or break Dems' House hopes",
      "url": "https://apnews.com/2fc19d72480d49ed28ca81432d2f586c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2269f008f3f24832b03b29fbe5319694/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — “Wonka” debuted with $39 million in box office sales in U.S. and Canadian theaters over the weekend, according to studio estimates Sunday.",
      "publishedAt": "2023-12-17T18:19:27Z",
      "title": "'Wonka' waltzes to $39 million opening, propelled by Chalamet's starring role",
      "url": "https://apnews.com/28aa01dfdd429efab49b32a1ab87cb40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/223a961e79e24fc89df51b1babf53b80/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}