{
  "articles": [
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The Israeli military said Friday that it dismissed two officers and reprimanded three others for their roles in drone strikes in Gaza that killed seven aid workers on a food-delivery mission, saying they had mishandled critical information and violated the army’s rules of engagement.",
      "publishedAt": "2024-04-05T10:32:35Z",
      "title": "Israel dismisses 2 officers over deadly drone strikes on aid workers in Gaza",
      "url": "https://apnews.com/69b6176362dafc8e4e2754b2342faa1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f8eb41d7be64f16b80ef066bc65b564/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — When Israel declared war against Hamas last October, it stood unified at home and enjoyed broad backing from around the world following an unprecedented attack by the Islamic militant group.",
      "publishedAt": "2024-04-05T04:20:58Z",
      "title": "After six months of war, Israel's isolation grows with no end in sight",
      "url": "https://apnews.com/327bfeb7bfce5cb0de1568bf41a0ff06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3f898af56d543e487eb3786aeac5423/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MIKE CATALINI",
      "description": "NEW YORK (AP) — An earthquake centered between New York and Philadelphia shook skyscrapers and suburbs across the northeastern U.S. for several seconds Friday morning, causing no major damage but startling millions of people in an area unaccustomed to such tremors.",
      "publishedAt": "2024-04-05T14:34:33Z",
      "title": "An earthquake centered between NYC and Philadelphia rattles much of the Northeast",
      "url": "https://apnews.com/7d03f7a44a6c1a1ea877820515808bee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/914e91679d7e4644b4f0b66cd9bda6ea/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "BALTIMORE (AP) — President Joe Bide got a firsthand look Friday at efforts to clear away the hulking remains of the collapsed Francis Scott Key Bridge in Baltimore, as cranes, ships and diving crews work to reopen one of the nation's main shipping lanes.",
      "publishedAt": "2024-04-05T09:07:46Z",
      "title": "Biden tours collapsed Baltimore bridge where recovery effort has political overtones",
      "url": "https://apnews.com/b4388845fc912f0a0b491d05b5ac5cf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a65c220c32ad484b9ba2a099258ca527/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Former Defense Secretary Mark Esper has called him a “threat to democracy.” Former national security adviser John Bolton has declared him “unfit to be president.” And former Vice President Mike Pence has declined to endorse him, citing “profound differences.”",
      "publishedAt": "2024-04-05T04:06:24Z",
      "title": "Former Trump officials are among the most vocal opponents of returning him to the White House",
      "url": "https://apnews.com/e202861911ab37cadfcf058b5b163fb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8710f238cd5b49a4bf6d305cd7d4f4b6/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — America’s employers delivered another outpouring of jobs in March, adding a sizzling 303,000 workers to their payrolls and bolstering hopes that the economy can vanquish inflation without succumbing to a recession in the face of high interest rates.",
      "publishedAt": "2024-04-05T04:01:28Z",
      "title": "Another month of robust US job growth points to continued economic strength",
      "url": "https://apnews.com/1e456b8df0e11b218ed50f1ead6f6797",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f6a8845185046d99a39a3e3bd914c4f/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — An international campaign to ban surrogacy received a strong endorsement Friday from the Vatican, with a top official calling for a broad-based alliance to stop the “commercialization of life.”",
      "publishedAt": "2024-04-05T13:35:42Z",
      "title": "Right to children or children’s rights? Surrogacy debate comes to a head in Rome",
      "url": "https://apnews.com/a9229ef32f3c5b4f3b0bb7bd0e08f503",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbc64c89ca1e42f7b588465b5e4a3814/3000.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "ST. LOUIS (AP) — Missouri's execution protocol allows for “surgery without anesthesia” if the typical process of finding a suitable vein to inject the lethal drug doesn't work, lawyers for a death row inmate say in an appeal aimed at sparing his life.",
      "publishedAt": "2024-04-05T15:29:16Z",
      "title": "Condemned inmate could face 'surgery without anesthesia' if good vein is elusive, lawyers say",
      "url": "https://apnews.com/aaffa63d0e64c2c87f1d99fbe01cfc0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb5c40840ccb45ca8f4a44121777f377/3000.jpeg"
    },
    {
      "author": "NICK PERRY and LISA RATHKE",
      "description": "GILFORD, N.H. (AP) — Snow showers lingered Friday as the cleanup began following a major spring storm that brought heavy snow, rain and high winds to the Northeast, left hundreds of thousands of homes and businesses without power, and contributed to at least two deaths.",
      "publishedAt": "2024-04-05T11:51:26Z",
      "title": "Cleanup begins as spring nor'easter moves on. But hundreds of thousands still lack power",
      "url": "https://apnews.com/c7de82552c5f131eb315be704013b87d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/805549531e90445a801ac272c6fcf112/1920.jpeg"
    },
    {
      "author": "MICHAEL MAROT",
      "description": "WEST LAFAYETTE, Ind. (AP) — The child who wanted Zach Edey's autograph during his Purdue recruiting trip apparently saw something others missed.Big Maple was destined to be a basketball star.",
      "publishedAt": "2024-04-05T16:01:11Z",
      "title": "Purdue's Zach Edey is the overwhelming choice for 2nd straight AP Player of the Year award",
      "url": "https://apnews.com/9e624d65df4b952a8b1a2ae1b5c1cac3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab098382692b47bbb2a558fa00da052d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}