{
  "articles": [
    {
      "author": "ADAM SCHRECK and SAMY MAGDY",
      "description": "JERUSALEM (AP) — The Israeli government said a drone was launched toward the prime minister’s house Saturday, with no casualties, as Iran’s supreme leader vowed that Hamas would continue its fight against Israel following the killing of the mastermind of last year’s deadly Oct.",
      "publishedAt": "2024-10-19T07:40:37Z",
      "title": "Drone targets Israeli prime minister's house as strikes in Gaza kill 50",
      "url": "https://apnews.com/c49911f11a40b7d81b21bc8568ecfe11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6c2aba726af4628ac8adf784bb4fea3/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — The killing of Hamas leader Yahya Sinwar by Israeli forces in Gaza this week leaves the Palestinian militant group considering new leadership for the second time in less than three months.",
      "publishedAt": "2024-10-18T19:30:26Z",
      "title": "What's next for Hamas after its leader Yahya Sinwar's death?",
      "url": "https://apnews.com/a1c44df5cdabf0cf6459db9ea6eaa9b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96110c48c640495a861a779ebc2e7c20/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and BASSEM MROUE",
      "description": "TEL AVIV, Israel (AP) — Israeli forces have spent much of the past year destroying Hamas’ vast underground network in Gaza.",
      "publishedAt": "2024-10-19T04:01:56Z",
      "title": "Israel unearths Hezbollah's web of tunnels in southern Lebanon",
      "url": "https://apnews.com/2f22d95269bdf3b5fa1304816f2fee81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79df770c823949a9ba702c55d92ef891/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, JOEY CAPPELLETTI and MICHELLE L. PRICE",
      "description": "GRAND RAPIDS, Mich. (AP) — Kamala Harris insisted it was time to “end the suffering” in the Middle East while Donald Trump visited one of the nation's only Muslim-majority cities on Friday as the dueling presidential contenders fought for a small but pivotal bloc of Arab American voters in swing-state Michigan.",
      "publishedAt": "2024-10-18T04:16:06Z",
      "title": "Harris and Trump seek Arab American votes in Michigan in effort to shore up battleground states",
      "url": "https://apnews.com/6b034753290276bfa96d7caf8f7639bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a154125751304c38a12f3559b0d9eafe/1920.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — Over the past four years, judges at Washington’s federal courthouse have punished hundreds of rioters who stormed the U.S. Capitol in an unprecedented assault on the nation's democracy.",
      "publishedAt": "2024-10-19T04:05:36Z",
      "title": "Judges punishing Jan. 6 rioters say they fear more political violence as Election Day nears",
      "url": "https://apnews.com/ebb54ab9badccfcb2b1bc2fa0de5bf21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa5f09b51fb24ed8a0e8f109aeed557d/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — A man threw several firebombs into the headquarters of Japan’s ruling party in Tokyo Saturday, then crashed his car into the fencing of the prime minister's residence, Tokyo police said.",
      "publishedAt": "2024-10-18T23:41:25Z",
      "title": "Japan's ruling party headquarters is attacked with firebombs and suspect is arrested",
      "url": "https://apnews.com/491eb0635a348793e679212d2dbb40cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4585ac713bc24c4f8db3667a38368578/3000.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ and STEFANIE DAZIO",
      "description": "SAN FRANCISCO (AP) — A fast-moving fire fed by strong winds burned two homes Friday and damaged several others in a hillside neighborhood in the city of Oakland, where hundreds of people were ordered to evacuate before more than 100 firefighters stopped the progress of the flames, authorities said.",
      "publishedAt": "2024-10-18T15:16:31Z",
      "title": "Crews halt fast-moving brush fire that burned 2 Oakland homes, forced 500 evacuations",
      "url": "https://apnews.com/0bb99ee4a062730bdbf9d50170a30053",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62aed6ce963647edb3451c1548f5a625/1920.jpeg"
    },
    {
      "author": "ANDREA RODRÍGUEZ",
      "description": "HAVANA (AP) — Cuba’s electrical grid went down Friday after one of the island’s major power plants failed, a day after a massive blackout swept across the Caribbean island and with no official estimate for when service will be restored.",
      "publishedAt": "2024-10-18T18:52:25Z",
      "title": "Cuba’s grid goes offline with massive blackout after a major power plant fails",
      "url": "https://apnews.com/4ae305120a99fec17c79e7621e8dac4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64e4ed7887ed47bab421c9dbf87bcd05/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "ANCHORAGE, Alaska (AP) — On a desolate slab of island tundra in western Alaska, a resident of Adak will again become the last American to cast an in-person ballot for president, continuing a 12-year tradition for the nation’s westernmost community.",
      "publishedAt": "2024-10-19T04:04:06Z",
      "title": "The last in-person vote in the US will be cast on the desolate tundra of Alaska's Aleutian Islands",
      "url": "https://apnews.com/1460b6fba46e90f0bafbbda5f7611dfa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a0c7289ac3e4db6bc1591bb2b88ed12/3000.jpeg"
    },
    {
      "author": "ISABELLA VOLMERT and MICHELLE R. SMITH",
      "description": "Christian nationalist leaders are telling followers that Vice President Kamala Harris is under the influence of a “Jezebel spirit,” using a term with deeply racist and misogynistic roots that is setting off alarm bells for religious and political scholars.",
      "publishedAt": "2024-10-18T12:04:57Z",
      "title": "What's a 'Jezebel spirit'? Some Christians use the term to paint Kamala Harris with a demonic brush",
      "url": "https://apnews.com/0a513c9e549a57a33f864341556d1b7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0a10fefa6b04a58a22f4b4028644070/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}