{
  "articles": [
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — The Israeli military said it struck Hezbollah’s headquarters in Beirut on Friday in a series of massive explosions that targeted the leader of the militant group and leveled multiple high-rise apartment buildings.",
      "publishedAt": "2024-09-27T15:34:31Z",
      "title": "Israel strikes Hezbollah in a huge blast targeting the militant group's leader",
      "url": "https://apnews.com/617575d9c5d7c711bc02e7b81d2ba4ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c476003df9c4624bbb1e35ff78bcd0b/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "UNITED NATIONS (AP) — Israeli leader Benjamin Netanyahu signaled to the world from the United Nations on Friday that the multiple conflicts in the Middle East were far from resolved, and he vowed to continue battling the Lebanese Hezbollah and defeat Hamas in the Gaza Strip until “total victory.\"",
      "publishedAt": "2024-09-27T13:58:12Z",
      "title": "Netanyahu, at UN, vows that Israel will keep 'degrading Hezbollah' until its objectives are met",
      "url": "https://apnews.com/12e02fd82f35a8438aa907ca6762bac0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/041a7b72214e4fedbd1a6b3345bc7151/1920.jpeg"
    },
    {
      "author": "STEPHEN SMITH, KATE PAYNE and HEATHER HOLLINGSWORTH",
      "description": "PERRY, Fla. (AP) — Hurricane Helene left an enormous path of destruction across Florida and the southeastern U.S.",
      "publishedAt": "2024-09-27T05:27:23Z",
      "title": "Hurricane Helene kills at least 44 and cuts a swath of destruction across the Southeast",
      "url": "https://apnews.com/e5769b56dea81e40fae2161ad1b4e75d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f65a1906356141f08f7256124a8b5dfd/1158.jpeg"
    },
    {
      "author": "TODD RICHMOND",
      "description": "MADISON, Wis. (AP) — A day after Vice President Kamala Harris discussed immigration at the U.S.-Mexico border, former President Donald Trump is expected to respond by again linking her to illegal border crossings at an event in a western Wisconsin river town.",
      "publishedAt": "2024-09-28T04:12:51Z",
      "title": "Trump is set to respond to Harris on immigration during his visit to a small Wisconsin town",
      "url": "https://apnews.com/0810efccefc8b094756d0c46f927b7dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/119aeeeeda1f44dc9fff635e0a4a1dce/3000.jpeg"
    },
    {
      "author": "DIDI TANG and DAVID KLEPPER",
      "description": "WASHINGTON (AP) — When veteran U.S. diplomat Kurt Campbell traveled to the Solomon Islands to counter Beijing's influence in the South Pacific country, he quickly saw just how far China would go to spread its message.",
      "publishedAt": "2024-09-28T04:13:24Z",
      "title": "In global game of influence, China turns to a cheap and effective tool: fake news",
      "url": "https://apnews.com/3085f10d6edca36f6415d6410e5ef874",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73e49c992dc14ebcaf8ea426e7b0ae97/3000.jpeg"
    },
    {
      "author": "BY QASSIM ABDUL-ZAHRA and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. announced an agreement with the Iraqi government Friday to wrap up the military mission in Iraq of an American-led coalition fighting the Islamic State group by next year, with U.S.",
      "publishedAt": "2024-09-27T19:16:34Z",
      "title": "Wrapping up mission, US troops will leave some longstanding bases in Iraq under new deal",
      "url": "https://apnews.com/a79aa83dca8f776f87a138bfe5697fa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b66ef9299e1949e28de2c7f4718b5861/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "For months, New York City Mayor Eric Adams — a former cop — refused to criticize the federal authorities investigating his administration. Not anymore.The day news of his indictment on corruption charges broke, Adams defiantly suggested, without providing evidence, that U.S.",
      "publishedAt": "2024-09-28T04:08:25Z",
      "title": "Indicted New York City mayor adopts familiar defense: He was targeted for his politics",
      "url": "https://apnews.com/8a99f5b8e42626eed1f1818fbd9f63ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8a20604f9464b7d8f4f892e007882a6/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "Already the longest-lived of the 45 men to serve as U.S. president, Jimmy Carter is about to reach the century mark. The 39th president, who remains under home hospice care, will turn 100 on Tuesday, Oct.",
      "publishedAt": "2024-09-28T04:13:25Z",
      "title": "Jimmy Carter at 100: A century of changes for a president, the US and the world since 1924",
      "url": "https://apnews.com/34ceff0c3bb527863dae1c6788095c81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7eb561f9c304408bc6db681fd30319a/2998.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — “Saturday Night Live” is set to set off its 50th season with host Jean Smart and musical guest Jelly Roll.",
      "publishedAt": "2024-09-28T04:00:32Z",
      "title": "'Saturday Night Live' launches 50th season with Jean Smart, Jelly Roll and maybe Maya as Kamala",
      "url": "https://apnews.com/9205f31f0eab80700604f39581b84cf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e88446413984ff5a5bf7d78775fa9d5/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, ADRIANA GOMEZ LICON and LISA MASCARO",
      "description": "NEW YORK (AP) — Ukrainian President Volodymyr Zelenskyy met face-to-face with Donald Trump on Friday with public tensions rising between the two over Ukraine's defense against Russia's invasion and in the midst of the U.S.",
      "publishedAt": "2024-09-27T04:05:15Z",
      "title": "Trump and Zelenskyy meet in New York as election holds high stakes for US support for Ukraine",
      "url": "https://apnews.com/7c163eb5068c5003b219b6d524436517",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23214c89981d4677a583c1288ed30a39/2989.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}