{
  "articles": [
    {
      "author": "JOSEPH KRAUSS",
      "description": "U.S. and Arab mediators say they are closing in on a deal to halt the war in Gaza and free hostages captured by Hamas in its Oct. 7 attack, but the talks have dragged on for months, with several moments of false hope.",
      "publishedAt": "2024-08-19T04:23:46Z",
      "title": "What is the latest on the high-stakes negotiations over a cease-fire in Gaza?",
      "url": "https://apnews.com/acc945acb9160c63a8d957e1addc16e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/500756ed033e472085aa7f37ce1f2a58/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across Gaza killed 29 people including young quintuplets overnight and into Sunday, health officials said, as U.S. Secretary of State Antony Blinken arrived in Israel to try to seal a cease-fire deal that could help ease soaring regional tensions.",
      "publishedAt": "2024-08-18T06:33:39Z",
      "title": "Quintuplets among Gaza's dead as Blinken visits the region to seek a cease-fire deal",
      "url": "https://apnews.com/4059985bff76d459360f17e8319633c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9dfcaae30471431d9c5ee5ff0953977c/1920.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said Sunday the daring military incursion into Russia’s Kursk region aims to create a buffer zone to prevent further attacks by Moscow across the border.",
      "publishedAt": "2024-08-18T11:12:29Z",
      "title": "Ukrainian president says push into Russia's Kursk region is to create a buffer zone there",
      "url": "https://apnews.com/43d6579c82c24ffc5cfabd99d07c66db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4d13c2989e94edaa43256e2e53ee78f/2000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, ZEKE MILLER and BILL BARROW",
      "description": "CHICAGO (AP) — A refreshed Democratic Party reintroduces itself to a divided nation this week, having been transformed by the money, momentum, relief and even joy that followed Vice President Kamala Harris ' rise to the top of its ticket.",
      "publishedAt": "2024-08-19T04:06:05Z",
      "title": "Democrats open their convention transformed by Harris' ascendance but facing lingering questions",
      "url": "https://apnews.com/0a0e65ab69a1e338d9c1f3f137a45e82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7d9d896057944c0be4b832bfdc07e21/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "CHICAGO (AP) — In 1948, the Republican and Democratic parties did something unthinkable in today’s climate of ferocious political animosity: They not only held their national conventions in the same city but also shared some of the props.",
      "publishedAt": "2024-08-19T04:07:31Z",
      "title": "Floor fights, boos and a too-long kiss. How the dramatic and the bizarre define convention history",
      "url": "https://apnews.com/2f8c85a343192cf0b75f68b3ea7b5a8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/743c356916f5478386507c29aa41754a/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is entering the Democratic National Convention with increased excitement from Democrats and a steady rise in her favorability ratings among Americans as a whole.",
      "publishedAt": "2024-08-19T04:03:04Z",
      "title": "Favorable views of Kamala Harris have risen this summer heading into the DNC, AP-NORC poll shows",
      "url": "https://apnews.com/b2a725729afe91851d89644fd97eb6e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/496c427e161440d8bb3d7a1ff9f94a8a/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "BEDMINSTER, N.J. (AP) — As Democrats kick off their convention in Chicago, Donald Trump 's campaign is trying to regain its footing after weeks of struggling to adjust to Vice President Kamala Harris at the top of the opposing ticket.",
      "publishedAt": "2024-08-19T04:08:53Z",
      "title": "Trump will campaign across the country this week as he struggles to adjust to Harris",
      "url": "https://apnews.com/48f5d991866e33af23e4494467240592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58f5b6f46aa147c4a9922d345f471309/3000.jpeg"
    },
    {
      "author": "SIMINA MISTREANU and JIM GOMEZ",
      "description": "TAIPEI, Taiwan (AP) — Chinese and Philippine coast guard ships collided at sea, damaging at least two boats, in an encounter early Monday near a new flashpoint in their increasingly alarming confrontations in the disputed South China Sea.",
      "publishedAt": "2024-08-19T02:24:58Z",
      "title": "Chinese and Philippine ships collide again in disputed waters, and the countries are trading blame",
      "url": "https://apnews.com/fd76fcfcbcfcfdce5eb81c9422e8216c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f0bc73153b847b28836b7ccd329cf3e/3000.jpeg"
    },
    {
      "author": "RON TODT",
      "description": "Tropical Storm Ernesto became a hurricane again Sunday as it churned away from Bermuda and headed further out in the northeastern Atlantic, sending powerful swells toward the U.S.",
      "publishedAt": "2024-08-18T15:52:14Z",
      "title": "Ernesto regains hurricane strength, sends powerful swells, dangerous rip currents to US East Coast",
      "url": "https://apnews.com/a9260c6c35d380854c22635ac12ec8bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0422e159f6a84ad3a20c97030b8460b8/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "SINTRA, Portugal (AP) — The doorbell to Martinho de Almada Pimentel’s house is hard to find, and he likes it that way. It’s a long rope that, when pulled, rings a literal bell on the roof that lets him know someone is outside the mountainside mansion that his great-grandfather built in 1914 as a monument to privacy.",
      "publishedAt": "2024-08-19T04:21:10Z",
      "title": "Too many people, not enough management: A look at the chaos of 'overtourism' in the summer of 2024",
      "url": "https://apnews.com/df764ed1c7009fdbbf5a32eaedc6ffd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14190d8aa1ee43fb81e546ed53588f3f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}