{
  "articles": [
    {
      "author": "DREW CALLISTER",
      "description": "NEW YORK (AP) — Omar Abu Kuwaik is far from his home in Gaza. The 4-year-old's parents and sister were killed by an Israeli airstrike, when he lost part of his arm. He’s one of the lucky ones.",
      "publishedAt": "2024-03-04T05:15:51Z",
      "title": "A 4-year-old Gaza boy lost his arm – and his family. Half a world away, he’s getting a second chance",
      "url": "https://apnews.com/65b993f4b77b6d474c52062f6ca0fb10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/029d75945a4a4b428f5f9d8417494acb/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris on Monday is hosting a member of Israel’s wartime Cabinet who is visiting Washington in defiance of Israeli Prime Minister Benjamin Netanyahu.",
      "publishedAt": "2024-03-04T05:13:12Z",
      "title": "Harris is to meet with Israeli Cabinet official who is in Washington despite Netanyahu's rebuke",
      "url": "https://apnews.com/e86e6f95a0707e290384fcc86367e4fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffc9e5a2c85c4de5a486a61966683d11/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — A poll finds that a growing share of U.S. adults doubt that 81-year-old President Joe Biden has the memory and acuity for the job, turning his coming State of the Union address into something of a real-time audition for a second term.",
      "publishedAt": "2024-03-04T05:02:29Z",
      "title": "As Biden prepares to address the nation, more than 6 in 10 US adults doubt his mental capability",
      "url": "https://apnews.com/66d8784586d21f30885d8153f949510c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2389ad1d0abf418390cd8ee195b653ce/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Former President Donald Trump could learn Monday whether the Supreme Court will let him appear on this year’s ballot as the leading Republican presidential candidate tries to close in on his party’s nomination.",
      "publishedAt": "2024-03-04T05:04:32Z",
      "title": "The Supreme Court could decide Monday whether Trump can be barred from the 2024 ballot",
      "url": "https://apnews.com/51e79c0f03013034c8a042cb278b6446",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4913e5ff250b4ade971c32f599ef785a/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Nikki Haley has won the Republican primary in the District of Columbia, notching her first victory of the 2024 campaign.Her victory Sunday at least temporarily halts Donald Trump’s sweep of the GOP voting contests, although the former president is likely to pick up several hundred more delegates in this week’s Super Tuesday races.",
      "publishedAt": "2024-03-04T01:46:09Z",
      "title": "Nikki Haley wins the District of Columbia’s Republican primary and gets her first 2024 victory",
      "url": "https://apnews.com/7b5eec7a5398379b0f1c9ed9f50b6ce3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47639790a8974cb1bea6c30911768830/1920.jpeg"
    },
    {
      "author": null,
      "description": "KING CITY, Calif. (AP) — A group of men in masks opened fire at an outdoor party in central California, killing four people and injuring three others Sunday evening, police said.Police responded to a reported shooting around 6 p.m.",
      "publishedAt": "2024-03-04T09:25:11Z",
      "title": "Masked shooters kill 4 people and injure 3 at an outdoor party in California, police say",
      "url": "https://apnews.com/0932798b18efe5b12f2fb589a40780fa",
      "urlToImage": ""
    },
    {
      "author": "EVENS SANON and PIERRE-RICHARD LUXAMA",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Authorities have ordered a nighttime curfew in an attempt to regain control of Haiti's streets after an explosion of violence during the weekend, including gunmen from gangs overrunning the country's two biggest prisons and freeing their inmates.",
      "publishedAt": "2024-03-04T05:06:37Z",
      "title": "Haiti orders nightly curfew trying to restore calm after a weekend of violence and prison break",
      "url": "https://apnews.com/105ca137aa337b9e6681cf87add9a5c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f437685d4baf4661b3dd5fcfafa8adba/1920.jpeg"
    },
    {
      "author": "DAKE KANG and ELAINE KURTENBACH",
      "description": "BEIJING (AP) — It's clear that China’s efforts to build confidence in its slowing economy will top the agenda of its ceremonial national legislature, which convenes Tuesday in Beijing.What remains unclear is how the ruling Communist Party can navigate toward stronger, sustained growth as China’s workforce is aging, relations with Washington are fraught, and housing construction — a main driver of the economy — is in crisis.",
      "publishedAt": "2024-03-04T06:35:03Z",
      "title": "China seeks ways to revive slowing economy and salvage property market as annual congress convenes",
      "url": "https://apnews.com/a804bc4d0d9157fea88bef85b4d5e1af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa3a0d7c16714ddba622447ea33657d2/3000.jpeg"
    },
    {
      "author": "TERRY TANG and MICHAEL CASEY",
      "description": "BOSTON (AP) — Regina Lawless hit a professional high at 40, becoming the first director of diversity and inclusion for Instagram. But after her husband died suddenly in 2021, she pondered whether she had neglected her personal life and what it means for Black woman to succeed in the corporate world.",
      "publishedAt": "2024-03-04T05:14:07Z",
      "title": "Black women struggle to find their way in a job world where diversity is under attack",
      "url": "https://apnews.com/702e7fb758565e400cc519ce9e75d989",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e6ac86589084279a31f1537cee19349/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — Strong winds spread flames on Sunday and prompted at least one evacuation while airplanes dropped fire retardant over the northern Texas Panhandle as firefighters worked to stop the largest wildfire in state history.",
      "publishedAt": "2024-03-04T06:54:10Z",
      "title": "Texas firefighters battle flames stoked by strong winds as warnings are issued across the region",
      "url": "https://apnews.com/d61f26c6686ae62e855bd2075453651b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e9803b808fe49e09250bebc7bdd840b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}