{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and LEE KEATH",
      "description": "RAFAH, Gaza Strip (AP) — Hundreds of dual passport holders and dozens of seriously injured Palestinians were allowed to leave Gaza on Wednesday after more than three weeks under siege, while Israeli airstrikes destroyed apartments in a densely populated area for the second straight day.",
      "publishedAt": "2023-11-01T06:39:52Z",
      "title": "Gaza border opened to allow some badly wounded, and foreign passport holders, flee the war",
      "url": "https://apnews.com/24a6ad56ff87a4154f250c708b5310dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c36e5178d5864580a83e231a1a37b1d1/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN and AMY TEIBEL",
      "description": "JERUSALEM (AP) — When U.S. Secretary of State Antony Blinken was asked this week who would govern the Gaza Strip following Israel’s devastating war against Hamas, he said a return of the internationally recognized Palestinian Authority made “the most sense.”",
      "publishedAt": "2023-11-01T18:30:16Z",
      "title": "The US has strongly backed Israel's war against Hamas. The allies don't seem to know what comes next",
      "url": "https://apnews.com/d57766fd8e55500ff6f16b78b3560d51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e73747990e4c486ab3503ec5bb2781e9/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — The Federal Reserve kept its key short-term interest rate unchanged Wednesday for a second straight time but left the door open to further rate hikes if inflation pressures should accelerate in the months ahead.",
      "publishedAt": "2023-11-01T04:01:21Z",
      "title": "Federal Reserve leaves its key rate unchanged but keeps open possibility of a future hike",
      "url": "https://apnews.com/63f5a7ed041d6b55c7aa773d071a05fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be8f84a7e364416f8437bd1ace887349/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — The mayors of Chicago, Denver, Houston, Los Angeles and New York are pressing to meet with President Joe Biden about getting federal help in managing the surge of migrants they say are arriving in their cities with little to no coordination, support or resources from his administration.",
      "publishedAt": "2023-11-01T16:10:24Z",
      "title": "The mayors of five big cities seek a meeting with Biden about how to better manage arriving migrants",
      "url": "https://apnews.com/f498da66af8fb0ff8df653969f3f7a7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e65bcf5a8d74fb194d0a57c1ae2b36c/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — When Donald Trump became president in 2017, he handed day-to-day management of his real estate empire to his eldest sons, Donald Jr.",
      "publishedAt": "2023-11-01T04:05:27Z",
      "title": "Donald Trump’s sons Don Jr. and Eric will testify at fraud trial that threatens the family’s empire",
      "url": "https://apnews.com/3ceb1a1d9eefdc9fddec5d04ce813ea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e9b620e984f49e59f57a59d8024cf50/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — The effort to ban former President Donald Trump from the ballot under the Constitution's “insurrection clause” turned to distant history on Wednesday, when a law professor testified about how the post-Civil War provision was indeed intended to apply to presidential candidates.",
      "publishedAt": "2023-11-01T18:22:44Z",
      "title": "Trial to determine if Trump can be barred from offices reaches far back in history for answers",
      "url": "https://apnews.com/ca5a632f46066bc31349849fe60a781a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29899847602f477cb5eb93116ec99907/3000.jpeg"
    },
    {
      "author": "HOLLY RAMER, LINDSAY WHITEHURST, KIMBERLEE KRUESI and BERNARD CONDON",
      "description": "LEWISTON, Maine (AP) — A history of mental illness. An array of weapons. Law enforcement knew about his potential for violence. But he was still able to own guns and commit the deadliest mass shooting in Maine’s history.",
      "publishedAt": "2023-11-01T16:33:59Z",
      "title": "Why was Maine shooter allowed to have guns? Questions swirl in wake of massacre",
      "url": "https://apnews.com/109a533fd7a7f7083d0270da6413d565",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08199e59f1924dc4b033be75f99536b5/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The House is expected on Wednesday to consider resolutions that would punish two of its most polarizing members, Democratic Rep. Rashida Tlaib of Michigan and Republican Rep.",
      "publishedAt": "2023-11-01T17:58:10Z",
      "title": "House weighs censure efforts against Rashida Tlaib and Marjorie Taylor Greene over their rhetoric",
      "url": "https://apnews.com/48d109c21c11f8df80053d15ff7b77b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5056a71e939f480fb001f27363c8f74f/3000.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM",
      "description": "INEZ, Ky. (AP) — One man has died after he and a coworker were trapped beneath a collapsed 11-story building being demolished at an abandoned eastern Kentucky mine's coal preparation plant, Gov. Andy Beshear announced Wednesday.",
      "publishedAt": "2023-11-01T12:19:47Z",
      "title": "Collapse of Kentucky plant being demolished at abandoned mine leaves 1 worker dead, another trapped",
      "url": "https://apnews.com/472d671ababe7886ef168d717d09e2ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0ef8cb0c7a74cd8bdd209eeb33177e3/3000.jpeg"
    },
    {
      "author": "ALICIA RANCILIO",
      "description": "If Henry Winkler is not a morning person, it's impossible to tell. He's logged onto Zoom for an interview about his new memoir but occasionally is interrupted by a phone call — which he answers with a cheery “Good Morning.” His granddaughter walks through his home office, as do his dogs.",
      "publishedAt": "2023-11-01T16:27:21Z",
      "title": "Henry Winkler rises above dyslexia to write children's books and a memoir: 'There is always a way'",
      "url": "https://apnews.com/8ae9fc6d184cb5bf3aa3b98fbb85d183",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90db38ec039d42ffbc13472f416eef99/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}