{
  "articles": [
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu pledged Tuesday to launch an incursion into the southern Gaza city of Rafah, where hundreds of thousands of Palestinians are sheltering from the almost 7-month-long war, as cease-fire negotiations between Israel and Hamas appear to be gaining steam.",
      "publishedAt": "2024-04-30T10:43:44Z",
      "title": "Netanyahu vows to invade Rafah 'with or without a deal' as cease-fire talks with Hamas continue",
      "url": "https://apnews.com/f5e14fd176d69f9c4e23b48f3ab5af6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cbce9f581474b35bc773b0fbb7ee2fe/1920.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — Israeli officials sound increasingly concerned that the International Criminal Court could issue arrest warrants for the country’s leaders more than six months into the Israel-Hamas war.",
      "publishedAt": "2024-04-29T18:48:50Z",
      "title": "What is the International Criminal Court and why it has Israeli officials worried",
      "url": "https://apnews.com/1f683a6e2e150d91c415eb1d0a19a44d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fba81926024d4df8b3006ea35afa4766/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO, CEDAR ATTANASIO, JAKE OFFENHARTZ and JONATHAN MATTISE",
      "description": "NEW YORK (AP) — Dozens of protesters took over a building at Columbia University in New York early Tuesday, barricading the entrances and unfurling a Palestinian flag out of a window in the latest escalation of demonstrations against the Israel-Hamas war that have spread to college campuses nationwide.",
      "publishedAt": "2024-04-30T04:13:28Z",
      "title": "Protesters take over Columbia University's Hamilton Hall in escalation of anti-war demonstrations",
      "url": "https://apnews.com/8b0d3a0cedb17f5e892c6ca43bbdf628",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e874327fae541d58bc68073e53934a6/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and COLLEEN LONG",
      "description": "NEW YORK (AP) — The first week of testimony at Donald Trump's hush money trial was the scene-setter for jurors: Manhattan prosecutors portrayed what they say was an illegal scheme to influence the 2016 presidential campaign by burying negative stories.",
      "publishedAt": "2024-04-30T04:02:59Z",
      "title": "Prosecutors at Donald Trump's hush money trial zero in on the details",
      "url": "https://apnews.com/d2f9badee0b28a60d32bc98c0d4e783f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a4e4de5bcea4f2d8b826565090cf0ff/2618.jpeg"
    },
    {
      "author": "ERIK VERDUZCO and PETER SMITH",
      "description": "CHARLOTTE, N.C. (AP) — Four law officers serving a warrant for a felon wanted for possessing a firearm were killed and four other officers were wounded in a shootout Monday at a North Carolina home, police said.",
      "publishedAt": "2024-04-29T18:40:33Z",
      "title": "4 law officers serving warrant are killed, 4 wounded in shootout at North Carolina home, police say",
      "url": "https://apnews.com/42d3e25ec6ec990634c9ac209e0f779a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9eac9a04c234b6dac1be8914084fbd1/1500.jpeg"
    },
    {
      "author": "STEPHANY MATAT",
      "description": "WEST PALM BEACH, Fla. (AP) — Jordan Vassallo is lukewarm about casting her first presidential ballot for President Joe Biden in November. But when the 18-year-old senior at Jupiter High School in Florida thinks about the things she cares about, she says her vote for the Democratic incumbent is an “obvious choice.”",
      "publishedAt": "2024-04-30T04:09:17Z",
      "title": "Florida Democrats hope abortion and marijuana questions draw young voters despite low enthusiasm",
      "url": "https://apnews.com/cf3a3166a0d9d6c620cf9efea4f30f51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3ce6a937b8440d4a28244354075e13d/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "MEXICO CITY (AP) — A retired Roman Catholic bishop who was famous for trying to mediate between drug cartels in Mexico was located and taken to a hospital after apparently being briefly kidnapped, the Mexican Council of Bishops said Monday.",
      "publishedAt": "2024-04-29T23:35:56Z",
      "title": "Abducted retired Catholic bishop who mediated between cartels in Mexico is located, hospitalized",
      "url": "https://apnews.com/cce5f11c068ee5e5fea9ea63fbcbf2b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9e5bb05e869468e8c29814cf62ef848/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KABUL, Afghanistan (AP) — Around 30 men are crammed into a Kabul classroom, part of the debut student cohort at a Taliban-run institute training tourism and hospitality professionals. It’s a motley crew.",
      "publishedAt": "2024-04-30T04:25:17Z",
      "title": "The Taliban are working to woo tourists to Afghanistan",
      "url": "https://apnews.com/7acb04bb78dd779e763a337790113cec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5938c8bc64974252bf0ce2bc1462787f/3000.jpeg"
    },
    {
      "author": "DAKE KANG",
      "description": "SHANGHAI (AP) — The first scientist to publish a sequence of the COVID-19 virus in China staged a sit-in protest outside his lab after authorities locked him out of the facility — a sign of the Beijing's continuing pressure on scientists conducting research on the coronavirus.",
      "publishedAt": "2024-04-30T07:12:39Z",
      "title": "Chinese scientist who first published COVID sequence stages protest after being locked out of lab",
      "url": "https://apnews.com/b54e2a88610e813c9383833f2c9a2379",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f208250d083c49bc8e6f8e87425a565a/3000.jpeg"
    },
    {
      "author": "PAT GRAHAM",
      "description": "DENVER (AP) — The futures of LeBron James and Darvin Ham with the Los Angeles Lakers are murky after their first-round playoff exit. One might choose to leave and the other might not have a choice.",
      "publishedAt": "2024-04-30T07:05:41Z",
      "title": "James, Ham face uncertain futures with Lakers after being eliminated from playoffs by Nuggets again",
      "url": "https://apnews.com/0ac018c5009181ae0653806b2a824384",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/048b8172bbfd49dfbd43ad8848f46817/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}