{
  "articles": [
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — Men walk through a lush plantation between Ecuador ’s balmy Pacific coast and its majestic Andes, lopping hundreds of bunches of green bananas from groaning plants twice their height.",
      "publishedAt": "2023-09-04T04:21:18Z",
      "title": "Security in Ecuador has come undone as drug cartels exploit the banana industry to ship cocaine",
      "url": "https://apnews.com/6d6529e2b1d8f3cbd16aea74ade0b93d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31864f35fadb4a2d89c2f96b674492ff/1920.jpeg"
    },
    {
      "author": null,
      "description": "BLACK ROCK DESERT, Nev. (AP) — An unusual late-summer storm turned a week-long counterculture fest into a sloppy mess with tens of thousands of partygoers stuck in foot-deep mud and with no working toilets in the northern Nevada desert.",
      "publishedAt": "2023-09-02T20:16:14Z",
      "title": "Burning Man flooding strands tens of thousands at Nevada site; authorities are investigating 1 death",
      "url": "https://apnews.com/d6cd88ee009c6e1f6d2d92739ec1ca18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eeca78822834573a1795eb3b7c6dcde/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukraine President Volodymyr Zelenskyy said Sunday that defense minister Oleksii Reznikov will be replaced this week with Rustem Umerov, a Crimean Tatar lawmaker.Zelenskyy made the announcement on his official Telegram account, writing that new leadership was needed after Reznikov went through \"more than 550 days of full-scale war.”",
      "publishedAt": "2023-09-03T10:20:51Z",
      "title": "Ukraine President Zelenskyy says defense minister Oleksii Reznikov will be replaced this week",
      "url": "https://apnews.com/a795984a5c42f5a65f64f2e35772a49b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7ce7c633b984d939d73ee1cb9791359/3000.jpeg"
    },
    {
      "author": "RISHI LEKHI and PIYUSH NAGPAL",
      "description": "NEW DELHI (AP) — New Delhi's crowded streets have been resurfaced. Streetlights are illuminating once dark sidewalks. City buildings and walls are painted with bright murals and graffiti. Planted flowers are everywhere.",
      "publishedAt": "2023-09-04T04:43:25Z",
      "title": "New Delhi got a makeover for the G20 summit. The city's poor say they were simply erased",
      "url": "https://apnews.com/9d449f133d5ed0aa8855ee65485ce873",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/480822164cdc4860b8231c3803822b80/3000.jpeg"
    },
    {
      "author": "PIYUSH NAGPAL, ALTAF QADRI and SIBI ARASU",
      "description": "NEW DELHI (AP) — Rekha Devi, a 30-year-old farm worker, is dreading the moment when her family will be ordered to leave their makeshift tent atop a half-built overpass and return to the Yamuna River floodplains below, where their hut and small field of vegetables is still under water from July's devastating rains.",
      "publishedAt": "2023-09-04T01:19:41Z",
      "title": "As G20 leaders prepare to meet in recently flooded New Delhi, climate policy issues are unresolved",
      "url": "https://apnews.com/092d9250659a3f6de3d1f48ec805041d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/728571ebb7434b96a7743671ca904d35/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Southeast Asian leaders led by Indonesian host President Joko Widodo are gathering in their final summit this year, besieged by divisive issues with no solutions in sight: Myanmar’s deadly civil strife, new flare-ups in the disputed South China Sea, and the longstanding United States-China rivalry.",
      "publishedAt": "2023-09-04T01:08:34Z",
      "title": "Southeast Asian leaders are besieged by thorny issues as they hold an ASEAN summit without Biden",
      "url": "https://apnews.com/d228b6b34d0cadd011673b3035285048",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38cb5e67d14b435399a8becdb9ec146d/3000.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME and GERALD IMRAY",
      "description": "JOHANNESBURG (AP) — One of the few things that survived the fire and smoke that caused at least 76 horrific deaths in a rundown apartment block in Johannesburg is a circular plaque hanging on the brown brick exterior.",
      "publishedAt": "2023-09-03T15:01:55Z",
      "title": "A building marked by fire and death shows the decay of South Africa's 'city of gold'",
      "url": "https://apnews.com/e0c0791bf90f25bd40d4fb357c368616",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1c57ce760aa46f49a191c13aa6d74fc/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and SARUUL ENKHBOLD",
      "description": "ULAANBAATAR, Mongolia (AP) — Pope Francis wrapped up the first-ever papal visit to Mongolia on Monday by inaugurating a church-run homeless clinic and shelter, insisting that such initiatives aren’t aimed at winning converts but are simply exercises in Christian charity.",
      "publishedAt": "2023-09-04T02:27:45Z",
      "title": "Francis opens clinic on 1st papal visit to Mongolia. He says it's about charity not conversion",
      "url": "https://apnews.com/f6ea91e6f2b77a3420321fff97e32821",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c7355818ef243ed8df46dde8dc863df/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and MICHELLE L. PRICE",
      "description": "ANDERSON, S.C. (AP) — A microphone in hand, Sen. Tim Scott left the podium at a recent barbecue event in South Carolina and made his way through tables draped in red, white and blue as attendees finished plates of pulled pork and baked beans.",
      "publishedAt": "2023-09-04T04:06:23Z",
      "title": "In the pivotal South Carolina primary, Republican candidates search for a path against Donald Trump",
      "url": "https://apnews.com/0f7e001af12f4044a64f38330e429f42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3d8018c15284c2e964a866abf5ff136/2223.jpeg"
    },
    {
      "author": "HOWARD FENDRICH, MARY KATHERINE WILDEMAN and BRIAN MAHONEY",
      "description": "NEW YORK (AP) — Andy Murray prepared for the steamy conditions often found at the U.S.",
      "publishedAt": "2023-09-04T03:01:18Z",
      "title": "Grand Slam tournaments are getting hotter. US Open players and fans may feel that this week",
      "url": "https://apnews.com/5412fac6f440c9a9191e7a501db870d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02a0daaa520e4e4ab6123d94e919ef28/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}