{
  "articles": [
    {
      "author": "EMMA BURROWS",
      "description": "Ukrainian President Volodymyr Zelenskyy says he directed his ministers not to sign off on a proposed agreement to give the United States access to Ukraine’s rare earth minerals because the document was too focused on U.S. interests. The proposal, which was at the center of Zelenskyy’s talks with U.S. Vice President JD Vance on the sidelines of the Munich Security Conference on Friday, did not offer any specific security guarantees in return, according to one current and one former senior official familiar with the talks. Zelenskyy’s decision to reject a deal, at least for now, was described as “short-sighted” by a senior White House official.",
      "publishedAt": "2025-02-16T05:11:08Z",
      "title": "US presented Ukraine with a document to access its minerals but offered almost nothing in return",
      "url": "https://apnews.com/article/ukraine-us-zelenskyy-agreement-trump-minerals-4d5eefcc44c9f17f330db98d81720b29",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe5ce53/2147483647/strip/true/crop/8083x4547+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F3c%2F52734a0c648ad5e8fa772ec9bc1d%2F43f837ab393e4666be58044671b139a9"
    },
    {
      "author": "SAMYA KULLAB, HANNA ARHIROVA",
      "description": "Ukraine boasts vast reserves of ilmenite, a key element used to produce titanium, in the heavy mineral sands that stretch for miles along the country’s embattled east. Much of it is underdeveloped because of war as well as onerous state policies. That is poised to change if U.S. President Donald Trump’s administration agrees to a deal with Ukraine to exchange critical minerals for continued American military aid. But many unknowns stand in the way of turning these riches into profit: cost, licensing terms and whether such a deal will be underpinned by security guarantees.",
      "publishedAt": "2025-02-16T07:01:37Z",
      "title": "In Ukraine, a potential arms-for-minerals deal inspires hope and skepticism",
      "url": "https://apnews.com/article/ukraine-titanium-minerals-us-deal-d99cf34936b9301c4fcee038fc6d9656",
      "urlToImage": "https://dims.apnews.com/dims4/default/bcb96ec/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Ff4%2Feae07d4e3e695e99dc6e2470218a%2F73e2ad11e074483fa6cb98e00fe1a8b7"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "The stunning news came in a terse statement from the Russian penitentiary service a year ago: Opposition leader Alexei Navalny had died in the Arctic Circle penal colony.",
      "publishedAt": "2025-02-16T05:11:20Z",
      "title": "Navalny death anniversary: Russian opposition struggles without its charismatic leader",
      "url": "https://apnews.com/article/russia-navalny-putin-opposition-crackdown-prison-371262559eee0aec5a22029889c0790e",
      "urlToImage": "https://dims.apnews.com/dims4/default/cee53b0/2147483647/strip/true/crop/3285x1848+0+171/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F90%2F8a08b56f21fb51363df0f87f1bf8%2Fa34ccf4b179747b9bb0f912a9c4b0c87"
    },
    {
      "author": "ALFONSO NQUNJANA, GERALD IMRAY",
      "description": "Some white South Africans have showed support for President Donald Trump and gathered at the U.S. Embassy in Pretoria to claim they are victims of racism by their own government. Hundreds of protesters held placards Saturday that read “Thank God for President Trump” and displayed other messages criticizing what they see as racist laws instituted by the South African government that discriminate against the white minority. Many were from the white Afrikaner community that Trump focused on in an executive order a week ago that cut aid and assistance to the South African government.",
      "publishedAt": "2025-02-15T10:39:12Z",
      "title": "White South Africans gather in support of Trump",
      "url": "https://apnews.com/article/trump-south-africa-white-afrikaners-b41aa729360af4d1d090ea1ac1e22cce",
      "urlToImage": "https://dims.apnews.com/dims4/default/c28ed8a/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F55%2Fb6e677ce615b63042c08113ed1af%2Fb6b1f74e5e1044bdb1ecbe472bb22cb1"
    },
    {
      "author": "MATTHEW LEE",
      "description": "Secretary of State Marco Rubio is kicking of a Mideast tour in Israel on Sunday. Arab leaders are reeling from President Donald Trump’s proposal to transfer the Palestinian population of the Gaza Strip to other countries and redevelop it under U.S. ownership. On Rubio’s first visit to the region as America’s top diplomat he is likely to get a warm welcome from Israeli Prime Minister Benjamin Netanyahu, who has praised the plan, and pushback from Arab leaders, who have universally rejected it and are scrambling to come up with a counterproposal.",
      "publishedAt": "2025-02-16T06:54:13Z",
      "title": "Rubio kicks off Mideast trip in Israel",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-15-2025-1cf8b3cb7622489c368c610f85e51e35",
      "urlToImage": "https://dims.apnews.com/dims4/default/119d528/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2F4b%2F3b55dabfecde87612933bf238fa9%2F2dd0394819f44fec9bb7e62f5ace0555"
    },
    {
      "author": "HOLLY RAMER, PATRICK WHITTLE, MARK SCOLFORO",
      "description": "A traffic stop in Vermont has cracked open a cultlike group called Zizians linked to six deaths in three states. Officials have offered few details about their cross-country investigation, but police and court records, interviews and online postings point to a small group of young computer scientists portrayed as highly intelligent and increasingly violent. Their goals aren’t clear, but online writings span topics from radical veganism and gender identity to artificial intelligence. The dead include Border Patrol Agent David Maland, two members of the group, the parents of another member and a California landlord who tried to evict some of them.",
      "publishedAt": "2025-02-15T05:03:30Z",
      "title": "A Vermont border agent’s death was the latest violence linked to the cultlike Zizian group",
      "url": "https://apnews.com/article/vermont-border-patrol-shooting-youngblut-lasota-zizians-6541ebcefc2806efd105d7db99a24aaf",
      "urlToImage": "https://dims.apnews.com/dims4/default/edfd14f/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2Fc1%2Fa48e011416b25ac3d0b11cf97f5d%2F75895b07e3cd4b8cb837536b5c48a8ac"
    },
    {
      "author": "DYLAN LOVAN",
      "description": "Heavy rains and dangerous flooding have struck the Southeast U.S. as much of the East endured a renewed round of harsh, soggy weather, with at least one fatality reported in Kentucky. Water has submerged cars and buildings in Kentucky and mudslides have blocked roads in Virginia. Both of the states were under flood warnings, along with Tennessee and Arkansas. The National Weather Service has warned residents to stay off the roads. Forecasters also have predicted weekend snowstorms in the Northeast and the threat of tornadoes for the Mississippi Valley. Heavy snow is expected to blanket much of New England. Meteorologists are also warning the U.S. could get its coldest polar vortex stretching event this season in the northern Rockies and northern Plains.",
      "publishedAt": "2025-02-15T16:37:32Z",
      "title": "Eastern US endures a renewed round of harsh, soggy weather",
      "url": "https://apnews.com/article/rain-snow-flooding-0c4ddcf08eba65e62f9c070f59947457",
      "urlToImage": "https://dims.apnews.com/dims4/default/01d3f94/2147483647/strip/true/crop/1668x938+0+87/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F01%2Fc1cc669c381e471bb4f255092eda%2F2a1286cdd1884ca182833dddaa1f3073"
    },
    {
      "author": "EMMA BURROWS",
      "description": "Finland’s president has urged the rearming of Ukraine and putting “maximum pressure on Russia” in the run-up to possible peace negotiations sought by the U.S. Alexander Stubb and other European leaders on the final day of the Munich Security Conference on Sunday sought to firm up how the European Union can move from talk to more action and stay relevant as Washington pushes to stop the fighting. He laid out three phases, saying we are currently at the “pre-negotiation” stage, where Ukraine needs to be put in a position of strength. This would be followed by a ceasefire and then a long-term peace negotiation.",
      "publishedAt": "2025-02-16T10:57:34Z",
      "title": "Finnish leader urges Europe to firm up Ukraine's hand for U.S.-sought talks with Russia to end war",
      "url": "https://apnews.com/article/munich-zelenskyy-russia-ukraine-stubb-finland-putin-trump-vance-a96cd82f8011ce75570d45fe45e41625",
      "urlToImage": "https://dims.apnews.com/dims4/default/06c5f59/2147483647/strip/true/crop/4994x2809+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F54%2F8c6e7439c8e32477ec5c5570f01d%2F990cf20710d04d14a19c683e1c1f9808"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "Austrian authorities say they have classified the stabbing attack in a southern city as an “Islamic terror incident.” The suspect, a 23-year-old Syrian man, stabbed six passersby in broad daylight on Saturday, killing a 14-year-old boy and wounding five others. He was arrested after the attack. Interior Minister Gerhard Karner said Sunday he felt “anger about an Islamist attacker who indiscriminately stabbed innocent people here in this city.”",
      "publishedAt": "2025-02-16T09:51:38Z",
      "title": "Austrian official says the suspect in the fatal stabbing attack had an 'Islamic terror motive'",
      "url": "https://apnews.com/article/austria-stabbing-attack-syria-migration-a7b5c09085eacaff68dc738bfa1459fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc59f12/2147483647/strip/true/crop/6110x3437+0+319/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F05%2F7558bc1d44e80ca4d39b760536d0%2Fdd0d51c89b47400f9507b337ca499dd5"
    },
    {
      "author": null,
      "description": "Rwanda-backed rebels have reached the center of east Congo’s second-largest city, Bukavu, and taken control of the South Kivu province administrative office. The M23 rebels were being cheered on by residents in the center of Bukavu on Sunday morning after they faced little resistance from government forces, many of whom fled the rebels' advance on Saturday along with civilians. President Felix Tshisekedi held a security meeting which stated that the country is still controlling Bukavu. It is not clear who is controlling the city but residents have reported seeing government forces flee most parts of Bukavu.",
      "publishedAt": "2025-02-16T09:56:18Z",
      "title": "Rwanda-backed rebels reach the center of east Congo’s 2nd major city in an unprecedented expansion",
      "url": "https://apnews.com/article/congo-m23-rebels-bukavu-southkivu-14527185304baa9a5e40eff4cfccba85",
      "urlToImage": "https://dims.apnews.com/dims4/default/87b8681/2147483647/strip/true/crop/3172x1784+426+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fdd%2Fc097b7a7357b44ef1a74b3670d0c%2F4ff211567c5f4c708e614448d70b6f8e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}