{
  "articles": [
    {
      "author": null,
      "description": "Pakistani security officials say that India fired missiles across the border into Pakistani-controlled territory in at least three locations early Wednesday, killing at a child and wounding two other people. India said it was striking infrastructure used by militants. The strikes came amid soaring tensions between the nuclear-armed neighbors over last month’s militant attack on tourists in the Indian-controlled portion of Kashmir. India has blamed Pakistan for backing the militant attack, which Islamabad has denied. The missiles early Wednesday struck locations in Pakistan-administered Kashmir and in the country’s eastern Punjab province, according to three Pakistani security officials.",
      "publishedAt": "2025-05-06T20:33:25Z",
      "title": "India fires missiles across the frontier with Pakistan, killing at least 1 child, officials say",
      "url": "https://apnews.com/article/pakistan-india-missiles-border-tensions-21a2859557179f2b32d6b8d5628ac853",
      "urlToImage": "https://dims.apnews.com/dims4/default/75c779d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fb0%2F13d9a6f090e23b10dad7070e71f7%2F4fe77d8fa06646669129fb401707744f"
    },
    {
      "author": "Nicole Winfield",
      "description": "A senior cardinal has urged the cardinals voting in a conclave to elect a pope who prizes unity in diversity, and puts personal interests aside.Cardinal Giovanni Battista Re, the dean of the College of Cardinals, outlined the marching orders for the 133 men who will enter the Sistine Chapel later Wednesday to begin voting to elect a new pope. In his sermon at the final pre-conclave Mass, Re reminded the cardinals that a conclave represented the highest human and church responsibility, and that they must set aside “every personal consideration.” He said the new pope must foster communion and unity within the church.",
      "publishedAt": "2025-05-07T04:42:47Z",
      "title": "Cardinals are set to begin the conclave to elect a new pope",
      "url": "https://apnews.com/article/conclave-pope-francis-cardinals-50c798caa826bbb7c913791175536add",
      "urlToImage": "https://dims.apnews.com/dims4/default/12e3e11/2147483647/strip/true/crop/7087x3986+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F92%2F850e99b481b65469a71e03afdb04%2F78056896e2954d5498b0b107e163ede1"
    },
    {
      "author": "Matthew Lee",
      "description": "President Donald Trump plans to announce next week that the U.S. will refer to the Persian Gulf as the Arabian Gulf or the Gulf of Arabia. That's according to two U.S. officials who spoke to The Associated Press on Tuesday on condition of anonymity to discuss sensitive matters. Trump is traveling to Saudi Arabia next week. Arab nations have pushed for a change to the geographic name of the body of water off the southern coast of Iran, while Iran has maintained its historic ties to the gulf. The White House and National Security Council didn’t immediately respond to messages seeking comment.",
      "publishedAt": "2025-05-07T01:12:52Z",
      "title": "Trump plans to announce the US will call the Persian Gulf the Arabian Gulf, officials tell AP",
      "url": "https://apnews.com/article/trump-persian-gulf-saudi-arabia-ce30874c27bc01426d93ad3c65a18844",
      "urlToImage": "https://dims.apnews.com/dims4/default/065e5b7/2147483647/strip/true/crop/5795x3260+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F34%2F7e746244bd40722728cc5e5cfc70%2Ffa1e72403ae64d22befb0c94252616cb"
    },
    {
      "author": "Olga R. Rodriguez",
      "description": "REAL ID requirements for those flying within the United States begin after more than 20 years of delays. Starting Wednesday, travelers taking a domestic flight and using a state-issued ID to get through security must have one that meets federal REAL ID requirements. Homeland Security Secretary Kristi Noem assured people Tuesday they will be able to fly after clearing additional identity checks. The Transportation Security Administration warned people who don’t have identification that complies with REAL ID requirements to show up early and be prepared for advanced screening to avoid causing delays.",
      "publishedAt": "2025-05-07T04:03:18Z",
      "title": "Most travelers must have a REAL ID now to fly within the US",
      "url": "https://apnews.com/article/real-id-travelers-tsa-when-deadline-f0923fe95923e9675d556ee7e08df326",
      "urlToImage": "https://dims.apnews.com/dims4/default/a828218/2147483647/strip/true/crop/4766x2681+0+248/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F5d%2F3f51368f5eba5d3fc14a1b11edf0%2Fd99671fe0fb4485682a6b664e215e06a"
    },
    {
      "author": "David A. Lieb",
      "description": "Citizen activists could find it harder to get initiatives on next year's ballot in some states. Lawmakers in about a dozen states have advanced roughly 40 measures this year that would restrict or revamp the citizen initiative process. Many of those bills already have been signed into law. The new laws include limits on who can circulate initiative petitions and additional requirements on the content of those petitions. Several states also are proposing to raise the threshold needed for voter approval. Many of the new provisions come from Republican lawmakers in states where progressive groups have placed initiatives on the ballot.",
      "publishedAt": "2025-05-07T04:06:53Z",
      "title": "Lawmakers imposing more restrictions on citizen ballot initiatives",
      "url": "https://apnews.com/article/citizen-ballot-initiative-petition-2be9e9c2900d17d93ac588b136039d56",
      "urlToImage": "https://dims.apnews.com/dims4/default/75e6949/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F5a%2Fe9c381041dd6c9f280c6f9be2918%2F92151d59ab7c490aa2ad565b6a7791f5"
    },
    {
      "author": "Wafaa Shurafa, Tia Goldenberg",
      "description": "Hospital officials say Israeli strikes across Gaza killed at least 48 people, including women and children. Officials from the Al-Aqsa Hospital said on Wednesday that the strikes included one attack on a school sheltering hundreds of displaced Palestinians, which killed 27 people, including nine women and three children. It was the fifth time since the war began that the school has been struck. Strikes on targets in multiple other areas killed at least 21. The Israeli military had no immediate comment Wednesday on the strikes. Israel blames Hamas for the death toll because it operates from civilian infrastructure, including schools.",
      "publishedAt": "2025-05-07T08:01:56Z",
      "title": "Israeli strikes across Gaza kill more than 40 people as Israel prepares to ramp up its offensive",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-07-05-2025-e6c7f8b3b57f24518e1e66a66fee7713",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0e6cc5/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2Fb1%2Fc8ba3495b05a41d713095439d6ed%2F229df0a2a743497da8d764f5ed2e365e"
    },
    {
      "author": "Maria Teresa Hernández",
      "description": "Mexico City lawmakers recently voted to ban violent bullfighting in the country’s capital. Animal rights advocates celebrated the decision, but for matadors, fans and cattle breeders, this long-time Spanish tradition bears a profound significance that would be shattered if bulls were not to be killed at the arena. For Diego Silveti, a fourth generation matador, bullfighting is a vocation, a path that he embraces despite it might kill him. “I am willing to lose my life if necessary,” Silveti said. “For my legacy, for my significance, for what God has commanded me to do.”",
      "publishedAt": "2025-05-07T05:04:06Z",
      "title": "Those devoted to bullfighting in Mexico feel recent bans harm a sacred tradition",
      "url": "https://apnews.com/article/bullfighting-mexico-matadors-religion-animal-cruelty-e8ed2a96646736b2d08a5695c3cb25c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/e121d08/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F32%2F146b36d6d2d08163b94cb88b64e1%2Ff72a3bcba72747a199dabf8d0abcee4e"
    },
    {
      "author": "Rob Gillies, Josh Boak",
      "description": "Canadian Prime Minister Mark Carney has arrived in Washington for a high-stakes meeting with President Donald Trump. Carney will have lunch with Trump before a bilateral meeting Tuesday. The new Canadian prime minster hopes to ease tensions in the trade war, which has created economic uncertainty on both sides of the border. Carney’s Liberal Party scored a stunning comeback victory last month in a vote widely seen as a rebuke of Trump. The Republican president has shattered a decades-old alliance by saying he wants to make Canada the 51st U.S. state and levying steep tariffs. Carney has stressed Canada is “in a once-in-a-lifetime crisis.” Meanwhile, Trump told reporters he wasn’t quite sure why Carney was visiting.",
      "publishedAt": "2025-05-06T10:58:06Z",
      "title": "Canadian Prime Minister Carney arrives in Washington for meeting with Trump",
      "url": "https://apnews.com/article/canada-prime-minister-carney-trump-c279642998197ecb212f39bf38184388",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba26170/2147483647/strip/true/crop/3000x1688+0+60/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F0b%2Feb9e530ff6d847a7a2d3e11c77e0%2F6896fd3b34ee46558e9b0afa7eec1ada"
    },
    {
      "author": "Zeke Miller, Fatima Hussein, Didi Tang",
      "description": "Top U.S. officials are set to meet with a high-level Chinese delegation this weekend in Switzerland. The administration on Tuesday announced the first major talks between the two nations since President Donald Trump sparked a trade war with stiff tariffs on imports. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson Greer will meet with their counterparts in Geneva in the most-senior known conversations between the two countries in months. The Chinese Commerce Ministry confirmed the meeting, saying they agreed to have contact “after fully considering global expectations, Chinese interests and calls from U.S. businesses and consumers.” It comes amid growing U.S. market worry over the impact of the tariffs.",
      "publishedAt": "2025-05-06T22:38:13Z",
      "title": "Top Trump officials to meet with Chinese counterparts in first major talks since trade war started",
      "url": "https://apnews.com/article/trump-china-trade-switzerland-bessent-2a3335ed92989dc4b3a74ea550b79b3f",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec67726/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F24%2Fc4744a419cf4b4faa8faff571bcc%2Fb7d4f728bc3d492c8a2099177df16251"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court is allowing President Donald Trump’s administration to enforce a ban on transgender people in the military, while legal challenges proceed. The high court acted Tuesday in the dispute over a policy that presumptively disqualifies transgender people from military service. The court’s three liberal justices said they would have kept the policy on hold. Just after beginning his second term in January, Trump moved aggressively to roll back the rights of transgender people. Among the Republican president’s actions was an executive order that claims the sexual identity of transgender service members “conflicts with a soldier’s commitment to an honorable, truthful, and disciplined lifestyle, even in one’s personal life” and is harmful to military readiness.",
      "publishedAt": "2025-05-06T18:13:36Z",
      "title": "Supreme Court allows Trump ban on transgender military members",
      "url": "https://apnews.com/article/supreme-court-transgender-military-ban-ef67038857bd5b99e128bf0b8866afb4",
      "urlToImage": "https://dims.apnews.com/dims4/default/41efec0/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fe9%2F6ef4d323016b07e4f56d91781143%2F78ad037c00ff44b5b6d53c1bb4674ef6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}