{
  "articles": [
    {
      "author": null,
      "description": "INDIANAPOLIS (AP) — Josef Newgarden wins Indianapolis 500 for the second straight year.",
      "publishedAt": "2024-05-26T23:47:45Z",
      "title": "Josef Newgarden wins Indianapolis 500 for the second straight year",
      "url": "https://apnews.com/cac736fc2e8dddb300c30c270958cee4",
      "urlToImage": ""
    },
    {
      "author": "WAFAA SHURAFA, TIA GOLDENBERG and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Palestinian health workers said Israeli airstrikes killed at least 35 people Sunday and hit tents for displaced people in the southern Gaza city of Rafah, and “numerous” others were trapped in flaming debris.",
      "publishedAt": "2024-05-26T08:42:49Z",
      "title": "Palestinian medics say Israeli airstrikes kill 35 in Gaza's Rafah as displaced people are hit",
      "url": "https://apnews.com/eb25eb70d2c7b9e6bcd0497060eccbca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fb0be3eb00243409a76276f786e8a73/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY and JULIO CORTEZ",
      "description": "VALLEY VIEW, Texas (AP) — Powerful storms killed at least 15 people, injured hundreds and left a wide trail of destruction Sunday across Texas, Oklahoma and Arkansas after obliterating homes and destroying a truck stop where dozens sought shelter in a restroom during the latest deadly weather to strike the central U.S.",
      "publishedAt": "2024-05-26T14:21:59Z",
      "title": "At least 15 dead after severe weather carves path of ruin across multiple states in the South",
      "url": "https://apnews.com/93001e1d81f120d0d55c8dfa24938250",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aec2647528df4eaab93bd25c1f70a78c/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY and JULIO CORTEZ",
      "description": "VALLEY VIEW, Texas (AP) — The dazed residents of a north Texas county sifted through their mangled homes on Sunday after seven people there were killed when a tornado ripped through the remote region near the tiny community of Valley View.",
      "publishedAt": "2024-05-26T20:20:26Z",
      "title": "In a north Texas county, dazed residents sift through homes mangled by a tornado",
      "url": "https://apnews.com/757353f48885ac9332df7b6897077d61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c94b6f4dd5c643f383c379440956e2d6/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — After 22 witnesses, including a porn actor, tabloid publisher and White House insiders, testimony is over at Donald Trump’s criminal trial in New York.",
      "publishedAt": "2024-05-26T12:03:16Z",
      "title": "Here's what every key witness said at Donald Trump’s hush money trial. Closing arguments are coming",
      "url": "https://apnews.com/ed9e28cd63502c0949e9fafcc6f0a991",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e1248e3d4574cb9a927956deba522a0/3000.jpeg"
    },
    {
      "author": "JENNA FRYER",
      "description": "INDIANAPOLIS (AP) — Josef Newgarden put his cheating scandal behind him to become the first back-to-back winner of the Indianapolis 500 since Helio Castroneves 22 years ago and give Roger Penske a record-extending 20th win in “The Greatest Spectacle in Racing.”",
      "publishedAt": "2024-05-26T08:10:25Z",
      "title": "Newgarden goes back-to-back at Indy 500 to give Roger Penske record-extending 20th win",
      "url": "https://apnews.com/af0fb6bd9f99433267893337e806209f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e72cbe3ab4cb43378466c3d3f110c8a2/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "SILER CITY, N.C. (AP) — At the epicenter of President Joe Biden’s promised economic boom, a slow tractor can still halt traffic.Just 81,000 people live in rural Chatham County, North Carolina.",
      "publishedAt": "2024-05-26T11:54:02Z",
      "title": "In one North Carolina county, it's 'growth, growth, growth.' But will Biden reap the benefit?",
      "url": "https://apnews.com/7e3415e660e78403b6ab261cdf55fe97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/676700b61ecf4617b548f03cbb3b4d93/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — The International Organization for Migration on Sunday increased its estimate of the death toll from a massive landslide in Papua New Guinea to more than 670 as emergency responders and traumatized relatives gave up hope that any survivors will now be found.",
      "publishedAt": "2024-05-26T04:52:37Z",
      "title": "Over 670 people died in a massive Papua New Guinea landslide, UN estimates, as survivors seek safety",
      "url": "https://apnews.com/642d9e8e0c913efa25ed2d67df318393",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e38d4e4330904f8c8bcf8e2f0fd759cf/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — All 18-year-olds in Britain will have to perform a year of mandatory military or civilian national service if the governing Conservative Party wins the July 4 national election, the party said Sunday.",
      "publishedAt": "2024-05-26T09:11:52Z",
      "title": "Sunak’s plan to make 18-year-olds do national service grabs attention on UK election trail",
      "url": "https://apnews.com/fdaf7e38793434e4f060c11735fef71e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9d9b55f65284450959cfa1d18e81949/3000.jpeg"
    },
    {
      "author": "BEN NUCKOLS",
      "description": "When Balu Natarajan became the first Indian American champion of the Scripps National Spelling Bee in 1985, a headline on an Associated Press article read, “Immigrants’ son wins National Spelling Bee,” with the first paragraph noting the champion “speaks his parents’ native Indian language at home.”",
      "publishedAt": "2024-05-26T04:58:26Z",
      "title": "National Spelling Bee reflects the economic success and cultural impact of immigrants from India",
      "url": "https://apnews.com/b14ba87533dfcd8af813de568ee5958f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d47672141b34313bf9643a059fa19c8/2857.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}