{
  "articles": [
    {
      "author": "AUDREY MCAVOY, JENNIFER SINCO KELLEHER and NICK PERRY",
      "description": "WAILUKU, Hawaii (AP) — Thousands of Hawaii residents raced to escape homes on Maui as blazes swept across the island, destroying parts of a centuries-old town and killing at least 36 people in one of the deadliest U.S.",
      "publishedAt": "2023-08-10T05:46:33Z",
      "title": "At least 36 killed on Maui as fires burn through Hawaii and thousands race to escape",
      "url": "https://apnews.com/f5a7047d407f836f89e90dd7f10faa94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9d89f313d434717afdfd281821682a5/1920.jpeg"
    },
    {
      "author": "GONZALO SOLANO and MEGAN JANETSKY",
      "description": "QUITO, Ecuador (AP) — An Ecuadorian presidential candidate known for speaking up against cartels and corruption was shot and killed Wednesday at a political rally in the capital, amid a startling wave of gang-driven violence in the South American country.",
      "publishedAt": "2023-08-10T00:59:39Z",
      "title": "Anti-corruption Ecuadorian presidential candidate assassinated at campaign event",
      "url": "https://apnews.com/ee9c726b82c09e16e5dacde2d6f005ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de07ad324d394b90915ec9b61444f2b0/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — A few hours after rioters laid siege to the Capitol, overpowering police in a violent attack on the seat of American democracy on Jan.",
      "publishedAt": "2023-08-10T04:05:53Z",
      "title": "Indictment shows White House lawyers struggling for control as Trump fought to overturn election",
      "url": "https://apnews.com/b72ee539405f1f70fe34277f969a741c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54a3712ce60e46cc8fdf791612ae7751/3000.jpeg"
    },
    {
      "author": "MARTHA MENDOZA and DASHA LITVINOVA",
      "description": "WASHINGTON (AP) — The U.S. and its European allies are importing vast amounts of nuclear fuel and compounds from Russia, providing Moscow with hundreds of millions of dollars in badly needed revenue as it wages war on Ukraine.",
      "publishedAt": "2023-08-10T04:01:18Z",
      "title": "Putin profits off global reliance on Russian nuclear fuel",
      "url": "https://apnews.com/4129cbea2aaa69b1da5d09a41804f745",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca9a891b499d4b28aca249c3d6074edc/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG, YONG JUN CHANG and AHN YOUNG-JOON",
      "description": "BUSAN, South Korea (AP) — Tropical Storm Khanun was pouring intense rain on South Korea on Thursday, turning roads into chocolate-colored rivers and leaving at least one person dead as it advanced north toward major urban centers near the capital.",
      "publishedAt": "2023-08-10T00:30:12Z",
      "title": "Tropical Storm Khanun drenches South Korea as it churns toward Seoul",
      "url": "https://apnews.com/544ab746065f89ccc768974979fb8447",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68e14061cccf4872a55279c307798124/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK and CHINEDU ASADU",
      "description": "NIAMEY, Niger (AP) — West African heads of state began meeting Thursday on next steps after Niger's military junta defied their deadline to reinstate the nation's deposed president, but analysts say the bloc known as ECOWAS may be running out of options as support fades for a military intervention.",
      "publishedAt": "2023-08-10T08:15:32Z",
      "title": "West African leaders are meeting on Niger, but options are few as a military junta defies mediation",
      "url": "https://apnews.com/9032a0e1161551ffcfde4b785f6cf74a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4c9f1ec47c2410ba37c33fdba52a527/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden signed an executive order Wednesday to block and regulate high-tech U.S.-based investments going toward China — a move the administration said was targeted but it also reflected an intensifying competition between the world's two biggest powers.",
      "publishedAt": "2023-08-09T20:00:31Z",
      "title": "Biden issues an executive order restricting US investments in Chinese technology",
      "url": "https://apnews.com/dd6a5b138e6c7cba31468dc89f776e8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24c60619b31e4a0782a167817857f707/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI and JON GAMBRELL",
      "description": "TEHRAN, Iran (AP) — For months, Iranian authorities did little to enforce the law on women covering their hair but now the country’s theocracy is pushing to make businesses the new battleground over the mandatory headscarf.",
      "publishedAt": "2023-08-10T05:31:07Z",
      "title": "A year ago, an Iranian woman's death sparked hijab protests. Now businesses are a new battleground",
      "url": "https://apnews.com/074977c6e3712b7c61acbe37e6f561a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d3de493211d44879794f7813c9a5944/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "ST. LOUIS (AP) — Firefighter and paramedic Mike Camilleri once had no trouble hauling heavy gear up ladders. Now battling long COVID, he gingerly steps onto a treadmill to learn how his heart handles a simple walk.",
      "publishedAt": "2023-08-10T04:12:14Z",
      "title": "COVID-19 took a toll on heart health and doctors are still grappling with how to help",
      "url": "https://apnews.com/3dd8f26c663e96bffcc2980830626153",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1ad5f3747274082a474217cf3bda763/3000.jpeg"
    },
    {
      "author": "JOCELYN GECKER",
      "description": "When philosophy professor Darren Hick came across another case of cheating in his classroom at Furman University last semester, he posted an update to his followers on social media: “Aaaaand, I’ve caught my second ChatGPT plagiarist.”",
      "publishedAt": "2023-08-10T04:17:47Z",
      "title": "Paper exams, chatbot bans: Colleges seek to 'ChatGPT-proof' assignments",
      "url": "https://apnews.com/1b654b44de2d0dfa4e50bf0186137fc1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbb3e1ec5f1a471bb0006bf238ca39b7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}