{
  "articles": [
    {
      "author": "NAJIB JOBAIN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces on Tuesday expanded their ground offensive into urban refugee camps in central Gaza after bombarding the crowded Palestinian communities and ordering residents to evacuate.",
      "publishedAt": "2023-12-26T10:14:15Z",
      "title": "Israeli military says Gaza ground offensive has expanded into urban refugee camps",
      "url": "https://apnews.com/698c895797ccb057d13fe4f68690c98b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/935e561b17da44df8f4f8d820897ae02/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The doctors gave Shaimaa Nabahin an impossible choice: lose your left leg or risk death. The 22-year-old had been hospitalized in Gaza for around a week, after her ankle was partially severed in an Israeli airstrike, when doctors told her she was suffering from blood poisoning.",
      "publishedAt": "2023-12-26T05:11:24Z",
      "title": "Lose a limb or risk death? Growing numbers among Gaza's thousands of war-wounded face hard decisions",
      "url": "https://apnews.com/b5a452bbf2a27364aaff68cc71b51fc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e87025fcc484e9e955a3b6435c7434f/3000.jpeg"
    },
    {
      "author": "ANNE D’INNOCENZIO and HALELUYA HADERO",
      "description": "NEW YORK (AP) — Holiday sales rose this year and spending remained resilient during the shopping season even with Americans wrestling with higher prices in some areas and other financial worries, according to the latest measure.",
      "publishedAt": "2023-12-26T15:50:32Z",
      "title": "Americans ramped up spending during the holidays despite some financial anxiety and higher costs",
      "url": "https://apnews.com/cc87e571ccffbae39110132a4c39a7c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a278bea911140d7b9bfcdae1838592d/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — For holding a sign outside a courthouse reminding jurors of their right to acquit defendants, a retiree faces up to two years in prison. For hanging a banner reading “Just Stop Oil” off a bridge, an engineer got a three-year prison sentence.",
      "publishedAt": "2023-12-26T05:20:22Z",
      "title": "The right to protest is under threat in Britain, undermining a pillar of democracy",
      "url": "https://apnews.com/616078b918e27d5098890be6f9967b14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f673b1e064e84b36ab034ed8c3f2b106/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, ZEKE MILLER and QASSIM ABDUL-ZAHRA",
      "description": "WASHINGTON (AP) — U.S. President Joe Biden ordered the United States military to carry out retaliatory airstrikes against Iranian-backed militia groups after three U.S.",
      "publishedAt": "2023-12-26T03:25:36Z",
      "title": "Biden orders strikes on an Iranian-aligned group after 3 US troops wounded in drone attack in Iraq",
      "url": "https://apnews.com/b4b4480e2cae6e7ad26e88eb625ab397",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be533bd8eb73479eab08133bcce7d37e/3000.jpeg"
    },
    {
      "author": "MSTYSLAV CHERNOV",
      "description": "KHERSON, Ukraine (AP) — Their first battle plan was outdated the moment the dam crumbled. So the Ukrainian special forces officers spent six months adapting their fight to secure a crossing to the other side of the Dnipro River in southern Ukraine.",
      "publishedAt": "2023-12-26T05:21:22Z",
      "title": "How Ukrainian special forces secured a critical Dnipro River crossing in southern Ukraine",
      "url": "https://apnews.com/9cca826e96ca244a7fea12649ff154ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2975780cdffb47869a8c64a8dc4bb601/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "HASLET, Texas (AP) — Worried about his mother’s health, Jacob Mabil tried for months to persuade her to let him start the process that would take her from a sprawling refugee camp where she had spent almost a decade after fleeing violence in South Sudan.",
      "publishedAt": "2023-12-26T05:11:06Z",
      "title": "Their lives were torn apart by war in Africa. A family hopes a new US program will help them reunite",
      "url": "https://apnews.com/039ebb3a14047497196d2491108f6559",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e2a2cc00ef14895bf2fdc6aca11968f/1920.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "ABUJA, Nigeria (AP) — Gunmen attacked remote villages over the weekend in north-central Nigeria’s Plateau state, killing at least 140 people, officials and survivors said Tuesday, the latest case this year of such mass killings blamed on the farmer-herder crisis in the West African nation.",
      "publishedAt": "2023-12-26T11:10:15Z",
      "title": "At least 140 villagers killed by suspected herders in weekend attacks in north-central Nigeria",
      "url": "https://apnews.com/9e9e9cf4615f6e31053881e8d2233bca",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russian opposition leader Alexei Navalny on Tuesday released a sardonic statement about his transfer to a Arctic prison colony nicknamed the “Polar Wolf,” his first appearance since associates lost contact with him three weeks ago.",
      "publishedAt": "2023-12-26T11:24:18Z",
      "title": "The imprisoned Russian opposition leader Alexei Navalny resurfaces with darkly humorous comments",
      "url": "https://apnews.com/0839d4164ae60a1e4fc10a3fa0d01bcf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f453fd0a02d428b98ab3ca003a42566/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — Singer-songwriter Mitski’s “My Love Mine All Mine,” plays out like a whispered dirge.",
      "publishedAt": "2023-12-26T16:31:21Z",
      "title": "For a new generation of indie rock acts, country music is king",
      "url": "https://apnews.com/7a51cb6e46e1109c2f61b7d78799532e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df1acfd7a4f64a17822765a2805668d5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}