{
  "articles": [
    {
      "author": "CLAIRE RUSH, TY O'NEIL and JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Blackened hulks of burned-out cars, the pavement streaked with melted and then rehardened chrome. Block after block of flattened homes and businesses. Incinerated telephone poles, and elevator shafts rising from ashy lots where apartment buildings once stood.",
      "publishedAt": "2023-08-11T05:47:00Z",
      "title": "Survivors of Maui's wildfires return home to blackened ruins as death toll rises to 67",
      "url": "https://apnews.com/c0f3cc5c7718bd41dd54d38479fb29b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43a2054b84844a8f90cb99a7ad3aa8a6/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and LISA MASCARO",
      "description": "WASHINGTON (AP) — Attorney General Merrick Garland appointed a special counsel Friday in the Hunter Biden probe, a surprise move that intensifies the investigation into the president's son ahead of the 2024 election.",
      "publishedAt": "2023-08-11T16:24:47Z",
      "title": "Attorney general appoints a special counsel in Hunter Biden probe, deepening investigation",
      "url": "https://apnews.com/ad1034e274570d65032f8e4f47c0c8f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0cf39f15e4e43998150a4b1b26c1878/1920.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "The appointment of a special counsel to oversee the Justice Department's probe of Hunter Biden is bringing renewed attention on the role such prosecutors have played in modern American history.",
      "publishedAt": "2023-08-11T18:19:36Z",
      "title": "The origins of special counsels, their powers and what to expect in the Hunter Biden probe",
      "url": "https://apnews.com/518e566269f29f41a36be1d7ac4d43ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2efc0e5136ff4625bab3dbc0ecf7fd21/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST, NOMAAN MERCHANT and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — The federal judge overseeing the election conspiracy case against Donald Trump warned Friday that there are limits on what the former president can publicly say about evidence in the investigation as he campaigns for a second term in the White House.",
      "publishedAt": "2023-08-11T04:17:45Z",
      "title": "Judge warns of restraints to what evidence Trump can talk about, agrees to limited protective order",
      "url": "https://apnews.com/7129afbb11d968b42c9500559109f522",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34e229fbe85247a68a7753ce6c95aafa/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — FTX founder Sam Bankman-Fried left a federal courtroom in handcuffs Friday when a judge revoked his bail after concluding that the fallen cryptocurrency wiz had repeatedly tried to influence witnesses against him.",
      "publishedAt": "2023-08-11T04:07:59Z",
      "title": "Judge sends FTX founder Sam Bankman-Fried to jail, says crypto mogul tampered with witnesses",
      "url": "https://apnews.com/5d85e43225c4da2b1abdf65b153bb760",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45302302ac9643d3b82e3cf16037c648/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — A 3-year-old child riding one of Texas’ migrant buses died while on the way to Chicago, officials said Friday, the first time the state has announced a death since it began shuttling thousands of migrants from the U.S.-Mexico border last year.",
      "publishedAt": "2023-08-12T00:09:01Z",
      "title": "3-year-old riding one of Texas’ migrant buses dies on the way to Chicago, officials say",
      "url": "https://apnews.com/172def5894d16d225d82ca92129c3f34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75216729033442b6b346550198d22ecd/3000.jpeg"
    },
    {
      "author": "CARLA BRIDI and MAURICIO SAVARESE",
      "description": "BRASILIA, Brazil (AP) — Brazil’s federal police on Friday alleged former President Jair Bolsonaro received cash from the nearly $70,000 sale of two luxury watches he received as gifts from Saudi Arabia while in office, posing another potential blow for the embattled far-right leader.",
      "publishedAt": "2023-08-12T00:36:15Z",
      "title": "Brazil's police allege Bolsonaro got money from $70,000 sale of luxury jewelry gifts",
      "url": "https://apnews.com/2cca7c335af4d731346c21e382f7a3bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7301f48981b14b6d842b1bddb7295f42/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and MATTHEW LEE",
      "description": "DUBAI, United Arab Emirates (AP) — The United States and Iran reached a tentative agreement this week that will eventually see five detained Americans in Iran and an unknown number of Iranians imprisoned in the U.S.",
      "publishedAt": "2023-08-11T16:51:16Z",
      "title": "What's behind the tentative US-Iran agreement involving prisoners and frozen funds",
      "url": "https://apnews.com/e17dc67521798a2836ab4a3213e9277b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c40e1673d4a94ccc9a8273f24f6c46f6/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Tensions are escalating between Niger's new military regime and the West African regional bloc that has ordered the deployment of troops to restore Niger's flailing democracy.",
      "publishedAt": "2023-08-11T08:09:54Z",
      "title": "Tensions rise as West African nations prepare to send troops to restore democracy in Niger",
      "url": "https://apnews.com/bfd1ddcf075379289475d3f72d85fa16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/719d94e43da842b0bb7f6a3f455a8a1b/1920.jpeg"
    },
    {
      "author": "AMY TAXIN",
      "description": "SANTA ANA, Calif. (AP) — A Southern California judge accused of killing his wife during an argument while drunk texted his court clerk and bailiff afterward to say he had shot her, prosecutors said Friday as they charged him with murder.",
      "publishedAt": "2023-08-11T16:07:50Z",
      "title": "California judge who's charged with murder texted court staff that he shot his wife, prosecutors say",
      "url": "https://apnews.com/d7d3a5c08eb04bbe7113402d9eab23d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d677e0422db4f239fc8547362235cae/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}