{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, MARK SCOLFORO and CEDAR ATTANASIO",
      "description": "ALTOONA, Pa. (AP) — Authorities arrested a suspect and charged him with murder Monday in the brazen Manhattan killing of UnitedHealthcare’s CEO after a quick-thinking McDonald’s customer in Pennsylvania spotted a man who officers found with a gun, mask and writings linking him to the ambush.",
      "publishedAt": "2024-12-09T16:33:47Z",
      "title": "New York prosecutors charge suspect in UnitedHealthcare CEO killing with murder, court records show",
      "url": "https://apnews.com/eaee0b7d31b319f42e0cf7f2f7badfb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ec6f966c3ad4323946f1744bcf9db9b/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB, BASSEM MROUE and TIA GOLDENBERG",
      "description": "DAMASCUS, Syria (AP) — Syria's prime minister said Monday that most cabinet ministers were back at work after rebels overthrew President Bashar Assad, but some state workers failed to return to their jobs, and a United Nations official said the country's public sector had come “to a complete and abrupt halt.\"",
      "publishedAt": "2024-12-09T08:06:03Z",
      "title": "Syrian government services come to a 'complete halt' as state workers stay home after rebel takeover",
      "url": "https://apnews.com/a8ecceee72a66f4d7e6168d6a21b8dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b266cf2f73a4d45b2cd667ea40b21d0/3000.jpeg"
    },
    {
      "author": "JACQUES BILLEAUD and ANITA SNOW",
      "description": "PHOENIX (AP) — A polygamist religious leader who claimed more than 20 spiritual “wives” including 10 underage girls was sentenced to 50 years in prison on Monday for coercing girls as young as 9 years old to submit to criminal sex acts with him and other adults, and for scheming to kidnap them from protective custody.",
      "publishedAt": "2024-12-09T14:05:46Z",
      "title": "Polygamous sect leader gets 50 years in prison in scheme to orchestrate sex involving children",
      "url": "https://apnews.com/af1386e7a13527b4effc6fd0077951e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01c6800f5872425f854ed14105a006d1/2000.jpeg"
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — President-elect Donald Trump's pick for intelligence chief, Tulsi Gabbard, faced fresh scrutiny Monday on Capitol Hill about her proximity to Russian-ally Syria amid the sudden collapse of that country's hardline Assad rule.",
      "publishedAt": "2024-12-09T23:24:45Z",
      "title": "Tulsi Gabbard, Trump's pick for intel chief, faces questions on Capitol Hill amid Syria fallout",
      "url": "https://apnews.com/44d0150e7d251946b60fc7f6799c4a74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6057e099a8241db9ae4ab336a5dc2c2/3000.jpeg"
    },
    {
      "author": "EVENS SANON and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A gang leader who controls a key port in Haiti's capital is accused of massacring older people and Vodou religious leaders in his community to avenge his son's death, according to the government and human rights organizations that estimate more than 100 were killed.",
      "publishedAt": "2024-12-09T16:55:33Z",
      "title": "A gang leader in Haiti is accused of massacring older people to avenge his son's death",
      "url": "https://apnews.com/97c1206c79648b61b43fd6be6ee1079a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c88c4f854f044528b6c2d19d84be974/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A Marine veteran who used a chokehold on an agitated subway rider was acquitted on Monday in a death that became a prism for differing views about public safety, valor and vigilantism.",
      "publishedAt": "2024-12-09T05:02:32Z",
      "title": "Veteran Daniel Penny is acquitted in NYC subway chokehold case over Jordan Neely's death",
      "url": "https://apnews.com/305a4eb324f6466a67bdb6734a7b999a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6780f5f57484cdab7380b12ff322caf/1920.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — President-elect Donald Trump has promised to end birthright citizenship as soon as he gets into office to make good on campaign promises aiming to restrict immigration and redefining what it means to be American.",
      "publishedAt": "2024-12-09T22:08:52Z",
      "title": "Trump promises to end birthright citizenship: What is it and could he do it?",
      "url": "https://apnews.com/20919d26029cf0f98ecb0dc7f90a066b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6578cb85c5df4367b914629f66d81cd2/1920.jpeg"
    },
    {
      "author": "JIM VERTUNO",
      "description": "AUSTIN, Texas (AP) — Six Guatemalans were arrested in Guatemala and in Texas Monday on human smuggling charges linked to a 2021 semitrailer truck crash in Mexico that killed more than 50 migrants, authorities said.",
      "publishedAt": "2024-12-09T23:02:16Z",
      "title": "6 Guatemalans arrested and charged with human smuggling in deadly 2021 Mexico truck crash",
      "url": "https://apnews.com/53324607c1956a47511d087711dc7cdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/435c11eb638340e59ca313786af47740/3000.jpeg"
    },
    {
      "author": null,
      "description": "RENO, Nev. (AP) — A probate commissioner has ruled against Rupert Murdoch’s effort to change his family’s trust to give one of his sons control of his media empire and ensure Fox News maintains its conservative editorial slant, according to a sealed document obtained by The New York Times.",
      "publishedAt": "2024-12-10T04:44:59Z",
      "title": "Rupert Murdoch’s attempt to change his family’s trust over Fox News media empire control rejected",
      "url": "https://apnews.com/d50b2e3c3e3c19d71cd6f605aacf509e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62fe29ea8135473abb9abe7574419454/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — About 87,000 people were being evacuated in a central Philippine region Tuesday a day after a volcano briefly erupted with a towering ash plume and superhot streams of gas and debris hurtling down its western slopes.",
      "publishedAt": "2024-12-10T03:10:29Z",
      "title": "Mass evacuation of Philippine villages underway after a brief but major volcanic eruption",
      "url": "https://apnews.com/ceb5c089dd807d39d96b94536911abd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2d83997161546388d2274771179dff5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}