{
  "articles": [
    {
      "author": "SAM MEDNICK and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — Israel’s prime minister faced growing pressure Saturday after U.S. President Joe Biden announced a proposed agreement to end the fighting in Gaza, with many Israelis urging Benjamin Netanyahu to embrace the deal but far-right allies threatening to collapse his government if he does.",
      "publishedAt": "2024-06-01T10:04:25Z",
      "title": "Israeli leader Netanyahu faces growing pressure at home after Biden's Gaza proposal",
      "url": "https://apnews.com/8c06dda3a8e20491b5a34377c60bb827",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33938d3d8c6546d89c0764cfcd306474/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Acknowledging only “an uptick” in Israeli military activity, the United States has gone to lengths to avoid any suggestion that Israeli forces have crossed a red line set by President Joe Biden in the deepening offensive in the southern Gaza city of Rafah.",
      "publishedAt": "2024-06-01T13:51:49Z",
      "title": "The Biden administration says Israel hasn't crossed a red line on Rafah. This could be why",
      "url": "https://apnews.com/2b13ba81805c4b7ad988f7959abc1a7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bd59519543342f4a6f2e91e6779bb6a/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Embracing Donald Trump’s strategy of blaming the U.S. justice system after his historic guilty verdict, Republicans in Congress are fervently enlisting themselves in his campaign of vengeance and political retribution as the GOP runs to reclaim the White House.",
      "publishedAt": "2024-06-01T04:24:48Z",
      "title": "Republicans join Trump's attacks on justice system and campaign of vengeance after guilty verdict",
      "url": "https://apnews.com/a05db7fa2512a62afe035992f2baaf16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dac58a673d87491880bc772810b01e3a/1920.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — The African National Congress party lost its majority in a historic election result Saturday that puts South Africa on a new political path for the first time since the end of the apartheid system of white minority rule 30 years ago.",
      "publishedAt": "2024-06-01T07:28:39Z",
      "title": "The ANC party that freed South Africa from apartheid loses its 30-year majority in landmark election",
      "url": "https://apnews.com/d9da7582ca98a4e00fec2da6a5fe1e91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41961b9202554a01aded4d05441a745e/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — Voter participation advocate Theresa Pasqual traverses Acoma Pueblo with a stack of sample ballots in her car and applications for absentee ballots, handing them out at every opportunity ahead of New Mexico's Tuesday primary.",
      "publishedAt": "2024-06-01T14:02:41Z",
      "title": "100 years ago, US citizenship for Native Americans came without voting rights in swing states",
      "url": "https://apnews.com/ed175f6bbdc1b3a078bd675be8ac0b04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6012b65b0c104d45b8c4076f4a047cd6/2972.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — President Joe Biden's son was in federal court, prepared to plead guilty to misdemeanor tax offenses. The culmination of a sprawling investigation, the deal between Hunter Biden and prosecutors was going to spare him a politically explosive trial in the middle of his father’s reelection campaign and likely prison time.",
      "publishedAt": "2024-06-01T14:55:01Z",
      "title": "From collapsed plea deal to trial: How Hunter Biden has come to face jurors on federal gun charges",
      "url": "https://apnews.com/cc96568ac3428802557c85876c820dec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b3a6be76d5142b1bce45d2b70d5ce69/3000.jpeg"
    },
    {
      "author": null,
      "description": "BOISE, Idaho (AP) — A jury in Idaho unanimously agreed Saturday that convicted killer Chad Daybell deserves the death penalty for the gruesome murders of his wife and his girlfriend’s two youngest children, ending a grim case that began in 2019 with a search for two missing children.",
      "publishedAt": "2024-06-01T16:35:00Z",
      "title": "Chad Daybell sentenced to death for killing wife and girlfriend’s 2 children in jury decision",
      "url": "https://apnews.com/a294ee6efc7ecb814f67d0e5f5daaf98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2a99c0ac7fa4cd7ba93d2f54c12dd30/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "As weight-loss plans go, it’s easy to see the allure of intermittent fasting: Eat what you want, but only during certain windows of time — often just eight hours a day.Instead of counting calories or measuring portions, dieters just have to pay attention to the clock, said Courtney Peterson, a nutrition researcher at the University of Alabama at Birmingham.",
      "publishedAt": "2024-06-01T12:00:25Z",
      "title": "Is intermittent fasting better than counting calories? Maybe not, but you might stick with it",
      "url": "https://apnews.com/c8a7a8e0bafc5b6f6faa9f30bfcc0646",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c08d9974a5e4a62b8fdd651b033a069/3000.jpeg"
    },
    {
      "author": "MATÍAS DELACROIX and JUAN ZAMORANO",
      "description": "GARDI SUGDUB, Panama (AP) — On a tiny island off Panama’s Caribbean coast, about 300 families are packing their belongings in preparation for a dramatic change. Generations of Gunas who have grown up on Gardi Sugdub in a life dedicated to the sea and tourism will trade that next week for the mainland’s solid ground.",
      "publishedAt": "2024-06-01T15:10:17Z",
      "title": "Panama prepares to evacuate first island in face of rising sea levels",
      "url": "https://apnews.com/f368711649ff6986ea25a79534405a84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a22a65a1909f43529c5deab46a084ae0/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — Last-minute computer trouble nixed Saturday’s launch attempt for Boeing’s first astronaut flight, the latest in a string of delays over the years.",
      "publishedAt": "2024-06-01T11:05:27Z",
      "title": "Boeing's first astronaut flight called off at the last minute in latest setback",
      "url": "https://apnews.com/c4caeff8515da9e5effe7bad33cf0b81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16bb0105cc1f4f749435601fcb2255c4/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}