{
  "articles": [
    {
      "author": "TOM MURPHY, AMANDA SEITZ and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — The popular diabetes treatment Jardiance and the blood thinner Eliquis are among the first drugs that will be targeted for price negotiations in effort to cut Medicare costs.President Joe Biden's administration on Tuesday released a list of 10 drugs for which the federal government will take a first-ever step: negotiating drug prices directly with the manufacturer.",
      "publishedAt": "2023-08-29T04:05:07Z",
      "title": "Biden targets diabetes drug Jardiance, blood thinner Eliquis and 8 others for Medicare price talks",
      "url": "https://apnews.com/2bf6775c3431111a2cd03fd033caefa7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c18d798033d49f5a31ceedc5c7b8a30/3000.jpeg"
    },
    {
      "author": "LAURA BARGFELD",
      "description": "TAMPA, Fla. (AP) — Idalia became a hurricane on Tuesday, threatening to bring deadly storm surge and dangerous winds to Florida’s Gulf Coast after lashing Cuba with heavy rain.A day earlier, Florida residents loaded up on sandbags and evacuated from homes in low-lying areas along the Gulf Coast to prepare for a storm that the National Hurricane Center projected could have sustained winds of up to 120 mph (193 kph).",
      "publishedAt": "2023-08-29T04:04:24Z",
      "title": "Idalia strengthens to a hurricane and dangerous storm surges are forecast for Florida’s Gulf Coast",
      "url": "https://apnews.com/c5da324eb214b779e51b145cd2c96837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48dd855651e84992ada961c2ad7c4890/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES and BRENDAN FARRINGTON",
      "description": "TALLAHASSEE, Fla. (AP) — Ron DeSantis scoffed when the NAACP issued a travel advisory this spring warning Black people to use “extreme care” if traveling to Florida.",
      "publishedAt": "2023-08-29T04:01:44Z",
      "title": "Florida Gov. Ron DeSantis faces Black leaders' anger after racist killings in Jacksonville",
      "url": "https://apnews.com/9bba89577ae8d0571e1d19b6a947fef5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc2fe549050545cd847963f257a9d23d/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM and VALERIE GONZALEZ",
      "description": "JACKSONVILLE, Fla. (AP) — A campus security officer tipped off by observant students likely stopped the killer who fatally shot three people at a nearby Dollar General Store from carrying out his racist attack at Edward Waters University, the president of the historically Black institution said Monday.",
      "publishedAt": "2023-08-28T23:23:57Z",
      "title": "HBCU president lauds students, officer for stopping Jacksonville killer before racist store attack",
      "url": "https://apnews.com/4a4050c4f607c204be6fe0973954f0a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f51f585a379f42bd84b8628e5befb4b5/3000.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM, GARY D. ROBERTSON and SARAH RANKIN",
      "description": "CHAPEL HILL, N.C. (AP) — Police were searching for both the weapon and the motive in a shooting at the University of North Carolina at Chapel Hill that left one faculty member dead and prompted an hourslong lockdown amid a search for the suspect.",
      "publishedAt": "2023-08-29T05:13:59Z",
      "title": "UNC Chapel Hill shooting suspect's motive in the killing of a faculty member is unclear, police say",
      "url": "https://apnews.com/a5eb7268934f7f416b7cfa2e2e3e24db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32c2611dbf1947a8b5efe98b4ac0669a/3000.jpeg"
    },
    {
      "author": "TOM MURPHY, AMANDA SEITZ and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — The popular diabetes treatment Jardiance and the blood thinner Eliquis are among the first drugs that will be targeted for price negotiations in effort to cut Medicare costs.President Joe Biden's administration on Tuesday released a list of 10 drugs for which the federal government will take a first-ever step: negotiating drug prices directly with the manufacturer.",
      "publishedAt": "2023-08-29T04:05:07Z",
      "title": "Biden targets diabetes drug Jardiance, blood thinner Eliquis and 8 others for Medicare price talks",
      "url": "https://apnews.com/2bf6775c3431111a2cd03fd033caefa7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c18d798033d49f5a31ceedc5c7b8a30/3000.jpeg"
    },
    {
      "author": null,
      "description": "ST. PETERSBURG, Russia (AP) — President Vladimir Putin is not planning to attend the funeral for Yevgeny Prigozhin, the Kremlin said, following reports that the mercenary chief who challenged the Russian leader's authority would be buried Tuesday.",
      "publishedAt": "2023-08-29T09:46:47Z",
      "title": "Putin is not planning to attend the funeral for Wagner chief Prigozhin, the Kremlin says",
      "url": "https://apnews.com/dc62a2919f7cfb2d0e63321f6bc1fa1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05123542969a4aba9a5b76f248410590/3000.jpeg"
    },
    {
      "author": "SONIA PÉREZ D. and MEGAN JANETSKY",
      "description": "GUATEMALA CITY (AP) — Progressive candidate Bernardo Arévalo was confirmed the winner of Guatemala's presidential election by the country's Supreme Electoral Tribunal on Monday, but the same day another government body ordered his political party suspended.",
      "publishedAt": "2023-08-28T23:43:49Z",
      "title": "Guatemala progressive's presidential victory certified, but his party is suspended",
      "url": "https://apnews.com/0b8d5eb5dbc81fcb6a413f8212739b68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5446725ef9e94505beb95402afca1212/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Anti-government protests in southern Syria have stretched into a second week, with demonstrators waving the colorful flag of the minority Druze community, burning banners of President Bashar Assad's government and at one point raiding several offices of his ruling party.",
      "publishedAt": "2023-08-29T05:27:18Z",
      "title": "Syria protests spurred by economic misery stir memories of the 2011 anti-government uprising",
      "url": "https://apnews.com/daec33a9af0e53641d3defb3beed589a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab4c27696d5348b6b8f05afec3554f96/2048.jpeg"
    },
    {
      "author": "HALLIE GOLDEN",
      "description": "PORT ANGELES, Wash. (AP) — Jeanette Kiokun, the tribal clerk for the Qutekcak Native Tribe in Alaska, doesn't immediately recognize the shriveled, brown plant she finds on the shore of the Salish Sea or others that were sunburned during the long, hot summer.",
      "publishedAt": "2023-08-29T05:16:44Z",
      "title": "Native nations on front lines of climate change share knowledge and find support at intensive camps",
      "url": "https://apnews.com/30ebca225c27ed807c1e2e670b24eb8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d801f39bd544dbcaaaa6145964542c4/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}