{
  "articles": [
    {
      "author": "Chan Ho-him",
      "description": "China has moved to curb a fierce price war between automakers sector that has caused massive losses for the industry. China’s State Administration for Market Regulation released new guidelines Thursday to prevent manufacturers from pricing cars too cheaply in order to squeeze out rivals. The China Association of Automobile Manufacturers reported this week that domestic passenger car sales fell 20% in January from a year earlier. Analysts say a cut in tax exemptions for electric vehicles and weaker EV subsidies in several Chinese regions have dampened demand. As domestic car demand slows, Chinese carmakers are expanding their global sales, and exports are expected to grow this year.",
      "publishedAt": "2026-02-12T09:11:16Z",
      "title": "China moves to curb auto price wars after sales sink",
      "url": "https://apnews.com/article/china-auto-sales-ev-tariffs-c5c32f6982cc163764e8941e1df3d9a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/a797472/2147483647/strip/true/crop/6804x4534+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2Fb8%2Fd593e9c841aacd9d65e6c6de475e%2Ff452c6930fb4434c97d2fa821ac26877"
    },
    {
      "author": "Kim Tong-hyung",
      "description": "South Korea’s spy agency says it believes the teenage daughter of North Korean leader Kim Jong Un is close to being designated as the country’s future leader. The assessment comes as Kim moves to extend the family dynasty to a fourth generation. The assessment by the National Intelligence Service was delivered to lawmakers in a closed-door meeting on Thursday. It comes as North Korea is preparing to hold its biggest political conference later this month, where Kim is expected to outline his major policy goals for the next five years and take steps to tighten his authoritarian grip.",
      "publishedAt": "2026-02-12T09:24:19Z",
      "title": "South Korea says Kim Jong Un’s daughter could soon be designated North Korea’s future leader",
      "url": "https://apnews.com/article/north-korea-kim-jong-un-daughter-c795f8c25177d45f1f4a8bf5af160007",
      "urlToImage": "https://dims.apnews.com/dims4/default/3aa2250/2147483647/strip/true/crop/4490x2992+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F4f%2F721fe5e5f833964b39aa4d518964%2Fd8972e4124174e0dbe2f0d334495c035"
    },
    {
      "author": "Rajesh Roy",
      "description": "A broad coalition of unions and farmers in India has held a one-day national strike against an interim trade deal with the United States. The strike Thursday disrupted some public services and factory work. Protest leaders say the pact harms small farmers, workers and local businesses. Opposition lawmakers in Parliament demanded the deal be scrapped. Union leaders say the deal opens India to subsidized American farm products. They also condemn privatization and new labor codes. The government defends the pact and says it protects farmers. U.S. and Indian officials say the framework lowers tariffs and deepens ties.",
      "publishedAt": "2026-02-12T09:50:38Z",
      "title": "India unions and farmers stage strike over US trade deal",
      "url": "https://apnews.com/article/india-modi-protest-trade-deal-us-farmers-90746ddd26679ba11a180aa36a4612c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/08dd6b4/2147483647/strip/true/crop/8153x5433+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F62%2Ff1948b8018666f67a82523872b58%2F88f9f20bcade47e086352e1f56c705d3"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking",
      "description": "The House has voted to slap back President Donald Trump’s tariffs on Canada. The tally offered a rare rebuke of the White House agenda, though it wouldn’t actually undo the tariffs without support from Trump himself, which is highly unlikely. Almost instantly, Trump issued his own rebuke with a political warning to those who would dare cross him. He believes in the power of tariffs to force U.S. trade partners to the negotiating table. But lawmakers are facing unrest back home from businesses caught in the trade wars and constituents navigating high prices. House Speaker Mike Johnson tried to prevent a vote, but his strategy collapsed. Several Republicans joined with Democrats in favor of the resolution. It next goes to the Senate.",
      "publishedAt": "2026-02-11T22:32:17Z",
      "title": "House GOP join Democrats to slap back Trump's tariffs on Canada",
      "url": "https://apnews.com/article/congress-tariffs-trump-canada-db591b69fbc3d867a82c7ae22d7e308b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f232a22/2147483647/strip/true/crop/5301x3532+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F02%2F10c0964cc778242aca8865d63a4c%2Faa20220e5b29455481478502e64cdab5"
    },
    {
      "author": "Sam McNeil",
      "description": "European Union leaders are gathering in Belgium as the bloc argues over how to stand up to pressure from the United States, China and Russia. They are meeting Thursday in a session meant to shape another summit in late March. German and Italian leaders are pushing deregulation, rebooted ties with Washington and more trade deals. France is pushing “European preference” to protect key industries and to steer defense spending toward EU arms makers. Leaders will also debate new finance tools to shield trade and investment. European Commission President Ursula von der Leyen says economic strength drives global influence.",
      "publishedAt": "2026-02-12T05:05:06Z",
      "title": "EU leaders meet on dealing with Trump, Russia and China pressures",
      "url": "https://apnews.com/article/europe-eu-trump-china-russia-rethink-6461ea032aa4e3aa8e133bc5080ab922",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0d1365/2147483647/strip/true/crop/6870x4578+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F74%2Fb25d4a8ef0bdb33fcac5e6de5540%2Fe8c77ace086842bfa079f1b90afd9631"
    },
    {
      "author": "Jon Gambrell",
      "description": "Activists say the death toll from a crackdown over Iran’s nationwide protests has reached at least 7,002 with many more people still feared dead. The U.S.-based Human Rights Activists News Agency offered the latest figures Thursday. It has been accurate in counting deaths during previous rounds of unrest in Iran and relies on a network of activists in Iran to verify deaths. Iran’s government offered its only death toll on Jan. 21, saying 3,117 people were killed. Iran’s theocracy in the past has undercounted or not reported fatalities from past unrest. The Associated Press has been unable to independently assess the death toll, given authorities have disrupted internet access and international calls in Iran.",
      "publishedAt": "2026-02-12T00:30:44Z",
      "title": "Iran's protest crackdown killed more than 7,000, activists say",
      "url": "https://apnews.com/article/iran-protests-crackdown-52aae887976ec1bbb0f77c42abd600b8",
      "urlToImage": "https://dims.apnews.com/dims4/default/55248a1/2147483647/strip/true/crop/2169x1445+16+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F0f%2Fcf39d29d2ad17c92540e5ec4143f%2F0cc35ad02c3f4839a30704f2d5843263"
    },
    {
      "author": "Matthew Lee",
      "description": "Secretary of State Marco Rubio is leading a large U.S. delegation to the Munich Security Conference this week. Increasingly nervous European leaders are hoping for at least a brief reprieve from President Donald Trump’s often inconsistent policies and threats that have roiled transatlantic relations and the post-World War II international order. A year after Vice President JD Vance stunned assembled dignitaries at the same venue with a verbal assault on many of America’s closest allies in Europe, Rubio plans to take a less contentious but philosophically similar approach when he addresses the annual conference on Saturday. That's according to U.S. officials who spoke on condition of anonymity.",
      "publishedAt": "2026-02-12T05:02:22Z",
      "title": "Munich Security Conference will present a new test of US-Europe ties",
      "url": "https://apnews.com/article/munich-security-conference-europe-rubio-vance-7298f12621d1e977909d6533d20f9692",
      "urlToImage": "https://dims.apnews.com/dims4/default/79e5d7a/2147483647/strip/true/crop/6216x4142+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F37%2F7f82303d046332af4d17e0f6bc09%2Ffe87f84cdce64384815ee31d7a4b87b9"
    },
    {
      "author": "Chan Ho-him",
      "description": "Taiwan's economy is thriving thanks to the boom in artificial intelligence, driven by strong demand for computer chips and other products made by companies like TSMC and Foxconn. The island's economy grew at an 8.6% annual pace last year and a recent trade deal with Washington may give it a further boost. But Taiwan's heavy reliance on computer chip makers and other technology companies also carries the risk of the AI craze turning out to be a bubble. Beijing claims the self-governed island as its own territory, a persisting threat for Taiwan despite its vital role in Chinese and global supply chains.",
      "publishedAt": "2026-02-12T05:00:00Z",
      "title": "The AI boom lifts chipmaking Taiwan's economy, but raises risks",
      "url": "https://apnews.com/article/taiwan-trump-tariffs-economy-ai-tsmc-7527bd4bf3089cbd2dab1c530ee61c3e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d10f623/2147483647/strip/true/crop/6000x3998+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F67%2F62500da0db31826fa177cd634707%2F1f18b957dc434d03a07c7f6ebd103479"
    },
    {
      "author": null,
      "description": "The Federal Aviation Administration is closing the airspace around El Paso International Airport in Texas for 10 days, grounding all flights to and from the airport. A notice posted on the FAA’s website said the temporary flight restrictions were for “special security reasons,” but the notice did not provide additional details. The closure does not include Mexican airspace. The airport said in an Instagram post that all flights to and from the airport would be grounded from late Tuesday through late on Feb. 20, including commercial, cargo and general aviation flights. It suggests travelers contact their airlines to get up-to-date flight information.",
      "publishedAt": "2026-02-11T10:51:06Z",
      "title": "FAA closes airspace around El Paso International Airport for 10 days",
      "url": "https://apnews.com/article/faa-el-paso-texas-air-space-closed-1f774bdfd46f5986ff0e7003df709caa",
      "urlToImage": "https://dims.apnews.com/dims4/default/cff83bb/2147483647/strip/true/crop/4005x2669+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F56%2Fa40ae2f7385a44057ca845ba8125%2F9ff56359bb5749f2959b601277ec2e4f"
    },
    {
      "author": "Ty ONeil",
      "description": "FBI agents are fanning out across an Arizona neighborhood not far from Nancy Guthrie’s home. They're knocking on doors and searching through thick desert terrain. This comes a day after authorities investigating Guthrie's disappearance detained a man who says he was questioned for hours before being released. The man told several media outlets on Wednesday that he had nothing to do with last week’s disappearance of Guthrie, the 84-year-old mother of “Today” show host Savannah Guthrie. Hours earlier, the FBI released images of a masked person on Nancy Guthrie’s porch the night she went missing near Tucson.",
      "publishedAt": "2026-02-11T09:07:30Z",
      "title": "FBI searches for clues in Nancy Guthrie's disappearance",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-arizona-6f1016e390e2c59d82604731f795a8ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/847afd1/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F2b%2F1b53bcbee5244718f9172fd1bf5b%2Ffd3453e41629415aab772438d4b2ccce"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}