{
  "articles": [
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — The president of South Korea early Wednesday lifted the martial law he imposed on the country hours earlier, bending to political pressure after a tense night in which troops surrounded parliament and lawmakers voted to reject military rule.",
      "publishedAt": "2024-12-03T13:40:05Z",
      "title": "South Korea lifts president's martial law decree after lawmakers reject military rule",
      "url": "https://apnews.com/997c22ac93f6a9bece68454597e577c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad19a84c9d5b479b851e7db7e393e60a/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — President-elect Donald Trump’s lawyers formally asked a judge Monday to throw out his hush money criminal conviction, arguing that continuing the case would present unconstitutional “disruptions to the institution of the Presidency.“",
      "publishedAt": "2024-12-03T21:27:14Z",
      "title": "President-elect Donald Trump’s lawyers urge judge to toss his hush money conviction",
      "url": "https://apnews.com/4ca273191cb1ea226c8938ef14f0b259",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38871df356fe4eceba6c2dd3cb88250a/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, WILL WEISSERT and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden's decision to break his word and pardon his son Hunter has spurred a broader discussion about what else he should be doing with the broad clemency powers of the presidency before he leaves office in January, including whether he should be pardoning Donald Trump.",
      "publishedAt": "2024-12-03T14:33:56Z",
      "title": "Joe Biden's pardon of his son Hunter spurs broader discussion on who else should be granted clemency",
      "url": "https://apnews.com/e2d0ce366c6980cd31c6717edbc9938a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c8ef89274c34fcb8d778546504a5332/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — President-elect Donald Trump's transition team on Tuesday signed an agreement to allow the Justice Department to conduct background checks on his nominees and appointees after a weeks-long delay.",
      "publishedAt": "2024-12-03T21:17:00Z",
      "title": "Trump team signs agreement to allow Justice to conduct background checks on nominees, staff",
      "url": "https://apnews.com/9916d70ea53ed791f28c92889aac6573",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4e0e569c9bd4adab91f022e56758035/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and JOSEF FEDERMAN",
      "description": "CAIRO (AP) — Palestinian officials say Fatah and Hamas are closing in on an agreement to appoint a committee of politically independent technocrats to administer the Gaza Strip after the war.",
      "publishedAt": "2024-12-03T09:08:42Z",
      "title": "Hamas and Fatah are near an agreement on who will oversee postwar Gaza",
      "url": "https://apnews.com/acc4da6042ed030f65d0cd0745b82217",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d894fd1de9f497aab4aae9bd9a0df64/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Kash Patel has been well-known for years within Donald Trump's orbit as a loyal supporter who shares the president-elect's skepticism of the FBI and intelligence community.",
      "publishedAt": "2024-12-03T05:03:50Z",
      "title": "Trump's FBI pick has plans to reshape the bureau. This is what Kash Patel has said he wants to do",
      "url": "https://apnews.com/2d215ded96ad8a08689b6f7f0b2d49ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3013c26e215c4d0c9a040e04ea732fa8/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KABUL, Afghanistan (AP) — In a town that has been through it all and is clawing its way back, a man named Omidullah is looking to hit paydirt.The Kabul real estate agent is selling a nine-bedroom, nine-bath, white-and-gold villa in the Afghan capital.",
      "publishedAt": "2024-12-03T05:13:40Z",
      "title": "Thanks to peace, two unexpected words are echoing across Afghanistan's capital: Luxury housing",
      "url": "https://apnews.com/06cb2e2386a8fe1b24c416b0bd2bad92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fd64af0b708407eb70af45665b84303/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY, SHARON LURYE and MORGAN LEE",
      "description": "SAN CARLOS, Ariz. (AP) — After missing 40 days of school last year, Tommy Betom, 10, is on track this year for much better attendance.",
      "publishedAt": "2024-12-03T05:08:09Z",
      "title": "Native American students miss school at higher rates. It only got worse during the pandemic",
      "url": "https://apnews.com/85179b9a8d29617661da74e29062faef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9b78579380049d686fbd82a916cc4bc/1920.jpeg"
    },
    {
      "author": "BERNARD McGHEE",
      "description": "It was a murder case almost everyone had an opinion on. O.J. Simpson 's “trial of the century” over the 1994 killings of his ex-wife and her friend bared divisions over race and law enforcement in America and brought an intersection of sports, crime, entertainment and class that was hard to turn away from.",
      "publishedAt": "2024-12-03T15:06:28Z",
      "title": "The year in review: Influential people who died in 2024",
      "url": "https://apnews.com/a0ee6673586e6687a63c829b66ac8fe7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9aeac638741d4947b2c16027ca5a97b6/3000.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "NEW YORK (AP) — I’ll get you, my pretty! And your little pygmy hippo, too!Forgive us the shameless attempt to link the fantasy hit “Wicked” to the delightful Moo Deng.",
      "publishedAt": "2024-12-03T15:00:21Z",
      "title": "2024 in pop culture: In a bruising year, we sought out fantasy, escapism — and cute little animals",
      "url": "https://apnews.com/c985d4b171608dcc00bf07c3989512d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14c8568b3fd64383a13980c8a29c3aa8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}