{
  "articles": [
    {
      "author": null,
      "description": "The risk of life-threatening flooding is still high in central Texas with more rain on the way. The urgent search for the missing continues following a holiday weekend deluge that killed at least 82 people including children at summer camps. Officials say the death toll is sure to rise. Gov. Greg Abbott says more than 40 people are unaccounted for. Searchers now have found 68 bodies in Kerr County, where a wall of water came down the Guadalupe River. Sheriff Larry Leitha says the dead include 28 children. Abbott warned Sunday that additional rounds of heavy rains lasting into Tuesday could produce more flash flooding.",
      "publishedAt": "2025-07-07T04:06:20Z",
      "title": "More than 80 dead, dozens missing in Texas flooding as search continues",
      "url": "https://apnews.com/article/texas-flash-flood-severe-weather-camp-mystic-ef8e596833b145fef61451db92f32609",
      "urlToImage": "https://dims.apnews.com/dims4/default/738f522/2147483647/strip/true/crop/3600x2025+0+98/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2Fea%2Fd31d346a5c32b59bb3a8b71af6a5%2F6e234350183a4cee91a68653a78d0693"
    },
    {
      "author": null,
      "description": "Flash floods in Texas have killed nearly 70 people, many of them children. An unknown number of people are missing. Heavy rains fell quickly in the predawn hours Friday in the Texas Hill Country, causing the Guadalupe River to rise 26 feet in just 45 minutes. Among the missing are 27 girls from Camp Mystic, a Christian summer camp. Officials are resisting estimating the total number of missing. The July Fourth holiday weekend likely brought an influx of visitors to the area outside San Antonio, making it difficult to track all the people who may have been in the area.",
      "publishedAt": "2025-07-06T16:25:30Z",
      "title": "What to know about the Texas flash floods and the rising death toll",
      "url": "https://apnews.com/article/flash-flood-texas-camp-mystic-aec9181a07d3ce8ff85197922e108b13",
      "urlToImage": "https://dims.apnews.com/dims4/default/154f53b/2147483647/strip/true/crop/3600x2025+0+80/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F78%2Fd1cad5f70533b8ed2593e866e61c%2F71337bc08bf34e5ebd8267d8fc6fb9a3"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu and U.S. President Donald Trump are meeting to discuss key Middle East issues. Both leaders have celebrated their joint actions, including strikes on Iran’s nuclear facilities, as successes. However, unresolved challenges remain, especially Israel’s 21-month war with Hamas in Gaza. Trump is pushing for a ceasefire, which could lead to a halt in fighting, aid for Gaza and the release of hostages. Hamas demands an Israeli withdrawal, while Netanyahu insists on Hamas disarming. Trump also aims to revive his regional peace vision, including expanding the Abraham Accords. Ending the Gaza war could be crucial to achieving these broader goals. The two leaders are meeting Monday over a private dinner in the White House.",
      "publishedAt": "2025-07-07T04:00:34Z",
      "title": "Gaza war looms over Trump-Netanyahu meeting",
      "url": "https://apnews.com/article/trump-iran-israel-netanyahu-gaza-ceasefire-30dba4ae46fbec44dbe977a547e612f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6838ff/2147483647/strip/true/crop/4835x2720+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2Fce%2Fa8616f8dd55e9521c05b1408c6c4%2Fba51121e8b6e4ec9953e511698efce89"
    },
    {
      "author": null,
      "description": "President Donald Trump on Monday set a 25% tax on goods imported from Japan and South Korea, as well as new tariff rates on a dozen other countries. Trump provided notice of the tariffs to begin on Aug. 1 by posting letters on Truth Social that were addressed to the leaders of the various countries. The letters warned them to not retaliate by increasing their own import taxes, or else the Trump administration would further increase import taxes. The higher tariffs could hinder economic growth, if not increase recession risks.",
      "publishedAt": "2025-07-07T16:40:16Z",
      "title": "Trump announces more tariffs on Japan, South Korea, Malaysia, other nations",
      "url": "https://apnews.com/article/trump-japan-south-korea-tariff-25-2c725e8f06367e20f9300c1081ea4ec0",
      "urlToImage": "https://dims.apnews.com/dims4/default/04b9b5d/2147483647/strip/true/crop/7308x4111+0+381/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fe6%2F8707d986cd61d645b72eb551835d%2Ff3a1477a770e4df0a343abb3419f5ec5"
    },
    {
      "author": null,
      "description": "Dozens of federal officers in tactical gear roamed a mostly empty park in a Los Angeles neighborhood with a large immigrant population for about an hour before clearing out. It wasn’t immediately known if any arrests were made Monday. Defense officials had said about 90 members of the California National Guard and over a dozen military vehicles would help protect immigration officers as they carried out a raid in MacArthur Park. Mayor Karen Bass was among the small crowd who watched as officers moved through a section of the park and then cleared out. Some activists who had earlier warned people to leave the area filmed the officers.",
      "publishedAt": "2025-07-07T18:35:33Z",
      "title": "National Guard protect immigration officers in Los Angeles operation",
      "url": "https://apnews.com/article/california-immigration-raid-troops-military-2d81f5c35f9d11db9e32234e03480497",
      "urlToImage": "https://dims.apnews.com/dims4/default/d902118/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F77%2F023cebb95f750debf788d7b24161%2F453bb510f8dd4a618f6c0ff4287dcb12"
    },
    {
      "author": null,
      "description": "Israel’s military launched airstrikes early Monday targeting ports and facilities held by Yemen’s Houthi rebels, with the rebels responding with missile fire targeting Israel. The attacks came after a suspected Houthi attack targeting a ship in the Red Sea that caught fire and took on water, later forcing its crew to abandon the vessel. The Israeli military said it struck Houthi-held ports at Hodeida, Ras Isa and Salif. The Houthis then responded with an apparent missile attack on Israel. The Israeli military said it attempted to intercept the missile, but it appeared to make impact, though there were no immediate reports of injuries from the attack.",
      "publishedAt": "2025-07-07T01:30:05Z",
      "title": "Israeli airstrikes hit Yemen's Houthi rebels",
      "url": "https://apnews.com/article/mideast-wars-yemen-houthis-israel-15edf75586540201f63b7c33348fb737",
      "urlToImage": "https://dims.apnews.com/dims4/default/02e17b8/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F88%2F9ebd2b838e8c0c7f4b12e0c0aae4%2F91f88bfc3ab74d939977bae744355640"
    },
    {
      "author": null,
      "description": "Authorities say a 27-year-old man was killed after opening fire at a U.S. Border Patrol facility in McAllen, Texas. McAllen Police Chief Victor Rodriguez told reporters Monday that Ryan Louis Mosqueda had an assault rifle and was carrying a utility vest when federal agents returned fire. Rodriguez says police received a call about the shooting just before 6 a.m. and that Mosqueda fired dozens of rounds. The shooting took place at a facility across the street from McAllen International Airport, which was shut down as a precaution. Law enforcement said afterward that they found another rifle, ammunition and backpacks that Mosqueda had brought.",
      "publishedAt": "2025-07-07T15:30:55Z",
      "title": "Man with an assault rifle killed after shooting at a Border Patrol facility in Texas",
      "url": "https://apnews.com/article/mcallen-texas-border-patrol-shooting-8241ec60d26e54d7582a7e77f6ece01e",
      "urlToImage": "https://dims.apnews.com/dims4/default/87bef48/2147483647/strip/true/crop/2400x1350+0+81/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F44%2F3d32c9b46271bc932d52dcfd2a1a%2Fd447959ef0624550979d8bb8f52a1517"
    },
    {
      "author": null,
      "description": "Authorities say Russia’s transport minister was found dead from a gunshot wound in an apparent suicide. The statement about the death of Roman Starovoit, 53, came hours after a Kremlin announcement that he had been dismissed by President Vladimir Putin. The Kremlin did not give a reason for his firing, and details of when he died were unclear, along with whether it was related to an alleged embezzlement case that surfaced in some Russian media. Russia’s Investigative Committee his body was found in his car with a gunshot wound in Odintsovo, a western Moscow neighborhood where members of Russia’s elite live. A gun was found next to his body.",
      "publishedAt": "2025-07-07T14:33:24Z",
      "title": "Russia's transportation minister found dead in what officials say was an apparent suicide",
      "url": "https://apnews.com/article/russia-starovoyt-minister-suicide-kursk-59babee35c7c1bae79c5becd51f52066",
      "urlToImage": "https://dims.apnews.com/dims4/default/7232130/2147483647/strip/true/crop/2679x1507+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F3b%2Ff99faf9cec3796451d13d6a58ae0%2F8922903c63d94f7fb9fa19e7ea7ea675"
    },
    {
      "author": null,
      "description": "The Justice Department will not release more files related to the wealthy financier Jeffrey Epstein's sex trafficking investigation despite promises from Attorney General Pam Bondi that had raised the expectations of conservative influencers and conspiracy theorists. A Justice Department memo released Monday says there is no evidence Epstein maintained a “client list.\" It represents a public walk-back of a theory that the Trump administration itself had helped promote, with Bondi suggesting in a Fox News interview earlier this year that such a document was “sitting on my desk” in preparation for release. Bondi for weeks had suggested that more evidence was going to be revealed, saying in one interview: “It’s a new administration and everything is going to come out to the public.\"",
      "publishedAt": "2025-07-07T17:31:25Z",
      "title": "Justice Department walks back theory Bondi promoted about Epstein client list",
      "url": "https://apnews.com/article/jeffrey-epstein-justice-department-pam-bondi-03fbcd024f631440f7ed62b3c6927db3",
      "urlToImage": "https://dims.apnews.com/dims4/default/623f1d3/2147483647/strip/true/crop/5076x2855+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F30%2Fdb31f06393be93deaa40f7467193%2F4b8e111561104bbd85cd54aa9f410507"
    },
    {
      "author": null,
      "description": "A new study shows that the health of U.S. children has deteriorated over the past 17 years, with kids today more likely to experience obesity, chronic diseases and other problems. The research was published Monday in the Journal of the American Medical Association. Health Secretary Robert F. Kennedy Jr. has brought children’s health to the forefront of the national policy conversation. His agency's report in May described kids as undernourished and overmedicated. But outside experts who reviewed the new study say the Trump administration’s decision to make cuts to federal health agencies, Medicaid and scientific research are not likely to reverse the trend.",
      "publishedAt": "2025-07-07T15:01:25Z",
      "title": "US children are growing increasingly unhealthy, new study says",
      "url": "https://apnews.com/article/children-health-maha-rfk-jr-jama-d920bb5421bfdc2c83d4356986e9ade7",
      "urlToImage": "https://dims.apnews.com/dims4/default/2722b8f/2147483647/strip/true/crop/3942x2217+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F4e%2Fea2bd3f4078c4282a45a883e54ef%2Fe2aebfb4cafc4eefbfcb785759368c5c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}