{
  "articles": [
    {
      "author": "Tia Goldenberg",
      "description": "Top Israeli Cabinet ministers are set to meet to vote on whether to intensify the country’s military operations in the Gaza Strip, as the country's main airport was closed following a missile launched from Yemen. The army has begun to call up thousands of reserve soldiers in preparation for an expanded assault, Israeli officials said Sunday. The plans to escalate fighting in Gaza more than 18 months after the war there erupted come as a humanitarian crisis in the territory deepens. Houthi rebels on Sunday launched a missile that set off air raid sirens in many parts of the country. A large plume of smoke could be seen rising near Ben-Gurion Airport, according to footage shared by Israeli media.",
      "publishedAt": "2025-05-04T07:24:05Z",
      "title": "Israeli Cabinet ministers to vote on whether to expand Gaza fighting",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-05-2025-44737a4e5eba0bdd2cfe9b008b600d0c",
      "urlToImage": "https://dims.apnews.com/dims4/default/5f999d4/2147483647/strip/true/crop/6420x3611+0+334/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F7c%2F429c5267f6ac2d7be874d4c23565%2F258e58d5b08e40159cef652615d4152b"
    },
    {
      "author": "Sam Metz, Akram Oubachir",
      "description": "Morocco's ports have emerged as a flashpoint in protests against the country's decision to normalize ties with Israel. A year and a half of protests have emboldened activists and exposed a gulf between the government and those they govern. Demonstrators from across the political spectrum have taken to the streets to target the country's 4-year-old decision to normalize ties with Israel. Activists accuse the government of disregarding public sentiment and are expanding their targets, which now include the country's strategic ports. Protests swelled this month ahead of the docking of vessels suspected of carrying military cargo as part of a program that includes Israel.",
      "publishedAt": "2025-05-04T04:10:06Z",
      "title": "Protesters want Morocco to sever ties with Israel, so they're targeting strategic ports",
      "url": "https://apnews.com/article/morocco-protests-ports-israel-palestinians-0e16988c3d5e30233382f32d6adbbc03",
      "urlToImage": "https://dims.apnews.com/dims4/default/a8973c8/2147483647/strip/true/crop/5293x2977+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F20%2F4e73c8585b2139a458a8f7954b5f%2F5c93e12846044da98bcc61a21f9f073e"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin said there has been no need to use nuclear weapons in the war in Ukraine and expressed hope that such a scenario will not arise. In a preview aired Sunday of a state TV interview, Putin said Russia has the strength to bring the conflict to a “logical conclusion.” His remarks come amid competing Russian and Ukrainian ceasefire proposals and continued fighting. Ukrainian officials said 11 people, including two children, were wounded in a Russian drone strike on Kyiv overnight. Russia’s Defense Ministry said its air defenses shot down 13 Ukrainian drones.",
      "publishedAt": "2025-05-04T09:02:38Z",
      "title": "Putin says he hopes nuclear weapons won't be needed in Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-nuclear-putin-ceasefire-868bda4fc666ec3b05a1e512eca91b3c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2892fe5/2147483647/strip/true/crop/6510x3662+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F90%2F1d69e1bb826577f20a614df07997%2F9034cb9b4951494eb5a3d8278e25ebd5"
    },
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump, in a new interview, is circumspect about his duties to uphold due process rights laid out in the Constitution. He also says he doesn’t think military force would be needed to make Canada the “51st state.” And he's downplaying the possibility that he'd look to run for a third term in the White House. The comments came in a wide-ranging and at time combative interview with Kristen Walker that aired Sunday on NBC’s “Meet the Press.\" The Republican president’s efforts to quickly enact his agenda are beginning to face sharper headwinds just as his administration crossed the 100-day mark this past week.",
      "publishedAt": "2025-05-04T13:08:45Z",
      "title": "Trump, in a new interview, says he doesn't know if he backs due process rights",
      "url": "https://apnews.com/article/trump-due-process-canada-greenland-military-action-8da3e853b6cec944ec373fae4d317ac4",
      "urlToImage": "https://dims.apnews.com/dims4/default/b28a790/2147483647/strip/true/crop/2885x1623+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F88%2Fb89823e8ff67f89c97dfa3de1164%2Fc28eed8434c04d12ac9681ae96b8f635"
    },
    {
      "author": "Laurie Kellman",
      "description": "President Donald Trump is once more calling opponents “communists” as his administration wages policy fights on trade and in the courts. His use of the term continues a strategy from the 2024 presidential campaign, when he called Democratic rival Kamala Harris “comrade Kamala.” But experts say there's little connection between communism, the system, and the American judges and others Trump now calls communists. Experts tell The Associated Press that Trump is using the term as a rhetorical tool to erode the legitimacy of his opponents. Trump came of age though during the Cold War, during a period of intense fear that communists could overtake the United States.",
      "publishedAt": "2025-05-03T13:15:13Z",
      "title": "Trump brands his opponents as 'communists,' a label from a bygone era",
      "url": "https://apnews.com/article/trump-communist-judges-tariff-china-russia-cae626a3699a5411841f646a847c2c7b",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e04e41/2147483647/strip/true/crop/4855x2731+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F0e%2Fa3b9370ce9d080decf906abc9ee6%2Fba67b3e4511346f8821651c170f52ff7"
    },
    {
      "author": "Bill Barrow",
      "description": "Democrats are looking for the right message and messengers to lead the opposition to President Donald Trump in his second term. And two vastly different politicians are emerging as top Democratic voices. They are Illinois Gov. JB Pritzker and Alexandria Ocasio-Cortez, a New York congresswoman. Both have drawn praise for high-profile speeches and events that have excited voters on the left. Pritzker is a billionaire heir who calls Trump as a threat to democracy and national stability. Ocasio-Cortez maintains her antiestablishment profile and labels Trump a corrupt billionaire who's hurting the working class he says he represents. Their messages highlight a familiar argument among Democrats' progressive and more moderate factions.",
      "publishedAt": "2025-05-04T11:51:59Z",
      "title": "Pritzker and Ocasio-Cortez emerge as Trump resistance leaders",
      "url": "https://apnews.com/article/pritzker-trump-ocasio-cortez-democrats-resistance-message-9d4f7868892629e34df7ea1e29dc0b34",
      "urlToImage": "https://dims.apnews.com/dims4/default/504faf2/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Fcb%2F08889530a724656379ecf14f7884%2F43ab07c20967473a948a7dad2287b173"
    },
    {
      "author": "Nicole Winfield",
      "description": "While Pope Francis accomplished a lot in his 12-year papacy, he left much unfinished business and many challenges for his successor — from the Vatican’s disastrous finances to the wars raging on multiple continents. When the conclave’s cardinals finish casting their ballots in the Sistine Chapel, the 267th pope will have to decide whether to continue with Francis’ policies, radically change them, or abandon them altogether. He also must choose what new projects will take precedence. Among the pressing issues are the role of women in the church, the division between traditionalists and progressives, what to do about clergy sex abuse and whether to LGBTQ+ Catholics.",
      "publishedAt": "2025-05-04T04:07:31Z",
      "title": "Pope Francis left unfinished business after a 12-year papacy. What challenges await the next pope?",
      "url": "https://apnews.com/article/pope-conclave-challenges-lgbtq-women-sex-abuse-e73199910f1723282b91984f207ad5a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/f48f1ce/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F25%2F5444d9ca67d9af32c8136104ca03%2F02b6f038ebff4275a12503eed7f3bb20"
    },
    {
      "author": "Associated Pres",
      "description": "It felt much longer, but the U.S. stock market needed just a few weeks to roar all the way back to where it was on President Donald Trump’s “Liberation Day.” That’s when he shocked Wall Street by announcing much steeper tariffs than expected on nearly all U.S. trading partners. Within just four days, the S&P 500 fell about 12%, and the Dow Jones Industrial Average lost nearly 4,600 points, or about 11%. This past Friday, though, the S&P 500 rallied for a ninth straight gain and pulled back to where it was on April 2. Trump's 90-day pause on many tariffs and a resilient economy helped the market bounce back.",
      "publishedAt": "2025-05-04T12:40:39Z",
      "title": "How the stock market made back all its losses after Trump escalated the trade war",
      "url": "https://apnews.com/article/trump-tariffs-stock-market-bonds-dollar-pause-5409392268729ba0ada7077d0eea9e4e",
      "urlToImage": "https://dims.apnews.com/dims4/default/41ff5fc/2147483647/strip/true/crop/2987x1680+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F72%2Fec2c7ce10d04ecb061a0d34d862f%2F2614279450bc415b834bf3a60125532b"
    },
    {
      "author": "Stephen Mcgrath",
      "description": "Romanians are casting ballots in a critical presidential election redo after last year’s annulled vote plunged the European Union and NATO member country into its worst political crisis in decades. Eleven candidates are vying for the presidency and a May 18 runoff is expected. A median of local polls suggests George Simion, a MAGA-style hard-right nationalist, will emerge as the frontrunner, likely pitting him against Bucharest Mayor Nicusor Dan, or the governing coalition’s candidate Crin Antonescu.",
      "publishedAt": "2025-05-04T04:06:10Z",
      "title": "Romanians cast votes in presidential rerun after voided election sparked deep political crisis",
      "url": "https://apnews.com/article/romania-election-presidential-crisis-e6ce0a674cf88bfc02c505482dc2497b",
      "urlToImage": "https://dims.apnews.com/dims4/default/225b9ab/2147483647/strip/true/crop/6862x3860+0+358/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F45%2Fa2%2F683231fe381391343e5f4b73abd5%2Fd0c33d9ef1db4783a2f58048f5ad7918"
    },
    {
      "author": null,
      "description": "Brazilian police say that they have thwarted a plot to detonate a bomb at Lady Gaga’s concert the night before in Rio de Janeiro, the biggest show of her career that drew some 2 million fans to Copacabana Beach. The Rio de Janeiro state police said Sunday they had worked with the Justice Ministry to disrupt the attack allegedly planned by a group that was spreading hate speech against the LGBTQ community. Two people have been arrested. Police said the group sought to radicalize and recruit teenagers to carry out attacks using Molotov cocktails and improvised explosives.",
      "publishedAt": "2025-05-04T15:18:55Z",
      "title": "Brazilian police arrest two people over plot to bomb Lady Gaga's concert in Rio",
      "url": "https://apnews.com/article/brazil-concert-lady-gaga-bomb-plot-arrests-f280b304d3a2793c2ab48be07b44a964",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0d3d51/2147483647/strip/true/crop/6188x3481+0+323/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F08%2F39f9733e1b4d3c0c6558f66a4be1%2Fdd70782e1f554fe7bcf1861ab7574de5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}