{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and RAVI NESSMAN",
      "description": "RAFAH, Gaza Strip (AP) — A barrage of Israeli airstrikes across the Gaza Strip on Tuesday crushed multiple residential buildings and buried families under rubble, as health officials in the besieged territory reported hundreds killed in the past day and the closure of medical facilities because of bomb damage and a lack of power.",
      "publishedAt": "2023-10-24T07:15:30Z",
      "title": "Israel launches 400 strikes across Gaza, where health officials say hundreds of Palestinians killed",
      "url": "https://apnews.com/c2482817f230580c20b898bd65e5a4c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/979203658b7d43b2b3dc9ba1d1e8dee7/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE and NAJIB JOBAIN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — For more than a week, Talaat Ghabayen, a citizen of Norway who spent his whole life in Oslo, has waited days and nights at the Gaza Strip's land crossing with Egypt as his embassy advised, hoping to flee Israel's bombardment and looming ground invasion and reunite with his wife and sons back home.",
      "publishedAt": "2023-10-24T16:29:43Z",
      "title": "Stranded at a closed border as bombs fall, foreign nationals in besieged Gaza await evacuation",
      "url": "https://apnews.com/e04be08cc81286f87c21450a4c88886a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ae199b377e944619cfeebee5c441aab/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "Dozens of US states, including California and New York, are suing Meta Platforms Inc. for harming young people and contributing to the youth mental health crisis by knowingly and deliberately designing features on Instagram and Facebook that addict children to its platforms.",
      "publishedAt": "2023-10-24T16:01:15Z",
      "title": "States sue Meta claiming its social platforms are addictive and harm children's mental health",
      "url": "https://apnews.com/1805492a38f7cee111cbb865cc786c28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d82e4c5730184905a12964d7a80365bc/3000.jpeg"
    },
    {
      "author": "KEVIN McGILL and SARA CLINE",
      "description": "NEW ORLEANS (AP) — Crews worked into Tuesday morning clearing the wreckage of more than 150 vehicles involved in a series of crashes the day before on Interstate 55 near New Orleans caused by a “superfog” of marsh fire smoke and dense fog that killed at least seven people and injured another 25.",
      "publishedAt": "2023-10-24T12:50:22Z",
      "title": "Crews clear wreckage after 'superfog' near New Orleans causes highway crashes that killed at least 7",
      "url": "https://apnews.com/304195491d1bfbc5ac929b1c6acd1d7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf04b78cf45949e29cbc32858add4094/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — First it was Ford, then Stellantis, and now a General Motors factory has been added to the growing list of highly profitable plants where the United Auto Workers union is on strike.On Tuesday, about 5,000 workers walked out at GM's factory in Arlington, Texas, that makes big, high margin SUVs such as the Chevrolet Tahoe and Cadillac Escalade.",
      "publishedAt": "2023-10-24T14:38:19Z",
      "title": "UAW strikes at General Motors plant in Texas as union goes after automakers' cash cows",
      "url": "https://apnews.com/f16005a7b20a6f1772947957854d1017",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5094e61aad94791b561d45023c3ef92/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and KATE BRUMBACK",
      "description": "ATLANTA (AP) — Attorney and prominent conservative media figure Jenna Ellis pleaded guilty on Tuesday to a felony charge over efforts to overturn Donald Trump’s 2020 election loss in Georgia, tearfully telling the judge she looks back on that time with “deep remorse.”",
      "publishedAt": "2023-10-24T13:45:57Z",
      "title": "Jenna Ellis becomes latest Trump lawyer to plead guilty over efforts to overturn Georgia's election",
      "url": "https://apnews.com/c4dbacd3e4bbb5415ebd3d42d8fa3128",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02e6159353f44ca9abf0448f97e8c441/2902.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — In a courtroom showdown five years in the making, Donald Trump's fixer-turned-foe Michael Cohen testified Tuesday that he worked to boost the supposed value of the former president's assets to “whatever number Trump told us to.\"",
      "publishedAt": "2023-10-24T04:28:57Z",
      "title": "In courtroom faceoff, Michael Cohen says he was told to boost Trump's asset values 'arbitrarily'",
      "url": "https://apnews.com/8e49619e3f5ebb6931e6947c4dabda87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/399205712b184ae382ddb46d8b6d585b/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, STEPHEN GROVES, FARNOUSH AMIRI and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Republicans picked Rep. Tom Emmer as their nominee for House speaker Tuesday as they try again to fill the top position, but the choice quickly ran into familiar resistance from hard-liners and allies of Donald Trump leaving no guarantee the latest hopeful can win the gavel.",
      "publishedAt": "2023-10-24T04:25:10Z",
      "title": "GOP picks Tom Emmer as its nominee for House speaker but there's no guarantee he can win the gavel",
      "url": "https://apnews.com/c7ddb6abf4c7322f9fc44fdaa07791fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6c96418d52e4d419eaace6335bdcfd5/3000.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "FRANKFURT, Germany (AP) — Tensions from the war in Gaza could help accelerate the move away from planet-warming fossil fuels like oil and gas and toward renewable energy, electric cars and heat pumps — similar to how sharp increases in the price of oil during the 1970s unleashed efforts to conserve fuel, the head of the International Energy Agency said.",
      "publishedAt": "2023-10-24T04:04:53Z",
      "title": "Gaza has oil markets on edge. That could build more urgency to shift to renewables, IEA head says",
      "url": "https://apnews.com/7b0cf535f33a3b33a2bfd8a462850ff4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa86b63188c54e90a1cabb56b3c415ec/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "NASHVILLE, Tenn. (AP) — It’s long after midnight when the bustling operating room suddenly falls quiet — a moment of silence to honor the man lying on the table.This is no ordinary surgery. Detrick Witherspoon died before ever being wheeled in, and now two wide-eyed medical students are about to get a hands-on introduction to organ donation.",
      "publishedAt": "2023-10-24T05:02:49Z",
      "title": "Few transplant surgeons are Black. Giving medical students a rare peek at organ donation may help",
      "url": "https://apnews.com/a00f3e7b43f3d4e176a9647c49487e92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7287c3e87d774e36a5f5a0b94e70da32/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}