{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Two jurors in former President Donald Trump's hush money trial were dismissed Thursday, one after expressing doubt about her ability to be fair and impartial and the other over concerns that some of his answers in court may not have been accurate.",
      "publishedAt": "2024-04-18T04:07:01Z",
      "title": "2 jurors dismissed from Trump hush money trial as prosecutors seek to hold ex-president in contempt",
      "url": "https://apnews.com/b514cb52bb31a82579cb827c40166173",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fd8a2a6927449c1b91464f975eb33f0/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Jury selection in Donald Trump ’s hush money case encountered new setbacks Thursday as two previously sworn-in jurors were excused — one for backtracking on whether she could be impartial and fair and the other over concerns that he may not have been truthful about whether he had ever been accused or convicted of a crime.",
      "publishedAt": "2024-04-18T12:30:38Z",
      "title": "The Latest | A second seated juror dismissed by judge from Trump's hush money trial",
      "url": "https://apnews.com/3fbfbc00592292726c2ae05407eecc04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/469e2da63a0d4eb2ada54b4f11fc85ab/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, WILL WEISSERT and CHRIS MEGERIAN",
      "description": "PHILADELPHIA (AP) — President Joe Biden will accept endorsements from at least 15 members of the Kennedy political family during a campaign stop Thursday as he aims to undermine Donald Trump and marginalize the candidacy of independent Robert F.",
      "publishedAt": "2024-04-18T10:13:41Z",
      "title": "Biden scores endorsements from Kennedy family, looking to shore up support against Trump and RFK Jr.",
      "url": "https://apnews.com/b411e744d3b13fc6365029cb3dfd00c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8738467af5734f8dab50318af67dd857/2741.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — The U.S. and U.K. on Thursday imposed a new round of sanctions on Iran as concern grows that Tehran’s unprecedented attack on Israel could fuel a wider war in the Middle East.",
      "publishedAt": "2024-04-18T13:33:18Z",
      "title": "US and UK issue new sanctions on Iran in response to Tehran's weekend attack on Israel",
      "url": "https://apnews.com/f031a8bbcc54734a2eac152b36859ee9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97e048b449e44964adbfcc8681d86a19/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "JERUSALEM (AP) — Every year, Alon Gat’s mother led the family's Passover celebration of the liberation of the ancient Israelites from Egypt thousands of years ago. But this year, Gat is struggling with how to reconcile a holiday commemorating freedom after his mother was slain and other family members abducted when Hamas attacked Israel.",
      "publishedAt": "2024-04-18T04:28:00Z",
      "title": "Israelis grapple with how to celebrate Passover, a holiday about freedom, while many remain captive",
      "url": "https://apnews.com/a750b8a3150c32836af4515c11dc31c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f32e42afbb7c4bc49aa4238d950fc69b/1920.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and SHEIKH SAALIQ",
      "description": "AHMEDABAD, India (AP) — Hindu nationalism, once a fringe ideology in India, is now mainstream.",
      "publishedAt": "2024-04-18T04:20:47Z",
      "title": "Once a fringe Indian ideology, Hindu nationalism is now mainstream, thanks to Modi's decade in power",
      "url": "https://apnews.com/79c30c8ae750a9c037d86b9e2c1b640c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a86e6e9fd09d4cb88b4ac6697c99731c/2970.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Six months after a deadly mass shooting by an Army reservist, Maine lawmakers this week passed a wide-ranging package of new gun restrictions.",
      "publishedAt": "2024-04-18T17:07:33Z",
      "title": "Two shootings, two different responses — Maine restricts guns while Iowa arms teachers",
      "url": "https://apnews.com/b7104227457bc85536b6d5a6c6eb650e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c9aa3889e5744cda91ba99db039ce97/1920.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN and LINLEY SANDERS",
      "description": "Like many Americans, Ron Theusch is getting more worried about climate change.",
      "publishedAt": "2024-04-18T04:03:07Z",
      "title": "Climate change concerns grow, but few think Biden's climate law will help, an AP-NORC poll finds",
      "url": "https://apnews.com/f9943ab6a37674ef2345f4041618cf5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf8241dec45b463c8d836c44e8485d8e/3000.jpeg"
    },
    {
      "author": "TRAVIS LOLLER and MICHAEL PHILLIS",
      "description": "When a deadly explosion destroyed BP’s Deepwater Horizon drilling rig in the Gulf of Mexico, 134 million gallons of crude erupted into the sea over the next three months — and tens of thousands of ordinary people were hired to help clean up environmental devastation from the biggest offshore oil spill in U.S.",
      "publishedAt": "2024-04-18T13:34:54Z",
      "title": "Once praised, settlement to help sickened BP oil spill workers leaves most with nearly nothing",
      "url": "https://apnews.com/f3845a3cb9da869d2689452a7dec0c9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1a37806d5944d78b662fd43ae5922e4/3000.jpeg"
    },
    {
      "author": "ROB MAADDI",
      "description": "The NFL draft will be offensive.We’re not talking about hurt feelings. This draft has the potential to set a record for most offensive players selected in the first round.No draft has seen more than 19 players on offense chosen in the first round.",
      "publishedAt": "2024-04-18T10:00:35Z",
      "title": "NFL draft has potential to set a record for most players on offense selected in the first round",
      "url": "https://apnews.com/598d5970ee0b85ed36a4c94ce25adea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e1656004e2f49dbad7264e570863591/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}