{
  "articles": [
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden pardoned potentially thousands of former U.S. service members convicted of violating a now-repealed military ban on consensual gay sex, saying Wednesday that he is “righting an historic wrong\" to clear the way for them to regain lost benefits.",
      "publishedAt": "2024-06-26T09:00:40Z",
      "title": "Biden pardons potentially thousands of ex-service members convicted under now-repealed gay sex ban",
      "url": "https://apnews.com/a83b799323380de10aac0ca6fb57595b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/018dad8800aa43adbcf995cc278d0222/3000.jpeg"
    },
    {
      "author": "RICK RYCROFT and ROD McGUIRK",
      "description": "CANBERRA, Australia (AP) — WikiLeaks founder Julian Assange returned to his homeland Australia aboard a charter jet on Wednesday, hours after pleading guilty to obtaining and publishing U.S.",
      "publishedAt": "2024-06-26T09:41:57Z",
      "title": "WikiLeaks founder Julian Assange returns to Australia a free man after US legal battle ends",
      "url": "https://apnews.com/7daeb8f54c0604fb0e78c0b171046013",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69c07c5c3d3d4e88899da6befb54f020/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and MAYA ALLERUZZO",
      "description": "JENIN, West Bank (AP) — When Mujahid Abadi stepped outside to see if Israeli forces had entered his uncle's neighborhood, he was shot in the arm and the foot. That was only the start of his ordeal. Hours later, beaten and bloodied, he found himself strapped to the searing hood of an Israeli military jeep driving down a road.",
      "publishedAt": "2024-06-26T04:34:10Z",
      "title": "A Palestinian was shot, beaten and tied to an Israeli army jeep. The army says he posed no threat",
      "url": "https://apnews.com/8e8ed63bda65383e38e4dd52d239e319",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba1a3048d8d245a9af6dfd2fc2a6194e/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — What people remember from Joe Biden and Donald Trump’s first debate four years ago are likely the interruptions, the shouting and the “will you shut up, man?”",
      "publishedAt": "2024-06-26T04:03:56Z",
      "title": "Biden and Trump are set to debate. Here's what their past performances looked like",
      "url": "https://apnews.com/a3b65b133c7e7a7d29450a4ffa28d85f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e81dd8ec0427450596858f6ab38d4cb1/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Most U.S. adults plan to watch some element of Thursday's presidential debate and many think the event will be important for the campaigns of both President Joe Biden and former President Donald Trump, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-06-26T04:07:42Z",
      "title": "Most Americans plan to watch the Biden-Trump debate, and many see high stakes, an AP-NORC poll finds",
      "url": "https://apnews.com/cc9e16ef147507162e22c96ddb889ee8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dbd14078b604d6488f4f44871c8d3a0/1920.jpeg"
    },
    {
      "author": "NASSER KARIMI and JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Seemingly every afternoon in Iran's capital, police vans rush to major Tehran squares and intersections to search for women with loose headscarves and those who dare not to wear them at all.",
      "publishedAt": "2024-06-26T04:59:54Z",
      "title": "As Iran's presidential vote looms, tensions boil over renewed headscarf crackdown",
      "url": "https://apnews.com/9dafd124a8d957119cd845cad3e81dea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8912ab741c8d43b78603c5393184500e/3000.jpeg"
    },
    {
      "author": "SYLVIA HUI",
      "description": "CLACTON-ON-SEA, England (AP) — Dorothy Carr is fed up with how things are run in her hometown. It’s impossible to get a doctor's appointment through Britain's state-run health care system. Local buses have been canceled.",
      "publishedAt": "2024-06-26T11:21:01Z",
      "title": "Fed up with the UK Conservatives, some voters turn to the anti-immigration Reform party for answers",
      "url": "https://apnews.com/61f79607dddf9e68eedf65ea14adb162",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae2784af30f54cbcb48f7b0ab2d92c65/3000.jpeg"
    },
    {
      "author": "KIRILL ZARUBIN and JIM HEINTZ",
      "description": "YEKATERINBURG, Russia (AP) — Wall Street Journal reporter Evan Gershkovich went on trial behind closed doors in Yekaterinburg on Wednesday, 15 months after his arrest in the Russian city on espionage charges that he, his employer and the U.S.",
      "publishedAt": "2024-06-26T04:41:22Z",
      "title": "A US journalist goes on trial in Russia on espionage charges that he and his employer deny",
      "url": "https://apnews.com/75c2cdca103c5cd4902255dcdb372315",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7651ddbc31594d2ba4576d752dcb82be/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — As he campaigned for the presidency, Joe Biden promised to spend billions of dollars to “save the world” from climate change. One of the largest players in the solar industry was ready.",
      "publishedAt": "2024-06-26T11:01:09Z",
      "title": "A signature Biden law aimed to boost renewable energy. It also helped a solar company reap billions",
      "url": "https://apnews.com/dca914675cd0855004214d82aab5b10c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56c788efaa2a4041be1128ed8e5b3cc7/2900.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT, DAVE COLLINS and MARGERY A. BECK",
      "description": "DES MOINES, Iowa (AP) — Kathy Roberts has almost nothing left. The South Dakota resident escaped flooding Sunday night with her cat and the clothes on her back, KTIV-TV reported.",
      "publishedAt": "2024-06-26T04:34:23Z",
      "title": "Midwest flooding devastation comes into focus as flood warnings are extended in other areas",
      "url": "https://apnews.com/4b9fbfe8918e7a7e3c18178cb92b11a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f054687adc044d268d247792c1963a71/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}