{
  "articles": [
    {
      "author": "ADRIANA GOMEZ LICON and ALANNA DURKIN RICHER",
      "description": "MIAMI (AP) — The property manager of Donald Trump’s Mar-a-Lago estate made his first court appearance on Monday facing charges in the classified documents case against the former president, but he did not enter a plea because he has not found a Florida-based attorney to represent him.",
      "publishedAt": "2023-07-31T04:11:39Z",
      "title": "Mar-a-Lago manager De Oliveira makes his first court appearance in Trump's classified documents case",
      "url": "https://apnews.com/f7e6879fe80e96a321b46279b150bdf9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2191ab0a6f94056841d3a4d070b7744/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO and JILL COLVIN",
      "description": "WASHINGTON (AP) — Donald Trump’s political operation entered the second half of the year in a strained financial position with its bank account drained by tens of millions of dollars that were directed toward defending the former president from mounting legal challenges as he seeks the White House again.",
      "publishedAt": "2023-07-31T18:40:06Z",
      "title": "Trump's campaign finances are strained as legal peril mounts",
      "url": "https://apnews.com/36fe10e4988a56de34f120cff38e1552",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89dde514273d46069ff7f9b00066ac36/3000.jpeg"
    },
    {
      "author": "BY ANITA SNOW and DREW COSTLEY",
      "description": "PHOENIX (AP) — A record string of daily highs over 110 degrees Fahrenheit (43.3 degrees Celsius) in Phoenix ended Monday as the dangerous heat wave that suffocated the Southwest throughout July receded slightly with cooling monsoon rains.",
      "publishedAt": "2023-07-31T18:16:36Z",
      "title": "Phoenix has ended 31-day streak of highs at or above 110 degrees as rains ease a Southwest heat wave",
      "url": "https://apnews.com/d7db7d44effcdab554b6a742288eb2be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09f0de55c9864c96a397686f278178e7/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "At about summer's halfway point, the record-breaking heat and weather extremes are both unprecedented and unsurprising, hellish yet boring in some ways, scientists say.",
      "publishedAt": "2023-07-31T15:08:11Z",
      "title": "Here's how hot and extreme the summer has been, and it's only halfway over",
      "url": "https://apnews.com/c36078efbcba515a4c67b7d9d0bbb9fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c9c5a925a764cf99308218354035224/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "BOISE, Idaho (AP) — Idaho mother Lori Vallow Daybell has been sentenced to life in prison without parole Monday in the murders of her two youngest children and a woman she saw as a romantic rival in a case that included bizarre claims that her son and daughter were zombies and that she was a goddess tasked with ushering in an apocalypse.",
      "publishedAt": "2023-07-31T04:04:47Z",
      "title": "Idaho mom Lori Vallow Daybell sentenced in deaths of 2 children and her romantic rival",
      "url": "https://apnews.com/1e0a1cfa1f4e67b4dbb7b43cba86156d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0cae4d4a7a14b7bb03dcef1c790f13b/2000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — The National Institutes of Health is beginning a handful of studies to test possible treatments for long COVID, an anxiously awaited step in U.S. efforts against the mysterious condition that afflicts millions.",
      "publishedAt": "2023-07-31T16:01:31Z",
      "title": "Brain fog and other long COVID symptoms are the focus of new small treatment studies",
      "url": "https://apnews.com/d5ac01c9f4209691ddcd7a1b5c78353e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d256e5d5d9b4d91a894d277250e03e0/1592.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Paul Reubens, the actor and comedian whose Pee-wee Herman character — an overgrown child with a tight gray suit and an unforgettable laugh — became a 1980s pop cultural phenomenon, has died at 70.",
      "publishedAt": "2023-07-31T17:28:27Z",
      "title": "Pee-wee Herman actor and creator Paul Reubens dies from cancer at 70",
      "url": "https://apnews.com/616484f62a62c4ac3e0cc46b02376dd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fb03288d0ab40b2a73d4d3d22008163/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — President Joe Biden has decided to keep U.S. Space Command headquarters in Colorado, overturning a last-ditch decision by the Trump administration to move it to Alabama.",
      "publishedAt": "2023-07-31T19:39:32Z",
      "title": "Biden decides to keep Space Command in Colorado, rejecting move to Alabama",
      "url": "https://apnews.com/382b12b57733848fd1d083227aefa0bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/949986ddfa0c4fb0b290073f01c89027/3000.jpeg"
    },
    {
      "author": "ANWARULLAH KHAN and RIAZ KHAN",
      "description": "KHAR, Pakistan (AP) — An Afghan branch of the Islamic State group on Monday claimed responsibility for a suicide bombing in Pakistan that killed at least 54 people at a pro-Taliban party's election rally, in one of the region's worst attacks in recent years.",
      "publishedAt": "2023-07-31T07:19:03Z",
      "title": "IS claims responsibility for the bombing that killed 54 at a pro-Taliban election rally in Pakistan",
      "url": "https://apnews.com/21bc29f3d7c3e75cd5ea9ade1d8d0cd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fff1d2c6cc94923befd62eeece4bdea/1920.jpeg"
    },
    {
      "author": "JENNA FRYER",
      "description": "AUCKLAND, New Zealand (AP) — The United States arrived at the Women's World Cup as the favorite to win an unprecedented third consecutive title.",
      "publishedAt": "2023-07-31T07:24:51Z",
      "title": "US needs win or draw to avoid risk of elimination in group play for first time in Women's World Cup",
      "url": "https://apnews.com/c05d2dbd0ad73f1afef8b318be27edc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b87a4971c1db4e9ab5cbb29096e01f96/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}