{
  "articles": [
    {
      "author": "ZEKE MILLER, WILL WEISSERT and DARLENE SUPERVILLE",
      "description": "CHICAGO (AP) — Kamala Harris summoned Americans on Thursday to reject political division and instead chart what she called a “new way forward,” as she accepted her party’s nomination while blending biography with warnings about electing Donald Trump again to the White House.",
      "publishedAt": "2024-08-22T10:31:04Z",
      "title": "Harris summons Americans to reject political divisions, warns of consequences posed by a Trump win",
      "url": "https://apnews.com/807cf9d4a609a18ceaa9eee9c9422af5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16f203ea5f9f49a0bf996257a2c33e70/3000.jpeg"
    },
    {
      "author": "JOSH BOAK, BRIAN SLODYSKO and NICHOLAS RICCARDI",
      "description": "CHICAGO (AP) — Vice President Kamala Harris urged Americans to seize a “precious, fleeting opportunity” to move beyond political divisions and the threat of Republican Donald Trump on Thursday as she closed out the Democratic National Convention.",
      "publishedAt": "2024-08-23T01:11:23Z",
      "title": "Harris' big moment, Dems' rising stars, Gaza protesters shut out. Takeaways from DNC's last night",
      "url": "https://apnews.com/76e14a4c02743ba7340e8e352ccb43cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a73d9e6173f41bfb75a819ead5a002d/2932.jpeg"
    },
    {
      "author": "STEVE PEOPLES and ZEKE MILLER",
      "description": "CHICAGO (AP) — Over and over, from the massive stage in the electric convention hall, the Democrats this week predicted Kamala Harris would defeat Donald Trump.",
      "publishedAt": "2024-08-23T05:05:41Z",
      "title": "The 'joyful' Democratic convention is over. The real test for Kamala Harris' campaign now begins",
      "url": "https://apnews.com/7846ddab4b7bd64d38e255285e6649d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e039ea9e486454ea2fbe7c8125ceb92/2296.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration will send about $125 million in new military aid to Ukraine, U.S. officials said Thursday, even as Washington works to get a better understanding of Kyiv's incursion into Russia and how it advances the broader battlefield goals more than two years into the war.",
      "publishedAt": "2024-08-22T20:57:26Z",
      "title": "The US is sending $125 million in new military aid to Ukraine, officials say",
      "url": "https://apnews.com/4ca7ba2bb2da155d8038c0376da80ab1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/246d525f547e479193e90c580f0c3c38/3000.jpeg"
    },
    {
      "author": "GLENN GAMBOA and THALIA BEATY",
      "description": "NEW YORK (AP) — Forward Through Ferguson has made its mark on its community and the St. Louis region by focusing on justice and education, racial equity and policing reform.The Missouri nonprofit was founded in 2015 to enact the societal changes outlined in the Ferguson Commission report to address the issues that contributed to the police shooting death of Michael Brown Jr. and the riots that followed in Ferguson, Missouri.",
      "publishedAt": "2024-08-23T04:06:00Z",
      "title": "With their massive resources, corporations could be champions of racial equity but often waiver",
      "url": "https://apnews.com/c8915d2070cbb9b7679471bef49575cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21984f0c50e046e3b466639c2f4a5b16/3000.jpeg"
    },
    {
      "author": "MATT BROWN and AARON MORRISON",
      "description": "CHICAGO (AP) — Vice President Kamala Harris, on the night she became the first woman of Black and South Asian heritage to be a major party’s presidential nominee, didn't explicitly mention the racial and gender firsts she would set if elected to the White House.",
      "publishedAt": "2024-08-23T05:18:49Z",
      "title": "Kamala Harris' racial and cultural firsts were onstage throughout the Democratic convention",
      "url": "https://apnews.com/e6541b4c6573ebbe5e8a0a3d433ee1c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cdc12da1ab64ae0ad1ad9719321e9ab/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and ALI SWENSON",
      "description": "PHOENIX (AP) — Robert F. Kennedy Jr. withdrew from the ballot in Arizona late Thursday, a day before he and Donald Trump were set to appear miles apart in the Phoenix area as speculation grows that Kennedy could drop his independent presidential bid and endorse the Republican nominee.",
      "publishedAt": "2024-08-23T03:29:03Z",
      "title": "RFK Jr. withdraws from Arizona ballot as questions swirl around a possible alliance with Trump",
      "url": "https://apnews.com/a2638f89ddcb5de03edbe4574ca17d45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a367145c131f4bf987a77dd624502f5b/3000.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "WILLIAMSBURG, Va. (AP) — Archaeologists in Virginia are uncovering one of colonial America's most lavish displays of opulence: An ornamental garden where a wealthy politician and enslaved gardeners grew exotic plants from around the world.",
      "publishedAt": "2024-08-23T05:08:43Z",
      "title": "Archaeologists in Virginia unearth colonial-era garden with clues about its enslaved gardeners",
      "url": "https://apnews.com/47b441d5fb5b917ac15f10fc5fc1ccf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2f24a253e6c4c78aab1f5c93e22c5b9/3000.jpeg"
    },
    {
      "author": "MARCO DI MARCO and DAVID KEYTON",
      "description": "GRINDAVIK, Iceland (AP) — A volcano in southwestern Iceland erupted Thursday evening for the sixth time since December, spewing red lava through a new fissure on the Reykjanes Peninsula.The eruption began shortly after 9 p.m.",
      "publishedAt": "2024-08-23T03:42:57Z",
      "title": "An Iceland volcano erupts again but spares the nearby town of Grindavik for now",
      "url": "https://apnews.com/a2f46d6985d57fd2d9a0071efc58ace3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe81e6592933449c99c51128ca916529/1919.jpeg"
    },
    {
      "author": "STEPHEN McGRATH and NICOLAE DUMITRACHE",
      "description": "BUCHAREST, Romania (AP) — A court in Romania's capital Thursday placed the divisive internet influencer Andrew Tate under house arrest for 30 days, as prosecutors investigate a sprawling new case that involves allegations of human trafficking of minors and sex with a minor.",
      "publishedAt": "2024-08-22T18:12:50Z",
      "title": "Andrew Tate placed under house arrest as new human trafficking allegations emerge involving minors",
      "url": "https://apnews.com/197b1345b2ebdcb56c1ad58c48dd023c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d8e9189ac6b484c87cd986e0ea8da8d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}