{
  "articles": [
    {
      "author": null,
      "description": "New York City Mayor Eric Adams says that a gunman who killed four people at a Manhattan office building was trying to target the headquarters of the National Football League but took the wrong elevator. Investigators believe Shane Tamura was trying to get to the NFL offices after shooting several people in the building’s lobby but accidentally entered the wrong set of elevator banks, Adams said in interviews on Tuesday. Four people, including an off-duty New York City police officer, were killed. Police said Tamura had a history of mental illness, and a rambling note found on his body suggested he had a grievance against the NFL over an unsubstantiated claim that he suffered from chronic traumatic encephalopathy.",
      "publishedAt": "2025-07-29T12:03:59Z",
      "title": "Mayor says gunman was targeting NFL headquarters",
      "url": "https://apnews.com/article/manhattan-office-shooting-nfl-nyc-d32bec88dfe208af1a413cec02034a14",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f74fd7/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fd8%2F03c95569b23a779fd0dc5317846c%2Fa6d9a72b23d742b6a0431189d2528ed4"
    },
    {
      "author": null,
      "description": "An off-duty New York City police officer and an executive at an investment firm were among four people killed by a gunman at a Manhattan office tower. The officer, Didarul Islam, was working a corporate security detail at the midtown skyscraper that is home to the headquarters of both the NFL and Blackstone, one of the world’s largest investment firms. Blackstone has confirmed senior managing director Wesley LePatner was fatally shot. NFL Commissioner Roger Goodell said a worker at the league's office was seriously wounded. A labor union identified a security officer killed in the shooting as Aland Etienne. Authorities haven’t identified the other person killed in the attack.",
      "publishedAt": "2025-07-29T16:16:38Z",
      "title": "A police officer and investment firm executive are among New York City shooting victims",
      "url": "https://apnews.com/article/victims-office-shooting-new-york-nfl-2869b5bb31e6480dc2c20175d270ad88",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a7d2d1/2147483647/strip/true/crop/8439x4747+0+440/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F11%2Fa603361617cafadf8ed20928b33a%2Fabaf280eae9342eba2e2f02a86f82ed4"
    },
    {
      "author": null,
      "description": "President Donald Trump’s administration has proposed revoking a scientific finding that's long been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change. The proposed Environmental Protection Agency rule rescinds a 2009 declaration that determined carbon dioxide and other greenhouse gases endanger public health. The “endangerment finding” is the legal underpinning of a host of climate regulations under the Clean Air Act for motor vehicles, power plants and other pollution sources. EPA Administrator Lee Zeldin announced the proposed rule change on a podcast ahead of an official announcement set for Tuesday in Indiana. Three former EPA leaders say Zeldin's proposal would endanger the lives of millions of Americans.",
      "publishedAt": "2025-07-29T14:53:19Z",
      "title": "Trump EPA moves to repeal landmark finding that allows climate regulation",
      "url": "https://apnews.com/article/trump-climate-epa-endangerment-zeldin-5cba0871c880e23d044ef40a398c57b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e21f695/2147483647/strip/true/crop/3644x2050+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2Fce%2F34e47d39cb0c0ba16dffaa8ad59c%2F4335cd6c681e40f6adec69ed6e217b1d"
    },
    {
      "author": null,
      "description": "The leading international authority on food crises said in a new alert that the “worst-case scenario of famine is currently playing out in the Gaza Strip,” and “widespread death” will occur without immediate action. Tuesday's alert, still short of a formal famine declaration, follows an outcry over images of emaciated children in Gaza after nearly 22 months of war. The Integrated Food Security Phase Classification, or IPC, said Gaza has teetered on the brink of famine for two years, but recent developments have “dramatically worsened” the situation, including “increasingly stringent blockades” by Israel.",
      "publishedAt": "2025-07-29T08:03:03Z",
      "title": "Food crisis experts say 'worst-case scenario of famine' is happening in Gaza",
      "url": "https://apnews.com/article/mideast-wars-gaza-famine-israel-warning-d14ca629a68f7bdefe9c2fcc67d62224",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c5cfbf/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F70%2F5bcd6bc702191bafaa465613c18a%2F4e09f4354e3f4fb2a4b7a2ac7ee4a87d"
    },
    {
      "author": null,
      "description": "Over 60,000 Palestinians have been killed in the 21-month Israel-Hamas war, according to Gaza’s Health Ministry. The ministry's statement on Tuesday did not say how many were civilians or militants, but has said women and children make up around half the dead. The ministry, part of the Hamas-run government, said the latest death toll had risen to 60,034, with 145,870 people wounded since Hamas’ Oct. 7, 2023, attack. Israel’s offensive has destroyed vast areas of Gaza, displaced around 90% of the population and caused to a catastrophic humanitarian crisis, with experts warning of famine.",
      "publishedAt": "2025-07-29T10:10:16Z",
      "title": "Over 60,000 Palestinians have died in the 21-month Israel-Hamas war, Gaza’s Health Ministry says",
      "url": "https://apnews.com/article/palestinians-death-toll-war-health-ministry-816d592952814db869924f9626ca8876",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5e8829/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F3c%2F6970bdf41dba05f97eeb92d77a84%2F48efc724951e43cda13ced6bbc5b9de8"
    },
    {
      "author": null,
      "description": "Russian glide bombs and missiles have struck a Ukrainian prison and a medical facility, killing at least 22 people. Officials reported the attacks on Tuesday. A Russian airstrike on a prison in the Zaporizhzhia region killed at least 17 inmates and wounded more than 80 others. In the Dnipro region, authorities reported at least four people were killed and eight injured. This comes as U.S. President Donald Trump has threatened Russia with sanctions unless it stops its bombardment of civilian areas. The Kremlin has warned against ultimatums, framing the conflict as a geopolitical confrontation with the West.",
      "publishedAt": "2025-07-29T07:06:43Z",
      "title": "Russia kills 22 in Ukraine attacks despite Trump threat",
      "url": "https://apnews.com/article/russia-ukraine-war-prison-zaporizhzhia-feb6039758a0ee9bb21e1dab986c20b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a337e5/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2Fdb%2Fe943a384f972ed0665160e189221%2F13e7c044aa5743e5b040d214e6d00471"
    },
    {
      "author": null,
      "description": "A new analysis suggests President Donald Trump's tariffs could increase factory costs by 2% to 4.5%. The analysis highlights potential challenges for domestic manufacturers relying on global supply chains just as the Republican president prepares to announce tariff hikes he says will boost the U.S. economy. While the U.S. stock market shows relief tariffs aren't as high as initially threatened, concerns remain about higher prices and slower growth. Tuesday's analysis by the Washington Center for Equitable Growth warns of economic and political costs, especially in swing states with significant manufacturing sectors, like Michigan and Wisconsin.",
      "publishedAt": "2025-07-29T10:52:09Z",
      "title": "Trump tariffs could increase factory costs by up to 4.5%: analysis",
      "url": "https://apnews.com/article/trump-tariffs-factory-costs-manufacturing-4c928842b57c7f36db9d5ca26a84108b",
      "urlToImage": "https://dims.apnews.com/dims4/default/8e55789/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F2a%2Ffd11dea037a3c9470efd3366fa8f%2Fce049f6f3afa475eab8b4704a73006d3"
    },
    {
      "author": null,
      "description": "The number of millionaires in the United States is soaring. A report from Swiss bank UBS finds about 1 in 10 American adults now has a net worth of at least $1 million, with 1,000 new millionaires added every day last year. That milestone, once reserved for celebrities and CEOs, is increasingly being reached by everyday Americans, thanks to rising home values, stock market gains and decades of retirement savings. With inflation, a million bucks no longer stretches as far as it once did, and many millionaires' wealth is tied up in houses and 401(k)s. But seven-figure status still holds symbolic weight. As one man who hit the mark put it, “It’s not a golden ticket like it was in the past\" but it buys “peace of mind.”",
      "publishedAt": "2025-07-29T09:00:06Z",
      "title": "1 in 10 Americans now millionaires, but the status loses some luster",
      "url": "https://apnews.com/article/wealth-retirement-millionaire-stocks-homes-inflation-8bc8bf04552feac2625afd6752faa29e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a05b32e/2147483647/strip/true/crop/5220x2936+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2F3c%2F00547059e2509a9f8746ee3bbfca%2F44b869583f1148ef8a72c3759361a6cd"
    },
    {
      "author": null,
      "description": "U.S. health officials are cracking down on an opioid-related ingredient being added to drinks, supplements and other products. The FDA said Tuesday it will recommend that the ingredient be banned under federal law. The substance is a component of kratom, a plant native to Southeast Asia that has gained popularity in the U.S. as an unapproved treatment for pain, anxiety and drug dependence. For months, dietary supplement companies that sell kratom have been urging a crackdown on products containing the ingredient. The companies say it is a dangerous, concentrated form of the chemical found in original kratom.",
      "publishedAt": "2025-07-29T15:32:48Z",
      "title": "US health officials crack down on kratom-related products after complaints from supplement industry",
      "url": "https://apnews.com/article/kennedy-hhs-kratom-978e5beb6e3067f6bcf1ee45ec16372a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0680b3/2147483647/strip/true/crop/3000x1688+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F95%2F5e279e532371e5b9df4121a8c7a0%2Fe1fb9c36c91b43b8b092111131d3da9e"
    },
    {
      "author": null,
      "description": "Two weeks after spending the Fourth of July on a popular South Carolina lake, 12-year-old Jaysen Carr died from a brain-eating amoeba that was living in the warm water. The amoeba entered his brain through his nose, possibly when he jumped into Lake Murray, near Columbia. A doctor delivered the diagnosis after Jaysen’s headache and nausea worsened. He fought for a week before dying on July 18. Like many other states, South Carolina has no law requiring public reporting of such deaths. The lake remains open, with no water testing conducted. Jaysen’s parents want to raise awareness and try to prevent anyone else from losing a child.",
      "publishedAt": "2025-07-29T16:54:28Z",
      "title": "South Carolina boy dies from brain-eating amoeba at popular Lake Murray",
      "url": "https://apnews.com/article/brain-eating-amoeba-death-south-carolina-lake-f61a5f97384fed3c366508382be94d45",
      "urlToImage": "https://dims.apnews.com/dims4/default/b1ec1bd/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2Fca%2F4d4a437c366649db10699c235ed4%2Fc83e2895bc76464b9aa7bf4837d5d24b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}