{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — Donald Trump's defense attorney says the former president never asked Mike Pence to overturn the will of the voters in the 2020 election, but only wanted the former vice president to “pause” the certification of votes to allow states to investigate his claims of election fraud.",
      "publishedAt": "2023-08-06T17:07:23Z",
      "title": "Pence, Trump attorney clash over what Trump told his VP ahead of Jan. 6, 2021",
      "url": "https://apnews.com/ca1f049328ad8f240c6bf72cce97026e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f160755b23784f1b9b27d5b06bae9cc9/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "CEDAR RAPIDS, Iowa (AP) — Few even mentioned his name, and the new federal indictment he faces was completely ignored, as Republican candidates for president tried in Iowa Sunday to present themselves as Donald Trump alternatives.",
      "publishedAt": "2023-08-07T01:54:33Z",
      "title": "Indictment ignored, Trump barely a mention, as GOP candidates pitch Iowa voters to challenge him",
      "url": "https://apnews.com/7301ecf815a01f7459481b4e14743c90",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/edb06a9589c74df2a15c73e79d0978d9/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — His social media accounts suggest that Prime Minister Narendra Modi is launching high-speed trains and rubbing shoulders with foreign leaders as a powerhouse on the global stage and the face of an ascendant India.",
      "publishedAt": "2023-08-07T04:13:22Z",
      "title": "India's Modi faces a no-confidence vote over silence on ethnic violence tearing at remote Manipur",
      "url": "https://apnews.com/0477352c82171e79137066169c033e36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c66d10d3a574df88cb2032f45efa742/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "Word spread through an Oregon hospital last month that a visitor was causing trouble in the maternity ward, and nurses were warned the man might try to abduct his partner's newborn.Hours later, the visitor opened fire, killing a security guard and sending patients, nurses and doctors scrambling for cover.",
      "publishedAt": "2023-08-07T04:22:13Z",
      "title": "Attacks at US medical centers show why health care is one of the nation's most violent fields",
      "url": "https://apnews.com/aa6918569ff8f76ff8a15b9813e31686",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/762ff4c332a1461faec143ceaf8d1cfb/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "Two conservative groups are asking a federal court to block the Biden administration's plan to cancel $39 billion in student loans for more than 800,000 borrowers.In a lawsuit filed Friday in Michigan, the groups argue that the administration overstepped its power when it announced the forgiveness in July, just weeks after the Supreme Court struck down a broader cancellation plan pushed by President Joe Biden.",
      "publishedAt": "2023-08-06T17:35:28Z",
      "title": "Conservative groups sue to block Biden plan canceling $39 billion in student loans",
      "url": "https://apnews.com/73327bbcb47dba6aec0c686f44bc2ab4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a41068ffec34cd8a08bab5b942f25f8/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ABOARD THE PAPAL PLANE (AP) — Pope Francis said Sunday his recovery from his latest abdominal surgery is going well and stressed that he ditched speeches during his five-day trip to Portugal and spoke off-the-cuff not because he was tired or feeling unwell, but to better communicate with young people.",
      "publishedAt": "2023-08-06T20:51:45Z",
      "title": "Pope discusses health, his ditched peace prayer in Fatima and LGBTQ+ Catholics in airborne briefing",
      "url": "https://apnews.com/b72bb8a3ce41ef6e5ab8e045dbd63930",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b499338e29542fbb585dfd0351286c3/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — The U.S. government’s most ambitious plan ever to slash planet-warming greenhouse gas emissions from passenger vehicles faces skepticism both about how realistic it is and whether it goes far enough.",
      "publishedAt": "2023-08-06T14:02:17Z",
      "title": "The EPA's ambitious plan to cut auto emissions to slow climate change runs into skepticism",
      "url": "https://apnews.com/306783df62bd2a2af0ad0f8e0b0bb121",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11b79ac4fb1b4a81bad387dde2904ed4/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "JACKSON, Miss. (AP) — Monica Lee sat outside her parents' home, where a former Mississippi sheriff’s deputy pummeled her son, who died hours later in the hospital.It was a sweltering afternoon in Braxton — the same town where, in a separate episode, six white law enforcement officers tortured two other Black men in January, shaking seasoned federal prosecutors, elected officials and ordinary people to their core.",
      "publishedAt": "2023-08-06T04:03:18Z",
      "title": "Racist abuse by Mississippi officers reveals a culture of misconduct, residents say",
      "url": "https://apnews.com/1feb54483e62bef53efe1a1a16be29f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63885d539f6b41f3a630dd30bd538bd2/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russia unleashed a missile and drone barrage Sunday across parts of Ukraine that killed six people, Kyiv officials said, as Moscow followed through on its promise to retaliate for an attack on a Russian tanker.",
      "publishedAt": "2023-08-06T09:43:01Z",
      "title": "Russia unleashes missile and drone strikes against Ukraine, retaliating for an attack on a tanker",
      "url": "https://apnews.com/9afba9271d343cd7f077211ff8507b88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/415ca711906b485aae285344d4826a2c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}