{
  "articles": [
    {
      "author": "EBRAHIM NOROOZI, CHRIS STERN and GEIR MOULSON",
      "description": "MAGDEBURG, Germany (AP) — A car plowed into a busy outdoor Christmas market in the eastern German city of Magdeburg on Friday, killing at least two people and injuring at least 60 others in what authorities believe was an attack.",
      "publishedAt": "2024-12-20T19:02:06Z",
      "title": "At least 2 dead and 60 hurt after a car drives into a German Christmas market in a suspected attack",
      "url": "https://apnews.com/6b2bcf305eb9f60f8d7273949dbba4c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7db2fad69ced4c9eb4e47bf83769d7ec/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and MATT BROWN",
      "description": "WASHINGTON (AP) — Hours to go before a midnight government shutdown, the House was voting late Friday on a new plan from House Speaker Mike Johnson that would temporarily fund federal operations and disaster aid, but drops President-elect Donald Trump's demands for a debt limit increase into the new year.",
      "publishedAt": "2024-12-20T15:21:15Z",
      "title": "House sets up vote to prevent government shutdown, dropping Trump's demand for debt limit",
      "url": "https://apnews.com/da117337aa0c0adab34a5626bb5816af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21004e7b772f4d05bbdf2c5ff6e2bfd3/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WEST PALM BEACH, Fla. (AP) — The smooth economy that Donald Trump was poised to inherit suddenly looks a bit rockier — with critics saying the president-elect is contributing to the uncertainty.The Dow Jones stock index essentially ended Thursday flat after having posted 10 days of losses.",
      "publishedAt": "2024-12-20T12:00:54Z",
      "title": "Trump was poised to inherit a strong economy. Then things got rocky and he added to the uncertainty",
      "url": "https://apnews.com/73d12a23ca26bb02883e6194a957affe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5422a809f4134241a5d8a1003fde56a7/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "CAIRO (AP) — Even with hopes running high, so much can go wrong when a country ousts a longtime dictator and tries to start anew. The Middle Eastern and North African nations that attempted to transition to democracy in recent years can attest to that.",
      "publishedAt": "2024-12-20T17:29:10Z",
      "title": "What will Syria's future look like? The answer could lie in other Arab countries' recent pasts",
      "url": "https://apnews.com/51635b7aabc0760bb7841829586ede7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4db51c2ee1df4390a891953e4f3565d4/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and MATTHEW LEE",
      "description": "DAMASCUS, Syria (AP) — The Biden administration said Friday it has decided not to pursue a $10 million reward it had offered for the capture of a Syrian rebel leader whose forces led the ouster of President Bashar Assad earlier this month.",
      "publishedAt": "2024-12-20T05:33:13Z",
      "title": "US drops $10M terrorism bounty offered for capture of Syrian rebel leader who ousted Assad",
      "url": "https://apnews.com/de71dc4920d4677fcfb2d31a2b6e6e54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7ed86d89a8742d8a30f9194bbfab4d2/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — The man accused of gunning down United Healthcare’s CEO outside a Manhattan hotel is now jailed in New York, awaiting arraignment Monday on a state murder indictment after he was returned to the city in dramatic fashion to face charges in multiple courts.",
      "publishedAt": "2024-12-20T20:09:57Z",
      "title": "What’s next for the man charged with killing UnitedHealthcare’s CEO?",
      "url": "https://apnews.com/4cc18cfa71b96aaa39b321f60145d2f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a816f4330f5647a89e4d83cba7320f04/2048.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau's chances of staying on in power have become more tenuous after the opposition party that backed his government for years announced it will vote no confidence in the government when Parliament resumes.",
      "publishedAt": "2024-12-20T14:49:03Z",
      "title": "Canada's Trudeau reshuffles his Cabinet as resignation calls mount and new election threat looms",
      "url": "https://apnews.com/1f222c037bbe7d1e8d68845f91d76417",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34feb7c1ce344a1f861dc2f6f3cbec99/3000.jpeg"
    },
    {
      "author": "TOM NOUVIAN and SAMUEL PETREQUIN",
      "description": "PARIS (AP) — France’s anti-terrorism court on Friday convicted eight people of involvement in the beheading of teacher Samuel Paty outside his school near Paris four years ago, a horrific death that shocked the country.",
      "publishedAt": "2024-12-20T10:05:19Z",
      "title": "France's anti-terrorism court convicts 8 people of involvement in the 2020 beheading of a teacher",
      "url": "https://apnews.com/c03c4c29bef324fbe6dc3095a425ba9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bf6ede8c51b43eab7a3a8b03d8d1daa/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — The U.S. flu season is underway, with cases surging across much of the country, health officials said Friday.",
      "publishedAt": "2024-12-20T17:34:56Z",
      "title": "US flu season is underway, as cases surge in some areas and vaccinations lag",
      "url": "https://apnews.com/1d44ab79d0c3172981397a62767680be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95c9975d2e134ccb83c748d0b81bf313/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Drivers and airline passengers without reindeer and sleighs better make a dash for it: it's beginning to look like another record for holiday travel in the U.S.",
      "publishedAt": "2024-12-20T05:10:27Z",
      "title": "It's beginning to look like another record for holiday travel",
      "url": "https://apnews.com/02023bc4a9975d5bb0ac0aedbbaedeb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/031c841181e64db58ca3682e8f3d8a44/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}