{
  "articles": [
    {
      "author": "Steve Douglas, Brian Melley",
      "description": "Police in Liverpool say a driver has been arrested after a vehicle plowed into a crowd of people celebrating the city soccer team’s Premier League championship. Merseyside Police said they were investigating reports that multiple pedestrians were hit late Monday. A car was stopped and a man was arrested. It came as trophy parades in English soccer were held in Liverpool and London.",
      "publishedAt": "2025-05-26T12:41:59Z",
      "title": "Driver arrested after car plows into celebrating Liverpool fans",
      "url": "https://apnews.com/article/liverpool-crystal-palace-arsenal-women-trophy-parade-b2929e5981eeff72e074bf9c901a0bc5",
      "urlToImage": "https://dims.apnews.com/dims4/default/568c586/2147483647/strip/true/crop/3500x1969+0+262/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2Fde%2Ffe5bfd2ede2f41b99886ba10f460%2F3efa714096cd4f3e8e04fbb3a160fd81"
    },
    {
      "author": "Seung Min Kim",
      "description": "President Donald Trump is set to deliver remarks at Arlington National Cemetery to commemorate Memorial Day. Trump on Monday placed a wreath at the Tomb of the Unknown Soldier, a somber tradition for U.S. presidents. Vice President JD Vance and Defense Secretary Pete Hegseth joined him. Trump began the day with a decidedly different tone. In an all-caps social media message, Trump ranted at former President Joe Biden, calling him the “SCUM THAT SPENT THE LAST FOUR YEARS TRYING TO DESTROY OUR COUNTRY.\" Trump also went after federal judges who have blocked efforts to enact his mass deportation agenda.",
      "publishedAt": "2025-05-26T14:10:46Z",
      "title": "Trump speaking at Arlington on Memorial Day",
      "url": "https://apnews.com/article/donald-trump-arlington-memorial-day-eeb602e8b4521ba2b7c79d2447dfefab",
      "urlToImage": "https://dims.apnews.com/dims4/default/d23f9cb/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F37%2F344c62d8bc49f4eb1d4a9d2e3c8a%2F5cc9c6a1f7b74bb1a24a0869a4f4d4db"
    },
    {
      "author": null,
      "description": "Ukrainian officials say that a massive Russian drone-and-missile attack targeted the country for a second consecutive night, killing at least twelve people and injuring dozens. The attack early on Sunday came on the third day of a planned prisoner swap between Russia and Ukraine, the only tangible outcome from peace talks in Istanbul earlier this month which have so far failed to produce a ceasefire. Ukraine’s President Volodymyr Zelenskyy and Russia’s defense ministry said each side brought home 307 more soldiers on Saturday, a day after each released a total of 390 combatants and civilians. Further releases were expected on Sunday.",
      "publishedAt": "2025-05-25T05:24:51Z",
      "title": "A massive Russian drone-and-missile attack on Ukraine kills at least 12",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-dbefc3d0a83826c865908aa29dd40f93",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ef8ea2/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fd9%2Fd3ab0a5e78158586ab83c2e6968d%2Faff05b9e9af543d78d9f71004eb1165b"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "An Israeli strike on a school-turned-shelter in the Gaza Strip has killed at least 25 people, mostly women and children, according to the territory’s Health Ministry. The strike on the school in northern Gaza also wounded more than 55 people, said Fahmy Awad, head of the ministry’s emergency service. He said the school was hit three times while people slept, setting their belongings ablaze. Footage circulating online showed rescuers struggling to extinguish fires and recovering charred remains. There was no immediate comment from the Israeli military.",
      "publishedAt": "2025-05-26T05:12:35Z",
      "title": "Israeli strike on school-turned-shelter in Gaza kills 25, medics say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-26-2025-6a7285f144a3619e8239138e6883b3b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6f342/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ff1%2F01784acd98fe5fbb6381bbc362f0%2F419377a7ba8643cb87ee439505810f17"
    },
    {
      "author": "Steve Karnowski",
      "description": "Minneapolis has changed, slowly, since a city police officer murdered George Floyd on Memorial Day in 2020. The city is still struggling to decide what should become of the intersection where Floyd met his demise, which has become a place of pilgrimage known as George Floyd Square. City leaders have not agreed on whether to close the intersection to all traffic as a permanent memorial. Minneapolis has also begun a remake of its police department under court supervision — an effort that the mayor and police chief say will continue with or without the backing of the Trump administration.",
      "publishedAt": "2025-05-26T05:28:17Z",
      "title": "5 years since George Floyd's death, how has Minneapolis evolved?",
      "url": "https://apnews.com/article/george-floyd-murder-anniversary-minneapolis-11871dabb9736de7216d61f1c2e95e51",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0bf816/2147483647/strip/true/crop/8093x4552+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2Fd2%2Fb245b684692751c28efcde1bbe1c%2F85f28f2caad043f495a583c80ca9ca23"
    },
    {
      "author": null,
      "description": "Former Democratic US Rep. Charles Rangel of New York has died at age 94. The family confirmed the death in a statement provide dby City College of New York spokesperson Michelle Stent. He died at a hospital in New York, Stent said. Rangel was a veteran of the Korean War and spent nearly five decades on Capitol Hill. He was also a founding member of the Congressional Black Caucus.",
      "publishedAt": "2025-05-26T15:28:19Z",
      "title": "Former US Rep. Charles Rangel of New York has died at age 94",
      "url": "https://apnews.com/article/charles-rangel-dies-9902b608e33aeb7db30478be00a77acc",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Rob Gillies",
      "description": "King Charles III is to arrive in Ottawa on a visit that underscores Canada’s sovereignty to U.S. President Donald Trump. Trump’s repeated suggestion that the U.S. annex its northern neighbor prompted Prime Minister Mark Carney to invite Charles to give the speech from the throne that will outline his government’s agenda for the new Parliament. The king is the head of state in Canada, which is a member of the British Commonwealth of former colonies. Canadians are largely indifferent to the monarchy, but Carney has been eager to show the differences between Canada and the United States. He said the king’s visit clearly underscores the sovereignty of Canada.",
      "publishedAt": "2025-05-26T04:07:21Z",
      "title": "King Charles III's visit to Canada underscores its sovereignty to Trump",
      "url": "https://apnews.com/article/king-charles-canada-carney-trump-parliament-speech-cfb17691de077f3a3677fe377666ace7",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b820a3/2147483647/strip/true/crop/4902x2757+0+438/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Fb2%2F948e490e8e79af965bb11ab34764%2Ff2b20c966a3540808b50b7ee4ed40079"
    },
    {
      "author": "Meg Kinnard, Adriana Gomez Licon",
      "description": "Four months into the Trump administration, some top Democrats are rethinking their approach to podcasts. Some high-profile politicians with 2028 aspirations are starting their own shows or venturing more into popular ones with already large audiences. Taking a reflective look back at their opponent’s strategy, Democratic strategists point out that Trump used podcasts to take his message to new audiences, and hope that their party’s next round of candidates can successfully do the same.",
      "publishedAt": "2025-05-26T12:47:00Z",
      "title": "The Democrats' 2028 podcast primary is underway",
      "url": "https://apnews.com/article/podcasts-democrats-newsom-beshear-buttigieg-c20ac32a80b1f74523f8f2a7918689d8",
      "urlToImage": "https://dims.apnews.com/dims4/default/fbd5567/2147483647/strip/true/crop/5568x3132+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F12%2F0aee237b31099b096c275d7f42d2%2F78a2e7dec4dd4ffc887d529fdc326dd3"
    },
    {
      "author": "The Associated Press",
      "description": "In what had long been celebrated every May 30 to honor America’s fallen soldiers, Memorial Day officially became a federal holiday in 1971, observed on the last Monday in May. Businesses increasingly have chosen to stay open on the holiday, leading to what is now one of the biggest retail sales and travel weekends of the year. Government offices, post offices and schools are closed, as is the stock market, banks and a handful of businesses. The vast majority of retailers will be open, with many trying to lure customers with big promotional sales.",
      "publishedAt": "2025-05-25T13:51:06Z",
      "title": "What's open and closed on Memorial Day?",
      "url": "https://apnews.com/article/memorial-day-2025-stores-open-closed-217c9b4b29bcfd58f0f825ba549a4d1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c177ba/2147483647/strip/true/crop/2038x1146+0+106/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F13%2F4ea0709690e713d23a452a907b80%2F892dd88881ba448daaa5aa2c5c9d7fd5"
    },
    {
      "author": null,
      "description": "Phil Robertson of Duck Dynasty has died. He was 79. Robertson's daughter-in-law announced his death Sunday on Facebook. They said in December he had been diagnosed with Alzheimer’s disease. Robertson turned his small duck calling interest in the sportsman’s paradise of northern Louisiana into a big business and conservative cultural phenomenon. Duck Dynasty followed Robertson, his brother and his sons in a reality show presented like a sitcom. They were immediately recognizable by their long beards and their conservative, Christian and family-oriented beliefs.",
      "publishedAt": "2025-05-26T15:18:57Z",
      "title": "Duck Dynasty patriarch and conservative cultural icon Phil Robertson dies",
      "url": "https://apnews.com/article/obit-phil-robertson-duck-dynasy-47f156dcabdf2ba0a9fa927a5457d510",
      "urlToImage": "https://dims.apnews.com/dims4/default/a383a03/2147483647/strip/true/crop/3632x2043+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F08%2Fa28327543e0c58703b0c2c185380%2Fa51ddc6f634447e88047848abeee6e7a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}