{
  "articles": [
    {
      "author": "WAFAA SHURAFA and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — At least 39 people were killed by Israeli air strikes across northern Gaza on Saturday, according to Palestinian and hospital officials.Fadel Naem, director of the al-Ahli Hospital in Gaza City, told The Associated Press that more than three dozen bodies arrived at the hospital.",
      "publishedAt": "2024-06-22T07:56:53Z",
      "title": "At least 39 people killed in Israeli strikes across northern Gaza, officials say",
      "url": "https://apnews.com/39d09eccc39a7f225d573c97e73a2917",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28fcf01aa0bc47999268fa26cd869ffd/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An attack by Yemen's Houthi rebels targeted a commercial ship traveling through the Gulf of Aden but apparently caused no damage, authorities said Saturday, in the latest strike on the shipping lane by the group.",
      "publishedAt": "2024-06-22T04:38:14Z",
      "title": "Yemen's Houthi rebels target ship in the Gulf of Aden as the Eisenhower aircraft carrier heads home",
      "url": "https://apnews.com/ffe35adc91e25379c0c6fd420b413099",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05cc162bf78341c9a564bea53a3f6568/3000.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "The governor of Iowa sent helicopters to a small town to evacuate people from flooded homes Saturday, the result of weeks of rain, while much of the United States longed for relief from yet another round of extraordinary heat.",
      "publishedAt": "2024-06-22T16:06:22Z",
      "title": "Helicopters scramble to rescue people in flooded Iowa town while much of US toils again in heat",
      "url": "https://apnews.com/3c96b904f1ccb4725ac856aa450180be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e22358d084d5446e8f3df337cc018bf4/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "ATLANTA (AP) — Republicans and conservative activists have increasingly been targeting an executive order issued three years ago by the Biden administration that is intended to boost voter registration, claiming it's unconstitutional and an attempt to interfere in the November election.",
      "publishedAt": "2024-06-22T04:07:25Z",
      "title": "GOP targets a Biden executive order on voter registration ahead of the fall election",
      "url": "https://apnews.com/efe62f90c25bf25549bc436ecfc47d13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/264aace1cc31481ba3d0dbeb843817ff/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "DOYLESTOWN, Pa. (AP) — Thirty miles north of Philadelphia, upscale subdivisions such as Colonial Commons interrupt dairy farms, centuries-old roadside stone houses and the winding Neshaminy Creek that flows between Doylestown and Newtown.",
      "publishedAt": "2024-06-22T04:06:11Z",
      "title": "Biden and allied Republicans are trying to rally GOP women in swing-state suburbs away from Trump",
      "url": "https://apnews.com/9d1e7276ddc0121a35b768c3b1486510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07fe8ed4d6124e4abc8f5d8ac49b2551/3000.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE",
      "description": "Idaho librarian June Meissner was closing up for the day at the downtown Boise Public Library when a man approached her asking for help. As an information services librarian, answering patrons' questions is part of Meissner’s day-to-day work, and serving the community is one of her favorite parts of the job.",
      "publishedAt": "2024-06-22T13:01:02Z",
      "title": "LGBTQ+ librarians grapple with attacks on books - and on themselves",
      "url": "https://apnews.com/4ac552901f7ab0eca3a9dcf070b24350",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e17bd377ada419d85cb2aea1801ffb6/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — Donald Trump is set to speak Saturday to a group of politically influential evangelicals who fiercely support him but would like to see the presumptive Republican presidential nominee promise to do more to restrict abortion.",
      "publishedAt": "2024-06-22T04:04:03Z",
      "title": "Trump will address influential evangelicals who back him but want to see a national abortion ban",
      "url": "https://apnews.com/042cd25750a43a1f9a474e793c86c0a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/895e8b74ae9b402faecc70bcc721500c/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — A 22-year-old woman who became an abortion rights advocate after she was raped by her stepfather as a child will campaign with first lady Jill Biden in Pennsylvania this weekend as part of a 2024 election push around the anniversary of the fall of Roe v.",
      "publishedAt": "2024-06-22T12:15:35Z",
      "title": "Now an abortion rights advocate, woman raped by stepfather as a child will campaign with first lady",
      "url": "https://apnews.com/5a63638ad0193c2e778ad54c9683ba64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19b603959e7a4e75b91de7560897ccc6/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — A family of six was found dead by rescuers in Fujian province, state media reported Saturday, adding to the extreme weather deaths after downpours caused landslides in the area, even as authorities extended a warning of more severe weather ahead.",
      "publishedAt": "2024-06-22T09:37:58Z",
      "title": "Rescuers find family of 6 dead in landslide in eastern China, as severe weather warning extended",
      "url": "https://apnews.com/38e991e0a3633ce1819c5e018fe652f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6f6d9b33c2c48a294da02d4c54074b7/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY",
      "description": "CAPE TOWN, South Africa (AP) — In a country where racial segregation was once brutally enforced, South Africa's new coalition government has brought a Black president and a white opposition leader together in an image of unity.",
      "publishedAt": "2024-06-22T04:02:04Z",
      "title": "South Africa's new government brings Black and white together. It's also reviving racial tensions",
      "url": "https://apnews.com/7f4ccd58e42c2f211f247287ce0509d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c66f4f26a534f068fd6209d9579ab39/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}