{
  "articles": [
    {
      "author": "Jon Gambrell",
      "description": "Yemen's Houthi rebels say U.S. airstrikes targeting the Ras Isa oil port have killed 20 people and wounded 50 others. The strikes were confirmed by the U.S. military’s Central Command, which did not acknowledge any casualties. The airstrikes represent one of the highest death tolls so far in the campaign launched under President Donald Trump that has involved hundreds of strikes since March 15. Central Command said U.S. forces acted to eliminate fuel for the Houthis and deprive them of illegal revenue.",
      "publishedAt": "2025-04-18T01:21:03Z",
      "title": "US strikes on oil port in Yemen kill 20, Houthi rebels say",
      "url": "https://apnews.com/article/yemen-us-airstrikes-563f61bbd96e1f2de68373fdf76c8811",
      "urlToImage": "https://dims.apnews.com/dims4/default/55a57bd/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F64%2F7202dc2069d1c5e6e7f243dbb0a6%2F44231e4191474113b7476d5342b9fa2c"
    },
    {
      "author": "Michael Kunzelman",
      "description": "A federal appeals court says it is “shocking” that The Trump administration claims it can’t do anything to free Kilmar Abrego Garcia from an El Salvador prison and return him to the U.S. A three-judge panel from the 4th U.S. Circuit Court of Appeals on Thursday unanimously refused to suspend a judge’s decision to order sworn testimony by Trump administration officials to determine if they complied with her instruction to facilitate Abrego Garcia’s return.",
      "publishedAt": "2025-04-17T19:29:41Z",
      "title": "Appeals court calls Trump officials defiance over Abrego Garcia 'shocking'",
      "url": "https://apnews.com/article/abrego-garcia-trump-maryland-el-salvador-2090f0dd508bbc3d2f60845842af27b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/0aca7d1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F26%2F51840e5ed136828d2845c3974d63%2Fa76685c0ca494bb3be86899cd908c3e3"
    },
    {
      "author": "Sara Cline, Kate Brumback",
      "description": "The world's largest immigration detention system is on the cusp of explosive growth as President Donald Trump pursues his signature campaign promise of mass deportations. The deportations represent a potential bonanza for private prison companies and a challenge to the government agencies responsible for the orderly expulsion of immigrants. Some critics say the administration’s plans also include a deliberate attempt to isolate detainees by locking them up and holding court proceedings far from their attorneys and support systems. The Immigration and Customs Enforcement agency is starting to scale up from its current budget for about 41,000 beds to 100,000 beds.",
      "publishedAt": "2025-04-18T04:02:52Z",
      "title": "Trump administration seeks explosive expansion of nation's immigration detention system",
      "url": "https://apnews.com/article/immigration-detention-louisiana-trump-3db72b138d1a6ee8a7bb5388669a1666",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ccabed/2147483647/strip/true/crop/8141x4579+0+424/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F0d%2F1cd9355d08268852337ea35f2967%2F10e1900b38364cb3b3fef25f68154122"
    },
    {
      "author": "Josh Funk",
      "description": "America’s only rare earths mine has fielded calls from anxious companies since China responded to President Donald Trump's tariffs by limiting exports of seven heavy metals. The mine in California can’t meet the U.S. demand for rare earths, which is why Trump is pushing for new mines. Rare earth elements are ingredients in electric vehicles, advanced fighter jets, smartphones and many other products. They aren’t actually rare, but it’s hard to find them in a high enough concentration to make a mine worth the investment. Experts say prices are likely to increase quickly if China extends its import controls but there is likely enough of a stockpile to keep factories operating for now.",
      "publishedAt": "2025-04-18T04:22:35Z",
      "title": "The US has a single rare earths mine. Chinese export limits are energizing a push for more",
      "url": "https://apnews.com/article/rare-earths-trump-tariffs-china-trade-war-effd6a7ec64b5830df9d3c76ab9b607a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ee06ef/2147483647/strip/true/crop/5272x2966+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F06%2F0ca95233108bf8560254a322c875%2F18d541af657345d08a2e763c09d31a52"
    },
    {
      "author": "Kate Payne, David Fischer",
      "description": "When a 20-year-old opened fire at Florida State University, terrified students barricaded doors and fled across campus, abandoning chemistry notes and even shoes. By early Friday, memorials of candles and flowers dotted the campus and a school-wide vigil had been scheduled as students and faculty tried to start healing from the shooting that investigators said killed two men and wounded at least six others. Investigators say the son of a sheriff’s deputy opened fire with his mother’s former service weapon. Officers who arrived almost immediately shot and wounded the shooter who is believed to be a Florida State student.",
      "publishedAt": "2025-04-18T04:42:19Z",
      "title": "Florida State University students felt fear and panic in deadly shooting",
      "url": "https://apnews.com/article/florida-state-university-shooting-c9a33f571466ce1ab1045dafebb30b82",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb88c98/2147483647/strip/true/crop/3773x2122+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F8e%2F70fa7758688151cac453eb0c9c82%2F1f2a016d09314784a8ebcf4a2c174e66"
    },
    {
      "author": null,
      "description": "The Supreme Court is keeping a hold on President Donald Trump’s restrictions on birthright citizenship but will hear arguments on the issue in May. Trump’s executive order to end birthright citizenship for the children of people who are in the U.S. illegally has been halted nationwide by three district courts around the country. The Republican administration had sought to narrow those orders to allow for the policy to take effect in parts or most of the country. That is expected to be the focus of the high court arguments under the court's order Thursday.",
      "publishedAt": "2025-04-17T18:11:27Z",
      "title": "Supreme Court keeps hold on Trump’s restrictions on birthright citizenship but sets May arguments",
      "url": "https://apnews.com/article/supreme-court-birthright-citizenship-trump-6f0cb929c4604ec1d9bf9fea99765b61",
      "urlToImage": "https://dims.apnews.com/dims4/default/9922c2c/2147483647/strip/true/crop/4938x2778+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F7d%2Faf235ce8c74616cc72c29520a06e%2F7b46c2bb087040fba75928bb700be375"
    },
    {
      "author": "Maryclaire Dale, Mark Scolforo",
      "description": "The arsonist who broke into the Pennsylvania governor’s residence while Gov. Josh Shapiro and his family slept upstairs faced little resistance as he smashed windows, ignited Molotov cocktails and crawled inside. A security expert who is retired from the FBI wonders how that happened. State police who protect the governor have pledged to hire an outside firm to review the breach. And it has happened before around the world — at the White House, at Buckingham Palace and at the California home of former House Speaker Nancy Pelosi. Pennsylvania suspect Cody Balmer is being held without bail pending a competency evaluation.",
      "publishedAt": "2025-04-17T21:37:40Z",
      "title": "Pennsylvania intruder faced little resistance as Gov. Josh Shapiro and his family slept",
      "url": "https://apnews.com/article/pennsylvania-governor-shapiro-mansion-fire-security-cc51b9f913c82250abcdcda024780e2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ec3f91/2147483647/strip/true/crop/1500x844+0+78/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Ffa%2F98c3ede575624e42a9d199dfa2f2%2Fcc9369c5e17d4d78b61976d4caaab6d2"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "Luigi Mangione, the man accused of gunning down UnitedHealthcare CEO Brian Thompson outside a Manhattan hotel in December, has been indicted in a New York court on four charges including a count eligible for the death penalty. A grand jury returned the indictment on Thursday in Manhattan federal court. The charges include stalking, murder and a firearms count. It was not immediately clear when the 26-year-old Mangione will be arraigned. He faces separate federal and state murder charges for the killing. A message seeking comment on the indictment was left for a spokesperson for Mangione’s lawyers.",
      "publishedAt": "2025-04-17T22:34:43Z",
      "title": "UnitedHealthcare killing suspect Luigi Mangione indicted on death penalty-eligible charges",
      "url": "https://apnews.com/article/unitedhealthcare-ceo-killing-luigi-mangione-nyc-8783ef6526bf0d14c2507d278888db3b",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Megan Janetsky, Julie Watson",
      "description": "A U.S. man has been fatally shot after he hijacked a small passenger plane in Belize. That's according to officials in Belize and the U.S. After the plane carrying 14 passengers and two crew members landed safely on Thursday, police in Belize identified the man as Akinyela Taylor. Chester Williams, Belize police commissioner, said that Taylor wielded a knife and stabbed three people on the plane. The three were later taken to a hospital. A passenger licensed to carry firearms shot the hijacker. A U.S. Embassy spokesperson confirmed Taylor was a U.S. citizen but U.S. officials could not confirm a Belize commissioner's statement that he was a military veteran. The hijacker's motive was not immediately known.",
      "publishedAt": "2025-04-17T20:15:06Z",
      "title": "A US man hijacks a small plane in Belize and stabs people. He is fatally shot and plane lands safely",
      "url": "https://apnews.com/article/belize-plane-hijacked-passengers-injured-1c1aaba8db4fdf27f50b88fb61b073b1",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Officials in southern Italy say that a cable car carrying tourists south of Naples has crashed after the cable snapped, killing at least four people and critically injuring one. Italy’s alpine rescue was responding to the accident on Monte Faito on Thursday. The cable car accident happened just a week after the destination reopened for the season. The cable car at Castellammare di Stabia is popular for its views of the Mount Vesuvius volcano and the Bay of Naples.",
      "publishedAt": "2025-04-17T17:21:52Z",
      "title": "Cable car accident in southern Italy kills at least 4 people",
      "url": "https://apnews.com/article/fatal-cable-car-accident-italy-3fbb1c9b7803352a4b5c74903cb3830b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7c728d1/2147483647/strip/true/crop/1600x900+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F68%2F48a28128a4e04b56dd52b4ff9ae5%2F129b6e47a2bd49da9946751c2d417f1f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}