{
  "articles": [
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korean law enforcement authorities are pushing to summon impeached President Yoon Suk Yeol for questioning over his short-lived martial law decree as the Constitutional Court began its first meeting Monday on Yoon’s case to determine whether to remove him from office or reinstate him.",
      "publishedAt": "2024-12-16T00:39:12Z",
      "title": "South Korean investigators push to summon impeached president as court set to determine his fate",
      "url": "https://apnews.com/8ec38d61f0ea5c48b3bd1f683b5e9c8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3ed00d3cae948fcbd6cf56382364f85/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and NATALIE MELZER",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel said Sunday it will close its embassy in Ireland as relations deteriorated over the war in Gaza, where Palestinian medical officials said new Israeli airstrikes killed over 46 people including several children.",
      "publishedAt": "2024-12-15T15:57:55Z",
      "title": "Israel will close its Ireland embassy over Gaza tensions as Palestinian death toll nears 45,000",
      "url": "https://apnews.com/b97bfffe851f87328ab24017da8d7a32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63465114c0d44461a250d62e07ed918c/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "DAMASCUS, Syria (AP) — In churches across long-stifled Syria, Christians marked the first Sunday services since the collapse of Bashar Assad 's government in an air of transformation.",
      "publishedAt": "2024-12-15T10:30:14Z",
      "title": "Christians in Syria mark country's transformation with tears as UN envoy urges an end to sanctions",
      "url": "https://apnews.com/3f0031108d7e58c2343bd6a8fd42254c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e03e468c9fd4468585ba343b71d2f57a/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "SAN PEDRO SULA, Honduras (AP) — As dozens of deported migrants pack into a sweltering airport facility in San Pedro Sula, Norma sits under fluorescent lights clutching a foam cup of coffee and a small plate of eggs – all that was waiting for her in Honduras.",
      "publishedAt": "2024-12-16T04:17:21Z",
      "title": "As Trump threatens mass deportations, Central America braces for an influx of vulnerable migrants",
      "url": "https://apnews.com/c28e71c590a9f3df2d607df13b956656",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d827fa22aa6d4418acdfbf5319c604d2/3000.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "WASHINGTON (AP) — President Joe Biden and Vice President Kamala Harris on Sunday thanked deep-pocketed Democratic donors who raised record sums in last month's election loss to President-elect Donald Trump and urged them not to lose hope and to remain politically engaged.",
      "publishedAt": "2024-12-16T00:52:57Z",
      "title": "Biden, Harris thank major Democratic donors and urge them to stay engaged after tough loss to Trump",
      "url": "https://apnews.com/a535c094e16d1807161759bd02c12b57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/babb21da4ab442669fce0047ff318f41/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and SYLVIE CORBET",
      "description": "CAPE TOWN, South Africa (AP) — The death toll in the French territory of Mayotte from Cyclone Chido is “several hundred” and may run into the thousands, the island’s top government official told a local broadcaster Sunday.",
      "publishedAt": "2024-12-15T10:24:09Z",
      "title": "Death toll in French territory of Mayotte from Cyclone Chido is 'several hundred,' top official says",
      "url": "https://apnews.com/2b49b97217a47e2013dc9021d9324eb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18bfe0d44bcc479fb71c4081694af000/1920.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — Chancellor Olaf Scholz faces a confidence vote in the German parliament on Monday that he's expected to lose, paving the way for the European Union's most populous member and biggest economy to hold an early election in February.",
      "publishedAt": "2024-12-16T05:01:44Z",
      "title": "Germany's Scholz faces a confidence vote. It's expected to lead to an election in February",
      "url": "https://apnews.com/87c6c0c64726eefaa95d9c46dae611dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6da66d626b6744dcafe1f2378699428a/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS and DAVE COLLINS",
      "description": "BOSTON (AP) — After weeks of fear and bewilderment about the drones buzzing over parts of New York and New Jersey, elected officials are urging action to identify and stop the mysterious flights.",
      "publishedAt": "2024-12-15T18:33:09Z",
      "title": "US agencies should use advanced technology to identify mysterious drones, Schumer says",
      "url": "https://apnews.com/80de1d64708677cfa7efc60249075d7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f3b17660cbc4330a54628816e1857b3/1920.jpeg"
    },
    {
      "author": "RICK CALLAHAN",
      "description": "INDIANAPOLIS (AP) — Indiana officials are preparing to execute the state's first death row inmate in 15 years, who was convicted a quarter-century ago of killing his brother and three other men.Joseph Corcoran, 49, has been on Indiana's death row since 1999.",
      "publishedAt": "2024-12-15T05:12:57Z",
      "title": "After a 15-year pause in executions, Indiana prepares to put to death a man who killed 4",
      "url": "https://apnews.com/aaf0dea682859a61bec88080aeb5171a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/631d8640ea36435ba81af75fd7dbe75f/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — Zakir Hussain, one of India's most accomplished classical musicians who defied genres and introduced tabla to global audiences, died on Sunday. He was 73.The Indian classical music icon died from idiopathic pulmonary fibrosis, a chronic lung disease, at a hospital in San Francisco, his family said in a statement.",
      "publishedAt": "2024-12-16T04:12:45Z",
      "title": "Zakir Hussain, one of India's most accomplished classical musicians, dies at 73",
      "url": "https://apnews.com/4e6b09e2a85a35e417d486188c433fe2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17d875e314364cdcb140e4e3e1a63d5e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}