{
  "articles": [
    {
      "author": "ZEKE MILLER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden said Wednesday that he would not supply offensive weapons that Israel could use to launch an all-out assault on Rafah — the last major Hamas stronghold in Gaza — over concern for the well-being of the more than 1 million civilians sheltering there.",
      "publishedAt": "2024-05-08T15:40:28Z",
      "title": "Biden says US won't supply weapons for Israel to attack Rafah, in warning to ally",
      "url": "https://apnews.com/eed365ebef0477ba74bf9848cacae4f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0c3c5fe4bb14477b16b393101bc65a7/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SARAH EL DEEB and LEE KEATH",
      "description": "RAFAH, Gaza Strip (AP) — Tens of thousands of displaced and exhausted Palestinians have packed up their tents and other belongings from Rafah, dragging families on a new exodus.",
      "publishedAt": "2024-05-08T21:41:07Z",
      "title": "Palestinians flee chaos and panic in Rafah after Israel's seizure of border crossing",
      "url": "https://apnews.com/e0754cdae0f3786982038e80feaa159e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5cd99d941a74824a1e5c2b5b15c4ad5/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, JENNIFER PELTZ and COLLEEN LONG",
      "description": "NEW YORK (AP) — Stormy Daniels will return to the witness stand Thursday in Donald Trump's hush money trial as the defense tries to undermine the credibility of the porn actor's salacious testimony about their alleged sexual encounter and the money she was paid to keep quiet.",
      "publishedAt": "2024-05-09T04:03:49Z",
      "title": "Defense attacks Stormy Daniels' credibility as she returns to the stand in Trump's hush money trial",
      "url": "https://apnews.com/d8be160e53c8050bf788d7772f483a64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbbb48db796247e9af7b1cfe268a664f/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Hardline Rep. Marjorie Taylor Greene tried and failed in a brazen push to oust House Speaker Mike Johnson, but the resounding rejection by Republicans and Democrats tired of the turmoil does not guarantee an end to the GOP chaos.",
      "publishedAt": "2024-05-09T04:08:52Z",
      "title": "House rejects Rep. Marjorie Taylor Greene's effort to oust Speaker Mike Johnson, but chaos lingers",
      "url": "https://apnews.com/11b3f1fa0c3b18a87d6ef797da739972",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/001d550145194fe884dda4e0c59d8f20/1920.jpeg"
    },
    {
      "author": "GEORGE WALKER IV, JOEY CAPPELLETTI and ED WHITE",
      "description": "COLUMBIA, Tenn. (AP) — Forecasters warned a wave of dangerous storms in the U.S. could march through parts of the South early Thursday, after storms a day earlier spawned damaging tornadoes and massive hail, leaving two dead in Tennessee and one dead in North Carolina.",
      "publishedAt": "2024-05-09T05:25:16Z",
      "title": "Tornadoes tear through southeastern US as storms leave 3 dead",
      "url": "https://apnews.com/a7c0feb2b60b4c568ca53f412d8eb605",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3de1904d20324e159b1c92391d261813/1920.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE and GABRIELA SÁ PESSOA",
      "description": "PORTO ALEGRE, Brazil (AP) — As major floods engulfed entire cities in the northern part of the Brazil's Rio Grande do Sul state last week, meteorologist Estael Sias knew the water would drain into capital Porto Alegre’s metropolitan region and that she would need to find a safe place.",
      "publishedAt": "2024-05-08T17:41:09Z",
      "title": "Southern Brazil is still reeling from massive flooding as it faces risk from new storms",
      "url": "https://apnews.com/6daa5788e5cf6ec9a94cb3ea30fa6b18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c4605763a954d33b1d512153216c94e/1920.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russia is wrapping itself in patriotic pageantry for Victory Day, a celebration of its defeat of Nazi Germany in World War II that President Vladimir Putin has turned into a pillar of his nearly quarter-century in power and a justification of his move into Ukraine.",
      "publishedAt": "2024-05-09T04:11:01Z",
      "title": "Russia's celebration of victory in World War II is a key pillar of Putin’s rule",
      "url": "https://apnews.com/ba00d11cdc76ad243921329d7742600c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72b6d4aec4d4491a991e33aa3b9c5800/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "BANGKOK (AP) — Six months into an offensive against Myanmar ’s military government, opposition forces have made massive gains, but civilian casualties are rising sharply as regime troops increasingly turn toward scorched-earth tactics in the Southeast Asian country's bitter civil war.",
      "publishedAt": "2024-05-09T04:14:53Z",
      "title": "Civilian casualties rise in Myanmar's civil war as resistance forces tighten noose around military",
      "url": "https://apnews.com/a15d8cd60bcc10c1f2dd9b7a8e576bf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a10166247334adba9eb86ee8684c9d5/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The Vatican crosses a key milestone Thursday in the runup to its 2025 Jubilee with the promulgation of the official decree establishing the Holy Year. It's a once-every-quarter-century event that is expected to bring some 32 million pilgrims to Rome and has already brought months of headaches to Romans.",
      "publishedAt": "2024-05-09T04:10:50Z",
      "title": "Vatican and Rome enter final dash to 2025 Jubilee with papal bull and around-the-clock construction",
      "url": "https://apnews.com/20189e83df9dd8eb5312d5e96e076af2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/663ebc4f5ee544bc94454c694e4ebb18/2048.jpeg"
    },
    {
      "author": null,
      "description": "MARSEILLE, France (AP) — Torchbearers are to carry the Olympic flame through the streets of France' southern port city of Marseille, one day after it arrived on a majestic three-mast ship for the welcoming ceremony.",
      "publishedAt": "2024-05-09T04:40:44Z",
      "title": "Torchbearers in Marseille kick off the Olympic flame's journey across the country",
      "url": "https://apnews.com/a45b9bbf9b3b974e374364c99007f053",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d76c9e728f3248a39eb192e42eea3880/2331.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}