{
  "articles": [
    {
      "author": "WILL WEISSERT and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — At the top of his first speech as her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-12T04:04:41Z",
      "title": "Harris is pushing joy. Trump paints a darker picture. Will mismatched moods matter?",
      "url": "https://apnews.com/ff1818feee5c8661decaa9d48f6927af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f1aeb0a6b4e4ba6afb40da7764733de/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — An official in the Kursk border region of Russia on Monday urged more residents to evacuate due to the “very tense situation” in the area, where Russian forces are still scrambling to respond to a surprise Ukrainian attack after almost a week of fierce fighting.",
      "publishedAt": "2024-08-12T09:24:25Z",
      "title": "More Russians are urged to flee Ukraine's cross-border attack as the Kremlin scrambles to respond",
      "url": "https://apnews.com/afa42b9613323901bef07800ac2cae9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38fdc03ee7f346879023e7da0eeaf7c7/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The leaders of France, Germany and Britain have endorsed calls for a cease-fire in Gaza, the return of scores of hostages held by Hamas and the “unfettered” delivery of humanitarian aid.In a joint statement released Monday, they endorsed the latest push by the United States, Qatar and Egypt to broker an agreement to end the 10-month-old Israel-Hamas war.",
      "publishedAt": "2024-08-12T06:24:00Z",
      "title": "Israel-Hamas war latest: Leaders of France, Germany and Britain endorse calls for cease-fire in Gaza",
      "url": "https://apnews.com/ea8cb6224cd789e7b19f6130a6201026",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b162c2ef73f49eca6cadedb3cd6d9f4/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL",
      "description": "Jannatul Prome hopes to leave Bangladesh to study more or possibly find a job after she finishes her university degree, frustrated by a system that she says doesn't reward merit and offers little opportunity for young people.",
      "publishedAt": "2024-08-12T04:10:24Z",
      "title": "How a young generation in Bangladesh forced out the leader who ruled for much of their lives",
      "url": "https://apnews.com/2723012c6177c2feafd1e81c20c68309",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7e13fbf7bf944b3a28ed8072bc8267c/3000.jpeg"
    },
    {
      "author": "BRITTANY PETERSON",
      "description": "In the days after wildfire ripped through a rural neighborhood in the Maui mountain town of Kula, residents were determined to do what they could to prevent a repeat. With donated hoses and some impromptu training, some even learned how to open a standpipe to attack flames themselves if needed.",
      "publishedAt": "2024-08-12T05:02:01Z",
      "title": "After fire struck Maui's Upcountry, residents of one town looked to themselves to prep for next one",
      "url": "https://apnews.com/69689be066f24da84ac53914e4de2683",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df0ff84103be4fd485f3eea7f437f16d/3000.jpeg"
    },
    {
      "author": "ELENA BECATOROS",
      "description": "ATHENS, Greece (AP) — A major forest fire was raging out of control on the northern fringes of the Greek capital Monday, triggering numerous evacuation orders for Athens suburbs and outlying areas as strong winds hampered the efforts of hundreds of firefighters and dozens of water-dropping planes.",
      "publishedAt": "2024-08-12T06:58:33Z",
      "title": "Major wildfire rages out of control on fringes of Greek capital; hundreds of firefighters deployed",
      "url": "https://apnews.com/4d6a07dc7e0fa61d2e1bb2d6549f8974",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0d716a42fd747ff8c61ddf88fdd7aa2/1920.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "SAINT-DENIS, France (AP) — Setting out to prove that topping Paris isn’t mission impossible, Los Angeles rolled out a skydiving Tom Cruise, Grammy winner Billie Eilish and other stars on Sunday as it took over Olympic hosting duties from the French capital, which closed out its 2024 Games just as they started — with joy and panache.",
      "publishedAt": "2024-08-11T19:03:12Z",
      "title": "Paris closes the Olympics, and Los Angeles turns to Tom Cruise for its 2028 mission",
      "url": "https://apnews.com/b1786f8e9ae6c5e2b709cf0b2cf6bb52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e00c4114b3974bd8a643659cdc216961/3000.jpeg"
    },
    {
      "author": "JAIMIE DING and ANDREW DALTON",
      "description": "LOS ANGELES (AP) — It's Los Angeles' turn for the torch. Mayor Karen Bass accepted the Olympic flag at the Paris closing ceremony Sunday, before handing it off to a key representative of LA's local business — Tom Cruise — who in a pre-recorded trek via motorcycle, plane and parachute kicked off the countdown to 2028.",
      "publishedAt": "2024-08-12T04:11:30Z",
      "title": "From Paris to Los Angeles: How the city is preparing for the 2028 Olympics",
      "url": "https://apnews.com/59e0f1e3a66464b28024f431b193dc00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e122b977156a4f74aab9fdb64029fa2b/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — The smell of hairspray clouds Alexa Flores López as she gets the finishing touches of an intricate updo on her thick black hair. When Alexa found out she was going to have a quinceañera — the traditional celebration for a 15th birthday in Mexico — she could barely contain herself.",
      "publishedAt": "2024-08-12T04:10:45Z",
      "title": "How a Mexico City hospital transforms into a coming-of-age celebration for its patients",
      "url": "https://apnews.com/9c68d5e6c52648eaeb590972013fa281",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3f8cbb0ba1b4784b97de616e106dac1/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO and ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — They’re adorable. They require less food and space. And without much coaxing, they might help cut the grass. Americans are showing more interest in owning miniature cows, goats, donkeys and other diminutive farm animals, a trend driven by hobby farmers looking for easy-to-manage livestock and homesteaders who like the idea of having a petite pig or a scaled-down sheep as a pet.",
      "publishedAt": "2024-08-12T09:07:23Z",
      "title": "Mini farm animals are adorable. There's also a growing demand for them",
      "url": "https://apnews.com/9a62536eb3c679ff3bf0156cd20b9354",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a26cca88f6f3426095d89ed92b59cd6e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}