{
  "articles": [
    {
      "author": "SAM MEDNICK and JACK JEFFREY",
      "description": "JERUSALEM (AP) — Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.",
      "publishedAt": "2024-06-08T10:46:01Z",
      "title": "Israel rescues 4 hostages kidnapped in a Hamas-led attack on Oct. 7",
      "url": "https://apnews.com/a5d1ef04763a5ed17de2d050ebc5d490",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/528e0ecaf2a44291a2983666016a85fd/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, ZEKE MILLER and SYLVIE CORBET",
      "description": "PARIS (AP) — President Joe Biden is being feted by French President Emmanuel Macron with a state visit Saturday as the two allies aim to show off their partnership on global security issues and move past trade tensions.",
      "publishedAt": "2024-06-08T04:00:47Z",
      "title": "Macron is hosting Biden for a state visit as the two leaders try to move past trade tensions",
      "url": "https://apnews.com/0c46f64738ecfcbb45e624e9dd226d9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c7437cb8b704e84b2f50ab464d25cb8/3000.jpeg"
    },
    {
      "author": "KAREL JANICEK",
      "description": "PRAGUE (AP) — Voters in Slovakia, Italy and other European Union nations are casting their ballots Saturday on the third day of elections for the European Parliament, with populist and far-right parties looking to make gains across the 27-member bloc.",
      "publishedAt": "2024-06-08T05:18:35Z",
      "title": "Slovaks and others go to the polls in EU elections under the shadow of an assassination attempt",
      "url": "https://apnews.com/0e7fd468dcbe8c85a6277b2992de9da0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25ace952f6a14c6ab5b3508a25c63068/3000.jpeg"
    },
    {
      "author": "PAN PYLAS",
      "description": "LONDON (AP) — The decision by British Prime Minister Rishi Sunak to leave D-Day commemorations in northern France early has caused a political storm that threatens to derail his Conservative Party's general election campaign.",
      "publishedAt": "2024-06-08T07:00:13Z",
      "title": "Rishi Sunak's D-Day departure is just the latest in a long line of gaffes in UK election campaigns",
      "url": "https://apnews.com/d78b9572e98ba3d7b6b139a457a938f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0152f1334654a18a5555811d9a693b0/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.",
      "publishedAt": "2024-06-08T09:36:33Z",
      "title": "Attacks in Russian-occupied Ukrainian regions leave 28 dead, Moscow-backed officials say",
      "url": "https://apnews.com/aa5de3171da1126d0ae2a0dd59d419dc",
      "urlToImage": ""
    },
    {
      "author": "JIM VERTUNO",
      "description": "The judge presiding over Hunter Biden's federal gun trial in Delaware is a former corporate civil lawyer with a background in biology who was nominated to the bench by the Biden family's chief political antagonist: former President Donald Trump.",
      "publishedAt": "2024-06-08T04:01:46Z",
      "title": "Appointed by Trump, Hunter Biden trial judge spent most of her career in civil law",
      "url": "https://apnews.com/1e1c44a3a3a3d0e8739bf6c7690cffde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30c0103125354902847e37bb70d9b9c9/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON and AUDREY McAVOY",
      "description": "SEATTLE (AP) — William Anders, the former Apollo 8 astronaut who took the iconic “Earthrise” photo showing the planet as a shadowed blue marble from space in 1968, was killed Friday when the plane he was piloting alone plummeted into the waters off the San Juan Islands in Washington state.",
      "publishedAt": "2024-06-08T05:18:44Z",
      "title": "Former astronaut William Anders, who took iconic Earthrise photo, killed in Washington plane crash",
      "url": "https://apnews.com/b4d783e0c5613a0e65fc9598a55f90d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14e9b3e196f94cf3959d4c78d1664011/2895.jpeg"
    },
    {
      "author": "ALBERT STUMM",
      "description": "Prince Bhojwani never thought of himself as a negative person, until three trips to the hospital in one month forced him to reconsider.Before May 2018, he was a healthy but chronically worried start-up founder who regularly did 20-mile (32-kilometer) bike rides.",
      "publishedAt": "2024-06-08T04:04:54Z",
      "title": "Optimism is just what the doctor ordered. But what if I’m already too negative?",
      "url": "https://apnews.com/39fb842af1cf9c08fe5c0bfa0ac368ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2448b9393a6a4bdbac6ccaa53c27a507/2192.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — A soaring demand for food delivered fast has spawned small armies of couriers — and increasing alarm — in big cities where scooters, motorcycles and mopeds zip in and out of traffic and hop onto pedestrian-filled sidewalks as their drivers race to drop off salads and sandwiches.",
      "publishedAt": "2024-06-08T04:10:25Z",
      "title": "Demand for food delivery has skyrocketed. So have complaints about some drivers",
      "url": "https://apnews.com/e35b5667cb7f2140bdc778ca52f59695",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7218874897804e169acb9a75ca2f4644/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "LOS GATOS, Calif. (AP) — Although its video streaming service sparkles with a Hollywood sheen, Netflix still taps its roots in Silicon Valley to stay a step ahead of traditional TV and movie studios.",
      "publishedAt": "2024-06-08T11:40:19Z",
      "title": "Netflix's recipe for success includes 'secret sauce' spiced with Silicon Valley savvy",
      "url": "https://apnews.com/7146b50bc23d72f752f7eba8d3b156e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73e03c4fd48040ee81f9e019f48c7836/2672.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}