{
  "articles": [
    {
      "author": "HAVEN DALEY and MIKE SCHNEIDER",
      "description": "BELLEAIR BEACH, Fla. (AP) — Milton rapidly strengthened in the Gulf of Mexico on Monday to become a Category 5 hurricane on a path toward Florida, threatening a dangerous storm surge in Tampa Bay, leading to evacuation orders and lending more urgency to the cleanup from Hurricane Helene, which swamped the same stretch of coastline less than two weeks ago.",
      "publishedAt": "2024-10-07T04:14:16Z",
      "title": "Hurricane Milton is a Category 5. Florida orders evacuations and scrambles to clear Helene's debris",
      "url": "https://apnews.com/557c5c512135e0a8661b298e45e17c92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c6a6e76856f48cf816ae4c254094d69/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and TIA GOLDENBERG",
      "description": "RE'IM, Israel (AP) — Israelis held somber ceremonies Monday to mark a year since the deadliest attack in the country’s history, a Hamas-led raid that shattered its sense of security and has since spiraled into wars on two fronts with no end in sight.",
      "publishedAt": "2024-10-07T03:35:39Z",
      "title": "War rages on multiple fronts as Israel marks a year since Hamas' Oct. 7 attack",
      "url": "https://apnews.com/cf123f95609051e8e8eaf6aebe661b6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4f320928ac64d17a1ad8862a4a1ac89/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS and SARAH EL DEEB",
      "description": "The Gaza Strip is in ruins.There are hills of rubble where apartment blocks stood, and pools of sewage-tainted water spreading disease.",
      "publishedAt": "2024-10-07T04:27:05Z",
      "title": "Gaza is in ruins after Israel's yearlong offensive. Rebuilding may take decades",
      "url": "https://apnews.com/6b41ad9f64887228e90793705dd379a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/faf1f473705b41efa95cb6e4fa33d93a/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "KFAR AZA, Israel (AP) — On a sun-dappled day in Kibbutz Kfar Aza, Liora Eilon stood at the spot where her son was killed. She stooped to pick a figurine from the pile of belongings scattered around an abandoned home nearby.",
      "publishedAt": "2024-10-07T04:21:49Z",
      "title": "A year after the Hamas attack shattered this Israeli community, going home still feels impossible",
      "url": "https://apnews.com/344b289751d8ee80d4909f15864f508c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4124f43a8b0e4dccb283bf26314471f7/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — Vigils, commemorations and acts of remembrance were planned across the world on Monday to mark one year since the Oct.",
      "publishedAt": "2024-10-07T11:07:58Z",
      "title": "Countries around the world commemorate the anniversary of Hamas attack on Israel",
      "url": "https://apnews.com/b8f7428b707f2cf4300405feca0b570e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c64c487d14d0460184a813a15024a698/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The United States has spent a record of at least $17.9 billion on military aid to Israel since the war in Gaza began and led to escalating conflict around the Middle East, according to a report for Brown University's Costs of War project, released Monday on the anniversary of Hamas’ attacks on Israel.",
      "publishedAt": "2024-10-07T04:09:45Z",
      "title": "US spends a record $17.9 billion on military aid to Israel since last Oct. 7",
      "url": "https://apnews.com/8e6e5033f7a1334bf6e35f86e7040e14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e3b8a3437bf48c7b42981b114d2549c/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The U.S. government’s top disaster relief official said Sunday that false claims and conspiracy theories about the federal response to Hurricane Helene — spread most prominently by Donald Trump — are “demoralizing” aid workers and creating fear in people who need recovery assistance.",
      "publishedAt": "2024-10-06T19:35:29Z",
      "title": "US disaster relief chief blasts false claims about Helene response as a 'truly dangerous narrative'",
      "url": "https://apnews.com/07d5b1f6968cb2af11b63357186a1a15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c30f1f683583477099282ddd52d0b85d/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — Soon, the ballots will be cast, the polls will close and a campaign marked by assassination attempts, animosity and anxiety will come to an end. But for U.S. adversaries, the work to meddle with American democracy may be entering its most critical phase.",
      "publishedAt": "2024-10-07T04:04:50Z",
      "title": "For US adversaries, Election Day won't mean the end to efforts to influence Americans",
      "url": "https://apnews.com/efff7f7fcbc71032b1152d011c953eba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab611f5a543d471ba279258759ae8c1d/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN, MARIA CHENG and MIKE CORDER",
      "description": "STOCKHOLM (AP) — Two scientists won the Nobel Prize in physiology or medicine on Monday for their discovery of microRNA, tiny bits of genetic material that serve as on and off switches inside cells that help control what the cells do and when they do it.",
      "publishedAt": "2024-10-07T07:14:52Z",
      "title": "Nobel Prize in medicine honors 2 scientists for their discovery of microRNA",
      "url": "https://apnews.com/dc84622d7a15317bc83e873d3f9a2dbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b22b8c1526042f3863172336864b83a/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A spacecraft blasted off Monday to investigate the scene of a cosmic crash.",
      "publishedAt": "2024-10-07T14:53:41Z",
      "title": "A spacecraft is on its way to a harmless asteroid slammed by NASA in a previous save-the-Earth test",
      "url": "https://apnews.com/e716ac29b5b056861a995c0bf6342c2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f66a35c71e441508360e005af77d0b6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}