{
  "articles": [
    {
      "author": null,
      "description": "Israel has received Hamas' latest ceasefire proposal, with an Israeli official calling it \"workable.\" Hamas has confirmed sending the proposal to mediators, signaling a potential breakthrough to end the war in Gaza. This comes after more than 100 charity and human rights groups warned that Israel’s blockade and military actions are pushing Palestinians in Gaza toward starvation. Experts say Gaza is at risk of famine due to the blockade and ongoing offensive. Meanwhile, two Palestinian teens were killed by Israeli fire in the occupied West Bank, according to Palestinian health officials.",
      "publishedAt": "2025-07-24T06:36:53Z",
      "title": "Israeli official says Hamas ceasefire offer 'workable' as US envoy to meet key leaders",
      "url": "https://apnews.com/article/israel-gaza-mideast-wars-hamas-latest-07-24-2025-ae5a311014646b8018181e4191e9795b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e310070/2147483647/strip/true/crop/5218x2935+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F5c%2F9609daee0f1afb345109a9466cfd%2Fb7fd02103bbb496ea421792306846927"
    },
    {
      "author": null,
      "description": "A judge has rejected a Trump administration request to unseal transcripts from grand jury investigations of Jeffrey Epstein years ago in Florida. A similar records request is pending in New York. U.S. District Judge Robin Rosenberg in West Palm Beach said Wednesday the request to release grand jury documents from 2005 and 2007 did not meet any of the extraordinary exceptions under federal law that could make them public.",
      "publishedAt": "2025-07-23T19:14:36Z",
      "title": "Judge rejects effort to unseal Epstein grand jury records in Florida",
      "url": "https://apnews.com/article/epstein-trump-grand-jury-records-florida-3254decc623fbf2a5ee2967c7adfa2e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "A House subcommittee has voted to subpoena the Department of Justice for files in the sex trafficking investigation into Jeffrey Epstein. Democrats successfully goaded GOP lawmakers to defy Trump and Republican leadership to support the action. Democrats on a subcommittee of the powerful House Committee on Oversight made a motion for the subpoena Wednesday afternoon, just hours before the House was scheduled to end its July work session and depart Washington for a monthlong break. Three Republicans on the panel voted with Democrats for the subpoena, sending it through on an 8-2 vote tally.",
      "publishedAt": "2025-07-23T19:39:32Z",
      "title": "House subcommittee votes to subpoena Epstein files",
      "url": "https://apnews.com/article/epstein-files-congress-democrats-subpoena-republicans-trump-5d17ea83f7ffeff5784159848b97f38e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ab243e/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2Fec%2Fb6a4cd1364eaceff46020e38a0f9%2F0e8f08f9421344dda24f5a4bcc17bd2c"
    },
    {
      "author": null,
      "description": "Local officials in Russia say the wreckage of a plane that crashed while carrying 49 passengers has been found in the country's Far Eastern Amur region. Russian news agencies said an initial aerial inspection suggested there were no survivors. The flight was traveling from Blagoveshchensk, near the Russian-Chinese border, to the town of Tynda on Thursday when it disappeared from radar. A regional governor says 43 passengers, including five children, were on board, as well as six crew members.",
      "publishedAt": "2025-07-24T06:49:41Z",
      "title": "Russian plane crashes in Far Eastern Amur region with 49 on board",
      "url": "https://apnews.com/article/russia-plane-disappears-far-east-amur-819e5bd46dfa440246f37b4d4976eb23",
      "urlToImage": "https://dims.apnews.com/dims4/default/796f590/2147483647/strip/true/crop/3000x1688+0+1406/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F40%2Fec63021cd0084a8509f78dac7019%2F1d94ca8374b248339a22949c9eb9e783"
    },
    {
      "author": null,
      "description": "Thai and Cambodian soldiers have fired at each other in a contested border area after the nations downgraded their diplomatic relations in a rapidly escalating dispute. It was not immediately clear if the clash was ongoing. A livestream video from Thailand’s side showed people running from their homes and hiding in a concrete bunker Thursday morning as explosions sounded periodically. The clash happened in an area where the ancient Prasat Ta Muen Thom temple stands along the border of Thailand’s Surin province and Cambodia Oddar Meanchey province. Both Thailand and Cambodia accused each other of opening fire first.",
      "publishedAt": "2025-07-24T03:12:02Z",
      "title": "Thai and Cambodia soldiers fire at each other in disputed border area",
      "url": "https://apnews.com/article/thailand-cambodia-armed-clash-border-5b1e15987fb02132268913e474250c51",
      "urlToImage": "https://dims.apnews.com/dims4/default/37cb443/2147483647/strip/true/crop/1473x829+0+77/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Ff3%2F3421e19445c957c4350bd4514f15%2Fc3ba190254464c8a88e8a8870ed028b3"
    },
    {
      "author": null,
      "description": "Serious armed clashes have erupted between Thailand and Cambodia over a disputed border area. The fighting Thursday included gunfire exchanges and shelling and rocket fire, which Thai authorities say killed at least nine Thai civilians and injured 14 others in three provinces. Thailand has responded with air strikes. It was the second armed confrontation since a Cambodian soldier was shot dead in May. Border disputes are long-standing issues that have caused periodic tensions between the two neighbors. Thailand and Cambodia share more than 800 kilometers of land border. The contesting claims stem largely from a 1907 map drawn under French colonial rule.",
      "publishedAt": "2025-07-24T07:26:37Z",
      "title": "What's behind the clash between Thailand and Cambodia",
      "url": "https://apnews.com/article/thailand-cambodia-border-conflict-explainer-0eb99510a4ea16ee769a5934e0c07383",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d43e9d/2147483647/strip/true/crop/4000x2250+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2F20%2Fe404fcaf14c9a3675c9b036c655c%2F85ebe2873db14d5592d55f8a3c14a672"
    },
    {
      "author": null,
      "description": "Director of National Intelligence Tulsi Gabbard this month declassified material that she claimed proved a “treasonous conspiracy” by the Obama administration in 2016 to politicize U.S. intelligence in service of casting doubt on the legitimacy of Donald Trump’s election victory. But a review by The Associated Press of reports produced by federal prosecutors and congressional committees casts doubt on that claim and others made by the nation’s top intelligence official.",
      "publishedAt": "2025-07-24T04:13:58Z",
      "title": "Gabbard's claims of anti-Trump conspiracy not backed by declassified documents",
      "url": "https://apnews.com/article/gabbard-russia-2016-steele-dossier-0452e1079506daa86d75fa0a2f22fc60",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8f2334/2147483647/strip/true/crop/2688x1512+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F43%2F00e1b4e5fa39fd31bdeb644c2df7%2F02357f21c1c14eed86864e19e8444fe6"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump is visiting Scotland this week, returning to the country where his mother was born and raised. He's likely to get a mixed reception on the trip, which includes visits to his two Scottish golf resorts. He has faced opposition from environmental campaigners and some neighbors over his Trump International Scotland course in northeast Scotland. Trump will meet Scottish First Minister John Swinney and U.K. Prime Minister Keir Starmer during his visit. Protests are expected, with some Scots opposing his presence. The visit comes ahead of a formal state visit to the U.K. in two months.",
      "publishedAt": "2025-07-24T04:25:08Z",
      "title": "Donald Trump's Scotland trip: A mixed reception awaits",
      "url": "https://apnews.com/article/trump-scotland-mother-ancestry-golf-d31dadc1ef89591b82efaabfdcb2ddde",
      "urlToImage": "https://dims.apnews.com/dims4/default/58924a4/2147483647/strip/true/crop/5245x2950+0+273/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2Ff6%2Fe25cc6db2717507fa3eea6b2e265%2F2e51ac2f8c284c08be915424aec76d7b"
    },
    {
      "author": null,
      "description": "Archaeologists in central Israel are excavating one of the world's oldest known burial sites, dating back 100,000 years. The site, Tinshemet Cave, contains remarkably preserved remains of early humans, carefully arranged and with what are likely ceremonial objects. Experts believe this site showcases a significant shift in how early humans treated their dead and thought about spirituality and the afterlife. Researchers are still studying whether the remains belong to Neanderthals, Homo sapiens, or a hybrid population.",
      "publishedAt": "2025-07-24T05:23:06Z",
      "title": "Archaeologists uncover one of the oldest burial sites in Israel cave",
      "url": "https://apnews.com/article/israel-archaeology-paleolithic-burial-skeletons-6813bf418566721409f2c3c94b5d627c",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2412e0/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F99%2F36e0eddfc3a8f039a398585e1a2a%2F4e13ebaf31cf4b1aacbb2e9533941a37"
    },
    {
      "author": null,
      "description": "A federal appeals court has ruled that President Donald Trump’s order seeking to end birthright citizenship is unconstitutional, affirming a lower-court decision that blocked its enforcement nationwide. The ruling from the 9th U.S. Circuit Court of Appeals comes after the push was also blocked by a federal judge in New Hampshire, and puts the issue one step closer to quickly coming back before the Supreme Court.",
      "publishedAt": "2025-07-24T00:18:25Z",
      "title": "Court finds Trump’s effort to end birthright citizenship unconstitutional",
      "url": "https://apnews.com/article/immigration-birthright-citizenship-16658c712cf6a3141f168c7557c0628d",
      "urlToImage": "https://dims.apnews.com/dims4/default/0d1297c/2147483647/strip/true/crop/3840x2160+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2F8c%2F510cbabc2bbf9c4a2604af236e64%2F3f27a83261b24d5aa9e3e715235d4170"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}