{
  "articles": [
    {
      "author": "SAMYA KULLAB and JOANNA KOZLOWSKA",
      "description": "KYIV, Ukraine (AP) — A Russian strike on a nine-story building in the city of Sumy in northern Ukraine killed eight people and wounded dozens, an official said Sunday, as Russia launched a massive drone and missile attack described by officials as the largest in recent months.",
      "publishedAt": "2024-11-17T08:31:14Z",
      "title": "Russia launches one of its fiercest missile and drone attacks at Ukraine's infrastructure",
      "url": "https://apnews.com/6af214839d9436731e9b960f0d3a7a8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b26750e5e6c416b902495ab3bdd4d1e/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, COLLEEN LONG, ZEKE MILLER, MATTHEW LEE and ELLEN KNICKMEYER",
      "description": "MANAUS, Brazil (AP) — President Joe Biden has authorized Ukraine to use U.S.-supplied long-range missiles to strike deeper inside Russia, easing limitations on the weapons as Russia deploys thousands of North Korean troops to reinforce its war, according to a U.S.",
      "publishedAt": "2024-11-17T18:36:04Z",
      "title": "Biden authorizes Ukraine to use US-supplied long-range missiles for deeper strikes inside Russia",
      "url": "https://apnews.com/52d424158182de2044ecc8bfcf011f9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aacf7b639540446d870aee08fc77fe31/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "PALM BEACH, Fla. (AP) — Donald Trump Jr. said Sunday that the team now around the president-elect knows how to choose a Cabinet and build out an administration, unlike the time before his father first took office.",
      "publishedAt": "2024-11-17T19:03:22Z",
      "title": "Donald Trump Jr. says pushback against Cabinet picks proves they're the disrupters voters wanted",
      "url": "https://apnews.com/552db11011b979577e87de77c76ed921",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17dcee6159034f38a397498ee968b16d/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "The 2024 presidential election featured sky-high turnout, approaching the historic levels of the 2020 contest and contradicting long-held conventional political wisdom that Republicans struggle to win races in which many people vote.",
      "publishedAt": "2024-11-17T12:59:58Z",
      "title": "Big voter turnout this year benefited Republicans, contradicting conventional political wisdom",
      "url": "https://apnews.com/7ef18c115c8e1e76210820e0146bc3a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8825f42291647209dfe62c8d558c0b5/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER, ELLEN KNICKMEYER and EDITH M. LEDERER",
      "description": "WASHINGTON (AP) — Tulsi Gabbard, President-elect Donald Trump's choice to lead the U.S.",
      "publishedAt": "2024-11-17T13:06:26Z",
      "title": "Gabbard's sympathetic views toward Russia cause alarm as Trump's pick to lead intelligence services",
      "url": "https://apnews.com/a798adaf9cd531a5d0c9329f7597f0f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bba9df5785fe4eec88af01ba596784b3/3000.jpeg"
    },
    {
      "author": "FADI TAWIL, BASSEM MROUE and WAFAA SHURAFA",
      "description": "BEIRUT (AP) — A rare Israeli strike in central Beirut killed the Hezbollah militant group's chief spokesman on Sunday, while an Israeli strike in northern Gaza ’s Beit Lahiya killed at least 30 people, a hospital director there told The Associated Press.",
      "publishedAt": "2024-11-17T07:05:05Z",
      "title": "An Israeli strike in Beirut kills Hezbollah's spokesman, while a strike in Gaza kills at least 30",
      "url": "https://apnews.com/060c45c86b937d255270d272590884a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90117a6b25834cc2b49cd0e77829d003/1920.jpeg"
    },
    {
      "author": "SUSAN HAIGH and PATRICK WHITTLE",
      "description": "Firefighters in New York said Sunday that a voluntary evacuation overnight helped them protect more than 160 homes from a stubborn wildfire near the New Jersey border as officials in much of the Northeast coped with hundreds of brush fires in tinder-dry and windy conditions.",
      "publishedAt": "2024-11-17T06:50:00Z",
      "title": "Wildfire threat continues in much of the US Northeast as dry conditions persist",
      "url": "https://apnews.com/00215fa5dcbfde4164924d486e363c2e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fecd12840bd3478bb1fe91ab8c337dc1/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and SIBI ARASU",
      "description": "BAKU, Azerbaijan (AP) — Distractions were bigger than deals in the first week of United Nations climate talks, leaving a lot to be done, especially on the main issue of money.In week one, not a lot of progress was made on the issue of how much money rich countries should pay to developed ones to move away from dirty fuels and how to cope with rising seas and temperatures and pay for damage already caused by climate-driven extreme weather.",
      "publishedAt": "2024-11-17T05:08:36Z",
      "title": "As talks in Baku cross the halfway point, nations are no closer to a goal on cash for climate action",
      "url": "https://apnews.com/8d726f485bd544d1ad483755c34c0f70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86acb3f0842b4002a8195d679f354e99/3000.jpeg"
    },
    {
      "author": "GIADA ZAMPANO",
      "description": "ROME (AP) — Pope Francis has called for an investigation to determine if Israel’s attacks in Gaza constitute genocide, according to excerpts released Sunday from an upcoming new book ahead of the pontiff's jubilee year.",
      "publishedAt": "2024-11-17T10:43:10Z",
      "title": "Pope Francis calls for investigation to determine if Israel's attacks in Gaza constitute 'genocide'",
      "url": "https://apnews.com/62907898cead13dbcfd603592263904c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed33a6b7bbe04fe4b672b2f6e084a1ed/3000.jpeg"
    },
    {
      "author": "ERIC OLSON",
      "description": "Oregon remained the unanimous No. 1 team in The Associated Press Top 25 college football poll Sunday after its close call at Wisconsin, Notre Dame and Alabama each jumped up two spots and Georgia returned to the top 10.",
      "publishedAt": "2024-11-17T19:17:34Z",
      "title": "AP Top 25: Oregon is the unanimous No. 1 team again; Georgia is back in top 10 and LSU out of Top 25",
      "url": "https://apnews.com/5f01bc5e74fb32cea5c79526ff7cb7cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87bcab75450144a8b356488f2e70968f/1608.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}