{
  "articles": [
    {
      "author": "TIA GOLDENBERG and JACK JEFFERY",
      "description": "TEL AVIV, Israel (AP) — Israel’s killing of Yahya Sinwar, Hamas’ top leader and the mastermind of the group’s Oct.",
      "publishedAt": "2024-10-17T20:44:38Z",
      "title": "Sinwar's killing opens up opportunity and much uncertainty for the war in Gaza",
      "url": "https://apnews.com/170b010299a62f679fe5ee7324a69ff5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de417777ff524b519c4d2d4f6a4a1f96/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, MELANIE LIDMAN and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Israeli forces in Gaza killed Hamas leader Yahya Sinwar, a chief architect of last year’s attack on Israel that sparked the war, the military said Thursday.",
      "publishedAt": "2024-10-17T11:42:28Z",
      "title": "Israel says it has killed Hamas leader Yahya Sinwar in Gaza",
      "url": "https://apnews.com/d12ca71945313e601cf10876072f4182",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3427c2fef94e4b6d827dddaefdf9fbca/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "GRAND RAPIDS, Mich. (AP) — Kamala Harris and Donald Trump will both be scouring for votes in Michigan on Friday as they try to lock down support in this key political battleground.",
      "publishedAt": "2024-10-18T04:16:06Z",
      "title": "Harris and Trump target Michigan as both parties try to shore up 'blue wall' votes",
      "url": "https://apnews.com/6b034753290276bfa96d7caf8f7639bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c40bf3c6b1645f38a5abbb27055186a/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "BERLIN (AP) — Even in Germany, it's hard for President Joe Biden to escape the topic of Donald Trump.The U.S. president meets Friday with European allies for closed-door conversations about Russia's war in Ukraine and the conflict in the Middle East.",
      "publishedAt": "2024-10-18T04:26:45Z",
      "title": "As Biden meets with European allies, the possibility of another Trump term hangs over their talks",
      "url": "https://apnews.com/047d46d4ef80804ebee515ee5d2d449c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8f3f8c785b24276b1d814c79392a6aa/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "This year has seen President Vladimir Putin repeatedly brandish the nuclear sword, reminding everyone that Russia has the world’s largest atomic arsenal to try to deter the West from ramping up support for Ukraine.",
      "publishedAt": "2024-10-18T04:06:04Z",
      "title": "Russia flaunts its many doomsday weapons to keep the West from ramping up support for Ukraine",
      "url": "https://apnews.com/bf50d3155369cc0a5f12ef7805bf2340",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d13176ac35b54fd0993118523ade3c1e/3000.jpeg"
    },
    {
      "author": "ALAN SUDERMAN and GARANCE BURKE",
      "description": "WASHINGTON (AP) — The Kremlin could not have asked for better publicity at a better time when Ben Swann, a self-described independent journalist who promotes conspiracy theories, released a 12-part video series he promised would reveal dark truths about Ukrainian President Volodymyr Zelenskyy.",
      "publishedAt": "2024-10-18T04:11:34Z",
      "title": "Right-wing influencers hyped anti-Ukraine videos made by a TV producer also funded by Russian media",
      "url": "https://apnews.com/9d4281756246b94eda05c478f3dac203",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16a84eb3119142a99663f07e3a3c2eef/2351.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and MICHAEL GRACZYK",
      "description": "HUNTSVILLE, Texas (AP) — The Texas Supreme Court halted Thursday night’s scheduled execution of a man who would have become the first person in the U.S. put to death for a murder conviction tied to a diagnosis of shaken baby syndrome.",
      "publishedAt": "2024-10-17T05:03:03Z",
      "title": "Texas Supreme Court halts execution of man in shaken baby case after lawmakers' last-minute appeal",
      "url": "https://apnews.com/1ef99c052cc1630785ac5d6e2edfc9cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ce58ce647a64aff8c11df99bc36f79c/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — Texas has sued a Dallas doctor over accusations of providing gender-affirming care to youths, marking one of the first times a state has sought to enforce recent bans driven by Republicans.",
      "publishedAt": "2024-10-18T00:58:58Z",
      "title": "Texas sues doctor and accuses her of violating ban on gender-affirming care",
      "url": "https://apnews.com/bb2a24b0c981819a11c7a4386c72eb6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a0bd1d0dc9a4859af0394c5974477fa/2915.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "BUENOS AIRES, Argentina (AP) — The circumstances surrounding the death of ex-One Direction singer Liam Payne were suspicious and possibly involved drugs, though there was no sign of a third party being involved, Argentine prosecutors said Thursday.",
      "publishedAt": "2024-10-17T09:19:02Z",
      "title": "Argentine authorities probe what happened before Liam Payne's fatal fall from his hotel balcony",
      "url": "https://apnews.com/487239e4f0b938a6f350a7d2f14737e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7a47bfb1c0d4f019d644cafd5f82abd/1920.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — King Charles III and Queen Camilla will arrive in Sydney on Friday for the first Australian visit by a reigning monarch in more than a decade, a trip that has rekindled debate about the nation’s constitutional links to Britain.",
      "publishedAt": "2024-10-18T00:20:43Z",
      "title": "King Charles III's visit rekindles Australia's debate on ending ties to the British monarchy",
      "url": "https://apnews.com/dcb4baf655f28fc20068c5991f09f28f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/836df02823df4e5a84a726e6acaa7197/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}