{
  "articles": [
    {
      "author": "Mike Stobbe",
      "description": "The nation’s top public health agency is inviting about 180 employees back to work about two weeks after laying them off. Emails went out Tuesday to some Centers for Disease Control and Prevention probationary employees who got termination notices last month. A message seen by the AP was sent with the subject line, “Read this e-mail immediately.” It said that a Feb. 15 termination notice has been rescinded. It’s not clear how many people returned to work Wednesday. And it’s also unclear whether the employees would be spared from further widespread job cuts that are expected soon across government agencies.",
      "publishedAt": "2025-03-05T19:46:20Z",
      "title": "CDC calls 180 fired employees back to work on a day's notice",
      "url": "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930",
      "urlToImage": "https://dims.apnews.com/dims4/default/977c96f/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Ff3%2Fc28219f311c09b7e59b5e82de64f%2Fcb1cfaf434544ae0bb7daf1919f6a315"
    },
    {
      "author": "Stephen Groves",
      "description": "The Department of Veterans Affairs is planning an “aggressive” reorganization that includes cutting 80,000 jobs from the sprawling agency that provides health care for retired military members. That's according to an internal memo obtained by The Associated Press. The VA’s chief of staff, Christopher Syrek, told top level officials at the agency that it had an objective to cut enough employees to return to 2019 staffing levels of just under 400,000. That would require terminating tens of thousands of employees after the VA expanded under the Biden administration, as well as to cover veterans impacted by burn pits under the 2022 PACT Act.",
      "publishedAt": "2025-03-05T16:51:56Z",
      "title": "Trump administration plans to cut 80,000 employees from Veterans Affairs",
      "url": "https://apnews.com/article/veterans-affairs-cuts-doge-musk-trump-f587a6bc3db6a460e9c357592e165712",
      "urlToImage": "https://dims.apnews.com/dims4/default/880d936/2147483647/strip/true/crop/5100x2869+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F21%2Fb2422e0c15ea0efc2189b5036c5c%2F001c7c8c71a04876882ece68d0d0b273"
    },
    {
      "author": "Josh Boak, Rob Gillies",
      "description": "Commerce Secretary Howard Lutnick said there might be carveouts coming to the 25% tariffs placed on Canada and Mexico by President Donald Trump. It's a sudden backing away after Tuesday’s tax hike hurt the stock market, worried consumers and started a trade war. In a Wednesday interview with Bloomberg Television, Lutnick said that Trump would update his tariff plans with an afternoon announcements, possibly sparing sectors such as autos from the import taxes.",
      "publishedAt": "2025-03-05T14:00:52Z",
      "title": "Trump administration signals that the tariffs against Canada and Mexico may soon have exemptions",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-lutnick-2b269614084027a4894aa14f3dc16227",
      "urlToImage": "https://dims.apnews.com/dims4/default/48ad772/2147483647/strip/true/crop/6834x3844+0+356/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F5d%2Fe1ed99eccd7c87f070165de5b097%2Fea9d7970e09447939fcd69884171d1a7"
    },
    {
      "author": "Josh Funk, Melina Walling",
      "description": "Farmers and meat producers across the U.S. can expect the new tariffs on Mexico, Canada and China and the retaliation to hurt their bottom lines by billions of dollars if they stay in place a while. And consumers could quickly see that result in higher prices at the grocery store for some things. But some of the impact might not be felt until the next harvest and the price of corn, wheat and soybeans accounts for relatively little of the price of most products consumers buy. Plus, President Donald Trump could offer farmers significant aid payments to offset some of the losses. But if the tariffs make farmers and consumers uneasy about spending that would hurt the economy overall.",
      "publishedAt": "2025-03-05T16:48:58Z",
      "title": "Trump says as both farmers and consumers brace for tariff effects",
      "url": "https://apnews.com/article/trump-tariffs-farms-farmers-mexico-canada-china-prices-3a460f004633c10a6da6c4f97627dd13",
      "urlToImage": "https://dims.apnews.com/dims4/default/54ab847/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F73%2Fedcf6ff4510e46b1b13448bba94e%2F7a866dff098043b48f88b8c23944584a"
    },
    {
      "author": "Will Weissert, Valerie Gonzalez",
      "description": "Vice President JD Vance has participated in an aerial tour of the U.S.-Mexico border and met with law enforcement officials. It's part of a trip Wednesday meant to highlight tougher immigration policies that the White House says has led to dramatically fewer arrests for illegal crossings since President Donald Trump began his second term. Joined by Defense Secretary Pete Hegseth and Director of National Intelligence Tulsi Gabbard, Vance viewed the Eagle Pass area by helicopter. The trio also visited a detention facility before holding a roundtable discussion with local and national participants. Arrests for illegal border crossings from Mexico fell 39% in January from a month earlier, though they’ve been falling sharply since well before Trump took office",
      "publishedAt": "2025-03-05T12:01:11Z",
      "title": "Vance visits the US-Mexico border to tout Trump's immigration crackdown",
      "url": "https://apnews.com/article/vance-border-visit-mexico-texas-gabbard-hegseth-066a1891e51890d50b48fb55191f0dcc",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c78f0a/2147483647/strip/true/crop/7401x4163+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F02%2Fd1e987711e8012cff62d1ad7ad9f%2Fa721385931464f3893b867945f13d023"
    },
    {
      "author": "Lisa Mascaro",
      "description": "Elon Musk has visited Capitol Hill for private meetings with Republicans about his Department of Government Efficiency's budget slashing. GOP senators told the billionaire aide to President Donald Trump about budget rescissions, an obscure legislative tool that could bring legal heft to his effort and enshrine the cuts into law. The meeting comes as the courts are looking skeptically at the legality of the Trump administration’s actions and as lawmakers’ town halls are being overrun by protesters pushing for answers as tens of thousands of federal workers are being fired. Musk met later with House Republicans and said he's making “good progress.” Republicans are eager to show voters the cuts are producing real savings.",
      "publishedAt": "2025-03-06T00:26:18Z",
      "title": "Elon Musk meets with Republicans who discuss turning DOGE cuts into law",
      "url": "https://apnews.com/article/trump-musk-doge-cuts-congress-5f2101c129924c9d416437aca05e1e11",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a330f7/2147483647/strip/true/crop/6763x3804+0+352/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F1c%2Fc15b47474f10616aedcbeb480aa1%2F90f02604f3af475d9fe8152b4b4059d1"
    },
    {
      "author": "Aamer Madhani, Samy Magdy",
      "description": "President Donald Trump has issued what he calls a “last warning” to Hamas to release all remaining hostages held in Gaza. Trump, in a statement on his Truth Social platform soon after meeting eight former hostages at the White House on Wednesday, added that he was “sending Israel everything it needs to finish the job.” The sharp language from Trump came as the White House said Wednesday that U.S. officials have engaged in “ongoing talks and discussions” with Hamas officials, stepping away from a long-held U.S. policy of not directly engaging in the militant group.",
      "publishedAt": "2025-03-05T18:52:25Z",
      "title": "Trump issues 'last warning' to Hamas to release all remaining hostages",
      "url": "https://apnews.com/article/hamas-israel-trump-ceasefire-bdc21f862b073dd478e0960ebfbf71e3",
      "urlToImage": "https://dims.apnews.com/dims4/default/7230465/2147483647/strip/true/crop/4709x2649+0+245/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F14%2F451dc26e993fbce8948ac5eae751%2Fae9c51208e0f4fcbb7938e452197fcaf"
    },
    {
      "author": null,
      "description": "A South Korean fighter jet has accidentally dropped eight bombs on a civilian area during training, reportedly injuring seven people on the ground. The South Korean air force says the MK-82 bombs “abnormally” released by the KF-16 fighter jet fell outside a firing range on Thursday morning. The air force has apologized for causing civilian damages. It says it'll establish a committee to investigate why the accident happened. South Korean media report the bombing injured five civilians and two soldiers.",
      "publishedAt": "2025-03-06T03:49:55Z",
      "title": "South Korean fighter jet accidentally drops bombs, injures 7 people",
      "url": "https://apnews.com/article/south-korea-fighter-jet-accidental-bombing-4e2b2cc86b8510eed1849b9b24890880",
      "urlToImage": "https://dims.apnews.com/dims4/default/26203bd/2147483647/strip/true/crop/2568x1445+0+34/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2Fa8%2Fce40af9e30c718fe5937ee228bfb%2F0667509e2deb44fe97596067489b83ee"
    },
    {
      "author": "Charlotte Graham-mclay",
      "description": "New Zealand’s High Commissioner to the United Kingdom has lost his job over remarks he made about President Donald Trump at an event held by the international affairs think tank Chatham House in London this week. Phil Goff alluded to a speech the British politician Winston Churchill gave in 1938 decrying Britain's signing of the Munich Agreement with Adolf Hitler. “President Trump has restored the bust of Churchill to the Oval Office. But do you think he really understands history?” Goff asked the guest speaker. New Zealand’s Foreign Minister Winston Peters said Goff’s comments were “disappointing” and made the envoy’s position “untenable.”",
      "publishedAt": "2025-03-06T01:06:56Z",
      "title": "New Zealand sacks ambassador to UK over remarks about President Trump",
      "url": "https://apnews.com/article/trump-goff-zealand-uk-diplomat-chatham-london-3c3a55e5b45170da815f76ff5873ab70",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c8989d/2147483647/strip/true/crop/4921x2768+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F78%2F2d67511bf3451a47ff065b436c9d%2F724325b9429749fa8188d9cce0407997"
    },
    {
      "author": "Mark Sherman",
      "description": "A sharply divided Supreme Court has rejected a Trump administration push to rebuke a federal judge who imposed a quick deadline to release billions of dollars in foreign aid. By a 5-4 vote Wednesday, the court told U.S. District Judge Amir Ali to clarify his earlier order that required the Republican administration to release nearly $2 billion in aid for work that had already been done. Justice Samuel Alito led four conservative justices in dissent, saying Ali lacks the authority to order the payments. Alito wrote that he is stunned the court is rewarding “an act of judicial hubris.”",
      "publishedAt": "2025-03-05T14:13:31Z",
      "title": "Divided Supreme Court reinstates order requiring Trump administration to release frozen foreign aid",
      "url": "https://apnews.com/article/supreme-court-trump-usaid-foreign-billions-30b8bde0b16c0bd68f8b690f14923c50",
      "urlToImage": "https://dims.apnews.com/dims4/default/185178d/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Ff3%2F037f98fcb4f310f35173da606ec6%2F263d4bd9234b47c2ac293ee41794f771"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}