{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY, and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Palestinian authorities on Tuesday called for a cease-fire to evacuate three dozen newborns and other patients trapped inside Gaza’s biggest hospital as Israeli forces battled Hamas in the streets just outside and seized more ground across northern Gaza.",
      "publishedAt": "2023-11-14T07:55:45Z",
      "title": "Calls grow to evacuate Gaza's largest hospital as Israel and Hamas battle just outside",
      "url": "https://apnews.com/42d3e99d81672d166e720e7520796c41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/deecac412b1d4e44a5c79bb653c4fabc/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Gaza’s Shifa Hospital has become the focus of a dayslong stalemate in Israel’s war against the Hamas militant group.Shifa is Gaza’s largest and best-equipped hospital. Israel, without providing visual evidence, claims the facility also is used by Hamas for military purposes.",
      "publishedAt": "2023-11-13T22:00:39Z",
      "title": "Is Hamas hiding in Gaza's main hospital? Israel's claim is now a focal point in a dayslong stalemate",
      "url": "https://apnews.com/ce8fda9821a011a6cb6e4a3df5c90916",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a5fdd4fc05a41ed8a1d5821ca2fcc1f/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and COLLEEN LONG",
      "description": "SAN FRANCISCO (AP) — President Joe Biden said on the eve of his much-anticipated meeting with China's Xi Jinping that his goal for the talks is simply to try to get U.S.-Chinese communications back on stable ground after a tumultuous year.",
      "publishedAt": "2023-11-14T05:09:31Z",
      "title": "Biden says his goal for Xi meeting is to get US-China communications back to normal",
      "url": "https://apnews.com/3da195342650591f6bb436c864e19328",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49cc9ce7e5a0467a87ca9620b74257af/3000.jpeg"
    },
    {
      "author": "TERRY TANG and LINLEY SANDERS",
      "description": "Despite ongoing advocacy and legislation to combat anti-Asian racism that arose after the pandemic, about a third of Asian Americans and Pacific Islanders say they have experienced an act of abuse based on their race or ethnicity in the last year, including being on the receiving end of verbal harassment, slurs, physical threats or cyberbullying.",
      "publishedAt": "2023-11-14T05:03:19Z",
      "title": "1 in 3 US Asians and Pacific Islanders faced racial abuse this year, AP-NORC/AAPI Data poll shows",
      "url": "https://apnews.com/e5e8c8928dd286b48098a94c5e5f184f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/073369a0c7f6403583c2d0b040fa5ef1/3000.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — Earlier this year, the doctor who leads the World Health Organization’s efforts to prevent sexual abuse travelled to Congo to address the biggest known sex scandal in the U.N. health agency’s history, the abuse of well over 100 local women by staffers and others during a deadly Ebola outbreak.",
      "publishedAt": "2023-11-14T06:14:14Z",
      "title": "Internal documents show the World Health Organization paid sexual abuse victims in Congo $250 each",
      "url": "https://apnews.com/f0720f9c241102a220a8d5b4a7fe52cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d14aab63f74044d8ae64bf25e4d5dde8/2000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and TAMMY WEBBER",
      "description": "Revved-up climate change now permeates Americans’ daily lives with harm that is “already far-reaching and worsening across every region of the United States,\" a massive new government report says.",
      "publishedAt": "2023-11-14T10:05:37Z",
      "title": "Worsening warming is hurting people in all regions, US climate assessment shows",
      "url": "https://apnews.com/a419265bb733adcb7c62b4111028aa0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3e83e9e525842d38c1fdc4728dc0835/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Thousands marched in Mexico's capital Monday night demanding justice for Jesús Ociel Baena, an influential LGBTQ+ figure who was found dead at home in the central city of Aguascalientes after receiving death threats.",
      "publishedAt": "2023-11-14T05:05:46Z",
      "title": "Thousands in Mexico demand justice for LGBTQ+ figure found dead after death threats",
      "url": "https://apnews.com/148d5bcf5cec7952fa5b86d5b64882ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41788072a4274253967acebf8cd2d97f/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The last time Congress tried to fund the government to prevent a federal shutdown, it cost House Speaker Kevin McCarthy his job.",
      "publishedAt": "2023-11-14T05:05:47Z",
      "title": "The last government shutdown deadline ousted the House speaker. This week's showdown could be calmer",
      "url": "https://apnews.com/9cb26b703804a9e82e776e44caedcaa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee34c6177b1e43819bb6a4e37ff1f922/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ and KENYA HUNTER",
      "description": "WASHINGTON (AP) — Up to 30 million of the poorest Americans could be purged from the Medicaid program, many the result of error-ridden state reviews that poverty experts say the Biden administration is not doing enough to stop.",
      "publishedAt": "2023-11-14T05:24:01Z",
      "title": "The Biden administration is slow to act as millions are booted off Medicaid, advocates say",
      "url": "https://apnews.com/fe7c10276e86ab909060dd6fbea60328",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9e8075fff4649f6a21019b9a333e3b3/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "ACAPULCO, Mexico (AP) — During the first minutes of Oct. 25 when Hurricane Otis roared into Acapulco Bay with 165 mph winds, sailor Ruben Torres recorded a 10-second audio message from a yacht called the Sereno.",
      "publishedAt": "2023-11-14T05:27:12Z",
      "title": "A missing sailor's last message from Hurricane Otis was to ask his family to pray for him",
      "url": "https://apnews.com/9d804784735d916e5926271c9cde9565",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e33f33aa5cf54b98b4a4b66aad3ab57e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}