{
  "articles": [
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Working furiously to take control of a House in disarray, allies of Speaker Kevin McCarthy implored their Republican colleagues Saturday to drop their hardline tactics and work together to approve a conservative spending plan to prevent a federal shutdown.",
      "publishedAt": "2023-09-23T21:24:35Z",
      "title": "With House Republicans in turmoil, colleagues implore GOP holdouts not to shut down government",
      "url": "https://apnews.com/249d83636e9d61cdd2aabdf34a129514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f58ba0500e394a5d93caef0eb66ef7cf/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KRAMATORSK, Ukraine (AP) — Among the hundreds of trains criss-crossing Ukraine’s elaborate railway network every day, the Kyiv-Kramatorsk train stands apart, shrouded in solemn silence as passengers anticipate their destination.",
      "publishedAt": "2023-09-24T04:14:27Z",
      "title": "A Ukrainian train is a lifeline connecting the nation's capital with the front line",
      "url": "https://apnews.com/4e0547023d456e9f1a0c33372704cdf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27252625e34849f0be618821f14a570e/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden is set to announce the opening of new U.S. embassies on Cook Islands and Niue on Monday as the Democratic administration aims to demonstrate to Pacific Island leaders that it remains committed to increasing American presence in the region.",
      "publishedAt": "2023-09-24T09:00:35Z",
      "title": "The US is set to open embassies in the Cook Islands and Niue as Biden hosts a Pacific leaders summit",
      "url": "https://apnews.com/c07493a9c05893e1477d991cf07b9ffb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2351b9a8e4448629b829ec1206c58b3/3000.jpeg"
    },
    {
      "author": null,
      "description": "TORONTO (AP) — Information shared by members of an intelligence-sharing alliance was part of what Canadian Prime Minister Justin Trudeau used to make public allegations of the Indian government's possible involvement in the assassination of a Sikh Canadian, the U.S.",
      "publishedAt": "2023-09-23T18:44:57Z",
      "title": "US diplomat says intelligence from 'Five Eyes' nations helped Canada to link India to Sikh's killing",
      "url": "https://apnews.com/c475ac129e09e5f1c9ebf68eaaf247ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e010ee35b244e4aa5d72ab468b9abee/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — Wildfires fueled by climate change have ravaged communities from Maui to the Mediterranean this summer, killing many people, exhausting firefighters and fueling demand for new solutions.",
      "publishedAt": "2023-09-24T07:08:24Z",
      "title": "The threat of wildfires is rising. So is new artificial intelligence solutions to fight them",
      "url": "https://apnews.com/62002360f2e3be32ccc7df020239efea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/672da93283644fea8ec881450554538e/3000.jpeg"
    },
    {
      "author": "BRIAN WITTE and JONATHAN MATTISE",
      "description": "ANNAPOLIS, Md. (AP) — Tropical Storm Ophelia was downgraded to a post-tropical low on Saturday night but continued to pose a threat of coastal flooding and flash floods in the mid-Atlantic region, the U.S.",
      "publishedAt": "2023-09-24T05:22:41Z",
      "title": "Mid-Atlantic coast under flood warnings as Ophelia weakens to post-tropical low and moves north",
      "url": "https://apnews.com/326b445a9ae54d03e9c1026528f15539",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03c72056f7174767b79938414c4bf110/2000.jpeg"
    },
    {
      "author": "BARRY HATTON and HELENA ALVES",
      "description": "COSTA DA CAPARICA, Portugal (AP) — Sofia Oliveira was 12 years old when catastrophic wildfires in central Portugal killed more than 100 people in 2017. She “felt it was now or never to raise our voices” as her country appeared to be in the grip of deadly human-caused climate change.",
      "publishedAt": "2023-09-24T03:02:20Z",
      "title": "Six young activists devote years to climate fight with 32 governments. Now comes their day in court",
      "url": "https://apnews.com/9bfbd337aa0e8e8b0078c574c526ad00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a79d82b6a9540cfa97bcf59ae9ad522/3000.jpeg"
    },
    {
      "author": "AREF TUFAHA",
      "description": "NOUR SHAMS REFUGEE CAMP, West Bank (AP) — Two Palestinians were killed during an Israeli military raid Sunday in the northern West Bank, Palestinian health officials said, the latest bloodshed in a surge of violence during a sensitive Jewish holiday period.",
      "publishedAt": "2023-09-24T05:56:36Z",
      "title": "Israeli military raid kills 2 Palestinians in West Bank. Israel says its troops came under fire",
      "url": "https://apnews.com/ba539fdd4b36b786cf55ba6a420a12cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/237b490644e049babe32c84e8d06e604/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "A space capsule carrying NASA’s first asteroid samples streaked toward a touchdown in the Utah desert Sunday to cap a seven-year journey.",
      "publishedAt": "2023-09-24T11:22:16Z",
      "title": "NASA's first asteroid samples streaking toward Earth after release from spacecraft",
      "url": "https://apnews.com/9918c2c13b689e01800de4ea42d60188",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b8f0943c0bd450eb0875020d807d10f/1920.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "IRAPUATO, Mexico (AP) — As a train roared in the distance, some 5,000 mostly Venezuelan migrants hoping to make it to the U.S. snapped into action.Families with young children sleeping on top of cardboard boxes and young men and women tucked away in tents under a nearby bridge scrambled to pack their things.",
      "publishedAt": "2023-09-24T04:07:50Z",
      "title": "Migrants hoping to reach US continue north through Mexico by train amid historic migration levels",
      "url": "https://apnews.com/5525cff00a2e8594b0c7d1ae250b7a1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d88301ba1b0472797e42c7568ca2863/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}