{
  "articles": [
    {
      "author": "KAREEM CHEHAYEB and MALAK HARB",
      "description": "AITO, Lebanon (AP) — Dany Alwan stood shaking as rescue workers pulled remains from piles of rubble where his brother’s building once stood.An Israeli airstrike destroyed the three-story residential building in the quiet Christian village of Aito a day before.",
      "publishedAt": "2024-10-29T04:25:50Z",
      "title": "As Israel strikes deeper into Lebanon, fear rises in communities where the displaced took refuge",
      "url": "https://apnews.com/395ccfd8ff7e230b474867b13e594b1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3a7cc8426a34a8db479c65a2eefe2da/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — This presidential election, the first since the Jan. 6, 2021, insurrection at the Capitol, will be a stress test of the new systems and guardrails that Congress put in place to ensure America’s long tradition of the peaceful transfer of presidential power.",
      "publishedAt": "2024-10-29T04:18:22Z",
      "title": "The first presidential election since the Jan. 6 attack will test new guardrails from Congress",
      "url": "https://apnews.com/64b1ceeeacff133731ca4af01425a7c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dead30909a3f4aba904c6580c4d3fe0e/3000.jpeg"
    },
    {
      "author": "JULIE PACE",
      "description": "Since long before the advent of the internet, smartphones or social media, The Associated Press has delivered the results of elections in the United States. Our fundamental role in the American democracy – the single largest act of journalism in the world -- dates back to 1848 when we called the White House for Zachary Taylor.",
      "publishedAt": "2024-10-29T04:04:02Z",
      "title": "For the US election, the AP performs the world's single largest act of journalism",
      "url": "https://apnews.com/1e3151554eecc16a26ac318bd3627d17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/482685796945443c8fc513e375df8529/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — After the 2020 presidential election, thousands of Donald Trump’s most fervent supporters heeded his call to join a “wild” protest of his defeat.",
      "publishedAt": "2024-10-29T04:09:49Z",
      "title": "Election threats persist four years after far-right extremists stormed the US Capitol",
      "url": "https://apnews.com/88457e7bf02a908fa2716047fc370cc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0102bfeb5d5459bbfcb06a5f1533653/2491.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — Kamala Harris will deliver her campaign's “closing argument” Tuesday from the same spot in Washington where Republican Donald Trump helped incite a mob that attacked the U.S.",
      "publishedAt": "2024-10-29T04:03:05Z",
      "title": "Harris is speaking at the same spot where Trump fanned anger on Jan. 6, 2021. Here's what happened",
      "url": "https://apnews.com/599719041f7d51b541f4f024936ad8d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e26dbad0bba483281e104ef6d7abce6/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korea said Tuesday its top diplomat is visiting Russia, in another sign of their deepening relations as rival South Korea and Western nations say the North has sent thousands of troops to support Russia’s war in Ukraine.",
      "publishedAt": "2024-10-29T03:35:32Z",
      "title": "North Korea sends foreign minister to Russia as its troops train to fight in Ukraine",
      "url": "https://apnews.com/c67d98128d06e8959aa34f21428f5081",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be48ab13d9104c5e84a8416e0b4146e1/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "DEARBORN, Mich. (AP) — Bowls of labneh and platters of za’atar bread covered the tables in a Lebanese restaurant near Detroit, yet no one seemed to have much of an appetite.On one side were Kamala Harris ’ top emissaries to the Arab American community.",
      "publishedAt": "2024-10-29T04:23:32Z",
      "title": "Arab American voters make their choice — Harris, Trump or neither — in the election's final days",
      "url": "https://apnews.com/2b698c34863aa1ec5956d9536479d115",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bab9999f91fa424b8329a7c0bc905ad0/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK and RUTH ALONGA",
      "description": "GOMA, Congo (AP) — The end of one of the world's deadliest and yet most shadowy wars is as difficult to predict as the end of the large peacekeeping force meant to contain it.Congo desperately wants stability in its mineral-rich east, of intense interest to the global economy.",
      "publishedAt": "2024-10-29T04:40:12Z",
      "title": "Congo wants UN peacekeepers gone. But endless war around minerals is complicating that",
      "url": "https://apnews.com/14cbff3d836c20174a1e2d21e2b04714",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/344706fe5d434384980e9b0d16511a5a/1920.jpeg"
    },
    {
      "author": "MIKE FITZPATRICK",
      "description": "NEW YORK (AP) — Freddie Freeman homered for the third straight game and Walker Buehler pitched another World Series gem as the Los Angeles Dodgers beat the New York Yankees 4-2 on Monday night for a 3-0 lead in the Fall Classic.",
      "publishedAt": "2024-10-29T03:48:28Z",
      "title": "Freeman and Buehler lead Dodgers past slumping Yankees 4-2 for 3-0 advantage in World Series",
      "url": "https://apnews.com/d3099c04a70ae7732d69da0821e3f5dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9ee01cb54af4e678d337363aa2d8aa2/2201.jpeg"
    },
    {
      "author": null,
      "description": "DANBURY, Conn. (AP) — Longtime Donald Trump ally Steve Bannon is scheduled to be released from prison Tuesday after serving a four-month sentence for defying a subpoena in the congressional investigation into the U.S.",
      "publishedAt": "2024-10-29T04:08:29Z",
      "title": "Trump ally Steve Bannon to be released after serving 4 months in prison for contempt of Congress",
      "url": "https://apnews.com/56f2f7a17ae2273a29a0829234f56fae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2720f106f38f42a983aac4be4f26f0e1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}