{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel ordered new evacuations from parts of Gaza City on Tuesday, as a study led by the U.N. children's agency found that one in six children are acutely malnourished in the isolated and largely devastated north of the territory, where the city is located.",
      "publishedAt": "2024-02-20T07:35:18Z",
      "title": "Israel orders new evacuations in northern Gaza, where UN says 1 in 6 children are malnourished",
      "url": "https://apnews.com/26d2afd9b81868c74ff2e4393692f91f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9db0b1d46304a0aa075cf9a39e36141/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — Arab nations are putting to a vote a U.N. resolution demanding an immediate humanitarian cease-fire in Gaza, knowing it will be vetoed by the United States but hoping to show broad global support for ending the Israel-Hamas war.",
      "publishedAt": "2024-02-20T05:07:53Z",
      "title": "The UN Security Council is voting on a Gaza cease-fire on Tuesday, with the US certain to veto",
      "url": "https://apnews.com/350c86ef261bf1a00a2515cf22764de5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05e8e558c8544a9381a726cffc082269/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Despite a month of U.S.-led airstrikes, Yemen's Iran-backed Houthi rebels remain capable of launching significant attacks — just this week, they seriously damaged a ship in a crucial strait and apparently downed an American drone worth tens of millions of dollars.",
      "publishedAt": "2024-02-20T09:28:03Z",
      "title": "Ship attacks and downing US drones. Yemen's Houthis still put up a fight despite US-led airstrikes",
      "url": "https://apnews.com/6ac2a1bf5032ed0531258816907cfe2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/433b1da1abb045cf8a55640ab04a4d43/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "When the invasion of Ukraine began in February 2022, some analysts predicted it might take as few as three days for Russian forces to capture the capital of Kyiv.",
      "publishedAt": "2024-02-20T05:07:33Z",
      "title": "As the Ukraine war enters a third year, Putin waits for Western support for Kyiv to wither",
      "url": "https://apnews.com/fb2db02ef51683eb6d7c85c0235577f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92c18fff68fb4fa18ac9e54fffbe48e9/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden heads to California on Tuesday looking to soak up more cash for his reelection bid during a three-day swing through the state.",
      "publishedAt": "2024-02-20T10:02:04Z",
      "title": "Biden heads to California to rev up his fundraising in anticipation of costly rematch with Trump",
      "url": "https://apnews.com/87ae7fe3a8c742d53d034322d450462d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a9c8284b41245eebe222f6d179bb741/3000.jpeg"
    },
    {
      "author": "JOHN HANNA",
      "description": "A man who died after fatally shooting two police officers and a firefighter in a wooded Minneapolis-area neighborhood wasn't legally allowed to have guns after a previous assault conviction and was entangled in a yearslong dispute over the custody and financial support of his three oldest children, court records show.",
      "publishedAt": "2024-02-19T23:37:32Z",
      "title": "Minnesota man who shot 2 officers and a firefighter wasn't allowed to have guns",
      "url": "https://apnews.com/c6e27aa84e577c27d5e44f5f2c9c4004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60c4caea33dd434e8a98bf4d9d48a180/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — One afternoon in mid-December, Pope Francis had a meeting that wasn’t on his official agenda or otherwise recorded, that underscored the utter dysfunction of the Catholic Church’s response to the global clergy sex abuse scandal.",
      "publishedAt": "2024-02-20T05:12:20Z",
      "title": "Long after pope's abuse summit, victims still traumatized by the system meant to address their cases",
      "url": "https://apnews.com/6cfef8f4e77db777df660bbc4d855758",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bb2b6c349fd41879756724405370279/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO and EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A judge in Haiti responsible for investigating the July 2021 assassination of President Jovenel Moïse has indicted his widow, Martine Moïse, ex-prime minister Claude Joseph and the former chief of Haiti’s National Police, Léon Charles, among others, according to a report obtained Monday.",
      "publishedAt": "2024-02-19T23:02:46Z",
      "title": "Widow, ex-prime minister and former police chief indicted in 2021 assassination of Haiti's president",
      "url": "https://apnews.com/9b70e2dd91e7bbb48737df89f76a689d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93d438312c2e490bafd77cc93100aecd/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Julian Assange's lawyers began their final U.K. legal challenge Tuesday to stop the WikiLeaks founder from being sent to the United States to face spying charges, arguing that his actions had exposed serious criminal actions by U.S.",
      "publishedAt": "2024-02-20T05:18:16Z",
      "title": "WikiLeaks founder Assange starts final UK legal battle to avoid extradition to US on spy charges",
      "url": "https://apnews.com/48e6786241f35064833e40060a90279a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47a9862a31524ce682d0fe60cc9f4572/3000.jpeg"
    },
    {
      "author": "KEN SWEET",
      "description": "NEW YORK (AP) — Capital One Financial said it will buy Discover Financial Services for $35 billion, in a deal that would bring together two of the nation's credit card companies as well as potentially shake up the payments industry, which is largely dominated by Visa and Mastercard.",
      "publishedAt": "2024-02-20T01:50:26Z",
      "title": "Capital One to buy Discover for $35 billion in deal that combines major US credit card companies",
      "url": "https://apnews.com/3444782717e668b896883f09bda27baa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b44460fe6e694ff4aea5f2b042c33528/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}