{
  "articles": [
    {
      "author": "SAMY MAGDY, ABBY SEWELL, TARA COPP and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden will announce Thursday that he is directing the U.S. military to help set up a temporary port off the Gaza coast, opening a sea route for food and other aid for desperate Palestinian civilians trapped in the Israel-Hamas war, senior U.S.",
      "publishedAt": "2024-03-07T11:22:43Z",
      "title": "Biden will announce plans for a temporary aid port on Gaza's coast as cease-fire talks stall",
      "url": "https://apnews.com/5657eedc005040694a9ab935ce3e39e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db4733cc79154e33bb5cb0d618e74a93/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is set to use his State of the Union address Thursday to promote his vision for a second term to a dispirited electorate that questions whether he's up to the job and to warn that GOP front-runner Donald Trump would be a dangerous alternative.",
      "publishedAt": "2024-03-07T05:03:44Z",
      "title": "Biden will try to use State of the Union address to convince voters he deserves a second term",
      "url": "https://apnews.com/1a42ff9d4ef3e0f2753e43ac8d39fc18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8977b0e34a64947ab8eb2bf3f66c5e4/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The invitation list for President Joe Biden's State of the Union address on Thursday speaks volumes about what Democrats and Republicans want to focus on as the 2024 election season heats up.",
      "publishedAt": "2024-03-07T10:04:26Z",
      "title": "State of the Union guests spotlight divide on abortion and immigration but offer some rare unity",
      "url": "https://apnews.com/003c5da894f9fd7af2c8289a267ac7b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d90fdc8676547eaaf4e51350fef1e7d/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The House on Thursday passed a bill that would require federal authorities to detain unauthorized immigrants who have been accused of theft, as Republicans seized on the recent death of a nursing student in Georgia to rebuke President Joe Biden's border policies just hours ahead of his State of the Union address.",
      "publishedAt": "2024-03-07T19:28:36Z",
      "title": "House Republicans push bill to detain migrants accused of theft after Georgia student killed",
      "url": "https://apnews.com/34b06b0829772900eb55c123fe151845",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e41e7f64b19d4624b27eb0b00c747cea/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "Power lines ignited massive wildfires across the Texas Panhandle that killed at least two people, destroyed homes and livestock, and left a charred landscape, officials said Thursday, including the largest blaze in state history.",
      "publishedAt": "2024-03-07T15:14:36Z",
      "title": "Power lines ignited the largest wildfire in Texas history and one nearby, officials say",
      "url": "https://apnews.com/22540df0a0c1d2c42a7fe0284858845a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea2a40ba7ad349389856e81be9ca2b0d/2684.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "UVALDE, Texas (AP) — An investigation Uvalde city leaders ordered into the Robb Elementary School shooting put no blame on local police officers and defended their actions Thursday, despite acknowledging a series of rippling failures during the fumbled response to the 2022 classroom attack that left 19 children and two teachers dead.",
      "publishedAt": "2024-03-07T05:14:12Z",
      "title": "Uvalde parents lash out after new report clears city police of missteps during Texas school attack",
      "url": "https://apnews.com/b5c9f8204f33f62f720a7c1644b47ffc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed943aa50ca242008e5836ad4d63b5d1/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN",
      "description": "MIAMI (AP) — When Haitian Prime Minister Ariel Henry filled the void left by the assassination of the country’s president in 2021, he did so over the protest of wide segments of the population but with the full-throated support of the Biden administration.",
      "publishedAt": "2024-03-07T17:13:50Z",
      "title": "'They messed it up': Biden's backing for Haiti's unpopular leader digs US into deeper policy hole",
      "url": "https://apnews.com/c79d6c330f2074e44c08decaca2bc1f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a711963920d408188c360ce8004c1d4/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and LORNE COOK",
      "description": "WASHINGTON (AP) — Sweden on Thursday formally joined NATO as the 32nd member of the transatlantic military alliance, ending decades of post-World War II neutrality and centuries of broader non-alignment with major powers as security concerns in Europe have spiked following Russia’s 2022 invasion of Ukraine.",
      "publishedAt": "2024-03-07T16:29:28Z",
      "title": "Sweden officially joins NATO, ending decades of post-World War II neutrality",
      "url": "https://apnews.com/8372bc866c8ddcf42d2b8209fa5cd2b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1dc0d2b324f4bf9b4438270b5a8a90b/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Millions of Americans who have dropped pounds and boosted their health using popular obesity drugs like Wegovy are facing a new dilemma: What happens if they stop taking them?Many worry, rightly, that they’ll regain weight and revert to old habits.",
      "publishedAt": "2024-03-07T06:01:34Z",
      "title": "Weight-loss drugs like Wegovy are meant for long-term use. Some patients want to stop",
      "url": "https://apnews.com/0d2b4e3f055dfd1b02a1d330db805c52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30e7cf9c14a0406d95e463a4da2f6e99/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — The Oscars are poised to do something on Sunday that they haven’t done in a very long time: Hand its top award to a blockbuster.After years of favoring smaller movies like “The Shape of Water” and “Nomadland, ” the clear best-picture favorite “Oppenheimer” — with just shy of $1 billion in tickets sold — is steam rolling toward the kind of big-movie dominance the Academy Awards hasn’t seen in two decades.",
      "publishedAt": "2024-03-07T18:50:24Z",
      "title": "And the Oscar goes to ... a movie most people have seen",
      "url": "https://apnews.com/5dd72660915a7aad6fe8e358172dad69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0a92e7345cf4397926f4c132d3941cd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}