{
  "articles": [
    {
      "author": "CLAIRE RUSH, AUDREY MCAVOY and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — Parishioners mourned the dead and prayed for the missing Sunday in Hawaii churches as communities began looking ahead to a long recovery from last week's wildfire that demolished a historic Maui town and killed more than 90 people.",
      "publishedAt": "2023-08-13T04:28:09Z",
      "title": "Hawaii churches offer prayers for the dead and the missing after devastating Maui wildfires",
      "url": "https://apnews.com/fb2ebf6cd39c149a582b82eed6ac3930",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98cdb9256f144a8b9a180c6a492d337e/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Long before the FBI began investigating Donald Trump 's hoarding of classified documents or Attorney General Merrick Garland appointed a special prosecutor to probe the former president, Fani Willis was at work.",
      "publishedAt": "2023-08-14T04:05:27Z",
      "title": "How Fani Willis oversaw what might be the most sprawling legal case against Donald Trump",
      "url": "https://apnews.com/32bfdd2cca9d3184056836b208a78379",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/965e3f683ee94c2fbb47fd969cfa1781/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "BRANDON, Miss. (AP) — Six former Mississippi law officers are expected to plead guilty to state charges on Monday for torturing two Black men in a racist assault after recently admitting their guilt in a connected federal civil rights case.",
      "publishedAt": "2023-08-14T04:20:05Z",
      "title": "Former Mississippi officers expected to plead guilty to state charges for racist assault",
      "url": "https://apnews.com/a04261f338812a0aaf43b4b7efa8c944",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4f31989a3004b55b03e323ce5dd6aec/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — Belen Diaz was walking home from college one evening when a motorcycle carrying two men made a menacing U-turn.Terrified that she was about to be robbed for the eighth time in three years, the teaching student banged on a cab window until the driver drove her home.",
      "publishedAt": "2023-08-14T04:13:45Z",
      "title": "Ecuador was calm and peaceful. Now hitmen, kidnappers and robbers walk the streets",
      "url": "https://apnews.com/4f96684926c2600e2483373555a7cf42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/297ef12ea7794c58810c5e7f08e22840/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Seven people – including a 23-day-old baby girl – were killed in Russian shelling in Ukraine's southern Kherson region on Sunday, the country's Internal Affairs Ministry said.Artillery shelling in the village of Shiroka Balka, on the banks of the Dnieper River killed a family — a husband, wife, 12-year-old boy and 23-day-old girl — and another resident.",
      "publishedAt": "2023-08-13T11:29:13Z",
      "title": "7 killed in Ukraine's Kherson region, including a 23-day-old baby girl",
      "url": "https://apnews.com/95be9d8fbe3e3c3f8c39908a7ab1f0c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ccb00de704245918be0348c740ed892/3000.jpeg"
    },
    {
      "author": "JOHN HANNA",
      "description": "TOPEKA, Kan. (AP) — As children across the U.S. head back to classes and practices for fall sports, four more states are expecting their K-12 schools to keep transgender girls off their girls teams.",
      "publishedAt": "2023-08-14T04:08:06Z",
      "title": "More states expect schools to keep trans girls off girls teams as K-12 classes resume",
      "url": "https://apnews.com/ec0b1d2ea162855131264c88bb992e2e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b37252532d96436686f2638c87ec04c0/3000.jpeg"
    },
    {
      "author": "KANIS LEUNG",
      "description": "HONG KONG (AP) — Seven of Hong Kong’s most prominent pro-democracy advocates had part of their convictions quashed Monday over their roles in one of the biggest pro-democracy protests in 2019. Jimmy Lai, founder of the now-defunct Apple Daily newspaper; Martin Lee, the founding chairman of the city’s Democratic Party; and five former pro-democracy lawmakers, including barrister Margaret Ng, had been found guilty of organizing and participating an unauthorized assembly.",
      "publishedAt": "2023-08-14T02:46:12Z",
      "title": "Prominent Hong Kong democracy activists partially win bid to quash convictions over 2019 protest",
      "url": "https://apnews.com/9f230dc34533484acc8357ffd58cfd29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef4db2ac508d43ffabc214d550a1f02f/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un again toured major munitions factories and has ordered a drastic increase in production of missiles and other weapons, state media said Monday, as the South Korean and U.S.",
      "publishedAt": "2023-08-14T00:20:20Z",
      "title": "North Korea's Kim orders sharp increase in missile production, days before US-South Korea drills",
      "url": "https://apnews.com/c210abfa3f4c01ce08a235ce153d198b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5f6abc947c54254bb6a7995dbcfa11f/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI",
      "description": "BUENOS AIRES, Argentina (AP) — Far-right populist Javier Milei rocked Argentina’s political establishment Sunday by emerging as the biggest vote-getter in primary elections to choose presidential candidates for the October general election in a nation battered by economic woes.",
      "publishedAt": "2023-08-13T04:32:08Z",
      "title": "Far-right populist emerges as biggest vote-getter in Argentina's presidential primary voting",
      "url": "https://apnews.com/a4fdbe888b7f561c3833ba4eca7e5d72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06d4b9735bae4a47ac0cedf1aa7789a0/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — One week after a deadline passed for mutinous soldiers in Niger to reinstate the country's ousted president or face military intervention, the junta has not acquiesced. No military action has been taken and the coup leaders appear to have gained the upper hand over the regional group that issued the threat, analysts say.",
      "publishedAt": "2023-08-13T07:59:17Z",
      "title": "Niger's junta gains the upper hand over the regional bloc threatening military force, analysts say",
      "url": "https://apnews.com/57900b121d1fa1499354ed21aca994d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c52a359eedd74c6aa4ad6405dfbd195f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}