{
  "articles": [
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Commandos from Iran's paramilitary Revolutionary Guard rappelled from a helicopter onto an Israeli-affiliated container ship near the Strait of Hormuz and seized the vessel Saturday in the latest attack between the two countries.",
      "publishedAt": "2024-04-13T08:20:12Z",
      "title": "Iran's Revolutionary Guard seizes a container ship near Strait of Hormuz amid tensions with Israel",
      "url": "https://apnews.com/33fcffde2d867380e98c89403776a8ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a39b2348f354478a8558c9f41808dd12/1920.jpeg"
    },
    {
      "author": "NASSER NASSER and JACK JEFFERY",
      "description": "Al-MUGHAYYIR, West Bank (AP) — Israeli settlers in the occupied West Bank went on the largest rampage against Palestinians there since the war in Gaza began, as Israel's army said Saturday the body of a missing Israeli teen was found after he was killed in a “terrorist attack.” Witnesses said settlers assaulted a number of communities.",
      "publishedAt": "2024-04-13T12:02:13Z",
      "title": "West Bank sees biggest settler rampage since war in Gaza began as Israeli teen's body is found",
      "url": "https://apnews.com/7e75e1ef8f5307946d24f8b9a190fd66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/882d3682c05e45fba74e4ee3dd8609af/1920.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI and CHRISTINE FERNANDO",
      "description": "NASHVILLE, Tenn. (AP) — For decades, only three people knew Gloria Johnson had had an abortion.But a year of watching women and doctors agonize under Tennessee's strict abortion ban kicked up a fire in the longtime Democrat.",
      "publishedAt": "2024-04-13T14:49:28Z",
      "title": "Progressive candidates are increasingly sharing their own abortion stories after Roe's demise",
      "url": "https://apnews.com/1fc9f35dd526fa61c9252d4c88f215db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0ab98034c144a6ba6a02b5c024708d7/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and ERIC TUCKER",
      "description": "NEW YORK (AP) — It was the kind of tawdry tale that Donald Trump might have relished before politics: a porn actor claiming they had had sex.But on the eve of the 2016 presidential election, Trump feared the story, which he says is false, would cost him votes.",
      "publishedAt": "2024-04-13T04:01:09Z",
      "title": "How a hush money scandal tied to a porn star led to Trump’s first criminal trial",
      "url": "https://apnews.com/e40532d3bce7768e296fdaf9591ef05b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bbac647cf8e4be5b65e28196d65ba53/2000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — No woman has appeared more often before the Supreme Court than Lisa Blatt, who will make her 50th argument this month. No lawyer, male or female, has done it with quite the same mix of humor, passion and style.",
      "publishedAt": "2024-04-13T13:12:02Z",
      "title": "Nearing 50 Supreme Court arguments in, lawyer Lisa Blatt keeps winning",
      "url": "https://apnews.com/4e3a5042d299eab80a0577f8c81eb189",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/134958e02d7d44f4850cbb9e0d8cdca0/3000.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "The Ford Bronco initially was conceived and designed for rugged outdoorsy types, a two-door means of escape to nature from the bustling cities of mid-century America. But it had already been tamed and polished for suburbanites, with cruise control and air conditioning, by 1994, when O.J.",
      "publishedAt": "2024-04-13T04:46:29Z",
      "title": "How O.J. Simpson burned the Ford Bronco into America's collective memory",
      "url": "https://apnews.com/71bfec2bf12112bceb004e6dcfd321df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d979d839a7745938127f338a76d78a0/1920.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "The United Methodist Church lost one-fourth of its U.S. churches in a recent schism, with conservatives departing over disputes on sexuality and theology.",
      "publishedAt": "2024-04-13T12:09:37Z",
      "title": "As a landmark United Methodist gathering approaches, African churches weigh their future.",
      "url": "https://apnews.com/1319aea6e1d2ad8755a905a8c4b1bf79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f90dccb21874477b772aaed0c1e14eb/1400.jpeg"
    },
    {
      "author": "TOM MURPHY",
      "description": "The first drug shown to slow Alzheimer’s disease hit the U.S. market over a year ago, but sales have lagged, major hospital systems have taken months to start using it and some insurers have rejected coverage.",
      "publishedAt": "2024-04-13T12:00:27Z",
      "title": "It's the first drug shown to slow Alzheimer's. Why is is it off to a slow start?",
      "url": "https://apnews.com/f9022b85b16cc6de4491594ce875657b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89b687e9243d4bb582a6bcf8ad524a0f/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "A bird flu outbreak in U.S. dairy cows has grown to affect more than two dozen herds in eight states, just weeks after the nation's largest egg producer found the virus in its chickens.",
      "publishedAt": "2024-04-13T12:01:49Z",
      "title": "Bird flu is spreading to more farm animals. Are milk and eggs safe?",
      "url": "https://apnews.com/9d3a579b9bdb6f4d879b14b153174102",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce85c1ddfe90466a801b036c2148c74d/2903.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "AUGUSTA, Ga. (AP) — Perhaps the top perk for the 60 players who survived one of the most wind-blown, grueling days at the Masters was getting a weekend at Augusta National far more agreeable.",
      "publishedAt": "2024-04-13T14:35:01Z",
      "title": "Masters weekend has three-way tie and more forgiving conditions. It also has Tiger Woods",
      "url": "https://apnews.com/dbafb7b5d205767df5239fc3383a7a55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c530c80c230242b38000b89f3c7e46f4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}