{
  "articles": [
    {
      "author": null,
      "description": "Iran has launched retaliatory missile strikes on Israel into Saturday morning after a series of blistering Israeli attacks on the heart of Iran’s nuclear program and its armed forces, killing at least three people and wounding dozens. Israel’s assault involved warplanes as well as drones previously smuggled into the country to assault key facilities and kill top generals and scientists. Israel asserted the barrage was necessary before Iran got any closer to building an atomic weapon, although experts and the U.S. government have assessed that Tehran was actively working on such a weapon before the strikes. It also put further talks between the United States and Iran over reaching an atomic accord into doubt.",
      "publishedAt": "2025-06-14T04:14:40Z",
      "title": "Iran retaliates after Israeli strikes",
      "url": "https://apnews.com/article/iran-israel-missile-drone-attacks-nuclear-a8b23f58b502ed77a20a9d843bf30f76",
      "urlToImage": "https://dims.apnews.com/dims4/default/4554e70/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F17%2F8ea1a326b5df691c13266a8c6e79%2F1d19112e0d1240b58b94c2443b065376"
    },
    {
      "author": null,
      "description": "President Donald Trump is urging Iran to make a nuclear deal now that Israel has launched strikes against the country. Trump says on social media Iran should make a deal “before there is nothing left and save what was once known as the Iranian Empire.” Trump is holding onto hope the long-simmering dispute over Tehran’s nuclear program can be resolved. But with the Israeli military operation now underway and likely to continue for some time, Trump will be tested anew on his ability to deliver on a campaign promise to disentangle the U.S. from foreign conflicts. The Republican president is already struggling to find an endgame to the conflicts in Ukraine and Gaza.",
      "publishedAt": "2025-06-13T04:23:40Z",
      "title": "Trump faces new test after Israeli strikes on Iran",
      "url": "https://apnews.com/article/iran-israel-nuclear-weapon-trump-4fcc4013bae363f781c632ce03fea55d",
      "urlToImage": "https://dims.apnews.com/dims4/default/86fcbbe/2147483647/strip/true/crop/4641x2611+0+242/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F0b%2F9b1ce093c92d6630021a8ea26730%2F778a5685aab442aca3042c224a5a5b4d"
    },
    {
      "author": null,
      "description": "Homeland Security Secretary Kristi Noem is promising to move forward with the Trump administration’s immigration crackdown in Los Angeles despite the waves of unrest. Noem spoke Thursday, hours before a judge directed the president to return control to California over National Guard troops he deployed after protests erupted over the immigration crackdown. But the 9th U.S. Circuit Court of Appeals quickly put the brakes on that and temporarily blocked the judge's order, which was to go into effect on Friday. The judge’s order said the Guard deployment was illegal and both violated the Tenth Amendment and exceeded President Donald Trump’s statutory authority.",
      "publishedAt": "2025-06-13T05:43:24Z",
      "title": "DHS vows Trump's immigration crackdown will continue despite unrest",
      "url": "https://apnews.com/article/immigration-raids-national-guard-lawsuit-los-angeles-f4809c7f39d09e4fdfa01982f44ec995",
      "urlToImage": "https://dims.apnews.com/dims4/default/b782467/2147483647/strip/true/crop/4737x2665+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F3f%2F680e47f224ad85d4c1bd6b3f95ae%2Fcf6f81a1c61d4d51bf1312fc92fec446"
    },
    {
      "author": null,
      "description": "Cities large and small are preparing for major demonstrations across the U.S. against President Donald Trump. That's happening Saturday as officials urge calm, National Guard troops mobilize and Trump attends a military parade in Washington to mark the Army’s 250th anniversary. A flagship “No Kings” march and rally are planned in Philadelphia. The demonstrations are gaining additional fuel from protests flaring up over federal immigration enforcement raids. Governors and city officials are vowing to protect the right to protest and to show no tolerance for violence. Republican governors in Virginia, Texas and Missouri are mobilizing National Guard troops. Organizers say Philadelphia could see a crowd approaching 100,000 people.",
      "publishedAt": "2025-06-14T04:11:08Z",
      "title": "Major 'No Kings' protests against Trump planned across US",
      "url": "https://apnews.com/article/no-kings-protest-trump-philadelphia-los-angeles-immigration-raids-a3b67d23733cd060f8d01aef1e391dbf",
      "urlToImage": "https://dims.apnews.com/dims4/default/3eaf8a7/2147483647/strip/true/crop/3240x1823+0+169/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F4f%2F93d2d8fca9b392eaf380a4faa84a%2Ffed69c36ca2743499f63b5e23c43e574"
    },
    {
      "author": null,
      "description": "Israel’s sweeping attack across Iran struck at the heart of Tehran’s nuclear program, delivering a blow to the country’s ability to enrich uranium and potentially setting its nuclear ambitions back by months or years. As well as killing key military figures and nuclear scientists, the Israeli strikes destroyed part of a plant that was enriching uranium to levels far beyond the requirements for nuclear-fueled power stations. The attacks also destroyed backup power for the underground section of the plant, potentially damaging more sensitive equipment. Iran’s nuclear program has progressed rapidly since 2018, when the U.S. withdrew from a deal to limit Tehran’s capacity to enrich uranium.",
      "publishedAt": "2025-06-14T04:01:17Z",
      "title": "Israeli strikes have delivered a serious blow to Iran's nuclear program",
      "url": "https://apnews.com/article/iran-israel-nuclear-attack-uranium-enrichment-radiation-5ded3c224531adf510668c5860801882",
      "urlToImage": "https://dims.apnews.com/dims4/default/49e05ae/2147483647/strip/true/crop/5915x3327+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F40%2Fef6d174d5e49a3d63c42bbec6d25%2Ff6f2cbef8b32466e9c8eaba4049ea7ae"
    },
    {
      "author": null,
      "description": "The massive military parade that President Donald Trump has long wanted is set to step off from the Lincoln Memorial with tanks, bands and thousands of troops. And the biggest question marks are whether it will be overshadowed or delayed Saturday by either the weather in Washington or planned protests elsewhere around the country. Falling on Trump’s 79th birthday, the parade was added just a few weeks ago to the Army’s long-planned 250th anniversary celebration. It has triggered criticism for its price tag of up to $45 million and the possibility that the lumbering tanks could tear up city streets. Trump so far has shrugged off concerns about the parade cost, the rainy forecast and the potential for protests.",
      "publishedAt": "2025-06-14T04:04:52Z",
      "title": "US Army's parade to proceed despite rain, protests",
      "url": "https://apnews.com/article/trump-army-parade-troops-tanks-birthday-protests-4cca4da0e89908d39c820240744375a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/106fd8a/2147483647/strip/true/crop/4994x2809+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F6f%2F811464c685ce0bd8567aacfc4f9a%2F5af76853afaa4a4291d7bae698f4c854"
    },
    {
      "author": null,
      "description": "Authorities have begun investigating one of India’s worst aviation disasters after an Air India plane crashed a day earlier, killing all but one of the total 242 passengers and crew onboard. The Indian government has launched an investigation into the fatal crash of the London-bound Air India plane that came down in a in a residential area in the northwestern city of Ahmedabad, minutes after takeoff on Thursday. Civil Aviation Minister Ram Mohan Naidu in a statement said the Aircraft Accident Investigation Bureau has initiated the probe in line with global protocols set by the International Civil Aviation Organization. A team from the U.S. is expected in India to help with the probe.",
      "publishedAt": "2025-06-13T04:55:54Z",
      "title": "Indian authorities begin probe of Air India plane crash as Modi visits the site",
      "url": "https://apnews.com/article/air-india-plane-crash-ahmedabad-survivor-boeing-787-18a1e45cb65bd716d6529b8922cc94b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/4138789/2147483647/strip/true/crop/7048x3965+0+367/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Fa0%2F7541be4f6eb1138c26a91a1daaf8%2F5ba76ed4bea84d86ac28c1db2ed25980"
    },
    {
      "author": null,
      "description": "Former England soccer captain David Beckham, Academy Award winner Gary Oldman and The Who’s frontman Roger Daltrey have been knighted in King Charles III’s birthday honors list. Elaine Paige, the renowned musicals singer, Booker Prize-winning novelist Pat Barker and former Conservative government minister Penny Mordaunt have been given damehoods, the female equivalent of a knighthood. The honors aim to reward individuals for their contributions to British life. They are awarded twice a year to celebrities and public figures as well as ordinary people.",
      "publishedAt": "2025-06-14T11:14:53Z",
      "title": "David Beckham, Gary Oldman and others honored by King Charles III",
      "url": "https://apnews.com/article/beckham-oldman-paige-king-charles-honors-28e9d5e5b206fcacab3f92ca891e85e3",
      "urlToImage": "https://dims.apnews.com/dims4/default/16bb4a2/2147483647/strip/true/crop/4158x2339+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F17%2F327a301c6a377313d75ad2a5618f%2F81e2655f78c9468e84da7724537b8761"
    },
    {
      "author": null,
      "description": "The fifth week of Sean “Diddy” Combs’ sex trafficking trial featured a courthouse appearance by one of his famous friends: Ye, the rapper formerly known as Kanye West. He came to the courthouse but was unable to get into the crowded courtroom and left after seeing just a few minutes of the trial on an overflow room monitor. Otherwise, the week featured four days of testimony from a former Combs girlfriend, Jane. She revealed she was planning to meet Combs at the New York hotel where he was arrested last September. Combs has pleaded not guilty to all charges.",
      "publishedAt": "2025-06-14T04:07:56Z",
      "title": "Key moments from the fifth week of Sean 'Diddy' Combs' sex trafficking trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-recap-f1e59194f6769de232b4938e280cbd78",
      "urlToImage": "https://dims.apnews.com/dims4/default/6da041a/2147483647/strip/true/crop/2718x1529+0+142/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2F3a%2F6f16eb19d78e3e766a9689d87c68%2Fed29139ab1234ab1addf778f61f499ca"
    },
    {
      "author": null,
      "description": "The attorneys general for California and New York are praising a federal judge's decision to block President Donald Trump’s executive order on elections. The judge in Massachusetts on Friday sided with the Democratic state attorneys general, who called the Republican president's executive order overreach. Trump's order sought to compel officials to require documentary proof of citizenship for everyone registering to vote for federal elections and accept mailed ballots only if received by Election Day. The attorneys general say Trump's order was unconstitutional. The White House has defended Trump's order as “standing up for free, fair and honest elections.\" The judge says the Constitution doesn't grant the president any specific powers over elections.",
      "publishedAt": "2025-06-13T12:52:47Z",
      "title": "Judge blocks Trump’s election executive order",
      "url": "https://apnews.com/article/trump-elections-executive-order-4f863aaa8e0c59640ebc727827ffc887",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ecd68d/2147483647/strip/true/crop/3565x2005+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2Fc6%2F534698bdf8fcb35efccd0845584c%2F062acde6656b4dad9d8b5ff230f9ec70"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}