{
  "articles": [
    {
      "author": "SAMYA KULLAB and NAJIB JOBAIN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — The night a blast struck his family's home in the Gaza Strip, Ahmed al-Naouq was more than 2,000 miles away but he still jolted awake, consumed with inexplicable panic.",
      "publishedAt": "2023-11-16T06:20:35Z",
      "title": "Their families wiped out, grieving Palestinians in Gaza ask why",
      "url": "https://apnews.com/689624bc9069c10b5fa154a762f6da6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a60d5ad188834d7f85b507b95a075cab/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN and KAREEM CHEHAYEB",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli forces dropped leaflets warning Palestinians to flee parts of southern Gaza, residents said Thursday, signaling a possible expansion of their offensive to areas where hundreds of thousands of people who heeded earlier evacuation orders are crowded into U.N.-run shelters and family homes.",
      "publishedAt": "2023-11-16T07:42:34Z",
      "title": "Israel signals wider offensive in Gaza's south, where hundreds of thousands have fled",
      "url": "https://apnews.com/6c7daa3b8c3a6b8dddf186ce631dfaad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c24c257f8c2451e83bb08f5d47d8c74/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and ZEKE J. MILLER",
      "description": "WASHINGTON (AP) — It was a meeting a year in the making. President Joe Biden and Chinese President Xi Jinping sat down together on Wednesday just outside of San Francisco, where Asian leaders gathered for an annual summit.",
      "publishedAt": "2023-11-16T01:49:41Z",
      "title": "Pandas, fentanyl and Taiwan — takeaways from Biden's long-awaited meeting with Xi",
      "url": "https://apnews.com/c8384d40661a32aa276ec8ca97f35003",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fe5b19c935f473db1febf5a39638585/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Perhaps just shaking hands and sitting down together can be enough sometimes. At their meeting Wednesday, U.S. President Joe Biden and his Chinese counterpart Xi Jinping didn't resolve any of the major geopolitical issues dividing the world's two largest economies and chief rivals for influence, particularly among developing nations.",
      "publishedAt": "2023-11-16T09:28:50Z",
      "title": "Xi-Biden meeting seen as putting relations back on course, even as issues remain unresolved",
      "url": "https://apnews.com/760e31ef59cc476fec7d425a930e8958",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44ec28af4fad40b69115ef7155ede8ea/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — After raiding the Gaza Strip’s largest hospital, Israel appears close to completing its takeover of the besieged territory’s northern sector, which it has described as the headquarters of the ruling Hamas militant group.",
      "publishedAt": "2023-11-15T21:27:55Z",
      "title": "The Israeli military has set its sights on southern Gaza. Problems loom in next phase of war",
      "url": "https://apnews.com/29388314e3286b2b0f1152f7d15e2d7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87c3f80d6a3e45d3a26155c381b0df64/3000.jpeg"
    },
    {
      "author": "MIKE PESOLI and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Police and protesters clashed outside Democratic National Committee headquarters on Wednesday night during a demonstration for a cease-fire in the war between Israel and Hamas, the latest reflection of boiling tensions over the bloody conflict.",
      "publishedAt": "2023-11-16T02:11:30Z",
      "title": "Police and protesters clash outside Democratic HQ during demonstration over Israel-Hamas war",
      "url": "https://apnews.com/3040090acfc9df2f061e5079b952cdaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a926384ae684490bb74b595d3c5b80a4/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Ending the threat of a government shutdown until after the holidays, Congress gave final approval Wednesday night to a temporary government funding package that pushes a confrontation over the federal budget into the new year.",
      "publishedAt": "2023-11-15T19:04:14Z",
      "title": "Averting government shutdown, Congress approves temporary funding through the holidays",
      "url": "https://apnews.com/43064e2521454f5ce32851ef74ac50cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1c31e2cba704ac3a2e3b45356c0a023/3000.jpeg"
    },
    {
      "author": "EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A heavily armed gang surrounded a hospital in Haiti on Wednesday, trapping women, children and newborns inside until police rescued them, according to the director of the medical center, who pleaded for help via social media.",
      "publishedAt": "2023-11-15T20:37:31Z",
      "title": "Heavily armed Haitian gang surrounds hospital in capital and traps people inside",
      "url": "https://apnews.com/770ea717b1400705d064c26ecb45234d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b60580bf47fc4f83b79d659af6781b87/3000.jpeg"
    },
    {
      "author": "PAOLO SANTALUCIA",
      "description": "SALERNO, Italy (AP) — Less than 24 hours after setting foot on the pier of a southern Italian port, 60 people who’d survived a perilous boat journey from Libya were served with expulsion orders. Some came from Bangladesh, others from Syria and Egypt.",
      "publishedAt": "2023-11-16T05:12:26Z",
      "title": "The odyssey of asylum-seekers and the failure of EU regulations",
      "url": "https://apnews.com/1a9ee02fd18ec03f0e886567f7221702",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d1e9e37701e4fac8cfdf45572062082/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Thousands of workers at more than 200 U.S. Starbucks stores plan to walk off the job Thursday in what organizers say is the largest strike yet in the two-year-old effort to unionize the company’s stores.",
      "publishedAt": "2023-11-16T08:00:18Z",
      "title": "Thousands of Starbucks workers are expected to go on a one-day strike",
      "url": "https://apnews.com/7c07617260ea1c4760410e29b4509b6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/217f532f49364713ae1ab53d9c691ff6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}