{
  "articles": [
    {
      "author": "KAREEM CHEHAYEB and BASSEM MROUE",
      "description": "AITO, Lebanon (AP) — The day after a deadly Israeli airstrike in northern Lebanon – far from Hezbollah’s main area of influence – the militant group's acting leader said it would aim rockets into more areas of Israel.",
      "publishedAt": "2024-10-15T16:46:20Z",
      "title": "Hezbollah vows to expand attacks in Israel after deadly strike in Lebanon's Christian heartland",
      "url": "https://apnews.com/7d497b9c3c5a7429b3ac1fd3560f89be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/986291988eed47de9045bb444adb270c/1920.jpeg"
    },
    {
      "author": "TARA COPP, MATTHEW LEE and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Biden administration has warned Israel that it must increase the amount of humanitarian aid it is allowing into Gaza within the next 30 days or it could risk losing access to U.S.",
      "publishedAt": "2024-10-15T17:09:37Z",
      "title": "US warns Israel to boost humanitarian aid into Gaza or risk losing weapons funding",
      "url": "https://apnews.com/887ae388a022215f71309ab6def12103",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f916b3a7dd744ab9b2ebd03b08c4101/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT, COLLEEN LONG and BILL BARROW",
      "description": "DETROIT (AP) — Democratic presidential nominee Kamala Harris warned Tuesday that Republican Donald Trump would “institutionalize” harsh policing tactics that disproportionately affect Black men, while Trump blamed Harris' immigration policies for “devastating” Black and Latino communities.",
      "publishedAt": "2024-10-15T15:13:51Z",
      "title": "Harris works to energize Black male voters while Trump continues to attack immigration policy",
      "url": "https://apnews.com/2eab5daa1095b7ecb38fe92857acdb86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6514c8581c0e42b590eac68ddf303d07/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN and JILL COLVIN",
      "description": "CHICAGO (AP) — Donald Trump seized Tuesday on an opening to sound his frequent argument that imposing huge tariffs on foreign goods would amount to an economic elixir — one that he claims would raise enormous sums for the government, protect U.S.",
      "publishedAt": "2024-10-15T20:06:32Z",
      "title": "Trump uses interview on economics to promote tariffs and riff on his favorite themes",
      "url": "https://apnews.com/6a4b07be04e342bf657ad12ef7b6bbfa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f18018b1bba846ce941f6fc9a75134e6/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A judge has blocked a new rule that requires Georgia Election Day ballots to be counted by hand after the close of voting. The ruling came a day after the same judge ruled that county election officials must certify election results by the deadline set in law.",
      "publishedAt": "2024-10-15T14:00:11Z",
      "title": "Georgia judge blocks ballot counting rule and says county officials must certify election results",
      "url": "https://apnews.com/03f6bc623d9f6aeeb3f9dc47823d03f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94b8b38df5b74c358a875bd159af0fad/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy was set to at least partially unveil a plan to win the war against Russia to his country's Parliament on Wednesday after weeks of dropping hints about the blueprint to lukewarm Western allies, including U.S.",
      "publishedAt": "2024-10-16T04:03:35Z",
      "title": "Zelenskyy to unveil 'victory plan' to Ukrainian lawmakers after presenting it to Western allies",
      "url": "https://apnews.com/f3525550f6986f590777193a7385c0c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b504584b4992440897baef6caf18f3f9/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "MEXICO CITY (AP) — Cellphone chats have become death sentences in the continuing, bloody factional war inside Mexico's Sinaloa drug cartel.",
      "publishedAt": "2024-10-16T04:03:59Z",
      "title": "In the heartland of Mexico's Sinaloa cartel, the old ways have changed and violence rages",
      "url": "https://apnews.com/b18bbd3abb4ba528444fef3598bdf05a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b48f3bd66134eccbbef7b472f0cc9e8/3000.jpeg"
    },
    {
      "author": "MARIA CHENG and ANGIE WANG",
      "description": "TORONTO (AP) — A homeless man refusing long-term care, a woman with severe obesity, an injured worker given meager government assistance, and grieving new widows. All of them requested to be killed under Canada’s euthanasia system, and each sparked private debate among doctors and nurses struggling with the ethics of one of the world’s most permissive laws on the practice, according to an Associated Press investigation.",
      "publishedAt": "2024-10-16T04:06:52Z",
      "title": "Canadian doctors who provide euthanasia struggle with the ethics of killing vulnerable patients",
      "url": "https://apnews.com/dfe59b1786592e31d9eb3b826c5175d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4aa4624d8fb14cee86ddb459e3deff04/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK and RUTH ALONGA",
      "description": "GOMA, Congo (AP) — For Nelly Shukuru, there was no way out. The fighting that forced her from her home, the squalid conditions in the displacement camp in eastern Congo, the hunger, all felt inescapable.",
      "publishedAt": "2024-10-16T04:11:42Z",
      "title": "Years of war in Congo have created a dire mental health crisis. But little support is available",
      "url": "https://apnews.com/88642207a472870de36e5f434ead5990",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfe5775473b64266b1c2e7a77e039539/3000.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "AMSTERDAM (AP) — The annex where the young Jewish diarist Anne Frank hid from Nazi occupiers during World War II is heading to New York.A full-scale replica of the rooms that form the heart of the Anne Frank House museum on one of Amsterdam's historic canals is being built in the Netherlands and will be shipped across the Atlantic for a show titled “Anne Frank The Exhibition” at the Center for Jewish History in Manhattan.",
      "publishedAt": "2024-10-16T04:18:11Z",
      "title": "A full-scale replica of Anne Frank's hidden annex is heading to New York for an exhibition",
      "url": "https://apnews.com/8d093b71a48dcb84983a4ecf9d497747",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02902cb07375469083b27be3d4d918c2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}