{
  "articles": [
    {
      "author": "AAMER MADHANI, EMMA BURROWS, STEFANIE DAZIO",
      "description": "Ukrainian President Volodymyr Zelenskyy says his country wants “security guarantees” before any talks to end the Ukraine-Russia war. Zelenskyy made his remarks Friday during a highly anticipated meeting with U.S. Vice President JD Vance at the Munich Security Conference. Shortly before sitting down with Vance, Zelenskyy said he will only agree to meet in-person with Russian leader Vladimir Putin after a common plan is negotiated with U.S. President Donald Trump. Zelenskyy said he believes Trump is the key to ending the war, and said the U.S president gave him his telephone number.",
      "publishedAt": "2025-02-14T05:02:03Z",
      "title": "Zelenskyy to Vance: Ukraine wants 'security guarantees' as Trump seeks to end Ukraine-Russia war",
      "url": "https://apnews.com/article/vance-rubio-munich-security-conference-ukraine-ab2d7379aaf6ca224cc51e1f9ade9edf",
      "urlToImage": "https://dims.apnews.com/dims4/default/b75f120/2147483647/strip/true/crop/3871x2177+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F83%2Fa18f599f963f63b86c9380132ac8%2F410f15afdce44ba181a3c95856ef1b32"
    },
    {
      "author": null,
      "description": "Russian media say a U.S. citizen was detained after cannabis-laced marmalade was found in his luggage. The arrest comes days after a Moscow-Washington prisoner swap that the White House called a diplomatic thaw and a step toward ending the fighting in Ukraine. Russian police said the 28-year-old American had attempted to smuggle a “significant amount” of drugs into the country. The Interfax news agency said he was detained at Moscow’s Vnukovo airport after flying in from Istanbul last Friday. Mash, a Russian Telegram channel with links to the security services, said the U.S. citizen, identified only as K. Byers, faced up to seven years in prison if convicted. There was no immediate comment from the U.S. State Department.",
      "publishedAt": "2025-02-14T18:15:48Z",
      "title": "Russia detains another US citizen on drugs charges days after swap, reports say",
      "url": "https://apnews.com/article/russia-american-arrested-marijuana-prisoner-swap-488faacfe1e65adfcb732de569de04a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/201b115/2147483647/strip/true/crop/4421x2487+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2Fa5%2F1e25ad36a1a4e776016d7f14fff2%2F827101bf6e9648989553984b889c408e"
    },
    {
      "author": "ILLIA NOVIKOV, EFREM LUKATSKY",
      "description": "A drone armed with a warhead hit the protective outer shell of Ukraine’s Chernobyl nuclear plant. Friday's strike punched a hole in the shell and briefly started a fire. Kyiv blamed Russia, while the Kremlin denied it was responsible. The U.N. International Atomic Energy Agency said radiation levels at the shuttered plant in the Kyiv region have not increased. It said the strike did not breach the plant’s inner containment shell. The IAEA did not attribute blame. Fighting around nuclear power plants has repeatedly raised fears of a nuclear catastrophe during three years of war. Chernobyl was the site of the world's worst nuclear accident in 1986.",
      "publishedAt": "2025-02-14T08:14:47Z",
      "title": "A drone pierced the outer shell of Ukraine's Chernobyl nuclear plant. Radiation levels are normal",
      "url": "https://apnews.com/article/russia-ukraine-war-chernobyl-zelenskyy-71d781dbd66754d0a548edd388f3447a",
      "urlToImage": "https://dims.apnews.com/dims4/default/61d9512/2147483647/strip/true/crop/3614x2033+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2F58%2F99d9f5c6455e0718e345d74a7f14%2F958f5e46e06048b480670218463c54df"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "Hungarian Prime Minister Viktor Orbán believes U.S. President Donald Trump will reintegrate Russia into the Western economy and energy sector if the Ukraine war ends. Speaking on state radio Friday, Orbán praised Trump’s efforts to negotiate peace in Ukraine and criticized the European Union's stance on sanctions. A recent Trump-Putin call raised concerns in Kyiv and Europe about a settlement without their involvement. Orbán, a longtime critic of EU sanctions, warned high energy prices could lead to the bloc’s collapse. He described Trump’s influence as a “Trump tornado,” reshaping Western policies. Hungary remains heavily reliant on Russian energy, diverging from most European nations.",
      "publishedAt": "2025-02-14T10:35:45Z",
      "title": "Hungary's Orbán predicts Trump will bring Russia back into Western fold after end of Ukraine war",
      "url": "https://apnews.com/article/trump-russia-hungary-orban-western-fold-4288ca5db21a8cbcb95dc71fedf0f9ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/03aec57/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F07%2Fdadccf414f362a8c192d67d90dba%2F8c93e4261c18492bb94659a7e4cfb5c5"
    },
    {
      "author": null,
      "description": "Three immigrants who won a restraining order against the U.S. government to avoid transfer to Guantanamo Bay Naval Base in Cuba have been deported on direct flights to Venezuela. Court documents published Friday show the three men were deported the day after a federal judge approved a temporary order blocking a possible transfer to Guantanamo. Lawyers for the man say they were the target of baseless accusations of gang affiliation by the government that may expose them to harm upon returning to Venezuela.",
      "publishedAt": "2025-02-15T01:56:14Z",
      "title": "US deports immigrants to Venezuela after judge blocked transfer to Guantanamo Bay",
      "url": "https://apnews.com/article/venezuelans-deported-immigration-crackdown-guantanamo-b12eee8c28b23e63cc35583083a79df0",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6a19bf/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F09%2F48b9c850fddf980e25ca4a1e0a17%2F641559248699404e8703f62e799c6bb7"
    },
    {
      "author": "GARY FIELDS, TIM SULLIVAN",
      "description": "Investigators say the crew of the helicopter that collided midair with an American Airlines jet near Washington D.C.’s Ronald Reagan National Airport might not have heard instructions from the air traffic controller to pass behind the plane. National Transportation Safety Board Chairwoman Jennifer Homendy said the recording from the Black Hawk helicopter cockpit suggests the crew may have missed the key instruction just before the Jan. 29 collision, in which all 67 aboard the two aircraft were killed.",
      "publishedAt": "2025-02-14T19:46:27Z",
      "title": "Helicopter crew in collision with plane may not have heard key instruction from tower, NTSB says",
      "url": "https://apnews.com/article/washington-national-airport-aircraft-crash-ntsb-3dec2686beb43ada10ce392c857751cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/9708267/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F3c%2F2735cc41f49cf793fd68c611bb23%2F9cddda579bdd4edbb13215b642bd5b33"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "Hamas named three more Israeli hostages it will release in a weekend trade for hundreds of Palestinian prisoners, the latest sign that the shaky Gaza ceasefire deal appears to be holding in spite of a tense dispute that has threatened to renew fighting. The three men were abducted from one of the hardest-hit communities in southern Israel during the Hamas-led attack on Oct. 7, 2023, that ignited the war. Under the terms of the ceasefire, Israel is to release more than 300 Palestinian prisoners held in its jails in return. Of the 251 hostages taken, 73 remain in Gaza, around half of whom are believed to be dead.",
      "publishedAt": "2025-02-14T14:24:19Z",
      "title": "Hamas names 3 more Israeli hostages to be freed from Gaza",
      "url": "https://apnews.com/article/mideast-israel-hamas-hostages-exchange-25580c24d78df5f12a9684a1ed387b75",
      "urlToImage": "https://dims.apnews.com/dims4/default/704d037/2147483647/strip/true/crop/3573x2010+28+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2Fe8%2Fe6e6e325df655988b43ad84f1fd2%2Fff9d8183ed5c4d65b0997e7d78dd5cec"
    },
    {
      "author": "JILL COLVIN, BRIAN WITTE, MIKE HOUSEHOLDER, MICHELLE L. PRICE",
      "description": "Federal workers were responding with anger and confusion Friday as they grappled with the Trump administration’s latest effort to shrink the size of the federal workforce by ordering agencies to lay off probationary employees who have yet to qualify for civil service protections. Many of those workers say they had already accepted the administration’s deferred resignation offer, under which they were supposed to be paid until Sept. 30 if they agreed to quit, raising questions about how many others who signed will nonetheless be fired.",
      "publishedAt": "2025-02-14T22:34:14Z",
      "title": "Trump's job cuts: Anger, chaos and confusion take hold as federal workers face mass layoffs",
      "url": "https://apnews.com/article/trump-firing-probation-workforce-buyouts-layoffs-doge-159a6de411622c2eb651016b1e99da37",
      "urlToImage": "https://dims.apnews.com/dims4/default/c03d34b/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fef%2Fb447c386aed921b95de41bf9d695%2Fcbf9c83827c049c99de488ebc7fc15ad"
    },
    {
      "author": "DAVID BAUDER",
      "description": "The Trump administration blocked The Associated Press from traveling with President Trump on Air Force One and also from covering an Oval Office event. It's part of an ongoing terminology dispute over the Gulf of Mexico. The administration criticized AP's “commitment to misinformation” in not adopting Trump's name change to “Gulf of America” in all of its copy. AP says the administration is flouting the First Amendment in punishing the news outlet for not saying what it wants. AP has advised the thousands of news outlets that use its service that it would continue to use Gulf of Mexico as its style but would note Trump's change of name as well.",
      "publishedAt": "2025-02-14T23:44:36Z",
      "title": "AP journalists barred from Air Force One over style dispute",
      "url": "https://apnews.com/article/trump-ap-news-ban-air-force-one-b90b8b842d63aef9960ccffb4a657dc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e5d9d7/2147483647/strip/true/crop/6499x3656+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fb9%2F430ce8a2675d51f92a8cd5077c33%2F1ee1a620aacd4c739d350dc94b0374f0"
    },
    {
      "author": "FATIMA HUSSEIN, JOSH BOAK",
      "description": "The Treasury Department’s Office of Inspector General says it's launching an audit of the security controls for the federal government’s payment system. That's as Democratic lawmakers raised red flags about the access provided to Trump aide Elon Musk’s Department of Government Efficiency. The audit will also review the past two years of the system’s transactions as it relates to Musk’s assertion of “alleged fraudulent payments.” That's according to a letter from Treasury’s deputy inspector general obtained Friday by The Associated Press. The audit marks part of the broader effort led by Democratic lawmakers and federal employee unions to provide transparency about DOGE’s activities under President Donald Trump's Republican administration.",
      "publishedAt": "2025-02-14T15:00:34Z",
      "title": "Treasury watchdog begins audit of Musk DOGE team's access to the US government's payment system",
      "url": "https://apnews.com/article/treasury-inspector-general-audit-doge-musk-democrats-d1e2710d0b63f54a8c1fe50fe4f23d4d",
      "urlToImage": "https://dims.apnews.com/dims4/default/c03d34b/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fef%2Fb447c386aed921b95de41bf9d695%2Fcbf9c83827c049c99de488ebc7fc15ad"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}