{
  "articles": [
    {
      "author": "ZEKE MILLER and MICHELLE L. PRICE",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump announced Tuesday that he is nominating former Director of National Intelligence John Ratcliffe to lead the Central Intelligence Agency. He also said he had chosen former Arkansas Gov.",
      "publishedAt": "2024-11-12T18:51:45Z",
      "title": "Trump picks ex-DNI John Ratfcliffe to lead CIA, ex-Arkansas Gov. Huckabee to be ambassador to Israel",
      "url": "https://apnews.com/f51121db5b18814bbab014e872c2a736",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbecbbcc4c35437f8e1432e255795aa9/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and JILL COLVIN",
      "description": "WASHINGTON (AP) — For a man who loves the spotlight, Donald Trump has been conspicuously out of view since his triumph in last week's presidential election.",
      "publishedAt": "2024-11-12T18:24:09Z",
      "title": "Trump spends first week as president-elect behind closed doors at Mar-a-Lago",
      "url": "https://apnews.com/bee52b9b3a06c12741d9db2e2fc7bb78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5ac629792fe4170bc5f77fd74315d02/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — Donald Trump's first picks for immigration policy jobs spent the last four years angling for this moment.Stephen Miller and Thomas Homan had critical roles in the first Trump administration and are unapologetic defenders of its policies, which included separating thousands of parents from their children at the border to deter illegal crossings.",
      "publishedAt": "2024-11-12T05:06:55Z",
      "title": "Trump picks a pair of experienced advisers motivated to carry out his immigration crackdown",
      "url": "https://apnews.com/abb1a75497d11c978c369cb20016eecb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/516759f4b2af40e0aefc305c1d9937b3/1642.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A judge has postponed a decision on whether to undo President-elect Donald Trump’s hush money conviction as prosecutors consider how to proceed in light of last week’s election and his lawyers argue for dismissal so he can run the country.",
      "publishedAt": "2024-11-12T05:22:48Z",
      "title": "Judge delays ruling on whether to scrap Trump's conviction in hush money case",
      "url": "https://apnews.com/1b555b96443f38d35e995b8b4853a32c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7a71f3a14da4c19bd8c6ae0a10814b2/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE, JULIA FRANKEL and SAMY MAGDY",
      "description": "WASHINGTON (AP) — The Biden administration said Tuesday that Israel has made some good but limited progress in increasing the flow of humanitarian aid to Gaza and will not limit arms transfers to Israel as it had threatened to a month ago if the situation had not improved.",
      "publishedAt": "2024-11-12T07:24:40Z",
      "title": "US says it will not limit Israel arms transfers after some improvements in flow of aid to Gaza",
      "url": "https://apnews.com/48cd09c1c007cacd6d7a309589490320",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f33c02463424cdd9621ecd75888569e/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed at least 46 people in the Gaza Strip in the past 24 hours, including 11 at a makeshift cafeteria in an Israeli-declared humanitarian zone, medics said.",
      "publishedAt": "2024-11-12T06:46:27Z",
      "title": "Israeli strikes kill 46 people in the Gaza Strip and 33 in Lebanon, medics say",
      "url": "https://apnews.com/095148946dcc1d0dcb75cbd423b1be3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ca5e09b38ef4f5f86c25f97139297fa/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JACK JEFFERY",
      "description": "JERUSALEM (AP) — The United States said Tuesday it would not punish Israel over the dire humanitarian situation in the Gaza Strip.",
      "publishedAt": "2024-11-12T19:25:00Z",
      "title": "Why is only limited aid getting to Palestinians inside Gaza?",
      "url": "https://apnews.com/bcf8489c338a2f33cb4d6f0a4f7138b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e659adf4c55448c9c858feac78ce254/1920.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — A federal judge on Tuesday sentenced a Massachusetts Air National Guard member to 15 years in prison after he pleaded guilty to leaking highly classified military documents about the war in Ukraine.",
      "publishedAt": "2024-11-12T05:05:35Z",
      "title": "Pentagon secrets leaker Jack Teixeira sentenced to 15 years in prison by a federal judge",
      "url": "https://apnews.com/e67e18f310101b2f1c894ca1b550a3eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d5f24367c054fdd81aa824a3972527e/2556.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson said Tuesday that Republicans are “ready to deliver” President-elect Donald Trump's agenda after his election victory, insisting the GOP won't make the mistakes of last time and will be much better prepared for a second-term Trump White House.",
      "publishedAt": "2024-11-12T05:10:44Z",
      "title": "Speaker Mike Johnson says Republicans are 'ready to deliver' on Trump's agenda",
      "url": "https://apnews.com/82730f474a365a0d6e6af78a84bceda7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fb84cbe9922464abd55587524ae3f29/3000.jpeg"
    },
    {
      "author": "EVENS SANON AND MEGAN JANETSKY",
      "description": "PORT-AU-PRINCE, Haiti (AP) — The Federal Aviation Administration announced Tuesday that it was prohibiting U.S. airlines from flying to Haiti for 30 days after gangs shot three planes and the United Nations temporarily suspended flights to Port-au-Prince, limiting humanitarian aid coming into the country.",
      "publishedAt": "2024-11-12T15:26:27Z",
      "title": "US prohibits airlines from flying to Haiti and UN suspends flights after planes were shot by gangs",
      "url": "https://apnews.com/90dc8d26bc58eb9b214385ac10f315a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f97a7927c4e4769baca7beec279b9b0/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}