{
  "articles": [
    {
      "author": "COLLEEN LONG, MAKIYA SEMINERA and MATT BROWN",
      "description": "WASHINGTON (AP) — While President Joe Biden was hosting a celebration of Black excellence at the White House with lawmakers, advocates and celebrities this past week, Kamala Harris was instead headed off to Pennsylvania.",
      "publishedAt": "2024-09-14T15:44:17Z",
      "title": "Harris is promoting her resume and her goals rather than race as she courts Black voters",
      "url": "https://apnews.com/0544720c6bacaf0484259bdabe83239f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bef26127725740bca01634d74b0ae82f/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Dick Cheney is a career Republican still vilified by Democrats for his bullish defense of the Iraq War as vice president.",
      "publishedAt": "2024-09-14T12:22:34Z",
      "title": "Dick Cheney was once vilified by Democrats. Now he's backing Harris. Will it matter?",
      "url": "https://apnews.com/224d7be9ee7ebb6dc699bca5339a4458",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4af64e2ace14562a5bff04f86b1426c/2975.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "From the looks of it, the Phoenix suburb of Gilbert hasn’t done too much with the $24 million it received in federal pandemic aid.The site where it plans to spend most of the money for a crime victims center remains an empty plot of dirt.",
      "publishedAt": "2024-09-14T04:14:11Z",
      "title": "Clock is ticking for local governments to use billions of dollars of federal pandemic aid",
      "url": "https://apnews.com/57856355e594a910d1d255deab7d2aaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02bc148aa5854ec197af5446c211eb6c/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI and JON GAMBRELL",
      "description": "TEHRAN, Iran (AP) — Iran launched a satellite into space Saturday with a rocket built by the country's paramilitary Revolutionary Guard, state-run media reported, the latest for a program the West fears helps Tehran advance its ballistic missile program.",
      "publishedAt": "2024-09-14T07:30:02Z",
      "title": "Iran says it successfully launched a satellite in its program criticized by West over missile fears",
      "url": "https://apnews.com/52022a743be4e3ffca5df9d30de7b04c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77c2f0e82f8e45999e419375b81f2c89/3000.jpeg"
    },
    {
      "author": "ANDREW WILKS and WAFAA SHURAFA",
      "description": "ISTANBUL, Turkey (AP) — A Turkish-American activist who was killed by Israeli fire in the West Bank was laid to rest on Saturday in her hometown in Turkey with thousands lining the streets and anti-Israeli feelings in the country rising from a conflict that threatens to spread across the region.",
      "publishedAt": "2024-09-14T07:31:47Z",
      "title": "An American activist killed by Israeli fire is buried in Turkey as Israel strikes Gaza",
      "url": "https://apnews.com/816a01b4ca23bfd6b22a1a381e1671bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6b66f3a855a474796bc3bce8dc2ddb8/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and CLAUDIA LAUER",
      "description": "HONOLULU (AP) — The wind pushed flames from house to house as a group of neighbors tried to escape their blazing subdivision, abandoning their cars in a blocked road and running to an industrial outbuilding for safety.",
      "publishedAt": "2024-09-14T04:12:24Z",
      "title": "Hawaii wildfire victims made it just blocks before becoming trapped by flames, report says",
      "url": "https://apnews.com/dc43aa50abb82f79de4ce786f9af510e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7aa8c753a24440818d9d6906be4b991a/1920.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Disgraced ex-movie mogul Harvey Weinstein faces mounting legal and health troubles some seven years after scores of women came forward with allegations of sexual misconduct against him, helping launch the global #MeToo movement.",
      "publishedAt": "2024-09-14T17:49:07Z",
      "title": "A look at Harvey Weinstein’s health and legal issues as he faces more criminal charges",
      "url": "https://apnews.com/4e6d14096b4c93a957f6c5f454894abd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/266d4b2f2be046c98652cec62fa8c45b/3000.jpeg"
    },
    {
      "author": "RODNEY MUHUMUZA",
      "description": "MALINDI, Kenya (AP) — Shukran Karisa Mangi always showed up drunk at work, where he dug up the bodies of doomsday cult members buried in shallow graves.",
      "publishedAt": "2024-09-14T06:38:44Z",
      "title": "The church was named Good News. Hundreds of members died in a cult massacre that haunts survivors",
      "url": "https://apnews.com/b2e99891fc5f140df8166725436cb58e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8bc126b88b54ea4a78b3e907944d101/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "CHALCO, Mexico (AP) — As 56-year-old Juana Salazar Segundo walked through her home in Chalco, a low-income suburb southeast of Mexico City, she recalled how black, reeking water had reached up to her belly button after flooding early last month.",
      "publishedAt": "2024-09-14T04:05:42Z",
      "title": "Residents of Mexico City suburb are anxious after living over a month in black sewage water",
      "url": "https://apnews.com/8ecc2eb4d9fabd5219fe6850de5addf6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e331d875eb4a45cb9368250824d904c1/3000.jpeg"
    },
    {
      "author": "LEANNE ITALIE",
      "description": "NEW YORK (AP) — The cuddles. The loyalty. The worshipful eyes. There's a lot of joy in having a dog, not the least of which is heading out for a brisk walk.",
      "publishedAt": "2024-09-14T04:05:47Z",
      "title": "Dogs bring loads of joy but also perils on a leash",
      "url": "https://apnews.com/316c71a8dff0ea553af8d3f6a170616d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/850373f22ad34f2fb2d315418c252bc5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}