{
  "articles": [
    {
      "author": "JOEY CAPPELLETTI and DARLENE SUPERVILLE",
      "description": "EAU CLAIRE, Wis. (AP) — Vice President Kamala Harris and Minnesota Gov. Tim Walz are spending their first full day as running mates Wednesday rallying Democrats across the Midwest, a politically divided region that is crucial to their effort to win the White House in less than three months.",
      "publishedAt": "2024-08-07T04:11:52Z",
      "title": "Harris' pick of Walz amps up excitement in Midwestern states, inspires big donations",
      "url": "https://apnews.com/d66fad315f34ec68a50c81b118b18480",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f19daafd337402cab54ceb374bd55c4/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "FORT MEADE, Md. (AP) — Military-run hearings for accused Sept. 11 mastermind Khalid Sheikh Mohammed and two co-defendants at Guantanamo Bay, Cuba, were in upheaval Wednesday following Defense Secretary Lloyd Austin's decision to throw out a plea agreement.",
      "publishedAt": "2024-08-07T16:54:55Z",
      "title": "9/11 hearings at Guantanamo Bay in upheaval after surprise order by US defense chief",
      "url": "https://apnews.com/d1ea80cf69649927d85b638f9913c76f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1652c7424af47e396a6d2d68b48dc34/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and KIMBERLEE KRUESI",
      "description": "The number of women getting abortions in the U.S. actually went up in the first three months of 2024 compared with before the Supreme Court overturned Roe v Wade, a report released Wednesday found, reflecting the lengths that Democratic-controlled states went to expand access.",
      "publishedAt": "2024-08-07T13:01:43Z",
      "title": "US abortion numbers have risen slightly since Roe was overturned, study finds",
      "url": "https://apnews.com/7179dda48eae0a764be89c2e0aafd80a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58521d5607ca4147bf11a0af5898d4ae/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Yahya Sinwar's appointment as the top leader of Hamas formalizes a role he assumed in the early hours of Oct.",
      "publishedAt": "2024-08-07T13:47:16Z",
      "title": "Hamas has a new leader. How will that affect the war in Gaza and cease-fire efforts?",
      "url": "https://apnews.com/25d870421bb2ccd7ebc659a40d32429f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62c0bfd29d93409db97a9301c690435a/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Russian President Vladimir Putin on Wednesday described a Ukrainian incursion into the country's southwestern Kursk region as a “large-scale provocation” as his officials asserted that they were fighting off cross-border raids for a second day.",
      "publishedAt": "2024-08-07T09:43:15Z",
      "title": "Putin accuses Ukraine of a ‘large-scale provocation’ with its raid in southwestern Russia",
      "url": "https://apnews.com/e838343b88b2dd9827f5a40fbc5a1db7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdaf3e782f2b4df1b627a1ba8428b1ef/3000.jpeg"
    },
    {
      "author": "JENNA FRYER",
      "description": "PARIS (AP) — Every single thing Simone Biles has done at the Paris Olympics has been spotlighted: four medals, an online feud with a former teammate and a social media post that appeared to take a swipe at presidential candidate Donald Trump.",
      "publishedAt": "2024-08-07T17:06:04Z",
      "title": "Everything Simone Biles did at the Paris Olympics was amplified. She thrived in the spotlight",
      "url": "https://apnews.com/e094f0aba6a2bf703c8d1e631e24a7bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d3515e5df0141b59d1c7b8e829b5788/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM, JEFFREY COLLINS and JOHN MINCHILLO",
      "description": "CHARLESTON, S.C. (AP) — Tropical Storm Debby pushed bad weather up the East Coast on Wednesday, colliding with other systems and bringing no respite to residents as far away as the Great Lakes and New Jersey, where heavy rain flooded highways and streets and stranded motorists.",
      "publishedAt": "2024-08-07T04:14:07Z",
      "title": "Tropical Storm Debby churns up the East Coast, and affects weather as far away as the Great Lakes",
      "url": "https://apnews.com/3d3e634978b9a03790c4e998b20505c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6ef3cbdc0d4434db9cc2b106cc97d4c/1920.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — Bangladesh's incoming interim leader Nobel laureate Muhammad Yunus on Wednesday asked his people to stay calm and get ready to rebuild the nation after weeks of violence that left hundreds killed, following an uprising that forced former Prime Minister Sheikh Hasina to step down and flee to neighboring India.",
      "publishedAt": "2024-08-07T12:07:12Z",
      "title": "Bangladesh's incoming interim leader Yunus asks for calm as he is set to take oath Thursday",
      "url": "https://apnews.com/fd7db94ba0a66a12f7b61de3a1bb6730",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97db65565ac142eaa117589ad01caeed/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — A federal safety board planned on Wednesday to probe the Federal Aviation Administration's oversight of Boeing and how it has changed since a door plug blew off a Boeing 737 Max in midflight.",
      "publishedAt": "2024-08-07T15:13:18Z",
      "title": "US safety board plans to quiz officials about FAA oversight of Boeing before a panel blew off a 737",
      "url": "https://apnews.com/9057d70b2f85b06caa80d6ba7a91826a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8be34d7fc20249f19fc7aee1a50987d0/3000.jpeg"
    },
    {
      "author": "SUMAN NAISHADHAM",
      "description": "WASHINGTON (AP) — Ocean temperatures in the Great Barrier Reef hit their highest level in 400 years over the past decade, according to researchers who warned that the reef likely won’t survive if planetary warming isn’t stopped.",
      "publishedAt": "2024-08-07T15:02:16Z",
      "title": "Great Barrier Reef waters were hottest in 400 years over the past decade, study finds",
      "url": "https://apnews.com/4259ac9241d1e48db3e4a3896d2c9827",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a39cc947eea64885af0b711336397fa2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}