{
  "articles": [
    {
      "author": null,
      "description": "PARIS (AP) — Court voids the inquiry that led to Olympic bronze for Jordan Chiles, tells gymnastics body to reassess who gets medals.",
      "publishedAt": "2024-08-10T17:43:41Z",
      "title": "Court voids the inquiry that led to Olympic bronze for Jordan Chiles, tells gymnastics body to reassess who gets medals",
      "url": "https://apnews.com/bacfdfd20d750e30ec7392cce64e92e8",
      "urlToImage": ""
    },
    {
      "author": "ANNE M. PETERSON",
      "description": "PARIS (AP) — The U.S. women's soccer team won its fifth Olympic gold medal by beating Brazil 1-0 on Mallory Swanson’s early second-half goal in the tournament final Saturday at the Paris Games.",
      "publishedAt": "2024-08-10T14:36:45Z",
      "title": "USWNT wins its fifth Olympic gold medal in women's soccer with a 1-0 victory over Brazil in final",
      "url": "https://apnews.com/9c90483b76a3a67df35d6058af748c04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bea29d3f028f467eb24a0fed42987b90/2611.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike hit a school-turned-shelter in Gaza early Saturday, killing at least 80 people and wounding nearly 50 others, Palestinian health authorities said, in one of the deadliest attacks of the 10-month war between Israel and Hamas.",
      "publishedAt": "2024-08-10T04:26:06Z",
      "title": "Israeli airstrike on a Gaza school used as a shelter kills at least 80, Palestinian officials say",
      "url": "https://apnews.com/f33867d7596ebb70c1cb3a77fd4437cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34a7e5fd5ad141efb3db32d90cc35e1e/1920.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — The uncle of the Uvalde, Texas, school shooter who killed 19 students and two teachers begged police to let him try to talk his nephew down, according to a 911 call included in a massive trove of recordings and transcripts released by city officials Saturday.",
      "publishedAt": "2024-08-10T17:08:06Z",
      "title": "Uvalde shooter's uncle begged police to let him talk to the gunman",
      "url": "https://apnews.com/2eaabf46b09866b037b3a9dee81b9cd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/928dd8975dff49e1b0b66e249b567cd1/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — “Mass Deportation Now!” declared the signs at the Republican National Convention, giving a full embrace to Donald Trump’s pledge to expel millions of migrants in the largest deportation program in American history.",
      "publishedAt": "2024-08-10T04:21:20Z",
      "title": "Trump is putting mass deportations at the heart of his campaign. Some Republicans are worried",
      "url": "https://apnews.com/ec64f85e3633c9c7a8a247eaf9feb64f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d63a0b64565045788fa6986ffe892af2/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and JOSH BOAK",
      "description": "LAS VEGAS (AP) — Vice President Kamala Harris is working to make Nevada look like less of a political gamble in November's election.The Democratic presidential nominee visits the state on Saturday with her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-10T04:01:25Z",
      "title": "In Las Vegas, Kamala Harris sees a chance to improve her odds of winning",
      "url": "https://apnews.com/ac21118dbb24290e46d32ad9669507d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d16525e1b20a44dcba0757be98f76a96/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE, GABRIELA SÁ PESSOA and DAVID KOENIG",
      "description": "VINHEDO, Brazil (AP) — Brazilian authorities worked Saturday to piece together what exactly caused the plane crash in Sao Paulo state the previous day that killed all 62 people on board.",
      "publishedAt": "2024-08-10T04:08:29Z",
      "title": "Brazilian authorities are investigating the cause of the fiery plane crash that killed 62",
      "url": "https://apnews.com/5c5a3371b5e899b745c1cb6e46950230",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d24eca695024162ab879ada62b7d1b2/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER, ERIC TUCKER and LARRY NEUMEISTER",
      "description": "WASHINGTON (AP) — A Defense Department disagreement over how to bring to justice the accused mastermind of the Sept.",
      "publishedAt": "2024-08-10T12:35:35Z",
      "title": "'Original sin': Torture of 9/11 suspects means even without plea deal, they may never face a verdict",
      "url": "https://apnews.com/5742ea797014d3fd48cfaae4c9f180f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a63f396cbac043e6b57d8cfcd33e45c6/3000.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO and MICHAEL R. SISAK",
      "description": "WASHINGTON (AP) — A worker at a federal prison in California has died and investigators are examining whether he was exposed to fentanyl shortly before his death, three people familiar with the matter told The Associated Press.",
      "publishedAt": "2024-08-10T13:14:54Z",
      "title": "Worker's death at California federal prison investigated for possible fentanyl exposure, AP learns",
      "url": "https://apnews.com/c524f7db5c03c2298af5e488470ba639",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/904804b08f464ba8b3677177e68a3011/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, MICHAEL HILL, MARK SCOLFORO and PATRICK WHITTLE",
      "description": "Debby finally moved out of the U.S. on Saturday after the storm spent the better part of a week unleashing tornadoes and flooding, damaging homes and taking lives as it moved up the East Coast after first arriving in Florida as a hurricane.",
      "publishedAt": "2024-08-10T04:10:21Z",
      "title": "Debby finally moves out of the US, though risk from flooded rivers remains",
      "url": "https://apnews.com/a369f782a8e6fa18fdb7f722ade4b3c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f073224caf054c0d8714a2821cb79a49/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}