{
  "articles": [
    {
      "author": "HEATHER HOLLINGSWORTH and NICK INGRAM",
      "description": "KANSAS CITY, Mo. (AP) — Eight children were among 22 people hit by gunfire in a shooting at the end of Wednesday's parade to celebrate the Kansas City Chiefs' Super Bowl win, authorities said, as terrified fans ran for cover and yet another high-profile public event was marred by gun violence.",
      "publishedAt": "2024-02-14T11:00:41Z",
      "title": "At least 8 children among 22 hit by gunfire at end of Chiefs' Super Bowl parade; 1 person killed",
      "url": "https://apnews.com/c373ac902961ded32bccc11c67afbd37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb277fcbe5d7411f9297c9fa28707fb7/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and MARK SHERMAN",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith urged the U.S. Supreme Court on Wednesday to let former President Donald Trump's 2020 election interference case proceed to trial without further delay.",
      "publishedAt": "2024-02-14T23:05:32Z",
      "title": "Special counsel asks Supreme Court to let Trump's 2020 election case proceed to trial without delay",
      "url": "https://apnews.com/c2dcc83e56a541804d4785f6bb6cd45c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04eb0514db0c443ea422f231c2746ad8/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, ZEKE MILLER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — President Joe Biden avoided criminal charges around his handling of classified documents in part because of his answers during a lengthy interview with the special counsel investigating him.",
      "publishedAt": "2024-02-14T22:26:21Z",
      "title": "Biden allies, rivals both want transcript of his special counsel interview released. It could happen",
      "url": "https://apnews.com/ab454b5ce925b782202fe30875a2b5b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b31694770534f0eb3b74327ef2c9ae7/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and MICHELLE L. PRICE",
      "description": "NORTH CHARLESTON, S.C. (AP) — Former President Donald Trump again said Wednesday that if he returns to the White House, he would not defend NATO members that don't meet defense spending targets, days after he set off alarms in Europe by suggesting he would tell Russia to attack NATO allies he considered delinquent.",
      "publishedAt": "2024-02-15T02:57:15Z",
      "title": "Donald Trump stands by remarks about not defending NATO members after backlash",
      "url": "https://apnews.com/796f245e06d1a0f314e3b4bfdb793cc0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/928267a499574a8299a41244d74c7c42/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — A recent decline in arrests for illegal crossings on the U.S. border with Mexico may prove only temporary. The drop in January reflects how the numbers ebb and flow, and the reason usually goes beyond any single factor.",
      "publishedAt": "2024-02-14T23:11:31Z",
      "title": "Migrant crossings at the US-Mexico border are down. What's behind the drop?",
      "url": "https://apnews.com/8ae7910cda7e113b2fd57ae8d854f746",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b45f6c0df7a34fb688ad3bf4184b476c/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE, KEVIN FREKING, ELLEN KNICKMEYER and ZEKE MILLER",
      "description": "WASHINGTON (AP) — The U.S. has gathered highly sensitive intelligence about Russian anti-satellite weapons that has been shared in recent weeks with the upper echelons of government, according to four people who have been briefed on the intelligence.",
      "publishedAt": "2024-02-14T17:56:48Z",
      "title": "Russian efforts to create anti-satellite weapons are cause for US concern",
      "url": "https://apnews.com/6a4497fc2d74ebbe2ab3483ba43e09b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6252babf671448bbae68523c48013a0/1920.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Japan has slipped to the world’s fourth-largest economy as government data released Thursday showed it fell behind the size of Germany's in 2023.The numbers highlight how the Japanese economy has gradually lost its competitiveness and productivity while the population shrinks as Japanese people age and have fewer children, analysts say.",
      "publishedAt": "2024-02-15T01:10:56Z",
      "title": "Japan slips to the world's fourth-largest economy, behind the US, China and now Germany",
      "url": "https://apnews.com/893d53deba654c4924e4924f0b321cc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f3f2a4c766e42b98d640ae42852c916/3000.jpeg"
    },
    {
      "author": "GRANT PECK",
      "description": "BANGKOK (AP) — Myanmar’s military government on Wednesday said it will draft 60,000 young men and women yearly for military service under its newly activated conscription law, with call-ups beginning after the April festival marking the country’s traditional New Year.",
      "publishedAt": "2024-02-14T14:48:29Z",
      "title": "Myanmar will start drafting 5,000 people a month into the military soon. Some think of fleeing",
      "url": "https://apnews.com/025d7ce94293244ee356050cbfa031e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fbd720fec864368b301cc1ad9bc374b/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, SAMY MAGDY and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — International efforts to broker a cease-fire between Israel and Hamas suffered a setback on Wednesday as Israel reportedly recalled its negotiating team and Prime Minister Benjamin Netanyahu accused Hamas of hobbling the high-stakes negotiations by sticking to “delusional” demands.",
      "publishedAt": "2024-02-14T10:42:02Z",
      "title": "Gaza cease-fire and hostage release talks appear to stall as Netanyahu and Hamas trade blame",
      "url": "https://apnews.com/15eb8cbd5f15d52928711193081fe9c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5c59515c7e94a4293c4d812da929659/1920.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "NEW YORK (AP) — A few months ago, Derek Carrier started seeing someone and became infatuated.He experienced a “ton” of romantic feelings but he also knew it was an illusion.That's because his girlfriend was generated by artificial intelligence.",
      "publishedAt": "2024-02-14T05:11:57Z",
      "title": "Artificial intelligence, real emotion. People are seeking a romantic connection with the perfect bot",
      "url": "https://apnews.com/113df1b9ed069ed56162793b50f3a9fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/089914121c3045ecaeb300c2e9d2eac7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}