{
  "articles": [
    {
      "author": null,
      "description": "BELGRADE, Serbia (AP) — Authorities in Western Balkan countries warned citizens Friday to be cautious, drink water and avoid sunshine during an early heat wave that sent temperatures soaring to up to 40 degrees Celsius (104 degrees Fahrenheit.)",
      "publishedAt": "2024-06-21T11:08:07Z",
      "title": "Balkan countries swelter in early summer heat wave with people warned to take extra care",
      "url": "https://apnews.com/72b80a830b8bb275f377818ab2e41076",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe9e7b47d6eb487892978c18847b123b/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — President Joe Biden begins an intense period of private preparations Friday at Camp David for what may be the most consequential presidential debate in decades.",
      "publishedAt": "2024-06-21T04:12:22Z",
      "title": "How Biden and Trump are taking very different approaches to preparing for next week's debate",
      "url": "https://apnews.com/2f67b119f58136b310b625e42fad3d3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef767780c0a7423f876fbc3ff85a3ac8/3000.jpeg"
    },
    {
      "author": "DIDI TANG and KEN MORITSUGU",
      "description": "BEIJING (AP) — With no obvious options, China appears to be keeping its distance as Russia and North Korea move closer to each other with a new defense pact that could tilt the balance of power among the three authoritarian states.",
      "publishedAt": "2024-06-21T06:55:39Z",
      "title": "Russia-North Korea pact could dent China's influence, but Beijing still holds sway over both",
      "url": "https://apnews.com/3998a978ed89fd42b6da654ab1572873",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf25a862584c4e7db29f79e6322ec617/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The Israeli military said Sunday that it was establishing a new safe corridor to deliver aid into southern Gaza. But days later, this self-declared “tactical pause” has brought little relief to desperate Palestinians.",
      "publishedAt": "2024-06-20T20:32:04Z",
      "title": "Israel's pledge to guard an aid route into Gaza falls flat as lawlessness blocks distribution",
      "url": "https://apnews.com/988f2919d00339ded5a18f26feafda6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad74baab31bb4f99a643ff9584e34e7a/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — During daytime, entire districts of Ukraine's capital are disconnected from the power grid to save energy.",
      "publishedAt": "2024-06-21T05:20:05Z",
      "title": "Navigating through darkness: Ukraine’s emergency blackouts return after Russia pounds infrastructure",
      "url": "https://apnews.com/a0f9c6a84b708dfd493230c8c26716fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45b430863e82407da146248af4b77894/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — At least 47 people have died as downpours in southern China’s Guangdong province caused historic flooding and slides, state media reported Friday, while authorities warned of more extreme weather ahead in other parts of the country.",
      "publishedAt": "2024-06-21T04:53:25Z",
      "title": "Historic flooding in southern China kills 47, with more floods feared in coming days",
      "url": "https://apnews.com/4c9ff00b28335e7c54ac1c7acdbc09c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d0921a27c064cb7a956125b3a8d117a/3000.jpeg"
    },
    {
      "author": "NICK PERRY, HOLLY RAMER and ROBERT F. BUKATY",
      "description": "SQUAM LAKE, N.H. (AP) — As New England baked in a heat wave Thursday, guests at one campground were keeping their food and beer cold with blocks of ice harvested months earlier from a frozen lake.",
      "publishedAt": "2024-06-20T15:50:17Z",
      "title": "As millions sweat out the heat wave, blocks of lake ice keep these campers cool",
      "url": "https://apnews.com/fd0a476d9baea83a0a470189879547c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a283b6079a6431f9ac98cacfa43b4f9/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "FORT PIERCE, Fla. (AP) — The federal judge presiding over the classified documents case against former President Donald Trump is hearing arguments Friday on a long-shot defense effort to get the indictment thrown out based on the claim that the prosecutor who brought the charges was illegally appointed.",
      "publishedAt": "2024-06-21T04:11:30Z",
      "title": "Motion after motion puts Trump Florida case in slow motion as 3-day hearing begins",
      "url": "https://apnews.com/00ca368253a7d53881ba54d83e7f6a6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b48d3b3044e4a84a6a7ce91ea5a5552/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON and LAURIE KELLMAN",
      "description": "BARCELONA, Spain (AP) — Try saying “no” when a child asks for a smartphone. What comes after, parents everywhere can attest, begins with some variation of: “Everyone has one. Why can’t I?”But what if no pre-teen in sight has one — and what if having a smartphone was weird?",
      "publishedAt": "2024-06-21T05:10:52Z",
      "title": "Should young kids have smartphones? These parents in Europe linked arms and said no",
      "url": "https://apnews.com/a96775a16ba131d2cc50b27b5096fe8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bf9133bffc347dbbc2cfb38f2b42498/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Judges, state lawmakers and voters are deciding the future of abortion in the U.S. two years after the Supreme Court jolted the legal status quo with a ruling that overturned Roe v.",
      "publishedAt": "2024-06-21T04:05:24Z",
      "title": "Here’s the landscape 2 years after the Supreme Court overturned a national right to abortion",
      "url": "https://apnews.com/cadff0d905d1c4d7b9825c8406aadffb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38bc30b6bbb64e4680b72b8664f648e1/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}