{
  "articles": [
    {
      "author": "ERIC TUCKER, LINDSAY WHITEHURST and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — A judge on Monday set a March 4, 2024, trial date for Donald Trump in the federal case in Washington charging the former president with trying to overturn the results of the 2020 election, rejecting a defense request to push back the case by years.",
      "publishedAt": "2023-08-28T04:05:32Z",
      "title": "Trump trial set for March 4, 2024, in federal case charging him with plotting to overturn election",
      "url": "https://apnews.com/1a5ae1a0ea35492e1e347e28867a7d3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5da96a01115e4a3e91b353a5c94f08ab/3000.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN",
      "description": "By some measures, Jacksonville was making strides to emerge from its racist past. But the killing of three Black people by a young, white shooter was a painful and startling reminder that the remnants of racism still fester in the Florida city.",
      "publishedAt": "2023-08-28T08:17:25Z",
      "title": "Jacksonville killings refocus attention on the city's racist past and the struggle to move on",
      "url": "https://apnews.com/89deb39815e7f319a19cf71536042010",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8a1ca5284e34dd6b5cd45bf9c2a2467/3000.jpeg"
    },
    {
      "author": "LAURA BARGFELD",
      "description": "TAMPA, Fla. (AP) — Florida residents loaded up on sandbags and evacuated from homes in low-lying areas along the Gulf Coast as Tropical Storm Idalia intensified Monday and forecasters predicted it would hit in days as a major hurricane with potentially life-threatening storm surges.",
      "publishedAt": "2023-08-28T12:34:56Z",
      "title": "Florida governor declares widespread state of emergency ahead of Idalia's expected landfall",
      "url": "https://apnews.com/431e595c7ebe2b849b58811d1d7b2685",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca36d27925f641f293aa6d0fd76c4d85/1920.jpeg"
    },
    {
      "author": "JEFF MARTIN",
      "description": "Floridians pray that when Idalia hits the Gulf Coast it won't join the long list of destructive Atlantic Ocean storms whose names started with “I.”",
      "publishedAt": "2023-08-28T19:58:02Z",
      "title": "Florida prays Idalia won't join long list of destructive storms with names starting with “I.”",
      "url": "https://apnews.com/4576d3b4b479df90a1ae3cbf37c7f728",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51f28067bc144de3ab56a6233cdab93b/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT, EMILY SWANSON and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden is “old” and “confused,” and former President Donald Trump is “corrupt” and “dishonest.” Those are among the top terms Americans use when they’re asked to describe the Democrat in the White House and the Republican best positioned to face him in next year’s election.",
      "publishedAt": "2023-08-28T10:34:57Z",
      "title": "Biden is 'old,' Trump is 'corrupt': AP-NORC poll has ominous signs for both in possible 2024 rematch",
      "url": "https://apnews.com/12b806876e2072790f9a67793761c688",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c7c09e8f01740d3919dda2aa3193eb1/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — The movie centers around a renowned violinist from Belgium arriving in Kyiv to perform. The date is February 2022, and his trip is upended as Russia starts bombing Ukraine. The musician survives a series of “inhuman crimes and bloody provocations by Ukrainian nationalists,” and he wants to tell the world “what it was really like.”",
      "publishedAt": "2023-08-28T04:51:07Z",
      "title": "The Ukraine war, propaganda-style, is coming to Russian movie screens. Will people watch?",
      "url": "https://apnews.com/16fa6ec7ac56641dd1b346d2b22e3e9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23ebc8bd21d049439002bbb0dc08fc66/3000.jpeg"
    },
    {
      "author": "JENNIFER McDERMOTT and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — Hawaii’s electric utility acknowledged its power lines started a wildfire on Maui but faulted county firefighters for declaring the blaze contained and leaving the scene, only to have a second wildfire break out nearby and become the deadliest in the U.S.",
      "publishedAt": "2023-08-28T16:17:55Z",
      "title": "Hawaii power utility takes responsibility for first fire on Maui, but faults county firefighters",
      "url": "https://apnews.com/1741e22bbf955b62103db6b60f5c4853",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73c3e56e1ab549d3a3f34c666769eb67/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden will observe next month's 22nd anniversary of the worst terrorist attack on U.S. soil at an Alaska military base with service members and their families, the White House announced.",
      "publishedAt": "2023-08-28T17:13:15Z",
      "title": "Biden will observe 9/11 in Alaska instead of the traditional NYC, Virginia or Pennsylvania events",
      "url": "https://apnews.com/8e58378865dc612a49d0a2dee80f2304",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87490a73726040c7b56912ec0eebdcaf/3000.jpeg"
    },
    {
      "author": null,
      "description": "ROME (AP) — Pope Francis has blasted the “backwardness” of some conservatives in the U.S. Catholic Church, saying they have replaced faith with ideology and that a correct understanding of Catholic doctrine allows for change over time.",
      "publishedAt": "2023-08-28T12:15:26Z",
      "title": "Pope says 'backward' U.S. conservatives have replaced faith with ideology",
      "url": "https://apnews.com/bbfc346c117bd9ae68a1963478bea6b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a624334629ed4c8bb2a1f763c4a030cb/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER",
      "description": "TOLEDO, Ohio (AP) — Samuel “Joe” Wurzelbacher, who was thrust into the political spotlight as “Joe the Plumber” after questioning Barack Obama about his economic policies during the 2008 presidential campaign, and who later forayed into politics himself, has died, his son said Monday.",
      "publishedAt": "2023-08-28T17:21:17Z",
      "title": "Joe the Plumber, who questioned Obama's tax policies during the 2008 campaign, has died at 49",
      "url": "https://apnews.com/71205f6f377129b3f1122f26ca238dc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd46436d9c2343d199fa394d4776a6de/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}