{
  "articles": [
    {
      "author": "WILL GRAVES",
      "description": "Kerry Bowie's daughters have dreams. Big ones. His 15-year-old wants to go to law school, maybe dabble in politics. His 12-year-old plans to be a business magnate.And while their schedules are jammed with everything from piano and violin lessons to soccer and volleyball tournaments, at some point this summer Bowie plans to take them to Franklin Park in the heart of Boston, place a golf club in their hands and have them learn about a game whose influence extends far beyond fairways and greens.",
      "publishedAt": "2023-07-17T04:18:27Z",
      "title": "Golf has long been about making connections. That won't change in an LIV-PGA Tour world",
      "url": "https://apnews.com/efd5af5aeaecca63e0f02f743a8f9032",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/573bd3fe29954c78a85f5bf6fd2336f8/2000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — To get a sense of just how much animosity is flying around Hollywood these days, watch how Ron Perlman responded to a report that the studios aimed to prolong a strike long enough for writers to lose their homes.",
      "publishedAt": "2023-07-17T15:40:58Z",
      "title": "Hollywood plunges into all-out war on the heels of pandemic and a streaming revolution",
      "url": "https://apnews.com/946a2bf9de48a9d55f3160df6be8f481",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cee7a7f439047528bc8ac9763f70f75/3000.jpeg"
    },
    {
      "author": "COURTNEY BONNELL",
      "description": "LONDON (AP) — Russia on Monday halted a breakthrough wartime deal that allowed grain to flow from Ukraine to countries in Africa, the Middle East and Asia where hunger is a growing threat and high food prices have pushed more people into poverty.",
      "publishedAt": "2023-07-17T09:05:30Z",
      "title": "Russia halts landmark deal that allowed Ukraine to export grain at time of growing hunger",
      "url": "https://apnews.com/ba7f9146b745337a1948a964cb30331c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/530683f9c8f44a13a2a356a35c28cc5c/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An attack before dawn Monday damaged a bridge linking Russia to Moscow-annexed Crimea that is a key supply route for Kremlin forces in the war with Ukraine, forcing the span’s temporary closure for a second time in less than a year.",
      "publishedAt": "2023-07-17T04:01:53Z",
      "title": "Key Russian bridge to Crimea is struck again as Putin vows response to attack that killed 2",
      "url": "https://apnews.com/eafa1696fc5f2377cb83ac4b317c5386",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ee591945a174d5fa8c69c606bf648f2/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — A month after former President Donald Trump was charged with mishandling classified documents, the judge presiding over the case is set to take on a more visible role as she weighs competing requests on a trial date and hears arguments this week on a procedural, but potentially crucial, area of the law.",
      "publishedAt": "2023-07-17T04:06:33Z",
      "title": "Spotlight on judge in Trump documents case intensifies following controversial earlier ruling",
      "url": "https://apnews.com/2737f5645c7d6d1b83ca06810542df88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/935854df54ea4f5a9cbec723523be207/1873.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — When Speaker Kevin McCarthy suggested recently he might stop the FBI from relocating its downtown headquarters to a new facility planned for the Washington suburbs, it was more than idle thinking about an office renovation.",
      "publishedAt": "2023-07-17T04:03:47Z",
      "title": "GOP and FBI are at odds as Republicans move to stop the agency's new headquarters after Trump probes",
      "url": "https://apnews.com/8ece63b547f465bb48f35d11b2034e04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57659273634b4b4ebf69996397b92950/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "WEST PALM BEACH, Fla. (AP) — When student activists assembled in Florida last year for Turning Point Action’s annual summit, many were torn, wrestling with whether former President Donald Trump or Florida Gov.",
      "publishedAt": "2023-07-17T18:04:57Z",
      "title": "Turning Point Action's student activists were torn between Trump and DeSantis last year. Not anymore",
      "url": "https://apnews.com/cb94fa925ba2e4774ecbb9736fbcbe15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96120f256e3e4180ab0de4213b42a9ca/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and JEFF AMY",
      "description": "HAMPTON, Ga. (AP) — The 40-year-old man who shot four people in the country's 31st mass killing this year needed mental help for nearly a decade but his family and officials couldn't force him to get treatment, his mother said.",
      "publishedAt": "2023-07-17T17:27:43Z",
      "title": "Mother says man who killed 4 people in Georgia needed mental help for years but refused treatment",
      "url": "https://apnews.com/5b93bc989833679f5239d36e976d543b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a399301d615e4ff2809a5ec28226e785/1920.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE",
      "description": "CHICAGO (AP) — For Chicagoans planning a lengthy outdoor run Monday, “today is not necessarily the day for that,” according to Kim Biggs of the Illinois Environmental Protection Agency.Extensive swaths of the northern United States awoke to unhealthy air quality Monday morning or were experiencing it by midafternoon, according to the Environmental Protection Agency's AirNow.gov Smoke and Fire map.",
      "publishedAt": "2023-07-17T18:24:41Z",
      "title": "Unhealthy air quality lingers across parts of U.S. from drifting Canadian wildfire smoke",
      "url": "https://apnews.com/bd2cb7203ab4e22249ecf68a374b4bfc",
      "urlToImage": ""
    },
    {
      "author": "BRIAN MELLEY",
      "description": "LONDON (AP) — Kevin Spacey 's lawyers enlisted the help of an A-list star Monday in his sexual assault trial, calling on Elton John and his husband to cast doubt on one of the Oscar winner's accusers at the end of the defense case.",
      "publishedAt": "2023-07-17T10:45:09Z",
      "title": "Elton John lends celebrity testimony to Kevin Spacey's sexual assault trial",
      "url": "https://apnews.com/68c1108bd46e5641bc10d0a5b3ccc785",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dd36ed295a04b55be64bde46a121a9c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}