{
  "articles": [
    {
      "author": "Illia Novikov",
      "description": "Officials say a Russian drone has struck an apartment building in a southeastern Ukraine city, killing three people and injuring 10 others. The attack early Friday came a day after U.S. President Donald Trump rebuked Russia’s leader for a deadly missile and drone attack on Kyiv while Washington endeavors to stop the more than three-year war. Russia pounded Kyiv in an hourslong barrage Thursday, killing at least 12 people and injuring 87 in its deadliest assault on the Ukrainian capital since July. Trump envoy Steve Witkoff is expected to meet with President Vladimir Putin in Moscow on Friday for the second time this month.",
      "publishedAt": "2025-04-25T08:23:52Z",
      "title": "Ukraine says Russia kills 3 in another drone attack after Trump rebukes Putin",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-putin-33015fe967ab7cd09fee165fed59953e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e3ece30/2147483647/strip/true/crop/7377x4150+0+384/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F64%2Fa0fd2b356466dafc87092d1f5c11%2F2d3514f6bd7b4439a769dba42f82e7c9"
    },
    {
      "author": "Colleen Barry",
      "description": "Heads of state and royalty will begin converging on Rome for Pope Francis’ funeral in the Vatican’s St. Peter’s Square, but the group of poor people who will meet his casket in a small crosstown basilica are more in keeping with Francis’ humble persona and disdain for pomp. U.S. President Donald Trump and Argentine President Javier Milei are among the leaders arriving Friday. That is the last day Argentine pope will lie in state in St. Peter’s Basilica before his coffin is sealed in preparation for his funeral Saturday. More than 90,000 mourners have waited hours in line to bid farewell to Francis, who died Monday.",
      "publishedAt": "2025-04-25T04:07:48Z",
      "title": "Trump and Zelenskyy among dignitaries converging on Rome for funeral of Pope Francis",
      "url": "https://apnews.com/article/italy-vatican-pope-funeral-dignitaries-b8c206d03e3535b8ee3b18d42667b803",
      "urlToImage": "https://dims.apnews.com/dims4/default/2fba9c1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F91%2F18f17c1a0ac4cf08c7b08cca5c7d%2F12068fd3696c4425b9410471616641b3"
    },
    {
      "author": "Peter Smith, Michelle L. Price",
      "description": "The clash in style between Donald Trump and Pope Francis and their positions on migration, the environment and poverty will come into sharper focus with the president in Rome for Francis’ funeral. It will be held Saturday morning in St. Peter’s Square. Despite the billionaire former reality star’s divergences over the years with the holy leader known for a humble style, Trump’s support has risen over the years among American Catholics. He courted them in his last presidential campaign, and many influential bishops are among his supporters.",
      "publishedAt": "2025-04-25T04:06:55Z",
      "title": "Trump’s trip to Pope Francis’ funeral highlights years of clashes",
      "url": "https://apnews.com/article/trump-pope-francis-funeral-catholics-relationship-a34cb1f8a6ceb147e2e112cb4e02e32c",
      "urlToImage": "https://dims.apnews.com/dims4/default/53247ad/2147483647/strip/true/crop/3911x2200+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F33%2Fd3b153cd6acfd8416776c628da4f%2F2476823162114b2ea4d0a9a75056f92b"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump can’t stop contradicting himself on his own tariff plans. Trump says he’s on a path to cut several new trade deals in a few weeks — but also suggests it’s “physically impossible” to hold all the needed meetings. The Republican president has said he'll simply set new tariff rates negotiated internally within the U.S. government over the next few weeks — although he already did that April 2, causing the world economy to shudder. The sure bet is uncertainty will persist in ways that employers and consumers alike expect to damage the economy and that leave foreign leaders scratching their heads in bewilderment.",
      "publishedAt": "2025-04-25T17:47:09Z",
      "title": "Trump keeps contradicting himself on tariffs, unnerving world economy",
      "url": "https://apnews.com/article/trump-tariffs-time-china-switzerland-660aa519e9059de7d81368ec4eef4b38",
      "urlToImage": "https://dims.apnews.com/dims4/default/d64f0b0/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F49%2F050cd37d85631f478960b5600316%2F09a4dc1c6dcc47f5ba01d843182369e1"
    },
    {
      "author": null,
      "description": "FBI Director Kash Patel says a Wisconsin county judge accused of helping a man avoid immigration enforcement has been arrested. Patel made the announcement Friday in a post on X and says his office believes Judge Hannah Dugan “intentionally misdirected federal agents away from the subject to be arrested in her courthouse.” Patel identified the subject as Eduardo Flores Ruiz and said Dugan’s actions allowed Ruiz to evade arrest.",
      "publishedAt": "2025-04-25T14:52:41Z",
      "title": "FBI director says judge accused of helping someone evade immigration agents has been arrested",
      "url": "https://apnews.com/article/immigration-judge-arrested-7997186bbca5730e70a25f2347e631f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c07484/2147483647/strip/true/crop/7200x4050+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F51%2Ff3c3199c773a19a48e393ff194ce%2Fb22018a336ec425e886a1e8bc16df6ca"
    },
    {
      "author": "Eric Tucker, Alanna Durkin Richer",
      "description": "The Justice Department is poised to crack down on leaks of information to the news media, authorizing prosecutors to issue subpoenas to news organizations as part of leak investigations, serve search warrants when appropriate and force journalists to testify about their sources. New regulations, announced by Attorney General Pam Bondi in a memo to the staff obtained by The Associated Press on Friday, rescind a Biden administration policy that protected journalists from having their phone records secretly seized during leak investigations — a practice long decried by news organizations and press freedom groups.",
      "publishedAt": "2025-04-25T21:25:06Z",
      "title": "Justice Department to crack down on leaks by subpoenaing journalists",
      "url": "https://apnews.com/article/justice-department-subpoenas-journalists-leaks-investigations-0d5745648eb935a89af1529e08536b9d",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c1ee64/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F31%2F03871b29dd530d362b1c07480c2e%2Fccdc0668d4c649fa8aa9e5fee36b8e34"
    },
    {
      "author": "Janie Har, Kate Brumback",
      "description": "A government lawyer said the federal government is reversing the termination of legal status for international students after many filed court challenges around the U.S. Judges around the country had already issued temporary orders restoring the students’ records in a federal database of international students maintained by Immigration and Customs Enforcement, or ICE. The records had been suddenly terminated in recent weeks, often without the students or their schools being notified. A lawyer for the government read a statement in federal court in Oakland that said ICE was manually restoring the student status for people whose records were terminated in recent weeks.",
      "publishedAt": "2025-04-25T16:44:14Z",
      "title": "Government lawyer: ICE is reversing termination of legal status for international students around US",
      "url": "https://apnews.com/article/international-student-status-restored-9e8a7cb90f4193ec52bf06edc5094cd9",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Ashraf Khalil",
      "description": "Organizers and the Kennedy Center have canceled a week’s worth of events celebrating LGBTQ+ rights for this summer’s World Pride festival in Washington, D.C. The move comes amid a shift in priorities and the ousting of center leadership. Multiple artists and producers involved in the center’s Tapestry of Pride schedule told The Associated Press that their events had been quietly canceled or moved to other venues. Washington’s Capital Pride Alliance has disassociated itself from the Kennedy Center. The events at the center had been planned for June 5 to 8. The Kennedy Center’s website still lists Tapestry of Pride on its website with a general description. The center didn’t respond to a request for comment.",
      "publishedAt": "2025-04-25T21:53:24Z",
      "title": "Kennedy Center cancels LGBTQ+ World Pride events",
      "url": "https://apnews.com/article/world-pride-kennedy-center-trump-lgbtq-69fbf0ca20c2f9c36f49f8311f8bf1b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/fce8435/2147483647/strip/true/crop/4104x2309+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2Ff9%2Fc27812a5bdeb9e34dfe91c626e62%2Facfcf3b1cce94ee18ded76606cbc31c0"
    },
    {
      "author": "Michael R. Sisak",
      "description": "Luigi Mangione has pleaded not guilty to a federal murder charge in the killing of UnitedHealthcare CEO Brian Thompson, as prosecutors formally declared their intent to seek the death penalty against him. Mangione, 26, stood with his lawyers as he entered the plea Friday, leaning forward toward a microphone as he addressed U.S. District Judge Margaret Garnett. Asked how he wished to plead, Mangione said simply, “not guilty.” Mangione’s arraignment attracted several dozen people to the federal courthouse in Manhattan, including former Army intelligence analyst Chelsea Manning, who served about seven years in prison for stealing classified diplomatic cables.",
      "publishedAt": "2025-04-25T17:29:36Z",
      "title": "Luigi Mangione pleads not guilty to federal death penalty charge in UnitedHealthcare CEO’s killing",
      "url": "https://apnews.com/article/unitedhealthcare-ceo-killing-luigi-mangione-nyc-bc926d92af482822c3186d55b87c5115",
      "urlToImage": "https://dims.apnews.com/dims4/default/18319b7/2147483647/strip/true/crop/6755x3800+0+352/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F72%2F62ff0b1d6e2f52a0ed1d2ada1c62%2Fde75057f69af4a9497ef896e4d64218a"
    },
    {
      "author": "Michael Kunzelman",
      "description": "A federal judge has agreed to temporarily block the Trump administration from implementing an executive order that a labor union says would cancel collective bargaining rights for hundreds of thousands of federal employees. U.S. District Judge Paul Friedman ruled Friday that a key part of President Donald Trump’s March 27 order can’t be enforced at roughly three dozen agencies and departments where employees are represented by the National Treasury Employees Union. The union said it would lose more than half of its revenue and over two-thirds of its membership if the judge denied its request for a preliminary injunction.",
      "publishedAt": "2025-04-25T21:08:24Z",
      "title": "Judge blocks Trump order on federal employee unions",
      "url": "https://apnews.com/article/trump-labor-union-collective-bargaining-94c4f6d4f88b2953ce45bbfca1f35699",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e1b039/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Ff0%2F030b88fe7d8fee886c3dc11bb0f9%2F2610ee8fca9a4779b7ad6287619a5703"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}