{
  "articles": [
    {
      "author": "CLAIRE RUSH, JENNIFER SINCO KELLEHER and BEATRICE DUPUY",
      "description": "LAHAINA, Hawaii (AP) — As the death toll from a wildfire that razed a historic Maui town reached 89, authorities warned Saturday that the effort to find and identify the dead was still in its early stages.",
      "publishedAt": "2023-08-13T04:28:09Z",
      "title": "As death toll from Maui fire reaches 89, authorities say effort to count the losses is just starting",
      "url": "https://apnews.com/fb2ebf6cd39c149a582b82eed6ac3930",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d805721ab83444fae27bb65ac87626d/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — As he gears up for reelection, President Joe Biden is already facing questions about his ability to convince voters that the economy is performing well.",
      "publishedAt": "2023-08-12T04:26:20Z",
      "title": "Biden's reelection bid faces vulnerabilities in wake of special counsel appointment",
      "url": "https://apnews.com/aa7a608719c0fbcb281408420e4235ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44290ff664f04e6292a0ec1394fd3c6d/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Western-backed maritime forces in the Middle East on Saturday warned shippers traveling through the strategic Strait of Hormuz to stay as far away from Iranian territorial waters as possible to avoid being seized, a stark advisory amid heightened tensions between Iran and the U.S.",
      "publishedAt": "2023-08-12T14:47:41Z",
      "title": "Shippers warned to stay away from Iranian waters over seizure threat as US-Iran tensions high",
      "url": "https://apnews.com/6d33ae164cb5f89a0347634b2ed45ae7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a9d1dd6f7ee434aba709057f8504528/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russia thwarted an attack by 20 Ukrainian drones targeting Moscow-annexed Crimea overnight, the Russian Defense Ministry said Saturday.Fourteen drones were shot down by Russian air defenses and a further six were jammed electronically, the ministry said in a Telegram post.",
      "publishedAt": "2023-08-12T08:24:47Z",
      "title": "Russia downs 20 drones over Crimea following a spate of attacks on Moscow",
      "url": "https://apnews.com/de83d603e64ab85e48ae37be27997caf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88874af314cc45119176a4d9b73dbd1c/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Pentagon is developing plans to restructure the National Guard in Washington, D.C., in a move to address problems highlighted by the chaotic response to the Jan.",
      "publishedAt": "2023-08-12T11:19:27Z",
      "title": "The Pentagon plans to shake up DC’s National Guard, criticized for its response to protests, Jan. 6",
      "url": "https://apnews.com/e80e186b33efeff0f38ed19d5951d42e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a17a46e3618490f94655f61738f77cf/3000.jpeg"
    },
    {
      "author": null,
      "description": "DAMASCUS, Syria (AP) — The sound of repeated explosions could be heard in the area around the Syrian capital before dawn on Sunday, state media and Damascus residents said.",
      "publishedAt": "2023-08-13T03:04:50Z",
      "title": "Syrian capital rocked by explosions but no immediate word on source or target of attacks",
      "url": "https://apnews.com/fcd438dd96ef3d438be1da82c86ac268",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24b1d42506874d51badf9152cd8f7fba/3000.jpeg"
    },
    {
      "author": "SARA BURNETT",
      "description": "VAIL, Iowa (AP) — Republican presidential hopeful Vivek Ramaswamy was more than 40 minutes into a town hall in rural Iowa when a woman in the crowd posed a pointed question.",
      "publishedAt": "2023-08-12T04:40:36Z",
      "title": "How Vivek Ramaswamy is pushing — delicately — to win over Trump supporters",
      "url": "https://apnews.com/768b865d113f603a721cb0f7d1e8053a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c74c922f8744f1ebdde1eab784f178c/3000.jpeg"
    },
    {
      "author": "JAMES POLLARD",
      "description": "PHILLIPS COMMUNITY, S.C. (AP) — The Rev. Elijah Smalls Jr. once grew okra, butter beans and other vegetables in the neighborhood where his family has lived near the South Carolina coast since not long after the Civil War.",
      "publishedAt": "2023-08-12T05:01:53Z",
      "title": "Developers have Black families fighting to maintain property and history",
      "url": "https://apnews.com/7eeb7b1bcb70e845ffec7eeba23f594b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/273ab82174974ad5833456a9736158dc/3000.jpeg"
    },
    {
      "author": "ZARAR KHAN and KIRSTEN GRIESHABER",
      "description": "ISLAMABAD (AP) — An investigation has been launched into the death of a Pakistani porter near the peak of the world's most treacherous mountain, a Pakistani mountaineer said Saturday, following allegations that dozens of climbers eager to reach the summit had walked past the man after he was gravely injured in a fall.",
      "publishedAt": "2023-08-12T13:55:39Z",
      "title": "Record-breaking summit of K2 dogged by allegations that Western climbers left Pakistani man to die",
      "url": "https://apnews.com/51429bae5b1c53a449c360ad42c38153",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15a627555d8e4abbacc3336826336e95/3000.jpeg"
    },
    {
      "author": "JOHN WAWROW",
      "description": "ORCHARD PARK, N.Y. (AP) — Whatever jitters Bills safety Damar Hamlin might have been feeling went away midway through the first quarter on Saturday, when he first heard the play call: Blitz.Four snaps into his first game in a competitive setting since a near-death experience on Jan, 2, Hamlin broke toward the line and stopped Indianapolis Colts running back Evan Hull for no gain on fourth-and-1 from the Buffalo 40.",
      "publishedAt": "2023-08-12T10:00:27Z",
      "title": "Damar Hamlin makes an early impact in returning to field in Bills' preseason game against Colts",
      "url": "https://apnews.com/bffe86713152ee00d2e91f78b507a91e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9581fded719e4da8afd2327d8eaf6864/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}