{
  "articles": [
    {
      "author": "Stephen Groves",
      "description": "The Department of Veterans Affairs is planning an “aggressive” reorganization that includes cutting 80,000 jobs from the sprawling agency that provides health care for retired military members. That's according to an internal memo obtained by The Associated Press. The VA’s chief of staff, Christopher Syrek, told top level officials at the agency that it had an objective to cut enough employees to return to 2019 staffing levels of just under 400,000. That would require terminating tens of thousands of employees after the VA expanded under the Biden administration, as well as to cover veterans impacted by burn pits under the 2022 PACT Act.",
      "publishedAt": "2025-03-05T16:51:56Z",
      "title": "Trump administration plans to cut 80,000 employees from Veterans Affairs",
      "url": "https://apnews.com/article/veterans-affairs-cuts-doge-musk-trump-f587a6bc3db6a460e9c357592e165712",
      "urlToImage": "https://dims.apnews.com/dims4/default/880d936/2147483647/strip/true/crop/5100x2869+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F21%2Fb2422e0c15ea0efc2189b5036c5c%2F001c7c8c71a04876882ece68d0d0b273"
    },
    {
      "author": "Ben Finley, Stephen Groves",
      "description": "A handful of veterans speaking to The Associated Press are divided over the Trump administration's proposed cuts to the Department of Veterans Affairs. Stephen Watson is a former Marine who lives in Jesup, Georgia. Watson says everyone, including veterans, needs to share in the sacrifice to bring the nation's spending under control. But former Marine Gregg Bafundo, of Tonasket, Washington, disagrees. Bafundo says President Donald Trump's cuts are only about “hurting people and breaking things.” The Republican administration's plans to cut $2 billion in VA contracts are currently on pause. That's because of concerns that critical health services for veterans would be harmed.",
      "publishedAt": "2025-03-05T12:02:39Z",
      "title": "Veterans are speaking out on Musk's plans to cut the VA's budget",
      "url": "https://apnews.com/article/veterans-doge-va-trump-cuts-marines-opinions-370be785e1117ab0d82a58c95c639420",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec7a960/2147483647/strip/true/crop/5687x3199+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F80%2F5405a5eddac6690075f91f0c876e%2Ffbfbd592a5724e8bb44aacc1639a16da"
    },
    {
      "author": "Mike Stobbe",
      "description": "The nation’s top public health agency is inviting about 180 employees back to work about two weeks after laying them off. Emails went out Tuesday to some Centers for Disease Control and Prevention probationary employees who got termination notices last month. A message seen by the AP was sent with the subject line, “Read this e-mail immediately.” It said that a Feb. 15 termination notice has been rescinded. It’s not clear how many people returned to work Wednesday. And it’s also unclear whether the employees would be spared from further widespread job cuts that are expected soon across government agencies.",
      "publishedAt": "2025-03-05T19:46:20Z",
      "title": "CDC calls 180 fired employees back to work on a day's notice",
      "url": "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930",
      "urlToImage": "https://dims.apnews.com/dims4/default/977c96f/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Ff3%2Fc28219f311c09b7e59b5e82de64f%2Fcb1cfaf434544ae0bb7daf1919f6a315"
    },
    {
      "author": "Jill Colvin, Michael R. Sisak",
      "description": "The Trump administration published a list of more than 440 federal properties it identified to close or sell, including the FBI headquarters and the main Department of Justice building, after deeming them “not core to government operations.” Hours later on Tuesday, however, the administration issued a revised list with only 320 entries — none in Washington, D.C. And by Wednesday morning, the list was gone entirely. “Non-core property list (Coming soon)” the same page read. The General Services Administration, which published the list, did not immediately respond to questions about the changes. The initial list had included some of the country’s most recognizable buildings and spanned nearly every state.",
      "publishedAt": "2025-03-04T22:57:03Z",
      "title": "Trump administration deletes list of buildings targeted for potential sale",
      "url": "https://apnews.com/article/gsa-federal-buildings-doge-fbi-doj-aa123e9c3b12e38c8fa511c2a727f880",
      "urlToImage": "https://dims.apnews.com/dims4/default/4dd18be/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2Ff5%2Fe427f2e2259fab13adeba25d3529%2Fc649233a85c849c8aa11bfe8c641c7c7"
    },
    {
      "author": "Lindsay Whitehurst, Rebecca Boone",
      "description": "The Trump administration is dropping an emergency abortion case in Idaho in one of the administration’s first moves on the issue since President Donald Trump's second term began. The Justice Department filed a motion to dismiss the Biden administration lawsuit in a reversal that could have national implications for urgent care. The lawsuit had argued that emergency-room doctors treating pregnant women had to provide terminations if needed to save their lives or to avoid serious health consequences in Idaho, which has one of the country’s strictest abortion bans. The state argues that its law does allow life-saving abortions and the Biden administration wrongly sought to expand the exceptions.",
      "publishedAt": "2025-03-05T16:36:25Z",
      "title": "Trump administration moves to drop Idaho emergency abortion case",
      "url": "https://apnews.com/article/abortion-emergencies-trump-idaho-emergency-3ec19baa29bcc1fd5c94aada6ea4905e",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c73904/2147483647/strip/true/crop/2948x1658+0+2/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F13%2F55957368f9e83c8dc5a97f716ff1%2F5e05751ada56448eac8bcc87fb0537a1"
    },
    {
      "author": "Aamer Madhani",
      "description": "White House press secretary Secretary Karoline Leavitt says that U.S. officials have had “ongoing talks and discussions” with Hamas officials. The talks come as Israel-Hamas ceasefire remains in the balance. Leavitt declined to detail the talks, which were first reported by the news site Axios.",
      "publishedAt": "2025-03-05T18:52:25Z",
      "title": "White House confirms 'ongoing talks and discussions' with Hamas",
      "url": "https://apnews.com/article/hamas-israel-trump-ceasefire-bdc21f862b073dd478e0960ebfbf71e3",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Panama President José Raúl Mulino has accused U.S. President Donald Trump of lying when Trump said in his address to Congress the night before that his administration was “reclaiming” the Panama Canal. Trump was referencing a deal announced Tuesday for a consortium led by BlackRock Inc. to buy a controlling stake in the company held by a Hong Kong-based group that operates ports at both ends of the Panama Canal. Panama maintains that it has full control over the canal and that the Hong Kong-based group’s operation of the ports did not amount to Chinese control. Mulino in a message posted to X on Wednesday, rejected that the deal came about because of U.S. pressure.",
      "publishedAt": "2025-03-05T14:58:38Z",
      "title": "Panama president calls Trump's talk of 'reclaiming' the Panama Canal a lie",
      "url": "https://apnews.com/article/panama-canal-trump-china-a56f0bcec1952417f1c8c47fa34ec20e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b634f4c/2147483647/strip/true/crop/6192x3483+0+323/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2Fd5%2F3fc47bdf568b0e8d896bbd128828%2F46acab0c4a8047ff898a3a463bfc5324"
    },
    {
      "author": "Josh Boak, Rob Gillies",
      "description": "Commerce Secretary Howard Lutnick said there might be carveouts coming to the 25% tariffs placed on Canada and Mexico by President Donald Trump. It's a sudden backing away after Tuesday’s tax hike hurt the stock market, worried consumers and started a trade war. In a Wednesday interview with Bloomberg Television, Lutnick said that Trump would update his tariff plans with an afternoon announcements, possibly sparing sectors such as autos from the import taxes.",
      "publishedAt": "2025-03-05T14:00:52Z",
      "title": "Trump administration signals that the tariffs against Canada and Mexico may soon have exemptions",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-lutnick-2b269614084027a4894aa14f3dc16227",
      "urlToImage": "https://dims.apnews.com/dims4/default/48ad772/2147483647/strip/true/crop/6834x3844+0+356/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F5d%2Fe1ed99eccd7c87f070165de5b097%2Fea9d7970e09447939fcd69884171d1a7"
    },
    {
      "author": "Mark Sherman",
      "description": "A sharply divided Supreme Court has rejected a Trump administration push to rebuke a federal judge who imposed a quick deadline to release billions of dollars in foreign aid. By a 5-4 vote Wednesday, the court told U.S. District Judge Amir Ali to clarify his earlier order that required the Republican administration to release nearly $2 billion in aid for work that had already been done. Justice Samuel Alito led four conservative justices in dissent, saying Ali lacks the authority to order the payments. Alito wrote that he is stunned the court is rewarding “an act of judicial hubris.”",
      "publishedAt": "2025-03-05T14:13:31Z",
      "title": "Divided Supreme Court reinstates order requiring Trump administration to release frozen foreign aid",
      "url": "https://apnews.com/article/supreme-court-trump-usaid-foreign-billions-30b8bde0b16c0bd68f8b690f14923c50",
      "urlToImage": "https://dims.apnews.com/dims4/default/185178d/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Ff3%2F037f98fcb4f310f35173da606ec6%2F263d4bd9234b47c2ac293ee41794f771"
    },
    {
      "author": "Will Weissert, Valerie Gonzalez",
      "description": "Vice President JD Vance has participated in an aerial tour of the U.S.-Mexico border and met with law enforcement officials. It's part of a trip Wednesday meant to highlight tougher immigration policies that the White House says has led to dramatically fewer arrests for illegal crossings since President Donald Trump began his second term. Joined by Defense Secretary Pete Hegseth and Director of National Intelligence Tulsi Gabbard, Vance viewed the Eagle Pass area by helicopter. The trio also visited a detention facility before holding a roundtable discussion with local and national participants. Arrests for illegal border crossings from Mexico fell 39% in January from a month earlier, though they’ve been falling sharply since well before Trump took office",
      "publishedAt": "2025-03-05T12:01:11Z",
      "title": "Vance visits the US-Mexico border to tout Trump's immigration crackdown",
      "url": "https://apnews.com/article/vance-border-visit-mexico-texas-gabbard-hegseth-066a1891e51890d50b48fb55191f0dcc",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c78f0a/2147483647/strip/true/crop/7401x4163+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F02%2Fd1e987711e8012cff62d1ad7ad9f%2Fa721385931464f3893b867945f13d023"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}