{
  "articles": [
    {
      "author": "DARLENE SUPERVILLE, MICHELLE L. PRICE",
      "description": "President Donald Trump has signed an executive order to study how to expand access to in vitro fertilization and make it more affordable. Tuesday's signing follows up on a campaign pledge that was at odds with some members of his party. Trump also signed another executive order as well as a presidential memorandum at his Florida home and club, Mar-a-Lago. The other executive order outlined the oversight functions of the Office of Management and Budget, while the presidential memorandum called for more transparency from the government. Trump answered questions from reporters after signing the orders. His first joint TV interview with adviser Elon Musk airs later Tuesday on Fox News Channel.",
      "publishedAt": "2025-02-18T16:17:28Z",
      "title": "Trump signs order to study how to expand access to IVF",
      "url": "https://apnews.com/article/trump-executive-order-musk-hannity-143316eda581ac466cd923cdf4568d87",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb5cf87/2147483647/strip/true/crop/2613x1470+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fe3%2Fb6f84db18540ad5515dc9530dcef%2F3431098aace84487b3ece39de6d0dfc0"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "The White House says billionaire Elon Musk is not the administrator of the Department of Government Efficiency team sweeping through federal agencies, but rather a senior adviser to President Donald Trump. That's according to court documents. The declaration was filed Monday as the Trump administration fends off a lawsuit from several Democratic states that want to block Musk and the DOGE team from government systems. They say he’s wielding sweeping power to access data and make mass layoffs without being confirmed by the Senate, in violation of the Constitution. The Trump administration, on the other hand, says Musk has no actual authority to make government decisions himself. White House press secretary Karoline Leavitt declined Tuesday to say who is leading DOGE.",
      "publishedAt": "2025-02-18T18:20:55Z",
      "title": "White House says Elon Musk is not in charge at DOGE, but is advising the president",
      "url": "https://apnews.com/article/elon-musk-doge-white-house-layoffs-0fcdbb692717c63203ef971cb9807b35",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ff45cf/2147483647/strip/true/crop/5694x3203+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2Fd4%2F32e3741dee29740229f850671ead%2Fe23ab55400414e1d9510677b814553fb"
    },
    {
      "author": "The Associated Press",
      "description": "The White House declared Elon Musk a senior adviser to President Donald Trump. The designation came shortly before a judge declined to block Musk and DOGE from accessing government data systems or laying off workers.",
      "publishedAt": "2025-02-18T07:46:00Z",
      "title": "Live updates: Judge declines to block Musk and DOGE from accessing federal data or laying off workers",
      "url": "https://apnews.com/live/trump-presidency-updates-2-18-2025#00000195-192c-dbf1-abdf-df6ddc030000",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ff45cf/2147483647/strip/true/crop/5694x3203+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2Fd4%2F32e3741dee29740229f850671ead%2Fe23ab55400414e1d9510677b814553fb"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "The Trump administration is giving America’s schools and universities two weeks to eliminate diversity initiatives or risk losing federal money, raising the stakes in the president’s fight against “wokeness.” In a memo to education institutions on Friday, the Education Department gave an ultimatum to stop using “racial preferences” as a factor in admissions, financial aid, hiring or other areas. Schools are being given 14 days to end any practice that treats students or workers differently because of their race, or lose their eligibility for federal money. The sweeping demand could upend education in myriad ways.",
      "publishedAt": "2025-02-18T15:44:05Z",
      "title": "Trump administration gives schools a deadline to end DEI programs",
      "url": "https://apnews.com/article/dei-critical-race-theory-colleges-diversity-db8317ad37931558dd5a396cf5ab3d42",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a07c29/2147483647/strip/true/crop/4311x2425+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2Fa0%2Fab9b819e3cf4099ef897f1a824c4%2F7cc287a3aa3c43d28a43e84342b6c477"
    },
    {
      "author": "MICHAEL BIESECKER, SAM MEDNICK, GARANCE BURKE",
      "description": "U.S. tech giants have quietly empowered Israel to track and kill many more alleged militants more quickly in Gaza and Lebanon through a sharp spike in artificial intelligence and computing services. But as the number of civilians killed has also soared, so have fears that these tools are contributing to the deaths of innocent people. The Israeli military uses AI to sift through vast troves of intelligence, intercepted communications and surveillance to find suspicious speech or behavior and learn its enemies' movements. An Associated Press investigation found after the surprise attack by Hamas militants on Oct. 7, 2023, its use of Microsoft and OpenAI technology skyrocketed.",
      "publishedAt": "2025-02-18T12:06:02Z",
      "title": "How US tech giants' AI is changing the face of warfare in Gaza and Lebanon",
      "url": "https://apnews.com/article/israel-palestinians-ai-technology-737bc17af7b03e98c29cec4e15d0f108",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ee7887/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F4f%2Ffab921614594811eaab071b174e4%2Ffor-promo-image01.jpg"
    },
    {
      "author": "AMANDA SEITZ, ANDREW DEMILLO, KEVIN FREKING",
      "description": "Republicans are weighing billions of dollars in cuts to Medicaid, jeopardizing health care coverage for some of the 80 million U.S. adults and children enrolled in the safety net program. The increasing number of Americans who signed up for taxpayer-funded health care coverage was lauded by Democrats during the Biden administration. But Republicans during the Trump administration are looking to slash federal spending. The $880 billion Medicaid program is financed mostly by federal taxpayers. The GOP-controlled Congress is eyeing work requirements for Medicaid and considering paying a shrunken, fixed rate to states. Over the next decade, Republican lawmakers could try to siphon billions of dollars from the nearly-free health care coverage offered to the poorest Americans.",
      "publishedAt": "2025-02-18T12:03:45Z",
      "title": "Republicans consider cuts and work requirements for Medicaid",
      "url": "https://apnews.com/article/medicaid-cuts-work-requirements-congress-republicans-90ec1119f1d95de067c76f79eec7fa87",
      "urlToImage": "https://dims.apnews.com/dims4/default/17493a9/2147483647/strip/true/crop/5800x3263+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2Fee%2F5f5292f8886d0bd6b2df4df0581a%2F82f84c9cbec2453cbf13c93939a4635b"
    },
    {
      "author": "GRAHAM LEE BREWER, CURT ANDERSON",
      "description": "Native American activist Leonard Peltier has been released from a Florida prison, weeks after then-President Joe Biden angered law enforcement officials by commuting his life sentence to home confinement in the 1975 killings of two FBI agents. A prison official says the 80-year-old Peltier left the Coleman penitentiary in an SUV on Tuesday. He didn’t stop to speak with reporters or the roughly two dozen supporters who gathered outside the gates to celebrate his release. Peltier, a member of the Turtle Mountain Band of Chippewa Indians in North Dakota, is headed back to his reservation, where family and friends will celebrate his release with him on Wednesday and where he'll serve his home confinement.",
      "publishedAt": "2025-02-18T05:01:32Z",
      "title": "Leonard Peltier leaves prison after Biden commuted his sentence in killing of FBI agents",
      "url": "https://apnews.com/article/leonard-peltier-release-fbi-killings-indigenous-rights-8b7da707f4921e974b53ede7d032cf23",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba90134/2147483647/strip/true/crop/5101x2869+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2F3e%2F89b71bed3b6836d2610bc357933a%2F9080be72a8944a39acc82788df8f1eb3"
    },
    {
      "author": "MATTHEW LEE, VLADIMIR ISACHENKOV",
      "description": "Top U.S. and Russian officials had their most extensive high-level engagement since Moscow sent troops into Ukraine almost three years ago. They met for nearly four hours Tuesday in Saudi Arabia as President Donald Trump sought to advance his goal of ending the fighting in Ukraine and mending ties with Moscow. The delegations said the discussions were a good first step. However, the rapprochement may come at a cost to the transatlantic alliance of the U.S. and Europe and significantly damage Washington’s standing with Ukraine as well as with other nations counting on U.S. leadership in NATO and elsewhere for their security and protection.",
      "publishedAt": "2025-02-18T21:05:30Z",
      "title": "A deeper look at the talks between US and Russian officials and what comes next",
      "url": "https://apnews.com/article/us-russia-rubio-lavrov-ukraine-saudi-arabia-94bc4de5ecc86922d6ea4376e38f1cfd",
      "urlToImage": "https://dims.apnews.com/dims4/default/1266af6/2147483647/strip/true/crop/5500x3094+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F7f%2F0c718b498911960324314ad93170%2F72c5f372db4a4f8c94ad30140916b8b6"
    },
    {
      "author": "SAMY MAGDY, NATALIE MELZER",
      "description": "A senior Hamas leader says the militant group will release six living Israeli hostages on Saturday and the bodies of four others on Thursday. The surprise acceleration in releases is apparently in return for Israel allowing long-requested mobile homes and construction equipment into the Gaza Strip. The six are the last living hostages set to be freed under the ceasefire’s first phase. The sides have yet to negotiate the second and more difficult phase, in which Hamas says it will only release dozens more hostages in exchange for a lasting ceasefire and an Israeli withdrawal.",
      "publishedAt": "2025-02-18T13:21:25Z",
      "title": "Hamas says it will free 6 living hostages and hand over 4 bodies, accelerating Gaza releases",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-18-2025-873e5177fea96dbf569ca96980eed29c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d689df3/2147483647/strip/true/crop/5989x3369+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F8a%2F252cfe9371584c74855256f6b708%2F1f0a5a5280404b64aa66dc12af49e58c"
    },
    {
      "author": "JOHN WAWROW, MICHAEL CASEY",
      "description": "Aviation experts say investigators will consider the weather conditions, as well as the possibility of human error or an aircraft malfunction as they try to determine why a Delta Air Lines jet burst into flames and flipped upside down as it tried to land in Toronto. The aircraft came down fast Monday, landing so hard that it lost its right wing, then burst into flames. The aircraft slid to a stop, upside down, leaving a trail of black smoke in its wake and passengers scrambling to escape the wreckage. Miraculously, all 80 people on board the flight from Minneapolis to Toronto’s Pearson International Airport survived and all but two of the 21 people injured have been released from hospitals.",
      "publishedAt": "2025-02-18T16:35:47Z",
      "title": "Questions emerge about what may have caused Delta plane to burst into flames and flip over",
      "url": "https://apnews.com/article/toronto-delta-crash-9c37b48b9719cffdbeba920d46e116b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e969e41/2147483647/strip/true/crop/1006x566+0+53/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2Fb7%2F38b4415db910120f17cff741b1aa%2F02c18ec315984af1830fd21266e97bb1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}