{
  "articles": [
    {
      "author": "Luena Rodriguez-Feo Vileira, Curtis Yee",
      "description": "The U.S. Supreme Court struck down President Donald Trump's sweeping global tariffs, handing him a loss on an issue crucial to his economic agenda.",
      "publishedAt": "2026-02-20T10:09:00Z",
      "title": "Live updates: Supreme Court strikes down Trump’s sweeping tariffs, upending central plank of economic agenda",
      "url": "https://apnews.com/live/supreme-court-tariff-ruling-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b8b8bb/2147483647/strip/true/crop/4290x2859+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F62%2Fa8351feb4d6fab0f8798a52948c1%2Fap25300324932366.jpg"
    },
    {
      "author": "Josh Boak, Steve Peoples",
      "description": "President Donald Trump suffered a rare rebuke when the Supreme Court ruled against his tariff agenda. The decision Friday throws U.S. trade policy back into uncertainty. Trump has built his economic message around tariffs and the deals that he says they force. He argues they bring factories and jobs back. He also warns that losing them harms the economy. Trump called the ruling “ridiculous” and said he is looking for other laws to keep tariffs in place. Democrats say the decision proves Trump broke the law. Polling from AP-NORC finds that most adults oppose tariffs and expect higher prices.",
      "publishedAt": "2026-02-20T16:35:18Z",
      "title": "Trump's made tariffs central to his presidency. What's next?",
      "url": "https://apnews.com/article/trump-tariffs-supreme-court-whats-next-b8b6d5d44ebb3640a88f7202754cb361",
      "urlToImage": "https://dims.apnews.com/dims4/default/7675d7b/2147483647/strip/true/crop/2116x1410+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2F3f%2Faccf46e53eacff661869a399613d%2F9a1d1dafaf4543318073b54dbc1f83ef"
    },
    {
      "author": "Stan Choe",
      "description": "Wall Street kept calm after the Supreme Court struck down President Donald Trump’s sweeping tariffs, and stocks ticked higher. The S&P 500 added 0.7% Friday. It had been flipping between small gains and losses before the court’s ruling, following discouraging reports showing slowing growth for the U.S. economy and faster inflation. The Dow Jones Industrial Average added 0.5%, and the Nasdaq composite rose 0.9%. Trading was tentative across markets after the ruling and after Trump pledged to put tariffs on other countries using other avenues. Treasury yields largely held steady in the bond market.",
      "publishedAt": "2026-02-20T05:21:51Z",
      "title": "Wall Street keeps calm after the Supreme Court strikes down Trump's tariffs",
      "url": "https://apnews.com/article/stocks-markets-iran-trump-ai-oil-9e92f1913a1b97aa49f674fda96f0b65",
      "urlToImage": "https://dims.apnews.com/dims4/default/37c6ccc/2147483647/strip/true/crop/6657x4436+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7f%2F5d%2Fcda6975e676bde761abf2bd6ff20%2Fbd169d8c2749449382f0ddb636851e57"
    },
    {
      "author": "Stephen Whyno",
      "description": "The much-anticipated but never guaranteed U.S.-Canada showdown for gold in men’s hockey at the Olympics is on. Jack Hughes scored two goals, including one with a highlight-reel individual effort, and the Americans rolled into the final by routing Slovakia 6-2 in the semifinals on Friday night. They’ll meet tournament favorite and top-seeded Canada on Sunday for the title, a year since the North American rivals played two memorable games against each other at the 4 Nations Face-Off.",
      "publishedAt": "2026-02-20T21:07:21Z",
      "title": "US sets up Olympic gold-medal game vs. Canada by cruising past Slovakia",
      "url": "https://apnews.com/article/usa-slovakia-score-olympics-2b87368158edbd8c1ab396e35c76c33d",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca5ecb2/2147483647/strip/true/crop/5064x3374+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fc9%2Fd14d9b6c68774a7fc717974bf717%2Fa10a574daf094cc09e01c3c643d9a83b"
    },
    {
      "author": "Andrew Dampf",
      "description": "Canada’s controversial men’s team will have the curling power’s last chance at Olympic gold at the Milan Cortina Games. With Canada already shut out of the mixed team event medals, the country’s top-ranked women were upset by Anna Hasselborg’s Sweden in the semifinals. Sweden will face Switzerland for gold on Sunday. Silvana Tirinzoni’s Switzerland beat the United States and will be aiming for their first women’s gold at the Olympics. Canada will play the U.S. for bronze on Saturday. In the men’s competition Switzerland routed Norway 9-1 for the bronze medal before Canada faces Britain for gold on Saturday.",
      "publishedAt": "2026-02-20T15:58:31Z",
      "title": "Top-ranked Canada heartbroken after upset loss to Sweden in women's curling at the Olympics",
      "url": "https://apnews.com/article/curling-olympics-milan-cortina-181f0e245d12d96575b958d956580824",
      "urlToImage": "https://dims.apnews.com/dims4/default/7bd511b/2147483647/strip/true/crop/5402x3599+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F5f%2F55dcfa809dfe0c3e3f5e528328c2%2Fc4ba5b24b835441d99fb3b71b1882bd7"
    },
    {
      "author": "Brian Melley, Derek Gatopoulos",
      "description": "Norway has set a new record for Winter Olympic gold medals with 17 in Italy this month so far and room for more. Cross-country star Johannes Hoesflot Klaebo won half of his 10 career Olympic golds during these Games. Experts say Norway’s edge comes from deep youth participation and strong local clubs. They also cite stable coaching and a snow-first culture.",
      "publishedAt": "2026-02-18T18:24:34Z",
      "title": "Norway's way of life is paying off at the Milan Cortina Olympics",
      "url": "https://apnews.com/article/klaebo-norway-milan-cortina-olympics-6ca56dbf201cd6bfbd287b01e4f21b66",
      "urlToImage": "https://dims.apnews.com/dims4/default/31dc725/2147483647/strip/true/crop/3079x2052+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F80%2Fd1119453a66cc772468274b35492%2Fc141b3659d6043ce97ee405043a588bf"
    },
    {
      "author": "Associated Press",
      "description": "Do you remember what happened in the Milan Cortina Olympics? Test your knowledge:",
      "publishedAt": "2026-02-20T19:27:16Z",
      "title": "How well do you remember the Milan Cortina Olympics? Test your knowledge",
      "url": "https://apnews.com/article/olympics-milan-quiz-usa-team-2026",
      "urlToImage": "https://dims.apnews.com/dims4/default/4aaa0ae/2147483647/strip/true/crop/4364x2908+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2Faf%2Fc35674ca9238b0a2ef0e035ed798%2F6b095bb086564cfba384679f0691e18e"
    },
    {
      "author": "Farnoush Amiri, Seung Min Kim",
      "description": "President Donald Trump has warned that limited strikes against Iran are possible even as the country’s top diplomat says Tehran expects to have a proposed deal ready in the next few days following nuclear talks with the U.S. Trump's remarks Friday came a few hours after Iranian Foreign Minister Abbas Aragchi said on MSNOW’s “Morning Joe” show that his country was planning to finalize a draft deal in “the next two to three days” to then send to Washington. The tensions between the longtime adversaries have ramped up as the Trump administration pushes for concessions from Iran and has built up the largest U.S. military presence in the Middle East in decades.",
      "publishedAt": "2026-02-20T17:31:09Z",
      "title": "Trump warns he's considering limited strikes on Iran",
      "url": "https://apnews.com/article/iran-trump-nuclear-deal-limited-strikes-07e2cc542d1d13ec6f0b873d69b4eede",
      "urlToImage": "https://dims.apnews.com/dims4/default/1603573/2147483647/strip/true/crop/5713x3807+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faa%2Fc0%2F51e240a38a7d200e3426afbc6604%2F69ac57e2d3934190acbb3578fc185c2e"
    },
    {
      "author": "Josh Funk",
      "description": "All truckers and bus drivers will have to take their commercial driver’s license tests in English as the Trump administration expands its aggressive campaign to improve safety in the industry and get unqualified drivers off the road. Transportation Secretary Sean Duffy announced the latest effort Friday to ensure that drivers understand English well enough to read road signs and communicate with law enforcement officers. Earlier this week, the Transportation Department said 557 driving schools should close because they failed to meet basic safety standards. The department has been aggressively going after states that handed out commercial driver’s licenses to immigrants who shouldn’t have qualified for them ever since a fatal crash in August.",
      "publishedAt": "2026-02-20T19:23:45Z",
      "title": "US commercial driver's license tests must be taken in English",
      "url": "https://apnews.com/article/cdl-commercial-drivers-licenses-duffy-3a87cd0c83e5e563b1445454418e8f59",
      "urlToImage": "https://dims.apnews.com/dims4/default/161f252/2147483647/strip/true/crop/4375x2915+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F23%2F03da5d19284578f3742d9917d250%2F0d00a3ae0af841bab55fe02d0d65e53c"
    },
    {
      "author": "Matt Brown, Lisa Mascaro",
      "description": "House Speaker Mike Johnson’s office has denied a request to have the late Rev. Jesse Jackson lie in honor in the United States Capitol Rotunda due to precedents that such honors are usually only designated for presidents. Johnson's office said it received a request from the family to have Jackson’s remains lie in honor at the Capitol. The Jackson family has announced scheduled dates for memorial services to honor the civil rights icon in Chicago, South Carolina and Washington, DC. No locations or times have yet been outlined for the events in South Carolina and Washington.",
      "publishedAt": "2026-02-20T18:51:20Z",
      "title": "Rev. Jesse Jackson won't lie in honor at US Capitol Rotunda after House Speaker denies request",
      "url": "https://apnews.com/article/jesse-jackson-funeral-plans-capitol-rotunda-2910a8ff9df4531f9fa4ed76404a9887",
      "urlToImage": "https://dims.apnews.com/dims4/default/4513057/2147483647/strip/true/crop/3032x2020+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2F83%2F93c5babbaace0ffcfe2e2d74cc72%2F4b2f1d1a34a64a48b6e7db123671e95b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}