{
  "articles": [
    {
      "author": "NICOLE WINFIELD",
      "description": "BARI, Italy (AP) — A Group of Seven summit is opening Thursday with agreement on a U.S. proposal to back a $50 billion loan to Ukraine using frozen Russian assets as collateral, giving Kyiv a strong show of support even as Europe's political chessboard shifts to the right.",
      "publishedAt": "2024-06-13T04:05:15Z",
      "title": "G7 summit opens with deal to use Russian assets for Ukraine as EU's traditional powers recalibrate",
      "url": "https://apnews.com/a7771f3f8932653b44e21217a121854b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4e85326b90f40fa8a24f7dda6a1c623/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, COLLEEN LONG, ZEKE MILLER and AAMER MADHANI",
      "description": "BRINDISI, Italy (AP) — President Joe Biden and President Volodymyr Zelenskyy will sign a bilateral security agreement between the U.S. and Ukraine on Thursday when they meet on the sidelines of the Group of Seven summit in Italy.",
      "publishedAt": "2024-06-12T13:09:35Z",
      "title": "Biden and Zelenskyy will sign a security deal, as G7 leaders agree to use Russian cash to help Kyiv",
      "url": "https://apnews.com/a43439b8386a20d1af9faec19f94bf55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2345fca5f60e444f9fbee4ef64c71318/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and JACK JEFFERY",
      "description": "BEIRUT (AP) — U.S. Secretary of State Antony Blinken said Wednesday that mediators would keep trying to close an elusive cease-fire deal for Gaza after Hamas proposed changes to a U.S.-backed plan, some of which he said were “workable” and some not.",
      "publishedAt": "2024-06-12T08:41:07Z",
      "title": "Blinken says some of Hamas' proposed changes to a cease-fire plan in Gaza are workable and some not",
      "url": "https://apnews.com/5cf89b426dc799e27f4ca166ea539cd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9280d0d85a244fec9be1a65059b0545b/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "ABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.",
      "publishedAt": "2024-06-12T19:33:09Z",
      "title": "Yemen's Houthi rebels launch boat-borne bomb attack against Greek-owned ship in Red Sea",
      "url": "https://apnews.com/12e8bf184bfa08669bbe17b8e1f99b0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4287702f69f4048b2c908f632d72ce3/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Donald Trump is making a triumphant return to Capitol Hill to meet with House and Senate Republicans, his first since sending the mob to “fight like hell” ahead of the Jan.6, 2021 attack, as GOP lawmakers find themselves newly energized and reinvigorated by his bid to retake the White House.",
      "publishedAt": "2024-06-13T04:07:29Z",
      "title": "Trump is returning to Capitol Hill to meet with Republican lawmakers, a first since Jan. 6 attack",
      "url": "https://apnews.com/ef6a2dc69ee8cd3e11479d095f2bfd1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c020ab05318c41c38e35c56dffb197a6/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "BUENOS AIRES, Argentina (AP) — Argentina’s Senate narrowly approved key state overhaul and tax bills proposed by President Javier Miliei, delivering an initial legislative victory to the libertarian leader in his efforts to enact his promises of radical change.",
      "publishedAt": "2024-06-12T19:27:22Z",
      "title": "In initial win for Argentine President Milei, senators approve his key bills after violent protests",
      "url": "https://apnews.com/1da751ee44f2312c404ad35beb3d23df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bfbe6cc3b4b433382b60a9015881b7f/1920.jpeg"
    },
    {
      "author": "NICHOLAS PAPHITIS",
      "description": "ATHENS, Greece (AP) — Desperate hands clutched at Ali Elwan's arms, legs and neck, and screams misted his ears, as he spat out saltwater and fought for three hours to keep afloat in the night, dozens of miles from land.",
      "publishedAt": "2024-06-13T04:10:45Z",
      "title": "One year later, migrants who cheated death off Greece seek justice and struggle to cope with life",
      "url": "https://apnews.com/a6386a5e7287920766b79e35a981ad8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/caf629c78e204c0e9e97d42eb2d0b1b4/2000.jpeg"
    },
    {
      "author": "CURT ANDERSON",
      "description": "A tropical disturbance has brought a rare flash flood emergency to much of southern Florida as residents prepared to weather more heavy rainfall on Thursday and Friday.Wednesday's downpours and subsequent flooding blocked roads, floated vehicles and delayed the Florida Panthers on their way to Stanley Cup games in Canada against the Edmonton Oilers.",
      "publishedAt": "2024-06-13T04:31:51Z",
      "title": "After rare flash flood emergency, Florida prepares for more heavy rainfall in coming days",
      "url": "https://apnews.com/bb31b2d8ac01ee1300642ce674c6e61c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a4526d74a644c0e9e61d9d44f3e745e/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "NEW YORK (AP) — Eight former employees sued SpaceX and its CEO Elon Musk, alleging that Musk ordered them fired after they challenged what they called rampant sexual harassment and a hostile “Animal House”-style work environment at the company.",
      "publishedAt": "2024-06-13T04:23:44Z",
      "title": "Fired SpaceX employees sue the company for wrongfully terminating critics of CEO Elon Musk",
      "url": "https://apnews.com/87e31157555fba646b6ba8200167b2f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72e2164121574c71b7e8ce0dd5049df7/3000.jpeg"
    },
    {
      "author": "SCHUYLER DIXON",
      "description": "DALLAS (AP) — Jayson Tatum and Jaylen Brown shared a long hug after helping Boston avoid the biggest collapse in an NBA Finals game since at least 1997.",
      "publishedAt": "2024-06-13T03:11:26Z",
      "title": "Tatum, Brown help Celtics hold off huge Dallas rally for 106-99 win, 3-0 lead in NBA Finals",
      "url": "https://apnews.com/9e2aa5254dade3eaf56795b1fc94beb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a776a72a641437392bbb935e26c444c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}