{
  "articles": [
    {
      "author": null,
      "description": "The United States has attacked three sites in Iran, inserting itself into Israel’s war aimed at destroying the country’s nuclear program in a risky gambit to weaken a longtime foe that prompted fears of a wider regional conflict. Addressing the nation from the White House, President Donald Trump asserted that Iran’s key nuclear sites were “completely and fully obliterated.” There was no independent damage assessment. The Atomic Energy Organization of Iran confirmed that attacks took place on its Fordo, Isfahan and Natanz sites, but it insisted that its nuclear program will not be stopped.",
      "publishedAt": "2025-06-22T05:23:42Z",
      "title": "US strikes 3 Iranian nuclear sites, inserting itself into Israel's war with Iran",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-trump-bomber-news-06-22-2025-c2baca52babe915e033ae175ce8b2687",
      "urlToImage": "https://dims.apnews.com/dims4/default/1be7dd2/2147483647/strip/true/crop/4171x2346+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F15%2F314cca71547ad37865b0e9c0659a%2Febf738c18fbd4b3aba7f9757939ebbd5"
    },
    {
      "author": null,
      "description": "The Trump administration is signaling a willingness to renew talks with Iran and avoid a prolonged war. That's in the aftermath of a surprise attack on three of Iran's nuclear sites as U.S. officials assess Tehran’s nuclear ambitions and the threat of retaliation against American interests. President Donald Trump's national security team spoke for him on Sunday. The coordinated messaging suggested a confidence that any fallout from the attack would be manageable and that Iran’s lack of military capabilities would ultimately force it back to the bargaining table.",
      "publishedAt": "2025-06-22T12:50:48Z",
      "title": "US signals a willingness to renew talks with Iran and avoid a prolonged war",
      "url": "https://apnews.com/article/iran-trump-nuclear-sites-strikes-503eb17f991a8509604b4b3aaf93cb5c",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc67e56/2147483647/strip/true/crop/3897x2192+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F5f%2Fbfb10d38c165c64202a8cdc1b0d1%2F5b9f1f128cbd4b4d95058b3847f681f5"
    },
    {
      "author": null,
      "description": "Iran has spent decades building multi-tiered military capabilities at home and across the region that were at least partly aimed at deterring the United States from attacking it. By entering Israel’s war, the U.S. may have removed the last rationale for holding them in reserve. That could mean a wave of attacks on U.S. forces in the Middle East or an attempt to close a key bottleneck for global oil supplies. Iran could also make a dash to develop a nuclear weapon with what remains of its disputed program after American strikes on three key sites.",
      "publishedAt": "2025-06-17T09:22:50Z",
      "title": "Iran has several options how to retaliate against Israel",
      "url": "https://apnews.com/article/israel-iran-attacks-retaliation-targets-mideast-wars-63ccbe43d83cf3cc7faf3fc4b37e6333",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae7bc33/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Faa%2F3d381623537730b94819ef3ffa5e%2F4dc00fa988de4364aea4515fd279fd83"
    },
    {
      "author": null,
      "description": "President Donald Trump has expressed certainty that his big gamble to directly assist the Israelis delivered a knockout blow to Iran’s nuclear program — even as many of his supporters and detractors are warning that U.S. military action could lead the United States into an expansive regional conflict. In Trump's remarks to the nation on Saturday evening from the White House, he said the strikes “obliterated” three critical Iranian enrichment facilities and “the bully of the Middle East must now make peace.” But it’s a risky moment, Trump has belittled his predecessors for tying up America in “stupid wars” and has repeatedly said he's determined to keep the U.S. from getting involved in another messy conflict.",
      "publishedAt": "2025-06-22T01:23:23Z",
      "title": "Trump's big gamble in Iran is a risky moment",
      "url": "https://apnews.com/article/trump-iran-nuclear-fordo-ef530114e5297884b1c3b76a04a3b1de",
      "urlToImage": "https://dims.apnews.com/dims4/default/c38d278/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2Fb2%2Fd74bae1c3a504c9582636954fdff%2F58a7767b75e4487abba1f3b3b52fa333"
    },
    {
      "author": null,
      "description": "Hours after the U.S. struck three Iranian nuclear sites, Iran launched more than 40 missiles toward Israel on Sunday morning, injuring 23 people and destroying apartment buildings and homes in three cities across Israel. In Tel Aviv, a missile damaged several residential buildings, stores and a nursing home. Strikes have displaced more than 9,000 people from their homes since the start of the war with Iran, according to the Israeli military. Missiles have damaged 240 residential buildings, including more than 2,000 individual apartments.",
      "publishedAt": "2025-06-22T14:45:29Z",
      "title": "Iranian missile fired after US strikes causes heavy damage but few injuries in Tel Aviv",
      "url": "https://apnews.com/article/israel-iran-strikes-tel-aviv-nuclear-309953597c37f73441974a3c15001d80",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c8349d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2Ff6%2F73ede26a664e72674364c6ff2985%2F7382dce49eb143a59940ded17e70a3ee"
    },
    {
      "author": null,
      "description": "The U.S. strike on Iran has fueled fears that Israel’s war with Tehran could escalate to a wider regional conflict and other countries began reacting with calls for diplomacy and words of caution. U.S. President Donald Trump had said Thursday that he would decide within “two weeks” whether to get involved. In the end, it took just days to decide, and Washington inserted itself into Israel’s campaign with its early Sunday attack. It remained unclear early how much damage had been inflicted, but Iran had pledged to retaliate if the U.S. joined the Israeli assault.",
      "publishedAt": "2025-06-22T04:57:10Z",
      "title": "Nations react to US strikes on Iran with calls for diplomacy",
      "url": "https://apnews.com/article/us-attack-iran-israel-reaction-united-nations-c10cc46ec236816d958ced2497a11464",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a43216/2147483647/strip/true/crop/9157x5151+0+184/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fcd%2F816b921f38393b9d551936c72204%2F67e04d83d53d4fe8b240fcef37f542a9"
    },
    {
      "author": null,
      "description": "Tens of millions of people across the eastern and central U.S. are bracing for more days of extreme temperatures as an unusual June heat wave continues to grip parts of the country. National Weather Service forecasts for Sunday call for heat indices in the Chicago area of between 100 and 105 degrees. The heat index in Pittsburgh was expected to reach 105 F. The sweltering temperatures are expected to continue through most of the week.",
      "publishedAt": "2025-06-22T13:43:06Z",
      "title": "Eastern half of U.S. braces for more long days of dangerous heat",
      "url": "https://apnews.com/article/heat-wave-eastern-central-united-states-advisories-d7b93e295c42cdb4787cf95c1f09858b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dc0389/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F16%2Fd60b12f8337ed83489f9c31b951a%2F9377e67aec284343b2e02584945b4d75"
    },
    {
      "author": null,
      "description": "State media says a suicide bomber in Syria has detonated himself inside a church filled with people, killing at least 13. The explosion in Dweil’a in the outskirts of Damascus took place Sunday as people were praying inside the Mar Elias Church. Britain-based war monitor the Syrian Observatory for Human Rights says there were 30 people wounded and killed, but the exact numbers are unclear. Some local media reported that children were among the casualties. The attack was the first of its kind in Syria in years, and comes as Damascus under its de facto Islamist rule is trying to win the support of minorities.",
      "publishedAt": "2025-06-22T16:45:02Z",
      "title": "Suicide bomber kills at least 13 in Syrian church near Damascus during Mass",
      "url": "https://apnews.com/article/syria-church-attack-damascus-mass-da2ed505d6625fce1fc9de9e88c200a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/74cdbd7/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2Fe3%2F8384ad3f789a474cdda45d043eb3%2Fd3851078d95042518c04594c307d6dcb"
    },
    {
      "author": null,
      "description": "At summits after Russia launched its full-scale invasion of Ukraine, NATO welcomed President Volodymyr Zelenskyy with open arms. In Washington last year, it vowed to supply long-term security assistance and support Ukraine “on its irreversible path\" to NATO membership. In 2023, a NATO-Ukraine Council was set up, and Kyiv’s membership path fast-tracked. The summit in the Netherlands starting Tuesday will be different. NATO’s most powerful member, the United States, is vetoing Ukraine’s membership. Zelenskyy is invited again, but he won't be seated at NATO's table. Ukraine is only likely to get a brief mention in this year's summit statement.",
      "publishedAt": "2025-06-22T08:13:06Z",
      "title": "Wartime NATO summits have focused on Ukraine. With Trump, this one will be different",
      "url": "https://apnews.com/article/nato-summit-ukraine-trump-war-russia-dcdbd80f8b50df6351b95399fdd10379",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d785de/2147483647/strip/true/crop/7777x4375+0+405/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F1d%2Fd9237000e09f96e5a2f700797daa%2F1c47f10705c94dbebf2b87d41f3e0a41"
    },
    {
      "author": null,
      "description": "The Houston Rockets are acquiring 15-time All-Star and four-time Olympic gold medalist Kevin Durant from the Phoenix Suns in a blockbuster deal struck Sunday, according to a person with knowledge of the agreement. The Rockets are giving up Dillon Brooks, Jalen Green and six future picks, according to the person who spoke to The Associated Press on condition of anonymity because the deal was still pending NBA approval. It ends weeks of speculation about where Durant would end up. Many teams were involved at various times, including Miami and Minnesota, but in the end Phoenix took the Rockets’ offer.",
      "publishedAt": "2025-06-22T17:14:40Z",
      "title": "Kevin Durant is going from the Suns to the Rockets in a blockbuster trade, AP source says",
      "url": "https://apnews.com/article/kevin-durant-suns-rockets-trade-0f70dd6296c4093cf6b4f27800ba99cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/dda71b0/2147483647/strip/true/crop/5771x3246+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fc8%2Ffc131e015327e3941e795138fcf4%2F0358cd7b582e4d8283f52a9097c2e954"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}