{
  "articles": [
    {
      "author": "JENNIFER PELTZ and DEREK GATOPOULOS",
      "description": "UNITED NATIONS (AP) — Ukrainian President Volodymyr Zelenskyy said Tuesday that Russia is “weaponizing” everything from food and energy to abducted children in its war against Ukraine — and he warned world leaders that the same could happen to them.",
      "publishedAt": "2023-09-19T00:45:39Z",
      "title": "Russia has turned food, energy and even children into weapons against Ukraine, Zelenskyy says at UN",
      "url": "https://apnews.com/1e6b464628a7a391289b2ad386bd2d8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6bda55744544e2297e2408600392045/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "KANSAS CITY NATIONAL SECURITY CAMPUS, Mo. (AP) — In an ultra-sterile room at a secure factory in Kansas City, U.S. government technicians refurbish the nation’s nuclear warheads. The job is exacting: Each warhead has thousands of springs, gears and copper contacts that must work in conjunction to set off a nuclear explosion.",
      "publishedAt": "2023-09-20T04:02:40Z",
      "title": "Inside the delicate art of maintaining America's aging nuclear weapons",
      "url": "https://apnews.com/6b86198def4516cebe496c9f5fbfbb75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78118d2bdef540b8a2e44f3e36bc4867/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Facing fresh challenges to his leadership, Speaker Kevin McCarthy is trying to accomplish what at times seems impossible — working furiously to convince House Republicans to come together and pass a conservative bill to keep the federal government open.",
      "publishedAt": "2023-09-19T19:05:18Z",
      "title": "Speaker McCarthy faces an almost impossible task trying to unite House GOP and fund the government",
      "url": "https://apnews.com/543f93b6ad6a3f23ee3f5275e19293f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7784f3cfcd142df9224def4dc230745/1920.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and ROB GILLIES",
      "description": "NEW DELHI (AP) — India expelled one of Canada’s top diplomats Tuesday, ramping up a confrontation between the two countries over Canadian accusations that India may have been involved in the killing of a Sikh separatist leader in suburban Vancouver.",
      "publishedAt": "2023-09-19T03:23:54Z",
      "title": "India expels Canadian diplomat, escalating tensions after Trudeau accuses India in Sikh's killing",
      "url": "https://apnews.com/3c5572d9027769ea6adbd047ec6f462a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f0b31165a3c40c39dbe6de8958fb2ae/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Saudi Arabia on Wednesday praised the “positive results” of negotiations with Yemen's Houthi rebels after they visited the kingdom for peace talks, though Riyadh released few details on their discussions to end the war tearing at the Arab world's poorest nation.",
      "publishedAt": "2023-09-20T02:27:56Z",
      "title": "Saudi Arabia praises 'positive results' after Yemen's Houthi rebels visit kingdom for peace talks",
      "url": "https://apnews.com/d2a9ad9efe1ab0b4f5d51597098f46a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a363a1631e7a4e1b89d4a7440d9bac3f/3000.jpeg"
    },
    {
      "author": "KEN SWEET",
      "description": "NEW YORK (AP) — A growing number of Americans are finding it difficult to afford insurance on their homes, a problem only expected to worsen because insurers and lawmakers have underestimated the impact of climate change, a new report says.",
      "publishedAt": "2023-09-20T04:01:40Z",
      "title": "Homeowners face rising insurance rates as climate change makes wildfires, storms more common",
      "url": "https://apnews.com/9c7129881f12ec478386e4b47c1acbbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea95f295ffa847709a04ee84cb13510b/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "ALBANY, N.Y. (AP) — As more than 100,000 migrants arrived in New York City over the past year after crossing the border from Mexico, Mayor Eric Adams and Gov.",
      "publishedAt": "2023-09-20T04:07:20Z",
      "title": "Biden's Democratic allies intensify pressure for asylum-seekers to get work permits",
      "url": "https://apnews.com/c173aa553cd4b14ec05ddb2cb56e9e5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bdb5b5d48674af99bcbf30bde912301/3000.jpeg"
    },
    {
      "author": "MARÍA TERESA HERNÁNDEZ",
      "description": "SANTIAGO, Chile (AP) — Soon after she learned what happened, Helmut Kramer’s mother grabbed a pair of scissors and cut the priest out of photographs from her son’s baptism.“She kept the photos after that,” said Kramer, who was sexually abused at age 12 in a Jesuit school in Antofagasta, a city in northern Chile.",
      "publishedAt": "2023-09-20T04:04:38Z",
      "title": "In Chile, justice eludes victims of Catholic clergy sex abuse years after the crisis exploded",
      "url": "https://apnews.com/c11f8200a6b64c1b88e1b492cca6d196",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64230c83caf9454c938fc0566758a0f7/3000.jpeg"
    },
    {
      "author": "FERNANDA PESCE",
      "description": "HUEHUETOCA, Mexico (AP) — A Mexican railway operator announced Tuesday it is temporarily suspending train runs in the northern part of the country because so many migrants are climbing aboard freight cars and getting hurt in the process.",
      "publishedAt": "2023-09-19T22:03:53Z",
      "title": "Mexican railway operator halts trains because so many migrants are climbing aboard and getting hurt",
      "url": "https://apnews.com/8e55d3629a9d152516a0bd97f13e328d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/698de064d4b4462aae07e9caa8cfaee7/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The classified documents indictment of Donald Trump would seem, on paper at least, to be the most straightforward of the four criminal cases the former president is facing.",
      "publishedAt": "2023-09-19T04:18:16Z",
      "title": "Florida jury pool could give Trump an advantage in classified documents case",
      "url": "https://apnews.com/68155de474a855cd37e2a5c27ce55cbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1dbd6a4a77c548d0956c49a28f5bb422/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}