{
  "articles": [
    {
      "author": null,
      "description": "Hospitals in Gaza have reported the killing of more than a dozen people, half of them food-seekers, by Israeli fire on Saturday as Palestinians endured severe risks in their search for food amid airdrops and restrictions on overland aid delivery. Eyewitnesses described chaos and gunfire at aid distribution sites, which the Israel-backed private American contractor denied. Airstrikes also killed families in tents and homes, health and hospital officials said. Meanwhile, hostage families protested in Tel Aviv, urging a deal to end the war. As border crossings remain blocked, more countries joined airdrop efforts, which UN officials say are costly and insufficient to address the crisis.",
      "publishedAt": "2025-08-02T10:48:36Z",
      "title": "Israeli fire kills at least 18 in Gaza, US envoy visits hostage family protest",
      "url": "https://apnews.com/article/israel-gaza-war-witkoff-hostage-tel-aviv-b90fe087e8254179667e0cd6094cd438",
      "urlToImage": "https://dims.apnews.com/dims4/default/23c8e7e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F74%2Fe99ab08f2a813b602c0355cf84bf%2F012f2db78e764437bcef6f719ea010d9"
    },
    {
      "author": null,
      "description": "President Donald Trump's economic policies are facing scrutiny as weak indicators emerge. Job gains are dwindling, inflation is rising and growth has slowed compared to last year. More than six months into his term, Trump's tariffs and tax changes have reshaped the economy. On Friday, a bleak jobs report showed a decline in manufacturing jobs, and Trump fired the head of the agency responsible for the data. Critics warn that Trump's aggressive use of tariffs and tax changes could backfire. The White House, however, remains optimistic, claiming the best is yet to come.",
      "publishedAt": "2025-08-02T04:02:50Z",
      "title": "It's Trump's economy now. The latest financial numbers offer some warning signs",
      "url": "https://apnews.com/article/trump-economy-warning-signs-financial-numbers-6f9754dbb6b21c9ef5c557b1ebfe6ce9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5372c1d/2147483647/strip/true/crop/5145x2894+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F0a%2F1ad077234b791658b266afa52512%2Fc305bde79c8b4f1a8d20725ff6451870"
    },
    {
      "author": null,
      "description": "President Donald Trump’s tariff onslaught this week left a lot of losers – from small, poor countries like Laos and Algeria to wealthy U.S. trading partners like Canada and Switzerland. They’re now facing hefty taxes – tariffs – on the products they export to the United States. What’s unclear is whether there will ultimately be any winners – even in the United States, the intended beneficiary of Trump’s protectionist policies. Trump’s trade war has pushed the average U.S. tariff from 2.5% at the start of 2025 to 18.3% now, the highest since 1934, according to the Budget Lab at Yale University. One expert at the New York Law School said that “in many respects, everybody’s a loser here.’’",
      "publishedAt": "2025-08-02T14:50:06Z",
      "title": "From Laos to Brazil, Trump's tariffs leave a lot of losers. But even the winners will pay a price",
      "url": "https://apnews.com/article/trump-trade-tariffs-deals-winners-losers-25e65f0c984b0cb7d795265aa2976265",
      "urlToImage": "https://dims.apnews.com/dims4/default/53fcbcc/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F9a%2F499aed5b182ae599e927e771ebc4%2F5cb4fac1c025425f9c60457faea77535"
    },
    {
      "author": null,
      "description": "Some Republican-controlled states are moving to redraw legislative maps to pad their party's narrow House majority in Washington. They're acting at President Donald Trump's urging, and that's forced Democrats to rethink their embrace of a nonpartisan approach to line-drawing. In many Democratic-controlled states, independent commissions rather than the state legislature handle redistricting. That means Democrats have few options to match Republicans, who are redrawing the congressional map in Texas to carve out as many as five new winnable seats for the GOP. That could be enough to prevent Democrats from winning back the majority in the midterm elections near year.",
      "publishedAt": "2025-08-02T12:05:34Z",
      "title": "Democrats have limited options to retaliate against Texas redistricting",
      "url": "https://apnews.com/article/redistricting-trump-republicans-democrats-texas-california-e53fd3df17fb9677c29cbd155b91c353",
      "urlToImage": "https://dims.apnews.com/dims4/default/3fb4ac2/2147483647/strip/true/crop/7306x4110+0+381/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2Fa1%2F749db80f3005c26784b40d8ca7b6%2Fd6082258caab4751b5faf1ace3bff4f8"
    },
    {
      "author": null,
      "description": "Under Republican Gov. Ron DeSantis, Florida has executed more people so far this year than any other state, setting a new state record. Across the country, more people have been executed in the first seven months of this year than in all of 2024. Florida's increase is putting the country on track to surpass 2015’s total of 28 executions. Little is publicly known about how the governor decides whose death warrant to sign and when. DeSantis has said he takes capital cases “very seriously” and that for some crimes, “the only appropriate punishment is the death penalty.”",
      "publishedAt": "2025-08-02T04:03:44Z",
      "title": "DeSantis set a Florida record for executions, driving a national increase",
      "url": "https://apnews.com/article/death-penalty-florida-execution-desantis-trump-5a2271ea97d40dfbc175c9ee829121f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/c2d09b1/2147483647/strip/true/crop/3753x2111+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F07%2F783385a77176128e8551384c4954%2F169528d4d1864df3b4e20cb874ae56ec"
    },
    {
      "author": null,
      "description": "Hundreds of thousands of young Catholics are pouring into a vast field on Rome’s outskirts for the highlight of the Vatican’s 2025 Holy Year. They're camping out for an evening vigil, outdoor slumber party and morning Mass celebrated by Pope Leo XIV that marks his first big encounter with the next generation of Catholics. Leo was flying in by helicopter Saturday evening to preside over the vigil and a question-and-answer session. He was then returning to the Vatican for the night and coming back for a popemobile romp and Mass on Sunday morning.",
      "publishedAt": "2025-08-02T12:42:25Z",
      "title": "Young Catholics invade Rome for Holy Year festival with Pope Leo XIV",
      "url": "https://apnews.com/article/vatican-youth-leo-pope-pilgrims-4d1f8c3c6743e9ad1e9eab6699f7d95e",
      "urlToImage": "https://dims.apnews.com/dims4/default/ce2481d/2147483647/strip/true/crop/8317x4678+0+433/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F68%2Fde190e6eaf36040f1e0514a3347c%2F88be0bd93e614174abc12892c7c3c500"
    },
    {
      "author": null,
      "description": "Smoke from Canadian wildfires hovered over several Midwestern states Saturday, bringing warnings of unhealthy air. Air quality alerts were in effect in Iowa, Minnesota, Wisconsin and Michigan, as well as eastern Nebraska and parts of Indiana and Illinois. Forecasters said the smoky skies would remain for much of the day. People with lung disease, heart disease, children, older adults and pregnant women are most susceptible to the poor breathing conditions and are advised to stay indoors.",
      "publishedAt": "2025-08-02T17:44:27Z",
      "title": "Smoke from Canada brings unhealthy air to large swaths of Midwest",
      "url": "https://apnews.com/article/canada-wildfires-smoke-minnesota-midwest-ec9aff3eb3f76cf115c3737d8b1d515b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1204218/2147483647/strip/true/crop/7371x4146+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F02%2F240ec40fac826e10886deffe7bf3%2Fef9eabeb5b4b492288c88562aced9056"
    },
    {
      "author": null,
      "description": "America’s rural high school students are less likely to go to college than their urban and suburban peers. Students in the most sparsely populated regions often face obstacles to attending college, including having to travel far to get to campus, a lack of public transportation, and inconsistent broadband access that limits access to online courses and financial aid. Family dynamics also often factor in, including a lack of exposure to college because parents didn’t attend and an underlying doubt about the value of a college degree and curriculum. Some colleges have stepped up efforts to recruit rural students.",
      "publishedAt": "2025-08-02T04:03:00Z",
      "title": "Rural schools are introducing more college-level classes",
      "url": "https://apnews.com/article/rural-students-college-enrollment-employment-692de5e6f70be4c6f299e642527f8fca",
      "urlToImage": "https://dims.apnews.com/dims4/default/b8daed2/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F4e%2Feb2517107976a889d17408c3c4ed%2F8d96f41dce4c46d88a6038dc215d5bf6"
    },
    {
      "author": null,
      "description": "Millions of student borrowers could begin having their wages garnished as soon as this summer. That's according to estimates from credit bureau TransUnion. The company predicts that by August roughly 3 million borrowers could move into default, meaning they’re 270 days past due on payments. At that point, loan holders are at risk of having 15% of their pay docked by the government, with the money going toward the outstanding debt. There has been no clear indication of when wage garnishment will start.",
      "publishedAt": "2025-08-02T15:26:52Z",
      "title": "Millions of student borrowers face wage garnishment",
      "url": "https://apnews.com/article/wage-garnishment-student-loans-borrowers-487645f5cd25ff4631b0ea1aa2ae6561",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb503cc/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F72%2Ff460152358178a15541022108aba%2F3941881f51724183821bd433ad8f7b4a"
    },
    {
      "author": null,
      "description": "A 110-foot Ferris wheel. Race cars painted in MLB team colors. Food trucks. Live music. Pitching tunnels and batting cages. A chance for photos with the Commissioner’s Trophy. And Clydesdales. Of course, there’s merchandise available for any fans who forgot to grab their gear supporting the Atlanta Braves or Cincinnati Reds or simply commemorating a spectacle unlike any other. About four years in the planning, it’s finally time for the MLB Speedway Classic to play ball Saturday night on the diamond constructed on the infield at Bristol Motor Speedway at the place called the “Last Great Colisseum!”",
      "publishedAt": "2025-08-02T10:00:08Z",
      "title": "MLB Speedway Classic debuts at Bristol Motor Speedway",
      "url": "https://apnews.com/article/mlb-speedway-classic-reds-braves-bristol-b25ba29f19121d9859ba485df4038510",
      "urlToImage": "https://dims.apnews.com/dims4/default/0735f10/2147483647/strip/true/crop/5227x2940+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F25%2F124bf62f27fa183b935997e0b851%2Fb33380dacc7f449eaf6fcd651374cf74"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}