{
  "articles": [
    {
      "author": null,
      "description": "U.S. President Donald Trump’s special envoy to Ukraine, retired Lt. Gen. Keith Kellogg, arrived in Kyiv on Monday. Discussions will focus on defense, security, and U.S.-Ukraine cooperation. Trump has expressed frustration with Russian President Vladimir Putin over continued attacks on Ukraine, calling Putin’s actions “crazy.” The U.S. is sending Patriot missiles to help Ukraine counter Russia’s intensified aerial strikes. June saw record civilian casualties, with Russia launching significantly more attacks than last year. Meanwhile, NATO’s Secretary-General is in Washington for talks, and Sen. Lindsey Graham claims the conflict is at a turning point, with increased U.S. support for Ukraine expected soon.",
      "publishedAt": "2025-07-14T07:46:13Z",
      "title": "Trump envoy Kellogg in Kyiv as US pledges Patriot missiles to Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-patriot-missiles-kellogg-ca8cda9b417737188c471390bc312a5d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d2fb7a1/2147483647/strip/true/crop/2000x1125+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2Fdf%2F694c113fd6314a5ad38a86f82f33%2F49b58a5408744bb096a24f5bb7eec466"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump repeatedly said during his campaign he would be able to end the war between Russia and Ukraine “in 24 hours” upon taking office. But since his Jan. 20 inauguration, the road to a peace deal has been fraught with changing dynamics between the U.S. leader, Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin. Trump’s rhetoric toward both Zelenskyy and Putin has evolved during the first months of his second term in the White House. The Republican leader has become increasingly exasperated with Putin in recent days, while he appears to have softened toward Zelenskyy after a February blowout in the Oval Office.",
      "publishedAt": "2025-07-14T14:37:45Z",
      "title": "In his words: Trump's rhetoric about Zelenskyy and Putin has evolved",
      "url": "https://apnews.com/article/russia-ukraine-trump-zelenskyy-putin-war-088f37d5f4f301cb0a0472c84ffb7513",
      "urlToImage": "https://dims.apnews.com/dims4/default/f87b41e/2147483647/strip/true/crop/3048x1715+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2Fd0%2Fac47f54fdcc313b5969d253f9b49%2F2fe5198f510440518ac6755159cb28e7"
    },
    {
      "author": null,
      "description": "Authorities are reporting multiple deaths in a fire at an assisted living facility in Fall River, Massachusetts, where people were hanging out of windows screaming for help. The fire broke out Sunday night at the Gabriel House facility, which houses about 70 residents. Firefighters arrived to find heavy smoke, flames, and occupants trapped inside. Many residents were rescued, but several were pronounced dead at the scene. Others were taken to hospitals with varying injuries. Five firefighters sustained non-life-threatening injuries. Officials say the cause of the fire is under investigation. The local fire chief called the incident a devastating tragedy for the community and affected families.",
      "publishedAt": "2025-07-14T10:31:14Z",
      "title": "Multiple deaths in fire at Massachusetts assisted living facility",
      "url": "https://apnews.com/article/fatal-fire-assisted-living-massachusetts-deef7610ac6b12cccd4fcc5b8088669f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Former New York Governor Andrew Cuomo has announced he will run for New York City mayor as an independent candidate. Cuomo, who lost to progressive Democrat Zohran Mamdani in the June primary, says he aims to challenge Mamdani’s policies, calling them “slick slogans with no real solutions.” The general election is set for November. The current Mayor Eric Adams is also running as an independent, while Curtis Sliwa is set to represent the Republican Party. Critics of Mamdani’s progressive agenda worry that multiple candidates could split the anti-Mamdani vote, boosting his chances. This marks Cuomo’s latest comeback attempt after resigning as governor amid scandal.",
      "publishedAt": "2025-07-14T19:14:02Z",
      "title": "Cuomo to run as an independent in NYC mayor’s race against Mamdani",
      "url": "https://apnews.com/article/andrew-cuomo-zohran-mamdani-new-york-mayor-b51061b3b88ff52b44ffebbbf952554d",
      "urlToImage": "https://dims.apnews.com/dims4/default/48c41d3/2147483647/strip/true/crop/4800x2700+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F1d%2F344d76986185dc00e78f87ea0091%2Fa3e465839a534ee1a7f2376b1207bcaa"
    },
    {
      "author": null,
      "description": "A broken promise to release more information about the Jeffrey Epstein case has sparked outrage among some of President Donald Trump’s loyal supporters. Right-wing influencers were once bolstered by Trump’s own claims on this case, but are now feeling their demands are being squelched by his administration. Figures like commentator Tucker Carlson, activist Laura Loomer, and Trump’s former adviser Steve Bannon claim the government’s handling of the case shows a lack of transparency. Anger over the case threatens to divide the MAGA faithful.",
      "publishedAt": "2025-07-14T19:28:52Z",
      "title": "MAGA faithful are angry about the Epstein case. Here's what to know",
      "url": "https://apnews.com/article/epstein-trump-bondi-904822e788fa02fd6bd5c8181d0c9c08",
      "urlToImage": "https://dims.apnews.com/dims4/default/d142b6d/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Ff4%2Ff39325e1523f193116962481afc2%2F8c7d29d49e864bf282d06ee283727f61"
    },
    {
      "author": null,
      "description": "A wildfire along the Grand Canyon's North Rim grew rapidly over the weekend and destroyed a historic lodge and visitors center. Firefighters are working to slow down the fire that began on July 4 after a lightning trike. The fire is in a less popular area of the Grand Canyon that draws only about 10% of the park's millions of visitors. Evacuations were ordered over concerns that include chlorine gas exposure after a treatment plant burned. Arizona Gov. Katie Hobbs has called for a federal investigation into the fire's management. Another wildfire in Colorado has closed Black Canyon of the Gunnison National Park, prompting evacuations and a disaster declaration by the state’s governor.",
      "publishedAt": "2025-07-14T14:04:19Z",
      "title": "Grand Canyon fire along North Rim destroy historic lodge",
      "url": "https://apnews.com/article/grand-canyon-fire-lodge-north-rim-e2af8a6a42c40c74a8ba69517ba1e592",
      "urlToImage": "https://dims.apnews.com/dims4/default/a283c90/2147483647/strip/true/crop/2048x1152+0+192/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F05%2F52a47a605947864c09d3e5d2c76f%2Fd523857bed884d6fa78a071d5046ff3d"
    },
    {
      "author": null,
      "description": "The man accused of killing two women at a Kentucky church and wounding a state trooper in separate shootings had been expected in court for a domestic violence hearing the next day. Guy House was fatally shot by police on Sunday at Richmond Road Baptist Church. The Lexington Herald-Leader reported that House went to the church looking for the mother of his children, but his domestic violence hearing on Monday did not involve her. Authorities say he also wounded two men in the rampage, which began when House shot the trooper during a traffic stop near Lexington’s airport. The shootings remain under investigation.",
      "publishedAt": "2025-07-14T16:43:40Z",
      "title": "Kentucky church shooting suspect had an upcoming domestic violence hearing",
      "url": "https://apnews.com/article/kentucky-church-shooting-suspect-d593436b654700c5b90013baf569fba6",
      "urlToImage": "https://dims.apnews.com/dims4/default/85d2865/2147483647/strip/true/crop/4502x2532+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F64%2Fef21396ef37274bf61f79f49c09d%2F4a499b9402c847c9a8bef284657b40ad"
    },
    {
      "author": null,
      "description": "The Supreme Court is allowing President Donald Trump to put his plan to dismantle the Education Department back on track and go through with laying off nearly 1,400 employees. With the three liberal justices in dissent, the court on Monday paused an order from U.S. District Judge Myong Joun in Boston, who issued a preliminary injunction reversing the layoffs and calling into question the broader plan. The layoffs “will likely cripple the department,” Joun wrote. A federal appeals court refused to put the order on hold while the administration appealed.",
      "publishedAt": "2025-07-14T19:26:41Z",
      "title": "Supreme Court allows Education Department layoffs",
      "url": "https://apnews.com/article/supreme-court-trump-education-layoffs-9370415531185092341b16a6bfea9344",
      "urlToImage": "https://dims.apnews.com/dims4/default/8868f37/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F07%2Fa48a09ac70eef1694b1a491f3df0%2F84c6d33ec30649c9b58b1f99950582a1"
    },
    {
      "author": null,
      "description": "Clashes between Druze militias and Sunni Bedouin clans in Syria's Sweida province have killed more than 30 people and injured nearly 100. The interior ministry said Monday that military forces will deploy to restore order. The Syrian Observatory for Human Rights reported 37 deaths and said the violence began after kidnappings and robberies escalated tensions between Druze and Sunni Bedouin groups. The ministry called the situation a dangerous escalation fueled by the absence of effective governance. Sweida is home to Syria’s Druze minority and has seen unrest since the fall of former leader Bashar Assad, with Druze factions divided over integrating with the new government.",
      "publishedAt": "2025-07-14T05:57:27Z",
      "title": "More than 30 killed in Syria clashes",
      "url": "https://apnews.com/article/syria-clashes-druze-bedouins-sweida-be7e45ae4adc631b758d2bebfb06e0a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/078129e/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F11%2F5456f56b106939a8bf14f9a8903d%2Ffdd71330901640218e8869c200b46795"
    },
    {
      "author": null,
      "description": "Fast fashion relies heavily on synthetic fibers that are made from oil and gas, fossil fuels that cause climate change. Once discarded, many of those materials end up in landfills. Some designers are working to cut those products out completely and instead use biomaterials. They are experimenting with tapioca, gelatin, agar agar, mushrooms, and other kitchen-shelf ingredients. Big names like Stella McCartney and Hermes have experimented with biomaterials like mushroom leather, while other early adopters are making fabrics out of corn and soy. Some experts are skeptical these textiles can be scaled up, but designers experimenting with biomaterials believe their experimentation could help push the industry away from the heavy pollution and waste that it currently produces.",
      "publishedAt": "2025-07-14T12:11:46Z",
      "title": "Fashion designers experiment with natural supplies called biomaterials",
      "url": "https://apnews.com/article/fashion-clothes-retail-biomaterial-seaweed-mushroom-leather-a175c38aa146764e788c0b65f2f80661",
      "urlToImage": "https://dims.apnews.com/dims4/default/b31791e/2147483647/strip/true/crop/3814x2145+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2Fc1%2F822411fa0c7347f900d3a096bc08%2F9673be32239a435e8b07026d416e3e03"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}