{
  "articles": [
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden will convene the top four congressional leaders at the White House on Tuesday to press lawmakers on passing an emergency aid package for Ukraine and Israel, as well as averting a looming government shutdown next month, according to a White House official.",
      "publishedAt": "2024-02-25T23:00:53Z",
      "title": "Biden is summoning congressional leaders to the White House to talk Ukraine and government funding",
      "url": "https://apnews.com/a4b886c469b3d5bff8ae7a18e5896eb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44b912d6311f431f8cb73a91a55d767f/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said Sunday that 31,000 Ukrainian soldiers have been killed in action in the two years since Russia launched its full-scale invasion.",
      "publishedAt": "2024-02-25T15:56:40Z",
      "title": "31,000 Ukrainian troops killed since the start of Russia's full-scale invasion, Zelenskyy says",
      "url": "https://apnews.com/675f53437aaf56a4d990736e85af57c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34b901b3cb534ce088a3ed2344208d74/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and ABBY SEWELL",
      "description": "TEL AVIV, ISRAEL (AP) — Israel’s defense minister vowed Sunday to step up attacks on Lebanon’s Hezbollah militant group even if a cease-fire is reached with Hamas in the Gaza Strip.Hezbollah, which has been exchanging fire with Israel throughout the war in Gaza, has said it will halt its nearly daily attacks on Israel if a cease-fire is reached in Gaza.",
      "publishedAt": "2024-02-25T22:14:25Z",
      "title": "Israel vows to target Lebanon's Hezbollah even if cease-fire reached with Hamas in Gaza",
      "url": "https://apnews.com/54b7e874169478b6f0a2b821ec07489a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e05b3399707400faa112c521bfed118/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — An Israeli military offensive in Gaza's southernmost city of Rafah could be “delayed somewhat” if a deal is reached for a weekslong cease-fire between Israel and Hamas, Prime Minister Benjamin Netanyahu said Sunday, and claimed that total victory in the territory would come within weeks once the offensive begins.",
      "publishedAt": "2024-02-25T08:31:20Z",
      "title": "Netanyahu says a cease-fire deal would only delay 'somewhat' an Israeli military offensive in Rafah",
      "url": "https://apnews.com/f3e4ea708548689cf8d9d404c3ee94ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96efaaa434c14a8280ed08ea7a1817c7/1920.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and MEG KINNARD",
      "description": "TROY, Mich. (AP) — Republican presidential candidate Nikki Haley says it's not “the end of our story” despite Donald Trump's easy primary victory in South Carolina, her home state where the onetime governor had long suggested her competitiveness with the former president would show.",
      "publishedAt": "2024-02-25T16:33:53Z",
      "title": "Off to Michigan, Haley is staying in the race despite Trump's easy primary win in South Carolina",
      "url": "https://apnews.com/ee571b2024cb6bba665507dd63c6a730",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/baf68c8e169348dfb079f22839b79491/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK and TRISTAN LAVALETTE",
      "description": "MELBOURNE, Australia (AP) — Tuvalu’s former Attorney General Feleti Teo was named prime minister of the tiny South Pacific nation Monday after elections a month ago ousted the last government leader.",
      "publishedAt": "2024-02-26T01:31:32Z",
      "title": "Feleti Teo is named Tuvalu's new prime minister after elections that ousted Taiwan supporter",
      "url": "https://apnews.com/bae1874651a7a0fc86594f04b9ebe7dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bed1c7e5441543ed8c5e4ba1db2a67a9/2953.jpeg"
    },
    {
      "author": "VICTORIA MILKO and DAVID GOLDMAN",
      "description": "SINGAPORE (AP) — A crack of thunder booms as dozens of screens in a locked office flash between live video of cars splashing through wet roads, drains sapping the streets dry, and reservoirs collecting the precious rainwater across the tropical island of Singapore.",
      "publishedAt": "2024-02-25T13:01:07Z",
      "title": "In water-stressed Singapore, a search for new solutions to keep the taps flowing",
      "url": "https://apnews.com/2f4a23baccdc22f46128728171ec5cff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75d5df71e3254430802a7bc0179173fc/3000.jpeg"
    },
    {
      "author": "FELIPE CAMPOS MELLO and MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — Supporters of former President Jair Bolsonaro staged a huge rally jamming a main avenue in Brazil's biggest city Sunday to defend him against legal challenges that could put him in jail.",
      "publishedAt": "2024-02-25T22:56:54Z",
      "title": "Supporters of Brazil's Bolsonaro stage huge demonstration to defend him amid investigations",
      "url": "https://apnews.com/88ba5fdc25bbedc192665f7e95e3cc19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2e45a53f752478a996122e7904b9e35/3000.jpeg"
    },
    {
      "author": "MARGERY A. BECK",
      "description": "OMAHA, Neb. (AP) — A warm front swept springlike weather across a large swath of the country Sunday in what is usually one of the coldest months of the year, sending people out of their homes to enjoy the rare winter respite but also bringing increased wildfire danger.",
      "publishedAt": "2024-02-25T22:31:47Z",
      "title": "Warm weather brings a taste of spring to central and western United States",
      "url": "https://apnews.com/3427ffe07907ea245279e3e21ffdebac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58690d2cdd8a4e409deaa12fe4885c4c/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "ABU DHABI, United Arab Emirates (AP) — The World Trade Organization will open its biennial meeting Monday in the United Arab Emirates as the bloc faces pressure from the United States and other nations ahead of a year of consequential elections around the globe.",
      "publishedAt": "2024-02-26T04:40:27Z",
      "title": "World Trade Organization to open biennial meeting in the United Arab Emirates as challenges loom",
      "url": "https://apnews.com/376ad89f7202e06e90a93390205a01f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d0d42afce0e4cb1b0ea7f1b7730c93e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}