{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Russian mercenary chief Yevgeny Prigozhin and some of his top lieutenants were presumed dead in a plane crash — widely seen Thursday as an assassination to avenge a mutiny that challenged President Vladimir Putin’s authority.",
      "publishedAt": "2023-08-24T07:33:57Z",
      "title": "Mercenary chief Prigozhin is presumed to have died in a plane crash seen as the Kremlin's revenge",
      "url": "https://apnews.com/382515214f691e47daa2e3635d64e612",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0302eeca8cf4d9987b4d764bdbe51ce/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER, KATE BRUMBACK and JILL COLVIN",
      "description": "ATLANTA (AP) — Donald Trump is set to surrender Thursday to authorities in Georgia on charges that he schemed to overturn the 2020 election in that state, a booking process expected to yield a historic first: a mug shot of a former American president.",
      "publishedAt": "2023-08-24T04:42:08Z",
      "title": "Trump is set to surrender at a Georgia jail on charges he sought to overturn his 2020 election loss",
      "url": "https://apnews.com/7f4e9860859fbb71221b6a5163aaa42f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b96471fed774be1917aa22bff9bf30e/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and NICHOLAS RICCARDI",
      "description": "Former President Donald Trump and Florida Gov. Ron DeSantis have dominated the Republican presidential nomination fight for much of the year. Neither dominated the debate stage Wednesday night.Trump, of course, decided to skip the GOP’s opening presidential primary debate given his overwhelming lead in the polls.",
      "publishedAt": "2023-08-24T02:08:08Z",
      "title": "Vivek Ramaswamy takes center stage, plus other key moments from first Republican debate",
      "url": "https://apnews.com/f38e0aa189ad85f347f97b1b6bea4c53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c77420d660f04081844efced968fa422/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "OKUMA, Japan (AP) — The tsunami-wrecked Fukushima Daiichi nuclear power plant began releasing its first batch of treated radioactive water into the Pacific Ocean on Thursday — a controversial step that prompted China to ban seafood from Japan.",
      "publishedAt": "2023-08-24T01:56:56Z",
      "title": "China bans seafood from Japan after the Fukushima nuclear plant begins its wastewater release",
      "url": "https://apnews.com/04d2423accd508e57afcd9e1eb6714ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/888aaa4aac35437ba13f98456eec6eae/1920.jpeg"
    },
    {
      "author": null,
      "description": "TRABUCO CANYON, Calif. (AP) — Three people were killed and five others were wounded in a shooting Wednesday at a Southern California biker bar, the Orange County Sheriff’s Department said. The gunman was also killed by deputies.",
      "publishedAt": "2023-08-24T03:57:17Z",
      "title": "Gunfire at a California biker bar kills 4 people, including the shooter, and wounds 5 more",
      "url": "https://apnews.com/be474bdb916250261808d34cc20f67b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97d97c57f3cb4d9d883515c2f4229320/1920.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and JAE C. HONG",
      "description": "LAHAINA, Hawaii (AP) — Shortly after the ignition of the deadliest U.S. wildfire in more than a century, a developer of land around a threatened Maui community urgently asked state officials for permission to divert water from streams to fight the growing inferno.",
      "publishedAt": "2023-08-24T04:13:51Z",
      "title": "Maui wildfires renew tensions around water rights in a centuries-old conflict over sacred streams",
      "url": "https://apnews.com/531263684bf5106d635f29aec91115e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38d9e40b4c50437bab42671f6617afb6/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — Iran and Saudi Arabia were among six countries set to join Brazil, Russia, India, China and South Africa in the BRICS economic bloc from next year, the bloc announced Thursday, a move that will likely throw more scrutiny on Beijing's political influence in the Persian Gulf.",
      "publishedAt": "2023-08-24T08:05:01Z",
      "title": "Iran, Saudi Arabia and Egypt are among 6 nations set to join China and Russia in BRICS economic bloc",
      "url": "https://apnews.com/b5900168d165cc78b36d5d5c068b7a50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06cb8f76aeb24084b21294828a4cea8c/3000.jpeg"
    },
    {
      "author": "GRAHAM DUNBAR",
      "description": "GENEVA (AP) — FIFA opened a disciplinary case Thursday against the Spanish soccer official who kissed a player on the lips while celebrating the team's victory in the Women’s World Cup final.The governing body's disciplinary committee will weigh if Spanish soccer federation president Luis Rubiales violated \"the basic rules of decent conduct” and “behaving in a way that brings the sport of football and/or FIFA into disrepute.”",
      "publishedAt": "2023-08-24T12:04:13Z",
      "title": "FIFA opens case against Spanish soccer official who a kissed player on the lips at Women's World Cup",
      "url": "https://apnews.com/879b859172e96b52fd89c830270698de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8464983a05384f19a0b9c200e85d8745/3000.jpeg"
    },
    {
      "author": "ANNIE MA",
      "description": "When Wes Brown sought out children's books for his two young sons, he made sure to seek titles that reflected the family he and his husband were building. He found that in one called “The Family Book,” a 2003 picture book by Todd Parr.",
      "publishedAt": "2023-08-24T04:06:04Z",
      "title": "Bans on diverse picture books? Young kids need to see their families represented, experts say",
      "url": "https://apnews.com/6ffaa23f2fc5a8e68108918ea69e7bfb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb842826555347029fe60e3cb2231302/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "The seasonal drink that made pumpkin spice a star is turning 20. And unlike the autumn days it celebrates, there seems to be no chill in customer demand.Starbucks’ Pumpkin Spice Latte goes on sale Thursday in the U.S.",
      "publishedAt": "2023-08-24T04:01:56Z",
      "title": "Starbucks' Pumpkin Spice Latte turns 20, beloved by millions and despised by some",
      "url": "https://apnews.com/aeac4eaecf371e77af161598f4b62949",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37fef5d709794f729e088e11f0be6db3/2597.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}