{
  "articles": [
    {
      "author": null,
      "description": "A U.N. official says 47 Palestinians were wounded, mostly by gunfire, when crowd overran Gaza aid hub. Ajith Sunghay, head of the U.N. Human Rights Office for the Palestinian territories, said it appeared that Israeli army fire had caused most of the injuries. On Tuesday, crowds of Palestinians overwhelmed a new aid distribution hub set up by an Israeli and U.S.-backed foundation. The crowd broke through fences and an Associated Press journalist heard Israeli tank and gun fire, and saw a military helicopter firing flares. The distribution hub outside Gaza’s southernmost city of Rafah was opened the day before by the Gaza Humanitarian Foundation, which has been slated by Israel to take over aid operations.",
      "publishedAt": "2025-05-28T06:59:43Z",
      "title": "UN official says 47 were wounded, mostly by gunfire, when crowd overran aid hub in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-05-28-2025-d4fdbe80de0ac3edd24cf17227c0e3c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/bbee8a1/2147483647/strip/true/crop/7716x4340+0+402/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F8a%2F6eaa81bf01237452eaaef2ae4a52%2F326322584baa4389ba0d13c38952f823"
    },
    {
      "author": "Stefanie Dazio",
      "description": "Ukrainian President Zelenskyy will visit Berlin to meet with new German Chancellor Friedrich Merz. The talks on Wednesday come amid an escalation in Russia’s bombing campaign despite U.S.-led attempts at peace talks. Germany has been the second-biggest supplier of military aid to Ukraine after the United States. Zelenskyy’s visit on Wednesday comes two days after Merz said his country and other major allies are no longer imposing any range restrictions on weapons supplied to Ukraine as it fights the Russian invasion. Russian forces launched an attack overnight on Ukraine using five Iskander ballistic missiles, one guided air-launched missile and 88 drones.",
      "publishedAt": "2025-05-28T07:31:44Z",
      "title": "Zelenskyy visits Berlin as he seeks more support for Ukraine in the war against Russia",
      "url": "https://apnews.com/article/russia-ukraine-war-germany-zelenskyy-merz-35c583e769bfd89eed738125802637ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/829835a/2147483647/strip/true/crop/5329x2998+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fa3%2F20e193887e906c968ccb0854af34%2F195290eadef14d819bd2077b3ddb36b5"
    },
    {
      "author": null,
      "description": "The head of the United Nations’ atomic watchdog says that “the jury is still out” on negotiations between Iran and the U.S. over Tehran’s rapidly advancing nuclear program. But Rafael Mariano Grossi described the continuing negotiations a good sign. Grossi is the director-general of the International Atomic Energy Agency. He made the comment on Wednesday to journalists attending a weeklong seminar at the agency in Vienna. Grossi acknowledged one of his deputies was in Tehran on Wednesday. Iranian officials identified the official as Massimo Aparo. He is the head of the IAEA’s safeguards arm.",
      "publishedAt": "2025-05-28T10:50:15Z",
      "title": "UN atomic watchdog chief says 'jury is still out' on Iran-US nuclear talks",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-0613bd70b6a47ed2f583177e54473a21",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Marcia Dunn",
      "description": "SpaceX has launched its Starship mega rocket again after back-to-back explosions. It made it through the entire test flight Tuesday evening, but fell short of its main objectives when the spacecraft tumbled out of control. SpaceX had hoped to release a series of mock satellites following liftoff from Texas, but that got nixed because the door failed to open all the way. Then the spacecraft began spinning as it skimmed space toward an entry in the Indian Ocean. The first-stage booster ended up in the Gulf of Mexico in pieces. There were no plans to catch the booster this time.",
      "publishedAt": "2025-05-27T23:37:40Z",
      "title": "SpaceX mega rocket Starship spins out of control and breaks apart",
      "url": "https://apnews.com/article/spacex-starship-elon-musk-moon-mars-5f02ab8e4b794e518fe99905adaa7471",
      "urlToImage": "https://dims.apnews.com/dims4/default/99cccc2/2147483647/strip/true/crop/3073x1729+0+160/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F55%2F1cadb5ff78f2f2ddbc351eff55f7%2F5e97a6d63fe04eb49fb19367bab65a18"
    },
    {
      "author": "Steve Karnowski",
      "description": "Two men face sentencing in Minnesota on human smuggling charges more than three years after a family of four from India froze to death while trying to cross into the U.S. along a remote stretch of the Canadian border in a blizzard. Federal prosecutors have recommended nearly 20 years for the alleged ringleader, Harshkumar Ramanlal Patel, at his sentencing Wednesday. And they're seeking nearly 11 years for the driver who was supposed to pick them up, Steve Anthony Shand. They'll be sentenced at the federal courthouse in the northwestern Minnesota city of Fergus Falls, where they were tried and convicted on four counts apiece in November.",
      "publishedAt": "2025-05-28T04:02:57Z",
      "title": "Men to be sentenced for human smuggling after deaths of Indian family",
      "url": "https://apnews.com/article/immigration-canada-us-india-deaths-smuggling-trial-0ec4b9f27bc55d8ab9195decd315f5cb",
      "urlToImage": "https://dims.apnews.com/dims4/default/6b12dd2/2147483647/strip/true/crop/3900x2194+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Fca%2F05dab2b59d3ebc9e68f4ea4820aa%2F769e95e339014a1abc83e86112378fd0"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "Asian shares are mixed after President Donald Trump delayed a 50% tariff on goods coming from the European Union, sparking a rally on Wall Street. A closely watched auction of 40-year Japanese government bonds drew weak demand as worries mount over growing levels of debt. U.S. futures were little changed and oil prices rose. Gains for shares in technology companies helped to boost benchmarks in Tokyo and South Korea. On Tuesday, the S&P 500 jumped 2%, also helped by a better-than-expected report on U.S. consumer confidence. The Dow Jones Industrial Average jumped 1.8% and the Nasdaq composite climbed 2.5%.",
      "publishedAt": "2025-05-28T03:30:48Z",
      "title": "Asian shares are mixed after S&P 500 rallies 2%, while Japan bond auction sees weak demand",
      "url": "https://apnews.com/article/stocks-markets-trump-tariffs-bonds-c377ae381e6839a45a0bde8b4bab3183",
      "urlToImage": "https://dims.apnews.com/dims4/default/c8becc6/2147483647/strip/true/crop/3640x2048+0+189/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fe9%2F6654641e9ba67df92ca0518fdf18%2Fa38a6f0cd5f84d3eb114d53a2f927a26"
    },
    {
      "author": "Rebecca Santana, Lindsay Whitehurst",
      "description": "The Trump administration is asking the Supreme Court to halt a judge’s order allowing migrants to challenge their deportations to South Sudan. The emergency appeal Tuesday came after a judge found the White House violated a court order with a deportation flight to the chaotic African nation carrying people from other countries who had been convicted of crimes in the U.S. Judge Brian E. Murphy in Boston found that the White House had “unquestionably” violated his earlier order that people must be given a chance to raise objections before being sent to another country that would put them in danger, even if they’ve otherwise exhausted their legal appeals.",
      "publishedAt": "2025-05-27T16:27:20Z",
      "title": "Judge accuses Trump administration of 'manufacturing' chaos in migrant deportation case",
      "url": "https://apnews.com/article/deportation-immigration-south-sudan-department-of-homeland-security-26547035c21e45339cffec1450dffa35",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb1b0b6/2147483647/strip/true/crop/5608x3155+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F7d%2F8af24457b16d9785e7e208d842ad%2F5ef8b4863aad48bdada6dd5f80a8242c"
    },
    {
      "author": null,
      "description": "The White House says President Donald Trump is set to pardon reality TV stars Julie and Todd Chrisley, the couple famous for “Chrisley Knows Best,” which followed their tightly knit family and extravagant lifestyle. A jury in 2022 found them guilty of conspiring to defraud community banks out of more than $30 million in fraudulent loans. The Chrisleys were also found guilty of tax evasion by hiding their earnings. In a social media post Tuesday, the White House said Trump called the Chrisley family and said “he will be granting full pardons,” adding, “Trump Knows Best!”",
      "publishedAt": "2025-05-27T21:36:33Z",
      "title": "Trump set to pardon reality TV stars Todd and Julie Chrisley",
      "url": "https://apnews.com/article/trump-pardon-julie-todd-chrisley-reality-tv-2f79831f142de44b36922ebdbc959f04",
      "urlToImage": "https://dims.apnews.com/dims4/default/576d25a/2147483647/strip/true/crop/5384x3029+0+280/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F4d%2F830049a0506b1f1cae823eba109c%2F35a8df1871924d22bd08017fd89cd83b"
    },
    {
      "author": "Tatiana Pollastri",
      "description": "Two Brazilian nuns have gone viral after dropping an impromptu beatbox and dance session during a Catholic television program. Sisters Marizele Cassiano and Marisa de Paula, members of the “Copiosa Redenção” congregation, were talking about a vocational retreat on Brazil’s Pai Eterno — Eternal Father — TV channel when they brought up a song about being called to the religious life. The two stood up and launched into a routine, complete with singing, beatbox and dance moves. Then the presenter, Deacon Giovani Bastos, joined in, matching Sister de Paula’s moves in a performance that’s now been seen by millions on social media in Brazil and abroad.",
      "publishedAt": "2025-05-28T09:45:53Z",
      "title": "Brazilian nuns go viral after beatboxing on Catholic TV",
      "url": "https://apnews.com/article/brazil-beatboxing-nuns-cassiano-paula-fbc70b83476201dfdf90ad6769edeca1",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5103de/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Fed%2F7a42cd3368898f1724fc39de4f70%2Fbra-beatboxing-nun-20250527cr-1920x1080.jpg"
    },
    {
      "author": null,
      "description": "An explosion at a chemical plant in eastern China has killed at least five people and injured 19. That's according to local emergency management authorities reported. Authorities say six people are missing following Tuesday's explosion at the Gaomi Youdao Chemical Co. in the city of Weifang. It manufactures pesticides as well as chemicals for medical use. It is not immediately clear what caused the explosion. The blast knocked out windows at a storage warehouse more than two miles away. A student at a nearby school told state media he saw saw dirt-yellow smoke, tainted with redness, rising from the plant.",
      "publishedAt": "2025-05-27T09:02:01Z",
      "title": "At least 5 are dead and 19 injured after a chemical plant explodes in China, authorities say",
      "url": "https://apnews.com/article/china-chemical-plant-explosion-c6cf0f35f996654221e9fb8de7d9fcee",
      "urlToImage": "https://dims.apnews.com/dims4/default/4bdeb9c/2147483647/strip/true/crop/1961x1103+0+102/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2F62%2F044d56e2735297fb96385b0661c8%2Ff55e23d7c1744f649a0df20ea92e0b4d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}