{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "JERUSALEM (AP) — The Israeli military on Wednesday said it had uncovered a major Hamas command center in the heart of Gaza City, inflicting what it described as a serious blow to the Islamic militant group as pressure grows on Israel to scale back its devastating military offensive in the coastal enclave.",
      "publishedAt": "2023-12-20T08:47:04Z",
      "title": "Israel uncovers major Hamas command center in Gaza City as cease-fire talks gain momentum",
      "url": "https://apnews.com/81b80e4716b53756c8fab96c183089ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ae540c0f7ee4382b89ab7e0211aab34/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN, ERIC TUCKER and REGINA GARCIA CANO",
      "description": "MIAMI (AP) — The United States freed a close ally of Venezuelan President Nicolás Maduro in exchange for the release of 10 Americans imprisoned in the South American country and the return of a fugitive defense contractor known as “Fat Leonard” who is at the center of a massive Pentagon bribery scandal, the Biden administration announced Wednesday.",
      "publishedAt": "2023-12-20T14:04:10Z",
      "title": "US, Venezuela swap prisoners: Maduro ally for 10 Americans, plus fugitive contractor 'Fat Leonard'",
      "url": "https://apnews.com/d7148a34dd009d5bab3d5f50c28ed93e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1387369961734f9a95d235bb0bca66d7/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — Former President Donald Trump's bid to win back the White House is now threatened by two sentences added to the U.S. Constitution 155 years ago.The Colorado Supreme Court on Tuesday barred Trump from the state's ballot under Section 3 of the 14th Amendment, which prohibits anyone who swore an oath to support the Constitution and then “engaged in insurrection” against it from holding office.",
      "publishedAt": "2023-12-20T17:34:38Z",
      "title": "The Constitution's insurrection clause threatens Trump's campaign. Here is how that is playing out",
      "url": "https://apnews.com/79373b5043976588b599fc00ede049e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4f102bab95e4294a2a25d2d17f39147/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Some top Democrats are worried that a dip in Black voter turnout, along with other challenges, could doom President Joe Biden and his party in 2024.",
      "publishedAt": "2023-12-21T05:05:10Z",
      "title": "Biden needs a new approach to Black voters based on Georgia and Michigan, group of strategists says",
      "url": "https://apnews.com/805b5d55fdf8c105f9ad5d320119a2cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/797998a69bec4c8cbb017a7b4699884e/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "ANAHEIM, Calif. (AP) — Before Shohei Ohtani stepped into the bright lights of Hollywood and signed the most lucrative contract in professional sports history, baseball's two-way superstar put together yet another season of unparalleled brilliance from Tokyo to Anaheim.",
      "publishedAt": "2023-12-21T11:00:25Z",
      "title": "Shohei Ohtani is the AP Male Athlete of the Year for the 2nd time in 3 years",
      "url": "https://apnews.com/b449f6ca931ff54ba49737d5fb4796d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3e46713a33e45d19b14e6e06e871fab/2000.jpeg"
    },
    {
      "author": "STEPHEN GROVES, LISA MASCARO and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — Amid grueling negotiations, the contours of a bipartisan border security and immigration deal are beginning to take shape, emerging even as Congress leaves town having failed to publicly unveil any details of the package that's central to unlocking stalled aid for Ukraine.",
      "publishedAt": "2023-12-21T05:03:23Z",
      "title": "A deal on US border policy is closer than it seems. Here's how it is shaping up and what's at stake",
      "url": "https://apnews.com/cf4aa608de350a480fabd8e6a3e062ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5160e7a034d644d3b65076bb3bf93bea/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — Texas sent a plane with more than 120 migrants from the U.S.-Mexico border to Chicago in an escalation of Republican Gov. Greg Abbott's busing operation that has given more than 80,000 migrants free rides to Democratic-led cities across the country since last year.",
      "publishedAt": "2023-12-20T23:02:45Z",
      "title": "Texas begins flying migrants from southern border to Chicago. The 1st plane carried over 120 people",
      "url": "https://apnews.com/16f23893299bc880ce1c4afaa9b9656a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20968f1352d94696872d40653e900d3f/3000.jpeg"
    },
    {
      "author": "BARRY HATTON",
      "description": "The year started with high hopes for Ukrainian troops planning a counteroffensive against Russia.",
      "publishedAt": "2023-12-21T05:18:04Z",
      "title": "Ukraine ends year disappointed by stalemate with Russia, and anxious about aid from allies",
      "url": "https://apnews.com/4c62940dd5ae56bc753cee7dbddbe3fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aef9776646f94a5bbb9747725f86d6c7/3000.jpeg"
    },
    {
      "author": "ED WHITE, DEL QUENTIN WILBER and MADDY PEEK",
      "description": "DETROIT (AP) — The serial killer lured women one by one into vacant homes to be murdered, posing their nude or partially clothed corpses amid cheap booze pints, crumbling sheetrock and hypodermic needles.",
      "publishedAt": "2023-12-21T05:07:32Z",
      "title": "'Total systemic breakdown': Missteps over years allowed Detroit serial killer to roam free",
      "url": "https://apnews.com/611aeac907177c7496f9cab5e4cc4c60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e0d9e59fe0d489b819c35ab6a235737/2250.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "KANSAS CITY, Mo. (AP) — A romance that united sports and music fans, a celestial wonder that drew millions of eyes skyward and a spiritual homecoming for some Native American tribes were just some of the moments that inspired us and brought joy in 2023.",
      "publishedAt": "2023-12-21T05:16:05Z",
      "title": "Taylor Swift's new romance, debt-erasing gifts and the eclipse are among most joyous moments of 2023",
      "url": "https://apnews.com/f90116512ed7c9f776da4e3b8ae194c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3bb555f058946b08028ba2286d74ec1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}