{
  "articles": [
    {
      "author": "Colleen Barry, Nicole Winfield",
      "description": "Pope Francis’ body will be moved to St. Peter’s Basilica to lie in state allowing the Catholic faithful to pay their respects to the Argentine pope. Francis is being remembered for his humble style, concern for the poor and insistent prayers for peace. Heads of state are expected for the funeral Saturday in St. Peter’s Square. But the three days of public viewing are largely for ordinary Catholics to mourn the 88-year-old pope. Francis died Monday after suffering a stroke. His body will be transferred Wednesday morning to St. Peter’s Basilica. The public mourning period will end on Friday night.",
      "publishedAt": "2025-04-23T04:45:44Z",
      "title": "Pope Francis' body to lie in state in St. Peter's Basilica as the faithful mourn",
      "url": "https://apnews.com/article/vatican-pope-francis-public-viewing-st-peters-732d413b0eba7695d8a931af393097f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b6aae6/2147483647/strip/true/crop/7087x3986+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F12%2F2686b99b7e28dc4c12742744dd78%2F1b27f627a766436ca580eeee7ef6fe2c"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Francis had a learning curve on clergy sexual abuse, with the turning point coming in 2018. Few people could have predicted that a comment he made then, dismissing victims of Chile's most notorious pedophile, would blow up into the biggest crisis of his papacy. But it was one that eventually set the Catholic Church on a new path of accountability for clergy sexual abuse. Years later, Francis recognized that the Chile trip was his “conversion” moment, when he came to realize he had been misled about just how bad the problem was.",
      "publishedAt": "2025-04-23T04:46:35Z",
      "title": "How Pope Francis dealt with clergy sexual abuse",
      "url": "https://apnews.com/article/pope-francis-catholic-church-sexual-abuse-2d87fe01e6ede23d403039b9fd3a978f",
      "urlToImage": "https://dims.apnews.com/dims4/default/0dce4b1/2147483647/strip/true/crop/3757x2113+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F01%2F732a0c2aeae78760909680a72766%2Fb72a7543aab74d549092d75d7ea8346e"
    },
    {
      "author": null,
      "description": "Diplomats and defense chiefs from Britain, the U.S., European nations and Ukraine are due to meet in London to push for a peace deal between Moscow and Kyiv. British Defense Secretary John Healey said Wednesday's meeting of foreign ministers and national security adviserswill include “what a ceasefire might look like and how to secure peace in the long term.” It follows talks last week in Paris. Those attending include retired Lt. Gen. Keith Kellogg, President Donald Trump’s envoy for Ukraine and Russia. The U.S. State Department said Secretary of State Marco Rubio, who attended the Paris talks, was unable to come because of a scheduling issue.",
      "publishedAt": "2025-04-23T04:47:36Z",
      "title": "Officials from Ukraine, US and UK meet in London in latest push to stop the war",
      "url": "https://apnews.com/article/russia-ukraine-war-peace-talks-london-4f35dc70f521e2363218f4c40748caba",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d59037/2147483647/strip/true/crop/8122x4569+0+423/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F4c%2F9b0b4b184c99bd5386eb05e6c66f%2F79281dd1c0ce43ea94daa06bba49b831"
    },
    {
      "author": "Aijaz Hussain",
      "description": "Indian police say gunmen have killed at least 26 tourists at a resort in Indian-controlled Kashmir. Tuesday's attack appears to be a major shift in a regional conflict in which tourists have largely been spared from violence. Two senior police officers say at least four gunmen, whom they described as militants, fired at dozens of tourists from close range. The officers say at least three dozen people were wounded, with many of them reported to be in serious condition. The region's top elected official says the attack is “much larger than anything we’ve seen directed at civilians in recent years.”",
      "publishedAt": "2025-04-22T11:08:50Z",
      "title": "Militants kill at least 26 tourists at Pahalgam terror attack in Kashmir",
      "url": "https://apnews.com/article/kashmir-tourist-attack-dc7067a18899d9e7ff7726d4e05982c3",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd4b3fa/2147483647/strip/true/crop/3260x1834+0+170/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2F5d%2F90c13e3942b9817da78d93b1d753%2F92ac9c211b5e40deaa5b043acdab0130"
    },
    {
      "author": "Jon Gambrell",
      "description": "Yemen’s Houthi rebels have launched a missile toward northern Israel, a rare target for the group as a monthlong intense U.S. airstrike campaign continues to target them. Sirens sounded in Haifa, Krayot and other areas west of the Sea of Galilee. The Israeli military that \"an interceptor was launched toward the missile, and the missile was most likely successfully intercepted.” Those in the area could here booms in the predawn darkness on Wednesday. The Houthis did not immediately claim the attack, though it can take them hours or even days to acknowledge their assaults. The Houthis separately claimed shooting down another MQ-9 Reaper drone over Yemen.",
      "publishedAt": "2025-04-23T02:11:47Z",
      "title": "Yemen's Houthi rebels fire missile targeting north Israel",
      "url": "https://apnews.com/article/yemen-us-airstrikes-iran-houthis-04-23-2025-edcdc10675178db11dc488b6f11d14db",
      "urlToImage": "https://dims.apnews.com/dims4/default/55a57bd/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F64%2F7202dc2069d1c5e6e7f243dbb0a6%2F44231e4191474113b7476d5342b9fa2c"
    },
    {
      "author": "Josh Boak, Fatima Hussein",
      "description": "U.S. Treasury Secretary Scott Bessent said in a Tuesday speech that the ongoing tariffs showdown with China is unsustainable and expects a “de-escalation” in the trade war between the world’s two largest economies. But in a private speech in Washington for JPMorgan Chase, Bessent also cautioned that talks between the United States and China had yet to formally start. President Donald Trump placed a 145% import tax on China, which countered with 125% tariffs on U.S. imports. Trump has placed tariffs on several dozen countries, causing the stock market to stumble and interest rates to increase on U.S. debt as investors worry about slower economic growth and higher inflationary pressures.",
      "publishedAt": "2025-04-22T17:51:36Z",
      "title": "Scott Bessent says US tariff war with China is not 'sustainable'",
      "url": "https://apnews.com/article/tariffs-trade-taxes-trump-china-bessent-treasury-66668fa26957ece530a250fa8ea19faa",
      "urlToImage": "https://dims.apnews.com/dims4/default/2fd9ea1/2147483647/strip/true/crop/4792x2696+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2Fbe%2Fbba80cc7a96d129a126e4e2e45e0%2F90de5d469b234a8287bbb52c9f4345d1"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump said Tuesday he has no plans to fire Federal Reserve Chair Jerome Powell, just days after his statement that he would like to terminate the head of the U.S. central bank caused a stock market selloff. Trump told reporters, “I have no intention of firing him.\" The U.S. president had previously insinuated otherwise as he said he could fire Powell if he wanted to, having been frustrated by the Fed putting a pause on cuts to short-term interest rates.",
      "publishedAt": "2025-04-22T21:57:01Z",
      "title": "Trump says he has 'no intention' of firing Fed Chair Jerome Powell",
      "url": "https://apnews.com/article/federal-reserve-trump-jerome-powel-4710172f1fd4d6493769ac0b81703c01",
      "urlToImage": "https://dims.apnews.com/dims4/default/940aca6/2147483647/strip/true/crop/4891x2751+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F89%2F2c8216ed51dabc4b31d7bdfaf47c%2F70e978f8dd864dbeb11010e22fac49a1"
    },
    {
      "author": null,
      "description": "A wildfire burning in New Jersey has forced thousands of people to evacuate and closed a stretch of a major highway. The New Jersey Fire Service says the Garden State Parkway has been closed between Barnegat and Lacey townships. Authorities say more than 1,300 structures have been threatened and power is out to most of Barnegat Township. About 3,000 residents have been evacuated. There have been no immediate reports of injuries. The cause of the fire is under investigation.",
      "publishedAt": "2025-04-23T01:25:49Z",
      "title": "New Jersey forest fire prompts thousands of evacuations and closes a major highway",
      "url": "https://apnews.com/article/wildfire-new-jersey-garden-state-parkway-67aa9857c28eadfaeb54ebc9f0ce1028",
      "urlToImage": "https://dims.apnews.com/dims4/default/69f0e3e/2147483647/strip/true/crop/5236x2945+0+273/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2F2e%2F06e6b719beda71c455509b825219%2F54511b70d24c42139affc08670afe87f"
    },
    {
      "author": "Kate Brumback",
      "description": "Some international students in the U.S. who have had their legal status terminated in recent weeks have found a measure of success in court, with federal judges around the country issuing orders to restore students’ status at least temporarily. More than a thousand international students have had their visas revoked or their status ended, with their academic careers — and their lives in the U.S. — thrown into doubt in a widespread crackdown by the Trump administration. Judges have issued temporary restraining orders in states including Georgia, New Hampshire, Wisconsin, Montana, Oregon and Washington. Judges have denied similar requests in some other cases.",
      "publishedAt": "2025-04-23T04:04:42Z",
      "title": "Visa revocations: International students challenge status terminations",
      "url": "https://apnews.com/article/international-student-visa-status-restraining-order-64a97b4fabc5264ed20b179952cdabff",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a9081c/2147483647/strip/true/crop/3020x1699+0+158/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fea%2F5dd29d405a23c2cccc85773985ca%2F531a593a9b8845cb95cb87215bb15d2e"
    },
    {
      "author": "Isabella O'malley",
      "description": "Harmful bleaching of the world’s coral has now grown to include 84% of the ocean’s reefs in the most intense event of its kind in recorded history. That's according to the International Coral Reef Initiative. Warming oceans cause corals to expel the colorful algae living inside of them, putting the coral at risk of death. Healthy corals are essential for seafood production, jobs and coastline protection worldwide. Scientists say it's essential to reduce greenhouse gases that are the main driver of atmospheric warming. Last year was the warmest on record, and much of that heat is going into oceans.",
      "publishedAt": "2025-04-23T04:02:57Z",
      "title": "Global coral bleaching has now hit 84% of ocean's reefs in biggest-ever event",
      "url": "https://apnews.com/article/coral-reef-bleaching-climate-change-fdbeddf7ae3ccc9d7cf85d1c3267e581",
      "urlToImage": "https://dims.apnews.com/dims4/default/8d9a499/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1c%2F2e%2Ff1aa0bdae09e0983ba043a1f335e%2F95a54fc7e4f24e6e89e9a5d0e301b2b6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}