{
  "articles": [
    {
      "author": null,
      "description": "The leaders of four European countries have arrived in Kyiv as calls intensify for Russia to agree to a monthlong cease-fire in the war. The leaders of France, Germany, Poland and the United Kingdom arrived together Saturday at the train station in Kyiv, where they are expected to meet Ukrainian President Volodymyr Zelenskyy. The visit marked the first time the leaders of the four countries have travelled together to Ukraine. Friedrich Merz is making a first visit to Ukraine as Germany’s new Chancellor. Along with President Donald Trump, the European leaders are pushing for Russia to agree to a 30-day ceasefire to allow for peace talks on ending the conflict.",
      "publishedAt": "2025-05-10T06:55:52Z",
      "title": "European leaders arrive in Kyiv amid push for 30-day ceasefire",
      "url": "https://apnews.com/article/russia-ukraine-war-fbd6aa9ddb147fa1b789c30dcf44dab3",
      "urlToImage": "https://dims.apnews.com/dims4/default/d76327f/2147483647/strip/true/crop/3692x2077+0+192/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Fa2%2F170fcd5dd54fb8e9e533fa9452de%2F5fca82ef6f8d42f9986fbcc4d88b839c"
    },
    {
      "author": "Munir Ahmed",
      "description": "Pakistan’s army spokesman says India has fired missiles at three air bases inside the country, but most of the missiles have been intercepted. Lt. Gen. Ahmad Sharif said the assets of the Pakistan Air Force are safe. He made this announcement during his televised address, saying some of the Indian missiles have also hit India’s eastern Punjab.",
      "publishedAt": "2025-05-09T23:03:19Z",
      "title": "Pakistan's army spokesman says India has fired missiles at 3 Pakistani air bases",
      "url": "https://apnews.com/article/india-pakistan-missiles-air-bases-1de0ca13c13899f0bd3530b4808d45ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2a69bd/2147483647/strip/true/crop/7203x4052+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F5b%2Ff167ac4b2dd36820616fff87a055%2Ff2f652c417164790a65310dc0aed29c6"
    },
    {
      "author": "Will Weissert",
      "description": "Top White House aide Stephen Miller says the Trump administration is looking for ways to expand its legal power to deport migrants who are in the United States illegally. To achieve that, he says President Donald Trump’s team is “actively looking at” suspending habeas corpus, the constitutional right for people to legally challenge their detention by the government. Such a move would be aimed at migrants as part of the Republican president’s broader crackdown at the U.S.-Mexico border. The Constitution says habeas corpus, “shall not be suspended, unless when, in cases of rebellion or invasion, the public safety may require it.” Miller is suggesting the U.S. is facing “an invasion” of migrants.",
      "publishedAt": "2025-05-10T17:12:46Z",
      "title": "Trump team mulls suspending habeas corpus to speed deportations. Can it?",
      "url": "https://apnews.com/article/habeas-corpus-trump-migrants-deportations-constitution-28a598363d03bfc9448b5132c72f2b3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/4835abb/2147483647/strip/true/crop/4187x2355+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2F91%2F3f0a4f22f89e904674ff5ed26ee5%2Fa2f1fc08a9de4e59b17592d6daac951e"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV has laid out the vision of his papacy, identifying artificial intelligence as one of the most critical matters facing humanity. In his first formal audience Saturday, Leo made clear he will follow in the modernizing reforms of Pope Francis to make the Catholic Church inclusive, attentive to the faithful and a church that looks out for the “least and rejected.” Citing Francis repeatedly, he told the cardinals who elected him that he was fully committed to the reforms of the Second Vatican Council, the 1960s meetings that modernized the church. He said artificial intelligence poses challenges to defending human dignity, justice and labor.",
      "publishedAt": "2025-05-10T11:41:31Z",
      "title": "Pope Leo XIV lays out his vision of papacy, identifies AI as a main challenge for humanity",
      "url": "https://apnews.com/article/pope-leo-vision-papacy-artificial-intelligence-36d29e37a11620b594b9b7c0574cc358",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Jack Brook, Deepa Bharath",
      "description": "The election of Pope Leo XIV, who is the first U.S. pope and has Creole roots, is raising more awareness about the complexity of the Creole identity. The pope has not openly spoken about his racial identity, but historical records highlight a story of migration common to African American families leaving the racism of the Jim Crow South. Black and Creole Catholics in the U.S. say that a pope who holds these multiple identities is just what the Catholic Church needs to unify the global church and elevate the profile of Black Catholics, whose history and contributions, they say, have been overlooked.",
      "publishedAt": "2025-05-10T04:03:37Z",
      "title": "Pope Leo XIV has Creole roots in New Orleans, historian says",
      "url": "https://apnews.com/article/pope-leo-creole-roots-new-orleans-black-b5794961d9582941413fe3154b30cc87",
      "urlToImage": "https://dims.apnews.com/dims4/default/008bfdc/2147483647/strip/true/crop/1418x798+0+74/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2Fc2%2F26ae7c6e26e434796e4436bc17c8%2Fe5c6e4c84c6c4b00bf08595dbe7e51d8"
    },
    {
      "author": "Paul Wiseman, Didi Tang, Jamey Keaten",
      "description": "The U.S. Treasury Secretary and America’s top trade negotiator will meet with high-ranking Chinese officials in Switzerland this weekend to de-escalate a dispute that threatens to cut off trade between the world’s two biggest economies and damage the global economy. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson will meet in Geneva with a Chinese delegation led by Vice Premier He Lifeng. Prospects for a major breakthrough appear dim. But there is hope that the two countries will scale back the massive taxes – tariffs – they’ve slapped on each other’s goods, a move that would relieve world financial markets and companies on both sides of the Pacific Ocean that depend on U.S.-China trade.",
      "publishedAt": "2025-05-10T04:15:16Z",
      "title": "US and Chinese officials meet in Geneva to discuss tariffs as the world looks for signs of hope",
      "url": "https://apnews.com/article/china-trump-trade-tariffs-bessent-economy-71a6e410a0e5771c70ac853563a8b75d",
      "urlToImage": "https://dims.apnews.com/dims4/default/18e45de/2147483647/strip/true/crop/7440x4185+0+388/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fd3%2F6d65f5826aba92fe309c8898314f%2F39f00ddbfa87492488a621511b32c1d3"
    },
    {
      "author": "Lisa Mascaro",
      "description": "The Republican Party is trying to figure out what it stands for in terms of economic policy during the second Trump administration. House Speaker Mike Johnson is racing to draft a package of tax breaks and spending cuts being pushed by President Donald Trump. Republicans must decide whether they stick with the “No new taxes” pledge that's been GOP political orthodoxy for decades or whether they tax the rich, as Trump has suggested. They must decide whether to roll back the Obama-era health care expansion and Biden administration green energy investments or protect the federal flow to the states. And do they want free trade or Trump’s tariffs?",
      "publishedAt": "2025-05-10T14:19:38Z",
      "title": "Tax the rich? Republicans wrestle with their economic priorities in the Trump era",
      "url": "https://apnews.com/article/medicaid-taxes-trade-trump-republicans-economic-policy-85989224465f3c6e0c0c22e07081d44f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8e8cdb3/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F6d%2F95d6aec60c5501aaee6f3711ec4a%2F2dd6cc0223904fa488c80e2586160c3f"
    },
    {
      "author": "The Associated Press",
      "description": "An earthquake of 4.1 preliminary magnitude has been reported in Tennessee and was felt in Atlanta, Georgia, and western North Carolina. That is according to the U.S. Geological Survey and local news reports. The website for USGS said the earthquake originated shortly after 9 a.m. EDT Saturday about 12 miles from Greenback, Tennessee. Meteorologists at television news stations serving Georgia and North Carolina reported feeling the tremors.",
      "publishedAt": "2025-05-10T13:54:33Z",
      "title": "An earthquake of 4.1 preliminary magnitude has been reported in Tennessee and was felt in Atlanta",
      "url": "https://apnews.com/article/earthquake-tennessee-atlanta-north-carolina-cb5a05028a43145bed6aa2d887d93c07",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Marcia Dunn",
      "description": "A Soviet-era spacecraft has plunged to Earth, more than a half-century after its failed launch to Venus. The half-ton spacecraft fell out of orbit on Saturday. The European Union Space Surveillance and Tracking confirmed its uncontrolled entry, as did the Russian Space Agency. The Russians said it came in over the Indian Ocean, but some experts questioned the location. It was not immediately known how much, if any, of the Kosmos 482 spacecraft survived the fiery descent through the atmosphere. Experts said ahead of time that some if not all of it might come crashing down, given it was built to withstand a landing on Venus. The chances of anyone being clobbered by the spacecraft debris were exceedingly low.",
      "publishedAt": "2025-05-10T10:52:50Z",
      "title": "Soviet-era spacecraft Kosmos 482 plunges to Earth after 53 years stuck in orbit",
      "url": "https://apnews.com/article/soviet-venus-spacecraft-kosmos-482-93871c98ca9c09a67219e238ed3e2eaa",
      "urlToImage": "https://dims.apnews.com/dims4/default/533ca8e/2147483647/strip/true/crop/927x521+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F51%2Fd4f8545e2d77e2d0e44b0fdadc98%2Ffcf205560e7c464cae17edf1341708ae"
    },
    {
      "author": "Brett Martel",
      "description": "The New Orleans Saints say veteran quarterback Derek Carr has decided to retire because of a labral tear in his right shoulder and “significant degenerative changes” to his rotator cuff. The 34-year-old Carr has played for 11 pro seasons since being selected out of Fresno State by the then-Oakland Raiders in the second round of the 2014 NFL draft. Carr was acquired by the Saints as a free agent in 2023 but had mixed results in New Orleans, going 14-13 as a starter while also struggling through oblique, hand and head injuries that caused him to miss seven games last season. His retirement comes two weeks after the Saints selected Louisville QB Tyler Shough in the second round of the draft.",
      "publishedAt": "2025-05-10T15:12:27Z",
      "title": "Saints QB Derek Carr is retiring because of 'significant degenerative changes' to his right shoulder",
      "url": "https://apnews.com/article/saints-derek-carr-retire-67c08cbd96a293ba07dc66cf8a43bf89",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb894aa/2147483647/strip/true/crop/3706x2085+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F17%2Fd6cc0995610401434051d25f82e7%2F2fe34c445e434dd4a308c6d753c41a2d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}