{
  "articles": [
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — It was the middle of the night when a dispatcher’s 12-second warning crackled over the radio: A massive cargo ship had lost its steering capabilities and was heading toward the Francis Scott Key Bridge.",
      "publishedAt": "2024-03-27T04:03:00Z",
      "title": "'Heroes' scrambled to stop traffic before Baltimore bridge collapsed; construction crew feared dead",
      "url": "https://apnews.com/6a95340e5daeff6551fc999d23feb278",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fba513d2dada482a8f283e971d1d66d4/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Around 30 rockets were launched from Lebanon toward northern Israel on Wednesday morning, according to the Israeli military. Hezbollah took responsibility for the launches and said they were in response to an Israeli airstrike on a paramedic center linked to a Lebanese Sunni Muslim group in south Lebanon that killed seven of its members overnight.",
      "publishedAt": "2024-03-27T09:25:37Z",
      "title": "The Latest | Hezbollah launches rockets into Israel after an Israeli strike kills 7 in Lebanon",
      "url": "https://apnews.com/dac468145fa4170a368938e527eec269",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c445ff066d94b6aa38b6d68dfe12f89/3000.jpeg"
    },
    {
      "author": "BILL BARROW and LINLEY SANDERS",
      "description": "ATLANTA (AP) — Many Americans are unenthusiastic about a November rematch of the 2020 presidential election. But presumptive GOP nominee Donald Trump appears to stoke more anger and fear among Americans from his opposing party than President Joe Biden does from his.",
      "publishedAt": "2024-03-27T04:01:40Z",
      "title": "AP-NORC Poll: Trump evokes more anger and fear from Democrats than Biden does from Republicans",
      "url": "https://apnews.com/2d29d5b0be4fe11272ec372542b76b44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13b1cd523fca45f889a5466a3bcad9ff/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The case against Donald Trump seemed relatively straightforward in August 2022 when FBI agents searched his Mar-a-Lago estate, with authorities citing evidence that the former president hoarded enough classified documents to fill dozens of boxes and obstructed the government's efforts to retrieve them.",
      "publishedAt": "2024-03-27T04:06:37Z",
      "title": "Hurry up and wait: Trump's classified documents case is mired in delays that may run past election",
      "url": "https://apnews.com/83be6fb5362e7bb2b7aaf6371a9acabf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/787372846d68443490ccc24f6d615ac5/3000.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "KIBBUTZ NAHAL OZ, Israel (AP) — For a few minutes on a recent afternoon, the sun-bathed silence that fills Nadav Tzabari’s neighborhood could almost be mistaken for peace.Then shelling from Israeli tanks dug in across the fence line in Gaza erupts again, sending shudders through the vacated homes and overgrown gardens of this long-resilient farming community, emptied for months of nearly all its people.",
      "publishedAt": "2024-03-27T04:13:35Z",
      "title": "They fled kibbutzim after Hamas attacked. Now, many Israelis must decide whether to go back.",
      "url": "https://apnews.com/602abc399f73ac97ce19b81ddc13571a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2948138bfb4e48cc9a7a1e724db70e2f/1920.jpeg"
    },
    {
      "author": "DARKO BANDIC and JOVANA GEC",
      "description": "ZAGREB, Croatia (AP) — With vigils outside clinics, marches drawing thousands and groups of men kneeling to pray in public squares, religious and neo-conservative groups have been ramping up pressure to ban abortions in staunchly Catholic Croatia.",
      "publishedAt": "2024-03-27T04:05:12Z",
      "title": "50 years after the former Yugoslavia protected abortion rights, that legacy is under threat",
      "url": "https://apnews.com/fbb9d3c885742fd17ecf1343c9525fba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ff1e4a6414d43a585f67d5552547f35/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — A media frenzy was born on Feb. 27, when the hashtag #WhereIsKate exploded online with speculation about the whereabouts of Britain's Princess of Wales. It opened a rabbit hole of amateur detective work, memes, bizarre theories and jokes — mixed with genuine concern about Kate's health — into which thousands of people descended until her announcement last week that she was recovering from cancer.",
      "publishedAt": "2024-03-27T04:01:33Z",
      "title": "The British royal family learns that if you don't fill an information vacuum, someone else will",
      "url": "https://apnews.com/49d725512152e60d8fbe7bd093b8d5c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d72098d14974ef2b544b1ba37d71276/3000.jpeg"
    },
    {
      "author": null,
      "description": "BANGKOK (AP) — Lawmakers in Thailand's lower house of Parliament overwhelmingly approved a marriage equality bill on Wednesday that would make the country the first in Southeast Asia to legalize equal rights for marriage partners of any gender.",
      "publishedAt": "2024-03-27T08:09:05Z",
      "title": "Lawmakers in Thailand overwhelmingly approve a bill to legalize same-sex marriage",
      "url": "https://apnews.com/9a2f9da6b5b36a1cf70dee5caec70e23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90bc65903dfd42efaf548f491d3399fd/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY, ANNIE MA and NOREEN NASIR",
      "description": "CHICAGO (AP) — When she started writing her college essay, Hillary Amofa told the story she thought admissions offices wanted to hear. About being the daughter of immigrants from Ghana and growing up in a small apartment in Chicago.",
      "publishedAt": "2024-03-27T04:12:00Z",
      "title": "Should college essays touch on race? Some feel the affirmative action ruling leaves them no choice",
      "url": "https://apnews.com/f0c006a6210ab244c1b6b4c2b1926b6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f32ff3560d694463a25b1d22f28aa4db/3000.jpeg"
    },
    {
      "author": null,
      "description": "DES MOINES, Iowa (AP) — Someone in New Jersey overcame the odds Tuesday night and won the $1.13 billion Mega Millions jackpot, breaking a winless streak that dated to last December.The numbers drawn were: 7, 11, 22, 29, 38 and the gold Mega Ball 4.",
      "publishedAt": "2024-03-26T16:22:26Z",
      "title": "The winless lottery streak ends. Someone in New Jersey won the $1.13 billion Mega Millions jackpot",
      "url": "https://apnews.com/2ca3af2378b56cb272877f2c0a674cd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7366b7d0b7714264b18d2fde5bbf0768/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}