{
  "articles": [
    {
      "author": "NAJIB JOBAIN, BASSEM MROUE and ELENA BECATOROS",
      "description": "RAFAH, Gaza Strip (AP) — Desperate Palestinians fleeing Israel's expanding ground offensive crowded into an ever-shrinking area of the Gaza Strip as the Israel-Hamas war entered its third month Friday.",
      "publishedAt": "2023-12-08T08:49:14Z",
      "title": "Palestinians crowd into ever-shrinking areas in Gaza as Israel's war against Hamas enters 3rd month",
      "url": "https://apnews.com/364b8f23ced3704273faede6f2ca6f38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80fea8dc7b7c4e13be62c5473250ecdc/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE, SAMY MAGDY and NAJIB JOBAIN",
      "description": "RAFAH, Gaza Strip (AP) — The roads are so ravaged that the dead and wounded arrive by donkey cart. Desperate relatives rush bloodied and dust-covered people, many of them children, to the hospital.",
      "publishedAt": "2023-12-08T06:48:11Z",
      "title": "Bloodshed, fear, hunger, desperation: Palestinians try to survive war's new chapter in southern Gaza",
      "url": "https://apnews.com/4da8410ab2e849adef8aff18c79b310c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97cdeed71f13432aabf278055889d0be/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden was indicted on nine tax charges in California on Thursday as a special counsel investigation into the business dealings of President Joe Biden's son intensifies against the backdrop of the looming 2024 election.",
      "publishedAt": "2023-12-08T01:31:36Z",
      "title": "Hunter Biden indicted on nine tax charges, adding to gun charges in special counsel probe",
      "url": "https://apnews.com/75b2aa05f247535677454ff2dfa7c71f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8753e67b1d524cc2b664bbbea08c5eaa/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MICHAEL BALSAMO",
      "description": "Derek Chauvin was stabbed nearly two dozen times in the law library at a federal prison in Arizona.",
      "publishedAt": "2023-12-08T05:15:38Z",
      "title": "High-profile attacks on Derek Chauvin and Larry Nassar put spotlight on violence in federal prisons",
      "url": "https://apnews.com/410aa291befb9a8dc29e0d77fa13c96e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb2958212e93489fbe198950fd4fd412/2100.jpeg"
    },
    {
      "author": "JILL COLVIN and BILL BARROW",
      "description": "TUSCALOOSA, Ala. (AP) — As Donald Trump faces growing scrutiny over his increasingly authoritarian and violent rhetoric, Fox News host Sean Hannity gave his longtime friend a chance to assure the American people that he wouldn't abuse power or seek retribution if he wins a second term.",
      "publishedAt": "2023-12-08T00:58:52Z",
      "title": "Trump's vow to only be a dictator on 'day one' follows growing worry over his authoritarian rhetoric",
      "url": "https://apnews.com/f27e7e9d7c13fabbe3ae7dd7f1235c72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2840d5c5e2847ad81c23bfda8b5b29f/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and BEN FINLEY",
      "description": "LAS VEGAS (AP) — A 67-year-old college professor who was denied jobs at various Nevada colleges and universities stuffed loaded handgun magazines into his waistband before walking into a University of Nevada, Las Vegas campus building and killing three faculty members, police said.",
      "publishedAt": "2023-12-08T05:49:06Z",
      "title": "UNLV gunman was unemployed professor who had 150 rounds of ammunition and a target list, police say",
      "url": "https://apnews.com/8f75fc1c5f863f5d928c48aa1189aedf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/837b2436416f430cabe844030a7334af/1920.jpeg"
    },
    {
      "author": "EDNA TARIGAN",
      "description": "BOGOR, Indonesia (AP) — At a lake in the West Javan city of Bogor, children and teenagers paddle toward piles of floating trash, pick it up and store it in their kayaks, before passing it to friends sorting it onshore.",
      "publishedAt": "2023-12-08T05:39:15Z",
      "title": "Indonesia's youth clean up trash from waterways, but more permanent solutions are still elusive",
      "url": "https://apnews.com/0083891b04ea3d69c8a1e82c470a4332",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18c28949b8c745e497aab4c9423d3121/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — A mayoral runoff Saturday between state Sen. John Whitmire, 74, and U.S. Rep. Sheila Jackson Lee, 73, has the fourth-largest city in the U.S. on the verge of picking a new leader who cuts against Houston's demographic trends.",
      "publishedAt": "2023-12-08T05:42:03Z",
      "title": "Houston has a population that's young. Its next mayor, set to be elected in a runoff, won't be",
      "url": "https://apnews.com/43308e60628f2947173eccfac5ca020a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18dac0a78325408592d9c204036c40c1/1920.jpeg"
    },
    {
      "author": "CURT ANDERSON",
      "description": "ST. PETERSBURG, Fla. (AP) — In Florida, this year has been a tale of two states as far as rainfall totals, with the southeast coast deluged by sometimes-record rainfall and much of the Gulf of Mexico coast facing a drought.",
      "publishedAt": "2023-12-08T05:00:58Z",
      "title": "Drought vs deluge: Florida's unusual rainfall totals either too little or too much on each coast",
      "url": "https://apnews.com/a4c23d088b6059beea2b70bf3e7907a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34313bc4d9174ccb891b1335eace49d9/1920.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — One of the biggest and brightest stars in the night sky will momentarily vanish as an asteroid passes in front of it to produce a one-of-a-kind eclipse.The rare and fleeting spectacle, late Monday into early Tuesday, should be visible to millions of people along a narrow path stretching from central Asia’s Tajikistan and Armenia, across Turkey, Greece, Italy and Spain, to Miami and the Florida Keys and finally, to parts of Mexico.",
      "publishedAt": "2023-12-08T08:00:17Z",
      "title": "Asteroid will pass in front of bright star Betelgeuse to produce a rare eclipse visible to millions",
      "url": "https://apnews.com/b9e3796c1ca915afdb84ed41509da9c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31f3cb5d133c4b3fa4a0b4d258e35059/1280.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}