{
  "articles": [
    {
      "author": "Illia Novikov",
      "description": "Ukraine’s capital has came under a large-scale combined drone and missile attack with explosions and machine gun fire heard throughout the city. Many residents of Kyiv are taking shelter in the underground subway stations. The debris of intercepted missiles and drones fell in at least 4 city districts, acting head of Kyiv military administration, Tymur Tkachenko, wrote on Telegram. According to Tkachenko, six people required medical care after the attack, two fires sparked at Solomianskyi district of Kyiv. Prior to the attack, city mayor Vitalii Klitschko warned Kyiv residents of more than 20 Russian strike drones heading towards Kyiv.",
      "publishedAt": "2025-05-24T00:02:19Z",
      "title": "Kyiv comes under large-scale Russian drone and missile attack with explosions heard throughout city",
      "url": "https://apnews.com/article/russia-ukraine-war-attack-drones-kyiv-469287eb80a7c3d423379969d4752ab9",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ba878e/2147483647/strip/true/crop/5886x3311+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2F7a%2F899c8f4767da774fe308ad88cd8b%2F3b403e3eb6394814858dfb79a8f255fd"
    },
    {
      "author": "Seung Min Kim, West Point, N.y.",
      "description": "President Donald Trump is delivering his first military commencement address since returning to office. The Republican president is set to speak to West Point’s graduating class on Saturday morning. Trump gave the commencement address at West Point in 2020, during the height of the COVID-19 pandemic. The president urged the graduating cadets to “never forget” the soldiers who fought a war over slavery during his remarks, which came as the nation was reckoning with its history on race after the murder of George Floyd in Minneapolis. Trump also paid tribute to the military academy’s history and its famed graduates, including Douglas MacArthur and Dwight D. Eisenhower.",
      "publishedAt": "2025-05-24T04:03:50Z",
      "title": "Trump is set to deliver West Point commencement address",
      "url": "https://apnews.com/article/trump-commencement-army-west-point-graduates-ecbc20a0ce46350618dabae573e40556",
      "urlToImage": "https://dims.apnews.com/dims4/default/05a7775/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F56%2Fed8a5dcfdb04cf8c1b5439b38dbf%2F824191205e1d458ea83befe7e0bec343"
    },
    {
      "author": "Sally Abou Aljoud, Samy Magdy",
      "description": "Gaza's Health Ministry says the bodies of 79 people killed by Israel strikes have been brought to hospitals in the past 24 hours. The toll doesn’t include hospitals in the battered north that the ministry says are now inaccessible. The dead over the past day in Israel’s renewed military offensive included nine of a doctor’s 10 children. That's according to horrified colleagues and the Health Ministry. Israel’s military says it struck suspects operating near its forces and described the area of the southern city of Khan Younis as a “dangerous war zone.” Israel says its air force struck over 100 targets throughout Gaza over the past day in its renewed offensive.",
      "publishedAt": "2025-05-24T14:48:41Z",
      "title": "9 of a doctor's 10 children are killed in Israel's latest strikes in Gaza",
      "url": "https://apnews.com/article/gaza-israel-palestinians-war-news-8c3fe634bd81986249a235ad53a9044c",
      "urlToImage": "https://dims.apnews.com/dims4/default/ffd58a2/2147483647/strip/true/crop/5940x3341+0+309/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F54%2F2173eed0de106d2e611ce27e17c0%2F89af9d56c355444eaa58baa52d7a0774"
    },
    {
      "author": "Jake Coyle",
      "description": "Iranian dissident filmmaker Jafar Panahi’s revenge thriller “It Was Just an Accident” has won the Palme d’Or at the Cannes Film Festival on Saturday. The win hands the festival’s top prize to a director who had been banned from leaving Iran for more than 15 years. The closing ceremony got underway Saturday after a major power outage struck southeastern France due to what police suspected as arson. Also among the winners Saturday were Wagner Moura for the Brazilian political thriller “The Secret Agent” and a special prize for Bi Gan’s sci-fi film “Resurrection.” The Grand Prix, or second prize, was awarded to Joachim Trier’s Norwegian family drama “Sentimental Value.\"",
      "publishedAt": "2025-05-24T04:00:14Z",
      "title": "Cannes awards its Palme d'Or trophy to Iranian revenge drama 'It Was Just an Accident'",
      "url": "https://apnews.com/article/cannes-2025-palme-dor-awards-72ccfe497665406489f8a9b997eda224",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c30843/2147483647/strip/true/crop/8020x4511+0+418/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F8d%2F60a8c56a0b3321f973aa266ee308%2F8f8d99687b4f411c9796584c4e1e7eda"
    },
    {
      "author": null,
      "description": "A major power outage affecting southeastern France disrupted traffic and briefly halted events at the Cannes Film Festival as the prestigious event prepared to hand out its top prize. Electricity operator said about 160,000 households in the Alpes-Maritimes department lost electricity after a high-voltage line fell Saturday morning. Police are investigating possible arson. Cannes Film Festival organizers confirmed the outage affected the early activities of Saturday and said the Palais des Festivals had switched to an independent power supply. Power was restored around 3 p.m., prompting cheers as music resumed along the beachfront.",
      "publishedAt": "2025-05-24T12:11:20Z",
      "title": "Power outage disrupts final day of Cannes Film Festival, police investigate possible arson",
      "url": "https://apnews.com/article/cannes-film-power-outage-france-1747c2b19ae0eb92e5d7a6b21accdf68",
      "urlToImage": "https://dims.apnews.com/dims4/default/765bd93/2147483647/strip/true/crop/7929x4460+0+413/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2F6b%2Fc3c157c5c0463b299e8f4d6748cb%2F016e4d50e1e94445b14c5f4b2aab6579"
    },
    {
      "author": "Sam Mednick, Samy Magdy",
      "description": "Several Palestinians and Israeli soldiers say troops are systematically forcing Palestinians to act as human shields in Gaza, sending them into buildings and tunnels to check for bombs and gunmen. They say the practice has become ubiquitous over 19 months of war. Israel’s military says it prohibits using civilians as shields, a practice it's long accused Hamas of using. It says it’s investigating a handful of cases but wouldn’t give details. Seven Palestinians described to The Associated Press being used as shields in Gaza and the occupied West Bank. One said he was beaten, bound and blindfolded. Two Israeli solders also described using human shields and that derogatory terms like mosquito were used to refer to the Palestinians.",
      "publishedAt": "2025-05-24T05:14:46Z",
      "title": "Israel's use of human shields in Gaza is widespread, sources say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-army-human-shields-80f358dd2c87a1123f26ffada159701c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d900316/2147483647/strip/true/crop/1500x844+0+78/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fc0%2F4fad2f910044a37decd3f587f885%2Fe61c218e2cb544c196e80231a80dc353"
    },
    {
      "author": "Adithi Ramakrishnan",
      "description": "Skin experts say people of color still need to wear sunscreen. The melanin in darker skin offers some extra protection from the sun, but dermatologists say that isn’t enough on its own. Sunscreen does help prevent skin cancer, but the cancers affecting Black people tend not to be sun-related. Dermatologists say sunscreen is an additional protective layer that helps prevent a host of other skin problems including sunburns, rosacea and dark patches. It's recommended that people with darker skin use at least SPF 30 sunscreen, reapplying every two hours.",
      "publishedAt": "2025-05-24T13:00:06Z",
      "title": "You should wear sunscreen even if you have darker skin. Here's why",
      "url": "https://apnews.com/article/sunscreen-for-dark-skin-tones-cccd4a0c1cea4e4a5ca6a67c00a5b5c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/66b86e1/2147483647/strip/true/crop/2580x1451+0+134/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fc4%2F5ffee7ffb933a0470e32784141e4%2F1d7d09556cd448bc858a9405b9103866"
    },
    {
      "author": null,
      "description": "Authorities say a stabbing attack at the busy central station in the German city of Hamburg left multiple people injured, some of them in life-threatening condition. Police said a woman was arrested as the suspect on Friday and was believed to have acted alone. The attacker targeted people on a platform in the station at around 6 p.m., according to police. Police said there was no immediate indication of any political motive, and investigators were looking into whether the suspect may have been mentally ill.",
      "publishedAt": "2025-05-23T17:20:10Z",
      "title": "A stabbing at Hamburg's central train station causes multiple injuries. A woman is arrested",
      "url": "https://apnews.com/article/stabbing-hamburg-train-station-aa0c9d31a07e6055cf465986cbe578d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a34bd0/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F90%2Fb9087147df661637cb56cc1c8cdd%2Fcfc82d09d2f14b3cb8b86d2920e5fd25"
    },
    {
      "author": "Julie Watson",
      "description": "The music agency Sound Talent Group says three of its employees died on the private plane that crashed into a San Diego neighborhood on Thursday. The music agency says the dead include Dave Shapiro, the agency’s co-founder. Shapiro is listed as the owner of the plane and has a pilot’s license. Sound Talent Group has represented artists including Hanson, Sum 41 and Vanessa Carlton. The agency didn’t share the names of the other two employees who were killed. The private jet crashed early Thursday into a neighborhood of U.S. Navy-owned housing in San Diego during foggy weather, igniting at least one home and numerous vehicles parked on the street.",
      "publishedAt": "2025-05-22T12:37:03Z",
      "title": "3 people dead after small plane crashes into San Diego neighborhood",
      "url": "https://apnews.com/article/plane-crash-san-diego-5e465454fc0282a81adafc1bfdc142a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/7616bde/2147483647/strip/true/crop/4619x2598+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2F7d%2F245e1c081dc1ce790684553dacb3%2F0137346332ce469b9dc66cd844192eef"
    },
    {
      "author": "Steve Karnowski",
      "description": "Former Minneapolis Police Chief Medaria Arradondo says he wishes he had moved faster to change the culture of his department before the murder of George Floyd, which happened five years ago Sunday. Arradondo, the city's first Black police chief, told The Associated Press he also wishes he had done more to elevate the community voices demanding change. He recently published a book, “Chief Rondo: Securing Justice for the Murder of George Floyd.” He closes it with a letter to Floyd’s daughter, Gianna in which he says something she hasn't heard from the former officers convicted in Floyd’s death: “I'm sorry.”",
      "publishedAt": "2025-05-24T04:04:50Z",
      "title": "Ex-Minneapolis police chief recalls 'absolutely gut-wrenching' moment of seeing George Floyd video",
      "url": "https://apnews.com/article/george-floyd-murder-minneapolis-police-chief-rondo-1e4a3e3102c5a5315d0ef89177fb8e2e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b51598a/2147483647/strip/true/crop/3130x1761+0+163/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2Fcd%2Fc8a2a923d11cf3bb07a6fe02f547%2F6a3af5f246524f55803ace1e9eaffd07"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}