{
  "articles": [
    {
      "author": "Colleen Slevin, Eric Tucker",
      "description": "Authorities say a man who wounded 12 people in an attack on a group holding their weekly demonstration for the release of Israeli hostages in Gaza had planned to kill them all but appeared to have second thoughts. They say Mohamed Sabry Soliman had 18 Molotov cocktails but threw just two during Sunday’s attack in which he yelled “Free Palestine. The two incendiary devices he did throw into the group of about 20 people were enough to wound more than half of them, and authorities say he expressed no regrets about the attack. Federal and state prosecutors have filed separate criminal cases against Soliman, charging him with a hate crime and attempted murder, respectively.",
      "publishedAt": "2025-06-03T05:03:34Z",
      "title": "Boulder attacker planned to kill demonstrators but got scared, police say",
      "url": "https://apnews.com/article/molotov-cocktails-boulder-attack-injured-f2af62386989f6b79a5e1844a2c9dce5",
      "urlToImage": "https://dims.apnews.com/dims4/default/05b23bd/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F40%2Fb4aa5fe3bf11f5ae8518bbec1ff7%2F523bb0e61f474bcab0871746f0b0c143"
    },
    {
      "author": "Jonathan J. Cooper, Chris Megerian",
      "description": "Elon Musk has blasted President Donald Trump’s “big, beautiful bill” of tax breaks and spending cuts as a “disgusting abomination.\" The tech billionaire's comments on Tuesday test his own influence over the Trump-led Republican Party. Musk targeted Trump’s top congressional priority just days after the president gave him a celebratory Oval Office sendoff marking the end of Musk’s role leading the Department of Government Efficiency. Musk’s business interests stand to lose from Trump’s bill, which would slash funding for electric vehicles and related technologies.",
      "publishedAt": "2025-06-03T21:51:56Z",
      "title": "Elon Musk calls Trump's tax break bill an 'abomination'",
      "url": "https://apnews.com/article/elon-musk-trump-tax-spending-bill-abomination-157b8733b60c343a5f8e551ffc887bf3",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a7f11a/2147483647/strip/true/crop/5228x2941+0+273/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F93%2F4e3fc68dff3b0e29b00d977655d7%2F4fdd787f13a648bab59d08b08287a120"
    },
    {
      "author": "Hyung-Jin Kim, Kim Tong-hyung",
      "description": "Millions of South Koreans are voting for a new president in a snap election triggered by the ouster of Yoon Suk Yeol, a conservative who faces a criminal trial over his short-lived imposition of martial law in December. Pre-election surveys suggest liberal Lee Jae-myung appears headed for an easy win in Tuesday’s election, riding on deep public frustration over the conservatives in the wake of Yoon’s martial law debacle. Conservative candidate Kim Moon Soo has struggled to restore public confidence. The winning candidate will be immediately sworn in as president Wednesday for a full, single five-year term.",
      "publishedAt": "2025-06-02T21:06:57Z",
      "title": "South Koreans vote for new president in wake of Yoon's ouster over martial law",
      "url": "https://apnews.com/article/south-korea-election-da088cf36a61641e23795688df01ee01",
      "urlToImage": "https://dims.apnews.com/dims4/default/76f35dc/2147483647/strip/true/crop/7635x4295+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F82%2Fc476c0e4304ebd399d5a35a7114b%2Fa3567d0a111e4554b2d565c2948fb367"
    },
    {
      "author": "Illia Novikov",
      "description": "Ukraine President Volodymyr Zelenskyy described a Russian attack on Sumy city center as “brutal.” “That’s all you need to know about Russia’s ‘desire’ to end this war,” Zelenskyy wrote in a post on Telegram. The attack on Tuesday came a day after direct peace talks made no progress on ending the 3-year war. Sumy authorities said at least three people were killed when a barrage of rockets struck apartment buildings and a medical facility. The war has killed more than 12,000 Ukrainian civilians, according to the United Nations, as well as tens of thousands of soldiers on both sides.",
      "publishedAt": "2025-06-03T10:09:37Z",
      "title": "Zelenskyy condemns 'brutal' Russian rocket attack after 3 killed in Ukrainian city",
      "url": "https://apnews.com/article/russia-ukraine-sumy-attack-zelenskyy-a6a513e388768e1d5179498302945bd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/a3b67b5/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F13%2Fb388154d2f84e234aeb2228a80f3%2Fa57e3bbc50b34c3ead49c4c57bf51efc"
    },
    {
      "author": "Mohammad Jahjouh, Samy Magdy",
      "description": "Palestinian health officials and witnesses say Israeli forces fired on people as they headed toward an aid distribution site Tuesday, killing at least 27, in the third such incident in three days. The army said it fired “near a few individual suspects” who left the designated route, approached its forces and ignored warning shots. The near-daily shootings have come after an Israeli and U.S.-backed foundation established aid distribution points inside Israeli military zones, a system it says is designed to circumvent Hamas. The United Nations has rejected the new system, saying it doesn’t address Gaza’s mounting hunger crisis and allows Israel to use aid as a weapon. The Israeli military said it was looking into reports of casualties on Tuesday.",
      "publishedAt": "2025-06-03T05:15:25Z",
      "title": "Gaza officials say Israeli forces killed 27 heading to aid site. Israel says it fired near suspects",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-03-2025-24ce3d395c7058362e650f2330a6476f",
      "urlToImage": "https://dims.apnews.com/dims4/default/002d4b4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F0d%2F28bb1c8d93e97cd8c5f4db07f75e%2F5da0ac1f57204ac9ba1c2df2b06dc25f"
    },
    {
      "author": "Jim Mustian, Jack Brook",
      "description": "A man who identifies himself as New Orleans jail escapee Antoine Massey released videos on social media while still on the run from authorities. And that led to a police raid that failed to recapture him. A senior law enforcement official says authorities were so convinced about the authenticity of the videos that they carried out a search late Monday of a New Orleans home in which they believe they were filmed. The official said Massey was not at the home, but authorities did locate some clothing they believe he wore during the filming. The official spoke on condition of anonymity because he was not authorized to publicly discuss the investigation.",
      "publishedAt": "2025-06-03T18:35:26Z",
      "title": "New Orleans jail escapee releases videos, prompting search of home where they were made, source says",
      "url": "https://apnews.com/article/new-orleans-jailbreak-video-fugitive-antoine-massey-83c223cd32922f0074305a0544bf1aec",
      "urlToImage": "https://dims.apnews.com/dims4/default/538c806/2147483647/strip/true/crop/3704x2084+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F90%2Ffe69f4f812eeb34e6b650c883fb9%2Fc02be9f5354540d08e3b6070e3fa5a2d"
    },
    {
      "author": "Andrew DeMillo",
      "description": "Arkansas authorities have released a photo rendering of a convicted murderer and former police chief known as the “Devil in the Ozarks” who escaped from prison. The Arkansas Department of Corrections said Tuesday the rendering shows what 56-year-old Grant Hardin may look like more than a week after his escape from the Calico Rock prison. Hardin was serving sentences for rape and murder when he escaped May 25. Authorities have said he donned an outfit designed to look like a law enforcement uniform. Police continued to search the north-central Arkansas region for Hardin.",
      "publishedAt": "2025-06-03T22:26:46Z",
      "title": "Arkansas authorities release photo rendering of 'Devil in the Ozarks' as manhunt continues",
      "url": "https://apnews.com/article/devil-ozarks-calico-rock-hardin-10382e1c29c844b9a06b2b66bda9d09e",
      "urlToImage": "https://dims.apnews.com/dims4/default/f38796b/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F4f%2Fd646f6c4030c19617c330fb0c613%2F0c1c605ae3c84a5fa2ba6e9a063aa86d"
    },
    {
      "author": "Michael Kunzelman",
      "description": "A judge says the federal Bureau of Prisons must keep providing hormone therapy to hundreds of transgender inmates following an executive order signed by President Donald Trump that led to a disruption in medical treatment. U.S. District Judge Royce Lamberth in Washington said Tuesday a federal law prohibits prison officials from arbitrarily depriving inmates of medications the bureau's own medical staff deems appropriate. The judge says the transgender inmates who sued to block Trump’s order are trying to lessen the anguish caused by their gender dysphoria. The Republican president’s order required the bureau to revise its medical care policies so federal funds aren’t spent for \"conforming an inmate’s appearance to that of the opposite sex.”",
      "publishedAt": "2025-06-03T17:12:35Z",
      "title": "US prisons must keep providing hormone therapy to transgender inmates",
      "url": "https://apnews.com/article/transgender-prison-inmates-hormone-therapy-d07dc644d3eb29d847de92cc09f1284d",
      "urlToImage": "https://dims.apnews.com/dims4/default/23afb18/2147483647/strip/true/crop/3878x2181+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2F35%2F015751a2361522fb0c1990bd08dc%2F1aae0ef6f4444cdd859f65263795a12e"
    },
    {
      "author": "Brian Mahoney",
      "description": "The New York Knicks have fired coach Tom Thibodeau, just days after their first trip to the Eastern Conference finals in 25 years. The Knicks were eliminated by the Indiana Pacers with a loss in Game 6 on Saturday night. They then decided to move on from Thibodeau, who led them to the postseason in four of his five seasons in New York. The decision was made by team president Leon Rose with approval from owner Jim Dolan, according to the person who spoke to The Associated Press on condition of anonymity Tuesday.",
      "publishedAt": "2025-06-03T18:56:41Z",
      "title": "Knicks fire coach Tom Thibodeau, AP source says",
      "url": "https://apnews.com/article/knicks-coach-thibodeau-fired-7f0b4335a3833f9be697cec148993639",
      "urlToImage": "https://dims.apnews.com/dims4/default/021790b/2147483647/strip/true/crop/3736x2102+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F7d%2Fafc78601f91f495a2fe62fcd5f8e%2Ffd1a3ae972264b218fddbff71e84d180"
    },
    {
      "author": "Jennifer Peltz",
      "description": "Closing arguments are underway at Harvey Weinstein's New York sex crimes retrial. His lawyer portrayed Weinstein Tuesday as the falsely accused “poster boy” of the #MeToo era. A prosecutor, on the other hand, said the former movie mogul preyed on less-powerful women he thought would never speak up. Closing arguments are due to conclude Wednesday. The majority-female jury is expected to start deliberations at some point in the day. Weinstein has pleaded not guilty to raping a woman in 2013 and forcing oral sex on two others, separately, in 2006.",
      "publishedAt": "2025-06-03T22:36:42Z",
      "title": "Harvey Weinstein's retrial nears end as lawyers argue: sexual predator or #MeToo 'poster boy'?",
      "url": "https://apnews.com/article/harvey-weinstein-metoo-sexual-assault-retrial-0233591e63b798492bde1b3f8e036a7c",
      "urlToImage": "https://dims.apnews.com/dims4/default/20cd26f/2147483647/strip/true/crop/5245x2950+0+273/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2F8d%2F8793d269cde2872af5593029e10b%2F306e4cf890ab47c88b000ed8f0dba6ab"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}