{
  "articles": [
    {
      "author": "HOLLY MEYER and TIFFANY STANLEY",
      "description": "For conservative, anti-abortion Christians, former President Donald Trump delivered in four years what no other Republican before him had been able to do: A conservative majority U.S.",
      "publishedAt": "2024-04-08T20:50:54Z",
      "title": "Conservative Christians praise Trump's anti-abortion record but say he's stopped short of the goal",
      "url": "https://apnews.com/d9a0286c809da48d65e5349cad8d1209",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96a900dfeedf43fdaa57e2c39bf079af/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A New York appeals court judge on Monday rejected Donald Trump's bid to delay his April 15 hush money criminal trial while he mounts a last-minute fight to move the case out of Manhattan, foiling the former president’s latest attempt to put off the historic trial.",
      "publishedAt": "2024-04-08T18:07:48Z",
      "title": "New York appeals judge rejects Donald Trump’s request to delay his April 15 hush money trial",
      "url": "https://apnews.com/6abe221a7cb2ea670eb3ed1a7a134643",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37269a764ea5429e8a01c13ccfa6808b/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "MESQUITE, Texas (AP) — A chilly, midday darkness fell across North America on Monday as a total solar eclipse raced across the continent, thrilling those lucky enough to behold the spectacle through clear skies.",
      "publishedAt": "2024-04-08T05:00:20Z",
      "title": "Total solar eclipse wows North America. Clouds part just in time for most",
      "url": "https://apnews.com/a667cf827dd4d78d1f41fdd5483e3508",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/654ff42378a840adba75efe67979a67d/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "DALLAS (AP) — Millions across North America witnessed the moon block out the sun during a total solar eclipse Monday.The eclipse’s path of totality stretched from Mazatlán, Mexico to Newfoundland, an area that crosses 15 U.S.",
      "publishedAt": "2024-04-08T19:09:04Z",
      "title": "AP PHOTOS: Total solar eclipse sweeps across North America",
      "url": "https://apnews.com/0a07725f59906849b00949e43177e6d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6155593cbee04ee084e7b68493575fad/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Stunned Palestinians found their home city unrecognizable Monday as they filtered in to salvage what they could from the vast destruction left by Israeli troops who withdrew from southern Gaza's Khan Younis a day earlier after months of fighting and bombardment.",
      "publishedAt": "2024-04-08T09:32:27Z",
      "title": "Palestinians returning to Khan Younis after Israeli withdrawal find an unrecognizable city",
      "url": "https://apnews.com/c8776b6a074cd182d0641214f5f352d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e047fe248ee4ea4bc0fb073ec5cfc3e/1920.jpeg"
    },
    {
      "author": "ERIC OLSON",
      "description": "The National Association of Intercollegiate Athletics announced a policy Monday that all but bans transgender athletes from competing in women's sports at its 241 mostly small colleges across the country.",
      "publishedAt": "2024-04-08T17:59:17Z",
      "title": "NAIA all but bans transgender athletes from women's sports. NCAA vows to ensure 'fair competition'",
      "url": "https://apnews.com/ad422f3a86ebcc4db618750c6a5d1c5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9388cbd378cd45579e44111b19e6763d/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The Vatican on Monday declared gender-affirming surgery and surrogacy as grave violations of human dignity, putting them on par with abortion and euthanasia as practices that it said reject God’s plan for human life.",
      "publishedAt": "2024-04-08T10:02:21Z",
      "title": "Vatican blasts gender-affirming surgery, surrogacy and gender theory as violations of human dignity",
      "url": "https://apnews.com/3f84d8eb97f045b0cfb0ec1efa4e614e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42356152b6a24e3f901afdca1e4f28bb/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and COLLIN BINKLEY",
      "description": "MADISON, Wis. (AP) — President Joe Biden said Monday that more than 30 million borrowers would see “life-changing” relief from his new plan to ease their student loan debt burdens, a fresh attempt by the Democratic president to follow through on a campaign pledge that could buoy his standing with younger voters.",
      "publishedAt": "2024-04-08T04:08:04Z",
      "title": "Biden promotes 'life-changing' student loan relief in Wisconsin as he rallies younger voters",
      "url": "https://apnews.com/069d64e7e6fc4edd967adf6bc5f7e699",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e2a465880324a74a5471fd063c857d1/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and GABRIELA MOLINA",
      "description": "QUITO, Ecuador (AP) — While world leaders have expressed shock and bewilderment over Ecuadorian President Daniel Noboa’s decision to raid Mexico’s embassy last Friday, the extraordinarily unusual move — and Noboa's relative silence about it — is unlikely to hurt him with his constituents.",
      "publishedAt": "2024-04-08T21:26:32Z",
      "title": "Ecuadorians wanted an action man. President Noboa has fulfilled that role — embassy raid included",
      "url": "https://apnews.com/0abd04431a9ac83d561bcfdc4a8557bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a07745fff6624acf807bf39ea8c9d5b2/3000.jpeg"
    },
    {
      "author": "AARON BEARD",
      "description": "GLENDALE, Ariz. (AP) — The NCAA Tournament has reached its finish line, down to one game pairing the two best teams that routinely win in romps and boasting a marquee post matchup that features a two-time national player of the year.",
      "publishedAt": "2024-04-07T23:29:57Z",
      "title": "UConn, Purdue set to collide in NCAA title game after dominating in a romp-filled March Madness",
      "url": "https://apnews.com/01cfcfa75a4c098c53872f5ec6ecc19d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b39f77bb27444dfafe0b59fbd3336f2/2047.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}