{
  "articles": [
    {
      "author": "PAOLA FLORES and MEGAN JANETSKY",
      "description": "LA PAZ, Bolivia (AP) — Armored vehicles rammed into the doors of Bolivia’s government palace Wednesday in an apparent coup attempt, but President Luis Arce vowed to stand firm and named a new army commander who ordered troops to stand down.",
      "publishedAt": "2024-06-26T20:00:23Z",
      "title": "Military flees Bolivia government palace after coup attempt fails, general taken into custody",
      "url": "https://apnews.com/028cd88f3be1fb02164c05deb0faa099",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2077431c68794695801985e5f11eeeea/1920.jpeg"
    },
    {
      "author": null,
      "description": "LA PAZ, Bolivia (AP) — An apparent failed coup attempt erupted Wednesday in Bolivia, where armored vehicles rammed into the doors of the government palace and President Luis Arce said the country stood firm against attacks on democracy.",
      "publishedAt": "2024-06-26T21:09:58Z",
      "title": "The Latest | Bolivian army general apparently behind failed coup attempt has been arrested",
      "url": "https://apnews.com/38239d9c37249724fc7393f3a1574adf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcab08687b3a4c2b854b6e84fb8942b2/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court appears poised to allow emergency abortions in Idaho when a pregnant patient’s health is at serious risk, according to a copy of the opinion briefly posted on the court's website Wednesday and obtained by Bloomberg News.",
      "publishedAt": "2024-06-26T17:22:39Z",
      "title": "Justices seem set to allow emergency abortions in Idaho for now, a prematurely posted opinion says",
      "url": "https://apnews.com/fda6b6b8cefd026dea95011dfcf11426",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51db272fa36a485b9d0d0118d6cfa62a/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Wednesday sided with the Biden administration in a dispute with Republican-led states over how far the federal government can go to combat controversial social media posts on topics including COVID-19 and election security.",
      "publishedAt": "2024-06-26T14:04:25Z",
      "title": "The Supreme Court rules for Biden administration in a social media dispute with conservative states",
      "url": "https://apnews.com/453b6ae8794548f960c4ebf72a534aff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b89b6febe23942afaf37285b4bbc35a9/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — What people remember from Joe Biden and Donald Trump’s first debate four years ago are likely the interruptions, the shouting and the “will you shut up, man?”",
      "publishedAt": "2024-06-26T04:03:56Z",
      "title": "Biden and Trump are set to debate. Here's what their past performances looked like",
      "url": "https://apnews.com/a3b65b133c7e7a7d29450a4ffa28d85f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e81dd8ec0427450596858f6ab38d4cb1/3000.jpeg"
    },
    {
      "author": "RICK RYCROFT and ROD McGUIRK",
      "description": "CANBERRA, Australia (AP) — WikiLeaks founder Julian Assange returned to his homeland Australia aboard a charter jet and raised a celebratory clenched fist as his supporters cheered on Wednesday, hours after pleading guilty to obtaining and publishing U.S.",
      "publishedAt": "2024-06-26T09:41:57Z",
      "title": "WikiLeaks founder Julian Assange returns to Australia a free man after US legal battle ends",
      "url": "https://apnews.com/7daeb8f54c0604fb0e78c0b171046013",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d421e67ed464b5793be1776b051a92a/1920.jpeg"
    },
    {
      "author": "EVELYNE MUSAMBI",
      "description": "NAIROBI, Kenya (AP) — Kenya's president said on Wednesday he won't sign into law a finance bill proposing new taxes that prompted thousands of protesters to storm the parliament the previous day, leaving several people killed as police opened fire.",
      "publishedAt": "2024-06-26T07:39:47Z",
      "title": "Kenya's president says he won't sign a finance bill that led protesters to storm the parliament",
      "url": "https://apnews.com/3378f8fd31402002cc5b3c8dfeff6f2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d6c9ae83a0446d0891f7cb6c777379e/1920.jpeg"
    },
    {
      "author": "SOPHIA TAREEN and KATHLEEN FOODY",
      "description": "WAUKEGAN, Ill. (AP) — The man accused of killing seven people and injuring dozens more at a 2022 Independence Day parade in a Chicago suburb rejected a deal requiring him to plead guilty to seven charges of murder Wednesday in a stunning courtroom scene just days before the second anniversary of the attack.",
      "publishedAt": "2024-06-26T04:04:48Z",
      "title": "Illinois man rejects deal to plead guilty to 7 murder charges in shooting at 2022 July Fourth parade",
      "url": "https://apnews.com/49f8c726d5a157b05f6f86ac3ed3a5b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20aa1c212fad4eaaa223dbf3e7eb67c9/3000.jpeg"
    },
    {
      "author": "PETER SMITH and DAVID CRARY",
      "description": "Sean Rowe, a 49-year-old bishop from western Pennsylvania, on Wednesday became the youngest person ever elected as leader of the Episcopal Church.He immediately issued a sobering call for the church, which has faced division and chronic membership loss, to confront an “existential crisis” that he compared with the steel industry collapse in his native Rust Belt.",
      "publishedAt": "2024-06-26T12:02:43Z",
      "title": "Pennsylvania bishop Sean Rowe elected new leader of Episcopal Church. He's the youngest since 1789",
      "url": "https://apnews.com/ea10f967d5f7e8464bce149a0da9bcb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cf6c1b6c8fe4ab987a838a4ca06480e/2448.jpeg"
    },
    {
      "author": "WAYNE PARRY",
      "description": "FREEHOLD, N.J. (AP) — Fighting brain cancer, little Giada Demma was lying in her pediatric hospital bed, her tiny body virtually swimming in a drab green hospital gown.Her cousin Giuliana Demma remembers looking at the 1-year-old and thinking how sad the scene was: a small child awash in an ugly gown several sizes too big for her.",
      "publishedAt": "2024-06-26T04:10:44Z",
      "title": "Baby cousin with cancer inspires girls to sew hospital gowns for sick kids across U.S. and Africa",
      "url": "https://apnews.com/81827b14aab133b45cdbeee17e71a1bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bccec918acf445aebf8159206e20edaa/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}