{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and MARK SCOLFORO",
      "description": "ALTOONA, Pa. (AP) — The gun found on the man charged with killing United Healthcare’s CEO matched shell casings found at the site of the shooting, New York City’s police commissioner said Wednesday as authorities scrutinized evidence and the suspect's experiences with the victim's industry.",
      "publishedAt": "2024-12-11T05:07:34Z",
      "title": "Gun found on suspect in killing of UnitedHealthcare CEO matches shell casings at scene, police say",
      "url": "https://apnews.com/64ba21747f41c3a81f661900e797b6d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f18a92bf82ff45728637089b785bba40/1920.jpeg"
    },
    {
      "author": "MIKE CATALINI",
      "description": "Is he a hero? A killer? Both? About the same time the #FreeLuigi memes featuring the mustachioed plumber from “Super Mario Brothers” mushroomed online this week, commenters shared memes showing Tony Soprano pronouncing Luigi Mangione, the man charged with murdering the UnitedHealthcare CEO in Manhattan, a hero.",
      "publishedAt": "2024-12-11T19:33:55Z",
      "title": "Arguments over whether Luigi Mangione is a 'hero' offer a glimpse into an unusual American moment",
      "url": "https://apnews.com/3a8c64a0bc412e0eeb84bca0c99b6e67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5c32f18582444ae8fcabe7173c91f9e/1741.jpeg"
    },
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Donald Trump doesn't think much of Joe Biden's foreign policy record. The Republican president-elect frequently casts the outgoing Democratic president as a feckless leader who shredded American credibility around the world during his four-year term.",
      "publishedAt": "2024-12-11T18:22:44Z",
      "title": "The Trump and Biden teams insist they're working hand in glove on foreign crises",
      "url": "https://apnews.com/d9bdefb745fc3a54b9f32e8e690bf04c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4c1454534d741918de3049a4cafda37/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — FBI Director Christopher Wray told bureau workers Wednesday that he plans to resign at the end of President Joe Biden's term in January, an announcement that came a week and a half after President-elect Donald Trump said he would nominate loyalist Kash Patel for the job.",
      "publishedAt": "2024-12-11T19:21:25Z",
      "title": "FBI Director Wray says he intends to resign before Trump takes office in January",
      "url": "https://apnews.com/ca7553c92819b5487ce12de252a5a543",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef37b74d26b44cdeb2337417ce6f1ab4/1920.jpeg"
    },
    {
      "author": "HUSSEIN MALLA and OMAR ALBAM",
      "description": "DAMASCUS (AP) — Mohammad Chaeeb spoke softly into his phone, telling a relative the grim news: He found his brother at the morgue.“I saw him and said my goodbyes,” he said. His gaze lingered on the blackened body of Sami Chaeeb, whose teeth were bared and whose eye sockets were empty.",
      "publishedAt": "2024-12-11T18:01:52Z",
      "title": "Syrians flock to morgues looking for loved ones who perished in Assad's prisons",
      "url": "https://apnews.com/c64f6f4f3e03e7d063dc90f03ccd4c4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18c243fb51664e4c87e32e8a15fcca88/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — Russia could launch its lethal new intermediate-range ballistic missile against Ukraine again soon, the Pentagon said Wednesday, as both sides wrestle for a battlefield advantage that will give them leverage in any negotiations to end the nearly 3-year war.",
      "publishedAt": "2024-12-11T14:33:57Z",
      "title": "US warns Russia may be ready to use new lethal missile against Ukraine again in 'coming days'",
      "url": "https://apnews.com/28bf28d09087844544874df151bd3a9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cdc242c49684c10a61fe1d24cd69d87/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes pounded the Gaza Strip overnight and into Wednesday, with one attack ripping through a home where displaced people were sheltering in the isolated north.",
      "publishedAt": "2024-12-11T06:36:53Z",
      "title": "Israeli strikes on Gaza kill at least 33 including children, Palestinian medics say",
      "url": "https://apnews.com/52692a401ef2fb7e66c0d4d00633bd10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28b94dfc47e44e2987f9dd91cec8c0cf/2478.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — Hannah Kobayashi, the missing Hawaii woman whose disappearance prompted a massive search and a missing persons investigation in Los Angeles, has been found safe, police said Wednesday.",
      "publishedAt": "2024-12-11T21:19:15Z",
      "title": "Hannah Kobayashi, missing Hawaii woman whose disappearance prompted a massive search, is found safe",
      "url": "https://apnews.com/f2f0dc2855b4a2a020b6e5623ef9ecbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9842ce74ef4d4c7e9a570f88f365c67f/3000.jpeg"
    },
    {
      "author": "TODD RICHMOND",
      "description": "GREEN LAKE, Wis. (AP) — A Wisconsin man who faked his own drowning and left his wife and three children for Eastern Europe willingly returned to the U.S.",
      "publishedAt": "2024-12-11T03:08:10Z",
      "title": "Wisconsin kayaker who faked his death and fled the country is charged after returning to US",
      "url": "https://apnews.com/fededd01e567675af37a69c81eda5c75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97442054a14842d0ba84ce4245123f64/1920.jpeg"
    },
    {
      "author": "GRAHAM DUNBAR",
      "description": "ZURICH (AP) — Saudi Arabia scored a major win in its campaign to attract major sports events to the kingdom when it was formally appointed as the 2034 World Cup host on Wednesday.",
      "publishedAt": "2024-12-11T22:06:56Z",
      "title": "Saudi Arabia will host the 2034 World Cup. But when exactly?",
      "url": "https://apnews.com/2b8bd39a2083ba14918d9d2263fa2fad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4219ae07f944e4b9fb6a8c34d0c2399/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}