{
  "articles": [
    {
      "author": null,
      "description": "Russia launched 550 drones and missiles across Ukraine overnight in the largest aerial assaults since the war began. The capital Kyiv was the primary target. At least 23 people were injured, and multiple residential buildings in the capital were damaged. Ukrainian air defenses shot down 270 targets and another 208 targets were lost from radar and presumed jammed, but dozens still struck or caused damage across the city. Fires and destruction were reported in at least five of Kyiv's 10 districts, and railway infrastructure was also hit. The attack came hours after President Donald Trump held a call with Russian President Vladimir Putin and made his first public comments on the U.S. decision to pause some shipments of weapons to Ukraine.",
      "publishedAt": "2025-07-04T06:33:48Z",
      "title": "Russia hits Ukraine with its largest aerial attack of the war",
      "url": "https://apnews.com/article/ukraine-russia-war-attack-missile-drone-58bc08ddcf1038fb409999c56b11e9fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a5c55e/2147483647/strip/true/crop/8056x4532+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F6e%2Fbf17c5f6f4da18799ea393da9514%2Fae1cabfc6cd8457fb86f8e98f8737c84"
    },
    {
      "author": null,
      "description": "Up all night, House Republicans voted pre-dawn to advance President Donald Trump’s tax and spending cuts package. The House is now starting a round of debates ahead of a final vote expected later Thursday morning. GOP leaders worked almost around the clock trying to persuade skeptical holdouts. Trump worked the phones as Republicans race to send the bill to his desk by the Fourth of July deadline. Speaker Mike Johnson had recalled lawmakers to Washington, eager to seize on the momentum of the 887-page bill's passage the day before in the Senate. Some GOP lawmakers are criticizing the legislation as straying from the party's fiscal goals. Johnson expects votes later Thursday morning.",
      "publishedAt": "2025-07-03T07:54:06Z",
      "title": "House GOP clears key hurdle on Trump's big bill, pushing it closer to vote",
      "url": "https://apnews.com/article/trump-big-beautiful-gop-taxes-ced365c347de9320eef2ccb8df16dda2",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f62811/2147483647/strip/true/crop/5803x3264+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F17%2F034bb11eaf5781d2c79435146a61%2F2a4fdc853eb544efaf189d0d42a565c6"
    },
    {
      "author": null,
      "description": "Republicans in Congress have muscled President Donald Trump’s tax and spending bill to passage. At nearly 900 pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations. The House approved the bill on Thursday, the final step necessary to get the bill to Trump's desk by the GOP’s self-imposed deadline of July 4th. The bill would make permanent many of the tax breaks passed in Trump's first term while also adding new ones, such as new tax deductions for tips, overtime, seniors and interest payments on auto loans.",
      "publishedAt": "2025-07-03T18:47:48Z",
      "title": "What's in Trump's big bill that passed Congress",
      "url": "https://apnews.com/article/what-is-republican-trump-tax-bill-f65be44e1050431a601320197322551b",
      "urlToImage": "https://dims.apnews.com/dims4/default/640fa02/2147483647/strip/true/crop/5876x3305+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2F4f%2F9b40c7c90634883fa7b2cbb22d9f%2F4848db0607744a889293d7af549eb407"
    },
    {
      "author": null,
      "description": "Israeli airstrikes killed 15 Palestinians in Gaza early on Friday, while a hospital said another 20 people died in shootings while waiting for aid. Meanwhile, the U.N. human rights office says it has recorded 613 killings in Gaza near humanitarian convoys and aid distribution points run by an Israeli-backed American organization since it first began operations in late May. Spokeswoman Ravina Shamdasani said the rights office was not able to attribute responsibility for the killings. But she said “it is clear that the Israeli military has shelled and shot at Palestinians trying to reach the distribution points” operated by the Gaza Humanitarian Foundation.",
      "publishedAt": "2025-07-04T09:30:40Z",
      "title": "UN records 613 killings in Gaza near humanitarian convoys or aid distribution points run by US group",
      "url": "https://apnews.com/article/mideast-wars-gaza-aid-hamas-ceasefire-c263f8ecf5f432f2da2bcbbd0938c623",
      "urlToImage": "https://dims.apnews.com/dims4/default/e273813/2147483647/strip/true/crop/7855x4418+0+409/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Fd0%2F301cf9d4a6d52e5ac6dbb893b817%2Fc72eeba4558d404e97c133c6bdec8145"
    },
    {
      "author": null,
      "description": "Famed Mexican boxer Julio César Chávez Jr. has been arrested for entering US illegally and will be deported to Mexico, where he faces organized crime charges, federal officials said Thursday. The arrest in Studio City, California, on Wednesday comes only days after the former middleweight champion fought in a match against Jake Paul in Anaheim, California. The Department of Homeland Security said Immigration and Customs Enforcement officers detained Chávez for overstaying a tourist visa. They said he also has an active arrest warrant in Mexico for involvement in organized crime and trafficking firearms, ammunition, and explosives and is believed to be an affiliate of the Sinaloa Cartel.",
      "publishedAt": "2025-07-03T18:54:25Z",
      "title": "ICE arrested Mexican boxer Julio César Chávez Jr. pending deportation",
      "url": "https://apnews.com/article/mexican-boxer-julio-cesar-chavez-arrested-deportation-e8f600abb9c7e5adfe60de8739fd12df",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b9fb42/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F73%2Fba004cedffa73ea13e7c85f69cd0%2Fad2448e99eca45d2bd604beb01c196e2"
    },
    {
      "author": null,
      "description": "Asian shares were mixed on Friday after U.S. stocks climbed further into record heights as the clock ticks on President Donald Trump’s July 9 tariff deadline. Japan’s Nikkei 225 fell 0.6% to 39,762.20 after earlier gains, while South Korea’s KOSPI index was down 1.2% to 3,078.31. Hong Kong’s Hang Seng index lost 0.6% to 23,914.44 while the Shanghai Composite index added 0.4% to 3,475.24. Australia’s S&P/ASX 200 rose 0.1% to 8,609.50. India’s Sensex index was up 0.1% to 83,288.73. On Thursday, after a report showed a U.S. job market stronger than Wall Street expected, the S&P 500 rose 0.8% and set an all-time high for the fourth time in five days. The Dow Jones Industrial Average added 344 points, or 0.8%, and the Nasdaq composite gained 1%.",
      "publishedAt": "2025-07-04T04:30:44Z",
      "title": "Asian shares are mixed as Trump’s tariff deadline looms",
      "url": "https://apnews.com/article/stock-markets-tariffs-deadline-6edfb5f2494b282fbe95f6587bdced97",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb36e92/2147483647/strip/true/crop/5332x2999+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F5f%2F560be955f84c2121f9addc2deb1a%2Fc93cc3bcd16344c0ae7da648c58ce2c3"
    },
    {
      "author": null,
      "description": "President Donald Trump will be in Iowa to kick off a year of patriotic festivities leading up to next year's 250th anniversary of American independence. Organizers see the coming year of festivities, which start Thursday, as a way to help unite a polarized country and bridge partisan divides. But a recent Gallup poll showed the widest partisan split in patriotism in over two decades, with only about a third of Democrats saying they are proud to be American compared with about 9 in 10 Republicans. As a candidate, Trump proposed a “Great American State Fair” in Iowa, but it will take place next year in Washington instead.",
      "publishedAt": "2025-07-03T04:14:55Z",
      "title": "Trump marks celebration of America's 250th anniversary in Iowa",
      "url": "https://apnews.com/article/trump-america-250th-birthday-iowa-e6fb5df832cdba107ae4e9c62f2577e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/58d5f27/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2F64%2F7c2f3c6202990b7d13194425ed3e%2F0a75ac31cfcb4be9b3cee59ae4183412"
    },
    {
      "author": null,
      "description": "The first group of immigrants has arrived at a new detention center deep in the Florida Everglades that officials have dubbed “Alligator Alcatraz.” Florida Republican Attorney General James Uthmeier said on social media Wednesday that “hundreds” of immigration detainees were to arrive at the center. Republican Gov. Ron DeSantis says the facility will have a capacity of about 3,000 detainees when fully operational. The center was built in eight days and features more than 200 security cameras, 28,000-plus feet of barbed wire and 400 security personnel. And the area features alligators, pythons and other dangerous wildlife.",
      "publishedAt": "2025-07-03T16:19:34Z",
      "title": "First immigration detainees arrive at Florida center in the Everglades",
      "url": "https://apnews.com/article/alligator-alcatraz-immigration-detainees-florida-56670910db4c88800d9df42ac3ce7f91",
      "urlToImage": "https://dims.apnews.com/dims4/default/57fe7f5/2147483647/strip/true/crop/3109x1749+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fee%2F60d4f5800e1763f0d60d8b02b717%2F566a4ef9fc4947eeb742172d69230479"
    },
    {
      "author": null,
      "description": "A strike by French air traffic controllers is disrupting travel. About 40% of flights at Paris airports are canceled, along with half of flights in Nice and 30% of flights in Marseille, Lyon and some other cities. The strike has affected tens of thousands of passengers during the busy summer travel season. Unions cite staff shortages and stricter monitoring measures as reasons for the strike. Ryanair reports canceling 400 flights, impacting 70,000 passengers, and has called for EU air traffic reforms. France’s transport minister criticizes the timing of the strike, calling it unacceptable during peak vacation travel.",
      "publishedAt": "2025-07-04T05:22:44Z",
      "title": "French airports are disrupted by a strike by air traffic controllers",
      "url": "https://apnews.com/article/france-strike-air-traffic-controllers-baa290e6594404bf260e8031b393edc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/c839d64/2147483647/strip/true/crop/4789x2694+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2Fb7%2F59ba8547ee3d31dcf625ccc2c134%2F72624fc1b3a74980ae12a7c4f6614f50"
    },
    {
      "author": null,
      "description": "States and rural health advocacy groups are sounding the alarm that Congress’ slashing of Medicaid will devastate already financially fragile rural hospitals. One analysis estimates more than 300 hospitals could be at risk of closing under the Republican measure to slash about $1 trillion in Medicaid funding over ten years. Rural hospitals rely heavily on Medicaid reimbursements and are already financially strained. While the measure includes $50 billion to help make up the loss to rural hospitals, advocates worry it won’t offset the funding shortfall. No state stands to lose more than Kentucky. One report estimates the state would lose a whopping $12.3 billion over 10 years.",
      "publishedAt": "2025-07-04T04:06:36Z",
      "title": "Republican bill slashing Medicaid could cause rural hospitals across the US to close",
      "url": "https://apnews.com/article/medicaid-tax-cuts-rural-hospitals-nebraska-kentucky-cf6bb787fc6a4d387c55d90051ff2f1f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ac4322/2147483647/strip/true/crop/2891x1626+0+151/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2Fcc%2F006255d6a58502e5944167a3931d%2Fa41f5baf6d2f4701bac541f5d1e5483e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}