{
  "articles": [
    {
      "author": null,
      "description": "UK police have arrested Andrew Mountbatten-Windsor, the former Prince Andrew, on suspicion of misconduct in public office. On Thursday, Thames Valley Police said they opened an investigation after assessing reports about his alleged contact with Jeffrey Epstein. Police did not name him, which follows U.K. practice, but they confirmed they arrested a man in his 60s. Police say they want to protect the integrity of the investigation. They also said the case drawed strong public interest and they planned to share updates at the right time. Pictures online also appeared to show police cars and officers outside his home.",
      "publishedAt": "2026-02-19T10:21:46Z",
      "title": "UK police arrest Andrew Mountbatten-Windsor for misconduct in public office",
      "url": "https://apnews.com/article/britain-epstein-andrew-former-prince-arrested-fb0b9e738bf7ede10651914ee3f3583d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a1374d/2147483647/strip/true/crop/5906x3935+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2F2c%2Ffb3ef81145cb9ee829890253e2be%2Fap26035407432236.jpg"
    },
    {
      "author": "Jill Lawless",
      "description": "The former Prince Andrew is the first senior British royal in modern history to be arrested by police. Andrew Mountbatten-Windsor was detained Thursday on suspicion of misconduct in public office, in an investigation stemming from his relationship with the late sex offender Jeffrey Epstein. He was born in 1960, the second child of Queen Elizabeth II and her husband Prince Philip. He spent 22 years in the Royal Navy, serving as a helicopter pilot during the 1982 Falklands War. Andrew was named Britain’s special representative for international trade in 2001. He was forced to step down from that role in 2011 amid growing concern about his friendship with Epstein. Last year that friendship cost him his royal title and honors.",
      "publishedAt": "2026-02-19T12:22:05Z",
      "title": "The former Prince Andrew went from helicopter pilot to trade envoy to royal pariah",
      "url": "https://apnews.com/article/andrew-mountbatten-windsor-profile-d64e61fd0214a68b9a05fc0da95d9486",
      "urlToImage": "https://dims.apnews.com/dims4/default/07a0fc5/2147483647/strip/true/crop/3674x2448+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2F47%2Fad347a8b9f811d1346d6868e0d05%2F9c30fb046b9841fa80bcf7ac7b76b101"
    },
    {
      "author": "Aamer Madhani, Matthew Lee",
      "description": "President Donald Trump is gathering with representatives from more than two dozen countries that have joined his Board of Peace —and several others that have opted not to. Thursday's inaugural meeting will focus on reconstruction for a war-battered Gaza. But ahead of the gathering, the Gaza ceasefire deal remains fragile and Trump’s expanded vision for the board has triggered fears that he's looking to create a rival to the United Nations. A senior Trump administration official said more than 40 countries and the European Union have confirmed they will send officials. Germany, Italy, Norway and Switzerland are among more than a dozen countries that have not joined the board but are expected to attend.",
      "publishedAt": "2026-02-19T05:03:49Z",
      "title": "What to expect from Trump's first Board of Peace meeting",
      "url": "https://apnews.com/article/trump-board-of-peace-first-meeting-22e587df67e27cd1e1d96e446cb88378",
      "urlToImage": "https://dims.apnews.com/dims4/default/f03bdbd/2147483647/strip/true/crop/5199x3464+160+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2F06%2F7ebcdae2b82a0024a239557c189e%2F058c57a2a15e4a13a9adc8151ab01004"
    },
    {
      "author": "Jeff Amy, Steve Peoples",
      "description": "President Donald Trump is weighing military action against Iran, leading an immigration crackdown, and teasing a federal takeover of state elections. But on Thursday, White House insists he will focus on the economy when he visits battleground Georgia. The trip aims to boost the Republican president’s political standing heading into the high-stakes midterm elections. The White House has long said the president would focus more on the economy, but recent months have been dominated by his immigration crackdown, global conflicts and his interest in nationalizing state elections, among other issues. Trump’s visit comes less than a month after federal agents seized voting records and ballots from Fulton County, home to the state’s largest concentration of Democrats.",
      "publishedAt": "2026-02-19T05:07:31Z",
      "title": "Trump heads to Georgia as Republicans look for midterm boost",
      "url": "https://apnews.com/article/trump-georgia-economy-midterm-elections-greene-29075b0f22be1569aafe144ab7ca025b",
      "urlToImage": "https://dims.apnews.com/dims4/default/b168798/2147483647/strip/true/crop/2895x1929+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Fe3%2F7285ca1105c04f4e7fa092ea032b%2Ff89e0206bc5748cbaaa79d85b1224a57"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States are both applying naval pressure to the talks over Tehran's nuclear program. Tehran held drills Thursday with Russia. Meanwhile, the Americans brought another aircraft carrier closer to the Mideast, the USS Gerald R. Ford. The movements of additional American warships and airplanes to the region don’t guarantee a U.S. strike on Iran. But it does give President Donald Trump the ability to carry out one should he choose to do so. Meanwhile, Iran struggles with unrest at home following its deadly crackdown on protests. Mourners are holding ceremonies honoring their dead.",
      "publishedAt": "2026-02-19T08:04:43Z",
      "title": "Iran and the US lean into gunboat diplomacy",
      "url": "https://apnews.com/article/iran-us-russia-drill-nuclear-talks-aircraft-carrier-0456903e0d7a24cfcdc33d53732dee2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/09e5af1/2147483647/strip/true/crop/4724x3148+2+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F1d%2F114777173880f03ca451fcd761a3%2Fd295d48c402440db8abee8c9da00efe3"
    },
    {
      "author": "Paul Wiseman",
      "description": "The U.S. trade deficit slipped modestly in 2025, a year in which President Donald Trump upended global commerce by slapping double digit tariffs on imports from most countries. The Commerce Department reported Thursday that the gap the between the goods and services the U.S. sells other countries and what it buys from them narrowed to just over $901 billion from $904 billion in 2024.",
      "publishedAt": "2026-02-19T13:41:34Z",
      "title": "US trade deficit declined in 2025, but gap for goods hits a record despite Trump tariffs",
      "url": "https://apnews.com/article/trump-trade-deficit-tariffs-china-9eb6bd10ff635d63e46ee99d34ce1d05",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc683c9/2147483647/strip/true/crop/4445x2962+363+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F1a%2F29267f7f3c71c865373f7a598f09%2F5eafc98b3b5b4ef2bd8de4644f64186e"
    },
    {
      "author": "Darlene Superville",
      "description": "A federal panel made up of President Donald Trump's appointees has unanimously approved his plan to build a massive ballroom on the site of the former White House East Wing. Approval came Thursday by the U.S. Commission of Fine Arts. The project is scheduled for additional discussion at a March 5 meeting of the National Capital Planning Commission, which is led by one of Trump’s top White House aides. The National Trust for Historic Preservation has sued in federal court to halt construction of the ballroom. A court decision in the case is pending.",
      "publishedAt": "2026-02-19T12:38:52Z",
      "title": "Trump's White House ballroom proposal is approved by federal fine arts commission",
      "url": "https://apnews.com/article/trump-white-house-ballroom-commission-fine-arts-f2a15d0b1c9c95f24816fe60b6b1ee5f",
      "urlToImage": "https://dims.apnews.com/dims4/default/00c815d/2147483647/strip/true/crop/5712x3806+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fc1%2Fd3501486da7a27a554604a043153%2Fb137d9e3cd244808a1d0de2e777b0714"
    },
    {
      "author": "Brooke Hess-homeier, Julie Watson, Hallie Golden",
      "description": "Authorities say the bodies of eight backcountry skiers have been found and one remains missing after an avalanche near Lake Tahoe in California. Search and rescue crews were dispatched to the Castle Peak area of the Sierra Nevada after a 911 call reporting an avalanche Tuesday morning. Six others were found alive. Heavy snow and the threat of additional avalanches slowed the rescue effort in the mountains near Castle Peak, northwest of Lake Tahoe. Authorities have told the families the mission has moved from rescue to recovery. They say the eight victims were found fairly close together, and that three of them were discovered by the skiers who survived.",
      "publishedAt": "2026-02-19T06:59:50Z",
      "title": "Some of 8 California avalanche victims had roots in Lake Tahoe",
      "url": "https://apnews.com/article/california-avalanche-tahoe-backcountry-skiers-dead-591d11d13b7e259f2e53784bf9835a98",
      "urlToImage": "https://dims.apnews.com/dims4/default/e727899/2147483647/strip/true/crop/1459x972+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F97%2F312bdd16f2e58082823ae47657b5%2F26de7ce2725c43fb9a3632c8dbc20331"
    },
    {
      "author": "Michael Casey, Kimberlee Kruesi",
      "description": "Moments after Robert Dorgan starting shooting family members at a hockey game, three people in the stands rushed toward the shooter. Among them was Michael Black, who recalled hearing the shots and lunging for Dorgan's gun. Black managed to catch his hand in the gun and jam it. Two others helped him subdue Dorgan, but not before the 56-year-old could reach for a second gun and die from a self-inflicted gunshot wound. The shooter's ex-wife Rhonda Dorgan and adult son Aidan Dorgan were killed Monday and three others were injured: Rhonda Dorgan’s parents, Linda and Gerald Dorgan; and a family friend, Thomas Geruso.",
      "publishedAt": "2026-02-19T16:31:55Z",
      "title": "How a group of courageous citizens helped stop the Rhode Island ice rink shooting",
      "url": "https://apnews.com/article/hockey-rink-shooting-hero-rhode-island-pawtucket-fcf58def325c4c6698775e5d46e260fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ce6bdb/2147483647/strip/true/crop/2274x1515+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fd3%2F69c8eb4185bae9ffadedaaf224c3%2Ff6229ce532be4bf0b9f85b7b3dc8fa01"
    },
    {
      "author": "Stan Choe",
      "description": "U.S. stocks are drifting lower, and the S&P 500 may be heading toward its first loss in four days. The index slipped 0.2% Thursday. The Dow Jones Industrial Average dipped 184 points, and the Nasdaq composite fell 0.1%. The company behind Booking.com and Priceline sank to one of the market's sharper losses as worries continue about whether AI competitors could steal away its customers. Such concerns have been rolling through Wall Street recently and hitting various industries. Oil prices climbed with worries about a potential conflict between the United States and Iran. Treasury yields held relatively steady.",
      "publishedAt": "2026-02-19T04:24:14Z",
      "title": "US stocks drift as oil prices rise on worries about a potential US-Iran conflict",
      "url": "https://apnews.com/article/stocks-markets-iran-ai-trump-9105f5156c294507738154a714dcd13d",
      "urlToImage": "https://dims.apnews.com/dims4/default/a882def/2147483647/strip/true/crop/4788x3190+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2Fbb%2F985d173782734e51e53538b82398%2F8241256a2ba943edb309b7312c49a808"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}