{
  "articles": [
    {
      "author": "CLAIRE RUSH, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — A mobile morgue unit arrived Tuesday to help Hawaii officials working painstakingly to identify the remains of people killed in wildfires that ravaged Maui, as the death rose above 100 and teams intensified the search for more dead in neighborhoods reduced to ash.",
      "publishedAt": "2023-08-15T05:10:19Z",
      "title": "Death toll from devastating Maui fire reaches 101, Hawaii governor says",
      "url": "https://apnews.com/c3da091a10e7aaa69022f002d3e241b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e73f57bccfbc4c329e11cbca1f15273e/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and LINLEY SANDERS",
      "description": "NEW YORK (AP) — After every new indictment, Donald Trump has boasted that his standing among Republicans only improves — and he has a point.Nearly two-thirds of Republicans — 63% — now say they want the former president to run again, according to new polling from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-08-16T04:04:00Z",
      "title": "Trump enjoys strong support among Republicans. The general election could be a different story",
      "url": "https://apnews.com/ddfd50492dc576c0c2ca2d1afe0e4639",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/effe9b6cc9a84b01877863595d3fe6d7/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and ERIC TUCKER",
      "description": "ATLANTA (AP) — Donald Trump and 18 allies were indicted in Georgia on Monday over their efforts to overturn his 2020 election loss in the state, with prosecutors using a statute normally associated with mobsters to accuse the former president, lawyers and other aides of a “criminal enterprise” to keep him in power.",
      "publishedAt": "2023-08-14T16:23:05Z",
      "title": "Trump and 18 allies charged in Georgia election meddling as former president faces 4th criminal case",
      "url": "https://apnews.com/d39562cedfc60d64948708de1b011ed3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7baad1574bfd44a58e432693f48b8667/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "ATLANTA (AP) — A day after the Jan. 6, 2021, attack on the U.S. Capitol, as the country was still reeling from the violent attempt to halt the transfer of presidential power, a local Republican Party official greeted a group of computer experts outside the election office in a rural county in south Georgia, where they were given access to voting equipment.",
      "publishedAt": "2023-08-15T19:03:41Z",
      "title": "Georgia election indictment highlights wider attempts to illegally access voting equipment",
      "url": "https://apnews.com/bc3db57cabd25fd8e335f85ed299e79c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2dd7a2ca32724c61919556b07f45b938/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — He says he won't sign the pledge required to participate, but former President Donald Trump's Republican rivals are actively preparing as if he will be onstage for the GOP's first 2024 presidential debate next week.",
      "publishedAt": "2023-08-15T14:21:02Z",
      "title": "Will Donald Trump show up at next week's presidential debate? GOP rivals are preparing for it",
      "url": "https://apnews.com/d3192137ee265d8455ff8af64a5f88ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f64539fcbc244881a8adb34d22abe724/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korea asserted Wednesday that a U.S. soldier who bolted across the heavily armed Korean border last month did so after becoming disillusioned with the inequality of American society and racial discrimination in its Army.",
      "publishedAt": "2023-08-15T21:57:29Z",
      "title": "North Korea asserts US soldier Travis King crossed border after becoming disillusioned with America",
      "url": "https://apnews.com/7b0b2f3b87f4cb9352c1cc458ab576b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c28a4cf8b6c143c7bf3935e22059c45f/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The International Criminal Court should prosecute Taliban leaders for a crime against humanity for denying education and employment to Afghan girls and women, the U.N.",
      "publishedAt": "2023-08-16T04:03:21Z",
      "title": "UN envoy says ICC should prosecute Taliban for crimes against humanity for denying girls education",
      "url": "https://apnews.com/d676898b186ea76f113fffda6540e1b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e6016ce303f40d7a3c6375bfa8f1f32/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A legal showdown over the derailed plea deal for Hunter Biden continued Tuesday as prosecutors asserted that an agreement on a gun charge is dead along with the rest of the deal as the case makes a major shift into a special counsel investigation.",
      "publishedAt": "2023-08-15T19:04:09Z",
      "title": "Prosecutors in the Hunter Biden case deny defense push to keep gun charge agreement in place",
      "url": "https://apnews.com/de3702ea46e9f544e69d6fd2e694dce8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0acd81aedc754c7592c2b3bfe3f16ab8/2344.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "Washington (AP) — Congressional leaders are pitching a stopgap government funding package to avoid a federal shutdown after next month, acknowledging the House and Senate are nowhere near agreement on spending levels to keep federal operations running.",
      "publishedAt": "2023-08-15T20:27:15Z",
      "title": "McCarthy floats stopgap funding to prevent a government shutdown at the end of next month",
      "url": "https://apnews.com/abbde0620a2058e304846a93834e9bd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acd863cd07744a5ab6afb0dd30a27674/3000.jpeg"
    },
    {
      "author": "JACK JEFFERY",
      "description": "CAIRO (AP) — Deadly clashes between rival militias in Libya's capital killed at least 27 people and left residents trapped in their homes on Tuesday, unable to escape the violence, medical authorities said.",
      "publishedAt": "2023-08-15T11:17:35Z",
      "title": "Deadly clashes between rival militias in Libya leave 27 dead, authorities say",
      "url": "https://apnews.com/6b79fc951a1bd4e3621ef59c3ad8301d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25876719ca3440cfb741cb615250a2d5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}