{
  "articles": [
    {
      "author": "TARA COPP, LOLITA C. BALDOR, ZEKE MILLER",
      "description": "President Donald Trump has signed an executive order directing Defense Secretary Pete Hegseth to revise the Pentagon’s policy on transgender troops. It is likely to set in motion a future ban on their military service. Trump had tried to impose a ban on transgender troops during his first term, but it was tangled up in the courts for years before being overturned by then-President Joe Biden shortly after he took office. Lawyers for transgender troops who challenged the ban in the courts during Trump’s first term have already pledged to fight the new ban.",
      "publishedAt": "2025-01-27T15:08:49Z",
      "title": "President Trump directs Pentagon to revise policy on transgender troops",
      "url": "https://apnews.com/article/hegseth-tuskegee-airmen-dei-pentagon-480d932c8bcb4c6056abe78e34010982",
      "urlToImage": "https://dims.apnews.com/dims4/default/11eba85/2147483647/strip/true/crop/6048x3402+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2Fc3%2Fde5078e2789034dc72094982b243%2F12d45a6e7eb24e418686cc51265878da"
    },
    {
      "author": "ELLEN KNICKMEYER, MATTHEW LEE",
      "description": "At least 56 senior officials in the top U.S. aid and development agency have been placed on leave amid an investigation into an alleged effort to thwart President Donald Trump’s orders. U.S. Agency for International Development acting head Jason Gray said Monday in an internal memo obtained by The Associated Press that the move was part of an investigation into possible efforts at the agency to thwart Trump's orders. A current official and a former official at USAID recounted the actions on condition of anonymity for fear of reprisal. The move comes as a sweeping foreign assistance funding freeze by Trump was beginning to shut down U.S.-funded projects around the world.",
      "publishedAt": "2025-01-28T02:19:47Z",
      "title": "Trump administration puts at least 56 senior USAID officials on leave",
      "url": "https://apnews.com/article/trump-usaid-leave-87704eee4897b24a79072e32e3df58a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ab7c96/2147483647/strip/true/crop/3766x2118+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2Fee%2F0997bcaf57345565945c51712359%2Fd3a4fab52dc143bc9473fc6c9b40ff39"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER",
      "description": "The Trump Justice Department says it has fired more than a dozen employees who worked on criminal investigations into President Donald Trump. The abrupt action targeting career prosecutors who worked on special counsel Jack Smith’s team is the latest sign of upheaval inside the Justice Department. It reflects the administration’s determination to purge the government of workers it perceives as disloyal to the president. The move, which follows the reassignment of multiple senior career officials across divisions, was made even though rank-and-file prosecutors by tradition remain in their positions across presidential administrations and are not punished because of their involvement in sensitive investigations.",
      "publishedAt": "2025-01-27T21:53:32Z",
      "title": "Justice Department fires employees involved in Trump prosecutions",
      "url": "https://apnews.com/article/justice-department-special-counsel-trump-046ce32dbad712e72e500c32ecc20f2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b07d255/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F93%2Fd6ffbd1c1cf17c9848a2dcc5265b%2F7e997a51476f4203be3dbd1895cf63fb"
    },
    {
      "author": "JIM MORRIS",
      "description": "Chrystia Freeland, the former finance minister who is running to replace Justin Trudeau as Canada's prime minister, says her country needs to release a “retaliation list” of goods the country would target if U.S. President Donald Trump makes good on his threat to slap 25% tariffs on Canadian goods. A list of products worth $200 billion Canadian dollars would send a message to U.S. exporters about the harm tariffs would cause them, Freeland said Monday in a statement. “Our counterpunch must be dollar-for-dollar — and it must be precisely and painfully targeted: Florida orange growers, Wisconsin dairy farmers, Michigan dishwasher manufacturers, and much more.”",
      "publishedAt": "2025-01-27T21:46:04Z",
      "title": "Canadian PM hopeful lays out plan to fight Trump's tariff threats 'where it hurts'",
      "url": "https://apnews.com/article/canada-us-tariffs-chrystia-freeland-d06de336a9ba641779f95cf0614ead20",
      "urlToImage": "https://dims.apnews.com/dims4/default/339b969/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F94%2F36d93f1103346cc1f46e18cf8e77%2F659bced1e9e749aba69f2cc293a57a7e"
    },
    {
      "author": "MIKE STOBBE",
      "description": "U.S. public health officials have been told to stop working with the World Health Organization, effective immediately. The surprise decision is focused on the U.S. Centers for Disease Control and Prevention. A CDC official sent a memo to senior leaders at the agency on Sunday night telling them that all agency staff who work with the WHO must immediately stop their collaborations and “await further guidance.” The Associated Press viewed the memo. Experts say the sudden stoppage is a surprise and will set back work on investigating and trying to stop outbreaks of Marburg virus and mpox in Africa.",
      "publishedAt": "2025-01-27T20:19:49Z",
      "title": "CDC ordered to stop working with WHO immediately",
      "url": "https://apnews.com/article/cdc-who-trump-548cf18b1c409c7d22e17311ccdfe1f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/9dad1fe/2147483647/strip/true/crop/5675x3192+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2F24%2Ff56808076479c3aa06a201c8a111%2F18b3a9dc49d8448a9133e0f0b7b170fb"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "A frenzy over an artificial intelligence chatbot made by Chinese tech startup DeepSeek was upending stock markets Monday and fueling debates over the economic and geopolitical competition between the U.S. and China in developing AI technology. DeepSeek’s AI assistant became the No. 1 downloaded free app on Apple’s iPhone store Monday, propelled by curiosity about the ChatGPT competitor. Part of what’s worrying some U.S. tech industry observers is the idea that the Chinese startup has caught up with the American companies at the forefront of generative AI at a fraction of the cost. But hype and misconceptions about DeepSeek’s technological advancements also sowed confusion.",
      "publishedAt": "2025-01-27T19:25:46Z",
      "title": "What is DeepSeek, the Chinese AI company upending the stock market?",
      "url": "https://apnews.com/article/deepseek-ai-china-f4908eaca221d601e31e7e3368778030",
      "urlToImage": "https://dims.apnews.com/dims4/default/84121ab/2147483647/strip/true/crop/8404x4727+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2F13%2F3567b7e98d698f1900f7dd722b1f%2Fd3bce37a2580412fa5a831ec7fd762f8"
    },
    {
      "author": "MANUEL RUEDA, ADRIANA GOMEZ LICON",
      "description": "Visa appointments at the U.S. Embassy in Colombia have been canceled following a dispute between President Donald Trump and his Colombian counterpart Gustavo Petro over deportation flights that nearly turned into a costly trade war between both countries. On Monday morning, hundreds of Colombians showed up outside the U.S. Embassy in Bogota, and were handed letters by local staff that said their appointments — which can take up to two years to obtain — had been canceled “due to the Colombian government’s refusal to accept repatriation flights of Colombian nationals.”",
      "publishedAt": "2025-01-27T16:44:20Z",
      "title": "Hundreds of US visa appointments canceled in Colombia following spat with Trump",
      "url": "https://apnews.com/article/colombia-visas-deportation-flights-trump-tariffs-d98900b9626bc481daebe0561d8889e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f32863/2147483647/strip/true/crop/5690x3201+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2Fa7%2F0b5f36a72b42ea03a108e31e0f14%2F002f59d9c12845d5ba34c4e7c6dce076"
    },
    {
      "author": "MONIKA PRONCZUK, MARK BANCHEREAU",
      "description": "Rwanda-backed rebels say they captured eastern Congo’s strategic city of Goma, the hub of a region containing trillions of dollars in mineral wealth that remains largely untapped. Analysts say the M23 fighters aim to control the city of about 2 million people and perhaps other areas in the region nearly 1,000 miles from the Congolese capital. It marks a sharp escalation in one of Africa’s longest wars, threatening to dramatically worsen a dire humanitarian crisis and spill into a wider regional conflict. The rebels’ offensive has sent thousands fleeing their homes and stretched local hospitals to the limit, with hundreds of wounded coming in every day.",
      "publishedAt": "2025-01-24T21:46:48Z",
      "title": "What is happening in eastern Congo, where rebels claim they captured a key city?",
      "url": "https://apnews.com/article/congo-m23-goma-fighting-crisis-rebels-3c0430df47b61f4930df93f1f7543f67",
      "urlToImage": "https://dims.apnews.com/dims4/default/5dee72e/2147483647/strip/true/crop/2921x1643+0+152/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F14%2F4af0d84ce2d3d6428f3e08f701f7%2Fc184c602b8714abba21cc42e64bc7e3e"
    },
    {
      "author": "TAMMY WEBBER",
      "description": "As Gaza residents return to what is left of their homes, they're facing new risks on top of monumental health challenges. The 15-month war, which has killed more than 47,000 people and displaced most of the population of 2.3 million, left a health system in shambles and large swaths of the territory reduced to rubble. A shortage of clean water and damaged sewer systems have spurred worries over the spread of infectious disease. Now aid groups are rushing to provide food and supplies amid a fragile ceasefire between Israel and Hamas while planning the best way forward.",
      "publishedAt": "2025-01-27T19:26:01Z",
      "title": "Huge health challenges face Gaza residents returning to their homes",
      "url": "https://apnews.com/article/gaza-health-water-sewer-rubble-hospital-a52e9d55316adb8681b96554835342cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef42c99/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fe9%2Fd8aa6b8943cd2f4fe9ee0e28801e%2F3d9701a6a97a4088b29b070335012166"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, JOSEPH KRAUSS",
      "description": "Israel is allowing Palestinians to return to the heavily destroyed north of the Gaza Strip for the first time since the early weeks of the 15-month war with Hamas, in accordance with a fragile ceasefire. Thousands of Palestinians headed north Monday after waiting for days to cross. Associated Press reporters saw people crossing the so-called Netzarim corridor shortly after 7 a.m. The opening was delayed over a dispute between Hamas and Israel, which said the militant group had changed the order of the hostages it released in exchange for scores of Palestinian prisoners.",
      "publishedAt": "2025-01-27T05:17:24Z",
      "title": "Israel allows Palestinians to return to northern Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-27-2025-48a7eb98d6900cdf24b32ea93b5bc584",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bdabcc/2147483647/strip/true/crop/5600x3150+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2Fa8%2F14b1f8312da084bb77558eb9ce26%2Fd5b82bd14a594a9394636c146d2b81ad"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}