{
  "articles": [
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israel said it targeted Hamas’ shadowy military commander in a massive strike in the southern Gaza Strip that killed at least 71 people, according to local health officials.",
      "publishedAt": "2024-07-13T10:27:48Z",
      "title": "An Israeli attack targeting head of Hamas' military wing kills at least 71 in southern Gaza Strip",
      "url": "https://apnews.com/83bc4de7ed25b317c7871fd5c0999ad1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df345ab526f344249173d412fd94783b/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is on a public and private blitz to shake off concerns about his cognitive capacities.But with public doubts about his fitness to serve unabating, Biden’s every move is now under a withering microscope as any potential stumble risks becoming magnified and delivering another blow to his candidacy.",
      "publishedAt": "2024-07-13T04:01:23Z",
      "title": "Biden's supporters want to 'let Joe be Joe' — but his stumbles are now under a bigger spotlight",
      "url": "https://apnews.com/834695dd707d3de47e86a791d4387915",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca3e714a644d41d2939c4c039272aad1/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, JOEY CAPPELLETTI and SEUNG MIN KIM",
      "description": "DETROIT (AP) — President Joe Biden on Friday forcefully defied the growing number of critics in his own party who have called on him to exit the race, pivoting to warnings about a second Donald Trump term and declaring he was “not done yet.”",
      "publishedAt": "2024-07-12T09:01:30Z",
      "title": "In 'blue wall' push, Biden defiantly says he's 'not going anywhere' as he slams Trump, Project 2025",
      "url": "https://apnews.com/e0f71b95bc8761b1a39083b1b9af6e1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/500bcf1517c744589e1985fefb6c8b33/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump will have one last chance Saturday to unveil his vice presidential pick on a rally stage before the Republican National Convention kicks off in Milwaukee next week.",
      "publishedAt": "2024-07-13T04:00:26Z",
      "title": "Trump heads to Pennsylvania for pre-convention rally as VP announcement looms",
      "url": "https://apnews.com/7c7ba6b99b5f38d2d840ed95b2fdc3e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/111c41ae4a5e4f8b8554b76d46ff9fb0/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MILWAUKEE (AP) — Milwaukee loves its Miller Beer, Brewers baseball and “ Bronze Fonz ” statue.",
      "publishedAt": "2024-07-13T04:03:13Z",
      "title": "Deeply Democratic Milwaukee wrestles with hosting Trump and the Republican National Convention",
      "url": "https://apnews.com/3a6c8b391ff4d0ba54332347c95e767c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09a86f29d8ce4c7297b027373000900e/3000.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — A New Mexico judge on Friday brought a sudden and stunning end to the involuntary manslaughter case against Alec Baldwin, dismissing it in the middle of the actor's trial and saying it cannot be filed again.",
      "publishedAt": "2024-07-12T04:01:37Z",
      "title": "Alec Baldwin weeps in court as judge announces involuntary manslaughter case is dismissed midtrial",
      "url": "https://apnews.com/eb3059c696a9aee5cb86967e27d8f3bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ea9462e4b55451ca05f1e3579e9f18c/1920.jpeg"
    },
    {
      "author": "BINAJ GURUBCHARYA",
      "description": "KATHMANDU, Nepal (AP) — Rescuers in Nepal recovered Saturday the first body after a landslide swept away two buses, pushing them into a raging river a day earlier, authorities said. The buses, carrying more than 50 people, fell into the Trishuli river which was swollen by continuous rainfall over the past few days as heavy monsoon downpours turned their waters murky brown, making it even more difficult to see the wreckage.",
      "publishedAt": "2024-07-13T04:55:58Z",
      "title": "Rescuers recover first body from 2 buses that were hit by landslide and fell into a river in Nepal",
      "url": "https://apnews.com/95f77f955e2d957ed0d7e07e3b089f8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/817c323780404d57a12184b9b11c98e4/1920.jpeg"
    },
    {
      "author": "JAMES POLLARD",
      "description": "HOUSTON (AP) — The deafening hum of a generator was a welcome noise Thursday evening at a Houston independent living center where several dozen seniors had lost power in the wake of Hurricane Beryl.",
      "publishedAt": "2024-07-13T04:07:02Z",
      "title": "Houston community groups strain to keep feeding and cooling a city battered by repeat storms",
      "url": "https://apnews.com/054704e2de841b8d58c4c84b078d01a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b9f2c7dc50c40ada5d9565146cad2a7/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU and DEEPA BHARATH",
      "description": "HUALIEN, Taiwan (AP) — When a 7.4-magnitude earthquake ripped through Taiwan in April, it took about 30 minutes for the region’s most ubiquitous charity to set up an emergency response center.",
      "publishedAt": "2024-07-13T04:05:11Z",
      "title": "A Taiwan-based Buddhist charity attempts to take the founding nun's message of compassion global",
      "url": "https://apnews.com/9d8600a7d53d4f5a8e04f8c810f8f658",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/301b0e689144484999b2907422f99e1e/3000.jpeg"
    },
    {
      "author": "RAFIQ MAQBOOL and RAJANISH KAKADE",
      "description": "MUMBAI, India (AP) — The youngest son of Mukesh Ambani, Asia’s richest man, married his longtime girlfriend early Saturday in what many dubbed the wedding of the year, attended by global celebrities, business tycoons and politicians, highlighting the billionaire’s staggering wealth and rising clout.",
      "publishedAt": "2024-07-13T04:22:54Z",
      "title": "The son of Asia's richest man gets married in the year's most extravagant wedding",
      "url": "https://apnews.com/9fe22be18241d5c228c7ad98f94079e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff0e793e196d477ba1fdb4bad37d8e62/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}