{
  "articles": [
    {
      "author": "JULIE CARR SMYTH, JILL COLVIN, COLLEEN LONG, MICHAEL BALSAMO, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "BUTLER, Pa. (AP) — On the heels of an apparent attempt to kill him, former President Donald Trump called Sunday for unity and resilience as shocked leaders across the political divide recoiled from the shooting that left him wounded but “fine.”",
      "publishedAt": "2024-07-14T12:40:25Z",
      "title": "Governor says man killed at Trump rally was former fire chief who 'died a hero'",
      "url": "https://apnews.com/db24c5bfbbe7d09fa2437c3c836bb434",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83499f30482c4f1a852a84ba823651a5/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A shooting at Donald Trump ’s rally in Butler, Pennsylvania is being investigated as an attempted assassination of the former president and presumptive Republican nominee, law enforcement officials say.",
      "publishedAt": "2024-07-14T12:13:19Z",
      "title": "The Latest: New details emerge about Trump rally shooting suspect",
      "url": "https://apnews.com/9b5184baa2662f6e2c07f1b18577d1e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dcebcf40ccf4e79b7c7172670b3ff09/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden will address the nation Sunday afternoon after a Situation Room briefing about the apparent assassination attempt on his predecessor, Donald Trump.",
      "publishedAt": "2024-07-14T15:48:47Z",
      "title": "Biden to address the nation on Trump's shooting as he works to balance politics with calls for unity",
      "url": "https://apnews.com/704592d02c3421a767112f0bf6d25eb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b10d82fa50e40cf9cd282f914a2ca64/3000.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Law enforcement officials were working Sunday to learn more about the 20-year-old Pennsylvania man they believe tried to assassinate former President Donald Trump at a campaign rally and to determine what drove him to open fire, killing one spectator.",
      "publishedAt": "2024-07-14T13:09:53Z",
      "title": "What we know about the 20-year-old suspect in the apparent assassination attempt of Donald Trump",
      "url": "https://apnews.com/881581c46c07025898027143fc9132e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52fd7c9fd499418db0ed211bcabb2978/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA, MICHAEL BIESECKER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — The U.S. Secret Service is investigating how a gunman armed with an AR-style rifle was able to get close enough to shoot and injure former President Donald Trump at a rally Saturday in Pennsylvania, a monumental failure of one of the agency’s core duties.",
      "publishedAt": "2024-07-14T05:33:56Z",
      "title": "The Secret Service is investigating how a gunman who shot and injured Trump was able to get so close",
      "url": "https://apnews.com/4e3415b1461f5acefbc8e1fadad0375b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ea4340bef11477a8a74887816b6ddfa/3000.jpeg"
    },
    {
      "author": "EVAN VUCCI and JULIE CARR SMYTH",
      "description": "BUTLER, Pa. (AP) — At 6:02 pm Saturday, to the strains of “God Bless the U.S.A.,” former President Donald Trump took the stage at fairgrounds in Butler, Pennsylvania, waving at the cheering crowd and settling into his regular rally speech under a scorching midsummer sun.",
      "publishedAt": "2024-07-14T01:48:37Z",
      "title": "A few short minutes after Trump took the stage, shots rang out",
      "url": "https://apnews.com/c75feec7f997d84eed34b0a3b3c194a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/decb43c08e0f497bb4ce70c2fbd625b5/1920.jpeg"
    },
    {
      "author": "DEL QUENTIN WILBER",
      "description": "WASHINGTON (AP) — The would-be assassin got off six shots in 1.7 seconds, nearly taking the life of a president and changing the trajectory of a presidency.It happened on a dreary March afternoon in 1981.",
      "publishedAt": "2024-07-14T14:37:14Z",
      "title": "Reagan survived an assassination attempt and his response changed the trajectory of his presidency",
      "url": "https://apnews.com/bd3c038d706de55a64727f7d15dffbc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cdaaf56e4564eb0b787cc04ad90b21b/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and MELANIE LIDMAN",
      "description": "MUWASI, Gaza Strip (AP) — Hamas said Sunday that Gaza cease-fire talks continue and the group’s military commander was in good health, a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials said killed at least 90 people, including children.",
      "publishedAt": "2024-07-14T13:45:44Z",
      "title": "Hamas says Gaza cease-fire talks haven't paused and claims military chief survived Israeli strike",
      "url": "https://apnews.com/728bb0842141ba246456422ebf93deb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb94fb8b0f8947389e4aca1e0b4d235d/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — When Maksim Kolker’s phone rang at 6 a.m., and the voice on the other end said his father had been arrested, he thought it was a scam to extort money. A day earlier, he had taken his father, prominent Russian physicist Dmitry Kolker, to the hospital in his native Novosibirsk, when his advanced pancreatic cancer had suddenly worsened.",
      "publishedAt": "2024-07-14T04:05:06Z",
      "title": "Treason and espionage cases are rising in Russia since the war in Ukraine began",
      "url": "https://apnews.com/ee99b15588fc0c3b20ed0e381afe3de3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fdef20737614da4b22e7da592e2f371/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "LONDON (AP) — For Carlos Alcaraz, there was one brief blip in the Wimbledon men's final against Novak Djokovic on Sunday, one five-point stretch that took him from the verge of victory to close to a collapse.",
      "publishedAt": "2024-07-14T07:04:26Z",
      "title": "Carlos Alcaraz wins Wimbledon by beating Novak Djokovic and now owns 4 Slam titles at age 21",
      "url": "https://apnews.com/29160fa7a3653edc1ba493940dddc5eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9c6700695e54e4bbeb5cd625103e85f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}