{
  "articles": [
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The race for control of Congress is as close as ever, with barely two dozen House seats and a handful in the Senate likely to determine the majority this November and whether a single party sweeps to power with the White House.",
      "publishedAt": "2024-09-07T13:54:17Z",
      "title": "Tight race for control of Congress could be decided by just a handful of campaigns",
      "url": "https://apnews.com/ae84dca1bfe82a270912ae0788d3b437",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/046c107c8ff54527bc0307b569d9bbf1/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and JILL COLVIN",
      "description": "PITTSBURGH (AP) — Kamala Harris and Donald Trump are veering sharply in how they gear up for Tuesday's presidential debate, setting up a showdown that reflects not just two separate visions for the country but two politicians who approach big moments very differently.",
      "publishedAt": "2024-09-07T04:14:31Z",
      "title": "Harris and Trump are getting ready for Tuesday's debate in sharply different ways",
      "url": "https://apnews.com/c34170599af4f51925f8dc4753e06e8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f18756bd8d8c4d8da55df6243a84935e/1930.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI and MICHAEL GOLDBERG",
      "description": "MINNEAPOLIS (AP) — Gov. Tim Walz faced the biggest crisis of his political career when Minnesota’s two largest cities erupted in protests and riots after a white Minneapolis police officer killed George Floyd.",
      "publishedAt": "2024-09-07T12:38:30Z",
      "title": "Sharp divisions persist over Walz's response to the riots that followed the murder of George Floyd",
      "url": "https://apnews.com/2b9b0bf883828e0429c379843f16005d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/940a8f74bb364e22a7bde9e4c9264d7a/3000.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "Murder charges filed against the father of a 14-year-old boy accused of a Georgia school shooting follow the successful prosecution of two parents in Michigan who were held responsible for a similar tragedy at a school north of Detroit.",
      "publishedAt": "2024-09-07T13:03:52Z",
      "title": "With father of suspect charged in Georgia shooting, will more parents be held responsible?",
      "url": "https://apnews.com/05e8cfb5aff0b99350c3265981c1ecec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c7858698d1b471a8566cf28fc2f17a9/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli air raids in the Gaza Strip killed more than a dozen people overnight into Saturday, hospital and local authorities said, as health workers wrapped up the second phase of an urgent polio vaccination campaign designed to prevent a large-scale outbreak.",
      "publishedAt": "2024-09-07T10:40:01Z",
      "title": "Israeli strikes in Gaza kill more than a dozen as polio vaccinations continue",
      "url": "https://apnews.com/ea11e05b51ad898a0a980246cd8d7ad4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9df6778349de4e289fe38cd52a491b96/3000.jpeg"
    },
    {
      "author": "ZEN SOO and ANIRUDDHA GHOSAL",
      "description": "HANOI, Vietnam (AP) — Vietnamese authorities say Typhoon Yagi has killed at least four people and injured 78 others after making landfall Saturday afternoon in the north of the country. Yagi, described by Vietnamese meteorological officials as “one of the most powerful typhoons in the region over the past decade,” made its way to the Southeast Asian country after it left three people dead and nearly a hundred others injured in the Chinese province of Hainan.",
      "publishedAt": "2024-09-07T04:46:12Z",
      "title": "Typhoon Yagi leaves at least 4 dead and scores injured in Vietnam",
      "url": "https://apnews.com/555e6187e737da7b13fe3e31cf3797ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9a678e5354e4e798ac891db1c5e5336/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH and JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Hinano Rodrigues remembers being 4 or 5 years old, carrying a bucket across a highway to the ocean in the Maui community where he still lives.At dawn, he would accompany his grandmother to a reef at low tide, where she plucked black snails, spiny lobsters and spiky sea urchins from the craggy rock.",
      "publishedAt": "2024-09-07T04:20:53Z",
      "title": "Maui's toxic debris could fill 5 football fields 5 stories deep. Where will it end up?",
      "url": "https://apnews.com/a10a5e4893182c6ea238c73fbd02fa3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e096b658ca9840d7a539b2053bcc903c/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "NASHVILLE, Tenn. (AP) — Nashville’s Ryman Auditorium is known as the Mother Church of Country Music. And, indeed, it began as a church, built by a riverboat captain who was converted to religion by an evangelist.",
      "publishedAt": "2024-09-07T12:15:39Z",
      "title": "Nashville's Mother Church of Country Music retains its roots as religious house of worship",
      "url": "https://apnews.com/29e75be20c490450d9107e137faeb8aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a95fe7c9de524bfd8eb6c4cf929ff9f6/3000.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "Preschool options are growing with the expansion of early learning programs, giving families in some parts of the U.S. a dizzying array of choices.Some states, like Colorado and New Mexico, are funneling state money into existing private preschools or child care centers.",
      "publishedAt": "2024-09-07T12:18:33Z",
      "title": "How to pick the best preschool or child care center for your child",
      "url": "https://apnews.com/d990c5aae5e7b17d76a73c7dff470eb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0308d7795fc9471ca5a1f4c4b306dacf/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "BIDDEFORD, Maine (AP) — Orange, blue, calico, two-toned and ... cotton-candy colored?Those are all the hues of lobsters that have showed up in fishers' traps, supermarket seafood tanks and scientists' laboratories over the last year.",
      "publishedAt": "2024-09-07T04:04:52Z",
      "title": "Just how rare is a rare-colored lobster? Scientists say answer could be under the shell",
      "url": "https://apnews.com/ae7e1c98d4eebb9658eea1e3e4cb6e31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64bcd4c669e64ef6ae57be3a92db3fd0/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}