{
  "articles": [
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Mike Pence fought the Department of Justice in court to try to avoid testifying against his former boss.",
      "publishedAt": "2023-08-02T15:27:50Z",
      "title": "Pence fought an order to testify but now is a central figure in his former boss's indictment",
      "url": "https://apnews.com/ab36fd360a0850562a07d1b404f15d69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5d32b6455be4ecaa4a49edd536dcb2b/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Russian drones on Wednesday hit a Ukrainian port city along the border with Romania, causing significant damage and a huge fire at facilities that are key to Ukrainian grain exports.",
      "publishedAt": "2023-08-02T06:29:59Z",
      "title": "Russian drone strikes hit a Ukrainian port on Romania's border that is key to grain exports",
      "url": "https://apnews.com/8b20147a55f29a0c0bc465b59274357e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5edf72bb0044b3da4381ea4ceb9e9c2/1920.jpeg"
    },
    {
      "author": "PETER SMITH and MICHAEL RUBINKAM",
      "description": "PITTSBURGH (AP) — The gunman who stormed a synagogue in the heart of Pittsburgh’s Jewish community and killed 11 worshippers will be sentenced to death for perpetrating the deadliest antisemitic attack in U.S.",
      "publishedAt": "2023-08-02T13:16:17Z",
      "title": "The Pittsburgh synagogue gunman will be sentenced to death for the nation’s worst antisemitic attack",
      "url": "https://apnews.com/27e3b1a505cacdd674ee9b8a179aa1a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3a5624d61ac46c39d73637935070f56/2464.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — Some Republican presidential candidates haven't yet met polling and fundraising thresholds for the first debate of the 2024 cycle, and now the qualifications for making it to the second one will be even higher.",
      "publishedAt": "2023-08-02T15:51:26Z",
      "title": "Republican National Committee boosts polling and fundraising thresholds to qualify for 2nd debate",
      "url": "https://apnews.com/bbbe87970329c1af4b12060961a50707",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afd3e1e39bb34ea8b2a376d53c5918af/3000.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — Rhonda Hicks could have kept working into her 60s. She loved teaching and loved her students in Philadelphia’s public schools. As a Black woman, she took pride in being a role model for many children of color.",
      "publishedAt": "2023-08-02T04:06:06Z",
      "title": "Burnout, low pay and politics are driving away teachers. Turnover is soaring for educators of color",
      "url": "https://apnews.com/b0c39ec0d4320e12f2767a342e503f85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e57956186d34032ab590a39b61678b1/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD, HELENA ALVES and BARRY HATTON",
      "description": "LISBON, Portugal (AP) — Pope Francis blasted Portugal’s Catholic Church leaders for the “scandal” of clergy sex abuse Wednesday as he kicked off a trip to the European country, saying their actions had helped drive the faithful away and ordering members of the Catholic hierarchy to change their ways and treat victims better.",
      "publishedAt": "2023-08-02T03:35:32Z",
      "title": "Pope Francis blasts 'scandal' of clergy abuse in Portugal as he arrives for World Youth Day",
      "url": "https://apnews.com/4db3ac2405da84abb9beced2b1f8b7c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93a06cb95e174e15a6ed3627a6892f15/1920.jpeg"
    },
    {
      "author": "GENE JOHNSON and CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — A man who posed as an undercover police officer kidnapped a woman in Seattle, drove her hundreds of miles to his home in Oregon and locked her in a cinder block cell until she bloodied her hands breaking the door to escape, the FBI said Wednesday.",
      "publishedAt": "2023-08-02T17:29:35Z",
      "title": "FBI looks for more possible victims after woman escapes from cinder block cage in Oregon",
      "url": "https://apnews.com/b4ad69d3b356156a8d25c723ffcea442",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de1625b7bec44f9a8499a907128ca256/3000.jpeg"
    },
    {
      "author": "MADDIE BURAKOFF",
      "description": "NEW YORK (AP) — There could be a new contender for heaviest animal to ever live. While today's blue whale has long held the title, scientists have dug up fossils from an ancient giant that could tip the scales.",
      "publishedAt": "2023-08-02T15:07:47Z",
      "title": "The heaviest animal ever may be this ancient whale found in the Peruvian desert",
      "url": "https://apnews.com/d4e4c1b8eb58bb0ee9702052f6adb457",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b02de41759a94b4997e69b2113b81171/3000.jpeg"
    },
    {
      "author": "DAVID HAMILTON",
      "description": "SAN FRANCISCO (AP) — Get ready to say goodbye to the once ubiquitous incandescent light bulb, pioneered by Thomas Edison more than a century ago. You can thank — or blame — new federal energy efficiency regulations that went into full effect Tuesday.",
      "publishedAt": "2023-08-02T13:12:48Z",
      "title": "Prepare to flick off your incandescent bulbs for good under new US rules that kicked in this week",
      "url": "https://apnews.com/950ca7bd90453a5bde277f3002e67d83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5faf18bf70246128f412f2b3465eff4/3000.jpeg"
    },
    {
      "author": "NOAH TRISTER",
      "description": "The arms race in the AL West began with Lucas Giolito and quickly escalated.After the Los Angeles Angels acquired Giolito and signaled their intentions to make a bid for the postseason, division rivals Texas and Houston answered with some big moves of their own, acquiring Max Scherzer and Justin Verlander before Tuesday's trade deadline.",
      "publishedAt": "2023-08-02T10:00:25Z",
      "title": "MLB trade deadline analysis: AL West leaders loaded up on starting pitchers",
      "url": "https://apnews.com/9882d31d549491b70ddd83b5994a13b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53fbf6d11c1945c38218aaa06d12b81d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}