{
  "articles": [
    {
      "author": "KAREN MATTHEWS",
      "description": "NEW YORK (AP) — Would Lisa Simpson set up a tent at New York University to protest the war in Gaza? How would Principal Skinner respond if she did?Hard to say, but some NYU students facing discipline for their actions during this spring's pro-Palestinian protests have been assigned a 49-page workbook that includes a “Simpsons”-based module on ethical decision-making.",
      "publishedAt": "2024-05-17T18:47:25Z",
      "title": "What would Lisa Simpson do? NYU student protesters asked to ponder ethical issues",
      "url": "https://apnews.com/69269d672fead4aa5c08c3c1cc958cfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8862d249c9743c1a59b75637197945c/3000.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — The Israeli military said Friday its troops in Gaza found the bodies of three Israeli hostages killed by Hamas during its Oct. 7 attack, including German-Israeli Shani Louk.",
      "publishedAt": "2024-05-17T15:32:45Z",
      "title": "Israeli army finds bodies of 3 hostages in Gaza killed at Oct. 7 music festival",
      "url": "https://apnews.com/a37e4fd656b46be36c4c659a9c2aac7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3d4f8d4efab479492c2cb8d72620b5c/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and JON GAMBRELL",
      "description": "WASHINGTON (AP) — Trucks carrying badly needed aid for the Gaza Strip rolled across a newly built U.S. pier and into the besieged enclave for the first time Friday as Israeli restrictions on border crossings and heavy fighting hindered the delivery of food and other supplies.",
      "publishedAt": "2024-05-17T06:14:53Z",
      "title": "Trucks are rolling across a new US pier into Gaza. But challenges remain to getting enough aid in",
      "url": "https://apnews.com/336c810724d107a41bb6628c721aea7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9493875097574688b5c3f493b10369fa/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russian President Vladimir Putin said on Friday during a visit to China that Moscow’s offensive in Ukraine’s northeastern Kharkiv region aims to create a buffer zone but that there are no plans to capture the city.",
      "publishedAt": "2024-05-17T06:29:04Z",
      "title": "Putin says Russia wants a buffer zone in Ukraine's Kharkiv but has no plans to capture the city",
      "url": "https://apnews.com/ce31e2e73cbb8dd59aa73baa6cd87d68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e7593ea8d7b4b5780dace0c33e995db/1920.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "ST. PAUL, Minn. (AP) — Former President Donald Trump will head to Minnesota on a day off from his hush money trial for a Republican fundraiser Friday night in a traditionally Democratic state that he boasts he can carry in November.",
      "publishedAt": "2024-05-17T04:04:12Z",
      "title": "Trump heads to Minnesota to campaign after attending his son Barron's Florida high school graduation",
      "url": "https://apnews.com/4f7ebfe7a2e1949d38a7c9894616a985",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b62733f2a5a74d0996f28ddced3da23a/2946.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ",
      "description": "SAN FRANCISCO (AP) — The man who broke into the home of then-House Speaker Nancy Pelosi seeking to hold her hostage and bludgeoned her husband with a hammer was sentenced Friday to 30 years in prison.",
      "publishedAt": "2024-05-17T04:08:12Z",
      "title": "Man gets 30 years in prison for attacking ex-Speaker Nancy Pelosi’s husband with a hammer",
      "url": "https://apnews.com/b41b6c776fb27f62913e3754afa1ceac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d274686e7f3e4d1aae26a19dbefbcd6c/2402.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "LOUISVILLE, Ky. (AP) — Masters champion Scottie Scheffler was arrested Friday morning on his way to the PGA Championship, with stunning images showing him handcuffed as he was taken to jail for not following police orders during a pedestrian fatality investigation.",
      "publishedAt": "2024-05-17T11:35:14Z",
      "title": "Scottie Scheffler arrested outside PGA Championship, then returns and climbs leaderboard",
      "url": "https://apnews.com/a421bfdb346f00dec95c95a0ab04e4d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df18b1b1933b42a6ac0f1a4dff239971/1920.jpeg"
    },
    {
      "author": "TOM KRISHER and KIM CHANDLER",
      "description": "TUSCALOOSA, Ala. (AP) — A decisive vote against the United Auto Workers union at two Mercedes factories in Alabama on Friday sidetracked the UAW's grand plan to sign up workers at nonunion plants mainly in the South.",
      "publishedAt": "2024-05-17T04:13:50Z",
      "title": "After decisive loss at Alabama Mercedes plants, powerful auto union vows to return and win",
      "url": "https://apnews.com/bb5f6855474b0197b015d70273651a94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/485b2bf92d42407fb607c2138878a3a7/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian police announced Friday they have linked the deaths of four young women nearly 50 years ago to a now-deceased U.S. fugitive who hid in Canada from the mid-1970s to the late 1990s.",
      "publishedAt": "2024-05-17T19:18:56Z",
      "title": "Canadian police link 4 women killed in the 1970s to dead American serial sex offender",
      "url": "https://apnews.com/8b0dc786da4a2d9ebb3da681637f7644",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ee88fef22034c439c536ea177dd6508/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The Vatican on Friday overhauled its process for evaluating alleged visions of the Virgin Mary, weeping statues and other seemingly supernatural phenomena that have marked church history, putting the brakes on making definitive declarations unless the event is obviously fabricated.",
      "publishedAt": "2024-05-17T04:09:25Z",
      "title": "Vatican moves to adapt to hoaxes, Internet and overhauls its process for evaluating visions of Mary",
      "url": "https://apnews.com/f9b5659e2947e7eb966db2e491e17267",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc9318f913fc49709df1334b9786692e/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}