{
  "articles": [
    {
      "author": "RUSS BYNUM, TERRY SPENCER and TRISHA AHMED",
      "description": "JACKSONVILLE, Fla. (AP) — A masked white man fatally shot three Black people inside a Jacksonville, Florida, Dollar General store in a predominately African-American neighborhood on Saturday, in an attack where he used a gun painted with a swastika, officials said.",
      "publishedAt": "2023-08-26T20:56:43Z",
      "title": "A white man fatally shoots 3 Black people at a Florida store in a hate crime, then kills himself",
      "url": "https://apnews.com/b65ecad5f81ac8aa35121507dd4f7dcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/924d1aa8b4474477b4c10eaef95a0709/3000.jpeg"
    },
    {
      "author": "JENNIFER McDERMOTT, BERNARD CONDON and MICHAEL BIESECKER",
      "description": "In the first moments of the Maui fires, when high winds brought down power poles, slapping electrified wires to the dry grass below, there was a reason the flames erupted all at once in long, neat rows -- those wires were bare, uninsulated metal that could spark on contact.",
      "publishedAt": "2023-08-26T12:04:26Z",
      "title": "Bare electrical wire and leaning poles on Maui were possible cause of deadly fires",
      "url": "https://apnews.com/9f23f79821ea50256f0725ac9b0b3905",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7acf0f415a2f4cbc9e66afa4d47c73ea/3000.jpeg"
    },
    {
      "author": "AARON MORRISON and AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — Thousands converged Saturday on the National Mall for the 60th anniversary of Rev.",
      "publishedAt": "2023-08-26T04:12:14Z",
      "title": "Thousands converge on National Mall to mark the March on Washington’s 60th anniversary",
      "url": "https://apnews.com/7639b60f26948fe614978dc6a763cc84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7707656889b54b789e0869af7d6e6719/3000.jpeg"
    },
    {
      "author": "NICK PERRY",
      "description": "CHRISTCHURCH, New Zealand (AP) — The howling winds and perpetual darkness of the Antarctic winter were easing to a frozen spring when mechanic Liz Monahon at McMurdo Station grabbed a hammer.If those in charge weren’t going to protect her from the man she feared would kill her, she figured, she needed to protect herself.",
      "publishedAt": "2023-08-27T04:04:46Z",
      "title": "Women working in Antarctica say they were left to fend for themselves against sexual harassers",
      "url": "https://apnews.com/ba0e550fddf1ab0afd031ff4d25143cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d62d148ce8284d169f6694480f71a7fd/3000.jpeg"
    },
    {
      "author": "EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A powerful gang opened fire Saturday on a large group of parishioners led by a pastor as they marched through a community armed with machetes to rid the area of gang members.",
      "publishedAt": "2023-08-27T01:38:04Z",
      "title": "A gang in Haiti opens fire on a crowd of parishioners trying to rid the community of criminals",
      "url": "https://apnews.com/1b170673a2e373f893e85f33ab36a044",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a86a2dbaa7db45ef8c9a097842d602b1/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "FUTABA, Japan (AP) — For the wrecked Fukushima Daiichi nuclear plant, managing the ever-growing volume of radioactive wastewater held in more than 1,000 tanks has been a safety risk and a burden since the meltdown in March 2011.",
      "publishedAt": "2023-08-27T02:47:22Z",
      "title": "At Fukushima Daiichi, decommissioning the nuclear plant is far more challenging than water release",
      "url": "https://apnews.com/4745dff09d17a7de47b3e3dc4653724a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab4e4cf91978412f878a20ef317769eb/1243.jpeg"
    },
    {
      "author": "GABE STERN",
      "description": "RENO, Nev. (AP) — Santos Brizuela spent more than two decades laboring outdoors, persisting despite a bout of heatstroke while cutting sugarcane in Mexico and chronic laryngitis from repeated exposure to the hot sun while on various other jobs.",
      "publishedAt": "2023-08-27T04:37:03Z",
      "title": "Workers exposed to extreme heat have no consistent protection in the US",
      "url": "https://apnews.com/1d53c85d0f8dd2cb973f950c54fb17eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2d16352c35e48628daad6c23af5fdf1/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "FORT LAUDERDALE, Fla. (AP) — Forecasters are warning of possible flash flooding and landslides across the eastern Yucatan peninsula and western Cuba, and Florida braced for a possible hurricane by midweek, as a weather system off the coast of Mexico was expected to become a tropical storm by Sunday, the U.S.",
      "publishedAt": "2023-08-26T17:07:42Z",
      "title": "Much of Florida under state of emergency as possible tropical storm forms in Gulf of Mexico",
      "url": "https://apnews.com/7e94c35ac7c599f7463dcc2c9d40ae3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72f0f316f3ea43ab8c6fd256ed901b02/3000.jpeg"
    },
    {
      "author": "FARAI MUTSAKA and GERALD IMRAY",
      "description": "HARARE, Zimbabwe (AP) — Zimbabwean President Emmerson Mnangagwa was re-elected for a second and final five-year term late Saturday in results announced much earlier than expected following another troubled vote in the southern African country with a history of violent and disputed elections.",
      "publishedAt": "2023-08-26T21:49:00Z",
      "title": "Zimbabwean President Emmerson Mnangagwa wins re-election after troubled vote, officials say",
      "url": "https://apnews.com/4aaeb10b7bf49f54fd10af141d18ced2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0acf9d9d0b664dcbba65c9714842661f/3000.jpeg"
    },
    {
      "author": "GRAHAM DUNBAR and JOSEPH WILSON",
      "description": "GENEVA (AP) — FIFA suspended Spanish soccer federation president Luis Rubiales on Saturday while its disciplinary committee investigates his conduct at the Women’s World Cup final, which included kissing player Jenni Hermoso on the lips after Spain's victory.",
      "publishedAt": "2023-08-26T12:29:17Z",
      "title": "FIFA suspends Spain soccer federation president Luis Rubiales for 90 days after World Cup win kiss",
      "url": "https://apnews.com/1559a704b765b834d94544ee0b119efc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9ef8692b386435ea561e3ab9c1c4f29/2040.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}