{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "President Donald Trump's tariffs against China have gone into effect. China has retaliated with tariffs against U.S. oil. Tariffs against Mexico and Canada have paused as negotiations continue.",
      "publishedAt": "2025-02-04T09:11:00Z",
      "title": "Live updates: China retaliates against Trump with tariffs of their own",
      "url": "https://apnews.com/live/trump-presidency-updates-day-16",
      "urlToImage": "https://dims.apnews.com/dims4/default/26453a2/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2Fec%2Fc644ba517baf6a2b5adb9ab81051%2F2ec1a2dcaebf40dfac1c121dd4bc3802"
    },
    {
      "author": null,
      "description": "China’s Ministry of Commerce announced Tuesday it was implementing counter tariffs against the U.S. on multiple products. The government said that it would implement 15% tariff on coal and liquified natural gas products, as well as a 10% tariff on crude oil, agricultural machinery and certain vehicles. “The US’s unilateral tariff increase seriously violates the rules of the World Trade Organization,” the statement said. “It is not only unhelpful in solving its own problems, but also damages normal economic and trade cooperation between China and the US.” China’s State Administration for Market Regulation also Tuesday said it is investigating Google on suspicion of violating antitrust laws.",
      "publishedAt": "2025-02-04T05:31:25Z",
      "title": "China imposes 15% tariffs on coal, LNG in response to Trump's tariffs",
      "url": "https://apnews.com/article/china-tariffs-us-trump-150fab3a44ec055845e47c82bde544c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/62d23e0/2147483647/strip/true/crop/4347x2445+0+226/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F5c%2Fc5bc5798c932c5100d5e027ad324%2Fca44d9f84e964d7694f49ad395e64fdd"
    },
    {
      "author": "ROB GILLIES",
      "description": "One of the world’s most durable and amicable alliances is broken. Canadians are absorbing U.S. President Donald Trump’s trade war and his threats to make Canada the 51st state. Canadians are feeling a sense of betrayal after Trump declared a trade war against America’s northern neighbor and longtime ally. Trump keeps threatening Canada’s sovereignty and vowing to put sweeping 25% tariffs on Canadian products. The ties between the two countries are without parallel. Nearly $3.6 billion Canadian, or US$2.5 billion, worth of goods and services cross the border each day. Canada is the top export destination for 36 U.S. states and 77% of Canada’s exports go to the United States.",
      "publishedAt": "2025-02-03T20:57:16Z",
      "title": "After Trump declares a trade war, Canadians grapple with a sense of betrayal",
      "url": "https://apnews.com/article/canada-trump-tariffs-e0af3e973a2d7848c2baaa6fb8021c27",
      "urlToImage": "https://dims.apnews.com/dims4/default/e20870e/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2Fd0%2F11c21eeb747e36c227032e0d8c7f%2F8a8309097fe24c8fb4516d2c1b89c572"
    },
    {
      "author": "ZEN SOO",
      "description": "China has announced a flurry of retaliatory measures against the U.S., including tariffs on imports of products such as coal, liquefied natural gas products and crude oil, as well as an antitrust probe into Google. It also placed two other U.S. firms on an unreliable entity list that could bar them from investing in China. Although Google services are not accessible in China, the company still maintains a presence in the country, primarily focused on sales and engineering for its advertising business. Some experts believe that the antitrust investigation is likely to center around Google’s Android operating system for smartphones and used as a bargaining chip in the U.S.-China trade war.",
      "publishedAt": "2025-02-04T11:05:10Z",
      "title": "China launches an antitrust probe into Google. Here's what it means",
      "url": "https://apnews.com/article/google-china-antitrust-investigation-tariffs-ab02b906733666cb0d348d2b416b7fa5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4b316b/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F03%2F2a230fc1a327ac5d9ec57d9137f5%2Fef6f8845ee41413ab546bac485e79857"
    },
    {
      "author": "AMANDA SEITZ, STEPHEN GROVES",
      "description": "Robert F. Kennedy Jr. is set to find out if he has cleared the first hurdle to become the nation's top health official when the Senate Finance Committee votes on his nomination. The vote on the controversial environmental lawyer turned public health critic is Tuesday morning. Democrats are still raising concerns about Kennedy’s potential to profit off anti-vaccine advocacy and lawsuits. But Republicans appear to be rallying behind President Donald Trump’s health secretary nominee. On Monday, a Republican once viewed as a vulnerable “no” vote, North Carolina Sen. Thom Tillis, announced he would back Kennedy. Kennedy needs support from all but three Republicans if Democrats uniformly oppose him.",
      "publishedAt": "2025-02-04T11:23:24Z",
      "title": "RFK Jr. faces key first vote to be health secretary Tuesday",
      "url": "https://apnews.com/article/trump-cabinet-kennedy-rfk-health-secretary-vote-842455e48b1f9b79fb2312937dff29f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb2d534/2147483647/strip/true/crop/6447x3626+0+336/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F46%2Ff5db7aa5af731efb2da317d0e5f3%2Fbc11833dafd348feb3dfed6cec449d4a"
    },
    {
      "author": "MARCIA DUNN",
      "description": "New research shows that when an asteroid slammed into the moon billions of years ago, it carved out a pair of grand canyons on the far side. That's good news for NASA, which is looking to land astronauts at the south pole on the near, Earth-facing side later this decade. Because the debris went elsewhere, the moon's south pole contains older rocks that could be collected by moonwalkers. The incoming object created an impact basin and sent streams of rocks hurtling like missiles. Within minutes, two canyons comparable in size to Arizona's Grand Canyon were formed.",
      "publishedAt": "2025-02-04T16:01:45Z",
      "title": "How an ancient asteroid strike carved out 2 grand canyons on the moon",
      "url": "https://apnews.com/article/moon-grand-canyons-nasa-astronauts-landing-31981ecbc04a2eb383f619582e830e9c",
      "urlToImage": "https://dims.apnews.com/dims4/default/cfaba72/2147483647/strip/true/crop/2133x1200+133+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F21%2F5d45f7afcdbd417872418f7634ac%2F18c7b1663e7f4b73b3b19d253f6a6610"
    },
    {
      "author": "ALLEN G. BREED, CHRISTINA LARSON",
      "description": "Red wolves once ranged far and wide across the U.S., helping them earn the nickname “America's wolf.” But there are now thought to be fewer than 20 left in the wild. And in North Carolina, the only place where the animals roam free, motorists are the biggest threat to their survival. For decades, conservationists have pushed for changes to U.S. 64, a busy two-lane highway that runs straight through the Alligator River National Wildlife Refuge. They may finally be getting their wish with federal funding that backs small underpasses to steer wolves and other animals below the highway. Wildlife crossings have surged around the world in the past two decades, but the one in North Carolina is a little different because it seeks to save a critically endangered species.",
      "publishedAt": "2025-02-04T14:31:28Z",
      "title": "A North Carolina wildlife crossing will save people. Can it save the last wild red wolves too?",
      "url": "https://apnews.com/article/red-wolf-wildlife-crossings-north-carolina-conservation-endangered-5797ffd304dac2cdd9718d40edb83718",
      "urlToImage": "https://dims.apnews.com/dims4/default/6438915/2147483647/strip/true/crop/5502x3095+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2Ff2%2Ff50c0f4791f102d4971360e1090a%2F363ec191617449e89c6cd177d1344279"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Hamas officials say they’ve begun talks with international mediators over the second phase of the ceasefire in Gaza that began last month. The accord mapped out three phases of negotiations to end the 15-month war. The first, which began Jan. 19, halted fighting, expanded the amount of humanitarian aid let into Gaza and exchanged Palestinian prisoners for Israeli hostages taken to Gaza during the Oct. 7, 2023, attack that triggered the conflict. Israeli Prime Minister Benjamin Netanyahu was in Washington to meet with U.S. President Donald Trump on Tuesday. Egypt, Qatar and the United States are mediating the indirect talks between Israel and Hamas.",
      "publishedAt": "2025-02-04T08:49:56Z",
      "title": "Middle East latest: Hamas officials say they've started talks on second phase of ceasefire",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-ceasefire-news-02-04-2025-763f7874199e84926f75f5a513087137",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1e7da7/2147483647/strip/true/crop/4484x2522+0+233/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2Ff2%2Faa923d054fb9599c7a81d6119aa2%2F4137703ae8f240239baa0c44f2090b43"
    },
    {
      "author": "JOSHUA GOODMAN",
      "description": "When President Donald Trump froze foreign assistance for 90 days, he argued that such a drastic step was needed to eliminate waste and block what he derides as “woke” spending that doesn’t align with American interests. Experts say the suspension has a serious consequence: It could prove to be a boon to authoritarian leaders and their regimes. The billions that the U.S. spends annually on foreign aid — more than any other nation — include hundreds of grants for grassroots groups dedicated to fighting for democracy and against corruption.",
      "publishedAt": "2025-02-04T05:08:00Z",
      "title": "Trump’s foreign aid freeze could prove to be a boon for the world’s authoritarians",
      "url": "https://apnews.com/article/usaid-foreign-aid-trump-dictators-freeze-de4b211931515315ef699c8fc7d37239",
      "urlToImage": "https://dims.apnews.com/dims4/default/30778f1/2147483647/strip/true/crop/5416x3047+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fd3%2F84aebbda3e83d4c2f8c39f46a001%2F05f9fa7f65fd4366b3bb49990430afa1"
    },
    {
      "author": "AAMER MADHANI, TIA GOLDENBERG",
      "description": "Donald Trump and Benjamin Netanyahu are set to meet for talks in Washington. Tuesday's White House meeting comes as the Israeli prime minister faces competing pressure from his right-wing coalition to end a temporary truce and resume the war against Hamas militants in Gaza and from war-weary Israelis who want to see remaining hostages come home and the 15-month war brought to an end. Trump is guarded about the long-term prospects for the truce, even as he takes credit for pressuring Hamas and Israel into the hostage and ceasefire agreement that went into effect on the day before he returned to power last month.",
      "publishedAt": "2025-02-04T05:02:26Z",
      "title": "Trump and Netanyahu hold talks as US president warns 'no guarantees' fragile peace in Gaza will hold",
      "url": "https://apnews.com/article/trump-netanyahu-washington-ceasefire-1c8deec4dd46177e08e07d669d595ed3",
      "urlToImage": "https://dims.apnews.com/dims4/default/10c0012/2147483647/strip/true/crop/3561x2003+0+185/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F73%2F261701097e5bf920278eb42123cf%2F82252b5244164906b2302c8f396c5940"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}