{
  "articles": [
    {
      "author": "SASHA CHAVKIN",
      "description": "WASHINGTON (AP) — As incomes in China have grown in the last decade, so has China’s appetite for beef. No longer out of reach for China’s middle class, beef now sizzles in home woks and restaurant kitchens.",
      "publishedAt": "2023-11-03T04:24:29Z",
      "title": "How an American meat broker is fueling Amazon deforestation",
      "url": "https://apnews.com/2a7a9a4310b6abca727dabb596e2e84d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2da05f293bcb47bca46443f47fed021b/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, BASSEM MROUE and LEE KEATH",
      "description": "TEL AVIV, Israel (AP) — Israeli President Benjamin Netanyahu on Friday pushed back against growing U.S. pressure for a “humanitarian pause” in the war to protect civilians and allow more aid into Gaza, insisting there would be no temporary cease-fire until some 240 hostages were released.",
      "publishedAt": "2023-11-03T07:23:39Z",
      "title": "Israel resists US pressure to pause the war to allow more aid to Gaza, wants hostages back first",
      "url": "https://apnews.com/94d5d0b58bc10a14be6ac191060e47e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e334679a5d254e9289abcb648a3ba8c1/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE, KAREEM CHEHAYEB and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — When Israeli warplanes bombed the crowded Jabaliya refugee camp in northern Gaza this week, neonatal nurse Hudaa Ali Eldaor felt the vibration in her ward at the nearby Kamal Adwan Hospital.",
      "publishedAt": "2023-11-03T14:48:48Z",
      "title": "Trapped in hell: Palestinian civilians try to survive in northern Gaza, focus of Israel's offensive",
      "url": "https://apnews.com/8a25acaf136b897492158d128bf5742d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b6a851470524f9aab5d8dfeff5b4ff8/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court agreed on Friday to decide whether a Trump era-ban on bump stocks, the gun attachments that allow semi-automatic weapons to fire rapidly like machine guns, violates federal law.",
      "publishedAt": "2023-11-03T17:48:02Z",
      "title": "Supreme Court will rule on ban on rapid-fire gun bump stocks, used in the Las Vegas mass shooting",
      "url": "https://apnews.com/2b66dbcbce4c04c19b448951696fe4b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/867e5c4e5e994df5907408ff323a7c50/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN and ANNE D'INNOCENZIO",
      "description": "WASHINGTON (AP) — The nation’s employers slowed their hiring in October, adding a modest but still decent 150,000 jobs, a sign that the labor market may be cooling but remains resilient despite high interest rates that have made borrowing much costlier for companies and consumers.",
      "publishedAt": "2023-11-03T04:01:24Z",
      "title": "US employers pulled back on hiring in October, adding 150,000 jobs in face of higher borrowing rates",
      "url": "https://apnews.com/941e0963d178e3435dfd01f3393787aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9233a8297eec4e19ab8ef41e78083f57/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Eric Trump testified Friday that he was relying on accountants to ensure the accuracy of financial statements that authorities say fraudulently exaggerated his father's wealth and the value of his assets to deceive banks and insurers.",
      "publishedAt": "2023-11-03T14:27:35Z",
      "title": "Eric Trump testifies in civil fraud trial he relied on accountants for financial statements accuracy",
      "url": "https://apnews.com/af902a6800c01abba93277c54d07c7f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19862d30675c4685b3a505987222f066/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and CHRISTINE FERNANDO",
      "description": "DENVER (AP) — Can former President Donald Trump run for his old job again after his role in the Jan. 6, 2021, attack on the U.S. Capitol? The answer may depend on the definition of insurrection.Liberal groups have filed lawsuits in Colorado, Minnesota and other states to bar Trump from the ballot, citing a rarely used constitutional prohibition against holding office for those who swore an oath to uphold the Constitution but then “engaged in insurrection” against it.",
      "publishedAt": "2023-11-03T17:58:01Z",
      "title": "Can Trump be on the ballot in 2024? It can hinge on the meaning of 'insurrection'",
      "url": "https://apnews.com/64ea3e076af335a3e1bce6d7620d58a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d78e49ec16e645db8c278f49253f4b18/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and CARLA K. JOHNSON",
      "description": "FINDLAY, Ohio (AP) — Communities ravaged by America's opioid epidemic are starting to get their share of a $50 billion pie from legal settlements.Most of that money comes with a requirement that it be used to address the overdose crisis and prevent more deaths.",
      "publishedAt": "2023-11-03T04:19:41Z",
      "title": "As billions roll in to fight the US opioid epidemic, one county shows how recovery can work",
      "url": "https://apnews.com/d186d72250f35056892bc9d70b5ab2c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6909068bb02d445b92deac95e9c129da/3000.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "NEWPORT NEWS, Va. (AP) — A teacher who was shot by her 6-year-old student in Virginia can press forward with her $40 million against a school system over claims of negligence by school administrators, a judge ruled Friday.",
      "publishedAt": "2023-11-03T18:22:24Z",
      "title": "Virginia teacher shot by 6-year-old can proceed with $40 million lawsuit, judge rules",
      "url": "https://apnews.com/48d4ea18da54ccfeb3e082902020bf6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73fd4ba57f7a4641be9e98360c827f3b/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Fans of hip-hop, country, pop, funk, R&amp;B and rock all have reason to cheer the 2023 class entering the Rock &amp; Roll Hall of Fame.",
      "publishedAt": "2023-11-03T04:01:35Z",
      "title": "Missy Elliott, Willie Nelson, Sheryl Crow and Chaka Khan ready for Rock & Roll Hall of Fame",
      "url": "https://apnews.com/f8c111337f7c2f6e2477a015369462f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e250d4c862d44c1a252fd55b8d26643/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}