{
  "articles": [
    {
      "author": "NAJIB JOBAIN, BASSEM MROUE and CARA ANNA",
      "description": "RAFAH, Gaza Strip (AP) — The United States and Arab partners disagreed Saturday on the need for an immediate cease-fire in the Gaza Strip as Israeli military strikes killed civilians at a U.N.",
      "publishedAt": "2023-11-04T07:48:05Z",
      "title": "US and Arab partners disagree on the need for a cease-fire as Israeli airstrikes kill more civilians",
      "url": "https://apnews.com/baf5a858e29aa6a4b8100e3afc5afdf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1596894a804346529201d023eca0e73a/1920.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN and OLEG CETINIC",
      "description": "WASHINGTON (AP) — From Washington to Milan to Paris, tens of thousands of pro-Palestinian demonstrators marched Saturday, calling for a halt to Israel’s bombardment of Gaza.",
      "publishedAt": "2023-11-04T19:52:53Z",
      "title": "Protest marches from US to Berlin call for immediate halt to Israeli bombing of Gaza",
      "url": "https://apnews.com/193a9aaca97df2c5c6a515f756a40a34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dfb83fcd7774b9d8ec4964b8dbaaff9/3000.jpeg"
    },
    {
      "author": "JIM SALTER and MARC LEVY",
      "description": "ST. LOUIS (AP) — Most members of Congress have stood firmly behind Israel since the Hamas attack last month, but not Cori Bush.",
      "publishedAt": "2023-11-04T04:03:03Z",
      "title": "War in the Middle East upends the dynamics of 2024 House Democratic primaries",
      "url": "https://apnews.com/1b8616887e31f86a930ebc2e767c9a12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4393fba31cc4108bc2d91dbfcfb5962/3000.jpeg"
    },
    {
      "author": "JEFF McMURRAY",
      "description": "CHICAGO (AP) — Sophee Langerman was on her way to a bicycle safety rally in Chicago’s Lakeview neighborhood in June when a car turning right rolled through a red light and slammed into her bike, which she was walking off the curb and into the crosswalk.",
      "publishedAt": "2023-11-04T04:21:31Z",
      "title": "Right turn on red? With pedestrian deaths rising, US cities are considering bans",
      "url": "https://apnews.com/7f5bdee9c7b3f4cbf005f1844f486123",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8d62c43a790480490e46abbd196bcd8/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and BILL BARROW",
      "description": "KISSIMMEE, Fla. (AP) — A booth at the Florida Republican Party’s Freedom Summit made swift business of Donald Trump merchandise on Saturday, selling everything from socks to bathtub rubber ducks that paid tribute to the former president.",
      "publishedAt": "2023-11-04T04:07:22Z",
      "title": "Donald Trump's strength is clear in Florida as Gov. Ron DeSantis tries to move past 'nonsense'",
      "url": "https://apnews.com/4e290803224da2c9ebef65f41b409542",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbbe2e47493147c8a01c0982c52fb448/3000.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Helicopters and ground troops rushed to help people hurt in a strong earthquake that shook districts in northwestern Nepal just before midnight Friday, killing at least 128 people and injuring dozens more, officials said Saturday.",
      "publishedAt": "2023-11-03T19:01:17Z",
      "title": "Quake shakes northwest Nepal, killing at least 128 and injuring dozens. Officials fear toll to rise",
      "url": "https://apnews.com/47b0b262ed1aa26957285dd1a55699fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d0738ef681b40f2bfa95932068dd1b2/2884.jpeg"
    },
    {
      "author": "JOSH BOAK and JOEY CAPPELLETTI",
      "description": "WASHINGTON (AP) — President Joe Biden called the head of the United Auto Workers union to congratulate him this past week on getting a new contract with General Motors and to wish him a happy 55th birthday — a sign of how the relationship had evolved since their first get-to-know-you meeting in the Oval Office on July 19.",
      "publishedAt": "2023-11-04T12:04:56Z",
      "title": "During strike talks, Biden worked to build ties to the UAW's leader. They have yet to fully pay off",
      "url": "https://apnews.com/065ed44fb22fd5c18440a6b1fcbd4cae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97072d6e0810467b8231099db7ae302a/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russian attacks in Ukraine wounded at least 14 civilians over the past day, officials said Saturday, as the president of the European Union's executive arm returned to the Ukrainian capital to meet with President Volodymyr Zelenskyy.",
      "publishedAt": "2023-11-04T09:56:38Z",
      "title": "Zelenskyy hosts EU official von der Leyen as Russian attacks wound at least 14 people in Ukraine",
      "url": "https://apnews.com/ae84a4120f736de4be76d44bdaecce16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b49e7cabd17d4d088a5bf3cdfd992de1/3000.jpeg"
    },
    {
      "author": "ANNE M. PETERSON and JAMES ROBSON",
      "description": "U.S. Soccer is closing in on naming Chelsea’s Emma Hayes as the new coach of the women’s national team, a source familiar with the negotiations told The Associated Press on Saturday.The person spoke on the condition of anonymity because the details had not been made public.",
      "publishedAt": "2023-11-04T16:31:15Z",
      "title": "Chelsea's Emma Hayes expected to become US women's soccer coach, AP source says",
      "url": "https://apnews.com/7caac9df0b5ac4fe2d8ecda9565f9f35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8204c03e18c41c3882091bd499147c9/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "UVALDE, Texas (AP) — On a sticky Texas morning, Kimberly Mata-Rubio is lacing up her running shoes ahead of two races she is running in Uvalde in tribute to her daughter Lexi, who was killed in the 2022 Robb Elementary School shooting.",
      "publishedAt": "2023-11-04T04:00:30Z",
      "title": "Her daughter was killed in the Robb Elementary shooting. Now she's running for mayor of Uvalde",
      "url": "https://apnews.com/e052b6ef51607f6b5fc49f722e4acc27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d12bcf8732524b54a449b6c0e27208c2/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}