{
  "articles": [
    {
      "author": "KIM TONG-HYUNG and DASHA LITVINOVA",
      "description": "SEOUL, South Korea (AP) — North Korea’s Kim Jong Un vowed “full and unconditional support” for Russia’s Vladimir Putin on Wednesday as the two leaders isolated by the West held a summit that the U.S.",
      "publishedAt": "2023-09-13T04:03:14Z",
      "title": "North Korea's Kim vows full support for Russia at summit with Putin at a Far East spaceport",
      "url": "https://apnews.com/0d70f5190df1088ebe53e8ca19f8e9c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c6789bd8177427db19560a41ccd854d/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and YOUSEF MURAD",
      "description": "DERNA, Libya (AP) — The death toll from flooding that hit the eastern Libyan city of Derna reached more than 5,100 and was expected to rise further, a local health official said Wednesday, as authorities struggled to get aid to the coastal city where thousands remained missing and tens of thousands were homeless.",
      "publishedAt": "2023-09-13T07:20:18Z",
      "title": "Toll from devastating floods in Libyan city passes 5,100 dead, authorities struggle to get in aid",
      "url": "https://apnews.com/39081eb32e4fd426119f4b486c9c2ade",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f60ebb51e9754b41913006044d9ad99b/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Speaker Kevin McCarthy announced Tuesday he is directing the U.S.",
      "publishedAt": "2023-09-12T14:53:19Z",
      "title": "Speaker McCarthy directs the House to open an impeachment inquiry into President Biden",
      "url": "https://apnews.com/b187202be8814f7acbdd6e2e937e23d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd1ad56308d844a08580c90af893b5df/3000.jpeg"
    },
    {
      "author": "SAM METZ and MOSA'AB ELSHAMY",
      "description": "IMI N'TALA, Morocco (AP) — The stench of death wafted through the village of Imi N’Tala high up in Morocco’s Atlas Mountains four days after a deadly earthquake struck, slicing off a chunk of mountain, killing residents and razing the hamlet to the ground.",
      "publishedAt": "2023-09-13T11:05:30Z",
      "title": "International crews in Morocco to recover bodies days after deadly 6.8 quake earthquake struck",
      "url": "https://apnews.com/775ea447648078cd33c5d1c3d95eda0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a0bca06e60a429ca66cbd5f3648950b/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — A Ukrainian attack on a strategic shipyard early Wednesday in Russia-annexed Crimea wounded 24 people, damaged two ships undergoing repairs and caused a fire at the facility, Russian authorities reported.",
      "publishedAt": "2023-09-13T04:08:25Z",
      "title": "A Crimea shipyard is on fire after a Ukrainian attack that damaged 2 ships and injured 24 people",
      "url": "https://apnews.com/925cf5d35b53ea061d1dc73dd0cf329f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c744693f815456ea34a59303b8d2afe/2000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "HERZLIYA, Israel (AP) — They contended with bloody uprisings, destabilizing wars and even the assassination of a prime minister during their service. But for dozens of former Israeli security commanders, the policies of Prime Minister Benjamin Netanyahu’s far-right government are the biggest threat yet to the country’s future.",
      "publishedAt": "2023-09-13T05:11:55Z",
      "title": "Former leaders of Israel's security services are speaking out against Netanyahu's policies",
      "url": "https://apnews.com/cb8742ba0b0f210953669824568eab1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b127fdb75ed8479898b1208757651056/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Leaders of the United Auto Workers union are considering targeted strikes at a small number of factories run by each of Detroit’s three automakers if they can’t reach contract agreements by a Thursday night deadline.",
      "publishedAt": "2023-09-12T23:27:12Z",
      "title": "AP Sources: UAW may strike at small number of factories if it can't reach deals with automakers",
      "url": "https://apnews.com/a0b4b8b66e2001230fda0f2114ef78a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c7b98f8668043beb786244d411cbafb/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and MATT O'BRIEN",
      "description": "WASHINGTON (AP) — Senate Majority Leader Chuck Schumer has been talking for months about accomplishing a potentially impossible task: passing bipartisan legislation within the next year that encourages the rapid development of artificial intelligence and mitigates its biggest risks.",
      "publishedAt": "2023-09-13T04:04:02Z",
      "title": "Tech titans will give senators advice on artificial intelligence in a closed-door forum",
      "url": "https://apnews.com/efcfb1067d68ad2f595db7e92167943c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39685ec7debd41e281a0c54513a91e63/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA and MADDIE BURAKOFF",
      "description": "TEGUCIGALPA, Honduras (AP) — For decades, preventing dengue fever in Honduras has meant teaching people to fear mosquitoes and avoid their bites. Now, Hondurans are being educated about a potentially more effective way to control the disease — and it goes against everything they’ve learned.",
      "publishedAt": "2023-09-13T04:02:21Z",
      "title": "Special mosquitoes are being bred to fight dengue. How the old enemies are now becoming allies",
      "url": "https://apnews.com/9ecf4ebc8a67937e9db7feb0901c861e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d41f95e56594e7083ddbacb138b6112/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — A government watchdog agency in France has ordered Apple to withdraw the iPhone 12 from the French market, saying it emits levels of electromagnetic radiation that are too high.",
      "publishedAt": "2023-09-13T08:08:03Z",
      "title": "The iPhone 12 emits too much radiation and Apple must take it off the market, a French agency says",
      "url": "https://apnews.com/b51b82309100f959c83a2a19536dc934",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71f0b6aae36d45bd8387ff5551e7171e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}