{
  "articles": [
    {
      "author": "HALELUYA HADERO and MICHELLE L. PRICE",
      "description": "President-elect Donald Trump asked the Supreme Court on Friday to pause the potential TikTok ban from going into effect until his administration can pursue a “political resolution” to the issue. The request came as TikTok and the Biden administration filed opposing briefs to the court, in which the company argued the court should strike down a law that could ban the platform by Jan.",
      "publishedAt": "2024-12-27T22:44:11Z",
      "title": "Trump asks Supreme Court to delay TikTok ban so he can weigh in after he takes office",
      "url": "https://apnews.com/b96013a8447e9bdb5508ebe436aadf9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af5bd4c467994d769d0d85bce0ea3ce5/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The United States is expected to announce that it will send $1.25 billion in military assistance to Ukraine, U.S. officials said Friday, as the Biden administration pushes to get as much aid to Kyiv as possible before leaving office on Jan.",
      "publishedAt": "2024-12-27T19:42:45Z",
      "title": "US to send $1.25 billion in weapons to Ukraine, pushing to get aid out before Biden leaves office",
      "url": "https://apnews.com/9b926a275c235c59d591a649e2450746",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b32751b8716c4daa80660b6a0720442a/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Two Canadian Cabinet ministers left a meeting at Mar-a-Lago on Friday without assurances President-elect Donald Trump will back away from threatened tariffs on all products from the major American trading partner.",
      "publishedAt": "2024-12-27T23:05:13Z",
      "title": "Canadian Cabinet ministers meet with Trump's nominee for commerce secretary in bid to avoid tariffs",
      "url": "https://apnews.com/3ad63bf258bb4880749a93e830482d74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a494060b1fa4ff0b798965566b8e97e/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — Israeli airstrikes hit Yemen’s main airport as a civilian Airbus 320 with hundreds of passengers on board was landing and a U.N.",
      "publishedAt": "2024-12-27T23:57:03Z",
      "title": "Israeli airstrikes hit a Yemen airport as a jet with hundreds onboard was landing, UN official says",
      "url": "https://apnews.com/17690daff9dbb47c6ef7ce77447c5fe0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec7bd047300e482bb81e8f1a6bbe845c/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, FATMA KHALED and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli troops stormed one of the last hospitals operating in northern Gaza on Friday, forcing many staff and patients outside to strip in winter weather, the territory’s health ministry said.",
      "publishedAt": "2024-12-27T13:40:45Z",
      "title": "Israeli troops forcibly remove staff and patients from northern Gaza hospital, officials say",
      "url": "https://apnews.com/5bfab932afc29ce2205765ce1416a808",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94639035cd6c4f48ab25d60f00946f83/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "A genetic analysis suggests the bird flu virus mutated inside a Louisiana patient who contracted the nation’s first severe case of the illness, the U.S.",
      "publishedAt": "2024-12-27T16:20:29Z",
      "title": "Bird flu virus likely mutated within a Louisiana patient, CDC says",
      "url": "https://apnews.com/a870a8d4d86d3dd95f4c0d5c7e9edee5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d498f2182de24b339181237b7c4c0eba/2304.jpeg"
    },
    {
      "author": "KATE BRUMBACK and JEFF AMY",
      "description": "ATLANTA (AP) — A judge has ruled that the Georgia state Senate can subpoena Fulton County District Attorney Fani Willis as part of a inquiry into whether she has engaged in misconduct during her prosecution of President-elect Donald Trump but is giving Willis the chance to contest whether lawmakers' demands are overly broad.",
      "publishedAt": "2024-12-27T16:19:04Z",
      "title": "Court rules Georgia lawmakers can subpoena Fani Willis for information related to her Trump case",
      "url": "https://apnews.com/df925d8562e8cf4671c80e082c810a56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d9efe7b2cef493e84a744aa185668b4/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — A federal judge is signaling that Rudy Giuliani’s contempt hearing next Friday might not end so well for the former New York City mayor and onetime personal lawyer for President-elect Donald Trump as two Georgia election poll workers try to collect a $148 million defamation award they won against him.",
      "publishedAt": "2024-12-27T23:11:45Z",
      "title": "Judge signals that contempt hearing for Rudy Giuliani over his assets might not go well for him",
      "url": "https://apnews.com/4bd622388a8ef296f6a8ead1bff59462",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0c1d7ed414e4437bd73175878db3ad0/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "WEST PALM BEACH, Fla. (AP) — An online spat between factions of Donald Trump's supporters over immigration and the tech industry has thrown internal divisions in his political movement into public display, previewing the fissures and contradictory views his coalition could bring to the White House.",
      "publishedAt": "2024-12-27T18:42:42Z",
      "title": "An online debate over foreign workers in tech shows tensions in Trump's political coalition",
      "url": "https://apnews.com/40b78d2b413aa473e31ca063e4dd5fa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85470d0d2e0d49a79a5441619c1bda97/3000.jpeg"
    },
    {
      "author": "HALLIE GOLDEN",
      "description": "Greg Gumbel, a longtime CBS sportscaster who broke barriers during his career calling some of the biggest sporting events, has died from cancer, according to a statement from family released by the network on Friday.",
      "publishedAt": "2024-12-27T22:53:11Z",
      "title": "Sportscaster Greg Gumbel dies from cancer at age 78",
      "url": "https://apnews.com/ace2925dbb23282079fb2dba06efe9bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec8fa65cd19d4c9b8a5fd89a87edad6d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}