{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump faces ongoing questions about the Jeffrey Epstein case, overshadowing his administration's achievements. On Friday, reporters pressed the Republican president about pardoning Epstein's accomplice, Ghislaine Maxwell, but he deflected, emphasizing his administration's successes. Despite enacting significant policies, Trump's past ties to Epstein continue to stir controversy. Supporters demand transparency, believing Epstein's death in a New York jail cell six years ago hides a larger conspiracy. Administration officials who previously fueled theories now claim there's nothing more to reveal. Trump denies prior knowledge of Epstein's crimes and urges supporters to move on. But the Epstein case remains a challenging distraction.",
      "publishedAt": "2025-07-25T18:23:42Z",
      "title": "Trump's toughest test: Shifting focus from Epstein case",
      "url": "https://apnews.com/article/trump-epstein-conspiracies-97200cfab77572a36bc9ab25841a8833",
      "urlToImage": "https://dims.apnews.com/dims4/default/93c7fb4/2147483647/strip/true/crop/5419x3048+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2F62%2F122b3265e297602a281fe3f95151%2F170cc21c3aca46cb878f39bb5abcc39b"
    },
    {
      "author": null,
      "description": "Jeffrey Epstein's ex-girlfriend Ghislaine Maxwell has finished 1 1/2 days of interviews with Justice Department officials. Maxwell's lawyer said Friday she answered questions “about 100 different people.” Maxwell is serving a 20-year prison term in Tallahassee, Florida, for helping Epstein sexually abuse underage girls. Maxwell's interview is related to the controversy about the Epstein investigation. The Justice Department says it won't release any more files after pledging otherwise. Maxwell's attorney says she answered questions \"truthfully.\" Officials say Epstein killed himself in his New York jail cell while awaiting trial in 2019, but his case has generated endless conspiracy theories because of his and Maxwell’s links to famous people including Donald Trump.",
      "publishedAt": "2025-07-25T18:52:50Z",
      "title": "Epstein ex-girlfriend Maxwell finishes Justice Department interviews",
      "url": "https://apnews.com/article/epstein-maxwell-justice-department-interview-053ad2ae16f31b9d7300340d5f9349c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d72b0c/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2Fba%2Fdba98c0adca26f1abe444daa1180%2Fe3d23046583c48cb95cd286b063331b8"
    },
    {
      "author": null,
      "description": "President Donald Trump's visit to his Scottish golf resorts has prompted a major police operation. Thousands of officers in reflective yellow vests are patrolling around his Turnberry golf course to provide security and manage planned protests. The operation is expected to cost Scottish taxpayers millions of pounds. The union representing officers is concerned about the strain on already overworked police. Policing for Trump's previous visit to the U.K. in 2018 cost about $19 million. Assistant Chief Constable Emma Bond says the operation involves local, national and specialist resources. Protests are planned in Edinburgh, Aberdeen and Dumfries.",
      "publishedAt": "2025-07-25T12:32:41Z",
      "title": "Scottish police ramp up security for Trump's visit",
      "url": "https://apnews.com/article/scotland-trump-security-golf-protest-police-cd2431a5ef8729be68567243f4435880",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2cb436/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2Fc7%2Fedc8177a58e76fccb4beead9473f%2F9ef84e391dda45f2bfe749cc524505a7"
    },
    {
      "author": null,
      "description": "Ceasefire talks between Hamas and Israel are expected to resume next week as the war in Gaza nears it’s 22nd month and experts warn Palestinians are on the brink of famine. Hamas official, Bassem Naim said on Friday that he was told an Israeli delegation would depart for consultations early next week. His comments come a day after the United States recalled its negotiating team from Qatar and after President Donald Trump’s special envoy, Steve Witkoff said Hamas’ latest response to the negotiations showed a “lack of desire” to reach a truce. The sides have held weeks of talks in Qatar reporting small signs of progress but no major breakthroughs.",
      "publishedAt": "2025-07-25T12:10:44Z",
      "title": "Hamas says ceasefire talks expected to resume next week after U.S. and Israel recall negotiators",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-07-25-2025-86ad3aef03cb43cbc8b05c8037e8c5c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ef638f/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F66%2Fb74bb38b98e3ad597721c9a10b20%2Ff68b934decb149e4b96ca007d93afad9"
    },
    {
      "author": null,
      "description": "Florida Gov. Ron DeSantis says deportation flights from the remote Everglades immigration lockup known as ”Alligator Alcatraz″ began in the past few days. DeSantis said Friday that the flights operated by the Department of Homeland Security have transferred about 100 detainees from the immigration detention center to other countries. He expects that number to increase soon. Officials say two or three flights have happened, though they didn't say which countries those flights headed to. Critics have condemned the facility as cruel and inhumane, but DeSantis and other Republicans have defended it as part of the state’s aggressive push to support President Donald Trump’s crackdown on illegal immigration.",
      "publishedAt": "2025-07-25T14:27:41Z",
      "title": "Florida governor says deportation flights from 'Alligator Alcatraz' have started",
      "url": "https://apnews.com/article/alligator-alcatraz-desantis-immigration-264b9d3cf49be876ed6bcb32c07e23bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/936c00b/2147483647/strip/true/crop/5200x2925+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F24%2F3efc5ed46c9f9e5e55d2e70557e7%2F5240e3e2a6dd4758be381b5259c256cc"
    },
    {
      "author": null,
      "description": "Disgraced former U.S. Rep. George Santos is set to begin serving a seven-year prison sentence for the fraud charges that got him ousted from Congress. The New York Republican is slated to report to federal prison by 2 p.m. on Friday. It’s unclear where he’ll serve his time. Santos and his lawyers have declined to comment, as has the federal Bureau of Prisons. Santos pleaded guilty last summer to federal wire fraud and aggravated identity theft. He admitted that he deceived donors and stole the identities of nearly a dozen people to fund his congressional campaign. He served less than a year in Congress before being expelled in 2023.",
      "publishedAt": "2025-07-25T04:02:46Z",
      "title": "Ex-GOP Rep. George Santos to start 7-year prison term for fraud charges",
      "url": "https://apnews.com/article/george-santos-fraud-prison-29cdb8a9e9dfe7283d53091a6e20b1ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/42ea047/2147483647/strip/true/crop/4300x2419+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F94%2F4281e8d3fa1104babea46f18ca67%2Fbe27fd344308436cab27ce0e430dbd7d"
    },
    {
      "author": null,
      "description": "Hulk Hogan's death has sparked mixed reactions, especially among Black wrestling fans and commentators. Many remember Hogan as a wrestling icon who broadened the sport's appeal. However his well-documented racism and controversial behavior have resurfaced. Some fans struggle with his legacy, while others celebrate his achievements. Yet, his past use of racial slurs and political endorsements have left many questioning his sincerity. This reflects broader issues of race in wrestling and American society. Some fans remain devoted to the sport despite the contradictions.",
      "publishedAt": "2025-07-25T16:37:06Z",
      "title": "Black wrestling fans reflect on Hulk Hogan's legacy on issues of race",
      "url": "https://apnews.com/article/hulk-hogan-death-black-americans-wrestling-legacy-bde576793d6de5954d8b903f33de5fb7",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb3ef29/2147483647/strip/true/crop/2998x1686+0+132/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2Ff8%2F310123ee122bc74c6d704944d36a%2Ff2c6a8174bfb4b3b87fbb3ed6bb16b7d"
    },
    {
      "author": null,
      "description": "The Trump administration is releasing billions of dollars in grants to schools for adult literacy, English language instruction and other programs, the Education Department said Friday. President Donald Trump’s administration had withheld $6 billion in funding on July 1 as part of a review to ensure spending aligned with the White House’s priorities. Officials later said the department would release $1.3 billion of the money for after-school programs, days after 10 Republican senators sent a letter imploring the administration to allow frozen education money to be sent to states.",
      "publishedAt": "2025-07-25T18:16:02Z",
      "title": "Trump administration releases $6B in school grants after freeze",
      "url": "https://apnews.com/article/trump-education-freeze-school-grants-released-gop-f9ac79dd44595fc9d8a3c72609cb5574",
      "urlToImage": "https://dims.apnews.com/dims4/default/3fdf69b/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F84%2Fed90cd52afd2598ae62dc62a5eeb%2F666b0d98b6e84a61bd7f78ba3cd85d3c"
    },
    {
      "author": null,
      "description": "Lori Vallow Daybell has been sentenced to life in prison on two murder conspiracy convictions in Arizona. The punishments mark an end to a winding legal saga for the mother with doomsday religious beliefs who claimed people in her life had been possessed by evil spirits. Vallow Daybell is already serving life sentences in Idaho in the killings of her two youngest children and a romantic rival. She was convicted at separate trials this spring in Phoenix of conspiring to murder her estranged husband, Charles Vallow, and her niece’s ex-husband, Brandon Boudreaux. Vallow was killed, while Boudreaux survived the attack.",
      "publishedAt": "2025-07-25T03:46:13Z",
      "title": "Idaho mom Lori Vallow Daybell sentenced to life in prison on Arizona convictions",
      "url": "https://apnews.com/article/lori-vallow-daybell-idaho-arizona-sentencing-doomsday-b81602158ad47c27a907d28086e213f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/10e2db2/2147483647/strip/true/crop/1018x573+0+53/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F9d%2F4a3df23ff461bea1eef7247c4675%2F849ff05332ca41fbae7a3c7c67cc4f6c"
    },
    {
      "author": null,
      "description": "A scientific journal has retracted a controversial study that hinted at the possibility of a bizarre life form. Over a decade ago, scientists said they'd discovered bacteria that uses the poisonous element arsenic to grow. Several research groups failed to replicate the results, saying it wasn’t possible for a living thing to use something so toxic to make DNA and proteins. Thursday, the journal Science, which first published the research, retracted it, though not because of misconduct on the researchers’ part. The researchers disagree with the journal’s decision and stand by their data.",
      "publishedAt": "2025-07-25T18:05:27Z",
      "title": "A NASA-funded study that hinted at a bizarre life form in Mono Lake has been retracted",
      "url": "https://apnews.com/article/arsenic-alien-life-mono-lake-nasa-bacteria-eb6b70b302457e4066006a17257d536b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a592ce/2147483647/strip/true/crop/2000x1125+0+78/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Fd5%2Fa5bd9408b6b68efd27aa6216a98d%2F7e55967bf31f4bfc84dffbde6537a32b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}