{
  "articles": [
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — A cargo ship lost power and rammed into a major bridge in Baltimore early Tuesday, destroying the span in a matter of seconds and plunging it into the river in a terrifying collapse that could disrupt a vital shipping port for months.",
      "publishedAt": "2024-03-26T07:10:17Z",
      "title": "Baltimore bridge collapses after powerless cargo ship rams into support column; 6 presumed dead",
      "url": "https://apnews.com/53169b379820032f832de4016c655d1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8521ff4366b479da4b05d8190e4ffb9/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A New York judge Tuesday issued a gag order barring Donald Trump from commenting publicly about witnesses, prosecutors, court staff and jurors in his upcoming hush-money criminal trial, citing the former president's history of “threatening, inflammatory, denigrating\" remarks about people involved in his legal cases.",
      "publishedAt": "2024-03-26T18:59:05Z",
      "title": "Judge issues gag order barring Donald Trump from commenting on witnesses, others in hush money case",
      "url": "https://apnews.com/68317dee722581bfbde51c305788b614",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d8ee630ae7547f484839522c5309acd/2000.jpeg"
    },
    {
      "author": "JONATHAN LANDRUM Jr.",
      "description": "LOS ANGELES (AP) — Sean “Diddy\" Combs' lawyer said Tuesday that the searches of the rapper's Los Angeles and Miami properties by federal authorities in a sex trafficking investigation were ”a gross use of military-level force\" and that Combs is “innocent and will continue to fight\" to clear his name.",
      "publishedAt": "2024-03-26T21:40:59Z",
      "title": "Sean 'Diddy' Combs' lawyer says raids of the rapper's homes were 'excessive' use of military force",
      "url": "https://apnews.com/74a31ab6d1778ef84f1b97e7578dc906",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/445c9fe369154d08bd18511212def496/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE, AMANDA SEITZ and CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — U.S. Supreme Court justices on Tuesday did not appear ready to limit access to the abortion pill mifepristone, in a case that could have far-reaching implications for millions of American women and for scores of drugs regulated by the Food and Drug Administration.",
      "publishedAt": "2024-03-26T20:17:45Z",
      "title": "5 takeaways from the abortion pill case before the U.S. Supreme Court",
      "url": "https://apnews.com/7fe897ec4f5b3121dc73d5b74b5a0d6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21dffb1904cb4d99aada29c57697cb5d/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — NBC News will cut ties with former Republican National Committee chief Ronna McDaniel, hired last week as an on-air political contributor, following a furious protest by some of its journalists and commentators, according to a memo from the top official of the network's news division.",
      "publishedAt": "2024-03-26T22:45:33Z",
      "title": "NBC says it will cut ties with former RNC head Ronna McDaniel after days of employee objections",
      "url": "https://apnews.com/483647e9eca547a981002e4179d3b2e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a26262db5d2f475ba96c86d385306ae4/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and MEG KINNARD",
      "description": "OAKLAND, Calif. (AP) — Robert F. Kennedy Jr. chose Nicole Shanahan on Tuesday to be his vice presidential pick, adding a wealthy but nationally unknown figure to his independent White House bid that's trying to appeal to voters disaffected by a rematch of the 2020 election.",
      "publishedAt": "2024-03-26T04:10:32Z",
      "title": "Robert F. Kennedy Jr. picks Nicole Shanahan as his running mate for his independent White House bid",
      "url": "https://apnews.com/6be6d7e04ba7d9e74190b8c01a1bf075",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73df7484dbd045668e5d9a137f5f78cd/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Shares of Donald Trump’s social media company rose about 16% in the first day of trading on the Nasdaq, boosting the value of Trump's large stake in the company as well as the smaller holdings of fans who purchased shares as a show of support for the former president.",
      "publishedAt": "2024-03-26T07:01:27Z",
      "title": "Trump's social media company gains in its first day of trading on Nasdaq",
      "url": "https://apnews.com/106d7c423174ca1d7cc3cc9a3f3897a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fc9beca1f444f8eb190c1d31c128809/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Texas Attorney General Ken Paxton on Tuesday agreed to pay nearly $300,000 in restitution under a deal to end criminal securities fraud charges that have shadowed the Republican for nearly a decade.",
      "publishedAt": "2024-03-26T04:05:51Z",
      "title": "Texas AG Ken Paxton reaches deal to end securities fraud charges after 9 years",
      "url": "https://apnews.com/9ed5eecc30c1f967ec51f7e58ad9d0af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3ce571a8a7e498dabbf6b50e4acdb38/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — As Israel battles a prolonged war in Gaza, broad exemptions from mandatory military service for ultra-Orthodox men have reopened a deep divide in the country and rattled the government coalition, with Prime Minister Benjamin Netanyahu’s fellow War Cabinet members staunchly opposed to his proposed new conscription law.",
      "publishedAt": "2024-03-26T15:51:13Z",
      "title": "With its soldiers mired in Gaza, Israel fights a battle at home over drafting the ultra-Orthodox",
      "url": "https://apnews.com/b91733c886246e2c69ca525f71c78053",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7b6592b97f14ade8cef02eacf945726/1920.jpeg"
    },
    {
      "author": "JAMES ROBSON",
      "description": "MANCHESTER, England (AP) — Ricky Hill packed his bags and prepared to uproot his life again. Next stop: Chicago. The former England international soccer player is accustomed to making sacrifices and traveling far to build his coaching career, an effort he says has been stymied because he is Black.",
      "publishedAt": "2024-03-26T08:56:23Z",
      "title": "Black coaches are rare in soccer. Is this because of a lack of diversity in the boardroom?",
      "url": "https://apnews.com/eddf17b8063762a5ee26232e97966c1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f3387c2254048819535dc8d9a5318dd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}