{
  "articles": [
    {
      "author": "PAUL WISEMAN",
      "description": "President Donald Trump said this week that tariffs on U.S. neighbors Canada and Mexico will arrive Saturday. The two nations are not only close geographically, but economically as well. The business between the North American nations now exceeds China, totaling $1.8 trillion in 2023. That is far greater than the $643 billion in commerce that the U.S. did with China in that same year. Following are just a few imported goods that could be hit first.",
      "publishedAt": "2025-01-31T12:43:44Z",
      "title": "Trump tariffs on Mexico and Canada could land this weekend. Here are some goods in the crosshairs",
      "url": "https://apnews.com/article/america-canada-mexico-tariffs-trump-trade-4568dababcf524945333bb518232ec4b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a386812/2147483647/strip/true/crop/2250x1266+0+117/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F21%2F20ffe7a55af9fab7724a337e6938%2F6da0acf14de24a4581f40a4d9fe979a2"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER",
      "description": "The Trump administration has fired a group of prosecutors involved in the Jan. 6 criminal cases and demanded the names of FBI agents involved in those same probes so that they can possibly be ousted. The moves that reflect a White House determination to exert control over federal law enforcement and purge the agencies of career employees seen as insufficiently loyal. Acting Deputy Attorney General Emil Bove ordered the firings of the group of Jan. 6 prosecutors days after President Donald Trump’s sweeping clemency action benefiting the more than 1,500 people charged in the U.S. Capitol attack. A separate memo by Bove identified more than a half-dozen FBI senior executives who were ordered to resign or be fired by Monday.",
      "publishedAt": "2025-01-31T20:00:28Z",
      "title": "Trump admin moving to fire FBI agents involved in investigations of president",
      "url": "https://apnews.com/article/trump-fbi-firing-a7b19a5f414ce82c6f6b5f6656000d23",
      "urlToImage": "https://dims.apnews.com/dims4/default/75f0bb3/2147483647/strip/true/crop/5777x3250+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F7b%2Ff17837024f314d7f87e3d9f43214%2F7512c874e72e4e7683c9e1f56ab01033"
    },
    {
      "author": "MICHELLE R. SMITH",
      "description": "A letter submitted to the U.S. Senate that states it was sent by physicians in support of Robert F. Kennedy Jr.’s nomination as secretary of Health and Human Services includes the names of doctors who have had their licenses revoked, suspended or faced other discipline. The Associated Press has also found that many of the nearly 800 signers of the letter are not doctors. Among those who signed it were a self-described journalist, a certified public accountant, a firefighter/paramedic, a certified health coach and someone who said they had a bachelor’s degree “with an emphasis on Jungian Psychology.”",
      "publishedAt": "2025-02-01T05:03:31Z",
      "title": "Some doctors who signed letter in support of RFK Jr. had licenses revoked.",
      "url": "https://apnews.com/article/trump-cabinet-kennedy-health-secretary-doctors-vaccines-a3dc5bdb0be5da29dccaef91c19c9ce4",
      "urlToImage": "https://dims.apnews.com/dims4/default/966c3ec/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F15%2F061f8496ffebf8fbb34dd52fa3f9%2Ff8e6b5cf45044cea9ebc3436225d2b49"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "Democrats are poised to elect a new leader in a low-profile Democratic National Committee election that could have big implications for the party’s future. The party is desperately seeking a new message and messengers to push back against the Trump administration. The leading candidates in Saturday's election are Wisconsin’s Ben Wikler and Minnesota’s Ken Martin. They’re little-known state party chairs who are promising to refocus on working-class voters, strengthen Democratic infrastructure and improve the party’s anti-Trump rapid response system. More than 400 DNC members from every state and U.S. territory have gathered in suburban Washington for the election. The candidates acknowledge that the Democratic brand is badly damaged, but few are promising fundamental changes.",
      "publishedAt": "2025-02-01T05:04:32Z",
      "title": "Democrats to elect new leader of national committee as party struggles to repair brand",
      "url": "https://apnews.com/article/democratic-national-committee-dnc-chair-martin-wikler-fcc229d9619aa93f8f8574b0face4334",
      "urlToImage": "https://dims.apnews.com/dims4/default/f5cdff4/2147483647/strip/true/crop/5077x2856+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F61%2Fc282809361c973c6bfd2de626ef4%2Fad18874c2ced460aaed8309ec4797161"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "President Donald Trump has targeted the rights of transgender people in executive orders in his first two weeks back in office. He wants to use a federal definition of the sexes that excludes them, a reversal from President Joe Biden's administration policies that sought to expand legal protections. Trump has opened the door to ousting transgender service members from the military and is halting government funding for gender-affirming health care for young people. He also wants to reverse state and local policies that say students' preferred pronouns should be used in schools. Some of the orders are already facing court challenges and others are expected to.",
      "publishedAt": "2025-02-01T05:01:26Z",
      "title": "Trump's orders and policies target transgender people",
      "url": "https://apnews.com/article/trump-transgender-order-passports-prisons-military-3c14ecbdd10f61618384e81624d090fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe3d5ef/2147483647/strip/true/crop/5724x3220+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F89%2F02b5ff94141b3e76dee66e94dad8%2F2e6c4e72fe6b485ea0bbcc1324e5d92c"
    },
    {
      "author": "WAAFA SHURAFA",
      "description": "Hamas-led militants are set to release three male hostages from the Gaza Strip on Saturday, in return for the release of dozens of Palestinian prisoners as part of a fragile ceasefire with Israel that has halted more than a year of intense fighting and has so far seen 15 hostages and hundreds of prisoners freed. Hamas and Israeli officials on Friday named the hostages to be released as Yarden Bibas, 35, American-Israeli Keith Siegel, 65, and French-Israeli Ofer Kalderon, 54, in the fourth such exchange since the ceasefire began on Jan. 19. The inclusion of Yarden Bibas has brought renewed attention to the plight of his wife Shiri and two young sons, Ariel and Kfir, who were the youngest hostages to have been taken in the Oct. 7, 2023 attack.",
      "publishedAt": "2025-02-01T05:30:36Z",
      "title": "Hamas to release 3 male hostages, Israel to release dozens of Palestinian prisoners under ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-01-2025-bb560151db1437d0b35ac1d568457a46",
      "urlToImage": "https://dims.apnews.com/dims4/default/173e7b0/2147483647/strip/true/crop/8088x4550+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F18%2F64294cf028d515c7ea69edddde2a%2Fdb0fa9a1c85047c7b728c50217af9867"
    },
    {
      "author": "MARYCLAIRE DALE",
      "description": "Around the United States, colleges and universities are cautiously navigating the Trump administration's crackdown on diversity, equity and inclusion initiatives. Schools are reassessing programs, courses and job titles that could run afoul of President Donald Trump's recent executive orders. As they figure out how to adapt, some schools are staying quiet out of uncertainty or fear. Others have vowed to stand firm. The president of Mount Holyoke College says she hopes colleagues in higher education will not capitulate to Trump’s vision for the country.",
      "publishedAt": "2025-02-01T05:01:33Z",
      "title": "Colleges change program names, review titles under Trump's DEI orders",
      "url": "https://apnews.com/article/trump-dei-college-university-9f26a51617744de5c3f929a293027758",
      "urlToImage": "https://dims.apnews.com/dims4/default/a8e2409/2147483647/strip/true/crop/5706x3210+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F25%2F90a3de9d9e11fc4e76367e5645bb%2F4a19430458b3448aa3151f0ca654c357"
    },
    {
      "author": "LOLITA C. BALDOR, TARA COPP, ADRIANA GOMEZ LICON, LEA SKENE",
      "description": "A midair collision between an Army helicopter and an American Airlines flight from Kansas has killed all 67 people aboard the two aircraft. That was the word from authorities Thursday as they scrutinized the actions of the military pilot after the country’s deadliest aviation disaster in almost a quarter century. At least 28 bodies were pulled from the icy waters of the Potomac River after the helicopter apparently flew into the path of the jet late Wednesday while it was landing at Ronald Reagan National Airport near Washington. The plane carried 60 passengers and four crew. Three soldiers were aboard the helicopter.",
      "publishedAt": "2025-01-31T05:09:23Z",
      "title": "Midair collision kills 67 people in the deadliest US air disaster in almost a quarter century",
      "url": "https://apnews.com/article/ronald-reagan-national-airport-crash-325edc6c0c2439dd6c1e73a81e382c0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb5006c/2147483647/strip/true/crop/5606x3153+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F5e%2F2906f862faa347ab67a750b218ee%2F6bf61d420d0b48b496f94fb121f81120"
    },
    {
      "author": "ZEKE MILLER, AAMER MADHANI, JOSH BOAK",
      "description": "Canada and Mexico say they’ve prepared the option of retaliatory tariffs to be used if necessary now that the White House says the U.S. will put in place 25% tariffs on imports from them this weekend. Canadian Prime Minister Justin Trudeau says tariffs would have “disastrous consequences” for the U.S., putting American jobs at risk and causing prices to rise. Mexican President Claudia Sheinbaum says Mexico has a “Plan A, Plan B, Plan C for what the United States government decides.” The White House on Friday provided no word on whether there would be any exemptions to the measures that could result in swift price increases to U.S. consumers.",
      "publishedAt": "2025-01-31T18:43:55Z",
      "title": "White House says Trump tariffs on Canada, Mexico and China will come Saturday. No word on exemptions",
      "url": "https://apnews.com/article/trump-tariffs-china-canada-mexico-fentanyl-e526616cdcb7fc596ed999cb89ee2265",
      "urlToImage": "https://dims.apnews.com/dims4/default/189f603/2147483647/strip/true/crop/3295x1853+0+174/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F48%2F89d3dd8690985edc8eae9de02397%2F02d1baf5cbed4fe5aae65c51b8f020cc"
    },
    {
      "author": "MICHAEL R. SISAK, MATT ROURKE",
      "description": "A medical transport jet carrying a child patient, her mother and four others has crashed into a Philadelphia neighborhood about 30 seconds after taking off, erupting in a fireball and engulfing several homes in flames. All six people aboard were from Mexico. The child had been treated in Philadelphia for a life-threatening condition and was being transported home. The crash comes two days after the country’s deadliest aviation disaster in almost a quarter century, in Washington, D.C.",
      "publishedAt": "2025-02-01T06:38:23Z",
      "title": "A medical plane carrying a child patient and 5 others crashes in Philadelphia, setting homes ablaze",
      "url": "https://apnews.com/article/philadelphia-plane-crash-medical-transport-8617dab53471190832dd73db149489fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/8147e8f/2147483647/strip/true/crop/5276x2968+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F91%2Fc77b4e96c4125b1b48d4e988a1e0%2F7ce95b1312e04f01b8bb6c1c3ae4b804"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}