{
  "articles": [
    {
      "author": "MICHELLE L. PRICE and WILL WEISSERT",
      "description": "NEW YORK (AP) — Donald Trump on Monday blamed without evidence President Joe Biden and Vice President Kamala Harris for inspiring another apparent attempt on his life, deriding their criticism of him as a threat to democracy despite his own long history of inflammatory campaign rhetoric and advocacy for jailing or prosecuting his political enemies.",
      "publishedAt": "2024-09-16T12:53:46Z",
      "title": "Trump rips Biden and Harris' rhetoric against him despite his own history of going after rivals",
      "url": "https://apnews.com/836523f3bbecf4a183dc46fbefd8230a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17411c2a4edf487f8ed8c0ecbd876ba2/1920.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER, AUDREY McAVOY, BERNARD CONDON and MICHAEL R. SISAK",
      "description": "KAAAWA, Hawaii (AP) — Ryan Wesley Routh portrayed himself online as a man who built housing for homeless people in Hawaii, tried to recruit fighters for Ukraine to defend itself against Russia, and described his support and then disdain for Donald Trump — even urging Iran to kill him.",
      "publishedAt": "2024-09-16T13:47:19Z",
      "title": "Man accused of trying to kill Trump wrote a book urging Iran to assassinate the ex-president",
      "url": "https://apnews.com/f76ed09f256f6bd21727a10901d92af7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc94a3d7a46246058373cafefcb64da3/1920.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — Sunday was to be a day of relative rest for Donald Trump, a rare breather this deep into a presidential campaign. Aside from sounding off on social media, golf was on the agenda.Then the Secret Service spotted the muzzle of a rifle sticking out of a fence in bushes at Trump's West Palm Beach golf club, and everything changed.",
      "publishedAt": "2024-09-16T05:42:30Z",
      "title": "Trump was on the links taking a breather from the campaign. Then the Secret Service saw a rifle",
      "url": "https://apnews.com/f0ace849dda2b99cb281aed5b9a7ea95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/260a3c78787048efb68affc19398c242/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The FBI said former President Donald Trump was the target of “what appears to be an attempted assassination ” at his golf club in West Palm Beach, Florida, on Sunday, just nine weeks after the Republican presidential nominee survived another attempt on his life.",
      "publishedAt": "2024-09-16T13:30:45Z",
      "title": "The Latest: Suspect in apparent assassination attempt against Trump charged with federal gun crimes",
      "url": "https://apnews.com/3b823cbca83546502fb92d13f5b3950f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6a7c0586bd941f0951ddf8f5641b8f3/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "LA PORTE, Texas (AP) — A massive pipeline fire in suburban Houston was shooting a giant plume of fire into the air for more than two hours on Monday as first-responders evacuated a surrounding neighborhood where some homes have caught fire.",
      "publishedAt": "2024-09-16T16:09:12Z",
      "title": "A pipeline has exploded and is on fire in a Houston suburb, forcing evacuations",
      "url": "https://apnews.com/659141b9f88ed2b324c36fce2735746f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9cb9f84962d44f589fcd0104e07ef32/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "Among the last words heard from the crew of an experimental submersible headed for the wreck of the Titanic were “all good here,” according to a visual re-creation of the journey of the Titan before it imploded, killing all five on board.",
      "publishedAt": "2024-09-16T04:03:51Z",
      "title": "A former engineering director for the Titan says he felt pressured to get the submersible ready",
      "url": "https://apnews.com/2ae3c044e50a69647bd42cffe96c7f98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f387e103eb45412d80f15f4e748994a0/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "The U.S. government and TikTok will go head-to-head in federal court on Monday as oral arguments begin in a consequential legal case that will determine if – or how — a popular social media platform used by nearly half of all Americans will continue to operate in the country.",
      "publishedAt": "2024-09-16T04:01:17Z",
      "title": "TikTok heads to court over US law that could lead to a ban on the popular platform",
      "url": "https://apnews.com/9bb5407c93b2ab99548db17b95dc2259",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f736fa0caea54c4bac85b171e06cf3cf/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Palestinian officials say Israeli airstrikes killed 16 people in the Gaza Strip on Monday, including five women and four children.A strike flattened a home in the built-up Nuseirat refugee camp in central Gaza, killing at least 10 people there, including four women and two children.",
      "publishedAt": "2024-09-16T05:31:45Z",
      "title": "Israel-Hamas war latest: Israeli airstrikes kill 16 in Gaza, including 4 children, Palestinians say",
      "url": "https://apnews.com/a794f441dbfddebe87fd9b95c28008fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f98ceff7869845ccb88f3f3924aa3733/3000.jpeg"
    },
    {
      "author": "THALIA BEATY and JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — Warren Buffett's adult children — Susie, Howard and Peter Buffett — have long track records as philanthropists, giving away more than $15 billion of their dad's money through their foundations since 2006.",
      "publishedAt": "2024-09-16T14:15:12Z",
      "title": "Giving away a fortune: What could Warren Buffett's adult children support?",
      "url": "https://apnews.com/fd195032b2253e2f791fc3e40df5c771",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3006f45b5eaa441cbb4393063330fc67/2993.jpeg"
    },
    {
      "author": "ALLEN G. BREED",
      "description": "Immigrants seeking to become United States citizens have to show a working knowledge of the nation’s history and how the federal government functions. And they don’t get multiple choices.Could YOU pass even a dumbed-down citizenship test?",
      "publishedAt": "2024-09-16T04:54:44Z",
      "title": "Could YOU pass a citizenship test?",
      "url": "https://apnews.com/bfeee2f2bfa19f8481d469aab258c684",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a1e4230f9a24e00ab30b01f679b22aa/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}