{
  "articles": [
    {
      "author": "WAFAA SHURAFA and TIA GOLDENBERG",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across the Gaza Strip overnight and into Sunday killed at least 20 people, including five children, Palestinian medical officials said.",
      "publishedAt": "2024-12-22T08:38:02Z",
      "title": "Israeli strikes across Gaza kill at least 20 as Vatican envoy visits Christians in the territory",
      "url": "https://apnews.com/6638c448bcc5780d98c3e8284ce58fe1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eba8ecd7fa08483288666d8a1bda2970/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and FATMA KHALED",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Winter is hitting the Gaza Strip and many of the nearly 2 million Palestinians displaced by the devastating 14-month war with Israel are struggling to protect themselves from the wind, cold and rain.",
      "publishedAt": "2024-12-22T05:03:45Z",
      "title": "Winter is hitting Gaza and many Palestinians have little protection from the cold",
      "url": "https://apnews.com/24fe23c8ae2743294c169cff4a1431d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5af5af4bff5e44f9af6d524c3163518e/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Two U.S. Navy pilots were shot down Sunday over the Red Sea in an apparent “friendly fire” incident, the U.S military said, marking the most serious incident to threaten troops in over a year of America targeting Yemen's Houthi rebels.",
      "publishedAt": "2024-12-22T02:57:03Z",
      "title": "Two US Navy pilots shot down over Red Sea in apparent 'friendly fire' incident, US military says",
      "url": "https://apnews.com/95a792daae3b0120186bfc6c66e1b6fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e683e86545a545a4ba0a968a30311969/3000.jpeg"
    },
    {
      "author": "MICHAEL PROBST and VANESSA GERA",
      "description": "MAGDEBURG, Germany (AP) — German authorities received a warning last year about the suspected perpetrator in a car attack at a Christmas market, a government office said Sunday as more details emerged about the five people killed in the attack.",
      "publishedAt": "2024-12-22T09:26:37Z",
      "title": "German authorities received a warning last year about the suspect in Christmas market attack",
      "url": "https://apnews.com/f14b036514e9ae2d4ca013cf45eac18f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/122139f820174605ac42b65044ab7176/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, STEPHEN GROVES, JILL COLVIN and JOSH BOAK",
      "description": "WASHINGTON (AP) — After days of threats and demands, Donald Trump had little to show for it once lawmakers passed a budget deal in the early hours of Saturday, narrowly averting a pre-Christmas government shutdown.",
      "publishedAt": "2024-12-21T20:38:59Z",
      "title": "What Trump's decision to wade into spending fight tells us about the next 4 years",
      "url": "https://apnews.com/e0258d31a9018c7af09afc11a8634707",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f57511b8ab4a478ca4171ec71e155388/1920.jpeg"
    },
    {
      "author": "DYEPKAZAH SHIBAYAN",
      "description": "ABUJA, Nigeria (AP) — The death toll from stampedes during two Christmas charity events in Nigeria has increased from 13 to 32, police said Sunday.",
      "publishedAt": "2024-12-22T09:49:14Z",
      "title": "Stampedes in Nigeria leave at least 32 dead in a rush to get Christmas gifts",
      "url": "https://apnews.com/eaf1e6d852a7014f24166c948d7e906a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba2797de76a947dfa98cfc505a46cb72/3000.jpeg"
    },
    {
      "author": "FLORENCE MIETTAUX",
      "description": "AYOD, South Sudan (AP) — Long-horned cattle wade through flooded lands and climb a slope along a canal that has become a refuge for displaced families in South Sudan.",
      "publishedAt": "2024-12-22T04:08:20Z",
      "title": "As flooding becomes a yearly disaster in South Sudan, thousands survive on the edge of a canal",
      "url": "https://apnews.com/dde718e68427f931d08eb0fb35f3927d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/433b2c05ad784b38aa5abdc979559993/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "QARDAHA, Syria (AP) — On the walls of the palatial mausoleum built to house the remains of former Syrian President Hafez Assad, vandals have sprayed variations of the phrase, “Damn your soul, Hafez.”",
      "publishedAt": "2024-12-22T05:04:54Z",
      "title": "In Assad's hometown, few shared in his family's fortune. They hope they won't share in his downfall",
      "url": "https://apnews.com/cbeb4ab8d5bf4bacc75fb9792bb4cd14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09ffd4810ddf41108f74d4ddec5e3098/3000.jpeg"
    },
    {
      "author": "JOSH DUBOW",
      "description": "OAKLAND, Calif. (AP) — Hall of Famer Rickey Henderson, the brash speedster who shattered stolen base records and redefined baseball's leadoff position, has died.",
      "publishedAt": "2024-12-21T23:20:24Z",
      "title": "Hall of Famer Rickey Henderson, baseball's stolen base king, has died at 65",
      "url": "https://apnews.com/bdeb785acf343e95fc53d008b2f8803e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3b8bcb7cd6f4e2296495901b47a34d2/3000.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — Plunging participation in girls basketball led one of Nebraska's largest high schools to cancel its varsity team for the year. The decision by Grand Island Senior High School — the state's third-largest with more than 2,600 students — reflects a national decline in participation in the girls sport, even as the popularity of women's basketball behind the likes of Caitlin Clark and Angel Reese has sent record numbers of fans flocking to arenas or tuning in on TV.",
      "publishedAt": "2024-12-22T05:04:48Z",
      "title": "Caitlin Clark effect hasn't reversed the decades-long decline in girls basketball participation",
      "url": "https://apnews.com/a6976a4e8da83067ae564da5cc6a3b5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2157a70e7787493b8371f88107ed7d28/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}