{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump’s special envoy has arrived in Israel to address the worsening humanitarian crisis in Gaza. Over the past 24 hours, at least 91 Palestinians have been killed and more than 600 wounded while trying to get aid, according to the Gaza Health Ministry. The Israeli military has not commented on the strikes, stating it targets militants and blames civilian deaths on Hamas. The envoy, Steve Witkoff, plans to meet with Prime Minister Benjamin Netanyahu to discuss the situation and a possible ceasefire. Meanwhile, international pressure on Israel to increase aid continues to grow.",
      "publishedAt": "2025-07-31T12:37:05Z",
      "title": "Death toll rises in Gaza as Trump's envoy visits to discuss aid",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-07-31-2025-d9d578ecf303c0f4e8b14074eb980101",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb9a63c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fdc%2F78c0d5f0471302eef9db365ff3fe%2Fce82a63cfbb946e0b8b637fbc29f1d8a"
    },
    {
      "author": null,
      "description": "President Donald Trump says there will be a 90-day negotiating period with Mexico after a call with that country’s leader, Claudia Sheinbaum, as the 25% tariff rates stay in place. Trump posted on Truth Social on Thursday his phone conversation with Sheinbaum was “very successful in that, more and more,\" they are \"getting to know and understand each other.” Trump says goods from Mexico imported into the U.S. would continue to face a 25% tariff he has ostensibly linked to fentanyl trafficking. The Republican president says autos would face a 25% tariffs, while copper, aluminum and steel would be taxed at 50%.",
      "publishedAt": "2025-07-31T15:15:07Z",
      "title": "Trump announces 90-day negotiating period with Mexico on tariffs",
      "url": "https://apnews.com/article/trump-tariffs-mexico-3b03b98296424e59c7dc19a865d21969",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb0a4f9/2147483647/strip/true/crop/4697x2642+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Fbe%2Fce85f03d3ea9cca2f765b5e09e56%2F12c52b8a660241b7ba3fc62aef2442f9"
    },
    {
      "author": null,
      "description": "President Donald Trump may have gotten his way with tariffs on some countries, but his overhaul of American trade policy has not gone unchallenged. In May, a three-judge panel of the U.S. Court of International Trade agreed that Trump exceeded his powers when he declared a national emergency to plaster tariffs on imports from almost every country in the world. On Thursday, the U.S. Court of Appeals for the Federal Circuit in Washington will hear oral arguments in the case, which is likely headed to the Supreme Court. Trump is facing at least seven lawsuits charging that he’s overstepped his authority. The plaintiffs want his biggest, boldest tariffs thrown out.",
      "publishedAt": "2025-07-31T04:01:06Z",
      "title": "Triumphant in trade talks, Trump and his tariffs still face a challenge in federal court",
      "url": "https://apnews.com/article/trump-tariffs-court-lawsuit-trade-4c289f51008f6a3a02939caa73ab5404",
      "urlToImage": "https://dims.apnews.com/dims4/default/8721596/2147483647/strip/true/crop/3199x1799+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fa2%2F427bcf32ee1ec7d4c5ef916b872c%2Fad97438b152d4cd2a8265b00911db571"
    },
    {
      "author": null,
      "description": "Ukrainian authorities say a Russian drone and missile attack on Ukraine’s capital killed at least six people including a 6-year-old boy. Kyiv City Military Administration head Tymur Tkachenko said Thursday that at least 52 other people were injured in the attacks, and that the number was likely to rise. A large part of a nine-story residential building collapsed after it was struck, Tkachenko added. Rescue teams were at the scene to rescue people trapped under the rubble. Western leaders have accused Putin of dragging his feet in U.S.-led peace efforts in an attempt to capture more Ukrainian land.",
      "publishedAt": "2025-07-31T06:03:39Z",
      "title": "Russia hits Kyiv with missile and drone attack, killing 6 and injuring 52",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-attack-76b7e62e44e79a6475c84ce9aaf0fbf2",
      "urlToImage": "https://dims.apnews.com/dims4/default/02b5b86/2147483647/strip/true/crop/8415x4733+0+438/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F12%2Fad0ffd4460c70539fb9dfef6c393%2F29496f7803b34983848959b98bd3f314"
    },
    {
      "author": null,
      "description": "The family of Jeffrey Epstein accuser Virginia Giuffre has expressed shock over President Donald Trump saying the disgraced New York financier “stole” her from him. Giuffre's family also says Epstein's ex-girlfriend Ghislaine Maxwell should stay in prison. Giuffre had accused Prince Andrew and others of exploitation and died by suicide. Giuffre's family wants answers. Trump denies prior knowledge of Epstein's crimes. A White House spokesperson says the Republican president was responding to a reporter's question. The Giuffre family's statement follows the Justice Department's recent interview with Maxwell, who's serving a 20-year sentence in Florida for sex trafficking. Maxwell's lawyer says she testified truthfully. Epstein died in jail before trial. Andrew denied Giuffre’s claims.",
      "publishedAt": "2025-07-31T14:58:10Z",
      "title": "Giuffre family shocked over Trump saying Epstein 'stole' her",
      "url": "https://apnews.com/article/epstein-trump-maxwell-giuffre-stole-family-40d4318c2ab7987e93a4fc8484464ec8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a8ce9d/2147483647/strip/true/crop/5760x3240+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F7b%2F29c75f396d2ad86bcb1194a6b9d8%2F84bf2f0a6b514cfda4ea21e49826314c"
    },
    {
      "author": null,
      "description": "President Donald Trump plans to reestablish the Presidential Fitness Test for American schoolchildren. The program was created in 1966 and had children run and perform situps, pullups or pushups and a sit-and-reach test. It changed in 2012 to focus more on individual health than athletic feats. White House press secretary Karoline Leavitt says Trump wants to promote healthy active lifestyles for future generations. Trump plans to sign an order later Thursday reestablishing the President’s Council on Sports, Fitness, and Nutrition. He'll be joined at the White House event by a number of prominent athletes, including some who've faced controversy.",
      "publishedAt": "2025-07-31T14:56:29Z",
      "title": "Trump plans to revive the Presidential Fitness Test for schoolchildren",
      "url": "https://apnews.com/article/trump-presidential-fitness-test-schoolchildren-1e0b667df467f767df1cd1388ea29f1c",
      "urlToImage": "https://dims.apnews.com/dims4/default/fffc81b/2147483647/strip/true/crop/5285x2973+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2Fe8%2Ff9c6ee7fc949c27407c2c9be5ecf%2F5c8351bffdaa4364819063ef0627c0a8"
    },
    {
      "author": null,
      "description": "Professional wrestler Hulk Hogan died of a heart attack last week. That's according to a medical examiner’s report released on Thursday. The report from the District Six Medical Examiner in Florida said that Hogan, whose real name was Terry Bollea, also previously had leukemia and an irregular heart rhythm. Hogan died July 24 in Florida at age 71. He was pronounced dead at a hospital less than 90 minutes after medics in Clearwater arrived at his home to answer a morning call about a cardiac arrest.",
      "publishedAt": "2025-07-31T17:01:16Z",
      "title": "Hulk Hogan died of a heart attack, medical examiner says",
      "url": "https://apnews.com/article/hulk-hogan-cause-of-death-heart-attack-0449e1dae512338e984340c393e50dd5",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6131a/2147483647/strip/true/crop/1807x1016+0+94/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2Fbb%2F944b60dce2173ba69683026567ee%2Fba8d4f311bd64227b722ce5036c0d3bd"
    },
    {
      "author": null,
      "description": "More fireflies than usual are lighting up summer evenings in the U.S. Northeast. But scientists say the lightning bugs are still on the decline. A particularly wet spring may have created the ideal conditions for young fireflies to grow into adults and set summer nights aglow. There are over 2,000 known firefly species across the globe. While evenings in the Northeast may seem brighter this summer, the bugs are actually waning at a faster rate than ever before. To look out for fireflies, consider turning the lights off at night and avoid spraying front lawns with insecticides.",
      "publishedAt": "2025-07-31T13:24:52Z",
      "title": "Fireflies are lighting up summer skies. But the glowing bugs are still on the decline",
      "url": "https://apnews.com/article/are-there-more-fireflies-this-summer-bb98f691cab57a147141799451067c92",
      "urlToImage": "https://dims.apnews.com/dims4/default/f9a9fdf/2147483647/strip/true/crop/1800x1013+0+94/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2Fbc%2F9e1cdfccbaad2660adf49915af11%2F8dcadc19dd4c4b41a5fd9816bcf17dd7"
    },
    {
      "author": null,
      "description": "Delta Air Lines says a flight from Salt Lake City to Amsterdam was hit by serious turbulence, injuring passengers and forcing the flight to divert to Minneapolis-St. Paul International Airport. The airline says that the airport fire department and paramedics met the flight Wednesday evening and 25 passengers were taken to hospitals for evaluation and treatment. Serious injuries from in-flight turbulence are rare, but scientists say they may be becoming more common as climate change alters the jet stream. A man was killed when a Singapore Airlines flight hit severe turbulence in May 2024, the first person to die from turbulence on a major airline in several decades.",
      "publishedAt": "2025-07-31T04:57:06Z",
      "title": "Severe turbulence injures passengers aboard Amsterdam-bound Delta flight",
      "url": "https://apnews.com/article/delta-flight-turbulence-injuries-f93bc14c4c6f27d0be137483938fddfe",
      "urlToImage": "https://dims.apnews.com/dims4/default/f16d089/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2Ff1%2Ff11092fc1d8ccf053654b29443f6%2F2d2c6b0cc8354876978f6fdd0c69b8f3"
    },
    {
      "author": null,
      "description": "Major League Baseball's trade deadline has sparked a flurry of activity. The San Diego Padres have added closer Mason Miller, known for his fastball averaging over 101 mph. They also acquired left-hander JP Sears. Meanwhile, the Toronto Blue Jays have acquired former Cy Young winner Shane Bieber from the Cleveland Guardians. Bieber is recovering from Tommy John surgery and has been making minor league rehab starts. Other notable moves include the Cubs adding Andrew Kittredge and the Rays acquiring catcher Hunter Feduccia.",
      "publishedAt": "2025-07-31T17:38:29Z",
      "title": "MLB trade deadline tracker: Mason Miller, Shane Bieber on the move",
      "url": "https://apnews.com/article/mlb-trade-deadline-miller-bieber-7a7d771f58aad301d7e0953fc0eb919d",
      "urlToImage": "https://dims.apnews.com/dims4/default/3b7e395/2147483647/strip/true/crop/3674x2067+0+191/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F1c%2F3ff9c28aee0f2f74c8ed3f9c6532%2F08bbd537fe78483393765c24334c66df"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}