{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and JULIA FRANKEL",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel’s war with Hamas erupted again Friday, as airstrikes hit houses and buildings in the Gaza Strip minutes after a weeklong truce expired.",
      "publishedAt": "2023-12-01T05:05:56Z",
      "title": "Israel’s war with Hamas resumes with airstrikes in Gaza after a weeklong truce ends",
      "url": "https://apnews.com/c944c736efdf8993c7a17cf683d6e364",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4870f43928694e5b9b0aaa4f0674739c/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — A weeklong cease-fire that brought the exchanges of dozens of hostages held by Hamas for scores of Palestinian prisoners held by Israel gave way Friday morning to resumed fighting between Israel and Hamas.",
      "publishedAt": "2023-12-01T19:08:29Z",
      "title": "Bombs are falling on Gaza again. Who are the hostages still remaining in the besieged strip?",
      "url": "https://apnews.com/d760e0b30a5fc8bb29623ee350ce0668",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dac2e235ed064d73bab829332bd4db1f/1600.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House voted on Friday to expel Republican Rep. George Santos of New York after a blistering ethics report on his conduct heightened lawmakers' concerns about the scandal-plagued freshman.",
      "publishedAt": "2023-12-01T05:13:33Z",
      "title": "House expels New York Rep. George Santos. It's just the sixth expulsion in the chamber's history",
      "url": "https://apnews.com/fd0f1524065883c6b2fe3e6f9afd84db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bde9c818665541d7b3288a41c5649ca8/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump is not immune from prosecution in his election interference case in Washington, a federal judge ruled Friday, knocking down the Republican's bid to derail the case charging him with plotting to overturn the 2020 presidential election.",
      "publishedAt": "2023-12-02T00:43:52Z",
      "title": "Judge rejects Trump’s claim of immunity in his federal 2020 election prosecution",
      "url": "https://apnews.com/a98872759762c95fa925ff831df27388",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/498209ea472e4bcaa77787663d2033c2/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Retired Supreme Court Justice Sandra Day O’Connor, an unwavering voice of moderate conservatism and the first woman to serve on the nation’s highest court, died Friday.",
      "publishedAt": "2023-12-01T15:02:29Z",
      "title": "Retired Justice Sandra Day O'Connor, the first woman on the Supreme Court, has died at age 93",
      "url": "https://apnews.com/304f91633f069c46350bdfff540ff9fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58514bac50aa4f8d9732b37e23f36fe6/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — An attorney for former President Donald Trump said Friday it would amount to “election interference” if his client is the Republican nominee for president while on trial in Georgia in the months running up to the general election.",
      "publishedAt": "2023-12-01T21:06:25Z",
      "title": "Trump attorney says trial during campaign would be 'election interference' if he is GOP nominee",
      "url": "https://apnews.com/6a37461ba37ed2f6953df32111efad38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05e4228072994327820cf04c34039a15/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MICHAEL BALSAMO",
      "description": "Derek Chauvin was stabbed in prison 22 times by a former gang leader and one-time FBI informant who told investigators he targeted the ex-Minneapolis police officer because of his notoriety for killing George Floyd, federal prosecutors said Friday.",
      "publishedAt": "2023-12-01T21:43:43Z",
      "title": "Inmate who stabbed Derek Chauvin 22 times is charged with attempted murder, prosecutors say",
      "url": "https://apnews.com/d458e9c8fba02a98d5dbabb1884dc1cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadee3019ddf47ebae68c654d55f1e30/2540.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE and MELISSA PEREZ WINDER",
      "description": "CHICAGO (AP) — Chicago is scrambling to house hundreds of asylum-seekers who are still sheltering on sidewalks, at police stations and at the city's busiest airport as the cold weather sets in and with winter just around the corner.",
      "publishedAt": "2023-12-01T20:52:19Z",
      "title": "Chicago and other northern US cities scramble to house migrants with coldest weather just ahead",
      "url": "https://apnews.com/8a09fc5a0cf406a0058a6af4d2f3e088",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04bbffae67b942599f325cbfad6f3b18/3000.jpeg"
    },
    {
      "author": "LISA RATHKE",
      "description": "BURLINGTON, Vt. (AP) — Nearly a week after three college students of Palestinian descent were shot and seriously wounded while taking an evening walk, relatives of two of the victims have arrived in Vermont from the war-torn West Bank, grappling with a new reality that has shattered their lives and a place they thought was a safe haven.",
      "publishedAt": "2023-12-01T18:18:27Z",
      "title": "A world away from the West Bank, Vermont shooting victims and their families face new grief and fear",
      "url": "https://apnews.com/1c662c8bcbae9b1400bb3df07ab2ea2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c283392c960f4684b15e83ac7d982239/1920.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "BOSTON (AP) — The American legal system is facing a crisis of trust in communities around the country, with people of all races and across the political spectrum.For many, recent protests against police brutality called attention to longstanding discrepancies in the administration of justice.",
      "publishedAt": "2023-12-01T14:08:50Z",
      "title": "AP Exclusive: America's Black attorneys general discuss race, politics and the justice system",
      "url": "https://apnews.com/819c9e11c91f8bde1502fd258145a66a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef0992ae2c4b437b80229cd077878246/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}