{
  "articles": [
    {
      "author": "AMANDA SEITZ, REBECCA BOONE and MARK SHERMAN",
      "description": "WASHINGTON (AP) — The U.S. Supreme Court heard its first test on Wednesday of state abortion bans that have been enacted since the court upended the Roe v.",
      "publishedAt": "2024-04-24T20:43:31Z",
      "title": "Key moments in the Supreme Court's latest abortion case that could change how women get care",
      "url": "https://apnews.com/06ce8d1870db6864496ce281b6a3e77a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59fbf8ec2ca840a591b41b995aa252ca/3000.jpeg"
    },
    {
      "author": "JACQUES BILLEAUD and JOSH KELETY",
      "description": "PHOENIX (AP) — Eleven Republicans who submitted a document to Congress falsely declaring that Donald Trump beat Joe Biden in Arizona in the 2020 presidential election were charged Wednesday with conspiracy, fraud and forgery, marking the fourth state to bring charges against “fake electors.”",
      "publishedAt": "2024-04-24T23:23:53Z",
      "title": "Arizona grand jury indicts 11 Republicans who falsely declared Trump won the state in 2020",
      "url": "https://apnews.com/9da5a7e58814ed55ceea1ca55401af85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d63c8059f2b1486ab0af021bae934d2f/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — For Senate Republican leader Mitch McConnell and House Speaker Mike Johnson, the necessity of providing Ukraine with weapons and other aid as it fends off Russia's invasion is rooted in their earliest and most formative political memories.",
      "publishedAt": "2024-04-24T18:19:12Z",
      "title": "To pass Ukraine aid, 'Reagan Republican' leaders in Congress navigated a party transformed by Trump",
      "url": "https://apnews.com/4cb76cfdefc38f35c1bda2ac8915b179",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ea7e32202b74d4f887109bb4b56cd9c/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO, ACACIA CORONADO and NICK PERRY",
      "description": "AUSTIN, Texas (AP) — Police tangled with student demonstrators in Texas and California while new encampments sprouted Wednesday at Harvard and other colleges as school leaders sought ways to defuse a growing wave of pro-Palestinian protests.",
      "publishedAt": "2024-04-24T05:23:23Z",
      "title": "Police tangle with students in Texas and California as wave of campus protest against Gaza war grows",
      "url": "https://apnews.com/47f4f7f0916a6493b79eede3e4d0a55d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21a7e975833b454f9168289ae909c64e/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — Russia on Wednesday vetoed a U.N. resolution sponsored by the United States and Japan calling on all nations to prevent a dangerous nuclear arms race in outer space, calling it “a dirty spectacle” that cherry picks weapons of mass destruction from all other weapons that should also be banned.",
      "publishedAt": "2024-04-24T17:08:51Z",
      "title": "Russia vetoes a UN resolution calling for the prevention of a dangerous nuclear arms race in space",
      "url": "https://apnews.com/175d45ddb658729eff060bd8a83b8a55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16eaaf974e0541f9932384ac8e45f179/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "NEW YORK (AP) — Doctors have transplanted a pig kidney into a New Jersey woman who was near death, part of a dramatic pair of surgeries that also stabilized her failing heart.Lisa Pisano’s combination of heart and kidney failure left her too sick to qualify for a traditional transplant, and out of options.",
      "publishedAt": "2024-04-24T13:01:55Z",
      "title": "She was too sick for a traditional transplant. So she received a pig kidney and a heart pump",
      "url": "https://apnews.com/f708d90b6059f974d492d26c283a16cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06706a171df047bdb0af340ea64566e6/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — About one-quarter of U.S. adults age 50 and older who are not yet retired say they expect to never retire and 70% are concerned about prices rising faster than their income, an AARP survey finds.",
      "publishedAt": "2024-04-24T15:49:52Z",
      "title": "About 1 in 4 US adults 50 and older who aren't yet retired expect to never retire, AARP study finds",
      "url": "https://apnews.com/c4f1353d97e8c0a9973c9c67a8eab800",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3646364f44c0470384b066e167ed3376/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Boeing said Wednesday that it lost $355 million on falling revenue in the first quarter, another sign of the crisis gripping the aircraft manufacturer as it faces increasing scrutiny over the safety of its planes and accusations of shoddy work from a growing number of whistleblowers.",
      "publishedAt": "2024-04-24T11:49:57Z",
      "title": "Boeing's financial woes continue, while families of crash victims urge US to prosecute the company",
      "url": "https://apnews.com/b078e483942c03bc250085e9a0023ace",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a86385a84e694ef39dec18e733e8452b/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "“ Barbenheimer ” is a hard act to follow. But as Hollywood enters another summer movie season, armed with fewer superheroes and a landscape vastly altered by the strikes, it’s worth remembering the classic William Goldman quote about what works: “Nobody knows anything.”",
      "publishedAt": "2024-04-24T14:13:45Z",
      "title": "The summer after Barbenheimer and the strikes, Hollywood charts a new course",
      "url": "https://apnews.com/dd4640580b4d32cb235996eb69665ea9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc2db53ffc4041d1994f8ea14c0c5c94/2424.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "LOS ANGELES (AP) — Reggie Bush has his Heisman back.The Heisman Trust reinstated the former Southern California tailback as the 2005 Heisman Trophy winner on Wednesday, citing fundamental changes in the structure of college athletics during the 14 years since Bush forfeited the trophy and the honor.",
      "publishedAt": "2024-04-24T14:01:52Z",
      "title": "Reggie Bush is reinstated as 2005 Heisman Trophy winner, with organizers citing NIL rule changes",
      "url": "https://apnews.com/5ec9ed713534ca1081a0777b699d0385",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71a3a5b1785b4ddd8e3a03a252a21322/2588.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}