{
  "articles": [
    {
      "author": "Ohad Zwigenberg, Sam Metz, Samy Magdy",
      "description": "Protesters in Israel have torched tires and blocked highways to demand a ceasefire to free hostages in Gaza. This comes as Israeli leaders push for an offensive against Hamas. The protest Tuesday follows deadly strikes on Gaza's main hospital that killed 20 people, including medics and journalists. Prime Minister Benjamin Netanyahu is expected meet his cabinet later on Tuesday. Relatives of hostages hope steady pressure can push the government to commit to ceasefire talks. But far-right coalition members have threatened to bolt if Israel agrees to a truce. Most hostages taken on October 7, 2023, have been released, but 50 remain in captivity in Gaza.",
      "publishedAt": "2025-08-26T10:33:05Z",
      "title": "Protesters in Israel demand release of hostages as Gaza strikes kill 16, hospitals say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-08-26-2025-0f1be1b4e3231e0cbec54ce837cc6af9",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e2a443/2147483647/strip/true/crop/5428x3053+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F54%2Fd7416eb3ffa0036e77cbff939584%2F1d6e562a18a442f08ba4f144848bb75f"
    },
    {
      "author": "Lea Skene",
      "description": "A federal judge has dismissed the Trump administration’s lawsuit against all 15 federal judges in Maryland over an order by the chief judge that stopped the immediate deportation of migrants challenging their removals. U.S. District Judge Thomas Cullen on Tuesday granted a request by the judges to toss the case, saying to do otherwise would \"offend the rule of law.” Cullen was nominated by President Donald Trump and serves in Virginia but was tapped to oversee the case because all of Maryland’s federal judges were named as defendants. The unusual circumstance reflects the Republican administration’s harsh response to judges who slow or stop its policies. The White House has no immediate comment.",
      "publishedAt": "2025-08-26T14:41:13Z",
      "title": "Court tosses Trump administration lawsuit against Maryland federal judges",
      "url": "https://apnews.com/article/trump-lawsuit-maryland-judges-dc9c203cfc4ca37814179d2b220e361f",
      "urlToImage": "https://dims.apnews.com/dims4/default/fede681/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F80%2Fa6bb3f085d2665609f45f5af2917%2F7bc6d0ff3c48498db22545635c965957"
    },
    {
      "author": "Mae Anderson",
      "description": "Low-value imports are losing their duty-free status in the U.S. this week as part of President Donald Trump's agenda for making the nation less dependent on foreign goods. A widely used customs exemption for international shipments worth $800 or less is set to end starting on Friday. Trump already ended the “de minimis” rule for inexpensive items sent from China and Hong Kong, but having to pay import taxes on small parcels from everywhere else likely will be a big change for some small businesses and online shoppers. Purchases that previously entered the U.S. without needing to clear customs will be subject to the origin country’s tariff rate, which can range from 10% to 50%.",
      "publishedAt": "2025-08-26T14:05:18Z",
      "title": "Small businesses and online shoppers prepare for the US to end 'de minimis' import tax exemption",
      "url": "https://apnews.com/article/de-minimis-exemption-end-date-dutyfree-48862fc5b6a563a077284e364fb14f08",
      "urlToImage": "https://dims.apnews.com/dims4/default/34993f7/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2Fdf%2F0f1116bec1a989209610ad49e402%2F6a7177a088dd423d8d44d0b7ca91ad59"
    },
    {
      "author": "Rodney Muhumuza",
      "description": "Opposition figures in Uganda have criticized a deal with the U.S. to accept deported migrants. They question the lack of parliamentary approval and suggest it eases political pressure on President Yoweri Museveni. Ugandan officials have shared few details, but have said they prefer deportees of African origin without criminal records. Still, U.S. officials say they are processing Kilmar Abrego Garcia, a Salvadoran national charged with human smuggling, for deportation to Uganda. Critics argue the agreement benefits Museveni politically and economically. The deal comes amid U.S. sanctions on Ugandan officials over corruption and rights abuses. The lack of transparency and parliamentary oversight has raised concerns.",
      "publishedAt": "2025-08-26T09:35:02Z",
      "title": "Ugandan opposition figures question deal to receive deportees from the US",
      "url": "https://apnews.com/article/uganda-us-deportations-criticism-692a6cbf61c96ac3ed837b567bf2d72c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Rod McGuirk",
      "description": "Australian Prime Minister Anthony Albanese is accusing Iran of directing at least two antisemitic attacks in Australia and says the country is cutting off diplomatic relations in response. Albanese says that Australian intelligence services has connected Iran to arson attacks on a Sydney restaurant and a Melbourne synagogue. There has been a steep rise in antisemitic events in the two cities since the Israel-Hamas war began in 2023. He added that Iran has tried to disguise its involvement, but ASIO assesses it was behind the attacks.",
      "publishedAt": "2025-08-26T03:23:51Z",
      "title": "Australia accuses Iran of antisemitic attacks",
      "url": "https://apnews.com/article/australia-iran-antisemitism-attacks-fad2dc76125807a643bfe14cae33d2c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/cfcc720/2147483647/strip/true/crop/5823x3275+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fa7%2Fd96ba7a38a21e7395b8999f8883f%2Fdad3d2a0067942e1a8b31a1c7ebee1c3"
    },
    {
      "author": "Sam McNeil, Kelvin Chan",
      "description": "President Donald Trump has vowed to impose new tariffs and export curbs on countries with digital taxes or regulations affecting American tech companies. His comments are seen as a threat against the European Union's digital rules targeting companies like Google and Apple. On Truth Social, Trump criticized digital taxes and regulations as discriminatory. He also complained about Chinese tech companies getting a pass from these rules. The EU's executive Commission defended its right to regulate economic activities. Trump's remarks come a week after a joint statement from Washington and Brussels on addressing digital trade barriers.",
      "publishedAt": "2025-08-26T13:31:42Z",
      "title": "Trump vows retaliation against countries with digital rules targeting US tech",
      "url": "https://apnews.com/article/trump-european-union-google-apple-meta-e5c432f29d2d470eff3504d6409d73ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/65cb86d/2147483647/strip/true/crop/8310x4674+0+433/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F0a%2F64383bb834b627e75e30046e5ed2%2F83ddf510ef014eac8792d63522876a9b"
    },
    {
      "author": "Yuri Kageyama",
      "description": "Shares are lower in Europe and Asia after President Donald Trump said he was firing Federal Reserve Gov. Lisa Cook. The announcement came after trading closed Monday on Wall Street, where benchmarks reversed some of their big gains from last week. Trump announced his plan to dismiss Cook on his Truth Social platform. On Monday, the S&P 500 fell 0.4% and the Dow Jones Industrial Average gave back 0.8% after setting a record on Friday. The Nasdaq composite shed 0.2%. Apart from rattling financial markets, Trump's latest move is likely to touch off an extensive legal battle that will probably go to the Supreme Court. Oil prices lost more than $1 a barrel.",
      "publishedAt": "2025-08-26T02:41:55Z",
      "title": "World shares sink after Trump escalates feud with the Federal Reserve",
      "url": "https://apnews.com/article/stock-markets-ai-inflation-fed-d3cfca075104241f4285a316d0f2143d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5dbe0d3/2147483647/strip/true/crop/2806x1578+0+146/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2Ffd%2F2ea1f0682ca0cc5e63b092438924%2F5c5fa057edba4c5790782741e3e47ec1"
    },
    {
      "author": "Seth Borenstein, Michael Phillis",
      "description": "Scientists are criticizing two key documents from the Trump administration that challenge the idea that climate change endangers the public. The documents from the Environmental Protection Agency and Department of Energy argue that climate change's impact is unclear and that U.S. cuts to greenhouse gas emissions have little global effect. Most of the scientists who responded to questions from The Associated Press said the reports misuse or misinterpret their work. A common critique was that the documents cherry-pick information to downplay climate change's severity. When asked to grade the documents, those surveyed most frequently gave the work an F.",
      "publishedAt": "2025-08-26T13:02:55Z",
      "title": "Trump administration reports on climate change filled with errors, say scientists",
      "url": "https://apnews.com/article/climate-change-epa-trump-science-endangerment-46e0519fac313ba635814b40ef638721",
      "urlToImage": "https://dims.apnews.com/dims4/default/47ea534/2147483647/strip/true/crop/5794x3259+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F96%2F84c22de6d17432aab7cfe79c1054%2Fc8684f695eb944f0a11047f205b7f323"
    },
    {
      "author": "Jocelyn Noveck",
      "description": "It’s a love story and, baby, she said yes: Taylor Swift and Travis Kelce are engaged. The superstar singer and football player revealed the news in a five-photo joint post on Instagram on Tuesday. It's the fairytale culmination of a courtship that for two years has thrilled and fascinated millions around the world. It's unclear when and where the two got engaged. The announcement comes not long after Swift's appearance on “New Heights.” That's the podcast hosted by the Kansas City Chiefs tight end and his brother Jason Kelce.",
      "publishedAt": "2025-08-26T17:13:09Z",
      "title": "Taylor Swift and Travis Kelce are engaged",
      "url": "https://apnews.com/article/taylor-swift-travis-kelce-engaged-d585627eb98b69428ce206a2c8a9cb7d",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c8c677/2147483647/strip/true/crop/1948x1096+0+102/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F21%2Fd5%2F94af36b2a14685cb1cb68d32fabb%2Fb46796a0b586498d9c9bcd1f3ec57b1a"
    },
    {
      "author": "Stephen Whyno",
      "description": "Althea Gibson is front and center at the U.S. Open this year on the 75th anniversary of her breaking the color barrier in tennis. The logo for the Grand Slam tournament is of her profile as designed by the first Black woman responsible for the U.S. Open’s feature art. Clips of Gibson playing at what was then known as the U.S. Nationals flash across screens inside Arthur Ashe Stadium, and a tribute narrated by Venus Williams is part of the soundtrack during breaks. Gibson's story is also a complicated one, given her fight to get in and a life afterward that ended more than two decades ago without the money or legacy to show for it.",
      "publishedAt": "2025-08-26T14:29:55Z",
      "title": "Althea Gibson broke the tennis color barrier 75 years ago",
      "url": "https://apnews.com/article/althea-gibson-us-open-75th-anniversary-e0511b11ad9a7899bb887ff6a9f8abf8",
      "urlToImage": "https://dims.apnews.com/dims4/default/90aa91a/2147483647/strip/true/crop/2700x1519+0+344/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F0a%2Fc4dfe1c96eb1e6a947b7be0fd735%2Fcba65c10f94248ab8fab52419cc77467"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}