{
  "articles": [
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — Generations of Maryland workers — longshoremen, seafarers, steelworkers and crabbers whose livelihoods depend on Baltimore’s port — watched in disbelief this week as an iconic symbol of their maritime culture crumbled into the Patapsco River.",
      "publishedAt": "2024-03-31T04:03:25Z",
      "title": "In Key Bridge collapse, Baltimore lost a piece of its cultural identity",
      "url": "https://apnews.com/91c3bfe8c235eff0157808691259a514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36ecae7ebc0f43178c70c7ea40bc32e7/3000.jpeg"
    },
    {
      "author": "SERKAN GURBUZ and JEFFREY COLLINS",
      "description": "BALTIMORE (AP) — Teams of engineers worked Saturday on the intricate process of cutting and lifting the first section of twisted steel from the collapsed Francis Scott Key Bridge, which crumpled into the Patapsco River this week after a massive cargo ship crashed into one of its supports.",
      "publishedAt": "2024-03-30T04:04:36Z",
      "title": "Crews carefully start removing first piece of twisted steel from collapsed Baltimore bridge",
      "url": "https://apnews.com/3edebfb3b7fb48fd81be81cf69ebfbf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b0c6214077848bfb4d03acc578c00e8/1920.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — A three-ship convoy left a port in Cyprus on Saturday with 400 tons of food and other supplies for Gaza as concerns about hunger in the territory soar.",
      "publishedAt": "2024-03-30T08:00:49Z",
      "title": "Ships with a second round of aid for Gaza have departed Cyprus as concerns about hunger soar",
      "url": "https://apnews.com/c0ab29bb92b859e22c927ae82637192b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daf84253306b4d25b40c5017e0ffb03b/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis presided over the Vatican's somber Easter Vigil service on Saturday night, delivering a 10-minute homily and baptizing eight people, a day after suddenly skipping the Good Friday procession at the Colosseum as a health precaution.",
      "publishedAt": "2024-03-30T12:16:19Z",
      "title": "Pope presides over Easter Vigil, delivers 10-minute homily after skipping Good Friday at last minute",
      "url": "https://apnews.com/f6e54df66552d07ea2c8c33cb91d72ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d3db79732cc4ce5a72e3880b8c53149/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden is facing criticism from Donald Trump's campaign and religious conservatives for proclaiming March 31 — which corresponds with Easter Sunday this year — as “Transgender Day of Visibility.”",
      "publishedAt": "2024-03-30T23:14:46Z",
      "title": "The Trump camp assails Biden for declaring March 31, Easter Sunday, as Transgender Day of Visibility",
      "url": "https://apnews.com/2acc05052d01272ed21ab83f32d99a77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fb890bf5551487e9e8a0e2965aeb575/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — As Donald Trump campaigns on promises of mass deportations and pardons for those convicted in the Jan.",
      "publishedAt": "2024-03-30T12:40:54Z",
      "title": "Some of Trump's allies in Congress already support his 2025 ideas on deportations and Jan. 6 pardons",
      "url": "https://apnews.com/c8e5398b3c2c8ce43149e32cd0805865",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b3ac90aa8cd4b88a807aee8dc4f5944/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Japanese government health officials on Sunday inspected a factory producing health supplements linked to at least five deaths and the hospitalization of more than 100 others, one day after the authorities investigated another plant that manufactured the product.",
      "publishedAt": "2024-03-30T03:55:48Z",
      "title": "Japanese officials inspect 2 factories making health supplements linked to 5 deaths",
      "url": "https://apnews.com/a6c881aff4c4cc67627d09af269a45a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0e33d74e1bb42c1bcb68f3fb2051104/3000.jpeg"
    },
    {
      "author": "SHARON LURYE",
      "description": "NEW ORLEANS (AP) — Ava Kreutziger was in high school English class last year when she heard about the passage of legislation that could affect LGBTQ+ students like her. She excused herself from class to go cry in the bathroom, and found two of her classmates already there in tears.",
      "publishedAt": "2024-03-31T04:06:12Z",
      "title": "First they tried protests of anti-gay bills. Then students put on a play at Louisiana’s Capitol",
      "url": "https://apnews.com/a30468fff90127c379eba7b8eccdaa56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72e82105a557408a8396282c37282a72/1920.jpeg"
    },
    {
      "author": null,
      "description": "DES MOINES, Iowa (AP) — The Powerball jackpot climbed to an estimated $975 million after no one matched the six numbers drawn Saturday night, continuing a nearly three-month stretch without a big winner.",
      "publishedAt": "2024-03-31T03:06:37Z",
      "title": "Powerball jackpot jumps to $975 million after another drawing without a big winner",
      "url": "https://apnews.com/cb08709b30ab08abbbb3c12e17686e00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/990c31b801664f05ac70d8d89d66200d/3000.jpeg"
    },
    {
      "author": "JIMMY GOLEN",
      "description": "BOSTON (AP) — Thirty points in a row — that's quite a run.The NCAA Tournament streak UConn is putting together is pretty, pretty impressive, too.The defending national champions scored 30 straight points to power their way back to the Final Four on Saturday night, steamrolling Illinois 77-52 — a March Madness record 10th straight double-digit victory for the top-seeded Huskies.",
      "publishedAt": "2024-03-31T00:31:35Z",
      "title": "Donovan Clingan, UConn power back into Final Four behind 30-0 run in 77-52 rout of Illinois",
      "url": "https://apnews.com/2ca12163692429327e6a740d97039582",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc136623fd644819ae44747a1dc8a9cf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}