{
  "articles": [
    {
      "author": "TIA GOLDENBERG and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — Israeli soldiers battled Hamas fighters in the streets of southern Israel on Sunday and launched retaliation strikes that leveled buildings in Gaza, while in northern Israel a brief exchange of strikes with Lebanon's Hezbollah militant group raised fears of a broader conflict.",
      "publishedAt": "2023-10-08T04:17:32Z",
      "title": "Israel battles Hamas for a second day after mass incursion and trades fire with Lebanon's Hezbollah",
      "url": "https://apnews.com/ca7903976387cfc1e1011ce9ea805a71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b11604e54165450e96737764167d9d1f/1920.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Powerful earthquakes killed at least 2,000 people in western Afghanistan, a Taliban government spokesman said Sunday. It’s one of the deadliest earthquakes to strike the country in two decades.",
      "publishedAt": "2023-10-08T08:41:41Z",
      "title": "Earthquakes kill over 2,000 in Afghanistan. People are freeing the dead and injured with their hands",
      "url": "https://apnews.com/155c12cd085d7aa8ee1fef5882e120f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b733deb29b384d2baa9b89f7b4049acf/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and JILL COLVIN",
      "description": "WASHINGTON (AP) — Donald Trump is again testing the power of his endorsement.With an early morning social media post on Friday, Trump inserted himself into the chaotic race to replace Kevin McCarthy as House speaker by backing Ohio Rep.",
      "publishedAt": "2023-10-07T04:47:17Z",
      "title": "Trump is inserting himself into the messy race to become the next House speaker. Will it matter?",
      "url": "https://apnews.com/77b4f760ff5653344b982fbabeac6ec7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2104e3e52b54577ab6240b928583e1c/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The ad sounds like something out of the GOP 2024 playbook, trumpeting a senator’s work with Republicans to crack down on the flow of fentanyl and other illegal drugs into the U.S., getting tough on Chinese interests helping smugglers, and noting how he \"wrote a bill signed by Donald Trump to increase funding for Border Patrol.”",
      "publishedAt": "2023-10-07T04:59:52Z",
      "title": "Biden faces more criticism about the US-Mexico border, one of his biggest problems heading into 2024",
      "url": "https://apnews.com/646f656dbfecf268f0cb182c74ad47ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54a0bf698d9042b2982932e779f5e0af/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — The area around the Maui town largely destroyed by wildfire two months ago was scheduled to welcome back travelers on Sunday as the mayor and Hawaii’s governor pushed ahead to restart tourism to boost the economy despite opposition from some Lahaina residents.",
      "publishedAt": "2023-10-08T04:05:58Z",
      "title": "Tourism resuming in West Maui near Lahaina as hotels and timeshare properties welcome visitors",
      "url": "https://apnews.com/d66e6528b8c61203a3110214869314ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/547957f8772142b6aced5d091f25dbd8/3000.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE",
      "description": "CHICAGO (AP) — Alexander watches Paw Patrol with fervor, bowls his baby brother over with hugs and does everything with gusto.What the 3-year-old West Chicago toddler can’t do yet is speak more than a few words.",
      "publishedAt": "2023-10-08T04:09:57Z",
      "title": "Toddlers with developmental delays are missing out on help they need. It can hurt them long term",
      "url": "https://apnews.com/fdf1c65ef0b3c928326385e498ff72f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff2440a921dd49ae8643fc5a80391c36/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and JOANNA KOZLOWSKA",
      "description": "HROZA, Ukraine (AP) — U.N. and local investigators searched for answers on Saturday at the site of a Russian missile strike on a small Ukrainian village that days earlier turned its sole cafe to rubble and killed nearly 52 people gathered for a dead soldier’s wake, according to President Volodymyr Zelenskyy and other top officials in Kyiv.",
      "publishedAt": "2023-10-07T17:35:57Z",
      "title": "Days after deadly missile strike on Ukrainian cafe, grief and a search for answers",
      "url": "https://apnews.com/85c312c3ec96a07c6b24fe8ad1b284fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3b69c7934da49ca9ae0cf630a4f1dfc/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and SUSAN HAIGH",
      "description": "HARTFORD, Conn. (AP) — A woman approaches a drop box in the dark with what appears to be handfuls of ballots. At a different drop box, someone else is seen making multiple trips to insert ballots. At yet another, the same car stops on at least three separate occasions, with different people stepping out and heading to the box.",
      "publishedAt": "2023-10-07T14:57:05Z",
      "title": "Drop boxes have become key to election conspiracy theories. Two Democrats just fueled those claims",
      "url": "https://apnews.com/af4751d78f87c8f5aeefc5daa2b1f6a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb58f92984404ebaa4eb2a9cd28fd4b5/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Members of Britain’s opposition Labour Party gather in Liverpool on Sunday for their annual conference with an unfamiliar feeling: optimism.The party has been out of power for 13 years, and in the last national election in 2019, voters handed Labour its worst drubbing since 1935.",
      "publishedAt": "2023-10-08T04:00:56Z",
      "title": "After years in opposition, Britain's Labour Party senses it's on the verge of regaining power",
      "url": "https://apnews.com/dd80a2c751c89b6f97858b8250e07ef3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb2eb161d57e4ac082d702475808fb57/3000.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — Two German states hold elections on Sunday at the halfway mark of Chancellor Olaf Scholz's unpopular national government, with polls showing the center-right opposition well ahead and Germany's interior minister facing an uphill struggle in a bid to become governor of her home region.",
      "publishedAt": "2023-10-08T06:16:09Z",
      "title": "Two German state elections expected to bring wins for conservative national opposition",
      "url": "https://apnews.com/136bad47e99f1e41ec1d36ef6a138c66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d926fc5965504b5183b5ac607c767d75/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}