{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin on Sunday replaced Sergei Shoigu as defense minister in a Cabinet shakeup that comes as he begins his fifth term in office. In line with Russian law, the entire Russian Cabinet resigned Tuesday following Putin’s glittering inauguration in the Kremlin, and most members have been widely expected to keep their jobs, while Shoigu's fate had appeared uncertain.",
      "publishedAt": "2024-05-12T11:22:28Z",
      "title": "Putin in Cabinet shakeup moves to replace defense minister as he starts his 5th term in office",
      "url": "https://apnews.com/e1f9250d200999ea3e87e9b96b4710d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df97b7f93e2d434bbb2952ae698fda4d/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "REHOBOTH BEACH, Del. (AP) — Secretary of State Antony Blinken on Sunday delivered some of the Biden administration’s strongest public criticism yet of Israel’s conduct of the war in Gaza, saying Israeli tactics have meant “a horrible loss of life of innocent civilians” but failed to neutralize Hamas leaders and fighters and could drive a lasting insurgency.",
      "publishedAt": "2024-05-12T17:16:48Z",
      "title": "Blinken delivers some of the strongest US public criticism of Israel's conduct of the war in Gaza",
      "url": "https://apnews.com/6e0f887bd307f707a05190b33708fe58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8819ca152ff4e69aab5cf2051619a8b/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, JOSEPH KRAUSS and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — The exodus of Palestinians from Gaza’s last refuge accelerated Sunday as Israeli forces pushed deeper into the southern city of Rafah. Israel also pounded the territory’s devastated north, where some Hamas militants have regrouped in areas the military said it had cleared months ago.",
      "publishedAt": "2024-05-12T07:50:23Z",
      "title": "Israel moves deeper into Rafah and fights Hamas militants regrouping in northern Gaza",
      "url": "https://apnews.com/c61fbe06bc5c1a7c85ac18a542e8776e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11af81637c3444d38b1f2b3568e6d4fe/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and ERIC TUCKER",
      "description": "NEW YORK (AP) — He once said he would take a bullet for Donald Trump. Now Michael Cohen is prosecutors' biggest piece of legal ammunition in the former president's hush money trial.",
      "publishedAt": "2024-05-12T11:21:56Z",
      "title": "Michael Cohen: A challenging star witness in Donald Trump's hush money trial",
      "url": "https://apnews.com/091b0e50af2738eb261f395e9d658505",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d4808a87c68461daa413b0c2104f95c/3000.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "A tiny contingent of Duke University graduates opposed pro-Israel comedian Jerry Seinfeld speaking at their commencement in North Carolina Sunday, with about 30 of the 7,000 students leaving their seats and chanting “free Palestine” amid a mix of boos and cheers.",
      "publishedAt": "2024-05-12T21:33:45Z",
      "title": "Pro-Palestinian protests dwindle to tiny numbers and subtle defiant acts at US college graduations",
      "url": "https://apnews.com/d05604ba10871f287ff6be4698b185c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9ba3eab3ba3482e8665416537566a19/3000.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — The controlled demolition of the largest remaining steel span of the collapsed Francis Scott Key Bridge in Baltimore has been postponed because of weather conditions, officials said Sunday afternoon.",
      "publishedAt": "2024-05-12T04:17:13Z",
      "title": "Controlled demolition at Baltimore bridge collapse site postponed due to weather",
      "url": "https://apnews.com/3da84f13a5688af5cc0bdba4c922bd32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adbf6c4a3c6a4dbea6316a0064b6a971/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "BARCELONA, Spain (AP) — Six years after plunging Spain into its worst political crisis in decades, Catalonia's separatist parties are in danger of losing their hold on power in the northeastern region after the pro-union Socialist Party scored a historic result in Sunday's election.",
      "publishedAt": "2024-05-12T04:12:21Z",
      "title": "Catalan separatists lose majority as Spain's pro-union Socialists win regional elections",
      "url": "https://apnews.com/6286cd67a5db7a34f7ea4e46e4052203",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c59b82aa62b54ad0b940e071356cfd68/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON and CLAIRE SAVAGE",
      "description": "NEW YORK (AP) — More working U.S. parents than ever are celebrating their first Mother’s Day with hard-fought access to paid time off to care for newborns. But the majority still must forego pay to care for new babies or other loved ones, even as efforts to expand paid parental and family leave gain traction.",
      "publishedAt": "2024-05-12T13:00:51Z",
      "title": "More US parents than ever have paid leave this Mother's Day - but most still don't",
      "url": "https://apnews.com/22aaac545f83b95842316a3029f3bb40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c4a61bff2de4c96b83bf991112a6e8c/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — Two Air Force fighter jets recently squared off in a dogfight in California. One was flown by a pilot. The other wasn’t.",
      "publishedAt": "2024-05-12T10:58:26Z",
      "title": "US aims to stay ahead of China in using AI to fly fighter jets, navigate without GPS and more",
      "url": "https://apnews.com/5f327918075cea0bfc32e5d36cba801d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8c118ca402f4f8aaf4beed0bc4d80bd/1920.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM and JOHN RABY",
      "description": "CHARLESTON, W.Va. (AP) — When West Virginia Republicans vote in Tuesday's primary, they will have a hard time finding a major candidate on the ballot in any statewide race who openly acknowledges that President Joe Biden won the 2020 election.",
      "publishedAt": "2024-05-12T14:20:31Z",
      "title": "Election deniers: West Virginia voters must pick from GOP candidates who still dispute 2020 outcome",
      "url": "https://apnews.com/ad0395542d4d5ef2b8ad5bcdec5d8495",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad3537e400b74424a92b3715b477ca90/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}