{
  "articles": [
    {
      "author": "JON GAMBRELL, ADAM SCHRECK and TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israel attacked military targets in Iran with pre-dawn airstrikes Saturday in retaliation for the barrage of ballistic missiles the Islamic Republic fired on Israel earlier this month.",
      "publishedAt": "2024-10-26T07:55:08Z",
      "title": "Israel's first open attack on Iran targets missile sites and apparently spares oil and nuclear ones",
      "url": "https://apnews.com/9c9f366c71c508e6dd0ee74cff8400d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a305e710a1841e38c713f3b5602c15f/3000.jpeg"
    },
    {
      "author": "ADAM SCHRECK",
      "description": "JERUSALEM (AP) — Israel delivered its long-expected response to Iranian missile attacks early Saturday by carrying out a series of airstrikes against the Islamic Republic.",
      "publishedAt": "2024-10-26T12:29:46Z",
      "title": "Five things to know about Israel's attack on Iran",
      "url": "https://apnews.com/35a2b1474e5feedbb200c3aaa557fe60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8f7939c8dc149069f166c628eb62335/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, AAMER MADHANI and CHRIS MEGERIAN",
      "description": "KALAMAZOO, Mich. (AP) — Michelle Obama challenged men to support Kamala Harris ' bid to be America's first female president, warning at a rally in Michigan on Saturday that women's lives would be at risk if Donald Trump returned to the White House.",
      "publishedAt": "2024-10-26T15:53:29Z",
      "title": "'Take our lives seriously,' Michelle Obama pleads as she rallies for Kamala Harris in Michigan",
      "url": "https://apnews.com/61897674ddc94706031d00aca5c1dc86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f0d365030cd4a8c8bada90949f712d0/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and ALI SWENSON",
      "description": "NOVI, Mich. (AP) — Donald Trump further denigrated Detroit while appealing for votes Saturday in a suburb of the largest city in swing state Michigan.",
      "publishedAt": "2024-10-26T19:37:05Z",
      "title": "Trump again denigrates Detroit while appealing for votes in a suburb of Michigan's largest city",
      "url": "https://apnews.com/ee1dbcb59eaddd8b006ce57aad77c37e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fb8c43ee65c4b6f979ba63b0d92a60f/1920.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "LOS ANGELES (AP) — Dodgers superstar Shohei Ohtani partially dislocated his left shoulder during the seventh inning of Saturday's Game 2 of the World Series against the New York Yankees when he tried to steal second base.",
      "publishedAt": "2024-10-27T02:51:05Z",
      "title": "Shohei Ohtani partially dislocates left shoulder during World Series Game 2, status TBD",
      "url": "https://apnews.com/332dfab365b16f5f8ae607fcb5147a01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ca03370269b4c2b996a771b22eef2b3/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "AURORA, Colo. (AP) — Starting seventh grade at her first American school, facing classes taught entirely in English, Alisson Ramirez steeled herself for rejection and months of feeling lost.",
      "publishedAt": "2024-10-27T04:14:36Z",
      "title": "They came to America looking for better lives — and better schools. The results were mixed",
      "url": "https://apnews.com/2aee52bc80300f5507a903cda3e441da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce90eae301114ba8b6e0f6404af62b90/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japanese Prime Minister Shigeru Ishiba’ s conservative ruling party braced for a blow to its comfortable majority in the lower house of parliament in Sunday’s elections amid public rage over the party’s financial scandals and discontent over a stagnant economy.",
      "publishedAt": "2024-10-27T00:12:09Z",
      "title": "Japan's ruling party braces for a blow to its comfortable majority in the lower house in elections",
      "url": "https://apnews.com/5c6509c7b83963ffe40588c50998967c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6299ef921f094c92b31b76b201d7de0a/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and EFREM LUKATSKY",
      "description": "KYIV, Ukraine (AP) — North Korean troops are poised to be deployed by Russia on the battlefield in Ukraine as early as this weekend, Ukrainian President Volodymyr Zelenskyy claimed Friday.Western officials have warned that North Korean units joining the fight would stoke the almost three-year war and bring geopolitical consequences as far away as the Indo-Pacific region.",
      "publishedAt": "2024-10-25T10:52:08Z",
      "title": "Ukraine's Zelenskyy says North Korean troops are poised to join the war, cancels UN chief's visit",
      "url": "https://apnews.com/9d83c419ef741259d09860b576b8a27d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94f8cc50a7fd406582151ae3c9d2ed2b/2112.jpeg"
    },
    {
      "author": "NAYARA BATSCHKE and ISABEL DEBRE",
      "description": "MONTEVIDEO, Uruguay (AP) — The small South American nation of Uruguay is holding a remarkably civilized general election on Sunday that pits an incumbent conservative coalition against a moderate left-wing alliance in a country free from the political histrionics of other presidential contests around the world.",
      "publishedAt": "2024-10-27T04:02:00Z",
      "title": "Uruguay election: Voters in one of Latin America's strongest democracies pick between 2 centrists",
      "url": "https://apnews.com/86984f87bb0607d9c061c293ec11fe71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c264bfd59641484db4d8a5d2373c2a80/3000.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "LOS ANGELES (AP) — Yoshinobu Yamamoto walked back to his dugout and made the slightest tip of his cap to cheering fans. He left Japan for moments like this, an opportunity to put the Los Angeles Dodgers in control of the World Series.",
      "publishedAt": "2024-10-27T03:18:40Z",
      "title": "Yamamoto shuts down Yankees, Freeman homers again as Dodgers win 4-2 for 2-0 World Series lead",
      "url": "https://apnews.com/d672c41e864884be79f2629a749363a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be55a5df435d4e0ebc77c30957744b27/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}