{
  "articles": [
    {
      "author": "Justin Spike",
      "description": "As Ukraine approached the three-year mark of Russia’s full-scale invasion, the country’s hoped-for path to a favorable and lasting peace has been upended in a matter of days by the administration of U.S. President Donald Trump. Kyiv had benefited from years of staunch support by its allies in the United States and Europe which had provided crucial military and financial support to help defend against Moscow’s grinding incursions. But when Trump held a lengthy phone call with Russian President Vladimir Putin last week — undoing years of U.S. policy to isolate the Russian leader — it was taken as a signal in Kyiv and other European capitals that their alliance to contain Moscow was fraying.",
      "publishedAt": "2025-02-22T05:21:54Z",
      "title": "10 days upended the US approach to Ukraine",
      "url": "https://apnews.com/article/ten-days-that-upended-us-support-for-ukraine-8930c01a15910a7ad8a7f7c7fac9ba3a",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a0fc9a/2147483647/strip/true/crop/5160x2903+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F50%2F1b0a9d2ff0756bfcf4ce416bb975%2F1e0d6d6e405a46fa8ca378b2e95ba161"
    },
    {
      "author": null,
      "description": "The United States has proposed a draft resolution for the U.N. General Assembly that stops far short of a competing European-backed statement demanding an immediate withdrawal of all of Moscow’s forces from Ukraine. Both are timed to the third anniversary of Russia’s invasion of Ukraine, which falls on Monday, when the General Assembly will vote on the nonbinding resolutions. It pits the United States against Europe as the strength of the transatlantic alliance has been called into question over the Trump administration’s extraordinary turnaround on Russia.",
      "publishedAt": "2025-02-22T01:30:38Z",
      "title": "US offers UN resolution on war in Ukraine that's far short of rival European statement",
      "url": "https://apnews.com/article/russia-ukraine-war-united-nations-resolutions-5a8af28518c4a81d70613f1e19702ae8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4faf88a/2147483647/strip/true/crop/5287x2974+106+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F58%2F3812800357017c31e06401de5e60%2F78f59aad851447e99963b353cc226612"
    },
    {
      "author": "Aamer Madhani",
      "description": "The White House and Ukraine have made significant progress toward reaching an agreement that would provide the U.S. with access to Ukraine’s rare earth minerals and tighten the long-term relationship between Kyiv and Washington. That's according to a person familiar with the negotiations who was not authorized to comment publicly. The progress in talks comes after President Donald Trump and Ukraine President Volodymyr Zelenskyy traded sharp rhetoric this week about their differences over the matter. But the two sides made significant progress during a three-day visit to Ukraine this week by retired Lt. Gen. Keith Kellogg, Trump’s special envoy to Ukraine and Russia.",
      "publishedAt": "2025-02-22T03:37:27Z",
      "title": "White House and Ukraine nearing rare earths deal that would tighten relationship, AP source says",
      "url": "https://apnews.com/article/ukraine-rare-earths-minerals-russia-trump-36090d67358d93b8aa70240761634d4a",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a79fbb/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2Fb8%2Fa819e8d407d772675f2b340f82c9%2Fcf657fd972d64a99856d7fbdfd7c3573"
    },
    {
      "author": "Illia Novikov",
      "description": "President Donald Trump’s envoy to Ukraine and Russia says he's held “extensive and positive discussions” with Ukraine’s President Volodymyr Zelenskyy about the three-year war. He praised the Ukrainian leader as an “embattled and courageous leader of a nation at war.” Retired U.S. Lt. Gen. Keith Kellogg — who traveled to Kyiv on Wednesday and whose planned news conference with Zelenskyy on Thursday was changed at the last minute to a simple photo opportunity — struck a positive tone Friday after saying it was “a long and intense day” of talks with Ukraine’s senior leadership. His comments marked a departure from rebukes of Zelenskyy by Trump and other senior U.S. officials that appeared to reflect an abrupt deterioration of relations.",
      "publishedAt": "2025-02-21T15:17:20Z",
      "title": "US envoy praises Zelenskyy after Trump's censure of the Ukrainian leader",
      "url": "https://apnews.com/article/russia-ukraine-zelenskyy-trump-0bc41d62c4fdfa00b4358f9043ee9991",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a79fbb/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2Fb8%2Fa819e8d407d772675f2b340f82c9%2Fcf657fd972d64a99856d7fbdfd7c3573"
    },
    {
      "author": "Michael R. Blood",
      "description": "Six weeks after devastating wildfires, Los Angeles Mayor Karen Bass ousted the city’s fire chief amid a public rift over preparations for the fires and finger-pointing between the chief and City Hall. Bass says in a statement Friday that she is removing Chief Kristin Crowley immediately. Bass says 1,000 firefighters could have been on duty the morning the fires broke out but “were instead sent home on Chief Crowley’s watch.” Bass also says Crowley bucked doing a report requested by the city’s Fire Commission.",
      "publishedAt": "2025-02-21T19:38:44Z",
      "title": "LA mayor Karen Bass dismisses fire chief over response to wildfire",
      "url": "https://apnews.com/article/california-wildfires-fire-chief-146e4421e4bac52dadca6164040eff39",
      "urlToImage": "https://dims.apnews.com/dims4/default/c30ab15/2147483647/strip/true/crop/8209x4618+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F33%2Ff45462d4444d66a065a31e117564%2F52ca21e1d9494d428cef177e675006ff"
    },
    {
      "author": null,
      "description": "Red Cross ambulances have arrived in Gaza’s southernmost city of Rafah in preparation for the handover of six Israeli hostages to be freed Saturday under the Israel-Hamas ceasefire deal. AP video showed the ambulances waiting among a crowd with a line of Hamas fighters nearby in Rafah, where two of the hostages are expected to be handed over. The other four are to be handed over in central Gaza.",
      "publishedAt": "2025-02-22T06:23:32Z",
      "title": "Family confirms second body released by militants was Shiri Bibas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-22-2025-364c7abeb679e910cb5acba234469574",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1bf97d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F43%2F476efdca70eadb16c08f1e79432d%2F465de4ee09d343a18485466b3b56195c"
    },
    {
      "author": "Josh Funk",
      "description": "A crash landing of a Delta Air Lines flight in Toronto has highlighted the potential dangers of flying with a young child on an adult's lap. The plane flipped over this week, which would have made holding onto a baby extremely difficult. Airline plane crashes are rare despite the recent rash of aviation disasters, but children could easily get hurt if they are on a parent's lap when a plane encounters turbulence. Experts agree it’s safer for children younger than 2 years old to have their own plane seats and ride in approved car seats when flying even if families have to pay for an extra ticket. Still, it isn't required.",
      "publishedAt": "2025-02-22T11:07:20Z",
      "title": "Canada plane flip highlights dangers of holding kids on your lap",
      "url": "https://apnews.com/article/toronto-delta-plane-flipped-lap-baby-safety-d4bf3ecada5972f129ba88511ba28dd6",
      "urlToImage": "https://dims.apnews.com/dims4/default/2b0028d/2147483647/strip/true/crop/1596x898+0+83/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2Ff4%2F0cc8bd0665bb00dec943770c35cb%2Fd4026317b092492daf33c74cced9e677"
    },
    {
      "author": "Tara Copp, Lolita C. Baldor",
      "description": "President Donald Trump has abruptly fired Air Force Gen. CQ Brown Jr. as chairman of the Joint Chiefs of Staff. The move Friday sidelines a history-making fighter pilot and respected officer as part of a targeted campaign to rid the military of leaders who support diversity and equity in the ranks. Brown is only the second Black general to serve as chairman. His 16 months in the job had been consumed with the war in Ukraine and the expanded conflict in the Middle East. But Brown’s future was called into question during the Senate Armed Services Committee’s confirmation hearing for Defense Secretary Pete Hegseth.",
      "publishedAt": "2025-02-22T00:40:47Z",
      "title": "Trump fires Joint Chiefs of Staff chair CQ Brown",
      "url": "https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf",
      "urlToImage": "https://dims.apnews.com/dims4/default/8691eba/2147483647/strip/true/crop/6048x3402+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F03%2F146b5adf1793acabc1bf2b6b425f%2F31247abc2b8b44d0bc34bbf9c0f2ad32"
    },
    {
      "author": "Lea Skene, Lindsay Whitehurst",
      "description": "A federal judge has largely blocked sweeping executive orders from President Donald Trump that sought to end government support for programs promoting diversity, equity and inclusion. Judge Adam Abelson in Baltimore found they likely violate free-speech rights and granted an injunction blocking them as a lawsuit plays out. Trump signed an order his first day in office directing federal agencies to terminate all “equity-related” grants or contracts. The city of Baltimore and higher education groups sued, arguing the executive orders are unconstitutional and an overreach of presidential authority. The Trump administration has argued that the president was targeting only DEI programs that violate federal civil rights laws.",
      "publishedAt": "2025-02-22T00:22:03Z",
      "title": "Judge largely blocks Trump’s executive orders ending federal support for DEI programs",
      "url": "https://apnews.com/article/dei-diversity-equity-inclusion-trump-federal-judge-5b04fbc742bd32adf98ca108b4b12b37",
      "urlToImage": "https://dims.apnews.com/dims4/default/2358533/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fc9%2F34743f2919558f5d65f8684810e0%2Fc171b7026f2342f6974000840b2a618c"
    },
    {
      "author": "Alanna Durkin Richer",
      "description": "The Justice Department has filed a complaint accusing a federal judge in Washington of misconduct during hearings over President Donald Trump’s executive order that calls for banning transgender troops from serving in the U.S. military. The complaint filed by Attorney General Pam Bondi’s chief of staff marks an escalation of the Republican administration’s criticism of the judiciary, which has been been weighing a slew of legal challenges to the president’s action. The complaint accuses U.S. District Judge Ana Reyes of inappropriately questioning a government lawyer about his religious beliefs and then trying to “embarrass” the attorney with a rhetorical exercise during an exchange about discrimination. A representative from Reyes’ chambers declined to comment.",
      "publishedAt": "2025-02-21T22:46:56Z",
      "title": "Justice Department files complaint against judge weighing challenge to Trump’s transgender troop ban",
      "url": "https://apnews.com/article/justice-department-judge-complaint-executive-order-trump-e5fe936e3db7cd621133a171b16aafef",
      "urlToImage": "https://dims.apnews.com/dims4/default/dc96faa/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Fa8%2F1814ae4f4f5fa6fb7341f9ab31ff%2Fe8b43ddaf7214244b76a58d89c7281e0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}