{
  "articles": [
    {
      "author": "MELANIE LIDMAN and TIA GOLDENBERG",
      "description": "RE'IM, Israel (AP) — Israelis held somber ceremonies Monday to mark a year since the deadliest attack in the country’s history, a Hamas-led raid that shattered its sense of security and has since spiraled into wars on two fronts with no end in sight.",
      "publishedAt": "2024-10-07T03:35:39Z",
      "title": "War rages on multiple fronts as Israel marks a year since Hamas' Oct. 7 attack",
      "url": "https://apnews.com/cf123f95609051e8e8eaf6aebe661b6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0d71dcfc41d44c1b2d4c3178e2b00c1/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Israeli military strikes are targeting Iran's armed allies across a nearly 2,000-mile stretch of the Middle East and threatening Iran itself.",
      "publishedAt": "2024-10-08T04:05:55Z",
      "title": "Israel's strikes are shifting the power balance in the Middle East, with US support",
      "url": "https://apnews.com/36d7c0bbc35964ed6ac9d21de17c632a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/924d2e2dcff442038e3232fe15cee0a0/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER and HAVEN DALEY",
      "description": "FORT MYERS BEACH, Fla. (AP) — Florida's Gulf Coast braced Tuesday for the impact of Hurricane Milton's near-record winds and expected massive storm surge, which could bring destruction to areas already reeling from Helene's devastation 12 days ago and still recovering from Ian's wrath two years ago.",
      "publishedAt": "2024-10-08T04:08:46Z",
      "title": "Florida braces for Hurricane Milton as communities recover from Helene and 2022's Ian",
      "url": "https://apnews.com/7678939c52fdf00da748937d22df1fac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a34b1efcad44b56a2ad58ece5944ade/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Not even two weeks after Hurricane Helene swamped the Florida coastline, Milton has strengthened rapidly into a Category 5 hurricane on a path toward the state.",
      "publishedAt": "2024-10-07T22:26:06Z",
      "title": "What to know about Hurricane Milton as it speeds toward Florida",
      "url": "https://apnews.com/d40b1e47fd78844bf1ed528bab5099f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5db12c55e1a45a3abfd59f6084e7b07/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris on Monday called former President Donald Trump “incredibly irresponsible” for spreading falsehoods about the federal response to Hurricane Helene 's destruction, offering especially sharp words as a new storm bears down on Florida with just weeks until Election Day.",
      "publishedAt": "2024-10-07T23:42:58Z",
      "title": "Harris calls Trump 'incredibly irresponsible' for spreading misinformation about Helene response",
      "url": "https://apnews.com/552e413dfb6c1b3e37eca0d2114668ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/619fec4cb1f24a5489a2cf4b6eea589b/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER and CHRIS MEGERIAN",
      "description": "NEW YORK (AP) — When Vice President Kamala Harris sat down for an interview with podcaster Alex Cooper, the conversation didn’t start by parsing policy positions.",
      "publishedAt": "2024-10-08T04:10:54Z",
      "title": "Harris is still introducing herself as she sets out on media tour when people are already voting",
      "url": "https://apnews.com/5a2af60ba0b1099e19cca151955c9855",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f184b9a7a234f67887ac94f87e37f82/3000.jpeg"
    },
    {
      "author": "MATT BROWN and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Black registered voters have an overwhelmingly positive view of Vice President Kamala Harris, but they’re less sure that she would change the country for the better, according to a recent poll from the  AP-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-10-08T04:01:48Z",
      "title": "What polling shows about Black voters' views of Harris and Trump",
      "url": "https://apnews.com/78e344ddea4886dd23582f4a51eb0da6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cb9ddfdcc2f4b2ba59e2bb8c1bad677/3000.jpeg"
    },
    {
      "author": null,
      "description": "SRINAGAR, India (AP) — Votes were being counted Tuesday in the recent election for a largely powerless local government in Indian-controlled Kashmir, the first since Indian Prime Minister Narendra Modi’s government stripped the disputed region of its special status five years ago.",
      "publishedAt": "2024-10-08T03:18:55Z",
      "title": "Votes are being counted in the election for a truncated government in Indian-controlled Kashmir",
      "url": "https://apnews.com/5590ef6cd2810cb16308f6efcdea23f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e5437ef0af74edd95ac9a4c63469837/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — A unique peek inside the human brain may help explain how it clears away waste like the kind that can build up and lead to Alzheimer’s disease.Brain cells use a lot of nutrients which means they make a lot of waste.",
      "publishedAt": "2024-10-07T21:58:05Z",
      "title": "A peek inside human brain shows a way it cleans out waste",
      "url": "https://apnews.com/f73b0e5f66a324e3d0e3f0cea951276b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d3e1e9f6ee846628f5c606516de3ab6/3000.jpeg"
    },
    {
      "author": null,
      "description": "SAN FRANCISCO (AP) — A federal judge on Monday ordered Google to tear down the digital walls shielding its Android app store from competition as punishment for maintaining an illegal monopoly that helped expand the company's internet empire.",
      "publishedAt": "2024-10-07T20:26:28Z",
      "title": "Federal judge orders Google to open its Android app store to competition",
      "url": "https://apnews.com/d635ff5b6a2c8b755faa14fe471b73e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22c4d530a34446c0bad92c07ae080a10/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}