{
  "articles": [
    {
      "author": "SEAN MURPHY",
      "description": "FORT WORTH, Texas (AP) — Republican Sen. Ted Cruz of Texas won reelection Tuesday, defeating U.S. Rep. Colin Allred and Democrats’ latest try at ending decades of GOP dominance in the booming state that was thrust this election year to the center of battles over immigration and abortion.",
      "publishedAt": "2024-11-05T07:01:29Z",
      "title": "Republican Ted Cruz of Texas wins a third term to the US Senate",
      "url": "https://apnews.com/e791c362621efac9fac78a3a146f77d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5c2c38d2ace4bcc9d9c3d5085a82e57/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — Republicans prevailed Tuesday in a must-win Senate race in Ohio, as Trump-backed Cleveland businessman Bernie Moreno defeated Democratic U.S.",
      "publishedAt": "2024-11-05T05:01:43Z",
      "title": "Trump-backed Republican Bernie Moreno defeats incumbent US Sen. Sherrod Brown in key Ohio race",
      "url": "https://apnews.com/74c4b91e5866215d4201377fefcadad0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e48e50bc8034da7a24fa668b3e500f6/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Donald Trump won the battleground state of North Carolina on Tuesday, fending off a challenge from Kamala Harris, who was looking to flip the state and expand her pathways to 270 electoral votes.",
      "publishedAt": "2024-11-05T11:29:35Z",
      "title": "Trump wins North Carolina, holding off Harris challenge",
      "url": "https://apnews.com/83c8e246ab97f5b97be45cdc156af4e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/542780306e404570904353dd9abd3e5b/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Republican Donald Trump won North Carolina, capturing one of the seven heavily contested battlegrounds while votes in six other swing states were still being counted.",
      "publishedAt": "2024-11-05T11:18:20Z",
      "title": "The Latest: Trump wins North Carolina while votes are still being counted in other key states",
      "url": "https://apnews.com/a2352c1cc3289d206d21260c5dc34da8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e98fd9af34c94cc9ae11b37c8d1cf447/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and BILL BARROW",
      "description": "WASHINGTON (AP) — Even with the outcome uncertain Tuesday night, the 2024 presidential election already has exposed the depths of a fractured nation as the candidates navigated political shifts based on class, race and age under the near-constant threat of misinformation and violence.",
      "publishedAt": "2024-11-06T03:19:37Z",
      "title": "Early election takeaways: Next president will lead fractured nation",
      "url": "https://apnews.com/d0e4677f4cd53b4d2d8d18d674be5bf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d3de9db07924eb6add2f78ae70b2002/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Democratic efforts to salvage their Senate majority slipped further out of reach Tuesday after Democratic Sen.",
      "publishedAt": "2024-11-05T05:01:59Z",
      "title": "Democratic Sen. Sherrod Brown defeated in Ohio, putting Republicans closer to Senate majority",
      "url": "https://apnews.com/94b49277db2a5c21f23236794a36afa6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e75d0de8ff54385a509eb0710a7313a/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and ALI SWENSON",
      "description": "WASHINGTON (AP) — A series of bomb threats across multiple battleground states and baseless claims of wrongdoing by former President Donald Trump disrupted an otherwise smooth Election Day that capped a tumultuous presidential campaign.",
      "publishedAt": "2024-11-05T05:06:00Z",
      "title": "Bomb threats briefly disrupt voting in swing states as Trump makes baseless Election Day claims",
      "url": "https://apnews.com/a8ae22f34417dcda060b430dac89bdbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/439908f7d38844beb89abbc34e461d38/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — Voters defeated a measure to add abortion rights to the Florida state constitution on Tuesday but sided with abortion-rights advocates on ballot measures in Colorado, Maryland and New York.",
      "publishedAt": "2024-11-05T05:03:56Z",
      "title": "Abortion rights supporters lose on Florida ballot measure, but win in 3 other states",
      "url": "https://apnews.com/49c9073cbb6056b66a8a7d0d099795d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4007f477637406ea38905b33e20dc28/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "A costly campaign to legalize recreational marijuana in Florida failed Tuesday as voters in dozens of states weighed more than 140 measures appearing on the ballot alongside races for president and top state offices.",
      "publishedAt": "2024-11-05T05:02:42Z",
      "title": "Marijuana legalization fails in Florida as numerous states approve citizen voting amendments",
      "url": "https://apnews.com/64bada2b555df6c817151796fa81ae7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/665e604bee2d47fd8e2f4ed705dcfed2/2340.jpeg"
    },
    {
      "author": "JOSH BOAK and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Voters for Kamala Harris and Donald Trump who cast their ballots for Tuesday’s presidential election had vastly different motivations — reflecting a broader national divide on the problems the United States faces.",
      "publishedAt": "2024-11-05T22:01:14Z",
      "title": "AP VoteCast: Harris voters motivated by democracy, Trump supporters by inflation and immigration",
      "url": "https://apnews.com/d5cf4e3611f50ec4349d93ddc7f037cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e98b1674c0041fa9a5c6ec2074c421d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}