{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A longtime tabloid publisher was expected Tuesday to tell jurors about his efforts to help Donald Trump stifle unflattering stories during the 2016 campaign as testimony resumes in the historic hush money trial of the former president.",
      "publishedAt": "2024-04-23T04:08:37Z",
      "title": "'Catch-and-kill' to be described to jurors as testimony resumes in hush money trial of Donald Trump",
      "url": "https://apnews.com/d44d4a7ce66cc08edb5981b3afb882ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ca205100d8c47aeafca31e8008f8707/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — An independent review of the neutrality of the U.N. agency helping Palestinian refugees found that Israel never expressed concern about anyone on the staff lists it has received annually since 2011.",
      "publishedAt": "2024-04-22T16:38:38Z",
      "title": "Review of UN agency helping Palestinian refugees found Israel did not express concern about staff",
      "url": "https://apnews.com/28a63ddef23efdc4b050b0bcbdb587ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56779cefd97e4b389f9578acc02226ec/3000.jpeg"
    },
    {
      "author": "NICK PERRY, MICHELLE L. PRICE, DAVE COLLINS and NOREEN NASIR",
      "description": "NEW YORK (AP) — Columbia canceled in-person classes, dozens of protesters were arrested at New York University and Yale, and the gates to Harvard Yard were closed to the public Monday as some of the most prestigious U.S.",
      "publishedAt": "2024-04-22T13:54:15Z",
      "title": "Pro-Palestinian protests sweep US college campuses following mass arrests at Columbia",
      "url": "https://apnews.com/56c3d9d0a278c15ed8e4132a75ea9599",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71ef307d81cd4e3f9408157758e887c7/1920.jpeg"
    },
    {
      "author": "KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — India's main opposition party is accusing Prime Minister Narendra Modi of hate speech after he called Muslims “infiltrators\" and used some of his most incendiary rhetoric to date about the minority faith.",
      "publishedAt": "2024-04-23T05:38:59Z",
      "title": "Indian opposition accuses Modi of hate speech after he calls Muslims 'infiltrators'",
      "url": "https://apnews.com/90f70cfae68d39ecc80a90acab6e3e00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7995481067ff49d08c3a4cecc1827314/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The Senate is returning to Washington on Tuesday to vote on $95 billion in war aid to Ukraine, Israel and Taiwan, taking the final steps in Congress to send the legislation to President Joe Biden’s desk after months of delays and contentious internal debate over how involved the United States should be abroad.",
      "publishedAt": "2024-04-23T04:51:02Z",
      "title": "Aid for Ukraine, Israel and Taiwan heads to Senate for final approval after months of delay",
      "url": "https://apnews.com/8fe738b17e5c4b2636bc0de11b2620b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49ad31849c634085a30e678eddfa40d3/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The social media company founded by former President Donald Trump applied for a business visa program that he sought to restrict during his administration and which many of his allies want him to curtail in a potential second term.",
      "publishedAt": "2024-04-23T04:03:32Z",
      "title": "Trump called this visa 'very bad' for Americans. Truth Social applied for one",
      "url": "https://apnews.com/51c5a41faff696709a2d2cc6ec4e2695",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3accf33ad3142c9bbbeafc16f08a6e5/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — British Prime Minister Rishi Sunak 's latest effort to send some migrants to Rwanda finally won approval from Parliament early Tuesday, hours after he pledged deportation flights would begin in July.",
      "publishedAt": "2024-04-22T09:12:06Z",
      "title": "UK Parliament approves Rwanda deportation bill, ending weeks of legislative stalemate",
      "url": "https://apnews.com/c9f6f7cef29b7d7655f7c4f0bab7a94f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/839357d6eb834d70a5df0c658b421bdc/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un supervised salvo launches of the country’s “super-large” multiple rocket launchers that simulated a nuclear counterattack against enemy targets, state media said Tuesday, adding to tests and threats that have raised tensions in the region.",
      "publishedAt": "2024-04-22T22:59:34Z",
      "title": "North Korean leader Kim leads rocket drills that simulate a nuclear counterattack against enemies",
      "url": "https://apnews.com/ffeae93cf7829e0a3cfccd5bf1b706b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee42223e28d34fdfa3561eb1e44bc8ca/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL",
      "description": "LONG AN, Vietnam (AP) — There is one thing that distinguishes 60-year-old Vo Van Van’s rice fields from a mosaic of thousands of other emerald fields across Long An province in southern Vietnam’s Mekong Delta: It isn’t entirely flooded.",
      "publishedAt": "2024-04-23T02:15:08Z",
      "title": "In Vietnam, farmers reduce methane emissions by changing how they grow rice",
      "url": "https://apnews.com/e82d9101bcd440751a9d0db060b10c0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ad749c5f90349acbe74af6179603364/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — It’s springtime in Europe — time for the annual blossoming of spectacle and sound known as the Eurovision Song Contest.Taking place in May in Malmö, Sweden, the 68th annual competition will see acts from 37 countries vie for the continent’s pop crown in a feelgood extravaganza that strives — not always successfully – to banish international strife and division.",
      "publishedAt": "2024-04-23T05:37:48Z",
      "title": "From pop to politics, what to know as Sweden prepares for the 2024 Eurovision Song Contest",
      "url": "https://apnews.com/2a6a9a789415f04ae997a688274e4e6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50a36a775c2949c893bb39c16a878867/2661.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}