{
  "articles": [
    {
      "author": "ABDULRAHMAN SHAHEEN, SARAH EL DEEB and ABBY SEWELL",
      "description": "DAMASCUS, Syria (AP) — Ousted Syrian leader Bashar Assad fled to Moscow and received asylum from his longtime ally, Russian media said Sunday, hours after a stunning rebel advance seized control of Damascus and ended his family’s 50 years of iron rule.",
      "publishedAt": "2024-12-08T07:23:26Z",
      "title": "Ousted Syrian leader Assad flees to Moscow after fall of Damascus, Russian state media say",
      "url": "https://apnews.com/816e538565d1ae47e016b5765b044d31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbc31ebf328f463a88d88189fcdd223f/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "MANAMA, Bahrain (AP) — For Iran’s theocratic government, it keeps getting worse. Its decadeslong strategy of building an “Axis of Resistance” supporting militant groups and proxies around the region is falling apart.",
      "publishedAt": "2024-12-08T16:42:02Z",
      "title": "Analysis: Collapse of Syria's Assad is a blow to Iran's 'Axis of Resistance'",
      "url": "https://apnews.com/c853bf613a6d6af7f6aa99b2e60984f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbd45aaf92b8454fbcf7bce30f04eaf8/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Abu Mohammed al-Golani, the militant leader whose stunning insurgency toppled Syria’s President Bashar Assad, has spent years working to remake his public image, renouncing longtime ties to al-Qaida and depicting himself as a champion of pluralism and tolerance.",
      "publishedAt": "2024-12-08T11:46:31Z",
      "title": "Who is Abu Mohammed al-Golani, the leader of the insurgency that toppled Syria's Assad?",
      "url": "https://apnews.com/aab4c8894238904a4e351076726499fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/368d75a4811843c58ecf83fb3562c5eb/2232.jpeg"
    },
    {
      "author": "BILL BARROW and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Donald Trump said he can't guarantee that his promised tariffs on key U.S.",
      "publishedAt": "2024-12-08T17:03:32Z",
      "title": "Trump says he can't guarantee tariffs won't raise US prices and won't rule out revenge prosecutions",
      "url": "https://apnews.com/72c08269f0a870d20e29033319201e22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15ab5377a0eb49c3a75ff311e32160ae/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — Police don't know who he is, where he is, or why he did it. As the frustrating search for UnitedHealthcare CEO Brian Thompson’s killer got underway for a fifth day Sunday, investigators reckoned with a tantalizing contradiction: They have troves of evidence, but the shooter remains an enigma.",
      "publishedAt": "2024-12-08T16:19:10Z",
      "title": "The hunt for UnitedHealthcare CEO's elusive killer yields new evidence, but few answers",
      "url": "https://apnews.com/81b07e0210486aea9d0864dd385ae9cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dad5417a12243c793d537f5b7514c9a/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and JOANNA KOZLOWSKA",
      "description": "WASHINGTON (AP) — Donald Trump on Sunday pushed Russian leader Vladimir Putin to act to reach an immediate ceasefire with Ukraine, describing it as part of his active efforts as president-elect to end the war despite being weeks from taking office.",
      "publishedAt": "2024-12-08T12:02:22Z",
      "title": "Trump calls for immediate ceasefire in Ukraine and says a US withdrawal from NATO is possible",
      "url": "https://apnews.com/e00a18db202ef74b38e009bb2a5381cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e915c489b5d4d5198eead7efaf2b527/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL BALAH, Gaza Strip (AP) — Israeli airstrikes in central Gaza killed at least 14 people including children Sunday, Palestinian health officials said, while the bombing of a hospital in northern Gaza wounded a half-dozen patients.",
      "publishedAt": "2024-12-08T18:18:34Z",
      "title": "Gaza health officials say latest Israeli airstrikes kill at least 14 including children",
      "url": "https://apnews.com/20a0d3732f81d88246f446b9e169113e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b90742dcb255452fb3d7281f1b05cb9f/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — In an era of rising authoritarianism, at the heels of a six-hour martial law decree that unfolded while many South Koreans slept, something noteworthy happened: Democracy held.",
      "publishedAt": "2024-12-08T15:52:46Z",
      "title": "South Korea's democracy held after a 6-hour power play. What does it say for democracies elsewhere?",
      "url": "https://apnews.com/caa2e5c9bbbe59c3af7f3bfab65bdf4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/752359f913b74b74a1766737b04b36c2/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Shortly after Donald Trump’s win in last month’s U.S. election, Israeli Prime Minister Benjamin Netanyahu rushed to congratulate the president-elect: “History’s greatest comeback!” he gushed.",
      "publishedAt": "2024-12-08T05:18:13Z",
      "title": "Trump's return may be a boon for Netanyahu, but challenges abound in a changed Middle East",
      "url": "https://apnews.com/c5aebb98b47d6100c5bd3c5c7f945e1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9074ed8c77834ca2b80e1fc663948ce5/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "The new, 12-team College Football Playoff brings with it a promise to be bigger, more exciting, more lucrative.",
      "publishedAt": "2024-12-08T11:10:20Z",
      "title": "First 12-team College Football Playoff set, Oregon seeded No. 1 and SMU edges Alabama for last spot",
      "url": "https://apnews.com/19ca5f1d2de4d1fb6b724880a2b4331e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1aa8ac1fbb7d4c979e6388b2d294c240/2902.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}