{
  "articles": [
    {
      "author": "GENE JOHNSON, MIKE CATALINI",
      "description": "President Donald Trump’s executive order denying U.S. citizenship to the children of parents living in the country illegally has faced the first of what will be many legal tests. It didn’t fare well. A Justice Department lawyer had barely started making his arguments in a Seattle courtroom when U.S. District Judge John C. Coughenour began blistering him with questions, calling the executive order “blatantly unconstitutional.” Coughenour went on to temporarily block it pending further arguments.",
      "publishedAt": "2025-01-24T05:04:53Z",
      "title": "What to know about the ruling blocking Trump's order on birthright citizenship",
      "url": "https://apnews.com/article/birthright-citizenship-trump-lawsuit-immigration-21b7a941442e598003e390da09893071",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "President Donald Trump is poised to sign the first bill of his new administration. It's named after a slain Georgia nursing student whose name became a rallying cry during his White House campaign. If signed into law, the Laken Riley Act would require the detention of unauthorized immigrants accused of theft and violent crimes. The bill won bipartisan support in both the House and Senate. Under the new law, federal officials would be required to detain any migrant arrested or charged with crimes like shoplifting, assaulting a police officer or crimes that injure or kill someone.",
      "publishedAt": "2025-01-24T05:02:19Z",
      "title": "What is the Laken Riley Act? And who voted for it?",
      "url": "https://apnews.com/article/what-is-laken-riley-act-trump-immigration-2667d626139ddf5a16d1533516eab18f",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1bd3de/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F90%2F431ce701d7ba3532497224d1cb23%2Ff144a6fef3d7470a9fe1b25b46e48b41"
    },
    {
      "author": "AMY TAXIN",
      "description": "President Donald Trump is criticizing California water policy as he prepares to tour wildfire damage in Los Angeles. Since the fires broke out Jan. 7, Trump has accused the state of sending too much water to the Pacific Ocean instead of south toward Los Angeles. But the federally managed Central Valley Project doesn't carry water to the nation's second most-populous city and mostly supplies farms. The Metropolitan Water District of Southern California says it has ample storage to meet the region's water needs.",
      "publishedAt": "2025-01-24T05:09:50Z",
      "title": "Trump targets California water policy as he prepares to tour LA fire damage",
      "url": "https://apnews.com/article/california-water-trump-delta-smelt-farmers-943082304d6ec61511fb1a0b95ca771a",
      "urlToImage": "https://dims.apnews.com/dims4/default/993529d/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F16%2F939a07676ab129d81e00604d18e5%2Fc6e37c5c7a184ddcabff7f7105e0229a"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "President Donald Trump has ordered the release of thousands of classified governmental records related to the assassination of President John F. Kennedy. The executive order Trump signed Thursday also aims to declassify the remaining federal records relating to the assassinations of Sen. Robert F. Kennedy and Martin Luther King Jr. The order is among a flurry of actions Trump has quickly taken as he begins a second term. Only a few thousand of the millions of governmental records related to the JFK assassination have yet to be fully declassified.",
      "publishedAt": "2025-01-23T21:51:09Z",
      "title": "Trump declassifies JFK, RFK and MLK assassination records",
      "url": "https://apnews.com/article/trump-jfk-mlk-rfk-assassination-files-e92f89d694eb55c595175f71a72cb5bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/59fd915/2147483647/strip/true/crop/7340x4129+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2F32%2Fc8149e8e4c6062923381b5ba6596%2F99a6cf1be26446e2840d274d2c8b2cfe"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "President Donald Trump is pardoning anti-abortion activists who were convicted in the October 2020 invasion and blockade of a Washington clinic. Lauren Handy was sentenced to nearly five years in prison for leading the blockade by directing activists to link themselves together with locks and chains to block the clinic’s doors. Trump pardoned Handy and her nine co-defendants. The news of the pardons comes ahead of Friday’s annual anti-abortion protest March for Life in Washington, D.C., where the president is expected to address the crowd in a video.",
      "publishedAt": "2025-01-23T21:36:18Z",
      "title": "Trump pardons anti-abortion activists who blockaded clinic entrances",
      "url": "https://apnews.com/article/abortion-trump-executive-order-pardon-817774b21d32a4edf6d39ee43cbc18f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/1458926/2147483647/strip/true/crop/5181x2914+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2Fe6%2F82a2ffcda6facc643fa1bd84af93%2F11880361b22e4ab7a23059504d59b25e"
    },
    {
      "author": "TARA COPP",
      "description": "Pete Hegseth, President Donald Trump’s nominee for defense secretary, paid $50,000 to the woman who accused him of sexual assault in 2017. That's according to answers he provided to a senator during his confirmation process that The Associated Press has obtained. The answers were provided to Massachusetts Democratic Sen. Elizabeth Warren in response additional questions she had for Hegseth as part of the vetting process. Hegseth attorney Timothy Parlatore declined to comment on the dollar figure Thursday. Hegseth told police at the time that the encounter had been consensual and denied any wrongdoing. The news of the payment comes the same day the Senate advanced Hegseth’s nomination along a party-line vote.",
      "publishedAt": "2025-01-23T21:46:56Z",
      "title": "Hegseth told senator he paid $50,000 to woman who accused him of 2017 sex assault",
      "url": "https://apnews.com/article/hegseth-sex-assault-payment-trump-6674cc8cfee654c374725948e01ff666",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f287bd/2147483647/strip/true/crop/5443x3062+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F21%2F7d%2Fb128a919234e5878af298b7b02d9%2F35edda763db647518551197f33ae129c"
    },
    {
      "author": "MEGAN JANETSKY, EDGAR H. CLEMENTE",
      "description": "Migrants in Mexico who were hoping to come to the U.S. are adjusting to a new and uncertain reality after President Donald Trump began cracking down on border security. Many remain determined to reach the U.S. through more dangerous means, riding freight trains, hiring smugglers and dodging authorities. Some lined up in Mexico’s refugee offices to seek asylum in that country. Others are contemplating finding a way back home. Trump has declared a national emergency at the U.S.-Mexico border and is sending U.S. troops, saying he wants to halt illegal entry and border crime.",
      "publishedAt": "2025-01-24T05:05:02Z",
      "title": "Asylum-seekers pushed to new extremes in Mexico after Trump's border crackdown begins",
      "url": "https://apnews.com/article/immigration-mexico-trump-22702c081ec8e8fec5f53e130b00b9ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/644d1e6/2147483647/strip/true/crop/5452x3067+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F87%2F8eb78793ae7438303a46aa5c37e5%2F27ccc2d8f32e4b41870eba5f09f9aa47"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "Those binders full of executive orders that President Donald Trump has been signing with a flourish in recent days don’t just magically appear before him. White House staff secretary Will Scharf has been a prominent part of the tableau. He stands at Trump’s side and tees up the leather-bound folders for the president. With the cameras rolling, Scharf provides running narration on what Trump is signing. Scharf was a member of Trump’s legal team before joining his new administration as staff secretary. The job has traditionally involved managing the papers that cross the president’s desk.",
      "publishedAt": "2025-01-24T05:01:10Z",
      "title": "Who's the guy handing Trump those binders of executive orders? Meet Will Scharf",
      "url": "https://apnews.com/article/trump-white-house-staff-secretary-will-scharf-7b9b6ca8ff99e4d79b743999bf560f62",
      "urlToImage": "https://dims.apnews.com/dims4/default/88610e1/2147483647/strip/true/crop/6227x3503+0+327/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2Fb2%2F1c95109651be02c09f2fcc755291%2Fdac5ca15b5bd42ba99cc03e99fbad07b"
    },
    {
      "author": "WILL WEISSERT, CHRIS MEGERIAN",
      "description": "President Donald Trump is heading to hurricane-battered western North Carolina and wildfire-ravaged Los Angeles. It's the first trip of his second term. Trump has frequently blended politics and disasters, and Friday will likely be no different. He has sharply criticized President Joe Biden's administration for its handling of Hurricane Helene in North Carolina, and he's suggested withholding money from California unless it changes water policies. Trump will follow those stops with a Saturday victory rally in Las Vegas, where he plans to start detailing how he can begin keeping a campaign promise to exclude tips from federal taxes.",
      "publishedAt": "2025-01-24T05:05:04Z",
      "title": "Trump to visit disaster zones in North Carolina and California on first trip of second term",
      "url": "https://apnews.com/article/trump-first-trip-california-north-carolina-nevada-b906880254ce7bf249c3dcefa45bf846",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2e286f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F39%2F1e68945b0535510cdd007e62811b%2Ff0988800cf5c4ac3ba66c8d5add1f771"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "U.S. officials say active duty military troops are arriving in El Paso, Texas, and in San Diego on Thursday evening. They are the first batch of new forces being deployed to secure the southern border. The Pentagon announced on Wednesday that about 1,500 troops were being sent to the border this week, as the department scrambles to put in motion President Donald Trump’s executive order demanding an immediate crackdown on immigration. The officials say they expect additional troops to be deployed in the coming days as defense and homeland security leaders iron out requests for more support. They spoke on condition of anonymity to provide details on troop movements.",
      "publishedAt": "2025-01-23T22:42:59Z",
      "title": "US active duty troops beginning to arrive in Texas and San Diego to support border security",
      "url": "https://apnews.com/article/troops-border-texas-california-migrants-e8fb79b6154c816a591261b30892ce06",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d299ae/2147483647/strip/true/crop/5381x3027+0+280/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2Fcb%2Fb1caf97b533fd2a37eb02126c3bb%2F2c789c8b0c2e4b389eb1ab3a7debc468"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}