{
  "articles": [
    {
      "author": "STEVE PEOPLES and MEG KINNARD",
      "description": "NEW YORK (AP) — Nikki Haley suspended her presidential campaign on Wednesday after being soundly defeated across the country on Super Tuesday, leaving Donald Trump as the last remaining major candidate for the 2024 Republican nomination.",
      "publishedAt": "2024-03-06T04:05:41Z",
      "title": "Nikki Haley suspends her campaign and leaves Donald Trump as the last major Republican candidate",
      "url": "https://apnews.com/95ab56b68a8eefbbf04ef90f2f00ef29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc964f13025d4085b410be9664d518e8/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT, BILL BARROW and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden and his predecessor, Donald Trump, romped through more than a dozen states on Super Tuesday, all but cementing a November rematch and pushing the former president’s last major rival, Nikki Haley, out of the Republican race.",
      "publishedAt": "2024-03-05T05:06:26Z",
      "title": "Biden and Trump dominate Super Tuesday races and move closer to a November rematch",
      "url": "https://apnews.com/e36971a222a2b50d35cb0a2c603ce4d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e00b5dc903a447dd9ffb6cc88decac68/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and TARA COPP",
      "description": "DUBAI, United Arab Emirates (AP) — A suspected attack by Yemen's Houthi rebels on a commercial ship in the Gulf of Aden caused “fatalities” and forced the crew to abandon the vessel on Wednesday, authorities said, the first fatal strike in a campaign of assaults by the group over Israel's war on Hamas in the Gaza Strip.",
      "publishedAt": "2024-03-06T01:23:36Z",
      "title": "A likely Yemen Houthi attack hits a ship, causing the first 'fatalities' in the assaults on shipping",
      "url": "https://apnews.com/89c5440d9943216a787b39912bd969e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bf30bed5b0e492cb2523f86c7b683ee/1920.jpeg"
    },
    {
      "author": "SUSIE BLANN and DEREK GATOPOULOS",
      "description": "KYIV, Ukraine (AP) — The sound of a large explosion reverberated around the Ukrainian port of Odesa as President Volodymyr Zelenskyy and Greece's prime minister ended a tour of the war-ravaged southern city Wednesday.",
      "publishedAt": "2024-03-06T16:25:29Z",
      "title": "A blast rocks the Ukrainian city of Odesa during a visit by Zelenskyy and Greece's prime minister",
      "url": "https://apnews.com/ee50ab4c3db41314f3294d257e6950d8",
      "urlToImage": ""
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Senate Republican leader Mitch McConnell endorsed Donald Trump for president on Wednesday, a remarkable turnaround from the onetime critic who blamed the then-president for “disgraceful” acts in the Jan.",
      "publishedAt": "2024-03-06T15:35:44Z",
      "title": "McConnell endorses Trump for president. He once blamed Trump for 'disgraceful' Jan. 6, 2021, attack",
      "url": "https://apnews.com/422a2ec6f19917b46804b4cf6ee40371",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3396284455d04e95a5c4d7cc10d84856/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Over the last five months, Israel has killed thousands of Hamas fighters, destroyed dozens of their tunnels and wreaked unprecedented destruction on the Gaza Strip.But it still faces a dilemma that was clear from the start of the war and will ultimately determine its outcome: It can either try to annihilate Hamas, which would mean almost certain death for the estimated 100 hostages still held in Gaza, or it can cut a deal that would allow the militants to claim a historic victory.",
      "publishedAt": "2024-03-06T05:04:20Z",
      "title": "Hostage crisis poses dilemma for Israel and offers a path to victory for Hamas",
      "url": "https://apnews.com/0b4720545d294b4eb25eb97055c238eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d2aaebea71b461a89782db6dbac9b5a/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — When charismatic opposition leader Boris Nemtsov was gunned down on a bridge near the Kremlin in February 2015, more than 50,000 Muscovites expressed their shock and outrage the next day at the brazen assassination.",
      "publishedAt": "2024-03-06T05:15:58Z",
      "title": "How Putin's crackdown on dissent became the hallmark of the Russian leader’s 24 years in power",
      "url": "https://apnews.com/532705369591610a94e9e86340233380",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7e0b753297a4edbb0c6a295c6e8a612/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "WASHINGTON (AP) — Ancient stone tools found in western Ukraine may be the oldest known evidence of early human presence in Europe, according to research published Wednesday in the journal Nature.",
      "publishedAt": "2024-03-06T16:13:00Z",
      "title": "Ancient stone tools found in Ukraine date to over 1 million years ago, and may be oldest in Europe",
      "url": "https://apnews.com/469327d6956b3f09c7d984dc633660f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95ada67ea1484e2a9dda9bdf70316a7a/1294.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Chair Jerome Powell reinforced his belief Wednesday that the Federal Reserve will cut its key interest rate this year but that it first wants to see more evidence that inflation is falling sustainably back to the Fed’s 2% target.",
      "publishedAt": "2024-03-06T05:01:19Z",
      "title": "Fed's Powell: Rate cuts likely this year, but more evidence is needed that inflation is tamed",
      "url": "https://apnews.com/d7ea4854d0e21feeb28f7891a1447d70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cee75d0fcad42908751ce6432ec90e4/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "Elon Musk supported making OpenAI a for-profit company, the ChatGPT maker said, attacking a lawsuit from the wealthy investor who has accused the artificial intelligence business of betraying its founding goal to benefit humanity as it pursued profits instead.",
      "publishedAt": "2024-03-06T11:01:02Z",
      "title": "OpenAI says Musk agreed the ChatGPT maker should become a for-profit company",
      "url": "https://apnews.com/4a4c0a19316f849f65db9e6d2b0b7a6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/242ad62b46f045a388f11387ecd4e600/2503.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}