{
  "articles": [
    {
      "author": "Nicholas Riccardi",
      "description": "President Donald Trump keeps talking about sending U.S. citizens who commit violent crimes to prison in El Salvador. But that's likely illegal. The whole purpose of sending people to the Central American country's prisons is that they're harsher than ones in the United States and federal courts would have no way of ensuring prisoners' rights were respected. That violates several constitutional guarantees. Additionally, only immigrants, not U.S. citizens, can be deported from the United States. Trump has said his administration is trying to find ways to make such incarceration legal anyway.",
      "publishedAt": "2025-04-15T00:44:02Z",
      "title": "Trump wants to imprison US citizens in El Salvador. That's likely illegal",
      "url": "https://apnews.com/article/trump-citizens-prison-el-salvador-illegal-79113d0ccefefd1f7d8e51c3a4c3defd",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e6013a/2147483647/strip/true/crop/5836x3283+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2Fd2%2Fbb3e87bccbbfea2f6fb3a2cd0ae6%2Ffb15dcee97d74f159d05eb5da8704576"
    },
    {
      "author": "Seung Min Kim, Marcos Alemán",
      "description": "President Donald Trump’s top advisers and El Salvador president Nayib Bukele say that they have no basis for the small Central American nation to return a Maryland man who was wrongly deported there last month. Trump administration officials are emphasizing that Kilmar Abrego Garcia, who was sent to a notorious gang prison in El Salvador, was a citizen of that country and that U.S. has no say in his future. And Bukele, who has been a vital partner for the Trump administration in its deportation efforts, said “of course\" he won't release him back to U.S. soil. The Supreme Court has called for the Trump administration to “facilitate” the return of Abrego Garcia to the U.S.",
      "publishedAt": "2025-04-14T04:11:17Z",
      "title": "El Salvador's president won't return Kilmar Abrego Garcia to the US",
      "url": "https://apnews.com/article/donald-trump-white-house-el-salvador-kilmar-abrego-garcia-ad338d6b4558a6aba80e8290fd3eece9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e2e25ce/2147483647/strip/true/crop/3824x2151+0+199/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F78%2Fa796550d7be13b11eade80044275%2F5587e03d63e2489c991fe65cef763050"
    },
    {
      "author": "Ben Finley",
      "description": "Kilmar Abrego Garcia's story begins in El Salvador. But it's become increasingly unclear where it will end. His attorneys say he fled his native country at 16 because a local gang threatened to kill him. He then lived in Maryland for 14 years and started a family. He was mistakenly deported to an El Salvador prison last month. The U.S. Supreme Court has ordered the Trump administration to return him. But the White House pushed back against the idea on Monday. It maintains that he’s an MS-13 gang member. Attorneys for Abrego Garcia say there’s no evidence he was in a gang.",
      "publishedAt": "2025-04-11T01:22:06Z",
      "title": "Who is Kilmar Abrego Garcia, the man ICE mistakenly deported?",
      "url": "https://apnews.com/article/who-is-abrego-garcia-e1b2af6528f915a1f0ec60f9a1c73cdd",
      "urlToImage": "https://dims.apnews.com/dims4/default/30ecb5c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F92%2Fd5629f3fd4aa11c5a7652a05ca0d%2Fd6725e809f7a4654b0f9099bf2136747"
    },
    {
      "author": "Michael Casey",
      "description": "Harvard University says it won't comply with a list of demands from the Trump administration as a condition for it to received almost $9 billion in funding. The demands are part of the Trump administration's effort to investigate antisemitism at many universities. The list at Harvard was updated Friday, and includes government and leadership reforms, as well as a requirement to institute a merit-based admissions and hiring policy. It also includes an audit of the study body and faculty on their views about diversity, as well as a ban on face masks which appeared to target pro-Palestinian protesters.",
      "publishedAt": "2025-04-14T19:35:20Z",
      "title": "Harvard defies Trump's demands and risks $9B in federal funding",
      "url": "https://apnews.com/article/harvard-trump-administration-federal-cuts-antisemitism-0a1fb70a2c1055bda7c4c5a5c476e18d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5c3cf7/2147483647/strip/true/crop/2540x1429+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F5f%2F1d1fe8f795e8a21c613d398676b4%2Fb57cca02200840dbb798e899ecb2eb63"
    },
    {
      "author": "Kathy Mccormack",
      "description": "A federal judge in Vermont who's considering whether he has jurisdiction over the case of a Turkish Tufts University student detained by immigration officials has raised the idea of having her brought back to his court for a hearing. U.S. District Judge William Sessions took under advisement Monday arguments over Rumeysa Ozturk. She was taken by immigration officials as she was walking in a Boston suburb on March 25. After being taken to New Hampshire and then Vermont, she was put on a plane the next day and moved to an immigration detention center in Louisiana. Ozturk’s lawyers are challenging that authority. They've asked that she be immediately released. A Justice Department lawyer says the immigration court has jurisdiction.",
      "publishedAt": "2025-04-14T18:46:37Z",
      "title": "Judge in Vermont considers whether he has jurisdiction of detained Tufts University student's case",
      "url": "https://apnews.com/article/rumeysa-ozturk-deportation-tufts-massachusetts-student-8043e94688adf48448862ac6e1f46fe5",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe0f037/2147483647/strip/true/crop/3000x1688+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F37%2F0e5c878bf1563d14a00cb3389baa%2F6d3747bbe5ee4dc4a9df67bb63ddbf24"
    },
    {
      "author": "Annie Ma",
      "description": "Several international students who have had their visas revoked in recent weeks have filed lawsuits against the Trump administration. They argue the government denied them due process when it suddenly took away their permission to be in the U.S. The actions by the federal government to terminate students’ legal status have left hundreds of scholars at risk of detention and deportation. Their schools range from private universities like Harvard and Stanford to large public institutions like the University of Maryland and Ohio State University to some small liberal arts colleges. Colleges say some students are being singled out over infractions as minor as traffic violations, including some long in the past.",
      "publishedAt": "2025-04-07T21:49:09Z",
      "title": "What to know about international student visas being revoked",
      "url": "https://apnews.com/article/f1-visa-international-college-student-trump-9d4d900d328a0c205503c1178e70f1d5",
      "urlToImage": "https://dims.apnews.com/dims4/default/edae187/2147483647/strip/true/crop/3375x1898+0+176/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F59%2F3105889d8b5d0953ce186c980ad0%2F0fd4f19367bd463f86596f08f91d3953"
    },
    {
      "author": "Patrick Whittle, Holly Ramer",
      "description": "A Palestinian man who led protests against the war in Gaza as a student at Columbia University has been arrested at a Vermont immigration office where he expected to be interviewed about finalizing his U.S. citizenship. Mohsen Mahdawi, a legal permanent resident who has held a green card since 2015, was detained Monday. His attorneys, who have filed a petition in federal court seeking an order barring the government from removing him from the state or country, say they do not know where he is. At Columbia, he organized campus protests of Israel’s military campaign in Gaza until March 2024. He also co-founded the Palestinian Student Union with Mahmoud Khalil, another Palestinian permanent resident of the U.S. who recently was detained by ICE.",
      "publishedAt": "2025-04-14T20:40:42Z",
      "title": "Palestinian activist expecting US citizenship interview is arrested instead by ICE",
      "url": "https://apnews.com/article/immigration-palestine-protest-trump-deportation-columbia-fca7e73fe2cbd616c1eacf3bdececdbe",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d9cb09/2147483647/strip/true/crop/1004x565+0+67/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2Fc3%2F709df935bd0fc6ca3147d70c2e4f%2Fa293f62c33854dc4a4c2b9fcc2544715"
    },
    {
      "author": "Marc Levy",
      "description": "The Philadelphia district attorney who became a campaign trail punching bag for Republicans amid rising crime in U.S. cities during the coronavirus pandemic is running for reelection on the back end of a withering effort to oust progressive district attorneys nationwide. Larry Krasner is striking a confident tone as he seeks a third term. Crime rates are dropping as Krasner vows resistance to President Donald Trump’s agenda and emphasizes the importance of being tough on violent crime. Krasner’s opponent in the May 20 Democratic primary is Pat Dugan, a former Philadelphia judge. Dugan calls Krasner “Let ’em Go Larry” and accuses Krasner of staffing the district attorney's office with inexperienced lawyers.",
      "publishedAt": "2025-04-15T12:11:25Z",
      "title": "Philadelphia progressive prosecutor Larry Krasner seeks third term",
      "url": "https://apnews.com/article/larry-krasner-philadelphia-prosecutor-district-attorney-crime-ceb0f5439e9c8dc86bffaec70308fde6",
      "urlToImage": "https://dims.apnews.com/dims4/default/39bee35/2147483647/strip/true/crop/3000x1688+0+199/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F8b%2F11c46269a0e4580cb0fb665514d4%2F056cfc0624914240899aeb51df414693"
    },
    {
      "author": "Julie Watson",
      "description": "At the San Diego Zoo Safari Park, a herd of African elephants was caught on video running over to protect their young by encircling them during a 5.2 magnitude earthquake. The elephants run as the video from the Southern California park starts to shake and then they appear to encircle the young. They stay in the cluster for several minutes after the rocking stops. The park says elephants have the ability to feel sound through their feet, and the behavior is known as an “alert circle.” The quake that hit Monday morning and was centered in San Diego County caused no injuries or major damage.",
      "publishedAt": "2025-04-15T00:29:47Z",
      "title": "Elephants at San Diego safari park huddle to protect calves during earthquake",
      "url": "https://apnews.com/article/earthquake-elephants-san-diego-zoo-safari-park-82311a59f471f5f48319c33f1c47f702",
      "urlToImage": "https://dims.apnews.com/dims4/default/56fe6b5/2147483647/strip/true/crop/2154x1212+0+112/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F39%2F9fe62c3bdc0108cac19c989727d9%2F6fcff387fc1e4490bfb502850cdd17fd"
    },
    {
      "author": "Doug Feinberg",
      "description": "Paige Bueckers is headed to Dallas as the first pick in the WNBA draft. The versatile UConn star is the latest Huskies standout to go No. 1, joining former greats Sue Bird, Diana Taurasi, Maya Moore and Breanna Stewart. Bueckers will have plenty of company, especially with the WNBA having its first expansion team in 17 years and the Golden State Valkyries making their debut draft selection at No. 5 overall. The first round will feature 12 picks, with 13 in each of the final two rounds.",
      "publishedAt": "2025-04-14T14:22:35Z",
      "title": "Dallas Wings pick Paige Bueckers as No.1 pick in WNBA draft 2025",
      "url": "https://apnews.com/article/wnba-2025-draft-paige-bueckers-a28fac1f8159d889ce385339717ab987",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e6674b/2147483647/strip/true/crop/2437x1371+0+127/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2Fad%2F8ca93f84be7af3c51891f3a6283a%2F47b3811be15f47b9a82fb32b120e816b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}