{
  "articles": [
    {
      "author": "BASSEM MROUE and MELANIE LIDMAN",
      "description": "BEIRUT (AP) — Lebanon’s Hezbollah group confirmed on Saturday that its leader and one of its founding members, Hassan Nasrallah, was killed in an Israeli airstrike in a southern suburb of Beirut.",
      "publishedAt": "2024-09-28T07:17:19Z",
      "title": "Hezbollah confirms its leader Hassan Nasrallah was killed in an Israeli airstrike",
      "url": "https://apnews.com/c4751957433ff944c4eb06027885a973",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d7d9a5bfe364515b805427c6edd531b/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and MATTHEW LEE",
      "description": "REHOBOTH BEACH, Del. (AP) — The Israeli strike that killed Hezbollah’s Hassan Nasrallah was a “measure of justice\" for victims of a four-decade “reign of terror,” President Joe Biden said Saturday.",
      "publishedAt": "2024-09-28T16:45:48Z",
      "title": "Biden and Harris call the Israeli strike killing Hezbollah’s Nasrallah a 'measure of justice'",
      "url": "https://apnews.com/024756fb7c2b7bdda93454db97659a19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d7e42177e1448cb96fb1dd9f150a704/3000.jpeg"
    },
    {
      "author": "STEPHEN SMITH, KATE PAYNE and HEATHER HOLLINGSWORTH",
      "description": "PERRY, Fla. (AP) — Massive rains from powerful Hurricane Helene left people stranded, without shelter and awaiting rescue Saturday, as the cleanup began from a tempest that killed at least 56 people, caused widespread destruction across the U.S.",
      "publishedAt": "2024-09-28T06:19:14Z",
      "title": "At least 56 dead and millions without power after Helene's deadly march across the Southeast",
      "url": "https://apnews.com/92d5caaafe40644e1db687cf6431395f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2ea64b82bda4fa79f91d1f70796a9ce/1920.jpeg"
    },
    {
      "author": "ERIK VERDUZCO, TRAVIS LOLLER and GEORGE WALKER IV",
      "description": "ASHEVILLE, N.C. (AP) — Floodwaters pushed by the remnants of Hurricane Helene left North Carolina’s largest mountain city isolated Saturday by damaged roads and a lack of power and cellphone service, part of a swath of destruction across southern Appalachia that left an unknown number dead and countless worried relatives unable to reach loved ones.",
      "publishedAt": "2024-09-28T18:33:28Z",
      "title": "Asheville has been isolated after Helene wrecked roads and knocked out power and cell service",
      "url": "https://apnews.com/078a298cdcaaf46749f3f6683a4e1057",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cae5a43d074945299c1d7df12487cffd/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congress is off for the campaign season, as lawmakers from one of the most chaotic and unproductive legislative sessions in modern times try to persuade voters to keep them on the job.",
      "publishedAt": "2024-09-28T11:41:34Z",
      "title": "After a chaotic Congress, lawmakers head home to ask voters: How about another term?",
      "url": "https://apnews.com/ef7ef9a498e1c7a04971bf28b59c81f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afe8a9bd3a814fac8c16f8b1d83a7556/3000.jpeg"
    },
    {
      "author": "TODD RICHMOND and COLLEEN LONG",
      "description": "PRAIRIE DU CHIEN, Wis. (AP) — Former President Donald Trump meandered Saturday through a list of grievances against Vice President Kamala Harris and other issues during an event intended to link his Democratic opponent to illegal border crossings.",
      "publishedAt": "2024-09-28T04:12:51Z",
      "title": "Trump lists his grievances in a Wisconsin speech intended to link Harris to illegal immigration",
      "url": "https://apnews.com/0810efccefc8b094756d0c46f927b7dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a29ce73867984a8ab6dce3492c08e87b/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — SpaceX launched a rescue mission for the two stuck astronauts at the International Space Station on Saturday, sending up a downsized crew to bring them home but not until next year.",
      "publishedAt": "2024-09-28T17:18:37Z",
      "title": "SpaceX launches rescue mission for 2 NASA astronauts who are stuck in space until next year",
      "url": "https://apnews.com/e179d0dc6c77d224278fd0430148ff8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f518ca402b44719bda367e59fefcf69/2208.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME and GERALD IMRAY",
      "description": "JOHANNESBURG (AP) — Seventeen people, including 15 women, were killed in two mass shootings that took place at two homes on the same street in a rural town in South Africa, police said Saturday.A search was underway for the suspects, national police spokesperson Brig.",
      "publishedAt": "2024-09-28T11:51:31Z",
      "title": "17 people have been killed in 2 mass shootings in the same street in South Africa",
      "url": "https://apnews.com/86e1fe1e481781793c76cc82f65049c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66907c4494f64138b993c44931e4fd9c/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "For months, New York City Mayor Eric Adams — a former cop — refused to criticize the federal authorities investigating his administration. Not anymore.The day news of his indictment on corruption charges broke, Adams defiantly suggested, without providing evidence, that U.S.",
      "publishedAt": "2024-09-28T04:08:25Z",
      "title": "Indicted New York City mayor adopts familiar defense: He was targeted for his politics",
      "url": "https://apnews.com/8a99f5b8e42626eed1f1818fbd9f63ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8a20604f9464b7d8f4f892e007882a6/3000.jpeg"
    },
    {
      "author": "SCOTT SONNER",
      "description": "By all accounts, Milagra the \"miracle\" California condor shouldn’t be alive today. But now at nearly 17 months old, she is one of three of the giant endangered birds who got to stretch their wings in the wild as part of a release this weekend near the Grand Canyon.",
      "publishedAt": "2024-09-28T04:01:45Z",
      "title": "A rare condor hatched and raised by foster parents in captivity now gets to live wild",
      "url": "https://apnews.com/53d2e43f9873bab6d9a3b82fc6d2bfb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b941ec25686b49b7a8451b1fcd2a7541/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}