{
  "articles": [
    {
      "author": "WALTER BERRY",
      "description": "PHOENIX (AP) — Phoenix sizzled through its 31st consecutive day of at least 110 degrees Fahrenheit (43.3 Celsius) and other parts of the country grappled Sunday with record temperatures after a week that saw significant portions of the U.S.",
      "publishedAt": "2023-07-30T23:33:58Z",
      "title": "July keeps sizzling as Phoenix hits another 110-degree day and wildfires spread in California",
      "url": "https://apnews.com/c4e7ff29fef6fcf9c95b8b9c82f6f72b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62af7b2b46a94628a79582e0e6715423/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A Georgia prosecutor is expected to seek a grand jury indictment in the coming weeks in her investigation into efforts by Donald Trump and his allies to overturn the former president's 2020 election loss.",
      "publishedAt": "2023-07-31T04:23:36Z",
      "title": "Trump could be indicted soon in Georgia. Here's a look at that investigation",
      "url": "https://apnews.com/30f7874b58137831cfa5dd86415a9e9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59dcceb1f8ff493f85a975be9c322894/2371.jpeg"
    },
    {
      "author": "ANWARULLAH KHAN and RIAZ KHAN",
      "description": "KHAR, Pakistan (AP) — A suicide bomber blew himself up at a political rally in a former stronghold of militants in northwest Pakistan bordering Afghanistan on Sunday, killing at least 44 people and wounding nearly 200 in an attack that a senior leader said was meant to weaken Pakistani Islamists.",
      "publishedAt": "2023-07-30T12:47:37Z",
      "title": "Suicide bomber at political rally in northwest Pakistan kills at least 44 people, wounds nearly 200",
      "url": "https://apnews.com/b655861c854ff086f118f18b69861ca1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f579cd02ce1c4607a061c3728746fb95/1920.jpeg"
    },
    {
      "author": "JARI TANNER",
      "description": "HELSINKI (AP) — Denmark’s foreign minister said Sunday the government will seek to make it illegal to desecrate the Quran or other religious holy books in front of foreign embassies in the Nordic country.",
      "publishedAt": "2023-07-30T20:25:47Z",
      "title": "Denmark seeks to legally prevent burnings of Quran or other religious scriptures",
      "url": "https://apnews.com/3e8c3f15ea07ac05945f3c646d71302f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62749565cb24414fa474c8f3053bea44/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "At 24, Alberto Rodriguez has grandparents younger than Joe Biden. But he's more interested in the 80-year-old president's accomplishments than his age.",
      "publishedAt": "2023-07-30T12:39:39Z",
      "title": "Joe Biden, America's oldest sitting president, needs young voters to win again. Will his age matter?",
      "url": "https://apnews.com/152d11d3090518a2e5eee63b9a596673",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09899f06a8c54d998ef8efb34c059dd4/3000.jpeg"
    },
    {
      "author": "JOE McDONALD",
      "description": "BEIJING (AP) — The Fangbiaogan Real Estate Agency in the southern city of Nanning is still waiting for China’s post-COVID rebound.Home sales are 30-40% below last year's depressed level after the economy barely grew in the latest quarter, according to the owner, who would give only his surname, Cai.",
      "publishedAt": "2023-07-31T03:29:35Z",
      "title": "Skepticism prevails as Chinese leaders promise to back private businesses to spur slowing economy",
      "url": "https://apnews.com/ad462b32457de194e4756ea331611376",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a99ab83bdd704c3796645b0b51481165/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Ukraine brought the war far from the front line into the heart of Russia again Sunday in drone penetrations that Russian authorities said damaged two office buildings a few miles (kilometers) from the Kremlin and a pig breeding complex on the countries' border.",
      "publishedAt": "2023-07-30T03:49:03Z",
      "title": "Ukraine again reported bringing war deep into Russia with attacks on Moscow and border region",
      "url": "https://apnews.com/4801c01e9f07ac882ab28d33666bf8d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f743e754f59481e86a322a347047446/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Thousands of people backing the coup in Niger marched through the streets of the capital denouncing France, the country's former colonial power, waving Russian flags, and setting a door at the French Embassy ablaze on Sunday before the army broke up the crowd.",
      "publishedAt": "2023-07-30T09:18:32Z",
      "title": "French embassy in Niger is attacked as protesters waving Russian flags march through capital",
      "url": "https://apnews.com/88ccaa2f004db44601e59475199c5fbe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e0abb5bafe84c5688ab720c7b7cdc4d/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "DENVER (AP) — As Denver neared triple-digit temperatures, Ben Gallegos sat shirtless on his porch swatting flies off his legs and spritzing himself with a misting fan to try to get through the heat.",
      "publishedAt": "2023-07-30T14:45:35Z",
      "title": "Record heat waves illuminate plight of poorest Americans who suffer without air conditioning",
      "url": "https://apnews.com/f897e336d6d99ee2a53024f42ad7b8b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f287750f41746b4bd59af12ccb6843c/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — A week later, the “Barbenheimer” boom has not abated.Seven days after Greta Gerwig’s “Barbie” and Christopher Nolan’s “Oppenheimer” conspired to set box office records, the two films held unusually strongly in theaters.",
      "publishedAt": "2023-07-30T16:44:00Z",
      "title": "The ‘Barbie’ bonanza continues at the box office, ‘Oppenheimer’ holds the No. 2 spot",
      "url": "https://apnews.com/3a82b8887c11fe44896117ec4dec1531",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eba9fb841a9c4f03bd46ba52117a0344/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}