{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Jews in communities far from Israel gathered at synagogues this weekend for Shabbat services held amid the ongoing war ignited by Hamas militants' attack on Israel a week earlier.",
      "publishedAt": "2023-10-14T14:25:03Z",
      "title": "Far from Israel, Jews grieve and pray for peace in Shabbat services held as Israel-Hamas war rages",
      "url": "https://apnews.com/5d5096d4ca4d56463da9ee00a3874f15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c91a4da0ee0447393fe4d758684eac1/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and JOSEPH KRAUSS",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Palestinians struggled Saturday to flee from areas of Gaza targeted by the Israeli military while grappling with a growing water and medical supply shortage ahead of an expected land offensive a week after Hamas’ bloody, wide-ranging attack into Israel.",
      "publishedAt": "2023-10-14T04:26:01Z",
      "title": "Palestinians struggle to evacuate northern Gaza amid growing Israeli warnings of ground offensive",
      "url": "https://apnews.com/785e0eb833715354cade4694e8ccbf67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aefca239bd4047ef87dcb9bc9f3697d0/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE and LOLITA C. BALDOR",
      "description": "RIYADH, Saudi Arabia (AP) — U.S. Secretary of State Antony Blinken called Saturday for protecting civilians in the Gaza Strip and Israel as he intensified his diplomatic outreach across the Middle East and beyond to rally an international response to prevent the Israel-Hamas war from expanding.",
      "publishedAt": "2023-10-14T11:41:21Z",
      "title": "America's top diplomat calls for protecting civilians as Israel readies an expected assault on Gaza",
      "url": "https://apnews.com/487f746b102a82f4c345a058584e2518",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d64229c244154c43bde7e71c2cd093c3/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Jews in communities far from Israel gathered at synagogues this weekend for Shabbat services held amid the ongoing war ignited by Hamas militants' attack on Israel a week earlier.",
      "publishedAt": "2023-10-14T14:25:03Z",
      "title": "Far from Israel, Jews grieve and pray for peace in Shabbat services held as Israel-Hamas war rages",
      "url": "https://apnews.com/5d5096d4ca4d56463da9ee00a3874f15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c91a4da0ee0447393fe4d758684eac1/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Ethical concerns are casting a shadow over President Joe Biden as he seeks reelection amid investigations into his son Hunter and an impeachment inquiry, with a poll showing that 35% of U.S.",
      "publishedAt": "2023-10-14T04:01:30Z",
      "title": "Hunter Biden investigations lead to ethical concerns about President Biden, an AP-NORC poll shows",
      "url": "https://apnews.com/fc56e4d79c8c98758e344cc13f7966ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48b94253754c499d92d4bb22ef0a1206/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — A proposed gag order aimed at reining in Donald Trump's incendiary rhetoric puts the judge overseeing his federal election interference case in a tricky position: She must balance the need to protect the integrity of the legal proceedings against the First Amendment rights of a presidential candidate to defend himself in public.",
      "publishedAt": "2023-10-14T12:25:19Z",
      "title": "A proposed gag order on Trump in his federal election case is putting the judge in a tricky position",
      "url": "https://apnews.com/02d078e492a828ed030e583775462dba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c7109e3363c46e9b4ba774c12f08175/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH and KATIE OYAN",
      "description": "ALBUQUERQUE, N.M.. (AP) — First came the darkening skies, then the crescent-shaped shadows on the ground, and finally an eruption of cheers by crowds that gathered Saturday along the narrow path of a rare “ring of fire” eclipse of the sun.",
      "publishedAt": "2023-10-14T04:07:07Z",
      "title": "'Ring of fire' eclipse moves across the Americas, bringing with it cheers and shouts of joy",
      "url": "https://apnews.com/81b8ba2d557c8f42cb90756fc4b342a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fa07bfadc5a44f99e8b8a71b547b57e/1920.jpeg"
    },
    {
      "author": "ANGELA CHARLTON and JEFFREY SCHAEFFER",
      "description": "PARIS (AP) — The Louvre Museum in Paris and Versailles Palace evacuated visitors and staff Saturday after receiving bomb threats, police said. The French government started deploying 7,000 troops to increase security around the country after a fatal school stabbing by a suspected Islamic extremist.",
      "publishedAt": "2023-10-14T15:26:34Z",
      "title": "Louvre Museum and Versailles Palace evacuated after bomb threats with France on alert",
      "url": "https://apnews.com/859227d963367d7601575e4a8e1d2d4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e392151b4de4c8c86eaff220dbb4bd5/3000.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM",
      "description": "CHARLESTON, W.Va. (AP) — Sen. Joe Manchin of West Virginia has benefited from waiting to reveal where he stands as the swing vote in a chamber closely divided between Democrats and Republicans.He's taken the same approach when it comes to the next phase of his political career: The moderate Democrat has teased possible retirement, a run for reelection to the Senate or even a presidential campaign in 2024 — possibly as an independent candidate.",
      "publishedAt": "2023-10-14T04:11:04Z",
      "title": "Sen. Joe Manchin considers independent 2024 run, warns party system could be nation's 'downfall'",
      "url": "https://apnews.com/1622326ec6890c5e33dbd30327d51f85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa0acb3db5a14f389a7c8c44d016a98b/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian officials reported intense combat as Russian forces relentlessly assaulted the eastern Ukrainian city of Avdiivka for a fifth consecutive day Saturday.City leader Vitalii Barabash reported that Moscow was deploying additional forces to encircle the strategically important city in the eastern Donetsk region, situated just north of the Russian-held regional capital, also called Donetsk.",
      "publishedAt": "2023-10-14T12:43:54Z",
      "title": "Fierce fighting persists in Ukraine’s east as Kyiv reports nonstop assaults by Russia on a key city",
      "url": "https://apnews.com/73c4ea243f608d79a091f8e1d8210cbb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e65ca8156984cf7a31e8a751a3e68aa/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}