{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — The Israeli army said Tuesday that its forces are battling Hamas fighters inside Gaza’s largest city, signaling a major new stage a month into a war that has claimed thousands of lives and leveled swaths of the territory.",
      "publishedAt": "2023-11-07T07:21:59Z",
      "title": "Israel fights Hamas in ‘depths’ of Gaza City, foresees control of enclave’s security after war",
      "url": "https://apnews.com/6e1425d218de6a73f8a51e4c036cfd39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba294c289eac4d238e36d38af45d82a4/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — When the Lebanese militia Hezbollah announced last week that its leader, Hassan Nasrallah, would deliver his first public speech since the outbreak of the Israel-Hamas war, much of the region held its breath.",
      "publishedAt": "2023-11-07T18:10:55Z",
      "title": "How Lebanon's Hezbollah group became a critical player in the Israel-Hamas war",
      "url": "https://apnews.com/493e9290bc796fd90a9220bab229cd37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5aca1cba3574791a6ab8361c475c1c6/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Though it's an off-year general election, races across the country will have far-reaching implications for 2024 and beyond.",
      "publishedAt": "2023-11-07T17:59:42Z",
      "title": "It's Election Day. Here is what you need to know",
      "url": "https://apnews.com/c91dc9a11e8787985e6278ebad9c7aae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf6c942dd7c64d5a89fd0f4b032ef7c2/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — Ohio became the latest flashpoint Tuesday in the nation's battle over abortion access since the U.S. Supreme Court overturned a constitutional right to the procedure last year.",
      "publishedAt": "2023-11-07T05:04:16Z",
      "title": "Ohio is the lone state deciding an abortion rights question, providing hints for 2024 races",
      "url": "https://apnews.com/fe3e06747b616507d8ca21ea26485270",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a36546ac8da4ced83b8332d5e70b9c9/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court seemed likely Tuesday to preserve a federal law that prohibits people under domestic violence restraining orders from having guns.",
      "publishedAt": "2023-11-07T05:30:14Z",
      "title": "The Supreme Court seems likely to preserve a gun law that protects domestic violence victims",
      "url": "https://apnews.com/b86948dc6103573898c3757b998a0a6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f75123144dec4f9194d45e5eede8ec8a/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The prosecutor overseeing the Hunter Biden investigation testified Tuesday that he had the ultimate authority in the yearslong case as he made an unprecedented appearance before Congress to rebut Republicans' explosive claims that the probe has been plagued with interference.",
      "publishedAt": "2023-11-07T05:35:25Z",
      "title": "Special counsel in the Hunter Biden case insists he was the 'decision-maker' in rare testimony",
      "url": "https://apnews.com/aed25541b709a57371cdfe1582be0c5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f97caf33e3a423597df8c4e06dc6302/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and THOMAS BEAUMONT",
      "description": "DAVENPORT, Iowa (AP) — Florida Gov. Ron DeSantis ’ senior advisers are outlining a difficult path to the Republican presidential nomination that can succeed only by first denying former President Donald Trump “a big win” in Iowa, where the DeSantis campaign is promising to leverage the “vast statewide political operation” of his newest major endorser, Gov.",
      "publishedAt": "2023-11-07T10:03:54Z",
      "title": "DeSantis argues Iowa governor's support may help him stop Trump and he labels his rivals as spoilers",
      "url": "https://apnews.com/4aa634fb30edf088b0f17d118b56967d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74c5a37ed6ba400f9626a7f0c4a3c502/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — The Air Force's vast fields of underground nuclear missile silos are rarely disturbed by more than the occasional wandering cow or floating spy balloon.",
      "publishedAt": "2023-11-07T13:01:07Z",
      "title": "The Air Force asks Congress to protect its nuclear launch sites from encroaching wind turbines",
      "url": "https://apnews.com/0313c9ab3a97d4452c3d0d1707294d52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c8a6b6f97204c25a8b427285bf130fd/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE and KENYA HUNTER",
      "description": "NEW YORK (AP) — Alarmed by yet another jump in syphilis cases in newborns, U.S. health officials are calling for stepped-up prevention measures, including encouraging millions of women of childbearing age and their partners to get tested for the sexually transmitted disease.",
      "publishedAt": "2023-11-07T18:01:44Z",
      "title": "Syphilis cases in US newborns skyrocketed in 2022. Health officials suggest more testing",
      "url": "https://apnews.com/25df6e6352508fce37fb20ac10770124",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4d815aab71747e5b15168a1b95b3582/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "On the same day whistleblower Frances Haugen was testifying before Congress about the harms of Facebook and Instagram to children in the fall of 2021, a former engineering director at the social media giant who had rejoined the company as a consultant sent an alarming email to Meta CEO Mark Zuckerberg about the same topic.",
      "publishedAt": "2023-11-07T14:33:06Z",
      "title": "A Meta engineer saw his own child face harassment on Instagram. Now, he's testifying before Congress",
      "url": "https://apnews.com/5f7fb7d55fb9f0da12cf3a57837fa0c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62e56f5d50994bb981df091954685fae/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}