{
  "articles": [
    {
      "author": null,
      "description": "Six of the Group of Seven leaders will try to show the wealthy nations’ club still has the clout to shape world events despite the early departure of President Donald Trump. Prime Minister Mark Carney and his counterparts from the U.K., France, Germany, Italy and Japan will be joined Tuesday by Ukrainian President Volodymyr Zelenskyy and NATO chief Mark Rutte to discuss Russia’s relentless war on its neighbor. That's just one of several crises in an increasingly unstable world. Another is a dangerous showdown between Israel and Iran. Trump left the summit in the Canadian Rockies saying it was very important for him to return.",
      "publishedAt": "2025-06-17T04:11:56Z",
      "title": "G7 leaders try to salvage a summit without Trump",
      "url": "https://apnews.com/article/g7-summit-canada-trump-departure-ukraine-6c86a0a8463603c9b1a3e950382af0a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7424e0/2147483647/strip/true/crop/3173x1785+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F97%2Ff2f849068f55b7a9848073d8b0c1%2F891c87358beb40d598fc9e3b0c0f50f9"
    },
    {
      "author": null,
      "description": "Israel’s air campaign on Iran’s capital appeared to broaden on the fourth day of an intensifying conflict as U.S. President Donald Trump posted an ominous message warning residents of the city to evacuate. Earlier, the Israeli military called for the some 330,000 residents of a neighborhood in the city center to evacuate. Israel says its sweeping assault on Iran’s top military leaders, uranium enrichment sites and nuclear scientists, is necessary to prevent its longtime adversary from getting any closer to building an atomic weapon. The strikes have killed at least 224 people since Friday. Iran has retaliated by launching more than 370 missiles and hundreds of drones at Israel. So far, 24 people have been killed in Israel and more than 500 injured.",
      "publishedAt": "2025-06-17T05:03:28Z",
      "title": "Israel strikes Iran and Trump tells capital's residents to evacuate",
      "url": "https://apnews.com/article/israel-iran-missile-attacks-nuclear-news-tehran-trump-06-17-2025-3f08988b5e8fd375645967b6e22916f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/01b6e16/2147483647/strip/true/crop/4285x2410+0+402/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Fb5%2F313bc031e4db86db9caed5f1897a%2Fd674c596204543adbb19beeeb2654b0d"
    },
    {
      "author": null,
      "description": "At least 51 Palestinians were killed and over 200 wounded in the Gaza Strip while waiting for U.N. and commercial trucks to enter the territory with desperately needed food, according to Gaza’s Health Ministry and a local hospital. Palestinian witnesses told The Associated Press that Israeli forces had fired on the crowds. The military said it was looking into reports that its forces had fired toward the crowd, causing several casualties. It did not appear to be related to a new Israeli- and U.S.-supported aid delivery network that rolled out last month and has been marred by controversy and violence.",
      "publishedAt": "2025-06-17T07:33:23Z",
      "title": "At least 51 Palestinians killed while waiting for aid trucks in Gaza, health officials say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-gaza-aid-06-17-2025-7af5503ea7d2176674fba26d34f6ef74",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6f342/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ff1%2F01784acd98fe5fbb6381bbc362f0%2F419377a7ba8643cb87ee439505810f17"
    },
    {
      "author": null,
      "description": "Members of Congress are attending emergency security briefings after the killing of a Minnesota state lawmaker. The shooting at the lawmaker's home has raised fresh fears about the safety of members of Congress. The suspect in the attack had dozens of federal lawmakers listed in his writings, besides the state lawmakers and others he allegedly targeted. The shootings come after credible threats to members of Congress have more than doubled in the last decade and after several violent attacks on lawmakers and their families. Senate Democrats say at a briefing Tuesday they plan to ask security officials and Republican leadership about their protection against outside threats.",
      "publishedAt": "2025-06-17T04:26:15Z",
      "title": "Congress holds emergency briefings on security after Minnesota shootings",
      "url": "https://apnews.com/article/minnesota-lawmakers-killed-congress-violence-1e6a061c4265b0136ebb058a2777b85f",
      "urlToImage": "https://dims.apnews.com/dims4/default/f5e8d6c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Fd1%2Fca9a1c37493466357e68af0fe3f6%2F8781e5b7258740de91d4f64404fb0fe4"
    },
    {
      "author": null,
      "description": "Prosecutors say the man charged with killing one Minnesota lawmaker and wounding another had dozens of apparent targets, including officials in at least three other states. U.S. Attorney Joseph Thompson says Vance Boelter made it to the homes of two other legislators on the night of the attacks, but one was not home and the suspect left the other house after police arrived. Boelter surrendered to police Sunday. He is accused of posing as a police officer and fatally shooting state Rep. Melissa Hortman and her husband in their home early Saturday. Federal prosecutors have charged Boelter with murder and stalking. He also says faces state murder charges. His attorney declined to comment.",
      "publishedAt": "2025-06-17T04:59:28Z",
      "title": "Minnesota shooting suspect had dozens of potential targets, prosecutors say",
      "url": "https://apnews.com/article/minnesota-lawmakers-shooting-dozens-targeted-d3d7866c09765fac088e6418e49ad811",
      "urlToImage": "https://dims.apnews.com/dims4/default/6e3bf5d/2147483647/strip/true/crop/4896x2754+63+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F42%2Fb332f382c2373c02196890cb783e%2Fa9928dd5586a42aea3515c10d60223d1"
    },
    {
      "author": null,
      "description": "Officials say a Russian missile and drone bombardment has killed at least 15 people and injured 156 others in Ukraine overnight, with the main barrage demolishing a nine-story apartment building in Kyiv. It was the deadliest attack on the Ukrainian capital this year and came as two rounds of direct peace talks have failed to make progress on ending the war, now in its fourth year. The city's military administration says 14 people were killed and 138 others were injured in the capital as explosions echoed for hours. Russia has repeatedly hit civilian areas of Ukraine with missiles and drones, and the United Nations says the attacks have killed more than 12,000 Ukrainian civilians.",
      "publishedAt": "2025-06-17T00:08:16Z",
      "title": "Overnight Russian attack on Ukraine kills 15 and injures 156",
      "url": "https://apnews.com/article/russia-drone-attack-kyiv-187fafa3d7324130e5ee7e20e0a3a5dc",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d16abd/2147483647/strip/true/crop/1000x563+0+52/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fdd%2F9a289b4c5e1b19ef0f1326cac3de%2F724c5bb5d8174b789625d7ea44d66144"
    },
    {
      "author": null,
      "description": "New York City comptroller and Democratic mayoral candidate Brad Lander has been arrested at a federal building in Manhattan as he was trying to accompany a person out of an immigration courtroom. A reporter with The Associated Press witnessed Lander’s arrest on Tuesday. The person Lander was walking out of the courtroom was also arrested. Lander had spent the morning observing immigration court hearings and told an AP reporter that he was there to “accompany” some immigrants out of the building. Emailed inquiries to the FBI and U.S. Immigration and Customs Enforcement were not immediately returned.",
      "publishedAt": "2025-06-17T16:36:31Z",
      "title": "Brad Lander, NYC comptroller and mayoral candidate, is arrested outside immigration court",
      "url": "https://apnews.com/article/brad-lander-nyc-immigration-court-arrest-6ed341297efab31a08a14421674d8ed8",
      "urlToImage": "https://dims.apnews.com/dims4/default/af72716/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F54%2Fe9f93513bee4fc0e8ced04775bf7%2F67ee628d735c45debbd7241b96ad2e51"
    },
    {
      "author": null,
      "description": "Hopes that Sean “Diddy” Combs might testify at his federal sex trafficking trial have faded after his lawyer predicted a defense presentation lasting two to five days. The defense made the estimate Tuesday when the judge asked how long their case would last. Prosecutors hope to rest Wednesday after presenting evidence for six weeks. The judge says the jury could begin deliberations next week. The 55-year-old Combs has pleaded not guilty to sex trafficking and racketeering conspiracy charges. The judge also scolded prosecutors and defense lawyers on Tuesday, saying information about a closed court proceeding involving a juror last Friday was leaked to a media outlet.",
      "publishedAt": "2025-06-17T15:19:43Z",
      "title": "Lawyers hint that Diddy likely won't testify at his own trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-034f49755372cff005a3d9c38fb02fb2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4647be/2147483647/strip/true/crop/1753x986+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F65%2F54a13cb40ffdb216bd6ed466ed07%2Fab10451bb17d49dba8de0d66346e85fb"
    },
    {
      "author": null,
      "description": "Retail sales fell sharply in May as consumers pulled back after a sharp increase in spending in March to get ahead of President Donald Trump’s sweeping tariffs on nearly all imports. Sales at retail stores and restaurants dropped 0.9% in May, the Commerce Department said Tuesday, after a decline of 0.1% in April. The figure was pulled down by a steep drop in auto sales, after Americans ramped up their car-buying in March to get ahead of Trump’s 25% duty on imported cars and car parts. Excluding autos, sales fell 0.3%. The sales drop comes after sharp declines in consumer confidence this year.",
      "publishedAt": "2025-06-17T12:43:39Z",
      "title": "Americans put the brakes on spending and retail sales slow",
      "url": "https://apnews.com/article/retail-sales-tariffs-consumers-spending-economy-bf7ac18e10a8e27de5a7159d9a61397a",
      "urlToImage": "https://dims.apnews.com/dims4/default/c8769da/2147483647/strip/true/crop/3895x2191+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2Fa9%2F7bcc2d2a1259174629b4c1f21307%2F0614efdf19f64bf8b990f8e8590692b1"
    },
    {
      "author": null,
      "description": "The Florida Panthers can win the Stanley Cup for the second year in a row by beating the Edmonton Oilers in Game 6 of the final. Their first chance to clinch the franchise's second championship comes at home after a dominant performance in Game 5 at Edmonton. Players say they learned important lessons from failing to close out the Oilers three times in the final a year ago. Still, the Stanley Cup being in the building is enough to rile up the nerves in what could be the final game of the NHL season.",
      "publishedAt": "2025-06-17T10:00:09Z",
      "title": "Panthers can win 2nd straight Stanley Cup by beating Oilers in Game 6",
      "url": "https://apnews.com/article/stanley-cup-nhl-playoffs-8a87ac5a24afb90cf482a89b15ad23c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/54e3f5f/2147483647/strip/true/crop/5888x3312+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F0b%2F787d8e8785c60142471410b548de%2Fae7ee4c9d88940d284630f43a4c76924"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}