{
  "articles": [
    {
      "author": "Illia Novikov",
      "description": "A senior Kremlin official says clinching a deal to end the war between Russia and Ukraine “is far too complex to be done quickly.” Kremlin spokesman Dmitry Peskov's comments Wednesday came as the U.S. labors to bring momentum to peace efforts and expresses frustration over the slow progress. Officials, meanwhile, said that a nighttime Russian drone attack on Ukraine’s second-largest city of Kharkiv wounded at least 45 civilians. The United Nations reported that the number of Ukrainian civilian casualties in the more than three-year war has surged in recent weeks. Peskov said Russian President Vladimir Putin backs calls for a ceasefire “but before it’s done, it’s necessary to answer a few questions and sort out a few nuances.”",
      "publishedAt": "2025-04-30T10:30:34Z",
      "title": "Kremlin says a deal to end the war with Ukraine can't be achieved quickly",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-trump-peace-ce025ba11929ceff0c90f94c25a47624",
      "urlToImage": "https://dims.apnews.com/dims4/default/aff8e3f/2147483647/strip/true/crop/2000x1125+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F14%2F45e929300d98393b7d3f97682a3a%2F240d0dc0732f4098adde9846f11fd779"
    },
    {
      "author": "Mark Sherman",
      "description": "Chief Justice John Roberts appears to hold the key vote over whether the Supreme Court will allow the nation’s first publicly funded religious charter school, in Oklahoma. Roberts was the only justice whose vote seemed in doubt after the court heard more than two hours of arguments Wednesday in a major culture-war clash involving the separation of church and state. Four other conservative justices seemed firmly on the side of the St. Isidore of Seville Catholic Virtual School and the state charter school board that approved it. The three liberal justices seemed just as likely to vote to affirm an Oklahoma Supreme Court ruling that held that the taxpayer-funded school would entangle church and state in violation of the First Amendment.",
      "publishedAt": "2025-04-30T11:09:27Z",
      "title": "Supreme Court hears arguments over Oklahoma publicly funded religious school",
      "url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd0245d/2147483647/strip/true/crop/5721x3218+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Ffe%2Ff4621d1bf84d8a95cdd6efbf1a3a%2Ff9810f81014541e79a38cf0885d04992"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump has gotten worrisome news about how the U.S. economy is battening down for potential fallout from his tariffs. And the Republican president is trying to blame Democrat Joe Biden, who left office months ago. The government reported Wednesday the U.S. economy shrank at an annual rate of 0.3% during the first three months of the year. Behind the decline was a surge in imports as companies tried to front-run Trump's sweeping tariffs on autos, steel, aluminum and almost every country. After stocks sold off Wednesday morning, Trump said it's not his stock market, it's Biden's. A former Biden aide says Trump has taken the U.S. economy from strong, stable growth to negative GDP.",
      "publishedAt": "2025-04-30T15:53:30Z",
      "title": "Trump tries blaming Biden on the economy after weak GDP report",
      "url": "https://apnews.com/article/trump-economy-tariffs-gdp-7494825851dcef94ec81475124f9326f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8fbdee6/2147483647/strip/true/crop/5068x2851+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F86%2Fd2acfbada58dfbc75615a58b96e6%2F7ca9eb7f8c7043c7ace099d71d47d142"
    },
    {
      "author": null,
      "description": "A judge has ordered the release of a Palestinian man who led protests against the war in Gaza as a student at Columbia University and was arrested by immigration officials during an interview about finalizing his U.S. citizenship. U.S. District Judge Geoffrey Crawford in Burlington, Vermont, issued his ruling Wednesday following a hearing on Mohsen Mahdawi. Mahdawi, a legal permanent resident for 10 years, was arrested by Immigration and Customs Enforcement agents on April 14. Mahdawi’s lawyers say he was detained in retaliation for his speech advocating for Palestinian human rights.",
      "publishedAt": "2025-04-30T14:38:13Z",
      "title": "Vermont judge orders release of a Palestinian man arrested at his US citizenship interview",
      "url": "https://apnews.com/article/mohsen-mahdawi-columbia-student-palestinian-release-dd95ffff78464df1b485d5912f1b3fcb",
      "urlToImage": "https://dims.apnews.com/dims4/default/052570b/2147483647/strip/true/crop/4674x2629+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F5b%2Fea88521274d6626d197409c5c534%2Ffaa986172b064cfc8c9d5c7ade9a82c2"
    },
    {
      "author": "Stan Choe",
      "description": "U.S. stocks are tumbling following a discouraging report suggesting the U.S. economy may have shrunk at the start of the year, before most of President Donald Trump’s announced tariffs could take effect. The S&P 500 sank 2% Wednesday and was on track to break a six-day winning streak. The Dow Jones Industrial Average fell 702 points, and sharp drops for such AI superstars as Super Micro Computer had the Nasdaq composite falling a market-leading 2.5%. Treasury yields also sank after a separate report suggested overall hiring by U.S. employers may have been weaker than economists expected in April.",
      "publishedAt": "2025-04-30T03:19:57Z",
      "title": "Wall Street tumbles and S&P 500 drops 2% following signs that the US economy is sputtering",
      "url": "https://apnews.com/article/stocks-markets-autos-tariffs-trump-earnings-bbad7ca16bceb8c35822d906b195f5d2",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d3ec91/2147483647/strip/true/crop/6869x3864+0+358/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F0c%2F82517981f680d26ee6326bb9f538%2F55577e6becc046d2800925219df5babe"
    },
    {
      "author": "Eric Tucker",
      "description": "U.S. officials say Kuwait has released 10 more American detainees in an apparent goodwill gesture. It brings to nearly two dozen the total number freed from Kuwait in the past two months. Taken together, the pardons of 23 Americans since March — done as a goodwill gesture by a U.S. ally — amounted to the largest release of U.S. citizens by a single foreign country in years. Ten others were released on March 12, weeks after a visit to Kuwait by Adam Boehler, who is serving as the Trump administration’s envoy for hostage affairs. The releases weren't done as part of a swap and the U.S. wasn't asked to give up anything in return.",
      "publishedAt": "2025-04-30T19:00:11Z",
      "title": "Kuwait frees 10 more Americans in second release in as many months",
      "url": "https://apnews.com/article/kuwait-detainees-released-us-state-department-fc35eb4fb08f8e18e0d7b0c5991cd191",
      "urlToImage": "https://dims.apnews.com/dims4/default/b21d11f/2147483647/strip/true/crop/4452x2504+0+114/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2F42%2F4dc8f43204b42c2d1aa624f6c9b6%2F0219b454beba4b71937467a2c87093cc"
    },
    {
      "author": "Prabhjot Gill, Sheikh Saaliq",
      "description": "Pakistan said Wednesday it had “credible intelligence” that India is planning to attack it within days, as Pakistani nationals headed for the border to comply with New Delhi’s orders to almost all Pakistani citizens to leave the country following last week’s deadly attack in Indian-controlled Kashmir. There was no immediate comment from Indian officials. An attack on tourists in Indian-controlled Kashmir and India’s moves to punish Pakistan — which denies any connection to the massacre — have driven tensions between the nuclear-armed rivals to their highest point since 2019. United Nations Secretary-General Antonio Guterres, in separate phone calls with India and Pakistan, stressed the need to “avoid a confrontation that could result in tragic consequences.”",
      "publishedAt": "2025-04-30T08:55:15Z",
      "title": "Pakistan says it has 'credible intelligence' India will attack within days",
      "url": "https://apnews.com/article/india-pakistan-kashmir-pahalgam-attari-wagah-a16c6fc5cf190f0ce0759ad4370a29cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/83e5795/2147483647/strip/true/crop/4391x2470+0+229/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2F45%2F1dd3e419564210b0767e2a6295ac%2Fc0fee57cb3944e6e958fa5aed882bf21"
    },
    {
      "author": "Matt O'Brien",
      "description": "Visa is hoping to hand your credit card to an artificial intelligence “agent” that can find and buy clothes, groceries, airplane tickets and other items on your behalf. Set a budget and some preferences and the AI assistant can make the purchases. Visa announced its new AI credit card plan Wednesday after months of working behind the scenes with leading AI chatbot developers such as Anthropic, Microsoft, OpenAI and Perplexity. Pilot projects begin Wednesday but it could take some time before average credit card users can ask an AI assistant to order their weekly grocery lists.",
      "publishedAt": "2025-04-30T18:08:11Z",
      "title": "Visa wants to give artificial intelligence 'agents' your credit card",
      "url": "https://apnews.com/article/ai-artificial-intelligence-5dfa1da145689e7951a181e2253ab349",
      "urlToImage": "https://dims.apnews.com/dims4/default/75edf5b/2147483647/strip/true/crop/5040x2835+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Fa1%2F042cc466a5e788a38614908dc7e1%2Fcc1afef11d614c229a9f71cdeef3dad8"
    },
    {
      "author": "Jennifer Peltz",
      "description": "A former TV production assistant is back on the witness stand at Harvey Weinstein’s retrial. Miriam Haley resumed testifying Wednesday about the weeks leading up to the July 2006 date when he's accused of forcing oral sex on her. Haley is the first of the ex-Hollywood honcho’s accusers to testify at the retrial. It's happening because New York’s highest court overturned Weinstein’s 2020 conviction. Weinstein’s retrial includes charges based on allegations from Haley and another accuser from the original trial, and a new charge based on an allegation from a former model. The 73-year-old former studio boss has pleaded not guilty and denies sexually assaulting anyone.",
      "publishedAt": "2025-04-30T15:02:30Z",
      "title": "First accuser resumes testimony at Harvey Weinstein's #MeToo retrial",
      "url": "https://apnews.com/article/harvey-weinstein-retrial-miriam-haley-metoo-a4df6e32641aaa20ccabf730d77c81b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/e0d53bc/2147483647/strip/true/crop/4297x2417+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2Fd2%2F5758e39d13870e575d3a91ec3df7%2F03d2f0fdc4bc4e66a3a5263241c90dc0"
    },
    {
      "author": "Tim Reynolds",
      "description": "For the Miami Grand Prix, someone is charge of all the strategic planning and the budget. Someone else oversees the construction of 163 temporary buildings needed for race weekend. Someone else designs the seating areas and keeps track of all the food and beverage needs. Someone else makes sure that the rich and famous have everything they need and want, from the right drink to the right kind of throw pillow. These jobs make the race happen. And in Miami, they’re all being done by women.",
      "publishedAt": "2025-04-30T09:10:06Z",
      "title": "At the F1 Miami Grand Prix, many top executive roles are held by women",
      "url": "https://apnews.com/article/formula-1-miami-76958f4e0a886ce52acc9e3447bbac34",
      "urlToImage": "https://dims.apnews.com/dims4/default/0698ddf/2147483647/strip/true/crop/6115x3440+0+319/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2Fec%2F248e627bd5d82ea0873f63e5cf36%2F4b4dc44f887b4fc5ba0ab4b7507d9d1c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}