{
  "articles": [
    {
      "author": "JON GAMBRELL, ADAM SCHRECK and TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israel attacked military targets in Iran with pre-dawn airstrikes Saturday in retaliation for the barrage of ballistic missiles the Islamic Republic fired on Israel earlier this month.",
      "publishedAt": "2024-10-26T07:55:08Z",
      "title": "Israel's first open attack on Iran targets missile sites and apparently spares oil and nuclear ones",
      "url": "https://apnews.com/9c9f366c71c508e6dd0ee74cff8400d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5f6f1befafa436bbf55bbb3be62ee9e/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An attack on an Iranian police convoy Saturday in the country's restive southern province of Sistan and Baluchestan killed at least 10 officers, authorities said.",
      "publishedAt": "2024-10-26T11:24:47Z",
      "title": "Attack on a police convoy in a restive southeastern province of Iran kills 10 officers",
      "url": "https://apnews.com/8e1ea2c0c73606ffd189eb97efaaf05d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6dbe20b4a4f74d10bd23bea084e34a8f/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "RENO, Nev. (AP) — One morning last month, Cari-Ann Burgess did something completely unremarkable: She made a quick stop at a coffee shop on her way to work.For Burgess, the top election official in a northern Nevada county, such outings could be precarious.",
      "publishedAt": "2024-10-26T11:19:03Z",
      "title": "An elections worker wanted to serve her country. A stew of conspiracy theories and vitriol awaited",
      "url": "https://apnews.com/7bf6666123b931e898f5ff409fb2bbce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7372bbde4304e3b97a180150c65ab47/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, COLLEEN LONG and NADIA LATHAN",
      "description": "HOUSTON (AP) — Kamala Harris and Beyoncé ignited a Houston rally with a double-barreled argument against Donald Trump on Friday, with the superstar telling the Democratic nominee’s biggest crowd ever that it was “time to sing a new song” as Harris warned that her GOP opponent was dead set on further eroding women’s rights.",
      "publishedAt": "2024-10-25T04:06:58Z",
      "title": "Harris and Beyoncé ignite a Houston rally with a double-barreled argument against Trump",
      "url": "https://apnews.com/f228eedd3308dab2e1125fdf6029a4a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae2b8b4d468447f2b4412ca7521f4fb0/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, JONATHAN J. COOPER and WILL WEISSERT",
      "description": "TRAVERSE CITY, Mich. (AP) — Many of Donald Trump’s supporters left a Michigan rally before he arrived after the former president kept them waiting for three hours to tape a popular podcast interview.",
      "publishedAt": "2024-10-25T14:26:27Z",
      "title": "Trump leaves Michigan rallygoers waiting in the cold for hours to tape Joe Rogan podcast",
      "url": "https://apnews.com/7ed6b971a86c69ed4344205ab2db668b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e0d16a9e0df472597fa01d5221b57e1/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "TBILISI, Georgia (AP) — Polls closed in Georgia Saturday after an election many citizens saw as a make-or-break vote on the opportunity to join the European Union.The pre-election campaign in the South Caucasus nation of 3.7 million people which borders Russia was dominated by foreign policy and marked by a bitter fight for votes and allegations of a smear campaign.",
      "publishedAt": "2024-10-26T04:04:23Z",
      "title": "Polls close in Georgia's election that could take it toward the EU or into Russia's orbit",
      "url": "https://apnews.com/06103525947fe3a1d372539a74cb573f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4434fcb433094be199b4f9d1b50420bf/1920.jpeg"
    },
    {
      "author": "GARANCE BURKE and HILKE SCHELLMANN",
      "description": "SAN FRANCISCO (AP) — Tech behemoth OpenAI has touted its artificial intelligence-powered transcription tool Whisper as having near “human level robustness and accuracy.”But Whisper has a major flaw: It is prone to making up chunks of text or even entire sentences, according to interviews with more than a dozen software engineers, developers and academic researchers.",
      "publishedAt": "2024-10-26T04:16:15Z",
      "title": "Researchers say an AI-powered transcription tool used in hospitals invents things no one ever said",
      "url": "https://apnews.com/90020cdf5fa16c79ca2e5b6c4c9bbb14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ce5a1e55363489d98885eb840ef04b7/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — Sixteen-year-old Billy's friends at his rural high school in the South don't know he was one of thousands of children separated from their parents at the U.S.-Mexico border under then-President Donald Trump's zero tolerance immigration policy.",
      "publishedAt": "2024-10-26T11:41:58Z",
      "title": "Migrant families separated under Trump still feel the fallout and they fear his return to office",
      "url": "https://apnews.com/ef77a181712149bb5edbd8dae4df4604",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1079626dbf6e44248d8893b611aa120a/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — A nail-biter all night with a Hollywood ending. Game 1 of Yankees-Dodgers certainly delivered.Freddie Freeman hit the first game-ending grand slam in World Series history with two outs in the 10th inning to give the Los Angeles Dodgers a 6-3 victory over the New York Yankees in a drama-filled opener Friday.",
      "publishedAt": "2024-10-26T03:48:56Z",
      "title": "Freeman hits 1st walk-off slam in World Series history as Dodgers top Yankees 6-3 in classic opener",
      "url": "https://apnews.com/4975fa3d364e1f2510f0a45eddd2c6ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c3fc8461ebc49409859a3e1442c4eea/3000.jpeg"
    },
    {
      "author": "VANESSA GERA, JAN M. OLSEN and STEFANIE DAZIO",
      "description": "COPENHAGEN (AP) — Nearly 30 years after they killed their parents, Erik and Lyle Menendez launched a beautification project in the California prison where they're serving life sentences.",
      "publishedAt": "2024-10-26T11:16:43Z",
      "title": "The Menendez brothers built a green space in prison. It’s modeled on this Norwegian idea",
      "url": "https://apnews.com/9b38364e1d70500fd99cedbbb0bf20cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3aae39f3577242a5bee1d8a3ee0f7082/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}