{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — More than 45,000 Palestinians have now been killed in the war in Gaza between Israel and Hamas militants, Palestinian health officials said Monday, as often-stalled ceasefire negotiations appeared to be gaining ground again.",
      "publishedAt": "2024-12-16T09:30:28Z",
      "title": "Death toll in Gaza from the Israel-Hamas war tops 45,000 Palestinians, health officials say",
      "url": "https://apnews.com/9f7c8f0df71dc4c97a6b31aed6e13304",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07406ac01595461fa1bf1a1707083762/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Ousted Syrian President Bashar Assad says he had no plans to leave the country after the fall of Damascus a week ago but the Russian military evacuated him from their base in western Syria after it came under attack.",
      "publishedAt": "2024-12-16T07:57:46Z",
      "title": "Middle East latest: Assad says he wanted to stay in Syria but Russia evacuated him",
      "url": "https://apnews.com/4ed0ec24506a1b78f0561ed0cc8f0994",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37898ec2ad26498b99540d303e5af040/2082.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "PALM BEACH, Fla. (AP) — President-elect Donald Trump will join SoftBank Group CEO Masayoshi Son at his Florida home on Monday to announce that the Japanese company is planning to invest $100 billion in U.S.",
      "publishedAt": "2024-12-16T14:47:17Z",
      "title": "Trump to announce $100B SoftBank investment in the US",
      "url": "https://apnews.com/8df47668f894b5d922839d98887bbb0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ae4b78146e8457b8d1f908a301cbadf/3000.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — Chancellor Olaf Scholz lost a confidence vote in the German parliament on Monday, putting the European Union’s most populous member and biggest economy on course to hold an early election in February.",
      "publishedAt": "2024-12-16T05:01:44Z",
      "title": "Germany's Scholz loses a confidence vote, setting up an early election in February",
      "url": "https://apnews.com/87c6c0c64726eefaa95d9c46dae611dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa26fdb93da04b14aff8e31a0835950e/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY, THOMAS ADAMSON and RAINAT ALILOIFFA",
      "description": "MAMOUDZOU, Mayotte (AP) — France used ships and military aircraft to rush rescue workers and supplies to its tiny Indian Ocean territory of Mayotte on Monday after the island group was battered by its worst cyclone in nearly a century.",
      "publishedAt": "2024-12-16T09:21:45Z",
      "title": "France rushes aid to Mayotte, with hundreds feared dead and hunger rising after Cyclone Chido",
      "url": "https://apnews.com/43890b2cee0d90e67b6263f278782334",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/438af7efa6354887ae3f63e076c38542/1920.jpeg"
    },
    {
      "author": "DAVE COLLINS and BIANCA VÁZQUEZ TONESS",
      "description": "BOSTON (AP) — More suspected drone sightings in the eastern U.S. led to a temporary airspace shutdown at an Air Force base in Ohio and arrests near Boston's Logan International Airport, as elected officials increased their push for action to identify and stop the mysterious unmanned flights.",
      "publishedAt": "2024-12-16T16:28:57Z",
      "title": "Drone sightings lead to airspace shutdown at Ohio military base, arrests near Boston airport",
      "url": "https://apnews.com/b37fda04755803392178b1f39b76ccd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f3b17660cbc4330a54628816e1857b3/1920.jpeg"
    },
    {
      "author": "JEFF McMURRAY",
      "description": "CHICAGO (AP) — Ismael El-Amin was driving his daughter to school when a chance encounter gave him an idea for a new way to carpool.",
      "publishedAt": "2024-12-16T05:13:13Z",
      "title": "Schools are cutting bus service for children. Parents are turning to ride-hailing apps",
      "url": "https://apnews.com/3fdcedfc4f957f748bf109066806bc88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee4f521068944ddcb2d3a2da5b2a014b/2910.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "BOISE, Idaho (AP) — Nearly every detail about the religious group Lisa Webb’s family belonged to was hidden from the outside world. Its followers met in homes rather than churches. Its leadership structure was hard to discern, its finances opaque.",
      "publishedAt": "2024-12-16T05:08:22Z",
      "title": "Survivors seek a reckoning as FBI investigates child sex abuse in little-known Christian sect",
      "url": "https://apnews.com/a94073c27168a7998c1a225f72672a3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69f60ca388974cabab36c575e4aa850f/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s impeached President Yoon Suk Yeol dodged requests by investigative agencies to appear for questioning over his short-lived martial law decree, as the Constitutional Court began its first meeting Monday on Yoon's case to determine whether to formally unseat or reinstate him.",
      "publishedAt": "2024-12-16T00:39:12Z",
      "title": "South Korea’s impeached leader avoids investigators as court begins meeting to determine his fate",
      "url": "https://apnews.com/8ec38d61f0ea5c48b3bd1f683b5e9c8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3ed00d3cae948fcbd6cf56382364f85/1920.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — New research suggests that Saturn’s rings may be older than they look — possibly as old as the planet.",
      "publishedAt": "2024-12-16T16:00:47Z",
      "title": "How old are Saturn's rings? Study suggests they could be as old as the planet",
      "url": "https://apnews.com/f4f88140895f146d61f427d1378cd981",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4d6c0d51633444eb610316f5727fb10/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}