{
  "articles": [
    {
      "author": null,
      "description": "CAPE TOWN, South Africa (AP) — A bus carrying people to an Easter festival in South Africa plunges off a bridge, killing 45, authorities say.",
      "publishedAt": "2024-03-28T22:38:23Z",
      "title": "A bus carrying people to an Easter festival in South Africa plunges off a bridge, killing 45, authorities say",
      "url": "https://apnews.com/2a241a5b0ee501bfa1d53a782eb91140",
      "urlToImage": ""
    },
    {
      "author": "LEA SKENE and BRIAN WITTE",
      "description": "BALTIMORE (AP) — Maryland Gov. Wes Moore warned Thursday of a “very long road ahead” to recover from the loss of Baltimore's Francis Scott Key Bridge as the Biden administration approved $60 million in immediate federal aid after the deadly collapse.",
      "publishedAt": "2024-03-28T14:49:45Z",
      "title": "Biden OKs $60M in aid after Baltimore bridge collapse as governor warns of 'very long road ahead'",
      "url": "https://apnews.com/a41073d33d08125b41c292b14b899d0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5502d5205184b8e9abd10e4c2405673/1920.jpeg"
    },
    {
      "author": "REESE DUNKLIN, RYAN J. FOLEY, JEFF MARTIN, JENNIFER McDERMOTT, HOLBROOK MOHR and JOHN SEEWER",
      "description": "Carl Grant, a Vietnam veteran with dementia, wandered out of a hospital room to charge a cellphone he imagined he had. When he wouldn’t sit still, the police officer escorting Grant body-slammed him, ricocheting the patient’s head off the floor.",
      "publishedAt": "2024-03-28T10:01:53Z",
      "title": "Why did more than 1,000 people die after police subdued them with force that isn't meant to kill?",
      "url": "https://apnews.com/02881a2bd3fbeb1fc31af9208bb0e310",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e8f74af45d04d729beaf2088d939f77/3000.jpeg"
    },
    {
      "author": "MIKE CORDER and JOSEF FEDERMAN",
      "description": "THE HAGUE, Netherlands (AP) — The top United Nations court on Thursday ordered Israel to take measures to improve the humanitarian situation in Gaza, including opening more land crossings to allow food, water, fuel and other supplies into the war-ravaged enclave.",
      "publishedAt": "2024-03-28T16:28:59Z",
      "title": "UN top court orders Israel to open more land crossings for aid into Gaza",
      "url": "https://apnews.com/7f2cb03fa2ec6736315a32e9ee291dbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be5fb3529bc045f189fc3bfe605e7c21/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and KAREEM CHEHAYEB",
      "description": "DEIR AL-BALAH, Gaza (AP) — An international team of doctors visiting a hospital in central Gaza was prepared for the worst. But the gruesome impact Israel’s war against Hamas is having on Palestinian children still left them stunned.",
      "publishedAt": "2024-03-28T04:16:20Z",
      "title": "Doctors visiting a Gaza hospital are stunned by the war's toll on Palestinian children",
      "url": "https://apnews.com/7c7a6117efae29e22a61e82151144613",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1890f34d8e5e43a3bd07175c1d4ebeef/1920.jpeg"
    },
    {
      "author": "KEN SWEET and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Crypto entrepreneur Sam Bankman-Fried was sentenced Thursday to 25 years in prison for a massive fraud on hundreds of thousands of customers that unraveled with the collapse of FTX, once one of the world’s most popular platforms for exchanging digital currency.",
      "publishedAt": "2024-03-28T04:18:45Z",
      "title": "Fallen crypto mogul Sam Bankman-Fried sentenced to 25 years in prison",
      "url": "https://apnews.com/d7bb1a5e94b4c22039d74dfeab1a2ff1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b9064884ab348088321e0101c224b80/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and PHILIP MARCELO",
      "description": "MASSAPEQUA PARK, N.Y. (AP) — Donald Trump attended Thursday's wake of a New York City police officer gunned down in the line of duty and called for “law and order,” as part of the presumptive Republican presidential nominee's attempt to show a contrast with President Joe Biden and focus on crime as part of his third White House campaign.",
      "publishedAt": "2024-03-28T04:07:33Z",
      "title": "Trump attends wake of slain New York officer, calls for 'law and order,' to show contrast with Biden",
      "url": "https://apnews.com/e91744c40c4513ead88caa247ab9916e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3e864f39ee94359ab47f0c599424008/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and CHRIS MEGERIAN",
      "description": "NEW YORK (AP) — A fundraiser for President Joe Biden on Thursday in New York City that also stars Barack Obama and Bill Clinton is raising a whopping $25 million, setting a record for the biggest haul for a political event, his campaign said.",
      "publishedAt": "2024-03-28T04:03:46Z",
      "title": "Biden's fundraiser with Obama and Clinton nets a record $25 million, his campaign says",
      "url": "https://apnews.com/ebfbc81d3b70f38745ae00c7ce6a382d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba7b75fd80b04d55a3fd10c8698cc8d5/3000.jpeg"
    },
    {
      "author": "DARREN SANDS",
      "description": "WASHINGTON (AP) — At the onset of the COVID-19 pandemic, when many churches moved their services online, the Rev. William H. Lamar IV initially shuddered at the thought that he needed to morph into a “video personality” to stay engaged with his parishioners.",
      "publishedAt": "2024-03-28T12:09:42Z",
      "title": "Black pastors see popular Easter services as an opportunity to rebuild in-person worship attendance",
      "url": "https://apnews.com/2b21b03863bc6be6c4b364a92f7fe094",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3563d9d78084586a9d9af664d1f33fd/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Republicans on Thursday invited President Joe Biden to testify before Congress in what appears to be a last-ditch effort to deliver on their stalled monthslong impeachment inquiry into the Biden family businesses.",
      "publishedAt": "2024-03-28T20:09:18Z",
      "title": "House Republicans invite President Biden to testify at public hearing as impeachment inquiry stalls",
      "url": "https://apnews.com/a2ffd73660b71cbb31b97ad4bfe44c07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6365906f369b401f8e27874d9aa5b5db/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}