{
  "articles": [
    {
      "author": "CLAUDIA LAUER, MICHAEL KUNZELMAN, COLLEEN LONG and RANDALL CHASE",
      "description": "WILMINGTON, Del. (AP) — A federal gun case against President Joe Biden’s son Hunter opened Monday with jury selection, following the collapse of a plea deal that would have avoided the spectacle of a trial so close the 2024 election.",
      "publishedAt": "2024-06-03T04:11:45Z",
      "title": "Prospective jurors in Hunter Biden's firearms case questioned on gun rights, addiction, politics",
      "url": "https://apnews.com/e2cc8b5d459ad80e5bd7b05c5e9105c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46eb65fa499342cd9f9aaf1373c142ea/2456.jpeg"
    },
    {
      "author": "MAE ANDERSON",
      "description": "More women are attaining the top job at companies in the S&amp;P 500, but their numbers are still minuscule compared to their male counterparts.Of the 341 CEOs included in the AP's annual compensation survey, 25 are women.",
      "publishedAt": "2024-06-03T11:04:14Z",
      "title": "More women made the list of top paid CEOs in 2023, but their numbers are still small compared to men",
      "url": "https://apnews.com/d482ceb56cd0194d1129083852ce7bde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/220b32ccaf15493a87a4b2ec86233f76/1313.jpeg"
    },
    {
      "author": "MARÍA VERZA and MARK STEVENSON",
      "description": "MEXICO CITY (AP) — Mexico’s newly elected president held out an olive branch Monday to the more than one-third of Mexicans who didn’t vote for her, but the first woman to win the job faces a tough path toward reconciling a country left deeply divided by outgoing President Andrés Manuel López Obrador.",
      "publishedAt": "2024-06-03T13:24:16Z",
      "title": "Mexico awakes with joy, division to the first woman elected president, Claudia Sheinbaum",
      "url": "https://apnews.com/cd48b3951845b0acb09da4ec5de8a91b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19c00a7334c743b09efcdcb9c95f05f6/1920.jpeg"
    },
    {
      "author": "TOM MURPHY and KASTURI PANANJADY",
      "description": "Opening stores used to mean everything to pharmacy chains. CVS Health once boasted of opening or buying more than 2,900 locations in a five-year period. Now it’s shuttering hundreds, while Walgreens, Rite Aid and independent drugstores also pull back.",
      "publishedAt": "2024-06-03T12:53:32Z",
      "title": "As pharmacies shutter, some Western states, Black and Latino communities are left behind",
      "url": "https://apnews.com/91967f18c0c059415b98fcf67ad0f84e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e5f7ec0494e41ecaac43ab7b6e30662/1611.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The cease-fire proposal announced by President Joe Biden has placed Prime Minister Benjamin Netanyahu at a crossroads, with either path likely to shape the legacy of Israel’s longest-serving and deeply divisive leader.",
      "publishedAt": "2024-06-03T16:12:56Z",
      "title": "Proposed Gaza cease-fire puts Netanyahu at a crossroads that could shape his legacy",
      "url": "https://apnews.com/ca984e5fc518f4f5f0fbd041b5c39ddb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7edaa14abbe54a07aad699f2aeaba654/3000.jpeg"
    },
    {
      "author": null,
      "description": "THE HAGUE, Netherlands (AP) — Palestinian officials have applied on behalf of the “State of Palestine” at the top U.N. court for permission to join South Africa's case accusing Israel of genocide in Gaza.",
      "publishedAt": "2024-06-03T17:32:25Z",
      "title": "'State of Palestine' applies to join South Africa's case at top UN court accusing Israel of genocide",
      "url": "https://apnews.com/cec7a3e2f3b2ca0705be7e4da44cb9cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/726b539fe40d43cc8373958102e7bd98/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's hard-line parliament speaker emerged on Monday as the most-prominent candidate from within the country's Shiite theocracy in the race for the June 28 presidential election to replace the late Ebrahim Raisi, killed in a helicopter crash last month.",
      "publishedAt": "2024-06-03T12:05:06Z",
      "title": "Iran's hard-line parliament speaker emerges as the theocracy's top figure in the presidential vote",
      "url": "https://apnews.com/f456884a4e0a369ed38f8a2154188ed6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6200deac180c4124badeb75822a6c405/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Pro-Brexit, anti-immigration campaigner Nigel Farage stepped back into front-line British politics on Monday, announcing he will take the helm of the right-wing party Reform U.K. and run for Parliament in the July 4 election.",
      "publishedAt": "2024-06-03T14:04:39Z",
      "title": "Populist campaigner Nigel Farage makes an about-face and says he will run in the UK election",
      "url": "https://apnews.com/7d8c7cdcd66b3ce4b7de67c6731a2431",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3857a96615e4283b18c423361427ba6/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — Bill May chuckles at the mere mention of the words “Saturday Night Live,” knowing that the conversation is about to turn to the TV show's 1984 skit starring Martin Short as one of two brothers attempting to make it to the Olympics in what then was called synchronized swimming.",
      "publishedAt": "2024-06-03T15:14:00Z",
      "title": "'SNL' lampooned men in artistic swimming. Bill May could be the sport's first male Olympian",
      "url": "https://apnews.com/73b1a984c7f119658c7a733b15717b4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/330dd2b6d48f44ba874a8e1d363d6c47/3000.jpeg"
    },
    {
      "author": "VALERIE KOMOR",
      "description": "NEW YORK (AP) — When Associated Press correspondent Don Whitehead arrived with other journalists in southern England to cover the Allies' imminent D-Day invasion of Normandy, a U.S.",
      "publishedAt": "2024-06-03T11:23:33Z",
      "title": "How AP covered the D-Day landings and lost photographer Bede Irvin in the battle for Normandy",
      "url": "https://apnews.com/fd4cb6c41e48b2624c3bb85b024bb332",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c518ba503d14251bc4b253e1bc40abc/2809.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}