{
  "articles": [
    {
      "author": "JENNIFER PELTZ, MICHAEL R. SISAK, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — The final jurors were seated Friday in Donald Trump’s hush money trial, and an appellate judge rejected the former president’s latest bid to halt the case as a hectic day in court set the stage for opening statements to begin Monday.",
      "publishedAt": "2024-04-19T04:03:35Z",
      "title": "Final jurors seated for Trump's hush money case, with opening statements set for Monday",
      "url": "https://apnews.com/24147c3774c8a411044c530cafcab292",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce3db4c63d8a418494b65b122d8bab2f/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Opening statements in Donald Trump's hush money case are set to begin next week after a jury of 12 people and six alternates was seated Friday.",
      "publishedAt": "2024-04-19T12:07:49Z",
      "title": "The Latest | Opening statements in Trump hush money trial set for Monday after latest appeal fails",
      "url": "https://apnews.com/f96099bf5aec8f37ae4497f3c18263b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce3db4c63d8a418494b65b122d8bab2f/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN and JON GAMBRELL",
      "description": "JERUSALEM (AP) — Israel and Iran on Friday both played down an apparent Israeli airstrike near a major air base and nuclear site in central Iran, signaling the two bitter enemies are ready to prevent their latest eruption of violence from escalating into a full-blown regional war.",
      "publishedAt": "2024-04-19T01:55:21Z",
      "title": "Israel, Iran play down apparent Israeli strike. The muted responses could calm tensions -- for now",
      "url": "https://apnews.com/a7ccbae2e2844bab089e8e4377a24ddb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/177c1600e58c47c7b76f3a2955186893/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES, LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — With rare bipartisan momentum, the House pushed ahead Friday on a foreign aid package of $95 billion for Ukraine, Israel, Taiwan and humanitarian support as a robust coalition of lawmakers helped it clear a procedural hurdle to reach final votes this weekend.",
      "publishedAt": "2024-04-19T14:28:23Z",
      "title": "Ukraine, Israel aid advances in rare House vote as Democrats help Republicans push it forward",
      "url": "https://apnews.com/68a810a998381dfd9f4c3c4e452b9f51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2430502f92a44ebf9768f6d6d845ecf0/3000.jpeg"
    },
    {
      "author": "BECKY BOHRER and MATTHEW DALY",
      "description": "JUNEAU, Alaska (AP) — The Biden administration said Friday it will restrict new oil and gas leasing on 13 million acres (5.3 million hectares) of a federal petroleum reserve in Alaska to help protect wildlife such as caribou and polar bears as the Arctic continues to warm.",
      "publishedAt": "2024-04-19T09:03:07Z",
      "title": "Biden administration restricts oil and gas leasing in 13 million acres of Alaska's petroleum reserve",
      "url": "https://apnews.com/1dd8c07d2ed6e902ee6ac6298e2eaade",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6631f08f05474f2f9be3be5017e42770/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — One woman miscarried in the lobby restroom of a Texas emergency room as front desk staff refused to check her in. Another woman learned that her fetus had no heartbeat at a Florida hospital, the day after a security guard turned her away from the facility.",
      "publishedAt": "2024-04-19T04:03:06Z",
      "title": "Emergency rooms refused to treat pregnant women, leaving one to miscarry in a lobby restroom",
      "url": "https://apnews.com/9ce6c87c8fc653c840654de1ae5f7a1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/353ade75acd44a2cb2dbc02f7d7cc414/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN and AMY BETH HANSON",
      "description": "HELENA, Mont. (AP) — BNSF Railway attorneys are expected to argue before jurors Friday that the railroad should not be held liable for the lung cancer deaths of two former residents of an asbestos-contaminated Montana town, one of the deadliest sites in the federal Superfund pollution program.",
      "publishedAt": "2024-04-19T05:05:40Z",
      "title": "BNSF Railway says it didn't know about asbestos that's killed hundreds in Montana town",
      "url": "https://apnews.com/cd9a904dd919a171b0c4c93899867e42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ca1ada2cf604a3d8b3980f9bb0312fd/2000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "CHICAGO (AP) — The closure of Wadsworth Elementary School in 2013 was a blow to residents of the majority-Black neighborhood it served, symbolizing a city indifferent to their interests.So when the city reopened Wadsworth last year to shelter hundreds of migrants without seeking community input, it added insult to injury.",
      "publishedAt": "2024-04-19T04:17:44Z",
      "title": "Chicago's response to migrant influx stirs longstanding frustrations among Black residents",
      "url": "https://apnews.com/ab8d7f22eea423d86fb350665b9e66f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d330cc6fed74dfd85d1a09e623bdca1/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "PHOENIX (AP) — A small blue dog with an Australian accent has captured the hearts of people across the world.",
      "publishedAt": "2024-04-19T17:58:37Z",
      "title": "Not a toddler, not a parent, but still love 'Bluey'? You're not alone",
      "url": "https://apnews.com/5271981ec52b9ce3b730ac70b0542947",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1a1e9c2785242c2b47194a3e0291a87/1920.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "There’s a 64-win team in Boston that ran away with the league’s best record. The defending champions in Denver, a group that won 57 games. A fearless young bunch in Oklahoma City, whose No. 1 seed was no fluke.",
      "publishedAt": "2024-04-19T14:32:14Z",
      "title": "The NBA playoffs are finally here. And as LeBron James says, 'it's a sprint now'",
      "url": "https://apnews.com/b7d75dc92ca84987ba15fe89814e416b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cee3a8cf98942ae8020e694f7fc5c34/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}