{
  "articles": [
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — In Middle East capitals, at the United Nations, from the White House and beyond, the Biden administration is making its most concentrated diplomatic push of the eight-month-old war in Gaza to persuade Israeli and Hamas leaders to take a proposed deal that would bring a cease-fire and release of more hostages.",
      "publishedAt": "2024-06-07T22:39:15Z",
      "title": "The US is making its biggest push yet to get Israel and Hamas to halt fighting. Is it succeeding?",
      "url": "https://apnews.com/f90f323b350cc2e164b0fecd942451b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24e0a7bed4c741f0be149d8b11bf38f6/3000.jpeg"
    },
    {
      "author": "KAREL JANICEK",
      "description": "PRAGUE (AP) — Voters in Slovakia, Italy and other European Union nations are casting their ballots Saturday on the third day of elections for the European Parliament, with populist and far-right parties looking to make gains across the 27-member bloc.",
      "publishedAt": "2024-06-08T05:18:35Z",
      "title": "Slovaks and others go to the polls in EU elections under the shadow of an assassination attempt",
      "url": "https://apnews.com/0e7fd468dcbe8c85a6277b2992de9da0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25ace952f6a14c6ab5b3508a25c63068/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, ZEKE MILLER and SYLVIE CORBET",
      "description": "PARIS (AP) — President Joe Biden is being feted by French President Emmanuel Macron with a state visit Saturday, as the two allies aim to show off their partnership on global security issues and move past trade tensions.",
      "publishedAt": "2024-06-08T04:00:47Z",
      "title": "Macron is hosting Biden for a state visit as the two leaders try to move past trade tensions",
      "url": "https://apnews.com/0c46f64738ecfcbb45e624e9dd226d9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51649789fa2447429ef4d2c9001672b7/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, SYLVIE CORBET and ZEKE MILLER",
      "description": "PARIS (AP) — President Joe Biden on Friday for the first time publicly apologized to Ukraine for a monthslong congressional holdup in American military assistance that let Russia make gains on the battlefield.",
      "publishedAt": "2024-06-07T07:36:54Z",
      "title": "Biden apologizes to Zelenskyy for monthslong congressional holdup to weapons that let Russia advance",
      "url": "https://apnews.com/a77546e23fa571eb7f6509d4e14b89b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a04426afa1e4c12af2aa0fa0b5352b0/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. military-built pier designed to carry badly needed aid into Gaza by boat has been reconnected to the beach in the besieged territory after a section broke apart in storms and rough seas, and food and other supplies will begin to flow soon, U.S.",
      "publishedAt": "2024-06-07T13:37:03Z",
      "title": "US-built pier in Gaza is reconnected after repairs, and aid will flow soon, US Central Command says",
      "url": "https://apnews.com/3db724ef590b4d056e81a1bac1b9c13f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddcc4908796d4c349c37dda52229392d/2859.jpeg"
    },
    {
      "author": "RANDALL CHASE, MICHAEL KUNZELMAN, COLLEEN LONG and CLAUDIA LAUER",
      "description": "WILMINGTON, Del. (AP) — Hunter Biden's daughter Naomi testified Friday in his federal gun trial about visiting her father while he was at a California rehab center, telling jurors that he seemed to be improving in the weeks before he bought the revolver in 2018.",
      "publishedAt": "2024-06-07T04:07:30Z",
      "title": "Hunter Biden's daughter Naomi testifies about her father in his federal gun trial, ending 1st week",
      "url": "https://apnews.com/8fc5b9e6960c1115c714e12c6e1217ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/899311c8db69476eafcd5938b7bfcbfe/1920.jpeg"
    },
    {
      "author": "GENE JOHNSON and AUDREY McAVOY",
      "description": "SEATTLE (AP) — William Anders, the former Apollo 8 astronaut who took the iconic “Earthrise” photo showing the planet as a shadowed blue marble from space in 1968, was killed Friday when the plane he was piloting alone plummeted into the waters off the San Juan Islands in Washington state.",
      "publishedAt": "2024-06-08T05:18:44Z",
      "title": "Former astronaut William Anders, who took iconic Earthrise photo, killed in Washington plane crash",
      "url": "https://apnews.com/b4d783e0c5613a0e65fc9598a55f90d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14e9b3e196f94cf3959d4c78d1664011/2895.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — By the time Iranian President Ebrahim Raisi boarded his window seat on a helicopter ferrying him, the foreign minister and six others, thick clouds already had begun forming around the mountaintops along the Azerbaijan-Iran border.",
      "publishedAt": "2024-06-08T05:09:14Z",
      "title": "Iran helicopter crash shows Tehran's reliance on an aging fleet as well as its challenges at home",
      "url": "https://apnews.com/31db6fb5a018e961a6b81a1cca3e4920",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a1f90aec55e4203973e041bd3ae270e/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — A soaring demand for food delivered fast has spawned small armies of couriers — and increasing alarm — in big cities where scooters, motorcycles and mopeds zip in and out of traffic and hop onto pedestrian-filled sidewalks as their drivers race to drop off salads and sandwiches.",
      "publishedAt": "2024-06-08T04:10:25Z",
      "title": "Demand for food delivery has skyrocketed. So have complaints about some drivers",
      "url": "https://apnews.com/e35b5667cb7f2140bdc778ca52f59695",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab0d4cbac8464d44a39d98956d493e1d/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Justice Clarence Thomas on Friday belatedly acknowledged more travel paid by Republican megadonor Harlan Crow, while several colleagues reported six-figure payments as part of book deals.",
      "publishedAt": "2024-06-07T16:47:21Z",
      "title": "Thomas acknowledges more travel paid for by Harlan Crow. Colleagues report six-figure book payments",
      "url": "https://apnews.com/d0873c92792f6c0791c9269fe05ed937",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a2a336e5d204364b68b8a0d884c84c2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}