{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JOSEF FEDERMAN and JACK JEFFERY",
      "description": "RAFAH, Gaza Strip (AP) — Hamas on Friday released 24 hostages who had been held captive in Gaza for weeks, and Israel freed 39 Palestinians from prison in the first stage of a swap under a four-day cease-fire deal.",
      "publishedAt": "2023-11-24T05:02:34Z",
      "title": "Hamas frees 24 hostages in exchange for 39 Palestinian prisoners as part of cease-fire swap",
      "url": "https://apnews.com/172256dd593189f7b37f7c62f4739c6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3eafe50a625d44f6a9e094355e9ec3a2/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — Gaza has always been a small, crowded space with hardly any exits. Now the world for Palestinians there has shrunk to the size of whatever refuge they can find: a jammed shelter, a car, the walls of a shared apartment, or floors and benches in hospital corridors.",
      "publishedAt": "2023-11-24T13:01:59Z",
      "title": "Gaza shrinks for Palestinians seeking refuge. 4 stories offer a glimpse into a diminished world",
      "url": "https://apnews.com/702f447ff7e52b03476555ec2513008b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f463660cc914657876bdcc857f94fe7/1600.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BANGKOK (AP) — Hamas freed at least 10 Thai nationals seized in the group's surprise attack on southern Israel last month and held until some hostages went free on Friday.",
      "publishedAt": "2023-11-24T19:25:56Z",
      "title": "At least 10 Thai hostages released by Hamas",
      "url": "https://apnews.com/1e712be6ab4446574128f36a5c6130e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9e314c9d6a24e42afc4ba38ed015103/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — Shoppers hunting for big deals packed malls and stores on Black Friday as retailers stepped up discounts to entice customers who are sticking to stricter budgets this year and resisting impulse buying.",
      "publishedAt": "2023-11-24T05:02:14Z",
      "title": "Retailers offer bigger Black Friday discounts to lure hesitant shoppers hunting for the best deals",
      "url": "https://apnews.com/fe9ab8137c76aa0df2e5b0a7cc3ecda4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fa73ffe77c54c31833e3e40f2cf83d8/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "PRETORIA, South Africa (AP) — Double-amputee Olympic runner Oscar Pistorius was granted parole on Friday, more than a decade after shooting his girlfriend through a toilet door at his home in South Africa in a killing that jolted the world.",
      "publishedAt": "2023-11-24T00:04:57Z",
      "title": "South African Olympic runner Oscar Pistorius granted parole, will be released from prison on Jan. 5",
      "url": "https://apnews.com/fb0ea8f28f786f6b91fb93b85ab0d315",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5182a6d1c4a74d3caaff02fef8beca47/2500.jpeg"
    },
    {
      "author": "FRANCES D'EMILIO",
      "description": "ROME (AP) — After the latest, horrifying killing of a college student allegedly by her resentful and jealous ex-boyfriend, students from Turin to Palermo have taken to pounding on classroom desks in unison to demand a stop to the slaying of women in Italy at the hands of men.",
      "publishedAt": "2023-11-24T05:11:11Z",
      "title": "Make noise! A murder and a movie stir Italians to loudly demand an end to violence against women",
      "url": "https://apnews.com/5b3c6101464b3536640fb9fb60d8761f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2af8b5a743864b8db07074bb133f68d8/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Ofri Bibas Levy has been haunted by nightmares since Oct. 7, when her brother, sister-in-law and their two young children were snatched by Hamas militants from their homes and dragged into the Gaza Strip.",
      "publishedAt": "2023-11-24T13:32:53Z",
      "title": "Families of hostages not slated for release from Gaza during current truce face enduring nightmare",
      "url": "https://apnews.com/6395a6113301e677bcac713f8db914b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a33aa231f599416d8d1475e7aab2fab4/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — Ohio’s new constitutional protections for abortion access and other reproductive rights take effect Dec. 7, a month after voters resoundingly passed them.",
      "publishedAt": "2023-11-24T05:03:11Z",
      "title": "Ohio voters just passed abortion protections. When and how they take effect is before the courts",
      "url": "https://apnews.com/fb1762537585350caeee589d68fe5a0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddc7362121014c41b6eeebec62562b42/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Two more women have come forward to accuse Sean “Diddy” Combs of sexual abuse, one week after the music mogul settled a separate lawsuit with the singer Cassie that contained allegations of rape and physical abuse.",
      "publishedAt": "2023-11-24T17:37:59Z",
      "title": "Sean 'Diddy' Combs accused of sexual abuse by two more women",
      "url": "https://apnews.com/c8dd081e5d60c88062d0328b9476802d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/345f822938884929a7c3d8f88391471b/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "When Daniel Skousen scrubs at the ash and soot covering his Maui home, he worries about the smell.",
      "publishedAt": "2023-11-24T05:04:47Z",
      "title": "Maui residents wonder if their burned town can be made safe. The answer? No one knows",
      "url": "https://apnews.com/20caacae75766e700d10c6fa3da9de1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97f2a52330c346b480410da3af546157/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}