{
  "articles": [
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — President Joe Biden's disastrous debate performance has reverberated across the Democratic Party, forcing lawmakers to grapple with a crisis that could upend the presidential election and change the course of American history.",
      "publishedAt": "2024-07-03T04:08:38Z",
      "title": "From raising alarm to backing Biden, Democrats in Congress grapple with debate aftermath",
      "url": "https://apnews.com/aa619e71e1e09868abe22d19fc48e351",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb13cf5a7b1d49a98dd8d8fb16bbdbd1/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump likes to be the one in the spotlight.But in the days since President Joe Biden's disastrous debate performance, the presumptive Republican nominee has kept a low profile, leaving the focus on the drama engulfing the Democratic Party as he and his campaign revel in a series of legal and political victories heading into the Republican National Convention this month.",
      "publishedAt": "2024-07-03T11:17:07Z",
      "title": "Trump revels in legal and political wins while Biden's campaign reels from their debate",
      "url": "https://apnews.com/86bfc24cc618906fa9b46ab029e65789",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43099fdb35c04a1a85750b809350f21d/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — An anti-settlement watchdog says Israel has approved the largest seizure of land in the occupied West Bank in over three decades.The Israeli group Peace Now said Wednesday that authorities recently approved the appropriation of 12.7 square kilometers (nearly 5 square miles) of land in the Jordan Valley.",
      "publishedAt": "2024-07-03T11:07:01Z",
      "title": "Anti-settlement group says Israel has made largest West Bank land seizure in 3 decades",
      "url": "https://apnews.com/033deab379a16efdf9989de8d6eaf0f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd5072e59cc9487cb687b330bcd03a9e/3000.jpeg"
    },
    {
      "author": "BISWAJEET BANERJEE and RAJESH KUMAR SINGH",
      "description": "HATHRAS, India (AP) — Severe overcrowding and a lack of exits contributed to a stampede at a religious festival in northern India, authorities said Wednesday, leaving at least 121 people dead as the faithful surged toward the preacher to touch him and chaos ensued.",
      "publishedAt": "2024-07-03T06:12:59Z",
      "title": "Severe overcrowding, lack of exits and mud contributed to a deadly stampede in India",
      "url": "https://apnews.com/f5d9e1e95f32240338c0121600ecdc9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/408bb297730f4a298fafd1b66b1d51d4/1920.jpeg"
    },
    {
      "author": null,
      "description": "KINGSTON, Jamaica (AP) — Hurricane Beryl was roaring toward Jamaica on Wednesday, with islanders scrambling to make preparations after the powerful Category 4 storm earlier killed at least six people and caused significant damage in the southeast Caribbean.",
      "publishedAt": "2024-07-03T09:06:06Z",
      "title": "Hurricane Beryl roars toward Jamaica after killing at least 6 people in the southeast Caribbean",
      "url": "https://apnews.com/774803fc70e187ea96e7df10f84d8a50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7387531b0a0d44069ec9ce5c5deefac9/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — There's plenty of worry among Democrats about whether 81-year-old President Joe Biden is up to the job itself or the task of defeating Donald Trump. Previous presidential campaigns offer lessons.",
      "publishedAt": "2024-07-03T04:13:59Z",
      "title": "Ominous history for Biden: Incumbents trying to win over their parties often struggle to win again",
      "url": "https://apnews.com/ff309816b14efd9c423c565791259818",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54eeea37cdaa4cf6b6d83aed5e79b328/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — In her dissent from a Supreme Court opinion that afforded former President Donald Trump broad immunity, Justice Sonia Sotomayor pondered the potential doomsday consequences: A president could pocket a bribe for a pardon, stage a military coup to retain power, order the killing of a rival by the Navy SEAL Team Six — and be protected from prosecution for all of it.",
      "publishedAt": "2024-07-03T04:01:43Z",
      "title": "Supreme Court opinion conferring broad immunity could embolden Trump as he seeks to return to power",
      "url": "https://apnews.com/05af7a7325a03bcb1ce0ad22ec389f1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1de7780989e4968b11d77e8d9f7cbbc/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Rishi Sunak has covered thousands of miles in the past few weeks, but he hasn’t outrun the expectation that his time as Britain’s prime minister is in its final hours.",
      "publishedAt": "2024-07-03T04:52:14Z",
      "title": "In the UK election campaign’s final hours, Sunak battles to the end as Labour’s Starmer eyes victory",
      "url": "https://apnews.com/80c5def5ba76f6077db4230ab4881260",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f14e0589c21a4d65a0a9c941215e7c55/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO, HALELUYA HADERO and DEE-ANN DURBIN",
      "description": "NEW YORK (AP) — TikTok and its bite-sized videos arrived in the United States as a global version of the Chinese app Douyin.",
      "publishedAt": "2024-07-03T08:59:34Z",
      "title": "From 'latte makeup' to 'girl dinners,' TikTok has launched tons of trends. Will its influence last?",
      "url": "https://apnews.com/6cc74619493f226827b103da4f652a84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2113e8434e914c139402802d788c7434/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Ron Falk lost his right leg, had extensive skin grafting on the left one and is still recovering a year after collapsing on the searing asphalt outside a Phoenix convenience store where he stopped for a cold soda during a heat wave.",
      "publishedAt": "2024-07-03T04:03:40Z",
      "title": "Sizzling sidewalks, unshaded playgrounds pose risk for surface burns over searing Southwest summer",
      "url": "https://apnews.com/81ff205cec4733d54cb5c5bb58dbe1b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b33452e5b396448196ce7c4192868ee9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}