{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump's economic policies are facing scrutiny as weak indicators emerge. Job gains are dwindling, inflation is rising and growth has slowed compared to last year. More than six months into his term, Trump's tariffs and tax changes have reshaped the economy. On Friday, a bleak jobs report showed a decline in manufacturing jobs, and Trump fired the head of the agency responsible for the data. Critics warn that Trump's aggressive use of tariffs and tax changes could backfire. The White House, however, remains optimistic, claiming the best is yet to come.",
      "publishedAt": "2025-08-02T04:02:50Z",
      "title": "It's Trump's economy now. The latest financial numbers offer some warning signs",
      "url": "https://apnews.com/article/trump-economy-warning-signs-financial-numbers-6f9754dbb6b21c9ef5c557b1ebfe6ce9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5372c1d/2147483647/strip/true/crop/5145x2894+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F0a%2F1ad077234b791658b266afa52512%2Fc305bde79c8b4f1a8d20725ff6451870"
    },
    {
      "author": null,
      "description": "President Donald Trump says he's ordering the repositioning of two U.S. nuclear submarines. This decision comes after what he calls \"highly provocative statements\" by former Russian President Dmitry Medvedev. Trump posted on his social media site that he's taking action in case Medvedev's words are more than just rhetoric. He emphasizes the importance of words and hopes for no unintended consequences. The impact on U.S. nuclear subs, which routinely patrol global hotspots, remains unclear. This move escalates tensions between Washington and Moscow at a delicate time. Trump also mentions sending a special envoy to Russia to push for a ceasefire in its war with Ukraine.",
      "publishedAt": "2025-08-01T18:06:04Z",
      "title": "Trump orders US nuclear subs repositioned over statements from ex-Russian leader",
      "url": "https://apnews.com/article/trump-nuclear-submarines-repositioned-medvedev-f8e9b870fa107f6b6209e7a22f8ada43",
      "urlToImage": "https://dims.apnews.com/dims4/default/c7ab803/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F9e%2Fa78d8d6a4cd8ffa11a45205b8267%2F0462a46b5e3c44aba7eee6d781d7e57d"
    },
    {
      "author": null,
      "description": "Hospitals in Gaza have reported the killing of more than a dozen people, half of them food-seekers, by Israeli fire on Saturday as Palestinians endured severe risks in their search for food amid airdrops and restrictions on overland aid delivery. Eyewitnesses described chaos and gunfire at aid distribution sites, which the Israel-backed private American contractor denied. Airstrikes also killed families in tents and homes, health and hospital officials said. Meanwhile, hostage families protested in Tel Aviv, urging a deal to end the war. As border crossings remain blocked, more countries joined airdrop efforts, which UN officials say are costly and insufficient to address the crisis.",
      "publishedAt": "2025-08-02T10:48:36Z",
      "title": "Israeli fire kills at least 18 in Gaza, US envoy visits hostage family protest",
      "url": "https://apnews.com/article/israel-gaza-war-witkoff-hostage-tel-aviv-b90fe087e8254179667e0cd6094cd438",
      "urlToImage": "https://dims.apnews.com/dims4/default/23c8e7e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F74%2Fe99ab08f2a813b602c0355cf84bf%2F012f2db78e764437bcef6f719ea010d9"
    },
    {
      "author": null,
      "description": "The Corporation for Public Broadcasting has been a cornerstone of American culture for three generations. Now it says it will begin taking steps toward its own closure after being defunded by the U.S. Senate. That marks the end of a nearly six-decade era in which it fueled the production of renowned educational programming, cultural content and even emergency alerts. The demise of the corporation, known as CPB, is a direct result of President Donald Trump’s targeting of public media, which he has repeatedly said is spreading political and cultural views antithetical to those the United States should be espousing. The closure is expected to have a profound impact on the journalistic and cultural landscape.",
      "publishedAt": "2025-08-01T19:23:18Z",
      "title": "Corporation for Public Broadcasting to close after Congress defunds it",
      "url": "https://apnews.com/article/public-broadcasting-defunding-pbs-npr-94708ffb8313d4811fa6ca199fe454ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/4836298/2147483647/strip/true/crop/3435x1932+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F47%2F04431ebadab9b4cf56e12651e293%2F0ddb51fba5144786b601d13fadfe377c"
    },
    {
      "author": null,
      "description": "A federal appeals court has upheld a lower court’s temporary order blocking the Trump administration from conducting indiscriminate immigration stops and arrests in Southern California. A three-judge panel of the Ninth U.S. Circuit Court of Appeals ruled Friday night. They held a hearing Monday where the federal government asked the court to overturn a temporary restraining order issued July 12. The government argued the order was impeding their ability to enforce immigration law. Immigrant advocacy groups filed a lawsuit last month accusing President Donald Trump’s administration of systematically targeting brown-skinned people in Southern California during its ongoing immigration crackdown.",
      "publishedAt": "2025-08-02T06:05:26Z",
      "title": "Appeals court keeps order blocking Trump administration from indiscriminate immigration sweeps",
      "url": "https://apnews.com/article/immigration-raids-aclu-lawsuit-los-angeles-trump-3bbcb0634ed57ede1897c89f76676094",
      "urlToImage": "https://dims.apnews.com/dims4/default/44f3d2d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F78%2F289be6affab73f32c49f14e63531%2F50d91b42fe83449ea06e1d6546efdffe"
    },
    {
      "author": null,
      "description": "The Smithsonian’s removal of a reference to the 2019 and 2021 impeachments of President Donald Trump from a panel in an exhibition about the American presidency comes in the wake of Trump administration actions like removing the name of a gay rights activist from a Navy ship, pushing for Republican supporters in Congress to defund the Corporation for Public Broadcasting and getting rid of the leadership at the Kennedy Center. A Smithsonian spokesperson said the removal of the reference, which had been installed as a temporary addition in 2021, came after a review of “legacy content recently” and said the exhibit eventually “will include all impeachments.”",
      "publishedAt": "2025-08-02T04:10:43Z",
      "title": "Complex questions echo after Smithsonian removes Trump impeachment exhibit",
      "url": "https://apnews.com/article/smithsonian-trump-history-impeachment-b2b60d952d92df1a4a5233e0d60ecaa6",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5b3e0f/2147483647/strip/true/crop/2883x1622+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F80%2Fcf38eca78f360e38a8b907420a9d%2Fcf4e1471635a43e79b27d9673f0f9ab8"
    },
    {
      "author": null,
      "description": "SpaceX has delivered a new crew to the International Space Station in just 15 hours. The team, consisting of astronauts from the U.S., Russia, and Japan, launched from NASA's Kennedy Space Center and arrived on Saturday. They will spend at least six months aboard, replacing colleagues who have been there since March. SpaceX plans to bring the previous crew back as early as Wednesday. NASA's Zena Cardman and Mike Fincke, Japan's Kimiya Yui, and Russia's Oleg Platonov are now on board. Their arrival temporarily increases the space station's population to 11.",
      "publishedAt": "2025-08-02T06:29:30Z",
      "title": "SpaceX delivers four astronauts to the International Space Station just 15 hours after launch",
      "url": "https://apnews.com/article/nasa-spacex-astronauts-docking-64caca227f6ef4774de1fc14b05910bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/46e1416/2147483647/strip/true/crop/2484x1397+0+42/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F69%2F6bdb897caa42bc2f4b957fb8f819%2F6263027bf7c647f289a050e7fec20ee1"
    },
    {
      "author": null,
      "description": "Abeer and Fadi Sobh spend their days seeking food for themselves and their six children. Their family is like so many others in the war-ravaged Gaza Strip. International organizations have said for months that Gaza has been on the brink of famine, but they warned this week that the worst-case scenario of famine was beginning to unfold. Though the flow of aid resumed in May after a 10-week blockade, the amount is a fraction of what aid organizations say is needed. A security breakdown has also made it nearly impossible to safely deliver food. Much of the limited aid entering is hoarded and later sold on the black market.",
      "publishedAt": "2025-08-02T05:01:00Z",
      "title": "A Gaza family's waking hours are focused on finding food",
      "url": "https://apnews.com/article/gaza-starvation-food-war-israel-hamas-62060ce002cd7856301047314b7df7e3",
      "urlToImage": "https://dims.apnews.com/dims4/default/350d39e/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F88%2F1fd61fcbf4b9e19662342e7e8557%2F9370e51664cd433b8c680b2b7aa4dd1a"
    },
    {
      "author": null,
      "description": "Jeannie Seely, the soulful country music singer known for hits like “Don’t Touch Me,” has died at 85. Her publicist says she died Friday from complications of an intestinal infection. Known as “Miss Country Soul,” Seely was a trailblazer for women in country music, celebrated for her spirited nonconformity and hits in the ‘60s and ’70s. She was hospitalized in May after multiple surgeries and a bout of pneumonia. Seely never stopped working in country music. Since 2018, she's hosted the weekly “Sunday’s with Seely” on Willie Nelson's SiriusXM channel. She appeared nearly 5,400 times at Grand Ole Opry, which will dedicate its Saturday show to her.",
      "publishedAt": "2025-08-01T23:13:58Z",
      "title": "Jeannie Seely, country singer of hits like ‘Don’t Touch Me,’ dies at 85",
      "url": "https://apnews.com/article/jeannie-seely-dead-f5e817427aecdf18efad4dcb88458268",
      "urlToImage": "https://dims.apnews.com/dims4/default/27d9646/2147483647/strip/true/crop/3000x1688+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F1e%2Fc59215a474838aa308f86e1b0270%2Fc0cb4bcf6a6e41a682d2ff4afa4702a4"
    },
    {
      "author": null,
      "description": "A 110-foot Ferris wheel. Race cars painted in MLB team colors. Food trucks. Live music. Pitching tunnels and batting cages. A chance for photos with the Commissioner’s Trophy. And Clydesdales. Of course, there’s merchandise available for any fans who forgot to grab their gear supporting the Atlanta Braves or Cincinnati Reds or simply commemorating a spectacle unlike any other. About four years in the planning, it’s finally time for the MLB Speedway Classic to play ball Saturday night on the diamond constructed on the infield at Bristol Motor Speedway at the place called the “Last Great Colisseum!”",
      "publishedAt": "2025-08-02T10:00:08Z",
      "title": "MLB Speedway Classic debuts at Bristol Motor Speedway",
      "url": "https://apnews.com/article/mlb-speedway-classic-reds-braves-bristol-b25ba29f19121d9859ba485df4038510",
      "urlToImage": "https://dims.apnews.com/dims4/default/0735f10/2147483647/strip/true/crop/5227x2940+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F25%2F124bf62f27fa183b935997e0b851%2Fb33380dacc7f449eaf6fcd651374cf74"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}