{
  "articles": [
    {
      "author": "MAKIYA SEMINERA and JOHN MINCHILLO",
      "description": "LUCAMA, N.C. (AP) — Tornadoes spawned by Tropical Storm Debby leveled homes, damaged a school and killed one person early Thursday, as the system dropped heavy rain and flooded communities across North and South Carolina.",
      "publishedAt": "2024-08-08T04:10:28Z",
      "title": "Tornadoes spawned by Tropical Storm Debby rip through North Carolina",
      "url": "https://apnews.com/d90428b0417df35fa1cae8b24793f5c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1e5a227500249338530e0829cab1689/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and JOEY CAPPELLETTI",
      "description": "DETROIT (AP) — Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz, are set to play up their support for organized labor during an appearance at a Detroit-area union hall as the new Democratic ticket lavishes attention on a crucial base of support.",
      "publishedAt": "2024-08-08T10:07:21Z",
      "title": "Harris and Walz are showing their support for organized labor with appearance at Detroit union hall",
      "url": "https://apnews.com/c19aa8557fe93a986f673eccf461f5be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cd267abdd9f46fcad4c0bfe45b10f3a/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "CINCINNATI (AP) — Minnesota Gov. Tim Walz's military record has come under scrutiny since he was named as Vice President Kamala Harris' running mate on the Democratic presidential ticket, with Republicans questioning both Walz's characterization of his time in uniform and his departure from service.",
      "publishedAt": "2024-08-08T15:49:21Z",
      "title": "Walz's military record under scrutiny as Vance, GOP question his service",
      "url": "https://apnews.com/ae43d684bf1319e535f9f620552155d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d86e1fb0cf24619bf61cf49a92ddda6/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, MICHELLE L. PRICE and ADRIANA GOMEZ LICON",
      "description": "PALM BEACH, Fla. (AP) — Former President Donald Trump says he will hold a news conference Thursday at Mar-a-Lago, his Florida beachside compound, making his first public appearance since Vice President Kamala Harris became the Democratic presidential nominee and selected Minnesota Gov.",
      "publishedAt": "2024-08-08T12:16:18Z",
      "title": "Trump will hold a news conference in his first public appearance since rival Harris picked Walz",
      "url": "https://apnews.com/94b590ddf0434d9ea7b1241396dbbcc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd84c30f00a44fb4bb4e5bc2dddf7a5d/3000.jpeg"
    },
    {
      "author": "KYLE HIGHTOWER",
      "description": "PARIS (AP) — Guerschon Yabusele scored 17 points and France beat Germany 73-69 in front of a raucous crowd to advance to the men’s Olympic basketball gold medal game. Isaia Cordinier added 16 points and Victor Wembanyama finished with 11 points and seven rebounds to help France – which won the silver medal in Toyko three years ago --- reach its second straight Olympic final.",
      "publishedAt": "2024-08-08T17:41:15Z",
      "title": "France beats Germany 73-69 to advance to Olympic men's basketball gold medal game",
      "url": "https://apnews.com/ee7ae109109afc694e32e0e8a00902e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cd380c1aa57491c9ce820e44803f058/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN",
      "description": "MIAMI (AP) — Federal investigators say they found the DNA of a decorated former U.S. Green Beret on some of the 60 automatic weapons he allegedly smuggled from Florida to South America as part of a failed 2020 coup attempt against Venezuelan President Nicolás Maduro.",
      "publishedAt": "2024-08-08T16:38:29Z",
      "title": "DNA on weapons implicates ex-U.S. Green Beret in attempted Venezuelan coup, federal officials say",
      "url": "https://apnews.com/da832a30eea2150d0366851935998bd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a66466de2d9e4ab99947ffaf2273cc4a/1280.jpeg"
    },
    {
      "author": "PHILIPP-MORITZ JENNE, STEFANIE DAZIO and KIRSTEN GRIESHABER",
      "description": "VIENNA (AP) — Both suspects in a foiled plot to attack Taylor Swift shows in Vienna appeared to be inspired by the Islamic State group and al-Qaida, Austrian authorities said Thursday, and investigators found bomb-making materials at one of their homes.",
      "publishedAt": "2024-08-08T07:49:12Z",
      "title": "Suspects in foiled attack on Taylor Swift shows were inspired by Islamic State group, officials say",
      "url": "https://apnews.com/17b494f1a164b205128d7faeb607e731",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4da1c335ed544d5f8a8790e2ddcefec0/1920.jpeg"
    },
    {
      "author": "GABRIELA AOUN ANGUEIRA",
      "description": "KANAIO, Hawaii (AP) — Fear. Anxiety. Anger. Depression. Overwhelmed.Janice Dapitan began her second counseling session by writing those words on a whiteboard, reflecting what she felt in that moment.",
      "publishedAt": "2024-08-08T04:05:51Z",
      "title": "How horses at the Spirit Horse Ranch help Maui wildfire survivors process their grief",
      "url": "https://apnews.com/ffad3bdb5cd3c348a06bb495bfcef88c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b0d1d42dbd44a8095ae70b856671998/3000.jpeg"
    },
    {
      "author": "DEVNA BOSE",
      "description": "Three people have now died in a listeria food poisoning outbreak linked to Boar's Head deli meats, federal food safety officials announced Thursday, and the overall number of people sickened rose to 43.",
      "publishedAt": "2024-08-08T17:02:54Z",
      "title": "Third person dies in listeria outbreak tied to Boar's Head deli meats",
      "url": "https://apnews.com/76936390711deb8541314adb9801e74d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a211d442b4f4f198b90b9ef8d6cebc7/3000.jpeg"
    },
    {
      "author": null,
      "description": "CHICAGO (AP) — The Chicago White Sox fired manager Pedro Grifol and three coaches on Thursday, two days after the team ended a 21-game losing streak that tied the American League record.Chicago began the day 28-89, on pace to finish 39-122, which would be the worst major league record since the National League's Cleveland Spiders were 20-134 in 1899.",
      "publishedAt": "2024-08-08T14:12:14Z",
      "title": "White Sox fire manager Pedro Grifol after end of 21-game losing streak that tied AL record",
      "url": "https://apnews.com/8ef615131350230c0480701a836ee974",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0da2c06bf5a471195f78a1c5987a2de/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}