{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — Halloween has plenty of traditions, from candy to jack-o'-lanterns — and the annual spectacle of Heidi Klum's costume.",
      "publishedAt": "2024-10-30T16:34:28Z",
      "title": "Heidi Klum's Halloween costumes are always epic. See how she's dressed up over the years",
      "url": "https://apnews.com/a1287d08998804eccec5bfb899e5d0eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/237d6bd874cf4551ab266985f0f693a4/1920.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS",
      "description": "Donald Trump and Kamala Harris will crisscross several swing states on Wednesday, passing each other in Wisconsin, where the former president is scheduled to appear in Green Bay with a onetime local icon, retired NFL quarterback Brett Favre.",
      "publishedAt": "2024-10-30T11:26:43Z",
      "title": "Trump will campaign in Wisconsin with Brett Favre, who's linked to a Mississippi welfare scandal",
      "url": "https://apnews.com/ebc6e53c292588ef218915eadc0b4ba4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa27c51d6c024def9a5ce1e0b273cf07/2085.jpeg"
    },
    {
      "author": "WILL WEISSERT and CHRIS MEGERIAN",
      "description": "HARRISBURG, Penn. (AP) — Kamala Harris called Wednesday for Americans to “stop pointing fingers at each other” as she tried to push past comments made by President Joe Biden about Donald Trump's supporters and “garbage \" and keep the focus on her Republican opponent in the closing days of the race.",
      "publishedAt": "2024-10-30T14:26:29Z",
      "title": "Harris promises to 'represent all Americans' after Biden's remark on Trump supporters and 'garbage'",
      "url": "https://apnews.com/3d2ea66e3027ddc4bc2b30c13bf7b554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba5dbc1cc8114f21baa65619c70d5ddf/1920.jpeg"
    },
    {
      "author": "ABED AL KAREEM HANA and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza (AP) — A Palestinian ambulance worker made a horrific discovery when the bloody sheet was lifted: The corpse on the stretcher was his own mother, killed by an Israeli airstrike Wednesday in central Gaza.",
      "publishedAt": "2024-10-30T21:34:02Z",
      "title": "A Gaza medic realizes he's carrying his own mother's body, killed by an Israeli airstrike",
      "url": "https://apnews.com/89c8e9bde2d3f772549fa6c0e9f77a46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/942b1eea3a9844b599921f13df54cff3/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE, JULIA FRANKEL and SAMY MAGDY",
      "description": "BEIRUT (AP) — The United States and other mediators are ramping up efforts to halt the wars in Lebanon and the Gaza Strip, circulating new proposals to wind down the regional conflict during the Biden administration’s final months.",
      "publishedAt": "2024-10-30T14:01:57Z",
      "title": "A new push to wind down the Middle East wars faces familiar challenges",
      "url": "https://apnews.com/4fdcf546eb73faf26717b76b4bb3a919",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84a691ddc3c241cf91c03040e35ceccf/3000.jpeg"
    },
    {
      "author": "TARA COPP and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin said Wednesday that North Korean troops wearing Russian uniforms and carrying Russian equipment are moving toward Ukraine, in what he called a dangerous and destabilizing development.",
      "publishedAt": "2024-10-30T17:31:24Z",
      "title": "North Korean troops in Russian uniforms are heading toward Ukraine, US says",
      "url": "https://apnews.com/faeabb0b2c2ea162bbc6c4691df4d6c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81877127a8524a70b609f7ad9b85d6d8/1920.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — Federal officials on Wednesday reported more cases of E. coli poisoning among people who ate at McDonald’s, as government investigators seeking the outbreak’s source identified an “onion grower of interest” in Washington state.",
      "publishedAt": "2024-10-30T22:00:52Z",
      "title": "McDonald's E. coli case count rises as federal officials inspect an onion grower",
      "url": "https://apnews.com/a38666eaf2c38dccc99c00d72879928c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c9711b0b655423c83a5176b71fe7c83/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — The man suspected of setting fires in ballot drop boxes in Oregon and Washington state is an experienced metalworker and may be planning additional attacks, authorities said Wednesday.",
      "publishedAt": "2024-10-30T17:06:08Z",
      "title": "Police say the man behind ballot box fires has metalworking experience and might plan more attacks",
      "url": "https://apnews.com/60fea753ceb761624e6aba49f0e9dd99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c4b5542ffd44badb340c1248317d664/1920.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "The groups promoting ballot measures to add amendments to the constitutions in nine states that would enshrine a right to abortion have raised more than $160 million.",
      "publishedAt": "2024-10-30T13:02:53Z",
      "title": "Abortion-rights groups outspend opponents by more than 6 to 1 in ballot measure campaigns",
      "url": "https://apnews.com/539217e94f6f96200eff75e8917e525b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab2ca36d70584c749cc35442b843e7b4/3000.jpeg"
    },
    {
      "author": "ALICIA LEÓN, JOSEPH WILSON and TERESA MEDRANO",
      "description": "UTIEL, Spain (AP) — Flash floods in Spain turned village streets into rivers, ruined homes, disrupted transportation and killed at least 95 people in the worst natural disaster to hit the European nation in recent memory.",
      "publishedAt": "2024-10-30T08:03:44Z",
      "title": "At least 95 people die in devastating flash floods in Spain",
      "url": "https://apnews.com/ef0dffabe1a106a05c239dca4dfec1ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3eb992d9c3174c229030b59489ee7788/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}