{
  "articles": [
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu said Sunday that the current phase of fighting against Hamas in Gaza is winding down, setting the stage for Israel to send more troops to its northern border to confront the Lebanese militant group Hezbollah.",
      "publishedAt": "2024-06-23T10:57:34Z",
      "title": "Netanyahu says Israel is winding down its Gaza operations. But he warns a Lebanon war could be next",
      "url": "https://apnews.com/bcc6c48de5c463fd68b7249f5b15bf5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/933da2158a034e5a8fd83ab73a860095/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "ESPARGOS, Cape Verde (AP) — The top U.S. military officer warned on Sunday that any Israeli military offensive into Lebanon would risk an Iranian response in defense of the powerful Hezbollah militant group there, triggering a broader war that could put U.S.",
      "publishedAt": "2024-06-23T20:36:03Z",
      "title": "An Israel offensive into Lebanon risks an Iranian military response, top US military leader says",
      "url": "https://apnews.com/82d714dfca0d34fd44f565cf859818c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b494ac63cd494d199341817f483109dc/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Millions of Americans sweated through yet another scorching day as temperatures soared Sunday across the U.S., while residents were rescued from floodwaters that forced evacuations across the Midwest, including in an Iowa town where the flood gauge was submerged.",
      "publishedAt": "2024-06-23T15:05:54Z",
      "title": "Millions swelter as temperatures soar across the US, while floodwaters inundate the Midwest",
      "url": "https://apnews.com/45e54e79787626291194be620bb67e10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7ec82c00430433d900172e350d5af29/1920.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — More than 15 police officers and several civilians, including an Orthodox priest, were killed by armed militants in Russia’s southern republic of Dagestan on Sunday, its governor Sergei Melikov said in a video statement early Monday.",
      "publishedAt": "2024-06-23T18:49:05Z",
      "title": "Gunmen kill 15 police officers and several civilians in Russia's southern Dagestan region",
      "url": "https://apnews.com/d4ceba71308ab75b28e128991776b2b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36d8e1d37b6048418a83a2e56fb85f28/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and NASSER KARIMI",
      "description": "DUBAI, United Arab Emirates (AP) — Cab drivers and bikers tap away furiously on their mobile phones as they wait at red lights in the Iranian capital during an early June heatwave. Some pedestrians in Tehran are doing the same.",
      "publishedAt": "2024-06-24T05:10:56Z",
      "title": "'Hamster' crypto craze has taken Iran. It highlights economic malaise ahead of presidential election",
      "url": "https://apnews.com/934a398a0d2074c04bbf0112d701086f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d75c251f3e7c408e9b5382827deb9dea/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — For Mon PMs; WX507-508___Rarely, if ever, has one candidate in a presidential debate had so much material to use against the other.",
      "publishedAt": "2024-06-24T04:05:16Z",
      "title": "Can Biden perform and can Trump be boring? Key questions ahead of high-stakes presidential debate",
      "url": "https://apnews.com/366ccaf83068a3c64e262bcca945d6ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcb783f5ad4c4bbcbaeca4f73b710dda/2965.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "FORT PIERCE, Fla. (AP) — The federal judge presiding over the classified documents prosecution of Donald Trump is hearing arguments Monday on whether to bar the former president from public comments that prosecutors say could endanger the lives of FBI agents working on the case.",
      "publishedAt": "2024-06-24T04:10:36Z",
      "title": "Prosecutors in classified files case to urge judge to bar Trump from inflammatory comments about FBI",
      "url": "https://apnews.com/1d800e05b549de0d027f94aa93726742",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84536b07d4a0423284dcbbbdcef41ab9/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "KIBBUTZ NIR OZ, Israel (AP) — A new kind of tourism has emerged in Israel in the months since Hamas’ Oct. 7 attack. For celebrities, politicians, influencers and others, no trip is complete without a somber visit to the devastated south that absorbed the brunt of the assault near the border with Gaza.",
      "publishedAt": "2024-06-24T04:39:10Z",
      "title": "Some visitors to Israel have a new stop on their tours: Hamas' destruction in the south",
      "url": "https://apnews.com/8b21f590c37fa6780bf9190d6bfb62b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af010d0b86cd42f88d865ed585bc9851/3000.jpeg"
    },
    {
      "author": "SUDHIN THANAWALA",
      "description": "Callie Weems was reveling in her new role as a mom in the months before a gunman in Arkansas fatally shot her at a grocery store.Her daughter Ivy, now 10 months old, was a constant source of entertainment and wonder, Weems’ mother, Helen Browning, 53, said in a phone interview on Sunday as she shared memories of her daughter.",
      "publishedAt": "2024-06-23T02:23:50Z",
      "title": "New mom who delighted in her daughter is among the dead in Arkansas grocery store shooting",
      "url": "https://apnews.com/2accbd7f3bef7987c84ca8f12c60de69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c27e9aa45234d8898ea9f4fb262add8/2750.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — Before Emperor Naruhito of Japan attends a banquet hosted by King Charles III, lays a wreath at Westminster Abbey or tours one of Britain’s premier biomedical research institutes, he'll kick off this week’s trip to the U.K.",
      "publishedAt": "2024-06-24T05:07:55Z",
      "title": "Japanese emperor to reconnect with the River Thames in state visit meant to bolster ties with UK",
      "url": "https://apnews.com/0ed3e261c150ec714e4d1a1a919238a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46de719622ea4959ad4da3c986dcac39/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}