{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump is visiting Texas on Friday to assess catastrophic flooding that has killed at least 120 people. Despite his past calls to phase out the Federal Emergency Management Agency, Trump has praised the federal response to the disaster. He plans to tour affected areas by air, meet first responders and speak with victims' families. The administration has shifted focus from reducing federal disaster management to addressing the tragedy's human impact. But even though Trump hasn't been as vocal about his push to shutter FEMA, Homeland Security Secretary Kristi Noem in recent days has highlighted efforts to streamline its operations.",
      "publishedAt": "2025-07-11T04:00:41Z",
      "title": "Trump plans to tour Texas flood damage",
      "url": "https://apnews.com/article/trump-texas-floods-fema-phase-out-b77d9681d2d39f8c201351b54ecf944f",
      "urlToImage": "https://dims.apnews.com/dims4/default/80ea1a6/2147483647/strip/true/crop/7897x4442+0+411/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F8a%2Fbbb7b4815157ae028222b65f980f%2F3462225b773643a495456c7fefc4c5a9"
    },
    {
      "author": null,
      "description": "A retired nurse, her son and a family friend say they were lucky to survive last week's flash floods in Texas that killed more than 100 people, including many summer campers. Jane Towler says she got a call at around 4 a.m. last Friday from a friend in a neighboring cabin telling her the Guadalupe River was rising quickly and to get to safety. Towler ran next door to warn her son, their family friend and the woman's young daughter. Videos Towler shot show how quickly the cottage filled with water and how they had to flee to the attic and then the roof, where they waited out the night amid lightning, shouts and widespread destruction.",
      "publishedAt": "2025-07-10T19:53:33Z",
      "title": "Photos and video captured Texas flood survivors' terrifying ordeal as water filled their cottage",
      "url": "https://apnews.com/article/texas-flood-survivors-video-434cea2164368a9f1dee74636961d1da",
      "urlToImage": "https://dims.apnews.com/dims4/default/af0aae6/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F9d%2F803b9cafd421c2bcfdeb215646bc%2F6b82ba781cd84e5ba7ba479faf1cd647"
    },
    {
      "author": null,
      "description": "The State Department is firing over 1,300 career diplomats and civil servants in line with a dramatic reorganization plan initiated by the Trump administration earlier this year. A senior State Department official said Friday the department is sending layoff notices to 1,107 civil servants and 246 foreign service officers with domestic assignments in the United States. While lauded by President Donald Trump's administration as overdue and necessary to make the department leaner and more efficient, the cuts have been roundly criticized by current and former diplomats who say they will weaken U.S. influence and its ability to counter existing and emerging threats abroad.",
      "publishedAt": "2025-07-11T11:29:32Z",
      "title": "State Department laying off 1,300 staffers under Trump plan",
      "url": "https://apnews.com/article/layoffs-diplomats-state-department-trump-rubio-bfdb86767b7bd5b6570819d404a7782e",
      "urlToImage": "https://dims.apnews.com/dims4/default/fab6f77/2147483647/strip/true/crop/7632x4293+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F12%2Fbb36e8e47bc3677cddfba58d89aa%2Fc3d65919cb014d26936ecc18b1c6546a"
    },
    {
      "author": null,
      "description": "A federal judge in New Hampshire says he will certify a class action lawsuit including all children who will be affected by President Donald Trump’s executive order ending birthright citizenship and issue a preliminary injunction blocking it. The judge announced his decision Thursday after an hour-long hearing and said a written order will follow. He says the order will include a seven-day stay to allow for appeal. Plaintiffs originally sought to include parents as plaintiffs.",
      "publishedAt": "2025-07-10T04:01:25Z",
      "title": "New Hampshire judge to pause Trump’s birthright citizenship order",
      "url": "https://apnews.com/article/birthright-citizenship-classaction-lawsuit-055227e3f219fd890c78cd21c89fd5d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/8e08f48/2147483647/strip/true/crop/5533x3112+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F11%2F023b54efde6b27cd04e746ad9429%2Fad15bb51227c47edb926cda9a4d1f7e1"
    },
    {
      "author": null,
      "description": "A federal judge in New Hampshire has blocked President Donald Trump’s executive order ending birthright citizenship. The ruling, issued Thursday, prohibits the order from taking effect nationwide but allows a seven-day stay for appeal. Birthright citizenship, rooted in the 14th Amendment, grants U.S. citizenship to anyone born on American soil, regardless of their parents' legal status. Trump’s order, signed in January, challenges this principle, calling it a “magnet for illegal immigration.” Legal battles over the order are ongoing, with experts predicting the case will reach the U.S. Supreme Court. The issue could have significant implications for immigration and constitutional law.",
      "publishedAt": "2025-06-27T22:08:52Z",
      "title": "What's next for President Donald Trump's birthright citizenship order in the courts",
      "url": "https://apnews.com/article/birthright-citizenship-trump-supreme-court-next-steps-11ce3a0dfe3a30c0ee1b67b92a322f01",
      "urlToImage": "https://dims.apnews.com/dims4/default/9893ca4/2147483647/strip/true/crop/5852x3292+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Fb7%2F4dd8767c4a1b8b29e8ea4bab7079%2F0fb8f52ab1c54ed9a86eb37a79b4996c"
    },
    {
      "author": null,
      "description": "Brazilian President Luiz Inácio Lula da Silva says he will impose retaliatory tariffs on the United States if President Donald Trump follows through on a pledge to boost import taxes by 50%. Lula’s comments raise the risk of a tariffs war erupting between the two countries, similar to what has happened between the U.S. and China. Trump has vowed to respond forcefully if countries seek to punish the U.S. The letter that Trump sent to Brazil on Wednesday railing against the “witch hunt” trial against former President Jair Bolsonaro opened up a new front in his trade wars.",
      "publishedAt": "2025-07-10T20:57:18Z",
      "title": "Brazil vows retaliation if Trump imposes 50% tariff over Bolsonaro",
      "url": "https://apnews.com/article/brazil-trump-tariffs-bolsonaro-lula-us-d45722a041324a732fe0435000360745",
      "urlToImage": "https://dims.apnews.com/dims4/default/88a2a3a/2147483647/strip/true/crop/6962x3916+0+362/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F12%2F9b6763367d22aa2256c2659fe217%2F1ebe6e9a55a54b959dfb4e73da901c47"
    },
    {
      "author": null,
      "description": "Fighters with a Kurdish separatist militant group that has waged a decades-long insurgency in Turkey have begun laying down their weapons in a symbolic ceremony Friday in northern Iraq, the first concrete step toward a promised disarmament as part of a peace process. The Kurdistan Workers’ Party, or PKK, announced in May it would disband and renounce armed conflict, ending four decades of hostilities. The move came after PKK leader Abdullah Öcalan, who has been imprisoned on an island near Istanbul since 1999, urged his group in February to convene a congress and formally disband and disarm.",
      "publishedAt": "2025-07-11T09:14:32Z",
      "title": "PKK fighters begin disarmament in northern Iraq",
      "url": "https://apnews.com/article/pkk-kurdish-iraq-turkey-peace-process-disarmament-b91f6eac4794767fee2d3288fcb343d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/96bdf82/2147483647/strip/true/crop/5092x2864+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F66%2Fb5c4c6766011ca6d4a393c6dbcbe%2F1b26db4578e34ef9bf9be0ad6244fa88"
    },
    {
      "author": null,
      "description": "A Gallup poll shows a substantial jump in the share of Americans who view immigration as positive for the U.S. since President Donald Trump took office. About 8 in 10 U.S. adults say immigration is a \"good thing,” marking a 25-year high. The poll finds the share of Americans wanting U.S. immigration reduced has dropped from 55% to 30% in the past year, largely driven by Republicans becoming more content with the country's immigration levels. Americans have grown less supportive of deporting immigrants in the country illegally and more supportive of pathways to citizenship for those brought to the U.S. illegally as children. These shifting attitudes could complicate Trump’s push for sweeping deportations.",
      "publishedAt": "2025-07-11T11:02:25Z",
      "title": "Views on immigration are more positive since Trump took office",
      "url": "https://apnews.com/article/immigration-polling-trump-deportation-d138992f803e2d0b5b399aa9eaa36581",
      "urlToImage": "https://dims.apnews.com/dims4/default/aba3433/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fa2%2F2b5203c7c5921b802dd733aedc53%2F82892295f62e4871ae3da788c39b4dbb"
    },
    {
      "author": null,
      "description": "The Trump administration says it will restrict immigrants in the country illegally from enrolling in Head Start, a federally funded preschool program. The move is part of a broad effort to limit access to federal benefits for immigrants who lack legal status. People in the country illegally are largely ineligible for federal public benefits such as food stamps, student loans and financial aid for higher education. But for decades they have been able to access some community-level programs such as Head Start and community health centers. The changes were announced Thursday by the Health and Human Services department.",
      "publishedAt": "2025-07-10T22:44:31Z",
      "title": "Trump to cut off Head Start for immigrants in US illegally",
      "url": "https://apnews.com/article/trump-head-start-immigrants-rfk-d10a3b8fa77d37e6e54106ef1db45888",
      "urlToImage": "https://dims.apnews.com/dims4/default/a002afc/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fee%2Fe834438f67e725a9a76f0eeb10fa%2Faf4dbc0889eb4029ac2a2d4852473eff"
    },
    {
      "author": null,
      "description": "Grammy-winning singer Chris Brown has pleaded not guilty to two further charges related to the serious beating of a music producer with a bottle in a London nightclub in 2023. Brown on Friday pleaded not guilty to assault causing actual bodily harm to Abraham Diaw at the Tape nightclub in the swanky London neighborhood of Mayfair in February 2023. He denied having an offensive weapon — a bottle — in a public place during the hearing at Southwark Crown Court. Co-defendant Omololu Akinlolu also denied actual bodily harm on Friday. Brown denied the more serious charge of attempting to cause grievous bodily harm at a hearing last month.",
      "publishedAt": "2025-07-11T10:04:36Z",
      "title": "Singer Chris Brown pleads not guilty to 2 further charges over London nightclub assault case",
      "url": "https://apnews.com/article/chris-brown-assault-london-c3307986d2706c5ad905500ac57f4b7e",
      "urlToImage": "https://dims.apnews.com/dims4/default/faa4bda/2147483647/strip/true/crop/3528x1985+0+184/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F7f%2F989b6e5056c0192ad31a54586cee%2Fca18caaeb0c143e88c0546407d2d50f1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}