{
  "articles": [
    {
      "author": "Matthew Daly",
      "description": "The Environmental Protection Agency has revoked a key scientific finding that supported U.S. regulations on greenhouse gas emissions. This decision rescinds a 2009 declaration that carbon dioxide and other gases endanger public health. EPA Administrator Lee Zeldin announced the move Thursday, calling it a major deregulatory action. Critics argue it undermines efforts to combat climate change and could lead to more pollution. Environmental groups are certain to challenge the action in court. The EPA also proposes delaying a Biden-era rule on vehicle emissions, which could impact the push for electric vehicles.",
      "publishedAt": "2026-02-12T18:44:01Z",
      "title": "The EPA revokes a key legal underpinning in fighting climate change",
      "url": "https://apnews.com/article/trump-climate-change-epa-clean-air-act-c149d5ea6ec71c862e6c4b578adf92cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/b00eaf1/2147483647/strip/true/crop/4000x2665+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2F4b%2F970dd0fc24387367cc6cf22175b1%2F6908626a20ef489295804f2176d83dfe"
    },
    {
      "author": "Steve Karnowski",
      "description": "Federal officials have announced an end to an immigration crackdown in Minnesota that led to mass detentions, protests and two deaths. Border czar Tom Homan made the announcement during a news conference Thursday. U.S. Immigration and Customs Enforcement launched Operation Metro Surge on Dec. 1. Federal authorities say the sweeps focused on the Minneapolis-St. Paul metro area have led to the arrest of more than 4,000 people. While the Trump administration has called those arrested “dangerous criminal illegal aliens,” many people with no criminal records, including children and U.S. citizens, have also been detained.",
      "publishedAt": "2026-02-12T14:20:30Z",
      "title": "Border czar Homan says Minnesota immigration crackdown is ending",
      "url": "https://apnews.com/article/minnesota-metro-surge-ice-523d18d5d75c81cbf9f24c602f1884ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/e825aa2/2147483647/strip/true/crop/3049x2032+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2Ff9%2Fd641136d884ef26230d672b9842b%2F6a048ebf299a4981a66a184e094cfcda"
    },
    {
      "author": "Mary Clare Jalonick, Kevin Freking",
      "description": "A shutdown for the Department of Homeland Security appears certain. Lawmakers in the House and Senate are set to leave Washington for a 10-day break, while negotiations with the White House over Democrats’ demands for new restrictions have stalled. The White House and Democrats have traded offers in recent days. Democrats have said they want curbs on President Donald Trump’s broad campaign of immigration enforcement. They've demanded better identification for Immigration and Customs Enforcement and other federal law enforcement officers, a new code of conduct for those agencies and more use of judicial warrants, among their requests.",
      "publishedAt": "2026-02-12T19:25:31Z",
      "title": "Homeland Security shutdown seems certain",
      "url": "https://apnews.com/article/homeland-security-funding-shutdown-democrats-trump-4e9c4cebd45396e77f8333fd6cc31944",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef8f07b/2147483647/strip/true/crop/7586x5055+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F65%2F250e85dc11750fd80f2049c7953c%2F993c3e97a35a458493fb980b83c2a94d"
    },
    {
      "author": "Ty ONeil",
      "description": "Investigators are pleading with people to share home surveillance camera footage from specific dates leading up to the disappearance of Nancy Guthrie as they deal with thousands of tips in their hope to crack the case. Guthrie, the 84-year-old mother of “Today” show host Savannah Guthrie, has been missing from her Tucson-area home since Feb. 1. News stations in Tucson reported Wednesday that people with Ring doorbell cameras in the area got an alert saying investigators are requesting footage from Jan. 11 between 9 p.m. and midnight. The stations also reported that a pair of black gloves were recovered during agents’ search and have been submitted for DNA analysis.",
      "publishedAt": "2026-02-12T15:08:28Z",
      "title": "Investigators seek neighbors' security videos in Nancy Guthrie case",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-arizona-2765739e230d89d2d01dce62e064c33b",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d773c3/2147483647/strip/true/crop/1476x983+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2Fe1%2F65e8c9e0352e1c0d5c3e30adc7b6%2Fa060c474f9604f07af89b9e431081fcc"
    },
    {
      "author": null,
      "description": "The remote Canadian community of Tumbler Ridge is mourning after a mass shooting in killed eight people, mostly children, plus the shooter. Residents of the British Columbia have been building a memorial with lights and stuffed animals and gathered late Wednesday for a cold vigil. Police say the suspect, 18-year-old Jesse Van Rootselaar, died from an apparent self-inflicted wound. Authorities say police had visited her home before for mental health checks. Police say she first killed her mother and stepbrother, then attacked the nearby school. The motive remains unclear. Prime Minister Mark Carney says Canada mourns with the town.",
      "publishedAt": "2026-02-12T15:13:36Z",
      "title": "Remote Canadian community of Tumbler Ridge grapples with aftermath of mass shooting",
      "url": "https://apnews.com/article/canada-school-shooting-british-columbia-bef756c3d04d26b76c49a4e2b5154002",
      "urlToImage": "https://dims.apnews.com/dims4/default/76ed478/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F10%2Feea547b0b2fd1be68816ca623f5a%2Fa4f2cf691d6b4edaa94435325a9a45df"
    },
    {
      "author": "Michael Kunzelman",
      "description": "A federal judge has temporarily blocked the Pentagon from punishing Democratic Sen. Mark Kelly, a former U.S. Navy pilot, for participating in a video that called on troops to resist unlawful orders. U.S. District Judge Richard Leon ruled Thursday that Pentagon officials have violated Kelly’s First Amendment free speech rights. Kelly, who represents Arizona, sued in federal court to block his Jan. 5 censure from Defense Secretary Pete Hegseth. In November, Kelly and five other Democratic lawmakers appeared on a video in which they urged troops to uphold the Constitution and not to follow unlawful military directives from the Trump administration.",
      "publishedAt": "2026-02-12T17:57:31Z",
      "title": "Judge temporarily blocks Pentagon from punishing Kelly over video",
      "url": "https://apnews.com/article/pentagon-kelly-hegseth-illegal-orders-lawsuit-f028eade00c78123263bc3e28b3caa0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/dc2ab79/2147483647/strip/true/crop/5792x3859+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F46%2Fc77d06851abb16f969755755f3eb%2F6f582397a1c24ee1a7ff38144f79448c"
    },
    {
      "author": "Juliet Linderman, Claire Galofaro",
      "description": "The Virginia Supreme Court has ruled that a U.S. Marine and his wife will keep an Afghan orphan they brought home in defiance of the U.S. government’s decision to reunite her with her Afghan family. The ruling likely ends a bitter, yearslong legal battle over the girl’s fate. Four justices on the Virginia Supreme Court on Thursday signed onto an opinion reversing two lower courts’ rulings that found the adoption was so flawed it was void from the moment it was issued. The justices wrote that a Virginia law that cements adoption orders after six months bars the child’s Afghan relatives from challenging the court, no matter how flawed its orders and even if the adoption was obtained by fraud.",
      "publishedAt": "2026-02-12T19:51:42Z",
      "title": "Court rules US Marine's adoption of an Afghan war orphan will stand",
      "url": "https://apnews.com/article/afghan-baby-adoption-marine-virginia-3703a5a979633bcd000e537e6eb1f5ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/8624ca4/2147483647/strip/true/crop/4404x2935+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F65%2Fef222e8ca8e96a33d4c04c547cc3%2Fdbe4610cdc8a4bc796973180607d5a26"
    },
    {
      "author": "Eric Tucker, Alanna Durkin Richer",
      "description": "Republican House Speaker Mike Johnson said Thursday that he did not think it was appropriate for the Justice Department to be tracking the search history of lawmakers who are reviewing files from the Jeffrey Epstein investigation. The rare rebuke to the Trump administration came as photographs emerged revealing an apparent catalog of records reviewed by a Democratic member of Congress who was among a group of lawmakers given an opportunity to read less-redacted versions of the Epstein files at a department annex and on department-owned computers. The Justice Department said in a statement that, as part of the process of permitting lawmakers to review the Epstein files, it “logs all searches made on its systems to protect against the release of victim information.”",
      "publishedAt": "2026-02-12T15:41:59Z",
      "title": "Democrats accuse Justice Department of 'spying' on lawmakers reviewing Epstein files",
      "url": "https://apnews.com/article/epstein-files-bondi-raskin-13eeb9ccadcc03ba34922d8ba95ce220",
      "urlToImage": "https://dims.apnews.com/dims4/default/589f060/2147483647/strip/true/crop/4000x2665+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F67%2F732d1bfb9cde38fcf7d060eb7e33%2Fa34e5f5315384394bb68444b5abf426d"
    },
    {
      "author": "Michael Phillis",
      "description": "A new study says genetic testing can speed the return of the American chestnut tree that once dominated Eastern U.S. forests. The tree was functionally extinct by the 1950s because of a fungal blight and root rot. Researchers want the height and character of the American chestnut with the disease resistance of the shorter, Chinese chestnut. Their work found that resistance involves many genes, not one. Genetic screening helps pick the best seedlings, and faster. Some experts say gene editing would make the process even faster, while others worry that hybrids will never fully replace a true American chestnut.",
      "publishedAt": "2026-02-12T19:00:41Z",
      "title": "To resurrect venerable American chestnuts, scientists turn to genetic testing",
      "url": "https://apnews.com/article/chestnut-genome-extinction-tree-6643cd14b0bc130c27133fce60932270",
      "urlToImage": "https://dims.apnews.com/dims4/default/55a982f/2147483647/strip/true/crop/4500x2998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F4d%2Ff24c3f2223a353887fe4ef932cdf%2F8999ad069a784982b3dc03b8c4077974"
    },
    {
      "author": "James Ellingworth",
      "description": "It's a day marked by a comeback and controversy at the Milan Cortina Olympics. Federica Brignone won a gold medal in the women's super-G to complete one of skiing's all-time great recoveries after badly breaking her leg a year ago. Vladyslav Heraskevych of Ukraine has been excluded from the Olympics after refusing to give up his plan to race in a helmet commemorating athletes who have been killed since Russia invaded his country. The International Olympic Committee says it breaks rules against making statements on the field of play. Later Thursday, Chloe Kim seeks a halfpipe three-peat for the United States.",
      "publishedAt": "2026-02-12T14:09:23Z",
      "title": "Federica Brignone completes dramatic comeback at Olympics",
      "url": "https://apnews.com/article/winter-olympics-roundup-thursday-3b75e5036f989b705ef0aaab3d8bdea8",
      "urlToImage": "https://dims.apnews.com/dims4/default/708da30/2147483647/strip/true/crop/2034x1355+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2F2b%2F5123d6c2265aca26477b09e38f0d%2F14be1cbecbe14a1cb65a822d0b0ef828"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}