{
  "articles": [
    {
      "author": null,
      "description": "Israel and Iran have struck at one another again a week into their war as President Donald Trump weighs U.S. involvement and new diplomatic efforts appear to be taking place. Iran’s Foreign Minister Abbas Araghchi appeared to be heading to Geneva on Friday for meetings with diplomats from the European Union, United Kingdom, France and Germany. Trump has been weighing whether to attack Iran by striking a uranium enrichment facility so deeply buried it is considered safe from all but America’s “bunker-buster” bombs.",
      "publishedAt": "2025-06-20T07:18:49Z",
      "title": "Israel and Iran strike one another a week into their war",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-gaza-news-06-20-2025-8adbedb3427a76be7dbde4a18a05f75f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b8adebd/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F99%2Ff34e7187f00c631e942245e5e560%2F57addb32c5aa4c1c9c43894f020ff905"
    },
    {
      "author": null,
      "description": "Israel and Iran exchanged strikes a week into their war Friday as new diplomatic efforts appeared to be underway. Iranian Foreign Minister Abbas Araghchi is believed to be airborne on the way to the first face-to-face negotiations he has conducted since the Israeli airstrikes began June 13. He is scheduled to meet with European diplomats in Geneva on Friday. Washington-based group Human Rights Activists says a week of Israeli strikes on Iran have killed at least 657 people and wounded 2,037 others.",
      "publishedAt": "2025-06-20T07:56:01Z",
      "title": "The Latest: Israeli airstrikes reach into Iranian city of Rasht",
      "url": "https://apnews.com/article/israel-palestinians-iran-war-latest-06-20-2025-7c3307c446da24fb8f8ac038e93b9b85",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7ea686/2147483647/strip/true/crop/8388x4718+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F78%2F81a6f5a20e05219ad848122b829a%2F083c0fef13bd409db5e6f70c4c05a076"
    },
    {
      "author": null,
      "description": "Authorities in southern Mexico were still assessing damage and watching rising rivers as rain from the remnants of Hurricane Erick doused the region. Authorities reported landslides, blocked highways, downed power lines and some flooding. At least one death was confirmed late Thursday, a 1-year-old boy who drowned in a swollen river. Acapulco residents and remaining tourists emerged to walk outside or visit the few open businesses as the remnants of Hurricane Erick scraped by just inland of the resort.",
      "publishedAt": "2025-06-20T04:51:56Z",
      "title": "Mexico assesses damage from Hurricane Erick as rising rivers leave at least 1 dead",
      "url": "https://apnews.com/article/hurricane-erick-mexico-acapulco-pacific-storm-rain-8b41231526c16b4c736cc741f3b6c786",
      "urlToImage": "https://dims.apnews.com/dims4/default/d998b37/2147483647/strip/true/crop/5078x2856+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F8c%2F1c89dedfdb8133fa552398844e89%2F4240a364b1d3483392a5098321aeadf0"
    },
    {
      "author": null,
      "description": "Amena Namjoyan arrived on the Greek island of Lesbos as part of a migration crisis that would rock the European Union. She spent months in an overcrowded camp. She struggled with illness and depression. She moved to Germany but eventually returned to Lesbos. She works at a restaurant, preparing Iranian dishes that locals devour. Islanders say this is part of Lesbos' legacy, helping outsiders in need. The migration crisis peaked from 2015 to 2016, and 10 years later the fallout still reverberates on the island and beyond. Migration policy in Europe has shifted toward deterrence. Far fewer people are arriving illegally. Officials and politicians maintain that strong borders are needed. Critics say enforcement has gone too far and violates fundamental EU values.",
      "publishedAt": "2025-06-20T04:11:05Z",
      "title": "10 years after Europe's migration crisis, the fallout remains",
      "url": "https://apnews.com/article/greece-lesbos-migration-european-union-0baa65ce50a9e19c2680e684533d2fed",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c17ffd/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2Fe0%2F83b2bfb2dcd1d7904948224d70fe%2F333c4e29080f43e29e3b99a45f5c0f8c"
    },
    {
      "author": null,
      "description": "More than 300,000 refugees in the Kakuma camp in remote Kenya have had their food rations cut in half. And now the monthly cash transfers to buy proteins and vegetables to supplement them are gone. Funding for the U.N. World Food Program has dropped after the Trump administration paused support in March. It's part of the widespread dismantling of foreign aid by the United States, once the world’s biggest donor. Some refugees are surviving on one meal a day. Some malnourished babies arrive too late at a local hospital and die within hours. Workers fear they will see more.",
      "publishedAt": "2025-06-20T04:22:13Z",
      "title": "Food rations are halved in one of Africa's largest refugee camps after US aid cuts",
      "url": "https://apnews.com/article/kenya-refugees-kakuma-funding-hunger-trump-8fc82dcca596ba5ef17434b0208d6b04",
      "urlToImage": "https://dims.apnews.com/dims4/default/169bd82/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2Fd7%2Fea8fc6eb7f324995af8233b0248e%2Fc1bb0ecf18ed45859d706d4724f4a237"
    },
    {
      "author": null,
      "description": "British lawmakers have begun debating whether to back a bill to help terminally ill adults end their lives in England and Wales. The vote Friday could be one of the most consequential social decisions they will ever make. It's potentially the biggest change to social policy since abortion was legalized in 1967. Members of Parliament approved assisted dying when they first debated the issue in November by a 330-275 vote. It since has undergone months of scrutiny leading to some changes in the proposed legislation that has been shepherded through Parliament by Labour lawmaker Kim Leadbeater rather than the government.",
      "publishedAt": "2025-06-20T06:06:27Z",
      "title": "UK lawmakers to vote on assisted dying legislation",
      "url": "https://apnews.com/article/britain-assisted-dying-parliament-vote-f8d2986e8e3fa6afb1b8bd2cf19ba5e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/fde6c42/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fb0%2Ffafb837234bd13c437b56dc4f6e4%2F3a04170ed1bc49718b4c21260a2105ba"
    },
    {
      "author": null,
      "description": "President Donald Trump honored Juneteenth in each of his first four years as president, before it became a federal holiday. He even claimed once to have made Juneteenth “very famous.” But on this year's Juneteenth holiday on Thursday, Trump kept silent about a day important to Black Americans for marking the end of slavery in the country he leads again. The president had been expected to issue a proclamation about Juneteenth but White House press secretary Karoline Leavitt told reporters she wasn't tracking that. She declined to say whether Trump would recognize the occasion another way or on another day.",
      "publishedAt": "2025-06-19T20:44:51Z",
      "title": "Trump is silent about Juneteenth holiday",
      "url": "https://apnews.com/article/trump-juneteenth-slavery-statement-holiday-28afec7cd532295437d53d3ec29f549f",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e287a9/2147483647/strip/true/crop/3861x2172+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F35%2F3b0234213b2528d010f80b38eb15%2F6c03cfacfca741d38d688b94b879b969"
    },
    {
      "author": null,
      "description": "Democrats in Virginia have built up a big fundraising advantage in this year's race for governor. It's an election seen as a bellwether for the 2026 midterms. The Democratic nominee is Abigail Spanberger, a congresswoman who is a former CIA case officer. She has a more than 2-to-1 fundraising edge over the Republican candidate, Lt. Gov. Winsome Earle-Sears. Virginia and New Jersey are the two states with statewide elections this year. The Democrats’ fundraising lead may reflect Democratic enthusiasm and the party's ability to push voters to the polls.",
      "publishedAt": "2025-06-20T04:06:50Z",
      "title": "Democrats in Virginia have big fundraising advantage in the governor's race",
      "url": "https://apnews.com/article/virginia-statewide-elections-governors-race-cash-raised-98d7e0ac80521aeaab14df9fba877a45",
      "urlToImage": "https://dims.apnews.com/dims4/default/0da4871/2147483647/strip/true/crop/4950x2784+0+258/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F0b%2Fdfa196981729a0d841470c2f47a7%2F4e7273a9deba4bb0b7c72f389defcf93"
    },
    {
      "author": null,
      "description": "An appeals court is allowing President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following protests over immigration raids. Thursday’s decision halts a ruling from a lower court judge who found Trump acted illegally by activating the soldiers over opposition from California Gov. Gavin Newsom. The deployment was the first by a president of a state National Guard without the governor’s permission since 1965 and the court case could have wider implications on the president’s power to deploy soldiers within the United States. Trump argued the troops were necessary to restore order, but Newsom said the move inflamed tensions and usurped local authority.",
      "publishedAt": "2025-06-20T02:40:22Z",
      "title": "Trump allowed to keep control of National Guard troops deployed to LA",
      "url": "https://apnews.com/article/los-angeles-protests-national-guard-lawsuit-ae2433fca9a2834634efefc9a545745b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1faca0/2147483647/strip/true/crop/4597x2586+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2F73%2Fb7820525444088c119a18ae0d726%2F733645c3232e4f1cb44bdf75b8e4b98a"
    },
    {
      "author": null,
      "description": "Grammy-winning singer Chris Brown has pleaded not guilty to a charge related to the serious beating of a music producer with a bottle in a London nightclub in 2023. Brown, 36, pleaded not guilty in Southwark Crown Court to one count of attempting to cause grievous bodily harm with intent. Brown’s friend and fellow musician Omololu Akinlolu, 38, who performs under the name “Hoody Baby,” pleaded not guilty to the same charge. Prosecutors said Brown and Akinlolu assaulted producer Abe Diaw at a bar in the Tape nightclub in the swanky Mayfair neighborhood.",
      "publishedAt": "2025-06-20T09:13:55Z",
      "title": "Chris Brown pleads not guilty in London assault case",
      "url": "https://apnews.com/article/chris-brown-assault-london-6e322e7992d12f8a119b24dd42c0a0cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/e81af98/2147483647/strip/true/crop/5629x3166+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2Fc3%2Fe6bc6d1e401677e420d1d5f93f5c%2F34c3d94f8819426e8442e6ceae2f4db5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}