{
  "articles": [
    {
      "author": null,
      "description": "Iran’s judiciary reports that at least 71 people were killed in Israel's attack on Tehran’s Evin prison. The attack occurred Monday and targeted several prison buildings. A judiciary spokesperson said Sunday that the dead included staff, soldiers, prisoners and visiting family members. Rights groups have raised concerns about inmate safety following the incident. Iran also confirmed Sunday that top prosecutor Ali Ghanaatkar, known for prosecuting dissidents, was among those killed. Ghanaatkar had faced criticism from human rights groups for his actions, including prosecuting Nobel Peace Prize winner Narges Mohammadi. He will be buried at a shrine in Qom.",
      "publishedAt": "2025-06-29T07:18:42Z",
      "title": "Iran's judiciary says at least 71 killed in Israel's attack on Tehran's notorious Evin prison",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-29-2025-da0d0f6e1a9bf89a30a2589e73cff2ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/bc05acf/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F47%2F7ffc348a02d9ec126bd26625eafb%2F7d46f901139d4c73b1f182cfc8e42228"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump is calling for a deal on the war in Gaza. In between posts about a Senate vote on his tax cuts and spending bill, Trump pleaded early Sunday on his social media platform Truth Social for a deal and the release of hostages. Trump has suggested a ceasefire agreement could happen within a week. An Israeli official says plans are underway for Prime Minister Benjamin Netanyahu to travel to Washington in the coming weeks, with a top adviser already heading there for discussions. In Gaza, Israel has ordered evacuations in northern areas during intensifying military operations.",
      "publishedAt": "2025-06-29T07:50:40Z",
      "title": "Signs of progress as Trump calls for a Gaza deal",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-06-29-2025-f72d5701a985213e12b1ff80d1357670",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6b9379/2147483647/strip/true/crop/7456x4194+0+389/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F3c%2F7209a7a2eb06f6c6798293190d3a%2F83ebd299747441bf97a9ea4b4e27f7f7"
    },
    {
      "author": null,
      "description": "Russia has launched its biggest aerial attack against Ukraine overnight. The escalating bombing campaign has further dashed hopes for a breakthrough in efforts to end the 3-year-old war. Ukraine’s air force says the assault involved 537 aerial weapons including drones and missiles, of which 249 were intercepted and 226 were likely jammed. The strikes targeted several regions, including western Ukraine, far from the front lines. Officials confirmed two deaths, one in Kherson and another in the Kharkiv region. Ukraine’s air force said one of its F-16 warplanes supplied by its Western partners crashed after sustaining damage while shooting down air targets. The pilot died.",
      "publishedAt": "2025-06-29T07:04:20Z",
      "title": "Ukraine says Russia launches biggest aerial attack since war began",
      "url": "https://apnews.com/article/russia-ukraine-war-biggest-aerial-attack-9fda235a9345d506cf6c796ddfa80e33",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6dce5f/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2Fb1%2F8b863b0952c4e46954f040e9ec8a%2Fukr-war-smila-attack-20250629cr-1920x1080.jpg"
    },
    {
      "author": null,
      "description": "Thousands of protesters in Serbia have rallied against President Aleksandar Vucic, demanding early parliamentary elections. The demonstration, led by university students, marked nearly eight months of anti-government protests fueled by allegations of corruption and negligence. Clashes erupted in Belgrade between protesters and riot police, resulting in dozens of arrests and injuries on both sides. Protesters accused Vucic’s government of stifling democracy and cracking down on dissent. Meanwhile, Vucic dismissed the protests, accusing opponents of inciting violence. Despite government pressure, the large turnout highlighted ongoing public discontent with Vucic’s administration, which has ruled Serbia for over a decade.",
      "publishedAt": "2025-06-28T11:39:21Z",
      "title": "Dozens of protesters detained during clashes with riot police in Serbia",
      "url": "https://apnews.com/article/serbia-protest-students-elections-vucic-5b3825302a59991c4ad4046c80e7ce45",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ba686b/2147483647/strip/true/crop/6891x3876+0+359/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F5c%2F3d9aaa91d9fa2c35fd0133739c38%2F473ec8c98e244d5697354d3a001229c5"
    },
    {
      "author": null,
      "description": "The monthlong celebration of LGBTQ+ Pride is reaching its rainbow-laden crescendo as New York and other major cities around the world host major parades and marches. Sunday’s festivities in Manhattan, the nation’s oldest and largest Pride celebration, kick off with a march that passes the landmark Stonewall Inn. In San Francisco, marchers will head down the city’s central Market Street. Chicago, Seattle, Minneapolis and Toronto, Canada are among the other major North American cities hosting Pride parades on Sunday. Organizers say this year’s events are taking a more defiant stance than in previous years in the face of rollbacks of LGBTQ+ friendly policies.",
      "publishedAt": "2025-06-29T03:57:05Z",
      "title": "NYC, San Francisco and other US cities capping LGBTQ+ Pride month with a mix of party and protest",
      "url": "https://apnews.com/article/lgbtq-pride-nyc-san-francisco-parade-protest-a4c788a137ad3ffc2717a9cd085039d3",
      "urlToImage": "https://dims.apnews.com/dims4/default/551234b/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fa1%2Fa4357555aef15b0c9c06381a5d78%2F98b209afe2234eac978225508bf0994a"
    },
    {
      "author": null,
      "description": "Pope Leo XIV is marking a feast day as the Vatican launches a new campaign to boost donations from the faithful. Leo celebrated Mass at St. Peter’s Basilica on Sunday, marking the Feast of Saints Peter and Paul, typically used for a special collection for Peter's Pence, a key fundraising initiative. The Vatican’s promotional efforts this year include videos, posters, and online donation options. Peter’s Pence funds both the Vatican's operations and papal charity work, but it has faced scandals over mismanagement. Vatican officials hope that with an American pope, donors will be reassured their money is managed and spent well.",
      "publishedAt": "2025-06-29T09:33:01Z",
      "title": "Pope Leo XIV marks feast day as Vatican launches campaign to help erase its $57-68 million deficit",
      "url": "https://apnews.com/article/vatican-peters-pence-leo-pope-c359be9fec676bb0c92e0d548c3674a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b1d7a6/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F28%2Fea3a7f691d1b51400f79ae3ee620%2F52aa2471a4ee4edf9f4f9e4cde5a0b0a"
    },
    {
      "author": null,
      "description": "The Senate is expected to grind through a rare weekend session as Republicans race to pass President Donald Trump’s package of tax breaks and spending cuts by his July Fourth deadline. Republicans are using their majorities in Congress to push aside Democratic opposition, but they've run into a series of setbacks. Senators are expected to take a procedural vote Saturday to begin debate on the bill, but the timing is uncertain and there's a long path ahead after that. Senate passage could be days away, and the bill would need to return to the House for more votes before it could reach the White House.",
      "publishedAt": "2025-06-28T12:32:38Z",
      "title": "GOP-led Congress race to pass Trump's bill by his July Fourth deadline",
      "url": "https://apnews.com/article/trump-tax-breaks-spending-cuts-senate-deadline-8c72d6db7c9725d9d56db8294012809e",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ae42a2/2147483647/strip/true/crop/5600x3150+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2Fde%2F8979ac14b646e4f3fc5f206eea66%2Fa4e90030db4e4ea29153738e748d7ff4"
    },
    {
      "author": null,
      "description": "Group and solo travelers are trickling into Afghanistan by plane, motorbike, camper van and even on bicycles. And the country’s Taliban government is more than happy to welcome them. Tourism is a vital, multi-billion-dollar industry for many countries. Afghanistan’s isolation on the international stage largely because of the Taliban's restrictions on women and girls has left much of its population mired in poverty. As the country struggles to attract foreign investment, the lucrative potential of tourism is far from lost on the government. Tourist visas are quick and easy to obtain and flights from major transit hubs such as Dubai and Istanbul operate several times a week.",
      "publishedAt": "2025-06-29T05:38:58Z",
      "title": "Afghanistan tourism is growing under the Taliban",
      "url": "https://apnews.com/article/afghanistan-tourism-growth-taliban-919a6a6b3714908603e7388f5312dcc9",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e70186/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F2c%2Fc9bab5e7508bb2bcf14092bcbffe%2F5ffd4245578541e6b6d95f4aca2c3775"
    },
    {
      "author": null,
      "description": "Some Iranians are getting arrested by immigration authorities after living decades in the United States. The Homeland Security Department hasn't released numbers but the National Iranian American Council, an advocacy group, says there has has been a surge of arrests. Mandonna “Donna” Kashanian lived in the United States for 47 years before being piked up by immigration officers this month in New Orleans. Like other Iranians, she has faced the possibility of being deported to Iran before, because of severed diplomatic relations with the U.S. Now the future appears more uncertain.",
      "publishedAt": "2025-06-29T03:59:25Z",
      "title": "Iranians who've been in the US for decades are being arrested in Trump deportation drive",
      "url": "https://apnews.com/article/iran-immigration-arrests-us-trump-deportations-9a4136657bda3a277125738807848368",
      "urlToImage": "https://dims.apnews.com/dims4/default/937a6dc/2147483647/strip/true/crop/1044x587+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F85%2F741f8ac741dccf7c0b06250302d3%2F0d397f52c9334010888db8e3d5ef0e5d"
    },
    {
      "author": null,
      "description": "Carlos Alcaraz’s first match on a grass court came just six years ago. He’s obviously a quick study. When Wimbledon gets started Monday, the 22-year-old from Spain will play in the first Centre Court match of this fortnight, an honor reserved for the previous year’s men’s champion. The contest against Fabio Fognini will open Alcaraz’s bid for a third consecutive championship at the All England Club. That’s something only four men have achieved in the Open era, which began in 1968: Bjorn Borg, Pete Sampras, Roger Federer and Novak Djokovic. Alcaraz comes in on a career-best 18-match winning streak.",
      "publishedAt": "2025-06-29T09:30:16Z",
      "title": "Carlos Alcaraz opens bid for 3rd Wimbledon title in a row",
      "url": "https://apnews.com/article/wimbledon-carlos-alcaraz-aa1576cc5425a6f0fa7d19752a7b7602",
      "urlToImage": "https://dims.apnews.com/dims4/default/bd89fd2/2147483647/strip/true/crop/5620x3161+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F48%2F8c046c5555273db6f403af0fd9f9%2F0c4e773b384d46d8a51044763a7ee4b2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}