{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB, RAVI NESSMAN and MATTHEW LEE",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — The Health Ministry run by Hamas said an Israeli airstrike on Tuesday hit a Gaza City hospital packed with wounded and other Palestinians seeking shelter, killing hundreds of people.",
      "publishedAt": "2023-10-17T04:58:59Z",
      "title": "Hamas says Israeli airstrike on Gaza hospital kills hundreds, as Biden heads to Mideast",
      "url": "https://apnews.com/e062825a375d9eb62e95509cab95b80c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af13accb7e634c4c92d8c6b5e1d3d2f1/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Republicans rejected Rep. Jim Jordan for House speaker on a first ballot Tuesday, as an unexpectedly numerous 20 holdouts denied the hard-charging ally of Donald Trump the GOP majority needed to seize the gavel.",
      "publishedAt": "2023-10-17T04:08:54Z",
      "title": "Republicans reject Rep. Jim Jordan for House speaker on the first ballot, but more voting likely",
      "url": "https://apnews.com/f2b2bf9dc834742bde93d5fc918d9940",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96c7c123aa5d4c8db1af6324affd51c3/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Former President Donald Trump returned to a New York court Tuesday to watch and deplore the civil fraud trial that threatens to disrupt his real estate empire, but he got no face-to-face encounter — for now — with the star witness against him.",
      "publishedAt": "2023-10-17T04:26:15Z",
      "title": "With Trump back at civil fraud trial, accountant testifies after key witness Michael Cohen postpones",
      "url": "https://apnews.com/067501b1d742d4dccba2521ac3262fdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d75baa32dfe443b5911bc0ca32f5c94e/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The United States has quietly delivered a small number of long-range ballistic missiles that Ukraine said it urgently needed and that President Joe Biden promised last month, Ukrainian President Volodymyr Zelenskyy confirmed Tuesday, saying they were used on the battlefield against Russia and “executed very accurately.”",
      "publishedAt": "2023-10-17T14:27:44Z",
      "title": "Ukraine uses US-provided long-range ATACMS missiles against Russian forces for the first time",
      "url": "https://apnews.com/5fd95f32449d14da22b82d57d6ccab22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5c230fd917d411abbe9ee9de437b445/3000.jpeg"
    },
    {
      "author": "LORNE COOK, SYLVAIN PLAZY and RAF CASERT",
      "description": "BRUSSELS (AP) — Authorities in the Belgian capital shot and killed a Tunisian national on Tuesday hours after they say he gunned down three Swedish soccer fans, killing two of them, and posted a video online in which he claimed credit for the attack and said the Quran was “a red line for which he is ready to sacrifice himself.”",
      "publishedAt": "2023-10-17T06:14:38Z",
      "title": "Belgian police kill Tunisian man suspected of shooting 3 Swedish soccer fans, killing 2 of them",
      "url": "https://apnews.com/a81ef9502207095ebf0afdc5cac5676a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0cce31a71654a8287492e2e85abd434/1920.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "Are 3D mammograms better than standard 2D imaging for catching advanced cancers?A clinical trial is recruiting thousands of volunteers — including a large number of Black women who face disparities in breast cancer death rates — to try to find out.",
      "publishedAt": "2023-10-17T13:13:39Z",
      "title": "Breast cancer is deadlier for Black women. A study of mammograms could help close the gap",
      "url": "https://apnews.com/62ed31ae0b53fd7825897654482114b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d2cbd5744344adabd14c1411a3d6a01/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "A broken rail caused a train derailment that collapsed a bridge over an interstate highway in Colorado, killing a truck driver and blocking the road for days, federal authorities said Tuesday, based on their preliminary investigation.",
      "publishedAt": "2023-10-17T17:16:18Z",
      "title": "Broken rail caused Colorado train derailment that collapsed bridge, preliminary findings show",
      "url": "https://apnews.com/f43838a0598afac233ff9aa50ff143cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b137d43e2f74765ab6969defc14987f/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — Special prosecutors said Tuesday they are seeking to recharge actor Alec Baldwin in the 2021 fatal shooting on a Western movie set in New Mexico by presenting evidence to a grand jury.",
      "publishedAt": "2023-10-17T18:35:38Z",
      "title": "Prosecutors seeking to recharge actor Alec Baldwin in fatal shooting on movie set",
      "url": "https://apnews.com/f337b3bdc267d30fef67bb7946d738e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a1eedfac788421b8798926f4e86b6c8/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "COLUMBIA, S.C. (AP) — An appeals court in South Carolina is allowing Alex Murdaugh to ask a judge to throw out his murder convictions and life sentence and get a new trial after his lawyers accused the court clerk in his trial of influencing the jury.",
      "publishedAt": "2023-10-17T16:15:38Z",
      "title": "Appeals court allows Alex Murdaugh to argue for new trial because of possible jury tampering",
      "url": "https://apnews.com/9ea1968eda79dabd9f731077e5f2f33a",
      "urlToImage": ""
    },
    {
      "author": "RICHARD LARDNER, TRENTON DANIEL and AARON KESSLER",
      "description": "WASHINGTON (AP) — Donald Trump’s political fundraising machine is raking in donations at a prodigious pace, but he’s spending tens of millions of dollars he’s bringing in to pay attorneys to deal with the escalating costs of the various criminal cases he is contending with as he moves further into the 2024 presidential campaign.",
      "publishedAt": "2023-10-17T04:18:48Z",
      "title": "Lawyers, Trump and money: Ex-president spends millions in donor cash on attorneys as legal woes grow",
      "url": "https://apnews.com/2e06de2a8a90b3752e7758dfea56a509",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c566e4c8eb34b018826c0d538accf70/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}