{
  "articles": [
    {
      "author": "ALI SWENSON and GARY FIELDS",
      "description": "CHARLOTTESVILLE, Va. (AP) — Few elections in the nation’s history have provided such a divide as this year's, with the two major candidates and so many of their supporters saying the outcome will determine the fate of the country and whether it can hold to its democratic moorings.",
      "publishedAt": "2024-10-31T04:10:17Z",
      "title": "US voters hear a stark message in the presidential race: The country's fate is on the line",
      "url": "https://apnews.com/17a9fcaf68ab8c1b7d12552d973937d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0bbc8377e4f422a8d4833d37ecf3649/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and COLLEEN LONG",
      "description": "MADISON, Wis. (AP) — Kamala Harris said Thursday that Donald Trump's comment that he would protect women “whether the women like it or not” showed that the Republican presidential nominee does not understand women's \"agency, their authority, their right and their ability to make decisions about their own lives, including their own bodies.”",
      "publishedAt": "2024-10-31T15:48:42Z",
      "title": "Kamala Harris says Trump's comments on women 'are offensive to everybody'",
      "url": "https://apnews.com/f5903d49488ebc733d7ba5812b36f935",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acdd3d59f77647fe879515f056eada2b/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and SUSAN MONTOYA BRYAN",
      "description": "ALBUQUERQUE, N.M. (AP) — Donald Trump is traveling to New Mexico and Virginia in the campaign's final days, taking a risky detour from the seven battleground states to spend time in places where Republican presidential candidates have not won in decades.",
      "publishedAt": "2024-10-31T12:22:34Z",
      "title": "Donald Trump gambles with late-stage trips to Democratic New Mexico and Virginia",
      "url": "https://apnews.com/55502679ef9df70306d10e0a431a3d69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99040f3f18f7449980f9ac1ce0208736/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN, JULIA FRANKEL and FADI TAWIL",
      "description": "TEL AVIV, Israel (AP) — Rockets fired from Lebanon killed two more people in northern Israel on Thursday, Israeli medics said, raising the death toll there to seven in what marked the deadliest strikes to hit Israel since its military invaded southern Lebanon earlier this month.",
      "publishedAt": "2024-10-31T11:51:27Z",
      "title": "Israel says another rocket barrage from Lebanon kills 2 in Israel, hours after 5 were killed",
      "url": "https://apnews.com/5554f469d1ac348c8da19b7faa3e5fbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b36e150bc99424fb9cf484a067acc4b/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — The family WhatsApp group chat buzzed with constant messages. Israel was escalating its airstrikes on villages and towns in southern Lebanon.",
      "publishedAt": "2024-10-31T04:56:40Z",
      "title": "A Lebanese family planning for a daughter's wedding is killed in an Israeli strike on their home",
      "url": "https://apnews.com/833dd81ade675384bc4dfc0434cef554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d7d94ede0f44062a80535f55494fef0/1067.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — Billions of dollars in advertising are raining down on voters across the Rust Belt, Rocky Mountains and American southwest as the two major political parties portray their opponent's candidates as extreme in a struggle for control of the U.S.",
      "publishedAt": "2024-10-31T13:03:06Z",
      "title": "The struggle for Senate control goes down to the wire as spending shatters records",
      "url": "https://apnews.com/32f653b47ab80ce67bd9204342b2253a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a825b0a682de45248be9a66f35b13dc4/3000.jpeg"
    },
    {
      "author": "ALBERTO SAIZ, JOSEPH WILSON and TERESA MEDRANO",
      "description": "BARRIO DE LA TORRE, Spain (AP) — Crews searched for bodies in stranded cars and sodden buildings Thursday as residents salvaged what they could from their ruined homes following monstrous flash floods in Spain that claimed at least 158 lives, with 155 deaths confirmed in the eastern Valencia region alone.",
      "publishedAt": "2024-10-31T08:18:41Z",
      "title": "Spain searches for bodies after unprecedented flooding claims at least 158 lives",
      "url": "https://apnews.com/30c6ef59ddf27598c691c89d0ba41442",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a00382b5abe465ea7b7405cc74e74f6/1920.jpeg"
    },
    {
      "author": "LORI HINNANT",
      "description": "ZAPORIZHZHIA, Ukraine (AP) — To be a parent in the Ukrainian front-line city of Zaporizhzhia means weighing your child’s life against the Russian weapons within striking distance.Most rain death in an instant: the drones, the ballistic missiles, the glide bombs, the artillery shells.",
      "publishedAt": "2024-10-31T04:18:24Z",
      "title": "Ukrainian front-line school system goes underground to protect against bombs and radiation",
      "url": "https://apnews.com/246975f9ac147ff4e8e6e60961f6f5e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25ce864bc107491ab9a9b48db9c5d994/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "PALO ALTO, Calif. (AP) — Google Maps is heading down a new road steered by artificial intelligence.The shift announced Thursday will bring more of the revolutionary AI technology that Google already has been baking into its dominant search engine to the digital maps service that the internet company launched nearly 20 years ago as part of its efforts to expand into new frontiers.",
      "publishedAt": "2024-10-31T14:01:31Z",
      "title": "Google Maps adds AI features to help users explore and navigate the world around them",
      "url": "https://apnews.com/bceb1ea762b3ac4a7a5a950fc4924756",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99c2638b9027411fbdf4842eeb71dd61/3000.jpeg"
    },
    {
      "author": "MIKE FITZPATRICK",
      "description": "NEW YORK (AP) — Just when it appeared Aaron Judge and the New York Yankees were right back in this World Series, they all but gave away the trophy.",
      "publishedAt": "2024-10-31T04:08:38Z",
      "title": "Yankees blow 5-run lead with epic defensive meltdown as Dodgers rally to clinch World Series",
      "url": "https://apnews.com/ff3ca215e6064c1983e4cce4f41a97e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f46d2f9c32e408581ff815ff344fc82/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}