{
  "articles": [
    {
      "author": "MATTHEW LEE",
      "description": "TEL AVIV, Israel (AP) — U.S. Secretary of State Antony Blinken said Monday that Israel has accepted a proposal to bridge differences holding up a cease-fire and hostage release in Gaza, and he called on Hamas to do the same, without saying whether it had addressed concerns cited by the militant group.",
      "publishedAt": "2024-08-19T06:38:11Z",
      "title": "Blinken says Israel agrees to a U.S.-backed proposal for a cease-fire and calls on Hamas to do same",
      "url": "https://apnews.com/34f91f99c9a4f63e98134aaecb7af971",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d03eeebfa084ee69cccfaa66229997a/1920.jpeg"
    },
    {
      "author": "ALEX BABENKO",
      "description": "POKROVSK, Ukraine (AP) — Civilians with small children in their arms and lugging heavy suitcases fled Monday from Ukraine’s eastern city of Pokrovsk, where the Russian army was bearing down fast despite a lightning Ukrainian incursion into Russia’s Kursk region.",
      "publishedAt": "2024-08-19T10:26:46Z",
      "title": "Civilians flee Pokrovsk as Russia's army bears down on the key eastern Ukraine city",
      "url": "https://apnews.com/b8c4c6cc0dd81658fecdf1c83145908d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf9c3337d8554a8395e7e61cfc437794/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES, ZEKE MILLER and BILL BARROW",
      "description": "CHICAGO (AP) — A refreshed Democratic Party will take a look back while it moves forward as its convention opens Monday night, with President Joe Biden preparing a valedictory speech and delegates reveling in the newfound energy that followed Vice President Kamala Harris ′ rise to the top of the ticket.",
      "publishedAt": "2024-08-19T04:06:05Z",
      "title": "Democrats open their convention transformed by Harris' ascendance but facing lingering questions",
      "url": "https://apnews.com/0a0e65ab69a1e338d9c1f3f137a45e82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e562d83dc55540e2a19e0f154c215407/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "CHICAGO (AP) — Sixteen years ago, a triumphant Joe Biden addressed an adoring crowd at the Democratic National Convention in Denver, his smile radiating confidence about the country's future and his own journey.",
      "publishedAt": "2024-08-19T04:10:08Z",
      "title": "Biden's journey: After getting knocked down, he keeps getting back up.",
      "url": "https://apnews.com/8ffeb60a8a0cb9a15695de05d65b1f3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75236e2f03d24d0a862d2e1599071f0b/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Republicans have released their initial impeachment inquiry report on President Joe Biden, alleging an abuse of power and obstruction of justice in the financial dealings of his son Hunter Biden and family associates.",
      "publishedAt": "2024-08-19T09:22:49Z",
      "title": "House Republicans release their impeachment report on Biden but the next steps are uncertain",
      "url": "https://apnews.com/0659ac1d6bca42332647fddd0f9150fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db33eff2318c4328a5c644607ba08c2b/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "BEDMINSTER, N.J. (AP) — As Democrats kick off their convention in Chicago, Donald Trump 's campaign is trying to regain its footing after weeks of struggling to adjust to Vice President Kamala Harris at the top of the opposing ticket.",
      "publishedAt": "2024-08-19T04:08:53Z",
      "title": "Trump will campaign across the country this week as he struggles to adjust to Harris",
      "url": "https://apnews.com/48f5d991866e33af23e4494467240592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58f5b6f46aa147c4a9922d345f471309/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — British tech magnate Mike Lynch and five other people were missing after their luxury superyacht sank during a freak storm off Sicily early Monday, Italy’s civil protection and authorities said.",
      "publishedAt": "2024-08-19T07:58:46Z",
      "title": "British tech magnate Mike Lynch among those missing after luxury superyacht sinks off Sicily",
      "url": "https://apnews.com/060bf26f426708c8eb59e81d88787d11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fe23d358f44462f8753bd9cc6e90e38/1920.jpeg"
    },
    {
      "author": "DAVE COLLINS and KAREN MATTHEWS",
      "description": "OXFORD, Conn. (AP) — Torrential rain flooded parts of Connecticut and New York's Long Island, washing out roads, trapping people in cars and a restaurant, and sweeping two people into a river. Two women died in the storms, which also caused problems in New Jersey late Sunday and early Monday, authorities said.",
      "publishedAt": "2024-08-19T13:38:59Z",
      "title": "Flash floods from 'training thunderstorms' leave 2 dead in Connecticut",
      "url": "https://apnews.com/c3bce519046c3ceb7f042159efe432f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70cb5280a9104d1fac35590b13d1c8f8/1920.jpeg"
    },
    {
      "author": "MUNIR AHMED",
      "description": "ISLAMABAD (AP) — Flash floods triggered by monsoon rains swept through streets in southern Pakistan and blocked a key highway in the north, officials said Monday, as the death toll from rain-related incidents rose to 209 since July 1.",
      "publishedAt": "2024-08-19T11:02:16Z",
      "title": "Heavy rains hit Pakistan's south as this monsoon's death toll rises to 209",
      "url": "https://apnews.com/02b4432583fe9576dba64064a1c39b28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5076889f43342e5abca2e6330f5a14e/2255.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "Phil Donahue, whose pioneering daytime talk show launched an indelible television genre that brought success to Oprah Winfrey, Montel Williams, Ellen DeGeneres and many others, has died.",
      "publishedAt": "2024-08-19T13:56:16Z",
      "title": "Phil Donahue, whose pioneering daytime talk show launched an indelible television genre, has died",
      "url": "https://apnews.com/337b3630524a576407c1119f590d1dd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4398a071513e4cccb97a3b19bbb61464/2500.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}