{
  "articles": [
    {
      "author": null,
      "description": "The Israeli security cabinet is meeting Thursday evening to discuss expanding military operations in Gaza. An Israeli official says the cabinet is expected to approve a plan to gradually increase pressure on Hamas. Israel’s Chief of Staff warns this could endanger hostages and exhaust troops. Demonstrations are planned across Israel to protest the expansion. Meanwhile, Israeli authorities have returned the body of a Palestinian activist allegedly killed by an Israeli settler last week, following a hunger strike by his relatives, and aid organizations denounce Israeli policies in Gaza.",
      "publishedAt": "2025-08-07T12:06:22Z",
      "title": "Israeli security cabinet to discuss expanding military operations in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostages-gaza-08-07-2025-b92e0e4947061ed89bfc6782c4067896",
      "urlToImage": "https://dims.apnews.com/dims4/default/35e62b3/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2F83%2Feeb8d13a471c8572af0014b3fb99%2Ff5d67a81a139475aa5dff24df7f6bdce"
    },
    {
      "author": null,
      "description": "President Donald Trump has started imposing higher import taxes on goods from over 60 countries, including the European Union, Japan and South Korea. These tariffs, which began Thursday, are part of Trump's strategy to reduce the trade deficit and encourage foreign investment in the U.S. However, the economic impact is already visible, with signs of stalled hiring, rising inflation and declining home values. Despite the uncertainty, Trump remains optimistic about economic growth, while many experts warn of potential long-term damage.",
      "publishedAt": "2025-08-07T04:02:21Z",
      "title": "Trump's broad tariffs go into effect, just as economic pain is surfacing",
      "url": "https://apnews.com/article/trump-tariffs-into-effect-economy-warning-signs-eafe20de9abad312573b320fd4b5fb33",
      "urlToImage": "https://dims.apnews.com/dims4/default/76528ac/2147483647/strip/true/crop/5491x3089+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2Fac%2F0a927050c5e8025388db521beb7e%2Fd73c8af454fd41b49a98072c44f6691a"
    },
    {
      "author": null,
      "description": "President Donald Trump has instructed the Commerce Department to change how the Census Bureau collects data, seeking to exclude immigrants in the United States illegally. The Republican president said Thursday the census' data collections will be based on “modern day facts and figures and, importantly, using the results and information gained from the Presidential Election of 2024.” It's an indication Trump might try to inject his politics into survey work measuring everything from child poverty to business operations. Trump stresses that as part of the changes people in the U.S. illegally will be excluded from census counts. Census changes could play into Trump's efforts to urge several Republican-led states to redraw congressional maps.",
      "publishedAt": "2025-08-07T12:02:16Z",
      "title": "Trump seeks census change excluding immigrants in US illegally",
      "url": "https://apnews.com/article/trump-census-immigration-illegal-165fe1c52cfc930521bc7e65d4b1ff41",
      "urlToImage": "https://dims.apnews.com/dims4/default/bce8239/2147483647/strip/true/crop/4216x2372+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2Fd1%2F1ecfec98efdb97c8854245f48f95%2F3daec11100c14bc3859656ea4154011d"
    },
    {
      "author": null,
      "description": "The Kremlin said Thursday that a meeting in the coming days between Russian President Vladimir Putin and U.S. President Donald Trump has been agreed on. Putin’s foreign affairs adviser Yuri Ushakov said the two sides are working on setting it up, and that a venue for the meeting has been agreed on and will be announced later. A meeting between Putin and Trump would be their first since Trump returned to office this year. It would be a significant milestone in the more than 3-year-old war, though there’s no promise such a meeting would lead to the end of the fighting, since Russia and Ukraine remain far apart on their demands.",
      "publishedAt": "2025-08-07T06:10:18Z",
      "title": "Trump to meet Putin in coming days, Kremlin says",
      "url": "https://apnews.com/article/russia-ukraine-war-poll-trump-sanctions-deadline-7cefb2df66f494f58a16b684a2c76687",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a361c5/2147483647/strip/true/crop/4855x2731+0+253/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Fd5%2F260b87d9e56efa7800fe7a2ce542%2Fc28e4655812a47e688e3620581ea22a4"
    },
    {
      "author": null,
      "description": "A senior FBI official who served as acting director in the first weeks of the Trump administration and resisted demands to turn over the names of agents who participated in the Jan. 6, 2021, investigations is being forced out of the bureau. That's according to two people familiar with the matter who spoke to The Associated Press on Thursday. The circumstances of Brian Driscoll’s ouster are unclear, but his final day is Friday. The people were not authorized to discuss the personnel move by name and spoke on the condition of anonymity. Additional ousters are possible. Spokespeople for the FBI have declined to comment. Driscoll worked international counterterrorism investigations in New York.",
      "publishedAt": "2025-08-07T16:02:48Z",
      "title": "Senior FBI official who resisted Trump demands is ousted",
      "url": "https://apnews.com/article/fbi-jan-6-patel-driscoll-f4bd75766307f558dfdbdea736e026e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/df0528e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F1f%2F2c25785ceedb65ba89224d8ac9cf%2Fd305e4133ed943bba80c76c360e9ab1c"
    },
    {
      "author": null,
      "description": "Six soldiers at a Georgia Army base are being hailed as heroes for tackling an armed assailant accused of shooting five people. Officials say Sgt. Quornelius Radford used a personal handgun to shoot five soldiers Wednesday at Fort Stewart before being tackled by other troops. Army Secretary Dan Driscoll praised the soldiers' quick actions, saying they saved lives. The wounded soldiers are stable and expected to recover. The suspect was arrested and officials are investigating the motive. This incident raises concerns about safety on military bases. The FBI is assisting with the investigation.",
      "publishedAt": "2025-08-07T14:55:12Z",
      "title": "Soldiers hailed as heroes for tackling armed assailant at Georgia Army base",
      "url": "https://apnews.com/article/georgia-army-base-shooting-fort-stewart-b8df160a33590461dc04b1125f054d42",
      "urlToImage": "https://dims.apnews.com/dims4/default/b464b0b/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2Fed%2F4cc31885409f305af9552748ee63%2F99a2e0495e784a7c8189a0027198f145"
    },
    {
      "author": null,
      "description": "Health Secretary Robert F. Kennedy Jr. says he wants to rework the U.S. program for compensating Americans injured by vaccines. The plan has long been a target of anti-vaccine groups and changing it could have far-reaching consequences for vaccine availibility. Government officials set up the program in the 1980s to limit the legal risks for vaccine makers. At the time many companies were leaving the business due to class action lawsuits. Kennedy and other critics have complained that the program shields vaccine makers from litigation and is too stingy in compensating injured patients.",
      "publishedAt": "2025-08-07T13:48:15Z",
      "title": "RFK Jr.'s vow to overhaul vaccine injury program echoes grievances of anti-vaccine movement",
      "url": "https://apnews.com/article/rfk-kenndy-vaccines-injury-compensation-lawsuit-gardasil-4a8ff2cec127d6ae7ddaf0f4f3479283",
      "urlToImage": "https://dims.apnews.com/dims4/default/12ede32/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F09%2F6a08f257fe733e63610d98373161%2F117a08b785264b4fae3131bd05d693a4"
    },
    {
      "author": null,
      "description": "A new federal report finds that most Americans get more than half their calories from ultra-processed foods. Overall, about 55% of calories consumed by Americans older than age 1 came from ultra-processed foods during August 2021 to August 2023. The top sources include burgers and sandwiches, sweet baked goods, savory snacks, pizza and sweetened drinks. Ultra-processed foods have been linked to chronic health problems. One surprising finding: Consumption of ultra-processed foods appeared to dip slightly over the past decade. One nutritionist says there may be greater awareness of the foods' potential harms.",
      "publishedAt": "2025-08-07T04:01:39Z",
      "title": "Ultra-processed foods make up a big portion of Americans' diet, CDC finds",
      "url": "https://apnews.com/article/ultraprocessed-foods-diet-cdc-9d025cd075a3b7bda2d3710da6d3f541",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e57791/2147483647/strip/true/crop/5784x3254+0+173/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F27%2F4cee0887e6e6edff280865eeca61%2Ffdcb36b1881947379a3700a6d9dc6275"
    },
    {
      "author": null,
      "description": "Stocks are drifting in mixed trading on Wall Street after President Donald Trump’s latest tariffs took effect on dozens of countries. The S&P 500 slipped 0.1% Thursday. The Dow Jones Industrial Average fell 330 points, and the Nasdaq composite rose 0.4%. Worries are still high that Trump’s tariffs are damaging the economy, particularly after last week’s U.S. jobs report. But hopes for coming cuts to interest rates and a torrent of stronger-than-expected profit reports have helped overshadow the concerns, at least for now. Stock indexes also rose across much of Asia and Europe. Treasury yields were steady in the bond market.",
      "publishedAt": "2025-08-07T05:55:00Z",
      "title": "Wall Street drifts as stock markets worldwide take Trump's new tariffs in stride",
      "url": "https://apnews.com/article/shares-markets-tariffs-china-trump-earnings-06cc62c73fb63a6246b26b651d53098c",
      "urlToImage": "https://dims.apnews.com/dims4/default/26b2944/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F65%2F5305c43dc97173e8708e62dfdf14%2Fec263125569c4d4db8adc7253b4056d7"
    },
    {
      "author": null,
      "description": "ESPN has announced its new streaming service will launch Aug. 21. This move comes as streaming surpasses cable and broadcast in U.S. TV usage. ESPN hopes to attract cord-cutters with a $29.95 monthly plan offering all ESPN networks and NFL content. The service will start with around 25 million subscribers, migrating from ESPN+. Recent deals with the NFL and WWE aim to expand ESPN's offerings and market footprint. However, ESPN faces financial challenges, with increased rights fees impacting profits. The company is launching this direct-to-consumer product to boost revenue beyond traditional cable and satellite fees.",
      "publishedAt": "2025-08-07T10:00:09Z",
      "title": "Here's what you need to know about ESPN's new steaming service and its deals with the NFL and WWE",
      "url": "https://apnews.com/article/espn-nfl-wwe-bb54d33ae71144ea5bab08070eeb2585",
      "urlToImage": "https://dims.apnews.com/dims4/default/5462c6c/2147483647/strip/true/crop/5154x2899+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F21%2Fd2%2F70fbc1d8df13d570f508d99b7f07%2Ff0e27fc814a54144a4718bafe223d7c2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}