{
  "articles": [
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — He is among the very last survivors of his Gaza family, a clan so close they knew without thinking how blood and marriage bound them across generations and city blocks.Then, branch by branch, 173 of Youssef Salem’s relatives were killed in Israeli airstrikes in a matter of days in December.",
      "publishedAt": "2024-06-17T05:15:25Z",
      "title": "The war in Gaza has wiped out entire Palestinian families. AP documents 60 who lost dozens or more",
      "url": "https://apnews.com/a9f8bcfe402c17f1f78903eae67b7a7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c529c6fa62643198f06875bc622fd83/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu dissolved the influential War Cabinet that has overseen the fighting in Gaza, a government spokesperson said Monday, a move that comes days after a key member of the body bolted from the government over frustration with the Israeli leader's handling of the war.",
      "publishedAt": "2024-06-17T09:29:50Z",
      "title": "Netanyahu dissolves influential War Cabinet after key partner bolted from government",
      "url": "https://apnews.com/76b4e165609bb3f0716c8599a83efa99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9483e4457294bf182c203292b27e2d2/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden’s reelection campaign is spending $50 million through the end of June, a blitz that includes its first television ad trumpeting Donald Trump’s felony conviction and signals that the Democratic incumbent is seeking to make his Republican opponent’s legal woes a bigger issue heading into November.",
      "publishedAt": "2024-06-17T09:01:25Z",
      "title": "Biden's campaign announces a $50 million advertising blitz highlighting Trump's conviction",
      "url": "https://apnews.com/bab63848426b8eb2134bb144dbb4d05b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b7ee026064c44e8a6ac9acd18241c32/3000.jpeg"
    },
    {
      "author": "ALI SWENSON, DAN MERICA and GARANCE BURKE",
      "description": "Adrian Perkins was running for reelection as the mayor of Shreveport, Louisiana, when he was surprised by a harsh campaign hit piece.The satirical TV commercial, paid for by a rival political action committee, used artificial intelligence to depict Perkins as a high school student who had been called into the principal’s office.",
      "publishedAt": "2024-06-17T04:04:40Z",
      "title": "AI experimentation is high risk, high reward for low-profile political campaigns",
      "url": "https://apnews.com/1d5080a5c916d5ff10eadd1d81f43dfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50d51a459396408a81f433e76ae97f20/3000.jpeg"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "The U.S. surgeon general has called on Congress to require warning labels on social media platforms similar to those now mandatory on cigarette boxes.",
      "publishedAt": "2024-06-17T11:23:32Z",
      "title": "Tobacco-like warning label for social media sought by US surgeon general who asks Congress to act",
      "url": "https://apnews.com/df321c791493863001754401676f165c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b09ea9d836a24d9aad9189063f9bd63e/3000.jpeg"
    },
    {
      "author": "BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — Maryland Gov. Wes Moore ordered more than 175,000 pardons for marijuana convictions on Monday, saying the “most sweeping state-level pardon in any state” will help reverse harms from the past caused by the war on drugs.",
      "publishedAt": "2024-06-17T06:30:47Z",
      "title": "Tens of thousands of Marylanders receive pardons for marijuana convictions",
      "url": "https://apnews.com/003a11d2435eabaa060d2d26da63ce42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbf1fbafeec64fe68e94b8abb7a354b0/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI",
      "description": "JAKARTA, Indonesia (AP) — Muslims in Asia on Monday celebrated Eid al-Adha, or the Feast of Sacrifice, with food and prayers for people in Gaza suffering from the Israel-Hamas war.",
      "publishedAt": "2024-06-17T03:01:20Z",
      "title": "Muslims in Asia celebrate Eid al-Adha with sacrifice festival and traditional feast",
      "url": "https://apnews.com/3c357a46b0329e794bbefe51fe83242c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9d27348afe0403faa87650fd149f81f/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY and ANNIE MA",
      "description": "WASHINGTON (AP) — The University of Michigan and the City University of New York did not adequately investigate complaints about antisemitic or anti-Palestinian harassment linked to campus protests over the Israel-Hamas war and other incidents, according to the results of investigations by the U.S.",
      "publishedAt": "2024-06-17T14:01:58Z",
      "title": "Michigan, CUNY didn't suitably assess if Israel-Hamas war protests made environment hostile, US says",
      "url": "https://apnews.com/5d76f2e61ddc06d75cea680ff8939ea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24a16d8270d142bea9666a66689bc44c/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — More than 70 million people in the United States were under extreme heat alerts Monday as a heat wave moved eastward, and the mid-Atlantic and New England were likely to see highs in the 90s as the week progresses.",
      "publishedAt": "2024-06-17T05:28:48Z",
      "title": "More than 70 million people in the US are under heat alerts. Go indoors and hydrate",
      "url": "https://apnews.com/43b96b6f2996b9735e8b201b8dd3cc31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/202dc979802c414699adfa41339284b3/1920.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and HOLLY RAMER",
      "description": "PORTLAND, Maine (AP) — The deadly implosion of an experimental submersible en route to the deep-sea grave of the Titanic last June has not dulled the desire for further ocean exploration, despite lingering questions about the disaster.",
      "publishedAt": "2024-06-17T04:14:26Z",
      "title": "A year after the Titan's tragic dive, deep-sea explorers vow to pursue ocean's mysteries",
      "url": "https://apnews.com/05903e98b0155b9d69249b86d3df6c89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34754493a03d403ca886c485275cb9b7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}