{
  "articles": [
    {
      "author": "Jon Gambrell",
      "description": "Talks between Iran and the United States are expected on Friday in Oman. That's according to Iranian media reports by the semiofficial ISNA and Tasnim news agencies on Wednesday. Oman did not immediately acknowledge it would host the talks. The sultanate hosted multiple rounds of earlier nuclear talks between Iran and the United States. U.S. Secretary of State Marco Rubio said Trump officials are working on maintaining a meeting this week, though the U.S. has not acknowledged the talks would take place in Oman. Rubio said he hoped to discuss a number of concerns beyond the issue of Iran's nuclear program.",
      "publishedAt": "2026-02-04T13:48:44Z",
      "title": "US-Iran talks expected Friday in Oman, Iranian media say",
      "url": "https://apnews.com/article/iran-protests-crackdown-2556ffcb5731de2753ffa044a6e2175b",
      "urlToImage": "https://dims.apnews.com/dims4/default/cfaa2d7/2147483647/strip/true/crop/1280x853+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F54%2Fd8a4a3eeefae2b3070e821c6aaa5%2Fe1d83806277a4c1dbfce2bf9172854fc"
    },
    {
      "author": null,
      "description": "President Donald Trump's border czar says the number of immigration enforcement officers in Minnesota will be seriously reduced after state and local officials agreed to cooperate by turning over arrested immigrants. Homan says about 700 federal agents will be immediately withdrawn from the immigration operation around Minnesota. Roughly 3,000 federal officers are currently deployed in the state.",
      "publishedAt": "2026-02-04T14:18:05Z",
      "title": "Homan says 700 immigration officers to immediately leave Minnesota",
      "url": "https://apnews.com/article/immigration-enforcement-drawdown-minnesota-homan-963adf341325d7f6eb5673e1c00d3c2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The Supreme Court has allowed California to use a new voter-approved congressional map that is favorable to Democrats in this year’s elections, rejecting a last-ditch plea from state Republicans and the Trump administration. The justices had previously allowed Texas’ Republican-friendly map to be used in 2026, despite a lower court ruling that it likely discriminates on the basis of race.",
      "publishedAt": "2026-02-04T19:00:58Z",
      "title": "Supreme Court allows new California congressional maps",
      "url": "https://apnews.com/article/supreme-court-california-congressional-maps-8362a34b739ea91d37a190eee1b6a6d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b21fea/2147483647/strip/true/crop/4579x3051+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2Fab%2Fd485fa5ec203a1ec8726d79e7902%2Fd55d68c6cd414e0a823ba82e5ba599f8"
    },
    {
      "author": "David Fischer",
      "description": "A man convicted of trying to assassinate President Donald Trump on a Florida golf course in 2024 has been sentenced to life in prison. U.S. District Judge Aileen Cannon pronounced Ryan Routh’s fate on Wednesday in the same Fort Pierce courtroom that erupted into chaos in September when Routh tried to stab himself shortly after jurors found him guilty of trying to kill a presidential candidate and other charges. Prosecutors asked for life without parole, saying Routh is unrepentant and has never apologized. A defense attorney brought in for his sentencing asked for 27 years, noting that Routh is already turning 60.",
      "publishedAt": "2026-02-04T05:02:11Z",
      "title": "Life sentence for man convicted of trying to assassinate Trump",
      "url": "https://apnews.com/article/trump-shooting-attempt-florida-ryan-routh-4bcddb2544bc127d6acf59b8311c458b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e5bc42/2147483647/strip/true/crop/2512x1674+22+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fc7%2Fa36e010e0a4996e65e57cddfb199%2F8184b42ad9374a3ebcde1b68d944e731"
    },
    {
      "author": "David Bauder",
      "description": "The troubled Washington Post has begun implementing large-scale cutbacks, including eliminating its sports department and shrinking the number of journalists it stations overseas. The changes were announced in a Zoom meeting with staff on Wednesday by executive editor Matt Murray. That's according to a person who listened to the call but was not authorized to speak with the media and spoke on the condition of anonymity. Staff members in the newsroom were told they'd get emails with one of two subject lines, announcing the person’s role has or hasn’t been eliminated. A total number of layoffs wasn't announced in the call. A Post representative hasn't returned a call seeking comment.",
      "publishedAt": "2026-02-04T14:27:07Z",
      "title": "Washington Post implements large-scale cuts",
      "url": "https://apnews.com/article/washington-post-staff-reduction-layoffs-cuts-923f87d4bd319c8a64b278165d0a6e27",
      "urlToImage": "https://dims.apnews.com/dims4/default/d2c3df2/2147483647/strip/true/crop/5865x3908+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2F91%2F1eb749d5cee10499735318eadbb8%2F52607db458244a398d835e85e034ec9d"
    },
    {
      "author": "Kate Brumback",
      "description": "Fulton County has filed a motion in federal court to retrieve documents from the 2020 election. The FBI seized these documents last week from a warehouse near Atlanta. The motion filed Wednesday also requests the unsealing of a law enforcement agent's sworn statement. That statement was presented to the judge who approved the search warrant. The motion isn't being released because the case is under seal. The search took place on Jan. 28 at Fulton County’s main election facility. Fulton County votes overwhelmingly Democratic. It's been a target of Donald Trump and his allies since the Republican narrowly lost the state to Joe Biden in 2020.",
      "publishedAt": "2026-02-04T14:44:25Z",
      "title": "Georgia's Fulton County wants 2020 election documents seized by FBI back",
      "url": "https://apnews.com/article/fbi-georgia-elections-fulton-county-2020-ballots-532b6daf318c79c471cd7f145c9f2215",
      "urlToImage": "https://dims.apnews.com/dims4/default/ece67d4/2147483647/strip/true/crop/2904x1935+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F02%2F8c9ef6bdffed1405ed4530a3fe3d%2F5741f01209654a5db025b33a0b549f39"
    },
    {
      "author": "Danica Kirka",
      "description": "The former Prince Andrew has moved out of his long-time home on crown-owned land near Windsor Castle earlier than expected, after the latest release of documents from the U.S. investigation of Jeffrey Epstein revived questions about his friendship with the convicted sex offender. The 65-year-old brother of King Charles III, now known as Andrew Mountbatten-Windsor, left the Royal Lodge in Windsor on Monday and is now living on the king’s Sandringham estate in eastern England. That's according to a person familiar with the matter said. British media reported that Mountbatten-Windsor will live temporarily at Wood Farm Cottage while his permanent home on the estate undergoes repairs.",
      "publishedAt": "2026-02-04T10:59:11Z",
      "title": "Former Prince Andrew moves to King Charles III's private estate",
      "url": "https://apnews.com/article/epstein-andrew-royal-lodge-1443dd1cac502d230cf446a32c2a0c59",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c39254/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fb7%2F38b47ded02eef8f6e90aea8271fc%2Fae629d6677c4436292bcb09f5c982462"
    },
    {
      "author": null,
      "description": "Israeli fire in Gaza killed at least 17 Palestinians, most of them women and children, hospital officials said Wednesday, while Israel said militant gunfire had injured an Israeli soldier. They were the latest Palestinian deaths since a ceasefire, which has been punctuated by deadly Israeli strikes, came into effect on Oct. 10, 2025. More than 530 Palestinians have been killed by Israeli fire since the deal took effect, according to Gaza’s health ministry.",
      "publishedAt": "2026-02-04T08:44:00Z",
      "title": "Israeli fire in Gaza kills 17, while militant gunfire wounds Israeli soldier",
      "url": "https://apnews.com/article/gaza-rafah-hamas-israel-war-2-4-2026-a3726ab659321430bf3ca73cae50936e",
      "urlToImage": "https://dims.apnews.com/dims4/default/0195d90/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F3e%2Ff814afa3c96d44a117007901cae1%2F5eced90106c6485992642c81b06c93cc"
    },
    {
      "author": "Jacques Billeaud, Sejal Govindarao, Mike Balsamo",
      "description": "Authorities say the search for “Today” show host Savannah Guthrie’s mother still has no suspect or person of interest, days after she disappeared with signs of forced entry at her home in southern Arizona. Authorities believe Nancy Guthrie was taken against her will. The Pima County sheriff has said Nancy Guthrie must be found soon because she could die without her medication. The sheriff's office said Monday that “detectives continue to speak with anyone who may have had contact with Mrs. Guthrie“ and they are ”working closely with the Guthrie family.”",
      "publishedAt": "2026-02-04T16:46:05Z",
      "title": "No suspects in search for 'Today' host Savannah Guthrie's missing mom",
      "url": "https://apnews.com/article/savannah-guthrie-nancy-guthrie-mom-missing-88e8731270d05e6e667730d2ed8633d3",
      "urlToImage": "https://dims.apnews.com/dims4/default/02f07f4/2147483647/strip/true/crop/4032x2687+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2Fdd%2F50b85963068c5bc65fed68807c80%2Fe20a12c6c28d4bf2a91ec2eaea515da1"
    },
    {
      "author": "Jennifer McDermott",
      "description": "The Winter Olympics got underway Wednesday with the first curling matches in Cortina, but came to a halt only moments later because of a power outage. Officials briefly paused the matches at the historic curling stadium when the lights dimmed and flickered. Curlers kept sliding on the ice to stay ready. Fans cheered when the bright lights came back shortly after and competition resumed. Curling in Cortina — eight teams in mixed doubles — began two full days before the opening ceremony for the 2026 Milan Cortina Games. American curler Korey Dropkin says he has been waiting a long time for this moment. Fans have arrived in Cortina, and they are excited for the first matches.",
      "publishedAt": "2026-02-04T17:37:51Z",
      "title": "Curling kicks off the Milan Cortina Winter Games",
      "url": "https://apnews.com/article/curling-olympics-winter-cortina-4707441e7b88710233ebb63814e47472",
      "urlToImage": "https://dims.apnews.com/dims4/default/ddd60f9/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F21%2F3b%2F04475cb2ee50b918aea376edcf7a%2F1499b656a6f544deafbfcbed7c9fb88a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}