{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Ohio voters on Tuesday resoundingly rejected a Republican-backed measure that would have made it more difficult to change the state’s constitution, setting up a fall campaign that will become the nation’s latest referendum on abortion rights since the U.S.",
      "publishedAt": "2023-08-08T04:04:47Z",
      "title": "Voters in Ohio reject GOP-backed proposal that would have made it tougher to protect abortion rights",
      "url": "https://apnews.com/227cde039f8d51723612878525164f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbdc34f5de374e0fae8e0531c2cf889f/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and HOLLY RAMER",
      "description": "WINDHAM, N.H. (AP) — Former President Donald Trump on Tuesday kept up his attacks on special counsel Jack Smith and vowed to continue talking about his criminal cases even as prosecutors sought a protective order to limit the evidence that Trump and his team could share.",
      "publishedAt": "2023-08-08T22:04:23Z",
      "title": "Trump vows to keep talking about criminal cases despite prosecutors pushing for protective order",
      "url": "https://apnews.com/11cc4d1015c36e6ba078c00805d99838",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54bc010f1eed45ab94a1b56b0347294a/3000.jpeg"
    },
    {
      "author": "FABIANO MAISONNAVE and DAVID BILLER",
      "description": "BELEM, Brazil (AP) — Eight Amazon nations called on industrialized countries to do more to help preserve the world's largest rainforest as they met at a major summit in Brazil to chart a common course on how to combat climate change.",
      "publishedAt": "2023-08-09T04:09:27Z",
      "title": "Amazon nations seek common voice on climate change, urge action from industrialized world",
      "url": "https://apnews.com/314d7127864fbb6e709c1ffa0fab0b3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/086cfa98fbeb4ac5a447f1f020e0cfff/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Scientists are wondering if global warming and El Nino have an accomplice in fueling this summer’s record-shattering heat.The European climate agency Copernicus reported that July was one-third of a degree Celsius (six-tenths of a degree Fahrenheit) hotter than the old record.",
      "publishedAt": "2023-08-09T04:11:08Z",
      "title": "Scientists look beyond climate change and El Nino for other factors that heat up Earth",
      "url": "https://apnews.com/9c5151f2fca2cd77d92a1c7bc61a0035",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c22794e48e0c421e8455519a68c1e372/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and JOSH BOAK",
      "description": "ALBUQUERQUE, N.M. (AP) — Bringing back factory jobs is one of the most popular of White House promises — regardless of who happens to be the president.Donald Trump said he'd do it with tariffs.",
      "publishedAt": "2023-08-09T04:03:21Z",
      "title": "Biden pitching his economic policies as a key to manufacturing jobs revival",
      "url": "https://apnews.com/95700c62f45c3a69b03e550ebdcfa01b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f05f12f502bf4c37941a4a536a56c2ba/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The numbers were drawn Tuesday night for an estimated $1.58 billion Mega Millions jackpot that is the third-largest in U.S.",
      "publishedAt": "2023-08-08T04:05:40Z",
      "title": "Numbers drawn for giant $1.58 billion Mega Millions jackpot",
      "url": "https://apnews.com/8397543de852fc4c716cc2ce940d9eac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9eeddc71ddbc46ef9ae08efbd619b2ad/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Dozens of flights and ferry services were grounded in South Korea on Wednesday ahead of a tropical storm that has dumped rain on Japan’s southwestern islands for more than a week.",
      "publishedAt": "2023-08-09T03:07:52Z",
      "title": "Flights and ferries halted in South Korea ahead of storm that's dumped rain on Japan for a week",
      "url": "https://apnews.com/a1fd5a9f5fcf852543f0b9b71d81aae6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52659e48e0c14e25a0a1d14a54d33c14/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court is reinstating a regulation aimed at reining in the proliferation of ghost guns, firearms without serial numbers that have been turning up at crime scenes across the nation in increasing numbers.",
      "publishedAt": "2023-08-08T16:46:37Z",
      "title": "Supreme Court reinstates regulation of ghost guns, firearms without serial numbers",
      "url": "https://apnews.com/46b871969dc6a7da35605c2ebc5385e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10c70377e5a84042ad855fb6c66db241/3000.jpeg"
    },
    {
      "author": "STEVE LeBLANC",
      "description": "BOSTON (AP) — Massachusetts Gov. Maura Healey declared a state of emergency Tuesday, citing an influx of migrants seeking shelter at a time when the cost of housing — already in short supply — continues to rise.",
      "publishedAt": "2023-08-08T20:56:43Z",
      "title": "Massachusetts governor declares state of emergency amid influx of migrants seeking shelter",
      "url": "https://apnews.com/3daeb96003779a2fe49def8e1f7b8975",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62be49f094f741dda0620fd862cf73d9/2984.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}