{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Federal agencies must develop plans to eliminate employee positions, according to a memo distributed by President Donald Trump ‘s administration on Wednesday.",
      "publishedAt": "2025-02-27T07:39:00Z",
      "title": "Live updates: Trump administration sets the stage for large-scale federal worker layoffs",
      "url": "https://apnews.com/live/donald-trump-news-updates-2-27-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/7cc1b56/2147483647/strip/true/crop/8256x4644+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F7e%2Fbcc9d39a4bd99b33c06c35afc882%2Fap25057651277103.jpg"
    },
    {
      "author": "Gary Fields",
      "description": "Thousands of U.S. Agency for International Development workers who've been fired or placed on leave as part of the Trump administration’s dismantling of the agency are being given a brief window Thursday and Friday to clear out their workspaces. USAID has been among the biggest targets of a broad campaign by President Donald Trump and his adviser Elon Musk's Department of Government Efficiency to slash the size of the federal government. Many USAID workers see the Republican administration’s terms for retrieving their belongings as insulting. The employees have been instructed not to bring weapons, including firearms, “spear guns” and “hand grenades.” The workers are being given 15 minutes at their former workstations.",
      "publishedAt": "2025-02-27T05:07:31Z",
      "title": "USAID workers will be given 15 minutes to clear their workspaces as the agency gets dismantled",
      "url": "https://apnews.com/article/trump-musk-doge-usaid-federal-workers-bfb69a0bf38419b7518555de42169ca1",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d93429/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F7f%2F12121486caf950413a59e745966f%2F490b44454b174d3fb2482ceded310cb7"
    },
    {
      "author": "Ellen Knickmeyer, Matthew Lee, Mark Sherman",
      "description": "The Trump administration says it is eliminating more than 90% of the U.S. Agency for International Development’s foreign aid contracts and $60 billion in overall U.S. assistance around the world. That’s according to an internal memo obtained by The Associated Press as well as court filings Wednesday. They detail the outcome of a 90-day review ordered by President Donald Trump of all the money provided by USAID and the State Department for development and aid work overseas. The move leaves few surviving USAID projects for advocates to try to save in what are ongoing court battles. Meanwhile, the Supreme Court late Wednesday temporarily blocked a court order requiring the administration to release billions of dollars in foreign aid.",
      "publishedAt": "2025-02-26T23:27:52Z",
      "title": "Supreme Court blocks order for Trump administration to release billions in US foreign aid",
      "url": "https://apnews.com/article/trump-usaid-foreign-aid-cuts-6292f48f8d4025bed0bf5c3e9d623c16",
      "urlToImage": "https://dims.apnews.com/dims4/default/3576dc3/2147483647/strip/true/crop/5212x2932+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2Fbf%2Fc9d7bef4d9c72024409dc3f16ea9%2F295bbc7950564e698abd859d63bb8717"
    },
    {
      "author": "Tara Copp, Carla K. Johnson",
      "description": "The Department of Veterans Affairs has temporarily suspended billions of dollars in contract cuts after an uproar that critical veterans health services were harmed, lawmakers and veterans service organizations said Wednesday. The pause affects hundreds of VA contracts that Secretary Doug Collins a day earlier described as simply consulting deals whose cancellation would save $2 billion. The Associated Press has obtained the full list of 875 of contracts up for cancellation, and it shows the cuts would have affected everything from cancer care to the ability to assess toxic exposure. It underscores how the administration’s approach to broad swath spending cuts have had immediate and potentially unintended consequences.",
      "publishedAt": "2025-02-26T23:44:10Z",
      "title": "Veterans Affairs pauses cuts lauded by Elon Musk as lawmakers, veterans decry loss of critical care",
      "url": "https://apnews.com/article/doge-veterans-affairs-cuts-health-services-contracts-9a726b744e402da01d711023b0fc49a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/880d936/2147483647/strip/true/crop/5100x2869+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F21%2Fb2422e0c15ea0efc2189b5036c5c%2F001c7c8c71a04876882ece68d0d0b273"
    },
    {
      "author": "Lolita C. Baldor, Tara Copp",
      "description": "Building lethality in the military may be the buzzword for the new Trump administration, but busywork and paperwork have become the reality at the Pentagon, as service members and civilian workers are facing a broad mandate to purge all of the department’s social media sites and untangle confusing personnel reduction moves. A new memo requires the military services to spend countless hours poring over years of website postings, photos, news articles and videos to remove any mentions that “promote diversity, equity and inclusion.” If they can’t do that by March 5, they must “temporarily remove from public display\" all content published during the Biden administration’s four years in office.",
      "publishedAt": "2025-02-27T01:02:02Z",
      "title": "Pentagon orders new purge of social media sites to dump diversity, inclusion mentions by March 5",
      "url": "https://apnews.com/article/pentagon-social-media-purge-lethality-cc404f00493578d4210e3efe2440648f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3faf15/2147483647/strip/true/crop/5246x2951+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fa7%2Fbec5a5b099e6c571e1ae440da8fa%2F86901f68313141d0a1fef40c42ae389b"
    },
    {
      "author": "David Bauder",
      "description": "The tech outlet Wired set up a new politics team in time for the presidential election — but its most impactful work is coming after the election is over. Wired's knowledge and focus on Elon Musk has helped its aggressive coverage revealing the young team that is working with Musk to shave the federal bureaucracy — who they are and what exactly they're doing. The work has attracted notice, and led to a quick jump in its circulation. Some Trump aides have suggested Wired is doxxing the new employees, while the outlet says people engaged in changing the government are fair game.",
      "publishedAt": "2025-02-26T15:05:52Z",
      "title": "Not known for political coverage, Wired takes a leading role in tracking Elon Musk's team",
      "url": "https://apnews.com/article/elon-musk-wired-doge-trump-1f3988a459d39f39e7be6c598aa3d710",
      "urlToImage": "https://dims.apnews.com/dims4/default/40d198e/2147483647/strip/true/crop/2321x1306+0+121/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2Fb0%2F247b3b146d34a16228a2dbb53e59%2F9eb5ceb9decf45c098e2058a60c5c18e"
    },
    {
      "author": "Raf Casert",
      "description": "The European Union is insisting that the 27-nation bloc is not out to undermine the United States as U.S. President Donald Trump put it. The EU says instead that the bloc was the world's largest free market that has created an economic windfall for U.S. companies working on and with the continent. The bloc also said that it would vigorously fight a wholesale tariff of 25% on all EU products headed for the United States. Thursday’s EU pushback came after Trump told reporters that “the European Union was formed in order to screw the United States.",
      "publishedAt": "2025-02-27T10:55:12Z",
      "title": "EU pushes back against Trump tariff threats and his caustic comments",
      "url": "https://apnews.com/article/eu-us-trump-trade-war-tariffs-e799b44cbaf81b19c37a57d7fd55ee6d",
      "urlToImage": "https://dims.apnews.com/dims4/default/7dc2d31/2147483647/strip/true/crop/5500x3094+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Fa2%2F4da239898d01b4ccd09dd85dadbf%2F1d5e001b66b54ef2b92aa67576279b06"
    },
    {
      "author": "Joseph Krauss",
      "description": "Israel’s refusal to withdraw from a narrow strip of desert on Gaza's border with Egypt, as called for in the ceasefire with Hamas, could threaten the truce. Under the ceasefire agreement reached last month, Israel was to begin withdrawing from the so-called Philadelphi corridor on Saturday and complete the pullout within eight days. Its refusal to do so would likely be seen by Hamas and key mediator Egypt as a breach of the agreement. An Israeli official said the military needed to remain in the corridor to prevent weapons smuggling.",
      "publishedAt": "2025-02-27T11:39:44Z",
      "title": "Israel's refusal to withdraw from Philadelphi corridor could threaten Gaza ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-egypt-gaza-corridor-ca9615f42004a47bafe969fef1377e04",
      "urlToImage": "https://dims.apnews.com/dims4/default/620c850/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fff%2Fa54a894258c1c86da74074396686%2F4959d9b4558949578cc80bb8ba736e47"
    },
    {
      "author": "Stephen Mcgrath, Andreea Alexandru",
      "description": "A Romanian official says influencer brothers Andrew and Tristan Tate have left for the U.S. after a travel ban imposed on them was lifted. The brothers are charged with human trafficking in Romania. They are also charged with forming a criminal gang to sexually exploit women. It wasn't clear under what conditions the Tates were allowed to leave Romania. But they are avid supporters of U.S. President Donald Trump and boast millions of online followers. An official at the Ministry of Internal Affairs said Thursday that the decision was at the discretion of prosecutors.",
      "publishedAt": "2025-02-27T08:37:46Z",
      "title": "Andrew Tate and Tristan Tate have left Romania for US, Romanian official says",
      "url": "https://apnews.com/article/romania-andrew-tate-us-04749679b90fad821c2b945955f5b145",
      "urlToImage": "https://dims.apnews.com/dims4/default/25c0a24/2147483647/strip/true/crop/3753x2111+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fd5%2F58b41fe6c54caea5a0edf24f67e4%2F6ca0271ad3f749f1805077e845ed1364"
    },
    {
      "author": "Mohammad Jahjouh, Wafaa Shurafa, Natalie Melzer",
      "description": "An Israeli official says the military will not withdraw from a strategic corridor in the Gaza Strip. The pullout was part of the ceasefire and Israel’s refusal could spark a crisis with Hamas and key mediator Egypt at a sensitive moment for the fragile truce. The official says Israeli forces needed to remain in the so-called Philadelphi corridor, on the Gaza side of the border with Egypt, to prevent weapons smuggling. The official spoke hours after Hamas released the remains of four hostages in exchange for over 600 Palestinian prisoners, the last planned exchange of the ceasefire’s first phase, which ends this weekend.",
      "publishedAt": "2025-02-27T07:02:11Z",
      "title": "Bodies of 4 Israeli hostages identified after Hamas returned them, group says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-02-27-2025-cfcdd8786afe4bc73ae79b3e0e4ccb3b",
      "urlToImage": "https://dims.apnews.com/dims4/default/2af2e38/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F41%2F7182936257d78b536e9d76e8486d%2F120ee35bda8e4b6f84370dd5fda25294"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}