{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — Palestinian militants ambushed Israeli troops in a dense Gaza City neighborhood, killing at least nine of them, media reported Wednesday, as Hamas put up stiff resistance in areas that Israel has isolated and pounded with airstrikes for over nine weeks.",
      "publishedAt": "2023-12-13T08:50:51Z",
      "title": "Ambush kills 9 Israeli soldiers in Gaza City, where battles rage weeks into devastating offensive",
      "url": "https://apnews.com/10a0370b7b320d73def6b6a2a137f16a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/283f5b3437d942a09c17238834b94862/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Israeli soldiers rummaging through private homes in Gaza. Forces destroying plastic figurines in a toy store, or trying to burn food and water supplies in the back of an abandoned truck.",
      "publishedAt": "2023-12-13T05:04:54Z",
      "title": "Amid outcry over Gaza tactics, videos of soldiers acting maliciously create new headache for Israel",
      "url": "https://apnews.com/072894147302535cc9632863888e53a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7650906f66b440d08e2f00c59a318da3/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN, DAVID KEYTON, JAMEY KEATEN and SIBI ARASU",
      "description": "DUBAI, United Arab Emirates (AP) — United Nations climate negotiators directed the world on Wednesday to transition away from planet-warming fossil fuels in a move the talks chief called historic, despite critics' worries about loopholes.",
      "publishedAt": "2023-12-13T03:19:26Z",
      "title": "Delegates at UN climate talks in Dubai agree to 'transition away' from planet-warming fossil fuels",
      "url": "https://apnews.com/64c0e39e6ad54a98e05e5201a2215293",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60ab3f9be5e148919f5e1bc29d144d73/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — One of President Joe Biden’s favorite stories is about his first international summit after taking office, when he declared that “America is back” in the wake of Donald Trump’s erratic and isolationist leadership.",
      "publishedAt": "2023-12-13T05:10:44Z",
      "title": "US credibility is on the line in Ukraine funding debate",
      "url": "https://apnews.com/660a3603c72a0b51b734d6a41499027b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdc777471ac14eb9bb1d4cbcf2d8e726/2862.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The House is pushing toward a vote Wednesday to formally authorize the impeachment inquiry into President Joe Biden as Republicans rally behind the charged process despite lingering concerns among some in the party that the investigation has yet to produce evidence of misconduct by the president.",
      "publishedAt": "2023-12-13T05:11:58Z",
      "title": "House set for key vote on Biden impeachment inquiry as Republicans unite behind investigation",
      "url": "https://apnews.com/94884b322da40ca9315ac5f4e73a3e86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8b5e5d56a0c4f35995e382982fdc700/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER and JAMIE STENGLE",
      "description": "AUSTIN, Texas (AP) — Kate Cox, whose fetus had a fatal condition, did not qualify for an abortion in Texas: not after four emergency room visits, elevated vital signs, risks of a uterine rupture and with her ability to have more children in jeopardy.",
      "publishedAt": "2023-12-12T22:06:10Z",
      "title": "Kate Cox sought an abortion in Texas. A court said no because she didn't show her life was in danger",
      "url": "https://apnews.com/e85664b2ab76bcb689b1b91913d3e33e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fcb872d820b4b9bb6040abc68d937b1/3000.jpeg"
    },
    {
      "author": "KRISTEN GELINEAU",
      "description": "KUALA LUMPUR, Malaysia (AP) — In a bedroom in Malaysia that has become a prison, the 14-year-old girl wipes away tears as she sits cross-legged on the concrete floor. It is here, she says, where her 35-year-old husband rapes her nearly every night.",
      "publishedAt": "2023-12-13T05:32:11Z",
      "title": "'I feel trapped': Scores of underage Rohingya girls forced into abusive marriages in Malaysia",
      "url": "https://apnews.com/f481e725f97d1b004a474e5facb10144",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b63e071ca3c4422e8d52c3061775a0ec/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Rina Gonoi came forward in summer 2022 to demand a reinvestigation of the case that authorities dropped nearly a year earlier, saying the sexual assault caused her to give up her military career.",
      "publishedAt": "2023-12-13T10:58:01Z",
      "title": "She won her sexual assault case. Now she hopes the Japanese military changes so others don't suffer",
      "url": "https://apnews.com/8146e97b53918a439112c46d415f24a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98f369ddc3cf42518ddd720bbc945b34/3000.jpeg"
    },
    {
      "author": "MATT BROWN and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — About 7 in 10 Asian American and Pacific Islanders in the United States believe the country is headed in the wrong direction and only about 1 in 10 believe democracy is working “extremely\" or “very” well, according to a new poll from AAPI Data and The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-12-13T05:08:42Z",
      "title": "US Asians and Pacific Islanders view democracy with concern, AP-NORC/AAPI Data poll shows",
      "url": "https://apnews.com/a7ca93b210c27ab237a3ca1dcf4042f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1da4defc0db4c02b8ce886c49171f91/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Tesla is recalling more than 2 million vehicles across its model lineup to fix a defective system that’s supposed to ensure drivers are paying attention when they use Autopilot.",
      "publishedAt": "2023-12-13T10:30:04Z",
      "title": "Tesla recalls over 2 million vehicles to fix defective system that monitors drivers using Autopilot",
      "url": "https://apnews.com/8060508627a34e6af889feca46eb3002",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/443c245281d341d48e8a7c4395116707/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}