{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A U.S. Army vessel carrying equipment to build a temporary pier in Gaza was heading to the Mediterranean on Sunday, after U.S. President Joe Biden announced plans to increase aid deliveries by sea to the besieged enclave where hundreds of thousands of Palestinians are going hungry.",
      "publishedAt": "2024-03-10T08:14:04Z",
      "title": "An effort to get aid to Gaza by sea is moving ahead. But the first ship is still waiting in Cyprus",
      "url": "https://apnews.com/cf0b639c9996715a1dc611c3d74b6a12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da85913aa14d4f359e9da923888c8436/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Officials saw the crescent moon Sunday night in Saudi Arabia, home to the holiest sites in Islam, marking the start of the holy fasting month of Ramadan for many of the world's 1.8 billion Muslims.",
      "publishedAt": "2024-03-10T15:22:16Z",
      "title": "Muslims spot Ramadan crescent moon in Saudi Arabia, meaning month of fasting starts Monday for many",
      "url": "https://apnews.com/5fd52c4a981e3d61bd86432ae734aeb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8325922bd67043fcb04b798dd694752f/3000.jpeg"
    },
    {
      "author": "JOSH BOAK, MICHELLE PRICE and JILL COLVIN",
      "description": "ATLANTA (AP) — President Joe Biden said Saturday that he regretted using the term “illegal” during his State of the Union address to describe the suspected killer of Laken Riley, as his all-but-certain 2024 GOP rival, Donald Trump, blasted the Democrat's immigration policies and blamed them for her death at a rally attended by the Georgia nursing student’s family and friends.",
      "publishedAt": "2024-03-09T22:17:15Z",
      "title": "Trump blasts Biden over Laken Riley's death after Biden says he regrets using term 'illegal'",
      "url": "https://apnews.com/04924ffb3be76d60e1b6e8796a968051",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f73a1d25ec741f4aa3062e8ff529c1c/1920.jpeg"
    },
    {
      "author": "EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — The U.S. military said Sunday that it had flown forces in to beef up security at the U.S. Embassy in Haiti and allow nonessential personnel to leave.The aircraft flew to the embassy compound, the U.S.",
      "publishedAt": "2024-03-10T15:40:24Z",
      "title": "US flies forces in to beef up security at embassy in Haiti and evacuate nonessential personnel",
      "url": "https://apnews.com/1b720280fa85c87ccf0768d3156dbd23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca24430d77be4030b76cbed509ecf601/3000.jpeg"
    },
    {
      "author": "JOSH KELETY",
      "description": "PHOENIX (AP) — A nationwide review of procedures by The Associated Press and CNHI News revealed a patchwork of complicated systems for resolving open government disputes that often put the burden of enforcing transparency laws on private citizens.",
      "publishedAt": "2024-03-10T05:32:50Z",
      "title": "States have hodgepodge of cumbersome rules for enforcing sunshine laws",
      "url": "https://apnews.com/8623bd3a8069edf41c6a487bbaff6854",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4aeac930a5f641199acf034b8ccc1766/3000.jpeg"
    },
    {
      "author": "STEPHEN McGRATH and AUREL OBREJA",
      "description": "CHISINAU, Moldova (AP) — The past two years have been the hardest and most tumultuous for European Union candidate Moldova in more than three decades as it faces threats from Russia in multiple spheres of public life, the country's foreign minister says.",
      "publishedAt": "2024-03-10T11:17:29Z",
      "title": "Moldova faces multiple threats from Russia as it turns toward EU membership, foreign minister says",
      "url": "https://apnews.com/6c14d96e8cdc0bc699f0315eecaab4f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3223e2e08744628a43a4c5802d453bb/2946.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "LOS ANGELES (AP) — Hi, “Oppenheimer.”When Hollywood gathers for the 96th Academy Awards on Sunday, the blockbuster biopic is widely expected to overpower all competition — including its release-date companion, “Barbie” — at an election-year Oscars that could turn into a coronation for Christopher Nolan.",
      "publishedAt": "2024-03-10T05:00:57Z",
      "title": "'Oppenheimer' set to overpower at the Oscars Sunday night",
      "url": "https://apnews.com/e72ce0ad9d9fbb77cb43770766b2042d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45357ae69f2141298b584b3705debd0d/3000.jpeg"
    },
    {
      "author": "BARRY HATTON",
      "description": "LISBON, Portugal (AP) — Portugal is holding a general election Sunday against a backdrop of corruption scandals and economic hardship that have eroded faith in moderate mainstream parties and could push a significant number of the country's 10.8 million voters into the arms of a radical right populist party.",
      "publishedAt": "2024-03-10T05:06:02Z",
      "title": "Portugal votes in a general election where mainstream moderates are trying to keep populists at bay",
      "url": "https://apnews.com/2507301c18e4bbe3c8a84152bef07fc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/574ba86b40c148c190aa49ffa59c5e51/3000.jpeg"
    },
    {
      "author": "JOCELYN GECKER",
      "description": "Virginia high school teacher Joe Clement keeps track of the text messages parents have sent students sitting in his economics and government classes:— “What did you get on your test?”— “Did you get the field trip form signed?”",
      "publishedAt": "2024-03-10T05:13:35Z",
      "title": "Why you should stop texting your kids at school",
      "url": "https://apnews.com/fb66d41592482b72b53e8ddd42a24a17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eea4b967e5f44b8e9d4afd0a0f9cae10/3000.jpeg"
    },
    {
      "author": "MOLLY QUELL and BARBARA SURK",
      "description": "AMSTERDAM (AP) — The Netherlands opened the National Holocaust Museum on Sunday with a ceremony presided over by the Dutch king as well as Israeli President Isaac Herzog, whose presence prompted protest because of Israel's military campaign in Gaza.",
      "publishedAt": "2024-03-10T08:20:12Z",
      "title": "The Netherlands opened a Holocaust museum amid protests against Israeli president's presence",
      "url": "https://apnews.com/0ddf32393b839be8ec115a485d807e42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b77c0f93ffc64171b9d6a9d163ae7774/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}