{
  "articles": [
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces backed by fighter jets and drones carried out a second ground raid into Gaza in as many days and struck targets on the outskirts of Gaza City, the military said Friday, as it prepares for a widely expected ground invasion of the Hamas-ruled territory.",
      "publishedAt": "2023-10-27T06:40:44Z",
      "title": "Israel strikes the outskirts of Gaza City during a second ground raid in as many days",
      "url": "https://apnews.com/e41b5b12e8cdf9db62395314d9a782b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebec9cf704584ce7a42182a9e6d7699b/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Just three weeks into the deadliest war between Israel and Hamas, it already is clear that the bloodshed has flipped long-standing assumptions in Israel and the region upside down.",
      "publishedAt": "2023-10-27T08:16:22Z",
      "title": "Israel-Hamas war upends years of conventional wisdom. Leaders give few details on what comes next",
      "url": "https://apnews.com/65427884b38bac77249f280fa8c796c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ede9eec2e4e4ce481587e6a350d63bc/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, ROBERT BUMSTED, HOLLY RAMER and MICHAEL BALSAMO",
      "description": "LEWISTON, Maine (AP) — Shocked and fearful Maine residents kept to their homes for a second night as hundreds of heavily armed police and FBI agents searched intensely for Robert Card, an Army reservist authorities say fatally shot 18 people at a bowling alley and a bar in the worst mass killing in state history.",
      "publishedAt": "2023-10-27T05:03:11Z",
      "title": "Amid massive search for mass killing suspect, Maine residents remain behind locked doors",
      "url": "https://apnews.com/fed5ab0aaee9d7d4c0f0fccb3d301bb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6371475c67145e5a342b54337aed9fc/1920.jpeg"
    },
    {
      "author": "HOLLY RAMER, LISA RATHKE and PATRICK WHITTLE",
      "description": "A volunteer youth bowling coach known for encouraging children and a bar manager whose father said tried to confront the shooter and died \"a hero” were among the at least 18 people killed and 13 injured in two mass shootings in Lewiston, Maine.",
      "publishedAt": "2023-10-26T22:01:23Z",
      "title": "Volunteer youth bowling coach and 'hero' bar manager are among the Maine shooting victims",
      "url": "https://apnews.com/1be7d14e90ef6c91ca23819163d29f3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64cced776622408ea8e007dcdaf8bbde/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — U.S. fighter jets launched airstrikes early Friday on two locations in eastern Syria linked to Iran's Revolutionary Guard Corps, the Pentagon said, in retaliation for a slew of drone and missile attacks against U.S.",
      "publishedAt": "2023-10-27T02:08:36Z",
      "title": "US fighter jets strike Iran-linked sites in Syria in retaliation for attacks on US troops",
      "url": "https://apnews.com/af3c7a0f069b8c8b08f6feaa0e165d6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5154afd136a40aea3829dd15ae4df05/2945.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — “Embarrassing,\" “chaotic” and “irresponsible.\" And those were just the words that House Republicans used to describe the past three weeks as they removed one speaker from office and splintered over three successive nominees before finally landing on Rep.",
      "publishedAt": "2023-10-27T04:15:37Z",
      "title": "Republicans hope the chaos of recent weeks will become a distant memory in next year's elections",
      "url": "https://apnews.com/7627782444ae655e55cb70cb297c770c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a852ddfd8b9140f2b75fbc393be263ed/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "ACAPULCO, Mexico (AP) — Survivors of the Category 5 storm that killed at least 27 people and devastated Mexico’s resort city of Acapulco are getting desperate amid a slow government response, worrying that the focus will remain on repairing infrastructure for the city’s economic engine of tourism instead of helping the neediest.",
      "publishedAt": "2023-10-27T04:42:33Z",
      "title": "Survivors of deadly Hurricane Otis grow desperate for food and aid amid slow government response",
      "url": "https://apnews.com/4c33ae4a3ebcf272eb05b89ae898bb28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9006f3593a6b42e9b7a83cbbb032ae50/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Despite its last-minute scheduling, the meeting at a bookstore in Russia’s westernmost city of Kaliningrad still drew about 60 people, with many outraged by a lawmaker’s efforts to ban abortions in local private clinics.",
      "publishedAt": "2023-10-27T04:47:42Z",
      "title": "Abortion restrictions in Russia spark outrage as the country takes a conservative turn",
      "url": "https://apnews.com/fc5eab75b5e3d028aeb1f70ec8a9a2b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54beb6413cc443829e9829f046a63f10/3000.jpeg"
    },
    {
      "author": "CORA LEWIS",
      "description": "NEW YORK (AP) — About 2 in 3 Americans say their household expenses have risen over the last year, but only about 1 in 4 say their income has increased in the same period, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-10-27T04:09:00Z",
      "title": "Many Americans say their household expenses are outpacing earnings this year, AP-NORC poll shows",
      "url": "https://apnews.com/dd4c88e2076d1fd3f85c51fb8992583b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a30d1b7f36024bab8c7f17d02458c577/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "SAN FRANCISCO (AP) — One year ago, billionaire and new owner Elon Musk walked into Twitter's San Francisco headquarters with a white bathroom sink and a grin, fired its CEO and other top executives and began transforming the social media platform into what is now known as X.",
      "publishedAt": "2023-10-27T04:06:32Z",
      "title": "Twitter takeover: 1 year later, X struggles with misinformation, advertising and usage decline",
      "url": "https://apnews.com/ac2cb6419d93d64086cc9ad980c5a57a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e59ec2e01934b5a996a1aa2f409ea88/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}