{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "Donald Trump’s legal team told a judge overseeing the election conspiracy case against him on Monday that prosecutors' proposed protective order aimed at preventing the public disclosure of evidence is too broad and would restrict his First Amendment rights.",
      "publishedAt": "2023-08-07T21:18:48Z",
      "title": "Trump lawyers urge judge to narrow proposed rules on evidence sharing in election subversion case",
      "url": "https://apnews.com/7188eddf6cac0a34379aae71eb16a226",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6a47c309443461891b63c768e3d96c0/3000.jpeg"
    },
    {
      "author": "ASHRAF KHALIL and JEFFREY COLLINS",
      "description": "WASHINGTON (AP) — At least two people died, thousands of U.S. flights were canceled or delayed, and more than 1.1 million homes and businesses lost power Monday as severe storms, including hail and lightning, moved through the eastern U.S.",
      "publishedAt": "2023-08-07T20:31:02Z",
      "title": "2 dead, thousands of flight cancellations, 1.1 million lose power in eastern US storms",
      "url": "https://apnews.com/31b54effe7bd180bb22d5bd422b9f98b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c1d8da8bd17465cb85292008d2180dd/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK and ELLEN KNICKMEYER",
      "description": "NIAMEY, Niger (AP) — A senior U.S. diplomat said coup leaders in Niger refused to allow her to meet Monday with the West African country’s democratically elected president, whom she described as under “virtual house arrest.”",
      "publishedAt": "2023-08-07T06:33:54Z",
      "title": "Niger coup leaders refuse to let senior US diplomat meet with nation's president",
      "url": "https://apnews.com/6cc3fa0b61adc6d9bcb2fb9745c4dcdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/443bdf9edf71451b8d905e985af76639/1920.jpeg"
    },
    {
      "author": "ALI SWENSON and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Supporters of a ballot question in Ohio that would make it harder to change the state constitution and could determine the fate of abortion rights there say a yes vote will provide a “defense against out-of-state meddling.”",
      "publishedAt": "2023-08-07T04:07:09Z",
      "title": "An Ohio election that revolves around abortion rights is fueled by national groups and money",
      "url": "https://apnews.com/06217130060cd97d398169052b6d511a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23987a6a7b6f465ea020ce1ebfc70aff/3000.jpeg"
    },
    {
      "author": "DAVID BILLER and FABIANO MAISONNAVE",
      "description": "BELEM, Brazil (AP) — The diminutive woman with a white feather headdress stood on the stage of the majestic colonial theater in Brazil’s Amazon on Monday and addressed the crowd.The woman, Minister of Indigenous People Sonia Guajajara, declared the day “the milestone of Indigenous participation,” then cited the national statistics institute’s freshly released census data that revealed the full scope of the nation’s Indigenous population: 1,693,535 people.",
      "publishedAt": "2023-08-08T02:44:36Z",
      "title": "Brazil has 1.7 million Indigenous people, near double the count from prior census, government says",
      "url": "https://apnews.com/41405ae42bb3b9661e0d27244983b9f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01956d934e2443a6b91b0147e5e64a3f/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Megan Thee Stallion said she has suffered daily since rapper Tory Lanezshot her in the feet three years ago in a written statement read during Lanez's sentencing, which will stretch into Tuesday.",
      "publishedAt": "2023-08-07T05:06:31Z",
      "title": "Megan Thee Stallion describes daily suffering after Tory Lanez shooting during rapper’s sentencing",
      "url": "https://apnews.com/5eeaafd1a913ebf46094bcb0358364ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/701f5a8df90c425199f3c567bd8a67d3/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "TUSAYAN, Ariz. (AP) — President Joe Biden set out Monday on a Western swing aimed at showcasing his work on conservation, clean energy and veterans' benefits as he seeks to draw an implicit contrast between his administration's accomplishments and former President Donald Trump's legal troubles.",
      "publishedAt": "2023-08-07T16:30:33Z",
      "title": "Biden heads west for a policy victory lap, drawing an implicit contrast with Trump",
      "url": "https://apnews.com/da5880c568b2cc29185977ea3207c080",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82ebd4dfa09d41d7a0eb93dfe5d81ab1/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — Tou Thao, the last former Minneapolis police officer convicted in state court for his role in the killing of George Floyd, did not show any repentance or admit any wrongdoing as he was sentenced Monday to 4 years and 9 months.",
      "publishedAt": "2023-08-07T04:47:01Z",
      "title": "Ex-Minneapolis officer unrepentant as he gets nearly 5 years in George Floyd killing",
      "url": "https://apnews.com/586deaeb4d14807ef3f2bdd0196d0b86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5718d32e6c814e9f82f727116335ffd1/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and JIM HEINTZ",
      "description": "KYIV, Ukraine (AP) — Two Russian missile strikes hit the city center of the Ukrainian city of Pokrovsk in the eastern Donetsk region Monday evening, killing at least five people and wounding two dozen more, Ukrainian officials said.",
      "publishedAt": "2023-08-07T12:33:21Z",
      "title": "2 Russian missile strikes hit a city in eastern Ukraine, killing at least 5 people, officials say",
      "url": "https://apnews.com/3719f5684487c25da4ff69755e841b6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43bcc23a34f34ceca5f1a91f04fd46e9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}