{
  "articles": [
    {
      "author": "Alan Suderman",
      "description": "Cryptocurrency prices jumped after President Donald Trump’s surprise announcement he wants the U.S. government to purchase and hold a variety of digital assets in a strategic reserve fund, an announcement that highlights Trump’s growing attempts to use volatile cryptocurrency prices as a barometer of his public support. Trump said on social media Sunday that his administration is working toward creating a “Crypto Strategic Reserve” that will include lesser-known cryptocurrencies XRP, solana, and cardano. He later followed up with another post saying his planned reserve would also include bitcoin and ether, the two most popular cryptocurrencies.",
      "publishedAt": "2025-03-03T16:34:16Z",
      "title": "Trump sends crypto prices soaring after announcement of strategic government reserve",
      "url": "https://apnews.com/article/trump-crypto-bitcoin-digital-assets-reserve-2f4246434a657f248cd85296f14382f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/562d722/2147483647/strip/true/crop/4559x2564+0+237/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F85%2Fe9b135450e27bc5fd818cfce3945%2Fb3ffa50ae75e4b14a8d12fee64758bc4"
    },
    {
      "author": null,
      "description": "Mexico President Claudia Sheinbaum has said that her administration is waiting to see if U.S. President Donald Trump makes good on his threat to impose 25% tariffs on Mexican imports. Her Cabinet secretaries for security and trade among others have been in constant communication with their U.S. counterparts and she said Monday there was still the possibility she and Trump would speak. Trump had threatened to impose tariffs in February before suspending them at the last minute when Mexico sent 10,000 National Guard troops to their shared border to crack down on drug trafficking and illegal immigration.",
      "publishedAt": "2025-03-03T14:42:46Z",
      "title": "Mexico makes case to avoid US tariffs as it awaits Trump's decision",
      "url": "https://apnews.com/article/mexico-us-trump-tariffs-cartels-301bb669362a148f356923ef5e058dce",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c8f418/2147483647/strip/true/crop/4002x2251+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F63%2F8eca11ad200f740bb444e41943d3%2F47cef55c79594385be71bb6403380a8a"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "Chinese manufacturers reported stronger orders in February as importers rushed to beat higher U.S. tariffs. Surveys of factory managers showed China's official purchasing managers index rose to 50.2%, though that was just above the 50 level that marks the break between contraction and expansion. The new orders index rose to 51.1. Another survey released Monday showed a similar improvement. The stronger-than-expected data came as Chinese leaders gathered in Beijing for the annual session of the National People's Congress. Lawmakers are expected as usual to endorse policies and priorities set by the ruling Communist Party, which could include some fresh help for the economy as it slows to growth economists forecast will fall below 5%.",
      "publishedAt": "2025-03-03T05:54:40Z",
      "title": "China eyeing U.S. farm exports for retaliation, report says, as importers rush to beat tariffs",
      "url": "https://apnews.com/article/china-economy-manufacturing-tariffs-trump-b439ce7e8148f6c9b266b1c183c36a1b",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6d0eba/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2Ff0%2F5cf6b9e6702f09d41a15d5628642%2F8504899723494e2086abe7c934e9ce4e"
    },
    {
      "author": "Stan Choe",
      "description": "U.S. stocks are drifting in mixed trading ahead of President Donald Trump’s latest deadline on tariffs.. The S&P 500 rose 0.1% Monday. The Dow Jones Industrial Average added 89 points, and the Nasdaq composite fell 0.1%. Treasury yields sank after a report on U.S. manufacturing showed weaker growth than expected. It followed other weaker-than-expected economic reports that have yanked stocks off their all-time high. Worries about tariffs have also hurt the market, and more tariffs are set to take effect Tuesday. Wall Street's hope is President Donald Trump will go with policies that ultimately mean less damage for the global economy.",
      "publishedAt": "2025-03-03T04:22:32Z",
      "title": "Stock market today: Wall Street remains relatively calm ahead of Trump's latest deadline on tariffs",
      "url": "https://apnews.com/article/stocks-markets-china-rates-inflation-72339ddf1ecb65d7815f4bb5272197d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/405f3ef/2147483647/strip/true/crop/5840x3285+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2Fd4%2Fa885fe8ed094bc519d4c36ea8817%2F8205b2b7c34e4011995fa42f16998dea"
    },
    {
      "author": "Lindsay Whitehurst",
      "description": "The Supreme Court is turning back a challenge from conservative college students who say their freedom of speech is violated by a university program for reporting allegations of bias. Two justices, though, said publicly they would have heard the case brought by Indiana University students. Justices Samuel Alito and Clarence Thomas would have heard the students' claims that a bias-response team stifles speech on campus by allowing anonymous reports about things that appear prejudiced or demeaning. The university says the program is aimed at education and support, and that the two-person team doesn’t dole out punishment.",
      "publishedAt": "2025-03-03T15:19:48Z",
      "title": "Supreme Court won't hear a challenge to college programs for reporting bias allegations",
      "url": "https://apnews.com/article/colleges-free-speech-supreme-court-879a12f6e7aaf9d678009e56a8ab6ed0",
      "urlToImage": "https://dims.apnews.com/dims4/default/e53c107/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1c%2Faa%2F63ebc9cf91c50d66407088b4dd99%2Fbfcd41d8f2264f52846c6cdfc75ca5f5"
    },
    {
      "author": "Josh Boak",
      "description": "Judging by his past speeches to Congress, President Donald Trump once felt the need to ask lawmakers to pass his agenda. Not so much anymore. As he prepares to address Congress on Tuesday night, Trump has asserted his authority to reshape the federal government without needing to consult the legislative branch. That’s a break from his previous remarks to Congress in which the president specifically sought lawmakers’ backing on many of the actions he’s now taking unilaterally. On his own, Trump has signed orders to levy punishing taxes on imports, deport immigrants in the country illegally, fire hundreds of thousands of federal workers and freeze congressionally approved spending.",
      "publishedAt": "2025-03-03T05:02:11Z",
      "title": "Trump's past speeches to Congress asked them to pass his agenda. Now, he's willing to go it alone",
      "url": "https://apnews.com/article/trump-congress-state-union-address-speech-8cfc36080ca688dfa0b0196323677fac",
      "urlToImage": "https://dims.apnews.com/dims4/default/f257e35/2147483647/strip/true/crop/6025x3389+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F3f%2F137889237508b51109189c51cabc%2F38652f1bb409440c96ee850bbf173434"
    },
    {
      "author": null,
      "description": "Britain’s King Charles III has given a warm welcome to Canadian Prime Minister Justin Trudeau as the two met for a private audience at the monarch’s royal residence Sandringham. While royal officials did not provide details about the private talks, the pair were expected to discuss U.S. President Donald Trump’s threats to make Canada the 51st state. Trudeau said on Sunday that he will discuss matters of importance to Canadians with Charles, who is the head of state in Canada. The king has come under criticism in Canada for being silent about Trump’s threats.",
      "publishedAt": "2025-03-03T14:50:40Z",
      "title": "King Charles III welcomes Canada's Trudeau for private talks at royal residence",
      "url": "https://apnews.com/article/king-charles-trudeau-canada-trump-a475587880917f210c8aa40d252e790d",
      "urlToImage": "https://dims.apnews.com/dims4/default/18af061/2147483647/strip/true/crop/3919x2204+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F94%2F033fa25ab9d9ab9047543a82a3bd%2F2ea728413be6463aaec8fb3699702bc5"
    },
    {
      "author": "The Associated Press",
      "description": "A 70-year-old was killed and four other people were wounded in a stabbing attack Monday in the northern Israeli city of Haifa. Israeli authorities said the assailant was killed. The attack took place in a bus station, Israeli police said. It was not immediately clear who killed the attacker, whose identity was not immediately known. Earlier, Eli Bin, head of emergency rescue service Magen David Adom, told Israeli media that four people were wounded in the stabbing attack and another was critically wounded by gunfire.",
      "publishedAt": "2025-03-03T08:30:57Z",
      "title": "Middle East latest: 1 killed and 4 wounded in stabbing attack in Haifa, Israeli officials say",
      "url": "https://apnews.com/article/mideast-gaza-israel-hamas-war-latest-03-03-2025-ee7d0cc67149ee6ef79daaa4abd3d98f",
      "urlToImage": "https://dims.apnews.com/dims4/default/ecbb1e1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F5a%2Fd499122e93ad1d21f730f8ccbd6c%2F5ca50dc618f4414b8b432afcb7a0dbab"
    },
    {
      "author": "Joseph Krauss",
      "description": "Israel has introduced what it said was a new U.S. ceasefire plan and is trying to force Hamas to accept it by imposing a siege on the Gaza Strip. The plan is different from the one the two sides agreed to in January. Prime Minister Benjamin Netanyahu referred to it as the “Witkoff proposal.” He says it came from U.S. President Donald Trump’s Mideast envoy, Steve Witkoff. But the White House has yet to confirm that. Netanyahu’s remarks came a day after the first phase of the negotiated ceasefire ended, with no clarity on what would come next since the agreement’s second phase has not yet been hammered out. The new plan would require Hamas to release half its remaining hostages in exchange for a ceasefire extension and a promise to negotiate a lasting truce.",
      "publishedAt": "2025-03-03T12:37:41Z",
      "title": "With the Gaza ceasefire in limbo, Israel tries to impose an alternative plan on Hamas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-witkoff-plan-46a639d66772915ba1ed0b43cd2728d8",
      "urlToImage": "https://dims.apnews.com/dims4/default/ce50b14/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F17%2F981bf2e68329a37c2755e63d770d%2F5196f5ca8373477f847eb1c55ef4f6db"
    },
    {
      "author": "Illia Novikov",
      "description": "Ukrainian President Volodymyr Zelenskyy says a deal to end the war between Ukraine and Russia “is still very, very far away.\" He added that he expects to keep receiving U.S. support despite his recent fraught relations with U.S. President Donald Trump. Zelenskyy said late Sunday that “I think our relationship (with the U.S.) will continue because it’s more than an occasional relationship.” He was referring to Washington’s support for the past three years of war. Zelenskyy publicly was upbeat despite recent diplomatic upheaval between Western countries that have been helping Ukraine with military hardware and financial aid. The turn of events is unwelcome for Ukraine whose understrength army is having a hard time keep bigger Russian forces at bay.",
      "publishedAt": "2025-03-03T13:54:55Z",
      "title": "Ukraine's Zelenskyy says end of war with Russia is 'very, very far away'",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-starmer-trump-b025877c40ffe0ddf2a92adad1715231",
      "urlToImage": "https://dims.apnews.com/dims4/default/79fc4f1/2147483647/strip/true/crop/3000x1688+0+36/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2F74%2F00225feb73fcb788bd260f77e272%2Fa89e20fbd29f4d7ab88211f2b6bbb45d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}