{
  "articles": [
    {
      "author": null,
      "description": "The United States has attacked three sites in Iran, inserting itself into Israel’s war aimed at destroying the country’s nuclear program in a risky gambit to weaken a longtime foe that prompted fears of a wider regional conflict. Addressing the nation from the White House, President Donald Trump asserted that Iran’s key nuclear sites were “completely and fully obliterated.” There was no independent damage assessment. The Atomic Energy Organization of Iran confirmed that attacks took place on its Fordo, Isfahan and Natanz sites, but it insisted that its nuclear program will not be stopped.",
      "publishedAt": "2025-06-22T05:23:42Z",
      "title": "US strikes 3 Iranian nuclear sites, inserting itself into Israel's war with Iran",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-trump-bomber-news-06-22-2025-c2baca52babe915e033ae175ce8b2687",
      "urlToImage": "https://dims.apnews.com/dims4/default/1be7dd2/2147483647/strip/true/crop/4171x2346+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F15%2F314cca71547ad37865b0e9c0659a%2Febf738c18fbd4b3aba7f9757939ebbd5"
    },
    {
      "author": null,
      "description": "The United States has inserted itself into Israel’s war against Iran, bombing three of the Islamic Republic’s nuclear sites overnight. U.S. President Donald Trump asserted Iran’s key nuclear sites were “completely and fully obliterated,” and warned there would be additional strikes if Iran retaliates. The U.S. attacks came after a week of open conflict between Israel and Iran, sparked by Israel’s sudden barrage of attacks against Iran’s nuclear and military structure. Iran insists its nuclear program is only for peaceful purposes. But Israel views Iran’s nuclear program as an existential threat, and has said its military campaign is necessary to prevent Iran from building an atomic weapon.",
      "publishedAt": "2025-06-13T04:35:43Z",
      "title": "What to know about the conflict between Israel and Iran, and the US intervention",
      "url": "https://apnews.com/article/israel-attack-iran-strike-nuclear-us-news-5adea3ffa51264e0c7c803d8acfde338",
      "urlToImage": "https://dims.apnews.com/dims4/default/022e4c4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc5%2Fca%2F3e189062911ef9170b939f4de7a5%2Fde9ac0fd2548487d912fb46f509e5600"
    },
    {
      "author": null,
      "description": "President Donald Trump has expressed certainty that his big gamble to directly assist the Israelis delivered a knockout blow to Iran’s nuclear program — even as many of his supporters and detractors are warning that U.S. military action could lead the United States into an expansive regional conflict. In Trump's remarks to the nation on Saturday evening from the White House, he said the strikes “obliterated” three critical Iranian enrichment facilities and “the bully of the Middle East must now make peace.” But it’s a risky moment, Trump has belittled his predecessors for tying up America in “stupid wars” and has repeatedly said he's determined to keep the U.S. from getting involved in another messy conflict.",
      "publishedAt": "2025-06-22T01:23:23Z",
      "title": "Trump's big gamble in Iran is a risky moment",
      "url": "https://apnews.com/article/trump-iran-nuclear-fordo-ef530114e5297884b1c3b76a04a3b1de",
      "urlToImage": "https://dims.apnews.com/dims4/default/c38d278/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2Fb2%2Fd74bae1c3a504c9582636954fdff%2F58a7767b75e4487abba1f3b3b52fa333"
    },
    {
      "author": null,
      "description": "The U.S. strike on Iran has fueled fears that Israel’s war with Tehran could escalate to a wider regional conflict and other countries began reacting with calls for diplomacy and words of caution. U.S. President Donald Trump had said Thursday that he would decide within “two weeks” whether to get involved. In the end, it took just days to decide, and Washington inserted itself into Israel’s campaign with its early Sunday attack. It remained unclear early how much damage had been inflicted, but Iran had pledged to retaliate if the U.S. joined the Israeli assault.",
      "publishedAt": "2025-06-22T04:57:10Z",
      "title": "Nations react to US strikes on Iran with calls for diplomacy",
      "url": "https://apnews.com/article/us-attack-iran-israel-reaction-united-nations-c10cc46ec236816d958ced2497a11464",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a43216/2147483647/strip/true/crop/9157x5151+0+184/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fcd%2F816b921f38393b9d551936c72204%2F67e04d83d53d4fe8b240fcef37f542a9"
    },
    {
      "author": null,
      "description": "The Israeli military says it has recovered the remains of three hostages held in the Gaza Strip. It identified them as Yonatan Samerano, 21; Ofra Keidar, 70; and Shay Levinson, 19. Kobi Samerano said in a Facebook post that his son Yonatan, was killed during Hamas’ Oct. 7, 2023, attack and his body was taken into Gaza. Samerano said the remains were returned on what would have been his son’s 23rd birthday.",
      "publishedAt": "2025-06-22T08:46:13Z",
      "title": "Israel says the remains of 3 hostages have been recovered from Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-22-2025-e8c8fdb31785d66b17117c16d99d0187",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6f342/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ff1%2F01784acd98fe5fbb6381bbc362f0%2F419377a7ba8643cb87ee439505810f17"
    },
    {
      "author": null,
      "description": "At summits after Russia launched its full-scale invasion of Ukraine, NATO welcomed President Volodymyr Zelenskyy with open arms. In Washington last year, it vowed to supply long-term security assistance and support Ukraine “on its irreversible path\" to NATO membership. In 2023, a NATO-Ukraine Council was set up, and Kyiv’s membership path fast-tracked. The summit in the Netherlands starting Tuesday will be different. NATO’s most powerful member, the United States, is vetoing Ukraine’s membership. Zelenskyy is invited again, but he won't be seated at NATO's table. Ukraine is only likely to get a brief mention in this year's summit statement.",
      "publishedAt": "2025-06-22T08:13:06Z",
      "title": "Wartime NATO summits have focused on Ukraine. With Trump, this one will be different",
      "url": "https://apnews.com/article/nato-summit-ukraine-trump-war-russia-dcdbd80f8b50df6351b95399fdd10379",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d785de/2147483647/strip/true/crop/7777x4375+0+405/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F1d%2Fd9237000e09f96e5a2f700797daa%2F1c47f10705c94dbebf2b87d41f3e0a41"
    },
    {
      "author": null,
      "description": "Three people are dead and a regional airport was heavily damaged after powerful winds, including a tornado, swept across the upper Midwest. Cass County Sheriff Jesse Jahner said at a press conference Saturday that two men and a woman were killed at two separate locations in the town of Enderlin, North Dakota, late Friday. Enderlin is about 57 miles southwest of Fargo. Heavy winds also swept across localized areas of Minnesota. The National Weather Service in Grand Forks said a tornado hit a home just east of Enderlin and reported wind gusts of up to 106 mph at Bemidji Regional Airport overnight in Minnesota.",
      "publishedAt": "2025-06-21T13:12:56Z",
      "title": "At least 3 people dead after severe weather swept through rural town in North Dakota",
      "url": "https://apnews.com/article/north-dakota-tornado-deaths-08d9ce8cbea78a8b86d6a66040723814",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A hot-air balloon has caught fire and tumbled from the sky in Brazil’s southern state of Santa Catarina, killing eight people. Thirteen people survived and were taken to hospitals on Saturday. Santa Catarina’s military fire brigade said that 21 people were on board including the pilot. Footage shared by local news outlet G1 showed billows of smoke coming from the balloon in flames as it hurtled toward the ground in the municipality of Praia Grande.",
      "publishedAt": "2025-06-21T14:22:08Z",
      "title": "Brazil hot-air balloon crash kills 8 in Santa Catarina state",
      "url": "https://apnews.com/article/brazil-balloon-fall-49c10b909e0f430a22913f7dd13e2c23",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Former Columbia University student Mahmoud Khalil has returned to the Northeast U.S. after spending 104 days in custody for protesting against Israel's war in Gaza. Greeting supporters at New Jersey's Newark International Airport on Saturday, Khalil pushed his infant son's stroller with one hand and pumped his fist in the air with the other. He told reporters he will continue to speak up for Palestine even if threatened with death. Khalil, a legal U.S. resident, wasn't accused of breaking any laws during the protests at Columbia. But the government has said noncitizens who participate in such demonstrations should be expelled for what it deems antisemitic views.",
      "publishedAt": "2025-06-21T18:28:42Z",
      "title": "Mahmoud Khalil vows to continue protesting Israel's war in Gaza",
      "url": "https://apnews.com/article/mahmoud-khalil-columbia-palestine-released-4dfbe39870d107e77902a56857b3089a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d2796b3/2147483647/strip/true/crop/4800x2700+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2Ff3%2F7ad5a7042ccd8c8cbbb598c23061%2F5c5b232a096848feb36d2e879cadb075"
    },
    {
      "author": null,
      "description": "As the sun rose on the longest day of the year in the Northern Hemisphere, a crowd erupted in cheers at Stonehenge where the ancient monument in southern England has clocked the summer solstice over thousands of years. The orange ball crested the northeast horizon Saturday and shone its light into the center of one of the world’s most famous prehistoric monuments. The crowd gathered at the World Heritage Site before dawn, beating the sweltering conditions of the U.K.’s first amber heat-health alert issued since September 2023. Temperatures later hit 91 degrees Fahrenheit in Surrey, the hottest temperature recorded this year.",
      "publishedAt": "2025-06-21T16:01:16Z",
      "title": "Stonehenge solstice sunrise draws druids, pagans and revelers",
      "url": "https://apnews.com/article/summer-solstice-stonehenge-druid-britain-ritual-sunrise-c52d83f82a2d12fba0265e224e2323de",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f552c1/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F62%2F868d8340aa0929f4045ee4233572%2Fc4f8e859d7084f9ab120de33d1fc7da6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}