{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A longtime tabloid publisher was expected Tuesday to tell jurors about his efforts to help Donald Trump stifle unflattering stories during the 2016 campaign as testimony resumes in the historic hush money trial of the former president.",
      "publishedAt": "2024-04-23T04:08:37Z",
      "title": "'Catch and kill' will be described to jurors in Donald Trump's hush money trial as testimony resumes",
      "url": "https://apnews.com/d44d4a7ce66cc08edb5981b3afb882ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5898557d359a4d1c8a5b486ec1407129/1920.jpeg"
    },
    {
      "author": "NICK PERRY, MICHELLE L. PRICE and DAVE COLLINS",
      "description": "NEW YORK (AP) — Columbia canceled in-person classes, dozens of protesters were arrested at New York University and Yale, and the gates to Harvard Yard were closed to the public Monday as some of the most prestigious U.S.",
      "publishedAt": "2024-04-22T13:54:15Z",
      "title": "Pro-Palestinian protests sweep US college campuses following mass arrests at Columbia",
      "url": "https://apnews.com/56c3d9d0a278c15ed8e4132a75ea9599",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95be58d878d34c4a98f0cd010f4ad73c/1800.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Satellite photos analyzed by The Associated Press appear to show a new compound of tents being built near Khan Younis in the southern Gaza Strip as the Israeli military continues to signal it plans an offensive on the city of Rafah.",
      "publishedAt": "2024-04-23T07:04:19Z",
      "title": "The Latest | Tent compound rises in southern Gaza as Israel prepares for Rafah offensive",
      "url": "https://apnews.com/7eb0c352bd4b9f7f87ff197be77d70d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc5bffa53b764c0cafa449d353b142e7/996.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — Five people, including a child, died while trying to cross the English Channel from France to the U.K., French authorities said Tuesday, just hours after the British government approved a migrant bill to deport some of those who entered the country illegally to Rwanda.",
      "publishedAt": "2024-04-23T08:31:27Z",
      "title": "5 migrants have died while crossing the English Channel, hours after UK approved deportation bill",
      "url": "https://apnews.com/00d73287212405d70fdb513cd791fcbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/972cb799512e4422ba2a591b496f438d/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — India's main opposition party accused Prime Minister Narendra Modi of using hate speech after he called Muslims “infiltrators\" — some of his most incendiary rhetoric about the minority faith, days after the country began its weekslong general election.",
      "publishedAt": "2024-04-23T05:38:59Z",
      "title": "Modi is accused of using hate speech for calling Muslims 'infiltrators' at an Indian election rally",
      "url": "https://apnews.com/90f70cfae68d39ecc80a90acab6e3e00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7995481067ff49d08c3a4cecc1827314/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The social media company founded by former President Donald Trump applied for a business visa program that he sought to restrict during his administration and which many of his allies want him to curtail in a potential second term.",
      "publishedAt": "2024-04-23T04:03:32Z",
      "title": "Trump called this visa 'very bad' for Americans. Truth Social applied for one",
      "url": "https://apnews.com/51c5a41faff696709a2d2cc6ec4e2695",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3accf33ad3142c9bbbeafc16f08a6e5/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said a Russian missile strike that smashed a television tower in Kharkiv was part of the Kremlin’s ongoing effort to intimidate Ukraine’s second-largest city, which in recent weeks has come under increasingly frequent attack.",
      "publishedAt": "2024-04-23T08:57:30Z",
      "title": "A Russian strike on Kharkiv's TV tower is part of an intimidation campaign, Ukraine's Zelenskyy says",
      "url": "https://apnews.com/317bfd1aef56342a82dfa0a776dadbcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51c0b45bcade45a8a7fa625579cc06c3/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The Senate is returning to Washington on Tuesday to vote on $95 billion in war aid to Ukraine, Israel and Taiwan, taking the final steps in Congress to send the legislation to President Joe Biden’s desk after months of delays and contentious internal debate over how involved the United States should be abroad.",
      "publishedAt": "2024-04-23T04:51:02Z",
      "title": "Aid for Ukraine, Israel and Taiwan heads to the Senate for final approval after months of delay",
      "url": "https://apnews.com/8fe738b17e5c4b2636bc0de11b2620b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49ad31849c634085a30e678eddfa40d3/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — On a recent morning at a hospital in the heart of gang territory in Haiti’s capital, a woman began convulsing before her body went limp as a doctor and two nurses raced to save her.",
      "publishedAt": "2024-04-23T04:05:45Z",
      "title": "Haiti health system nears collapse as medicine dwindles, gangs attack hospitals and ports stay shut",
      "url": "https://apnews.com/dc786ed53e66b6081515474b5b310525",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8ff08fe0e1a421a8af6e0c6868e8bb5/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — It’s springtime in Europe — time for the annual blossoming of spectacle and sound known as the Eurovision Song Contest.Taking place in May in Malmö, Sweden, the 68th annual competition will see acts from 37 countries vie for the continent’s pop crown in a feelgood extravaganza that strives — not always successfully – to banish international strife and division.",
      "publishedAt": "2024-04-23T05:37:48Z",
      "title": "From pop to politics, what to know as Sweden prepares for the 2024 Eurovision Song Contest",
      "url": "https://apnews.com/2a6a9a789415f04ae997a688274e4e6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50a36a775c2949c893bb39c16a878867/2661.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}