{
  "articles": [
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy says the U.S. has given Ukraine and Russia a June deadline to reach a peace agreement. Zelenskyy said that if the deadline is not met, the Trump administration will likely apply pressure on both sides. Zelenskyy spoke to reporters on Friday, with his comments embargoed until Saturday morning. He said the Americans want the war to end by the beginning of summer. They plan to do everything possible to achieve this goal and seek a clear schedule of events.",
      "publishedAt": "2026-02-07T09:11:20Z",
      "title": "Zelenskyy says U.S. gave Ukraine and Russia a June deadline to reach agreement to end war",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-june-deadline-98da4e17de8ab377363ae9c3ff308001",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a6e82b/2147483647/strip/true/crop/5584x3721+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2F17%2F890d53bd9225f48539907b6f1e3b%2Fb0c5c959afb44e8f9ca9da6053652836"
    },
    {
      "author": "Ben Finley, Konstantin Toropin",
      "description": "President Donald Trump has taken an unusual step of turning to military leaders for high-level diplomacy. The top U.S. commander in the Middle East is involved in talks over Iran’s nuclear program. Trump's Army secretary is engaged in negotiations on trying to end the Russia-Ukraine war. It's not clear whether the military leaders were brought in because of their expertise, connections or to signal potentially tougher options. But the move reflects how the Trump administration has upended traditional U.S. foreign policy and diplomacy. Envoy Steve Witkoff and Trump's son-in-law Jared Kushner are balancing both sets of difficult negotiations.",
      "publishedAt": "2026-02-07T13:20:58Z",
      "title": "Trump's military leaders help with diplomacy on Iran and Ukraine",
      "url": "https://apnews.com/article/military-diplomacy-trump-iran-ukraine-russia-09decddeb6264a4dd83cc3535553b2f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6c86ac/2147483647/strip/true/crop/7952x5299+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Fc6%2Fa740dc997047583c2f98b8a1e276%2Fb3cc592cabf34096ac059e8e79c22a42"
    },
    {
      "author": "Aijaz Hussain",
      "description": "India and the United States have released a framework for an interim trade agreement to lower tariffs on Indian goods. The joint statement, released Friday, follows U.S. President Donald Trump's announcement to reduce import tariffs on India. This comes six months after imposing taxes to press New Delhi to cut its reliance on Russian crude. Under the deal, tariffs on Indian goods would drop to 18% from 25%. India would also reduce tariffs on U.S. goods. The agreement aims to support resilient supply chains. However, Indian opposition parties argue it favors the U.S. and impacts sensitive sectors like agriculture.",
      "publishedAt": "2026-02-07T06:01:23Z",
      "title": "India and US release framework for interim trade agreement to lower Trump tariffs",
      "url": "https://apnews.com/article/india-us-trade-deal-tariffs-exports-b8f7e1ce3439d023922e86f507ce9f8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e28831/2147483647/strip/true/crop/5934x3954+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2Fc2%2F2e34a9c727594e331d1ae43eb6ed%2F9ec076e033264fbcbd819c6a4f9627b5"
    },
    {
      "author": "Jill Lawless",
      "description": "The Jeffrey Epstein files have rocked Europe's elite, revealing ties to a prince, an ambassador, and top politicians. The U.S. Department of Justice released documents that have ended careers and sparked investigations. King Charles III's brother lost his titles and home. Ex-U.K. ambassador Peter Mandelson was fired and may face prison. British Prime Minister Keir Starmer is in crisis for appointing Mandelson. Norway, Sweden and Slovakia have seen senior figures fall. Experts say the files expose Epstein's powerful network in Europe. The fallout contrasts with a more limited impact so far in the U.S. where only a handful of prominent Epstein associates have lost their jobs.",
      "publishedAt": "2026-02-07T10:41:15Z",
      "title": "Jeffrey Epstein files shake political careers in Europe",
      "url": "https://apnews.com/article/jeffrey-epstein-fallout-europe-us-mandelson-409c14e095a2e29bbea6398437411a8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e43f7e/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F4b%2F732ac12280a90280b960f4ba748b%2F0ce4d201467540bf8d42e37878060396"
    },
    {
      "author": "Ali Swenson, Jeff Amy",
      "description": "Democrats are focusing on health care in the November elections and making it a key issue. Republicans have cut Medicaid through new work requirements and they've declined to extend COVID-era subsidies. That's led to increased costs for people covered under Affordable Care Act plans. Democrats are using campaign ads and personal stories to emphasize the impact on Americans. Jon Ossoff is one high-profile Democrat in a tough reelection campaign this year. The Georgia senator plans to address health care at an event Saturday. Republicans have struggled to pass legislation to offset health costs and that's become weak point for them. Democrats see a chance to gain political leverage in the midterms.",
      "publishedAt": "2026-02-07T05:00:18Z",
      "title": "Health costs are a top focus for Democrats in the midterms",
      "url": "https://apnews.com/article/democrats-republicans-election-2026-midterms-health-care-e2ba02302f151a03fae4f1d760cf555f",
      "urlToImage": "https://dims.apnews.com/dims4/default/810d397/2147483647/strip/true/crop/5358x3570+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Ffa%2F6a86d5e29ac821936a3363cd6741%2Fab0bc283fec24799a60e48964a76952e"
    },
    {
      "author": "Jack Brook, Michael Biesecker, Jim Mustian, Cedar Attanasio",
      "description": "A Mexican immigrant whose skull was broken during his arrest by immigration officers last month in Minnesota says the beating was unprovoked. Alberto Castañeda Mondragón says federal agents began hitting him right after they pulled him from a vehicle. He was hospitalized with eight skull fractures and five life-threatening brain hemorrhages. Officers claimed he ran into a wall, but medical staff immediately doubted that account. His case has sparked calls for accountability and transparency. Castañeda Mondragón, who entered the U.S. legally, faces a long recovery and uncertain future. He hopes to stay in the U.S. and support his family despite fears of another encounter with ICE.",
      "publishedAt": "2026-02-07T05:01:10Z",
      "title": "Immigrant whose skull was broken during ICE arrest says beating was unprovoked",
      "url": "https://apnews.com/article/immigration-enforcement-minneapolis-hospital-ice-beating-assault-4e77742e0629fc7f127c0aa38b3d2a70",
      "urlToImage": "https://dims.apnews.com/dims4/default/cff3f9d/2147483647/strip/true/crop/2172x1447+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F98%2Fd3b31ba59f5bba8d4c0fd4bb3d28%2F94351bdc84064a95b5e3cb835e50b6db"
    },
    {
      "author": "Matthew Lee",
      "description": "President Donald Trump plans to convene the first meeting of his Board of Peace this month in Washington to raise money for the reconstruction of Gaza. The meeting is proposed for Feb. 19. It would include both world leaders who accepted Trump’s invitation in January to join the board as well as members of an executive committee for Gaza that will oversee the specifics of the territory’s governance, security and redevelopment. That word comes from two Trump administration officials. They spoke on condition of anonymity because the meeting hasn't yet been formally announced and details of its agenda are still being determined. It's not clear how many leaders will come.",
      "publishedAt": "2026-02-07T17:02:06Z",
      "title": "Trump aims to hold first Board of Peace meeting in DC this month",
      "url": "https://apnews.com/article/board-peace-trump-gaza-united-nations-a7d28cbbd3b163457064d056e65ed9b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4afa45/2147483647/strip/true/crop/7878x5249+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F69%2F86a5b167be541bec53b80af9338e%2Fe348621bc6ec458e92b04de21fdcb4ed"
    },
    {
      "author": "Hallie Golden",
      "description": "Moments after the news broke about the apparent abduction of “Today” show host Savannah Guthrie’s mother, the floodgates opened on social media. The desperate search for 84-year-old Nancy Guthrie has become the latest investigation to pique the widespread interest of online armchair detectives. Authorities believe she was taken against her will from her home just outside Tucson, Arizona, a week ago. Posts across Instagram, TikTok, X, Facebook and YouTube have put millions of eyeballs on tips and theories surrounding her disappearance. But they’ve also helped to amplify rumors and forced law enforcement to set the record straight on at least one crucial detail.",
      "publishedAt": "2026-02-07T14:00:16Z",
      "title": "Social media flooded with posts about Savannah Guthrie’s missing mom",
      "url": "https://apnews.com/article/search-nancy-guthrie-social-media-posts-e176abcc670af3844416946fb3bb5619",
      "urlToImage": "https://dims.apnews.com/dims4/default/64ff69e/2147483647/strip/true/crop/1864x1242+0+293/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F21%2F53%2Fe8418ed0fd4094248466788e3acc%2F4d30ec82218f4fecb1bcac22c8467af0"
    },
    {
      "author": "Mike Stobbe",
      "description": "Atrial fibrillation, or A-fib, is becoming more common, but doctors say treatments are improving. The condition is a quivering or irregular heartbeat that can lead to blood clots, stroke and heart failure. Experts say more than 10 million Americans have it, mostly older adults. Symptoms include a pounding heartbeat and shortness of breath. Smartwatches and other devices are helping with diagnosis. Causes include genetics, high blood pressure and stress. Treatments range from medications to procedures like ablation. Experts recommend a healthy lifestyle to lower the risk.",
      "publishedAt": "2026-02-07T13:59:36Z",
      "title": "Atrial fibrillation symptoms and treatments: What to know",
      "url": "https://apnews.com/article/what-is-atrial-fibrillation-afib-68365b1f1cfc17bf4363f6ca0180daed",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5034ad/2147483647/strip/true/crop/1080x720+0+600/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F23%2F415dfd6cd3c6ad0171d18c40e471%2F3176126828.jpg"
    },
    {
      "author": "Howard Fendrich",
      "description": "Speedskater Francesca Lollobrigida has won host Italy’s first gold medal of the Milan Cortina Games by taking the women’s 3,000 meters in an Olympics-record time. With fans rising to their feet and roaring for her as she competed on her 35th birthday, Lollobrigida finished Saturday's race in 3 minutes, 54.28 seconds. That was more than two seconds faster than runner-up Ragne Wiklund of Norway. Valerie Maltais of Canada was third. Lollobrigida was competing in her fourth Olympics and earned her first gold. She collected one silver and one bronze four years ago in Beijing.",
      "publishedAt": "2026-02-07T16:33:08Z",
      "title": "Speedskater Lollobrigida wins Italy's first gold of Winter Olympics",
      "url": "https://apnews.com/article/milan-cortina-olympics-speedskating-lollobrigida-3403f4d0378c2b0e1f955160e3fc9182",
      "urlToImage": "https://dims.apnews.com/dims4/default/08931ed/2147483647/strip/true/crop/3641x2426+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2Fd1%2F4f9fe891477123f62fc2101eb657%2Fe439c595e90a4167bc1d3a754a7dcc03"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}