{
  "articles": [
    {
      "author": "DAVID KLEPPER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — A presidential candidate's phone is hacked. A fake video falsely shows ballots burned in Pennsylvania.",
      "publishedAt": "2024-10-26T18:56:41Z",
      "title": "Foreign threats to the US election are on the rise, and officials are moving faster to expose them",
      "url": "https://apnews.com/6f4cb99be3facb08c58cecd11b2c5d41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbc789ee48784b738026f8c4df83e5c1/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL, ADAM SCHRECK and TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israel attacked military targets in Iran with pre-dawn airstrikes Saturday in retaliation for the barrage of ballistic missiles the Islamic Republic fired on Israel earlier this month.",
      "publishedAt": "2024-10-26T07:55:08Z",
      "title": "Israel's first open attack on Iran targets missile sites and apparently spares oil and nuclear ones",
      "url": "https://apnews.com/9c9f366c71c508e6dd0ee74cff8400d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71d053e5c8ea474897578d3b4c26f589/1920.jpeg"
    },
    {
      "author": "ADAM SCHRECK",
      "description": "JERUSALEM (AP) — Israel delivered its long-expected response to Iranian missile attacks early Saturday by carrying out a series of airstrikes against the Islamic Republic.",
      "publishedAt": "2024-10-26T12:29:46Z",
      "title": "Five things to know about Israel's attack on Iran",
      "url": "https://apnews.com/35a2b1474e5feedbb200c3aaa557fe60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8f7939c8dc149069f166c628eb62335/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, AAMER MADHANI and CHRIS MEGERIAN",
      "description": "KALAMAZOO, Mich. (AP) — Michelle Obama challenged men to support Kamala Harris ' bid to be America's first female president, warning at a rally in Michigan on Saturday that women's lives would be at risk if Donald Trump returned to the White House.",
      "publishedAt": "2024-10-26T15:53:29Z",
      "title": "'Take our lives seriously,' Michelle Obama pleads as she rallies for Kamala Harris in Michigan",
      "url": "https://apnews.com/61897674ddc94706031d00aca5c1dc86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f0d365030cd4a8c8bada90949f712d0/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and ALI SWENSON",
      "description": "NOVI, Mich. (AP) — Donald Trump further denigrated Detroit while appealing for votes Saturday in a suburb of the largest city in swing state Michigan.",
      "publishedAt": "2024-10-26T19:37:05Z",
      "title": "Trump denigrates Detroit while appealing for votes in a suburb of Michigan's largest city",
      "url": "https://apnews.com/ee1dbcb59eaddd8b006ce57aad77c37e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02458839fd044e7ba9d8d9133a81d82d/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "In his three-hour interview with podcaster Joe Rogan, Donald Trump dug in on his false claims about voting, election fraud and his loss in the 2020 presidential election.",
      "publishedAt": "2024-10-26T15:29:49Z",
      "title": "FACT FOCUS: Trump repeated election lies in his interview with Joe Rogan. Here are the facts",
      "url": "https://apnews.com/c8c06eb608c1b1ae8ca0e93ec1022b02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1afa2e96dc5d46ecb7ac434bec81f5eb/910.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — A bus tipped over in central Mexico after colliding with a trailer that detached from a truck transporting corn, killing 24 people and injuring five, Mexican authorities said Saturday.",
      "publishedAt": "2024-10-26T18:42:39Z",
      "title": "Bus in Mexico crashes after colliding with trailer that detached from truck killing 24",
      "url": "https://apnews.com/69d3fab4a939e46d1b5ef64eecffb683",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "VATICAN CITY (AP) — Pope Francis' yearslong process to reform the Catholic Church closed Saturday with recommendations that fell short of giving women more equity as hoped, but reflected the pope’s aims for a church that at least listens more to its followers.",
      "publishedAt": "2024-10-26T14:58:12Z",
      "title": "Pope Francis' Catholic church reform process ends without giving more equity to women",
      "url": "https://apnews.com/5cdd62a4d191b77ec71b30440c59e75e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9377e938539d42acb379b55f41224824/3000.jpeg"
    },
    {
      "author": "GRAHAM LEE BREWER",
      "description": "RED SPRINGS, N.C. (AP) — Native American communities were decisive voting blocs in key states in 2020, and with the 2024 race remaining stubbornly close both campaigns have tried to mobilize Native voters in the final weeks of the presidential election.",
      "publishedAt": "2024-10-26T12:04:13Z",
      "title": "A century after Native Americans got the right to vote, they could put Trump or Harris over the top",
      "url": "https://apnews.com/6e1033eb1995c93af9c48153c3efbc1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/438f468977a24200a12673745bb8314f/3000.jpeg"
    },
    {
      "author": null,
      "description": "TAIPEI, Taiwan (AP) — The United States has approved $2 billion in arms sales to Taiwan, including the first-time delivery to the self-ruled island of an advanced surface-to-air missile defense system, in a move sure to anger China.",
      "publishedAt": "2024-10-26T11:23:44Z",
      "title": "US approves $2 billion in arms sales to Taiwan including advanced missile defense system",
      "url": "https://apnews.com/bd14986ada9cfc894c5b1168aea27d02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6694279f758467f91164730595d919b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}