{
  "articles": [
    {
      "author": "JIM VERTUNO",
      "description": "A fast-moving wildfire burning through the Texas Panhandle grew into the second-largest blaze in state history Wednesday, forcing evacuations and triggering power outages as firefighters struggled to contain the widening flames.",
      "publishedAt": "2024-02-27T22:18:27Z",
      "title": "Wildfire grows into 2nd-largest in Texas history and briefly shuts down nuclear weapons facility",
      "url": "https://apnews.com/2cad37f14581bac74a3691969aaaf956",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf0fb45e64d14f06984c989034871fa7/2048.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "OXON HILL, Md. (AP) — On a recent evening outside Washington, the president of Argentina had the eyes and ears of a conservative crowd that had gathered to listen to Donald Trump. In a raspy voice, Javier Milei called out, “Hola a todos,” or “Hello, everyone,” before introducing himself as a lion.",
      "publishedAt": "2024-02-28T16:03:04Z",
      "title": "Can conservative Latin American populists motivate the Hispanic vote? Republicans are counting on it",
      "url": "https://apnews.com/0215b7fdea225a0ca2cddfbebbd2438a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9000bb46e2e46b1980971d87fcc7b51/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "BETHESDA, Md. (AP) — President Joe Biden is visiting Walter Reed National Military Medical Center on Wednesday for his annual physical exam — and the results are sure to be closely watched as the 81-year-old president seeks reelection.",
      "publishedAt": "2024-02-28T14:06:52Z",
      "title": "Biden is having his annual physical. The results will be closely watched amid his reelection bid",
      "url": "https://apnews.com/05668d241d1a67b51b2a91c302c38985",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/775fa20e4c7745a3bf864063c5783e50/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Hunter Biden appeared Wednesday on Capitol Hill for a closed-door deposition with lawmakers, a critical moment for Republicans as their impeachment inquiry into his father and the family's business affairs teeters on the brink of collapse.",
      "publishedAt": "2024-02-28T05:04:06Z",
      "title": "Hunter Biden appears for deposition, tells Republicans he did not involve his father in his business",
      "url": "https://apnews.com/f91915376997b5327eb2e747816690b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3b37c11b86442a398bb940716755a01/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The families of hostages held in Gaza and their supporters are launching a four-day march from southern Israel to Jerusalem to demand their loved ones be set free.The march comes as negotiations are underway in Qatar to bring about a deal between Hamas and Israel that would lead to a cease-fire in exchange for the release of hostages.",
      "publishedAt": "2024-02-28T09:12:09Z",
      "title": "The Latest | Families of hostages held in Gaza launch a 4-day march to demand their freedom",
      "url": "https://apnews.com/5fb126981031984395a228598fa9e4a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2928543b1cb04fa589102bae454ab9e1/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The funeral of Russian opposition leader Alexei Navalny, who died earlier this month in a remote Arctic penal colony, will take place on Friday in Moscow after several locations declined to host the service, his spokesperson said.",
      "publishedAt": "2024-02-28T09:46:15Z",
      "title": "The funeral of Russian opposition leader Alexei Navalny will be on Friday, spokesperson says",
      "url": "https://apnews.com/21502238f9435f49f9887a3af1a6d0f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/679683f94e144dd79682546a81fc45d2/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "The number of abortions performed each month is about the same as before the U.S. Supreme Court overturned Roe v. Wade and the nationwide right to abortion more than a year and a half ago, a new report finds.",
      "publishedAt": "2024-02-28T13:31:10Z",
      "title": "About as many abortions are happening in the US monthly as before Roe was overturned, report finds",
      "url": "https://apnews.com/e3c7c9539462eb924ad92f30c624f311",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0375f0adda15497cab7f2f5408550c10/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "BOISE, Idaho (AP) — The hour of Thomas Eugene Creech’s death has been set, and it is rapidly approaching.The 73-year-old serial killer, one of the nation’s longest-serving death row inmates, spent time with his wife Tuesday evening and ate a last meal including fried chicken, mashed potatoes, gravy and ice cream.",
      "publishedAt": "2024-02-28T05:11:01Z",
      "title": "Supreme Court won't halt Idaho's execution of Thomas Creech, who has spent 4 decades on death row",
      "url": "https://apnews.com/91a12d78e9301adde77e6076dbd01dbb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0223f7c779124889a81b2ab54a4acac2/661.jpeg"
    },
    {
      "author": "by PAOLO SANTALUCIA",
      "description": "VATICAN CITY (AP) — Pope Francis, who recently had the flu, was brought to a hospital in Rome for diagnostic testing after the papal audience Wednesday, the Vatican said, without giving further details.",
      "publishedAt": "2024-02-28T10:47:26Z",
      "title": "Pope Francis had diagnostic tests in a Rome hospital after his weekly audience",
      "url": "https://apnews.com/c9af33a0b467b1a134e9a4da96754e47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5403850d6ca4128ac590d6ecd901da4/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Price increases for cars and trucks in the United States, which helped fuel inflation for nearly three years, are slowing and in some cases falling, helping cool overall inflation and giving frustrated Americans more hope of finding an affordable vehicle.",
      "publishedAt": "2024-02-28T11:00:31Z",
      "title": "Lower auto prices are finally giving Americans a break after years of inflationary increases",
      "url": "https://apnews.com/8db91d020dea1b067c74ea4acaa6cf74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85041f4f69eb49b9b454ae9fb83aa321/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}