{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and ISSAM ADWAN",
      "description": "JERUSALEM (AP) — Israel increased airstrikes on the Gaza Strip and sealed it off from food, fuel, and other supplies in retaliation for a bloody incursion by Hamas militants, as the war's death toll rose to nearly 1,600 on both sides.",
      "publishedAt": "2023-10-09T04:45:19Z",
      "title": "Israel strikes and seals off Gaza after incursion by Hamas, which vows to execute hostages",
      "url": "https://apnews.com/4377e096f62bf535bebcdff38cf16049",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88a0098f9dd54a6381299f6a24db4880/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Republicans have no clear idea who to elect U.S. House speaker, leaving an unprecedented power vacuum in Congress and severely limiting America's ability to quickly respond to the crisis in Israel — or any number of other problems at home or abroad.",
      "publishedAt": "2023-10-09T19:24:48Z",
      "title": "As Republicans split over who will be House speaker, McCarthy positions himself as a de facto leader",
      "url": "https://apnews.com/58c7df019c59e144b2a526c657cf6087",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ff0594f34094f78aa78fbdb949ebdcb/3000.jpeg"
    },
    {
      "author": "OMID HAQJO",
      "description": "ZINDA JAN, Afghanistan (AP) — People dug through the rubble of the quake in western Afghanistan for their few possessions but the material losses seemed unimportant.",
      "publishedAt": "2023-10-09T07:58:45Z",
      "title": "Afghans reel from the earthquake that killed thousands",
      "url": "https://apnews.com/0aecf4c94979bd663d63922949f5ad0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/016588268da64459a1d6fa889503937b/3000.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "PHILADELPHIA (AP) — Longtime environmental lawyer and anti-vaccine activist Robert F. Kennedy Jr. said Monday he'll run for president as an independent and drop his Democratic primary bid, adding a wrinkle to a 2024 race heading toward a likely rematch between President Joe Biden and former President Donald Trump.",
      "publishedAt": "2023-10-09T10:30:08Z",
      "title": "Robert F. Kennedy Jr. will run for president as an independent and drop his Democratic primary bid",
      "url": "https://apnews.com/30d940109c4956de9c81f332ec418463",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90a6bc09795042bdb202fe6af9dc28ad/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN, DAVID KEYTON and MICHAEL CASEY",
      "description": "STOCKHOLM (AP) — Claudia Goldin, a Harvard University professor, was awarded the Nobel economics prize on Monday for research that helps explain why women around the world are less likely than men to work and to earn less money when they do.",
      "publishedAt": "2023-10-09T07:25:04Z",
      "title": "Nobel economics prize goes to Harvard's Claudia Goldin for research on the workplace gender gap",
      "url": "https://apnews.com/224c204c0cc20843636e5525d6a61673",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/370fee719ff5487b9587b4ecb9095493/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — Ron DeSantis wants suspected drug smugglers at the U.S.-Mexico border to be shot dead. Nikki Haley promises to send American special forces into Mexico. Vivek Ramaswamy has accused Mexico's leader of treating drug cartels as his “sugar daddy” and says that if he is elected president, “there will be a new daddy in town.”",
      "publishedAt": "2023-10-08T12:15:08Z",
      "title": "Some GOP candidates want to use force against Mexico to stop fentanyl. Experts say that won't work",
      "url": "https://apnews.com/b4127423a3130967a1fafb0d9fb7526a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f5ee86594ad4572b817da65b6b95a77/3000.jpeg"
    },
    {
      "author": "WASBIR HUSSAIN and ANUPAM NATH",
      "description": "GANGTOK, India (AP) — Air force helicopters rescued scores of stranded tourists Monday in India's Himalayan northeast after a 6-year-old hydroelectric dam cracked open last week in intense rain, flooding a valley with glacial lake water and killing at least 74 people.",
      "publishedAt": "2023-10-09T06:55:22Z",
      "title": "Indian rescuers are flying into the region where a flood washed out bridges and killed at least 74",
      "url": "https://apnews.com/f2b2657f4212f996b2861e04ac2e1fc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2ec44cb901442d0800c57110f5e54ca/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Union workers at Mack Trucks went on strike Monday after voting down a five-year contract agreement that negotiators had reached with the company. The United Auto Workers said 4,000 unionized workers walked out at 7 a.m., adding to labor turmoil in the industry that has ensnared all three big Detroit automakers.",
      "publishedAt": "2023-10-09T01:39:32Z",
      "title": "Workers at Mack Trucks reject contract and join the thousands of UAW picketers already on strike",
      "url": "https://apnews.com/31028457605436f0c142617b1b5cf838",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85408d6b6a3e4c70bd61cb1fa2a20d0b/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Native people celebrated their history on Monday with events across the U.S. marking Indigenous Peoples Day, from a sunrise gathering in Minneapolis to a rally in Maine. The ceremonies, dances and speeches came two years after President Joe Biden officially commemorated Indigenous Peoples Day.",
      "publishedAt": "2023-10-09T16:54:36Z",
      "title": "Native Americans celebrate their histories and cultures on Indigenous Peoples Day",
      "url": "https://apnews.com/03201cd01d147773b3236806282d3518",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29d852c13c9c4c8a9dbf18df9b2e5648/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "Which playing surface is safer for athletes: natural grass or artificial turf?The question is important not just in football, but also for soccer, recreational sports and high school and college athletics — anywhere athletes make sudden shifts in direction that can twist joints and tear ligaments.",
      "publishedAt": "2023-10-09T15:01:21Z",
      "title": "What does the science say about the grass vs. turf debate in sports?",
      "url": "https://apnews.com/79212f5443cd2a0d30fe8c9d981b13c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eec6a8d30c3b44bab1ddf588f5ac878b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}