{
  "articles": [
    {
      "author": null,
      "description": "Several hundred people have gathered for a worship ceremony at a high school stadium in Texas. The vigil was held Wednesday evening to remember of the at least 120 people who died in the catastrophic flash floods over the July Fourth holiday. More than 160 are still believed to be missing in hard-hit Kerr County. People in the crowd clutched one another and brushed away tears during the vigil. Search crews and volunteers are continuing to scour miles along the Guadalupe River for the people still missing. The floods are now the deadliest from inland flooding in the U.S. since 1976.",
      "publishedAt": "2025-07-10T04:06:59Z",
      "title": "Hundreds gather at Texas vigil following deadly floods",
      "url": "https://apnews.com/article/texas-floods-worship-ceremony-dead-missing-39afd477993c6220d0ce8c080cea0828",
      "urlToImage": "https://dims.apnews.com/dims4/default/d68995b/2147483647/strip/true/crop/5595x3147+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Faa%2F76838ea47c9996d1b02db06cfdb6%2F802f091d658043249f88c93c62d4568a"
    },
    {
      "author": null,
      "description": "President Donald Trump has sent out tariff letters to seven smaller U.S. trading partners in his first batch of import tax announcements of the day. The countries targeted so far Wednesday are the Philippines, Brunei, Moldova, Algeria, Libya, Iraq and Sri Lanka. None of them is a major industrial rival to the United States. He says a letter is also coming for Brazil. Most economic analyses say the tariffs will worsen inflationary pressures and subtract from economic growth. But Trump has used the taxes as a way to assert the diplomatic and financial power of the U.S. on both rivals and allies.",
      "publishedAt": "2025-07-09T16:28:19Z",
      "title": "Trump sends out tariff letters to 7 more countries and more are coming",
      "url": "https://apnews.com/article/trump-tariffs-eu-trading-partners-letter-958bafd5f28d600eb0dd55fa8e942f64",
      "urlToImage": "https://dims.apnews.com/dims4/default/02c5094/2147483647/strip/true/crop/5955x3350+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F9c%2F2086f532e6710128516c1a3f0307%2F31aa08873fa249d8b2d164eb89aecd7f"
    },
    {
      "author": null,
      "description": "President Joe Biden’s White House physician is refusing answer questions as part of the House Republican investigation into Biden’s health in office. Dr. Kevin O’Connor's lawyers say O'Connor invoked doctor-client privilege and his rights under the Fifth Amendment before the House Oversight Committee on Wednesday. Republicans are investigating Biden’s actions in office and questioning whether the Democrat's use of an autopen may have been invalid. Biden has strongly denied he was not in a right state of mind at any point while in office, calling the claims “ridiculous and false.” Oversight Committee Chair Rep. James Comer of Kentucky says O’Connor’s decision not to testify makes it \"clear there was a conspiracy.”",
      "publishedAt": "2025-07-09T14:42:10Z",
      "title": "Biden's ex-doctor doesn't answer questions in House Republican probe",
      "url": "https://apnews.com/article/biden-doctor-kevin-oconnor-testimony-5c2a75c6bec319bb4ff8a417993e3d6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/64652bf/2147483647/strip/true/crop/5316x2990+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2Fd2%2Fea6a20a49cce037a18e8934c0ffd%2F0a74f9372176409d82cd681d580ccb55"
    },
    {
      "author": null,
      "description": "Measles cases in the U.S. are at their highest in three decades. The U.S. Centers for Disease Control and Prevention says the U.S. has 1,288 cases since the beginning of the year. That’s higher than 2019, when there 1,274 cases driven by 22 outbreaks over 12 months. Seventeen states have seen outbreaks this year. Experts fear the U.S. may lose its status as having eliminated measles. There are also large outbreaks of the vaccine-preventable disease in Mexico and Canada.",
      "publishedAt": "2025-07-09T14:50:51Z",
      "title": "The US is having its worst year for measles in more than three decades",
      "url": "https://apnews.com/article/measles-outbreak-us-texas-mmr-vaccine-rfk-144ed193e13de675a750e52a505423e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/006cd24/2147483647/strip/true/crop/8474x4767+0+442/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F09%2F3e7297b0d417169d5c162a80cfb8%2Feb1949e0ddfa4c3badb288e84bbc0bcb"
    },
    {
      "author": null,
      "description": "The Trump administration has resumed sending some weapons to Ukraine, a week after the Pentagon had directed that some deliveries be paused. The weapons now moving into Ukraine include 155 mm munitions and precision-guided rockets known as GMLRS, two U.S. officials told The Associated Press on Wednesday. It’s unclear exactly when the weapons started moving. Defense Secretary Pete Hegseth directed the pause last week to allow the Pentagon to assess its weapons stockpiles, in a move that caught the White House by surprise. The Pentagon has denied that Hegseth acted without consulting President Donald Trump. The officials spoke on condition of anonymity to provide details that had not been announced publicly.",
      "publishedAt": "2025-07-09T21:04:27Z",
      "title": "US resumes sending some weapons to Ukraine after Pentagon pause",
      "url": "https://apnews.com/article/ukraine-weapons-shipments-trump-a1a39c136bce749debe36646f69b5196",
      "urlToImage": "https://dims.apnews.com/dims4/default/e996eca/2147483647/strip/true/crop/5297x2980+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F90%2F410b1709e7520f1420901364abaa%2F6f2161743bcc4b8bac8c393c836c81bd"
    },
    {
      "author": null,
      "description": "The mountain village of Ruidoso has returned to the grim rituals of rebuilding from flash flooding. Crews are working to clear twisted metal, broken trees and muddy debris from streets and homes days after monsoon rains triggered a deadly flash flood in southern New Mexico. A man and two children were killed Tuesday when they were swept away as the Rio Ruidoso crested, bringing with it a wall of water that damaged dozens of homes. Ruidoso, a popular vacation getaway, has been grappling with flooding since wildfire stripped the surrounding mountains of vegetation.",
      "publishedAt": "2025-07-10T04:16:36Z",
      "title": "Ruidoso, New Mexico, devastated by flash flood, 3 dead including 2 children, homes destroyed",
      "url": "https://apnews.com/article/flash-floods-new-mexico-mountain-village-ruidoso-350c1673cdc9c41796d1319e19914314",
      "urlToImage": "https://dims.apnews.com/dims4/default/e36f2ec/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2Fe9%2Fc4d938df71bf5f7cd4d934eedfc6%2Fcbea755245d74cfea2686c9b974bc006"
    },
    {
      "author": null,
      "description": "Chipmaker Nvidia became the first public company to top $4 trillion in value on Wednesday after two-year investor frenzy. Nvidia shares rose 2.5%, or $3.97, in early trading Wednesday, topping $164 each. At the beginning of 2023, Nvidia shares were around $14 each.",
      "publishedAt": "2025-07-09T14:17:28Z",
      "title": "Nvidia becomes the first company to reach $4 trillion in value",
      "url": "https://apnews.com/article/nvidia-4-trillion-chipmaker-7947e86a7ee9a994b9f16c3c0779b74f",
      "urlToImage": "https://dims.apnews.com/dims4/default/2548afd/2147483647/strip/true/crop/4798x2699+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F76%2Fb799b8b76617c150ca8898434dd3%2Fa4f971a1694b464eb704c1ee71b7d866"
    },
    {
      "author": null,
      "description": "As talks for a ceasefire in the Gaza Strip resume, Palestinians in the battered enclave say they are desperate for deal to end the war between Israel and Hamas. At least 40 Palestinians were killed overnight, according to Nasser Hospital in the southern city of Khan Younis. The strikes come as Israeli Prime Minister Benjamin Netanyahu is in Washington meeting U.S. President Donald Trump. Israel and Hamas are considering a new U.S.-backed ceasefire proposal that would pause the war, free Israeli hostages and send much-needed aid into Gaza.",
      "publishedAt": "2025-07-09T09:11:28Z",
      "title": "40 Palestinians killed in Gaza as Netanyahu and Trump meet over a ceasefire",
      "url": "https://apnews.com/article/israel-gaza-hamas-palestinians-war-news-07-09-2025-b70b2de81552e38b98be7e54cf2efd9f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9524ee/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F28%2Fb21fe677271443d4a08c02fd9e0d%2Faaa4713aa45a483ea29607167ccc8f19"
    },
    {
      "author": null,
      "description": "Europe’s top human rights court delivered damning judgments against Russia in four cases brought by Kyiv and the Netherlands accusing Moscow of atrocities in Ukraine dating back more than a decade. Judges at the European Court of Human Rights ruled that Russia was responsible for widespread violations of international law — from shooting down Malaysia Airlines Flight 17 in 2014, to the murder, torture, rape, destruction of civilian infrastructure and kidnapping of Ukrainian children after Moscow’s full-scale invasion of 2022. The Kremlin said it would ignore the largely symbolic judgment, but Ukraine hailed it as “historic and unprecedented,” saying it was an “undeniable victory” for the embattled country.",
      "publishedAt": "2025-07-09T04:05:36Z",
      "title": "European human rights court rules against Russia in Ukraine conflict and Flight MH17",
      "url": "https://apnews.com/article/ukraine-russia-european-human-rights-court-mh17-1bac36842f8a4cfe0e3e787f0fab0c1f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c20bbb/2147483647/strip/true/crop/5266x2962+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F1d%2F535e2ffa60c4fa0b441f7c37da61%2Fff1654f4d2f047189b7fbf3587b2db08"
    },
    {
      "author": null,
      "description": "Ukrainian officials say Russia has fired more than 700 attack and decoy drones at Ukraine overnight. That tops previous nightly barrages for the third time in two weeks. It's part of Moscow’s intensifying aerial and ground assault in the three-year war. Russia has recently sought to overwhelm Ukraine’s air defenses by launching major attacks that include increasing numbers of decoy drones. The most recent one appeared aimed at disrupting Ukraine’s vital supply of Western weapons. According to Ukrainian President Volodymyr Zelenskyy, the city of Lutsk was the hardest hit. It lies near the border with Poland in western Ukraine, a region that is a crucial hub for receiving foreign military aid.",
      "publishedAt": "2025-07-09T07:11:09Z",
      "title": "Russia launches 728 drones against Ukraine, officials say",
      "url": "https://apnews.com/article/russia-record-drone-attack-ukraine-war-fe3d23673b9b5696bb5097def9ed0775",
      "urlToImage": "https://dims.apnews.com/dims4/default/e962490/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F6c%2F28a6a9a9d702a3cf2dc823ba2ed7%2F0425f404c50b44fa88e74099164db2ca"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}