{
  "articles": [
    {
      "author": "PATRICK WHITTLE and BRIAN WITTE",
      "description": "A blast of snow, ice, wind and plunging temperatures stirred up dangerous travel conditions in parts of the central U.S.",
      "publishedAt": "2025-01-05T13:03:21Z",
      "title": "Heaviest snowfall in a decade possible in some areas as winter storm threatens US",
      "url": "https://apnews.com/da173992b438907b477bcd03afa17897",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/343114397fdf4212827da353cfdc8029/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The fourth anniversary of the Jan. 6 attack on the Capitol has a new focus as lawmakers brace for the prospect that President-elect Donald Trump may soon pardon many of the more than 1,500 people charged with crimes for their actions related to the riot.",
      "publishedAt": "2025-01-05T12:46:38Z",
      "title": "Lawmakers brace for Trump's promised Jan. 6 pardons. Some are urging restraint",
      "url": "https://apnews.com/4443c672fc3b1492640684652647cde6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcf1236cd8fd4f79aa4f76092f50a148/3000.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "The night, like countless others Bourbon Street has welcomed over the decades, started out ripe for celebration. With temperatures hovering in the 50s (10-15 Celsius) hours after the arrival of the new year, the open-air party pulsing down New Orleans’ famed nocturnal artery was still hot, drawing revelers from near and far.",
      "publishedAt": "2025-01-05T05:03:08Z",
      "title": "Drawn to New Orleans' iconic street of celebration, a night of partying becomes a nightmare",
      "url": "https://apnews.com/149bdb38ca0d7fc8e184eb3d32b5de40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93bcf20b61984f3f8ca8728841b69063/3000.jpeg"
    },
    {
      "author": "JIM MUSTIAN, JACK BROOK, STEPHEN SMITH and SARA CLINE",
      "description": "NEW ORLEANS (AP) — New Orleans mourned, wept and danced at a vigil Saturday evening along the famous thoroughfare where a man rammed a pickup truck into a crowd, killing and injuring revelers who were there to celebrate the new year.",
      "publishedAt": "2025-01-04T15:27:20Z",
      "title": "New Orleans mourns victims of truck attack with tearful vigil and celebration of life",
      "url": "https://apnews.com/15400d7a4cb29c9cfce212b99cac637b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a19f8a435a947e0a998c611c1248d45/1920.jpeg"
    },
    {
      "author": "CARA ANNA",
      "description": "NAIROBI, Kenya (AP) — Jimmy Carter was the first U.S. president to make a state visit to sub-Saharan Africa. He once called helping with Zimbabwe’s transition from white rule to independence “our greatest single success.” And when he died at 100, his foundation’s work in rural Africa had nearly fulfilled his quest to eliminate a disease that afflicted millions, for the first time since the eradication of smallpox.",
      "publishedAt": "2025-01-05T05:05:23Z",
      "title": "'Our country ignored Africa,' Jimmy Carter said. He didn't",
      "url": "https://apnews.com/06e637a7554c1a1109bd2a9e1e5390de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/696f26ebda6a42bcb4fd8318aefe516f/2998.jpeg"
    },
    {
      "author": "PAN PYLAS and MONIKA SCISLOWSKA",
      "description": "LONDON (AP) — Heavy snow and freezing rain brought widespread disruption across Europe on Sunday, particularly in the U.K. and Germany, with several major airports forced to suspend flights.With the weather set to stay inclement on Sunday in the U.K., there are concerns that many rural communities, particularly in the north of England, could be cut off, with up to 40 centimeters (15 inches) of snow on the ground above 300 meters (985 feet).",
      "publishedAt": "2025-01-05T10:02:58Z",
      "title": "Heavy snow brings widespread disruption across the UK and Germany",
      "url": "https://apnews.com/98fcfebc438b521ef7707e6abfa78753",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6a1d633493442f4b15f0ed8a616ef88/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Israel has helped a former soldier leave Brazil after legal action was initiated against him by a group accusing Israelis of war crimes in the Gaza Strip based in part on soldiers' social media posts.",
      "publishedAt": "2025-01-05T12:12:13Z",
      "title": "Israeli helps former soldier leave Brazil over investigation into alleged war crimes in Gaza",
      "url": "https://apnews.com/43f582190c0fac0896d3e1c547747047",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04342ee58a844efa8986cc8d7cc26c8f/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Hundreds of South Koreans, bundled up against freezing temperatures and snow, rallied overnight into Sunday near the residence of impeached President Yoon Suk Yeol, calling for his ouster and arrest, as authorities prepared to renew their efforts to detain him over his short-lived martial law decree.",
      "publishedAt": "2025-01-05T04:01:10Z",
      "title": "South Korean protesters brave cold to demand Yoon's ouster as detention deadline looms",
      "url": "https://apnews.com/c16cb90593c7a99673d12ffa0853dda8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c54634cc69734e79bf42688a6e5993c2/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — President Joe Biden on Sunday plans to sign into law a measure that boosts Social Security payments for current and former public employees, affecting nearly 3 million people who receive pensions from their time as teachers, firefighters, police officers and in other public service jobs.",
      "publishedAt": "2025-01-05T14:07:33Z",
      "title": "Higher Social Security payments coming for millions of people from bill that Biden is signing",
      "url": "https://apnews.com/5673001497090043e786ade8a8d0fdb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df9a8b7e60504e14a5c5207902b3d705/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — New York's new toll for drivers entering the center of Manhattan debuted Sunday, meaning many people will pay $9 to access the busiest part of the Big Apple during peak hours.",
      "publishedAt": "2025-01-05T11:53:14Z",
      "title": "Driving into Manhattan? That'll cost you, as new congestion toll starts Sunday",
      "url": "https://apnews.com/5a8a6de4495d687079290918f5a499c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69c0620be7d640f581a667a8b2d69a1d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}