{
  "articles": [
    {
      "author": "PATRICK WHITTLE",
      "description": "PORTLAND, Maine (AP) — They're wriggly, they're gross and they're worth more than $2,000 a pound. And soon, fishermen might be able to catch thousands of pounds of them for years to come.Baby eels, also called elvers, are likely the most valuable fish in the United States on a per-pound basis - worth orders of magnitude more money at the docks than lobsters, scallops or salmon.",
      "publishedAt": "2024-03-14T16:08:38Z",
      "title": "Wriggling gold: Fishermen who catch baby eels for $2,000 a pound hope for many years of fishing",
      "url": "https://apnews.com/a26c8c4d33615cca76007dd82a5fadb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5ff6b0636ac4830bb84aa7a7bc6f02e/2974.jpeg"
    },
    {
      "author": "KATE BRUMBACK and ALANNA DURKIN RICHER",
      "description": "ATLANTA (AP) — Fulton County District Attorney Fani Willis must step aside from the Georgia election interference case against Donald Trump or remove the special prosecutor with whom she had a romantic relationship before the case can proceed, the judge overseeing it ruled Friday.",
      "publishedAt": "2024-03-15T13:08:38Z",
      "title": "Fulton County DA Fani Willis must step aside or remove special prosecutor in Trump case, judge says",
      "url": "https://apnews.com/60b7dd9642fc9ef7c03d75980692334c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/516232a901bf4dcca0e14d6a660cd580/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "WADI GAZA, Gaza Strip (AP) — A ship carrying 200 tons of aid approached the coast of Gaza on Friday in a mission to inaugurate a sea route from Cyprus to help alleviate the humanitarian crisis in the enclave five months into the war between Israel and Hamas.",
      "publishedAt": "2024-03-15T10:38:07Z",
      "title": "The first ship to use a new sea route approaches Gaza with 200 tons of aid",
      "url": "https://apnews.com/d4e2f9ed525914233e4cf16c217f5248",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb2ec632801e4d6c96ab3a6b796f8e00/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — A Russian ballistic missile attack blasted homes in the southern Ukrainian city of Odesa on Friday, followed by a second missile that targeted first responders who arrived at the scene, officials said.",
      "publishedAt": "2024-03-15T12:22:35Z",
      "title": "Russian missiles kill at least 16 people in the latest strike on southern Ukraine's Odesa",
      "url": "https://apnews.com/f7f8db9afd8fcaf08c41b0fac3ef885f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c8d689d2f334e599c78ff7f58497be2/2000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — The United States and allies warned Iran on Friday that major Western economies will pile new sanctions on Tehran if it moves forward with an advancing plan to provide ballistic missiles to Russia for its war with Ukraine.",
      "publishedAt": "2024-03-15T15:08:51Z",
      "title": "US, G-7 allies warn Iran to back off deal to provide Russia ballistic missiles or face new sanctions",
      "url": "https://apnews.com/f12dc454b04f7cbe671d2c401e31390c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f3d2e525c9049f98c8cb6d58a0bbbc4/1200.jpeg"
    },
    {
      "author": "JOSHUA A. BICKEL and JOHN SEEWER",
      "description": "LAKEVIEW, Ohio (AP) — Tornadoes tore through several central U.S. states, flattening homes and trailers in an RV park and killing at least three people, authorities said. Crews and cadaver dogs searched for more victims in the rubble Friday.",
      "publishedAt": "2024-03-15T13:29:02Z",
      "title": "Tornadoes have killed at least 3 people in Ohio. Crews are searching for others",
      "url": "https://apnews.com/731ed36b02cd521590ac8f5dbc4509f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01184c8fe5314e45a564634ff2b91321/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Georgia Gov. Brian Kemp will back his fellow Republicans' presidential ticket in November. That does not mean he will cheerlead for former President Donald Trump or even endorse him by name.",
      "publishedAt": "2024-03-15T04:02:02Z",
      "title": "These Republicans won states that Trump lost in 2020. Their endorsements are lukewarm (or withheld)",
      "url": "https://apnews.com/931a15dea973c358ab24e56981b5770d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a407e342fdd84911b4665dfdc217a2f2/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — A unanimous Supreme Court ruled Friday that public officials can sometimes be sued for blocking their critics on social media, an issue that first arose for the high court in a case involving then-President Donald Trump.",
      "publishedAt": "2024-03-15T15:20:28Z",
      "title": "Supreme Court rules public officials can sometimes be sued for blocking critics on social media",
      "url": "https://apnews.com/973f1d18e74faccaa4bfce3bd65cc1af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed230932cc1745898f9bc4a8eeca25b3/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — U.S. marriages have rebounded to pre-pandemic levels with nearly 2.1 million in 2022.",
      "publishedAt": "2024-03-15T16:23:08Z",
      "title": "Marriages in the US are back to pre-pandemic levels, CDC says",
      "url": "https://apnews.com/0b9a913e66e2afbf4f9a6e1866cec157",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b3cd643c8074015904aca3b351769ed/3000.jpeg"
    },
    {
      "author": "LORI HINNANT, VASILISA STEPANENKO, SAMYA KULLAB and HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — He and his parents were among the last in their village to take a Russian passport, but the pressure was becoming unbearable.By his third beating at the hands of the Russian soldiers occupying Ukraine’s Kherson region, Vyacheslav Ryabkov caved.",
      "publishedAt": "2024-03-15T05:05:11Z",
      "title": "Russia forces Ukrainians in occupied territories to take its passports – and fight in its army",
      "url": "https://apnews.com/c43bbd1107a27f70ed6a37097d5b9c59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53306daac4de4e868d2c15a430011429/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}