{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and ISSAM ADWAN",
      "description": "JERUSALEM (AP) — Israeli warplanes hammered the Gaza Strip neighborhood by neighborhood on Tuesday, reducing buildings to rubble and sending people scrambling to find safety in the tiny, sealed-off territory now suffering severe retaliation for the deadly weekend attack by Hamas militants.",
      "publishedAt": "2023-10-10T05:16:03Z",
      "title": "Gazans scramble for safety as Israeli airstrikes pound sealed-off territory to punish Hamas",
      "url": "https://apnews.com/bf6c42f84526c4d9416978c8effd932a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55898fa46c8f4560862d4117258865dd/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Less than three weeks ago, Israeli Prime Minister Benjamin Netanyahu sat beside President Joe Biden and marveled that a “historic peace between Israel and Saudi Arabia” seemed within reach — a diplomatic advance that he predicted could lead to lasting peace between the Israelis and Palestinians.",
      "publishedAt": "2023-10-10T04:10:05Z",
      "title": "Biden's hopes for establishing Israel-Saudi relations could become a casualty of the new Mideast war",
      "url": "https://apnews.com/246213034afa75e4dff27e71362a1979",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adcd044af8b141c49537b59574c47ca9/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House Republican majority is stuck, one week after the ouster of Speaker Kevin McCarthy, with lawmakers unable to coalesce around a new leader in a stalemate that threatens to keep Congress partly shuttered indefinitely.",
      "publishedAt": "2023-10-10T17:32:10Z",
      "title": "After one week without a House speaker, Republicans appear no closer to choosing a new leader",
      "url": "https://apnews.com/f4173df8025c692a9bc34eccd822de0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5394afcf33694fedbdc63d6cb9cb7675/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump signed a document 30 years ago that gave the true size of his New York penthouse that was later listed as far larger on his financial statements, according to evidence shown Tuesday at the former president's civil business fraud trial.",
      "publishedAt": "2023-10-10T04:17:08Z",
      "title": "Trial document: Trump acknowledged penthouse size at 11,000 square feet, not 30,000 he later claimed",
      "url": "https://apnews.com/71df7b5f1e4d3c89937efa77e2922914",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6afdadff17584e5c98fecebf8862e95f/1920.jpeg"
    },
    {
      "author": "EBRAHIM NOROOZI and OMID HAQJO",
      "description": "ZINDA JAN, Afghanistan (AP) — Clinging to hope that finding survivors was still possible, Afghan rescuers and villagers kept digging through rubble in western Herat province on Tuesday, three days after one of the deadliest earthquakes in the region left more than 2,000 dead.",
      "publishedAt": "2023-10-10T07:30:28Z",
      "title": "Afghans still hope to find survivors from quake that killed over 2,000 in western Herat province",
      "url": "https://apnews.com/825d607d025bff1575cf8f21ac86c019",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4b74632aec3491992201271c4c64a96/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — Charlie Kirk’s $4.75 million Spanish-style estate is tucked away in a gated Arizona country club that charges nearly a half-million dollars for a golf membership. It boasts a guest casita, a “resort-style” pool and striking views of the Sonoran Desert.",
      "publishedAt": "2023-10-10T04:04:36Z",
      "title": "How Trump's MAGA movement helped a 29-year-old activist become a millionaire",
      "url": "https://apnews.com/d08a98e439fa4e902cb756d7e35153db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e9c27283504429b909712f63ba08651/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — Over five years, the largest U.S. city on the Mexican border developed a well-oiled system to shelter asylum-seekers. That system is being tested like never before as U.S. Customs and Border Protection releases migrants to the streets of California’s second-largest city because shelters are full.",
      "publishedAt": "2023-10-10T17:15:50Z",
      "title": "US Border Patrol has released thousands of migrants on San Diego's streets, taxing charities",
      "url": "https://apnews.com/afd3a60803902eb4e1d6890785275a2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfa39513f66b46e79a412a24a4eb1dea/1920.jpeg"
    },
    {
      "author": "MICHAEL R. BLOOD",
      "description": "LOS ANGELES (AP) — Former baseball MVP Steve Garvey joined the race Tuesday to succeed the late California Sen. Dianne Feinstein, giving Republicans a splash of star quality on the ballot in a heavily Democratic state where the GOP hasn’t won a Senate race in 35 years.",
      "publishedAt": "2023-10-10T12:20:24Z",
      "title": "Former baseball MVP Steve Garvey joins California US Senate race, gives GOP ballot dash of celebrity",
      "url": "https://apnews.com/ce5fb39988916e7eb91ec0c5a31c9c1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdb8b8934ac54644aa00030d0e44bdb8/3000.jpeg"
    },
    {
      "author": "KEN SWEET and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — The trial of FTX founder Sam Bankman-Fried took a star turn Tuesday as his former fellow top executive, Caroline Ellison, began testifying against him, immediately blaming her former boyfriend for directing her to commit crimes before his cryptocurrency empire collapsed last November.",
      "publishedAt": "2023-10-10T17:47:43Z",
      "title": "Star witness Caroline Ellison starts testimony at FTX founder Sam Bankman-Fried's trial",
      "url": "https://apnews.com/bdab0230730ec079fad8e2086cf9b3f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/598ad830580648e3b2bc8f7853f17385/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and MIKE HOUSEHOLDER",
      "description": "WAYNE, Mich. (AP) — On the picket lines at a Ford factory west of Detroit, many striking workers don't think the electric vehicle revolution is coming for their jobs — at least not in the near future.",
      "publishedAt": "2023-10-10T10:00:28Z",
      "title": "The future of electric vehicles looms over negotiations in the US autoworkers strike",
      "url": "https://apnews.com/3e5b9a970cdf9b0de9c79fcebe315694",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d326569b5b74046a26d99eeb9f7d30c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}