{
  "articles": [
    {
      "author": "AAMER MADHANI, COLLEEN LONG, ZEKE MILLER AND WILL WEISSERT",
      "description": "NEW YORK (AP) — Kamala Harris made a surprise appearance on “Saturday Night Live” in the final days before the presidential election, playing herself as the mirror-image double of Maya Rudolph’s version of her in the show's cold open.",
      "publishedAt": "2024-11-02T23:32:43Z",
      "title": "Harris appears on 'Saturday Night Live' as mirror image of Maya Rudolph with election looming",
      "url": "https://apnews.com/f58069ca1db9ec077b092a52bd118ac5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69fe694da16d42a4b959c3fe38ca6aff/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, JILL COLVIN and DARLENE SUPERVILLE",
      "description": "CHARLOTTE, N.C. (AP) — Democrat Kamala Harris and Republican Donald Trump zeroed in on the Sun Belt on Saturday as they embarked on one last weekend quest to sway every undecided voter in the battleground states.",
      "publishedAt": "2024-11-02T14:31:19Z",
      "title": "Harris and Trump focus on Sunbelt states during final weekend push for votes",
      "url": "https://apnews.com/437e0faf54c19bee5944650166383bfb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49bc3d01e8694577b0e0c5382786a5fa/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE, JULIA FRANKEL and LEE KEATH",
      "description": "JERUSALEM (AP) — They were built to be places of healing. But once again, three hospitals in northern Gaza are encircled by Israeli troops and under fire.Bombardment is pounding around them as Israel wages a new offensive against Hamas fighters that it says have regrouped nearby.",
      "publishedAt": "2024-11-03T04:21:55Z",
      "title": "Still wrecked from past Israeli raids, hospitals in northern Gaza come under attack again",
      "url": "https://apnews.com/7f3d7db74304cbe1b12d2b2e950dec82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfea9e368894445abbdeff20bf77487f/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — An Israeli drone strike on a clinic in northern Gaza — where children were being vaccinated for polio — wounded six people including four children, Palestinian officials said.",
      "publishedAt": "2024-11-03T08:07:35Z",
      "title": "Palestinians say Israel struck a Gaza clinic during a polio campaign. The army denies it",
      "url": "https://apnews.com/9806fad6404f68737c5192c6fa1c7b9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bdbcdf9f0f24c5c873256fc7366c756/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An Iranian-American journalist who once worked for a U.S. government-funded broadcaster is believed to have been detained by Iran for months now, authorities said Sunday, further raising the stakes as Tehran threatens to retaliate over an Israeli attack on the country.",
      "publishedAt": "2024-11-03T06:41:52Z",
      "title": "US says Iranian-American held in Iran as tensions high following Israeli attack on country",
      "url": "https://apnews.com/fe47ab33a4ac29a19ac0177ee06786ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcac1e5e99da488e9409a3460382b54c/3000.jpeg"
    },
    {
      "author": "DAVID MELERO and JOSEPH WILSON",
      "description": "PAIPORTA, Spain (AP) — A crowd of enraged survivors hurled clots of the mud left by storm-spawned flooding at the Spanish royal couple on Sunday during their first visit to the epicenter of their nation's deadliest natural disaster in living memory.",
      "publishedAt": "2024-11-03T12:37:57Z",
      "title": "Spain flood survivors hurl mud at the royals and top government officials",
      "url": "https://apnews.com/a8525bd82cf4cc3fc6273d535cbb9d66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/394bdb5587a24d779069e86e0240c40a/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "CHIVA, Spain (AP) — Irene Cuevas will never forget the sound of the waves crashing below her apartment’s balcony.If only there had been a flash of lightning in the darkness to let her glimpse what sounded like a roaring sea.",
      "publishedAt": "2024-11-03T11:33:32Z",
      "title": "Crashing waves in a hilltop village, a night of terror from Spain's floods",
      "url": "https://apnews.com/edcef9ff9430d0d35e2f464b068cec7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0848008db3514ea4b603fd3616dcae7d/3000.jpeg"
    },
    {
      "author": null,
      "description": "OKLAHOMA CITY (AP) — Severe storms and tornadoes battered Oklahoma early Sunday, tossing cars and ripping roofs off buildings in the middle of the night and leaving about 86,000 homes and businesses without power.",
      "publishedAt": "2024-11-03T10:36:36Z",
      "title": "Severe storms in Oklahoma injure at least 6 people and leave tens of thousands without power",
      "url": "https://apnews.com/a6e8d2107448b71855150c0af6491ec6",
      "urlToImage": ""
    },
    {
      "author": "BY STEPHEN McGRATH and VADIM GHIRDA",
      "description": "CHISINAU, Moldova (AP) — Moldovans cast votes in a decisive presidential runoff Sunday that pits pro-Western incumbent Maia Sandu against a Russia-friendly opponent, as ongoing claims of voter fraud, electoral interference, and intimidation threaten democracy in the European Union candidate country.",
      "publishedAt": "2024-11-03T05:07:28Z",
      "title": "Moldovans choose president in decisive runoff overshadowed by fraud and intimidation claims",
      "url": "https://apnews.com/5886447779a4a818e9f30fdadcb8bbe5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc3dae660def4ea4935e306faf3b26d4/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and SUMMER BALLENTINE",
      "description": "Orlando Harris’ family pleaded with Missouri police to confiscate the 19-year-old’s bullet-proof vest, ammunition and AR-15-style rifle. They knew his mental health was fragile after more than one suicide attempt.",
      "publishedAt": "2024-11-03T04:19:04Z",
      "title": "Family pleaded to have assault rifle seized before deadly school shooting. Officers had few options",
      "url": "https://apnews.com/dba891ceaec8d3881ef07e05eb966eb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dab1504b31c4b808735db5140f41955/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}