{
  "articles": [
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The U.S. House voted Tuesday to impeach Homeland Security Secretary Alejandro Mayorkas, with the Republican majority determined to punish the Biden administration over its handling of the U.S-Mexico border after failing last week in a politically embarrassing setback.",
      "publishedAt": "2024-02-13T05:02:38Z",
      "title": "GOP-led House impeaches Homeland Security Secretary Mayorkas — by one vote — over border management",
      "url": "https://apnews.com/80cbd5bbb8f512c6814f155f825a1214",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac9b35e43537483eb3763ebe4b7167f5/2811.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "Democrat Tom Suozzi won a special election for a U.S. House seat in New York on Tuesday, coming out on top in a politically mixed suburban district in a victory that could lift his party’s hopes heading into a fiercely contested presidential election later this year.",
      "publishedAt": "2024-02-13T05:16:51Z",
      "title": "Democrat Tom Suozzi wins New York race to succeed George Santos in Congress",
      "url": "https://apnews.com/be0140979ca3050921579e90507bfe1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f536e75e15c4e52be2a26df00b6c3c9/1920.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — Palestinians have begun evacuating the main hospital in the southern Gaza town of Khan Younis, according to videos shared by medics on Wednesday. Weeks of heavy fighting had isolated the medical facility and claimed the lives of several people inside it.",
      "publishedAt": "2024-02-14T10:42:02Z",
      "title": "Displaced Palestinians leave one of Gaza's main hospitals after weeks of being isolated by fighting",
      "url": "https://apnews.com/15eb8cbd5f15d52928711193081fe9c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/820534b37cc3446ba72a50681e737a8a/3000.jpeg"
    },
    {
      "author": null,
      "description": "RAFAH, Gaza Strip (AP) — Ibrahim Hasouna trudged over the rubble of the destroyed house, pointing out where family moments had taken place — where his mother and sister-in-law used to sleep, where he played with his 5-year-old nieces, where he helped his 1-year-old nephew take his first steps.",
      "publishedAt": "2024-02-13T21:47:52Z",
      "title": "Airstrike from Israeli hostage rescue wipes out entire Palestinian family in Gaza border town",
      "url": "https://apnews.com/3f28892cf94c5b5c4e64f3f449c8a6f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23a17b13396d49ba8197b2eb217dd529/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Defense Minister Prabowo Subianto had a strong lead in an early, unofficial tally of Indonesia’s presidential race Wednesday, suggesting the former general may be able to avoid a runoff.",
      "publishedAt": "2024-02-13T17:53:31Z",
      "title": "Defense Minister Subianto leads in early, unofficial count of Indonesia's presidential race",
      "url": "https://apnews.com/dd732adb2d0f3b674fc92aee4f547c6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01d105a57f504c21a3977c1bc1f0aef4/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukraine's military said Wednesday it sank a Russian landing ship in the Black Sea using naval drones, a report that has not been confirmed by Russian authorities.The Caesar Kunikov amphibious ship sank near Alupka, a city on the southern edge of the Crimean Peninsula that Moscow annexed in 2014, Ukraine’s General Staff said.",
      "publishedAt": "2024-02-14T08:30:04Z",
      "title": "Ukrainian military says it sank a Russian landing ship in the Black Sea",
      "url": "https://apnews.com/8d2a78ab1f1b2a9b04ec8c421782417d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/153bb25192784af3a8bf44bb6d626026/2400.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Former President Donald Trump is expected in court Thursday for an important hearing in his New York hush-money criminal case, which now appears increasingly likely to go to trial next month.",
      "publishedAt": "2024-02-14T05:02:15Z",
      "title": "What's at stake in Trump's hush-money criminal case? Judge to rule on key issues as trial date nears",
      "url": "https://apnews.com/b590b70dcba23fa103a1f91300b64883",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56da27b705164b2a904f9c400f472ded/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and JIM VERTUNO",
      "description": "HOUSTON (AP) — The shooter who opened fire at a Houston megachurch before being gunned down by security officers used an AR-style rifle that police say she legally purchased despite a years-long criminal record, a history of mental illness and allegations she threatened to shoot her ex-husband.",
      "publishedAt": "2024-02-14T00:01:23Z",
      "title": "How Texas church shooter bought rifle despite mental illness and criminal history is under scrutiny",
      "url": "https://apnews.com/89c8b72d00c5a1f924907e0d5a85a8ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3925d3f8cb494e49902fa387ae0d45ed/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Nearly four years after Harvey Weinstein was convicted of rape and sent to prison, New York’s highest court will hear arguments Wednesday in his quest to overturn the landmark #MeToo-era verdict.",
      "publishedAt": "2024-02-14T05:09:02Z",
      "title": "Harvey Weinstein is appealing 2020 rape conviction. New York's top court to hear arguments",
      "url": "https://apnews.com/31e8c864564e7553fd5aa85a9d1e3725",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23afe4f4270944489806053b38b6d2a1/3000.jpeg"
    },
    {
      "author": "HOLLY MEYER",
      "description": "Feb. 14 is a holiday heavyweight this year due to a calendar collision of events. Yes, it's Valentine's Day, the fixed annual celebration of love and friendship, marked by cute couples, eager elementary school students — and critics who deride its commercialization.",
      "publishedAt": "2024-02-13T11:00:17Z",
      "title": "Ash Wednesday and Valentine's Day fall on the same day this year. Here's what you need to know",
      "url": "https://apnews.com/3038d66975ca75fc479a0a8f8f360416",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30a8ce2180474a23b5ef3a19d6dbfcfe/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}