{
  "articles": [
    {
      "author": "Eric Tucker, Michael R. Sisak, Alanna Durkin Richer",
      "description": "Newly disclosed government files on Jeffrey Epstein show authorities thought they were close to indicting the wealthy financier on sex crimes nearly two decades ago, before that investigation was suddenly scrapped. Other documents in Friday’s release include Epstein’s communications with former White House advisers, an NFL team co-owner and billionaires including Bill Gates and Elon Musk. The Justice Department said it would be releasing more than 3 million pages of documents along with more than 2,000 videos and 180,000 images. Disclosures are resuming under a law intended to reveal what the government knew about his sexual abuse of young girls and his interactions with rich and powerful people.",
      "publishedAt": "2026-01-31T17:28:17Z",
      "title": "In the latest Epstein files are famous names and details of earlier probe",
      "url": "https://apnews.com/article/epstein-justice-department-trump-musk-andrew-tisch-d5dfbb26b93c46a4d6ab9ecf4eb3d3b1",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d9b633/2147483647/strip/true/crop/4790x3192+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2F88%2F13679738e5005c6e0a3c5709eb10%2Fee8342af102640afae1f5bd047f029be"
    },
    {
      "author": "Danica Kirka",
      "description": "Britain’s royal family is facing a fresh round of embarrassment after the latest release of documents from the U.S. investigation into Jeffrey Epstein revealed unsavory details about the relationship between the convicted sex offender and a correspondent who appears to be the man formerly known as Prince Andrew. Emails released by the U.S. Justice Department include an invitation for Epstein to dine at Buckingham Palace, Epstein’s offer to introduce his correspondent to a 26-year-old Russian woman, and photos that appear to show Andrew kneeling over an unidentified woman who is lying on the floor. The revelations come three months after King Charles III stripped Andrew of his royal titles, including the right to be called a prince.",
      "publishedAt": "2026-01-31T17:41:19Z",
      "title": "Royal family faces new scandal as Epstein documents reveal ties to Prince Andrew",
      "url": "https://apnews.com/article/jeffrey-epstein-andrew-prince-mountbatten-windsor-friend-7fa8aadad792e66963a1d18d9039235b",
      "urlToImage": "https://dims.apnews.com/dims4/default/2938dd4/2147483647/strip/true/crop/5906x3935+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F67%2F44e7117620490a5e6650b2043444%2F3783dd859c9a4fdd983315d9bd0c0603"
    },
    {
      "author": null,
      "description": "A federal judge says she won’t halt the immigration enforcement surge in Minnesota and the Twin Cities as a lawsuit over it proceeds. Judge Katherine M. Menendez on Saturday denied a preliminary injunction sought in a lawsuit filed this month by state Attorney General Keith Ellison and the mayors of Minneapolis and St. Paul. It argued that the Department of Homeland Security is violating constitutional protections. The lawsuit sought a quick order to halt the enforcement action or limit its scope. Lawyers with the U.S. Department of Justice have called the lawsuit “legally frivolous.” Federal officers have fatally shot two people on the streets of Minneapolis: Renee Good on Jan. 7 and Alex Pretti on Jan. 24.",
      "publishedAt": "2026-01-31T17:19:42Z",
      "title": "Judge won’t halt the immigration enforcement surge in Minnesota as lawsuit proceeds",
      "url": "https://apnews.com/article/immigration-enforcement-minnesota-judge-48052b87af15d2884c47ce00aff8c4a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/50e1320/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2Fdc%2F54ec1a312ca34fdbd2dc7b04d785%2Ffe33c349a7c84520ac61560bef72b208"
    },
    {
      "author": "Will Weissert",
      "description": "President Donald Trump says he's instructed Homeland Security Secretary Kristi Noem not to intervene in protests in Democratic-led cities unless local authorities request federal help. On his social media site Saturday, Trump posted that federal authorities will not participate in protests or riots, unless asked. He did not provide details on how such an order would affect immigration enforcement operations going forward but emphasized protecting federal buildings. The Trump administration has already deployed forces in several Democratic areas. Opposition to these tactics has grown, especially in Minnesota, where protests erupted after federal officers fatally shot two people in Minneapolis.",
      "publishedAt": "2026-01-31T23:42:34Z",
      "title": "Trump says feds won't respond to protests unless asked in Democratic-led cities",
      "url": "https://apnews.com/article/trump-democratic-cities-ice-federal-buildings-e14e47e9a55576d6b5750c4dd776aad0",
      "urlToImage": "https://dims.apnews.com/dims4/default/69d90f5/2147483647/strip/true/crop/3936x2623+0+5/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2Faa%2F2e7959d4fd170a6cc5a7e241bd7d%2F43120c566c2f42b6923837207679afed"
    },
    {
      "author": "Geoff Mulvihill",
      "description": "A judge has ordered the U.S. to release a father and 5-year-old son who were taken into custody during the immigration crackdown in Minnesota. Images of preschooler Liam Conejo Ramos in a bunny hat and Spiderman backpack being surrounded by federal agents in a Minneapolis suburb on Jan. 20 added to the outcry about the immigration actions of President Donald Trump’s administration. The government says the father and son, originally from Ecuador, entered the U.S. in 2024. They were taken to a detention facility in Dilley, Texas. The judge previously ruled that they could not be removed from the U.S. for now.",
      "publishedAt": "2026-01-31T20:27:13Z",
      "title": "US ordered to release 5-year-old and dad taken into custody in Minnesota",
      "url": "https://apnews.com/article/immigration-minnesota-boy-detained-a1ef2144c03a0136ef123f5a3685ee44",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e96805/2147483647/strip/true/crop/1536x1023+0+41/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F6c%2F193a4103f7ee7d6419da6c99b451%2F8639462d3c80406883929c3a8c3628b1"
    },
    {
      "author": null,
      "description": "The latest collection of government files released on Jeffrey Epstein include emails from 2003 between Casey Wasserman, the head of the Los Angeles Olympics organizing committee, and Epstein’s one-time partner, Ghislaine Maxwell. Among the exchanges include Wasserman telling Maxwell “I think of you all the time. So, what do I have to do to see you in a tight leather outfit?” Wasserman released a statement saying he deeply regretted his correspondence with Maxwell and that he never had a business or personal relationship with Epstein. Maxwell is serving a 20-year prison sentence for convictions on sex-trafficking charges.",
      "publishedAt": "2026-02-01T00:11:24Z",
      "title": "Epstein files include emails between LA Olympics leader Wasserman and Ghislaine Maxwell",
      "url": "https://apnews.com/article/epstein-maxwell-wasserman-olympics-bf365cd5231304395af05abc3deb9cf7",
      "urlToImage": "https://dims.apnews.com/dims4/default/afdafbc/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2Fca%2F5efc615aa789760adb9d5e5685c4%2Ff13e7af587aa40f39668916cb5e800c0"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Hospitals in Gaza said Israeli strikes killed at least 12 Palestinians early Saturday, one of the highest tolls since an October agreement aimed at stopping the fighting. The strikes hit northern and southern Gaza, including an apartment in Gaza City and a tent in Khan Younis, officials at the Nasser and Shifa Hospitals said. The casualties included two women and six children from two different families. Israel’s military did not immediately respond to questions about the strikes. The strikes came a day before a border crossing is set to open in Gaza’s southernmost city, a reminder that the death poll is still rising even as a ceasefire agreement inches forward.",
      "publishedAt": "2026-01-31T06:39:21Z",
      "title": "As ceasefire advances and Rafah nears reopening, hospitals say 12 killed in Israeli strikes in Gaza",
      "url": "https://apnews.com/article/mideast-wars-gaza-israel-strikes-88fcbfdbe8ea6265fa3765b7a407a5a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d20166/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F13%2Fa4ec45ffc1cc32a2bb94b43d7d7a%2Ff9b4463ab55947688db996f59f120eed"
    },
    {
      "author": "Meg Kinnard, Kevin Freking",
      "description": "The partial government shutdown is a lot different from the record-long shutdown in the fall. That's mostly because the shutdown that began Saturday may not last long. When the House returns on Monday, lawmakers will try to pass legislation quickly that would end the shutdown. Congress has passed half this year’s funding bills, and that means several important federal agencies and programs continue to operate. Nutrition assistance programs should be unaffected. But funding is lapsing, at least temporarily, for the Pentagon and agencies such as the departments of Homeland Security and Transportation. Essential functions will continue, but workers could go without pay if the impasse drags on.",
      "publishedAt": "2026-01-31T13:14:31Z",
      "title": "Partial government shutdown: Here's what to know",
      "url": "https://apnews.com/article/government-shutdown-homeland-security-pentagon-transportation-2dd3464f56295ff79f136c1c5c24a532",
      "urlToImage": "https://dims.apnews.com/dims4/default/b4f3919/2147483647/strip/true/crop/5198x3464+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2Ff4%2Fb6f4906cdd6a11260017c52dfce8%2F410633206f1c4ed5963d5cc82569d9f5"
    },
    {
      "author": "Susie Blann",
      "description": "Emergency power cuts swept across several Ukrainian cities as well as neighboring Moldova, officials said, following a commitment from the Kremlin to U.S. President Donald Trump to pause strikes on Kyiv as Ukraine continues to battle one of its bleakest winters in years. Ukraine’s Energy Minister, Denys Shmyhal, said that the outages had been caused by a technical malfunction affecting several power lines. The shortages follow weeks of Russian strikes against Ukraine’s already struggling energy grid, which have already triggered long stretches of severe power shortages. Moscow has sought to deny Ukrainian civilians heat, light and running water over the course of the war, in a strategy that Ukrainian officials describe as “weaponizing winter.”",
      "publishedAt": "2026-01-31T13:44:47Z",
      "title": "Emergency power cuts hit Ukrainian cities and Moldova",
      "url": "https://apnews.com/article/russia-ukraine-war-energy-ceasefire-blackout-winter-c4c3799925b83c2772bc49ca05d63140",
      "urlToImage": "https://dims.apnews.com/dims4/default/1020fdc/2147483647/strip/true/crop/4373x2914+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2Fad%2Fdb2546eb1fa833af27ad77a0d1d9%2F9b7140adf0e44d738f8c318f7c1f44b5"
    },
    {
      "author": "Kristin Hall, Sophie Bates",
      "description": "A powerful storm threatening howling winds, flooding and heavy snow is bearing down on the East Coast. Its forecast path includes some coastal communities in the Carolinas more accustomed to hurricanes than blizzard conditions. Temperatures have plummeted for tens of thousands in the Southeast still without power. Forecasters say the subfreezing weather will persist in the East into February. Heavy weekend snow is forecast in the Carolinas, Virginia and northeast Georgia. Parts of North Carolina could see as much as a foot.",
      "publishedAt": "2026-01-31T05:02:21Z",
      "title": "East Coast braces for heavy snow and near-hurricane force winds",
      "url": "https://apnews.com/article/winter-storm-east-coast-snow-floods-ff62eb61d9738850de04f19d5650e910",
      "urlToImage": "https://dims.apnews.com/dims4/default/de180c7/2147483647/strip/true/crop/7951x5298+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F69%2F7f07adba3ccd11ede6ca9cc7871c%2F02c9a79a1a5b49b2b0b17fc31decc987"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}