{
  "articles": [
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Kateryna Dmytryk had been waiting for this moment for almost two years — nearly all of her young son’s life.",
      "publishedAt": "2024-02-21T05:13:11Z",
      "title": "For many Ukrainians, life is split in two: Before and after the war. This is one family's story",
      "url": "https://apnews.com/9af6c5f03ca93a2f96dbcffbdea42f40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32fd5cf8b37a4b358d66335f9e79f18c/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Earlier this month, when Tucker Carlson asked Vladimir Putin about his reasons for invading Ukraine two years ago, Putin gave him a lecture on Russian history.",
      "publishedAt": "2024-02-21T05:27:32Z",
      "title": "How the Kremlin weaponized Russian history — and has used it to justify the war in Ukraine",
      "url": "https://apnews.com/80cb70fff9820357eddb83170695bdbb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2ffb03ba67445c78526afe8bbc854c0/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli strikes across Gaza killed at least 67 Palestinians overnight and into Wednesday, including in areas where civilians have been told to seek refuge.The Al-Aqsa Martyrs hospital in Deir al-Balah says it received 44 bodies after multiple strikes in central Gaza.",
      "publishedAt": "2024-02-21T09:00:45Z",
      "title": "Live updates | Israeli strikes across Gaza kill 67 Palestinians overnight",
      "url": "https://apnews.com/958e47556cdb77bc8edee3aed1e769e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0d794f183de40dab60cc1efe10a7bbd/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — James Biden arrived for a private interview Wednesday on Capitol Hill as part of House Republicans' impeachment inquiry into his brother, President Joe Biden.",
      "publishedAt": "2024-02-21T16:04:17Z",
      "title": "James Biden appears for GOP interview as FBI informant's arrest casts new doubt on impeachment",
      "url": "https://apnews.com/b5116eb6d686750b75b944a12eed5a9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e2d084e5ecf407ca41606655c1bf505/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Occupants of the White House have grumbled over news coverage practically since the place was built. Now it's Joe Biden's turn: With a reelection campaign underway, there are signs that those behind the president are starting to more aggressively and publicly challenge how he is portrayed.",
      "publishedAt": "2024-02-21T05:19:09Z",
      "title": "It's an election year, and Biden's team is signaling a more aggressive posture toward the press",
      "url": "https://apnews.com/3bda702e68181e58ead973e7c8eae0c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/750e8c1343b04f069020ccac79349b2b/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and SYLVIA HUI",
      "description": "LONDON (AP) — WikiLeaks founder Julian Assange should face espionage charges in the United States because he put innocent lives at risk and went beyond journalism in his bid to solicit, steal and indiscriminately publish classified U.S.",
      "publishedAt": "2024-02-21T09:05:02Z",
      "title": "WikiLeaks’ Assange went far beyond journalism and should face spying charges, lawyers for US say",
      "url": "https://apnews.com/25a5f66df1e8d94d0db1e9d6bb323ea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26770385cef44dfa880ff431197d39a3/3000.jpeg"
    },
    {
      "author": "ALTAF QADRI and KRUTIKA PATHI",
      "description": "SHAMBHU, India (AP) — A protester died on Wednesday as thousands of Indian farmers resumed their march to the capital after talks with the government failed to end an impasse over their demands for guaranteed crop prices.",
      "publishedAt": "2024-02-21T08:12:40Z",
      "title": "A young man dies as clashes erupt between police and protesting farmers trying to reach New Delhi",
      "url": "https://apnews.com/6fca589a5895501b7d9eb9a7e85bd123",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a6483039ffa46d2acd0f5b965108555/1280.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — Trying to keep up with customer demand, Batesville Tool &amp; Die began seeking 70 people to hire last year. It wasn't easy. Attracting factory workers to a community of 7,300 in the Indiana countryside was a tough sell, especially having to compete with big-name manufacturers nearby like Honda and Cummins Engine.",
      "publishedAt": "2024-02-21T11:00:25Z",
      "title": "Robots and happy workers: Productivity surge helps explain US economy's surprising resilience",
      "url": "https://apnews.com/c1e0163d51b430fcb18f0c80e32b2d81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e12f29cac6a4a88a07b7378248b93ed/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A private U.S. lunar lander reached the moon and eased into a low orbit Wednesday, a day before it will attempt an even greater feat — landing on the gray, dusty surface.",
      "publishedAt": "2024-02-21T16:08:58Z",
      "title": "Private US spacecraft enters orbit around the moon ahead of landing attempt",
      "url": "https://apnews.com/fed3a76d25c9f68cf20d2b6efd48b593",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83d426bc6e594f778f4c5fe5e9ba30fd/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Beyond Meat is revamping its signature plant-based burger, hoping that healthier ingredients will help it boost flagging U.S. sales.The El Segundo, California-based company said Wednesday its new Beyond Burger patties and Beyond Beef grounds cut saturated fat by 60% by switching from canola and coconut oils to avocado oil.",
      "publishedAt": "2024-02-21T14:37:14Z",
      "title": "Can a healthier plant-based burger combat falling US sales? Beyond Meat hopes so",
      "url": "https://apnews.com/6e5e9cdf3e4a1d6d84dc532a179adf3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4daca8feceb74ab8a186edf158b8ff38/2682.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}