{
  "articles": [
    {
      "author": "CHRISTOPHER WEBER",
      "description": "LOS ANGELES (AP) — Firefighters scrambled to corral a fast-moving wildfire in the Los Angeles hillsides dotted with celebrity homes as a potentially “life-threatening, destructive” windstorm hit Southern California on Tuesday, fanning the blaze seen for miles while roads were clogged with cars as residents tried to flee.",
      "publishedAt": "2025-01-07T06:10:15Z",
      "title": "Los Angeles residents flee fire as potentially 'life-threatening, destructive' winds gain strength",
      "url": "https://apnews.com/c48661615061eb631784b666cddfa4ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2c0608cdd244a9ba6e334daa43f4eaa/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and ZEKE MILLER",
      "description": "PALM BEACH, Fla. (AP) — President-elect Donald Trump on Tuesday said he would not rule out the use of military force to seize control of the Panama Canal and Greenland, as he declared U.S.",
      "publishedAt": "2025-01-07T17:14:56Z",
      "title": "Trump refuses to rule out use of military force to take control of Greenland and the Panama Canal",
      "url": "https://apnews.com/fa66f8d072eb39c00a8128a8941ede75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/171103e2cef241d8821e6749fdf3f5b8/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A federal judge on Tuesday temporarily blocked the public release of special counsel Jack Smith's report on investigations into Donald Trump as an appeals court weighs a challenge to the disclosure of a much-anticipated document just days before the president-elect reclaims office.",
      "publishedAt": "2025-01-07T13:13:49Z",
      "title": "Judge temporarily blocks release of special counsel report on Trump cases as court fight simmers",
      "url": "https://apnews.com/e73a42b03cc6dc807de32c42dc824f3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65c55c3c2a1643c79dc9ca734f3e6999/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and BEN FINLEY",
      "description": "NORFOLK, Va. (AP) — The plunging polar vortex brought subfreezing temperatures Tuesday to some of the southernmost points of the U.S., threatening to dump snow on parts of Texas and Oklahoma in the coming days and contributing to a power outage in Virginia's capital that made the water unsafe to drink.",
      "publishedAt": "2025-01-07T06:05:02Z",
      "title": "The polar vortex brings its bitter cold to the Southern US",
      "url": "https://apnews.com/3d4a3826d070d9e84d69bbf2800198a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1615cfdad45243eaa5adc1bf36b79134/1920.jpeg"
    },
    {
      "author": "BILL BARROW and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — Nearly 44 years after Jimmy Carter left the nation's capital in humbling defeat, the 39th president returned to Washington for three days of state funeral rites starting Tuesday.",
      "publishedAt": "2025-01-07T11:14:24Z",
      "title": "Jimmy Carter's casket arrives at the US Capitol, where he will lie in state",
      "url": "https://apnews.com/9200a643ca205719d94895c9a5deb36f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ac0bd1d1f264401bfa72f3e1b7c187f/1920.jpeg"
    },
    {
      "author": "MIKE CATALINI",
      "description": "The highly decorated soldier who exploded a Tesla Cybertruck outside the Trump hotel in Las Vegas used generative AI including ChatGPT to help plan the attack, Las Vegas police said Tuesday.Nearly a week after 37-year-old Matthew Livelsberger fatally shot himself, officials said according to writings, he didn't intend to kill anyone else.",
      "publishedAt": "2025-01-07T21:31:49Z",
      "title": "Man who exploded Tesla Cybertruck outside Trump hotel in Las Vegas used generative AI, police say",
      "url": "https://apnews.com/248b41d87287170aa7b68d27581fdb4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0610b1ade3f4adb89380667f8da190a/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The Biden administration on Tuesday asked a federal appeals court to block a plea agreement for accused 9/11 mastermind Khalid Sheikh Mohammed and two co-defendants that would spare them the risk of the death penalty.",
      "publishedAt": "2025-01-07T21:47:08Z",
      "title": "Biden administration asks court to block plea deal for alleged mastermind of 9/11 attacks",
      "url": "https://apnews.com/bb3dd51e3fafc9af0f863f7901c8f1c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/481c00c5430a40c9828b8165a355f59c/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS, HUMERA LODHI and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — More Americans say immigration should be a top focus for the U.S. government in 2025, as the country heads toward a new Republican administration in which President-elect Donald Trump has promised the mass deportations of migrants and an end to birthright citizenship.",
      "publishedAt": "2025-01-07T12:07:01Z",
      "title": "Immigration is a higher priority for Americans than it was a year ago, an AP-NORC poll shows",
      "url": "https://apnews.com/e6cb1e8eaca01d315f56d6560f0cc332",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f123c607da664e1ebac39d54c3aaad7a/3000.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — A strong earthquake shook a high-altitude region of western China and areas of Nepal on Tuesday, damaging hundreds of houses, littering streets with rubble and killing at least 126 people in Tibet.",
      "publishedAt": "2025-01-07T01:51:33Z",
      "title": "Tibet earthquake kills at least 126 people and leaves many trapped",
      "url": "https://apnews.com/ca21bd4848209370b9eebcaf107208df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21e3a43862504640bcbf77c83acdd5f8/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN, BARBARA ORTUTAY and NICHOLAS RICCARDI",
      "description": "Meta chief executive officer Mark Zuckerberg on Tuesday announced changes to content moderation on Facebook and Instagram long sought by conservatives. Incoming President Donald Trump said the new approach was “probably” due to threats he made against the technology mogul.",
      "publishedAt": "2025-01-07T13:30:06Z",
      "title": "Meta eliminates fact-checking in latest bow to Trump",
      "url": "https://apnews.com/413b8495939a058ff2d25fd23f2e0f43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38fdf987f15b4a6c9dad2dce02ceb8c4/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}