{
  "articles": [
    {
      "author": "Kevin Freking",
      "description": "Speaker Mike Johnson’s ability to carry out President Donald Trump's “play call” for funding the government is being put to the test. The House is holding a procedural vote Tuesday on a bill that would end the partial government shutdown. Johnson will need near-unanimous support from his Republican conference to proceed. The legislation funds most of the federal government through Sept. 30 and the Department of Homeland Security for two weeks as lawmakers negotiate potential changes for the agency that enforces the nation’s immigration laws, often referred to as ICE. Trump urged lawmakers to back the bill in a social media post.",
      "publishedAt": "2026-02-03T05:12:18Z",
      "title": "GOP leaders labor for support ahead of key test vote on ending shutdown",
      "url": "https://apnews.com/article/government-shutdown-ice-funding-471e55ba4c3247051739ee1b50b2857a",
      "urlToImage": "https://dims.apnews.com/dims4/default/0762e30/2147483647/strip/true/crop/5328x3550+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fea%2Fc3e194ba4b9704510345ac5dd390%2Febb4e2568cef4b5f9bf132ffd6282021"
    },
    {
      "author": "Jacques Billeaud, Sejal Govindarao",
      "description": "“Today” show host Savannah Guthrie is asking for prayers to help bring her mother home. Authorities in Arizona believe 84-year-old Nancy Guthrie was kidnapped, abducted or otherwise taken against her will. In a social media post, Savannah Guthrie said \"raise your prayers with us and believe with us that she will be lifted by them in this very moment.” For a second day Tuesday, “Today” opened with the disappearance and Savannah Guthrie wasn't at the anchor’s desk. The Pima County sheriff says it’s imperative Nancy Guthrie is found soon because she could die without her medication. She was last seen Saturday night at her home in the Tucson area.",
      "publishedAt": "2026-02-03T13:20:15Z",
      "title": "'Today' host Savannah Guthrie seeks prayers for missing mom in Arizona",
      "url": "https://apnews.com/article/savannah-guthrie-mother-missing-arizona-tucson-74d845b070fefe2d94cb92d655308e91",
      "urlToImage": "https://dims.apnews.com/dims4/default/039ef24/2147483647/strip/true/crop/3485x2322+8+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F89%2F33973dc649dbe34e480442b6c920%2F2dfae915dd9c47bab6b313653ef01709"
    },
    {
      "author": "Sylvie Corbet",
      "description": "French prosecutors have searched the offices of Elon Musk’s social media platform X as part of an investigation into alleged offences, including spreading child sexual abuse images and deepfakes. The investigation began in January last year and involves the prosecutors’ cybercrime unit. Prosecutors are looking into alleged complicity in possessing and spreading pornographic images of minors, among other charges. They have asked Elon Musk and former CEO Linda Yaccarino to attend voluntary interviews on April 20. Employees of X have also been summoned as witnesses. Europol is supporting the French authorities in this investigation.",
      "publishedAt": "2026-02-03T10:50:45Z",
      "title": "Paris prosecutors search Elon Musk's social media platform X offices",
      "url": "https://apnews.com/article/france-x-investigation-seach-elon-musk-1116be84d84201011219086ecfd4e0bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/a38bc68/2147483647/strip/true/crop/7681x5118+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2Fd0%2F47e3b063ae6efd879a729a33596e%2F255b9d2c8cd447a5ab63ce0bc23df02b"
    },
    {
      "author": "Jill Lawless",
      "description": "British politician Peter Mandelson is quitting the House of Lords over questions about his ties to Jeffrey Epstein. The Speaker of the House of Lords says Mandelson will retire effective Wednesday. He faces a potential police investigation over claims he passed sensitive government information to Epstein. The British government sent police a file on Tuesday about Mandelson's alleged leaks. Prime Minister Keir Starmer says he's is appalled by the revelations in newly released Epstein files. The files suggest Mandelson shared market-sensitive information about the 2008 financial crisis. Mandelson resigned from the Labour Party on Sunday to avoid further embarrassment.",
      "publishedAt": "2026-02-03T10:40:09Z",
      "title": "Peter Mandelson quits House of Lords over Jeffrey Epstein questions",
      "url": "https://apnews.com/article/uk-peter-mandelson-jeffrey-epstein-allegations-police-bd7d7f9831ad1eeaee4e5c7a951f2aeb",
      "urlToImage": "https://dims.apnews.com/dims4/default/a108c09/2147483647/strip/true/crop/4583x3054+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F0b%2F3ae27bdefcacf772864a93493d04%2Fee686039062c4bdb97337641c1428e04"
    },
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump is set to welcome Colombian President Gustavo Petro to the White House for talks. Tuesday's meeting comes weeks after Trump accused the Colombian leader of pumping cocaine into the United States and threatened military action against his South American country. U.S. administration officials say the meeting will focus on regional security cooperation and counternarcotics efforts. Bad blood between the leaders looms large ahead of the sit-down. Trump, on the heels of an operation to capture Venezuela’s Nicolás Maduro, warned Petro last month that he could be next. The conservative Trump and leftist Petro are ideologically far apart, but both leaders share a tendency for verbal bombast and unpredictability. That's giving the visit an anything-could-happen vibe.",
      "publishedAt": "2026-02-03T05:08:11Z",
      "title": "What to expect when Trump and Colombia's Petro meet on Tuesday",
      "url": "https://apnews.com/article/trump-colombia-petro-venezuela-36bc47d628886ea20c471a63156ec550",
      "urlToImage": "https://dims.apnews.com/dims4/default/c60485d/2147483647/strip/true/crop/2307x1537+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2Fcf%2F1de38f38197c2c74d1c677bb9637%2F7b59a9c7d81546d78d6a76ec1e46f344"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy, Sam Metz",
      "description": "Palestinians have gathered at Gaza’s Rafah crossing with Egypt, hoping to pass through after it reopened Monday. Delays and uncertainty have marred the process. On the Egyptian side, Palestinians who fled earlier in the Israel-Hamas war await return. On the Gaza side, those needing medical treatment unavailable in Gaza hope to cross. The crossing's reopening is seen as a step forward in the fragile ceasefire, but only a small number have crossed so far. Health officials emphasize the urgent need for medical supplies and evacuations. The situation remains tense with ongoing security and bureaucratic challenges.",
      "publishedAt": "2026-02-03T10:57:42Z",
      "title": "More Palestinians gather on both sides of Gaza's Rafah crossing",
      "url": "https://apnews.com/article/rafah-gaza-israel-palestinians-egypt-crossing-fb4fb8edf3ffd227a576cf01f8ce9b64",
      "urlToImage": "https://dims.apnews.com/dims4/default/b33d9c7/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2Fd0%2Fec1adb579cd98703335d7dfd7c3e%2F6c08d2eb87f746dd9e241353676fd2ef"
    },
    {
      "author": "Kamila Hrabchuk",
      "description": "Ukrainian President Volodymyr Zelenskyy says that Russia has launched a major attack on Ukraine with around 450 drones and 70 missiles. The strikes reported Tuesday came a day before U.S.-brokered talks between Russia and Ukraine in Abu Dhabi. Zelenskyy said that Russia targeted the power grid again in five regions of Ukraine in a bid to deny civilians light, heating and water during a harsh winter. At least 10 people were wounded. Zelenskyy urged allies to send more air defense supplies and increase pressure on Russia. Talks between Moscow and Kyiv have been described as constructive. But a comprehensive settlement remains distant.",
      "publishedAt": "2026-02-03T09:09:54Z",
      "title": "Russia fires 450 drones and 70 missiles at Ukraine, a day before US-brokered talks",
      "url": "https://apnews.com/article/russia-ukraine-war-missile-drone-attack-electricity-c10dbc6b621e196606fc79caab0eaad5",
      "urlToImage": "https://dims.apnews.com/dims4/default/37cb75d/2147483647/strip/true/crop/3831x2553+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F3e%2Fe42e5d1f5916eb47fb99617be147%2F49052046c40a4dfc8c366b51149d5d4d"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran’s president says he has instructed the country’s foreign minister to “pursue fair and equitable negotiations” with the United States. The comments on Tuesday from reformist President Masoud Pezeshkian represent the first clear signal from Iran that it may take part in negotiations being organized by Turkey. Pezeshkian made the comments on X. He said: “I have instructed my Minister of Foreign Affairs, provided that a suitable environment exists — one free from threats and unreasonable expectations — to pursue fair and equitable negotiations, guided by the principles of dignity, prudence, and expediency.” The U.S. has yet to acknowledge the talks will take place.",
      "publishedAt": "2026-02-03T05:20:10Z",
      "title": "Iran’s president seeks negotiations with the United States",
      "url": "https://apnews.com/article/iran-trump-protests-negotiations-nuclear-deal-9758adb33c0d01c70a07ad7de0f5221b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a86f059/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F77%2Fdf7eea9a4578933bd693207b7f07%2Fea5a975fd6894af482d240d95cdebc47"
    },
    {
      "author": "Collin Binkley",
      "description": "President Donald Trump is demanding a $1 billion payment from Harvard University to end his prolonged standoff with the Ivy League campus, doubling the amount he sought previously as both sides appear to move further from reaching a deal. The president raised the stakes on social media Monday night, saying Harvard has been “behaving very badly.” He said the university must pay the government directly as part of any deal — something Harvard has opposed. Trump’s comments on Truth Social came in response to a New York Times report saying the president had dropped his demand for a financial payment, lowering the bar for a deal.",
      "publishedAt": "2026-02-03T16:36:29Z",
      "title": "Trump demands $1 billion from Harvard as standoff deepens",
      "url": "https://apnews.com/article/trump-harvard-payment-ivy-league-1f0653854c0e6b7e387626d891820033",
      "urlToImage": "https://dims.apnews.com/dims4/default/77dd0d4/2147483647/strip/true/crop/4000x2665+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F27%2F89ca29066cbe763bb8303bdf66ba%2F42d19863def84acaa27b7932d01d9095"
    },
    {
      "author": "Andrew Dampf",
      "description": "Lindsey Vonn is “confident” she can compete at the Milan Cortina Winter Olympics beginning this week despite the left knee injury she sustained in a crash four days ago. Vonn says she “completed ruptured” her ACL, has bone bruising “plus meniscal damage.” She's had three days of physical therapy and consultations with doctors. Vonn went skiing on Tuesday with a brace on her knee. She says \"It feels stable, it feels strong.” She is “confident” to race. Vonn crashed in a downhill in Crans-Montana, Switzerland, on Friday and ended up in the safety nets.",
      "publishedAt": "2026-02-03T15:07:39Z",
      "title": "Vonn 'confident' she will race at Olympics despite 'completely ruptured' ACL in left knee",
      "url": "https://apnews.com/article/vonn-crash-injury-olympics-milan-bdb3be60608cc894af5f2c0c5a54dea1",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ce008b/2147483647/strip/true/crop/5084x3388+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7f%2F9a%2Fbcc70df27e2ac55cffb742a4848f%2F05c2cb488ded4724be4236849be5a4b1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}