{
  "articles": [
    {
      "author": "ZEKE MILLER, STEVE PEOPLES and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden worked forcefully Friday to quell Democratic anxieties over his unsteady showing in his debate with former President Donald Trump, as elected members of his party closed ranks around him in an effort to shut down talk of replacing him atop the ticket.",
      "publishedAt": "2024-06-28T15:28:07Z",
      "title": "Biden concedes debate fumbles but declares he will defend democracy. Dems stick by him -- for now",
      "url": "https://apnews.com/b93d7ffaad75fd423ea3953fe16287f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd396de2091644d7800d1e2e7a3002b3/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden's halting debate performance has led some in his own party to begin questioning whether he should be replaced on the ballot before November.",
      "publishedAt": "2024-06-28T04:58:33Z",
      "title": "Here's why it would be tough for Democrats to replace Joe Biden on the presidential ticket",
      "url": "https://apnews.com/7aa836b0ae642a68eec86cc0bebd3772",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4d0a13cc21046849fb97c2e2b24fe10/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Friday limited a federal obstruction law that has been used to charge hundreds of Capitol riot defendants as well as former President Donald Trump.",
      "publishedAt": "2024-06-28T14:48:31Z",
      "title": "Supreme Court makes it harder to charge Capitol riot defendants with obstruction, charge Trump faces",
      "url": "https://apnews.com/2cdba47baa5cea8177d651de751760a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a640ed92f55b45f9b83f2e7cb7465ef9/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court cleared the way for cities to enforce bans on homeless people sleeping outside in public places on Friday, overturning a ruling from a California-based appeals court that found such laws amount to cruel and unusual punishment when shelter space is lacking.",
      "publishedAt": "2024-06-28T14:06:46Z",
      "title": "Divided Supreme Court rules in major homelessness case that outdoor sleeping bans are OK",
      "url": "https://apnews.com/506ac68dc069e3bf456c10fcedfa6bee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51db8aaf61e1491a807201691a4a7384/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — Federal rules that impact virtually every aspect of everyday life, from the food we eat and the cars we drive to the air we breathe, could be at risk after a wide-ranging Supreme Court ruling Friday.",
      "publishedAt": "2024-06-28T20:44:03Z",
      "title": "Chevron takeaways: Supreme Court ruling removes frequently used tool from federal regulators",
      "url": "https://apnews.com/536cb6a7e4bc744bbaa3f058637bbf6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a0ed1f3e88e4081996f1c89a364b20a/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. military-built pier has been pulled again from the Gaza shore due to rough seas, and its future role in the distribution of aid to Palestinians is uncertain.",
      "publishedAt": "2024-06-28T19:53:33Z",
      "title": "This is how the US-built pier to bring aid to Gaza has worked — or not",
      "url": "https://apnews.com/c4d464cb01bdf86e71c38519fb635cde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65b0d81bbaf24f3ab73986a40728f0ba/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — A court ruling on Friday put an involuntary manslaughter case against Alec Baldwin on track for trial in early July as a judge denied a request to dismiss the case on complaints that key evidence was damaged by the FBI during forensic testing.",
      "publishedAt": "2024-06-28T22:28:53Z",
      "title": "Alec Baldwin’s case on track for trial in July as judge denies request to dismiss",
      "url": "https://apnews.com/cdeb9c00c73474bb0cb24b3fd8bae003",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65330bd0ee0f47138dc7c646d8b5cae3/2044.jpeg"
    },
    {
      "author": "MEGAN JANETSKY and PAOLA FLORES",
      "description": "LA PAZ, Bolivia (AP) — The death threats came rolling in shortly after Gimena Silva’s husband was detained on accusations that he took part in a failed coup in Bolivia.“They call us, they say that if we do anything, say anything, they’re going to disappear us.",
      "publishedAt": "2024-06-28T13:00:34Z",
      "title": "Families of 21 detained for coup in Bolivia plead for mercy, say loved ones were 'tricked'",
      "url": "https://apnews.com/e4e8f20fe61f6a61ffc54fe15f556798",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1883b7d70e374200bf3b6581afd0818f/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL and NASSER KARIMI",
      "description": "DUBAI, United Arab Emirates (AP) — Iranians voted on Friday in a snap election to replace the late hard-line President Ebrahim Raisi, with the race's sole reformist candidate vowing to seek “friendly relations” with the West in an effort to energize supporters in a vote beset by apathy.",
      "publishedAt": "2024-06-28T04:32:20Z",
      "title": "Polls close in Iran presidential election held after hard-liner's death and as Mideast tensions rise",
      "url": "https://apnews.com/bf09cc8c219750d31bc91042f203cc20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bd27cb12ee74f118121cdf8280339b6/1920.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "Two NASA astronauts will stay longer at the International Space Station as engineers troubleshoot problems on Boeing’s new space capsule that cropped up on the trip there.",
      "publishedAt": "2024-06-28T18:32:32Z",
      "title": "NASA astronauts will stay at the space station longer for more troubleshooting of Boeing capsule",
      "url": "https://apnews.com/2fe81a09bcd77563dadae2f86d4275fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97b3c635ab2745178a5246f85dd84ecf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}