{
  "articles": [
    {
      "author": "JIM MUSTIAN, JACK BROOK, STEPHEN SMITH and SARA CLINE",
      "description": "NEW ORLEANS (AP) — New Orleans mourned, wept and danced at a vigil Saturday evening along the famous thoroughfare where a man rammed a pickup truck into a crowd, killing and injuring revelers who were there to celebrate the new year.",
      "publishedAt": "2025-01-04T15:27:20Z",
      "title": "New Orleans mourns victims of truck attack with tearful vigil and celebration of life",
      "url": "https://apnews.com/15400d7a4cb29c9cfce212b99cac637b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a19f8a435a947e0a998c611c1248d45/1920.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "The night, like countless others Bourbon Street has welcomed over the decades, started out ripe for celebration. With temperatures hovering in the 50s (10-15 Celsius) hours after the arrival of the new year, the open-air party pulsing down New Orleans’ famed nocturnal artery was still hot, drawing revelers from near and far.",
      "publishedAt": "2025-01-05T05:03:08Z",
      "title": "Drawn to New Orleans' iconic street of celebration, a night of partying becomes a nightmare",
      "url": "https://apnews.com/149bdb38ca0d7fc8e184eb3d32b5de40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93bcf20b61984f3f8ca8728841b69063/3000.jpeg"
    },
    {
      "author": "CARA ANNA",
      "description": "NAIROBI, Kenya (AP) — Jimmy Carter was the first U.S. president to make a state visit to sub-Saharan Africa. He once called helping with Zimbabwe’s transition from white rule to independence “our greatest single success.” And when he died at 100, his foundation’s work in rural Africa had nearly fulfilled his quest to eliminate a disease that afflicted millions, for the first time since the eradication of smallpox.",
      "publishedAt": "2025-01-05T05:05:23Z",
      "title": "'Our country ignored Africa,' Jimmy Carter said. He didn't",
      "url": "https://apnews.com/06e637a7554c1a1109bd2a9e1e5390de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/696f26ebda6a42bcb4fd8318aefe516f/2998.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and BRIAN WITTE",
      "description": "MISSION, Kan. (AP) — Road conditions were deteriorating Saturday in the central U.S. as a winter storm brought a mix of snow, ice and plunging temperatures, with forecasts calling for the dreaded combo to spread eastward in the coming days.",
      "publishedAt": "2025-01-04T19:40:46Z",
      "title": "Drivers skid and crash as wintry mix grips central US before moving east",
      "url": "https://apnews.com/8dfabc4c2e17d86a270bdaa350f5e148",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e415e85566aa43d5986aa26c6e5e0c7d/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — Heavy snow and freezing rain have brought widespread disruption across the U.K., with several major airports forced to suspend flights and many key roads in the north of England unnavigable.",
      "publishedAt": "2025-01-05T10:02:58Z",
      "title": "Heavy snow brings widespread disruption across the UK",
      "url": "https://apnews.com/98fcfebc438b521ef7707e6abfa78753",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0bc45b1dd2414a248db82c7e1b98221d/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed at least 21 people, including at least two children, on Saturday in Gaza, hospital staff said, while a new effort at ceasefire talks was underway in Qatar after nearly 15 months of war.",
      "publishedAt": "2025-01-04T14:21:57Z",
      "title": "Israeli airstrikes in Gaza kill at least 21, hospital workers say, as talks underway",
      "url": "https://apnews.com/a6f9f03b1c5922a2e6f223f17d9d27cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3151fa71386475887d9dc131956788b/1920.jpeg"
    },
    {
      "author": "VOLODYMR YURCHUK and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Ukraine's President Volodymyr Zelenskyy said he will again call on allies to boost its air defenses at this week's meeting in Germany, as U.S.",
      "publishedAt": "2025-01-05T09:53:59Z",
      "title": "Ukraine will ask allies to boost its air defenses at a meeting in Germany, Zelenskyy says",
      "url": "https://apnews.com/f6e591c4494e6a1e8560cbd86ab5693e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be736e09dccd4f59b3bc2c3960a80612/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Hundreds of South Koreans, bundled up against freezing temperatures and snow, rallied overnight into Sunday near the residence of impeached President Yoon Suk Yeol, calling for his ouster and arrest, as authorities prepared to renew their efforts to detain him over his short-lived martial law decree.",
      "publishedAt": "2025-01-05T04:01:10Z",
      "title": "South Korean protesters brave cold to demand Yoon's ouster as detention deadline looms",
      "url": "https://apnews.com/c16cb90593c7a99673d12ffa0853dda8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c54634cc69734e79bf42688a6e5993c2/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN and MARC LEVY",
      "description": "WASHINGTON (AP) — By blocking a Japanese company’s takeover of U.S. Steel, President Joe Biden said he was protecting good jobs in the American heartland.",
      "publishedAt": "2025-01-05T05:07:09Z",
      "title": "Biden's decision to block Nippon Steel takeover creates uncertainty for U.S. Steel workers",
      "url": "https://apnews.com/cbd8022487b361dcad942c45bc3e12d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cd59bce6c2f44c7b53727940bbf9596/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "After a rocky few years and the disbanding of the Hollywood Foreign Press Association, the Golden Globes have seemingly stabilized. Now the question is: Can they still put on a good show?",
      "publishedAt": "2025-01-05T05:01:37Z",
      "title": "The Golden Globes are Sunday night. Here are five things to look for and how to watch them",
      "url": "https://apnews.com/efea6919904ccc8bebdc17197369c217",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e050a72aabd49b48a1fa8d0de7c4f57/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}