{
  "articles": [
    {
      "author": "Steve Karnowski",
      "description": "Federal officials have announced an end to an immigration crackdown in Minnesota that led to mass detentions, protests and two deaths. Border czar Tom Homan made the announcement during a news conference Thursday. U.S. Immigration and Customs Enforcement launched Operation Metro Surge on Dec. 1. Federal authorities say the sweeps focused on the Minneapolis-St. Paul metro area have led to the arrest of more than 4,000 people. While the Trump administration has called those arrested “dangerous criminal illegal aliens,” many people with no criminal records, including children and U.S. citizens, have also been detained.",
      "publishedAt": "2026-02-12T14:20:30Z",
      "title": "Border czar Homan says Minnesota immigration crackdown is ending",
      "url": "https://apnews.com/article/minnesota-metro-surge-ice-523d18d5d75c81cbf9f24c602f1884ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/e825aa2/2147483647/strip/true/crop/3049x2032+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2Ff9%2Fd641136d884ef26230d672b9842b%2F6a048ebf299a4981a66a184e094cfcda"
    },
    {
      "author": "Ty ONeil",
      "description": "Investigators are pleading with people to share home surveillance camera footage from specific dates leading up to the disappearance of Nancy Guthrie as they deal with thousands of tips in their hope to crack the case. Guthrie, the 84-year-old mother of “Today” show host Savannah Guthrie, has been missing from her Tucson-area home since Feb. 1. News stations in Tucson reported Wednesday that people with Ring doorbell cameras in the area got an alert saying investigators are requesting footage from Jan. 11 between 9 p.m. and midnight. The stations also reported that a pair of black gloves were recovered during agents’ search and have been submitted for DNA analysis.",
      "publishedAt": "2026-02-12T15:08:28Z",
      "title": "Investigators seek neighbors' security videos in Nancy Guthrie case",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-arizona-2765739e230d89d2d01dce62e064c33b",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d773c3/2147483647/strip/true/crop/1476x983+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2Fe1%2F65e8c9e0352e1c0d5c3e30adc7b6%2Fa060c474f9604f07af89b9e431081fcc"
    },
    {
      "author": null,
      "description": "The remote Canadian community of Tumbler Ridge is mourning after a mass shooting in killed eight people, mostly children, plus the shooter. Residents of the British Columbia have been building a memorial with lights and stuffed animals and gathered late Wednesday for a cold vigil. Police say the suspect, 18-year-old Jesse Van Rootselaar, died from an apparent self-inflicted wound. Authorities say police had visited her home before for mental health checks. Police say she first killed her mother and stepbrother, then attacked the nearby school. The motive remains unclear. Prime Minister Mark Carney says Canada mourns with the town.",
      "publishedAt": "2026-02-12T15:13:36Z",
      "title": "Remote Canadian community of Tumbler Ridge grapples with aftermath of mass shooting",
      "url": "https://apnews.com/article/canada-school-shooting-british-columbia-bef756c3d04d26b76c49a4e2b5154002",
      "urlToImage": "https://dims.apnews.com/dims4/default/76ed478/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F10%2Feea547b0b2fd1be68816ca623f5a%2Fa4f2cf691d6b4edaa94435325a9a45df"
    },
    {
      "author": "Susie Blann, Illia Novikov",
      "description": "Russia has attacked Ukrainian cities again overnight as Ukraine accuses Russia of dragging its feet on new U.S.-brokered peace talks. Ukrainian President Volodymyr Zelenskyy says Washington is proposing talks next week in Miami or in Abu Dhabi, in the United Arab Emirates. He says Ukraine confirms it can attend but Russia is hesitating. Zelenskyy says major disputes still block a deal, including issues of occupied land and security guarantees. He also says Russia is ignoring a proposed ceasefire that impacts the energy sector. Ukraine’s air force said on Thursday that Russia fired drones and missiles at Kyiv, Kharkiv, Dnipro and Odesa. Officials report injuries, damaged homes and major heating outages in the Ukrainian capital.",
      "publishedAt": "2026-02-12T10:29:18Z",
      "title": "Russia fires missile and drone barrage at Ukrainian cities",
      "url": "https://apnews.com/article/russia-ukraine-war-talks-drones-missiles-1e788221fd0e01158da721b2259f071a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e9a7433/2147483647/strip/true/crop/5166x3442+4+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F30%2F2754775cd36aee6b6e01fdf5e6b0%2F798f00a96312448f85de0eb5764f5628"
    },
    {
      "author": "Eric Tucker, Alanna Durkin Richer",
      "description": "A top Democrat is calling for a watchdog investigation after photographs emerged suggesting that the Justice Department has been tracking the search history of lawmakers who are reviewing files from the Jeffrey Epstein investigation. Rep. Jamie Raskin, the top Democrat on the House Judiciary Committee, asked the Justice Department’s inspector general to investigate what he characterized as “spying” on members of Congress who this week have reviewed less-redacted versions of the Epstein files at a department annex and on department-owned computers. Spokespeople for the Justice Department did not immediately return a request seeking comment Thursday. Representatives for the inspector general’s office also did not immediately respond to an email seeking comment.",
      "publishedAt": "2026-02-12T15:41:59Z",
      "title": "Democrats accuse Justice Department of 'spying' on lawmakers reviewing Epstein files",
      "url": "https://apnews.com/article/epstein-files-bondi-raskin-13eeb9ccadcc03ba34922d8ba95ce220",
      "urlToImage": "https://dims.apnews.com/dims4/default/589f060/2147483647/strip/true/crop/4000x2665+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F67%2F732d1bfb9cde38fcf7d060eb7e33%2Fa34e5f5315384394bb68444b5abf426d"
    },
    {
      "author": "Steve Peoples, Amelia Thomson-DeVeaux",
      "description": "A new AP-NORC poll finds that about 6 in 10 U.S. adults believe that President Donald Trump has “gone too far” in sending federal immigration agents into U.S. cities. The survey also shows that the Republican Party’s political advantage on Trump's signature domestic issue has shrunk since October. The new polling comes as the nation watches the human impact of Trump’s immigration crackdown in Minnesota, where thousands of heavily armed masked agents have descended upon the capital city. About 9 in 10 Democrats and about 7 in 10 independents say Trump has “gone too far” in sending federal immigration agents into U.S. cities, compared to only about one-quarter of Republicans.",
      "publishedAt": "2026-02-12T12:05:08Z",
      "title": "Trump's immigration enforcement in cities is unpopular: AP-NORC poll",
      "url": "https://apnews.com/article/trump-immigration-ice-minneapolis-deportation-42aff472ccf1ecd7b92ba0c90469c9e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/2553603/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F0a%2Fbb9cc6c4e0402ba83795c4c3f748%2Fa4e720a4670a45dea5a19ea05ac2c47f"
    },
    {
      "author": null,
      "description": "A U.S. judge says President Donald Trump’s $10 billion lawsuit against the BBC can go to trial in 2027. Judge Roy K. Altman of the federal court for the Southern District of Florida rejected an attempt by Britain’s national broadcaster to delay proceedings. He set a February 2027 trial date. Trump filed a lawsuit in December over the way the BBC edited a speech he gave on Jan. 6, 2021. The claim seeks $5 billion in damages for defamation and $5 billion for unfair trade practices. The broadcaster has apologized to Trump over the edit of the Jan. 6 speech. But the publicly funded BBC rejects claims it defamed him.",
      "publishedAt": "2026-02-12T14:32:29Z",
      "title": "US judge says Trump's defamation case against BBC to go to trial next year",
      "url": "https://apnews.com/article/donald-trump-bbc-lawsuit-florida-federal-court-e41bc699da7e010218f87a95a364350a",
      "urlToImage": "https://dims.apnews.com/dims4/default/158afd4/2147483647/strip/true/crop/5616x3742+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F91%2F17c45bc1e5df5af10b03d3742c56%2F6363437dfaaf4a38860d3346cc4b08de"
    },
    {
      "author": "Mike Stobbe, Ali Swenson",
      "description": "Robert F. Kennedy Jr. is reshaping U.S. health policy as HHS secretary, and doctors say his changes are eroding trust. Survey results show Americans' confidence keeps sliding, not rising. Kennedy has cut vaccine guidance, dismissed advisers and pushed claims medical groups call unverified. Doctors warn this confusion leads people to skip shots. They say that raises the risk of outbreaks. Polls from KFF and Gallup show trust in the CDC falling across groups. HHS says Kennedy is adding transparency and accountability. Critics say he is doing the opposite.",
      "publishedAt": "2026-02-12T15:03:30Z",
      "title": "Trust in US health agencies appears to be eroding",
      "url": "https://apnews.com/article/rfk-jr-kennedy-cdc-covid-health-trust-7ef5f0e2c6f91ce6d908cb58f9e2fcb2",
      "urlToImage": "https://dims.apnews.com/dims4/default/629e1fb/2147483647/strip/true/crop/7472x4979+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F19%2F33e5a0bb10c401273ca105622ffe%2Fb7fcbe2be7344ba2a98032e4df51d97a"
    },
    {
      "author": "Andrea Rodríguez",
      "description": "Mexico is sending two Navy ships with humanitarian aid to Cuba as tighter U.S. pressure worsens the island’s energy crisis. On Thursday, the ships carry large loads of food, hygiene supplies, and powdered milk. Mexico says one ship brings about 536 tons of items like rice, beans, canned fish, and oil. Mexico says the second ship carries over 277 tons of powdered milk. President Claudia Sheinbaum says Mexico ships aid while talks continue on oil supplies. U.S. President Donald Trump threatens tariffs on countries supplying oil to Cuba. Cuba reports blackouts and broad disruption from sanctions.",
      "publishedAt": "2026-02-12T13:50:39Z",
      "title": "Mexican Navy ships deliver humanitarian aid to Cuba as US blockade deepens crisis",
      "url": "https://apnews.com/article/mexico-cuba-humanitarian-aid-havana-us-sanctions-52c44db94c9423511d67366662e78ac4",
      "urlToImage": "https://dims.apnews.com/dims4/default/66f16ad/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F51%2F2ae56892db6b7a508b01bcd37212%2F6c85d941a1ca4137bdea5ba831d4b92c"
    },
    {
      "author": "Chan Ho-him, Matt Ott",
      "description": "U.S. stocks are ticking higher and once again flirting with a record following mixed profit reports from big companies. The S&P 500 rose 0.3% in early trading Thursday and was sitting just below its all-time high set late last month. The Dow Jones Industrial Average rose 179 points, and the Nasdaq composite climbed 0.3%. McDonald’s rose after reporting a stronger profit for the latest quarter than analysts expected. AppLovin and Cisco Systems fell after their reports. Treasury yields edged lower in the bond market after a report said slightly more workers filed for unemployment benefits last week than forecast.",
      "publishedAt": "2026-02-12T04:55:22Z",
      "title": "US stocks edge higher following mixed profit reports from big companies",
      "url": "https://apnews.com/article/stocks-markets-fed-jobs-profit-45f8d8df807d4b7ed9127afc4b5809c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ad0fa5/2147483647/strip/true/crop/4040x2692+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F3f%2F0ca6a0f779f1630fd48984c8eaf0%2F18c42c80e71e4b08b5c8f2ed7ee4cd34"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}