{
  "articles": [
    {
      "author": null,
      "description": "Authorities say two people in New Jersey were killed after their vehicle was swept up in floodwaters during a storm that moved across the U.S. Northeast overnight. Authorities said Tuesday their names haven't been released yet. Meanwhile, York City’s subway system is fully operational following overnight heavy rains. But some roads in New Jersey and Pennsylvania remained closed and there were dozens of flight delays and cancelations at area airports, including 159 total cancelations at Newark Liberty Airport.",
      "publishedAt": "2025-07-15T13:10:32Z",
      "title": "2 dead in New Jersey after flood waters carry away vehicle during heavy rains",
      "url": "https://apnews.com/article/new-york-city-new-jersey-flooding-f55d98547abc20e94dbb6be16a7f72cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/2b545f2/2147483647/strip/true/crop/3200x1800+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F49%2Ffcc0a7208c4fce51b56a67b40577%2F576dd22c55ab499db07ba1afe4ce14f0"
    },
    {
      "author": null,
      "description": "President Donald Trump’s strategy has been to downplay the uproar over the Jeffrey Epstein sex trafficking case as his supporters demand the Justice Department release much-hyped records in the investigation. Trump's problem is the nothing-to-see-here approach doesn’t work for those who've learned from him they must not give up until the government’s deepest, darkest secrets are exposed. Last week, the Justice Department and the FBI abruptly walked back the notion there's an Epstein client list of elites who participated in the wealthy New York financier’s trafficking of underage girls. The Republican president quickly defended Attorney General Pam Bondi, but the online backlash was swift.",
      "publishedAt": "2025-07-15T11:04:49Z",
      "title": "Trump's embrace of conspiracy theories haunts him with Epstein case",
      "url": "https://apnews.com/article/trump-epstein-conspiracy-theories-bondi-bongino-fbi-a143076353acbc1193cb9697e7fc4a90",
      "urlToImage": "https://dims.apnews.com/dims4/default/a0d6c91/2147483647/strip/true/crop/14845x8350+0+775/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F8e%2Fafb2d5bebc6c4ca0afc6e85011b9%2F0e75b10afbd7443abf9931ace520814f"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Trump administration says it is ending deployment of 2,000 National Guard troops in Los Angeles",
      "url": "https://apnews.com/article/immigration-raids-los-angeles-national-guard-4424658cc059df31317a83cb53c2b59e",
      "urlToImage": null
    },
    {
      "author": null,
      "description": "Gaza health officials say Israeli strikes overnight and into Tuesday killed more than 90 Palestinians across the Gaza Strip, including several families. One strike in the northern Shati refugee camp killed a 68-year-old Hamas member of the Palestinian legislature, as well as a man and a woman and their six children in the same building, according to officials from Shifa Hospital, where the casualties were taken. There was no immediate comment from the Israeli military on the strikes.",
      "publishedAt": "2025-07-15T15:27:08Z",
      "title": "Israeli strikes in Gaza kill 93 Palestinians, including several families, health officials say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-07-15-2025-43e559363cba4eb99cd7238c00d1de12",
      "urlToImage": "https://dims.apnews.com/dims4/default/a214d01/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fcb%2Fae31c6aad39b4ed091252e46505f%2Fe6f045c3650948fe8a528fd434033262"
    },
    {
      "author": null,
      "description": "President Donald Trump is downplaying the possibility of sending Ukraine long-range weapons as Kyiv awaits an injection of U.S. weaponry that it hopes will help it beat back an intensifying Russian air offensive. Trump on Tuesday offered a more cautious tone on what to expect after he threatened Russia a day earlier with steep tariffs if President Vladimir Putin doesn’t soon end the three-year conflict. Trump also told the BBC in an interview published Tuesday that he trusts “almost nobody” when asked whether he trusts Putin. It was further evidence of a break with Putin, whom he has long spoken admiringly of.",
      "publishedAt": "2025-07-15T21:10:23Z",
      "title": "Trump downplays possibility of sending Ukraine long-range weapons",
      "url": "https://apnews.com/article/trump-russia-ukraine-longrange-weapons-ccde532a4bd6c2c1d6bb73b28d90b0f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/227f35b/2147483647/strip/true/crop/4808x2705+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2Fde%2Fd0f335db0ee25cfd215079013da7%2F4a84487a10f44d108d512f4ee1270c01"
    },
    {
      "author": null,
      "description": "President Donald Trump says he plans to place tariffs of over 10% on smaller countries, including nations in Africa and the Caribbean. “We’ll probably set one tariff for all of them,” Trump said Tuesday, adding that it could be “a little over 10% tariff” on goods from at least 100 nations. Commerce Secretary Howard Lutnick interjected that the nations with goods being taxed at these rates would be in Africa and the Caribbean, places that generally do relatively modest levels of trade with the U.S. and would be relatively insignificant for addressing Trump’s goals of reducing trade imbalances with the rest of the world.",
      "publishedAt": "2025-07-15T23:28:16Z",
      "title": "Trump to put tariffs of over 10% on smaller nations",
      "url": "https://apnews.com/article/trump-tariffs-africa-caribbean-c0307a66f3fbab26c0ece454d78e48cb",
      "urlToImage": "https://dims.apnews.com/dims4/default/415a85b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F3f%2Fbb498fb0cebce83634ba08874adf%2Ffae0c9ad787e4e2e994e8c7556028986"
    },
    {
      "author": null,
      "description": "Two men who cut down England’s beloved Sycamore Gap tree have been sentenced to over four years in prison. The tree stood for nearly 150 years near Hadrian’s Wall before it was felled in September 2023. Prosecutors called it a “moronic mission.” The two local men were convicted of criminal damage for destroying the tree and harming the ancient Roman wall. The tree was famous for its scenic location and a cameo in the 1991 film “Robin Hood: Prince of Thieves.” The judge on Tuesday concluded the two men had largely done it for the “sheer bravado.”",
      "publishedAt": "2025-07-15T04:10:19Z",
      "title": "Sycamore Gap vandals sentenced to more than 4 years in prison",
      "url": "https://apnews.com/article/britain-sycamore-gap-tree-trial-sentencing-chainsaw-28a6db1552e6acea118aa7e8bcf69ecb",
      "urlToImage": "https://dims.apnews.com/dims4/default/d244f91/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2Fc6%2F57e4c692c21aae00e7a866f52d2d%2F29485d195f92419da45769c8313bfd8c"
    },
    {
      "author": null,
      "description": "The Emmy nominations are in, and familiar favorites like “Hacks,” “The Bear,” and “Abbott Elementary” dominate the comedy categories. However, there were some differences, too. Kathy Bates became the oldest lead drama actress nominee at 77 for “Matlock.” Apple TV+’s “Shrinking” gained traction with seven nominations, including Harrison Ford’s first Emmy nod. Netflix’s “Adolescence” scored 13 nominations, while “The Handmaid’s Tale” earned just one as it concluded its six-season run. Meanwhile, “The Voice” missed a reality competition nod for the first time since 2012, and Kristen Bell received her first-ever Emmy nomination for “Nobody Wants This.”",
      "publishedAt": "2025-07-15T17:25:13Z",
      "title": "Emmys: A look at snubs and surprises from 2025 nominations",
      "url": "https://apnews.com/article/emmy-2025-nominations-snubs-surprises-4ff53ba1291c6689ddb16cdd7d7218b8",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e47c3f/2147483647/strip/true/crop/5835x3282+0+47/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2Fe7%2Ff1b8a05172feea3ccc29f648b197%2F8d29c9eec2da457d9736ba84e12ed086"
    },
    {
      "author": null,
      "description": "Apple TV+ dominated the top categories at the Emmy nominations, with \"Severance\" leading all shows with 27 nods and \"The Studio\" topping comedies with a record-tying 23. \"Severance\" got lead acting nominations for Adam Scott and Britt Lower, and a directing nod for Ben Stiller. HBO also shined, securing 142 total nominations, led by \"The White Lotus,\" \"The Pitt,\" and \"The Penguin.\" Netflix follows with 120 nominations, including \"Adolescence\" and \"The Diplomat.\" Disney+'s \"Andor\" scored 14 nominations but missed a lead actor nod for Diego Luna. The Emmys air September 14 on CBS.",
      "publishedAt": "2025-07-15T04:03:33Z",
      "title": "‘Severance’ leads Emmy nominees, ‘The Studio’ tops comedies as AppleTV+ dominates",
      "url": "https://apnews.com/article/emmy-nominations-2025-04fb965b3ad873e87a1b869db0c2780c",
      "urlToImage": "https://dims.apnews.com/dims4/default/f30c444/2147483647/strip/true/crop/2400x1350+0+125/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F22%2F1bb0667acf396415a243f1376c49%2F9bcfb2fdd80b45ad80a10a69efb4164e"
    },
    {
      "author": null,
      "description": "Russian President Vladimir Putin has sacrificed an estimated 1 million of his soldiers, killed and wounded, in a three-year campaign to crush Ukraine. Now President Donald Trump is betting that his go-to economic weapon — tariffs — can succeed where Ukrainian drones and rockets haven’t, and finally persuade Putin to end his war. Trump said Monday he would impose 100% tariffs on countries that buy Russian oil, natural gas and other products if there isn’t a peace deal in 50 days. He did not spell out exactly how these “secondary″ tariffs would work, and trade analysts are skeptical they will be effective.",
      "publishedAt": "2025-07-15T21:02:34Z",
      "title": "Trump wields tariffs to sway Putin on Ukraine. Here's how they might work, or not",
      "url": "https://apnews.com/article/trump-tariffs-russia-ukraine-war-b265ec364349a7e2065982064748e69a",
      "urlToImage": "https://dims.apnews.com/dims4/default/357bf57/2147483647/strip/true/crop/3755x2112+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F41%2Fe85bbaab0279af13757c15612817%2F414f234ef0e5433190374389e6e2e8d0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}