{
  "articles": [
    {
      "author": "JILL COLVIN and JONATHAN J. COOPER",
      "description": "LITITZ, Pa. (AP) — Donald Trump delivered a profane and conspiracy-laden speech two days before Tuesday's presidential election, talking about reporters being shot and suggesting he “shouldn't have left” the White House after his 2020 loss to Democrat Joe Biden.",
      "publishedAt": "2024-11-03T18:46:15Z",
      "title": "Trump talks about reporters being shot and says he shouldn't have left White House after 2020 loss",
      "url": "https://apnews.com/a310fbc211ad8f0f5e290547ec284187",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d08ebfa1f0e4da5a1d7af01a48f83cb/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, ISABELLA VOLMERT and BILL BARROW",
      "description": "EAST LANSING, Mich. (AP) — Two days out from Election Day, Kamala Harris dashed through four stops across battleground Michigan on Sunday without uttering Donald Trump’s name, while urging voters not to fooled by the GOP nominee’s disparagement of the electoral system that he falsely claims is rigged against him.",
      "publishedAt": "2024-11-03T22:08:46Z",
      "title": "In dash across Michigan, Harris contrasts optimism with Trump's rhetoric without uttering his name",
      "url": "https://apnews.com/14d9d96cecdab90ebc2a4c31e8ccf47f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c51bb63ac2c48879f9e854c64af2447/3000.jpeg"
    },
    {
      "author": "MATT BROWN and FREIDA FRISARO",
      "description": "MIAMI (AP) — Concerts and carnivals hosted at polling precincts. “Souls to the Polls” mobilizations after Sunday service. And star-studded rallies featuring Hollywood actors, business leaders, musical artists and activists.",
      "publishedAt": "2024-11-04T00:58:47Z",
      "title": "Harris, Obamas and voting rights leaders work to turn out Black voters in run-up to Election Day",
      "url": "https://apnews.com/0f2d15b252fa68557e94d943da1e7624",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/553dd1f4bb394aaabe48d0879ef818db/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and JONATHAN J. COOPER",
      "description": "GASTONIA, N.C. (AP) — Donald Trump says he will be the “protector” of women, whether they like it or not.",
      "publishedAt": "2024-11-03T16:48:26Z",
      "title": "Trump wants to narrow his deficit with women but he's not changing how he talks about them",
      "url": "https://apnews.com/c4ba3f564e981aec7cd12f24d390aced",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fce644f26abb4bb68ec96a5af82cc368/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — The Israeli military said Sunday it has carried out a ground raid into Syria, seizing a Syrian citizen involved in Iranian networks. It was the first time in the current war that Israel announced its troops operated in Syrian territory.",
      "publishedAt": "2024-11-03T08:07:35Z",
      "title": "Israel says it carried out ground raid into Syria, seizing a Syrian citizen connected to Iran",
      "url": "https://apnews.com/9806fad6404f68737c5192c6fa1c7b9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bdbcdf9f0f24c5c873256fc7366c756/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — An Israeli court on Sunday loosened a gag order on a case investigating leaks of classified information suspected to involve one of Prime Minister Benjamin Netanyahu’s media advisers.",
      "publishedAt": "2024-11-03T15:01:32Z",
      "title": "Israel investigates leaks that appear to have bolstered Netanyahu as Gaza truce talks stalled",
      "url": "https://apnews.com/6075c848c8b32c8fd69835434c67046a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02aa47e437d846f2abe380840b08a413/3000.jpeg"
    },
    {
      "author": "BY STEPHEN McGRATH and VADIM GHIRDA",
      "description": "CHISINAU, Moldova (AP) — Moldova’s pro-Western President Maia Sandu has won a second term in a pivotal presidential runoff against a Russia-friendly opponent, in a race that was overshadowed by claims of Russian interference, voter fraud, and intimidation in the European Union candidate country.",
      "publishedAt": "2024-11-03T05:07:28Z",
      "title": "Moldova’s pro-Western president wins 2nd term in runoff overshadowed by Russian meddling claims",
      "url": "https://apnews.com/5886447779a4a818e9f30fdadcb8bbe5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92f290df832541fd8e6fb61d6736ad5c/3000.jpeg"
    },
    {
      "author": "JAKOBUS HERIN",
      "description": "MAUMERE, Indonesia (AP) — Indonesia’s National Disaster Management Agency said Monday that at least six people have died as a series of volcanic eruptions widens on the remote island of Flores.",
      "publishedAt": "2024-11-04T03:18:38Z",
      "title": "Volcanic eruption burns houses in Indonesia, killing at least 6 people",
      "url": "https://apnews.com/73f898102d514b9bd093be65b8188002",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0abf037135a243fda75e505e9e0ccf90/3000.jpeg"
    },
    {
      "author": "JUAN KARITA and ISABEL DEBRE",
      "description": "LAUCA Ñ, Bolivia (AP) — Bolivia's transformative and divisive former President Evo Morales said Sunday that he would press on with a hunger strike until the government of his protégé-turned-rival agreed to a political dialogue.",
      "publishedAt": "2024-11-03T22:10:09Z",
      "title": "Bolivia's Evo Morales tells AP he'll press on with a hunger strike until his rival accepts dialogue",
      "url": "https://apnews.com/8f14b568425ee257ff5d454b7fbc5a7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/382978433802424f8238f95ac6ee9a70/3000.jpeg"
    },
    {
      "author": "DAVID MELERO and JOSEPH WILSON",
      "description": "PAIPORTA, Spain (AP) — A crowd of enraged survivors hurled clots of mud left by storm-spawned flooding at the Spanish royal couple on Sunday during their first visit to the center of their nation's deadliest natural disaster in living memory.",
      "publishedAt": "2024-11-03T12:37:57Z",
      "title": "Spain flood survivors hurl mud at the royals and top government officials",
      "url": "https://apnews.com/a8525bd82cf4cc3fc6273d535cbb9d66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f6d739bc12044b1a3f1c433d03b00a0/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}