{
  "articles": [
    {
      "author": "JILL COLVIN and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Several of Donald Trump's allies used crude and extreme rhetoric Sunday toward Vice President Kamala Harris and other Trump critics before the former president was to take the stage at New York's Madison Square Garden.",
      "publishedAt": "2024-10-27T04:02:46Z",
      "title": "Speakers at Trump's Madison Square Garden event crudely denounce Harris and Democrats",
      "url": "https://apnews.com/fcfe75be7f8281fde7bffa3adb3bba5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1dca82c1114b48ef988a05ef9395b412/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, MARYCLAIRE DALE and CHRIS MEGERIAN",
      "description": "PHILADELPHIA (AP) — Kamala Harris said Sunday that “no one can sit on the sidelines” in this year's presidential election, capping a day of campaigning across the largest city in the crucial battleground state of Pennsylvania.",
      "publishedAt": "2024-10-27T09:28:21Z",
      "title": "Harris rallies Philadelphia voters at church, barbershop, bookstore, restaurant and basketball court",
      "url": "https://apnews.com/640ea532f6de541a5e03509bfe1471ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0bd601fe0964afb9eb8446e844a957c/3000.jpeg"
    },
    {
      "author": "AMI BENTOV, TIA GOLDENBERG, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "RAMAT HASHARON, Israel (AP) — Egypt’s president announced Sunday his country has proposed a two-day cease-fire between Israel and Hamas during which four hostages held in Gaza would be freed.",
      "publishedAt": "2024-10-27T05:30:19Z",
      "title": "Key mediator Egypt proposes a 2-day Gaza cease-fire and the release of 4 hostages",
      "url": "https://apnews.com/b4bf551e7c7de2af29257f6d4cc74da2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94b70be0fc1f4fc8b73c5b8ecea5cbbf/1920.jpeg"
    },
    {
      "author": "ADAM SCHRECK",
      "description": "JERUSALEM (AP) — It's Iran's move now. How the Islamic Republic chooses to respond to the unusually public Israeli aerial assault on its homeland could determine whether the region spirals further toward all-out war or holds steady at an already devastating and destabilizing level of violence.",
      "publishedAt": "2024-10-27T13:04:26Z",
      "title": "Analysis: Iran faces tough choices in deciding how to respond to Israeli strikes",
      "url": "https://apnews.com/80a619146abd4f8aee2a7776a8f134d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6106e377435d42fb8e69d4c7f6a158f9/2500.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "TBILISI, Georgia (AP) — Georgia’s president said Sunday she did not recognize the results of this weekend’s parliamentary vote, which election officials say was won by the ruling party, adding that the country fell victim to a “Russian special operation” aimed at moving it off a path toward Europe.",
      "publishedAt": "2024-10-27T09:01:03Z",
      "title": "Georgian president won't recognize parliamentary election result and calls public protests",
      "url": "https://apnews.com/8f040cb30e1d9c9e778383cbcbb7b2c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55561c48ca5f49ef9f1fbf9a54e72999/2270.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russian forces thwarted an attempt at another cross-border incursion by Ukraine into southwestern Russia, a local official reported Sunday, months after Kyiv staged a bold assault on its nuclear-armed enemy that Moscow is still struggling to halt.",
      "publishedAt": "2024-10-27T17:41:47Z",
      "title": "Russian forces thwart attempted cross-border assault from Ukraine, official says",
      "url": "https://apnews.com/5e37bb46493fa704f942e21c9203334c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19ad66ad15504d739460930afc64f21b/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Fighters from the notorious paramilitary Rapid Support Forces ran riot in east-central Sudan in a multi-day attack that killed more than 120 people in one town, a doctors group and the United Nations said.",
      "publishedAt": "2024-10-27T13:03:52Z",
      "title": "More than 120 killed in paramilitary rampage in east-central Sudan, UN and a doctors group say",
      "url": "https://apnews.com/6693a4a8c10baa49e8bc70506bc170d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64dbd04caff24eedaf89e909e47711a6/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "TALISAY, Philippines (AP) — As a storm pounded his rural home, Raynaldo Dejucos asked his wife and children to stay indoors and keep safe from a lightning strike or slippery roads.One thing the 36-year-old didn't mention was landslides.",
      "publishedAt": "2024-10-27T11:17:12Z",
      "title": "A Philippine town in the shadow of a volcano is hit by landslides it never expected",
      "url": "https://apnews.com/e18e6d928e8d8233c521c378ff58c1b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e401bfe5d98148e49fbc81034632b7e2/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "We watch video after video, consuming the world on our handheld devices in bites of two minutes, one minute, 30 seconds, 15. We turn to moving pictures — “film” — because it comes the closest to approximating the world that we see and experience.",
      "publishedAt": "2024-10-27T10:05:31Z",
      "title": "In Beirut, a photographer's frozen moments slow down time and allow the contemplation of destruction",
      "url": "https://apnews.com/aba36bb1c3cb5b53bbd0dad2526471fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a62c579034fb429fba04d1c7d888df28/3000.jpeg"
    },
    {
      "author": "ALBERT AJI",
      "description": "QUSAIR, Syria (AP) — A stream of refugees fleeing Lebanon to Syria crossed a narrow makeshift bridge on foot Sunday in the Qusair area of Syria’s Homs province after the official border crossing was put out of commission by an Israeli strike two days earlier.",
      "publishedAt": "2024-10-27T18:28:48Z",
      "title": "Destruction of Lebanon-Syria border crossings in Israeli airstrikes creates difficulties",
      "url": "https://apnews.com/051cf8de4bf5bb5a9448e562ec06fb19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84fa0181cef548fcaef9d6422cbbf391/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}