{
  "articles": [
    {
      "author": "JALAL BWAITEL",
      "description": "BETHLEHEM, West Bank (AP) — Bethlehem prepared Tuesday to mark another somber Christmas in the traditional birthplace of Jesus under the shadow of war in Gaza.",
      "publishedAt": "2024-12-24T10:33:35Z",
      "title": "Bethlehem is set to mark a second subdued Christmas during the war in Gaza",
      "url": "https://apnews.com/5b92d528fb97c59992c957f56028aadd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/170696bd5b3743ecaac2d13f3b6b1f78/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "TEL AVIV, Israel (AP) — A septuagenarian Israeli woman who was taken hostage during Hamas's attack on southern Israel on 0ct. 7, 2023 has died.She was among the 250 hostages the Palestinian militant group took back into Gaza following the surprise attack that left about 1,200 people dead.",
      "publishedAt": "2024-12-24T08:34:21Z",
      "title": "Middle East latest: Israel intercepts projectile from Yemen. Former Israeli hostage dies",
      "url": "https://apnews.com/0bdae4e84f41628e1f234acb02367dbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7073a71fe4264e88897c2590d2ddc522/3000.jpeg"
    },
    {
      "author": "KRISHAN FRANCIS",
      "description": "KURUKKAL MADAM, Sri Lanka (AP) — Pulled from the mud as an infant after the devastating Indian Ocean tsunami in 2004, and reunited with his parents following an emotional court battle, the boy once known as “Baby 81” is now a 20-year-old dreaming of higher education.",
      "publishedAt": "2024-12-24T04:22:45Z",
      "title": "20 years after the Indian Ocean tsunami, a boy found in the mud embraces being known as 'Baby 81'",
      "url": "https://apnews.com/fe6edec6968f1b90382c1288bb5f86a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e53fbdf2b4f4ad6855c0cd7a9a402ea/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden on Monday vetoed a once-bipartisan effort to add 66 federal district judgeships, saying “hurried action” by the House left important questions unanswered about the life-tenured positions.",
      "publishedAt": "2024-12-24T03:32:53Z",
      "title": "Biden vetoes once-bipartisan effort to add 66 federal judgeships, citing 'hurried' House action",
      "url": "https://apnews.com/d32ed31377b47d4434aa4dc845bbda86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de023154534b42dbb7e05f39e94c87a3/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT, JUAN ZAMORANO and GARY FIELDS",
      "description": "PANAMA CITY (AP) — Teddy Roosevelt once declared the Panama Canal “one of the feats to which the people of this republic will look back with the highest pride.” More than a century later, Donald Trump is threatening to take back the waterway for the same republic.",
      "publishedAt": "2024-12-23T21:20:49Z",
      "title": "A history of the Panama Canal — and why Trump can't take it back on his own",
      "url": "https://apnews.com/8db28fd0249377a3f102cbb0a81e9356",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1aef67433d249a8893f7ec530e73f36/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The House Ethics Committee's long-awaited report on Matt Gaetz documents a trove of salacious allegations, including sex with an underage girl, that tanked the Florida Republican's bid to lead the Justice Department.",
      "publishedAt": "2024-12-23T20:25:08Z",
      "title": "Inside the Gaetz ethics report, a trove of new details alleging payments for sex and drug use",
      "url": "https://apnews.com/7e0500a0d526299c525df77341b4db28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d331d7fc20f84c479ba9465549f66ef8/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s main liberal opposition party said Tuesday it will seek to impeach acting leader Han Duck-soo, as Seoul grapples with the turmoil set off when impeached President Yoon Suk Yeol made a short-lived declaration of martial law.",
      "publishedAt": "2024-12-24T04:35:07Z",
      "title": "South Korea's opposition party vows to impeach acting president",
      "url": "https://apnews.com/dd42c95aa46de258e25bbe9373d5e3e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/341d623a389a4c6b908a306fbb4884fc/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The man accused of fatally shooting the CEO of UnitedHealthcare pleaded not guilty on Monday to state murder and terror charges while his attorney complained that comments coming from New York’s mayor would make it tough to receive a fair trial.",
      "publishedAt": "2024-12-23T05:30:42Z",
      "title": "Luigi Mangione pleads not guilty to murder and weapons charges in UnitedHealthcare CEO's death",
      "url": "https://apnews.com/8079a5bbe5f3e0539d09332a7240168d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/281d69b119b9471893d7b0d89e6d2ea2/1920.jpeg"
    },
    {
      "author": "MARTHA MENDOZA and STEFANIE DAZIO",
      "description": "SANTA CRUZ, Calif. (AP) — A major storm pounded California’s central coast on Monday, bringing flooding and high surf that was blamed for fatally trapping a man beneath debris on a beach and later partially collapsing a pier, tossing three people into the Pacific Ocean.",
      "publishedAt": "2024-12-23T22:20:35Z",
      "title": "Major storm pounds California's central coast, blamed for man's death and partially collapsing pier",
      "url": "https://apnews.com/39b4acb32a8baab53289d4cd990f9311",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cde84eeef59c496a879044e527a4d72e/1920.jpeg"
    },
    {
      "author": "FARAI MUTSAKA",
      "description": "HARARE, Zimbabwe (AP) — In Southern Africa, where democracy remains relatively stable, elections held in 2024 saw long-governing liberation parties struggling to survive.Across Africa, power struggles involving military governments, coup attempts and armed conflict are common, but the southern region has largely been more stable and elections in some countries brought joy and hopes of a better future.",
      "publishedAt": "2024-12-24T04:56:42Z",
      "title": "Southern Africa elections brought big changes in 2024",
      "url": "https://apnews.com/7f9c7f660d3551585a8dd625f39e0cbe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a697f22a6df45c08cc95da2bbe5a44e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}