{
  "articles": [
    {
      "author": "Melanie Lidman, Samy Magdy",
      "description": "Israel has identified the remains two hostages after Hamas handed over their bodies to the Red Cross. Israeli officials say that the bodies belong to Ronen Engel and Sonthaya Oakkharasri. They were killed during Hamas' attack on southern Israel on Oct. 7, 2023. Israel has threatened on Sunday to keep the Rafah border crossing closed until Hamas fulfills its ceasefire role of returning all deceased hostages. Hamas has handed over the remains of 13 bodies. Eleven of them have been identified as hostages. Israel said one of the bodies released didn't belong to a hostage. The Palestinian group said that talks to launch the second phase of ceasefire negotiations have begun.",
      "publishedAt": "2025-10-19T06:42:26Z",
      "title": "Israel identifies bodies of 2 hostages as major Gaza crossing remains closed",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-10-19-2025-f3d95cf76018541ff824853d1bcd3356",
      "urlToImage": "https://dims.apnews.com/dims4/default/334b004/2147483647/strip/true/crop/7382x4152+0+384/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F1c%2F5d3c949b875a92e98080bc3c02a8%2Fd8683f45818741dfa399b81a7726ea62"
    },
    {
      "author": "Chris Megerian, Dánica Coto",
      "description": "President Donald Trump says he'll slash U.S. funding to Colombia because the country’s leader “does nothing to stop” drug production. In a social media post Sunday, Trump referred to Colombian President Gustavo Petro as “an illegal drug dealer” who is “low rated and very unpopular.” He warned that Petro “better close up” drug operations “or the United States will close them up for him, and it won’t be done nicely.”",
      "publishedAt": "2025-10-19T13:01:05Z",
      "title": "Trump announces an end to US aid to Colombia",
      "url": "https://apnews.com/article/trump-petro-colombia-drugs-us-aid-c3955b2ce351737119920741178e0567",
      "urlToImage": "https://dims.apnews.com/dims4/default/510ebbc/2147483647/strip/true/crop/6320x3555+0+329/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F7f%2F62fb9223a9d1fc35f59a8c95e671%2Fa7fbe0ad39b049859db2e8cf002882e6"
    },
    {
      "author": "Thomas Adamson",
      "description": "Thieves have pulled off a daring heist at the Louvre, using a basket lift to reach the museum on Sunday morning. They forced a window, smashed display cases, and fled with jewels of \"inestimable value,\" according to France's interior minister. The museum closed for the day as police sealed gates and ushered visitors out. The robbery took place in the Galerie d’Apollon, where part of the French Crown Jewels are displayed. The thieves reportedly took nine pieces from the jewelry collection of Napoleon and the Empress. Security and staffing at the Louvre have been under scrutiny.",
      "publishedAt": "2025-10-19T09:46:25Z",
      "title": "Thieves use basket lift in daring Louvre robbery, steal priceless jewels",
      "url": "https://apnews.com/article/france-louvre-museum-robbery-a3687f330a43e0aaff68c732c4b2585b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6fb39d/2147483647/strip/true/crop/4030x2267+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faa%2F29%2F9a8dc2bca0198aa5c0597749170f%2Fc1d6fa3557f84bf5931e8a2dfda4b9f3"
    },
    {
      "author": "Gabriela Aoun Angueira",
      "description": "State emergency management officials say they're facing funding challenges from the federal government that threaten the country's ability to respond to crises. The Trump administration has cut state grants and tied funding to immigration enforcement. And the government shutdown adds to the problem. Last week, a federal judge ordered the Department of Homeland Security to stop linking grants to immigration enforcement. Some states have seen drastic cuts to homeland security grants, leading to a freeze on the entire $1 billion program. Emergency management agencies are delaying hiring and equipment purchases. Experts warn these disruptions could jeopardize preparedness and response to disasters.",
      "publishedAt": "2025-10-19T11:32:59Z",
      "title": "Delays in federal FEMA grants risk jeopardizing disaster response",
      "url": "https://apnews.com/article/fema-grants-disasters-immigration-homeland-security-d9c085bc480c12a0ea4c8f283252510b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d76676/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F92%2F83d4bd29732bfd1ebc0175b4eec2%2F511616ce02af44938e82b51670757459"
    },
    {
      "author": "Isabel DeBre",
      "description": "Bolivia is about to swing to the right after almost two decades of being governed by the Movement Toward Socialism party. The question that voters must answer in Sunday’s presidential runoff is how far to the right and how fast. The two front-runners from the August election facing off in this second round are former right-wing president Jorge “Tuto ”Quiroga and centrist senator Rodrigo Paz. Both are conservative and business-friendly candidates. But they have different ideas about how to dig Bolivia out of its worst economic crisis in 40 years. The Andean nation is crippled by a shortage of U.S. dollars. Imports are scarce. Inflation has soared. And fuel lines paralyze the country.",
      "publishedAt": "2025-10-19T04:20:36Z",
      "title": "Bolivians seeking a way out of economic crisis vote in tight presidential runoff",
      "url": "https://apnews.com/article/bolivia-runoff-election-jorge-quiroga-rodrigo-paz-ef7643d07d8968452cdce784e75a7810",
      "urlToImage": "https://dims.apnews.com/dims4/default/df25a9f/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F89%2F6b3edffcd138270d14bfd3a165ac%2Fdff97692d031411099ff50dce2bf77cb"
    },
    {
      "author": "Josh Boak, Linley Sanders",
      "description": "Americans are increasingly worried about their ability to find a good job under President Donald Trump. That finding from an Associated Press-NORC Center for Public Affairs poll is a potential warning sign for the Republican president and his party as a promised economic boom is giving way to hiring freezes and higher prices. About half of U.S. adults are “not very confident” or are “not at all confident” they could find a good job if they wanted to. That's up from 37% when the same question was asked two years ago. People also worried about high prices for groceries, housing and gasoline, and rising electricity bills.",
      "publishedAt": "2025-10-19T12:05:45Z",
      "title": "Concern about ability to find a good job rises, AP-NORC poll finds",
      "url": "https://apnews.com/article/poll-economy-trump-inflation-electricity-costs-hiring-jobs-ffa4a9de69db090f47f968ba656d694b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a88cae2/2147483647/strip/true/crop/7719x4342+0+402/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F08%2Ffd13d08e12a3b7ab571ee9c23fca%2F93a3bfc812c641cd957dbf8686aceaef"
    },
    {
      "author": "Nicole Winfield, Juan Arraez",
      "description": "Pope Leo XIV has canonized Venezuela's “doctor of the poor” before tens of thousands of people. He has given the South American nation its first saint. José Gregorio Hernández, known for his dedication to the poor, was made a saint Sunday alongside Mother Carmen Rendiles Martínez, the founder of a Venezuelan religious order. Thousands of Venezuelans poured into St. Peter’s Square for the Mass. The ceremony will also canonize Papua New Guinea's first saint, Peter To Rot. He was a layman killed in prison in 1945 for standing up for monogamous marriage. In all, seven people will be canonized in a ceremony that Pope Francis put in motion in some of his final acts as pope.",
      "publishedAt": "2025-10-19T06:36:12Z",
      "title": "Pope Leo XIV canonizes Venezuela's 'doctor of the poor' as country faces economic crisis",
      "url": "https://apnews.com/article/venezuela-saints-pope-vatican-hernandez-c2828accedb39bcc96c9b1f8614c95d3",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a64dd9/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2Fd0%2Ff00009cefd1740b5c9331376a72c%2Fb60edae661de4d0f98345857bebdc9d6"
    },
    {
      "author": "Brian Melley",
      "description": "London police are investigating whether Prince Andrew asked a police officer to find damaging information on Virginia Giuffre, who accused him of sexual assault. Reports suggest Andrew sought to smear Giuffre in 2011 by trying to check her criminal record. This comes after Buckingham Palace announced Andrew would give up his Duke of York title following more revelations of his friendship with convicted sex offender Jeffrey Epstein. Giuffre’s family wants King Charles III to strip Andrew of his prince title. The duke’s demise began in 2019 following a disastrous interview in which Andrew sought to counter media reports about his friendship with Epstein and denied allegations he had sex with a 17-year-old Giuffre.",
      "publishedAt": "2025-10-19T10:50:56Z",
      "title": "Police looking into whether Prince Andrew enlisted officer to dig up dirt on accuser Giuffre",
      "url": "https://apnews.com/article/prince-andrew-charles-epstein-giuffre-police-90af5868e0bcd2ecf4a07b1fb8b3bb68",
      "urlToImage": "https://dims.apnews.com/dims4/default/6dbde71/2147483647/strip/true/crop/5906x3322+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F33%2F9121e5e4806ff76fbfa3ea04fc46%2F2893df4e109d4c158a50d3ff48c34f36"
    },
    {
      "author": null,
      "description": "Afghanistan and Pakistan say they will respect a ceasefire mediated by Qatar and Turkey. The truce comes into effect immediately and is intended to pause hostilities. The Taliban government's chief spokesman and Pakistan's defense minister confirmed the truce on Sunday. Violence has escalated between the neighbors since earlier this month, with each country saying they were responding to aggression from the other. Afghanistan denies harboring militants who carry out attacks in border areas. Pakistan is grappling with militancy that has surged since 2021, when the Taliban seized control of Afghanistan and returned to power.",
      "publishedAt": "2025-10-19T05:34:42Z",
      "title": "Afghanistan and Pakistan say they will respect ceasefire",
      "url": "https://apnews.com/article/afghanistan-pakistan-taliban-qatar-ceasefire-5644c17728ef48434e50e6e8be49294b",
      "urlToImage": "https://dims.apnews.com/dims4/default/b1279a0/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F30%2F8a02a0aab16b9da88cf852927dd7%2F300f84123d0a481ab752c92ecbf2c6fc"
    },
    {
      "author": "Leah Willingham",
      "description": "Five athletes are becoming the first from South Africa to compete in the prestigious Head of the Charles Regatta in Boston as part of a crew comprised of all people of color. The event is part of a multinational effort to expand access to one of the most exclusive, elite sports. In recent years, diversity initiatives have expanded in rowing. The first all-Black women’s 8+ from the U.S. competed at the Charles in 2022. Lwazi-Tsebo Zwane, a 23—year-old from Germiston, South Africa, said he and his boatmates feel very aware of the fact that they are role models for younger rowers.",
      "publishedAt": "2025-10-19T12:05:49Z",
      "title": "Historic first for South African rowers at Boston’s iconic Head of the Charles",
      "url": "https://apnews.com/article/south-africa-rowing-head-of-charles-regatta-871d2b4f4be4893db91366d0289c9774",
      "urlToImage": "https://dims.apnews.com/dims4/default/aac3c8c/2147483647/strip/true/crop/3031x1705+0+158/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F94%2F661fec890fd1a1c2aa3bca04823a%2Fa9553ce7ae794f67b5602132d6648403"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}