{
  "articles": [
    {
      "author": null,
      "description": "GILFORD, N.H. (AP) — An empty runaway boat speeding in circles on New Hampshire’s largest lake was brought safely to a stop by a teenager who jumped aboard from a personal watercraft.Rich Bono, who captured the events on video, said he was on the dock Wednesday in Lake Winnipesaukee’s Smith Cove when he heard some commotion in what is usually a quiet, no-wake zone.",
      "publishedAt": "2024-07-08T18:31:57Z",
      "title": "Teen safely stops runaway boat speeding in circles on New Hampshire's largest lake",
      "url": "https://apnews.com/4a6d57f2f00b66073cb85afdc84d45bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62e6cf3ad7234eea9106a3090e467c67/3000.jpeg"
    },
    {
      "author": "MARK VANCLEAVE and JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Tropical Storm Beryl slammed into Texas on Monday, knocking out power to nearly 3 million homes and businesses and unleashing heavy rains that prompted dozens of high-water rescues. The fast-moving tempest threatened to carve a harsh path over several more states in coming days.",
      "publishedAt": "2024-07-08T04:30:46Z",
      "title": "Texas officials say restoring electricity will take days after Beryl knocked out power to millions",
      "url": "https://apnews.com/7dfd5353671ee30d0c6d11518ea5a370",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d723cdfec2644ff9b8c32e5019ad9eb/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden stood firm Monday against calls for him to drop his reelection candidacy and called for an end to the intraparty drama that has torn apart Democrats since his dismal debate performance last month, as key lawmakers expressed support for him to remain in the 2024 presidential race.",
      "publishedAt": "2024-07-08T04:06:38Z",
      "title": "Biden tells Democrats he won't step aside, and key lawmakers support his reelection campaign",
      "url": "https://apnews.com/16c222f825558db01609605b3ad9742a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f9c068ae6aa4fb09df4ce7e256aa15c/1920.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and CHRISTINE FERNANDO",
      "description": "MILWAUKEE (AP) — The Republican National Committee moved Monday to adopt a party platform that reflects former President Donald Trump’s position opposing a federal abortion ban and ceding limits to states, omitting the explicit basis for a national ban for the first time in 40 years.",
      "publishedAt": "2024-07-08T04:21:54Z",
      "title": "Republicans move at Trump's behest to change how they will oppose abortion",
      "url": "https://apnews.com/5561e857c5501df9864ab8ca666d8bc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a00b781029241a5bd9551d9c00e934c/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and ALANNA DURKIN RICHER",
      "description": "Boeing will have a felony conviction if it follows through on an agreement with prosecutors to plead guilty to fraud in connection with approval of its 737 Max before two of the planes crashed, killing 346 people off the coast of Indonesia and in Ethiopia.",
      "publishedAt": "2024-07-08T22:08:58Z",
      "title": "Here's what to know about Boeing agreeing to plead guilty to fraud in 737 Max crashes",
      "url": "https://apnews.com/fd309f4cc643637ebd9637fd5864dbb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf90b4fd5ab047af8b6e8a387b986b92/2212.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — Seemingly so close, and yet still so far away.French far-right leader Marine Le Pen looked to be nearer to power than ever last week after her National Rally party, strengthened by new allies, triumphed in the opening round of legislative elections. Its first place wasn't a hole-in- one but looked like an impressive position to possibly win or get close to an absolute parliamentary majority in the decisive runoff.",
      "publishedAt": "2024-07-08T16:06:44Z",
      "title": "The far right seemed to have a lock on France's legislative elections. Here's why it didn't win",
      "url": "https://apnews.com/5c4c8fa261b0fa2f2e35c14c072a60b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d58d78e825284a2eb74eeb7654657f82/3000.jpeg"
    },
    {
      "author": "TY O'NEIL, CLAIRE RUSH and ANITA SNOW",
      "description": "DEATH VALLEY, California (AP) — A searing heat wave gripped large parts of the United States on Monday, with record daily high temperatures in Oregon suspected to have caused four deaths in the Portland area following a motorcyclist's death in dangerous heat over the weekend in Death Valley, California.",
      "publishedAt": "2024-07-08T04:31:39Z",
      "title": "Searing heat wave grips large parts of the US and causes deaths in the West",
      "url": "https://apnews.com/3a906d7045cf7eb04604aefec70cda16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7fc4dc4bf1545979411bd3f78b8df6e/1920.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Eight years ago, Yuriko Koike became the first woman to lead Tokyo, beating her male predecessor. She won her third term as governor Sunday, and one of her closest rivals was a woman.Multiple women competing for a top political office is still rare in Japan, which has a terrible global gender-equality ranking, but Koike’s win highlights a gradual rise in powerful female officials and a society more open to gender balance in politics.",
      "publishedAt": "2024-07-08T15:38:22Z",
      "title": "\"Pace is too slow.\" Women gradually rise in Japanese politics but face deep challenges",
      "url": "https://apnews.com/c8cebaafd79752687fa1b881f9297e16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e66630f967b84636825db0ddcb80aa81/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "Alec Baldwin ’s role as a producer of the Western film “Rust” isn’t relevant to the involuntary manslaughter trial over a fatal shooting on set, a New Mexico judge decided Monday.",
      "publishedAt": "2024-07-08T04:00:50Z",
      "title": "Judge decides Alec Baldwin's role as co-producer not relevant to trial over fatal 2021 set shooting",
      "url": "https://apnews.com/7111ebd9d360a261eade601b5e4ec297",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0cdb94eeaa9244dbbaa9009fbf24fe36/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russian missiles blasted cities across Ukraine on Monday, damaging the country's largest children's hospital and other buildings in a fierce assault that interrupted heart surgeries and forced young cancer patients to take their treatments outdoors.",
      "publishedAt": "2024-07-08T08:09:28Z",
      "title": "Russia's heaviest bombardment of Kyiv in 4 months hits a children's hospital",
      "url": "https://apnews.com/33aecd50cf252ff6184c0c14f90588b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/036b533f5d6142909b7bb9abe185dbff/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}