{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — For the first time in history, prosecutors will present a criminal case against a former American president to a jury Monday as they accuse Donald Trump of a hush money scheme aimed at preventing damaging stories about his personal life from becoming public.",
      "publishedAt": "2024-04-22T04:03:21Z",
      "title": "Prosecutors will make history with opening statements in Trump's hush money criminal case",
      "url": "https://apnews.com/6beee9b99114898ee0dd60185d43bac5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae2cc35e3a5f491e9a278191a32d7da7/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Opening statements in Donald Trump's historic hush money trial are set to begin Monday morning, setting the stage for weeks of unsavory and salacious testimony about the former president's personal life and placing his legal troubles at the center of his closely contested campaign against President Joe Biden.",
      "publishedAt": "2024-04-22T10:17:13Z",
      "title": "The Latest | Trump set to return to court for opening statements in his historic hush money trial",
      "url": "https://apnews.com/0b824550156f8f321a7754a712a8111a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83286143c8c649c08a995abcc6e9499c/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The head of Israeli military intelligence resigned on Monday over the failures surrounding Hamas' unprecedented Oct.",
      "publishedAt": "2024-04-22T07:20:32Z",
      "title": "Israeli military intelligence chief resigns over his role in failing to prevent Oct. 7 attack",
      "url": "https://apnews.com/85da1c989f71f8c3bf00d8b45a0ed7f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed2034b24fda4e778c2d8be1046ee261/3000.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH",
      "description": "RAFAH, Gaza Strip (AP) — Sabreen Jouda came into the world seconds after her mother left it.Their home was hit by an Israeli airstrike shortly before midnight Saturday. Until that moment, the family was like so many other Palestinians trying to shelter from the war in Gaza's southernmost city of Rafah.",
      "publishedAt": "2024-04-21T19:55:46Z",
      "title": "A Palestinian baby in Gaza is born an orphan in an urgent cesarean section after an Israeli strike",
      "url": "https://apnews.com/19d46c47465a8bc8bb4c56f5247beccc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c03f779ff2044d8b95cc5b40dc742687/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "TRAVERSE CITY, Mich. (AP) — The group gathered inside the conference room, mostly women, fell silent as the audio recording began to play.The male voice, clearly agitated, railed against what he thought had been fraud that cost former President Donald Trump reelection four years ago.",
      "publishedAt": "2024-04-22T04:08:33Z",
      "title": "Local election workers fear threats to their safety as November nears. One group is trying to help",
      "url": "https://apnews.com/d2702ae1e1e57c766c3df36f1a7ff763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6276dcb5987746019eaf49a37f0ac8b0/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukrainian commander Oleksiy Tarasenko witnessed a frightening shift last month in Russia's efforts to punch through Kyiv’s defense of the industrial region known as the Donbas.",
      "publishedAt": "2024-04-22T04:16:14Z",
      "title": "Aid approval brings Ukraine closer to replenishing troops struggling to hold front lines",
      "url": "https://apnews.com/5b2cfac8351bff94d8c1ead8704110a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db59f4a23ef34c079c04049bd1b3888f/3000.jpeg"
    },
    {
      "author": "DAKE KANG and MARIA CHENG",
      "description": "BEIJING (AP) — The hunt for the origins of COVID-19 has gone dark in China, the victim of political infighting after a series of stalled and thwarted attempts to find the source of the virus that killed millions and paralyzed the world for months.",
      "publishedAt": "2024-04-22T06:37:04Z",
      "title": "Toxic: How the search for the origins of COVID-19 turned politically poisonous",
      "url": "https://apnews.com/bed5ab50dca8e318ab00f60b5911da0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99710b3e84464fdc825bf43672dab149/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "NAPLES, Italy (AP) — Europe is the fastest-warming continent and its temperatures are rising at roughly twice the global average, two top climate monitoring organizations reported Monday, warning of the consequences for human health, glacier melt and economic activity.",
      "publishedAt": "2024-04-22T02:04:44Z",
      "title": "Europe is the fastest-warming continent, at nearly twice the average global rate, report says",
      "url": "https://apnews.com/d08b3bd028bc461f281f39828bd73056",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/641360b28165456f926f3f770cb2d629/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — Papua New Guinea’s Prime Minister James Marape accused Joe Biden of disparaging the South Pacific island nation by implying that an uncle of the U.S. president had been eaten by “cannibals” there during World War II.",
      "publishedAt": "2024-04-22T06:55:31Z",
      "title": "Papua New Guinea leader takes offense after Biden implies his uncle was eaten by cannibals",
      "url": "https://apnews.com/9479088c4262fe6879258e5ad135238f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9008e65cde846dca2bb70c305968cc4/3000.jpeg"
    },
    {
      "author": "KEN RITTER",
      "description": "LAS VEGAS (AP) — Work is set to begin Monday on a $12 billion high-speed passenger rail line between Las Vegas and the Los Angeles area, with officials projecting millions of ticket-buyers will be boarding trains by 2028.",
      "publishedAt": "2024-04-22T04:19:19Z",
      "title": "From Sin City to the City of Angels, building starts on high-speed rail line",
      "url": "https://apnews.com/595913ff2fa3d9001fb89bfab4e6c4d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22c8b27915094c4080271cb9d6ca76af/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}