{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An apparent Israeli airstrike early Sunday killed at least 18 people in central Gaza, Palestinian medical officials said.The strike hit a mosque sheltering displaced people near the al-Aqsa Martyrs hospital in the town of Deir al-Balah, the hospital said in a statement.",
      "publishedAt": "2024-10-06T04:39:16Z",
      "title": "Apparent Israeli airstrike on mosque in central Gaza kills at least 18 people",
      "url": "https://apnews.com/0210e9d539a899e21ee89b52807b6af7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c90ac378f9264cb2adf5ee1adc77b68c/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Ne’man Abu Jarad sat on a tarp on the ground. Around him, canvas sheets hung from cords, forming the walls of his tent. For the past year, Ne’man; his wife, Majida; and their six daughters have trekked the length of the Gaza Strip, trying to survive as Israeli forceswreaked destruction around them.",
      "publishedAt": "2024-10-06T04:00:59Z",
      "title": "A displaced family's year of fleeing across the devastated Gaza Strip",
      "url": "https://apnews.com/161d9ad8d07e12b22bfd41c79d174c70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d4591cf08d24e899bfc93a0c04a2546/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH, JILL COLVIN and ADRIANA GOMEZ LICON",
      "description": "BUTLER, Pa. (AP) — Donald Trump returned on Saturday to the Pennsylvania fairgrounds where he was nearly assassinated in July, urging a large crowd to deliver an Election Day victory that he tied to his survival of the shooting.",
      "publishedAt": "2024-10-05T04:15:07Z",
      "title": "Trump urges his supporters to deliver victory in his return to scene of first assassination attempt",
      "url": "https://apnews.com/24a8718393eb6fdab01336ca4438a0e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc6becf4d0c54d1e831850d90a8aa361/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and BILL BARROW",
      "description": "WASHINGTON (AP) — On the last day of August, President Joe Biden was asked about his fall campaign plans. He promised a Labor Day appearance in Pittsburgh and said he would be “on the road from there on.”",
      "publishedAt": "2024-10-05T14:48:20Z",
      "title": "Biden pledged to campaign hard for Harris. So far, he's been mostly a no-show",
      "url": "https://apnews.com/79496a704736e8965010eea3bb6b6b5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18b7e9c899694581bb4cf77c1d58f03d/3000.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "FRANKFORT, Ky. (AP) — The death toll from Hurricane Helene inched up to 227 on Saturday as the grim task of recovering bodies continued more than a week after the monster storm ravaged the Southeast and killed people in six states.",
      "publishedAt": "2024-10-05T23:27:31Z",
      "title": "Death toll from Hurricane Helene rises to 227 as grim task of recovering bodies continues",
      "url": "https://apnews.com/34d1226bb31f79dfb2ff6827e40587fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a19953ca7d234cf599ee63692f32223b/3000.jpeg"
    },
    {
      "author": "ALLEN G. BREED",
      "description": "CHIMNEY ROCK VILLAGE, N.C. (AP) — The stone tower that gave this place its name was nearly a half billion years in the making — heated and thrust upward from deep in the Earth, then carved and eroded by wind and water.",
      "publishedAt": "2024-10-05T13:03:52Z",
      "title": "Inside the North Carolina mountain town that Hurricane Helene nearly wiped off the map",
      "url": "https://apnews.com/da802219b70161816b73b24482b50684",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47c74e7a739e4b6c88596631f93637df/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — As a junior at George Washington University, Ty Lindia meets new students every day. But with the shadow of the Israel-Hamas war hanging over the Washington, D.C., campus, where everyone has a political opinion, each new encounter is fraught.",
      "publishedAt": "2024-10-06T04:31:51Z",
      "title": "A year into the Israel-Hamas war, students say a chill on free speech has reached college classrooms",
      "url": "https://apnews.com/46faa669edb6b8bf1da6f670f6186bbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1081509e34e4451fae1f322416a26988/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — The leaders of North Korea and China marked the 75th anniversary of their diplomatic relations on Sunday by exchanging messages that expressed hopes for stronger ties, as outsiders raised questions about their relationship.",
      "publishedAt": "2024-10-06T03:57:18Z",
      "title": "North Korea and China mark their 75th anniversary of ties as outsiders question their relationship",
      "url": "https://apnews.com/f2b1aebf0016cc32fb40600802540a21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bd8f5049f6e46209913d1402559c4ab/3000.jpeg"
    },
    {
      "author": "RUTH ALONGA",
      "description": "GOMA, Congo (AP) — Congolese authorities Saturday began vaccinations against mpox, nearly two months after the disease outbreak that spread from Congo to several African countries and beyond was declared a global emergency by the World Health Organization.",
      "publishedAt": "2024-10-05T14:06:20Z",
      "title": "Congo finally begins mpox vaccinations in a drive to slow outbreaks",
      "url": "https://apnews.com/26cb3224edf6fe28b5db507241fee68f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/055d476336e144478dd3eb0d4332d260/3000.jpeg"
    },
    {
      "author": "TERESA M. WALKER",
      "description": "NASHVILLE, Tenn. (AP) — Fans of the Vanderbilt Commodores danced onto the field, jumping up and down as they tore down a goal post, carried it out of the stadium and rang out sweet sounds of victory.",
      "publishedAt": "2024-10-05T23:53:15Z",
      "title": "Vanderbilt takes down No. 1 Alabama 40-35 in historic college football victory",
      "url": "https://apnews.com/a468641fca71fb58f7fc5ed235d48d82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78f56b6e67c64eeb9f422e0a7776b6b5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}