{
  "articles": [
    {
      "author": "SYLVIE CORBET, ADRIANA GOMEZ LICON and JILL COLVIN",
      "description": "PARIS (AP) — French President Emmanuel Macron welcomed Donald Trump to Paris on Saturday with a full a dose of presidential pomp as the two men resumed the relationship they established during Trump's first term after a four-year hiatus.",
      "publishedAt": "2024-12-07T05:04:33Z",
      "title": "Trump receives a Paris welcome full of presidential pomp from France's Macron",
      "url": "https://apnews.com/f97fde62ca2ce68c3874c395b305e26b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9c63eca7f4045618ea2408581a0285e/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Insurgents’ stunning march across Syria gained speed on Saturday with news that they had reached the suburbs of the capital and the government forced to deny rumors that President Bashar Assad had fled the country.",
      "publishedAt": "2024-12-07T11:08:16Z",
      "title": "Syrian opposition activists say insurgents have reached the suburbs of Damascus",
      "url": "https://apnews.com/7f65823bbf0a7bd331109e8dff419430",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa54e5b8bd0f465a8938ed9e671ba022/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea's embattled President Yoon Suk Yeol avoided an opposition-led attempt to impeach him over his short-lived imposition of martial law, as most ruling party lawmakers boycotted a parliamentary vote Saturday to deny a two-thirds majority needed to suspend his presidential powers.",
      "publishedAt": "2024-12-07T00:39:47Z",
      "title": "South Korea's president avoids an impeachment attempt over short-lived martial law",
      "url": "https://apnews.com/3f2a9190bf5cec83b49e2c6ad5cf5379",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b7d818d97bf46c1b43f6bbf8c8a2b2b/1920.jpeg"
    },
    {
      "author": "TOM MURPHY and DEVI SHASTRI",
      "description": "For years, patients in the U.S. health care system have grown frustrated with a bureaucracy they don’t understand.",
      "publishedAt": "2024-12-07T05:10:36Z",
      "title": "UnitedHealthcare CEO's shooting opens a door for many to vent frustrations over insurance",
      "url": "https://apnews.com/2d9c9a1a2a551876e72a11a93fc7624c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8093521fcf65465c82f2e32294b97300/3000.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — The gunman who killed the CEO of the largest U.S. health insurer likely left New York City on a bus soon after the brazen ambush that has shaken corporate America, police officials said.",
      "publishedAt": "2024-12-07T05:29:46Z",
      "title": "Days after gunman killed UnitedHealthcare's CEO, police push to ID him and FBI offers reward",
      "url": "https://apnews.com/dee5ad726a345a8209ecc0df7e44756e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e60efc9a7fce40a9bbd7b7e99a152487/1920.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "SCOTTSDALE, Ariz. (AP) — Four people are running to be the next Democratic National Committee chair, looking to take on the task of reinvigorating a party demoralized by a second loss to President-elect Donald Trump.",
      "publishedAt": "2024-12-07T05:01:48Z",
      "title": "The DNC chair candidates discuss Joe Biden, Kamala Harris and winning Latino voters",
      "url": "https://apnews.com/03c8e3cf7175bb7975ac7998c0b278f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f0f995d11fe4fadbd3e13cf9a7f85ed/3000.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "WASHINGTON (AP) — While the election was over a month ago, voters in some parts of the country are discovering that having their say at the ballot box is not necessarily the final word.Lawmakers in several states have already initiated or indicated plans to alter or nullify certain results.",
      "publishedAt": "2024-12-07T05:05:37Z",
      "title": "Election Day has long passed. In some states, legislatures are working to undermine the results",
      "url": "https://apnews.com/d6d9807d3ef2c40b9aaa484057e77e2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41fa15bac7d8456d8a9a3fd71aead8a8/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "PEARL HARBOR, Hawaii (AP) — Bob Fernandez thought he'd go dancing and see the world when he joined the U.S. Navy as a 17-year-old high school student in August 1941. Four months later he found himself shaking from explosions and passing ammunition to artillery crews so his ship's guns could return fire on Japanese planes bombing Pearl Harbor, a Navy base in Hawaii.",
      "publishedAt": "2024-12-07T05:05:10Z",
      "title": "100-year-old Pearl Harbor survivor recalls confusion and chaos during Japanese bombing 83 years ago",
      "url": "https://apnews.com/97e21f0b36f969bf0c5b3a8bb2641694",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebaf62643eed4834820d96712c04b561/3000.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE, Netherlands (AP) — An explosion and fire rocked a neighborhood in the Dutch city of The Hague on Saturday, killing three people and injuring other people and destroying several apartments, according to authorities.",
      "publishedAt": "2024-12-07T09:50:14Z",
      "title": "An explosion destroys an apartment block in a Dutch city, killing at least 3 and injuring others",
      "url": "https://apnews.com/54f06b68677dcfda4ee7af75deed4947",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ab51eec09c64a5fa0c13c608ec3b81d/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — Rhonda James was skeptical when her husband ordered a weighted blanket for her online. But five minutes after she wrapped it around her body, she zonked out.",
      "publishedAt": "2024-12-07T14:00:19Z",
      "title": "Do weighted blankets help you sleep better? Here's what to know",
      "url": "https://apnews.com/c84dae91049c7b9906e9de9408274c46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc93489608b44eeda320eb9383c27a70/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}