{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin's invasion of Ukraine three years ago has turned into Europe’s largest conflict since World War II. Tens of thousands have been killed, cities have been reduced to ruins, millions of Ukrainians became refugees, and Russia was isolated from the West. Now as top Russian and U.S. officials are talking again and setting the stage for summit meeting, Putin appears closer than ever to cementing Moscow’s gains of about a fifth of Ukraine’s territory and keeping the country out of NATO. President Donald Trump reversed the U.S. policy of isolating Russia, saying they have agreed “to work together very closely” to end the war. He said Ukrainian President Volodymyr Zelenskyy “will be involved” but didn’t elaborate.",
      "publishedAt": "2025-02-20T05:13:50Z",
      "title": "As the Ukraine war reaches its 3-year mark, Russia seems to have time on its side as talks start",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-trump-zelenskyy-f334a0922cecf08b4c78de75aca6d9ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/b183b87/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2Fca%2F717a0e48c9671c156411fba9e1d0%2F6ebe2572bc2d4b118ce8d6eb44fbf716"
    },
    {
      "author": "Justin Spike",
      "description": "President Donald Trump has blamed Ukraine for starting the war that has cost tens of thousands of Ukrainian lives. His comments caused outrage and alarm in a country that has spent nearly three years fighting back a much larger Russian military. Trump called Ukrainian President Volodymyr Zelenskyy “a dictator without elections” and claimed his support among voters was near rock-bottom. Zelenskyy said Wednesday that the disinformation is coming from Russia, and some of what Trump has said does echo Russia’s own narrative of the conflict.",
      "publishedAt": "2025-02-19T19:25:37Z",
      "title": "Trump says Ukraine started the war that's killing its citizens. What are the facts?",
      "url": "https://apnews.com/article/ukraine-russia-trump-war-zelenskyy-putin-7fe8c0c80b4e93e3bc079c621a44e8bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5822ed/2147483647/strip/true/crop/4660x2621+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F73%2F3ffa368b078fb7b1d2221155e464%2Fafce5fdda4064e0baba94ac9c75ace9a"
    },
    {
      "author": "STEPHEN McGRATH, NICOLAE DUMITRACHE",
      "description": "NATO members are continuing their largest combat exercises of 2025 amid concern within the 32-nation alliance over its most powerful member, the United States. The drills in Romania come as a shaken Europe grapples with a new U.S. course under President Donald Trump. His defense secretary has demanded that allies dramatically ramp up military spending and said U.S. security priorities lie elsewhere. That cast doubts on Washington’s longstanding security guarantees provided to Europe. The NATO exercises also come days before the third anniversary of Russia’s full-scale invasion of Ukraine.",
      "publishedAt": "2025-02-19T14:21:31Z",
      "title": "A worried NATO holds large-scale combat drills as the US stance on Europe shifts under Trump",
      "url": "https://apnews.com/article/romania-nato-europe-russia-ukraine-us-f192b88b03f56d81fed0770fca445ba9",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0d9efb/2147483647/strip/true/crop/7568x4257+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F9c%2F109acd51b1f2eb289908adee0449%2F5a50f6fe509341409fb02e4ab759e96a"
    },
    {
      "author": "Stephany Matat, Aamer Madhani, Mike Pesoli",
      "description": "President Donald Trump has warned Ukrainian President Volodymyr Zelenskyy that he “better move fast” to negotiate an end to Russia’s invasion of Ukraine or risk not having a nation to lead. The rhetoric from Trump toward Ukraine comes amid an escalating back-and-forth between the two presidents and rising tensions between the United States and much of Europe over Trump’s approach to settling the biggest conflict on the continent since World War II. Trump’s broadside came not long after Zelenskyy’s comment that Trump was being influenced by Russian disinformation as he tries to bring the fighting to a close on terms that Kyiv says are too favorable to Moscow.",
      "publishedAt": "2025-02-19T16:31:40Z",
      "title": "Trump warns Zelenskyy to quickly negotiate war's end with Russia or risk not having a nation to lead",
      "url": "https://apnews.com/article/trump-zelenskyy-ukraine-russia-war-7d18400b935166773bbd3b3323c8aa5f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7c696b/2147483647/strip/true/crop/3206x1803+0+169/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F2b%2F013e7a13efe7dbffe18c0bc707c3%2F1410097b0719430c9215cc688f8d43d5"
    },
    {
      "author": "Eric Tucker",
      "description": "The Senate is set to vote on whether to confirm Kash Patel as FBI director. It's a vote that could place Patel atop the nation’s premier federal law enforcement agency despite concerns from Democrats over his qualifications and the prospect that he would do President Donald Trump’s bidding. Patel cleared the Senate Judiciary Committee last week by a 12-10, party-line vote and is set for consideration by the Republican-controlled Senate on Thursday afternoon. He is expected to be confirmed unless more than three Republican senators defy Trump’s will and vote against him, which is seen as unlikely.",
      "publishedAt": "2025-02-20T05:01:40Z",
      "title": "Senate pushes toward confirmation of Kash Patel as FBI director",
      "url": "https://apnews.com/article/trump-patel-fbi-justice-department-518329110ea230e2989095bfcbe34c59",
      "urlToImage": "https://dims.apnews.com/dims4/default/817e2b2/2147483647/strip/true/crop/5798x3261+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F39%2F462a8fd9031d0ba12315ae77bb72%2Fad175c9d34e349699c1c0224784ea5e4"
    },
    {
      "author": "Geir Moulson",
      "description": "German voters go to the polls Sunday to elect a parliament that will determine who runs the country for the next four years. Germany has Europe’s biggest economy and is the EU’s most populous nation. It is a leading member of NATO and the second-biggest weapons supplier to Ukraine. The vote count is likely to be final early Monday, but it's not clear what governing coalitions are possible. Preelection polling shows a mainstream conservative bloc with about 30% support and the far-right Alternative for Germany with around 20%. Parties need to get 5% of the vote to win seats, so how many reach that threshold may determine the coalition's makeup. All mainstream parties say they won’t work with AfD.",
      "publishedAt": "2025-02-20T05:19:32Z",
      "title": "German voters prepare to elect a new parliament. Here's what to expect on and after election day",
      "url": "https://apnews.com/article/germany-parliament-election-chancellor-21d264a97ef4a8bf5236308d1e4e5ab1",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f42f48/2147483647/strip/true/crop/6979x3926+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F8e%2Fdffacd57b1b1af3532bd2da35c3b%2F59bd4ef3dec042268c628d2609dd9f0e"
    },
    {
      "author": "Kim Tong-hyung",
      "description": "Actor Kim Sae-ron’s death adds to the list of celebrity deaths in South Korea that underscore the enormous pressure they face under the gaze of a relentlessly unforgiving media that pounces on their every misstep. Experts express concern about increasingly provocative coverage as traditional media compete with YouTube channels and other social media sources for clicks, further dimming the prospects for reforms. Kim rose to stardom as a child actor with the 2010 thriller “The Man from Nowhere” and garnered acclaim and popularity for other acting roles. But she was condemned and ridiculed for many aspects of her life after a drunken-driving crash in 2022.",
      "publishedAt": "2025-02-20T07:16:03Z",
      "title": "Kim Sae-ron's death underscores the huge pressure on South Korean celebrities",
      "url": "https://apnews.com/article/south-korea-actor-kim-sae-ron-suicide-media-coverage-youtube-3924a3a118327d54cf703b1fc0e1e5e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/44102cf/2147483647/strip/true/crop/2694x1515+0+223/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2F7d%2Ff5bb22d22e76febfd0caf30b8ceb%2Fc2423f45e8694ce68d0d2ac83733d12d"
    },
    {
      "author": "Mohammad Jahjouh, Wafaa Shurafa, Melanie Lidman",
      "description": "Hamas is set to return the bodies of four Israeli hostages, including a mother and her two children who have long been feared dead and had come to embody the nation’s agony following the Oct. 7, 2023, attack. The remains to be released from the Gaza Strip on Thursday are of Shiri Bibas and her two children, Ariel and Kfir. Kfir was the youngest captive taken that day. Hamas has said all three were killed in an Israeli airstrike early in the war. The militant group also plans to release the body of Oded Lifshitz, who was 83 when he was abducted.",
      "publishedAt": "2025-02-20T05:18:28Z",
      "title": "Hamas to return 4 Israeli bodies, including a mother and her 2 young children",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-20-2025-4c2ffabae1771cff1a9542fddfaf7d07",
      "urlToImage": "https://dims.apnews.com/dims4/default/437be2c/2147483647/strip/true/crop/2000x1125+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F4b%2Fac489de4e6d83532116417958539%2Ffce3fcc65d2e45a79f419633124c4e10"
    },
    {
      "author": "Melanie Lidman",
      "description": "The bodies presumed to be of the youngest Israelis held hostage by Hamas have been returned to Israel, dashing the hopes of a nation hoping for a happier ending. The boys and their mother were abducted from a kibbutz on Oct. 7, 2023, and became a symbol of the country’s anguish. Hamas had claimed the family was killed in an Israeli airstrike, but their fate remained unclear for months. The father was freed earlier this month in a ceasefire deal. Images of the red-haired children circulated widely and their ordeal fueled calls for the release of all the hostages taken by Hamas. The remains will now be formally identified.",
      "publishedAt": "2025-02-20T09:27:26Z",
      "title": "Israel grieves as Hamas turns over the remains said to be of a mother and her 2 young children",
      "url": "https://apnews.com/article/israel-gaza-ceasefire-hostages-bodies-bibas-1d8718176c8d2564cf23c3e77f09ad72",
      "urlToImage": "https://dims.apnews.com/dims4/default/352d0d4/2147483647/strip/true/crop/7745x4357+0+403/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F4e%2F1bf2f7d8aa83e3fe9db3c446ec4b%2Fb94970188cb94646adf77a4cbe9c56f7"
    },
    {
      "author": "Didi Tang",
      "description": "President Donald Trump’s restrictions on foreign aid and targeting of a key agency funding programs around the world may be offering an opening to China. Trump’s “America First” moves have raised concerns among some lawmakers and experts about whether the U.S. is ceding global influence to rivals. National security adviser Mike Waltz has denied that, saying aid programs may not be in line with U.S. interests “like pushing back on China.” Democratic lawmakers worry that the U.S. is making it easier for China to gain influence. Chinese Foreign Minister Wang Yi has pledged that Beijing would be \"a factor of certainty in this multipolar system and strive to be a steadfast constructive force in a changing world.”",
      "publishedAt": "2025-02-20T05:07:26Z",
      "title": "Trump's freeze on foreign aid could give China an opening on the world stage",
      "url": "https://apnews.com/article/trump-china-foreign-aid-global-influence-d7f3ac76dcbf7c9b75e7b147d8d8fcb6",
      "urlToImage": "https://dims.apnews.com/dims4/default/945edac/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Ffc%2Fea99929f35e7a80c54b08542aa1d%2F800747c3871b4b42ac5635984139e92b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}