{
  "articles": [
    {
      "author": "COLLEEN LONG, SEUNG MIN KIM, ZEKE MILLER and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — At 1:45 p.m. Sunday, President Joe Biden’s senior staff was notified that he was stepping away from the 2024 race.",
      "publishedAt": "2024-07-21T23:18:32Z",
      "title": "Biden's decision to drop out crystallized Sunday. His staff knew one minute before the public did",
      "url": "https://apnews.com/be10da43b9447ef1230c178b15c4760a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31cbe8c808e644fca74b0cd0c6d2d86b/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris moved swiftly to lock up Democratic delegates behind her campaign for the White House after President Joe Biden stepped aside amid concerns from within their own party that he would be unable to defeat Republican Donald Trump.",
      "publishedAt": "2024-07-22T04:16:47Z",
      "title": "Harris looks to lock up Democratic nomination after Biden steps aside, reordering 2024 race",
      "url": "https://apnews.com/9fbd153493cb3f088994854fe61a73e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc4b0a2ba4a44634ba4110c2e8a28889/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — For the past year, the presidential campaign seemed destined to be a monotonous slog featuring two candidates, President Joe Biden and former President Donald Trump, that voters didn’t really want.",
      "publishedAt": "2024-07-22T04:14:59Z",
      "title": "Harris gets chance to press reset on 2024 race against Trump",
      "url": "https://apnews.com/90b9d5c6dc5553703af88dfa442a6bac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81affd8f52e54bf6b90a1955555c4f8f/1920.jpeg"
    },
    {
      "author": "JILL COLVIN and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump's campaign has spent the last year-and-a-half viciously attacking Joe Biden, ridiculing his policies, mocking his fumbles and relishing a rematch they felt they were winning.",
      "publishedAt": "2024-07-22T00:15:45Z",
      "title": "Trump's campaign quickly pivots to Harris after Biden announces decision to leave the race",
      "url": "https://apnews.com/920d7fe1c364e82290abeb9e0d1411c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d77e08bb46d044c39dbb00e5ec4f3a6e/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "President Joe Biden’s abrupt decision to bow out of the presidential race and endorse Vice President Kamala Harris to be the Democratic candidate against former President Donald Trump caused a political earthquake on Sunday.",
      "publishedAt": "2024-07-22T04:18:33Z",
      "title": "Takeaways from a day that fundamentally changed the presidential race",
      "url": "https://apnews.com/23adb69be6a46f9a72f46886e2e6bfba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ded1e540ed104ef78f8fcc23a383c66c/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "Joe Biden's withdrawal from the U.S. presidential race injects greater uncertainty into the world at a time when Western leaders are grappling with wars in Ukraine and Gaza, a more assertive China in Asia and the rise of the far right in Europe.",
      "publishedAt": "2024-07-22T02:02:54Z",
      "title": "Biden's withdrawal injects uncertainty into wars, trade disputes and other foreign policy challenges",
      "url": "https://apnews.com/a627c5f773d5f440541bd299efe3dbc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ff95bfc102b4f5e9407e4e3a1df5389/2567.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and AAMER MADHANI",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu left for Washington on Monday, leaving behind a brutal war to make a politically precarious speech before the U.S.",
      "publishedAt": "2024-07-21T20:48:50Z",
      "title": "Israel's Netanyahu walks political tightrope on Washington trip following Biden's exit from race",
      "url": "https://apnews.com/9e207697206c7d4f31e4ca07e19c5565",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47b2ba9b0a6243d6af69c3bac00704cb/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and MELANIE LIDMAN",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military ordered the evacuation Monday of part of an area in the Gaza Strip it has designated a humanitarian zone, saying it is planning an operation against Hamas militants there.",
      "publishedAt": "2024-07-22T06:30:32Z",
      "title": "Israel orders evacuation of part of Gaza humanitarian zone",
      "url": "https://apnews.com/e99dde86d4333a636d280d9a632835a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45ddcf9b03e8417ea3e227493a5556ae/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "NEW YORK (AP) — Airlines, including Delta Air Lines, continued to struggle to restore operations two days after a faulty software update caused technological havoc worldwide and resulted in several carriers grounding flights.",
      "publishedAt": "2024-07-21T21:38:25Z",
      "title": "Delta Air Lines says cancellations continue as it tries to restore operations after tech outage",
      "url": "https://apnews.com/bc470d7ae7c1627b2b590d2cb01b2b4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc8edbd7425b42ea8b5e69a07045e55f/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI, MIKE HOUSEHOLDER and CHARLOTTE KRAMON",
      "description": "HARPER WOODS, Mich. (AP) — After weeks of uncertainty about who would be at the top of the Democratic Party’s ticket in November, many voters expressed relief over the news that President Joe Biden would drop his reelection bid and began to think about who might replace him in a dramatically altered election landscape.",
      "publishedAt": "2024-07-22T00:24:00Z",
      "title": "Biden's decision to drop out leaves Democrats across the country relieved and looking toward future",
      "url": "https://apnews.com/d2c56e02d22e51b0ef62c7cbb8cead79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ded1e540ed104ef78f8fcc23a383c66c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}