{
  "articles": [
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukraine has destroyed a key bridge in Russia's Kursk region and struck a second one nearby, less than two weeks into its stunning cross-border incursion, disrupting Russian supply routes and possibly signaling that its troops are planning to dig in.",
      "publishedAt": "2024-08-18T11:12:29Z",
      "title": "Ukrainian troops have struck 2 key bridges in Russia. Could it mean they're there to stay?",
      "url": "https://apnews.com/43d6579c82c24ffc5cfabd99d07c66db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05adb366e01843c187a624a083996938/2150.jpeg"
    },
    {
      "author": "WILL WEISSERT, JILL COLVIN and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has replaced President Joe Biden atop the presidential ticket, but his “finish the job” campaign mantra can still largely apply to her top policy goals.",
      "publishedAt": "2024-08-18T04:01:49Z",
      "title": "Harris and Trump offer worlds-apart contrasts on top issues in presidential race",
      "url": "https://apnews.com/3f80a342c790da64e3de92a4f5760991",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93d0e261eedb4c65b169c8390107b375/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, MICHAEL RUBINKAM and MICHELLE L. PRICE",
      "description": "WILKES-BARRE, Pa. (AP) — Former President Donald Trump on Saturday repeatedly swerved from a message focused on the economy into non sequiturs and personal attacks, including thrice declaring that he was better looking than Vice President Kamala Harris.",
      "publishedAt": "2024-08-17T16:43:08Z",
      "title": "Trump zigzags between economic remarks and personal insults at rally in critical Pennsylvania",
      "url": "https://apnews.com/d1e8098a7588bfd1af685327f18ab3a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2260f597e05441ca9125824ae6ef6d8/2460.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "CHICAGO (AP) — Thousands of activists are expected to converge on Chicago this week for the Democratic National Convention, hoping to call attention to abortion rights, economic injustice and the war in Gaza.",
      "publishedAt": "2024-08-18T04:02:26Z",
      "title": "Thousands of activists expected in Chicago for Democratic convention to call for Gaza ceasefire",
      "url": "https://apnews.com/5741113478d2ca454d6d6d7a6e7bd50f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d15deb3688eb498996d33d26cf4eb424/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across Gaza killed 19 people overnight, including a woman and her six children, as U.S. Secretary of State Antony Blinken headed to the region on Sunday to try to seal a cease-fire deal after months of contentious negotiations.",
      "publishedAt": "2024-08-18T06:33:39Z",
      "title": "Israel strikes Gaza as Blinken heads to region to try to help close cease-fire deal",
      "url": "https://apnews.com/4059985bff76d459360f17e8319633c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21784e692f1c47d798b9980efe7e7a1f/1920.jpeg"
    },
    {
      "author": "SYLVIE CORBET and THOMAS ADAMSON",
      "description": "PARIS (AP) — Alain Delon, the internationally acclaimed French actor who embodied both the bad guy and the policeman and made hearts throb around the world, died at age 88, French media reported.With his handsome looks and tender manner, the prolific actor was able to combine toughness with an appealing, vulnerable quality that made him one of France’s memorable leading men.",
      "publishedAt": "2024-08-18T07:19:54Z",
      "title": "French actor and heartthrob Alain Delon dies at 88",
      "url": "https://apnews.com/890a18cca5084cd49e4809dc44d6e520",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dfde64f2f264259b43fe5ed94bd4602/1920.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Hurricane Ernesto weakened into a tropical storm late Saturday as it moved away from Bermuda over open waters of the Atlantic after crossing over the tiny British territory early in the day with heavy rains and strong winds.",
      "publishedAt": "2024-08-17T09:06:25Z",
      "title": "Hurricane Ernesto weakens into tropical storm as it moves away from Bermuda over open waters",
      "url": "https://apnews.com/c7dea3a54812e4353ee2dc2bd38b7e49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d67f597ec6e342c6b738a0541a8e68e5/1600.jpeg"
    },
    {
      "author": "STEPHANY MATAT",
      "description": "HOLEY LAND WILDLIFE MANAGEMENT AREA, Fla. (AP) — It's after midnight when the windshield fogs up on Thomas Aycock's F-250 pickup truck. He flashes a low smile as he slowly maneuvers through the sawgrass, down dirt roads deep in the Florida Everglades.",
      "publishedAt": "2024-08-18T04:29:23Z",
      "title": "A hunter’s graveyard shift: grabbing pythons in the Everglades",
      "url": "https://apnews.com/6838af6afed7eedf875a06482c362156",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f00e5ff5ec94cac80827ea701f660bc/1920.jpeg"
    },
    {
      "author": "JORGE RUEDA and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Venezuelans across the world — some with flags and other patriotic paraphernalia — responded to a call from their country’s political opposition Saturday and took to the streets to defend the faction’s claim to victory over President Nicolás Maduro in last month’s disputed presidential election.",
      "publishedAt": "2024-08-17T21:37:18Z",
      "title": "Venezuelans in Caracas and across the world demonstrate to defend opposition’s victory claim",
      "url": "https://apnews.com/e7a587ee841b83bc8049f4caf3575cc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/821dd5a526834dbca7279d56169a1dd4/3000.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "OKLAHOMA CITY (AP) — The latest search for the remains of 1921 Tulsa Race Massacre victims has ended with three more sets containing gunshot wounds, investigators said.",
      "publishedAt": "2024-08-17T14:07:00Z",
      "title": "Latest search for 1921 Tulsa Race Massacre victims ends with 3 more found with gunshot wounds",
      "url": "https://apnews.com/4ead29dba7e37e4de1f62c35c1c19ca1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c694ce1944c4ba2b5269b02ff928c9f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}