{
  "articles": [
    {
      "author": "BY MARIA SHERMAN",
      "description": "NEW YORK (AP) — Pop powerhouses, American classics, British artists and the estates of deceased legends — many musicians have objected to Donald Trump using their songs at campaign events.",
      "publishedAt": "2024-08-15T19:40:37Z",
      "title": "Artists who object to Trump using their songs from Celine Dion and Isaac Hayes' estate: How it works",
      "url": "https://apnews.com/a6add3c61426768fa30fddb596db9797",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3b530abef174005bac4b10151dd8ed8/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "DEARBORN, Mich. (AP) — Of the thousands of delegates expected to gather Monday at the Democratic National Convention, just 36 will belong to the “uncommitted” movement sparked by dissatisfaction with President Joe Biden's handling of the Israel-Hamas war.",
      "publishedAt": "2024-08-17T04:03:54Z",
      "title": "The pro-Palestinian 'uncommitted' movement is at a standstill with top Democrats as the DNC begins",
      "url": "https://apnews.com/93f9edb25a602c95ee226bd2645e4298",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dee7ddc7fc024de99e9112f121d308fa/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israel airstrike in Gaza killed at least 18 people, all from the same family, on Saturday, hours after mediators expressed optimism for an imminent cease-fire deal between Israel and Hamas after 10 months of war.",
      "publishedAt": "2024-08-17T10:00:23Z",
      "title": "An Israeli airstrike kills 18 members of a family in Gaza as mediators hope for a cease-fire",
      "url": "https://apnews.com/07e5f3d968cb09613609eb1086e26e91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/167c0a0bd6434f17ab6de3b01aa28f6f/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, MICHAEL RUBINKAM and MICHELLE L. PRICE",
      "description": "WILKES-BARRE, Pa. (AP) — Former President Donald Trump on Saturday repeatedly swerved from a message focused on the economy into non sequiturs and personal attacks, including thrice declaring that he was better looking than Vice President Kamala Harris.",
      "publishedAt": "2024-08-17T16:43:08Z",
      "title": "Trump zigzags between economic remarks and personal insults at rally in critical Pennsylvania",
      "url": "https://apnews.com/d1e8098a7588bfd1af685327f18ab3a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2260f597e05441ca9125824ae6ef6d8/2460.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — Tim Walz touted his Nebraska roots Saturday in his first trip back to his home state since becoming the Democratic vice presidential nominee, and drew sharp contrasts between Kamala Harris and Donald Trump.",
      "publishedAt": "2024-08-17T15:45:16Z",
      "title": "Walz touts Nebraska roots in visit to his home state where there's a battle over one electoral vote",
      "url": "https://apnews.com/5f11729f4e1c8e784bc8ea96fd2cddf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c169ee7f2b94ad78815fb8403615f10/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Hurricane Ernesto, which made landfall on the tiny British Atlantic territory of Bermuda early Saturday, brought heavy rains and strong winds before moving north-northeast away from the area.",
      "publishedAt": "2024-08-17T09:06:25Z",
      "title": "Hurricane Ernesto moves away from Bermuda to open waters",
      "url": "https://apnews.com/c7dea3a54812e4353ee2dc2bd38b7e49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35beb656ee8f406fafb2dd5185315c29/1920.jpeg"
    },
    {
      "author": "JORGE RUEDA and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Venezuelans across the world — some with flags and other patriotic paraphernalia — responded to a call from their country’s political opposition Saturday and took to the streets to defend the faction’s claim to victory over President Nicolás Maduro in last month’s disputed presidential election.",
      "publishedAt": "2024-08-17T21:37:18Z",
      "title": "Venezuelans in Caracas and across the world demonstrate to defend opposition’s victory claim",
      "url": "https://apnews.com/e7a587ee841b83bc8049f4caf3575cc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/821dd5a526834dbca7279d56169a1dd4/3000.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "Former U.S. Rep. George Santos is expected to plead guilty to multiple counts in his federal fraud case, according to a person familiar with the matter.",
      "publishedAt": "2024-08-17T17:21:49Z",
      "title": "Ex-Rep. George Santos expected to plead guilty to multiple counts in fraud case, AP source says",
      "url": "https://apnews.com/3225ffb42dab57f719cbe066be124210",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80318d01ce0a4e19ae39562f935b8aa1/3000.jpeg"
    },
    {
      "author": "GISELA SALOMON and REBECCA SANTANA",
      "description": "MIAMI (AP) — Roberto Garcia crossed the border from Mexico in 2009 looking for a better life. For the past eight years, he has been married to an American woman, and they have three kids who are all American citizens.",
      "publishedAt": "2024-08-17T13:01:56Z",
      "title": "Immigrants prepare for new Biden protections with excitement and concern",
      "url": "https://apnews.com/ab9b5fe84c2a24d6314512addeb037c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8429312fe684071b6cb992291cf6a52/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI and MIKE HOUSEHOLDER",
      "description": "EVART, Mich. (AP) — Alison Smith stared at the virtually empty dairy barn inside the Osceola County Fairgrounds, once bustling with teens and preteens preparing to show their prized animals but now eerily silent as an invisible virus once again interfered with a cherished summertime rite.",
      "publishedAt": "2024-08-17T04:27:22Z",
      "title": "Bird flu restrictions cause heartache for 4-H kids unable to show off livestock at fairs across US",
      "url": "https://apnews.com/88487eb492832f7a3b58e40304688366",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ff83b3e591c45639e364dfffa40ec26/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}