{
  "articles": [
    {
      "author": "IGNACIO MARTINEZ and JULIE WATSON",
      "description": "CABO SAN LUCAS, Mexico (AP) — A weakening Hurricane Hilary headed for Mexico's Baja California on Saturday as the U.S. National Hurricane Center predicted “catastrophic and life-threatening flooding” for the peninsula and for the southwestern United States, where it was forecast to cross the border as a tropical storm on Sunday.",
      "publishedAt": "2023-08-19T08:07:19Z",
      "title": "Pacific coast battens down the hatches as Hurricane Hilary threatens 'catastrophic' flooding",
      "url": "https://apnews.com/7fddeb8c6eaf2e6cb8893dfe4db838fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f786b7ca5bae469f9527fb4382bf33ce/1920.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — Hawaii Gov. Josh Green said Friday that what's rebuilt from the ashes of the devastating wildfires on Maui will be determined by the people. “Lahaina will rise again,” Green said during a livestreamed evening address from Honolulu.",
      "publishedAt": "2023-08-19T05:58:23Z",
      "title": "Maui town ravaged by fire will 'rise again,' Hawaii governor says of long recovery ahead",
      "url": "https://apnews.com/875c8a8571555da7cb006c651a807eff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7debbd89764c43c9b3af9973b2edf0ab/1920.jpeg"
    },
    {
      "author": "DAVID SHARP and JIM MORRIS",
      "description": "VANCOUVER, British Columbia (AP) — Firefighters battling wildfires in Canada on Saturday sought to stop flames that swept through the West Kelowna suburbs in British Columbia, forced the evacuation of a university campus and fouled the air with thick smoke.",
      "publishedAt": "2023-08-19T05:23:33Z",
      "title": "Canadian firefighters wage epic battle to save communities after mass evacuations",
      "url": "https://apnews.com/de07fcf732f303252468a40d2e01485d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9aa2e97352c4b06a803a7b4be1925d4/1920.jpeg"
    },
    {
      "author": "EFREM LUKATSKY, KARL RITTER and ELISE MORTON",
      "description": "CHERNIHIV, Ukraine (AP) — A Russian missile attack in the center of a northern Ukrainian city on Saturday killed seven people and wounded over a hundred others, including children, Ukrainian officials said.",
      "publishedAt": "2023-08-19T09:09:53Z",
      "title": "Russian missile attack kills 7 in northern Ukrainian city as Zelenskyy visits NATO candidate Sweden",
      "url": "https://apnews.com/fc376a4b51811fe5d57115fc03b999b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cc2c8565c7546d3a1edd9c67ceb035d/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — The loop Donald Trump's private jet made above the Iowa State Fair before his visit last weekend was more than just a gesture to the hundreds of supporters — and a few rival candidates — on the ground.",
      "publishedAt": "2023-08-19T04:02:09Z",
      "title": "Trump looms large over Iowa State Fair, but many GOP voters still mulling their caucus choices",
      "url": "https://apnews.com/c1a3c5b437dce7bb6f93e650d2e36db4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74ef4f0be66b499b8fa59b81e0ffaab3/1920.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD and SHELBY LUM",
      "description": "NEW YORK (AP) — Mary Miller-Duffy was dazed and grieving. Her brother suddenly collapsed and days later was brain-dead. Now she faced a tough question: Would she donate his body for research?That’s how the body of Maurice “Mo” Miller started its journey to a sunny corner of NYU Langone Health’s intensive care unit — and became part of the quest to one day ease the nation’s transplant shortage with organs from animals.",
      "publishedAt": "2023-08-19T12:28:50Z",
      "title": "How a family's choice to donate a body for pig kidney research could help change transplants",
      "url": "https://apnews.com/217626900d9cb8b26d4dab8d01eab9b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f275ead169b94567b423e7203addfc13/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ, PATRICK ORSAGOS and RENATA BRITO",
      "description": "CINCINNATI (AP) — Aissata Sall was scrolling through WhatsApp in May when she first learned about the new route to the United States. For Ibrahima Sow, the discovery came on TikTok a few weeks later.",
      "publishedAt": "2023-08-19T04:33:43Z",
      "title": "Thousands more Mauritanians are making their way to the US, thanks to a route spread on social media",
      "url": "https://apnews.com/bbef5afc25680ad7f2704afa76f44cea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f9ace3c8782464190d35de6c179be4d/1920.jpeg"
    },
    {
      "author": "JOHN HANNA and HEATHER HOLLINGSWORTH",
      "description": "TOPEKA, Kan. (AP) — A central Kansas police chief was not only on legally shaky ground when he ordered the raid of a weekly newspaper, experts said, but it may have been a criminal violation of civil rights, a former federal prosecutor added, saying: “I'd probably have the FBI starting to look.”",
      "publishedAt": "2023-08-19T11:31:17Z",
      "title": "A raid on a Kansas newspaper likely broke the law, experts say. But which one?",
      "url": "https://apnews.com/bead3f49d323c784d40154067141dc7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b07b585ce0546039d25959405d57004/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU, GERALD IMRAY, FARAI MUTSAKA and PAUL WISEMAN",
      "description": "ABUJA, Nigeria (AP) — Business has vanished at Kingsley Odafe’s clothing shop in Nigeria’s capital, forcing him to lay off three employees.One culprit for his troubles stands out: The U.S. dollar’s strength against the Nigerian currency, the naira, has pushed the price of garments and other foreign goods beyond the reach of local consumers.",
      "publishedAt": "2023-08-19T05:09:11Z",
      "title": "Emerging economies are pushing to end the dollar's dominance. But what's the alternative?",
      "url": "https://apnews.com/d4322e1f99480962eccc05628a0ddb64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f185ffdd9f684a079de06e1a732265fb/3000.jpeg"
    },
    {
      "author": "DAN GELSTON",
      "description": "PHILADELPHIA (AP) — Bryce Harper wants to get to Cooperstown.Sure, what baseball player, especially a two-time NL MVP such as Harper, doesn’t dream of induction into the Hall of Fame. But Harper’s hopes extend well beyond a call to the Hall -- the Philadelphia Phillies slugger would love for Major League Baseball to stick one of its yearly attraction games -- akin to recent “Field of Dreams” and London trips -- in Cooperstown, New York, as part of Hall of Fame weekend.",
      "publishedAt": "2023-08-19T14:32:57Z",
      "title": "Kids Again: MLB makes strides in attracting younger fans, ticket buyers in growing the game",
      "url": "https://apnews.com/e352cfbe33a790ebdbebc7511ee6bd86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acc9f0636a0c42ac848ef6ac840eee50/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}