{
  "articles": [
    {
      "author": "Jon Super",
      "description": "British police are holding a 53-year-old man over a collision that turned a joyous soccer celebration in Liverpool to tragedy and sent more than two dozen people to hospitals. The city's mayor says four people are in very serious condition. Police said they are not treating Monday evening's incident as terrorism and are not looking for other suspects. Detectives on Tuesday were piecing together how a minivan plowed into crowds. It happened after the players of Liverpool Football Club celebrated the Premier League championship with an open-topped bus parade. The North West Ambulance Service said a total of 47 people were injured, of whom 27 were taken to local hospitals.",
      "publishedAt": "2025-05-27T07:57:09Z",
      "title": "4 Liverpool fans seriously hurt when car plowed into a crowd. The suspect acted alone, police say",
      "url": "https://apnews.com/article/liverpool-ramming-police-injuries-soccer-58475cf48441048e87f89df7aba6bb45",
      "urlToImage": "https://dims.apnews.com/dims4/default/7b700e4/2147483647/strip/true/crop/7837x4408+0+408/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F7c%2F30eb50e509da81abe77c95eae26f%2F4969bf20afbf411e9760f594a03d225f"
    },
    {
      "author": "Seung Min Kim",
      "description": "President Donald Trump is set to deliver remarks at Arlington National Cemetery to commemorate Memorial Day. Trump on Monday placed a wreath at the Tomb of the Unknown Soldier, a somber tradition for U.S. presidents. Vice President JD Vance and Defense Secretary Pete Hegseth joined him. Trump began the day with a decidedly different tone. In an all-caps social media message, Trump ranted at former President Joe Biden, calling him the “SCUM THAT SPENT THE LAST FOUR YEARS TRYING TO DESTROY OUR COUNTRY.\" Trump also went after federal judges who have blocked efforts to enact his mass deportation agenda.",
      "publishedAt": "2025-05-26T14:10:46Z",
      "title": "Trump speaking at Arlington on Memorial Day",
      "url": "https://apnews.com/article/donald-trump-arlington-memorial-day-eeb602e8b4521ba2b7c79d2447dfefab",
      "urlToImage": "https://dims.apnews.com/dims4/default/d23f9cb/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F37%2F344c62d8bc49f4eb1d4a9d2e3c8a%2F5cc9c6a1f7b74bb1a24a0869a4f4d4db"
    },
    {
      "author": null,
      "description": "Ukrainian officials say that a massive Russian drone-and-missile attack targeted the country for a second consecutive night, killing at least twelve people and injuring dozens. The attack early on Sunday came on the third day of a planned prisoner swap between Russia and Ukraine, the only tangible outcome from peace talks in Istanbul earlier this month which have so far failed to produce a ceasefire. Ukraine’s President Volodymyr Zelenskyy and Russia’s defense ministry said each side brought home 307 more soldiers on Saturday, a day after each released a total of 390 combatants and civilians. Further releases were expected on Sunday.",
      "publishedAt": "2025-05-25T05:24:51Z",
      "title": "A massive Russian drone-and-missile attack on Ukraine kills at least 12",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-dbefc3d0a83826c865908aa29dd40f93",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ef8ea2/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fd9%2Fd3ab0a5e78158586ab83c2e6968d%2Faff05b9e9af543d78d9f71004eb1165b"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "An Israeli strike on a school-turned-shelter in the Gaza Strip has killed at least 25 people, mostly women and children, according to the territory’s Health Ministry. The strike on the school in northern Gaza also wounded more than 55 people, said Fahmy Awad, head of the ministry’s emergency service. He said the school was hit three times while people slept, setting their belongings ablaze. Footage circulating online showed rescuers struggling to extinguish fires and recovering charred remains. There was no immediate comment from the Israeli military.",
      "publishedAt": "2025-05-26T05:12:35Z",
      "title": "Israeli strike on school-turned-shelter in Gaza kills 25, medics say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-26-2025-6a7285f144a3619e8239138e6883b3b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6f342/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ff1%2F01784acd98fe5fbb6381bbc362f0%2F419377a7ba8643cb87ee439505810f17"
    },
    {
      "author": "Hanna Arhirova, Vasilisa Stepanenko, Illia Novikov",
      "description": "More than 200 Ukrainian POWs have died in Russian prisons since Moscow's full-scale invasion three years ago. Officials from human rights groups, the U.N. and the Ukrainian government say torture, starvation and inadequate health care were likely contributing factors in many of these deaths. These officials say the prison deaths add to evidence that Russia is systematically brutalizing POWs. And they believe that forensic discrepancies between Russian and Ukrainian autopsies, and the repatriation of bodies that are badly mutilated and decomposed, point to an effort by Russia to cover up systematic mistreatment. Russian authorities did not respond to requests for comment. But they have previously accused Ukraine of mistreating Russian POWs — allegations the U.N. has partially backed up.",
      "publishedAt": "2025-05-27T04:15:05Z",
      "title": "More than 200 Ukrainian POWs have died in Russian prisons. This is one soldier's story",
      "url": "https://apnews.com/article/russia-ukraine-pows-torture-autopsies-0615fd4fd7a2c5ce5b395e45f9bc372e",
      "urlToImage": "https://dims.apnews.com/dims4/default/95bef55/2147483647/strip/true/crop/4240x2385+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F06%2F96a0b0431a58e59c392c9fa8a351%2Fbbfe987f8f8e45b29ee3d05858f74cb2"
    },
    {
      "author": "Steve Karnowski",
      "description": "Minneapolis has changed, slowly, since a city police officer murdered George Floyd on Memorial Day in 2020. The city is still struggling to decide what should become of the intersection where Floyd met his demise, which has become a place of pilgrimage known as George Floyd Square. City leaders have not agreed on whether to close the intersection to all traffic as a permanent memorial. Minneapolis has also begun a remake of its police department under court supervision — an effort that the mayor and police chief say will continue with or without the backing of the Trump administration.",
      "publishedAt": "2025-05-26T05:28:17Z",
      "title": "5 years since George Floyd's death, how has Minneapolis evolved?",
      "url": "https://apnews.com/article/george-floyd-murder-anniversary-minneapolis-11871dabb9736de7216d61f1c2e95e51",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0bf816/2147483647/strip/true/crop/8093x4552+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2Fd2%2Fb245b684692751c28efcde1bbe1c%2F85f28f2caad043f495a583c80ca9ca23"
    },
    {
      "author": null,
      "description": "Former Democratic US Rep. Charles Rangel of New York has died at age 94. The family confirmed the death in a statement provide dby City College of New York spokesperson Michelle Stent. He died at a hospital in New York, Stent said. Rangel was a veteran of the Korean War and spent nearly five decades on Capitol Hill. He was also a founding member of the Congressional Black Caucus.",
      "publishedAt": "2025-05-26T15:28:19Z",
      "title": "Former US Rep. Charles Rangel of New York has died at age 94",
      "url": "https://apnews.com/article/charles-rangel-dies-9902b608e33aeb7db30478be00a77acc",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Rob Gillies",
      "description": "King Charles III will outline new Prime Minister Mark Carney’s government priorities in a speech in Parliament in what’s viewed as a show of support in the face of annexation threats by U.S. President Donald Trump. Trump’s repeated suggestion that the U.S. annex Canada prompted Prime Minister Carney to invite Charles to give the speech Tuesday from the throne. The king is the head of state in Canada, which is a member of the British Commonwealth of former colonies. Carney says the visit speaks to the “vitality of our constitutional monarchy and our distinct identity.”",
      "publishedAt": "2025-05-27T04:15:53Z",
      "title": "King Charles to outline Mark Carney's priorities in Canada's Parliament amid Trump annexation threat",
      "url": "https://apnews.com/article/canada-king-charles-speech-parliament-carney-8974156597e4cea19e1f25394953e45a",
      "urlToImage": "https://dims.apnews.com/dims4/default/2a200c7/2147483647/strip/true/crop/3000x1688+0+123/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2Fea%2F85acdab3318b4c3957d62a666cce%2F35e8fb814bcb45aeb0d481fddd849ad4"
    },
    {
      "author": "Meg Kinnard, Adriana Gomez Licon",
      "description": "Four months into the Trump administration, some top Democrats are rethinking their approach to podcasts. Some high-profile politicians with 2028 aspirations are starting their own shows or venturing more into popular ones with already large audiences. Taking a reflective look back at their opponent’s strategy, Democratic strategists point out that Trump used podcasts to take his message to new audiences, and hope that their party’s next round of candidates can successfully do the same.",
      "publishedAt": "2025-05-26T12:47:00Z",
      "title": "The Democrats' 2028 podcast primary is underway",
      "url": "https://apnews.com/article/podcasts-democrats-newsom-beshear-buttigieg-c20ac32a80b1f74523f8f2a7918689d8",
      "urlToImage": "https://dims.apnews.com/dims4/default/fbd5567/2147483647/strip/true/crop/5568x3132+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F12%2F0aee237b31099b096c275d7f42d2%2F78a2e7dec4dd4ffc887d529fdc326dd3"
    },
    {
      "author": "Kanis Leung",
      "description": "Hong Kong’s first locally born giant pandas have finally been named and introduced as Jia Jia and De De on Tuesday. The names for the cubs affectionately known as “Elder Sister” and “Little Brother” have been announced in a ceremony at Ocean Park. The theme park houses them, their parents and two other giant pandas that arrived from mainland China last year. The names were the winning suggestions from residents in a naming contest that drew more than 35,700 entries. The pandas’ birth in August made their mother, Ying Ying, the world’s oldest first-time panda mom. Their popularity has raised hopes for a tourism boost in the city, where politicians have touted the commercial opportunities as the “panda economy.”",
      "publishedAt": "2025-05-27T05:36:50Z",
      "title": "Hong Kong's baby pandas finally get names. Meet Jia Jia and De De",
      "url": "https://apnews.com/article/hong-kong-pandas-baby-names-11c59a2068773d111ad73b16c25c0c47",
      "urlToImage": "https://dims.apnews.com/dims4/default/797d9f9/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fbe%2F4e3bbc4b566e13f0ca490e1dcaee%2Fefe1d39914094a5c99cfde54cba774fc"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}