{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Behind the smiles, the balloons and the red-carpet pageantry of President Vladimir Putin's visit to North Korea last week, a strong signal came through: In the spiraling confrontation with the U.S.",
      "publishedAt": "2024-06-23T04:02:41Z",
      "title": "With its new pact with North Korea, Russia raises the stakes with the West over Ukraine",
      "url": "https://apnews.com/556492779b6a32c4cf74b992741d91a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32ec843d9bef4a9fa223625a2ad9baa6/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The last time Israeli Prime Minister Benjamin Netanyahu addressed the U.S. Congress, nearly 60 Democrats skipped his speech nine years ago, calling it a slap in the face to then-President Barack Obama as he negotiated a nuclear deal with Iran.",
      "publishedAt": "2024-06-23T12:11:52Z",
      "title": "Democrats wrestle with whether to attend Netanyahu's address to Congress as many plan to boycott",
      "url": "https://apnews.com/54d4abfb517e399b22324d4c535427aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bc8a8e2d91f42a59ed83ade39b90ea7/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and QASSIM ABDUL-ZAHRA",
      "description": "BEIRUT (AP) — Thousands of fighters from Iran-backed groups in the Middle East are ready to come to Lebanon to join with the militant Hezbollah group in its battle with Israel if the simmering conflict escalates into a full-blown war, officials with Iran-backed factions and analysts say.",
      "publishedAt": "2024-06-23T05:04:32Z",
      "title": "Thousands of Iran-backed fighters offer to join Hezbollah in its fight against Israel",
      "url": "https://apnews.com/1e3359917f252862f4ed3d4b3df1d43e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a74621112b2542d6bb29c35809066d2e/3000.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI, CHRISTINE FERNANDO and LEAH WILLINGHAM",
      "description": "CHARLESTON, W.Va. (AP) — Tucked inside the West Virginia Statehouse is a copy of a petition to lawmakers with a simple request: Let the voters decide whether to reinstate legal access to abortion.The request has been ignored by the Republican lawmakers who have supermajority control in the Legislature and banned abortions in the state in 2022, shortly after the U.S.",
      "publishedAt": "2024-06-23T04:14:35Z",
      "title": "Abortion access has won when it's been on the ballot. That’s not an option for half the states",
      "url": "https://apnews.com/9e8ac1f146c674bee965c5528a6e55a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/862e49fcd13f4cf5afe9878c4e0f1a2a/3000.jpeg"
    },
    {
      "author": "STEPHANY MATAT and ADRIANA GOMEZ LICON",
      "description": "WEST PALM BEACH, Fla. (AP) — After Melania Trump missed key events in her husband's presidential bid earlier this year — from the kickoff of the 2024 election in Iowa to Donald Trump’s Super Tuesday victory party — reporters asked the former first lady whether she planned to hit the campaign trail.",
      "publishedAt": "2024-06-23T11:24:32Z",
      "title": "Former first lady Melania Trump stays out of the public eye as Donald Trump runs for president",
      "url": "https://apnews.com/433bbc2c7d51e6b72a43a831c382c850",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aef2a49ad05e426e9aea664acad32917/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Millions of Americans prepared to sweat through yet another scorching day, with the potential for rolling storms later Sunday to bring relief from the sweltering heat for at least some. Floodwaters inundated parts of the Midwest, including a town in Iowa evacuated after being submerged up to the rooftops.",
      "publishedAt": "2024-06-23T15:05:54Z",
      "title": "Millions in the US prepare for more sweltering heat as floodwaters inundate parts of the Midwest",
      "url": "https://apnews.com/45e54e79787626291194be620bb67e10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8409ec92d1cd42cdbe47d501401b859a/1920.jpeg"
    },
    {
      "author": "TOM WILLIAMS and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Russian authorities said six people died and over 100 were wounded in Ukrainian drone and missile attacks on Sunday, while the second day of Russia's aerial bombing of Kharkiv in northeastern Ukraine killed at least one person.",
      "publishedAt": "2024-06-23T09:14:47Z",
      "title": "Ukrainian drones and missiles kill 6 in Russia and Crimea, fresh bombing of Kharkiv leaves 1 dead",
      "url": "https://apnews.com/272aa4d53e0fdadba02b8772a468553a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d7a0911bac64add8cc09817b6790d73/1920.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "OREM, Utah (AP) — As he led a crowd of picnicking families in the “YMCA” dance, Trent Staggs gleefully waved a “Utah for Trump” flag at a recent campaign rally — one more not-so-subtle reminder to voters that he is backed by the former president in the race to replace retiring U.S.",
      "publishedAt": "2024-06-23T11:47:35Z",
      "title": "In the race to replace Sen. Romney, Utah weighs a Trump loyalist and a climate-focused congressman",
      "url": "https://apnews.com/a7cff9b7438b57b325538124d2fbdf57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4122ab9a01b5420289ea9b4b4c4a09eb/1210.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris says “everything is at stake” with reproductive health rights in November's election as the Biden campaign steps up its focus on contrasting the positions taken by Democratic President Joe Biden and Republican Donald Trump on the issue before their debate this week.",
      "publishedAt": "2024-06-23T16:05:50Z",
      "title": "'Everything is at stake' for reproductive rights in 2024, Harris says as Biden-Trump debate nears",
      "url": "https://apnews.com/5ad83af956a401897552a8fdf3a0cacd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/511217b321f24f2d88a7f3ea7ecefbdb/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu told his Cabinet on Sunday that there had been a “dramatic drop” in U.S. weapons deliveries for Israel's war effort in Gaza, doubling down on a claim that the Biden administration has denied and underscoring the growing strains between the two allies.",
      "publishedAt": "2024-06-23T10:57:34Z",
      "title": "Netanyahu again claims the US is withholding arms shipments, days after Washington denies it",
      "url": "https://apnews.com/bcc6c48de5c463fd68b7249f5b15bf5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/933da2158a034e5a8fd83ab73a860095/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}