{
  "articles": [
    {
      "author": "Steve Karnowski",
      "description": "A federal judge is set to hear arguments Monday on whether to pause an immigration crackdown in Minnesota. This follows the fatal shootings of two people by government officers. The state and the cities of Minneapolis and St. Paul sued the Department of Homeland Security two weeks ago. They want to restore conditions before the Trump administration's Operation Metro Surge began in December. Democratic Minnesota Attorney General Keith Ellison plans to attend the hearing. Justice Department attorneys have called the lawsuit legally frivolous. The case could have implications for other states facing similar immigration enforcement operations like that underway in Minnesota.",
      "publishedAt": "2026-01-26T05:11:53Z",
      "title": "Federal judge set to hear arguments on Minnesota immigration crackdown",
      "url": "https://apnews.com/article/shooting-minneapolis-protests-ice-immigration-lawsuit-5bd12d70d3c76bfe5eacd802ce7480a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/c56d0d1/2147483647/strip/true/crop/5248x3497+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F25%2F505ec4a3755c414299e05da3bf21%2F335fed26d1434608b70ccf5b2104bc48"
    },
    {
      "author": "Rebecca Santana",
      "description": "The fatal shooting of Minneapolis man Alex Pretti by federal immigration officers has sparked calls for an independent investigation. The Trump administration has launched three federal probes, but details remain unclear. Tensions are high in Minneapolis, with conflicting narratives about the incident. The FBI is assisting in processing evidence, but there’s no indication their Civil Rights Division intends to investigate Pretti’s case. The incident highlights mistrust between state officials and the Trump administration over the investigation. Minnesota's governor, in a call with President Donald Trump, said he called for impartial investigations.",
      "publishedAt": "2026-01-26T23:10:24Z",
      "title": "What we know about investigations into the death of Alex Pretti",
      "url": "https://apnews.com/article/minneapolis-alex-pretti-border-patrol-shooting-investigation-9d8ac8531f0d195ada3374c86a9deb21",
      "urlToImage": "https://dims.apnews.com/dims4/default/3749057/2147483647/strip/true/crop/8426x5614+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2Fc3%2F0753da348223a3dc308568b7e5ee%2F2d3b339b315f4de9918b53f8639aa2a9"
    },
    {
      "author": "Kate Brumback, Julie Walker",
      "description": "The Northeastern U.S. is getting the last brunt of a massive winter storm that dumped snow, sleet and ice across much of the southern and eastern U.S. over the weekend. The colossal storm halted air and road traffic in many areas and sent temperatures plunging. As the work week began, the heaviest snow was falling from New York northward into New England. That's after heavy ice snapped branches and power lines in the South, leaving hundreds of thousands of homes and businesses without electricity. In the meantime, arctic air was spreading in behind the storm and some communities in New York saw record-breaking subzero temperatures.",
      "publishedAt": "2026-01-26T05:01:03Z",
      "title": "Colossal storm dumps deep snow in Northeast after dropping sleet and ice in the South",
      "url": "https://apnews.com/article/winter-weather-storm-snow-ice-cbdc1977b810322baf976c91b622516b",
      "urlToImage": "https://dims.apnews.com/dims4/default/95cb7fa/2147483647/strip/true/crop/7732x5152+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2Ff2%2F40b22522b0e4126d5f6422c3f20c%2F082caaf0fa7841939e372c71d7aa5c41"
    },
    {
      "author": null,
      "description": "The Federal Aviation Administration says a private aircraft with eight people on board has crashed on takeoff from Bangor International Airport in Maine. The Bombardier Challenger 600 crashed around 7:45 p.m. Sunday. There was no immediate word on the conditions of those aboard and an airport statement said the airport was closed and emergency crews were at the site. The FAA and the National Transportation Safety Board are investigating. The crash occurred as New England and much of the country grappled with a massive winter storm. Bangor had steady snowfall Sunday like much of the northeastern United States.",
      "publishedAt": "2026-01-26T03:02:18Z",
      "title": "Private jet carrying 8 crashes at Bangor, Maine, airport",
      "url": "https://apnews.com/article/plane-crash-maine-winter-weather-d963803b01c342c3d25d4071d79dba4e",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d8ae33/2147483647/strip/true/crop/2386x1590+182+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2Ff4%2Fa970bb3525d4f5dba3f86b3519d1%2F14c7fbb9757b4a5783bd60cf6139fed6"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump says he is increasing tariffs on South Korean goods because the country’s national assembly has yet to approve the trade framework announced last year. Trump said on social media Monday that import taxes would be raised on autos, lumber and pharmaceutical drugs from South Korea with the rate on other goods going from 15% to 25%. The U.S. president previously imposed the tariffs by declaring an economic emergency and bypassing Congress, while South Korea needed legislative approval for the framework announced in July and affirmed during Trump’s October visit to the country. The threat was a reminder that the tariff drama unleashed last year by Trump is likely to be repeated again and again this year.",
      "publishedAt": "2026-01-26T22:12:21Z",
      "title": "Trump threatens to hike tariffs on some South Korean goods to 25%",
      "url": "https://apnews.com/article/trump-south-korea-tariffs-trade-deal-3c5accc4bb4585837d670d44e1acf8e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/fffe500/2147483647/strip/true/crop/3936x2623+0+5/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2Faf%2Fcce400d729878dc96c25e266d896%2F4505829688d64767802b568087eb3636"
    },
    {
      "author": "Josh Funk",
      "description": "So many things went wrong last Jan. 29 to contribute to the collision between an airliner and a U.S. Army helicopter that killed 67 people that the National Transportation Safety Board isn’t likely to identify a single cause at its hearing. Instead, the investigators on Tuesday will detail all the things they found that played a role in the crash near Washington, D.C., and the board will recommend changes that should be made to help prevent a similar event from happening again. Family members of the victims hope those suggestions won’t be ignored the same way many past NTSB recommendations have been after other crashes.",
      "publishedAt": "2026-01-26T05:04:19Z",
      "title": "NTSB to hold hearing on collision of plane and helicopter over Washington, DC",
      "url": "https://apnews.com/article/dc-plane-crash-army-helicopter-ntsb-cause-f2e87b625583c077acfca694700de37f",
      "urlToImage": "https://dims.apnews.com/dims4/default/e3a515a/2147483647/strip/true/crop/3349x2232+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F59%2Ff2c425d9de13111ef11b1c68c77c%2Fd64a6d7fe0ae43a28202414e0f258a85"
    },
    {
      "author": "Julia Frankel, Samy Magdy",
      "description": "Israel says the remains of the final hostage in Gaza have been recovered, clearing the way for the next phase of the ceasefire that stopped the Israel-Hamas war. Monday’s announcement came a day after Israel’s government said the military was conducting a “large-scale operation” in a cemetery in northern Gaza to locate the remains of Ran Gvili. The return of all remaining hostages, living or dead, has been a key part of the Gaza ceasefire’s first phase, and Gvili’s family had urged Israel’s government not to enter the second phase until his remains were recovered and returned.",
      "publishedAt": "2026-01-26T11:22:06Z",
      "title": "Israel says the remains of final hostage in Gaza are recovered, key for ceasefire's next phase",
      "url": "https://apnews.com/article/israel-gaza-hamas-rafah-26-1-2026-c0b373a26ef7f4524b9b2bdad766cfda",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7c209a/2147483647/strip/true/crop/8067x5375+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F5e%2Fac5591763b9474be4cd34ccc189a%2F9b5d60d16e00445ca24eed4c4ca17a55"
    },
    {
      "author": "Stan Choe",
      "description": "U.S. stock indexes ticked higher, while other markets made louder moves, including another record-breaking rush for the price of gold. The S&P 500 rose 0.5% Monday and won back its losses from last week’s dip. The Dow Jones Industrial Average added 0.6%, and the Nasdaq composite gained 0.4%. Baker Hughes helped lead the way after the energy technology company delivered a stronger profit report than analysts expected. Gold's price briefly topped $5,100 per ounce for the first time, and silver surged even more. The U.S. dollar's value slid again versus other currencies, particularly the Japanese yen.",
      "publishedAt": "2026-01-26T04:21:18Z",
      "title": "US stocks rise as gold hits another record and the dollar's value sinks",
      "url": "https://apnews.com/article/stock-markets-trump-gold-tariffs-cfcf7fb103655bb78ead3f0078ac457f",
      "urlToImage": "https://dims.apnews.com/dims4/default/60796be/2147483647/strip/true/crop/7558x5036+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2F6b%2F22401e3e2113172ec55844fcef06%2F989e296ba49e4495a999fde02234354c"
    },
    {
      "author": "Kelvin Chan",
      "description": "European Union regulators have opened a formal investigation into Elon Musk's social media platform X after its AI chatbot Grok started producing nonconsensual sexualized deepfake images. The scrutiny from Brussels comes after Grok sparked backlash by using AI to undress people, including children, in images. Sme governments have banned the service or issued warnings. The EU's executive is examining whether X has met its obligations under the Digital Services Act to contain illegal content. An X spokeswoman said the platform remains committed to safety and has zero tolerance for child sexual exploitation and non-consensual nudity.",
      "publishedAt": "2026-01-26T11:28:00Z",
      "title": "EU investigates Musk's X over AI deepfake images",
      "url": "https://apnews.com/article/elon-musk-x-grok-ai-deepfakes-sexual-c1a3039e5aaeb4dd517d995b8b301537",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb0ccde/2147483647/strip/true/crop/2182x1454+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2F68%2Fe18af1992d043f541e7e6b4556ca%2F154a9a56332943d69579f721cc09713a"
    },
    {
      "author": "Dave Skretta",
      "description": "Arizona remains the unanimous No. 1 in the AP Top 25 men's college basketball poll. Nebraska climbed to a program-best fifth place. Duke held steady at No. 4, while Gonzaga moved up two spots to sixth. Michigan, Iowa State, Illinois and Houston round out the top 10. Purdue dropped to No. 12 after back-to-back losses last week. North Carolina made the biggest climb, moving up six spots to No. 15. The Big 12 and Big Ten continue to dominate the rankings with the former having six Top 25 teams and the Big Ten with five.",
      "publishedAt": "2026-01-26T18:02:25Z",
      "title": "Unbeaten Arizona leads AP Top 25 poll, Nebraska hits program-best fifth",
      "url": "https://apnews.com/article/ap-top-25-mens-college-basketball-poll-758ca762436516744d4f3c41d4addf0c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e21905/2147483647/strip/true/crop/5817x3876+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Ffa%2F8bf6ea30b3015e2d5f2657a68211%2Fec9b3b8a5f7a4e229e02898c9ba7f457"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}