{
  "articles": [
    {
      "author": "ALICIA RANCILIO",
      "description": "In Hulu's limited-series “ We Were the Lucky Ones, \" the Kurc family in Poland is separated during World War II and spends years trying to reunite.",
      "publishedAt": "2024-04-05T17:25:40Z",
      "title": "Hulu's 'We Were the Lucky Ones' is a good reminder to talk to your elders while you still can",
      "url": "https://apnews.com/46ca2401fa4604220c2cafc94e3d5f5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9789e31f3c894abd9ea38646fd4a1262/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Diplomatic relations between Mexico and Ecuador dramatically imploded after Ecuadorian police burst into Mexico's embassy in Quito and arrested Jorge Glas, Ecuador's former vice president.",
      "publishedAt": "2024-04-06T20:21:47Z",
      "title": "Ecuadorian police broke into Mexico's embassy, sparking outrage. Why is this such a big deal?",
      "url": "https://apnews.com/c888b82d614f91ef9a7bd8faa09afe91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c08e0086786d43599f94dd3ad32f114d/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — With immigration shaping the elections that will decide control of Congress, Democrats are trying to outflank Republicans and convince voters they can address problems at the U.S. border with Mexico, embracing an issue that has traditionally been used against them.",
      "publishedAt": "2024-04-06T04:02:30Z",
      "title": "Democrats lean into border security as it shapes contest for control of Congress",
      "url": "https://apnews.com/ca10e37c4f961700cdd1645e09422ac0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01f97c42d264447c8c4364868677eca5/3000.jpeg"
    },
    {
      "author": "ALI SWENSON and MELISSA GOLDIN",
      "description": "NEW YORK (AP) — The reposts and expressions of shock from public figures followed quickly after a user on the social platform X who uses a pseudonym claimed that a government website had revealed “skyrocketing” rates of voters registering without a photo ID in three states this year — two of them crucial to the presidential contest.",
      "publishedAt": "2024-04-06T13:00:40Z",
      "title": "Anonymous users are dominating right-wing discussions online. They also spread false information",
      "url": "https://apnews.com/8a6b0f8d727734200902d96a59b84bf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21f71a3a802d421595d980866ebda28d/3000.jpeg"
    },
    {
      "author": "LEE KEATH",
      "description": "CAIRO (AP) — Two basic mistakes, according to the Israeli military. First, officers overlooked a message detailing the vehicles in the convoy.",
      "publishedAt": "2024-04-06T05:11:10Z",
      "title": "Israel says its strike that killed aid workers was a mistake. Rights groups say it was no anomaly",
      "url": "https://apnews.com/cb695de7f6ef9e9d7d9cf8fbf6e95364",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dd6343a58ed4ad3a757d618a7e39049/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "JERUSALEM (AP) — It’s the last wish of a dying mother, to be with her daughter once more. But six months into Israel's war against Hamas, time is running out for Liora Argamani, who hopes to stay alive long enough to see her kidnapped daughter come home.",
      "publishedAt": "2024-04-06T05:07:36Z",
      "title": "For families of hostages, it's a race against time as Israel's war reaches six-month mark",
      "url": "https://apnews.com/d601ff02e41abf1f4f026f21f0db8755",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a9d3393c2e44684b66c5d08305e99d3/3000.jpeg"
    },
    {
      "author": null,
      "description": "ISFAHAN, Iran (AP) — A top military commander Saturday renewed Iran's promise to retaliate after an airstrike earlier this week widely blamed on Israel destroyed Iran’s consulate in Syria, killing 12 people, including two elite Iranian generals.",
      "publishedAt": "2024-04-06T18:09:44Z",
      "title": "Iranian commander renews vow to avenge Syria strike attributed to Israel that killed 2 generals",
      "url": "https://apnews.com/335f64884d57f72f4c5fb2a90f953c2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9db9cba38b1a4d38ad0ba72ac4f3e76f/3000.jpeg"
    },
    {
      "author": "BROOKE SCHULTZ",
      "description": "HARRISBURG, Pa. (AP) — POV: You’re on TikTok, and so is your governor — even as your Legislature considers banning the app from state-owned devices and networks. Efforts to ban TikTok over security concerns about China's influence through the platform have picked up steam in the past year in state legislatures, with an expansive ban even proposed by Congress.",
      "publishedAt": "2024-04-06T04:07:47Z",
      "title": "Some states are seeking to restrict TikTok. That doesn't mean their governors aren't using it",
      "url": "https://apnews.com/585bd1ee2e04f618f16883b61cb45e0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/638ffa751cfe4173ad46d914ca17fc82/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — The ground rumbled Friday beneath New York City, home to famous skyscrapers like the Empire State Building and One World Trade Center.",
      "publishedAt": "2024-04-06T15:49:43Z",
      "title": "New York City's skyscrapers are built to withstand most earthquakes",
      "url": "https://apnews.com/9c88baa573bc829641ce312af61e4356",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/031370fcbc6a4262b760f1a450a3bb43/3000.jpeg"
    },
    {
      "author": "ISABELLA VOLMERT",
      "description": "INDIANAPOLIS (AP) — Almost 25 years after suing the firearms industry for failing to prevent illegal gun sales, the northwestern Indiana city of Gary won a critical victory last fall when a judge ordered gun manufacturers to hand over years of production and sales records.",
      "publishedAt": "2024-04-06T04:05:39Z",
      "title": "State Republicans killed an Indiana city's lawsuit to stop illegal gun sales. Why?",
      "url": "https://apnews.com/ee82fc0ca8953238eb1bf45bb46533cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7f3230d58c24f8e8dd6457557d6eb39/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}