{
  "articles": [
    {
      "author": "MICHELLE L. PRICE and MEG KINNARD",
      "description": "NEW YORK (AP) — The reported altercation at Arlington National Cemetery involving Donald Trump’s staff was far from the first time that veterans or the families of service members have criticized the former president for words or behavior they saw as disparaging.",
      "publishedAt": "2024-08-29T20:57:31Z",
      "title": "Trump has history sparking outrage for incidents around veterans even as military voters backed him",
      "url": "https://apnews.com/cc0d20132abc7c1d8e33cba23ba1996b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b5d8c060a88477cb69237b0dad7c643/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "SAVANNAH, Ga. (AP) — Vice President Kamala Harris said Thursday “my values have not changed,” as she was questioned along with her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-29T04:18:21Z",
      "title": "In first sit-down interview of her presidential campaign, Harris says 'my values have not changed'",
      "url": "https://apnews.com/94eff1aa1247e471b48948d03faf0edf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60503894737b43e48c49241a798554e6/1920.jpeg"
    },
    {
      "author": "JILL COLVIN, JOEY CAPPELLETTI and THOMAS BEAUMONT",
      "description": "POTTERVILLE, Mich. (AP) — Former President Donald Trump says that, if he wins a second term, he wants to make IVF treatment free for women, but did not detail how he would fund his plan or how it would work.",
      "publishedAt": "2024-08-29T04:11:58Z",
      "title": "Trump calls for universal coverage of IVF treatment with no specifics on how his plan would work",
      "url": "https://apnews.com/0583faabae5e36000baa18c7b2bea752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15af5da230754e12840c802e74cdfcfa/1920.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA, DAVID BILLER and BARBARA ORTUTAY",
      "description": "SAO PAULO (AP) — It's a showdown between the world's richest man and a Brazilian Supreme Court justice.The justice, Alexandre de Moraes, has threatened to suspend social media giant X nationwide in the coming hours if its billionaire owner Elon Musk doesn't swiftly comply with one of his orders.",
      "publishedAt": "2024-08-29T20:57:02Z",
      "title": "How one Brazilian judge could suspend Musk's X in the coming hours",
      "url": "https://apnews.com/70fdaeef282e1ac7d649b99cf8241b42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6db22f0d96d64deabf15b4712dc984a9/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and TARA COPP",
      "description": "WASHINGTON (AP) — An Arlington National Cemetery official was “abruptly pushed aside” in an altercation with former President Donald Trump’s staff during a wreath-laying ceremony to honor service members killed in the Afghanistan War withdrawal, but she declined to press charges, an Army spokesman said Thursday.",
      "publishedAt": "2024-08-29T14:58:47Z",
      "title": "Arlington National Cemetery worker was 'pushed aside' in Trump staff dispute but won't seek charges",
      "url": "https://apnews.com/18086b03bb1214bc9b6a23f2aaea1c98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2f07743cba046ad8299c2dd75368b23/1920.jpeg"
    },
    {
      "author": "MAJDI MOHAMMED and MELANIE LIDMAN",
      "description": "TULKAREM, West Bank (AP) — The Israeli military said it killed five more West Bank militants, including a local commander, as it pressed ahead Thursday with its deadliest operation in the occupied territory since the start of the war in Gaza.",
      "publishedAt": "2024-08-29T05:56:13Z",
      "title": "Israel kills a top militant in its deadliest West Bank raids since the Gaza war began",
      "url": "https://apnews.com/ee53e1dbf7ece94151088308510e8679",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7845e70bd8294951a8c02e895385d7b2/1920.jpeg"
    },
    {
      "author": "DUSAN STOJANOVIC",
      "description": "BELGRADE, Serbia (AP) — Serbian President Aleksandar Vucic on Thursday announced a $3 billion deal to buy 12 French warplanes, in a move that shifts his country away from its dependence on Russian arms.",
      "publishedAt": "2024-08-29T10:21:40Z",
      "title": "Serbia announces $3 billion deal to buy 12 French warplanes, in a shift away from Russia",
      "url": "https://apnews.com/f7b73c2ddf89b309f242795c2e91c1ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8339dfdbc3ee49b1b5cc9255cbc30cfc/3000.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — Iran has further increased its stockpile of uranium enriched to near weapons-grade levels in defiance of international demands, a confidential report by the United Nations’ nuclear watchdog said Thursday.",
      "publishedAt": "2024-08-29T15:32:33Z",
      "title": "Iran has further increased its stockpile of uranium enriched to near weapons-grade levels, UN says",
      "url": "https://apnews.com/9c86e5788a8bb45eab1337d5f6c10121",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddd4764b696b4c7bb14d61b1b087f51a/3000.jpeg"
    },
    {
      "author": "KATE PAYNE",
      "description": "FORT WALTON BEACH, Fla. (AP) — A judge allowed bond Thursday for a Florida sheriff's deputy who was fired and charged with manslaughter after shooting a U.S.",
      "publishedAt": "2024-08-29T18:13:32Z",
      "title": "Fired Florida deputy freed on bond in fatal shooting of Black airman",
      "url": "https://apnews.com/5256761f30364661a7ab2d5d73a90319",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28824803454849e5aab36df42468ac06/2150.jpeg"
    },
    {
      "author": "TY ONEIL and MATT YORK",
      "description": "GRAND CANYON NATIONAL PARK, Ariz. (AP) — Sharon Ellison and Fred Jernigan spent four days hiking and camping from one end of the Grand Canyon to the other, with plans to relax at a hotel within the park on Thursday.",
      "publishedAt": "2024-08-29T18:08:28Z",
      "title": "Grand Canyon visitors are moving to hotels outside the national park after water pipeline failures",
      "url": "https://apnews.com/3819c4a5043164abb251622db485920c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15c0fb3201f84e8585076e450a18d91e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}