{
  "articles": [
    {
      "author": "LISA MASCARO, ZEKE MILLER, MICHAEL BALSAMO and AAMER MADHANI",
      "description": "WASHINGTON (AP) — Former president Barack Obama has privately expressed concerns to Democrats about President Joe Biden’s candidacy, and Speaker Emerita Nancy Pelosi privately warned Biden that Democrats could lose the ability to seize control of the House if he didn’t step away from the 2024 race, according to several people familiar with the sensitive internal matters.",
      "publishedAt": "2024-07-18T05:33:53Z",
      "title": "Obama, Pelosi and Democrats make a fresh push for Biden to reconsider 2024 race ahead of convention",
      "url": "https://apnews.com/3f9e3d15431fd4974771a54e1d0e4ea7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6d9c126280b4ffb8d8debf1b11fdb0b/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The 20-year-old Pennsylvania man who tried to assassinate Donald Trump had photos on his phone of the former Republican president, President Joe Biden and other officials, including Attorney General Merrick Garland and FBI Director Chris Wray, according to two people familiar with the matter.",
      "publishedAt": "2024-07-18T17:20:54Z",
      "title": "Rally shooter had photos of Trump, Biden and other US officials on his phone, AP sources say",
      "url": "https://apnews.com/2a90bdfd23ba9c3569cb9c29a459e87b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/589dd71e5faa4610affeca162abda3d0/3000.jpeg"
    },
    {
      "author": "MICHAEL SISAK",
      "description": "SARVER, Pa. (AP) — Hundreds of people who gathered to remember the former fire chief fatally shot at a weekend rally for former President Donald Trump were urged to find “unity” as the area in rural Pennsylvania sought to recover from the assassination attempt.",
      "publishedAt": "2024-07-18T04:22:13Z",
      "title": "Hundreds attend vigil for man killed at Trump rally in Pennsylvania before visitation Thursday",
      "url": "https://apnews.com/8c09711e88a56432424ef3f980321ed2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cf5e2f70d4d4357a429b2f3f27c9cd2/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and JILL COLVIN",
      "description": "MILWAUKEE (AP) — Donald Trump takes the stage Thursday at the Republican National Convention to accept his party's nomination again and give his first speech since he was cut off mid-sentence by a flurry of gunfire in an assassination attempt at a rally in Pennsylvania.",
      "publishedAt": "2024-07-18T11:03:25Z",
      "title": "Trump, in highly personal speech, will accept GOP nomination again days after assassination attempt",
      "url": "https://apnews.com/5f1f337ac39477e9d1c53d3e027edda3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7b3d08dc9e847f9a4e9fa0cba5091ae/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu made a surprise visit to troops in southern Gaza on Thursday, saying it was essential that Israel keep control of a strip of territory along the territory's border with Egypt, just days before he was set to give a speech to the U.S.",
      "publishedAt": "2024-07-18T06:40:16Z",
      "title": "Israel's Netanyahu makes surprise Gaza visit as far-right politician tours flashpoint Jerusalem site",
      "url": "https://apnews.com/f92f49c9f2254702f07a6a2af677c89e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51021bf023a34f50a32a66cb9f6415bf/3000.jpeg"
    },
    {
      "author": "KIRILL ZARUBIN and EMMA BURROWS",
      "description": "YEKATERINBURG, Russia (AP) — Closing arguments in the espionage trial of U.S. journalist Evan Gershkovich will be held Friday, a court said, as the proceedings in Russia's highly politicized legal system picked up speed in a case that has seen the reporter held behind bars for over a year.",
      "publishedAt": "2024-07-18T06:32:38Z",
      "title": "Closing arguments in espionage trial of Wall Street Journal reporter will be Friday, court says",
      "url": "https://apnews.com/fcc03e6ec79f5a9a8a2cded213ec3edc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57d5802e530d486d89fc61ab75b6a894/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — Police and government supporters clashed Thursday with student activists trying to shut down transportation across Bangladesh as part of dayslong protests over the allocation of government jobs, and media reports said 19 people died in the violence.",
      "publishedAt": "2024-07-18T07:47:49Z",
      "title": "19 more die in Bangladesh clashes as student protesters try to impose a 'complete shutdown'",
      "url": "https://apnews.com/09879fc7539bc2a9daf7cdd4b2cb1776",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94b009f9c2ec4bd6b162f85b2a6279a0/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "KANSAS CITY, Mo. (AP) — The Missouri Supreme Court cleared the way Thursday for a Missouri woman whose murder conviction was overturned to be freed after 43 years in prison.A circuit court judge ruled last month that Sandra Hemme’s attorneys showed evidence of her “actual innocence,” and an appeals court ruled she should be freed while her case is reviewed.",
      "publishedAt": "2024-07-18T16:39:00Z",
      "title": "Missouri high court clears the way for a woman's release after 43 years in prison",
      "url": "https://apnews.com/e20d285cef54c227167a290f39fd4b68",
      "urlToImage": ""
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — Federal health officials on Thursday authorized sales of the best-selling e-cigarette in the U.S., Vuse Alto, allowing manufacturer Reynolds American to keep the vaping brand on the market for years to come.",
      "publishedAt": "2024-07-18T16:38:38Z",
      "title": "FDA OKs best-selling e-cigarette Vuse Alto, but only in tobacco flavor",
      "url": "https://apnews.com/27ac73b6a56d616d842f7977538387bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9d07fe9117041b79be662c7a2c4bbf2/2000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "TROON, Scotland (AP) — So much for the British Open being one last stand for Rory McIlroy in the majors this year. His best hope now is getting beyond one more day. And he has company from U.S.",
      "publishedAt": "2024-07-18T16:41:31Z",
      "title": "McIlroy, DeChambeau stumble badly out of the gates at British Open",
      "url": "https://apnews.com/1017aba3b81632193399fb28295bdfef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36a70130994a4ccb8521cd796d3cf5ed/2826.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}