{
  "articles": [
    {
      "author": null,
      "description": "Federal regulators repeatedly granted appeals to remove Camp Mystic’s buildings from their 100-year flood map, as the camp operated and expanded in a dangerous flood plain in the years before rushing waters swept away children and counselors. The Federal Emergency Management Agency included the prestigious camp for girls in a “Special Flood Hazard Area” in its National Flood Insurance map for Kerr County in 2011, which means it was required to have flood insurance and faced tighter regulation on any future construction projects. But in map amendments in 2013, 2019 and 2020, FEMA granted appeals to remove 30 Camp Mystic structures from the map. The amendments shielded buildings at the original site, as well as at a second camp site.",
      "publishedAt": "2025-07-12T11:17:18Z",
      "title": "Dozens of Camp Mystic buildings were removed from a 100-year flood map in recent years, records show",
      "url": "https://apnews.com/article/texas-flood-camp-mystic-map-records-investigation-e12bee8d5f88301363861ca12c19b929",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3bd509/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F05%2Fee9ebee595b63927ccb2f5640fd6%2Fd6709d36899043cb90498cb60fd9536a"
    },
    {
      "author": null,
      "description": "President Donald Trump has announced he’s levying tariffs of 30% against the European Union and Mexico. Trump announced the tariffs Saturday on two of the United States' biggest trade partners in letters posted to his social media account. In his letter to Mexico, Trump acknowledged that the country has been helpful in stemming the flow of undocumented migrants and fentanyl into the United States. But he said the country has not done enough to stop North America from turning into a “Narco-Trafficking Playground.”",
      "publishedAt": "2025-07-12T12:55:13Z",
      "title": "Trump announces 30% tariffs against EU, Mexico to begin August 1",
      "url": "https://apnews.com/article/trump-tariffs-eu-mexico-66bf84d97dcd69bbd1f1108e42283afd",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f3bd8a/2147483647/strip/true/crop/4339x2441+0+76/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F99%2F1da809154681f70606c1709908e8%2F88efd82867e543d0bfca2fb7f0e00322"
    },
    {
      "author": null,
      "description": "President Donald Trump says he is considering revoking actress and comedian Rosie O’Donnell’s U.S. citizenship. On Saturday, Trump claimed on social media that O’Donnell is not in the “best interests” of the country and suggested she should stay in Ireland, where she moved earlier this year. Legal experts, however, note the Constitution prevents the government from stripping citizenship from native-born Americans. O’Donnell, born in the U.S., has a constitutional right to her citizenship. The two have feuded publicly for years.",
      "publishedAt": "2025-07-12T19:44:29Z",
      "title": "Trump says he's weighing 'taking away' Rosie O'Donnell's US citizenship",
      "url": "https://apnews.com/article/trump-rosie-odonnell-citizenship-835642a4d55a7897663c6ba89f42e606",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c78ee6/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2Fa0%2F6501a6b23d7608ab7b5730c29533%2F4a1f85b41dba44738b9b633f39f48f0b"
    },
    {
      "author": null,
      "description": "A preliminary finding into last month’s Air India plane crash has suggested the aircraft’s fuel control switches were turned off, causing a loss of engine thrust shortly after takeoff. The report, issued by India’s Aircraft Accident Investigation Bureau, also indicated that both pilots were confused over the change to the switch setting. The report did not say how the switches could have flipped to the cutoff position. The June 12 crash occurred in India's western Ahmedabad city when the plane struck a residential area shortly after takeoff. It killed at least 260 people, including 19 on the ground. Only one passenger survived the crash.",
      "publishedAt": "2025-07-12T01:51:43Z",
      "title": "Fuel switches moved to 'cutoff' before impact in Air India crash",
      "url": "https://apnews.com/article/air-india-plane-crash-ahmedabad-1da81c28862041317f29f547d3f00348",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e6b4ad/2147483647/strip/true/crop/3978x2238+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F06%2F3214918091f29f3e46fc4c1e8214%2Fe4d3a15fc0af4d639a9534359c7926f0"
    },
    {
      "author": null,
      "description": "A preliminary finding into last month’s Air India plane crash has suggested the aircraft’s fuel control switches were turned off, starving the engines of fuel and causing a loss of engine thrust shortly after takeoff. The Air India flight — a Boeing 787-8 Dreamliner — crashed on June 12 and killed at least 260 people, including 19 on the ground, in the northwestern city of Ahmedabad. Only one passenger survived the crash, which is one of India’s worst aviation disasters. The report based its finding on the data recovered from the plane’s black boxes — combined cockpit voice recorders and flight data recorders. Here is an explanation of what black boxes are and what they can do:",
      "publishedAt": "2025-07-12T08:08:36Z",
      "title": "What the ‘black box’ can tell us about plane crashes",
      "url": "https://apnews.com/article/air-india-plane-crash-black-box-9b9373428c33ab19fd18aa0b645b84a6",
      "urlToImage": "https://dims.apnews.com/dims4/default/05e138f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2Fa1%2F05a6e0fea2bfcff7832dbe98e48c%2Fa12fabfd568640128aa29c726d211579"
    },
    {
      "author": null,
      "description": "Democratic lawmakers are condemning Florida’s new Everglades immigration detention center after making a state-arranged visit. They are describing a crowded, unsanitary and bug-infested facility that officials have dubbed “Alligator Alcatraz.” But a Republican legislator said he saw a clean and well-run facility while on the same tour Saturday. The visit came after some Democrats were blocked earlier from viewing the 3,000-bed detention center. The state rapidly built it on an isolated airstrip surrounded by swampland.",
      "publishedAt": "2025-07-12T16:01:46Z",
      "title": "Florida lawmakers tour 'Alligator Alcatraz' after being blocked",
      "url": "https://apnews.com/article/alligator-alcatraz-immigration-detainees-florida-dd1cd271b864a72e6fed1f95d62ee8f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/308f338/2147483647/strip/true/crop/5228x2941+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F4f%2Fafdda21be6a2d24270053853e5f7%2Fc9679dfbbb3c4a34adc59fee2173c646"
    },
    {
      "author": null,
      "description": "President Donald Trump’s Department of Government Efficiency has spawned state-level DOGE initiatives as Republican governors and lawmakers aim to show that they're in step. Critics say some of these initiatives are nothing new or duplicative, while some governors are using their DOGE vehicles to target welfare programs or diversity, equity and inclusion programs. The state initiatives have a markedly different character than Trump’s slash-and-burn approach. Steve Slivinski of the libertarian Cato Institute says much of what he's seen is the same mundane stuff states routinely do to save money. Analysts at the pro-labor Economic Policy Institute say some governors and lawmakers are using DOGE agendas to consolidate power.",
      "publishedAt": "2025-07-12T05:03:42Z",
      "title": "DOGE sprouts in red states, as governors embrace the cost-cutter brand and make it their own",
      "url": "https://apnews.com/article/doge-trump-louisiana-florida-carolina-oklahoma-arkansas-9126dc6c2ed98ec7e8eeefc53a9425f5",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf21046/2147483647/strip/true/crop/5189x2919+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F28%2Fa910dc036cd31d4295ed9a39b140%2F7090a6affa144a7f85614b6b30fd2bd7"
    },
    {
      "author": null,
      "description": "Russia’s foreign minister has warned the U.S., South Korea and Japan against forming a security partnership targeting North Korea. Russian Foreign Minister Sergey made the comments during a trip to North Korea on Saturday. The U.S., South Korea and Japan have been expanding or restoring their regular combined military exercises in response to North Korea’s advancing nuclear program. At the same time, North Korea and Russia have been upgrading their military and other cooperation, with the North supplying troops and weapons to support Russia's war against Ukraine.",
      "publishedAt": "2025-07-12T09:24:53Z",
      "title": "Russia warns US, South Korea and Japan against forming security alliance targeting North Korea",
      "url": "https://apnews.com/article/north-korea-russia-lavrov-us-27e06451ab945fbfc74d9703fac7b581",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f3d3d6/2147483647/strip/true/crop/4500x2531+0+233/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2Fc9%2Ff40e3b99c67c472236135a5b86b0%2Fdb1e01253c4a410bb34662c13cdcd72c"
    },
    {
      "author": null,
      "description": "Iga Swiatek has won her first Wimbledon championship with a 6-0, 6-0 victory over Amanda Anisimova in the final. Saturday's victory at the All England Club took just 57 minutes and gave Swiatek her sixth Grand Slam title overall. She is now 6-0 in major title matches. The 24-year-old from Poland already owned four trophies from the French Open's red clay and one from the U.S. Open's hard courts. This is the first title of her pro career at a grass-court tournament. It also is first women’s final at Wimbledon in 114 years in which one player failed to claim a single game.",
      "publishedAt": "2025-07-12T07:00:09Z",
      "title": "Swiatek defeats Anisimova 6-0, 6-0 for first Wimbledon title",
      "url": "https://apnews.com/article/wimbledon-anisimova-swiatek-women-final-dfd0e0b0abe53ab43383e9718f562ef2",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a1b28c/2147483647/strip/true/crop/7487x4211+0+390/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F46%2F206a4a00593e84e8c1c287fe499d%2F78764d6d62004a65a33e4a412a649225"
    },
    {
      "author": null,
      "description": "Turkish President Recep Tayyip Erdogan has hailed the disarmament of militant Kurdish separatists as the end of a “painful chapter” in Turkey’s history. Erdogan told a meeting of his ruling party in Ankara Saturday that the more than 40-year-old ”scourge of terrorism\" by the Kurdistan Workers' Party - or PKK - is on its way to ending. The Turkish president said a parliamentary commission would be established to oversee the peace process. The PKK has waged an armed insurgency against Turkey since 1984 which morphed from establishing a Kurdish state to ensuring autonomy and rights for Kurds within Turkey. In May, the PKK announced it would heed jailed PKK leader Abdullah Ocalan's calls to formally disarm and disband.",
      "publishedAt": "2025-07-12T10:45:10Z",
      "title": "Turkish president hails the start of disarmament by militant Kurdish separatists",
      "url": "https://apnews.com/article/erdogan-pkk-disarmament-a23b5269e7e8926c3a8d1dc22c4b9db8",
      "urlToImage": "https://dims.apnews.com/dims4/default/aa82cd9/2147483647/strip/true/crop/2528x1422+0+132/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fdb%2Fc218b132901171e826852aeea5e6%2Fc2738ac78d1440d7abcaba15845d99fa"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}