{
  "articles": [
    {
      "author": "GIOVANNA DELL'ORTO",
      "description": "MIAMI BEACH, Fla. (AP) — Preparing for Hanukkah — Judaism’s celebration of finding light in the darkness — feels uniquely somber yet defiant this year for the diverse Jewish community in Miami-area towns that many consider a welcoming home for their faith.",
      "publishedAt": "2023-12-06T13:06:25Z",
      "title": "Hanukkah message of light in darkness feels uniquely relevant to US Jews amid war, antisemitism",
      "url": "https://apnews.com/de06017efbaf1ba0b642356994942ce7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8342e74aff564d3984b86da9c687167b/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, KAREEM CHEHAYEB and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Desperation grew Thursday among Palestinians largely cut off from supplies of food and water as Israeli forces engaged in fierce urban battles with Hamas militants. Strikes in the southern Gaza town of Rafah sowed fear in one of the last places where civilians could seek refuge.",
      "publishedAt": "2023-12-07T09:40:33Z",
      "title": "Desperation grows among Palestinians trapped with little aid as Israel battles Hamas in Gaza",
      "url": "https://apnews.com/174f470c9e3d3c6ea5adb59d7e523425",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3ea423af5ba467f9f99458071750ae4/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — The United States has offered strong support to Israel in its war against the Hamas militant group that rules the Gaza Strip. But the allies are increasingly at odds over what will happen to Gaza once the war winds down.",
      "publishedAt": "2023-12-07T13:41:15Z",
      "title": "Israel and US are at odds over conflicting visions for postwar Gaza",
      "url": "https://apnews.com/6e9b74682a61f8327727d44df644534b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/882e46bcb0f242c88c51d3b4371efe34/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House members voted again Thursday to punish one of their own, targeting Democratic Rep. Jamaal Bowman for triggering a fire alarm in a U.S.",
      "publishedAt": "2023-12-07T05:14:21Z",
      "title": "House votes to censure Democratic Rep. Bowman for pulling a fire alarm in a Capitol office building",
      "url": "https://apnews.com/a313aa51be66ba52e690d50d8564eaf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/076823404ba24f049f086922b42dc006/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — A Texas judge on Thursday gave a pregnant woman whose fetus has a fatal diagnosis permission to get an abortion in an unprecedented challenge over bans that more than a dozen states have enacted since Roe v.",
      "publishedAt": "2023-12-07T05:19:51Z",
      "title": "Texas judge grants pregnant woman permission to get an abortion despite state’s ban",
      "url": "https://apnews.com/568c09dc8794c341095189362ece9004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/edcd7b7f370248d59cfe4c9d1b85b88d/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Former President Donald Trump is appealing a ruling that found he is not immune from criminal prosecution as he runs out of time to delay or even derail an upcoming trial on charges that he plotted to overturn the results of the 2020 election.",
      "publishedAt": "2023-12-07T17:26:22Z",
      "title": "Trump appeals ruling rejecting immunity claim as window narrows to derail federal election case",
      "url": "https://apnews.com/9528a29b2dbebb6ee4a4ebd26780f98c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a05dd2c4c6dd4429bc46cbce3b14032f/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Former President Donald Trump returned to his civil fraud trial Thursday to spotlight his defense, renewing his complaints that the case is baseless and heaping praise on an accounting professor's testimony that backed him up.",
      "publishedAt": "2023-12-07T05:10:02Z",
      "title": "Donald Trump returns to court as his defense expert asserts there’s no evidence of accounting fraud",
      "url": "https://apnews.com/9713913226e8f65ed966d61ea590eaf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46bd0fc271cd4d67b73be8531a3a9e9a/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY and CLAIRE RUSH",
      "description": "PEARL HARBOR, Hawaii (AP) — Ira “Ike” Schab had just showered, put on a clean sailor's uniform and closed his locker aboard the USS Dobbin when he heard a call for a fire rescue party. He went topside to see the USS Utah capsizing and Japanese planes in the air.",
      "publishedAt": "2023-12-07T05:07:37Z",
      "title": "Centenarian survivors of Pearl Harbor attack are returning to honor those who perished 82 years ago",
      "url": "https://apnews.com/cdfd14ffccf0299305d90b61921fc95d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5d805d98bee4a958fe7044b60dbf207/3000.jpeg"
    },
    {
      "author": "KEN RITTER and RIO YAMAT",
      "description": "LAS VEGAS (AP) — Terrified students and professors cowered in classrooms and dorms as a gunman roamed the floors of a University of Nevada, Las Vegas building, killing three people and critically wounding a fourth before dying in a shootout with police.",
      "publishedAt": "2023-12-07T05:30:57Z",
      "title": "Vegas shooter who killed 3 was a professor who recently applied for a job at UNLV, AP source says",
      "url": "https://apnews.com/0b12656a801e227d6aa2b9ccee56d9f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f83257e295754f8d8314b133b337205d/1920.jpeg"
    },
    {
      "author": "LINDSEY BAHR and JAKE COYLE",
      "description": "The Associated Press’ Film Writers Lindsey Bahr and Jake Coyle's picks for the best movies of 2023:LINDSEY BAHR",
      "publishedAt": "2023-12-07T18:07:43Z",
      "title": "Best movies of 2023: 'Oppenheimer,' 'Fallen Leaves,' 'May December'",
      "url": "https://apnews.com/1b69bb2987a1c3f700e003a75244be79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33359c84a917459b918fc891a92cd62e/2362.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}