{
  "articles": [
    {
      "author": "FARNOUSH AMIRI and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Speaker Kevin McCarthy is facing an extraordinary referendum on his leadership of the House after a conservative member of his own Republican majority, a longtime critic, moved to launch a vote to oust him from the helm.",
      "publishedAt": "2023-10-02T23:11:52Z",
      "title": "Rep. Matt Gaetz files motion to oust Speaker Kevin McCarthy, throwing House into new turmoil",
      "url": "https://apnews.com/e7e5ccc6cf79ccbf5b4a7b73b9d5a3ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87c3d7fbee264759b70d9212a330f317/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Aggrieved and defiant, former President Donald Trump spent a day in court Monday for the sometimes testy start of a trial in a fraud lawsuit that could cost him control of Trump Tower and other prized properties.",
      "publishedAt": "2023-10-02T02:45:44Z",
      "title": "Trump seethes through the start of trial in New York lawsuit accusing him of lying about his wealth",
      "url": "https://apnews.com/eb98c99fe918da139b0d8b6347211afe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83ea5dc3750f40178e5ebaf2d7240d78/1920.jpeg"
    },
    {
      "author": "MICHAEL HILL and LISA BAUMANN",
      "description": "MOREAU, N.Y. (AP) — A 9-year-old girl who vanished during a family camping trip in upstate New York was “safe and in good health” Monday after a massive two-day search ended with her rescue and the arrest of a person suspected in her abduction, police said.",
      "publishedAt": "2023-10-02T15:22:21Z",
      "title": "9-year-old who vanished from New York state park found safe and man linked to ransom note arrested",
      "url": "https://apnews.com/033cf262967f5d74ddbf12dbd46a19ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47941f1787dc458897e8f96a2f2e1295/1432.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "A Florida sheriff released body camera video Monday that he says shows his officers were justified when they repeatedly punched, elbowed and kneed a drug suspect who appeared to resist arrest even after being zapped with a stun gun and pinned to the ground.",
      "publishedAt": "2023-10-03T01:41:48Z",
      "title": "Jacksonville sheriff says body camera video shows officers were justified in beating suspect",
      "url": "https://apnews.com/e784cf81f8a16219e08ddc387d070df4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fee4048e9c6245a7afe94cd1a79d58d4/2000.jpeg"
    },
    {
      "author": "MICHAEL R. BLOOD and ADAM BEAM",
      "description": "LOS ANGELES (AP) — When California Gov. Gavin Newsom needed to fill the U.S. Senate seat of his late mentor Dianne Feinstein, he could have turned to a big-city mayor, a member of Congress or a powerful legislator.",
      "publishedAt": "2023-10-02T22:27:31Z",
      "title": "California governor chooses labor leader and Democratic insider to fill Feinstein's Senate seat",
      "url": "https://apnews.com/4096fc7567c8baefbf3544a87d90d529",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78a68fb79bc1424aac0af257bac62f0a/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — The U.N. Security Council voted Monday to send a multinational armed force led by Kenya to Haiti to help combat violent gangs, marking the first time in almost 20 years that a force would be deployed to the troubled Caribbean nation.",
      "publishedAt": "2023-10-02T20:15:57Z",
      "title": "UN Security Council approves sending a Kenya-led force to Haiti to fight violent gangs",
      "url": "https://apnews.com/3749ac5db9d6c5903e61dee7b4206e6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/331a2fd3e5bd4997995226c3616458d2/3000.jpeg"
    },
    {
      "author": "DANIEL SHAILER",
      "description": "MEXICO CITY (AP) — Chanting in unison, students marched through downtown Mexico City on Monday evening, marking 55 years since the military massacred hundreds of students in Tlatelolco plaza.Enrique Treviño Taudres survived the massacre and now marches every year with the Pro Democratic Freedoms 68 Committee.",
      "publishedAt": "2023-10-03T02:25:02Z",
      "title": "Generations of students remember 1968 massacre in march through Mexico City",
      "url": "https://apnews.com/86f9f27d5536362893481ea040ee66b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/571b19a8be574915bf0fd7f0ab43f261/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Late-night talk shows began their return to the air after a five-month absence brought on by the Hollywood writers strike, while actors completed the first day of talks that could end their own long work walk-off.",
      "publishedAt": "2023-10-02T05:09:45Z",
      "title": "Late-night shows return after writers strike as actors resume talks that could end their standoff",
      "url": "https://apnews.com/1ddcaa8c4684375f8e56d2cd2abd62ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97a943a063f2473ebc9cfdcdf3e2f3af/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — More than 100 dolphins have died in the Brazilian Amazon rainforest in the past week as the region grapples with a severe drought, and many more could die soon if water temperatures remain high, experts say.",
      "publishedAt": "2023-10-03T00:58:33Z",
      "title": "More than 100 dolphins found dead in Brazilian Amazon as water temperatures soar",
      "url": "https://apnews.com/39cada45b987de407d5690b8d6ad201e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/569d1dd4845b429aa0b5c6afcf80abde/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — U.S. health officials plan to endorse a common antibiotic as a morning-after pill that gay and bisexual men can use to try to avoid some increasingly common sexually transmitted diseases.",
      "publishedAt": "2023-10-02T13:13:47Z",
      "title": "US health officials propose using a cheap antibiotic as a 'morning-after pill' against STDs",
      "url": "https://apnews.com/1de6323a834339e79cda1e124a455964",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8121208a14f4f2cb1adb64348ce2040/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}