{
  "articles": [
    {
      "author": "MICHELLE L. PRICE and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Kamala Harris and Donald Trump will meet for the first time face-to-face Tuesday night for perhaps their only debate, a high-pressure opportunity to showcase their starkly different visions for the country after a tumultuous campaign summer.",
      "publishedAt": "2024-09-10T04:05:35Z",
      "title": "The Harris-Trump debate becomes the 2024 election's latest landmark event",
      "url": "https://apnews.com/6ad8c03f6bf1ae88870b7db26276236e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e38fc71173f459a86e49083808d5b3c/3000.jpeg"
    },
    {
      "author": "JOSH BOAK, JILL COLVIN and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — This year’s presidential race is a genuine contest of ideas between Vice President Kamala Harris and former President Donald Trump — with clear differences on taxes, abortion, immigration, global alliances, climate change and democracy itself.",
      "publishedAt": "2024-08-18T04:01:49Z",
      "title": "Harris and Trump offer worlds-apart contrasts on top issues in presidential race",
      "url": "https://apnews.com/3f80a342c790da64e3de92a4f5760991",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93d0e261eedb4c65b169c8390107b375/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, MOHAMMAD JAHJOUH and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike on a crowded tent camp housing Palestinians displaced by the war in Gaza killed at least 19 people and wounded 60 early on Tuesday, Palestinian officials said.",
      "publishedAt": "2024-09-10T02:05:52Z",
      "title": "An Israeli strike on a tent camp in a Gaza humanitarian zone killed at least 19 people",
      "url": "https://apnews.com/3e1435277993d03de61f4e1c7494deec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29c7618e37864ddb80bc761859695363/3000.jpeg"
    },
    {
      "author": "JACK JEFFERY",
      "description": "RAMALLAH, West Bank (AP) — The Israeli military saiad Tuesday that an American activist who was killed in the West Bank last week was likely shot “indirectly and unintentionally” by Israeli forces who were aiming at someone else.",
      "publishedAt": "2024-09-10T11:57:23Z",
      "title": "Israeli military: American killed in West Bank was likely shot 'unintentionally' by Israeli forces",
      "url": "https://apnews.com/854676369633f242784683add40f9da4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33ddc4ccc27a4524a88d7e4d404ac143/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Over 140 Ukrainian drones targeted multiple Russian regions overnight, including Moscow and surrounding areas, killing at least one person, officials said Tuesday, in one of the biggest drone attacks on Russian soil in the 2 1/2-year war.",
      "publishedAt": "2024-09-10T06:58:00Z",
      "title": "A woman is killed near Moscow as over 140 Ukrainian drones target Russia, officials say",
      "url": "https://apnews.com/f6dfcae1dcb2b0d9c8c2da1ddbdc32ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37d36cbce7b54c11bc0e9bb551005d97/2743.jpeg"
    },
    {
      "author": "HELENA ALVES, NICOLE WINFIELD and NINIEK KARMINI",
      "description": "TASITOLU, East Timor (AP) — An estimated 600,000 people — nearly half of East Timor’s population —- packed a seaside park Tuesday for Pope Francis’ final Mass, held on the same field where St.",
      "publishedAt": "2024-09-10T02:37:16Z",
      "title": "Pope Francis’ Mass in East Timor draws 600,000 people, nearly half the population",
      "url": "https://apnews.com/8a12d6cfa771b2603d1044afd4ac68a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bf312421c9b4816badbd7119f50be70/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and LINLEY SANDERS",
      "description": "CHICAGO (AP) — For Christopher Pugh, the 2020 election was a turning point.He already distrusted the government. But as he watched Fox News coverage in the immediate aftermath of the election and read posts on Twitter, the social media platform now known as X, that distrust grew.",
      "publishedAt": "2024-09-10T04:09:40Z",
      "title": "AP-NORC/USAFacts poll: Republicans are more likely to trust Trump than official election results",
      "url": "https://apnews.com/451b4f6ebc4c82ac941521b9059500d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc985612b2f3486a98fd91a9b5b6d30f/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "ATLANTA (AP) — Many students in Georgia's Barrow County are headed back to class Tuesday, six days after a shooting killed two teachers and two students at the school district's Apalachee High School northeast of Atlanta.",
      "publishedAt": "2024-09-10T04:04:42Z",
      "title": "Most students in a Georgia school district hit by a shooting will return to class Tuesday",
      "url": "https://apnews.com/2a7406da1fd52c0da0b10eb3b650466b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d176e42e1614a9cb01c23ef80539342/3000.jpeg"
    },
    {
      "author": "SARA CLINE and JAMIE STENGLE",
      "description": "BATON ROUGE, La. (AP) — Tropical Storm Francine churned in the Gulf of Mexico with increasing strength and was expected to reach hurricane status on Tuesday before making landfall in Louisiana.",
      "publishedAt": "2024-09-10T06:05:45Z",
      "title": "Francine gains strength and is expected to be a hurricane when it reaches US Gulf Coast",
      "url": "https://apnews.com/9e12ece295d4728a556caa31959de83e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b94319e897c44cf4b2689ec1ab6afb92/3000.jpeg"
    },
    {
      "author": "AARON MORRISON, ALANIS THAMES and TERRY TANG",
      "description": "MIAMI (AP) — After his traffic stop in Miami on Sunday, Tyreek Hill said he has received “the talk” about what to do when pulled over by police.",
      "publishedAt": "2024-09-10T04:07:11Z",
      "title": "Tyreek Hill's traffic stop shows interactions with police can be about survival for Black men",
      "url": "https://apnews.com/3f1a6585c3ae92c26b596bf1e8ee6e16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e9320f17c834a1ea41aa611d0455cac/2400.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}