{
  "articles": [
    {
      "author": "JILL COLVIN",
      "description": "WEST PALM BEACH, Fla. (AP) — Donald Trump, whose single turbulent term in the White House transformed the Republican Party, tested the resilience of democratic institutions in the U.S.",
      "publishedAt": "2024-03-13T03:10:09Z",
      "title": "Trump wins delegates needed to become GOP’s presumptive nominee for third straight election",
      "url": "https://apnews.com/12e336deeb619602f8335f1c4ca1663e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e65494c0f92942cc87e8311ae0d5cb4b/1920.jpeg"
    },
    {
      "author": "ROBERT YOON",
      "description": "WASHINGTON (AP) — It's official: Both President Joe Biden and former President Donald Trump have won enough delegates to be called presumptive presidential nominees.",
      "publishedAt": "2024-02-24T23:27:40Z",
      "title": "Why AP is calling Trump and Biden 'presumptive nominees' for president",
      "url": "https://apnews.com/22a0c2f1e0494925c16c1b633153b67c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a75abc97d5c4031aa0d69d551279932/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump clinched their parties' presidential nominations Tuesday with decisive victories in a slate of low-profile primaries, setting up a general election rematch that many voters do not want.",
      "publishedAt": "2024-03-12T04:05:50Z",
      "title": "Biden and Trump clinch nominations, setting the stage for a grueling general election rematch",
      "url": "https://apnews.com/15bb0084ad656903ffef14cfae822abd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/106c5589330a4caa93df31a5b09f72f0/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and MENELAOS HADJICOSTIS",
      "description": "RAFAH, Gaza Strip (AP) — An aid ship loaded with some 200 tons of food set sail for Gaza on Tuesday in a pilot program for the opening of a sea corridor to the territory, where the 5-month Israel-Hamas war has driven hundreds of thousands of Palestinians to the brink of starvation.",
      "publishedAt": "2024-03-12T07:12:04Z",
      "title": "An aid ship is sailing to Gaza, where hundreds of thousands face starvation 5 months into war",
      "url": "https://apnews.com/d2ba829df1df1092cf421fc591af9063",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2823329272bb46529cf291f2c8e5bf52/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO and EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Politicians across Haiti are scrambling for power after Prime Minister Ariel Henry announced Tuesday that he would resign once a transitional presidential council is created.",
      "publishedAt": "2024-03-12T04:33:00Z",
      "title": "Haiti is preparing itself for new leadership. Gangs want a seat at the table",
      "url": "https://apnews.com/28acaecc1d80d993c99fe43a5e1e1f7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56f5dbb1be484170b667c56858edf671/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Special counsel Robert Hur was thanking the president for his time. He understood, Hur said, that there were a lot of things going on that demanded Joe Biden’s attention.“We may be interrupted by one,” Biden said, explaining that he’d just gotten off the phone with Israeli Prime Minister Benjamin Netanyahu.",
      "publishedAt": "2024-03-13T04:02:15Z",
      "title": "Hur transcript reveals Biden presidency's profound and mundane moments",
      "url": "https://apnews.com/346b3538309207f23b3fd147b5ebeb34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/240630cf76d54051977c7f8969e2dc25/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL",
      "description": "CAN THO, Vietnam (AP) — Dao Bao Tran and her brother Do Hoang Trung, 11-year-old twins growing up on a rickety houseboat in the Mekong Delta, have dreams. Tran loves K-pop, watches videos at night to learn Korean and would love to visit Seoul.",
      "publishedAt": "2024-03-13T01:05:00Z",
      "title": "In Vietnam’s Mekong Delta, the lure of moving to the city grows even stronger amid climate shocks",
      "url": "https://apnews.com/87e4060730f1103e0a9ee88c083c8d63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ee9acbb64a9467da7f9bd19ea5c754c/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Muslims around the world are observing the holy month of Ramadan, with worship, charity, dawn-to-dusk fasting and nightly feasts.",
      "publishedAt": "2024-03-12T23:01:17Z",
      "title": "AP PHOTOS: Muslims around the world observe holy month of Ramadan with prayer, fasting",
      "url": "https://apnews.com/83ead097a3b0921f387bb70ad2b6b3fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eef5f6bb012444b4a068d213a875cd3c/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — It's been a common refrain when seeking proof that someone's story or some event actually took place: “Pics, or it didn't happen.” But in a world where the spread of technology makes photo manipulation as easy as a tap on your phone, the idea that a visual image is an absolute truth is as outdated as the daguerreotype.",
      "publishedAt": "2024-03-12T18:04:30Z",
      "title": "Delete a background? Easy. Smooth out a face? Seamless. Digital photo manipulation is now mainstream",
      "url": "https://apnews.com/183d90cd83ae56de24fb5e4d1b920b25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbe360993c6d4068a2dd90a010294187/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — House Republicans are launching a vast re-investigation of the Jan. 6, 2021 attack on the Capitol, seeking to push the blame away from Donald Trump who has been indicted over his actions or his supporters in the mob siege trying to overturn the 2020 election.",
      "publishedAt": "2024-03-13T04:13:50Z",
      "title": "House GOP launch new probe of Jan. 6 and try shifting blame for the Capitol attack away from Trump",
      "url": "https://apnews.com/188ee6406b93f42eb946d28f5213de3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7926c4987314d6594e91a172f2eeff2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}