{
  "articles": [
    {
      "author": "JEFF MARTIN and ISABELLA O'MALLEY",
      "description": "ATLANTA (AP) — In the final hours before Hurricane Idalia struck Florida the storm had grown into a Category 4 beast lurking off the state’s west coast, and the forecast called for it to continue intensifying up until landfall.",
      "publishedAt": "2023-09-01T04:39:02Z",
      "title": "In final hours before landfall, Hurricane Idalia stopped intensifying and turned from Tallahassee",
      "url": "https://apnews.com/bd627422701eb57c7789911509dd557a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ec239268c744d00bf4c716d88ea7fd6/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — Hawaii Gov. Josh Green said Thursday his administration has opened several investigations into people who have allegedly made unsolicited offers for property in the fire-stricken Maui town of Lahaina in violation of a new emergency order.",
      "publishedAt": "2023-09-01T03:49:14Z",
      "title": "Hawaii investigates unsolicited land offers as the state tries to keep Lahaina in local hands",
      "url": "https://apnews.com/5c4db4072dc4237da4213800444f4f17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/328311744be549889d5fc0597bdd7ab4/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and SARUUL ENKHBOLD",
      "description": "ULAANBAATAR, Mongolia (AP) — Pope Francis arrived in Mongolia on Friday morning on a visit to encourage one of the world’s smallest and newest Catholic communities. It's the first time a pope has visited the landlocked Asian country and comes at a time when the Vatican’s relations with Mongolia’s two powerful neighbors, Russia and China, are once again strained.",
      "publishedAt": "2023-08-31T16:43:22Z",
      "title": "Pope arrives on first visit to Mongolia as Vatican relations with Russia and China remain strained",
      "url": "https://apnews.com/605975020cf2e4979d1387e8b4616e53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3453c22834f1462a8fb6e78bfb4161cd/2892.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Two former leaders of the far-right Proud Boys extremist group were sentenced to more than a decade each in prison Thursday for spearheading an attack on the U.S.",
      "publishedAt": "2023-08-31T16:43:02Z",
      "title": "Two ex-Proud Boys leaders get some of longest sentences in Jan. 6 Capitol attack",
      "url": "https://apnews.com/5c8bf8a8e5dc6381e7387e31e554cee6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe453f688b0146d8a1c60d9667c7f27c/2446.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — In newly public testimony, Donald Trump boasts about building a multibillion-dollar brand and saving “millions of lives” as president.",
      "publishedAt": "2023-08-31T23:23:43Z",
      "title": "A look inside Donald Trump's deposition: Defiance, deflection and the 'hottest brand in the world'",
      "url": "https://apnews.com/63f4708b27a52a1e544e3caa6f63fa3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a941ecb0c564468dac9c1d21695c4b61/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and CHRISTINA A. CASSIDY",
      "description": "WASHINGTON (AP) — More than a dozen people nationally have been charged with threatening election workers by a Justice Department unit trying to stem the tide of violent and graphic threats against people who count and secure the vote.",
      "publishedAt": "2023-08-31T15:54:19Z",
      "title": "Election workers have gotten death threats and warnings they will be lynched, the US government says",
      "url": "https://apnews.com/f17df44d63156a28eaa0862b0aa08f0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17dc7e6ad6a24d6bb0113d78c6d25115/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — A nighttime fire ripped through a rundown apartment building mainly occupied by homeless people and squatters in Johannesburg early Thursday, leaving at least 74 dead, officials said.",
      "publishedAt": "2023-08-31T05:23:04Z",
      "title": "At least 74 are dead, many of them homeless, as fire rips through a rundown building in South Africa",
      "url": "https://apnews.com/a365fc66541584e61ec5cd3e7b375e67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cf7d73945b640879b8776f9a3982588/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The news lit up the world of weed: U.S. health regulators are suggesting that the federal government loosen restrictions on marijuana.",
      "publishedAt": "2023-08-31T22:48:45Z",
      "title": "US regulators might change how they classify marijuana. Here's what that would mean",
      "url": "https://apnews.com/b0b5fc3d34a83d2c95db1665f8149d42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8030e816db5c4ae1bca4bd01263c9319/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER, ACACIA CORONADO and KENDRIA LaFLEUR",
      "description": "AUSTIN, Texas (AP) — A vision of armed officers at every school in Texas is crashing into the reality of not enough money or police as a new mandate took effect Friday, showing how a goal more states are embracing in response to America's cycle of mass killings is proving unworkable in many communities.",
      "publishedAt": "2023-09-01T04:33:03Z",
      "title": "Texas wanted armed officers at every school after Uvalde. Many can't meet that standard",
      "url": "https://apnews.com/9a68ff8935fa376965ad754056de1673",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c35ba5377de48b3ac48b65358d71117/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — Slowly and steadily, an overheated American job market is returning to room temperature.The Labor Department is expected to report Friday that U.S. employers — companies, nonprofits and government agencies combined — added 170,000 jobs last month, according to a survey of forecasters by the data firm FactSet.",
      "publishedAt": "2023-09-01T04:01:21Z",
      "title": "US jobs report for August could point to a moderating pace of hiring as economy gradually slows",
      "url": "https://apnews.com/9a0309b7644eb10f4069d9cab0d66687",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0be5d7abe504bd4ad78b00553ee9e4d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}