{
  "articles": [
    {
      "author": "ALI SWENSON and LINLEY SANDERS",
      "description": "NEW YORK (AP) — Roughly 3 in 4 American adults believe the upcoming presidential election is vital to the future of U.S. democracy, although which candidate they think poses the greater threat depends on their political leanings, according to a poll.",
      "publishedAt": "2024-08-08T04:01:21Z",
      "title": "Majority of US adults say democracy is on the ballot but they differ on the threat: AP-NORC poll",
      "url": "https://apnews.com/9802e104ad29ff69e9e323ad46244ae3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d48edfc723a64442ab1e5b372da8933d/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — Gov. Tim Walz and his fellow Democrats have enacted big changes in the two years that they've had full control of the Minnesota Legislature, from expansions of abortion and LGBTQ+ rights to tax credits and other initiatives aimed at making life easier for families.",
      "publishedAt": "2024-08-08T04:07:14Z",
      "title": "The Walz record: Abortion rights, free lunches for schoolkids, and disputes over a riot response",
      "url": "https://apnews.com/1d03387a8941cc1952e03fcf09fc1390",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a6dc16fdd1147dd9c6c5f0a4f2ba949/3000.jpeg"
    },
    {
      "author": "PHILIPP-MORITZ JENNE and STEFANIE DAZIO",
      "description": "VIENNA (AP) — Both suspects in a foiled plot to attack Taylor Swift shows in Vienna appeared to be inspired by the Islamic State group and al-Qaida, Austrian authorities said Thursday, and investigators found bomb-making materials at one of their homes.",
      "publishedAt": "2024-08-08T07:49:12Z",
      "title": "Officials say suspects in foiled plot at Taylor Swift shows hoped to kill as many people as possible",
      "url": "https://apnews.com/17b494f1a164b205128d7faeb607e731",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4da1c335ed544d5f8a8790e2ddcefec0/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A new report from Human Rights Watch says Israeli soldiers killed at least seven people and severely wounded two, including a 5-year-old, when they attacked a home in Gaza City where a Palestinian family was sheltering from the Israel-Hamas war in December.",
      "publishedAt": "2024-08-08T10:42:27Z",
      "title": "Israel-Hamas war latest: Rights group says Israeli forces killed 7 sheltering in a Gaza City home",
      "url": "https://apnews.com/3221838eeaf57711fbbf2b81fe8486b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23344300d44a426d806db1888a6bacd4/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — Bangladesh’s next leader Muhammad Yunus arrived home Thursday from an overseas trip and will take office later in the day, as he looks to restore calm and rebuild the country following an uprising that ended the 15-year, increasingly autocratic rule of former Prime Minister Sheikh Hasina.",
      "publishedAt": "2024-08-08T04:58:43Z",
      "title": "Nobel laureate Yunus arrives in Bangladesh to take over as interim leader",
      "url": "https://apnews.com/8e72489d3f05ab50f1ea4564e5ad23aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6928357bd8414e00b7fca667f1928fee/1920.jpeg"
    },
    {
      "author": "RENATA BRITO and BARRY HATTON",
      "description": "BARCELONA, Spain (AP) — Police launched a manhunt in Barcelona on Thursday for ex-Catalonia leader Carles Puigdemont, a celebrated separatist who seven years after fleeing Spain sensationally returned to the country despite an outstanding arrest warrant.",
      "publishedAt": "2024-08-08T07:13:06Z",
      "title": "Ex-Catalan leader gives police the slip on his return to Spain after nearly 7 years as a fugitive",
      "url": "https://apnews.com/d89d88131983da1fdd39b6ddcb85c297",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65925d9b15c34fd7b09d54af7a7cc1ec/1920.jpeg"
    },
    {
      "author": "JEFFREY COLLINS and JOHN MINCHILLO",
      "description": "HUGER, S.C. (AP) — Tropical Storm Debby has made a second landfall in South Carolina on its way up the East Coast, where residents as far north as Vermont could get several inches of rain this weekend.",
      "publishedAt": "2024-08-08T04:10:28Z",
      "title": "Tropical Storm Debby makes 2nd landfall in South Carolina, heavy rain expected up the East Coast",
      "url": "https://apnews.com/d90428b0417df35fa1cae8b24793f5c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1e5a227500249338530e0829cab1689/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — The last time anyone heard from Edni López was Sunday. The 33-year-old political science professor and award-winning poet was preparing to board a flight to Argentina to visit a friend when she texted from the airport that something was wrong with her passport.",
      "publishedAt": "2024-08-08T04:24:32Z",
      "title": "An aid worker's airport disappearance stirs fear of repression following disputed Venezuela election",
      "url": "https://apnews.com/f59c93361b9b17e83c3af97ce0c7f275",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/105610dad2144637a60aa5e7326ee203/1200.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN",
      "description": "Earth’s string of 13 straight months with a new average heat record came to an end this past July as the natural El Nino climate pattern ebbed, the European climate agency Copernicus announced Wednesday.",
      "publishedAt": "2024-08-08T02:02:14Z",
      "title": "July ends 13-month streak of global heat records as El Nino ebbs, but experts warn against relief",
      "url": "https://apnews.com/8dde22d29ae273544ab5c2c24071d00b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18482990f684499496039edb743d1c80/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean officials on Thursday flagged that the sleek Samsung smartphones provided to North Korean athletes at the Paris Olympics would violate U.N.",
      "publishedAt": "2024-08-08T10:44:49Z",
      "title": "Those Samsung smartphones given to Olympic athletes? They may violate sanctions on North Korea",
      "url": "https://apnews.com/02fec24674d7043105e13a592247a757",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f19084d865e4625991f8576adb41862/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}