{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — ‘Prophet of doom’ who wounded 10 in rush-hour attack on New York City subway system is sentenced to life in prison.",
      "publishedAt": "2023-10-05T18:54:33Z",
      "title": "‘Prophet of doom’ who wounded 10 in rush-hour attack on New York City subway system is sentenced to life in prison",
      "url": "https://apnews.com/26891394beb176fa77ff1de83dd8b6a9",
      "urlToImage": ""
    },
    {
      "author": "FARNOUSH AMIRI and JILL COLVIN",
      "description": "WASHINGTON (AP) — Former President Donald Trump is in talks to visit Capitol Hill next week as Republicans debate who should be the next speaker of the House following Kevin McCarthy's stunning ouster, according to three people familiar with the talks.",
      "publishedAt": "2023-10-05T17:58:40Z",
      "title": "Donald Trump may visit the Capitol to address Republicans as they pick a new speaker, AP sources say",
      "url": "https://apnews.com/432f89f6826b2b4f51990ae4b4d293fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7aabdf0bc4b040e69426013be6a4d126/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Lawyers for Donald Trump asked a judge on Thursday to dismiss the Washington federal election subversion case against him, arguing the Republican is immune from prosecution for actions they say were taken in his official role as president.",
      "publishedAt": "2023-10-05T18:18:33Z",
      "title": "Trump lawyers seek dismissal of DC federal election subversion case, arguing presidential immunity",
      "url": "https://apnews.com/118943be656200bbc3f22cd8612c1f8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29be0212ae6f46b8a78a06a5136b557f/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and ALBERT AJI",
      "description": "BEIRUT (AP) — Syria's health minister has raised the casualty tolls from a drone attack on Thursday that hit a packed military graduation ceremony in the central city of Homs to 80 killed and 240 wounded.",
      "publishedAt": "2023-10-05T07:27:09Z",
      "title": "Syria's health minister raises casualty tolls in Homs drone strikes to 80 killed and 240 wounded",
      "url": "https://apnews.com/1de0a6b1572827dae766a6ba14fc7ac4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8b04f2f246a4e04a78676f6efb8c1da/3000.jpeg"
    },
    {
      "author": "TARA COPP, LOLITA C.BALDOR and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The U.S. on Thursday shot down an armed Turkish drone that had come too close to U.S. troops on the ground in northeastern Syria, U.S. officials told The Associated Press, in a rare use of force by one NATO member against another.",
      "publishedAt": "2023-10-05T16:49:11Z",
      "title": "US shoots down armed Turkish drone after it came too close to US troops in Syria",
      "url": "https://apnews.com/06b5b407e91ffb3d41096bbfe5f1ef75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32fefa6301e647dbbccf03df315b83da/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russian President Vladimir Putin said Thursday that hand grenade fragments were found in the bodies of people who died in the Aug. 23 crash of mercenary chief Yevgeny Prigozhin’s plane.",
      "publishedAt": "2023-10-05T17:52:59Z",
      "title": "Hand grenade fragments were found in the bodies of victims in Prigozhin's plane crash, Putin claims",
      "url": "https://apnews.com/3e60c6214ef1a6c0a859021b1f6c9056",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6dee75f94a7842b6907ea12cd74922ec/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — The Biden administration announced they waived 26 federal laws in South Texas to allow border wall construction on Wednesday, marking the administration’s first use of sweeping executive power to pave the way for building more border barriers — a tactic used often during the Trump presidency.",
      "publishedAt": "2023-10-04T22:48:03Z",
      "title": "The Biden administration says it is using executive power to allow border wall construction in Texas",
      "url": "https://apnews.com/147d7ab497e6991e9ea929242f21ceb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/821f8882404b458ea625caab543da615/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "Mike Dulak grew up Catholic in Southern California, but by his teen years, he began skipping Mass and driving straight to the shore to play guitar, watch the waves and enjoy the beauty of the morning.",
      "publishedAt": "2023-10-05T04:02:02Z",
      "title": "America's nonreligious are a growing, diverse phenomenon. They really don't like organized religion",
      "url": "https://apnews.com/91bb8430280c88fd88530a7ad64b03f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f46603c99cb4e9e82d6dfbdab00dfca/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "New research confirms that fossil human footprints in New Mexico are likely the oldest direct evidence of human presence in the Americas, a finding that upends what many archaeologists thought they knew about when our ancestors arrived in the New World.",
      "publishedAt": "2023-10-05T18:03:59Z",
      "title": "Further evidence points to footprints in New Mexico being the oldest sign of humans in Americas",
      "url": "https://apnews.com/33e086dac71d4054cd5f5122810a73bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8e43944e035499082b09f058fbafd73/2336.jpeg"
    },
    {
      "author": "ALEX VEIGA",
      "description": "LOS ANGELES (AP) — The cost of financing a home surged again this week as the average long-term U.S. mortgage rate climbed to its highest level since December 2000, further dimming the affordability outlook for many would-be homebuyers.",
      "publishedAt": "2023-10-05T16:14:06Z",
      "title": "The average long-term US mortgage rate surges to 7.49%, its highest level since December 2000",
      "url": "https://apnews.com/64b94275598c2a254e5a4dbe1b444219",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0806a15aba14f78b9b06b84319e8261/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}