{
  "articles": [
    {
      "author": "WAFAA SHURAFA and JOSEPH KRAUSS",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Palestinians scrambled to flee northern Gaza on Saturday after the Israeli military ordered nearly half the population to evacuate south and carried out limited ground forays ahead of an expected land offensive a week after Hamas' bloody, wide-ranging attack into Israel.",
      "publishedAt": "2023-10-14T04:26:01Z",
      "title": "Palestinians stream south in Gaza as Israel urges mass evacuation and conducts brief raids",
      "url": "https://apnews.com/785e0eb833715354cade4694e8ccbf67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f96d9a6143a6430e8d430079dd4e5c8d/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — More than a million people in the northern Gaza Strip have been ordered to evacuate to the south as the latest Israel-Hamas war entered its seventh day Friday and Israel appeared to be preparing a ground offensive.",
      "publishedAt": "2023-10-07T15:53:34Z",
      "title": "What to know in the latest Israel-Hamas war",
      "url": "https://apnews.com/b6ea877aa1ee96303aa0870d741da777",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8c3d5e6f95340e6a151fe3bf19e08bb/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — In Israel's call for the evacuation of half of Gaza's population, many Palestinians fear a repeat of the most traumatic event in their tortured history, their mass exodus from what is now Israel during the 1948 war surrounding its creation.",
      "publishedAt": "2023-10-13T18:36:43Z",
      "title": "In Israel's call for mass evacuation, Palestinians hear echoes of their original catastrophic exodus",
      "url": "https://apnews.com/a1bec1ee3477573e80b39b4044a48111",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f323972c54fb4f33b469bc126099b248/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, KEVIN FREKING and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Republicans chose firebrand Rep. Jim Jordan as their new nominee for House speaker during internal voting Friday, putting the gavel within reach of the staunch ally of GOP presidential front-runner Donald Trump.",
      "publishedAt": "2023-10-13T16:03:53Z",
      "title": "Republicans pick Jim Jordan as nominee for House speaker, putting job within the Trump ally's reach",
      "url": "https://apnews.com/ced017e71de967a7e327cba7e502926a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef3a8691fc584e7fa6b6775aaa4128bb/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Ethical concerns are casting a shadow over President Joe Biden as he seeks reelection amid ongoing investigations into his son Hunter Biden and a presidential impeachment inquiry, with a new poll showing that 35% of U.S.",
      "publishedAt": "2023-10-14T04:01:30Z",
      "title": "Hunter Biden investigations lead to ethical concerns about President Joe Biden, AP-NORC poll shows",
      "url": "https://apnews.com/fc56e4d79c8c98758e344cc13f7966ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48b94253754c499d92d4bb22ef0a1206/3000.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM",
      "description": "CHARLESTON, W.Va. (AP) — Sen. Joe Manchin of West Virginia has benefited from waiting to reveal where he stands as the swing vote in a chamber closely divided between Democrats and Republicans.He's taken the same approach when it comes to the next phase of his political career: The moderate Democrat has teased possible retirement, a run for reelection to the Senate or even a presidential campaign in 2024 — possibly as an independent candidate.",
      "publishedAt": "2023-10-14T04:11:04Z",
      "title": "Sen. Joe Manchin considers independent 2024 run, warns party system could be nation's 'downfall'",
      "url": "https://apnews.com/1622326ec6890c5e33dbd30327d51f85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa0acb3db5a14f389a7c8c44d016a98b/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "SAN JOAQUIN, Venezuela (AP) — The avocado trees across the road from Jose Hernandez's tin-roofed home help feed several retirees in the rural community of San Joaquin along a highway two hours southwest of Venezuela’s capital.",
      "publishedAt": "2023-10-14T04:40:59Z",
      "title": "Evolving crisis fuels anxiety among Venezuelans who want a better economy but see worsening woes",
      "url": "https://apnews.com/afabb9dee444128c5ec4593a51e78896",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7400a53c2ad41fcade3bd9c7b1a60e4/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — A rare “ring of fire” eclipse of the sun cuts across the Americas on Saturday, stretching from Oregon to Brazil.",
      "publishedAt": "2023-10-14T04:07:07Z",
      "title": "'Ring of fire' solar eclipse will cut across the Americas, stretching from Oregon to Brazil",
      "url": "https://apnews.com/81b8ba2d557c8f42cb90756fc4b342a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38ca06a235f24bf8b935f3901f452fc4/2894.jpeg"
    },
    {
      "author": "JEFFREY SCHAEFFER and ANGELA CHARLTON",
      "description": "ARRAS, France (AP) — France will mobilize up to 7,000 soldiers to increase security around the country after a teacher was fatally stabbed and three other people wounded in a school attack by a former student suspected of Islamic radicalization, the president’s office said Saturday.",
      "publishedAt": "2023-10-14T07:41:52Z",
      "title": "France is deploying 7,000 troops after a deadly school stabbing by a suspected Islamic radical",
      "url": "https://apnews.com/96a24beba514c71e61ceb8c25da2cff7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc903e80be9d45a6acb3595a706fbf1a/3000.jpeg"
    },
    {
      "author": "DAN GELSTON",
      "description": "PHILADELPHIA (AP) — Bryce Harper has manhandled postseason pressure with the ease of one of his swings -- bat tucked behind his helmet, short ground step, then, whack! -- against a slider.He’s crushed it.",
      "publishedAt": "2023-10-13T18:32:08Z",
      "title": "Bryce Harper shines as Phillies aim for second straight World Series",
      "url": "https://apnews.com/27276d3c9ee20a421fc98b68a9b0b03f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2416b8f08a54f64937a0e0a92fedc11/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}