{
  "articles": [
    {
      "author": null,
      "description": "European leaders will join Ukraine’s President Volodymyr Zelenskyy for his crucial meeting with President Donald Trump, European Commission President Ursula von der Leyen said on Sunday. The move in relation to the key White House meeting on Monday is an apparent effort to prevent a repeat of the heated encounter Zelenskyy faced when he met Trump in February. Von der Leyen, head of the European Union’s executive branch, posted on X that “at the request of President Zelenskyy, I will join the meeting with President Trump and other European leaders in the White House tomorrow.”",
      "publishedAt": "2025-08-17T10:25:59Z",
      "title": "European leaders to join Zelenskyy for meeting with Trump",
      "url": "https://apnews.com/article/european-leaders-white-house-meeting-zelenskyy-trump-d7b082bae4136ef8932e16ac2d166303",
      "urlToImage": "https://dims.apnews.com/dims4/default/c4d6689/2147483647/strip/true/crop/7556x4250+0+393/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Ff4%2F441dd7acbd14903dc6fde034109d%2F26522dc7646b4212a5c8db7705c045ea"
    },
    {
      "author": null,
      "description": "Special U.S. envoy Steve Witkoff says Russian leader Vladimir Putin agreed at his summit with President Donald Trump to allow the U.S. and European allies to offer Ukraine a security guarantee resembling NATO’s collective defense mandate as part of an eventual deal to end the 3 1/2-year war. Witkoff told CNN's “State of the Union” on Sunday that “the United States could offer Article 5-like protection, which is one of the real reasons why Ukraine wants to be in NATO.” Witkoff said was the first time he had heard Putin agree to that.",
      "publishedAt": "2025-08-17T13:40:24Z",
      "title": "Putin agreed to NATO-style security protections for Ukraine, Trump envoy says",
      "url": "https://apnews.com/article/trump-witkoff-ukraine-russia-putin-war-048aa829a69b4020ca368577bfe18aee",
      "urlToImage": "https://dims.apnews.com/dims4/default/19ea50d/2147483647/strip/true/crop/4990x2807+0+593/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F73%2F56c12920a46d533d106058090fe4%2Fd65000c2811d4ff29e96401d981c092b"
    },
    {
      "author": null,
      "description": "Families of hostages held in Gaza are stepping up their campaign to secure their release by holding a strike across Israel. The Hostages and Missing Families Forum organized a “day of stoppage\" on Sunday as Prime Minister Benjamin Netanyahu faces pressure over stalled hostage talks and a new Gaza offensive. Protesters fear further fighting could endanger the 50 hostages believed to remain in Gaza, only about 20 of whom are thought to be alive. Netanyahu has demanded the unconditional and immediate release of the hostages but is balancing competing pressures, haunted by the potential for mutiny within his coalition.",
      "publishedAt": "2025-08-17T08:05:04Z",
      "title": "Israel: Protesters go on strike demanding ceasefire and release of Gaza hostages",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-hostages-protest-08-17-2025-260c6b0f9e79698d635a0e50da5c51bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea71a88/2147483647/strip/true/crop/5451x3066+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2Fe6%2Ff4bbda5d83f0c55bba5533a8fb6c%2Fa95d3ff41ec144858ca0273e45bab542"
    },
    {
      "author": null,
      "description": "Relations between Beirut and Damascus remain tense — as they have been for decades past, a time during which Syria failed to treat its smaller neighbor as a sovereign nation. A lot has happened on both sides of the Lebanon-Syria border. A lightning offensive by Islamist insurgents in Syria toppled longtime autocrat Bashar Assad last December and brought a new government in place in Damascus. In Lebanon, a bruising war with Israel dealt a serious blow to Hezbollah and a U.S.-negotiated deal has brought a fragile ceasefire. Still, even with the fall of Syria's 54-year Assad family rule and the events in Lebanon of the past year, attempts to reset Lebanese-Syrian political ties have been slow to take hold.",
      "publishedAt": "2025-08-17T05:26:44Z",
      "title": "Syria-Lebanon ties remain strained despite political changes",
      "url": "https://apnews.com/article/lebanon-syria-assad-hezbollah-border-detainees-3b9f93c92835a7c1d0e498ca7fac865a",
      "urlToImage": "https://dims.apnews.com/dims4/default/feaa299/2147483647/strip/true/crop/1222x687+0+63/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F81%2Fc1ac22c0ec4c15b2741ba504d542%2F74987087e09a4e30abeb9072061be839"
    },
    {
      "author": null,
      "description": "Pakistani officials say they are expanding rescue and relief operations after flash floods killed more than 220 people in a single northwest district and destroyed homes, roads, and businesses. Buner, a mountainous part of Khyber Pakhtunkhwa province, was struck by cloudbursts and torrential rains that triggered flash floods and landslides. Crews were using heavy machinery on Sunday to remove the rubble of collapsed homes after families reported that some of their relatives were missing. Higher-than-normal monsoon rains have lashed Pakistan since June 26 and killed more than 600, according to the National Disaster Management Authority.",
      "publishedAt": "2025-08-17T06:27:19Z",
      "title": "Pakistan expands rescue and relief efforts after floods kill hundreds",
      "url": "https://apnews.com/article/pakistan-floods-search-relief-operation-northwest-e4333febfc2f379953bae49b86ce04af",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a008e5/2147483647/strip/true/crop/3378x1900+0+176/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2F7c%2F1a1e61915557f2c2135e1cf7100d%2F5c1f56495f624b90965ba1ed5406b3eb"
    },
    {
      "author": null,
      "description": "Members of the African American Mayors Association started noticing last year declines in violent crime in their cities. But, those accomplishments, which they felt were already overlooked, became further buried this week with the Trump administration’s unprecedented law enforcement takeover in the nation’s capital. President Donald Trump has deployed the first of 800 National Guard members to Washington, D.C. But, the Republican president is setting his sights on other cities including Baltimore, Chicago, Los Angeles and Oakland, California. One thing they all have in common: They're led by Black mayors. The federal government’s actions have heightened some of these mayors’ desires to champion the strategies they’ve used to help make their cities safer.",
      "publishedAt": "2025-08-17T13:02:55Z",
      "title": "Black mayors see drop in violent crime with new strategies",
      "url": "https://apnews.com/article/black-mayors-national-guard-police-takeover-dc-aa9a9cd07f0704b13f3d2deb2e351e44",
      "urlToImage": "https://dims.apnews.com/dims4/default/b17d8cd/2147483647/strip/true/crop/5962x3354+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Fac%2F72b2c1a44e82f9680dd11c09cb1a%2Ff0ffe110273440218518f245e7dfc334"
    },
    {
      "author": null,
      "description": "Pope Leo XIV is spending the last Sunday of his summer vacation with several dozen homeless and poor people and the church volunteers who help them. He is celebrating a special Mass for them and inviting them into the Vatican’s lakeside estate for a lunch of lasagna and roast veal. In his homily, Leo celebrated the “fire of charity” that had brought them together. Leo, the former Robert Prevost, spent most of his adult life working with the poor people of Peru, first as an Augustinian missionary and then as bishop. There, he greatly reinforced the work of the local Caritas charity, opening soup kitchens and shelters for migrants.",
      "publishedAt": "2025-08-17T09:30:49Z",
      "title": "Pope Leo XIV celebrates Mass for local homeless people, invites them to lunch at summer villa",
      "url": "https://apnews.com/article/pope-leo-poor-caritas-f4d88950c63c64b4fb2fbd3be1b7c3d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/51fc1f1/2147483647/strip/true/crop/3528x1985+0+184/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2Fc8%2F03e35f2e5e5293981eedf487420c%2F9210bd9b97f94dfe9c91432f8819ab2b"
    },
    {
      "author": null,
      "description": "Hurricane Erin has been downgraded to a Category 3 hurricane. A tropical storm warning is in effect for the Turks and Caicos Islands as winds and heavy rains hit the Virgin Islands and Puerto Rico. Erin, the first Atlantic hurricane of 2025, reached Category 5 before weakening. The National Hurricane Center in Miami reported Sunday that Erin had maximum sustained winds of 125 mph. The storm's center is about 155 miles north of San Juan, Puerto Rico. Scientists link the rapid intensification of hurricanes in the Atlantic to climate change, with global warming causing more intense storms.",
      "publishedAt": "2025-08-17T09:38:16Z",
      "title": "Hurricane Erin downgraded to Category 3 as tropical storm warning issued for Turks and Caicos",
      "url": "https://apnews.com/article/hurricane-erin-caribbean-turks-caicos-d686d5a5844bb300b30dd1c9019b112f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Air Canada says it plans to resume flights on Sunday after the Canadian government intervened and forced the airline and its striking flight attendants back to work and into arbitration. The strike stranded more than 100,000 travelers around the world during the peak summer travel season. The country’s largest airline says in a release that the first flights will resume Sunday evening but that it will take several days before its operations return to normal. It said some flights will be canceled over the next seven to 10 days until the schedule is stabilized.",
      "publishedAt": "2025-08-17T10:11:39Z",
      "title": "Air Canada says it is restarting flights Sunday",
      "url": "https://apnews.com/article/air-canada-strike-flight-attendants-541145adf4092a677f3e7f2df7ffd7b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/69d4cb0/2147483647/strip/true/crop/4000x2250+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F24%2F1dd7cebc4d4c730e1408aad71cb5%2Ff61998ecd0e24a4fa8c26557599be1c1"
    },
    {
      "author": null,
      "description": "Three people are dead and eight others wounded after a shooting in a crowded New York City club. Law enforcement believe a shooter or shooters opened fire with multiple weapons at Taste of the City Lounge in the Brooklyn neighborhood of Crown Heights just before 3:30 a.m. on Sunday, killing three men. New York Police Department Commissioner Jessica Tisch told reporters that it was “a terrible shooting.\" She said officers have recovered at least 36 shell casings from the lounge on Sunday morning, as well as a firearm that was discovered in a nearby street.",
      "publishedAt": "2025-08-17T11:37:24Z",
      "title": "Three killed, eight injured in shooting in crowded New York club amid record low gun violence year",
      "url": "https://apnews.com/article/new-york-shooting-three-dead-7e1143b6869c1ee16ee316ffcf2b476b",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}