{
  "articles": [
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israel on Sunday said it had recovered the bodies of six hostages in Gaza, including a young Israeli-American man who became one of the most well-known captives held by Hamas as his parents met with world leaders and pressed for his release, including at the Democratic convention last month.",
      "publishedAt": "2024-09-01T03:11:35Z",
      "title": "Israel recovers the bodies of 6 hostages in Gaza, including Israeli-American Hersh Goldberg-Polin",
      "url": "https://apnews.com/29496f50a9b1740bd3905035ffd23052",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e82dddceacda4263a1fd93991104cc77/1600.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Vice President Kamala Harris said former President Donald Trump “disrespected sacred ground” in his recent appearance at Arlington National Cemetery, where the Republican nominee took and distributed images despite a federal prohibition on campaign activity on the grounds.",
      "publishedAt": "2024-08-31T23:43:40Z",
      "title": "Harris calls Trump's appearance at Arlington a 'political stunt' that 'disrespected sacred ground'",
      "url": "https://apnews.com/403925774d9ca65034b7a3281701d7f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e4936b60c9444f18fc2cc06e6ed6b0d/3000.jpeg"
    },
    {
      "author": "ALI SWENSON, MORIAH BALINGIT and AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — In her welcoming remarks at Moms for Liberty’s annual gathering in the nation’s capital on Friday, the group’s co-founder, Tiffany Justice, urged members to “fight like a mother” against the Democratic presidential ticket.",
      "publishedAt": "2024-08-31T20:04:50Z",
      "title": "Moms for Liberty fully embraces Trump and widens role in national politics as election nears",
      "url": "https://apnews.com/7c252c611b5bc73c333a24392b979372",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e371b812d8cc4d63b5f11dfa6dbecbda/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — If any evidence were needed to underscore that Pope Francis’ upcoming trip to Asia and Oceania is the longest, farthest and most challenging of his pontificate, it’s that he’s bringing along his secretaries to help him navigate the four-country program while keeping up with work back home.",
      "publishedAt": "2024-09-01T03:35:17Z",
      "title": "Pope embarks on longest, farthest and most challenging trip to Asia, with China in the background",
      "url": "https://apnews.com/19930e8f324ffc7f0c59ce30ab995585",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b8caeee6a074949946e9f8795a80497/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA and CATERINA MORBIATO",
      "description": "MEXICO CITY (AP) — “That’s it, dude! Done!,” exclaimed Eliezer López as he jumped up and down, throwing his arms to the sky and drawing a sign of the cross across his chest. His joy was so contagious, his friends started to emerge from nearby tents to celebrate with him.",
      "publishedAt": "2024-09-01T04:06:29Z",
      "title": "Migrants build makeshift life in Mexico City while waiting for US asylum",
      "url": "https://apnews.com/22b49fabf6e4d7d25d2873d0637544fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7b4f79a1ca540bea8c62509a107dd17/1920.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — The blocking of social media platform X in Brazil divided users and politicians over the legitimacy of the ban, and many Brazilians on Saturday had difficulty and doubts over navigating other social media in its absence.",
      "publishedAt": "2024-08-31T21:38:22Z",
      "title": "On the first day without X, many Brazilians say they feel disconnected from the world",
      "url": "https://apnews.com/1e896a1daedeaed6a09cf27205feb08a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ec91f33897945268b2dd5d2cd716707/3000.jpeg"
    },
    {
      "author": null,
      "description": "SAN FRANCISCO (AP) — 49ers wide receiver Ricky Pearsall was shot in the chest Saturday during an attempted robbery in central San Francisco, officials said, and he was reported to be in serious but stable condition.",
      "publishedAt": "2024-09-01T01:05:09Z",
      "title": "49ers WR Ricky Pearsall shot in attempted robbery in San Francisco, condition 'serious but stable'",
      "url": "https://apnews.com/3afececadc18b6b10d2df411a27c7d43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6a33206020f4dafaae89b6231ce1215/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — Paralympic triathlon competitions in Paris scheduled for Sunday have been postponed because of concerns about water quality in the Seine River after heavy rainfall, organizers said.",
      "publishedAt": "2024-09-01T05:33:04Z",
      "title": "Paralympic triathlon events are postponed because of poor water quality in the Seine River",
      "url": "https://apnews.com/5838f9850944082a8daadcff70017391",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d24b4ba5afcf49b998fd4ef4b619b294/3000.jpeg"
    },
    {
      "author": "RYAN DOAN-NGUYEN",
      "description": "Before she cut the air on the world’s biggest sporting stage with head-spinning, gravity-defying moves, Logan Edra, aka B-Girl Logistx, held herself with a razor-sharp focus.Brows furrowed and hands anchored at her hips, Team USA’s youngest breaker this year seemed more serious than some of her competitors at the Paris Olympics.",
      "publishedAt": "2024-09-01T04:21:05Z",
      "title": "Minority athletes hope their Olympic journeys will sway intolerant hearts and minds",
      "url": "https://apnews.com/71dc9a7d7ab5cd306df9d5b9c6b471d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c588d860f90a41558cfa29c92697583f/2982.jpeg"
    },
    {
      "author": "THOMAS PEIPERT",
      "description": "DENVER (AP) — Simon Rubick had lost almost everything to decades of alcoholism and drug addiction.In 2022, he found himself without a vehicle and without a home, which forced his two teenage children to move in with friends.",
      "publishedAt": "2024-09-01T04:06:19Z",
      "title": "Giving up pets to seek rehab can worsen trauma. A Colorado group intends to end that",
      "url": "https://apnews.com/0575655679d0d228e4dca9a83ca9c2c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/216fb89a40884bc9a231dec876619b9f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}