{
  "articles": [
    {
      "author": "Melanie Lidman, Samy Magdy",
      "description": "Israel has identified the remains two hostages after Hamas handed over their bodies to the Red Cross. Israeli officials say that the bodies belong to Ronen Engel and Sonthaya Oakkharasri. They were killed during Hamas' attack on southern Israel on Oct. 7, 2023. Israel has threatened on Sunday to keep the Rafah border crossing closed until Hamas fulfills its ceasefire role of returning all deceased hostages. Hamas has handed over the remains of 13 bodies. Eleven of them have been identified as hostages. Israel said one of the bodies released didn't belong to a hostage. The Palestinian group said that talks to launch the second phase of ceasefire negotiations have begun.",
      "publishedAt": "2025-10-19T06:42:26Z",
      "title": "Israel identifies bodies of 2 hostages as major Gaza crossing remains closed",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-10-19-2025-f3d95cf76018541ff824853d1bcd3356",
      "urlToImage": "https://dims.apnews.com/dims4/default/334b004/2147483647/strip/true/crop/7382x4152+0+384/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F1c%2F5d3c949b875a92e98080bc3c02a8%2Fd8683f45818741dfa399b81a7726ea62"
    },
    {
      "author": "Chris Megerian, Dánica Coto",
      "description": "President Donald Trump says he'll slash U.S. funding to Colombia because the country’s leader “does nothing to stop” drug production. In a social media post Sunday, Trump referred to Colombian President Gustavo Petro as “an illegal drug dealer” who is “low rated and very unpopular.” He warned that Petro “better close up” drug operations “or the United States will close them up for him, and it won’t be done nicely.”",
      "publishedAt": "2025-10-19T13:01:05Z",
      "title": "Trump announces an end to US aid to Colombia",
      "url": "https://apnews.com/article/trump-petro-colombia-drugs-us-aid-c3955b2ce351737119920741178e0567",
      "urlToImage": "https://dims.apnews.com/dims4/default/510ebbc/2147483647/strip/true/crop/6320x3555+0+329/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F7f%2F62fb9223a9d1fc35f59a8c95e671%2Fa7fbe0ad39b049859db2e8cf002882e6"
    },
    {
      "author": null,
      "description": "Freed from the prison where he had been serving time for ripping off his campaign donors, former U.S. Rep. George Santos says he’s humbled by his experience behind bars. But he says he's also unconcerned about the “pearl clutching” of critics upset that President Donald Trump granted him clemency. Speaking on CNN’s “State of the Union,” Santos said Sunday that if Trump “had pardoned Jesus Christ off the cross, he would have had critics.” Santos won office after inventing a bogus persona as a Wall Street dealmaker. He was serving a 7-year prison sentence for fraud and identity theft when Trump ordered him released him Friday.",
      "publishedAt": "2025-10-19T18:02:08Z",
      "title": "George Santos humbled by commutation but dismisses critics",
      "url": "https://apnews.com/article/trump-george-santos-commutation-pardon-interview-ff21b286cdcffcf45853883ba05ee69d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c21ab0/2147483647/strip/true/crop/2585x1454+0+134/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fbd%2F8b22fcbe634a39c19101c486cfee%2Fae3f3e7e51bd43f9bb5058e3a96bcb70"
    },
    {
      "author": "Gabriela Aoun Angueira",
      "description": "State emergency management officials say they're facing funding challenges from the federal government that threaten the country's ability to respond to crises. The Trump administration has cut state grants and tied funding to immigration enforcement. And the government shutdown adds to the problem. Last week, a federal judge ordered the Department of Homeland Security to stop linking grants to immigration enforcement. Some states have seen drastic cuts to homeland security grants, leading to a freeze on the entire $1 billion program. Emergency management agencies are delaying hiring and equipment purchases. Experts warn these disruptions could jeopardize preparedness and response to disasters.",
      "publishedAt": "2025-10-19T11:32:59Z",
      "title": "Delays in federal FEMA grants risk jeopardizing disaster response",
      "url": "https://apnews.com/article/fema-grants-disasters-immigration-homeland-security-d9c085bc480c12a0ea4c8f283252510b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d76676/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F92%2F83d4bd29732bfd1ebc0175b4eec2%2F511616ce02af44938e82b51670757459"
    },
    {
      "author": "Josh Boak, Linley Sanders",
      "description": "Americans are increasingly worried about their ability to find a good job under President Donald Trump. That finding from an Associated Press-NORC Center for Public Affairs poll is a potential warning sign for the Republican president and his party as a promised economic boom is giving way to hiring freezes and higher prices. About half of U.S. adults are “not very confident” or are “not at all confident” they could find a good job if they wanted to. That's up from 37% when the same question was asked two years ago. People also worried about high prices for groceries, housing and gasoline, and rising electricity bills.",
      "publishedAt": "2025-10-19T12:05:45Z",
      "title": "Concern about ability to find a good job rises, AP-NORC poll finds",
      "url": "https://apnews.com/article/poll-economy-trump-inflation-electricity-costs-hiring-jobs-ffa4a9de69db090f47f968ba656d694b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a88cae2/2147483647/strip/true/crop/7719x4342+0+402/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F08%2Ffd13d08e12a3b7ab571ee9c23fca%2F93a3bfc812c641cd957dbf8686aceaef"
    },
    {
      "author": "Thomas Adamson",
      "description": "Thieves have pulled off a daring heist at the Louvre, using a basket lift to reach the museum on Sunday morning. They forced a window, smashed display cases, and fled with jewels of \"inestimable value,\" according to France's interior minister. The museum closed for the day as police sealed gates and ushered visitors out. The robbery took place in the Galerie d’Apollon, where part of the French Crown Jewels are displayed. The thieves reportedly took nine pieces from the jewelry collection of Napoleon and the Empress. Security and staffing at the Louvre have been under scrutiny.",
      "publishedAt": "2025-10-19T09:46:25Z",
      "title": "Thieves use basket lift in daring Louvre robbery, steal priceless jewels",
      "url": "https://apnews.com/article/france-louvre-museum-robbery-a3687f330a43e0aaff68c732c4b2585b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6fb39d/2147483647/strip/true/crop/4030x2267+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faa%2F29%2F9a8dc2bca0198aa5c0597749170f%2Fc1d6fa3557f84bf5931e8a2dfda4b9f3"
    },
    {
      "author": null,
      "description": "Ukrainian drones have struck a major gas processing plant in southern Russia, causing a fire. The Orenburg plant, operated by Gazprom, is one of the world's largest facilities of its kind. The regional governor says the attack damaged a workshop but caused no casualties. Ukraine's military claims a large-scale fire erupted at the plant. Kyiv has increased attacks on Russian energy facilities in recent months. Elsewhere, U.S. President Donald Trump has suggested that Kyiv may have to give up territory in exchange for an end to Moscow’s aggression, in the latest of apparent reversals on how to pursue peace.",
      "publishedAt": "2025-10-19T09:45:19Z",
      "title": "Ukrainian drones hit major gas plant in southern Russia, causing fire",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-gas-strikes-energy-50826ce7b96814ad943d8721c1a2915c",
      "urlToImage": "https://dims.apnews.com/dims4/default/51c072a/2147483647/strip/true/crop/3239x1822+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc8%2F7609c0432b7349da60e1f78a2de6%2F709b901e9ed941b7a718bb791ab1480f"
    },
    {
      "author": "Mark Scolforo",
      "description": "Limp Bizkit band members say bass player Sam Rivers died on Saturday. His bandmates are praising him as \"pure magic\" and \"the soul in the sound.\" Lead singer Fred Durst says Rivers' musical gift is going to keep on giving. The 48-year-old Rivers had previously left the band in 2015 due to liver disease but rejoined three years later. Limp Bizkit is scheduled to tour Central and South America starting in late November. Limp Bizkit has roots in Jacksonville, Florida. It emerged in the late 1990s with a sound that melds altenative rock, heavy metal and rap.",
      "publishedAt": "2025-10-19T15:18:15Z",
      "title": "Limp Bizkit mourns bassist Sam Rivers, calling him irreplaceable",
      "url": "https://apnews.com/article/limp-bizkit-sam-rivers-bass-player-316bdc57a361ce0189ea5e483a6faa8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb8098a/2147483647/strip/true/crop/5088x2862+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F87%2F4b370ee260f40828d9fda922588d%2Fa508e57043b3488191b8a515260c7a61"
    },
    {
      "author": "Brian Melley",
      "description": "London police are investigating whether Prince Andrew asked a police officer to find damaging information on Virginia Giuffre, who accused him of sexual assault. Reports suggest Andrew sought to smear Giuffre in 2011 by trying to check her criminal record. This comes after Buckingham Palace announced Andrew would give up his Duke of York title following more revelations of his friendship with convicted sex offender Jeffrey Epstein. Giuffre’s family wants King Charles III to strip Andrew of his prince title. The duke’s demise began in 2019 following a disastrous interview in which Andrew sought to counter media reports about his friendship with Epstein and denied allegations he had sex with a 17-year-old Giuffre.",
      "publishedAt": "2025-10-19T10:50:56Z",
      "title": "Police looking into whether Prince Andrew enlisted officer to dig up dirt on accuser Giuffre",
      "url": "https://apnews.com/article/prince-andrew-charles-epstein-giuffre-police-90af5868e0bcd2ecf4a07b1fb8b3bb68",
      "urlToImage": "https://dims.apnews.com/dims4/default/6dbde71/2147483647/strip/true/crop/5906x3322+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F33%2F9121e5e4806ff76fbfa3ea04fc46%2F2893df4e109d4c158a50d3ff48c34f36"
    },
    {
      "author": "Eric Olson",
      "description": "Vanderbilt is now a top-10 team in college football for the first time since 1947. The Commodores' rise comes after a weekend where nine teams in The Associated Predss Top 25 lost. Ohio State remains No. 1 for the eighth straight week after defeating Wisconsin 34-0. Four top-10 teams lost in the same week for the third time this season. Indiana is up to a program-record No. 2 and Texas A&M moved to No. 3 for its highest ranking since 1995. Alabama and Georgia also climbed. Vanderbilt is 6-1 and off to its best start since 1950.",
      "publishedAt": "2025-10-19T18:01:36Z",
      "title": "What happened in the AP Top 25?",
      "url": "https://apnews.com/article/ap-top-25-47ce0f6019322adcebee6674241e0afd",
      "urlToImage": "https://dims.apnews.com/dims4/default/595acf1/2147483647/strip/true/crop/5434x3057+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F90%2Ff1838953bf268955cbc48749a2c6%2Fc603c8cc44cb45769d1c1f9e1491a529"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}