{
  "articles": [
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — In recent years the movie industry has gone through the streaming revolution, the pandemic, labor strikes and “Barbenheimer.” But after countless upheavals in Hollywood, you're still more than twice as likely to see male speaking characters in theatrical releases than you are female ones.",
      "publishedAt": "2024-08-05T13:01:18Z",
      "title": "One thing that hasn't changed in Hollywood: Male characters still more than double female ones",
      "url": "https://apnews.com/ebdc7eed509f3ca12d4e1713722b6ea0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6394491c7fba4d75aa1f40557719c2db/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military ordered more evacuations in southern Gaza early Sunday, a day after a deadly airstrike on a school-turned-shelter in the north killed at least 80 Palestinians, according to local health authorities.",
      "publishedAt": "2024-08-11T07:15:02Z",
      "title": "Israel widens evacuation orders in southern Gaza after a deadly strike on a school-turned-shelter",
      "url": "https://apnews.com/18b0a73f930e3cc472a4207168b09ac1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a94c0722e85744c9997b2a69bc0d39a4/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "LAS VEGAS (AP) — Big crowds, go-to applause lines, talk of joy — and some unsolicited Republican counterprogramming.These were common themes during the first big campaign swing for Vice President Kamala Harris and her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-11T15:43:08Z",
      "title": "Early Harris-Walz rallies feature big crowds, talk of 'joy' and unsolicited GOP counterprogramming",
      "url": "https://apnews.com/7da99aace01fec1c784fba27fdbce558",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d35ea168f244cdf8cc07c81c055c689/3000.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA",
      "description": "Latino voters and leaders say they are enthusiastic about Kamala Harris as the Democratic presidential nominee, but for her to win their crucial support, they want to know where she stands on issues like the economy, immigration and education.",
      "publishedAt": "2024-08-11T12:02:44Z",
      "title": "Latinos are excited about Harris, but she has work to do to win the crucial voting bloc, experts say",
      "url": "https://apnews.com/74ebbf92bd21d581bc1462f52fc7e6a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab305286463441b99f23e99adb1cb168/3000.jpeg"
    },
    {
      "author": "JANIE HAR and GEOFF MULVIHILL",
      "description": "SAN FRANCISCO (AP) — San Francisco Mayor London Breed has launched a new crackdown on people sleeping outside in a campaign to clear the sidewalks of homeless encampments that have come to define the city.",
      "publishedAt": "2024-08-11T04:01:27Z",
      "title": "Everyone agrees there's a homeless crisis in the US. Plans to address it vary among mayor candidates",
      "url": "https://apnews.com/8c0cfca3416ae564022639dd574901d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/060b04554a434e0595e09897aaaf7f59/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — In French, there are no goodbyes. Instead, Olympic crowds from Paris to the surfing venue in Tahiti were saying “au revoir” — see you again — as the 2024 Games drew to a close Sunday.",
      "publishedAt": "2024-08-11T08:56:36Z",
      "title": "Paris and the Olympics have changed each other during their summer fling",
      "url": "https://apnews.com/1da49a20c1af4c83f58b370736c0e59b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54fc0489ce4649aa99ab9dcfa0f08302/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "MIAMI (AP) — The dated gold and silver trophies packed in the china cabinet of Dr. Vivek Murthy’s childhood home still boast the surgeon general’s many talents, from dance performances to math competitions.",
      "publishedAt": "2024-08-11T11:56:33Z",
      "title": "US surgeon general was warned by his mom to avoid politics, but he jumped into the fray anyway",
      "url": "https://apnews.com/f2cff4178e6e6ca311099d2741e277a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b85d088405f4bda86b96871a08d119a/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Days after Ukraine began a surprise military incursion into Russia’s Kursk border region, President Volodymyr Zelenskyy has broken the government’s silence on it by indirectly acknowledging the ongoing military actions to “push the war out into the aggressor’s territory.”",
      "publishedAt": "2024-08-11T07:00:19Z",
      "title": "Ukraine's president indirectly acknowledges daring military incursion onto Russian soil",
      "url": "https://apnews.com/256adcd7e5ad8beef792a08fc0f0fe8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a54c306508a4b8790b0bbcf5a9d026b/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG and MARGERY A. BECK",
      "description": "MANKATO, Minn. (AP) — Jacob Reitan said he told Gwen Walz he was gay before he told his parents.Reitan was a student in 1999 at Mankato West High School in Minnesota, where Walz and her husband, Tim, were teachers.",
      "publishedAt": "2024-08-11T11:32:19Z",
      "title": "Former students and colleagues recall high school teachers Tim and Gwen Walz as allies and advocates",
      "url": "https://apnews.com/4e03b28f956e7862dc72d25b852af448",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e59eeae89d7a43d3a3d5c1acec2a2492/1920.jpeg"
    },
    {
      "author": "RODNEY MUHUMUZA",
      "description": "KAMPALA, Uganda (AP) — A vast landfill site in the Ugandan capital has collapsed, killing at least 18 people, the Red Cross said. Fourteen other people were injured when the Kiteezi landfill, which serves as a waste disposal site for much of Kampala, collapsed late Friday.",
      "publishedAt": "2024-08-11T12:02:40Z",
      "title": "At least 18 dead after landfill site collapses in Uganda's capital",
      "url": "https://apnews.com/947f7d090322b7f9099c652f2be9a6ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5042e37b2444184bf77cc7cfe999b9d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}