{
  "articles": [
    {
      "author": "TOM KRISHER, COREY WILLIAMS and MIKE HOUSEHOLDER",
      "description": "DETROIT (AP) — About 13,000 U.S. auto workers stopped making vehicles and went on strike Friday after their leaders couldn’t bridge a giant gap between union demands in contract talks and what Detroit’s three automakers are willing to pay.",
      "publishedAt": "2023-09-15T04:05:36Z",
      "title": "About 13,000 workers go on strike seeking better wages and benefits from Detroit’s three automakers",
      "url": "https://apnews.com/7ce3ca9d94b911250d07556b7af376c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b873033a4e947fcb2a2aa29b6d6c57e/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and EMMA BURROWS",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un arrived Friday in Komsomolsk-on-Amur in far eastern Russia and is expected to visit a plant that builds fighter jets as South Korea has said it’s concerned his visit is focused on expanding military cooperation in a possible arms-for-technology deal.",
      "publishedAt": "2023-09-14T07:30:09Z",
      "title": "Kim Jong Un arrives in Russian city of Komsomolsk-on-Amur for expected visit to fighter jet plant",
      "url": "https://apnews.com/20aedd047c7112eeff2b8c77c7aa5e55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ef8c0c26f3c4a3b954a64ae81f853b9/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES, LISA MASCARO and MATTHEW LEE",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy is expected at the White House and on Capitol Hill next week as he visits the U.S. during the United Nations General Assembly.",
      "publishedAt": "2023-09-14T21:59:28Z",
      "title": "Zelenskyy is expected to visit Washington as Congress is debating $24 billion in aid for Ukraine",
      "url": "https://apnews.com/8690dc44d00aa297c75cf514aeb5c63b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2812b7bd184a4453b84bddf664000e42/3000.jpeg"
    },
    {
      "author": null,
      "description": "DERNA, Libya (AP) — The death toll in Libya's coastal city of Derna has soared to 11,300 as search efforts continue following a massive flood fed by the breaching of two dams in heavy rains, the Libyan Red Crescent said Thursday.",
      "publishedAt": "2023-09-14T08:07:24Z",
      "title": "Flooding death toll soars to 11,300 in Libya's coastal city of Derna, aid group says",
      "url": "https://apnews.com/21b1a195d261a642e12dac13f0d19431",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ce2eaefb7ba4ad6bc7faf142e5e3c71/1920.jpeg"
    },
    {
      "author": "DAVID SHARP and PATRICK WHITTLE",
      "description": "PORTLAND, Maine (AP) — After a deluge of rain, flooding, sinkholes and tornadoes this week, New England is about to face Hurricane Lee.",
      "publishedAt": "2023-09-15T04:04:56Z",
      "title": "Hurricane Lee to strike weather-worn New England after heavy rain, flooding and tornadoes",
      "url": "https://apnews.com/870a13cf6f43a09086b1219cbabd3257",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dae51e167ad64cf4a98d9353bb85576a/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden was indicted Thursday on federal firearms charges, the latest step in a long-running investigation into the president's son that puts the case on track toward a possible high-stakes trial as the 2024 election looms.",
      "publishedAt": "2023-09-14T17:36:21Z",
      "title": "Hunter Biden is indicted on federal firearm-purchasing charges after plea deal fails",
      "url": "https://apnews.com/e5c8ded90ea8c22d2e2e7cb09804b747",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4306b7c97b084d409fea6448d4a1240f/2160.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The Republicans whose elections in swing districts next year will determine which party gains control of the House are overwhelmingly voicing their support for House Speaker Kevin McCarthy's impeachment inquiry into President Joe Biden.",
      "publishedAt": "2023-09-15T04:24:29Z",
      "title": "The Republicans most at risk in next year's election are falling in line behind impeachment inquiry",
      "url": "https://apnews.com/c38365ac6bbcdaca983995baded91121",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/048a8cfb164d48f8afc72aa345e6f0ad/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — President Joe Biden is trumpeting Medicare's new powers to negotiate directly with drugmakers on the cost of prescription medications — but a new poll shows that any immediate political boost that Biden gets for enacting the overwhelmingly popular policy may be limited.",
      "publishedAt": "2023-09-15T04:03:08Z",
      "title": "Americans overwhelmingly support Medicare drug negotiations, but Biden sees little political boost",
      "url": "https://apnews.com/b82928109ae8564e750a6a196c98cfe9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd9ba065b18f4672bf2d6bbf92bc6a26/3000.jpeg"
    },
    {
      "author": "MARTHA MENDOZA, CLAIRE GALOFARO and JULIET LINDERMAN",
      "description": "The U.S. government has warned a Virginia judge that allowing an American Marine to keep an Afghan war orphan risks violating international law and could be viewed around the world as “endorsing an act of international child abduction,” according to secret court records reviewed by The Associated Press.",
      "publishedAt": "2023-09-15T04:18:57Z",
      "title": "Secret records: Government says Marine's adoption of Afghan orphan seen as abduction, must be undone",
      "url": "https://apnews.com/8a0411f16067d73ad0d86b706f5ae46d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8da175cf346149dcbbce0adca99d061a/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD and SHELBY LUM",
      "description": "NEW YORK (AP) — Dozens of doctors and nurses silently lined the hospital hallway in tribute: For a history-making two months, a pig’s kidney worked normally inside the brain-dead man on the gurney rolling past them.",
      "publishedAt": "2023-09-14T14:28:51Z",
      "title": "Pig kidney works a record 2 months in donated body, raising hope for animal-human transplants",
      "url": "https://apnews.com/83dfb5e6d022ca72039a821cc6bc00ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fdf11a0055c4cc389404851fc21d8cf/1571.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}