{
  "articles": [
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — A pregnant Texas woman who sought court permission for an abortion in an unprecedented challenge to one of the most restrictive bans in the U.S. has left the state to obtain the procedure, her attorneys said Monday.",
      "publishedAt": "2023-12-11T19:11:06Z",
      "title": "Texas woman who sought court permission for abortion leaves state for the procedure, attorneys say",
      "url": "https://apnews.com/7d865cdfd75bdc6b2f4186f4d1e6e8bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15aae579f6c6405782a8744377bb901d/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, WAFAA SHURAFA and JACK JEFFERY",
      "description": "TEL AVIV, Israel (AP) — Israel’s defense minister on Monday pushed back against international calls to wrap up the country’s military offensive in the Gaza Strip, saying the current phase of the operation against the Hamas militant group will “take time.”",
      "publishedAt": "2023-12-11T08:04:02Z",
      "title": "Israeli defense chief resists pressure to halt Gaza offensive, says campaign will 'take time'",
      "url": "https://apnews.com/2beb52343a9b25050d8df801ad977bbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/441d81d1a51f4b5c86da2fde0cb1df23/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and QASSIM ABDUL-ZAHRA",
      "description": "BAGHDAD (AP) — Dozens of attacks on U.S. military facilities by Iran-backed factions in Iraq over the past two months as the Israel-Hamas war has raged have forced Baghdad into a balancing act that's becoming more difficult by the day.",
      "publishedAt": "2023-12-11T12:17:13Z",
      "title": "Iraq scrambles to contain fighting between US troops and Iran-backed groups, fearing Gaza spillover",
      "url": "https://apnews.com/0b99659922bf1174f86e390808e5bfde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2abaedf15a174c3daa8e1367bd10b626/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith on Monday asked the Supreme Court to take up and rule quickly on whether former President Donald Trump can be prosecuted on charges he plotted to overturn the 2020 election results.",
      "publishedAt": "2023-12-11T17:45:54Z",
      "title": "Special counsel Jack Smith asks Supreme Court to rule quickly on whether Trump can be prosecuted",
      "url": "https://apnews.com/f3e7206bdf169c9faa15a19084541824",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb14ef4cfa664cb28ab34826941231eb/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A combination of heavy rain, snow, and wind brought threats of flooding and power outages to the Northeast on Monday, part of the same storm system that killed six people in Tennessee, where tornadoes toppled houses and tens of thousands of people lost power in the wintry weather.",
      "publishedAt": "2023-12-11T15:07:01Z",
      "title": "Snowfall, rain, gusty winds hit Northeast as Tennessee recovers from deadly tornadoes",
      "url": "https://apnews.com/e66162f60b5e8b22f59ec95ca1b511a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef267c2116b2447cbfde877768f7768f/3000.jpeg"
    },
    {
      "author": "TARA COPP and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy kicked off a quick visit to Washington on Monday, warning in a speech to a defense university that Russia may be fighting in Ukraine but its “real target is freedom” in America and around the world.",
      "publishedAt": "2023-12-11T15:38:30Z",
      "title": "Zelenskyy issues plea for support during Washington visit as Ukraine funding stalls in Congress",
      "url": "https://apnews.com/8663f4d1e1b8b05828fde1c0be05686d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a303090f14434e95b8a40bcab3ffd9df/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — A jury was sworn in Monday in the federal case that will determine how much Rudy Giuliani might have to pay two Georgia election workers he falsely accused of fraud while pushing Donald Trump's baseless claims after the 2020 election.",
      "publishedAt": "2023-12-11T05:03:30Z",
      "title": "A jury is seated in the election workers' defamation damages trial against Rudy Giuliani",
      "url": "https://apnews.com/19fbeae3f5231654b4625787a78419e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/062fcee8deb843ae8cd2b82911cfffd7/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "At a small rural Missouri high school, two English teachers shared a secret: Both were posting adult content on OnlyFans, the subscription-based website known for sexually explicit content.The site and others like it provide an opportunity for those willing to dabble in pornography to earn extra money — sometimes lots of it.",
      "publishedAt": "2023-12-11T05:14:33Z",
      "title": "Teachers have been outed for moonlighting in adult content. Do they have legal recourse?",
      "url": "https://apnews.com/51967bfa6387f934dfc5561c6aea802d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7ce483a7e5641cf863fc7fb4df04eaf/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL, JAMEY KEATEN, SIBI ARASU and SETH BORENSTEIN",
      "description": "DUBAI, United Arab Emirates (AP) — Countries moved closer to reaching what critics called a watered-down final deal on how to act on climate change on Monday, to the disappointment and anger of nations who called to phase out planet-warming fossil fuels as the United Nations summit in Dubai neared its culmination.",
      "publishedAt": "2023-12-11T05:27:18Z",
      "title": "Critics pan draft text at UN climate talks as watered down as COP28 nears its finale in Dubai",
      "url": "https://apnews.com/47dfd6dbf32d987e885acd6dbffc7954",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f481544f3b843349c0ce2d29df53f66/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "SUMY, Ukraine (AP) — Whenever 52-year-old Anna is agitated, she senses the chilling touch of a gun barrel between her brows — a haunting reminder of an encounter with a group of Russian soldiers on her street about a year ago.",
      "publishedAt": "2023-12-11T05:02:07Z",
      "title": "Life in Russian-controlled areas of Ukraine is grim. People are fleeing through a dangerous corridor",
      "url": "https://apnews.com/57549469b780f53ef226c909d25a08d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c638f5162f314ca697a0a3367574efea/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}