{
  "articles": [
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United Nations Security Council is set to vote on a United States-sponsored resolution declaring that “an immediate and sustained cease-fire” in the Israel-Hamas war in Gaza is “imperative” to protect civilians and enable humanitarian aid to be delivered to more than 2 million hungry Palestinians.",
      "publishedAt": "2024-03-22T04:54:48Z",
      "title": "The UN will vote on a US resolution declaring that an immediate cease-fire in Gaza is imperative",
      "url": "https://apnews.com/f6453803b3eacc9fbaa2ce5a025e2a94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/038b921e5f2e48e8b8cfbbc5e35a8293/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "U.S. Secretary of State Antony Blinken met with Israeli leaders in Tel Aviv on Friday on the final stop in his sixth urgent trip to the region since the start of the war.",
      "publishedAt": "2024-03-22T07:57:50Z",
      "title": "The Latest | Blinken meets Israeli leaders as UN prepares to vote on a cease-fire resolution",
      "url": "https://apnews.com/046f37a193465ae9ec9bc59e2125d7eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c80ffafcc0594fbc9850cf797ad85ed0/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and JIM HEINTZ",
      "description": "KYIV, Ukraine (AP) — Russia attacked electrical power facilities in much of Ukraine, including the country's largest hydroelectric plant, causing widespread outages and killing at least three people, officials said Friday.",
      "publishedAt": "2024-03-22T08:11:57Z",
      "title": "Russia attacks Ukrainian electrical power facilities, including major hydroelectric plant",
      "url": "https://apnews.com/90218fcbed4fbf196aa8148a4aae6239",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c738e41864224df2b0a41df9879418d5/1600.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Lawmakers introduced a $1.2 trillion spending package Thursday that sets the stage for avoiding a partial government shutdown for several key federal agencies this weekend and allows Congress, nearly six months into the budget year, to complete its work funding the government through September.",
      "publishedAt": "2024-03-21T14:10:33Z",
      "title": "Congress unveils $1.2 trillion plan to avert federal shutdown and bring budget fight to a close",
      "url": "https://apnews.com/3b4e61cf5eaaf0f7fbeeddbacdf57212",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04c6b20b275c46e38dc0531d3378ded7/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Donald Trump's return to the stock market could be right around the corner.All eyes are on a vote scheduled for Friday by shareholders of Digital World Acquisition Corp., a publicly traded shell company that is looking to merge with the former president's media business.",
      "publishedAt": "2024-03-22T04:01:23Z",
      "title": "Is Donald Trump's Truth Social headed to Wall Street? It comes down to a Friday vote",
      "url": "https://apnews.com/841820869418c37ad7eed04f2af42854",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b815da18305c4c83904f8ecebacd7550/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON and MARK THIESSEN",
      "description": "Police on Thursday arrested two white supremacist gang members — an Idaho prison inmate and the accomplice who helped him escape — following an attack on corrections officers at a Boise hospital, and investigators are looking into whether they killed two people while on the run.",
      "publishedAt": "2024-03-21T05:03:40Z",
      "title": "Police track down escaped Idaho prison gang member and accomplice, say pair may have killed 2 on run",
      "url": "https://apnews.com/5d4eb764853ca05d2721145bc435367a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8bfe217ac5f4a1ca4811aa8ffe44599/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK and MICHAEL BIESECKER",
      "description": "DAKAR, Senegal (AP) — Women slain with babies wrapped against their bodies, lifeless children intertwined together, a 2-month-old face-up on the ground with puppies crawling on his tiny frame. The scenes were horrifying, but the 32-year-old farmer felt he had to document them, as proof of the carnage in his central Burkina Faso village.",
      "publishedAt": "2024-03-22T04:31:52Z",
      "title": "Burkina Faso's security forces are killing more civilians. Survivors detailed 1 village's massacre",
      "url": "https://apnews.com/e775658011de4c0b4352f53326f16da3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e196aa17c2a491180fa1685894f0531/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — The movie trailer begins with an outline of the iconic glasses worn by Mohandas Gandhi, the leader who helped India win independence from the British colonialists in 1947.",
      "publishedAt": "2024-03-22T05:02:24Z",
      "title": "As India's election nears, some Bollywood films promote Modi politics by embracing Hindu nationalism",
      "url": "https://apnews.com/2aea78fec4324d805d74ddc2bff9f633",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/175d4209a41e4a8ca3180b706438c237/3000.jpeg"
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — The sun is setting on Stumpy, the gnarled old cherry tree that has become a social media phenom. This year's cherry blossom festivities in Washington will be the last for Stumpy and more than 100 other cherry trees that will be cut down as part of a multiyear restoration of their Tidal Basin home.",
      "publishedAt": "2024-03-22T04:02:32Z",
      "title": "More than 100 iconic cherry trees in Washington are being cut down. So long, Stumpy",
      "url": "https://apnews.com/3de67f20140dafd20dfefcee6e20ba92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55f2e5ece1ae42ba9a339b8fe71dbf54/1920.jpeg"
    },
    {
      "author": "MARK ANDERSON",
      "description": "LAS VEGAS (AP) — Kentucky's 80-76 loss to Oakland on Thursday night didn't just end a bunch of perfect brackets.",
      "publishedAt": "2024-03-21T17:51:37Z",
      "title": "Kentucky's loss to unheralded Oakland crushes millions of March Madness brackets",
      "url": "https://apnews.com/2d8677e3eee10c0724f730a048dcbf8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5899ac09d37a4cbb88f337eab04ded0d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}