{
  "articles": [
    {
      "author": "TERRY SPENCER and HAVEN DALEY",
      "description": "TAMPA, Fla. (AP) — Hurricane Milton churned Wednesday toward a potentially catastrophic collision along the west coast of Florida, where some residents insisted they would stay after millions were ordered to evacuate and officials warned that stragglers would face grim odds of surviving.",
      "publishedAt": "2024-10-09T04:10:30Z",
      "title": "Time to evacuate is running out as Hurricane Milton closes in on Florida",
      "url": "https://apnews.com/08bde4b9c29460f471d43c6512821c93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff302b91b5c3443ba0845c249b86f2ce/3000.jpeg"
    },
    {
      "author": "DEVNA BOSE and DEVI SHASTRI",
      "description": "Hospitals and other health care facilities on Florida’s Gulf Coast — still reeling from Hurricane Helene — are now revving up for Hurricane Milton.The system, which is shaping up to be one of the most powerful to hit the region in years, is projected to make landfall a bit south of the Tampa area late Wednesday.",
      "publishedAt": "2024-10-08T22:26:34Z",
      "title": "Florida hospitals and health care facilities in Hurricane Milton's path prepare for the worst",
      "url": "https://apnews.com/c4146bee8f78a4769ba5829b4538f10e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af43c508045a41fb8b5f732fb64f7c18/3000.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN",
      "description": "Human-caused climate change boosted a devastating Hurricane Helene 's rainfall by about 10% and intensified its winds by about 11%, scientists said in a new flash study released just as a strengthening Hurricane Milton threatens the Florida coast less than two weeks later.",
      "publishedAt": "2024-10-09T04:03:35Z",
      "title": "Climate change boosted Helene's deadly rain and wind and scientists say same is likely for Milton",
      "url": "https://apnews.com/8a0d4f072669fd1d0031a23d7fc4b29c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebe1eff13ddd40488f0d66761955c0e3/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Hezbollah fired another barrage of rockets into Israel on Tuesday, and the militant group’s acting leader vowed to keep up pressure that has forced tens of thousands of Israelis from their homes near the Lebanese border.",
      "publishedAt": "2024-10-08T09:15:08Z",
      "title": "Hezbollah steps up rocket fire as Israel sends more troops into Lebanon",
      "url": "https://apnews.com/0bc0a8970c066c048ee1875bcdc8df79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80c25af8328140ec84ea9894b1ee3b39/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "WAUKEGAN, Ill. (AP) — On a table at the office of the Waukegan Township Democrats sits a box of postcards with Wisconsin addresses that were collected during a postcard-writing pizza party to help turn out voters there.",
      "publishedAt": "2024-10-09T04:07:36Z",
      "title": "What presidential campaign? The Electoral College puts most American voters on the sidelines",
      "url": "https://apnews.com/cdb4141205034c830924cb94457b7be1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4a7c065eb44425a83d2994cd4f7b523/1920.jpeg"
    },
    {
      "author": "RICHARD LARDNER and DAKE KANG",
      "description": "WASHINGTON (AP) — Thousands of copies of Donald Trump’s “God Bless the USA” Bible were printed in a country that the former president has repeatedly accused of stealing American jobs and engaging in unfair trade practices — China.",
      "publishedAt": "2024-10-09T04:02:39Z",
      "title": "Trump has long blasted China's trade practices. His 'God Bless the USA' Bibles were printed there",
      "url": "https://apnews.com/32a80611605d4052d8238064bbcace4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c512c23b1e724a2f916b2d15fbbd1445/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "WASHINGTON (AP) — Months into Russia's war in Ukraine, the United States had intelligence pointing to “highly sensitive, credible conversations inside the Kremlin” that President Vladimir Putin was seriously considering using nuclear weapons to avoid major battlefield losses, journalist Bob Woodward reported in his new book, “War.”",
      "publishedAt": "2024-10-08T20:30:11Z",
      "title": "US scrambled to urge Putin not to use nuclear weapons in Ukraine, Woodward book says",
      "url": "https://apnews.com/90cb3bb3499a5e211095b3f93173a575",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c48feea8cacb4ba3a2372a843e62809e/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The rumors surrounding Hurricane Helene are many. There are false claims that people taking federal relief money could see their land seized.",
      "publishedAt": "2024-10-08T23:18:52Z",
      "title": "As FEMA prepares for Hurricane Milton, it battles rumors surrounding Helene recovery",
      "url": "https://apnews.com/468b036784b1db05937e9a34d0146041",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb952fd3e6994ea4a0c31335ce974205/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Karolina Long Tain González Rodríguez plops another corn cake into the piping hot oil of a large pan. As she grabs a set of tongs to flip them one by one, she yells across the kitchen realizing she’s pressed for time.",
      "publishedAt": "2024-10-09T04:04:44Z",
      "title": "A kitchen staffed by trans women is a refuge for Mexico City’s LGBTQ+ community",
      "url": "https://apnews.com/3f5aecc86dd8e5843374d2abe8f73dbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fa336940205490a863e3e28cf93a73c/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "ANCHORAGE, Alaska (AP) — In a storyline better befitting a melodrama than a popularity vote, Grazer won her second Fat Bear Contest Tuesday by defeating the male behemoth that killed her cub this summer.",
      "publishedAt": "2024-10-09T01:14:35Z",
      "title": "Grazer beats the behemoth that killed her cub to win Alaska's Fat Bear Contest",
      "url": "https://apnews.com/2887949cd304cca96a3d8acbeb61095e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ac7f869367547448754cc7be6045c74/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}