{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — Caitlin Clark selected with the No. 1 pick in the WNBA draft by the Indiana Fever after record-setting college career.",
      "publishedAt": "2024-04-15T23:41:34Z",
      "title": "Caitlin Clark selected with the No. 1 pick in the WNBA draft by the Indiana Fever after record-setting college career",
      "url": "https://apnews.com/ececd55471fdaddffa835db8b1690e7f",
      "urlToImage": ""
    },
    {
      "author": "JENNIFER PELTZ, MICHAEL R. SISAK, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The historic hush money trial of Donald Trump got underway Monday with the arduous process of selecting a jury to hear the case charging the former president with falsifying business records in order to stifle stories about his sex life.",
      "publishedAt": "2024-04-15T04:04:39Z",
      "title": "Trump's historic hush money trial gets underway; 1st day ends without any jurors being picked",
      "url": "https://apnews.com/8da8759352478be8effd3d5734aae35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/764b90d68c6c4c3ba41425b860e9eb2e/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's direct attack on Israel over the weekend upended decades of its shadowy warfare by proxy, something Tehran has used to manage international repercussions for its actions.",
      "publishedAt": "2024-04-15T12:54:00Z",
      "title": "Analysis: Iran upends decades of shadow warfare in direct attack on Israel as tensions mount at home",
      "url": "https://apnews.com/95a0861c8b51cda375d31a806686c23a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1d6034ee7e046218fed476278442397/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military renewed warnings on Monday for Palestinians not to return to northern Gaza, a day after witnesses and medical officials said Israeli troops opened fire and killed five people among throngs of displaced residents trying to walk back to their homes in the devastated area.",
      "publishedAt": "2024-04-15T10:20:35Z",
      "title": "Israeli military tells Palestinians not to return to north Gaza after witnesses say troops killed 5",
      "url": "https://apnews.com/5d6b5dc1483771045113eea2c1904449",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86994a2d3f3146d2b4b1fe09036740d9/1920.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "CHICAGO (AP) — Pro-Palestinian demonstrators blocked roadways in Illinois, California, New York and the Pacific Northwest on Monday, temporarily shutting down travel into some of the nation's most heavily used airports, onto the Golden Gate and Brooklyn bridges and on a busy West Coast highway.",
      "publishedAt": "2024-04-15T16:40:13Z",
      "title": "Pro-Palestinian demonstrators shut down airport highways and key bridges in major U.S. cities",
      "url": "https://apnews.com/30da0602309a1645a5c59e10bce83b9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e929d26d6b19480194e17d4489a3aabf/1920.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — The Supreme Court is allowing Idaho to enforce its ban on gender-affirming care for transgender youth while lawsuits over the law proceed, reversing lower courts.",
      "publishedAt": "2024-04-15T21:14:35Z",
      "title": "Supreme Court allows Idaho to enforce its ban on gender-affirming care for transgender youth",
      "url": "https://apnews.com/f858bcce9a624ec79edc496414f2130f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e45eeace5d4f43c888f03e4d28bd41e7/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "NEW YORK (AP) — Caitlin Clark was selected with the No. 1 pick in the WNBA draft by the Indiana Fever on Monday night.The former Iowa star became a household name among basketball fans during her record-breaking college career, and she will now try and help revive the Indiana franchise along with last season's No.",
      "publishedAt": "2024-04-15T17:10:46Z",
      "title": "Caitlin Clark taken No. 1 in the WNBA draft by the Indiana Fever, as expected",
      "url": "https://apnews.com/6aa5dddaedbe7da5a2b147da6d39e832",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/355497134fbf408aa13b26f664e7e361/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — A movie weapons supervisor was sentenced to 18 months in prison in the fatal shooting of a cinematographer by Alec Baldwin on the set of the Western film “Rust,” during a hearing Monday in which tearful family members and friends gave testimonials that included calls for justice and a punishment that would instill greater accountability for safety on film sets.",
      "publishedAt": "2024-04-15T04:12:10Z",
      "title": "Gun supervisor for ‘Rust’ movie gets 18 months in prison for fatal shooting by Alec Baldwin on set",
      "url": "https://apnews.com/627373b6fd8aabe1f25050943777daba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b043675d19b74062a281e6e35da3f84c/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson on Monday unveiled a complicated proposal for passing wartime aid for Israel, Ukraine and Taiwan, leaving its path to passage deeply uncertain as he rejected pressure to simply approve a package sent over by the Senate.",
      "publishedAt": "2024-04-15T20:54:26Z",
      "title": "House Speaker Mike Johnson is taking complicated approach to passing aid for Ukraine and Israel",
      "url": "https://apnews.com/42a2f281a5437beaa8af4c3345987637",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15f75452699941f8963db41b44ab37f8/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, LEA SKENE and SARAH BRUMFIELD",
      "description": "BALTIMORE (AP) — Hours before leaving port, the massive container ship that caused the deadly collapse of a Baltimore bridge experienced apparent electrical problems, a person with knowledge of the situation told The Associated Press on Monday, the same day FBI agents boarded the vessel amid a criminal investigation into the circumstances leading up to the catastrophe.",
      "publishedAt": "2024-04-15T12:05:44Z",
      "title": "Ship that caused bridge collapse had apparent electrical issues while still docked, AP source says",
      "url": "https://apnews.com/58188d524035c756872603055f309c78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9a497a299444601ba83515bec1d32c2/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}