{
  "articles": [
    {
      "author": "Nicole Winfield, Colleen Barry",
      "description": "Cardinals are meeting at the Vatican to make the first decisions about running the Catholic Church following the death of Pope Francis. They need to decide when Francis' body will be moved into St. Peter’s Basilica for public viewing, when the funeral and burial will take place, and when the conclave will begin to elect his successor. The Congregation of Cardinals, the Tuesday gathering of the cardinals currently in Rome, could choose to begin the public viewing as soon as Wednesday. Under norms approved by Francis last year, the funeral and burial must occur between Friday and Sunday.",
      "publishedAt": "2025-04-22T05:56:55Z",
      "title": "Cardinals meet Tuesday at Vatican to choose date for Pope Francis' funeral",
      "url": "https://apnews.com/article/pope-francis-death-funeral-conclave-e9688b14b9d9e19bbdd6a868d57a4699",
      "urlToImage": "https://dims.apnews.com/dims4/default/600f41d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F08%2F53e7de4bea571c4022bfcba5b7a6%2F61096b564416415cb9e008e78a91906f"
    },
    {
      "author": "Nicole Winfield",
      "description": "Every pope has his critics. But Pope Francis’ conservative opponents were unique in that they actually had a living alternate as a point of reference. Pope Benedict XVI lived as a pope emeritus in the Vatican Gardens for the first decade of Francis’ pontificate. The unprecedented anomaly of having a reigning and retired pope living together made the dynamics of the Francis opposition a first in Catholic history. It exacerbated longstanding divisions in the church that experts say must be addressed before any other pope decides to step down. They say norms are needed to regulate a papal resignation to prevent a retired pontiff from remaining a source of inspiration for those seeking to discredit his successor.",
      "publishedAt": "2025-04-22T04:09:13Z",
      "title": "Pope Francis' critics: A unique situation for conservative opponents",
      "url": "https://apnews.com/article/pope-francis-critics-fef5eb221e1a44a15fa7bb9aa83b9d73",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ee8a57/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F4e%2F9b24eef4d4dc91677d83f6c8da00%2F155c70f824b64a23a7002b51d6ce5155"
    },
    {
      "author": "Qassim Abdul-zahra, Stella Martany",
      "description": "The death of Pope Francis has sent shockwaves through Iraq’s Christian community, where his presence once brought hope after one of the darkest chapters in the country’s recent history. His 2021 visit to Iraq, the first ever by a pope, had offered a rare moment of unity and hope after years of conflict and displacement. Just a few years before that, many Iraqi Christians had fled their homes as Islamic State militants swept across the country. During his visit to Iraq, Francis also held a historic meeting with the country’s top Shiite cleric, Grand Ayatollah Ali al-Sistani.",
      "publishedAt": "2025-04-22T09:45:22Z",
      "title": "For Iraqi Christians, Pope Francis' visit was a rare moment of hope",
      "url": "https://apnews.com/article/pope-francis-iraq-cb378b4ae3e30cb8cc01bba8cc55e5e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3964c3/2147483647/strip/true/crop/6049x3403+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F61%2Fcf0ef536febf30257ee68882290a%2Fdb8a7d18fc87492b8edcf85446c46899"
    },
    {
      "author": "Nicole Winfield",
      "description": "An Irish-born American cardinal was entrusted by Pope Francis to be the camerlengo, the Vatican official who runs the Holy See after the death of one pontiff and before the election of another. Cardinal Kevin Farrell is now in the spotlight. According to tradition, the camerlengo certifies the pope’s death, seals the papal apartment and breaks the pope’s fisherman’s ring. He leads the procession accompanying the coffin into St. Peter’s Basilica and presides over the burial. He also gets written reports from Vatican offices about their current assets; a copy of the current and projected budget for the Holy See; and any other information from the Vatican’s economic ministry that would be useful for cardinals and the future pope.",
      "publishedAt": "2025-04-22T04:05:32Z",
      "title": "Irish-born American Cardinal Kevin Farrell entrusted to be ‘camerlengo’",
      "url": "https://apnews.com/article/pope-francis-kevin-farrell-camerlengo-d539db6e09be52a76669dc7f7ac63fd8",
      "urlToImage": "https://dims.apnews.com/dims4/default/451c967/2147483647/strip/true/crop/4897x2755+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2F96%2Fe38f32539779f1dd4d6326d3260a%2Fb483fd7fa11f471c9399688c02d50802"
    },
    {
      "author": null,
      "description": "VATICAN CITY (AP) — The Vatican releases first images of Pope Francis, showing him in his casket with the Vatican secretary of state praying over him.",
      "publishedAt": "2025-04-22T07:37:12Z",
      "title": "AP PHOTOS: First images of Pope Francis released",
      "url": "https://apnews.com/article/vatican-pope-obit-death-lying-photos-4b360e206cd485c6a565bf209d942c3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea4256c/2147483647/strip/true/crop/7087x3986+0+370/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F33%2Fdd2e7f5bef550e59142790a7bc15%2Fb4d91a82540048f6aab1b043b0622fc2"
    },
    {
      "author": null,
      "description": "The main Palestinian rescue service in Gaza has condemned Israel’s probe into the killings of 15 medical workers last month, calling it a “fabricated investigation.” The army announced the results of its investigation on Sunday, saying it had found “professional failures” and dismissing a deputy commander in what it described as an accident. A total of 15 people were killed in the March 23 incident — including eight medics with the Palestinian Red Crescent Society, six members of the Hamas government’s Civil Defense unit and a U.N. staffer. The PRCS says the investigation underscores “the occupation’s persistence in shielding the truth from the world.”",
      "publishedAt": "2025-04-21T18:18:38Z",
      "title": "Gaza rescue service dismisses Israeli probe into killing of medics as a 'fabricated investigation'",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-21-2025-17ffc7981c4fe1f87b25b54b3c17bf20",
      "urlToImage": "https://dims.apnews.com/dims4/default/52e644f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F8b%2Fecc4514813633bdb3ca476a471c0%2F56a511f6eca145ed85c2a21ff085a9c1"
    },
    {
      "author": "Jon Gambrell",
      "description": "Negotiations between Iran and the United States over Tehran’s rapidly advancing nuclear program will move Wednesday to what’s known as the “expert level” — a sign analysts say shows that the talks are moving forward rapidly. However, experts not involved in the talks who spoke with The Associated Press warn that this doesn’t necessarily signal a deal is imminent. Instead, it means that the talks between Iranian Foreign Minister Abbas Araghchi and U.S. Mideast envoy Steve Witkoff haven’t broken down at what likely is the top-level trade — Tehran limiting its atomic program in exchange for the lifting of economic sanctions.",
      "publishedAt": "2025-04-22T05:04:57Z",
      "title": "What do 'expert' talks signal for Iran-US nuclear negotiations?",
      "url": "https://apnews.com/article/iran-us-nuclear-negotiations-expert-talks-explainer-4b47bfb4074469b1832f6b5009c84b58",
      "urlToImage": "https://dims.apnews.com/dims4/default/9190b70/2147483647/strip/true/crop/3500x1969+0+79/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F65%2Fa8926521ea3924857d4082ce7978%2F9405781ae7a147a7a66c67ef509dafd4"
    },
    {
      "author": "Tara Copp, Eric Tucker",
      "description": "The White House has expressed support for Defense Secretary Pete Hegseth following media reports that he shared sensitive military details in another Signal messaging chat that included his wife and brother. President Donald Trump on Monday called it “fake news” and pointed to what he called disgruntled workers. The administration's posture is meant to hold the line against Democratic demands for Hegseth’s firing at a time when the Pentagon is engulfed in turmoil, including the departures of several senior aides. The White House has framed the revelation as the outgrowth of a power struggle between Hegseth and the career workforce. But some of the recently departed officials were brought in by Hegseth.",
      "publishedAt": "2025-04-21T15:42:29Z",
      "title": "White House voices support for Hegseth as Signal chat revelation stirs fresh turmoil",
      "url": "https://apnews.com/article/hegseth-signal-chat-pentagon-trump-30dc4c3d0e75a89f3fd883f38b26afff",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff3a706/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F4c%2F1bbc15ff58dff7135160ca9cb956%2Fd1f9a1b15d4140f385f484b9f9f796e4"
    },
    {
      "author": "Kirsten Grieshaber",
      "description": "Eighty years after the Holocaust, more than 200,000 Jewish survivors are still alive, but according to a study 70% of them will be gone within the next 10 years. Currently, the survivors’ median age is 87 and more than 1,400 of them are over 100 years old. A study released by the New York-based Conference on Jewish Material Claims Against Germany projects that within 15 years, 90% of survivors will pass away. It also shows that mortality rates for survivors vary greatly across geographic locations depending on access to health care and economic stability.",
      "publishedAt": "2025-04-22T05:35:52Z",
      "title": "70% of Jewish Holocaust survivors will be gone in the next 10 years, a report shows",
      "url": "https://apnews.com/article/germany-vanishing-holocaust-survivors-6d055d1d386567d6117ca634f233b0a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef5a895/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2Fdb%2Fc8c1c2b9c782ce971bb0a662e115%2F20a12b8e7dbe4a2ba1a1fbc944dc4107"
    },
    {
      "author": "Corey Williams",
      "description": "Arborists are hoping to transform vacant land on Detroit’s eastside by planting giant sequoias, the world’s largest trees. Detroit is the pilot city for the Giant Sequoia Filter Forest. The nonprofit Archangel Ancient Tree Archive is donating sequoia saplings that will be planted by Arboretum Detroit to mark Earth Day. Archangel also plans to plant sequoia groves in Los Angeles, Oakland, California, and London. Sequoias are resilient against disease and insects but the California natives have become vulnerable to ever-hotter wildfires on the West Coast.",
      "publishedAt": "2025-04-22T04:07:46Z",
      "title": "A sequoia forest in Detroit? Plantings to improve air quality and mark Earth Day",
      "url": "https://apnews.com/article/sequoia-forest-detroit-vacant-lots-9a8b8b12cfde25129943bb599663c26f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ca7ee5/2147483647/strip/true/crop/5673x3191+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F90%2F6d26c0ebdd8f09353d549ec8d2b4%2F7f3f317ac0e543dc9f82763933334f63"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}