{
  "articles": [
    {
      "author": "JULIO CORTEZ, KATE PAYNE and HAVEN DALEY",
      "description": "ST. PETERSBURG, Fla. (AP) — Florida residents repaired damage from Hurricane Milton and tried to figure out what to do next Friday after the storm smashed through coastal communities and tore homes to pieces, flooded streets and spawned a barrage of deadly tornadoes.",
      "publishedAt": "2024-10-11T04:03:43Z",
      "title": "Residents clean up and figure out what's next after Hurricane Milton",
      "url": "https://apnews.com/7f60bbe9c6295f2ebef077eca2c1b4e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59e63f6f91234c5aa44c912701fa6a2c/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — A pair of unwelcome and destructive guests named Helene and Milton have stormed their way into this year's presidential election.",
      "publishedAt": "2024-10-11T04:05:44Z",
      "title": "Back-to-back hurricanes reshape 2024 campaign’s final stretch",
      "url": "https://apnews.com/f1bf69434656bd693daf316db3842fac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9969f43f78545fe997a81405c14db63/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Rescue workers searched through the rubble of a collapsed building in central Beirut on Friday morning, hours after two Israeli strikes hit the Lebanese capital, killing at least 22 people and wounding dozens.",
      "publishedAt": "2024-10-11T10:39:43Z",
      "title": "Israel's deadliest strike in central Beirut leaves Lebanese stunned as they dig through the rubble",
      "url": "https://apnews.com/9dd58a9fea9c2de963edbc31ba90bb1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/654be871e9aa4cdebaafa6188625fe5f/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — As the war between Israel and Hezbollah intensifies, Lebanese civilians are increasingly paying the price – and this dangerous reality often becomes clear in the middle of the night: That’s when the Israeli military typically warns people to evacuate buildings or neighborhoods to avoid airstrikes.",
      "publishedAt": "2024-10-11T05:04:38Z",
      "title": "Israel's airstrike warnings terrify and confuse Lebanese civilians",
      "url": "https://apnews.com/d131e6f7043623bc109eab768decc2a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afda205761d54290b9f620e53784b969/3000.jpeg"
    },
    {
      "author": "MIKE CORDER and ELENA BECATOROS",
      "description": "The Nobel Peace Prize was awarded Friday to Nihon Hidankyo, a Japanese organization of survivors of the U.S. atomic bombings of Hiroshima and Nagasaki, for its activism against nuclear weapons.",
      "publishedAt": "2024-10-11T08:31:45Z",
      "title": "Nobel Peace Prize awarded to Japanese organization of atomic bombing survivors Nihon Hidankyo",
      "url": "https://apnews.com/40c351ed629bd515675a8283c811bc38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03c36d1ba0494020bb108baa5a895272/1920.jpeg"
    },
    {
      "author": "ABDUL SATTAR",
      "description": "QUETTA, Pakistan (AP) — Gunmen killed 20 miners and wounded seven others in Pakistan’s southwest, a police official said Friday, drawing condemnation from authorities as a search was launched for the assailants.",
      "publishedAt": "2024-10-11T02:48:09Z",
      "title": "Gunmen kill 20 miners in an attack in southwest Pakistan ahead of an Asian security summit",
      "url": "https://apnews.com/b4302a6af4888c009212bea622f76679",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eca3dfb9d248419da4246199a19553d1/3000.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — A solid majority of Hispanic women have a positive opinion of Vice President Kamala Harris and a negative view of former President Donald Trump, but Hispanic men are more divided on both candidates, according to a recent poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-10-11T04:04:04Z",
      "title": "Harris viewed more positively by Hispanic women than by Hispanic men: AP-NORC poll",
      "url": "https://apnews.com/d42696a973e0988aed41bab2a46bb4cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8cd0e93ffdd49829c60c0a35bf90eea/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Two U.S. Navy SEALs drowned as they tried to climb aboard a ship carrying illicit Iranian-made weapons to Yemen because of glaring training failures and a lack of understanding about what to do after falling into deep, turbulent waters, according to a military investigation into the January deaths.",
      "publishedAt": "2024-10-11T04:04:54Z",
      "title": "The drownings of 2 Navy SEALs were preventable, military investigation finds",
      "url": "https://apnews.com/78e138486050c9748fc3724347ed230f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c84dcf9836646f1adb429f93fb32054/1236.jpeg"
    },
    {
      "author": "JESSE BEDAYN and MATTHEW BROWN",
      "description": "DENVER (AP) — One person was killed and 12 people were rescued after being trapped for about six hours at the bottom of a former Colorado gold mine when an elevator malfunctioned at the tourist site, authorities said.",
      "publishedAt": "2024-10-10T21:58:39Z",
      "title": "1 person dies and 12 are rescued after elevator malfunctions at Colorado gold mine tourist site",
      "url": "https://apnews.com/292aa17eb8ebdfc4baa16c4a4b4a0b62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86e16c641a0a4abbb09ed197a3c85131/1920.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — Phones hold so much of our digital lives — emails, social media and bank accounts, photos, chat messages and more — that if they ever get stolen or go missing, it can cause major disruption beyond just the loss of a device.",
      "publishedAt": "2024-10-11T07:30:18Z",
      "title": "One Tech Tip: Here's what you need to do before and after your phone is stolen or lost",
      "url": "https://apnews.com/c4d0ab7ee40fca01bc46d7db03d590dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5389aaac1dde4840a9a9f47e8a2062e2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}