{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAM METZ",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes hit a school being used by displaced people in central Gaza on Saturday, killing dozens of people, as the country’s negotiators prepared to meet international mediators to discuss a proposed cease-fire.",
      "publishedAt": "2024-07-27T07:11:58Z",
      "title": "An Israeli airstrike hits a school sheltering people in Gaza, killing at least 30",
      "url": "https://apnews.com/c95e8effebd9d4e4ba7e69bfbae61e04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/936699b510d64f5182f3ba39e306fe76/1920.jpeg"
    },
    {
      "author": "REBECCA BOONE and JOHN ANTCZAK",
      "description": "California's largest active fire exploded in size on Friday evening, growing rapidly amid bone-dry fuel and threatening thousands of homes as firefighters scrambled to meet the danger.The Park Fire's intensity and dramatic spread led fire officials to make unwelcome comparisons to the monstrous Camp Fire, which burned out of control in nearby Paradise in 2018, killing 85 people and torching 11,000 homes.",
      "publishedAt": "2024-07-27T04:17:00Z",
      "title": "California's largest wildfire explodes in size as fires rage across US West",
      "url": "https://apnews.com/4ff0e51837119a32cc805efc46967c94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7514e27d6f28460ebad7b8a081f965c6/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, JILL COLVIN, BERNARD CONDON and JIM MUSTIAN",
      "description": "WASHINGTON (AP) — Nearly two weeks after Donald Trump’s near assassination, the FBI confirmed Friday that it was indeed a bullet that struck the former president’s ear, moving to clear up conflicting accounts about what caused the former president’s injuries after a gunman opened fire at a Pennsylvania rally.",
      "publishedAt": "2024-07-26T23:00:43Z",
      "title": "FBI says Trump was indeed struck by bullet during assassination attempt",
      "url": "https://apnews.com/cb780b9d1a078f0be4191682e75101cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c1a260aeea9487ea4cdb052a27b2479/1920.jpeg"
    },
    {
      "author": "JOHN LEICESTER and MEGAN JANETSKY",
      "description": "PARIS (AP) — A hot-air balloon brought an Olympic ring of fire into a rainy sky and singer Celine Dion belted from the Eiffel Tower as Paris kicked off its first Summer Olympics in a century Friday, with a four-hour-long, rule-breaking opening ceremony that unfurled along the Seine River.",
      "publishedAt": "2024-07-26T10:23:50Z",
      "title": "Paris dazzles with a rainy Olympics opening ceremony on the Seine River",
      "url": "https://apnews.com/9ed330cb83d89d68092ac5858c0fe590",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3090648deafb420fb0485faecf3752fe/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — France's interior minister praised security forces after no major issues were reported Friday during the opening ceremony of the Olympics.",
      "publishedAt": "2024-07-26T17:31:03Z",
      "title": "Olympics opening ceremony saw no major reported issues, French official says",
      "url": "https://apnews.com/86c1f55df2a55f2fc2112684f67d9e20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/912d50feecbf4755a402caf833cd115c/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — “ Brats for Harris.” “ We need a Kamalanomenon. ” “ Gen Z feels the Kamalove.”",
      "publishedAt": "2024-07-27T04:10:27Z",
      "title": "'Gen Z feels the Kamalove': Youth-led progressive groups hope Harris will energize young voters",
      "url": "https://apnews.com/161caa432cf440a029e998409940b4a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f0f764dcd7047458d748b1fad32477a/3000.jpeg"
    },
    {
      "author": "AARON M. KESSLER and RICHARD LARDNER",
      "description": "WASHINGTON (AP) — As former President Donald Trump faces a supercharged Democratic fundraising effort, a persistent drag on his campaign’s coffers may be easing: legal expenses.",
      "publishedAt": "2024-07-27T04:03:59Z",
      "title": "With trials pushed back, Trump sees first big dip in legal bills",
      "url": "https://apnews.com/1ba0261aeab402327120e5250a081b75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/627e254fdcc54d28a7ab6ee3009989e0/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA and ALANNA DURKIN RICHER",
      "description": "MEXICO CITY (AP) — A new era is coming for Mexico’s powerful Sinaloa cartel in the wake of the capture by U.S. authorities of Ismael “El Mayo” Zambada, the last of the grand old Mexican drug traffickers.",
      "publishedAt": "2024-07-27T05:29:15Z",
      "title": "Mexican kingpin's arrest likely to set off violent jockeying for power",
      "url": "https://apnews.com/6a8a0c5af91c9e6d8ef3addabe140dcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e4608862cd64f4889fde8b5bece4b71/1944.jpeg"
    },
    {
      "author": "ALBERT STUMM",
      "description": "For many people of a certain age, high school gym class began with reaching for their toes. Then, over the years, we were told it was better to stretch after exercise. It turns out, both those things can be true, but the differing advice has created some confusion.",
      "publishedAt": "2024-07-27T04:02:50Z",
      "title": "Should you stretch before exercise? After? Never? Here’s what to know",
      "url": "https://apnews.com/4b1fd29e44c5cb384f5013eb70962a79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c912abceea246b090a5ddcac6feefbc/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO and ERIC TUCKER",
      "description": "WASHINGTON (AP) — In a fresh broadside against one of the world’s most popular technology companies, the Justice Department late Friday accused TikTok of harnessing the capability to gather bulk information on users based on views on divisive social issues like gun control, abortion and religion.",
      "publishedAt": "2024-07-27T05:24:28Z",
      "title": "Justice Dept. says TikTok collected US user views on issues like abortion and gun control",
      "url": "https://apnews.com/240e11d9bb6212b0c9b1adab821e5005",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e692c2290bbf450c95dab1e4fe06996a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}