{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — Tens of thousands of grieving and angry Israelis surged into the streets Sunday night after six more hostages were found dead in Gaza, chanting “Now! Now!” as they demanded that Prime Minister Benjamin Netanyahu reach a cease-fire with Hamas to bring the remaining captives home.",
      "publishedAt": "2024-09-01T03:11:35Z",
      "title": "Israelis erupt in protest to demand a cease-fire after 6 more hostages die in Gaza",
      "url": "https://apnews.com/29496f50a9b1740bd3905035ffd23052",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c16f4c638a94f72bdaca4093acc568d/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Palestinian health authorities and United Nations agencies on Sunday began a large-scale campaign of vaccinations against polio in the Gaza Strip, hoping to prevent an outbreak in the territory that has been ravaged by the Israel-Hamas war.",
      "publishedAt": "2024-09-01T07:24:00Z",
      "title": "Large-scale polio vaccinations begin in war-ravaged Gaza after first case in 25 years",
      "url": "https://apnews.com/5bca65dd2b60bb74011ecf97864961f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a19205e999a40a0b834ff96803ae2c6/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Donald Trump's campaign issued a statement Sunday from the Gold Star military families who invited him to Arlington National Cemetery as they defended the Republican presidential nominee and insisted that Vice President Kamala Harris is the candidate politicizing fallen U.S.",
      "publishedAt": "2024-09-01T16:33:25Z",
      "title": "Trump issues statement from Gold Star families defending Arlington Cemetery visit and ripping Harris",
      "url": "https://apnews.com/0ef2d4d0d0a1bbecdf77adbc4970a8fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f8563e8b71149bab76526d9939ea41d/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO and DAN MERICA",
      "description": "WASHINGTON (AP) — Italo Medelius was leading a volunteer drive to put Cornel West on North Carolina's presidential ballot last spring when he received an unexpected call from a man named Paul who said he wanted to help.",
      "publishedAt": "2024-09-01T16:39:42Z",
      "title": "GOP network props up liberal third-party candidates in key states, hoping to siphon off Harris votes",
      "url": "https://apnews.com/4089fb0c9ebb16002e56a1c254a21b0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a475f5a43a7409b821c58514bdcdfb6/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON",
      "description": "With up to 17 rooms to clean each shift, Fatima Amahmoud's job at the Moxy hotel in downtown Boston sometimes feels impossible.There was the time she found three days worth of blond dog fur clinging to the curtains, the bedspread and the carpet.",
      "publishedAt": "2024-09-01T13:12:47Z",
      "title": "Strikes start at top hotel chains as housekeepers seek higher wages and daily room cleaning work",
      "url": "https://apnews.com/2bc35ed24dd424bc66d1afc9b036f92d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b82c384f30b4f60825be83f83f5a6ae/1920.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — A far-right party won a state election for the first time in post-World War II Germany in the country’s east on Sunday, and looked set to finish a very close second to mainstream conservatives in a second vote.",
      "publishedAt": "2024-09-01T06:57:03Z",
      "title": "A German far-right party wins its first state election and is very close in a second",
      "url": "https://apnews.com/97413b8e75871eb35c5e2d8b05e885f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2556ef6b9e6a4f2dbdcd547adeaea8e8/2528.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — If any evidence were needed to underscore that Pope Francis’ upcoming trip to Asia and Oceania is the longest, farthest and most challenging of his pontificate, it’s that he’s bringing along his secretaries to help him navigate the four-country program while keeping up with work back home.",
      "publishedAt": "2024-09-01T03:35:17Z",
      "title": "Pope embarks on longest, farthest and most challenging trip to Asia, with China in the background",
      "url": "https://apnews.com/19930e8f324ffc7f0c59ce30ab995585",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b8caeee6a074949946e9f8795a80497/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA and CATERINA MORBIATO",
      "description": "MEXICO CITY (AP) — “That’s it, dude! Done!” exclaimed Eliezer López as he jumped up and down, throwing his arms to the sky and drawing a sign of the cross across his chest. His joy was so contagious, his friends started to emerge from nearby tents to celebrate with him.",
      "publishedAt": "2024-09-01T04:06:29Z",
      "title": "US border policy spurred migrant camps hundreds of miles away in Mexico's capital",
      "url": "https://apnews.com/22b49fabf6e4d7d25d2873d0637544fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41822a5b678a4fcda29eb6ee5ebfcb66/3000.jpeg"
    },
    {
      "author": "RYAN DOAN-NGUYEN",
      "description": "Before she cut the air on the world’s biggest sporting stage with head-spinning, gravity-defying moves, Logan Edra, aka B-Girl Logistx, held herself with a razor-sharp focus.Brows furrowed and hands anchored at her hips, Team USA’s youngest breaker this year seemed more serious than some of her competitors at the Paris Olympics.",
      "publishedAt": "2024-09-01T04:21:05Z",
      "title": "Minority athletes hope their Olympic journeys will sway intolerant hearts and minds",
      "url": "https://apnews.com/71dc9a7d7ab5cd306df9d5b9c6b471d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c588d860f90a41558cfa29c92697583f/2982.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "VENICE, Italy (AP) — George Clooney and Brad Pitt returned to the Venice Film Festival on Sunday for the world premiere of “Wolfs.”",
      "publishedAt": "2024-09-01T04:17:18Z",
      "title": "Venice Film Festival welcomes Pitt and Clooney, and their new film ‘Wolfs’",
      "url": "https://apnews.com/3af1903dc8e8b453e89173afd50a0bf0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6de822d2f8247949e38d1d52144574d/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}