{
  "articles": [
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "President Donald Trump said he will announce on Monday that the United States will impose 25% tariffs on all steel and aluminum imports, including from Canada and Mexico, as well as other import duties later in the week.",
      "publishedAt": "2025-02-10T08:20:00Z",
      "title": "Live updates: Trump says 25% steel and aluminum tariffs are coming Monday",
      "url": "https://apnews.com/live/donald-trump-news-2-10-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e5c069/2147483647/strip/true/crop/7573x4260+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F10%2F8d4c6169c3d207e68ad6d830f154%2F5d2651b7eb764c438e45800ca57c5354"
    },
    {
      "author": "JILL COLVIN",
      "description": "President Donald Trump said he is serious about wanting Canada to become the 51st state in an interview that aired Sunday during the Super Bowl preshow. “Yeah it is,” Trump told Fox News Channel’s Bret Baier when asked whether his talk of annexing Canada is “a real thing” — as Canadian Prime Minister Justin Trudeau recently warned. In the interview, Trump also said he has not seen enough action from Canada and Mexico to stave off the tariffs he has threatened to impose. “No, it’s not good enough,” he said of the United States' two largest trading partners. “Something has to happen. It’s not sustainable. And I’m changing it.”",
      "publishedAt": "2025-02-09T22:11:40Z",
      "title": "In Super Bowl interview, Trump says he wants Canada to be 51st state",
      "url": "https://apnews.com/article/canada-gulf-america-super-bowl-bret-baier-musk-7e1959c7d430899b01629c800db6f17b",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e5c069/2147483647/strip/true/crop/7573x4260+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F10%2F8d4c6169c3d207e68ad6d830f154%2F5d2651b7eb764c438e45800ca57c5354"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "A third federal judge has blocked President Donald Trump’s executive order ending birthright citizenship for the children of people who are in the U.S. illegally. The ruling from U.S. District Judge Joseph N. Laplante in New Hampshire on Monday came after two similar rulings by judges in Seattle and Maryland last week. An American Civil Liberties Union lawsuit contends Trump’s order attempts to upend a fundamental American constitutional value. Trump’s Republican administration has asserted that children of noncitizens are not entitled to citizenship and is appealing the Seattle judge’s block on his order.",
      "publishedAt": "2025-02-10T14:36:38Z",
      "title": "Third judge blocks Trump’s order ending birthright citizenship for kids of people in US illegally",
      "url": "https://apnews.com/article/trump-birthright-citizenship-order-lawsuit-edc182abc957868840f28c4bfb5326b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/8172748/2147483647/strip/true/crop/7562x4254+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F67%2Fbbb863d8695e5313271a98178642%2F9c3139378df346588ea7372b9d3d2dc3"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "The Trump administration has ordered the Consumer Financial Protection Bureau to stop nearly all its work, effectively shutting down the agency that was created to protect consumers after the 2008 financial crisis and subprime mortgage-lending scandal. Russell Vought is the newly installed director of the Office of Management and Budget. Vought directed the CFPB in a Saturday night email to stop work on proposed rules, to suspend the effective dates on any rules that were finalized but not yet effective, and to stop investigative work and not begin any new investigations. The agency has been a target of conservatives since President Barack Obama created it following the 2007-2008 financial crisis.",
      "publishedAt": "2025-02-09T16:08:36Z",
      "title": "Trump administration orders consumer protection agency to stop work, closes building",
      "url": "https://apnews.com/article/trump-consumer-protection-cease-1b93c60a773b6b5ee629e769ae6850e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/b953726/2147483647/strip/true/crop/5588x3143+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F3b%2F060b1f79df14ceca38d7abf2f9ef%2F150b19a0430743adb1da70f86374ff16"
    },
    {
      "author": "SYLVIE CORBET, AAMER MADHANI, THOMAS ADAMSON",
      "description": "JD Vance is stepping onto the world stage for the first time as U.S. vice president this week, using a high-profile artificial intelligence summit in France and a gathering of national security leaders in Germany to showcase Donald Trump’s more assertive approach to diplomacy. Challenging diplomatic talks are expected while tech titans fight for dominance in the fast-moving technology industry. Among those taking part in the two-day summit are heads of state, top government officials, CEOs and scientists from around 100 countries. Chinese Vice Premier Zhang Guoqing is also attending. The summit will give many European leaders a chance to meet Vance for the first time.",
      "publishedAt": "2025-02-10T06:02:04Z",
      "title": "Vance makes his debut as VP on the international stage at a high-stakes AI summit in Paris",
      "url": "https://apnews.com/article/vance-ai-summit-paris-macron-be59047c41c86b03fafe646ea3a93bc0",
      "urlToImage": "https://dims.apnews.com/dims4/default/8e3dbdc/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2Ff8%2F50bb283d515a02f8e3f259a0f81b%2Ff24a785df3ae4bac9cbb95d851f04dc6"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "President Donald Trump has unleashed chaos by distraction around the world with a blitz of executive orders and ideas. The result — foreign leaders are scrambling to respond and regular people are wondering how they'll get food and medicine. No one person or government could possibly keep up with the deluge. So the Saudis are furious. The Danes are scrambling. Greenlanders don't want to be part of the United States. War-scarred people in Gaza refuse to move elsewhere as Trump has proposed. And anyone who depends on American aid for medical care or food is confronting the life-and-death implications of abruptly not having it.",
      "publishedAt": "2025-02-10T15:39:45Z",
      "title": "Trump has unleashed chaos by distraction upon the international community. That's no accident",
      "url": "https://apnews.com/article/trump-chaos-gaza-greenland-trade-eabba5e346e0c41fb5e9391f84450668",
      "urlToImage": "https://dims.apnews.com/dims4/default/3576dc3/2147483647/strip/true/crop/5212x2932+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2Fbf%2Fc9d7bef4d9c72024409dc3f16ea9%2F295bbc7950564e698abd859d63bb8717"
    },
    {
      "author": "MARK SHERMAN",
      "description": "President Donald Trump will need the Supreme Court, with three justices he appointed, to enable the most aggressive of the many actions he has taken in just the first few weeks of his second White House term. But even a conservative majority with a robust view of presidential power might balk at some of what the president wants to do. The court gave Trump major victories last year that helped clear away potential obstacles to his reelection, postponing his criminal trial in Washington, D.C., then affording immunity from prosecution for official actions. But Trump’s first term was marked by significant defeats — as well as some wins — at the court.",
      "publishedAt": "2025-02-10T05:02:05Z",
      "title": "Supreme Court that Trump helped shape could have the last word on his aggressive executive orders",
      "url": "https://apnews.com/article/trump-supreme-court-birthright-citizenship-presidential-power-076bca4dba472d0d7e3b1d059cac7978",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb4dc04/2147483647/strip/true/crop/5166x2906+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2F3c%2F0f3946dc801b91c5de9c303a73b9%2F1d9cebc6463e4513943fa33c867b8f91"
    },
    {
      "author": "JILL COLVIN",
      "description": "President Donald Trump says he has directed the Treasury Department to stop minting new pennies, citing the rising cost of producing the one-cent coin. Trump wrote in a post Sunday night on his Truth Social site: “For far too long the United States has minted pennies which literally cost us more than 2 cents. This is so wasteful!” He added: “I have instructed my Secretary of the US Treasury to stop producing new pennies.” The move by Trump is the latest in what has been a rapid-fire effort by his new administration to enact sweeping change through executive order and proclamation.",
      "publishedAt": "2025-02-10T02:46:09Z",
      "title": "Trump says he has directed US Treasury to stop minting new pennies, citing rising cost",
      "url": "https://apnews.com/article/trump-penny-treasury-mint-192e3b9ad9891d50e7014997653051ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/23a7837/2147483647/strip/true/crop/6793x3821+0+354/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F66%2Fbe69129d93a8046ed0f69c69b450%2Fe4077503a0764e1192db15dcc00754bf"
    },
    {
      "author": "CHRISTOPHER RUGABER, DARLENE SUPERVILLE",
      "description": "President Donald Trump says he'll announce Monday the United States will impose 25% tariffs on all steel and aluminum imports, including from Canada and Mexico, as well as other import duties later in the week. Shares of U.S. steel companies rose sharply in futures trading before the opening bell Monday. Trump also reaffirms he'll announce “reciprocal tariffs.” That means the U.S. would impose import duties on products in cases in which another country has levied duties on U.S. goods. The Republican president spoke to reporters aboard Air Force One as he flew on Sunday from Florida to attend the Super Bowl in New Orleans.",
      "publishedAt": "2025-02-09T22:02:31Z",
      "title": "Trump says he will announce 25% steel and aluminum tariffs Monday",
      "url": "https://apnews.com/article/trump-steel-aluminum-tariffs-import-duties-74d7bfde0da59e111a45e772d199f2b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0cd7bc/2147483647/strip/true/crop/3000x1688+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2Fb9%2F8d23900ecc1261cc038f96ce30e8%2F771129d26549492dbd10bf7fc70fd76b"
    },
    {
      "author": "MARIA CHENG",
      "description": "The head of the U.N. AIDS agency says the number of new HIV infections could jump more than six times by 2029 if American support of the biggest AIDS program is dropped. UNAIDS Executive Director Winnie Byanyima warned that millions of people could die and more resistant strains of the disease could emerge. Since President Donald Trump’s announcement the U.S. would freeze all foreign assistance for 90 days, Byanyima said officials estimate that by 2029, there could be 8.7 million people newly infected with HIV, a tenfold jump in AIDS-related deaths of 6.3 million and an additional 3.4 million children made orphans.",
      "publishedAt": "2025-02-10T11:25:23Z",
      "title": "HIV infections could jump over 6 times if US support is dropped and not replaced, UNAIDS chief says",
      "url": "https://apnews.com/article/hiv-aids-us-trump-un-byanyima-ca9e3e582fe586cc7059ade352f308c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/42cbd03/2147483647/strip/true/crop/3056x1719+0+159/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2Fd8%2Ffec894c2cf86d727e65172d676e0%2F27543f25ea9c4aa59aceae5ed4f2c371"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}