{
  "articles": [
    {
      "author": "Zeke Miller",
      "description": "The White House says guests at President Donald Trump’s address to Congress will include the widow of a slain New York police officer, a Pennsylvania teacher who was detained in Russia and the family of a man killed at Trump’s assassination attempt in Pennsylvania. Trump on Tuesday will give an accounting of his turbulent first weeks in office as a divided nation struggles to keep pace. Some Americans fear for the country’s future after the Republican president’s aggressive early moves, while others cheer him on. Democrats are highlighting the impact of Trump’s actions by inviting as guests fired federal workers and people who’d be harmed by cuts to Medicaid and other programs.",
      "publishedAt": "2025-03-04T05:11:24Z",
      "title": "Trump will stand before Congress and offer divided nation an accounting of his turbulent first weeks",
      "url": "https://apnews.com/article/trump-speech-congress-immigration-tariffs-guests-93f6107ede260854f90c65c4bde60de8",
      "urlToImage": "https://dims.apnews.com/dims4/default/b426a2c/2147483647/strip/true/crop/5777x3250+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F95%2F045aec4086a891ea58abaa2a5668%2Fcf7b6a837c814f78acc74f0125803628"
    },
    {
      "author": "Chris Megerian, Aamer Madhani",
      "description": "A president’s address to Congress — even without the formal gloss of a State of the Union address — is typically a time for a call to national unity and predictable claims about the country being strong. But that wasn’t President Donald Trump’s plan. His speech on Tuesday night was relentlessly partisan, boasting about his election victory and criticizing Democrats for failing to recognize his accomplishments. The hard edge reflected Trump’s bulldozer approach to his second term, brushing aside opposition and demanding loyalty throughout the federal government.",
      "publishedAt": "2025-03-05T04:36:02Z",
      "title": "Key takeaways from Trump's speech to Congress",
      "url": "https://apnews.com/article/trump-address-congress-takeaways-partisan-divide-b25327f1c728190102c2a7ade61cb498",
      "urlToImage": "https://dims.apnews.com/dims4/default/82ff69e/2147483647/strip/true/crop/5212x2932+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Fd8%2Fc44aa89b08c95b1c4a02ab1e6dea%2F8878b3cd52bd4eeba31bf2154fce10f3"
    },
    {
      "author": "Joey Cappelletti",
      "description": "First-term Sen. Elissa Slotkin of Michigan accused President Donald Trump of driving up costs while pushing a giveaway to his billionaire friends. Slotkin delivered the Democratic response to Trump’s joint congressional address. Slotkin gave the rebuttal Tuesday night after just two months serving in the U.S. Senate. She won the battleground state's open Senate seat over Republican Mike Rogers in November while Trump carried the state in the presidential race. Slotkin told Americans that Trump’s policies would make them pay “in every part of your life.” Her speech comes as the Democratic party struggles to find a unified message against Trump.",
      "publishedAt": "2025-03-04T05:16:25Z",
      "title": "Michigan's Elissa Slotkin assails Trump's policies in Democratic response",
      "url": "https://apnews.com/article/trump-slotkin-democratic-response-fae53aacdc4796b2118ba5269fdd86de",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7bb7c7/2147483647/strip/true/crop/5553x3124+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2Ff9%2F9e390362f5e11fa5c1196d489b43%2Fd558e6b2d16244d5ab59c476a71b993b"
    },
    {
      "author": null,
      "description": "House Speaker Mike Johnson has instructed the House Sergeant of Arms to remove Rep. Al Green, D-Texas, for disturbing Trump’s speech.",
      "publishedAt": "2025-03-05T02:33:19Z",
      "title": "Rep. Al Green removed from House chamber during Trump's speech to Congress",
      "url": "https://apnews.com/video/al-green-gets-ejected-000001956426dd23abfffd3f55cb0000",
      "urlToImage": "https://dims.apnews.com/dims4/default/d26e1ca/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2Fd3%2F87766cb7418986c9e138c4be27c5%2Fyoutube-thumbnails-2025-03-04t215318-733.png"
    },
    {
      "author": "Lisa Mascaro",
      "description": "House Speaker Mike Johnson is encouraging Republican lawmakers to skip town halls that have been rife with protesters. The speaker’s advice on Tuesday comes as GOP lawmakers often find themselves at a loss to explain the Trump administration cuts led by billionaire Elon Musk’s Department of Government Efficiency. As workers are being fired coast to coast, Democrats are jumping in to shine a bright light on what is happening. Johnson said lawmakers could meet in small venues or on telephone town halls. He echoed President Donald Trump's claim that the demonstrations are just paid protesters. Democrats say Republicans are afraid to speak honestly about cuts to Medicaid and other federal programs.",
      "publishedAt": "2025-03-04T17:35:23Z",
      "title": "Speaker Johnson tells GOP lawmakers to skip town halls amid sharp protests",
      "url": "https://apnews.com/article/town-halls-musk-doge-trump-gop-749d91ea516284057e4c7bcb1615527e",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d7b206/2147483647/strip/true/crop/3794x2134+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F7d%2F4961181b9d0ff443edd6665b6e3e%2F95a8d761507143de8ef2248aabfbf998"
    },
    {
      "author": "Tammy Webber",
      "description": "President Donald Trump wants to increase logging in national forests and on public lands, including by bypassing endangered species protections. To do that, the federal government would have to activate a seldom-used committee nicknamed the “God Squad.” It's called that because it can approve federal projects even if it leads to extinction of a species otherwise protected by the Endangered Species Act. But experts say there are strict procedural requirements — and no provision under law to proactively use the committee to bypass protections.",
      "publishedAt": "2025-03-04T21:34:42Z",
      "title": "Trump wants to use the 'God Squad' to increase logging, but it must follow strict rules",
      "url": "https://apnews.com/article/trump-logging-endangered-species-god-squad-5ddbbd117a480cdc60f5bc5580cd72ef",
      "urlToImage": "https://dims.apnews.com/dims4/default/75ab9f5/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2Faf%2F509b3ce0a0dc264b539b2d6a75cc%2F520845695e1b4cd4afbef45e5fdd44ae"
    },
    {
      "author": "Paul Wiseman",
      "description": "A Minnesota farmer worries about the price of fertilizer. A San Diego entrepreneur deals with an unexpected increase in the cost of remodeling a restaurant. A Midwestern sheet metal fabricator bemoans the prospect of higher aluminum prices. President Donald Trump on Tuesday went ahead with plans to impose 25% tariffs on Canada and Mexico and to double levies on Chinese goods to 20%. Now businesses are scrambling to deal with the fallout.",
      "publishedAt": "2025-03-05T05:01:05Z",
      "title": "Businesses scramble to contain fallout from Trump's tariffs on Canada, China and Mexico",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-inflation-costs-39136d3cbe733e9b2242f1e3436b67ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/99a7cae/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F76%2F5b69312f6d98a5e97532292655a4%2F12db09054f384c2eb06edf914412bfcd"
    },
    {
      "author": "Julia Frankel, Samy Magdy",
      "description": "Israel’s cutoff of food, fuel, medicine and other supplies to Gaza’s 2 million people has sent prices soaring and humanitarian groups into overdrive, trying to distribute dwindling stocks to the most vulnerable. The population relies entirely on the aid to survive. Israel's move to freeze it has imperiled the tenuous progress aid workers say they have made to stave off famine over the past six weeks under the Israel-Hamas ceasefire deal. Humanitarian groups say they don’t have significant stockpiles of supplies inside Gaza and that an extended freeze could be catastrophic. Israel says it is blocking aid from entering to pressure Hamas to accept its new ceasefire demand.",
      "publishedAt": "2025-03-05T05:20:24Z",
      "title": "Israel cut off food and supplies to Gaza. Aid groups are scrambling. What's happening on the ground?",
      "url": "https://apnews.com/article/israel-gaza-aid-cutoff-netanyahu-hunger-war-940ceea2c2b754d197a4f07c0cad86de",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b37ff9/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F2a%2Fe7bf969bcf911ef73fc8802b4d88%2Ffa20088a1a2e490fb1ad0d3c8a512595"
    },
    {
      "author": "Morgan Lee",
      "description": "One discrepancy in the death of actor Gene Hackman, wife Betsy Arakawa and one of their three beloved dogs has been resolved after authorities mistakenly identified the deceased dog as a German shepherd. A dog care facility owner says Tuesday that a German shepherd named Bear survived, along with a second dog named Nikita. At the same time, he says the couple’s kelpie mix Zinna died. Authorities have been searching for answers after the deaths of Hackman and Arakawa since their partially mummified bodies were discovered on Feb. 26 at their Santa Fe home.",
      "publishedAt": "2025-03-05T01:31:56Z",
      "title": "Gene Hackman's dog was misidentified as other mysteries swirl around actor's death",
      "url": "https://apnews.com/article/gene-hackman-died-dogs-santa-fe-22d7f6921577f012c87027de8652795d",
      "urlToImage": "https://dims.apnews.com/dims4/default/482cd93/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F4a%2Fb6c13adfbb253815acb227661943%2Ff3a1e1f25b704f41b595a8a8145b6b4e"
    },
    {
      "author": "The Associated Press",
      "description": "President Donald Trump's one-hour and 40-minute address to Congress highlighted many of his initiatives, from an immigration crackdown to tariffs and energy policy. But many of his comments Tuesday night included false and misleading information about those efforts. Trump overstated numbers around his immigration crackdown and misrepresented economic figures, repeating several false claims he has made in the past. He also distorted an initiative from his predecessor on electric vehicles and took credit for Army recruitment trends that began before he entered office.",
      "publishedAt": "2025-03-04T12:02:48Z",
      "title": "FACT FOCUS: A look at false and misleading claims made by Trump during his address to Congress",
      "url": "https://apnews.com/article/fact-check-misinformation-trump-ukraine-3bea1df50167ac0a91f8c419b58c4b97",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad45570/2147483647/strip/true/crop/2355x1325+0+123/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2Fd8%2F61c61c927e9bec45e52d5b861dbe%2Fe5c3c41e517c417c9142b9ffd3a68b6d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}