{
  "articles": [
    {
      "author": "RAVI NESSMAN, ZEKE MILLER and AAMER MADHANI",
      "description": "JERUSALEM (AP) — In a sign that mediators believe a Gaza cease-fire deal is imminent, a U.S. official said Friday that Mideast negotiators are working out logistics for the potential release of hostages and distribution of aid as part of any agreement to end the Israel-Hamas war.",
      "publishedAt": "2024-08-16T06:39:24Z",
      "title": "US official says Mideast mediators are preparing for implementation of cease-fire deal in advance",
      "url": "https://apnews.com/cf0bb95a8a36cfabf1c6db8edf97c862",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1025cc90d0174dc79bb47c463ea6791f/1920.jpeg"
    },
    {
      "author": null,
      "description": "SUDZHA, Russia (AP) — A trail of destruction lies in the path that Ukrainian forces carved on their risky incursion into Russia, blasting through the border and eventually into the town of Sudzha, where Associated Press journalists traveled Friday on a Ukrainian government-organized trip.",
      "publishedAt": "2024-08-16T20:56:59Z",
      "title": "Ukrainian forces left a path of destruction in the Kursk operation. AP visited a seized Russian town",
      "url": "https://apnews.com/090f03d7f809af49ae9957e851525eb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39a31e55092c4cdea476e1f4ff42d887/3000.jpeg"
    },
    {
      "author": "MATT BROWN and MAKIYA SEMINERA",
      "description": "RALEIGH, N.C. (AP) — Vice President Kamala Harris announced a sweeping set of economic proposals on Friday meant to cut taxes and lower the cost of groceries, housing and other essentials for many Americans.",
      "publishedAt": "2024-08-16T11:05:32Z",
      "title": "Harris offers proposals to cut food and housing costs, trying to blunt Trump's economic attacks",
      "url": "https://apnews.com/e1ad3f26f2ce8e6cb365a4ffe2ca3e6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c542c15e7834bc8807995ecd85fba1f/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "Former President Donald Trump owns more than $1 million worth of cryptocurrency and up to $250,000 in gold bars along with the portfolio of golf courses and real estate properties that have made him a billionaire, according to newly released financial disclosures.",
      "publishedAt": "2024-08-16T16:59:57Z",
      "title": "Bibles, cryptocurrency, Truth Social and gold bars: A look at Trump's reported sources of income",
      "url": "https://apnews.com/126e8382dd3501e3144de1a8aa9df2f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c27c9701253d4785b22620c0c2e0e5f7/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "MEXICO CITY (AP) — It was strange and surprising when Mexico’s most-wanted drug lord landed at an airfield near El Paso, Texas in July, but the story of how he got there is now growing into a scandal that threatens top figures in Mexico’s ruling party.",
      "publishedAt": "2024-08-16T19:02:15Z",
      "title": "A gunshot, a murdered rival and a kidnapped drug lord: Mexico's ruling party faces growing scandal",
      "url": "https://apnews.com/45d2c8b8b90d9640aa7092357bd21622",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ca7552419d041e5bf6b34584624df5d/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, ELLIOT SPAGAT and FRANKLIN BRICENO",
      "description": "A South American crime boss wanted in the killings of at least 23 people in Peru was captured this week in New York, three months after U.S.",
      "publishedAt": "2024-08-16T19:16:40Z",
      "title": "What to know about the US arrest of a Peruvian gang leader suspected of killing 23 people",
      "url": "https://apnews.com/12ff7a64180566502308ad9b886c75fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d378cb06734d42a8815a0af8f09c7f07/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean opened shelters and closed government offices.",
      "publishedAt": "2024-08-16T10:54:53Z",
      "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm",
      "url": "https://apnews.com/7c53790d1b73ed431eae36bf3189fa4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe65d1bf74f44221b8bbf7cd65ff8d32/1920.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — The World Health Organization has declared the ongoing outbreaks of mpox in Congo and elsewhere in Africa to be a global emergency, requiring urgent action to curb the virus' transmission.",
      "publishedAt": "2024-08-16T16:19:36Z",
      "title": "Now that mpox is a global health emergency, will it trigger another pandemic?",
      "url": "https://apnews.com/59548adbbd58df7e5d176fc244e02a58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4d10527afc54e488d16028448997075/2100.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "The investigation into the death of “Friends” star Matthew Perry has led to a sweeping indictment that pulled in five people who prosecutors say contributed to his ketamine overdose in October, including two doctors and a street dealer involved in providing Perry large amounts of the powerful anesthetic.",
      "publishedAt": "2024-08-16T15:58:49Z",
      "title": "What is ketamine, the drug involved in Matthew Perry's death?",
      "url": "https://apnews.com/1f6bc37573a44408146e42260b689de4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff4bb351450c4a4ba905848750277bfe/2288.jpeg"
    },
    {
      "author": "AARON MORRISON",
      "description": "Kayla Reed was born in a predominantly African American section of St. Louis where, like her own kin, many Black families had been transplanted out of the Deep South. After the death of her grandmother, Reed moved with her father from the city to a St.",
      "publishedAt": "2024-08-16T18:24:56Z",
      "title": "Michael Brown’s death transformed a nation and sparked a decade of American reckoning on race",
      "url": "https://apnews.com/06773aab70c16bbbfd4835be1bf6037c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1dacea55c29448aafdfc1e0d9d7d304/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}