{
  "articles": [
    {
      "author": null,
      "description": "CANADIAN, Texas (AP) — Rapidly moving Texas wildfires Tuesday prompted evacuation orders in small towns and shut down a nuclear facility as strong winds, dry grass and unseasonably warm temperatures fueled the blaze in the state's rural Panhandle.",
      "publishedAt": "2024-02-27T22:18:27Z",
      "title": "Texas nuclear weapons facility pauses operations as wildfires spread through rural Panhandle",
      "url": "https://apnews.com/2cad37f14581bac74a3691969aaaf956",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf0fb45e64d14f06984c989034871fa7/2048.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and COREY WILLIAMS",
      "description": "DEARBORN, Mich. (AP) — President Joe Biden and former President Donald Trump won the Michigan primaries on Tuesday, further solidifying the all-but-certain rematch between the two men — yet early results from the state were highlighting some of their biggest political vulnerabilities ahead of the November general election.",
      "publishedAt": "2024-02-27T05:03:48Z",
      "title": "Trump and Biden won Michigan. But 'uncommitted' votes demanded attention",
      "url": "https://apnews.com/6e0b9fc18773e975fdfd23f7287ed615",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bd83dee6a7a41478cc44ad13142ba1c/1920.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "LANSING, Mich. (AP) — Joe Biden and Donald Trump easily won their party’s primaries in Michigan, but Tuesday’s results showed that both candidates have cause for concern in their bid to to win the swing state in November.",
      "publishedAt": "2024-02-28T02:31:59Z",
      "title": "Michigan takeaways: Presidential primaries show warning signs for Trump and Biden",
      "url": "https://apnews.com/48b7ab77b7af425c3662e5a8f28e37f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bd83dee6a7a41478cc44ad13142ba1c/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and TIA GOLDENBERG",
      "description": "CAIRO (AP) — Israel and Hamas are inching toward a new deal that would free some of the roughly 130 hostages held in the Gaza Strip in exchange for a weekslong pause in the war, now in its fifth month.",
      "publishedAt": "2024-02-27T17:47:59Z",
      "title": "A deal between Israel and Hamas appears to be taking shape. What would it look like?",
      "url": "https://apnews.com/2ef0d5b960c4f132bfe9d91b19878a12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cfb199c12b2464faf87fe8dc2bd6e80/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, KEVIN FREKING and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Congressional leaders emerged from an “intense” Oval Office meeting with President Joe Biden on Tuesday speaking optimistically about the prospects for avoiding a partial government shutdown, but with new uncertainty about aid for Ukraine and Israel as the president and others urgently warned Speaker Mike Johnson of the grave consequences of delay.",
      "publishedAt": "2024-02-27T05:07:26Z",
      "title": "Biden and party leaders implore Speaker Johnson to help Ukraine in 'intense' Oval Office meeting",
      "url": "https://apnews.com/dc6d39b2a652130c6e3021394c1a3ee3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc83ffb163b6419fa2604011884d622d/1920.jpeg"
    },
    {
      "author": "JEFF AMY, ELLIOT SPAGAT and WILL WEISSERT",
      "description": "ATHENS, Ga. (AP) — Laken Riley was a 22-year-old nursing student out on her morning run at the University of Georgia when authorities say a stranger dragged her into a secluded area and killed her, sending shockwaves through campus as police searched for a suspect.",
      "publishedAt": "2024-02-27T19:52:53Z",
      "title": "The killing of a Georgia nursing student is now at the center of the US immigration debate",
      "url": "https://apnews.com/63181cbc7a89fe9fe28b1d0cf84c8b9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/535cca7e52d34a2abe4f945c692e72d1/3000.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — Supervisors in San Francisco formally apologized Tuesday to African Americans and their descendants for the city’s role in perpetuating racism and discrimination, with several stating that this was just the start of reparations for Black residents and not the end.",
      "publishedAt": "2024-02-27T05:04:26Z",
      "title": "San Francisco apologizes to Black residents for decades of racist policies",
      "url": "https://apnews.com/8967c828a52c8ce6ac08c77027a23187",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d700d31bd9374e4bb93f93c977a11a4e/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "MARAVATÍO, Mexico (AP) — Two mayoral hopefuls in the Mexican city of Maravatío have been gunned down within hours of each other, as experts warn the June 2 national elections could be the country's most violent on record.",
      "publishedAt": "2024-02-27T15:20:23Z",
      "title": "Two mayoral hopefuls of a Mexican city are shot dead within hours of each other",
      "url": "https://apnews.com/66e20fe665a25a4974637d8369c7a740",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d5343f905114986a84ba5120dc29920/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "First year student Samuel Woo had been considering a career in cardiology so he would be able to pay off his medical school debt until the announcement this week of a generous donation that will remove tuition fees at his New York City school.",
      "publishedAt": "2024-02-27T23:41:57Z",
      "title": "$1B donation makes New York medical school tuition free and transforms students' lives",
      "url": "https://apnews.com/11eec429784776027161bcd1b6ea1905",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc6b5b3158a54c10b6f35581cdcfcbe8/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — More than 20 years after Run-D.M.C. star Jam Master Jay was brazenly gunned down in his recording studio, two men close to him were convicted Tuesday of murder, marking a moment authorities had long awaited in one of the hip-hop world’s most elusive cases.",
      "publishedAt": "2024-02-27T20:44:56Z",
      "title": "2 men convicted of killing Run-DMC’s Jam Master Jay nearly 22 years after rap star's death",
      "url": "https://apnews.com/4b49f009dc6ac9dc78d99a9dba79fc91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fe5e89754604921ac29668b7f34f1bf/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}