{
  "articles": [
    {
      "author": "AAMER MADHANI, JULIA FRANKEL and BASSEM MROUE",
      "description": "JERUSALEM (AP) — The Israeli military said Tuesday that Iran has fired missiles and it ordered residents to remain close to bomb shelters as air raid sirens sounded across the country.A series of window-shaking explosions were heard in Tel Aviv and near Jerusalem, though it was not immediately clear whether the sounds were from missiles landing or being intercepted by Israeli defenses, or both.",
      "publishedAt": "2024-10-01T09:41:48Z",
      "title": "Israel says Iran has fired missiles and it warns residents to shelter in place",
      "url": "https://apnews.com/eb175dff6e46906caea8b9e43dfbd3da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fe6da4b521f444988a7f41b8d35ee25/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israel said its ground troops crossed into Lebanon overnight, launching what the military described as “localized” raids to root out Hezbollah fighters and infrastructure.Hezbollah, meanwhile, said it saw no sign of Israeli forces and its troops were ready to confront them.",
      "publishedAt": "2024-10-01T12:10:40Z",
      "title": "What to know as Israel says it has launched ground incursion into Lebanon",
      "url": "https://apnews.com/c44358cb4c70db69bdab4b254cb2ed76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9038ef9536c6422fab9b37ea08936f4a/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — As a hostage in Gaza, Aviva Siegel found herself begging for food and water. Since her release, she has found herself begging for her husband to be set free from his own ongoing captivity.",
      "publishedAt": "2024-10-01T04:36:39Z",
      "title": "A former hostage fought for her own life in Gaza. A year on, she fights for her husband's freedom",
      "url": "https://apnews.com/d8ecb415268e911cea09518acdaf7ba2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d594d31cb624dda9ca9a94de0bcaf00/3000.jpeg"
    },
    {
      "author": "ERIK VERDUZCO and JEFFREY COLLINS",
      "description": "SWANNANOA, N.C. (AP) — Rescuers fanned out across the mountains of western North Carolina on Tuesday in search of anyone still unaccounted for since Hurricane Helene’s remnants caused catastrophic damage to the Southeast, with the death toll nearing 140 people.",
      "publishedAt": "2024-10-01T04:10:03Z",
      "title": "Crews search for survivors in North Carolina's mountains days after Helene's deluge",
      "url": "https://apnews.com/c5ff143de63e31bd345066221f5e4d24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e377ac9bd02a437cb751130398627f16/1920.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "ANNANDALE, Va. (AP) — As lawmakers voted on a budget deal at the U.S. Capitol, a different kind of balloting was taking place a dozen miles away in a sun-filled Virginia preschool classroom.",
      "publishedAt": "2024-10-01T04:19:45Z",
      "title": "How one preschool uses PAW Patrol to teach democracy",
      "url": "https://apnews.com/adccecd533294838bbb2cb08fcd41258",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d8a834d7402473f81b516ba70254c03/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Tim Walz and JD Vance will meet for their first and possibly only vice presidential debate Tuesday, in what could be the last debate for both campaigns to argue their case before the election.",
      "publishedAt": "2024-10-01T04:01:50Z",
      "title": "Walz and Vance will meet in their first and possibly only vice presidential debate",
      "url": "https://apnews.com/66ff2e5e45a8dda55b0a2242fc238fdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f21c833bd6740a7a476a98f97417a4a/3000.jpeg"
    },
    {
      "author": "TOM KRISHER, WYATTE GRANTHAM-PHILIPS and TASSANEE VEJPONGSA",
      "description": "PHILADELPHIA (AP) — From Maine to Texas, dockworkers at 36 ports across the eastern United States are on strike for the first time in decades, a work stoppage that could snarl supply chains and cause shortages and higher prices if it stretches on for more than a few weeks.",
      "publishedAt": "2024-10-01T10:43:00Z",
      "title": "Dockworkers' strike could push up prices and cause shortages if it lasts for weeks",
      "url": "https://apnews.com/91703e4798dbc9ee82185e983f31a3f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3f94c2eb7304342981627b3332df816/1920.jpeg"
    },
    {
      "author": "MARÍA VERZA, MEGAN JANETSKY and MARK STEVENSON",
      "description": "MEXICO CITY (AP) — Claudia Sheinbaum will take the oath of office Tuesday as Mexico’s first female president in more than 200 years of independence, promising to protect an expanded social safety net and fight for the poor like her predecessor, but facing pressing problems.",
      "publishedAt": "2024-10-01T04:13:54Z",
      "title": "Claudia Sheinbaum to be sworn in as 1st female president of Mexico, a country with pressing problems",
      "url": "https://apnews.com/7d3599b39a7298df46e7eda34d80afee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91a4b7b8f23f46d0bf2f1146464166fd/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — The U.S. on Tuesday imposed sanctions on Hilltop Youth, a group of extremist settlers in the Israeli -occupied West Bank who attack Palestinians and their property.",
      "publishedAt": "2024-10-01T15:18:29Z",
      "title": "US sanctions extremist West Bank settler group for violence against Palestinians",
      "url": "https://apnews.com/53fb26077c8d88637b4bd366ad3343cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68def43a8bba4af39a9554877ff5d0d1/3000.jpeg"
    },
    {
      "author": "BILL BARROW and CHARLOTTE KRAMON",
      "description": "ATLANTA (AP) — Jimmy Carter reached his 100th birthday Tuesday, the first time an American president has lived a full century and the latest milestone in a life that took the son of a Depression-era farmer to the White House and across the world as a Nobel Peace Prize-winning humanitarian and advocate for democracy.",
      "publishedAt": "2024-10-01T04:13:22Z",
      "title": "Jimmy Carter and his hometown of Plains celebrate the 39th president's 100th birthday",
      "url": "https://apnews.com/1e540c277dea07bd84242d290b4ebcdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cdf95fad438434080026471c6f22e27/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}