{
  "articles": [
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel would be willing to pause its war on Hamas in Gaza during the upcoming Muslim holy month of Ramadan if a deal is reached to release some of the hostages held by the militants, U.S.",
      "publishedAt": "2024-02-27T05:32:00Z",
      "title": "Israel is ready to pause its war in Gaza during Ramadan if a hostage deal is reached, Biden says",
      "url": "https://apnews.com/e17abedeaf5a005fcd5e7095fecacb7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b7eff6efe1c43668120251aa9bbef40/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden was meeting Tuesday with the top four leaders of Congress to press them to act quickly to avoid a looming government shutdown early next month and to pass emergency aid for Ukraine and Israel.",
      "publishedAt": "2024-02-27T05:07:26Z",
      "title": "Biden will urge Congress' top leaders to keep the government open and send aid to Ukraine and Israel",
      "url": "https://apnews.com/dc6d39b2a652130c6e3021394c1a3ee3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55d48d7e138d4b649176a35cd4072ca9/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "BRUSSELS (AP) — NATO Secretary-General Jens Stoltenberg told The Associated Press that the military alliance has no plans to send combat troops into Ukraine amid reports that some Western countries may be considering putting boots on the ground in the war-ravaged country.",
      "publishedAt": "2024-02-27T10:01:07Z",
      "title": "NATO's chief says the alliance has no plans to send troops to Ukraine",
      "url": "https://apnews.com/5d4ed747861a3c0edb8f922fa36427c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/512816507e574c228626ee1e7c3bfa68/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Vladimir Kara-Murza could only laugh when officials in Penal Colony No. 6 inexplicably put a small cabinet in his already-cramped concrete cell, next to a fold-up cot, stool, sink and latrine.",
      "publishedAt": "2024-02-27T05:03:19Z",
      "title": "What's life like for Russia's political prisoners? Isolation, poor food and arbitrary punishment",
      "url": "https://apnews.com/3e5b9f5d3cfde3256819fbde5e405067",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee43baa7f31441f5990e748e702ffcde/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — While Joe Biden and Donald Trump are marching toward their respective presidential nominations, Michigan's primary on Tuesday could reveal significant political perils for both of them.",
      "publishedAt": "2024-02-27T05:03:48Z",
      "title": "Biden and Trump will face tests in Michigan's primaries that could inform a November rematch",
      "url": "https://apnews.com/6e0b9fc18773e975fdfd23f7287ed615",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ba0be9310d04552b0b68bf34f67e1db/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH, SUMMER BALLENTINE and JIM SALTER",
      "description": "KANSAS CITY, Mo. (AP) — The man accused of firing the first shots at the Kansas City Chiefs Super Bowl rally told authorities he felt threatened, while a second man said he pulled the trigger because someone was shooting at him, according to court documents.",
      "publishedAt": "2024-02-27T05:37:56Z",
      "title": "Could Missouri's 'stand your ground' law apply to the Super Bowl celebration shooters?",
      "url": "https://apnews.com/fc7b0658055e285079430dd9ae6d602d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca6e8bf6b9964c4db63f94512d0fb7e7/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — The gunfire that shattered the calm at pastor Joel Osteen’s megachurch in Houston only lasted about four minutes.",
      "publishedAt": "2024-02-26T22:41:25Z",
      "title": "Barrage of gunfire as officers stop shooter at Joel Osteen's megachurch, newly released video shows",
      "url": "https://apnews.com/946045e19ef9b57895e72bb39ef5a340",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/160399a67b5b4a378369eb04564462a9/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — February's end is bringing wild weather to much of the United States, with record heat allowing for golf in Wisconsin and outdoor food trucks in Minnesota, along with an increased fire risk across much of the Great Plains.",
      "publishedAt": "2024-02-26T16:11:54Z",
      "title": "Wild weather hits Northwest with snow even as Midwest gets a taste of summer",
      "url": "https://apnews.com/dbbb5939c655a9a6e28ade6401b7ec88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71d391d493384768b6a99adb4e612768/3000.jpeg"
    },
    {
      "author": "JOCELYN GECKER",
      "description": "SAN FRANCISCO (AP) — In California, a high school teacher complains that students watch Netflix on their phones during class. In Maryland, a chemistry teacher says students use gambling apps to place bets during the school day.",
      "publishedAt": "2024-02-27T05:25:45Z",
      "title": "Phones are distracting students in class. More states are pressing schools to ban them",
      "url": "https://apnews.com/01fd6293a84a2e4e401708b15cb71d36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b53913a7f804b73b16006257580f308/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — A photographer told police he was punched in the face by Taylor Swift’s father on the Sydney waterfront on Tuesday, hours after the pop star’s Australian tour ended.Ben McDonald said he provided police with a statement alleging that Scott Swift assaulted him at the Neutral Bay Wharf, where the father and daughter had just come ashore from a yacht.",
      "publishedAt": "2024-02-27T04:52:47Z",
      "title": "Photographer accuses Taylor Swift's dad of punching him in the face on Sydney waterfront",
      "url": "https://apnews.com/23c542ca3226416c369b24b42a4050ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/715fbee3ed1e428bb53e0c5967f41bb8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}