{
  "articles": [
    {
      "author": "FATMA KHALED and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Last summer, Palestinians in the Gaza Strip celebrated the Muslim holiday of Eid al-Adha the way it's supposed to be: with large family feasts, meat shared with those less fortunate, and new clothes and gifts for children.",
      "publishedAt": "2024-06-15T04:46:31Z",
      "title": "A usually joyous Muslim holiday reminds families in Gaza of war's punishing toll",
      "url": "https://apnews.com/ea5f6c1573eea5592739e0d286bddda9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b95b7d43c564774b2b8a0838ffafc17/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Three years ago, Donald Trump had few friends left in the Senate.Senate Republican Leader Mitch McConnell declared in a speech that Trump was “practically and morally responsible” for the violent Jan.",
      "publishedAt": "2024-06-15T04:03:25Z",
      "title": "Many Senate Republicans were done with Trump after Jan. 6. Now they want him back in the White House",
      "url": "https://apnews.com/ebd9fe54f761d388b235ea3e87cf04eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45cae16692c94a53bab86aeebc4eef66/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and JOEY CAPPELLITTI",
      "description": "DETROIT (AP) — Donald Trump will use back-to-back stops Saturday to court Black voters and a conservative group that has been accused of attracting white supremacists as the Republican presidential candidate works to stitch together a coalition of historically divergent interests in battleground Michigan.",
      "publishedAt": "2024-06-15T11:32:46Z",
      "title": "Trump's Michigan trip will include stops at a Black church and a gathering of far-right activists",
      "url": "https://apnews.com/2ddab35eceecb42ee8899f0720715b32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4da206fc62d840e699801aa6791f36a1/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Flying through the night across nine time zones, from southern Italy to Southern California, President Joe Biden will shift focus from Russia's challenge of Western unity to raking in big bucks for his reelection campaign at a Hollywood fundraiser featuring George Clooney and Julia Roberts.",
      "publishedAt": "2024-06-15T04:02:37Z",
      "title": "Biden goes straight from G7 to Hollywood fundraiser, balancing geopolitics with his reelection bid",
      "url": "https://apnews.com/40081471c93faa68de5c4aa30455303b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83ea14882fc6470e8aa8dfe38620c0cb/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "OBBÜRGEN, Switzerland (AP) — The presidents of Ecuador, Ivory Coast, Kenya and Somalia will join many Western heads of state and government and other leaders at a conference this weekend aimed to plot out first steps toward peace in Ukraine – with Russia notably absent.",
      "publishedAt": "2024-06-15T07:02:32Z",
      "title": "World leaders to meet at Swiss resort on possible Ukraine peace roadmap. Russia is notably absent",
      "url": "https://apnews.com/2a8abeb9e6e2714f6af032593706d9e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5f0999ce7d649669d7806fd32e1971e/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "MOUNT ARAFAT, Saudi Arabia (AP) — Following the footsteps of prophets beneath a burning sun, Muslims from around the world congregated Saturday at a sacred hill in Saudi Arabia for intense, daylong worship and reflection.",
      "publishedAt": "2024-06-15T04:07:53Z",
      "title": "Muslim pilgrims converge at Mount Arafat for daylong worship as Hajj reaches its peak",
      "url": "https://apnews.com/77b05b14674d6997b25b7b58df0d8052",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf209cc747a54457982b3298757de77c/1920.jpeg"
    },
    {
      "author": "DAVE COLLINS, JUAN A. LOZANO and JIM VERTUNO",
      "description": "HOUSTON (AP) — Bombastic conspiracy theorist Alex Jones has been ordered to liquidate his personal assets as he owes $1.5 billion for his false claims that the 2012 Sandy Hook Elementary School shooting, which killed 20 first graders and six educators in Newtown, Connecticut, was a hoax.",
      "publishedAt": "2024-06-15T04:15:06Z",
      "title": "What we know about the fight between conspiracist Alex Jones and Sandy Hook families over his assets",
      "url": "https://apnews.com/0c3576e3c4bd853ac2cc5342118fca8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/479bcfa4e293436cba9d17fe1b8ae619/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "FOREST PARK, Illinois (AP) — Mayumi Barrack sees a pair of mating periodical cicadas getting together, whips out her phone, says, “Hi guys!\" and takes their picture.“I'm not really a bug person, but as I look more and more I feel they are adorable,” Barrack explained, noting that many other creatures — birds, squirrels, raccoons and more — are just as eager to get close to the bugs, if only to turn them into food.",
      "publishedAt": "2024-06-15T11:43:26Z",
      "title": "Think cicadas are weird? Check out superfans, who eat the bugs, use them in art and even striptease",
      "url": "https://apnews.com/87a0d9f476453ea91a54477cf500a741",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba1c38591acc4663a882f540a5266c66/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "The mailings promised “Life Without Pain!” via stem cell injections or IVs administered in a patient’s own home. The allure was obvious: more than 20% of U.S. adults endure chronic pain.The flyers invited Iowans to free dinners across the state.",
      "publishedAt": "2024-06-15T04:14:54Z",
      "title": "Some hawking stem cells say they can treat almost anything. They can't",
      "url": "https://apnews.com/23789b100f28a9abda6e287773369790",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1676cf75a9694e3a9acdac4de475faf1/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "DALLAS (AP) — There were two options for the Dallas Mavericks. Pack for Boston, or pack for vacation.Boston awaits.These NBA Finals are not over, thanks to one of the biggest blowouts in title-round history.",
      "publishedAt": "2024-06-15T03:04:29Z",
      "title": "Doncic scores 29, Mavericks roll past the Celtics 122-84 to avoid a sweep in the NBA Finals",
      "url": "https://apnews.com/06892b340967ef05fafb6d5c0ac6a9d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e22f2a2690c4667b83746de4c1eab77/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}