{
  "articles": [
    {
      "author": null,
      "description": "Kilmar Abrego Garcia has been charged by the Trump administration with transporting people who were in the country illegally. The federal charges unsealed Friday stem from a traffic stop in 2022. The charges allege that Abrego Garcia conspired to bring undocumented immigrants to the U.S. from Guatemala, El Salvador and other countries. The indictment also states that Abrego Garcia was an MS-13 gang member. Abrego Garcia has never been charged with being in MS-13 and has denied membership in the gang. His lawyer previously stated that he saw no wrongdoing in footage released from the 2022 traffic stop. Abrego Garcia was mistakenly deported to El Salvador in March.",
      "publishedAt": "2025-06-06T20:03:49Z",
      "title": "Kilmar Abrego Garcia returned to the US, charged with transporting people in the country illegally",
      "url": "https://apnews.com/article/abrego-garcia-justice-department-el-salvador-a547f3a228c92d4e69be799354037c7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/acbad8d/2147483647/strip/true/crop/1029x579+0+54/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2Fe9%2Fd4f34a97156268f6fdd695c4e66b%2F00c074ffb2ac4c46ad3912c3e5fdb0f0"
    },
    {
      "author": null,
      "description": "The Trump administration is asking the Supreme Court to pause a court order to reinstate Education Department employees who were fired in mass layoffs as part of President Donald Trump’s plan to dismantle the agency. The Justice Department’s emergency appeal to the high court Friday said U.S. District Judge Myong Joun in Boston exceeded his authority last month when he issued a preliminary injunction reversing the layoffs of nearly 1,400 people and putting the broader plan on hold. Joun’s order has blocked one of Trump’s biggest campaign promises and effectively stalled the effort to wind down the department. A federal appeals court refused to put the order on hold while the administration appealed.",
      "publishedAt": "2025-06-06T15:15:04Z",
      "title": "Trump administration asks Supreme Court to leave education layoffs in place",
      "url": "https://apnews.com/article/supreme-court-trump-education-layoffs-79a160b71db85aa060b11de58926a276",
      "urlToImage": "https://dims.apnews.com/dims4/default/7383f15/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fce%2F4101bc6c62f9af0878b853d89b4a%2F5a0e5010145e46e9a0363399a79c13bf"
    },
    {
      "author": null,
      "description": "Sean “Diddy” Combs’ recent ex-girlfriend is back on the witness stand testifying about how he allegedly pressured her to take part in drug-fueled sex marathons. The woman is using the pseudonym “Jane” at Combs' sex trafficking trial in New York as she testifies for a second day Friday. Combs has pleaded not guilty to running his business empire as a racketeering enterprise that enabled the abuse of women. Jane sobbed on Friday as she testified that Combs ignored her when she signaled she wanted to stop the sex encounters. She said felt obligated to participate, as Combs paid her rent and controlled many parts of her life.",
      "publishedAt": "2025-06-06T13:48:59Z",
      "title": "Diddy's recent ex-girlfriend 'Jane' testifies for a second day",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-6dece522ce1f59f874c7a31789f1dbb8",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb9f222/2147483647/strip/true/crop/4080x2295+0+389/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F3b%2F610fcca6a250e97d06e4e3628597%2F2b9c9c80f1d74c8597ef5bf1b0782e94"
    },
    {
      "author": null,
      "description": "A former police chief and convicted killer known as the “Devil in the Ozarks” has been captured after he escaped from a prison, triggering a massive manhunt in the mountains of northern Arkansas. Grant Hardin’s identity was confirmed through fingerprinting, the Izard County Sheriff’s Office said in a Facebook post. The former police chief in the small town of Gateway near the Arkansas-Missouri border was serving lengthy sentences for murder and rape. He was the subject of the TV documentary “Devil in the Ozarks.”",
      "publishedAt": "2025-06-06T19:25:14Z",
      "title": "Ex-police chief and convicted killer who escaped from Arkansas jail captured",
      "url": "https://apnews.com/article/arkansas-prison-escape-devil-ozarks-grant-hardin-44d5a0f6868f84651902aec05caa45e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5cccb3c/2147483647/strip/true/crop/2500x1406+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2Fd5%2F686e09a522b6ee2429c18e6b14e7%2Febb58fe4e4744f378938ef70083c9583"
    },
    {
      "author": null,
      "description": "U.S. employers slowed hiring last month, but still added a solid 139,000 jobs amid uncertainty over Trump’s trade wars. The Department of Labor said Friday that hiring fell from a revised 147,000 in April. The unemployment rate stayed at 4.2%. Trump’s aggressive and unpredictable policies – especially his sweeping taxes on imports – have muddied the outlook for the economy and the job market and raised fears that the American economy could be headed toward recession. But so far the damage hasn’t shown up clearly in government economic data.",
      "publishedAt": "2025-06-06T07:01:38Z",
      "title": "Hiring in the US slows, though a 139,000 jobs added in May",
      "url": "https://apnews.com/article/jobs-unemployment-trump-tariffs-economy-fdd4d1075b2b4490993a863ccb6950c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/a19698b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Fa7%2F4c1a61e41257c9a8c0fc77dfb91c%2F0913dd3291064592b932217017ad8b6f"
    },
    {
      "author": null,
      "description": "The U.S. is up to 1,168 confirmed measles cases this year. Texas added four cases in the past week, which shows continued slowing in its outbreak. Health officials in Pennsylvania and Michigan declared their outbreaks over. Two elementary school-aged children and an adult have died from measles-related illnesses this year. Other states with active outbreaks include Colorado, Kansas, Montana, New Mexico, North Dakota, Oklahoma, Ohio, and Tennessee. Measles is caused by a highly contagious virus that’s airborne. It is preventable through vaccines, and has been considered eliminated from the U.S. since 2000.",
      "publishedAt": "2025-05-09T19:22:07Z",
      "title": "Measles outbreaks: Updates on case counts across the US",
      "url": "https://apnews.com/article/measles-texas-vaccination-us-rfk-mmr-8fb86f56b0892408680daae4a52047e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/12f9862/2147483647/strip/true/crop/8474x4767+0+442/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fe2%2Fc5b296758d4385d6c417da672145%2F5a1dd41d649144a382083adc51106abd"
    },
    {
      "author": null,
      "description": "Democratic state attorneys general are seeking to block President Donald Trump’s proposal for an overhaul of U.S. elections in a case that tests a constitutional bedrock — the separation of powers. The top law enforcement officials from 19 states filed a federal lawsuit after the Republican president signed the executive order in March, arguing its provisions would step on states’ power to set their own election rules. During a Friday hearing in federal court in Boston, lawyers for the states argued the changes outlined in the order could not be implemented before the next election and could cost California alone $1 million just to update its voter registration database. Trump administration lawyers say any enforcement actions haven’t been decided.",
      "publishedAt": "2025-06-06T10:17:39Z",
      "title": "Democratic attorneys general sue over Trump's election overhaul",
      "url": "https://apnews.com/article/trump-executive-order-elections-democrats-states-8a329645f15e161103709409ecf3e746",
      "urlToImage": "https://dims.apnews.com/dims4/default/cec22d8/2147483647/strip/true/crop/3500x1969+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F16%2F6af32f3a5ec76cb9d233aeeb22b1%2Fac916e460f914777b4455d51a47d0ebd"
    },
    {
      "author": null,
      "description": "Stocks rose on Wall Street following a better-than-expected report on the U.S. job market. The S&P 500 index rose 1.2% in morning trading Friday. The Dow Jones Industrial Average added 482 points, or 1.1%, and the Nasdaq composite rose 1.4%. U.S. employers slowed their hiring last month, but still added a solid 139,000 jobs amid uncertainty over President Donald Trump’s trade wars. Lululemon Athletica sank after lowering its profit forecast for the full year. Treasury yields rose in the bond market. The yield on the 10-year Treasury note climbed to 4.48%. Markets in Asia were mixed, while markets in Europe rose.",
      "publishedAt": "2025-06-06T03:49:17Z",
      "title": "Stocks gain ground on Wall Street after solid US report",
      "url": "https://apnews.com/article/stocks-markets-musk-china-trump-61087505f58835e3c2e59ff51204f437",
      "urlToImage": "https://dims.apnews.com/dims4/default/336462c/2147483647/strip/true/crop/4991x2807+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F11%2Fcef86da74dde7cc8580b1c259280%2F37c447dbb2c24ebbbf83867eac9dc08d"
    },
    {
      "author": null,
      "description": "President Donald Trump and billionaire Elon Musk are showing no signs of reconciling on Friday, but Republicans are increasingly urging them to settle their dispute. They know what's at stake — a massive tax and border spending bill from the Republican Party that Musk has been railing against for days. Sen. Ted Cruz of Texas says he hopes “that both of them come back together.” Still, the feud between Trump and Musk is probably best described as a moving target. One person familiar with the president’s thinking says Musk wants to speak with Trump, but that the president doesn’t want to do it — or at least, not on Friday.",
      "publishedAt": "2025-06-06T15:27:11Z",
      "title": "Republicans urge Donald Trump and Elon Musk to end their feud",
      "url": "https://apnews.com/article/donald-trump-elon-musk-republicans-tax-border-dc762978d7749c8c39b8f62aba2dd9ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed900ce/2147483647/strip/true/crop/4989x2806+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fac%2Fc6bbcaa66e1e64b26eda04272dfc%2F94e6f38793944735baf9b37055b5636c"
    },
    {
      "author": null,
      "description": "A three-judge appeals court panel ruled against The Associated Press in its continuing bid to restore full access to covering events involving President Donald Trump. The panel granted the president a stay of a lower-court ruling that he had improperly punished the AP for the content of its speech — in this case not renaming the Gulf of Mexico to Trump's liking. Two judges at the U.S. Court of Appeals agreed with Trump's contention that a president has the discretion to invite whatever reporters he wants to cover him in small spaces like the Oval Office, Air Force One or Mar-a-Lago.",
      "publishedAt": "2025-06-07T00:35:27Z",
      "title": "AP gets incremental loss in press-access suit against Trump White House",
      "url": "https://apnews.com/article/trump-administration-white-house-ap-press-freedom-360937fa4adb6bdbdebb58a03a6bfcc5",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6874ed/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2Fb4%2F3776a7c7ab95ec39dc14b40c6bbb%2Fa3a5da8fcc934a3b8aecdd81a041706c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}