{
  "articles": [
    {
      "author": null,
      "description": "A federal court has blocked the Trump administration from sending three Venezuelan immigrants held in New Mexico to Guantanamo Bay Naval Base in Cuba as part of the president’s immigration crackdown. In a legal filing Sunday, lawyers for the men asked the court for a temporary restraining order blocking their transfer, adding that “the mere uncertainty the government has created surrounding the availability of legal process and counsel access is sufficient to authorize the modest injunction.” An attorney for the men says that the court granted the temporary order during a brief hearing a short time later. A message seeking comment was left for ICE.",
      "publishedAt": "2025-02-10T00:53:33Z",
      "title": "Court grants request to block detained Venezuelan immigrants from being sent to Guantanamo",
      "url": "https://apnews.com/article/immigration-detention-guantanamo-venezuela-new-mexico-ice-8fa3d0d5ef2e0a50061aba04f1a13845",
      "urlToImage": "https://dims.apnews.com/dims4/default/0693b43/2147483647/strip/true/crop/4570x2571+0+238/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F6c%2F14c496de581cc2ff0d29f973bc9c%2Fbf73fc44115a4160a02f6c82a5b3ac74"
    },
    {
      "author": "JILL COLVIN",
      "description": "Top Trump administration officials are openly questioning the judiciary’s authority to serve as a check on executive power as the new president’s sweeping agenda faces growing pushback from the courts. Over the last 24 hours, officials ranging from billionaire Elon Musk to Vice President JD Vance, have criticized a federal judge’s decision early Saturday that blocks Musk’s Department of Government Efficiency from accessing Treasury Department records that contain sensitive personal data such as Social Security and bank account numbers for millions of Americans. They have also attacked the legitimacy of judicial oversight, a fundamental pillar of a Democratic system based on a separation of powers.",
      "publishedAt": "2025-02-09T19:59:01Z",
      "title": "Vance and Musk question the authority of the courts as Trump faces pushback",
      "url": "https://apnews.com/article/trump-judiciary-musk-separation-of-powers-balance-checks-069c169ea1ddf6eea76f502d544c4c16",
      "urlToImage": "https://dims.apnews.com/dims4/default/37d59a6/2147483647/strip/true/crop/7159x4027+0+373/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2F25%2Fa2a9943b8165ec42a85ccde6e0c4%2F008abfa6dea640c5b9e24ef670891226"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "President Donald Trump says he'll announce on Monday that the United States will impose 25% tariffs on all steel and aluminum imports, including from Canada and Mexico, as well as other import duties later in the week. He's also reaffirming that he'll announce “reciprocal tariffs” — “probably Tuesday or Wednesday.” That means the U.S. would impose import duties on products in cases where another country has levied duties on U.S. goods. Trump spoke to reporters aboard Air Force One as he flew on Sunday from Florida to attend the Super Bowl in New Orleans.",
      "publishedAt": "2025-02-09T22:02:31Z",
      "title": "Trump says he will announce 25% steel and aluminum tariffs Monday",
      "url": "https://apnews.com/article/trump-steel-aluminum-tariffs-import-duties-74d7bfde0da59e111a45e772d199f2b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0cd7bc/2147483647/strip/true/crop/3000x1688+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2Fb9%2F8d23900ecc1261cc038f96ce30e8%2F771129d26549492dbd10bf7fc70fd76b"
    },
    {
      "author": "JILL COLVIN",
      "description": "President Donald Trump said he is serious about wanting Canada to become the 51st state in an interview that aired Sunday during the Super Bowl preshow. “Yeah it is,” Trump told Fox News Channel’s Bret Baier when asked whether his talk of annexing Canada is “a real thing” — as Canadian Prime Minister Justin Trudeau recently warned. In the interview, Trump also said he has not seen enough action from Canada and Mexico to stave off the tariffs he has threatened to impose. “No, it’s not good enough,” he said of the United States' two largest trading partners. “Something has to happen. It’s not sustainable. And I’m changing it.”",
      "publishedAt": "2025-02-09T22:11:40Z",
      "title": "In Super Bowl interview, Trump says he wants Canada to be 51st state",
      "url": "https://apnews.com/article/canada-gulf-america-super-bowl-bret-baier-musk-7e1959c7d430899b01629c800db6f17b",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e5c069/2147483647/strip/true/crop/7573x4260+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F10%2F8d4c6169c3d207e68ad6d830f154%2F5d2651b7eb764c438e45800ca57c5354"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "The Trump administration has ordered the Consumer Financial Protection Bureau to stop nearly all its work, effectively shutting down the agency that was created to protect consumers after the 2008 financial crisis and subprime mortgage-lending scandal. Russell Vought is the newly installed director of the Office of Management and Budget. Vought directed the CFPB in a Saturday night email to stop work on proposed rules, to suspend the effective dates on any rules that were finalized but not yet effective, and to stop investigative work and not begin any new investigations. The agency has been a target of conservatives since President Barack Obama created it following the 2007-2008 financial crisis.",
      "publishedAt": "2025-02-09T16:08:36Z",
      "title": "Trump official orders consumer protection agency to stop work",
      "url": "https://apnews.com/article/trump-consumer-protection-cease-1b93c60a773b6b5ee629e769ae6850e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/b953726/2147483647/strip/true/crop/5588x3143+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F3b%2F060b1f79df14ceca38d7abf2f9ef%2F150b19a0430743adb1da70f86374ff16"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "Ecuadorians have voted in a presidential election that was shaping up to be a repeat of the 2023 race, when they chose a young, conservative millionaire over the leftist protégée of the country’s most influential president this century. President Daniel Noboa and Luisa González were the clear front-runners in Sunday's election among the pool of 16 candidates. All have promised to reduce the widespread crime that pushed people's lives into an unnerving new normal four years ago. The spike in violence is tied to the trafficking of cocaine from neighboring Colombia and Peru. After polls closed, the National Electoral Council reported that more than 83% of eligible voters cast ballots.",
      "publishedAt": "2025-02-09T07:07:04Z",
      "title": "Ecuador votes for president, with the conservative incumbent and a leftist lawyer in the lead",
      "url": "https://apnews.com/article/ecuador-presidential-election-gonzalez-noboa-correa-crime-3740664e53520a4586a1a8aa96c77d99",
      "urlToImage": "https://dims.apnews.com/dims4/default/49ceb52/2147483647/strip/true/crop/7142x4017+0+669/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F3b%2F30139055e70b8ebf5bbec05fd082%2F9d5198e701ce4ab6a9c6d61369b7de2a"
    },
    {
      "author": "TIA GOLDENBERG, MOHAMMAD JAHJOUH",
      "description": "Israeli officials say Israeli forces have withdrawn from a key Gaza corridor, part of Israel’s commitments under a tenuous ceasefire deal with Hamas. The deal is moving ahead but faces a major test over whether the sides can negotiate its planned extension. Israel agreed as part of the truce to remove its forces from the 4-mile Netzarim corridor, a strip of land that bisects northern Gaza from the south. While the development Sunday signals the agreement is moving ahead, the sides appear to have made little progress on negotiating the deal’s second phase, which is meant to extend the truce and lead to the release of more Israeli hostages held by Hamas.",
      "publishedAt": "2025-02-09T08:29:32Z",
      "title": "Israeli forces withdrawing from Netzarim corridor in Gaza, official says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-09-2025-9c36734cd5175fbb86e6d1dabe3cfc07",
      "urlToImage": "https://dims.apnews.com/dims4/default/79b8ad0/2147483647/strip/true/crop/2579x1451+0+134/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2Fcc%2F074ae0eda455b553e02506d11ff3%2F542d99c95fbc40f2be2318a2e065f071"
    },
    {
      "author": "MEAD GRUVER",
      "description": "U.S. efforts to put carbon dioxide from power plants and industrial facilities underground where they won't contribute to global warming could see less federal support under President Donald Trump although demand for the technology remains high. While vowing to “drill, baby, drill” for fossil fuels, Trump has ordered the U.S. to withdraw from the landmark international Paris climate accord. Meanwhile, some Republicans in Congress look to repeal all or part of the Inflation Reduction Act, which boosted a tax credit for carbon capture and storage. An order this week by Energy Secretary Chris Wright says research will prioritize “affordable, reliable and secure energy” and makes no mention of carbon capture.",
      "publishedAt": "2025-02-09T14:30:08Z",
      "title": "Efforts to put carbon dioxide underground face less support in Trump's second term",
      "url": "https://apnews.com/article/carbon-dioxide-capture-trump-tax-credit-a7290db5557a6f539eb5ba67a677aca0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ad7d33/2147483647/strip/true/crop/7993x4496+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F09%2F6f92423c56749155b6ac250dfd33%2F9db6cde17fb34d0abac252511430bac8"
    },
    {
      "author": "ROB MAADDI",
      "description": "Cooper DeJean, Josh Sweat and the Philadelphia Eagles’ ferocious defense denied Patrick Mahomes, Travis Kelce and the Kansas City Chiefs a Super Bowl three-peat. It wasn’t even close. DeJean got a pick-6 on his 22nd birthday, Sweat tormented Mahomes and the Eagles routed the Chiefs 40-22 on Sunday to secure the franchise’s second Super Bowl championship. Jalen Hurts threw for two touchdowns and ran for a score on a tush push, and Vic Fangio’s defense was so dominant that the Eagles didn’t need much from Saquon Barkley. With Donald Trump becoming the first president in office to attend a Super Bowl, the Eagles outplayed Kansas City in every facet.",
      "publishedAt": "2025-02-10T03:18:44Z",
      "title": "Eagles dominate Chiefs in Super Bowl and roll to 40-22 win",
      "url": "https://apnews.com/article/super-bowl-2025-eagles-chiefs-score-e2ff209c074a00a6faff39750ff048f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/c20ef97/2147483647/strip/true/crop/7729x4348+0+403/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Fbd%2Fc59b7e4d5f69ca0c4fcc30eea7a3%2F8879dee1372345a89f8f3192a114ca5a"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "“Salutations!,” the actor Samuel L. Jackson dressed as Uncle Sam introduced Kendrick Lamar at New Orleans’ Caesars Superdome for the 2024 Super Bowl halftime show. It was a powerful, commanding creative choice by the first solo hip-hop artist to ever headline the coveted slot. As if there were any doubts of the Pulitzer Prize winning rapper’s ability to put on a show. In a review, The Associated Press' Maria Sherman describes Lamar's performance as a continued victory lap. SZA was a previously announced guest performer and frequent Lamar collaborator. Lamar performed his Drake diss track “Not Like Us.\"",
      "publishedAt": "2025-02-10T01:53:20Z",
      "title": "Review: Kendrick Lamar brings America and 'Not Like Us' into history-making Super Bowl halftime show",
      "url": "https://apnews.com/article/super-bowl-2025-halftime-show-review-1dc2bce615ebfba0c8af0ea7c3ce4b9d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7baf86/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fd4%2F122334d2a3e8051b808f2a20a57f%2Fde9a9f1335cf4436a625ff770c3ce373"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}