{
  "articles": [
    {
      "author": "NICOLE WINFIELD",
      "description": "ABOARD THE PAPAL PLANE (AP) — Pope Francis on Friday slammed both U.S. presidential candidates for what he called anti-life policies on abortion and migration, and he advised American Catholics to choose who they think is the “lesser evil” in the upcoming U.S.",
      "publishedAt": "2024-09-13T17:52:47Z",
      "title": "Pope slams both Harris and Trump as 'against life' and urges Catholics to vote for 'lesser evil'",
      "url": "https://apnews.com/0e0faef49ff587098f75b265e386bf22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d8ddff5d6984c7b9aea8a2ed4866fe7/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN and JULIE CARR SMYTH",
      "description": "BOZEMAN, Mont. (AP) — Montana U.S. Sen. Jon Tester has made protecting reproductive freedom for women central to his campaign to remain the sole remaining Democrat to hold statewide elective office in Big Sky Country.",
      "publishedAt": "2024-09-14T04:11:16Z",
      "title": "Embattled Democratic senators steer clear of Kamala Harris buzz but hope it helps",
      "url": "https://apnews.com/e7256dd5dd657f0432c36a5c2d2dc8bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99d59a9c2dee43bb9382c33469069102/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — On the streets of Iranian cities, it's becoming more common to see a woman passing by without a mandatory headscarf, or hijab, as the second anniversary of the death of Mahsa Amini and the mass protests it sparked approaches.",
      "publishedAt": "2024-09-14T05:10:09Z",
      "title": "Women in Iran are going without hijabs as the 2nd anniversary of Mahsa Amini's death approaches",
      "url": "https://apnews.com/59641e9254eea45c069b54d590c7e818",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9faf86fbb5724d18962f446fb8b67f9b/3000.jpeg"
    },
    {
      "author": "YURAS KARMANAU",
      "description": "TALLINN, Estonia (AP) — When school started this year for Mikalay in Belarus, the 15-year-old discovered that his teachers and administrators no longer called him by that name.",
      "publishedAt": "2024-09-14T04:18:49Z",
      "title": "In Belarus, the native language is vanishing as Russian takes prominence",
      "url": "https://apnews.com/bcc4eb1881ca6c93f98ef9951068dde7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f2c63a1e1314abab974fd9bd0efc1b1/2000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and CLAUDIA LAUER",
      "description": "HONOLULU (AP) — The wind pushed flames from house to house as a group of neighbors tried to escape their blazing subdivision, abandoning their cars in a blocked road and running to an industrial outbuilding for safety.",
      "publishedAt": "2024-09-14T04:12:24Z",
      "title": "Hawaii wildfire victims made it just blocks before becoming trapped by flames, report says",
      "url": "https://apnews.com/dc43aa50abb82f79de4ce786f9af510e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7aa8c753a24440818d9d6906be4b991a/1920.jpeg"
    },
    {
      "author": "MATTHEW BARAKAT",
      "description": "ALEXANDRIA, Va. (AP) — It happens in milliseconds, ideally, as you browse the web. Networks of computers and software analyze who you are, what you are looking at and buy and sell the advertisements you see on web pages.",
      "publishedAt": "2024-09-14T04:11:53Z",
      "title": "Going once, going twice: Google's millisecond ad auctions are the focus of monopoly claim",
      "url": "https://apnews.com/0c3516bccd31570301f2c01be7d7c526",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fae9b4bdbfb44ce5880cfd472cb4405e/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Ahead of the 2022 school year, the education technology company 21stCentEd was seeking to expand its presence in New York City's public schools. So they turned to a man, Terence Banks, whose new consulting firm promised to connect clients with top government stakeholders.",
      "publishedAt": "2024-09-13T17:49:09Z",
      "title": "A tech company hired a top NYC official's brother. A private meeting and $1.4M in contracts followed",
      "url": "https://apnews.com/b2369819ff7ccd4e630899eb08538bae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e365628cd5a3450b920bc6a809d69c00/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — Prince Harry was always something different.From the moment he first appeared in public, snuggled in Princess Diana’s arms outside the London hospital where he was born in 1984, Harry was the ginger-haired scamp who stuck his tongue out at photographers.",
      "publishedAt": "2024-09-14T04:40:55Z",
      "title": "Prince Harry's 40th birthday marks the moment the royal scamp moves to middle age",
      "url": "https://apnews.com/fbe182bdfdd76f2020e75c5c18000989",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ced6892f4414e2580f5dcee8e804a88/1764.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Authorities in Mexico's resort-studded Los Cabos area warned tourists and residents alike to stay inside Friday as Tropical Storm Ileana began to pound the southern tip of the Baja California peninsula with rain.",
      "publishedAt": "2024-09-13T17:48:06Z",
      "title": "Tropical Storm Ileana heads toward Los Cabos resorts bringing heavy rains",
      "url": "https://apnews.com/4b1b0c0e683596564a51fae369d5741c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1184dc6444e435ab696012372f78874/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARA",
      "description": "CHALCO, Mexico (AP) — As 56-year-old Juana Salazar Segundo walked through her home in Chalco, a low-income suburb southeast of Mexico City, she recalled how black, reeking water had reached up to her belly button after flooding early last month.",
      "publishedAt": "2024-09-14T04:05:42Z",
      "title": "Residents of Mexico City suburb are anxious after living over a month in black sewage water",
      "url": "https://apnews.com/8ecc2eb4d9fabd5219fe6850de5addf6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e331d875eb4a45cb9368250824d904c1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}