{
  "articles": [
    {
      "author": null,
      "description": "BLACK ROCK DESERT, Nev. (AP) — Muddy roads flooded by a summer storm that left tens of thousands of partygoers stranded for days at the Burning Man counterculture festival had dried up enough by Monday afternoon to allow them to begin their exodus from the northern Nevada desert.",
      "publishedAt": "2023-09-04T16:48:17Z",
      "title": "Burning Man revelers begin exodus after flooding left tens of thousands stranded in Nevada desert",
      "url": "https://apnews.com/0726190c9f8378935e2a3cce7f154785",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ad4140f516b4147a83f23100aa10a36/1920.jpeg"
    },
    {
      "author": "LOU KESTEN",
      "description": "WASHINGTON (AP) — A U.S. official said Monday that North Korean leader Kim Jong Un may travel to Russia soon to meet with President Vladimir Putin as the Kremlin tries to acquire military equipment for use in its war in Ukraine.",
      "publishedAt": "2023-09-04T21:12:00Z",
      "title": "North Korea's Kim Jong Un may meet with Putin in Russia this month, US official says",
      "url": "https://apnews.com/8315ba2a6093dd7a4af99743cfa11c47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a733618366749d3b7d7ff030b6168ed/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — The end of Labor Day weekend would typically mark the start of a furious sprint to the Iowa caucuses as candidates battle for their party's presidential nomination.",
      "publishedAt": "2023-09-05T04:04:04Z",
      "title": "The next presidential campaign is coming into focus. It might look a lot like the last one.",
      "url": "https://apnews.com/c84d0905fd5d238e088618c5ed41c2e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d594fba6506a4e6d9b93f817be34842a/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — First lady Jill Biden tested positive for COVID-19 Monday but is experiencing only mild symptoms, her spokeswoman said.President Joe Biden was tested for the virus following his wife's positive test, but his results were negative.",
      "publishedAt": "2023-09-05T01:15:38Z",
      "title": "First lady Jill Biden tests positive for COVID-19, but President Biden's results negative so far",
      "url": "https://apnews.com/24b43a5009e85ad6dc0524fafcf484ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6420102bbf8498b951c9bbbafbd41a5/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — Men walk through a lush plantation between Ecuador ’s balmy Pacific coast and its majestic Andes, lopping hundreds of bunches of green bananas from groaning plants twice their height.",
      "publishedAt": "2023-09-04T04:21:18Z",
      "title": "Security in Ecuador has come undone as drug cartels exploit the banana industry to ship cocaine",
      "url": "https://apnews.com/6d6529e2b1d8f3cbd16aea74ade0b93d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f8c3bf4be1a4d0f8c7164c5bd2581a9/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — Steve Harwell, the longtime frontman of the Grammy-nominated pop rock band Smash Mouth that was behind the megahit “All Star” has died.",
      "publishedAt": "2023-09-04T16:30:52Z",
      "title": "Smash Mouth frontman Steve Harwell, known for the ubiquitous pop-rock hit 'All Star,' dies at 56",
      "url": "https://apnews.com/868ae1aa513ce66dbf5ef0499c13261a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5afb08d435c943799db0c0660a7098c0/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "PHILADELPHIA (AP) — President Joe Biden, who often says he's the most pro-union president in history, touted the importance of organized labor and applauded American workers in building the economy during a Labor Day appearance in Philadelphia on Monday.",
      "publishedAt": "2023-09-04T10:43:25Z",
      "title": "Biden celebrates unions and job creation during a Philadelphia Labor Day appearance",
      "url": "https://apnews.com/011b5c6b283b60d3b69398f1e081a0d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25cf09bdb5e041a0b96cd55c9dcc83be/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — Aryna Sabalenka is going to be the No. 1 player in the WTA rankings next week, replacing Iga Swiatek there.",
      "publishedAt": "2023-09-04T17:58:47Z",
      "title": "Aryna Sabalenka is about to be No. 1 in the WTA rankings. She could be the new US Open champ, too",
      "url": "https://apnews.com/91207712f437c49b3d4dc2c56fca1270",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47226104b84d4d0099329f5d842bd4af/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin said Monday that a landmark deal allowing Ukraine to export grain safely through the Black Sea amid the war won’t be restored until the West meets Moscow's demands on its own agricultural exports.",
      "publishedAt": "2023-09-04T08:04:09Z",
      "title": "Putin says he won't renew the grain deal until the West meets his demands. The West says it has",
      "url": "https://apnews.com/ac41cb453a6d6c597d543873850414eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cb6484dc8cc440199f379715cce3401/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "Small farms with natural landscape features such as shade trees, hedgerows and tracts of intact forest provide a refuge for some tropical bird populations, according to an 18-year study in Costa Rica.",
      "publishedAt": "2023-09-04T19:31:12Z",
      "title": "Farms with natural landscape features provide sanctuary for some Costa Rica rainforest birds",
      "url": "https://apnews.com/88e767b936138ade5dd45131dd6f341b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a44ec589bf64de5bcf16ee5e9b34634/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}