{
  "articles": [
    {
      "author": "BILL BARROW, STEVE PEOPLES and JILL COLVIN",
      "description": "MILWAUKEE (AP) — Two days after surviving an attempted assassination, former President Donald Trump appeared triumphantly at the Republican National Convention’s opening night with a bandage over his right ear, the latest compelling scene in a presidential campaign already defined by dramatic turns.",
      "publishedAt": "2024-07-16T04:04:51Z",
      "title": "Republican convention to focus on immigration a day after a bandaged Trump makes triumphant entrance",
      "url": "https://apnews.com/d832fedbbd0df0a4fa68f941474c0209",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78369d7cd2084deaab5ac6f759e53fda/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "LAS VEGAS (AP) — President Joe Biden returns to the campaign trail Tuesday for the first time since the attempted assassination of his Republican rival, former President Donald Trump, aiming to sharpen the choice voters will face this November in the wake of the attack.",
      "publishedAt": "2024-07-16T09:03:10Z",
      "title": "Biden is trying to sharpen the choice voters face in November as Republicans meet in Milwaukee",
      "url": "https://apnews.com/3f9386fae612adbb7630bad3c62b683d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/458a864615854a5da3b84be48e7a00df/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, THOMAS BEAUMONT and FARNOUSH AMIRI",
      "description": "MILWAUKEE (AP) — JD Vance is supposed to help Donald Trump win the Midwest this fall.",
      "publishedAt": "2024-07-16T04:12:45Z",
      "title": "JD Vance is a relative political unknown. He's been asked to help Donald Trump avenge his loss",
      "url": "https://apnews.com/5b698796a382d313155476b1ee3b7e8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8810b319381c4881bd448c861c35529f/1920.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — Jarring, chaotic and sudden, the bullet whizzed toward the stage where former President Donald Trump stood behind a podium speaking. In its wake: the potential for a horrifying and tragic chapter in American history.",
      "publishedAt": "2024-07-16T04:10:54Z",
      "title": "Trump's escape from disaster by mere inches reveals a tiny margin with seismic impact",
      "url": "https://apnews.com/1636c4cfc7d8a239bf83b9f64817eab0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f7a9e9e6da54f0c8ac87c4bfbf2f972/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes in the central Gaza Strip overnight into Tuesday killed 24 people, including women and children, according to hospital records, in deadly violence that continues to rage as Israel and Hamas weigh the latest cease-fire proposal.",
      "publishedAt": "2024-07-16T10:16:26Z",
      "title": "Israeli strikes across Gaza kill more than 30 as the sides weigh the latest cease-fire proposal",
      "url": "https://apnews.com/0cff821823185af16fb2ec5ee8e5c986",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb94fb8b0f8947389e4aca1e0b4d235d/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Banglades (AP) — Police fired tear gas and charged with batons during violent clashes between a pro-government student body and student protesters overnight, leaving dozens injured at a public university outside Bangladesh’s capital, authorities and students said Tuesday.",
      "publishedAt": "2024-07-16T04:34:02Z",
      "title": "Violent clashes over government jobs quota system leave scores injured in Bangladesh",
      "url": "https://apnews.com/c3982590332a1639c88a22257e20f7d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a90a4682ea9483da49f4cedd5c06371/3000.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — Heavy rains in eastern Afghanistan have killed at least 40 people and injured nearly 350 others, Taliban officials said Tuesday. Separately, at least 17 died when a bus overturned on a main highway, official media said.",
      "publishedAt": "2024-07-16T08:06:19Z",
      "title": "Forty dead in heavy rains in eastern Afghanistan; 17 killed in bus accident",
      "url": "https://apnews.com/5dc141f0024d44919df5e4496e1dbb55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f27fdb38320a4e06b22010543efe9930/3000.jpeg"
    },
    {
      "author": null,
      "description": "CHICAGO (AP) — Storms spawning multiple tornado reports blew through Iowa, Illinois — including Chicago — and Indiana on Monday, downing trees and power poles and cutting power to more than 460,000 customers and businesses.",
      "publishedAt": "2024-07-16T00:30:51Z",
      "title": "Severe storms with tornado reports whip through Midwest, killing 1, cutting power to 460K",
      "url": "https://apnews.com/949aa0d324988c7920e2c16b2f7a2f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a4d7a80f62e4d838318e3ba9cc6490d/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS and HALELUYA HADERO",
      "description": "NEW YORK (AP) — Amazon Prime Day is here, and experts are reminding consumers to be wary of scams.",
      "publishedAt": "2024-07-16T04:08:48Z",
      "title": "Amazon Prime Day is a big event for scammers, experts warn",
      "url": "https://apnews.com/0059befef607ea6649b119e4ed7c6eae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c0bbc0b32784eb78c79091164eb1eb2/3000.jpeg"
    },
    {
      "author": "TOM NOUVIAN and SUMAN NAISHADHAM",
      "description": "PARIS (AP) — With the Paris Olympics less than two weeks away, a question hangs over the Games: Will the Seine River be clean enough for athletes to swim in?",
      "publishedAt": "2024-07-16T02:05:50Z",
      "title": "Will the Seine be clean enough by the Olympics? Not even the experts know yet",
      "url": "https://apnews.com/abde9a6ba9cc1617df1d0336743ee204",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2832180db034aa781bf0e85ce208fd9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}