{
  "articles": [
    {
      "author": "TIA GOLDENBERG, JON GAMBRELL and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — The White House on Sunday said U.S. President Joe Biden had again spoken with Israeli Prime Minister Benjamin Netanyahu as pressure builds on Israel and Hamas to reach a deal that would free some Israeli hostages and bring a cease-fire in the nearly seven-month-long war in Gaza.",
      "publishedAt": "2024-04-28T08:41:07Z",
      "title": "Biden and Netanyahu speak as pressure's on Israel over planned Rafah invasion and cease-fire talks",
      "url": "https://apnews.com/78410c1eaf671008cd60dccc00b44ee4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3f9f3af5ae84fb0991f98b03c70e762/1920.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON and MARGERY BECK",
      "description": "Protests are roiling college campuses nationwide as schools with graduation ceremonies next month face demands they cut financial ties to Israel because of the Israel-Hamas war.",
      "publishedAt": "2024-04-28T07:50:08Z",
      "title": "Arrests roil campuses nationwide ahead of graduation as protesters demand Israel ties be cut",
      "url": "https://apnews.com/cadbf05cf542c08dc3c664431b7a1f4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68cbf35472b2423f8c9e93862f3b001d/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden is out to win votes by scoring some laughs at the expense of Donald Trump, unleashing mockery with the goal of getting under the former president's thin skin and reminding the country of his blunders.",
      "publishedAt": "2024-04-28T14:03:19Z",
      "title": "Have you heard the one about Trump? Biden tries humor on the campaign trail",
      "url": "https://apnews.com/936815b539a3e541a03db16ba0807c6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0881bf3a342d4698893c2dd1fbd2d7e0/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — As Donald Trump campaigns for a return to the White House, he often reaches back more than 40 years and seven administrations to belittle President Joe Biden by comparing him to 99-year-old Jimmy Carter.",
      "publishedAt": "2024-04-28T11:42:14Z",
      "title": "Donald Trump is running against Joe Biden. But he keeps bringing up another Democrat: Jimmy Carter",
      "url": "https://apnews.com/6d58fb7dee75422ff555239013a6b52f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d696ef2c49884c53807f39a8409105b8/3000.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "SULPHUR, Okla. (AP) — Tornadoes killed four people in Oklahoma and left thousands without power Sunday after a destructive outbreak of severe weather flattened buildings in the heart of one rural town and injured at least 100 people across the state.",
      "publishedAt": "2024-04-28T14:21:02Z",
      "title": "Tornadoes kill 4 in Oklahoma, leaving trail of destruction and thousands without power",
      "url": "https://apnews.com/3106c502a148f7ea969809cbd3b2d6ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5aea33d27133411ca633923be26a034a/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — U.S. intelligence officials have determined that Russian President Vladimir Putin likely didn’t order the death of imprisoned opposition leader Alexei Navalny in February, according to an official familiar with the determination.",
      "publishedAt": "2024-04-28T20:17:20Z",
      "title": "Putin likely didn’t order death of Russian opposition leader Navalny, US official says",
      "url": "https://apnews.com/0ed248bbe00a707b1a1b4ce1d61fcc9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fe1f7dab9324034b11d51d20f646ce9/2985.jpeg"
    },
    {
      "author": "ABDULRAHMAN ZEYAD and QASSIM ABDUL-ZAHRA",
      "description": "BAGHDAD (AP) — Human rights groups and diplomats criticized a law that was quietly passed by the Iraqi parliament over the weekend that would impose heavy prison sentences on gay and transgender people.",
      "publishedAt": "2024-04-28T10:43:47Z",
      "title": "Passage of harsh anti-LGBTQ+ law in Iraq draws diplomatic backlash",
      "url": "https://apnews.com/85e5e55cde7a581631c484ad83b0773c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23d67d4e47924376bb86bd2a31242bb0/1920.jpeg"
    },
    {
      "author": "FARAI MUTSAKA, OMAR FARUK and DESMOND TIRO",
      "description": "HARARE, Zimbabwe (AP) — From ancient fertilizer methods in Zimbabwe to new greenhouse technology in Somalia, farmers across the heavily agriculture-reliant African continent are looking to the past and future to respond to climate change.",
      "publishedAt": "2024-04-28T05:06:18Z",
      "title": "African farmers look to the past and the future to address climate change",
      "url": "https://apnews.com/e0edfba75053cad02097f2e5bfe528fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2a4c18a6c994c2580b6816ba7b7f89c/1920.jpeg"
    },
    {
      "author": "DARREN SANDS",
      "description": "No woman had ever preached the keynote sermon at the Joint National Baptist Convention, a gathering of four historically Black Baptist denominations representing millions of people.That changed in January when the Rev.",
      "publishedAt": "2024-04-28T12:42:09Z",
      "title": "Obstacles remain as women seek more leadership roles in America's Black Church",
      "url": "https://apnews.com/a6801c58fe8609a14d9d2f08e1d2de37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bd65ff3a9ba4330bee22b3fddefe980/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "Candace Parker always said she'd know when it would be time to retire. That day came Sunday.The three-time WNBA champion and two-time Olympic gold medalist announced on social media that her career was over after 16 seasons.",
      "publishedAt": "2024-04-28T18:08:12Z",
      "title": "Candace Parker, a 3-time WNBA champion and 2-time Olympic gold medalist, announces retirement",
      "url": "https://apnews.com/6b28339cc1e21731760e6c0c1902d1b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1137485a57c34b01a1e3ad6ca06e55db/2831.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}