{
  "articles": [
    {
      "author": "MARÍA VERZA and MARK STEVENSON",
      "description": "MEXICO CITY (AP) — Mexico’s projected presidential winner Claudia Sheinbaum will become the first woman president in the country's 200-year history.",
      "publishedAt": "2024-06-02T04:05:32Z",
      "title": "Mexico elects Claudia Sheinbaum as its first woman president",
      "url": "https://apnews.com/d7fef5c7ac964072401ba6d9809dd7d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13157ab5dac84a0da8fa1ca3ed9f5e51/3000.jpeg"
    },
    {
      "author": "SARA ESPAÑA",
      "description": "MEXICO CITY (AP) — Claudia Sheinbaum’s name will go down in Mexican history.The governing party candidate won Mexico’s presidential election on Sunday, a turning point in a mostly conservative nation that for more than two centuries has been exclusively ruled by men.",
      "publishedAt": "2024-06-03T07:40:34Z",
      "title": "The first woman elected to lead Mexico faces pressing gender-related issues",
      "url": "https://apnews.com/b94710ba07324df14714c56589fc55c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e42054e806224dad984594d9edfcedc2/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Palestinian health officials said Israeli strikes killed 11 people overnight into Monday, including a woman and three children, in central Gaza.A strike on a home in the built-up Bureij refugee camp late Sunday killed four people, including the three children.",
      "publishedAt": "2024-06-03T07:26:39Z",
      "title": "The Latest | Israeli strikes in central Gaza kill at least 11 as the US pushes a cease-fire plan",
      "url": "https://apnews.com/4531e5bc3af4b808352a48f5cbe68f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df392271ea6b424c88a60f52b9ab3a5a/3000.jpeg"
    },
    {
      "author": "RANDALL CHASE, CLAUDIA LAUER, MICHAEL KUNZELMAN and COLLEEN LONG",
      "description": "WILMINGTON, Del. (AP) — Jury selection is to begin Monday in a federal gun case against President Joe Biden's son Hunter after the collapse of a deal with prosecutors that would have avoided the spectacle of a trial so close to the 2024 election.",
      "publishedAt": "2024-06-03T04:11:45Z",
      "title": "Jury selection is beginning in a federal gun case against President Joe Biden's son Hunter",
      "url": "https://apnews.com/e2cc8b5d459ad80e5bd7b05c5e9105c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6d08a63538c466fb0763ba6e78687ec/3000.jpeg"
    },
    {
      "author": "MAE ANDERSON, PAUL HARLOFF and BARBARA ORTUTAY",
      "description": "NEW YORK (AP) — The typical compensation package for chief executives who run companies in the S&amp;P 500 jumped nearly 13% last year, easily surpassing the gains for workers at a time when inflation was putting considerable pressure on Americans' budgets.",
      "publishedAt": "2024-06-03T11:01:32Z",
      "title": "CEOs got hefty pay raises in 2023, widening the gap with the workers they oversee",
      "url": "https://apnews.com/fa25db3338b68ad9eb395dfd46190383",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a21ddb2ad94f4961a210fa6cc2215f2a/1920.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — The world’s largest election could also be one of its most consequential. India has close to 970 million voters among its more than 1.4 billion people, and its general election pits Prime Minister Narendra Modi, an avowed Hindu nationalist, against a broad alliance of opposition parties that are struggling to play catch up.",
      "publishedAt": "2024-06-03T05:18:40Z",
      "title": "India's election concludes with the votes being counted Tuesday. Here's what to know",
      "url": "https://apnews.com/510eea0717dec60c10ddc510d82b1ccd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b90a0242171141cca4999998d5e5fb9d/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — Ukrainian President Volodymyr Zelenskyy met with the Philippine president on Monday in a rare Asian trip to urge regional leaders to attend a Swiss-organized global peace summit on the war in Ukraine that he accuses Russia, with China’s help, of trying to undermine.",
      "publishedAt": "2024-06-03T01:28:47Z",
      "title": "Zelenskyy in Manila to promote peace summit, which he says China and Russia are trying to undermine",
      "url": "https://apnews.com/713a05c244d01f1258e3bb4f67ec3b5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca018e9042d14d6b85d7cc5187967c61/3000.jpeg"
    },
    {
      "author": "VALERIE KOMOR",
      "description": "NEW YORK (AP) — When Associated Press correspondent Don Whitehead arrived with other journalists in southern England to cover the Allies' imminent D-Day invasion of Normandy, a U.S.",
      "publishedAt": "2024-06-03T11:23:33Z",
      "title": "How AP covered the D-Day landings and lost photographer Bede Irvin in the battle for Normandy",
      "url": "https://apnews.com/fd4cb6c41e48b2624c3bb85b024bb332",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c518ba503d14251bc4b253e1bc40abc/2809.jpeg"
    },
    {
      "author": "ISABEL DEBRE and ALMUDENA CALATRAVA",
      "description": "BUENOS AIRES, Argentina (AP) — At the base of the sacred Western Wall in Jerusalem’s Old City, President Javier Milei of Argentina appeared to be in a spiritual trance.With head and hands pressed against the ancient stone, he prayed with the Orthodox rabbi who introduced him to Judaism three years ago.",
      "publishedAt": "2024-06-03T04:10:23Z",
      "title": "President Milei's surprising devotion to Judaism and Israel provokes tension in Argentina and beyond",
      "url": "https://apnews.com/d8831369a6bc8a96205d4080d2b2045b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/545e074dd9854cd1932c0bbce2936737/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — The Washington Post said Sunday that its executive editor, Sally Buzbee, has stepped down after three years at the top of one of journalism's most storied brands.She will be replaced by Matt Murray, former editor in chief of The Wall Street Journal, through this fall's presidential election.",
      "publishedAt": "2024-06-03T01:28:57Z",
      "title": "Sally Buzbee steps down as executive editor of The Washington Post",
      "url": "https://apnews.com/705e69a42fe8022ce46205bb06932fb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42bb81d883f4490c98dee085cdee642f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}