{
  "articles": [
    {
      "author": "JULIO CORTEZ, KATE PAYNE and HAVEN DALEY",
      "description": "ST. PETERSBURG, Fla. (AP) — Florida residents slogged through flooded streets, gathered up scattered debris and assessed damage to their homes on Friday after Hurricane Milton smashed through coastal communities and spawned a barrage of deadly tornadoes.",
      "publishedAt": "2024-10-11T04:03:43Z",
      "title": "Residents slog through flooded streets, pick up debris after Hurricane Milton tore through Florida",
      "url": "https://apnews.com/7f60bbe9c6295f2ebef077eca2c1b4e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba6d5f3cddf74f2bbe84e6af5a8dbd7a/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — A pair of unwelcome and destructive guests named Helene and Milton have stormed their way into this year's presidential election.",
      "publishedAt": "2024-10-11T04:05:44Z",
      "title": "Back-to-back hurricanes reshape 2024 campaign’s final stretch",
      "url": "https://apnews.com/f1bf69434656bd693daf316db3842fac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9969f43f78545fe997a81405c14db63/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — An Israeli airstrike killed two Lebanese soldiers and wounded three other troops on Friday, Lebanon's military said, an incident that entangles the country's official army in the escalating conflict between Israel and Iran-backed Hezbollah militants in Lebanon.",
      "publishedAt": "2024-10-11T10:39:43Z",
      "title": "In separate strikes, Israeli forces kill 2 Lebanese soldiers and injure 2 UN peacekeepers",
      "url": "https://apnews.com/9dd58a9fea9c2de963edbc31ba90bb1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/654be871e9aa4cdebaafa6188625fe5f/1920.jpeg"
    },
    {
      "author": "JESSE BEDAYN and ADRIANA GOMEZ LICON",
      "description": "AURORA, Colo. (AP) — Donald Trump is detouring from the battleground states Friday to visit a Colorado suburb that's been in the news over illegal immigration as he drives a message that migrants are causing chaos in smaller American cities and towns, often using false or misleading claims to do so.",
      "publishedAt": "2024-10-11T14:48:51Z",
      "title": "Trump heads to Colorado to drive his anti-immigration message",
      "url": "https://apnews.com/fe8805ec9024cb683a6386bce9f64c70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7d3405169a7460dbaec7b06f62294fa/3000.jpeg"
    },
    {
      "author": "MIKE CORDER and ELENA BECATOROS",
      "description": "The Nobel Peace Prize was awarded Friday to Nihon Hidankyo, a Japanese organization of survivors of the U.S. atomic bombings of Hiroshima and Nagasaki, for its activism against nuclear weapons.",
      "publishedAt": "2024-10-11T08:31:45Z",
      "title": "Nobel Peace Prize given to Japanese organization Nihon Hidankyo for its work against nuclear weapons",
      "url": "https://apnews.com/40c351ed629bd515675a8283c811bc38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03c36d1ba0494020bb108baa5a895272/1920.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — A solid majority of Hispanic women have a positive opinion of Vice President Kamala Harris and a negative view of former President Donald Trump, but Hispanic men are more divided on both candidates, according to a recent poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-10-11T04:04:04Z",
      "title": "Harris viewed more positively by Hispanic women than by Hispanic men: AP-NORC poll",
      "url": "https://apnews.com/d42696a973e0988aed41bab2a46bb4cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8cd0e93ffdd49829c60c0a35bf90eea/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Two U.S. Navy SEALs drowned as they tried to climb aboard a ship carrying illicit Iranian-made weapons to Yemen because of glaring training failures and a lack of understanding about what to do after falling into deep, turbulent waters, according to a military investigation into the January deaths.",
      "publishedAt": "2024-10-11T04:04:54Z",
      "title": "The drownings of 2 Navy SEALs were preventable, military investigation finds",
      "url": "https://apnews.com/78e138486050c9748fc3724347ed230f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c84dcf9836646f1adb429f93fb32054/1236.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Another in a series of unusually strong solar storms hitting Earth produced stunning skies full of pinks, purples, greens and blues farther south than normal, including into parts of Germany, the United Kingdom, New England and New York City.",
      "publishedAt": "2024-10-11T15:54:22Z",
      "title": "What's behind the northern lights that dazzled the sky farther south than normal",
      "url": "https://apnews.com/19418e36587141b83fbba7a4f0d7b474",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a848f969a5c4db39a2098757891f49e/2600.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "FORT WORTH, Texas (AP) — Relatives of some of the 346 people who died in two crashes involving Boeing 737 Max planes are in court Friday, where their lawyers are asking a federal judge to throw out a plea agreement that the aircraft manufacturer struck with federal prosecutors.",
      "publishedAt": "2024-10-11T04:01:36Z",
      "title": "Boeing's lawyers come to court to face relatives of the passengers who died in Boeing Max crashes",
      "url": "https://apnews.com/7b772b2ae171b0e3cb9916d10d05652f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35c85df825c441e884c86e9bd5bbc90a/3000.jpeg"
    },
    {
      "author": "HILARY FOX",
      "description": "LONDON (AP) — Once again, Austin Stowell is having the best day ever — all thanks to him winning the role of legendary TV character Leroy Jethro Gibbs in “NCIS: Origins.”“Since I got this job, it has just been day after day after day of the greatest day of my life,” says Stowell, smiling.",
      "publishedAt": "2024-10-11T12:21:38Z",
      "title": "Austin Stowell is emotional about playing stoic Jethro Gibbs in 'NCIS: Origins'",
      "url": "https://apnews.com/2273dad6a6589ff82096536ca2e11f98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57a69859a4744821ae6ec57e410a6dcf/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}