{
  "articles": [
    {
      "author": "SEUNG MIN KIM and COLLEEN LONG",
      "description": "WASHINGTON (AP) — The White House is considering using provisions of federal immigration law repeatedly tapped by former President Donald Trump to unilaterally enact a sweeping crackdown at the southern border, according to three people familiar with the deliberations.",
      "publishedAt": "2024-02-22T01:06:40Z",
      "title": "White House weighing executive actions on the border — with immigration powers used by Trump",
      "url": "https://apnews.com/f0ca943f0f148e165bc6e8ebfd149f14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae234682a6f14ae58548b950df3d87ff/2117.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "From the earliest days of the Israel-Hamas war, the United States and much of the international community have pressed Israel to allow more humanitarian aid into the Gaza Strip.",
      "publishedAt": "2024-02-21T19:16:49Z",
      "title": "Why isn't desperately needed aid reaching Palestinians in Gaza?",
      "url": "https://apnews.com/1ce556a8a839803c8a1624b1b69b0a13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f54ea39872e40a6bf0661c5530ba986/3000.jpeg"
    },
    {
      "author": "FRANK BAJAK and DAKE KANG",
      "description": "Chinese police are investigating an unauthorized and highly unusual online dump of documents from a private security contractor linked to the nation's top policing agency and other parts of its government — a trove that catalogs apparent hacking activity and tools to spy on both Chinese and foreigners.",
      "publishedAt": "2024-02-21T19:29:41Z",
      "title": "An online dump of Chinese hacking documents offers a rare window into pervasive state surveillance",
      "url": "https://apnews.com/aac38c75f268b72910a94881ccbb77cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87e1ff6f878742c58e935429ba8de08a/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Alabama's largest hospital paused in vitro fertilization treatments Wednesday as providers and patients across the state scrambled to assess the impact of a court ruling that said frozen embryos are the legal equivalent of children.",
      "publishedAt": "2024-02-21T20:48:13Z",
      "title": "Alabama hospital puts pause on IVF in wake of ruling saying frozen embryos are children",
      "url": "https://apnews.com/4cf5d3139e1a6cbc62bc5ad9946cc1b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8990ee5efaab450b940da1e6a39bf8d1/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The explosive allegations at the center of an impeachment inquiry into President Joe Biden were false, federal prosecutors said, and came from an ex-FBI informant who said he was in touch with Russian intelligence.",
      "publishedAt": "2024-02-21T21:31:32Z",
      "title": "How is an ex-FBI informant charged with lying about Bidens allegedly linked to Russian intelligence?",
      "url": "https://apnews.com/ec37a35b808ffedf257bb3cfb3fc9ce2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6c857c92be344628e5ab75dc98da544/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — Donald Trump's legendary ability to raise massive sums of political cash may be on a collision course with a new and unpleasant reality.",
      "publishedAt": "2024-02-21T21:09:41Z",
      "title": "Trump faces warning signs that his fundraising prowess may have limits in 2024 campaign",
      "url": "https://apnews.com/07c9bafaaa5d4f27d93dbda3bd2624ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ffd6ca058324505ab301266f4e2fd0b/3000.jpeg"
    },
    {
      "author": null,
      "description": "LA PARAGUA, Venezuela (AP) — The collapse of an illegally operated open-pit gold mine in central Venezuela killed at least 14 people and injured several more, state authorities said Wednesday, as some other officials reported an undetermined number of people could be trapped.",
      "publishedAt": "2024-02-21T18:04:59Z",
      "title": "At least 14 confirmed dead after an illegal open-pit gold mine collapses in Venezuela",
      "url": "https://apnews.com/31d40848d930906d1f592117058e71b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc6f5ad498754611be521a9cc320920a/1920.jpeg"
    },
    {
      "author": "JULIE WATSON",
      "description": "SAN DIEGO (AP) — China plans to send a new pair of giant pandas to the San Diego Zoo, renewing its longstanding gesture of friendship toward the United States after nearly all the iconic bears on loan to U.S.",
      "publishedAt": "2024-02-22T04:03:28Z",
      "title": "China plans to send San Diego Zoo more pandas this year, reigniting its panda diplomacy",
      "url": "https://apnews.com/6976587ee9992c861d9a56db0cb1ff89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cf9d98f2c824c48bc3a22a4a7c4a584/2000.jpeg"
    },
    {
      "author": null,
      "description": "SEATTLE (AP) — Boeing said Wednesday that the head of its 737 jetliner program is leaving the company in an executive shake-up weeks after a door panel blew out on a flight over Oregon, renewing questions about safety at the company.",
      "publishedAt": "2024-02-21T19:17:15Z",
      "title": "Boeing ousts head of 737 jetliner program weeks after panel blowout on a flight over Oregon",
      "url": "https://apnews.com/fafcceb3a58aaded9c3afe96cf7a9fce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/969b8d60f89d47279c102c66ef4b8026/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "For as long as schools have policed hairstyles as part of their dress codes, some students have seen the rules as attempts to deny their cultural and religious identities. Nowhere have school rules on hair been a bigger flashpoint than in Texas, where a trial this week is set to determine whether high school administrators can continue punishing a Black teenager for refusing to cut his hair.",
      "publishedAt": "2024-02-21T15:48:01Z",
      "title": "Schools say dress codes promote discipline. But many Black students see traces of racism",
      "url": "https://apnews.com/c70448fd65670eed79ca902e30834b41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47c4616b818f42cea7ed152315dee867/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}