{
  "articles": [
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "RAFAH, Gaza Strip (AP) — The head of a Gaza City hospital that treated some of the Palestinians wounded in the bloodshed surrounding an aid convoy said Friday that more than 80% had been struck by gunfire, suggesting there was heavy shooting by Israeli troops.",
      "publishedAt": "2024-03-01T14:55:46Z",
      "title": "Gaza doctor says gunfire accounted for 80% of the wounds at his hospital from aid convoy bloodshed",
      "url": "https://apnews.com/86ab114fc0036d0b4fa5a69ed21964c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3add734fc214229b2fadfbe6f35e008/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Nabela thought the United Nations school in Gaza City was a safe haven.",
      "publishedAt": "2024-03-02T05:02:22Z",
      "title": "'They wanted to humiliate us.' Palestinian women detained by Israel allege abuse in Israeli custody",
      "url": "https://apnews.com/51d4727a1365b9e06198579c3eb856f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15fff6301009452684e64b0d94fb7ccb/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "More delegates are up for grabs Saturday as former President Donald Trump looks to get closer to clinching the Republican nomination and former U.N.",
      "publishedAt": "2024-03-02T05:08:05Z",
      "title": "Republicans in Idaho, Missouri and Michigan will meet to weigh in on the presidential race",
      "url": "https://apnews.com/5d3934acc54d6919427cfb025002f15c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdd48940890b4cc3b52b86bdbf845b3b/2400.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — Ukrainian drones fly without ammunition. Russian artillery unleash deadly volleys from safe positions beyond the range of Kyiv's troops. Shortages of ammo and supplies are resulting in lost ground to Moscow, U.S.",
      "publishedAt": "2024-03-02T05:08:33Z",
      "title": "Ukrainian troops are rationing ammo. But House Republicans plan to take weeks to consider aid",
      "url": "https://apnews.com/53db93c5db8ab249503e93b558da5bd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c35effacca4449a28a5114f6034e2816/3000.jpeg"
    },
    {
      "author": "SCOTT SONNER",
      "description": "RENO, Nev. (AP) — A powerful blizzard raged overnight into Saturday in the Sierra Nevada as the biggest storm of the season shut down a long stretch of Interstate-80 in California and gusty winds and heavy rain hit lower elevations, leaving tens of thousands of customers without power.",
      "publishedAt": "2024-03-02T08:01:57Z",
      "title": "Powerful storm in California and Nevada shuts interstate and dumps snow on mountains",
      "url": "https://apnews.com/d3da8b2ecfca73e2f885d88a83138ac7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f10639ba2e5427e997a6a47e7b87566/3000.jpeg"
    },
    {
      "author": "DAVID KEYTON",
      "description": "STOCKHOLM (AP) — Sweden's last war ended in 1814, and when the rifles and cannons it aimed at Norway fell silent, the once-warring power would not take up arms again.",
      "publishedAt": "2024-03-02T05:05:51Z",
      "title": "As Sweden joins NATO, it bids farewell to more than two centuries of neutrality",
      "url": "https://apnews.com/74ae8d15b2e27f9467634d7cde414625",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58fa0d17315f4d06bb40b849478df256/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "BETHEL, N.Y. (AP) — Woodstock didn't even happen in Woodstock.The fabled music festival, seen as one of the seminal cultural events of the 1960s, took place 60 miles (96.5 kilometers) away in Bethel, New York, an even smaller village than Woodstock.",
      "publishedAt": "2024-03-02T05:06:58Z",
      "title": "Peace, music and memories: As the 1960s fade, historians scramble to capture Woodstock's voices",
      "url": "https://apnews.com/b01faae2d19d38e28180c98146891c30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb6cdf691f78496ea6ff1ce48710be25/3000.jpeg"
    },
    {
      "author": "BABA AHMED",
      "description": "DAKAR, Senegal (AP) — Gueva Ba tried to reach Europe by boat 11 times from Morocco, failing each attempt.",
      "publishedAt": "2024-03-02T06:11:23Z",
      "title": "In Senegal's capital, Nicaragua is a hot ticket among travel agents as migrants try to reach US",
      "url": "https://apnews.com/02a14204c050961157e3c21662a7921c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d60797a4f4304d4b8bc8bfeac8fd8fc4/3000.jpeg"
    },
    {
      "author": "CÉSAR BARRETO",
      "description": "PIURA, Peru (AP) — Residents of Pedregal Grande, a poor neighborhood in the Peruvian city of Piura, receive water for only 30 minutes a day because of shortages, forcing them to collect it in plastic tanks that have become breeding grounds for mosquitoes.",
      "publishedAt": "2024-03-01T23:25:37Z",
      "title": "Dengue cases in Peru are surging, fueled by mosquitoes and high temperatures brought by El Niño",
      "url": "https://apnews.com/377507e8ced020f770d8fd9f36925321",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0594b425efe4ab49b9b1a5a3f2d1720/3000.jpeg"
    },
    {
      "author": "JEFF McMURRAY",
      "description": "Street parking was already scarce in Hoboken, New Jersey, when the death of an elderly pedestrian spurred city leaders to remove even more spaces in a bid to end traffic fatalities.For seven years now, the city of nearly 60,000 people has reported resounding success: Not a single automobile occupant, pedestrian or bicyclist has died in a traffic crash since January 2017, elevating Hoboken as a national model for roadway safety.",
      "publishedAt": "2024-03-02T05:02:21Z",
      "title": "A New Jersey city that limited street parking hasn’t had a traffic death in 7 years",
      "url": "https://apnews.com/007dec67706c1c09129da1436a3d9762",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/106949e8186f4dd5b36c00bb28f0b44c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}