{
  "articles": [
    {
      "author": "ADRIANA GOMEZ LICON and ALANNA DURKIN RICHER",
      "description": "MIAMI (AP) — The property manager of Donald Trump’s Mar-a-Lago estate made his first court appearance on Monday on charges in the classified documents case against the former president but did not enter a plea because he has not found a Florida-based attorney to represent him.",
      "publishedAt": "2023-07-31T04:11:39Z",
      "title": "Mar-a-Lago manager De Oliveira makes his first court appearance in Trump's classified documents case",
      "url": "https://apnews.com/f7e6879fe80e96a321b46279b150bdf9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2191ab0a6f94056841d3a4d070b7744/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "At about summer's halfway point, the record-breaking heat and weather extremes are both unprecedented and unsurprising, hellish yet boring in some ways, scientists say.",
      "publishedAt": "2023-07-31T15:08:11Z",
      "title": "Here's how hot and extreme the summer has been, and it's only halfway over",
      "url": "https://apnews.com/c36078efbcba515a4c67b7d9d0bbb9fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c9c5a925a764cf99308218354035224/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "BOISE, Idaho (AP) — Idaho mother Lori Vallow Daybell has been sentenced to life in prison without parole Monday in the murders of her two youngest children and a romantic rival in a case that included bizarre claims that her son and daughter were zombies and that she was a goddess sent to usher in the Biblical apocalypse.",
      "publishedAt": "2023-07-31T04:04:47Z",
      "title": "Idaho mom Lori Vallow Daybell sentenced in deaths of 2 children and her romantic rival",
      "url": "https://apnews.com/1e0a1cfa1f4e67b4dbb7b43cba86156d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9ed8713f3884f4eb9bdbbf42ffc72b7/1920.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — A man who was a Princeton University student when the FBI arrested him on charges related to the U.S. Capitol riot pleaded guilty on Monday to joining a mob's attack on police officers during one of the most violent clashes on Jan.",
      "publishedAt": "2023-07-31T19:57:35Z",
      "title": "Princeton University student pleads guilty to joining mob's attack on Capitol",
      "url": "https://apnews.com/f1910bb8aeef29556ce8af82cae4cd5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91907b432a164125a5c1d99103936090/2318.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — The National Institutes of Health is beginning a handful of studies to test possible treatments for long COVID, an anxiously awaited step in U.S. efforts against the mysterious condition that afflicts millions.",
      "publishedAt": "2023-07-31T16:01:31Z",
      "title": "Brain fog and other long COVID symptoms are the focus of new small treatment studies",
      "url": "https://apnews.com/d5ac01c9f4209691ddcd7a1b5c78353e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d256e5d5d9b4d91a894d277250e03e0/1592.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Paul Reubens, the actor and comedian whose Pee-wee Herman character — an overgrown child with a tight gray suit and an unforgettable laugh — became a 1980s pop cultural phenomenon, has died at 70.",
      "publishedAt": "2023-07-31T17:28:27Z",
      "title": "Pee-wee Herman actor and creator Paul Reubens dies from cancer at 70",
      "url": "https://apnews.com/616484f62a62c4ac3e0cc46b02376dd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/995c593b859b41db8fc3f3c1f0580058/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — President Joe Biden has decided to keep U.S. Space Command headquarters in Colorado, overturning a last-ditch decision by the Trump administration to move it to Alabama and ending months of politically fueled debate, according to senior U.S.",
      "publishedAt": "2023-07-31T19:39:32Z",
      "title": "Biden has decided to keep Space Command in Colorado, rejecting move to Alabama, officials tell AP",
      "url": "https://apnews.com/382b12b57733848fd1d083227aefa0bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/949986ddfa0c4fb0b290073f01c89027/3000.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — Israel's Supreme Court said Monday that a full panel of 15 justices would hear petitions in September against a contentious law that was passed last week by Prime Minister Benjamin Netanyahu's government and which has spurred mass protests.",
      "publishedAt": "2023-07-31T15:42:12Z",
      "title": "Israel's full high court to hear petitions against judiciary law in September that spurred protests",
      "url": "https://apnews.com/b729744a8ca640c9ae853a939dc0e750",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91c79fbfbd6d43bc99cb87df5f5c76e8/3000.jpeg"
    },
    {
      "author": "ANWARULLAH KHAN and RIAZ KHAN",
      "description": "KHAR, Pakistan (AP) — An Afghan branch of Islamic State on Monday claimed responsibility for a suicide bombing in Pakistan that killed at least 54 people at a pro-Taliban party's election rally, in one of the region's worst attacks in recent years.",
      "publishedAt": "2023-07-31T07:19:03Z",
      "title": "IS claims responsibility for the bombing that killed 54 at a pro-Taliban election rally in Pakistan",
      "url": "https://apnews.com/21bc29f3d7c3e75cd5ea9ade1d8d0cd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f579cd02ce1c4607a061c3728746fb95/1920.jpeg"
    },
    {
      "author": "BY WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Trucking company Yellow Corp. has shut down operations and is headed for a bankruptcy filing, according to the Teamsters Union and multiple media reports.",
      "publishedAt": "2023-07-31T13:03:28Z",
      "title": "Yellow is shutting down and headed for bankruptcy, the Teamsters Union says. Here's what to know",
      "url": "https://apnews.com/f041c94fde4c8766e1feed2294ef7acc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5456913bbfc14c64af8118e1ca8f283a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}