{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, PHILIP MARCELO and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — The prosecution's star witness has yet to take the stand in Donald Trump's hush money trial.",
      "publishedAt": "2024-05-03T04:05:51Z",
      "title": "Michael Cohen hasn't taken the stand in Trump's hush money trial. But jurors are hearing his words",
      "url": "https://apnews.com/f4f26333698f3a5ed73943ff805734b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/152f9c3598ce4714acca5cdde4c64020/3000.jpeg"
    },
    {
      "author": "JULIE WATSON, CHRISTOPHER L. KELLER, CAROLYN THOMPSON and STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — Police have arrested nearly 2,200 people during pro-Palestinian protests at college campuses across the United States in recent weeks, sometimes using riot gear, tactical vehicles and flash-bang devices to clear tent encampments and occupied buildings.",
      "publishedAt": "2024-05-03T04:17:15Z",
      "title": "Nearly 2,200 people have been arrested during pro-Palestinian protests on US college campuses",
      "url": "https://apnews.com/df5f7cf1547a3ca8fb959b992d6ebe1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0366565317a040f5ac3c57d4da004bb6/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The United Nations humanitarian aid agency says hundreds of thousands of people would be “at imminent risk of death” if Israel carries out a military assault in the southern Gaza city of Rafah.The city has become critical for humanitarian aid and is highly concentrated with displaced Palestinians.",
      "publishedAt": "2024-05-03T07:40:08Z",
      "title": "The Latest | A Rafah incursion would put hundreds of thousands of lives at risk, UN aid agency says",
      "url": "https://apnews.com/fd7d9c386b70d8e175b3e55a999a9e1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3747a1a7ac604b68b53c0a4612bafa75/3000.jpeg"
    },
    {
      "author": "ANITA SNOW and MORGAN LEE",
      "description": "PHOENIX (AP) — Arizona Gov. Katie Hobbs' signing of the repeal of a Civil War-era ban on nearly all abortions was a stirring occasion for the women working to ensure that the 19th century law remains in the past.",
      "publishedAt": "2024-05-03T05:20:16Z",
      "title": "Arizona governor's signing of abortion law repeal follows political fight by women lawmakers",
      "url": "https://apnews.com/d617843b7616c5c7f8a55424fd52dfa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6be89a129b684b4d8e19c5cd4aeb1092/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "From its earliest days, the Soviet Union's intelligence services — whether known as the Cheka or by the names of any of its successor agencies like the KGB — kept the government in power by pursuing its opponents no matter where they lived.",
      "publishedAt": "2024-05-03T04:17:31Z",
      "title": "For decades, Moscow has sought to silence its critics abroad",
      "url": "https://apnews.com/87ca5d9c1ebfbdcf517f4b4da2270794",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/639256c9ee8045acacfc74680ec2e1d1/3000.jpeg"
    },
    {
      "author": "PAN PYLAS",
      "description": "LONDON (AP) — Britain's governing Conservative Party suffered heavy losses in local election results Friday, further cementing expectations that the Labour Party will return to power after 14 years in a U.K.",
      "publishedAt": "2024-05-03T05:52:50Z",
      "title": "UK's governing Conservatives set for historic losses in local polls as Labour urges general election",
      "url": "https://apnews.com/71b0348dc6057513bb73f32385039df4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2654a935709e4917aa0062f093fbff82/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — The American economy likely delivered another solid hiring gain in April, showing continuing durability in the face of the highest interest rates in two decades.The Labor Department is expected to report Friday that employers added a healthy 233,000 jobs last month, down from a sizzling 303,000 in March but still a decidedly healthy total, according to a survey of forecasters by the data firm FactSet.",
      "publishedAt": "2024-05-03T04:01:20Z",
      "title": "US jobs report for April will likely point to a slower but still-strong pace of hiring",
      "url": "https://apnews.com/07a321981752503e5299882805ed36c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac13ee0ef1a04f05a0a229e8b7df8f5f/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — He's visiting Manhattan construction sites, decrying local crime and holding court in his gilded Fifth Avenue penthouse.After a years-long breakup with his hometown, Donald Trump is back in New York, this time as a criminal defendant.",
      "publishedAt": "2024-05-03T04:03:01Z",
      "title": "New York made Donald Trump and could convict him. But for now, he's using it to campaign",
      "url": "https://apnews.com/56fd4f4bb7562772c701a2acab76e9fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f07aa639ea34c95a840198cd2ac6fcf/3000.jpeg"
    },
    {
      "author": "ED WHITE and ISABELLA VOLMERT",
      "description": "ANN ARBOR, Mich. (AP) — With student protests over the Israel-Hamas war disrupting campuses nationwide, several major universities are intent on ensuring that commencement ceremonies — joyous milestones for graduates, their families and friends — go off without a hitch this weekend.",
      "publishedAt": "2024-05-03T04:08:46Z",
      "title": "Universities take steps to prevent pro-Palestinian protest disruptions of graduation ceremonies",
      "url": "https://apnews.com/5934cf1eb3554fe9847246649fb25216",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3ad61043a4a4439988daad802a088b7/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "CHENGDU, China (AP) — In 2018, the censors who oversee Chinese media issued a directive to the nation's entertainment industry: Don't feature artists with tattoos and those who represent hip-hop or any other subculture.",
      "publishedAt": "2024-05-03T04:40:06Z",
      "title": "A Chinese flavor of rap music is flourishing as emerging musicians find their voices",
      "url": "https://apnews.com/9b8290afb920328c13a7c09147bca796",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe7132e394984c21acf886d7f521981e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}