{
  "articles": [
    {
      "author": "Mari Yamaguchi, Didi Tang",
      "description": "Among all U.S. allies being wooed by Beijing in its tariff stare-down with Washington, Japan stands out as a peculiar case. That's not only for its staunch commitment to its alliance with the U.S. but also for its complicated and uneasy history with its neighboring Asian giant, particularly the war history from the 20th century that overshadows politics of today. Its senior officials are visiting Washington and Beijing as Tokyo seeks a delicate balance, while its prime minister recently traveled to Vietnam and the Philippines in a rivalry with Beijing.",
      "publishedAt": "2025-05-06T01:00:55Z",
      "title": "Threatened by Trump tariffs, Japan walks a tightrope between US and China",
      "url": "https://apnews.com/article/china-beijing-tariff-trump-xi-japan-1c9c669951146e9bee9c3563293dd694",
      "urlToImage": "https://dims.apnews.com/dims4/default/418e213/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F80%2F9abc2dd31eec680ce45f9c72cca7%2F65ad504a49af4059a1455d5ed6da3954"
    },
    {
      "author": "Tia Goldenberg",
      "description": "An Israeli official says Cabinet ministers have approved plans to intensify military operations in the Gaza Strip. The official said the plan was gradual and involved claiming more territory in the Palestinian enclave. The approval comes a day after Israel announced it was calling up tens of thousands of reservist for the expanded operations in Gaza, which Israel says are meant to increase pressure on the militant Hamas group to negotiate a ceasefire that better aligns with Israel’s terms. An eight-week ceasefire with the Hamas militant group collapsed in March when Israel resumed strikes in Gaza, killing hundreds of Palestinians, many of them women and children.",
      "publishedAt": "2025-05-05T05:26:52Z",
      "title": "Israel approves plans to intensify Gaza operations, official says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-05-2025-d22caabfd2cf89e83fe06e649e6438ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f14842/2147483647/strip/true/crop/3070x1727+0+160/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fb8%2F587422fe1fb2df6a5e1e55ec7f56%2Fa243f78be02e4bd595d740fc8841d116"
    },
    {
      "author": "Melanie Lidman, Samy Magdy",
      "description": "Israel’s military says it has carried out airstrikes against Houthi rebels in Yemen’s Red Sea city of Hodeida, a day after the Iranian-backed rebels launched a missile that hit Israel’s main airport. The rebels’ media office said the United States and Israel launched at least six strikes Monday afternoon that hit the crucial Hodeida port. The rebels said other strikes hit a cement factory in the Bajil district in Hodeida province. On Sunday, a missile launched by Iranian-backed rebels in Yemen briefly halted flights and commuter traffic at Israel’s main international airport. Four people were lightly injured. It was the first time a missile struck the grounds of Israel’s airport since the start of the war.",
      "publishedAt": "2025-05-05T18:08:51Z",
      "title": "Israel launches airstrikes on Yemen a day after Houthi rebels strike Israeli airport",
      "url": "https://apnews.com/article/israel-airstrikes-houthi-rebels-airport-ea0ea0ca695a3a07c71c18bedc987c3e",
      "urlToImage": "https://dims.apnews.com/dims4/default/6006415/2147483647/strip/true/crop/5148x2896+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F22%2Fab72256e1d38edb8fc5c623d0767%2Fbdefc24a659844dc9b54fe7960b336e1"
    },
    {
      "author": "Lisa Mascaro",
      "description": "Congress is drafting President Donald Trump’s big bill of tax breaks, spending cuts and beefed-up border security and deportation funds. But there’s still a lot of work to do, with \"bumps in the road,\" in the words of Republican Jason Smith, the chairman of the House Ways and Means Committee. The tax cuts portion is still a work in progress, as are the reductions in Medicaid and other mainstay government programs. House Speaker Mike Johnson’s goal is to pass the package out of his chamber by Memorial Day. Mostly, the Republicans in Congress have made progress on spending, adding some $350 billion to the Pentagon and Homeland Security.",
      "publishedAt": "2025-05-06T04:01:18Z",
      "title": "What's in the big bill that Republicans are crafting to meet Trump's agenda",
      "url": "https://apnews.com/article/trump-big-bill-tax-cuts-medicaid-1c893945b416419d806dacb6d24b895a",
      "urlToImage": "https://dims.apnews.com/dims4/default/0cb6de9/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2Fb1%2F96bb731808e660012ee4e5a93a45%2Fd606a2816c96457d9a1739f1f8dc3cc5"
    },
    {
      "author": "Nicole Winfield",
      "description": "Cardinals electing a new pope have some fundamental questions to weigh, beyond whether to give the Catholic Church its first Asian or African pope. Despite hailing from 70 different countries, the 133 cardinals seem fundamentally united in finding a pope who will be able to make the 2,000-year-old church credible and relevant today, especially to young people. That's a tall task, given the sexual abuse and financials scandals that have sullied the church’s reputation. Add to that the Holy See’s dire financial state and often-dysfunctional bureaucracy, and the job of being pope in the 21st century seems almost impossible. As Cardinal William Seng Chye Goh of Singapore put it: “We need a superman!”",
      "publishedAt": "2025-05-06T05:00:36Z",
      "title": "Beyond a possible Asian or African pope, what are the priorities of the cardinals in the conclave?",
      "url": "https://apnews.com/article/conclave-pope-election-vatican-cardinals-6038362e418d3194848229811c2d1a2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f01703a/2147483647/strip/true/crop/9178x5163+0+478/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fec%2F5755c6df5e812cb4bd11d14273f9%2Fafb8f3590e98424791c7c3b80ac039b2"
    },
    {
      "author": "Aijaz Hussain, Sheikh Saaliq, Rajesh Roy",
      "description": "Indian Prime Minister Narendra Modi’s administration has governed Kashmir with an iron fist in recent years. The government has claimed militancy in the region was in check and a tourism influx was a sign of normalcy returning. Those claims now lie shattered after a deadly attack on tourists killed 26 Indian Hindu men. India has described the April 22 massacre as a terror attack and blamed Pakistan for backing it. The accusation is denied by Islamabad. Security experts and former military officials say Modi’s government missed warning signs. The government acknowledged that in a rare admission. The assailants are still on the run even as calls in India for military action against Pakistan are growing.",
      "publishedAt": "2025-05-06T03:01:12Z",
      "title": "India’s Modi touted all was well in restive Kashmir. A tourist massacre shatters the claim",
      "url": "https://apnews.com/article/kashmir-india-pakistan-tourist-attack-pahalgam-1089607a2c148eff059ca1052fe86aad",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b1789d/2147483647/strip/true/crop/6384x3591+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2F1d%2F0f721a87566092b1d9dfb6ca7f86%2F6d997ded88e043edaa6a06d87ca0bec5"
    },
    {
      "author": "Tara Copp",
      "description": "Defense Secretary Pete Hegseth is directing the active duty military to shed 20% of its four-star general officers. The deep cuts are part of what the Trump administration says is an effort to promote efficiency but that critics worry could result in a more politicized force. Hegseth also is telling the National Guard to shed 20% of its top positions. In a memo dated Monday, he said the cuts will remove “redundant force structure to optimize and streamline leadership.” The Pentagon is under pressure to slash spending and personnel as part of the broader federal government cuts pushed by President Donald Trump and ally Elon Musk’s Department of Government Efficiency.",
      "publishedAt": "2025-05-05T20:45:12Z",
      "title": "Hegseth directs 20% cut to top military leadership positions",
      "url": "https://apnews.com/article/hegseth-pentagon-cuts-dd2107dff617951b0edf6ca86074d836",
      "urlToImage": "https://dims.apnews.com/dims4/default/6a41de8/2147483647/strip/true/crop/5380x3026+0+280/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F88%2Fd227a60a874922f34cdc8ed33ce8%2F98874e0817964671a21436b0afe73e91"
    },
    {
      "author": "Kirsten Grieshaber, Vanessa Gera",
      "description": "A German organization is painstakingly searching for fallen German soldiers in order to identify them and rebury them, 80 years after World War II. The German War Graves Commission works to exhume and rebury the dead with dignity — regardless of the army they served. There are more than 2 million German soldiers still unaccounted for. The effort continues across former battlefields, including in Ukraine. The Volksbund sees the work as a moral obligation, even as most families are no longer actively searching for lost relatives. The ongoing recovery of the dead underscores how much remains unresolved as the world marks the 80th anniversary of the war’s end.",
      "publishedAt": "2025-05-06T05:05:22Z",
      "title": "80 years after World War II, Germany is still painstakingly searching for its fallen soldiers",
      "url": "https://apnews.com/article/german-soldiers-burial-world-war-ii-010883431217f21ac967be99a54a11ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/4cfb357/2147483647/strip/true/crop/6357x3576+0+331/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2Fef%2F9ebb20dd9201b011f51870684bf7%2Fd9e1348c70f34a2a85b7c6ac982bda1e"
    },
    {
      "author": "Leanne Italie",
      "description": "Rihanna has shut down the rain-soaked Met Gala in a Marc Jacobs menswear-inspired look with a pinstripe jacket as a bustle. Many in the starry crowd stayed true to the menswear theme of fashion’s biggest night. Janelle Monáe epitomized the night’s theme, the Black dandy, in exaggerated pinstripes by Thom Browne. Lauryn Hill honored menswear in a butter yellow suit with exaggerated tailoring that screamed Black power. Doja Cat donned a Marc Jacobs bodysuit, while Teyana Taylor went for a stunning Zoot Suit look. The gala raises the bulk of the annual budget for the Metropolitan Museum of Art’s Costume Institute and this year took in a record haul: $31 million.",
      "publishedAt": "2025-05-05T04:00:06Z",
      "title": "Met Gala best looks: Celebs pay tribute to Black fashion",
      "url": "https://apnews.com/article/met-gala-2025-fashion-stream-93414e556eed355b14863e6bec9c296f",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f3f739/2147483647/strip/true/crop/3642x2049+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F73%2Ff5b0eb6f7b0c3d10fa91b2206297%2F22217477305b44f4a5659cfce904849a"
    },
    {
      "author": "Wyatte Grantham-Philips",
      "description": "President Donald Trump is threatening to levy all films made outside the U.S. at a steep rate of 100%. Over the weekend, Trump accused other countries of “stealing the movie-making capabilities” of the U.S. and said that he had authorized the Commerce Department and the U.S. Trade Representative to “immediately begin the process.\" But further specifics or dates weren’t provided, and the White House confirmed that no final decisions had been made as of Monday. A lot remains unclear about how an import tax on international productions could even be implemented. And unlike other sectors that have recently been targeted by tariffs, movies go beyond physical goods, bringing larger intellectual property ramifications into question.",
      "publishedAt": "2025-05-05T21:55:49Z",
      "title": "Trump has threatened a 100% tariff on movies made outside the US. Here's what we know",
      "url": "https://apnews.com/article/trump-tariffs-foreign-movies-films-8008248fc08c748a7e8a174306ba66ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/f81e48d/2147483647/strip/true/crop/3821x2149+0+199/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F1e%2F02c008fc7ef623bafc9706e8259e%2F5d0197c353214502ba72881302c41b73"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}