{
  "articles": [
    {
      "author": "Matthew Lee, Stephen Groves",
      "description": "Secretary of State Marco Rubio says there's been \"good and decent progress” in Venezuela since the United States ousted Nicolas Maduro as leader of the South American country. Rubio has begun his much-anticipated congressional testimony about Venezuela and is defending the Trump administration's military operation. Meanwhile, Republican and Democratic members of the Senate Foreign Relations Committee offered starkly different readings Wednesday of the current situation. Rubio said Venezuela’s interim leaders are cooperating and would soon begin to see benefits. He said Venezuela will be allowed to sell oil that is now subject to U.S. sanctions, with the revenue set aside to pay for basic government services such as policing and health care.",
      "publishedAt": "2026-01-28T05:03:26Z",
      "title": "Rubio cites 'good and decent progress' in Venezuela since US ousted Maduro",
      "url": "https://apnews.com/article/us-venezuela-trump-rubio-congress-maduro-rodriguez-e157b5d08a39047df4ac46764900ae77",
      "urlToImage": "https://dims.apnews.com/dims4/default/9fc06e4/2147483647/strip/true/crop/5616x3742+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F8f%2F1d27ebc41fa123a3b49f7f108fbd%2F17e2a297a2b140cc98313b6c018a3f24"
    },
    {
      "author": "Laura Bargfeld, Hannah Schoenbaum",
      "description": "A man has sprayed an unknown substance on U.S. Rep. Ilhan Omar before being tackled to the ground during a town hall she was hosting. The incident took place in Minneapolis, where tensions over federal immigration enforcement have come to a head after agents fatally shot an intensive care nurse and a mother of three this month. The audience cheered as the man was pinned down and his arms were tied behind his back. In video of the incident, someone in the crowd can be heard saying, “Oh my god, he sprayed something on her.” Omar continued the town hall after he was ushered out of the room.",
      "publishedAt": "2026-01-28T01:22:27Z",
      "title": "Man arrested after spraying substance on Rep. Ilhan Omar",
      "url": "https://apnews.com/article/ilhan-omar-town-hall-sprayed-7f6ad0b9ece2ae8804b2efe5badd2991",
      "urlToImage": "https://dims.apnews.com/dims4/default/21a61d3/2147483647/strip/true/crop/1616x1077+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F06%2F82eb07a58391c0524318c5c1e8bb%2F13f1eb069abc42e8b2b79822232fcc89"
    },
    {
      "author": null,
      "description": "The chief federal judge in Minnesota says the Trump administration has failed to comply with orders to hold hearings for detained immigrants and has ordered the head of Immigration and Customs Enforcement to appear before him Friday to explain why he shouldn’t be held in contempt. In an order dated Monday, Chief Judge Patrick J. Schiltz said Todd Lyons, the acting director of ICE, must appear personally in court. Schlitz took the administration to task over its handling of bond hearings for immigrants it has detained. The order says Schlitz recognizes that ordering the head of a federal agency to appear personally is extraordinary, but that the “extent of ICE’s violation of court orders is likewise extraordinary.”",
      "publishedAt": "2026-01-27T13:27:48Z",
      "title": "ICE chief must appear in court to explain why detainees have been denied due process",
      "url": "https://apnews.com/article/immigration-enforcement-minnesota-ice-b0cec9d1c5bae4b62469011775082300",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran has reached out to Middle Eastern countries over the threat of a possible U.S. military strike. Saudi Arabia and the United Arab Emirates have signaled they won’t allow their airspace to be used for any attack. The United States has moved the USS Abraham Lincoln into the region and President Donald Trump has urged Iran to negotiate. A month has passed since protests in Iran began over the economy and grew to challenge the theocracy. They led to a bloody crackdown, and activists say at least 6,221 people were killed. Meanwhile, Iran's currency on Wednesday reached a new low.",
      "publishedAt": "2026-01-28T09:30:23Z",
      "title": "Middle East worries over possible US strike on Iran one month after protests began",
      "url": "https://apnews.com/article/iran-protests-us-military-crackdown-5f6cb15275c575cefbb8fb41868a018a",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed36bc4/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F87%2F9cf0f7d5315c0b6ba12982bc8556%2F7ccc5efc079542b08e8698c701a25a3a"
    },
    {
      "author": "Christopher Rugaber",
      "description": "Federal Reserve officials are expected to keep their short-term interest rate unchanged Wednesday after three cuts last year, ignoring huge pressure for lower borrowing costs from the White House in favor of waiting to see how the economy evolves. A key issue that Chair Jerome Powell will likely address at his news conference Wednesday is how long the Fed will remain on hold. The rate-setting committee remains split between those officials opposed to further cuts until inflation comes down, and those who want to lower rates to further support hiring. In December, just 12 of the 19 participants in the committee’s meetings supported at least one more rate cut this year.",
      "publishedAt": "2026-01-28T05:01:38Z",
      "title": "Federal Reserve may keep rates unchanged for months as economy shows signs of health",
      "url": "https://apnews.com/article/federal-reserve-trump-powell-inflation-c13913c9e007981f075fb3b22d4a4cec",
      "urlToImage": "https://dims.apnews.com/dims4/default/20b0191/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F9c%2Fd19c0d2ad2121dddc230412b69cf%2F7959150d7f6e4510bdcea65acbc4a782"
    },
    {
      "author": "Russ Bynum",
      "description": "Officials in Mississippi say crews worked through the night to clear stranded vehicles on icy major highways as the eastern U.S. endures what could become its longest period of freezing cold in decades. Mississippi's Department of Transportation dispatched tow trucks and drones late Tuesday to frozen Interstate 55, where three tractor-trailers had stalled and caused a major backup. Gov. Tate Reeves said in social media post that highways remained dangerous Wednesday morning and urged people to stay off the roads. More than 380,000 people, mostly in Mississippi and Tennessee, remain without power days after a winter storm blasted the eastern U.S. with snow and ice. The East Coast could see more snowfall this weekend.",
      "publishedAt": "2026-01-28T16:11:59Z",
      "title": "Icy roads snarl traffic in Mississippi as new US snow threat looms",
      "url": "https://apnews.com/article/frigid-temperatures-arctic-air-us-south-tennessee-61cd5b29f15322cc4dcae374d7b78c7e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2003517/2147483647/strip/true/crop/5712x3806+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F3a%2F57fde7b69e20be27b2fa7e8f9051%2Fd5d2dda97d48404197e1cd3ed66dda22"
    },
    {
      "author": "Mark Sherman, Lindsay Whitehurst",
      "description": "When the Supreme Court granted an unusually quick hearing over President Donald Trump’s tariffs, a similarly fast resolution seemed possible. Trump’s lawyers told the court speed was of the essence on an issue central to the Republican president’s economic agenda. But nearly three months have elapsed since arguments in the closely watched case, and the court isn’t scheduled to meet in public for more than three weeks. No one knows what's going on among the nine justices. But the timeline for deciding the tariffs case now looks more or less typical and could reflect the normal back-and-forth that occurs not just in the biggest cases but in almost all the disputes the justices hear.",
      "publishedAt": "2026-01-28T05:09:20Z",
      "title": "Supreme Court still considering decision on Trump's tariffs",
      "url": "https://apnews.com/article/trump-tariffs-supreme-court-ruling-e00f24f16f327413efbab1af04a960df",
      "urlToImage": "https://dims.apnews.com/dims4/default/f9cf701/2147483647/strip/true/crop/4290x2859+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F6a%2Fcebffc92a934f6f7443439ae6b48%2Fc5ca76e675f947e1828c9671d3ef503d"
    },
    {
      "author": "Danica Kirka",
      "description": "Sarah Mullally was confirmed as archbishop of Canterbury on Wednesday, becoming the first woman to lead the Church of England. The worldwide Anglican Communion, which includes the Episcopal Church in the U.S., has no formal head, but the archbishop traditionally has been seen as its spiritual leader. Mullally, a cancer nurse turned cleric, officially took up the responsibilities of her new job Wednesday as judges presided over a legal ceremony confirming her appointment, which was announced almost four months ago. The Church of England ordained its first female priests in 1994 and its first female bishop in 2015.",
      "publishedAt": "2026-01-28T12:07:21Z",
      "title": "Sarah Mullally makes history as first female archbishop of Canterbury",
      "url": "https://apnews.com/article/sarah-mullally-archbishop-canterbury-anglican-church-women-3c20d119342265859835f4cbc45a2d55",
      "urlToImage": "https://dims.apnews.com/dims4/default/e736a57/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F23%2F800dfc8b728172640fd6a8ea9288%2F3aa1f72026ba4c3ebb8aac991b3a616d"
    },
    {
      "author": "Lauran Neergaard",
      "description": "Being a night owl can be bad for your heart. That's according to a study showing night owls had poorer overall cardiovascular health than most people, plus a modestly higher risk of a first heart attack or stroke. Unhealthy behaviors like too little sleep, smoking and a poor diet were key reasons. The body's circadian rhythm, or internal clock, governs when people feel sleepy and awake. Researchers say night owls will have to work harder on healthy behaviors like getting enough sleep in a morning person's world — but the health advice is good for everyone.",
      "publishedAt": "2026-01-28T10:11:18Z",
      "title": "Night owl habits are linked to higher health risks",
      "url": "https://apnews.com/article/healthy-heart-sleep-night-owls-circadian-rhythm-0c520492f5d6fc08c412053419e913f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/8050e97/2147483647/strip/true/crop/3616x2409+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2Faf%2F1cfbcee6c0d60945c8fe4475b9fa%2Fb589cafc55a344e2a956b98a86287fcf"
    },
    {
      "author": "The Associated Press",
      "description": "Amazon is announcing about 16,000 job cuts in the latest round of tech industry layoffs. Beth Galetti, a senior vice president at the company, shared the news in a blog post on Wednesday. The cuts come after Amazon laid off 14,000 workers in October. U.S.-based staff will have 90 days to find a new role within the company before receiving severance pay, outplacement services, and health insurance benefits.",
      "publishedAt": "2026-01-28T11:15:25Z",
      "title": "Amazon cuts another 16,000 jobs",
      "url": "https://apnews.com/article/amazon-layoffs-job-cuts-tech-74387fae2313ff7b0b1e638c00863443",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0ca32c/2147483647/strip/true/crop/3951x2633+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Fc9%2Fcff9a9250b7cdfcf4294c41e19e6%2Fd4e88db820f441dd89860eacf42689b0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}