{
  "articles": [
    {
      "author": "JOSHUA GOODMAN and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Venezuelan President Nicolás Maduro was formally declared the winner of his country's disputed presidential election Monday, a day after the political opposition and the entrenched incumbent both claimed victory in the contest.",
      "publishedAt": "2024-07-29T06:40:46Z",
      "title": "Venezuela's electoral body declares Maduro winner of country's disputed presidential election",
      "url": "https://apnews.com/acee6c8cd3a8fc88086c2dd71963b759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22ce85e7bd524eb4aa7a498fceef2896/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MICHELLE L. PRICE",
      "description": "ST. CLOUD, Minn. (AP) — Barely a week ago, a sense of inevitability hung over the U.S. presidential election.Donald Trump's allies gleefully predicted a landslide victory during a Republican National Convention that felt more like a coronation for a nominee who had just survived an assassination attempt and was promising to unite the country.",
      "publishedAt": "2024-07-29T04:02:23Z",
      "title": "Trump and Harris enter 99-day sprint to decide an election that has suddenly transformed",
      "url": "https://apnews.com/f1a86e343689c9e2d4aa676f7a75428c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c64c3fcfc3549d3a98cc27d034cace1/1634.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Former President Donald Trump has agreed to be interviewed by the FBI as part of an investigation into his attempted assassination in Pennsylvania earlier this month, a special agent said on Monday in disclosing how the gunman prior to the shooting had researched mass attacks and explosive devices.",
      "publishedAt": "2024-07-29T14:52:54Z",
      "title": "Trump agrees to be interviewed as part of an investigation into his assassination attempt, FBI says",
      "url": "https://apnews.com/9c3838fcf9753b3e61caf97804112fca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3d29168662840ce9919cd8b862748ff/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden has unveiled a long-awaited proposal for changes at the U.S.",
      "publishedAt": "2024-07-29T09:36:23Z",
      "title": "Biden unveils plan for Supreme Court changes, says US stands at 'breach' as public confidence sinks",
      "url": "https://apnews.com/ffd48f3a2023aeca841bb53c2147ef03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84c2bdec42e94f9dabaab8d51945d96a/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The United States on Monday cautioned Israel about escalation with the Iranian-backed Hezbollah as Israel weighs its response to a rocket attack from Lebanon over the weekend that killed 12 youths in the Israel-controlled Golan Heights.",
      "publishedAt": "2024-07-29T09:02:10Z",
      "title": "Israel-Hamas war latest: US cautions Israel over escalation with Hezbollah after weekend attack",
      "url": "https://apnews.com/1213b56409f36211815020ea0fdfee28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eb9e7d0b4e348a9b8b29839bd57dbaf/1920.jpeg"
    },
    {
      "author": "NIC COURY and REBECCA BOONE",
      "description": "FOREST RANCH, Calif. (AP) — Firefighters made progress and were helped by improving weather over the weekend in the battle against wildfires covering massive areas and leaving a trail of damage in the western United States, but further evacuations and resources have been necessary as thousands of personnel tackle the flames.",
      "publishedAt": "2024-07-29T06:41:41Z",
      "title": "California firefighters make progress as wildfires push devastation and spread smoke across US West",
      "url": "https://apnews.com/3e888a7e89f7b5b6b9c2172afb4671a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f707a9f557884e989adb9f26179c7737/1920.jpeg"
    },
    {
      "author": "JOHN O'CONNOR and LOLITA BALDOR",
      "description": "SPRINGFIELD, Ill. (AP) — The Illinois sheriff's deputy charged in the shooting death of Sonya Massey was kicked out of the Army for the first of two drunken driving convictions in which he had a weapon in his car, authorities said, but that didn't stop multiple law enforcement agencies from giving him a badge.",
      "publishedAt": "2024-07-29T16:39:45Z",
      "title": "With DUI-related ejection from Army, deputy who killed Massey should have raised flags, experts say",
      "url": "https://apnews.com/6ac3ff78bc29f18bd65c6e2763fab96f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fbf2916b3274a368ac8c945c69eb0da/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — Tongue-tie —a condition in infants that can affect breastfeeding — may be overdiagnosed in the U.S. and too often treated with unnecessary surgery, a prominent doctors' group said Monday.",
      "publishedAt": "2024-07-29T04:02:29Z",
      "title": "Infants' tongue-tie may be overdiagnosed and needlessly treated, American Academy of Pediatrics says",
      "url": "https://apnews.com/86a4d37b5ae924dc7848f17b8cdd5e3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5939b9d790945b7a467584a4fade4ac/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — A calf injury isn't going to slow down Simone Biles.The American gymnastics star is in the lineup for all four events during Tuesday night's Olympic team finals.",
      "publishedAt": "2024-07-29T15:09:27Z",
      "title": "Simone Biles to compete on all four events at Olympic team finals despite calf injury",
      "url": "https://apnews.com/43ade567f4b63b18ba86164750cfd636",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75a53aa2906d4283bfa86659b517549d/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "DEARBORN, Mich. (AP) — Osama Siblani’s phone won’t stop ringing.Just days after President Joe Biden withdrew his bid for reelection and endorsed Vice President Kamala Harris for the Democratic presidential nomination, top officials from both major political parties have been asking the publisher of the Dearborn-based Arab American News if Harris can regain the support of the nation’s largest Muslim population located in metro Detroit.",
      "publishedAt": "2024-07-29T04:11:04Z",
      "title": "Harris quickly pivots to convincing Arab American voters of her leadership",
      "url": "https://apnews.com/aa75d6616b2031c5d4c506c7354db14c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d2c6e30df284a26893848e07d206819/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}