{
  "articles": [
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — In the shadow of the White House, seven days before the final votes of the 2024 election are cast, Kamala Harris vowed to put country over party and warned that Donald Trump is obsessed with revenge and his own personal interests.",
      "publishedAt": "2024-10-30T00:35:13Z",
      "title": "Two closing arguments show the stark choice between Trump and Harris",
      "url": "https://apnews.com/070f6f5d72b4419a5d844e77177c2d42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47a96d284ff2402aba1915d063628487/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Kamala Harris stood before an overflowing crowd near the White House on Tuesday and promised Americans she would fight for them every day as she urged voters to reject Donald Trump’s efforts to sow division and fear, declaring, “It doesn’t have to be this way.”",
      "publishedAt": "2024-10-29T09:04:01Z",
      "title": "Harris urges voters to reject Trump’s efforts to sow division and fear",
      "url": "https://apnews.com/139a7b390dc30ceab85d9ac56fcc521d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70a92f66ba614f6b9e93e9397dcbc1f5/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "DULUTH, Ga. (AP) — No scene has dominated U.S. politics since 2015 quite like Donald Trump on stage, waxing on for an hour-plus in front of a chorus of red “Make America Great Again” hats.",
      "publishedAt": "2024-10-30T04:16:33Z",
      "title": "Inside 'the weave': How Donald Trump's rhetoric has grown darker and windier",
      "url": "https://apnews.com/a4ac05f3c67c80e8536c7ebe0e664866",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4115ae312e32413bba69ac8fa2cd5999/2806.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Two Israeli airstrikes in the northern Gaza Strip on Tuesday killed at least 88 people, including dozens of women and children, health officials said, and the director of a hospital said life-threatening injuries were going untreated because a weekend raid by Israeli forces led to the detention of dozens of medics.",
      "publishedAt": "2024-10-29T07:01:11Z",
      "title": "Israeli strikes in northern Gaza kill at least 88, officials say",
      "url": "https://apnews.com/befe1b42ef25599539198fa04e089f04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d00473a343db462da53a32698aefd3b3/1920.jpeg"
    },
    {
      "author": "SALLY ABOU ALJOUD",
      "description": "ARAMOUN, Lebanon (AP) — Ayman Jaber’s memories are rooted in every corner of Mhaibib, the village in southern Lebanon he refers to as his “habibti,” the Arabic word for “beloved.” The root of the village’s name means “the lover” or “the beloved.”",
      "publishedAt": "2024-10-30T05:35:27Z",
      "title": "In Lebanon, a family's memories are detonated along with their village",
      "url": "https://apnews.com/0d1220d7f23ca2ca66e9030b36fefa9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d0098dced5b4e189154541ac3f20a12/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "BARCELONA, Spain (AP) — At least 52 people have died in eastern Spain after flash floods swept away cars, turned village streets into rivers and disrupted rail lines and highways in the worst natural disaster to hit the European nation in recent memory.",
      "publishedAt": "2024-10-30T08:03:44Z",
      "title": "Spanish authorities report at least 52 dead from devastating flash floods",
      "url": "https://apnews.com/ef0dffabe1a106a05c239dca4dfec1ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb712290129e481da696c4d8df1e33c6/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "PHOENIX (AP) — Inside a squat building ringed with a chainlink fence and concrete barriers in downtown Phoenix, election workers on Nov. 5 will begin a grindingly slow tally of every ballot cast in the vast expanse of stucco and saguaro that is Maricopa County, Arizona.",
      "publishedAt": "2024-10-30T04:11:03Z",
      "title": "We may not know the next president on Election Day. This Arizona swing county could be why",
      "url": "https://apnews.com/a36ebb6884a9d87406157b10e84365cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34014dd888894ea19b29c92fcc24a4ec/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The question posed to Vladimir Putin in September about the U.S. election drew a wry smile and an arched eyebrow from the Russian president.",
      "publishedAt": "2024-10-30T04:26:05Z",
      "title": "How Putin views the choice between Harris and Trump, and what the election means for Russia",
      "url": "https://apnews.com/a94e45dfb0912bf44d5f83532b977b3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cbd5c3a028847079b3e61f14e6cf4f1/2758.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — Powered by consumer spending, the U.S. economy likely kept expanding at a healthy pace from July through September despite the pressure of still-high interest rates.The Commerce Department is expected to report Wednesday that the gross domestic product — the economy’s total output of goods and services — grew at a 2.6% annual pace last quarter, according to a survey of forecasters by the data firm FactSet.",
      "publishedAt": "2024-10-30T04:01:18Z",
      "title": "US economy is believed to have grown at a solid pace again last quarter",
      "url": "https://apnews.com/6a3fbfb5790b07434d656a95865b7435",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56ce4c44724e42d9b14a8097bd23d7d5/3000.jpeg"
    },
    {
      "author": "NG HAN GUAN",
      "description": "JIUQUAN, China (AP) — A Chinese space ship carrying a three-person crew docked with its orbiting space station Tuesday as the country seeks to expand its exploration of outer space in competition with the United States, even as it looks for cooperation from other nations.",
      "publishedAt": "2024-10-29T20:30:15Z",
      "title": "China's new crew has arrived at space station in sign of growing influence in space field",
      "url": "https://apnews.com/eeb0d5ca1f7dd080918cc8942511601f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6e36bb92e1e45e48bfccee4cc80c04c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}