{
  "articles": [
    {
      "author": null,
      "description": "The massive military parade that President Donald Trump has long wanted is set to step off from the Lincoln Memorial with tanks, bands and thousands of troops. And the biggest question marks are whether it will be overshadowed or delayed Saturday by either the weather in Washington or planned protests elsewhere around the country. Falling on Trump’s 79th birthday, the parade was added just a few weeks ago to the Army’s long-planned 250th anniversary celebration. It has triggered criticism for its price tag of up to $45 million and the possibility that the lumbering tanks could tear up city streets. Trump so far has shrugged off concerns about the parade cost, the rainy forecast and the potential for protests.",
      "publishedAt": "2025-06-14T04:04:52Z",
      "title": "US Army's parade to proceed despite rain, protests",
      "url": "https://apnews.com/article/trump-army-parade-troops-tanks-birthday-protests-4cca4da0e89908d39c820240744375a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/106fd8a/2147483647/strip/true/crop/4994x2809+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F6f%2F811464c685ce0bd8567aacfc4f9a%2F5af76853afaa4a4291d7bae698f4c854"
    },
    {
      "author": null,
      "description": "A massive search is stretching into its second day for a man who authorities say posed as a police officer and fatally shot a Democratic state lawmaker in her suburban Minneapolis home. Authorities say the suspect also shot and wounded a second lawmaker. Authorities have identified him as 57-year-old Vance Boelter. Melissa Hortman, a former Minnesota House Speaker, and her husband were fatally shot early Saturday in their Brooklyn Park home. The second state lawmaker, Sen. John Hoffman, and his wife were shot multiple times in nearby Champlin. Gov. Tim Walz has called it “a politically motivated assassination.” The FBI has issued a reward of up to $50,000 for information leading to Boelter's arrest and conviction.",
      "publishedAt": "2025-06-15T04:02:22Z",
      "title": "Authorities still searching for suspect in shooting of 2 Minnesota state lawmakers",
      "url": "https://apnews.com/article/minnesota-lawmakers-shot-8ce70a94c9eb90688baaa1a71faef6cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/7110fa9/2147483647/strip/true/crop/2781x1564+0+145/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F76%2F42e5c295dbd8e15f27ad47e31f10%2F757ac56de9114bbc9bd6b0411b1327a9"
    },
    {
      "author": null,
      "description": "Homeland Security Secretary Kristi Noem is promising to move forward with the Trump administration’s immigration crackdown in Los Angeles despite the waves of unrest. Noem spoke Thursday, hours before a judge directed the president to return control to California over National Guard troops he deployed after protests erupted over the immigration crackdown. But the 9th U.S. Circuit Court of Appeals quickly put the brakes on that and temporarily blocked the judge's order, which was to go into effect on Friday. The judge’s order said the Guard deployment was illegal and both violated the Tenth Amendment and exceeded President Donald Trump’s statutory authority.",
      "publishedAt": "2025-06-13T05:43:24Z",
      "title": "DHS vows Trump's immigration crackdown will continue despite unrest",
      "url": "https://apnews.com/article/immigration-raids-national-guard-lawsuit-los-angeles-f4809c7f39d09e4fdfa01982f44ec995",
      "urlToImage": "https://dims.apnews.com/dims4/default/b782467/2147483647/strip/true/crop/4737x2665+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F3f%2F680e47f224ad85d4c1bd6b3f95ae%2Fcf6f81a1c61d4d51bf1312fc92fec446"
    },
    {
      "author": null,
      "description": "Cities large and small are preparing for major demonstrations across the U.S. against President Donald Trump. That's happening Saturday as officials urge calm, National Guard troops mobilize and Trump attends a military parade in Washington to mark the Army’s 250th anniversary. A flagship “No Kings” march and rally are planned in Philadelphia. The demonstrations are gaining additional fuel from protests flaring up over federal immigration enforcement raids. Governors and city officials are vowing to protect the right to protest and to show no tolerance for violence. Republican governors in Virginia, Texas and Missouri are mobilizing National Guard troops. Organizers say Philadelphia could see a crowd approaching 100,000 people.",
      "publishedAt": "2025-06-14T04:11:08Z",
      "title": "Major 'No Kings' protests against Trump planned across US",
      "url": "https://apnews.com/article/no-kings-protest-trump-philadelphia-los-angeles-immigration-raids-a3b67d23733cd060f8d01aef1e391dbf",
      "urlToImage": "https://dims.apnews.com/dims4/default/3eaf8a7/2147483647/strip/true/crop/3240x1823+0+169/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F4f%2F93d2d8fca9b392eaf380a4faa84a%2Ffed69c36ca2743499f63b5e23c43e574"
    },
    {
      "author": null,
      "description": "Israel unleashed airstrikes across Iran for a third day and threatened even greater force as some Iranian missiles evaded Israeli air defenses to strike buildings in the heart of the country. Planned talks on Iran’s nuclear program, which could provide an off-ramp, were called off. The region braced for a protracted conflict after Israel’s surprise bombardment of Iran’s nuclear and military sites on Friday killed several top generals and nuclear scientists, and neither side showed any sign of backing down. Israel reportedly targeted a gas installation, raising the prospect of a broader assault on Iran’s heavily-sanctioned energy industry that could affect global markets.",
      "publishedAt": "2025-06-15T06:33:06Z",
      "title": "Israel and Iran trade strikes for a third day as nuclear talks are called off",
      "url": "https://apnews.com/article/israel-iran-mideast-war-news-06-15-2025-d7e902fda4933aa1b0a30d901d4ff479",
      "urlToImage": "https://dims.apnews.com/dims4/default/d28814d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fc3%2F0a37559187a1b3adec7617fd4aba%2F9de9ac237ac84c6eadf64301b36cd96e"
    },
    {
      "author": null,
      "description": "Israel’s sweeping attack across Iran struck at the heart of Tehran’s nuclear program, delivering a blow to the country’s ability to enrich uranium and potentially setting its nuclear ambitions back by months or years. As well as killing key military figures and nuclear scientists, the Israeli strikes destroyed part of a plant that was enriching uranium to levels far beyond the requirements for nuclear-fueled power stations. The attacks also destroyed backup power for the underground section of the plant, potentially damaging more sensitive equipment. Iran’s nuclear program has progressed rapidly since 2018, when the U.S. withdrew from a deal to limit Tehran’s capacity to enrich uranium.",
      "publishedAt": "2025-06-14T04:01:17Z",
      "title": "Israeli strikes have delivered a serious blow to Iran's nuclear program",
      "url": "https://apnews.com/article/iran-israel-nuclear-attack-uranium-enrichment-radiation-5ded3c224531adf510668c5860801882",
      "urlToImage": "https://dims.apnews.com/dims4/default/49e05ae/2147483647/strip/true/crop/5915x3327+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F40%2Fef6d174d5e49a3d63c42bbec6d25%2Ff6f2cbef8b32466e9c8eaba4049ea7ae"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy says rising global oil prices following Israeli strikes on Iran will strengthen Russia by increasing its oil revenues, aiding its war effort in Ukraine. He criticized the lack of effective Western price caps on Russian oil and says he plans to raise the issue in an upcoming conversation with U.S. President Donald Trump. Zelenskyy also expressed concern that renewed tensions in the Middle East could divert U.S. aid away from Ukraine, as has happened in the past. His remarks were made Friday and released under embargo on Saturday afternoon.",
      "publishedAt": "2025-06-14T12:40:40Z",
      "title": "Zelenskyy warns oil price surge could help Russia's war effort",
      "url": "https://apnews.com/article/russia-ukraine-war-iran-israel-zelenskyy-ba2a52ce82897f16f76f52d4b8e53b34",
      "urlToImage": "https://dims.apnews.com/dims4/default/e437160/2147483647/strip/true/crop/4341x2442+0+226/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F4d%2F94725b381f3eae7c932ff43a360b%2Fc6bb9cb4bfc748c1b548a72cb755ce24"
    },
    {
      "author": null,
      "description": "Authorities have begun investigating one of India’s worst aviation disasters after an Air India plane crashed a day earlier, killing all but one of the total 242 passengers and crew onboard. The Indian government has launched an investigation into the fatal crash of the London-bound Air India plane that came down in a in a residential area in the northwestern city of Ahmedabad, minutes after takeoff on Thursday. Civil Aviation Minister Ram Mohan Naidu in a statement said the Aircraft Accident Investigation Bureau has initiated the probe in line with global protocols set by the International Civil Aviation Organization. A team from the U.S. is expected in India to help with the probe.",
      "publishedAt": "2025-06-13T04:55:54Z",
      "title": "Indian authorities begin probe of Air India plane crash as Modi visits the site",
      "url": "https://apnews.com/article/air-india-plane-crash-ahmedabad-survivor-boeing-787-18a1e45cb65bd716d6529b8922cc94b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/4138789/2147483647/strip/true/crop/7048x3965+0+367/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Fa0%2F7541be4f6eb1138c26a91a1daaf8%2F5ba76ed4bea84d86ac28c1db2ed25980"
    },
    {
      "author": null,
      "description": "In his first words directed specifically to Americans, Pope Leo XIV told young people on Saturday how to find hope and meaning in their lives through God and in service to others. The message was delivered in a video broadcast on the jumbotron at the White Sox baseball stadium in Chicago, That is Leo’s hometown, and he roots for the White Sox. The event was organized by the Archdiocese of Chicago in honor of his recent election as pope. Leo seized the opportunity to speak directly to young people, tying his message to the Catholic Church’s ongoing Jubilee year of hope that was declared by Pope Francis.",
      "publishedAt": "2025-06-14T20:42:50Z",
      "title": "Pope Leo XIV sends message of hope via Chicago White Sox jumbotron",
      "url": "https://apnews.com/article/pope-leo-chicago-baseball-stadium-catholic-mass-5fa10cc7084271e92c911b66de8cab51",
      "urlToImage": "https://dims.apnews.com/dims4/default/f9e84d1/2147483647/strip/true/crop/6318x3554+0+329/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2Fa1%2F746514d7ef122025bb8a161e2d70%2F88244f124ca84f518aaf53da66473744"
    },
    {
      "author": null,
      "description": "Minnesota Gov. Tim Walz says a state lawmaker and her husband were shot and killed in a politically motivated assassination. A second lawmaker and his wife were shot and wounded early Saturday. The wounded lawmaker was identified as state Sen. John Hoffman, a Democrat first elected in 2012. Hortman was the top House Democratic leader in the state Legislature and a former House speaker. She was first elected in 2004. Drew Evans, superintendent of the Bureau of Criminal Apprehension, said that authorities were actively searching for a suspect. Officials said the suspect was dressed as a law enforcement officer.",
      "publishedAt": "2025-06-14T14:24:54Z",
      "title": "Minnesota lawmaker, spouse dead after targeted shooting",
      "url": "https://apnews.com/article/minnesota-lawmakers-shot-d7983e1e4f1a7573a487cab1a98cd172",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad8b912/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7f%2F79%2Fcfe106d73ebaadcc796ac82f7977%2F8bbe8f6e8b9244b8a5fb0c1c1714931e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}