{
  "articles": [
    {
      "author": "WAFAA SHURAFA, TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "RAFAH, Gaza Strip (AP) — Israel has failed to comply with an order by the United Nations' top court to provide urgently needed aid to desperate people in the Gaza Strip, Human Rights Watch said Monday, a month after a landmark ruling in The Hague ordered Israel to moderate its war.",
      "publishedAt": "2024-02-26T08:53:03Z",
      "title": "Human Rights Watch accuses Israel of blocking aid to Palestinians in violation of a UN court order",
      "url": "https://apnews.com/8682b5446e285a7fc641c9f869df9348",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96efaaa434c14a8280ed08ea7a1817c7/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — The Israeli military said Monday its air force was striking targets of the militant Hebollah group “deep inside Lebanon,” where residents reported explosions near the northeastern city of Baalbek.",
      "publishedAt": "2024-02-26T10:26:07Z",
      "title": "Israel's air force says it struck deep inside Lebanon after Hezbollah shot down a drone",
      "url": "https://apnews.com/ed15c8275fa47e6214784f5ed99649f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/490ef1f316e645ec9b3173f8ae041514/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden will convene the top four congressional leaders at the White House on Tuesday to press lawmakers on passing an emergency aid package for Ukraine and Israel, as well as averting a looming government shutdown next month, according to a White House official.",
      "publishedAt": "2024-02-25T23:00:53Z",
      "title": "Biden is summoning congressional leaders to the White House to talk Ukraine and government funding",
      "url": "https://apnews.com/a4b886c469b3d5bff8ae7a18e5896eb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44b912d6311f431f8cb73a91a55d767f/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — More than 20 European heads of state and government and other Western officials are gathering in a show of unity for Ukraine, signaling to Russia that their support for Kyiv isn't wavering as the full-scale invasion grinds into a third year.",
      "publishedAt": "2024-02-26T08:47:00Z",
      "title": "At Paris gathering, Western leaders to show unity for Ukraine and signal 'that Russia cannot win'",
      "url": "https://apnews.com/c458a1df3f9a7626128cdeb84050d469",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9cd3dc1fb8e4fa4bc3506363e7d9344/3000.jpeg"
    },
    {
      "author": "DIDI TANG and MICHAEL BALSAMO",
      "description": "WASHINGTON (AP) — An active-duty member of the U.S. Air Force was critically injured Sunday after setting himself ablaze outside the Israeli Embassy in Washington, D.C., while declaring that he “will no longer be complicit in genocide,” a person familiar with the matter told The Associated Press.",
      "publishedAt": "2024-02-26T02:03:20Z",
      "title": "Air Force member in critical condition after setting himself on fire outside Israeli embassy in DC",
      "url": "https://apnews.com/c49922e38d51727af736e60e3bb21dd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f509ecebebee45ccb3c05f4901544303/1280.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and MEG KINNARD",
      "description": "TROY, Mich. (AP) — Republican presidential candidate Nikki Haley says it's not “the end of our story” despite Donald Trump's easy primary victory in South Carolina, her home state where the onetime governor had long suggested her competitiveness with the former president would show.",
      "publishedAt": "2024-02-25T16:33:53Z",
      "title": "Off to Michigan, Haley is staying in the race despite Trump's easy primary win in South Carolina",
      "url": "https://apnews.com/ee571b2024cb6bba665507dd63c6a730",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/baf68c8e169348dfb079f22839b79491/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — For the third time in five years, senators will be sworn in as jurors for an impeachment trial. But the chamber is expected to spend far less time on the charges against Homeland Security Secretary Alejandro Mayorkas than the ones brought against former President Donald Trump — or maybe no time at all.",
      "publishedAt": "2024-02-26T05:07:04Z",
      "title": "Leaders are likely to seek quick dismissal as Mayorkas impeachment moves to the Senate",
      "url": "https://apnews.com/288b3ffaa56d97f3ee6bfda655decab2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71e4f26459b44bb98545b889f7c973d4/3000.jpeg"
    },
    {
      "author": "DUSAN STOJANOVIC and JOVANA GEC",
      "description": "ROGACA, Serbia (AP) — When Elena Koposova signed an open letter against Russia's full-scale invasion of Ukraine, she didn’t expect a backlash in her newly adopted home state of Serbia.",
      "publishedAt": "2024-02-26T05:05:51Z",
      "title": "Moscow ally Serbia cracks down on anti-war Russians living in the Balkan country",
      "url": "https://apnews.com/e208310992bfb474aa5dbf7bc0193601",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fb8a2b9c5ec40f5b0d82407acc6f3cc/3000.jpeg"
    },
    {
      "author": "GIADA ZAMPANO and VALERIA FERRARO",
      "description": "CROTONE, Italy (AP) — Survivors and family members of victims of a tragic shipwreck a year ago that killed 94 migrants, including 35 minors, just a few meters off Italy’s southern coast, returned for three days of commemorations ending Monday, calling for truth and justice.",
      "publishedAt": "2024-02-26T05:15:44Z",
      "title": "Survivors and families of 94 migrants who died in shipwreck off Italy call for truth a year later",
      "url": "https://apnews.com/bff0cfb53f78837884e3c6385d4c377c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a83c71bde2d945dda1c7b1c8d9385793/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — This year looks to be a much better one for the U.S. economy than business economists were forecasting just a few months ago, according to a survey released Monday. The economy looks set to grow 2.2% this year after adjusting for inflation, according to the National Association for Business Economics.",
      "publishedAt": "2024-02-26T05:02:14Z",
      "title": "What recession? Professional forecasters raise expectations for US economy in 2024",
      "url": "https://apnews.com/ed49d9bfa9a26b6301065b990169d387",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c9a854623c64216b140ef2abb67def4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}