{
  "articles": [
    {
      "author": "Jack Brook, Steve Karnowski, Rebecca Santana",
      "description": "Democratic officials and protesters on the streets are demanding that federal immigration officers leave Minnesota after a Border Patrol agent fatally shot a man in Minneapolis. Saturday's shooting drew hundreds of demonstrators into the frigid cold in a city already shaken by another killing weeks earlier. Minneapolis Police Chief Brian O’Hara says information about what led up to the latest shooting is limited. The man has been identified by his parents as Alex Pretti. He was a 37-year-old intensive care unit nurse. The Minnesota National Guard assisted local police in monitoring the crowds.",
      "publishedAt": "2026-01-25T05:01:38Z",
      "title": "After fatal shooting in Minneapolis, protesters and Democrats demand federal agents leave",
      "url": "https://apnews.com/article/shooting-minneapolis-protests-ice-immigration-0af10ec433181aa9300deea26d1cc8c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe606de/2147483647/strip/true/crop/3600x2399+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F41%2F2c6f8d9d7985877a890a256ec7d0%2F53e02021b11b43ec95470f1f7b790c3b"
    },
    {
      "author": "Steven Sloan",
      "description": "Some Republicans are calling for a deeper investigation into federal immigration tactics after a U.S. Border Patrol agent fatally shot a man in Minneapolis. And those calls are an early sign that the accounting of events by President Donald Trump’s administration may face bipartisan scrutiny. The Republican congressman who heads the House Homeland Security Committee is seeking testimony from leaders at Immigration and Customs Enforcement, Customs and Border Protection and U.S. Citizenship and Immigration Services. Two Republican senators are pressing for more information about the shooting. Meanwhile, administration officials remain firm in their defense of the hard-line immigration enforcement tactics in the Minnesota city,",
      "publishedAt": "2026-01-25T16:03:46Z",
      "title": "Some Republicans call for investigation after fatal shooting in Minneapolis",
      "url": "https://apnews.com/article/minneapolis-immigration-republicans-trump-pretti-988f694e4e1187033551fd23afde4c02",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2a33c7/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2F14%2F3b0d41cac4378f449d2dab8a4def%2F9a63ff53f21d46e19d15598f81d90c27"
    },
    {
      "author": "Kate Brumback, Julie Walker",
      "description": "A massive winter storm continues to hit large parts of the country, dumping snow, sleet and freezing rain. Frigid temperatures, power outages, and treacherous road conditions were widespread. The National Weather Service says the storm is expected to continue through Monday. Heavy snow is forecast from the Ohio Valley to the Northeast, while ice threatens the Lower Mississippi Valley to the Southeast. The number of customers without power was approaching 800,000, according to poweroutage.us, and the number was rising. More than 10,000 flights have been canceled. President Donald Trump approved emergency declarations for at least a dozen states by Saturday.",
      "publishedAt": "2026-01-25T13:52:15Z",
      "title": "Massive winter storm continues to bring cold, ice and dangerous conditions",
      "url": "https://apnews.com/article/winter-storm-snow-ice-power-outages-7ea143995026e68db42ed1b4aec396cb",
      "urlToImage": "https://dims.apnews.com/dims4/default/c14e684/2147483647/strip/true/crop/3500x2332+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F14%2F31da8af2fe83347d24574c052bb2%2F8b24fe3695154c5c860f4ec8fd344147"
    },
    {
      "author": "Rio Yamat",
      "description": "A massive winter storm set the stage for a brutal travel day Sunday, with airlines warning of widespread cancellations and delays at some of the nation’s busiest airports. More than 14,100 flights have been canceled across the U.S. since Saturday, according to flight tracking site FlightAware. Over 10,000 of those were scheduled for Sunday. Aviation analytics company Cirium says their data shows that Sunday will be the highest cancellation event since the pandemic — with over 29% of all U.S. departing flights axed.",
      "publishedAt": "2026-01-25T10:53:31Z",
      "title": "Massive winter storm threatens widespread US flight disruptions",
      "url": "https://apnews.com/article/flight-cancellations-winter-storm-871ea9cf98ec399bce4dccf0cffa2c01",
      "urlToImage": "https://dims.apnews.com/dims4/default/123c7dc/2147483647/strip/true/crop/5537x3689+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F0a%2Fa67428c926f64986ac5b3d7a307a%2F96cf00c0e17a4aac9e794d0ab823f6c1"
    },
    {
      "author": "Elena Becatoros",
      "description": "Authorities in Iran have unveiled a new mural in a central Tehran square with a direct warning to the United States to not attempt a military strike on the country. The painted image of several damaged aircraft on the flight deck of an aircraft carrier bears a slogan: “If you sow the wind, you will reap the whirlwind.” The unveiling of the mural in Enghelab Square comes as USS Abraham Lincoln aircraft carrier and accompanying warships move toward the region. U.S. President Donald Trump has said the ships were being moved “just in case” he decides to take action.",
      "publishedAt": "2026-01-25T13:28:55Z",
      "title": "Iran unveils mural in the capital to send anti-US message",
      "url": "https://apnews.com/article/iran-trump-mural-protests-military-4b2ceb8aff9dc448036341e86023b6c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4bfd3c9/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F2a%2F34e250967b5c630cce348c83a669%2Feef88c4065e84b4a80fd85a1cd75522f"
    },
    {
      "author": "Mike Stobbe",
      "description": "Dr. William Foege, a leader in the global eradication of smallpox, has died. He was 89. Foege was director of the U.S. Centers for Disease Control and Prevention in the late 1970s and early 1980s, and later held other key health leadership roles. But his greatest achievement came before all that, with his work on smallpox while he was a medical missionary in Nigeria. He and his colleagues developed a “ring containment” strategy for the disease. A smallpox outbreak was contained by identifying each case and vaccinating everyone who they might come into contact with.",
      "publishedAt": "2026-01-25T15:58:04Z",
      "title": "Small pox eradication pioneer Dr. William Foege dies",
      "url": "https://apnews.com/article/william-foege-smallpox-cdc-73770ffe382e48829a87fee0b364a3d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/2214aa5/2147483647/strip/true/crop/4800x3198+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2Fcb%2F7344448c48e3a361523c4cdd4b9f%2Ff9c41c2aa8964150a25c283d0032bd22"
    },
    {
      "author": "The Associated Press",
      "description": "Ukrainian President Volodymyr Zelenskyy said a security agreement with the United States is “100% ready.” Speaking on Sunday, Zelenskyy said Ukraine is waiting for its partners to set a signing date. Speaking after trilateral talks with Russia and the U.S. in Abu Dhabi, Zelenskyy emphasized Ukraine’s push for European Union membership by 2027 as an “economic security guarantee.” He acknowledged fundamental differences with Russia over territorial integrity. Negotiators will return to the UAE on Feb. 1, a U.S. official said.",
      "publishedAt": "2026-01-25T17:16:41Z",
      "title": "US security agreement for Ukraine is '100% ready' to be signed, Zelenskyy says",
      "url": "https://apnews.com/article/us-ukraine-war-talks-security-zelenskyy-438412639e3a73cab0abf9d109519720",
      "urlToImage": "https://dims.apnews.com/dims4/default/882f147/2147483647/strip/true/crop/6854x4567+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F44%2F408f3a63daa7a3183b69798e6553%2Fd156d6bb79fd4b2da3dccc29ae32879c"
    },
    {
      "author": null,
      "description": "President Donald Trump says the U.S. used a secret weapon he called “The Discombobulator” to disable Venezuelan equipment when the U.S. captured Nicolás Maduro. The president also renewed his threat to conduct military strikes on land against drug cartels, including in Mexico. Trump made the comments in an interview Friday with the New York Post. The Republican president was commenting on reports that the U.S. had a pulsed energy weapon and said, “The Discombobulator. I’m not allowed to talk about it.” He said the weapon made Venezuelan equipment “not work.”",
      "publishedAt": "2026-01-25T21:31:29Z",
      "title": "Trump says US used secret weapon to disable Venezuelan equipment in Maduro raid",
      "url": "https://apnews.com/article/trump-venezuela-weapon-maduro-drug-strikes-c052fd24a350a04a458f501b4b536e62",
      "urlToImage": "https://dims.apnews.com/dims4/default/f7e8d7e/2147483647/strip/true/crop/3523x2347+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2F03%2F22b7f176548a0e529a43e4fa6712%2F48720b5329824f4b9b6287e1464ceed8"
    },
    {
      "author": "Natalie Melzer",
      "description": "Israel says its military is conducting a large-scale operation to locate the last hostage in Gaza. This comes as Washington and other mediators pressure Israel and Hamas to move into the next phase of their ceasefire. On Sunday, Israel’s Cabinet was meeting to discuss opening Gaza’s Rafah border crossing with Egypt. Returning the remaining hostage, Ran Gvili, has been seen as removing the main obstacle to this move. The ceasefire's first phase, which began on Oct. 10, includes the return of all remaining hostages. Israel accuses Hamas of delaying the recovery of Gvili's remains, while Hamas claims it has provided all available information.",
      "publishedAt": "2026-01-25T19:28:28Z",
      "title": "Israel launches 'large scale operation' to locate last hostage in Gaza",
      "url": "https://apnews.com/article/gaza-israel-hamas-palestinians-hostage-gvili-d57a28eb5371785588d4b955f9dd2a46",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7c209a/2147483647/strip/true/crop/8067x5375+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F5e%2Fac5591763b9474be4cd34ccc189a%2F9b5d60d16e00445ca24eed4c4ca17a55"
    },
    {
      "author": "Pan Pylas",
      "description": "A row has erupted within Britain's Labour Party after Manchester's mayor, Andy Burnham, was blocked from running in a special election. Critics claim Prime Minister Keir Starmer wants to prevent a potential rival from reentering Parliament. Burnham requested to stand as Labour's candidate for the Gorton and Denton constituency. Labour's National Executive Committee denied his request, citing the impact on campaign resources. Burnham hasn't responded yet. Labour faces challenges in upcoming elections, with poll ratings dropping. Burnham, known for his leadership ambitions, has previously clashed with Starmer on policy issues.",
      "publishedAt": "2026-01-25T14:22:51Z",
      "title": "Manchester Mayor Andy Burnham's Parliament bid blocked, sparking Labour row",
      "url": "https://apnews.com/article/uk-labour-party-starmer-burnham-b63b1acaff7058eb2a22b730c0560390",
      "urlToImage": "https://dims.apnews.com/dims4/default/cd9c60f/2147483647/strip/true/crop/4440x2958+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2Ff0%2F8805b5cfcce3dc0be19fcdf16350%2F0996bf3b400b4dd0b62bbf2672568de8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}