{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel's military renewed calls Monday for mass evacuations from the southern town of Khan Younis, where tens of thousands of displaced Palestinians have sought refuge in recent weeks, as it widened its ground offensive and bombarded targets across the Gaza Strip.",
      "publishedAt": "2023-12-04T07:49:35Z",
      "title": "Israel orders evacuations as it widens offensive but Palestinians are running out of places to go",
      "url": "https://apnews.com/ece85568ce36cb2315f26b10adda30fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f56de61533fa4988b061b98450709079/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER AND LISA MASCARO",
      "description": "WASHINGTON (AP) — As a cease-fire ticked down last week and Israel prepared to resume its round-the-clock airstrikes, Sen. Bernie Sanders and a robust group of Democratic senators had a message for their president: They were done “asking nicely” for Israel to do more to reduce civilian casualties in Gaza.",
      "publishedAt": "2023-12-04T05:06:03Z",
      "title": "Biden's allies in Senate demand that Israel limit civilian deaths in Gaza as Congress debates US aid",
      "url": "https://apnews.com/a760c44986e5381b146d370cada95b52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/958ffce23c4c43f79f77fdf3063b6a06/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Ballistic missiles fired by Yemen's Houthi rebels struck three commercial ships Sunday in the Red Sea, while a U.S. warship shot down three drones in self-defense during the hourslong assault, the U.S.",
      "publishedAt": "2023-12-03T15:59:06Z",
      "title": "3 commercial ships hit by missiles in Houthi attack in Red Sea, US warship downs 3 drones",
      "url": "https://apnews.com/716770f0a780160e9abed98d3c48fbde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0db69f6ccba4d1d8a6daa8f05c8c3ed/1500.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and ERIC TUCKER",
      "description": "MIAMI (AP) — A former American diplomat who served as U.S. ambassador to Bolivia has been arrested in a long-running FBI counterintelligence investigation, accused of secretly serving as an agent of Cuba’s government, The Associated Press has learned.",
      "publishedAt": "2023-12-03T23:52:13Z",
      "title": "Former US ambassador arrested in Florida, accused of serving as an agent of Cuba, AP source says",
      "url": "https://apnews.com/af9d80a4f268099364dff249dd74b3ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d94784a570f7404f9b6d74a37fb0aabe/3000.jpeg"
    },
    {
      "author": "MICHAEL REZENDES and JASON DEAREN",
      "description": "HAILEY, Idaho (AP) — Paul Rytting listened as a woman, voice quavering, told him her story. When she was a child, her father, a former bishop in The Church of Jesus Christ of Latter-day Saints, had routinely slipped into bed with her while he was aroused, she said.",
      "publishedAt": "2023-12-04T05:02:22Z",
      "title": "Recordings show how the Mormon church protects itself from child sex abuse claims",
      "url": "https://apnews.com/9c301f750725c0f06344f948690caf16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffd0b2dbbb5a430582f6acd46539e265/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court is hearing arguments over a nationwide settlement with OxyContin maker Purdue Pharma that would shield members of the Sackler family who own the company from civil lawsuits over the toll of opioids.",
      "publishedAt": "2023-12-04T05:02:25Z",
      "title": "OxyContin maker bankruptcy deal goes before the Supreme Court on Monday, with billions at stake",
      "url": "https://apnews.com/df2843c77fa46d8a4752d4fe43745f0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a1039c8ad58488d84acf9ecc4153a7f/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — U.S. and Japanese divers have discovered wreckage and remains of crew members from a U.S. Air Force Osprey aircraft that crashed last week off southwestern Japan, the Air Force announced Monday.",
      "publishedAt": "2023-12-04T09:25:43Z",
      "title": "Divers have found wreckage, remains from Osprey aircraft that crashed off Japan, US Air Force says",
      "url": "https://apnews.com/a899abbe07447607813302ef06881424",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2138da93f4a445a5af1f57f8fd4588fd/3000.jpeg"
    },
    {
      "author": "MARY KATHERINE WILDEMAN and MICHAEL PHILLIS",
      "description": "At least 1,300 employees of organizations representing fossil fuel interests registered to attend this year's United Nations climate talks in Dubai, more than three times the number found in an Associated Press analysis of last year's talks, as new rules took effect requiring attendees to disclose their employment.",
      "publishedAt": "2023-12-04T04:01:34Z",
      "title": "At UN climate talks, fossil fuel interests have hundreds of employees on hand",
      "url": "https://apnews.com/e58911b437425abc02cafc089a10cb2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4219846fa4974fe2b9086dde14a02f8c/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — Hailed as a world first, European Union artificial intelligence rules are facing a make-or-break moment as negotiators try to hammer out the final details this week — talks complicated by the sudden rise of generative AI that produces human-like work.",
      "publishedAt": "2023-12-04T05:11:39Z",
      "title": "Europe's world-leading artificial intelligence rules are facing a do-or-die moment",
      "url": "https://apnews.com/06ab334caa97778770f5f57f4d904447",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/206d1072c8254aacb44e033693f18afd/3000.jpeg"
    },
    {
      "author": "BERNARD McGHEE",
      "description": "From a hot dog vendor to head of the formidable mercenary army Wagner Group, his rise through Russian society could easily be described as meteoric.",
      "publishedAt": "2023-12-04T05:07:19Z",
      "title": "Final goodbye: Recalling influential people who died in 2023",
      "url": "https://apnews.com/d87db779f2b68d310774c558302b7a8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cb9faa7f5d24c86a39da85af1a417cb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}