{
  "articles": [
    {
      "author": "TERRY SPENCER",
      "description": "PERRY, Fla. (AP) — Hurricane Idalia made landfall Wednesday in Florida as a Category 3 storm and unleashed devastation along a wide stretch of the Gulf Coast, submerging homes and vehicles, turning streets into rivers, unmooring small boats and downing power lines before sweeping into Georgia.",
      "publishedAt": "2023-08-30T04:37:06Z",
      "title": "Hurricane Idalia unleashes fury on Florida and Georgia, swamping a wide stretch of coast",
      "url": "https://apnews.com/2136985ceea53f5deb600c43aeea1138",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b2850e799f7421596a10e128807cece/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN and DASHA LITVINOVA",
      "description": "KYIV, Ukraine (AP) — Ukraine sent waves of drones deep into western Russia in more than four hours of nighttime attacks that struck military assets, Russian officials and media reports said Wednesday.",
      "publishedAt": "2023-08-30T01:36:54Z",
      "title": "Ukrainian drones strike deep in Russian territory, Moscow says, while a barrage in Kyiv kills 2",
      "url": "https://apnews.com/a9fc4ddad80a906e85aacca7354eb317",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2223fd9a82db4c5891250c1e5f289288/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — The White House on Wednesday said that it has new intelligence that shows Russian President Vladimir Putin and North Korean leader Kim Jong Un have swapped letters as Russia looks to North Korea for munitions for the war in Ukraine.",
      "publishedAt": "2023-08-30T15:28:10Z",
      "title": "White House says Putin and Kim Jong Un traded letters as Russia looks for munitions from North Korea",
      "url": "https://apnews.com/8c48787c798a50beda774a8ac5cc91ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8546a647e9584e20bb4daaf79beee30a/2392.jpeg"
    },
    {
      "author": "YVES LAURENT GOMA and SAM MEDNICK",
      "description": "LIBREVILLE, Gabon (AP) — Mutinous soldiers in Gabon proclaimed their republican guard chief as the country’s leader Wednesday after placing the just-reelected President Ali Bongo Ondimba under house arrest, alleging betrayal and massive embezzlement during his long-time rule over the oil-rich Central African nation.",
      "publishedAt": "2023-08-30T05:30:37Z",
      "title": "Mutineers in Gabon appoint a military leader after detaining the president, alleging corruption",
      "url": "https://apnews.com/a61d03963f75ae93ba85a4ba7eec3c71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b18909f664948edbed031816a97e336/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Senate Republican leader Mitch McConnell appeared to briefly freeze up and was unable to answer a question from a reporter at an event in Kentucky on Wednesday, weeks after he had a similar episode in Washington.",
      "publishedAt": "2023-08-30T18:16:51Z",
      "title": "Senate GOP leader Mitch McConnell appears to freeze up again, this time at a Kentucky event",
      "url": "https://apnews.com/c5b43745251daa0bb63636ceff4edce2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f8d2b21a78347f6b279264270cbff21/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, CHRISTINE FERNANDO and ALI SWENSON",
      "description": "MIAMI (AP) — When Florida Gov. Ron DeSantis was asked during last week’s GOP presidential debate whether he would support nationwide abortion restrictions, he instead offered a startling anecdote.",
      "publishedAt": "2023-08-30T18:50:52Z",
      "title": "Abortion anecdote from DeSantis at GOP debate is more complex than he made it sound",
      "url": "https://apnews.com/9b2f9ac73710ca9e1ae78c13d4694670",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d10606245d649b7bf74d64eaf29dcee/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and MARI YAMAGUCHI",
      "description": "SEOUL, South Korea (AP) — North Korea launched two short-range ballistic missiles toward the sea on Wednesday night, its neighbors said, hours after the U.S. flew long-range bombers for drills with its allies in a show of force against the North.",
      "publishedAt": "2023-08-30T15:07:16Z",
      "title": "North Korea launches ballistic missiles toward the sea after US flies bombers during drills",
      "url": "https://apnews.com/1351d0054dcdce86ede6942773b95cea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0856582229e84ef8ac9cafe3f979878b/2108.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A federal judge on Wednesday held Rudy Giuliani liable in a defamation lawsuit brought by two Georgia election workers who say they were falsely accused of fraud, ruling that the former New York city mayor gave “only lip service” to complying with his legal obligations while trying to portray himself as the victim in the case.",
      "publishedAt": "2023-08-30T15:49:26Z",
      "title": "Judge holds Giuliani liable in Georgia election workers' defamation case for withholding information",
      "url": "https://apnews.com/9b561a195fb74d991abc89d1b6587d66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d50ecb82794245eea12cbe2b33819d92/3000.jpeg"
    },
    {
      "author": "STEVE LeBLANC",
      "description": "DEDHAM, Mass. (AP) — The once-powerful Roman Catholic Cardinal Theodore McCarrick will not stand trial on charges he sexually assaulted a teenage boy decades ago, as a Massachusetts judge dismissed the case against the 93-year-old on Wednesday because both prosecutors and defense attorneys agree he suffers from dementia.",
      "publishedAt": "2023-08-30T17:02:53Z",
      "title": "Ex-Catholic cardinal McCarrick, age 93, is not fit to stand trial on teen sex abuse charges",
      "url": "https://apnews.com/4ef431ec2ff51c42f5f895d603764207",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a673bd9452a402d8e6841c1e12eb13e/2694.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Tesla is allowing some drivers to use its Autopilot driver-assist system for extended periods without making them put their hands on the steering wheel, a development that has drawn concern from U.S.",
      "publishedAt": "2023-08-30T11:51:07Z",
      "title": "Tesla is allowing no-hands driving with Autopilot for longer periods. US regulators have questions",
      "url": "https://apnews.com/8468bebd1602c242131649fc3c64e489",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ad2f41cff4c4d149d643d0891b1dfaf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}