{
  "articles": [
    {
      "author": "Seung Min Kim",
      "description": "President Donald Trump has floated cutting tariffs on China from 145% to 80% ahead of a weekend meeting as he looks to deescalate the trade war. Top U.S. officials are set to meet with a high-level Chinese delegation in Switzerland in the first major talks between the two nations since Trump sparked a trade war with stiff tariffs on imports. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson Greer will meet with their counterparts in Geneva in the most-senior known conversations between the two countries in months. It comes amid growing U.S. market worry over the impact of the tariffs on the prices and supply of consumer goods.",
      "publishedAt": "2025-05-09T11:39:51Z",
      "title": "Trump floats cutting China tariffs to 80% ahead of meeting",
      "url": "https://apnews.com/article/trump-tariffs-china-41d189bfe510e3ed7692da8647a14e64",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c358f6/2147483647/strip/true/crop/5858x3295+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F63%2F5642ecbdae186798c3b77fc70415%2F20c88dc7dbae4c338f80acb05908381d"
    },
    {
      "author": "Didi Tang",
      "description": "Before high-level U.S. and Chinese officials hold talks in Switzerland this weekend to discuss high tariffs, Washington and Beijing have been in a rhetorical duel over which side reached out first. Beijing insists that it is the Trump administration that requested the meeting, but President Donald Trump has retorted by asking the Chinese to “study their files.\" Experts call it a proxy fight over leverage when both sides want to project strength ahead of what is expected to be tough tariff negotiations.",
      "publishedAt": "2025-05-09T17:55:53Z",
      "title": "China and US go back and forth about who called the other first",
      "url": "https://apnews.com/article/china-united-states-trump-xi-jinping-diplomacy-3d476906422ba9749641c82979f67c28",
      "urlToImage": "https://dims.apnews.com/dims4/default/1bb9587/2147483647/strip/true/crop/7831x4405+0+408/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Fda%2Fb0d989d8c31751838a302cbd757c%2F628fcf4a16d74eb28dc0bf42bda4ae22"
    },
    {
      "author": "Munir Ahmed",
      "description": "Pakistan’s army spokesman says India has fired missiles at three air bases inside the country, but most of the missiles have been intercepted. Lt. Gen. Ahmad Sharif said the assets of the Pakistan Air Force are safe. He made this announcement during his televised address, saying some of the Indian missiles have also hit India’s eastern Punjab.",
      "publishedAt": "2025-05-09T23:03:19Z",
      "title": "Pakistan's army spokesman says India has fired missiles at 3 Pakistani air bases",
      "url": "https://apnews.com/article/india-pakistan-missiles-air-bases-1de0ca13c13899f0bd3530b4808d45ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2a69bd/2147483647/strip/true/crop/7203x4052+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F5b%2Ff167ac4b2dd36820616fff87a055%2Ff2f652c417164790a65310dc0aed29c6"
    },
    {
      "author": "Lolita Baldor",
      "description": "The Pentagon has ordered all military leaders and commands to pull and review all of their library books that address diversity, anti-racism or gender issues by May 21. That's according to a memo issued to the force on Friday. It is the broadest and most detailed directive so far on Defense Secretary Pete Hegseth’s campaign to rid the military of diversity and equity programs, policies and instructional materials. And it follows similar efforts to remove hundreds of books from the libraries at the military academies. The Associated Press obtained a copy of the memo.",
      "publishedAt": "2025-05-09T18:21:41Z",
      "title": "Pentagon directs military to pull library books that address DEI issues",
      "url": "https://apnews.com/article/pentagon-hegseth-dei-library-books-770364ab99591402ddffe8758432ff26",
      "urlToImage": "https://dims.apnews.com/dims4/default/1702afe/2147483647/strip/true/crop/4939x2778+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2F2d%2Fa1a73a6453a091a9104cd6514da7%2F997cd54082b5469698c2d92a8bc04660"
    },
    {
      "author": "Jake Offenhartz, Claudia Lauer",
      "description": "The mayor of Newark, New Jersey, has been arrested at a federal immigration detention center where he has been protesting its opening this week. A federal prosecutor says on the social platform X that Ras Baraka committed trespass Friday and ignored warnings to leave the Delaney Hall facility. Witnesses say Baraka tried to enter the center with three members of New Jersey’s congressional delegation who arrived unannounced to inspect it. They say he was arrested after returning to public property. Baraka has protested the construction and opening of the 1,000-bed detention center, including filing a lawsuit challenging its permits. The facility is run by a private operator.",
      "publishedAt": "2025-05-09T19:38:34Z",
      "title": "Mayor Baraka of Newark, New Jersey, arrested at immigration detention center he has been protesting",
      "url": "https://apnews.com/article/immigration-protest-ice-newark-mayor-arrested-5a2b3fefd7da563c48d2f85831cf2194",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ed60fe/2147483647/strip/true/crop/4000x2250+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fd8%2Ffd9bba1fb24e64892c2abe8795f6%2F67ba3b60e9bf467c88dc7098f459b9f1"
    },
    {
      "author": "Josh Funk",
      "description": "The air traffic controllers directing planes into the Newark, New Jersey, airport lost their radar Friday morning for the second time in two weeks. The Federal Aviation Administration said the radar at the facility in Philadelphia that directs planes in and out of Newark airport went black for 90 seconds at 3:55 a.m. Friday. That’s similar to what happened on April 28. That first radar outage led to hundreds of flights being cancelled or delayed at the Newark airport in the past two weeks after the FAA slowed down traffic at the airport to ensure safety.",
      "publishedAt": "2025-05-09T15:41:58Z",
      "title": "Air traffic controllers briefly lose radar access again at Newark airport",
      "url": "https://apnews.com/article/newark-airport-radar-outage-c41c772690e710b39412cd02c83819f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b48945/2147483647/strip/true/crop/7627x4290+0+397/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2Fc3%2F345a4631cd274fff782f78d2ca93%2Fb53aa00bbd10403480706729030a7eb8"
    },
    {
      "author": "Mark Sherman",
      "description": "Retired Supreme Court Justice David H. Souter has died at age 85. The ascetic bachelor and New Hampshire Republican became a darling of liberals during his nearly 20 years on the bench. The court says Souter died Thursday at his home in New Hampshire. He retired from the court in June 2009, giving President Barack Obama his first Supreme Court vacancy to fill. Obama chose Sonia Sotomayor, the court’s first Latina justice. Souter was appointed by Republican President George H.W. Bush in 1990. He was a reliably liberal vote on abortion, church-state relations, freedom of expression and the accessibility of federal courts.",
      "publishedAt": "2025-05-09T13:11:37Z",
      "title": "Supreme Court says retired Justice David Souter has died at age 85",
      "url": "https://apnews.com/article/supreme-court-justice-david-souter-dies-8cf552b7322297b03ef8c251a6a11d13",
      "urlToImage": "https://dims.apnews.com/dims4/default/836940d/2147483647/strip/true/crop/2000x1125+0+148/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2Fcc%2F31dd14556d506714e2c0b6589e5f%2F00c9d83b66484a5a8065e907fb6dc532"
    },
    {
      "author": "Kathy Mccormack",
      "description": "A federal judge in Vermont has released a Turkish Tufts University student detained in a Louisiana immigration center more than six weeks after she was arrested while walking along a street in a Boston suburb. U.S. District Judge William Sessions in Burlington released Rumeysa Ozturk on Friday pending a final decision on her claim that she’s been illegally detained following an op-ed she co-wrote lsat year that criticized the school's response to Israel's war in Gaza. Ozturk appeared at her bail hearing remotely from Louisiana, describing her growing asthma attacks in detention and her desire to finish her doctorate degree focusing on children and social media.",
      "publishedAt": "2025-05-09T10:51:26Z",
      "title": "Judge releases the Turkish Tufts University student who was detained by ICE to continue her studies",
      "url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-students-detained-034d97a7e280c68a7d1fb6aa879ce87c",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a99ed9/2147483647/strip/true/crop/1625x914+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2Fe6%2F9da45451c23a512a5f69fbb21455%2F954c92fae59f4ae29a7fd7cbe5f46aca"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV will celebrate his first Mass after his historic election as the first North American pope. He will meet on Friday with the cardinals who chose him to lead the Catholic Church and follow in Pope Francis’ reform-minded footsteps. Leo, the Chicago-born Augustinian missionary Robert Prevost, surprised the world on Thursday when he emerged on the loggia of St. Peter’s Basilica, since there had long been a taboo against a pope from the United States. He spoke to the crowd in Italian and Spanish, but not English, and honored Pope Francis for his final salute to the crowd on Easter Sunday.",
      "publishedAt": "2025-05-09T05:00:24Z",
      "title": "Pope Leo XIV celebrates first Mass as Francis' successor",
      "url": "https://apnews.com/article/vatican-pope-prevost-leo-cardinals-1c1752bacc935c02af5f839a05de9a39",
      "urlToImage": "https://dims.apnews.com/dims4/default/c5a2ace/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F9f%2Febbfc2d8cc573d37091e642f4be5%2F9bc7f431112d4b6eb0cb9c3ae6a2e274"
    },
    {
      "author": "Larry Neumeister",
      "description": "The judge presiding over the racketeering and sex trafficking trial of hip-hop mogul Sean “Diddy” Combs says there was no evidence to back up his lawyers' claim he was treated differently because of his race. Judge Arun Subramanian ruled Friday and rejected the request to dismiss some charges against Combs. The ruling came three days before opening statements are scheduled to occur in Manhattan federal court. Combs has pleaded not guilty to charges that he oversaw a racketeering enterprise from 2004 to 2024 that enabled him to sexually abuse women.",
      "publishedAt": "2025-05-09T13:21:51Z",
      "title": "Judge rejects claim that Sean 'Diddy' Combs was treated differently because of his race",
      "url": "https://apnews.com/article/diddy-trial-sean-combs-jury-selection-0b39534163eddaa80fe05976ca892d7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/48e6bd3/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2Fa0%2Fa08f2119e62958105c7e606147b0%2F65600b9539f14188b65e14c2082c7f30"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}