{
  "articles": [
    {
      "author": "ISABEL DEBRE, JULIA FRANKEL and SAM MAGDY",
      "description": "JERUSALEM (AP) — Israel on Saturday expanded its ground operation in Gaza with infantry and armored vehicles backed by “massive” strikes from the air and sea, including the bombing of Hamas tunnels — a key target in its campaign to crush the territory’s ruling group after its bloody incursion in Israel three weeks ago.",
      "publishedAt": "2023-10-28T05:34:13Z",
      "title": "Israel expands ground operation in Gaza and bombs Hamas tunnels after knocking out communications",
      "url": "https://apnews.com/c9bd7ecc5f4a9fe9d46486f66675244c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ab9d64e0fe74af9888ead7eb73c5537/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel launched an expanded ground operation on Saturday after knocking out communications and creating a near-blackout of information in the Gaza Strip with increased bombardment and artillery fire overnight.",
      "publishedAt": "2023-10-28T06:45:04Z",
      "title": "Live updates | Israel increases military operations as regional leaders call for halt and aid",
      "url": "https://apnews.com/3348f0544aa6d66b280c8cab1637a3db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dec698b953ac4fa4b1d7c72b6b2e804d/1920.jpeg"
    },
    {
      "author": "DAVID SHARP, PATRICK WHITTLE, HOLLY RAMER and MICHELLE R. SMITH",
      "description": "LEWISTON, Maine (AP) — The Army reservist who opened fire in a bowling alley and then at a bar in Lewiston, Maine, killing 18 people, was found dead Friday from a self-inflicted gunshot, ending an intensive two-day search that had the state on edge.",
      "publishedAt": "2023-10-27T05:03:11Z",
      "title": "Maine mass killing suspect found dead, ending search that put entire state on edge",
      "url": "https://apnews.com/fed5ab0aaee9d7d4c0f0fccb3d301bb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/784eceb2c30c4b9389bbcf91682898ac/1920.jpeg"
    },
    {
      "author": "HOLLY RAMER and MICHELLE R. SMITH",
      "description": "LEWISTON, Maine (AP) — The first loud noise 10-year-old Toni Asselin heard sounded like the thwack of a ball being hit hard across a pool table. She thought the second might have been someone dropping a bowling ball.",
      "publishedAt": "2023-10-28T04:20:20Z",
      "title": "When a man began shooting in Maine, some froze while others ran. Now they're left with questions",
      "url": "https://apnews.com/ebd05706f059bbe482bff6797604df93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a6ef615763d4387a577451d1f5e4426/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An Iranian teenage girl injured weeks ago in a mysterious incident on Tehran's Metro while not wearing a headscarf has died, state media reported Saturday.",
      "publishedAt": "2023-10-28T06:41:33Z",
      "title": "Iranian teen injured on Tehran Metro while not wearing a headscarf has died, state media says",
      "url": "https://apnews.com/16c4f49e15dd774121e7498f34bd6622",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b0764608fb94e1ab8b6cf0f90ad29d6/2920.jpeg"
    },
    {
      "author": "MARK STEVENSON and MEGAN JANETSKY",
      "description": "ACAPULCO, Mexico (AP) — In a city without water, electricity or gasoline, where desperate people have been allowed, even encouraged, to take essential goods from damaged stores since Hurricane Otis smashed Acapulco, state police officer Raúl Gallardo stood guard over a mountain of excess.",
      "publishedAt": "2023-10-28T05:04:37Z",
      "title": "Acapulco residents are fending for themselves in absence of aid",
      "url": "https://apnews.com/398e6957c0ea05e857d377d9f9c0b311",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9006f3593a6b42e9b7a83cbbb032ae50/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — A sea of hundreds of protesters filled the main concourse of New York City’s famed Grand Central Terminal during the evening rush hour Friday, chanting slogans and unfurling banners demanding a cease-fire as Israel intensified its bombardment of the Gaza Strip.",
      "publishedAt": "2023-10-28T05:03:24Z",
      "title": "NYC protesters demand Israeli cease-fire, at least 200 detained after filling Grand Central station",
      "url": "https://apnews.com/b6ceeb689b3d3c1e02a9a57f4796c048",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd2d54ec20e6443292d4d82172910a88/3000.jpeg"
    },
    {
      "author": "MARIAM FAM",
      "description": "For many of the university chaplains and faith leaders caring for students angered and shaken by the Israel-Hamas war, the needs are acute, the days intense. The bloodshed has roiled campuses in the United States, at times sparking rival rallies and competing demands.",
      "publishedAt": "2023-10-28T11:02:30Z",
      "title": "Jewish and Muslim chaplains navigate US campus tensions and help students roiled by Israel-Hamas war",
      "url": "https://apnews.com/5e0b485b7b018bfec4a6e6971856947f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a22149d1343044b88ad0209425486761/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump is set to testify Nov. 6 at his New York civil fraud trial, following his three eldest children to the witness stand in a case that threatens to disrupt their family's real estate empire, state lawyers said Friday.",
      "publishedAt": "2023-10-27T04:12:45Z",
      "title": "Donald Trump is set to testify Nov. 6 in civil fraud trial. Daughter Ivanka also will testify",
      "url": "https://apnews.com/c7018a92f3a2cb2496a55ad1cacf2412",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e9b620e984f49e59f57a59d8024cf50/1920.jpeg"
    },
    {
      "author": "STEPHEN HAWKINS",
      "description": "ARLINGTON, Texas (AP) — Adolis García took a few steps while watching the ball before tossing his bat aside after another big swing this postseason. This one won an extended Game 1 of the World Series for the Texas Rangers.",
      "publishedAt": "2023-10-28T04:25:36Z",
      "title": "García's HR in 11th, Seager's tying shot in 9th rally Rangers past Arizona 6-5 in Series opener",
      "url": "https://apnews.com/3158e768b217fe406d1a43ef2da27250",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b30fa05060a4826af509c2f2292c064/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}