{
  "articles": [
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A man who authorities say staked out Donald Trump for 12 hours on his golf course in Florida and wrote of his desire to kill him was indicted Tuesday on an attempted assassination charge.",
      "publishedAt": "2024-09-24T22:17:03Z",
      "title": "Man who staked out Trump at Florida golf course charged with attempting an assassination",
      "url": "https://apnews.com/b4c956e1a126e4acfb3c4eae0c06ddb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a7e29ac38c344589ba6d0bf450c316e/2187.jpeg"
    },
    {
      "author": "ABBY SEWELL and NATALIE MELZER",
      "description": "BEIRUT (AP) — Israel killed a top Hezbollah commander Tuesday as part of a two-day bombing campaign that has left more than 560 people dead and prompted thousands in southern Lebanon to seek refuge from the widening conflict.",
      "publishedAt": "2024-09-24T09:24:58Z",
      "title": "Israel bombards Hezbollah, killing a top commander, while families flee southern Lebanon",
      "url": "https://apnews.com/640a0046aceea1b5cfb395a54ff36bce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/217a1b8f644e457ea8f60f1ebdf344a9/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — After almost a year of trading fire, Israel and the Lebanese militant group Hezbollah are now engaged in ferocious confrontations that threaten to turn into a full-blown war.",
      "publishedAt": "2024-09-24T16:42:06Z",
      "title": "What is Hezbollah, the group battling Israel in Lebanon?",
      "url": "https://apnews.com/b4daa0a6084df27099cef45b59120034",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/efdf649fb09e4b9db54156dfa380121e/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB and JIM SALTER",
      "description": "BONNE TERRE, Mo. (AP) — A Missouri man was executed Tuesday for breaking into a woman’s home and killing her, despite calls by her family and the prosecutor’s office that put him on death row to let him serve out the rest of his life in prison.",
      "publishedAt": "2024-09-24T14:49:28Z",
      "title": "Missouri executes a man for the 1998 killing of a woman despite her family’s calls to spare his life",
      "url": "https://apnews.com/8be20e2f252992610a30fa0cfef4185a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/198c2506da61465b8b60087458119e7b/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, MATTHEW LEE and ZEKE MILLER",
      "description": "UNITED NATIONS (AP) — President Joe Biden declared in his final address to the U.N.",
      "publishedAt": "2024-09-24T04:03:29Z",
      "title": "Biden in farewell U.N. address says peace still possible in conflicts in Mideast and Ukraine",
      "url": "https://apnews.com/4e4e839c3cdd4edd7543aea84af2346f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3599387e97fc4935adf3ae23d2967f72/2625.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "Conspiracy theorist Alex Jones ' Infowars media platform and its assets will be sold off piece by piece in auctions this fall to help pay the more than $1 billion he owes relatives of victims of the Sandy Hook Elementary School shooting, under an order expected to be approved by a federal judge.",
      "publishedAt": "2024-09-24T22:59:11Z",
      "title": "Judge to approve auctions liquidating Alex Jones' Infowars to help pay Sandy Hook families",
      "url": "https://apnews.com/9052caad16dcdfd3bff0697454394d9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e95ad3ef51c475b8135b071ebbe50d5/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER and JENNIFER PELTZ",
      "description": "UNITED NATIONS (AP) — The head of the United Nations warned the gathered leaders of nations Tuesday that impunity, inequality and uncertainty are driving modern civilization toward “a powder keg that risks engulfing the world\" — the latest in an increasing number of clarion calls from Antonio Guterres in recent years that the global situation is becoming intolerable and unsustainable.",
      "publishedAt": "2024-09-24T05:07:12Z",
      "title": "Head of United Nations calls global situation 'unsustainable' as annual meeting of leaders opens",
      "url": "https://apnews.com/e9b8bd0ee132f6a7f56555975f67b0de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed70363778594c658422157053745ea8/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, WILL WEISSERT and TOM KRISHER",
      "description": "SAVANNAH, Ga. (AP) — Donald Trump on Tuesday pledged to stop U.S. businesses from shipping jobs overseas and to take other countries’ jobs and factories by relying heavily on sweeping tariffs to boost auto manufacturing — despite warnings that domestic consumers would pay more and a lack of specifics about how his plans would work.",
      "publishedAt": "2024-09-24T12:47:44Z",
      "title": "Trump calls for 100% tariffs on cars made in Mexico as part of US manufacturing plan",
      "url": "https://apnews.com/cb60395d632e7eaa2a398abcf616d1be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae417786b13949d4a69c957336708af9/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Two major weather systems are bringing heavy rain, high winds and more to Mexico's southern Pacific coast on one side and the Caribbean on the other.Tropical Storm John struck Mexico late Monday with life-threatening flood potential after growing into a Category 3 hurricane in a matter of hours.",
      "publishedAt": "2024-09-24T14:56:19Z",
      "title": "Tropical Weather Latest: Tropical Storm Helene forms in Caribbean, Tropical Storm John weakens",
      "url": "https://apnews.com/5a878562087e527a9ef7ba4d0b50de32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0f94917581a4642a9553a7557917ca7/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Caroline Ellison, a former top executive in Sam Bankman-Fried ’s fallen FTX cryptocurrency empire, was sentenced to two years in prison on Tuesday after she apologized to everyone hurt by a fraud that stole billions of dollars from investors, lenders and customers.",
      "publishedAt": "2024-09-24T04:12:15Z",
      "title": "Tearful Caroline Ellison gets 2 years in prison over her role in FTX fraud",
      "url": "https://apnews.com/18ebfcdee1af8527511e30c9b45de045",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ffb2b4748394ec69da3815bf9a86a60/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}