{
  "articles": [
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukraine's stunning incursion into Russia’s Kursk border region was a bold gamble for the country's military commanders, who committed their limited resources to a risky assault on a nuclear-armed enemy with no assurance of success.",
      "publishedAt": "2024-08-15T04:28:16Z",
      "title": "Ukraine gambled on an incursion deep into Russian territory. The bold move changed the battlefield",
      "url": "https://apnews.com/e862afd58c65d6d2d5b7b3747423ca4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/201c13d7acd4487ca564533067f498e5/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "DOHA, Qatar (AP) — A top Hamas official said the Palestinian militant group is losing faith in the United States’ ability to mediate a cease-fire in Gaza ahead of a new round of talks scheduled for this week amid mounting pressure to bring an end to the 10-month-old war with Israel.",
      "publishedAt": "2024-08-14T15:44:47Z",
      "title": "A top Hamas official says the group is losing faith in the US as a mediator in Gaza cease-fire talks",
      "url": "https://apnews.com/8509c5e68d57c96af99653c8292180b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/078bd9aec3634dddaad0d99cc78e02a9/1920.jpeg"
    },
    {
      "author": null,
      "description": "BEDMINSTER, N.J. (AP) — Former President Donald Trump invited reporters to his New Jersey golf club Thursday for his second news conference in as many weeks as he adjusts to a newly energized Democratic ticket ahead of next week's Democratic National Convention.",
      "publishedAt": "2024-08-15T04:08:40Z",
      "title": "Trump scheduled to hold news conference at his New Jersey golf resort",
      "url": "https://apnews.com/9af8036585d6727b6bb07008c0690cdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac9925cac8804757b8d85b391f440138/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — As the Democratic National Convention approaches, a recent poll from The Associated Press-NORC Center for Public Affairs Research finds that Democrats have slightly higher trust in Vice President Kamala Harris' ability to address the issue of climate change than President Joe Biden.",
      "publishedAt": "2024-08-15T04:01:47Z",
      "title": "Democrats trust Harris slightly more than Biden on climate change, AP-NORC poll finds",
      "url": "https://apnews.com/affebfcfe34d3f5e38c37bf597f10953",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fa9d129895c411bb25f304046b30d81/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and PHILIP MARCELO",
      "description": "NEW YORK (AP) — Columbia University President Minouche Shafik resigned Wednesday after a brief, tumultuous tenure that saw the head of the prestigious New York university face heavy scrutiny for her handling of protests and campus divisions over the Israel-Hamas war.",
      "publishedAt": "2024-08-15T00:18:43Z",
      "title": "Columbia's president resigns after months of turmoil punctuated by clashes over Israel-Hamas war",
      "url": "https://apnews.com/2497a023eecdd267f3f9189e9f010fce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ab29cefbdb041ad99435bf1d4ecfadd/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KABUL, Afghanistan (AP) — The Taliban have deliberately deprived 1.4 million Afghan girls of schooling through bans, a U.N.",
      "publishedAt": "2024-08-15T04:56:17Z",
      "title": "Taliban have deliberately deprived 1.4 million Afghan girls of schooling through bans, says UNESCO",
      "url": "https://apnews.com/da2c1ec7b1b5e27c6bcf34052553860b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f7bf00093bb4a2081daabfc00ff8206/3000.jpeg"
    },
    {
      "author": "FRANKLIN BRICEÑO, ASTRID SUÁREZ and NAYARA BATSCHKE",
      "description": "LIMA, Peru (AP) — President Nicolás Maduro's contested claim of victory in last month's election not only threw Venezuela into uncertainty but also spread anxiety from neighboring Colombia to faraway Chile as the region braced for a new migration surge.",
      "publishedAt": "2024-08-15T04:04:11Z",
      "title": "As fallout surges from Venezuela's election crisis, the region fears another mass exodus",
      "url": "https://apnews.com/4f922c50fae4bd0c1ca97e0735194c2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a52d7482f3441a1bd0802fc1e83251f/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "TOA BAJA, Puerto Rico (AP) — Hurricane Ernesto dropped torrential rain on Puerto Rico and knocked out power for nearly half of all customers in the U.S.",
      "publishedAt": "2024-08-14T10:42:25Z",
      "title": "Hurricane Ernesto drops torrential rain on Puerto Rico while pummeling northeast Caribbean",
      "url": "https://apnews.com/cb633e600fad24430d3d540f8a522974",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2dd825083c244425a6e076b773ae5e36/1920.jpeg"
    },
    {
      "author": "SEJAL GOVINDARAO",
      "description": "PHOENIX (AP) — An informational pamphlet for Arizona voters, who will decide in the fall whether to guarantee a constitutional right to an abortion, can refer to an embryo or fetus as an “unborn human being,” the state’s highest court ruled Wednesday.",
      "publishedAt": "2024-08-14T19:46:57Z",
      "title": "Ruling: Fetus can be referred to as 'unborn human being' in Arizona abortion measure voter pamphlet",
      "url": "https://apnews.com/b0ea37c92692533da109fd74a07b25f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78fcc690ff5f485580afe4507c62a8c6/3000.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — The World Health Organization declared the mpox outbreaks in Congo and elsewhere in Africa a global emergency on Wednesday, with cases confirmed among children and adults in more than a dozen countries and a new form of the virus spreading.",
      "publishedAt": "2024-08-14T17:30:34Z",
      "title": "WHO declares mpox outbreaks in Africa a global health emergency as a new form of the virus spreads",
      "url": "https://apnews.com/cc9bdf31b49d06bec5efd44fb55d5e42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fbd0ba40dcb4650b5f23979fd2dbca2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}