{
  "articles": [
    {
      "author": "JULIE CARR SMYTH, JILL COLVIN, COLLEEN LONG, MICHAEL BALSAMO, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "BUTLER, Pa. (AP) — Former President Donald Trump called for unity and resilience Sunday after an attempt on his life injected fresh uncertainty into an already tumultuous presidential campaign, while President Joe Biden implored Americans to “cool it down” in the final stretch and “resolve our differences at the ballot box.”",
      "publishedAt": "2024-07-14T12:40:25Z",
      "title": "Trump heads to convention as authorities investigate motive, security in assassination attempt",
      "url": "https://apnews.com/db24c5bfbbe7d09fa2437c3c836bb434",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d964c24c093f4639afc081a07571025d/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden on Sunday urged Americans to reject political violence and recommit themselves to resolving their differences peacefully, saying the upcoming presidential election will be a “time of testing” in the aftermath of the attempted assassination of former President Donald Trump.",
      "publishedAt": "2024-07-14T15:48:47Z",
      "title": "In prime-time address, Biden asks Americans to reject political violence and 'cool it down'",
      "url": "https://apnews.com/704592d02c3421a767112f0bf6d25eb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e537f31e103249a1adef3ab84edef21a/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and GARY FIELDS",
      "description": "WASHINGTON (AP) — “Tone it down!”That was the plea from one Republican congressman as he came to grips with the assassination attempt against Donald Trump at a political rally in the Butler Farm area where he grew up.",
      "publishedAt": "2024-07-15T01:51:15Z",
      "title": "America's toxic political climate faces calls to 'tone it down' after assassination attempt on Trump",
      "url": "https://apnews.com/1e4b414279af1872b07ac40385678b3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9808b00bd1664248beda076a48d96dee/3000.jpeg"
    },
    {
      "author": "BY AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — Authorities want to know how a shooter was able to get on top of a roof so close to where former President Donald Trump was speaking and open fire.",
      "publishedAt": "2024-07-14T03:46:05Z",
      "title": "What to know about Trump assassination attempt and the investigation into the shooting",
      "url": "https://apnews.com/ae383dee203d82ddf38d2e76c63a8bc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf83de39d99b4653ab645ef5c2f07f93/1920.jpeg"
    },
    {
      "author": "RON TODT, MARK SCOLFORO and KIMBERLEE KRUESI",
      "description": "BUFFALO TOWNSHIP, Pa. (AP) — The former fire chief who was killed at a Pennsylvania rally for Donald Trump spent his final moments diving down in front of his family, protecting them from the gunfire that rang out Saturday during an assassination attempt against the former president.",
      "publishedAt": "2024-07-14T18:43:36Z",
      "title": "Former fire chief who died at Trump rally used his body to shield family from gunfire",
      "url": "https://apnews.com/11e1aa65e6e45584f49577686d38766e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/069bc38e197c4ab58c0fee31264be02d/1920.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER, ALANNA DURKIN RICHER, MICHAEL BALSAMO and JIM MUSTIAN",
      "description": "WASHINGTON (AP) — The 20-year-old man who tried to assassinate former President Donald Trump first came to law enforcement’s attention at Saturday's rally when spectators noticed him acting strangely outside the campaign event.",
      "publishedAt": "2024-07-14T13:09:53Z",
      "title": "Authorities hunt for clues, but motive of man who tried to assassinate Donald Trump remains elusive",
      "url": "https://apnews.com/881581c46c07025898027143fc9132e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52fd7c9fd499418db0ed211bcabb2978/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "MILWAUKEE (AP) — Activists gathering in Milwaukee for the start of the Republican National Convention say the assassination attempt on former President Donald Trump won't affect their long-standing plans to demonstrate outside the convention site this week.",
      "publishedAt": "2024-07-15T04:13:48Z",
      "title": "GOP convention protests are on despite shooting at Trump rally",
      "url": "https://apnews.com/4a315dc5f36fc9390898301d508aee20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd7f93f0b82749aeb736856840d95c68/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and MELANIE LIDMAN",
      "description": "MUWASI, Gaza Strip (AP) — Hamas said Sunday that Gaza cease-fire talks were ongoing and the group’s military commander was in good health, a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials said killed at least 90 people, including children.",
      "publishedAt": "2024-07-14T13:45:44Z",
      "title": "Hamas says Gaza cease-fire talks haven't paused and claims military chief survived Israeli strike",
      "url": "https://apnews.com/728bb0842141ba246456422ebf93deb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb94fb8b0f8947389e4aca1e0b4d235d/3000.jpeg"
    },
    {
      "author": "DEREK GATOPOULOS and ANTON SHTUKA",
      "description": "NORTHERN UKRAINE (AP) — Struggling with manpower shortages, overwhelming odds and uneven international assistance, Ukraine hopes to find a strategic edge against Russia in an abandoned warehouse or a factory basement.",
      "publishedAt": "2024-07-15T04:10:32Z",
      "title": "From basement to battlefield: Ukrainian startups create low-cost robots to fight Russia",
      "url": "https://apnews.com/b07de714659ef859e16c51d7cda4256b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2362cd9028c4264baa6c7c8988198fe/3000.jpeg"
    },
    {
      "author": "ALANIS THAMES",
      "description": "MIAMI GARDENS, Fla. (AP) — Argentina won its second straight Copa America championship, overcoming Lionel Messi’s second-half leg injury to beat Colombia 1-0 Sunday night on Lautaro Martínez’s 112th-minute goal.",
      "publishedAt": "2024-07-15T04:17:14Z",
      "title": "Argentina wins record 16th Copa America title, beats Colombia 1-0 after Messi gets hurt",
      "url": "https://apnews.com/6753475603a48683a3c4971e451e8263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5720ab44ae34277a662163cb69c25ec/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}