{
  "articles": [
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has a new advertising push to draw attention to her plan to build 3 million new homes over four years, a move designed to contain inflationary pressures that also draws a sharp contrast to Republican Donald Trump's approach.",
      "publishedAt": "2024-08-27T09:03:28Z",
      "title": "Harris campaign releases a new ad to highlight plans to build 3 million homes and reduce inflation",
      "url": "https://apnews.com/00ae665790649d3b25d77a6cc0d111d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a12a180e5104e749b5261db6f2432fe/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — A federal judge in Texas on Monday paused a Biden administration policy that would give spouses of U.S. citizens legal status without having to first leave the country, dealing at least a temporary setback to one of the biggest presidential actions to ease a path to citizenship in years.",
      "publishedAt": "2024-08-27T00:08:49Z",
      "title": "Judge in Texas orders pause on Biden program that offers legal status to spouses of US citizens",
      "url": "https://apnews.com/80df0dafd913a22fd7a9074d31eeab65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0a1614d85b14f2c9550a45081bb840f/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Palestinian officials say Israeli airstrikes across the Gaza Strip have killed at least 18 people, including eight children.The Civil Defense, first responders who operate under the Hamas-run government, said three children and their mother were killed in an airstrike late Monday in the Tufah neighborhood of Gaza City.",
      "publishedAt": "2024-08-27T06:34:59Z",
      "title": "Israel-Hamas war latest: Israeli strikes across Gaza kill 18, including 8 children, Palestinians say",
      "url": "https://apnews.com/f4b88923f7e83ca9ae60f7f5d6e2c446",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fd3192681ed43e89ccc8f92e3748279/1920.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Nighttime Russian drone and missile attacks struck across Ukraine, killing at least five people on Tuesday, a day after a heavy barrage pounded energy facilities throughout the country.",
      "publishedAt": "2024-08-27T07:36:38Z",
      "title": "Russian missiles and drones strike across Ukraine and kill at least 5 people",
      "url": "https://apnews.com/b8f21176d417f38a7194e8cc1b9179e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2cac4be3d90470cb0650cb5c6dce2fa/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "ERFURT, Germany (AP) — It was a balmy summer night in 2020, shortly after the lifting of Germany’s first COVID-19 lockdown, and Omar Diallo and two friends from his home country of Guinea wanted to celebrate Eid al-Adha, the Muslim festival of sacrifice.",
      "publishedAt": "2024-08-27T09:20:20Z",
      "title": "Being Black in Germany has never been easy. Elections in eastern states could make it harder still",
      "url": "https://apnews.com/99206941a9694e8d2d49ed0b64ae52a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e48db0096bb4c9a80be0be8c14d4e1b/1920.jpeg"
    },
    {
      "author": null,
      "description": "FALCON HEIGHTS, Minn. (AP) — It's been a wild week of weather in many parts of the United States, from heat waves to snowstorms to flash floods.Here's a look at some of the weather events:Midwest sizzles under heat wave",
      "publishedAt": "2024-08-27T04:08:03Z",
      "title": "Wild week of US weather includes heat wave, tropical storm, landslide, flash flood and snow",
      "url": "https://apnews.com/74406ed40b60e8dff405488e0e483fc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfcd022d9f3a4c68b90e25fb4dcf83b3/3000.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — The 4-year-old boy struggled to balance while walking through the living room. His mother’s eyes attentively followed his every move. Then a seizure knocked him to the ground, the dull thud of his small body echoing through the home.",
      "publishedAt": "2024-08-27T04:06:52Z",
      "title": "Brazilian moms are leading the charge to secure medical marijuana for sick kids",
      "url": "https://apnews.com/d50fb583aa401bbed2af4aef5ec851b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b67c6d9ba72496dafa931e7fe0ff2e5/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — A French investigative judge extended police custody for the CEO of the popular messaging app Telegram, Pavel Durov, prosecutors said on Tuesday.",
      "publishedAt": "2024-08-27T09:56:43Z",
      "title": "French judge extends police custody for Telegram CEO Pavel Durov",
      "url": "https://apnews.com/ffc4cb0b80af1b65414644af9ad7864d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c1135b9f351437dba25a7196b3cd209/1920.jpeg"
    },
    {
      "author": "CIARÁN FAHEY and TOM NOUVIAN",
      "description": "PARIS (AP) — Let the games begin again.The Paralympic Games are set to open Wednesday as some 4,400 athletes with disabilities, permanent injuries or impairments prepare to compete for 549 medals across 22 sports over 11 days in Paris.",
      "publishedAt": "2024-08-27T08:35:31Z",
      "title": "The Paralympic Games are starting. Here's what to expect as 4,400 athletes compete in Paris",
      "url": "https://apnews.com/6ab076125149ac809815f17daf1b83be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ff512cc7b7e4926874a09bc5f7794f9/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA and MARIA SHERMAN",
      "description": "LONDON (AP) — Oasis, the Britpop band known for timeless hits like “Wonderwall” and “Don’t Look Back in Anger,” is reuniting for a tour of the British Isles next summer, ending a 15-year hiatus and, presumably, the long-held feud between brothers Liam and Noel Gallagher.",
      "publishedAt": "2024-08-27T07:09:20Z",
      "title": "Oasis reunites for tour and ends a 15-year hiatus during Gallagher brothers' feud",
      "url": "https://apnews.com/a3e462ea153fec65c5220b43415055b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/decbf5f27cc64a94ae24d2d303ef4c5e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}