{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel has essentially endorsed a framework of a proposed Gaza cease-fire and hostage release deal, and it is now up to Hamas to agree to it, a senior U.S.",
      "publishedAt": "2024-03-02T12:12:07Z",
      "title": "US says Israel has agreed to the framework for a Gaza cease-fire. Hamas must now decide",
      "url": "https://apnews.com/531593c27931a2764357b6f7b11ce394",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3add734fc214229b2fadfbe6f35e008/1920.jpeg"
    },
    {
      "author": "TARA COPP and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — U.S. military C-130 cargo planes dropped food in pallets over Gaza on Saturday in the opening stage of an emergency humanitarian assistance authorized by President Joe Biden after more than 100 Palestinians who had surged to pull goods off an aid convoy were killed during a chaotic encounter with Israeli troops.",
      "publishedAt": "2024-03-02T14:43:48Z",
      "title": "US military aircraft airdrop thousands of meals into Gaza in emergency humanitarian aid operation",
      "url": "https://apnews.com/f8bc071193f89906abf21478bc70a084",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/febc9a2dad81454da3d7024f65b737c7/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN",
      "description": "MIAMI (AP) — A vibrant fishing industry, some of the world’s largest coral reefs, desalination plants supplying millions with drinking water. They're all at risk from large amounts of fertilizer and oil spilled into the Red Sea by the sinking of a cargo ship attacked by Yemen’s Houthi rebels.",
      "publishedAt": "2024-03-02T20:04:21Z",
      "title": "Oil spill, fertilizer leak from sinking of cargo ship highlight risks to Red Sea from Houthi attacks",
      "url": "https://apnews.com/1e130e15ca0863ab40966ea9676cf42b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce9abf2ed5bb4976a6e6cd20cc60eeb4/3000.jpeg"
    },
    {
      "author": "SUMMER BALLENTINE and JONATHAN J. COOPER",
      "description": "COLUMBIA, Mo. (AP) — Former President Donald Trump continued his march toward the GOP nomination on Saturday, winning the Missouri caucuses and sweeping the delegate haul at a party convention in Michigan.",
      "publishedAt": "2024-03-02T05:08:05Z",
      "title": "Trump wins the Missouri caucuses and sweeps Michigan GOP convention as he moves closer to nomination",
      "url": "https://apnews.com/5d3934acc54d6919427cfb025002f15c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb54b3e76e2a49ff9be7fa85fbef5140/1920.jpeg"
    },
    {
      "author": "BROOKE HESS and KEN RITTER",
      "description": "TRUCKEE, Calif. (AP) — A powerful blizzard that a meteorologist termed “as bad as it gets” howled in the Sierra Nevada mountains, closing a long stretch of Interstate 80 in Northern California, forcing ski resorts to shut down, and leaving tens of thousands of homes without power.",
      "publishedAt": "2024-03-02T08:01:57Z",
      "title": "A massive blizzard howls in the Sierra Nevada. High winds and heavy snow close roads and ski resorts",
      "url": "https://apnews.com/d3da8b2ecfca73e2f885d88a83138ac7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb5489f5a27b422d84725fa2d64fe776/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO, ERIC TUCKER and ANTHONY McCARTNEY",
      "description": "WASHINGTON (AP) — Alexander Smirnov was cast by Republicans as one of the FBI’s most trusted informants, offering a “highly credible” account of brazen public corruption by Joe Biden that formed a pillar of the House impeachment investigation of the Democratic president.",
      "publishedAt": "2024-03-02T13:33:51Z",
      "title": "How clean is the dirt on Hunter Biden? A key Republican source is charged with lying to the FBI",
      "url": "https://apnews.com/113c1104052dbdc9302606f6d42c9939",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03a18021aaf94291b490bd733c0bdaa5/3000.jpeg"
    },
    {
      "author": "ANDREW DeMILLO",
      "description": "Oregon is poised to step back from its first-in-the-nation drug decriminalization law with a new measure approved by the state Senate that would reinstate criminal penalties for possessing small amounts of some drugs.",
      "publishedAt": "2024-03-02T21:56:07Z",
      "title": "Oregon may revive penalties for drug possession. What will the change do?",
      "url": "https://apnews.com/3810a6c6bcc7a4fc1cb029cad1f58dee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/870f1ca36d3d4f059020f2eddc358561/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY, JIM VERTUNO and KEN MILLER",
      "description": "STINNETT, Texas (AP) — Firefighters in Texas faced rising temperatures, whipped-up winds and dry air Saturday in their battle to keep the largest wildfire in state history from turning more of the Panhandle into a parched wasteland.",
      "publishedAt": "2024-03-02T12:38:35Z",
      "title": "Firefighters face difficult weather conditions as they battle the largest wildfire in Texas history",
      "url": "https://apnews.com/e00e345808351aa015779a28ec494392",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23e2e63075ea4e1eb060b5b7d5dbedd7/1920.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "BETHEL, N.Y. (AP) — Woodstock didn't even happen in Woodstock.The fabled music festival, seen as one of the seminal cultural events of the 1960s, took place 60 miles (96.5 kilometers) away in Bethel, New York, an even smaller village than Woodstock.",
      "publishedAt": "2024-03-02T05:06:58Z",
      "title": "Peace, music and memories: As the 1960s fade, historians scramble to capture Woodstock's voices",
      "url": "https://apnews.com/b01faae2d19d38e28180c98146891c30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb6cdf691f78496ea6ff1ce48710be25/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO and JESSIE WARDARSKI",
      "description": "NASHVILLE, Tenn. (AP) — The young crowd at a Nashville nightclub was ready to dance under the strobe lights to a throbbing mix of hip-hop, rap and Latin beats.",
      "publishedAt": "2024-03-02T13:19:42Z",
      "title": "No twerking. No drinking. No smoking. But it's still a party at this Christian nightclub",
      "url": "https://apnews.com/da3ed45aa9ee39b1114ff132515a960e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abe0751c79d943c0877bc641c12bc191/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}