{
  "articles": [
    {
      "author": "Michael Biesecker, Jesse Bedayn",
      "description": "Videos that emerged Wednesday show Alex Pretti was forcefully taken to the ground by federal immigration agents after kicking out the tail light of their vehicle during a Minneapolis protest 11 days before he was shot and killed by Border Patrol officers. The Jan. 13 scuffle was captured in a pair of videos that emerged Wednesday evening, showing Pretti shouting an expletive at federal immigration agents and struggling with them before he either breaks free or is let go. The new videos have rekindled the national debate about the death of Pretti, 37, an intensive care nurse at the Minneapolis VA Medical Center. A Minneapolis-based attorney representing Pretti’s parents says the earlier incident in no way justified the officers' use of deadly force more than a week later.",
      "publishedAt": "2026-01-29T03:53:04Z",
      "title": "New videos show Alex Pretti scuffle with federal officers the week before his death",
      "url": "https://apnews.com/article/minneapolis-ice-alex-pretti-videos-immigration-809506eb23f44a3e8f6e53b9fda7b700",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a98fce/2147483647/strip/true/crop/636x424+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2Fd9%2F0f5c6ee63d7a370b85b0b6b6b5f0%2Fab4890130a6b40c4a8787cbb50b24dce"
    },
    {
      "author": "Kate Brumback",
      "description": "FBI agents are executing a search warrant at the Fulton County elections office near Atlanta. An agency spokesperson confirmed the action on Wednesday. The search is taking place at the county's main election office in Union City, just south of Atlanta. A spokesperson declined to provide further details, citing an ongoing matter.",
      "publishedAt": "2026-01-28T18:13:42Z",
      "title": "FBI agents execute search warrant at Fulton County elections office near Atlanta",
      "url": "https://apnews.com/article/fbi-georgia-elections-office-fulton-county-28e736037521b17197760d2394f0ab43",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Russ Bynum",
      "description": "Officials in Mississippi say crews worked through the night to clear stranded vehicles on icy major highways as the eastern U.S. endures what could become its longest period of freezing cold in decades. Mississippi's Department of Transportation dispatched tow trucks and drones late Tuesday to frozen Interstate 55, where three tractor-trailers had stalled and caused a major backup. Gov. Tate Reeves said in social media post that highways remained dangerous Wednesday morning and urged people to stay off the roads. More than 380,000 people, mostly in Mississippi and Tennessee, remain without power days after a winter storm blasted the eastern U.S. with snow and ice. The East Coast could see more snowfall this weekend.",
      "publishedAt": "2026-01-28T16:11:59Z",
      "title": "Icy roads snarl traffic in Mississippi as new US snow threat looms",
      "url": "https://apnews.com/article/frigid-temperatures-arctic-air-us-south-tennessee-61cd5b29f15322cc4dcae374d7b78c7e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2003517/2147483647/strip/true/crop/5712x3806+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F3a%2F57fde7b69e20be27b2fa7e8f9051%2Fd5d2dda97d48404197e1cd3ed66dda22"
    },
    {
      "author": "Christopher Rugaber",
      "description": "Federal Reserve officials are expected to keep their short-term interest rate unchanged Wednesday after three cuts last year, ignoring huge pressure for lower borrowing costs from the White House in favor of waiting to see how the economy evolves. A key issue that Chair Jerome Powell will likely address at his news conference Wednesday is how long the Fed will remain on hold. The rate-setting committee remains split between those officials opposed to further cuts until inflation comes down, and those who want to lower rates to further support hiring. In December, just 12 of the 19 participants in the committee’s meetings supported at least one more rate cut this year.",
      "publishedAt": "2026-01-28T05:01:38Z",
      "title": "Federal Reserve may keep rates unchanged for months as economy shows signs of health",
      "url": "https://apnews.com/article/federal-reserve-trump-powell-inflation-c13913c9e007981f075fb3b22d4a4cec",
      "urlToImage": "https://dims.apnews.com/dims4/default/20b0191/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F9c%2Fd19c0d2ad2121dddc230412b69cf%2F7959150d7f6e4510bdcea65acbc4a782"
    },
    {
      "author": null,
      "description": "British Prime Minister Keir Starmer has called for a deeper relationship with China during what he describes as challenging times for the world. On Thursday, he told China's top leader Xi Jinping that their countries need to work together on global stability, climate change, and other issues. Starmer, the first British prime minister to visit in eight years, is holding talks in Beijing to improve relations after years of tension. He is trying to expand opportunities for British companies as the domestic economy slows. More than 50 top business executives have joined him on the trip.",
      "publishedAt": "2026-01-29T03:29:16Z",
      "title": "Starmer calls for UK to have a deeper relationship with China",
      "url": "https://apnews.com/article/uk-prime-minister-starmer-xi-beijing-trade-062717a30f70bcfd64db08436e9aff90",
      "urlToImage": "https://dims.apnews.com/dims4/default/af6499b/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F57%2F757eae776d7bd1010821bf70078a%2F070845639d294f27a75927e908fdb2f9"
    },
    {
      "author": "Matthew Lee, Stephen Groves",
      "description": "Secretary of State Marco Rubio says there's been \"good and decent progress” in Venezuela since the United States ousted Nicolas Maduro as leader of the South American country. Rubio has begun his much-anticipated congressional testimony about Venezuela and is defending the Trump administration's military operation. Meanwhile, Republican and Democratic members of the Senate Foreign Relations Committee offered starkly different readings Wednesday of the current situation. Rubio said Venezuela’s interim leaders are cooperating and would soon begin to see benefits. He said Venezuela will be allowed to sell oil that is now subject to U.S. sanctions, with the revenue set aside to pay for basic government services such as policing and health care.",
      "publishedAt": "2026-01-28T05:03:26Z",
      "title": "Rubio cites 'good and decent progress' in Venezuela since US ousted Maduro",
      "url": "https://apnews.com/article/us-venezuela-trump-rubio-congress-maduro-rodriguez-e157b5d08a39047df4ac46764900ae77",
      "urlToImage": "https://dims.apnews.com/dims4/default/9fc06e4/2147483647/strip/true/crop/5616x3742+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F8f%2F1d27ebc41fa123a3b49f7f108fbd%2F17e2a297a2b140cc98313b6c018a3f24"
    },
    {
      "author": "Steve Karnowski, Jack Brook, Giovanna Dell'Orto",
      "description": "President Donald Trump seemed to signal a willingness to ease tensions in Minneapolis after a second deadly shooting by federal immigration agents. But there was little evidence Wednesday of any significant changes after weeks of harsh rhetoric and clashes with protesters. Trump made a leadership change by sending his top border adviser to Minnesota to take charge of the immigration crackdown. That was followed by seemingly conciliatory remarks about the Democratic governor and mayor. But on city streets, there were few signs of a shift. Immigration enforcement operations and confrontations with activists continued in Minneapolis and St. Paul.",
      "publishedAt": "2026-01-28T17:50:11Z",
      "title": "Trump signals interest in easing tensions, but there's little change in Minneapolis",
      "url": "https://apnews.com/article/minnesota-immigration-enforcement-trump-ice-3a948e7e3a4d7e254e9c1fab93625953",
      "urlToImage": "https://dims.apnews.com/dims4/default/c2bc61e/2147483647/strip/true/crop/6103x4067+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F43%2Fd3e4dca1f7f3ce4b56a424efe256%2Fa239e253f7c74f48a5e9acde32992662"
    },
    {
      "author": "Mary Clare Jalonick, Kevin Freking",
      "description": "Democratic senators are working on a list of demands for changes to U.S. Immigration and Customs Enforcement. Their push comes a partial government shutdown looms by week's end. Democrats are hoping to put pressure on Republicans and the White House as the country reels from the deaths of two people at the hands of federal agents in Minneapolis. Senate Democratic leader Chuck Schumer hasn't outlined what his caucus will ask for before a crucial Thursday vote on spending legislation that funds the Department of Homeland Security and a swath of other government agencies. With no evident negotiations underway, a partial shutdown seems increasingly likely starting Saturday.",
      "publishedAt": "2026-01-28T18:33:34Z",
      "title": "Patrial shutdown seems increasingly likely as Democrats demand ICE changes",
      "url": "https://apnews.com/article/government-partial-shutdown-ice-funding-homeland-security-35abc94e6579e701f03d9c18ca5a7c44",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fcf0c2/2147483647/strip/true/crop/5333x3554+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2Fb5%2Fded09c84dd859f05a7dfba68b773%2Fbf429444818a464f8d5a13dde3a588df"
    },
    {
      "author": "Samy Magdy, Abdel Kareem Hana",
      "description": "Tens of thousands of Palestinians await the reopening of the Rafah crossing into Gaza so they can reunite with family. Israel is expected to reopen the border crossing between Egypt and Gaza in a matter of days after Monday's recovery of the last hostage's remains in the territory. Raed Belal has been stranded for more than two years in Egypt, where he sought medical treatment for back pain before the war broke out. Now he finally has hope he might return to see his wife and children. He has packed his bags and bought gifts for his children. “It’s the moment I have been waiting for,” he says.",
      "publishedAt": "2026-01-28T18:30:22Z",
      "title": "A father awaits reopening of Rafah crossing to reunite with family in Gaza",
      "url": "https://apnews.com/article/rafah-crossing-reopening-gaza-israel-94053566a0d0114f9ea9363482eb4b1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/a236f65/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2Fac%2F41ab060ef068185dcda1e1eea85b%2F753c0878509249049072cc8f15ff8cb5"
    },
    {
      "author": "Stan Choe",
      "description": "The U.S. stock market is drifting around its all-time high. The S&P 500 was mostly unchanged Wednesday, coming off its latest record. The Dow Jones Industrial rose 58 points, and the Nasdaq composite rose 0.1%. Nvidia climbed after an encouraging revenue forecast from a major player in the chipmaking industry boosted hopes for a continued AI boom. But a drop for Apple helped keep the market in check. The U.S. dollar’s value stabilized against other currencies after sliding to its lowest level in nearly four years. Treasury yields ticked higher ahead of the Federal Reserve’s announcement in the afternoon on interest rates.",
      "publishedAt": "2026-01-28T05:25:20Z",
      "title": "Wall Street drifts around its record while the dollar's value stabilizes",
      "url": "https://apnews.com/article/stocks-markets-gold-dollar-trump-fab8069d207df512c2c95994285ecac6",
      "urlToImage": "https://dims.apnews.com/dims4/default/703d3f3/2147483647/strip/true/crop/4919x3278+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F15%2F63ae9962851f2ea5e4b9900596aa%2F2362b1203c1943ab86680549f7ed8939"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}