{
  "articles": [
    {
      "author": "Josh Boak",
      "description": "The White House says President Donald Trump will sign an executive order Tuesday to relax some of his 25% tariffs on autos and auto parts. It's a significant reversal as the import taxes threatened to hurt domestic manufacturers. Automakers and independent analyses have indicated that the tariffs could raise prices, reduce sales and make U.S. production less competitive worldwide. White House press secretary Karoline Leavitt declined in a briefing with reporters to provide details of the relief. Treasury Secretary Scott Bessent, who joined Leavitt at the briefing, says the goal is to enable automakers to create more domestic manufacturing jobs.",
      "publishedAt": "2025-04-29T13:57:09Z",
      "title": "Trump will offer automakers some relief on his 25% tariffs",
      "url": "https://apnews.com/article/trump-tariffs-automakers-factories-relief-25a400c98e02c01c8c54502384e267e1",
      "urlToImage": "https://dims.apnews.com/dims4/default/4926534/2147483647/strip/true/crop/3984x2241+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F2e%2Fa729b95434ec4c09bb807565381f%2F3dda8de0ac8e47e4890cac05661c5818"
    },
    {
      "author": "Rob Gillies",
      "description": "Canada’s Liberals are celebrating election victory in a stunning turn of fortune. The country won't know until later Tuesday whether the party of new Prime Minister Mark Carney will have an outright majority or need help in Parliament. And the Canadian Broadcasting Corporation projects that populist Conservative Party leader Pierre Poilievre will lose his Parliament seat. That caps a stunning turnaround in fortunes fueled by U.S. President Donald Trump’s annexation threats and trade war. Poilievre a few months ago appeared to be a shoo-in to become Canada’s next prime minister and shepherd the Conservatives back into power for the first time in a decade.",
      "publishedAt": "2025-04-29T13:26:21Z",
      "title": "Canada's Liberals celebrate a stunning win and the populist challenger loses his seat",
      "url": "https://apnews.com/article/canada-election-carney-trump-poilievre-7d42d2d93b98d471c2afb3cd602d117d",
      "urlToImage": "https://dims.apnews.com/dims4/default/aeaeec5/2147483647/strip/true/crop/2859x1608+0+53/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2Fde%2Fe6ef393fc57c54539be257a9b808%2F2a90955c70e345558ded1ad07c0197d1"
    },
    {
      "author": "Suman Naishadham, Joseph Wilson",
      "description": "Power had almost fully returned to Spain early Tuesday morning as many questions remained about what caused one of Europe’s most severe blackouts across Spain and Portugal. By 7:00a.m., Spanish electricity operator Red Eléctrica said that more than 99% of energy demand had been restored. Power had returned to several regions across Spain and Portugal as the nations reeled from the still-unexplained widespread blackout that had turned airports and train stations into campgrounds for stranded travelers. Monday night, many city residents, including in Spain’s capital of Madrid, went to sleep in total darkness.",
      "publishedAt": "2025-04-29T04:12:50Z",
      "title": "Spain’s power supply is almost fully restored after one of Europe’s most severe blackouts",
      "url": "https://apnews.com/article/spain-portugal-power-outage-electicity-533832bb4ceae92eaa68c23dc0b5db18",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2b69e4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F0d%2F7c6318b404bf5694efd7dab4eaa7%2F4cf834a4e743410388b1673caf2db93a"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Italian cardinal at the heart of the Vatican’s “trial of the century” announced Tuesday he was withdrawing from participating in the upcoming conclave to elect a new pope. Cardinal Angelo Becciu’s status has dominated discussions in the days after Pope Francis’ death amid questions about whether he would participate in the conclave to elect his successor. After his 2020 downfall, Becciu had said he would not participate in any future conclave. But in recent days he had asserted he had a right to enter the Sistine Chapel with other cardinals on May 7. On Tuesday, the 76-year-old Italian issued a statement through his lawyers that said he had “decided to obey” the will of Pope Francis.",
      "publishedAt": "2025-04-29T08:01:27Z",
      "title": "Disgraced Cardinal Becciu formally withdraws from participation in conclave to elect pope",
      "url": "https://apnews.com/article/becciu-cardinal-conclave-withdraws-e2df8c80fcc993ae1e529f2f12000324",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d8ebfc/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F8e%2F64a70310240569ad31aafd0bb0de%2F6dd630a90edc40d6b8c8bf7833fc5086"
    },
    {
      "author": "Mark Thiessen, Julie Watson",
      "description": "The Vietnam War that ended after the fall of Saigon 50 years ago greatly impacted U.S. society. For some Americans, it still shapes their lives today. They include a woman who continues to work to recover the remains of her father whose U.S. Navy plane went missing in Vietnam. An anti-war stalwart who shares the lessons of the 1970 shootings by Ohio's National Guard troops who fired into the crowd at a protest at Kent State University. And a Vietnam veteran who helps fellow veterans in rural Alaska after overcoming his own struggles with alcohol and post-traumatic stress disorder.",
      "publishedAt": "2025-04-29T17:01:34Z",
      "title": "End of Vietnam War is still deeply felt by some Americans",
      "url": "https://apnews.com/article/saigon-vietnam-war-americans-50-years-f6b8b5823b99038fcdb87bdbcd4c0125",
      "urlToImage": "https://dims.apnews.com/dims4/default/6bbc74c/2147483647/strip/true/crop/3000x1688+0+387/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2Fd4%2F4fb07fdc09fb429aed524bde770b%2F28e8f97ebd4448f9aebbe5616cf63487"
    },
    {
      "author": "Tara Copp, Farnoush Amiri",
      "description": "Defense Secretary Pete Hegseth is boasting on “X” that he had dismantled a program supporting women on security teams — and may not have realized the program he just tried to break was not a “woke” Biden-era initiative but instead a celebrated program signed into law by his boss President Donald Trump. Hegseth in a agitated tweet Tuesday called the “Women, Peace & Security” program at the Department of Defense “a UNITED NATIONS program pushed by feminists and left-wing activists. Politicians fawn over it; troops HATE it.” But the legislation was actually endorsed by Trump, was heralded by Trump family members and is supported by Joint Chiefs Chairman Gen. Dan Caine. A spokeswoman for Hegseth did not immediately respond to a request for comment.",
      "publishedAt": "2025-04-29T17:43:44Z",
      "title": "Hegseth boasts about nixing 'woke' program that Trump signed into law",
      "url": "https://apnews.com/article/hegseth-ends-trump-program-women-5c9e65044c33ff780440bd123e16d28e",
      "urlToImage": "https://dims.apnews.com/dims4/default/df979d5/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2Fc9%2Ffb2fcce1dc0e8793c7a945f9d6bc%2Fc7cc2c30007749cc9bdffff7c657920e"
    },
    {
      "author": "John O'connor",
      "description": "Authorities say they believe a crash through an Illinois after-school building that killed three kids and one teenager wasn’t targeted. Police say the car smashed through a building Monday afternoon, injuring several others in the small city outside of Springfield, Illinois. They issued an update Tuesday about the investigation. Chatham Police Department Deputy Chief Scott Tarter says officers responded at about 3:20 p.m. to calls about a vehicle ramming through the building, fatally hitting four people before exiting the other side.",
      "publishedAt": "2025-04-29T11:32:27Z",
      "title": "Authorities believe crash through Illinois after-school building that killed 4 wasn’t targeted",
      "url": "https://apnews.com/article/chatham-illinois-after-school-building-crash-bba11439918ba4324eaf35231e0778c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/9d772fe/2147483647/strip/true/crop/2948x1658+27+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2Ff4%2Fc9de606da94305293dee3290d795%2Fe2c740a1631245eb994139b3aed4a77f"
    },
    {
      "author": "Wyatte Grantham-Philips, Josh Boak",
      "description": "Amazon is not planning to list added tariff costs next to product prices on its site — despite speculation spanning from a report that claimed the e-commerce giant would soon show new import charges, as well as fiery comments from President Donald Trump’s White House denouncing such a move. The Trump administration’s reaction appeared to be based on a misinterpretation of internal plans being considered by Amazon, rather than a final decision made by the company. Amazon’s Haul service — a recently launched, low-cost storefront — “considered the idea” of listing import charges on certain products, according to company spokesperson Tim Doyle. But this was never approved.",
      "publishedAt": "2025-04-29T16:31:20Z",
      "title": "Amazon is not planning to show added tariff costs next to its online product listings",
      "url": "https://apnews.com/article/amazon-tariff-prices-trump-white-house-8598569632263872a6c04f7ef330c0fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/d6f8c40/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2F71%2F9fc3b9c8056f52c3b891f9aed04b%2F36a3c56d61a646889f941535896e2ff0"
    },
    {
      "author": "Jennifer Peltz, Michael R. Sisak",
      "description": "The first of three accusers expected to testify at Harvey Weinstein’s rape retrial has taken the witness stand in a reprise of her testimony in his first #MeToo trial five years ago. Miriam Haley is testifying Tuesday at the start of the second week of testimony in Weinstein’s retrial. The former TV and movie production assistant alleges that the former movie mogul forcibly performed oral sex on her at his New York City apartment in 2006. Haley initially expressed some reluctance to testify again after a New York appeals court last year overturned Weinstein’s landmark conviction and ordered a new trial. Weinstein has pleaded not guilty and denies that he raped or sexually assaulted anyone.",
      "publishedAt": "2025-04-29T16:13:43Z",
      "title": "First accuser takes the witness stand at Harvey Weinstein’s #MeToo retrial",
      "url": "https://apnews.com/article/harvey-weinstein-metoo-sexual-assault-rape-retrial-8546575417110384805eebbdb572dc16",
      "urlToImage": "https://dims.apnews.com/dims4/default/57f38f3/2147483647/strip/true/crop/4636x2608+0+242/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Fcc%2F190816e7d0ea102c71aad70b2b8f%2F85332e203189451cb522f672418045a9"
    },
    {
      "author": null,
      "description": "A war monitor and an activist group say clashes broke out in the Syrian capital between local gunmen belonging to the minority Druze sect and pro-government fighters. The fighting early Tuesday left at least four people dead. The clashes in the southern suburb of Jaramana broke out after audio circulated on social media of a man attacking Islam’s Prophet Muhammad. The audio was attributed to a Druze cleric, who later denied being involved. The Britain-based Syrian Observatory for Human Rights said at least four people were killed in the clashes while the activist media collective Suwayda 24 said five people were killed and 12 were wounded.",
      "publishedAt": "2025-04-29T08:29:14Z",
      "title": "Clashes between Druze gunmen and pro-government fighters in Syrian capital kill at least 4",
      "url": "https://apnews.com/article/syria-jaramana-druze-islam-prophet-muhammad-23c39cfd03cd78fcf6111313d725217f",
      "urlToImage": "https://dims.apnews.com/dims4/default/198a29e/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F42%2Fd7debad9eb475819c6453fc71e41%2F95ffd6a0ff9f43f484d66d5a59fe8b1d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}