{
  "articles": [
    {
      "author": "ERIC TUCKER, DASHA LITVINOVA and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The United States and Russia completed their biggest prisoner swap in post-Soviet history on Thursday, with Moscow releasing journalist Evan Gershkovich and fellow American Paul Whelan, along with dissidents including Vladimir Kara-Murza, in a multinational deal that set two dozen people free, the White House said.",
      "publishedAt": "2024-08-01T13:29:35Z",
      "title": "US and Russia complete biggest prisoner swap in post-Soviet history, freeing Gershkovich and Whelan",
      "url": "https://apnews.com/d803e266cb4e60135ec5d668d684529f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8c1f9372f1248ca93448dbf62be66af/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — One spent over 5½ years behind bars in Russia while other, higher-profile detainees were released ahead of him. Another was jailed for only a few months. They include journalists, veteran political activists and those simply opposed to the war in Ukraine.",
      "publishedAt": "2024-08-01T15:29:44Z",
      "title": "Who's in the massive prisoner swap between Russia and the West?",
      "url": "https://apnews.com/5e1d9d7511df03b5f3d0c5734f886189",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b70cf74fa66445fca66daeb9dd109ba8/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — The United States and Russia completed a 24-person prisoner swap on Thursday, the largest in post-Soviet history, with Moscow releasing Wall Street Journal reporter Evan Gershkovich and fellow American Paul Whelan in a multinational deal that set some two dozen people free, according to officials in Turkey, where the exchange took place.",
      "publishedAt": "2024-08-01T15:34:10Z",
      "title": "Prisoner Swap Latest: US reporter Evan Gershkovich freed in US-Russia prisoner swap",
      "url": "https://apnews.com/fa753e373ee1fb47464373324a142a12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf120803b90549509fd9d70161d7704f/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July. The announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.",
      "publishedAt": "2024-08-01T08:40:43Z",
      "title": "Israel says it has confirmed that chief of Hamas' military wing was killed in a July strike in Gaza",
      "url": "https://apnews.com/9524d7d5c8f7321f4d8c931fde664556",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/986085d272094fd99bdf5607fa8682c5/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.",
      "publishedAt": "2024-08-01T05:00:45Z",
      "title": "For Iran and Hezbollah, calibrating response to Israeli strikes leaves no room for error",
      "url": "https://apnews.com/262194a2d70273207ed1d1a5cb9ab09b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd7398c344dc47328ef144d1719d5398/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and BRIAN MELLEY",
      "description": "LONDON (AP) — British Prime Minister Keir Starmer condemned the “tiny mindless minority” behind unrest that has plagued several cities after a horrific stabbing at a children’s dance class and vowed to put a stop to it as the 17-year-old suspect was named Thursday in part to counter misinformation blamed as one cause of the fiery clashes.",
      "publishedAt": "2024-08-01T08:19:13Z",
      "title": "British prime minister announces policing plan to deal with violence after fatal stabbing of girls",
      "url": "https://apnews.com/666c445e26aa0359f26805b4a10c071a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab45d2838c7841438ffecfab4db0941d/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — A deadly Osprey aircraft crash last November off Japan was caused by cracks in a metal gear and the pilot’s decision to keep flying, instead of heeding multiple warnings that he should land, according to an Air Force investigation released Thursday.",
      "publishedAt": "2024-08-01T16:01:28Z",
      "title": "Japan Osprey crash caused by cracks in a gear and pilot’s decision to keep flying, Air Force says",
      "url": "https://apnews.com/3b7b0951074334bec0f6a54da6309c31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1352db96ddb0416e9cffef0276000876/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS and SEUNG MIN KIM",
      "description": "As Vice President Kamala Harris prepares to announce her running mate, a poll from The Associated Press-NORC Center for Public Affairs Research finds that several of the top contenders for the role are largely unknown to Americans.",
      "publishedAt": "2024-08-01T04:01:04Z",
      "title": "What polling shows about the top VP contenders for Kamala Harris",
      "url": "https://apnews.com/d01c79817844b66c5bf466a1cd403c50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/308293c739a643738fab333ef4ead50c/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, STEPHEN GROVES and MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — Donald Trump is used to defending himself. But this week, the Republican presidential nominee has been put in the rare position of having to defend someone else — his running mate, Ohio Sen.",
      "publishedAt": "2024-08-01T04:07:01Z",
      "title": "Trump ramps up his defense of Vance after one of the rockiest VP rollouts in recent memory",
      "url": "https://apnews.com/ad67ae38d25c54eab9827b5cdb2fb6bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8e0806690734bc6a1fd84d768589ecd/3000.jpeg"
    },
    {
      "author": "MATT SEDENSKY",
      "description": "GARHMUKTESHWAR, India (AP) — They were found in gutters, on streets, in bushes. They were boarded on trains, deserted in hospitals, dumped at temples. They were sent away for being sick or outliving paychecks or simply growing too old.",
      "publishedAt": "2024-08-01T12:53:16Z",
      "title": "As India grows older, a secret shame emerges: Elders abandoned by their children",
      "url": "https://apnews.com/44701de4079bf8bca01cfa3217fdf1c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3da443b71c149efa3fa702773f5aeca/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}