{
  "articles": [
    {
      "author": "THOMAS ADAMSON and JEFFREY SCHAEFFER",
      "description": "PARIS (AP) — France’s high-speed rail network was hit Friday with widespread and “criminal” acts of vandalism including arson attacks, paralyzing travel to Paris from across the rest of France and Europe only hours before the grand opening ceremony of the Olympics.",
      "publishedAt": "2024-07-26T07:10:11Z",
      "title": "Arson attacks paralyze French high-speed rail network hours before start of Olympics",
      "url": "https://apnews.com/74c9727d33ac86bfc126f98e45cb874f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80b2758090ae4202a5f0e95d50caebdc/1920.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — The Paris Olympics were getting off to a rougher than hoped-for start Friday, with suspected acts of sabotage targeting France's flagship high-speed rail network and cloudy skies with light drizzle over the French capital ahead of its sprawling, ambitious opening ceremony.",
      "publishedAt": "2024-07-26T10:23:50Z",
      "title": "Sabotaged trains and forecast rain get Paris Olympics off to a rougher than hoped-for start",
      "url": "https://apnews.com/9ed330cb83d89d68092ac5858c0fe590",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/740e0e5c704d4fafa46a2d93f33f91c8/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Former President Barack Obama and former first lady Michelle Obama have endorsed Kamala Harris in her White House bid, giving the vice president the expected but still crucial backing of the nation’s two most popular Democrats.",
      "publishedAt": "2024-07-26T09:00:18Z",
      "title": "Barack and Michelle Obama endorse Kamala Harris, giving her expected but crucial support",
      "url": "https://apnews.com/48e38547560ae64484399d278c697a7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8194fa8f377741eaabcf990820193dac/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris, the likely Democratic nominee for president, is attempting to bridge divides within the party over the war in Gaza, emphasizing Israel's right to defend itself while also focusing on alleviating Palestinian suffering.",
      "publishedAt": "2024-07-26T04:02:34Z",
      "title": "Harris tries to thread the needle on Gaza after meeting with Netanyahu",
      "url": "https://apnews.com/dad5fd3715f35e8311bd4039aeff8173",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9255a23a74bb4dfcbc6e4848460b5d4a/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — As president, Donald Trump went well beyond his predecessors in fulfilling Israeli Prime Minister Benjamin Netanyahu’s top wishes from the United States.",
      "publishedAt": "2024-07-26T04:03:47Z",
      "title": "Netanyahu will meet Trump at Mar-a-Lago, mending a years-long rift",
      "url": "https://apnews.com/3d7a6b47060fbe51f66d82104ac5e1aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b17e746d3a34de3948705b450451f3d/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The 2-year-old toddler lay on a foil blanket, her face covered with salve for her burns and her little body riddled with scars from shrapnel. She squirmed, her breath heaving, as doctors examined her and the tube in her chest.",
      "publishedAt": "2024-07-26T06:23:14Z",
      "title": "Wounded in a strike that killed her family, a 2-year-old joins Gaza's ranks of thousands of orphans",
      "url": "https://apnews.com/d1388a6c30f16f3b487ec7cbcf1398d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9969326d26774cc1ae779a29f146f063/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, MARÍA VERZA and CHRISTOPHER SHERMAN",
      "description": "WASHINGTON (AP) — Ismael “El Mayo” Zambada, a longtime leader of Mexico’s Sinaloa cartel, and Joaquín Guzmán López, a son of another infamous cartel leader, were arrested by U.S. authorities in Texas on Thursday, the U.S.",
      "publishedAt": "2024-07-26T00:32:04Z",
      "title": "US arrests 2 leaders of Mexico’s Sinaloa cartel: ‘El Mayo’ Zambada and son of 'El Chapo'",
      "url": "https://apnews.com/092bb02d8116fe462b6e1340547a4c77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23f6a61de70e4cc6b9534f24b2ebbd00/2000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — The future of Venezuela is on the line. Voters will decide Sunday whether to reelect President Nicolas Maduro, whose 11 years in office have been beset by crisis, or allow the opposition a chance to deliver on a promise to undo the ruling party's policies that caused economic collapse and forced millions to emigrate.",
      "publishedAt": "2024-07-26T04:11:24Z",
      "title": "Venezuelan voters face crucial choice: Reelect Maduro or give opposition a chance after 25 years",
      "url": "https://apnews.com/115b02aa4ad25b7fb8cf583b3dd10a7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2373dffe6630428d9a25eb2adf0d0432/3000.jpeg"
    },
    {
      "author": "ANDREW MELDRUM and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Signing an agreement with Russia to stop the war with Ukraine would amount to signing a deal with the devil, a top adviser to Ukrainian President Volodymyr Zelenskyy said, as pressure mounts on the country to seek an end to more than two years of fighting.",
      "publishedAt": "2024-07-26T05:49:58Z",
      "title": "Agreement with Russia is 'deal with the devil,' adviser to Ukrainian president says",
      "url": "https://apnews.com/32cf93a025c3c713ce861c8e279328be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e303e5a244445b8bb9a9da501cc1364/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The opening ceremony for the Paris Olympics is set for Friday.",
      "publishedAt": "2024-07-25T07:06:24Z",
      "title": "How to watch the 2024 Olympics opening ceremony",
      "url": "https://apnews.com/e2836f814931a0cdfe9745edfce860f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/182d6dd4ca5e4a93a1142cb3163fb1df/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}