{
  "articles": [
    {
      "author": "Kareem Chehayeb, Sarah El Deeb",
      "description": "Six Iranians spoke to The Associated Press about the protests in Iran, describing a renewed sense of hope even with a bloody crackdown on demonstrators. The Iranians said they demonstrated and witnessed state violence. Protests erupt in Iran every few years, but several said this time felt different, with unprecedented momentum and a diverse crowd. They described older residents, people from well-to-do families, even children on the streets. Activists estimate over 6,000 people were killed in the bloodiest crackdown on dissent since the Islamic Republic's 1979 creation. The Iranians spoke on condition of anonymity as the crackdown continued. Iran’s mission to the United Nations did not respond to questions from AP about these witnesses’ recollections.",
      "publishedAt": "2026-01-30T05:09:38Z",
      "title": "Through the eyes of Iranian protesters, glimpses of disorder, disarray and death",
      "url": "https://apnews.com/article/iran-protests-tehran-crackdown-demonstrations-khamenei-d43414787f764ae83c608c5f19563cbb",
      "urlToImage": "https://dims.apnews.com/dims4/default/48223be/2147483647/strip/true/crop/3051x2033+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F2a%2F36caa6b5556b42b3a3001bf12886%2Fed18b911d1744d48b68341cb2dc5871d"
    },
    {
      "author": "Susie Blann",
      "description": "Ukraine is waiting to see if Russia will pause attacks on its power grid. U.S. President Donald Trump said that Russian President Vladimir Putin agreed to a temporary halt as Ukraine faces severe winter weather. Trump didn't specify when the call with Putin happened or when the moratorium would start. The Kremlin hasn't confirmed the pause. Ukrainian President Volodymyr Zelenskyy doubts Russia's intentions. Kyiv is experiencing power shortages and expects extreme cold. Zelenskyy said that Ukraine is ready to stop its attacks if Russia does the same. But there's no official ceasefire agreement. Zelenskyy said Thursday in comments made public on Friday that “I do not believe that Russia wants to end the war.\"",
      "publishedAt": "2026-01-30T09:17:51Z",
      "title": "Ukraine braces for brutal cold as Trump says Putin agreed to halt power grid attacks",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-trump-energy-truce-0f1e6e5cb72f11a181104db3bb5c4e1e",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e063cd/2147483647/strip/true/crop/2000x1333+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F96%2F9b0dccf97eb21c5495c73d2d9bf0%2Fe05d9415a60e4d8abe7ea6e1ed570039"
    },
    {
      "author": "Sophie Bates, Sudhin Thanawala, Russ Bynum",
      "description": "Another wave of dangerous cold is heading for the U.S. South, and experts say the risk of hypothermia heightens for people in parts of Mississippi and Tennessee who are entering their sixth day trapped at home without power in subfreezing temperatures. The National Weather Service says arctic air moving into the Southeast will cause already frigid temperatures to plummet into the teens on Friday night in cities like Nashville. Doctors say while more vulnerable people may have started experiencing hypothermia symptoms within hours of being exposed to the frigid temperatures, younger people who are generally healthy may soon start falling victim to these effects as well.",
      "publishedAt": "2026-01-30T05:01:12Z",
      "title": "Dangerous cold wave heightens hypothermia risk in Mississippi and Tennessee",
      "url": "https://apnews.com/article/freezing-temperatures-hypothermia-mississippi-tennessee-6ae30d4be75522f7c0cd3566ba664957",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d45947/2147483647/strip/true/crop/4076x2716+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Fcd%2Fb737353f5b3094836c9bcb819260%2Fbd23362c440545c59bba1fcb1dde6367"
    },
    {
      "author": "Mary Clare Jalonick",
      "description": "Senate leaders were scrambling to save a bipartisan spending deal and avert a partial government shutdown at midnight Friday as Democrats have demanded new restrictions on federal immigration raids across the country. Democrats struck a rare deal with President Donald Trump Thursday to separate funding for the Homeland Security Department from a broad government spending bill and fund it for two weeks while Congress debates curbs on the U.S. Immigration and Customs Enforcement agency. The deal came as irate Democrats had vowed to vote against the entire spending bill and trigger a shutdown in the wake of the deaths of two protesters at the hands of federal agents in Minneapolis.",
      "publishedAt": "2026-01-30T05:31:16Z",
      "title": "Senate leaders scramble to avert partial government shutdown",
      "url": "https://apnews.com/article/congress-budget-immigration-trump-homeland-security-39fd7917e39aaf9e4e78e89f3449a587",
      "urlToImage": "https://dims.apnews.com/dims4/default/413ab51/2147483647/strip/true/crop/4822x3213+89+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2Fbf%2F7daf3eb6c7507182928afb032793%2F9c37e91ed1534493b975bc9ced89a8ba"
    },
    {
      "author": "Garance Burke, Byron Tau",
      "description": "The Trump administration’s immigration crackdown in Minneapolis is providing insights into the surveillance technologies the government is using in its mass deportation campaign. Department of Homeland Security officials insist their immigration enforcement operations are “highly targeted.” But some American citizens have been caught up in the raids as the Trump administration has built new surveillance tools and fused together datasets on citizens and noncitizens alike. Over the last year, the agency’s expanding digital dragnet has empowered federal agents to collect and analyze vast volumes of information. The Department of Homeland Security says it will not disclose law enforcement-sensitive methods.",
      "publishedAt": "2026-01-30T05:09:35Z",
      "title": "How a digital dragnet is powering Trump’s immigration crackdown",
      "url": "https://apnews.com/article/digital-crackdown-immigration-minneapolis-trump-52662450a15a7be8d9df69036f9b5f12",
      "urlToImage": "https://dims.apnews.com/dims4/default/225fd56/2147483647/strip/true/crop/5608x3737+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2Fe4%2F14b97c279b18b5d8020ca9227f26%2F5496db41987d4ac699c3089c534b8c3f"
    },
    {
      "author": "Michelle L. Price, Megan Janetsky",
      "description": "President Donald Trump has signed an executive order that would impose a tariff on any goods from countries that sell or provide oil to Cuba, a move that puts pressure on Mexico. Mexican President Claudia Sheinbaum says her government had at least temporarily stopped oil shipments to Cuba. She says it was a “sovereign decision” not made under pressure from the U.S. Trump has squeezed Mexico to distance itself from the Cuban government. In the wake of the U.S. military operation to oust former Venezuelan President Nicolás Maduro, Trump has said the Cuban government is ready to fall.",
      "publishedAt": "2026-01-30T00:16:01Z",
      "title": "Trump threatens tariffs on any country selling oil to Cuba",
      "url": "https://apnews.com/article/oil-cuba-tariffs-trump-mexico-30f1d74a766fee23001684a5bb8079d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/38ca23b/2147483647/strip/true/crop/6509x4337+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2Fdf%2F7e4a6d9ada0bdb8619e090cbe59d%2Fc819ed53dd084bed8ae16b24d49ad663"
    },
    {
      "author": "Josh Boak, Darlene Superville",
      "description": "President Donald Trump said he plans to announce his choice for Federal Reserve chairman on Friday morning. Trump has criticized current Fed Chair Jerome Powell for not cutting interest rates more aggressively. Trump is believed to have four finalists for the position, but did not give details on Thursday. Tensions have been high between Trump and the Fed, with Powell emphasizing the importance of independent judgment and accountability to Congress. Powell's term ends in May, but he could remain on the board until 2028.",
      "publishedAt": "2026-01-30T02:01:00Z",
      "title": "Trump says he will announce his Federal Reserve pick on Friday",
      "url": "https://apnews.com/article/trump-fed-chair-powell-f759d0e3170c28e58af3164d511a4cc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/adb2872/2147483647/strip/true/crop/8039x5357+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Fff%2F569eece233298c9ca33b615c6076%2F398e4183f8bf46a387d05b9c4d574390"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "U.S. futures have dropped while European shares opened higher. Markets are awaiting a possible announcement by U.S. President Donald Trump on his pick to replace Jerome Powell as chair of the Federal Reserve. Stocks declined in Asia after a day of dramatic swings on Wall Street that included Microsoft's worst drop in nearly six years. Oil prices fell and the prices of gold and silver also weakened. The president of Indonesia's stock exchange resigned after share prices tumbled due to concerns over market risks. On Thursday, the S&P 500 edged 0.1% lower. The Dow industrials added 0.1%, and the Nasdaq composite fell 0.7%.",
      "publishedAt": "2026-01-30T02:54:29Z",
      "title": "US futures sink and world shares are mixed as markets await Trump's announcement on his Fed nominee",
      "url": "https://apnews.com/article/stocks-markets-gold-rates-oil-7f0eadba91bc2e550945eb49bc1085f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/546d9a7/2147483647/strip/true/crop/7556x5035+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F3d%2Fefe39da89ebe9ad09a6ec0796c42%2F148767934ebe40539355a050ce11a868"
    },
    {
      "author": "Fatima Hussein",
      "description": "President Donald Trump is suing the IRS and Treasury Department for $10 billion. He accuses them of failing to prevent a leak of his tax information to news outlets. The lawsuit was filed in a Florida federal court on Thursday. In 2024, former IRS contractor Charles Edward Littlejohn was sentenced to five years in prison for leaking tax information about Trump and others. Earlier this week, the U.S. Treasury Department cut its contracts with Booz Allen Hamilton, where Littlejohn worked. He was charged and imprisoned for leaking tax information about thousands of wealthy individuals, including Trump.",
      "publishedAt": "2026-01-30T02:30:14Z",
      "title": "Trump sues IRS for $10 billion over leaked tax info",
      "url": "https://apnews.com/article/trump-treasury-irs-tax-records-e3a79e1bfdc94a663504754af80ce183",
      "urlToImage": "https://dims.apnews.com/dims4/default/a06bd23/2147483647/strip/true/crop/5709x3804+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F04%2F15b76e9cd5974048568c735b906e%2Faf1bf845078141978996a4c86794bc9c"
    },
    {
      "author": null,
      "description": "Venezuela's legislature has approved opening the nation's oil sector to privatization. This decision reverses a key principle of the socialist movement that has ruled for over two decades. The National Assembly approved the energy industry law overhaul on Thursday. This move comes less than a month after the U.S. military seized then-President Nicolás Maduro in Venezuela’s capital. The bill now awaits the signature of acting President Delcy Rodríguez. She proposed the changes after U.S. President Donald Trump announced plans to take control of Venezuela’s oil exports and attract foreign investment to revitalize the industry.",
      "publishedAt": "2026-01-29T21:04:46Z",
      "title": "Venezuelan lawmakers approve easing state control of oil industry",
      "url": "https://apnews.com/article/venezuela-oil-reform-delcy-rodriguez-5784394afdc3ee0017d2f41427253fd8",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e41b2b/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2F44%2Faead700e78fb423304d9d8edccdc%2Ff5143b1d863f494fbf7e91337c7abe8b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}