{
  "articles": [
    {
      "author": null,
      "description": "Law enforcement are responding to what the FBI described as a “targeted terror attack” in Boulder, Colorado. FBI Director Kash Patel said in a social media post on Sunday that FBI agents and local police were on the scene and would provide more details soon. Boulder Police say they are evacuating several blocks of the typically popular pedestrian mall area. Police say there were “several victims” in the attack without providing further details.",
      "publishedAt": "2025-06-01T21:49:09Z",
      "title": "FBI and law enforcement respond to 'terror attack' in Boulder, Colorado",
      "url": "https://apnews.com/article/boulder-terror-attack-colorado-8af1b11734cbbe75c9945820a9b6684c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Colleen Slevin, Olga R. Rodriguez",
      "description": "Eight people calling for the release of Israeli hostages in Gaza were injured at an outdoor mall in Boulder, Colorado, by a man who used a makeshift flamethrower and hurled an incendiary device into the crowd. The FBI immediately called it a “targeted terror attack.” Officials said the man yelled “Free Palestine” as he attacked people Sunday calling for the immediate release of Israeli hostages in Gaza. The FBI identified the suspect as 45-year-old Mohamed Sabry Soliman. Charges were not immediately filed against him, but officials said they expect to hold him “fully accountable.”",
      "publishedAt": "2025-06-02T03:07:15Z",
      "title": "What we know about the suspect and victims in the Boulder attack",
      "url": "https://apnews.com/article/boulder-terror-attack-colorado-c90a20758b3ebee597c84eb296e44e91",
      "urlToImage": "https://dims.apnews.com/dims4/default/1de4b8e/2147483647/strip/true/crop/5110x2874+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2Ff0%2Fc2c0080b3d87f48f17e10e52ea97%2F0ba1178b52e943c2aa1587a0e5691a3b"
    },
    {
      "author": "Mehmet Guzel",
      "description": "Delegations from Russia and Ukraine are in Turkey for their second round of direct peace talks in just over two weeks. Expectations are low for any significant progress Monday on ending the three-year war after a string of major attacks over the weekend. Ukraine said Sunday it launched a spectacular surprise attack on five Russian airbases thousands of kilometers apart, ranging from air bases close to Moscow to targets in Russia’s Arctic, Siberia, and Far East. Ukraine claimed more than 40 Russian warplanes were destroyed in what Ukrainian President Volodymyr Zelenskyy called a “brilliant operation.” Meanwhile, Russia on Sunday launched the biggest number of drones — 472 — on Ukraine since the full-scale invasion in February 2022.",
      "publishedAt": "2025-06-02T07:43:46Z",
      "title": "Ukraine and Russia hold talks with little hope for a breakthrough",
      "url": "https://apnews.com/article/russia-ukraine-war-peace-talks-drone-attacks-0c2e0a4aeccd86c3fe18edf5cc73b250",
      "urlToImage": "https://dims.apnews.com/dims4/default/cd4c5b2/2147483647/strip/true/crop/1975x1111+31+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fda%2Fe4c375027039389aadc75bbec655%2F291c558799c246ecb4b06fa62547573e"
    },
    {
      "author": "Thomas Adamson",
      "description": "Two U.S. senators are warning that Russian President Vladimir Putin is stalling on peace while preparing a fresh military offensive against Ukraine. Senators Lindsey Graham and Richard Blumenthal say the U.S. Congress and Europe may have just two weeks to act. They spoke in Paris on Sunday in an Associated Press interview. Graham, a Republican, and Blumenthal, a Democrat, had just come from Kyiv, where they met President Volodymyr Zelenskyy and visited neighborhoods destroyed in what they called the most intense bombardments since the war began. The senators are urging swift support for a sweeping sanctions bill to sever the economic lifeline fueling Russia’s war.",
      "publishedAt": "2025-06-01T15:13:34Z",
      "title": "After talks with Zelenskyy and Macron, US senators warn: Putin 'is preparing for more war’",
      "url": "https://apnews.com/article/ukraine-russia-sanctions-graham-blumenthal-b2b9b69f504b8afd064055bb3bf11800",
      "urlToImage": "https://dims.apnews.com/dims4/default/d795e03/2147483647/strip/true/crop/4240x2385+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F72%2Fdfe5e604aaec1de601ee89b3f684%2F347f3ce9a2344f40a136912b684fd721"
    },
    {
      "author": "Mohammad Jahjouh, Samy Magdy",
      "description": "Gaza health officials and multiple witnesses say at least 25 people were killed and scores were wounded as they were on their way to receive food in the strip. The witnesses said Israeli forces fired on crowds on Sunday around a kilometer away from an aid site run by an Israeli-backed foundation. The military released a brief statement saying it was unaware of any injuries caused by Israeli fire within the distribution site. The foundation said it delivered aid at its sites “without incident” early on Sunday. An Associated Press reporter saw dozens of people being treated at a nearby field hospital.",
      "publishedAt": "2025-06-01T05:01:36Z",
      "title": "At least 21 Palestinians killed, 175 injured while trying to get aid in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-01-2025-67688833abb96fc068c42d10da90a0a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/3f974bb/2147483647/strip/true/crop/4244x2387+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fd3%2Fcb534f5ae45f8f088b480cd10d10%2F6c40f11cc69541298a7ea395cfc46fc4"
    },
    {
      "author": null,
      "description": "Conservative Karol Nawrocki has won Poland’s weekend presidential runoff election, according to the final vote count. Nawrocki won 50.89% of votes in a very tight race against liberal Warsaw Mayor Rafał Trzaskowski, who received 49.11%. The close race had the country on edge since a first round two weeks earlier and through the night into Monday, revealing deep divisions in the country along the eastern flank of NATO and the European Union. An early exit poll released Sunday evening suggested Trzaskowski was headed to victory before updated polling began to reverse the picture hours later.",
      "publishedAt": "2025-06-02T03:55:54Z",
      "title": "Nawrocki narrowly wins Poland's presidential runoff election",
      "url": "https://apnews.com/article/poland-presidential-election-karol-nawrocki-80a99eeb7a2f3ae64260a9263e7028ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/483b587/2147483647/strip/true/crop/3842x2161+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F23%2F4f89ddf64a5f9aa6983db695d475%2F6bf83a8ec75b4d06bc0860faadd6e54f"
    },
    {
      "author": "Jill Lawless, Pan Pylas",
      "description": "The U.K. will build new nuclear-powered attack submarines and create an army ready to fight a war in Europe as part of a boost to military spending. It's designed to senf a message to Moscow — and Washington. The government is responding Monday to a strategic defence review , led by former NATO Secretary General George Robertson, that it says is the most consequential since the end of the Cold War. Prime MInister Keir Starmer says Britain faces greater threats than it has for many years. He said U.K. defense spending will hit 2.5% of GDP by 2027. But a goal of 3% before 2034 is an “ambition,” rather than a firm promise.",
      "publishedAt": "2025-06-02T08:23:57Z",
      "title": "Britain is getting a defense boost aimed at sending a message to Moscow, and to Trump",
      "url": "https://apnews.com/article/uk-defense-spending-boost-submarines-russia-347608084fa80b10aa212a7f006bd053",
      "urlToImage": "https://dims.apnews.com/dims4/default/92e5f75/2147483647/strip/true/crop/7870x4427+0+411/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F96%2F52f88809aeb9ce9fef1c4de1631a%2F9fe95cf05ae44e858ff99202dce6d4fa"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump faces the challenge of convincing Republican senators, global investors, voters and even Elon Musk that he won’t bury the federal government in debt with his multitrillion-dollar tax breaks package. The response so far from financial markets has been skeptical as Trump seems unable to trim deficits as promised. The tax and spending cuts that passed the House last month would add $5.1 trillion to the national debt in the coming decade if they are allowed to continue. That's according to the Committee for a Responsible Financial Budget, a fiscal watchdog group.",
      "publishedAt": "2025-06-01T11:23:12Z",
      "title": "Can Trump fix the US debt? Even Elon Musk has doubts",
      "url": "https://apnews.com/article/trump-beautiful-bill-budget-deficit-debt-31e5857c9e94deaa11a176bbec538831",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5ea45a/2147483647/strip/true/crop/5575x3136+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Fb6%2Faa043cffb54377c1b59960e60998%2F6e8fdbefe3964cbdaabcbc156dfe5e1f"
    },
    {
      "author": "Ghaith Alsayed",
      "description": "Trading has resumed on the Damascus Securities Exchange after a six-month closure, as Syria’s new leaders attempt to shore up the country’s battered economy and begin rebuilding after nearly 14 years of civil war. The stock exchange had closed during the chaotic days leading up to the ouster of former President Bashar Assad in a lightning rebel offensive. The move to reopen comes as international restrictions on Syria’s financial systems begin to ease. The United States and Europe both last month announced the lifting of a wide raft of sanctions that had been slapped on Syria under the Assad dynasty’s rule.",
      "publishedAt": "2025-06-02T08:39:54Z",
      "title": "Damascus stock exchange reopens after 6-month closure",
      "url": "https://apnews.com/article/syria-stock-exchange-reopens-6ab7d5bb528aabb907187c3f2bfd8b3b",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Michael Marot",
      "description": "Tyrese Haliburton and Myles Turner beamed as they carried the Indiana Pacers shiny, new Eastern Conference championship trophy into their postgame news conferences Saturday night. Pascal Siakam needed help because he was also bringing the series MVP trophy. The Pacers have finally ended their 25-year NBA Finals drought. They enjoyed it with a fitting celebration for the team that plays in a state where basketball is treated like religion. These Pacers have managed to achieve the unthinkable after starting 10-15 and looking less like anything but a title contender. But now Indiana will try to exorcise the demons of its decades-long snake-bitten history when the Pacers take on the Oklahoma City .",
      "publishedAt": "2025-06-02T10:00:07Z",
      "title": "Pacers' 25-year wait is over, but can they conquer the Finals?",
      "url": "https://apnews.com/article/nba-finals-2025-pacers-thunder-ca64713f73182a5544d5b0f1f665ad35",
      "urlToImage": "https://dims.apnews.com/dims4/default/da5a7f3/2147483647/strip/true/crop/5704x3209+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F9e%2F22b95eb34b4d93d1670a719a6bc4%2F4db647a01b7d4a799a6eb5d056cc610c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}