{
  "articles": [
    {
      "author": "NICK PERRY and KAREN MATTHEWS",
      "description": "NEW YORK (AP) — Standoffs between pro-Palestinian student protesters and universities grew increasingly tense on both coasts Wednesday as hundreds encamped at Columbia University faced a deadline from the administration to clear out while dozens remained barricaded inside two buildings on a Northern California college campus.",
      "publishedAt": "2024-04-24T05:23:23Z",
      "title": "Arrests follow barricades and encampments as college students nationwide protest Gaza war",
      "url": "https://apnews.com/47f4f7f0916a6493b79eede3e4d0a55d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75a11cb11ea84de59d5715f50ccaa06b/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT, MICHELLE L. PRICE and CHRIS MEGERIAN",
      "description": "NEW YORK (AP) — Student protests over the war in Gaza have created a new and unpredictable challenge for President Joe Biden as he resists calls to cut off U.S.",
      "publishedAt": "2024-04-24T04:05:58Z",
      "title": "Biden tries to navigate the Israel-Hamas war protests roiling college campuses",
      "url": "https://apnews.com/2337121fb3620d2a4a6b2e22aaaf59bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ab15e36117644118bb7b4fdc054b524/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A veteran tabloid publisher testified Tuesday that he pledged to be Donald Trump 's “eyes and ears\" during his 2016 presidential campaign, recounting how he promised the then-candidate that he would help suppress harmful stories and even arranged to purchase the silence of a doorman.",
      "publishedAt": "2024-04-23T04:08:37Z",
      "title": "Tabloid publisher says he pledged to be Trump campaign's 'eyes and ears' during 2016 race",
      "url": "https://apnews.com/d44d4a7ce66cc08edb5981b3afb882ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30c30ba90f704b49b36e1a3d10bcb740/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Supreme Court hears arguments Thursday over whether Donald Trump is immune from prosecution in a case charging him with plotting to overturn the results of the 2020 presidential election.",
      "publishedAt": "2024-04-24T04:09:08Z",
      "title": "What to listen for during Supreme Court arguments on Donald Trump and presidential immunity",
      "url": "https://apnews.com/38fd48f47324bf812e2194831ef75471",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e08354a76ec48a889e4de8e633112a5/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United Nations called Tuesday for “a clear, transparent and credible investigation” of mass graves uncovered at two major hospitals in war-torn Gaza that were raided by Israeli troops.",
      "publishedAt": "2024-04-23T22:21:30Z",
      "title": "UN calls for investigation into mass graves uncovered at two Gaza hospitals raided by Israel",
      "url": "https://apnews.com/dbaf873d023a7ba66dda05fb49074434",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e626e20a1f63426abc6e3310b800d232/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — A big, new package of U.S. military aid will help Ukraine avoid defeat in its war with Russia. Winning will still be a long slog.",
      "publishedAt": "2024-04-24T05:52:27Z",
      "title": "Ukraine gets a big boost of US aid. It still faces a long slog to repel Russia",
      "url": "https://apnews.com/43072858c26195f6c91565c1ebbf1629",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79b58c7dc1754f90b9a080e70e43a2d8/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "No, TikTok will not suddenly disappear from your phone. Nor will you go to jail if you continue using it after it is banned. After years of attempts to ban the Chinese-owned app, including by former President Donald Trump, a measure to outlaw the popular video-sharing app has won congressional approval and is on its way to President Biden for his signature.",
      "publishedAt": "2024-04-24T04:01:27Z",
      "title": "US banning TikTok? Your key questions answered",
      "url": "https://apnews.com/5e1ff786e89da10a1b799241ae025406",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/348c2221d65b4c118835a57153557d6b/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court will consider Wednesday when doctors can provide abortions during medical emergencies in states with bans enacted after the high court’s sweeping decision overturning Roe v.",
      "publishedAt": "2024-04-24T04:01:39Z",
      "title": "Supreme Court to consider when doctors can provide emergency abortions in states with bans",
      "url": "https://apnews.com/45766f0a1ab576ce0f6515c5a1bd9e2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23a13e03407a4afca0eb307ec7f6e080/3000.jpeg"
    },
    {
      "author": "ARMANDO SOLÍS",
      "description": "VILLA MADERO, Mexico (AP) — As a drought in Mexico drags on, angry subsistence farmers have begun taking direct action on thirsty avocado orchards and berry fields of commercial farms that are drying up streams in the mountains west of Mexico City.",
      "publishedAt": "2024-04-24T04:09:09Z",
      "title": "Villagers in Mexico organize to take back their water as drought, avocados dry up lakes and rivers",
      "url": "https://apnews.com/faaad63fdf0d3f3cba7b33fb0456c053",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/efc7ac3ee31b45c48273c1463471fce3/3000.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "Like many little girls, a young Kristi Yamaguchi loved playing with Barbie. With a schedule packed with ice skating practices, her Barbie dolls became her “best friends.”So, it's surreal for the decorated Olympian figure skater to now be a Barbie girl herself.",
      "publishedAt": "2024-04-24T04:00:33Z",
      "title": "Olympian Kristi Yamaguchi is 'tickled pink' to inspire a Barbie doll",
      "url": "https://apnews.com/05138c29e0996592f5e5a052980b8c9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/888951b7c9594a2dacc84cbb5e590763/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}