{
  "articles": [
    {
      "author": "COLLEEN LONG and WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden warned Monday that a Supreme Court ruling granting presidents broad immunity from prosecution would make an unchecked Republican Donald Trump “more emboldened to do whatever he wants” if he regains the White House in November’s election.",
      "publishedAt": "2024-07-01T19:06:46Z",
      "title": "After Supreme Court immunity ruling, Biden draws sharp contrast with Trump on obeying rule of law",
      "url": "https://apnews.com/c47243b3cedb88ce6ea7905a1975e164",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be92ef27dae54ae6bdb332ab768d5b3a/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump’s lawyers on Monday asked the New York judge who presided over his hush money trial to set aside his conviction and delay his sentencing, scheduled for next week.",
      "publishedAt": "2024-07-02T00:28:45Z",
      "title": "Trump seeks to set aside New York hush money verdict hours after Supreme Court ruling",
      "url": "https://apnews.com/3d97d2e9497a5a208c1309aec7a0cd6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b7612268ff744f896222fdc8566e1ff/3000.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH, SAMY MAGDY and JULIA FRANKEL",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — The Israeli army ordered a mass evacuation of Palestinians from much of Khan Younis on Monday, a sign that troops are likely to launch a new ground assault into the Gaza Strip’s second-largest city.",
      "publishedAt": "2024-07-01T08:35:34Z",
      "title": "Israel orders Palestinians to flee Khan Younis, signaling likely new assault on southern Gaza city",
      "url": "https://apnews.com/453808f05ef8b98eb1a6b9814441224a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b375a85fdaa437089f2ea7ad6ad3965/1920.jpeg"
    },
    {
      "author": "NASSER KARIMI and JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Over 20 years ago, Iran's Supreme Leader Ayatollah Ali Khamenei stood before a crowd at Friday prayers to denounce the United States for its disenchanted electorate.",
      "publishedAt": "2024-07-02T05:20:26Z",
      "title": "As Iran faces a rare runoff presidential election, disenchanted voters are staying away",
      "url": "https://apnews.com/9a146e2a73411e1623e15ce09a140b44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be6db542803a4b6e9e919f16e9dde118/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO and KOFI JONES",
      "description": "BRIDGETOWN, Barbados (AP) — Hurricane Beryl strengthened to Category 5 status late Monday after it ripped doors, windows and roofs off homes across the southeastern Caribbean with devastating winds and storm surge fueled by the Atlantic's record warmth.",
      "publishedAt": "2024-07-01T11:08:06Z",
      "title": "Hurricane Beryl grows to Category 5 strength as it razes southeast Caribbean islands",
      "url": "https://apnews.com/234b2ecc47f8f0a8d6f3778bea503861",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/730929da4968423c9c738b1e71252a64/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court ended its term by ruling for the first time that former presidents have broad immunity from prosecution, a decision that almost certainly means Donald Trump won't stand trial before the November election.",
      "publishedAt": "2024-07-02T04:01:23Z",
      "title": "Highlights from Supreme Court term: Rulings on Trump, regulation, abortion, guns and homelessness",
      "url": "https://apnews.com/5d49f74d8b523f250f91512b46e1ac22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/455ba3614345483fb26c4514e49c6c4b/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korea said Tuesday it had test-fired a new tactical ballistic missile capable of carrying “a super-large warhead,” a claim quickly disputed by South Korean officials and experts who speculate the North likely fabricated a successful test to conceal a botched launch.",
      "publishedAt": "2024-07-02T00:21:44Z",
      "title": "North Korea brags of new missile with 'super-large warhead.' Outsiders doubt the North's claim",
      "url": "https://apnews.com/34446d7f69d43f5888c0fc611bae048e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/283aa52c45644365a955d947ac08bf2d/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Venezuela’s government plans to resume negotiations with the U.S. government this week, President Nicolás Maduro announced Monday, less than a month before a highly anticipated election in which he and his party are facing their toughest challenge in decades.",
      "publishedAt": "2024-07-02T00:31:34Z",
      "title": "Ahead of election, Venezuela's Maduro says he has agreed to resume negotiations with United States",
      "url": "https://apnews.com/3fa0b1326b860446c6707ba95a86435b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1abb729474d24d08b786ae6a10aa7694/3000.jpeg"
    },
    {
      "author": "CORAL MURPHY MARCOS",
      "description": "SAN JUAN, Puerto Rico (AP) — Gang violence in Haiti has displaced more than 300,000 children since March, the U.N. children's agency said Tuesday as the Caribbean country struggles to curb killings and kidnappings.",
      "publishedAt": "2024-07-02T04:03:33Z",
      "title": "Haiti's gang violence has displaced 300,000 children, the UN says",
      "url": "https://apnews.com/e502ca0ba324ba8fae710af6058ab7fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/042eef3c05fd4cda98571e66613fe1fd/3000.jpeg"
    },
    {
      "author": "DAVE SKRETTA",
      "description": "KANSAS CITY, Mo. (AP) — Gregg Berhalter gave a single-word answer after the United States was eliminated from the Copa America with a loss to Uruguay when asked whether he was the right man to lead the Americans into the 2026 World Cup.",
      "publishedAt": "2024-07-02T03:05:17Z",
      "title": "US eliminated from Copa America with 1-0 loss to Uruguay, increasing pressure to fire Berhalter",
      "url": "https://apnews.com/4b71dabc975c35eafce95017926234d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec96126626704810acdba61a147a3fd4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}