{
  "articles": [
    {
      "author": "JOHNSON LAI, CHRISTOPHER BODEEN and SIMINA MISTREANU",
      "description": "HUALIEN, Taiwan (AP) — The strongest earthquake in a quarter-century rocked Taiwan Wednesday morning, killing nine people, stranding dozens at quarries and a national park, and sending some residents scrambling out the windows of damaged buildings.",
      "publishedAt": "2024-04-03T00:24:07Z",
      "title": "Fierce earthquake rattles Taiwan, killing 9 and injuring more than 1,000",
      "url": "https://apnews.com/f086aac0c3082036d1ca77c01828fb28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4226cac03b246cfa1c1ae621a660386/1920.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — The bodies of six foreign aid workers killed in Israeli airstrikes began the journey back to their home countries Wednesday as more questions swirled over Israel's explanation that a “misidentification” led to the attack on their convoy.",
      "publishedAt": "2024-04-03T12:30:29Z",
      "title": "Bodies of 6 foreign aid workers slain in Israeli strikes are transported out of Gaza",
      "url": "https://apnews.com/3e379f56a6153c347179e3e99823c407",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b61aaf6421004bad91582a68a7f7d7ed/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli airstrikes that killed seven aid workers in Gaza reverberated around the world, as friends and relatives mourned the losses of those who were delivering food to besieged Palestinians with the charity World Central Kitchen.",
      "publishedAt": "2024-04-02T18:40:33Z",
      "title": "Family and friends recall dedication of World Central Kitchen aid workers killed in Gaza",
      "url": "https://apnews.com/f79eccaf93e34e36d39ae16c848dde92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27f84080751545e28f22a51e6671ab73/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Shortly after an airstrike widely attributed to Israel destroyed an Iranian consulate building in Syria, the United States had an urgent message for Iran: We had nothing to do with it.",
      "publishedAt": "2024-04-03T20:33:55Z",
      "title": "US braces for retaliation after attack on Iran consulate — even as it says it wasn't involved",
      "url": "https://apnews.com/a083ddef0db28cde2a6fdd84e0a56367",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/240048e8292746e98e0e456fcb13f97f/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The average price paid for a ticket on the resale market this week was twice as high for the NCAA women's Final Four compared with that for the men's semifinals, according to a technology company that analyzes prices across multiple platforms.",
      "publishedAt": "2024-04-03T19:04:07Z",
      "title": "Women's Final Four ticket on resale market selling for average of $2,300, twice as much as for men",
      "url": "https://apnews.com/d6cae68a63070866f54594d4bf2e5837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e42d78eda4748b69fac12552dd6a481/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Federal prosecutors chided the judge presiding over former President Donald Trump's classified documents case in Florida, warning her off potential jury instructions that they said rest on a “fundamentally flawed legal premise.”",
      "publishedAt": "2024-04-03T11:20:02Z",
      "title": "Prosecutors in Trump's classified documents case sharply rebuke judge's unusual and 'flawed' order",
      "url": "https://apnews.com/a99a6bc9fd9b44ffddecf979f8e1baa9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c73f370c01184690a2465cb2a0ec0cd2/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukraine lowered its draft-eligible age for men from 27 to 25 on Wednesday, reflecting the strain that more than two years of war with Russia has put on its military and the need to infuse its depleted ranks with new conscripts.",
      "publishedAt": "2024-04-03T07:52:41Z",
      "title": "Ukraine lowers its conscription age to 25 to replenish its beleaguered troops",
      "url": "https://apnews.com/251058a942a253f3eaec2c53373adf03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c3bc422c9c3476280f7ef918634598a/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Federal Reserve officials will likely reduce their benchmark interest rate later this year, Chair Jerome Powell said Wednesday, despite recent reports showing that the U.S.",
      "publishedAt": "2024-04-03T16:11:05Z",
      "title": "Powell: Fed still sees rate cuts this year; election timing won't affect decision",
      "url": "https://apnews.com/f9c65fb1b8116168f825657bc5f5c117",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05552354cdb2489d8762de355612a4c9/3000.jpeg"
    },
    {
      "author": "JACQUELINE LARMA and ENRIC MARTI",
      "description": "If she had lived, there would have been so many more photos.Anja could have gone to Kabul for the chaotic U.S. withdrawal, and to war-shattered Ukraine after the Russian invasion. She would have been at the Olympics, and at center court at Wimbledon.",
      "publishedAt": "2024-04-03T16:07:08Z",
      "title": "AP PHOTOS: 10 years after her killing, Anja Niedringhaus' images speak for her",
      "url": "https://apnews.com/f8e530c88c72aa173c4f39cbd9697896",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1116927d0d0a415799bf99ed8fba20a1/2385.jpeg"
    },
    {
      "author": "CHARLES ODUM",
      "description": "SAVANNAH, Ga. (AP) — Charlie Russo had an unbelievable view of Hank Aaron's record-breaking 715th home run. Fifty years later, he's ready to share it with the world.The 81-year-old Russo is releasing his long-private footage of the moment Aaron broke Babe Ruth's record on April 8, 1974, which he captured after surreptitiously following Aaron's family onto the field at Atlanta-Fulton County Stadium.",
      "publishedAt": "2024-04-03T19:19:12Z",
      "title": "50 years later, a Braves fan shares long-private video of Hank Aaron's 715th home run",
      "url": "https://apnews.com/3f428c51025bf575cd893745698c9827",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73c015e752cb421581e778124bc4519a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}