{
  "articles": [
    {
      "author": "ABBY SEWELL and BASSEM MROUE",
      "description": "BEIRUT, Lebanon (AP) — Israeli airstrikes Saturday in central Beirut killed at least 15 people, officials said, as the once-rare attacks on the heart of Lebanon's capital continued without warning while diplomats scrambled to broker a cease-fire.",
      "publishedAt": "2024-11-23T08:51:22Z",
      "title": "Israeli strikes without warning in central Beirut kill at least 15 as diplomats push for cease-fire",
      "url": "https://apnews.com/60f383ef1f42ff9928770a77d27ec4b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c31c0067397425787556d3f98953cb0/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump launched a blitz of picks for his Cabinet, but he took his time before settling on billionaire investor Scott Bessent as his treasury secretary nominee.",
      "publishedAt": "2024-11-23T05:03:18Z",
      "title": "Trump raced to pick many Cabinet posts. He took more time to settle on a treasury secretary",
      "url": "https://apnews.com/f01fc0bab029c10b453ee9afb2b41b24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19002ea6b1f54971926ab6bdc1ad8b7d/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "Scott Turner, President-elect Donald Trump choice to lead the Department of Housing and Urban Development, is a former NFL player who ran the White House Opportunity and Revitalization Council during Trump’s first term.",
      "publishedAt": "2024-11-23T16:46:53Z",
      "title": "What to know about Scott Turner, Trump's pick for housing secretary",
      "url": "https://apnews.com/727417b56d0e1f85a40eaf5f7d13d42f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54bc03a46d6d438b9eb3aef3f0e0a9aa/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "JEFFERSON CITY, Mo. (AP) — Two weeks before Election Day, activists from across the country gathered for an online rally heralding the historic number of state ballot initiatives seeking to change the way people vote.",
      "publishedAt": "2024-11-23T05:03:39Z",
      "title": "Voters rejected historic election reforms across the US, despite more than $100M push",
      "url": "https://apnews.com/bc797f209e5f98a18afb2e5f784e63b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1456407b2cef4ea3be85bc3ca0e05f59/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — This past week has seen the most significant escalation in hostilities that Ukraine has witnessed since Russia's full-scale invasion and marks a new chapter in the nearly three-year war — one tinged with uncertainty and fear.",
      "publishedAt": "2024-11-23T11:32:09Z",
      "title": "The week that upped the stakes of the Ukraine war",
      "url": "https://apnews.com/0555d1af20edcb8dcf8aef47d868db22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bd8da0dcb594a22b03bfe16ea9946d9/1280.jpeg"
    },
    {
      "author": "NOAH BERGER and OLGA R. RODRIGUEZ",
      "description": "HEALDSBURG, Calif. (AP) — A major storm dropped more snow and record rain in California, causing small landslides and flooding some streets, while on the opposite side of the country blizzard or winter storm warnings were in effect Saturday for areas spanning from the Northeast to central Appalachia.",
      "publishedAt": "2024-11-23T06:01:21Z",
      "title": "Storm dumps record rain in Northern California, while US Northeast deals with winter storms",
      "url": "https://apnews.com/e0b787685ad719b1a99c722658f484f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b905d4e9e6054ca9a01faea5493952f1/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Unlike scores of people who scrambled for the blockbuster drugs Ozempic and Wegovy to lose weight in recent years, Danielle Griffin had no trouble getting them.",
      "publishedAt": "2024-11-23T13:55:31Z",
      "title": "Even with access to blockbuster obesity drugs, some people don't lose weight",
      "url": "https://apnews.com/9f8ab517f26ccc6d2d32ce3e829ba8ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cd03b4c9ed946b9b82c3932e60c987e/1920.jpeg"
    },
    {
      "author": "RIAZ KHAN",
      "description": "PESHAWAR, Pakistan (AP) — Fighting between armed Sunni and Shiite groups in northwestern Pakistan killed at least 37 people and injured 25 others, a senior police officer from the region said Saturday.",
      "publishedAt": "2024-11-23T07:16:35Z",
      "title": "Fighting between armed sectarian groups in restive northwestern Pakistan kills at least 37 people",
      "url": "https://apnews.com/aec6e365dd13de8e381740008fbd14b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b2826e8ccd24879b66e26899affa434/3000.jpeg"
    },
    {
      "author": "ANDREW WILKS",
      "description": "ISTANBUL (AP) — The Turkish doctor at the center of an alleged fraud scheme that led to the deaths of 10 babies told an Istanbul court Saturday that he was a “trusted” physician.",
      "publishedAt": "2024-11-23T12:27:08Z",
      "title": "Doctor at the heart of Turkey's newborn baby deaths case says he was a 'trusted' physician",
      "url": "https://apnews.com/41d5bed064d377e5418d0af358c1938b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dbdcb5317784df890e3d253ac1002bf/3000.jpeg"
    },
    {
      "author": "KATHERINE ROTH",
      "description": "Travel can be stressful in the best of times. Now add in the high-level anxiety that seems to be baked into every holiday season and it's clear that travelers could use some help calming frazzled nerves.",
      "publishedAt": "2024-11-23T05:05:27Z",
      "title": "Hydrate. Make lists. Leave yourself time. And other tips for reducing holiday travel stress",
      "url": "https://apnews.com/db5e5d819b6251bd415a9ad204baa03a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fe0aa9456ed4952a6ef4843535f8bde/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}