{
  "articles": [
    {
      "author": "MEG KINNARD and WILL WEISSERT",
      "description": "CHARLESTON, S.C. (AP) — Donald Trump won South Carolina’s Republican primary on Saturday, easily beating former U.N. Ambassador Nikki Haley in her home state and further consolidating his path to a third straight GOP nomination.",
      "publishedAt": "2024-02-24T05:02:39Z",
      "title": "Trump wins South Carolina, easily beating Haley in her home state and closing in on GOP nomination",
      "url": "https://apnews.com/13237d287ce770e0a45e9bccee78e8ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f41dac29a3a48169a74f4afddf94dc7/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "NEW YORK (AP) — Donald Trump trounced Nikki Haley on Saturday in the South Carolina primary, a victory that emphatically punctuated the depth and breadth of his support among Republican primary voters as he vanquished his lone remaining major opponent in her home state.",
      "publishedAt": "2024-02-25T00:17:01Z",
      "title": "Takeaways from South Carolina primary: Donald Trump's Republican home field advantage is everywhere",
      "url": "https://apnews.com/e42427234446c38ee06b2a771bddc16e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dec6c786a3ab46e08d939dbe9bec0d99/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli officials will meet Saturday night on the next steps after the latest talks with the United States, Egypt and Qatar in search of a deal on pausing the fighting in Gaza, Israeli Prime Minister Benjamin Netanyahu said.",
      "publishedAt": "2024-02-24T10:53:08Z",
      "title": "Israeli officials to meet on a proposed pause in Gaza while the Cabinet is set to OK a Rafah plan",
      "url": "https://apnews.com/1e0e78d7ecf17c29a699c0b3c873a707",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd6c3baf68b6411fbe3a0bf46b83f622/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. and Britain struck 18 Houthi targets in Yemen on Saturday, answering a recent surge in attacks by the Iran-backed militia group on ships in the Red Sea and Gulf of Aden, including a missile strike this past week that set fire to a cargo vessel.",
      "publishedAt": "2024-02-24T09:29:12Z",
      "title": "US and British strikes on Houthi sites in Yemen answer militants’ surge in Red Sea attacks on ships",
      "url": "https://apnews.com/89b3f92ae9dd6279b56d945439010a27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4b2169bb264422b8bb3eaa2c465cb80/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS and JOANNA KOZLOWSKA",
      "description": "The body of Russian opposition leader Alexei Navalny has been handed over to his mother, a top aide to Navalny said Saturday on his social media account.",
      "publishedAt": "2024-02-24T09:10:53Z",
      "title": "The body of Russian opposition leader Alexei Navalny has been handed over to his mother, aide says",
      "url": "https://apnews.com/78fa6a0d6792ee868ad41fd672dea510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b322a7204fc4d73a3e09798ac713a53/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — President Volodymyr Zelenskyy welcomed Western leaders to Kyiv Saturday to mark the second anniversary of Russia's full-scale invasion, as Ukrainian forces run low on ammunition and foreign aid hangs in the balance.",
      "publishedAt": "2024-02-24T05:59:52Z",
      "title": "Western leaders rally around Kyiv to mark 2 years since Russia's full-scale invasion",
      "url": "https://apnews.com/65088ba9eb9bd729cf8c677e2115cb35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67d3b6740f7340ac8f6ae431fcb1d35c/1920.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "“Oppenheimer” continued to steamroll through Hollywood’s awards season on Saturday, winning the top prize, for outstanding cast, along with awards for Cillian Murphy and Robert Downey Jr., at the 30th Screen Actors Guild Awards.",
      "publishedAt": "2024-02-24T05:45:13Z",
      "title": "'Oppenheimer,' Lily Gladstone win at 30th Screen Actors Guild Awards",
      "url": "https://apnews.com/0ef5ed6895af04c56237f07b138c8a61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/623b461746874f18a3181168ef345da2/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden and Utah Gov. Spencer Cox disagree on many issues but they were united Saturday in calling for less bitterness in politics and more bipartisanship.",
      "publishedAt": "2024-02-25T02:00:32Z",
      "title": "Biden and Utah's governor call for less bitterness and more bipartisanship in the nation's politics",
      "url": "https://apnews.com/bcc015900f6dc8a103e56fd65fc13558",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7983920b2de34956876ad6805e1f9197/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — The eldest son of Mexico’s president and the governing party's presidential candidate said Saturday that their telephone numbers were published on social media and that they have received threats and insults.",
      "publishedAt": "2024-02-24T20:52:34Z",
      "title": "Mexico president's son, presidential candidate denounce leak of phone numbers, say threats received",
      "url": "https://apnews.com/0af5688f4b6cb910f596908ad36a843b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/651c7722cae441bcbd92232b8591f232/3000.jpeg"
    },
    {
      "author": "YURAS KARMANAU",
      "description": "TALLINN, Estonia (AP) — Belarusians will cast ballots Sunday in tightly controlled parliamentary and local elections that are set to cement the steely rule of the country's authoritarian leader, despite calls for a boycott from the opposition that dismissed the balloting as a “senseless farce.”",
      "publishedAt": "2024-02-25T04:04:38Z",
      "title": "Belarusians vote in tightly controlled election amid opposition calls for its boycott",
      "url": "https://apnews.com/b32e1a653d058be987adfee47a136a3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30a13b26291d4ad99ca23628d2dca7f0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}