{
  "articles": [
    {
      "author": null,
      "description": "Vice President JD Vance said Elon Musk was making a mistake going after President Donald Trump in a storm of bitter and inflammatory social media posts after a falling out between the two men. But the vice president, in an interview released Friday after the very public blow up between the world’s richest man and arguably the world’s most powerful, also tried to downplay Musk’s blistering attacks as an “emotional guy” who got frustrated. Vance’s comments come as other Republicans in recent days have urged the two men, who months ago were close allies spending significant time together, to mend fences.",
      "publishedAt": "2025-06-07T14:22:00Z",
      "title": "Vance says Musk making a 'huge mistake' in going after Trump but also tries to downplay the attacks",
      "url": "https://apnews.com/article/vance-elon-musk-theo-von-fd6f6af0b147d129836c243df31a7fc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/22bb370/2147483647/strip/true/crop/3549x1996+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F61%2F5d6dd4fe58d19f9f213577a3ebfa%2Fb72c7cbd0dce4f338adb188f69e58874"
    },
    {
      "author": null,
      "description": "A large Russian drone-and-missile attack has targeted Ukraine’s eastern city of Kharkiv, killing at least three people and injuring 21. Local Ukrainian officials said the attack on Saturday included deadly aerial glide bombs. Kharkiv’s mayor Ihor Terekhov said the barrage also damaged 18 apartment buildings and 13 private homes. Citing preliminary data, he said Russia used 48 Shahed drones, two missiles and four aerial glide bombs in the attack. The intensity of the Russian attacks on Ukraine over the past weeks has further dampened hopes that the warring sides could reach a peace deal anytime soon days — especially after Kyiv recently embarrassed the Kremlin with a surprising drone attack on military airfields deep inside Russia.",
      "publishedAt": "2025-06-07T06:12:32Z",
      "title": "A Russian attack on Ukraine's eastern city of Kharkiv kills 3 people",
      "url": "https://apnews.com/article/russia-ukraine-war-kharkiv-66093df9697bdb27794c8055d9beac10",
      "urlToImage": "https://dims.apnews.com/dims4/default/91b6f55/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F1c%2Ff9180dedd0dbd7c07c8421c91e61%2Ff8b705eb716742ac966d32311f0ef7e3"
    },
    {
      "author": null,
      "description": "Israel says it has retrieved the body of a Thai hostage kidnapped into Gaza on Oct. 7, 2023. The Prime Minister’s office said Saturday that the body of Thai citizen Nattapong Pinta was returned to Israel in a special military operation. Pinta was kidnapped from Kibbutz Nir Oz and killed in captivity near the start of the war, said the government. Thais were the largest group of foreigners held captive by Hamas militants. This comes two days after the bodies of two Israeli-American hostages were retrieved. Fifty-five hostages remain in Gaza, of whom Israel says more than half are dead.",
      "publishedAt": "2025-06-07T08:03:01Z",
      "title": "Israel says it retrieved the body of a Thai hostage kidnapped into Gaza",
      "url": "https://apnews.com/article/israel-palestinians-gaza-thai-hostage-bd910477d68ebc1ee98e0ea424c4fe45",
      "urlToImage": "https://dims.apnews.com/dims4/default/747686e/2147483647/strip/true/crop/799x449+0+42/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2Fbc%2F921aace0fc464aa274eff8382930%2F5a806f39efe049109d87c3c3b02ff6b7"
    },
    {
      "author": null,
      "description": "The fight over the mistaken deportation of Kilmar Abrego Garcia to El Salvador now returns to the U.S. court system. Abrego Garcia appeared Friday in court for the first time since he was expelled, facing new charges related to a large human smuggling operation. He was placed in federal custody in Tennessee after being brought back to the U.S. The Trump administration alleges that long before his deportation, Abrego Garcia smuggled thousands of people across the country who were living in the U.S. illegally. Abrego Garcia’s wife and lawyers offer a much different story, saying the now 29-year-old had as a teenager fled local gangs that terrorized his family for a life in Maryland.",
      "publishedAt": "2025-06-07T17:05:21Z",
      "title": "Kilmar Abrego Garcia is back in the US, charged with human smuggling as attorneys vow ongoing fight",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-human-smuggling-deportation-tennessee-f8ded5881c1cedd10c725e7b1cca79bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/acbad8d/2147483647/strip/true/crop/1029x579+0+54/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2Fe9%2Fd4f34a97156268f6fdd695c4e66b%2F00c074ffb2ac4c46ad3912c3e5fdb0f0"
    },
    {
      "author": null,
      "description": "Call it the 911 presidency. Despite insisting that the United States has rebounded from calamity under his watch, President Donald Trump is harnessing emergency powers unlike any of his predecessors. Whether it’s leveling punishing tariffs, deploying troops to the border or sidelining environmental regulations, Trump has relied on rules and laws intended only for use in extraordinary circumstances like war and invasion. An analysis by The Associated Press shows that 20% of Trump’s 150 executive orders have included some kind of emergency declaration, a proportion that far exceed those issued by any other recent president during entire four-year terms.",
      "publishedAt": "2025-06-07T04:00:53Z",
      "title": "Trump flexes emergency powers in his second term",
      "url": "https://apnews.com/article/trump-emergency-powers-tariffs-immigration-5cbe386d8f2cc4a374a5d005e618d76a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e83df8e/2147483647/strip/true/crop/4353x2449+0+227/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F45%2F45ba0c760ecc6430f0388dcdd1a2%2F79a228ea731a42a9bba6f332258465c7"
    },
    {
      "author": null,
      "description": "Chiseling away at President Barack Obama’s Affordable Care Act. Rolling back the green energy tax breaks central to President Joe Biden’s Inflation Reduction Act. At its core, the Republican “big, beautiful bill” is more than just an extension of tax breaks approved during President Donald Trump’s first term at the White House. The package is an attempt to undo, little by little, the signature domestic achievements of the past two Democratic presidents. House Speaker Mike Johnson says Republicans are going “to do what we said we were going to do.” But the bill's spending cuts pointed at the Democratic-led programs are causing the most political turmoil.",
      "publishedAt": "2025-06-07T11:34:20Z",
      "title": "Trump's big bill also seeks to undo the big bills of Biden and Obama",
      "url": "https://apnews.com/article/trump-big-beautiful-bill-medicaid-tax-cuts-bec87c569760ed979ac8c34cccba186b",
      "urlToImage": "https://dims.apnews.com/dims4/default/9085cde/2147483647/strip/true/crop/4830x2717+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F84%2F4c3e553eef6edf77358412c07e8d%2F6d9ffe8bd2d640eeba884ea0dc1551be"
    },
    {
      "author": null,
      "description": "President Donald Trump walked out to a thunderous standing ovation just ahead of the start of the UFC pay-per-view card at the Prudential Center, putting his public feud with tech billionaire Elon Musk on hold to instead watch the fierce battles inside the cage. Trump was accompanied Saturday night by UFC President Dana White and the pair headed to their cageside seats to Kid Rock’s “American Bad Ass.” Trump and White did the same for UFC’s card last November at Madison Square Garden, only then they were joined by Musk. Trump shook hands with fans and supporters including retired boxing champion Mike Tyson",
      "publishedAt": "2025-06-08T02:45:58Z",
      "title": "Trump attends UFC championship fight in New Jersey, taking a break from Musk feud for cage fights",
      "url": "https://apnews.com/article/mma-ufc-trump-tyson-c0d9279b626e69cc0ca62474c7dafa2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/2589127/2147483647/strip/true/crop/4497x2530+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Ff9%2F831c4df1aa58c9d996336361d1f4%2F0451208744984305af976d31c3109a54"
    },
    {
      "author": null,
      "description": "Tear gas and smoke have filled the air on the southern outskirts of Los Angeles as confrontations between immigration authorities and demonstrators extended into a second day. Border Patrol personnel in riot gear and gas masks stood guard outside an industrial park in the city of Paramount. They deployed tear gas as bystanders and protesters gathered on medians and across the street. Some jeered at officers. A woman said through a megaphone: “ICE out of Paramount” and “You are not welcome here.\" Homeland Security Secretary Kristi Noem warned “LA rioters” that interference with immigration enforcement will not be tolerated. DHS said said recent ICE operations in LA resulted in the arrest of 118 immigrants.",
      "publishedAt": "2025-06-07T20:08:14Z",
      "title": "Immigration authorities extend activity in Los Angeles area amid street protests",
      "url": "https://apnews.com/article/immigration-raids-los-angeles-2d1d5e2f638da600c4b34fe8bf8cf3aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7c4d8f/2147483647/strip/true/crop/4261x2397+0+222/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2F88%2Fe0d7bb2bda168de2975411a20d33%2F005136d86c724815954920e30dcd0112"
    },
    {
      "author": null,
      "description": "President Donald Trump grew impatient with how long it was taking to finish new planes to serve as Air Force One, so he started to look for other options. He found one in a luxury jumbo jet that Qatar was willing to sell — and now may be turning into a divisive gift. Assuming legal issues around the transfer are resolved, the next question is how long it will take to refurbish the Boeing 747 for presidential travel. That could span years and cost billions of dollars, meaning he might not get to use the plane during his term. If he’s in a rush and wants to cut corners, it’s a matter of how much risk he’s willing to take.",
      "publishedAt": "2025-06-07T11:20:30Z",
      "title": "What it takes to convert Trump's Qatar jet into Air Force One",
      "url": "https://apnews.com/article/trump-qatar-air-force-one-covert-security-questions-8498cc3d222fd7864c3dd2c9c97d7e69",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c1ce20/2147483647/strip/true/crop/5761x3241+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F22%2F591f2a406fe373fb969d9a5d8da5%2Fde74eb4918ca426589adf283ee9a41fe"
    },
    {
      "author": null,
      "description": "Federal health officials say a salmonella outbreak linked to a large egg recall has made dozens of people sick in seven states in the West and Midwest. On Friday, the August Egg Company recalled about 1.7 million brown organic and brown cage-free egg varieties distributed to grocery stores because of the potential for salmonella. The U.S. Centers for Disease Control and Prevention say 79 people have gotten a strain of salmonella that was linked to the eggs, and 21 people have been hospitalized. The recall covers Arizona, California, Illinois, Indiana, Nebraska, New Mexico, Nevada, Washington and Wyoming.",
      "publishedAt": "2025-06-07T15:46:58Z",
      "title": "Salmonella outbreak tied to eggs sickens people in 7 states",
      "url": "https://apnews.com/article/salmonella-outbreak-eggs-cdc-c521525f7af5d5abe50c62c98b1e082c",
      "urlToImage": "https://dims.apnews.com/dims4/default/a54ddff/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F1e%2Fec40e2cf8c198a7920116cd63332%2F097df7fc56c44c51be936c085c31e5ed"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}