{
  "articles": [
    {
      "author": null,
      "description": "Israel says it plans to take over Gaza City in another escalation of its 22-month war with Hamas. The decision, made after a late-night meeting of top officials, drew Palestinian rejection, fueled mounting international calls to end the war and provoked worries in Israel over the fate of hostages still held by Hamas. Israel’s air and ground war has already killed tens of thousands of people in Gaza, displaced most of the population, destroyed vast areas and pushed the territory toward famine. Another major ground operation would almost certainly exacerbate the humanitarian catastrophe. Hamas in a statement rebuffed Netanyahu’s plans and vowed remain defiant.",
      "publishedAt": "2025-08-08T06:20:07Z",
      "title": "Israel announces plan to retake Gaza City in another escalation of the war",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostages-gaza-08-08-2025-920f5b4bfd3fe07ded6acd28f5d77768",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c48ff2/2147483647/strip/true/crop/6124x3445+0+319/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F2d%2F110abd56da33a34463f6a7184624%2Fd9d69b9fb6c14d1588830dc4c37b33d4"
    },
    {
      "author": null,
      "description": "German Chancellor Friedrich Merz says Germany will not authorize exports of military equipment that could be used in Gaza “until further notice.” This decision comes after the Israeli Cabinet announced plans to take over Gaza City. On Friday, Merz emphasized that Israel “has the right to defend itself against Hamas’ terror.” He stated that the release of Israeli hostages and negotiations toward a cease-fire in the 22-month conflict “are our top priority.” Merz added that the recent military actions by Israel make it difficult for Germany to see how these goals will be achieved.",
      "publishedAt": "2025-08-08T10:31:08Z",
      "title": "Germany stops military exports that could be used in Gaza",
      "url": "https://apnews.com/article/germany-mideast-weapons-b957e28b73ee94ed33fbd2d4e4d36246",
      "urlToImage": "https://dims.apnews.com/dims4/default/10ebff4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2Fd4%2F6233e30ffe309e49b09b18d97d34%2F847fee673abd441b9a611804b98537e5"
    },
    {
      "author": null,
      "description": "President Donald Trump has started imposing higher import taxes on goods from over 60 countries, including the European Union, Japan and South Korea. These tariffs, which began Thursday, are part of Trump's strategy to reduce the trade deficit and encourage foreign investment in the U.S. However, the economic impact is already visible, with signs of stalled hiring, rising inflation and declining home values. Despite the uncertainty, Trump remains optimistic about economic growth, while many experts warn of potential long-term damage.",
      "publishedAt": "2025-08-07T04:02:21Z",
      "title": "Trump's broad tariffs go into effect, just as economic pain is surfacing",
      "url": "https://apnews.com/article/trump-tariffs-into-effect-economy-warning-signs-eafe20de9abad312573b320fd4b5fb33",
      "urlToImage": "https://dims.apnews.com/dims4/default/76528ac/2147483647/strip/true/crop/5491x3089+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2Fac%2F0a927050c5e8025388db521beb7e%2Fd73c8af454fd41b49a98072c44f6691a"
    },
    {
      "author": null,
      "description": "Ukrainian soldiers are expressing little hope for a diplomatic solution to the war with Russia. U.S. President Donald Trump’s Friday deadline for the Kremlin to stop the killing has arrived. Trump is eyeing a possible summit with Russian President Vladimir Putin to discuss the conflict. His efforts to pressure Putin have delivered no progress so far. Russia’s army is advancing deeper into Ukraine and it is bombarding cities. In eastern Ukraine, a commander says Moscow isn’t interested in peace. Hungarian Prime Minister Viktor Orbán says Europe should lead efforts to end the conflict.",
      "publishedAt": "2025-08-08T10:49:06Z",
      "title": "Ukrainian troops have little hope for peace as Trump presses Putin",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-deadline-putin-423e6a28df5186a48b7383eae41c11c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca6c91c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fdb%2Fb00b3291f089e967cdd297b76e22%2F21fa3b40e5954a729b03efac87ec2fbb"
    },
    {
      "author": null,
      "description": "Police say a 61-year-old man fatally shot a neighbor in rural Pennsylvania and then ambushed responding state troopers, wounding two while firing dozens of rounds from a semiautomatic weapon. State police Col. Christopher Paris told reporters Lori Wasko’s boyfriend called 911 after 11 a.m. Thursday from their home near Thompson to report shots fired. Paris says the 57-year-old woman was shot and killed outside her home near her vehicle. Paris says a man identified as Carmine Faino, 61, shot Wasko and then shot troopers Joseph Perechinsky and William Jenkins as they were arriving. Both troopers were in stable condition Thursday night. Faino was shot and killed by law enforcement.",
      "publishedAt": "2025-08-07T17:38:34Z",
      "title": "Woman killed by neighbor before responding state troopers were ambushed by gunfire, police say",
      "url": "https://apnews.com/article/pennsylvania-troopers-shot-9fa326255d7522b1f0564132abfa8aea",
      "urlToImage": "https://dims.apnews.com/dims4/default/63c4783/2147483647/strip/true/crop/3500x1969+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F77%2F8a12b0120535af679601fcc04363%2F7802a794b11444f9bea7d2bf68d5e7e7"
    },
    {
      "author": null,
      "description": "U.S. stocks drifted to a mixed finish as President Donald Trump’s tariffs on dozens of countries had only a muted effect on markets worldwide. The S&P 500 slipped 0.1% Thursday. The Dow Jones Industrial Average dipped 0.5%, and the Nasdaq composite rose 0.3% to a record. Worries are high that Trump’s tariffs are damaging the economy, particularly after last week’s worse-than-expected report on the job market. But hopes for coming cuts to interest rates by the Federal Reserve and a torrent of stronger-than-expected profit reports from big U.S. companies are helping to offset the concerns, at least for now. Treasury yields ticked higher.",
      "publishedAt": "2025-08-07T05:55:00Z",
      "title": "Wall Street drifts as stock markets worldwide take Trump's new tariffs in stride",
      "url": "https://apnews.com/article/shares-markets-tariffs-china-trump-earnings-06cc62c73fb63a6246b26b651d53098c",
      "urlToImage": "https://dims.apnews.com/dims4/default/26b2944/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F65%2F5305c43dc97173e8708e62dfdf14%2Fec263125569c4d4db8adc7253b4056d7"
    },
    {
      "author": null,
      "description": "Intel’s shares slumped Thursday as President Donald Trump said in a social media post that the chipmaker’s CEO must resign immediately. “The CEO of Intel is highly CONFLICTED and must resign, immediately,” Trump posted on Truth Social. Trump made the post after Sen. Tom Cotton sent a letter to Intel Chairman Frank Yeary expressing concern over CEO Lip-Bu Tan’s investments and ties to semiconductor firms that are reportedly linked to the Chinese Communist Party and the People’s Liberation Army, and asked the board whether Tan had divested his interests in these companies to eliminate any conflicts of interest.",
      "publishedAt": "2025-08-07T12:20:55Z",
      "title": "Trump urges Intel CEO to resign in social post",
      "url": "https://apnews.com/article/intel-trump-cotton-yeary-tan-206152398b39bf92ebe6391add109388",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8c2594/2147483647/strip/true/crop/6000x3375+0+317/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2Fe0%2F2f4c556a56eb727542660d9bf4d7%2F302bbb5724534792ae4a78c8beca85c6"
    },
    {
      "author": null,
      "description": "A federal judge is set to hear a Trump administration request to end a long-standing policy on protections for immigrant children in federal custody. The Flores settlement limits how long Customs and Border Protection can hold immigrant children and requires safe conditions. Advocates argue the protections are necessary and have submitted accounts of poor conditions in detention centers. The Trump administration says conditions have improved since the settlement was formalized in 1997. But advocates for the children say the government is holding children beyond the time limits set out in the agreement. A hearing is set Friday in Los Angeles. The Trump administration request comes after the Biden administration successfully pushed to partially end the agreement last year.",
      "publishedAt": "2025-08-08T04:01:59Z",
      "title": "Judge to consider ending protections for immigrant children in US custody",
      "url": "https://apnews.com/article/trump-immigration-detention-children-flores-settlement-91b9d5e1d7c6f6e06d775b952bbb4ae5",
      "urlToImage": "https://dims.apnews.com/dims4/default/f278648/2147483647/strip/true/crop/3864x2174+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fb6%2F5aec9cef4a4b7295358bdc307dba%2Fac9900dd720b48c28e35cea19554b91f"
    },
    {
      "author": null,
      "description": "Vice President JD Vance’s security detail had an Ohio river’s water level raised last weekend to accommodate a kayaking trip he and his family took for his 41st birthday. The U.S. Secret Service said it requested the increased waterflow for the Little Miami River to ensure motorized watercraft and emergency personnel “could operate safely” while protecting the Republican vice president, whose home is in Cincinnati. The Army Corps of Engineers action was first reported by The Guardian. Critics blasted Vance as entitled, pointing to the Trump administration's government-cutting efforts. His office said Vance was unaware the river had been raised.",
      "publishedAt": "2025-08-07T18:39:13Z",
      "title": "Vice President JD Vance's Ohio river kayaking trip sparks controversy",
      "url": "https://apnews.com/article/vp-vance-boating-ohio-river-level-raised-de4c773cfffd6cac0b82e96787fea951",
      "urlToImage": "https://dims.apnews.com/dims4/default/64939aa/2147483647/strip/true/crop/5712x3213+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2Fff%2Fd8d8e1007d48808f3077caf86462%2F5e901974422c42ad9478b78a0bc85dd3"
    },
    {
      "author": null,
      "description": "President Donald Trump on Thursday signed a memorandum requiring colleges to prove they do not consider race in admissions. This follows a Supreme Court ruling in 2023 against affirmative action. The court allowed colleges to consider how race has shaped students' lives if applicants shared that information in essays. Trump's Republican administration accuses colleges of using personal statements as proxies to consider race. The policy issued Thursday has similarities to parts of agreements with Brown and Columbia universities, which agreed to provide data on race as part of settlements to restore their federal funding. Conservatives argue colleges still consider race through proxy measures, but no clear pattern emerged in the racial makeup of last year's freshman class.",
      "publishedAt": "2025-08-07T16:47:37Z",
      "title": "Trump orders colleges to submit data on race in admissions",
      "url": "https://apnews.com/article/trump-race-college-admissions-executive-order-9fe070750d31879b24800032a013659d",
      "urlToImage": "https://dims.apnews.com/dims4/default/cd406ce/2147483647/strip/true/crop/5677x3193+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F44%2Fe71b644f7aabe90a26cca2cee393%2F01a928c47e02458f8adb04281c904d05"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}