{
  "articles": [
    {
      "author": "JON GAMBRELL",
      "description": "The Israel-Hamas war has devastated the Gaza Strip. Satellite photos offer some sense of the destruction in the territory. Some of the images have illustrated a likely buffer zone, wanted by Israel despite international objections. It would take some 60 square kilometers out of the enclave. In all, the strip of land along the Mediterranean Sea is about 360 square kilometers. Palestinians hope it will be part of a future state, along with the West Bank and east Jerusalem. Other images tell the story of how Palestinians’ lives have changed during the war. Gaza City has been decimated, with buildings destroyed and roads filled with rubble. The images have also helped relief agencies and experts make estimates regarding the extent of the damage.",
      "publishedAt": "2025-01-16T16:57:28Z",
      "title": "Before and after satellite photos of the Gaza Strip",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-destruction-satellite-photos-90093bca75d28af6193c21b9d1b5eaed",
      "urlToImage": "https://dims.apnews.com/dims4/default/379a0b4/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F31%2F962274f84aa08303f97b14a618ed%2Ftrumphushmoneylive1.png"
    },
    {
      "author": "SAMY MAGDY, SAM MEDNICK",
      "description": "Mediator Qatar says the ceasefire between Hamas and Israel will go into effect Sunday at 8:30 a.m. local time. Families of hostages held in Gaza are bracing Saturday for news of loved ones, while Palestinians prepare to receive freed detainees and humanitarian groups hurry to set up a surge in aid. The overnight approval of the deal by Israel’s Cabinet, in a rare meeting during the Jewish Sabbath, has set off a flurry of activity and a fresh wave of emotions as relatives wonder if hostages will be returned alive or dead. The names of the first hostages to be freed are expected to be released later Saturday,",
      "publishedAt": "2025-01-18T07:54:14Z",
      "title": "Ceasefire between Israel and Hamas will go into effect Sunday morning, officials say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-01-18-2025-a30917cd2a7740ce2a3ceeb33179391a",
      "urlToImage": "https://dims.apnews.com/dims4/default/ccf0b9c/2147483647/strip/true/crop/7310x4112+0+381/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F5d%2Fdb306607d99e807a5ec1df398235%2Fd8c2b9317fe64b5f81e8224c73bd4f99"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "The Gaza ceasefire and hostage release agreement is expected to take effect as soon as Sunday. But the most significant diplomatic breakthrough in over a year of brutal war between Israel and Hamas is rife with risks, and seems to raise more questions than it answers. The deal presented Friday to the Israeli Cabinet after months of negotiations mediated by the United States, Egypt and Qatar appears ridden with diplomatic ambiguity. It leaves the issues that most inflame tensions between Israel and Hamas up for further negotiation. That is stirring fears that, failing a second agreement, the war could resume within weeks.",
      "publishedAt": "2025-01-17T20:45:50Z",
      "title": "How the deal to pause the Israel-Hamas war could unfold",
      "url": "https://apnews.com/article/israel-hamas-ceasefire-war-gaza-0cdf43eb80d659ba3826b5dce7e7e6b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/c27ed15/2147483647/strip/true/crop/2084x1172+0+108/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2Fb6%2Ff0beb1a59ade6d9bb13c6c62815b%2F32f9d31bfa444cbca0354cc24f4c5ccf"
    },
    {
      "author": "DANICA KIRKA",
      "description": "As one of the oldest hostages taken by Hamas, Oded Lifshitz would be among the first to be released under a ceasefire deal. But after 469 days of captivity in Gaza, his daughter can only hope he survived. Sharone Lifschitz is well aware that the odds are against her 84-year-old father. The London-based artist spoke Friday to The Associated Press. About 100 hostages remain unaccounted for in Gaza, including 62 who are believed to be alive. Family and friends are still waiting to learn who survived and about their conditions. The ceasefire deal is expected to begin Sunday.",
      "publishedAt": "2025-01-17T21:27:43Z",
      "title": "Daughter of one of the oldest Israeli hostages hopes for answers in ceasefire deal",
      "url": "https://apnews.com/article/britain-israel-hostage-daughter-ceasefire-65947f8f2747eba05e3be029c7d64562",
      "urlToImage": "https://dims.apnews.com/dims4/default/08cad12/2147483647/strip/true/crop/6309x3549+0+329/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F49%2F9fcd587ae891aa26d43d961cd448%2F7621ba50b01a4bc3a8ae437e5ff87df2"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "TikTok arrived in the U.S. almost 6 1/2 years ago. The possibility the U.S. would outlaw the video-sharing app has kept influencers and users in anxious limbo for more than four of the years since then. Now, the moment its fans dreaded is here, but uncertainty over TikTok’s future lingers. On Friday, the Supreme Court upheld a federal law that bans the social media platform starting Sunday unless its China-based parent company sells to an approved buyer. An official says the Biden administration plans to leave the law’s implementation to President-elect Donald Trump, who takes office Monday. During its short life, TikTok has been both a global cultural phenomenon and the subject of political wrangling.",
      "publishedAt": "2025-01-18T05:07:43Z",
      "title": "The rise - and potential fall - of TikTok in the US",
      "url": "https://apnews.com/article/tiktok-ban-trump-supreme-court-36c3c3b42f743a35c69e1c74341f1f30",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae6eb1d/2147483647/strip/true/crop/3000x1688+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F83%2F4f60ee36f017f9afad99ea82ca35%2F1a89d699dc0448b4a1d47a79dbbe7f1e"
    },
    {
      "author": "TAMMY WEBBER, DORANY PINEDA",
      "description": "Over 1,100 California inmates have worked around the clock to help fight Los Angeles-area fires that have killed at least 25 people and destroyed thousands of homes. One 42-year-old man serving a 4-year sentence for a drunken driving incident that injured someone said firefighting helps him “right the wrongs that I did.” Inmates describe carrying heavy gear while hiking for hours in steep, rugged terrain to cut containment lines to keep flames from spreading. Many inmates early less than $30 a day and advocates say they deserve more for risking their lives. A bill introduced this week in the California Assembly would pay them the same as the lowest-paid non-incarcerated firefighter on the frontlines.",
      "publishedAt": "2025-01-18T14:30:07Z",
      "title": "Los Angeles wildfires: Inmates fight fires for less than $30 a day",
      "url": "https://apnews.com/article/california-los-angeles-inmate-firefighters-wildfires-49651540b1631a80ac54efd001ff4a5c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dd94bbf/2147483647/strip/true/crop/5170x2908+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2Fab%2Fe7d6d61e8c698dc913b3c99054e0%2Ff0cb02fe427b4024bd40edba3ebfe8e5"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "President-elect Donald Trump has pledged to broker a peace deal in Ukraine, but as he prepares to take office, peace seems as elusive as ever. Moscow and Kyiv are seeking battlefield gains to strengthen their negotiating positions ahead of any prospective talks to end the 3-year-old war. Their tough negotiating postures leave little room for compromise. Russian troops are slowly but steadily advancing through Ukrainian defenses in the east and south, seeking to establish full control of the four regions that Moscow illegally annexed early in the war but doesn't completely control. Ukraine, in turn, has tried to secure and extend its incursion in Russia’s Kursk region.",
      "publishedAt": "2025-01-18T04:59:43Z",
      "title": "Trump vowed to end the war in Ukraine quickly but Moscow and Kyiv are digging in before any talks",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-trump-zelenskyy-39621aa2d0fd6a92ef097e311919538f",
      "urlToImage": "https://dims.apnews.com/dims4/default/145e08c/2147483647/strip/true/crop/2332x1312+0+159/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F82%2F1d6d939a7faac2b74c6342ebb8f3%2F219a6537d9d84aa195e7bf81fcef0ebc"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "Donald Trump is returning to Washington to kick off days of pageantry to herald his second inauguration as president. Trump will leave his Florida home Saturday and fly to the nation's capital. He will attend an evening reception and fireworks show at Trump National Golf Club in Sterling, Virginia. On Sunday, Trump is scheduled to participate in a wreath-laying ceremony at Arlington National Cemetery before heading to a rally at Capital One Arena in Washington. On Monday, he will be sworn in inside the U.S. Capitol because of the cold weather.",
      "publishedAt": "2025-01-18T05:04:58Z",
      "title": "Trump to arrive in Washington for inaugural celebrations marking his return to power",
      "url": "https://apnews.com/article/trump-inauguration-return-to-washington-1389014f70bd04793a8dbc83048bba07",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d6041b/2147483647/strip/true/crop/7527x4234+0+392/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fb9%2F37cba23d34c60bbb29e4e8fa1756%2Ff74391e06a2549a7b831984b4bcd67c2"
    },
    {
      "author": "DARLENE SUPERVILLE, ADRIANA GOMEZ LICON",
      "description": "As Trump prepares to return to the White House, his family circle looks a little different than it did eight years ago. His youngest son, Barron, was in fifth grade when Trump's first administration began. He's now a college freshman. One of Trump's granddaughters is an aspiring social media influencer. Trump has tapped the fathers of his two sons-in-law for administration jobs. The president-elect has five children from his marriages to Ivana Trump, Marla Maples and current wife Melania Trump. He has 10 grandkids, and an 11th is on the way.",
      "publishedAt": "2025-01-18T12:27:06Z",
      "title": "Inside Trump's family circle as he returns to the White House",
      "url": "https://apnews.com/article/trump-family-then-now-white-house-add4a5054a88bd084392fbf92354977e",
      "urlToImage": "https://dims.apnews.com/dims4/default/4786d4f/2147483647/strip/true/crop/4687x2636+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F2f%2F1dfa0db87566a56e6833f0efe9e7%2F7ba0b64056a140d9bb0587f9cbfdb49b"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "It's unclear who'll take over at the Pentagon and the military services when the top leaders all step down Monday as President-elect Donald Trump is sworn into office. As of Friday, officials said they hadn't yet heard who'll become the acting defense secretary. Officials said the military chiefs of the Army, Navy and Air Force were getting ready to step in as acting service secretaries — a rare move. That's because no civilians had been named or, in some cases, had turned down the opportunity. The officials spoke on condition of anonymity to discuss internal deliberations. As is customary, all current political appointees will step down as of noon on Inauguration Day,",
      "publishedAt": "2025-01-18T12:54:21Z",
      "title": "It's not clear who will lead the Pentagon when Trump takes office",
      "url": "https://apnews.com/article/trump-defense-department-transition-secretaries-inauguration-bf535549800d166060f1c4399360d06f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8117255/2147483647/strip/true/crop/5132x2887+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F4e%2Fea6ca12c02e77af46b22838bef87%2Feb25c1eacc36494f93090d7e12e6ce2a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}