{
  "articles": [
    {
      "author": null,
      "description": "The Iranian state television says that Iran’s underground enrichment site at Fordo has been attacked again. The report, also carried by other Iranian media, offered no word on damage, nor who launched the assault on Monday. However, Israel has been conducted airstrikes throughout the day in Iran. The United States launched a major attack Sunday on three Iranian nuclear sites, including Fordo, which required the use of sophisticated bunker-buster bombs.",
      "publishedAt": "2025-06-23T08:39:17Z",
      "title": "Iran targets Israel with missiles and drones after US strikes",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-trump-bomber-news-06-23-2025-9e78510c88ccc5e262341f41550609c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/77ef267/2147483647/strip/true/crop/6611x3719+0+344/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F82%2F6a4ec8601ce8668bc131d8460f7b%2F2b5d3290d6454d06b22cc7d63d4a4688"
    },
    {
      "author": null,
      "description": "As President Donald Trump floats “regime change” in Tehran, previous U.S. attempts to remake the Middle East by force in recent decades can offer stark warnings about the possibility of a deepening involvement in the Iran-Israeli conflict. Trump posted over the weekend: “If the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change???” The White House insists Trump, who spent years railing against “forever wars,\" isn't doing an about-face and that Iranian citizens could revolt against its government. But that’s a delicate, perilous path that other U.S. administrations have been down before. And it’s a long way from Trump’s dismissal of “stupid, endless wars.\"",
      "publishedAt": "2025-06-23T19:05:09Z",
      "title": "Attempts to remake the MidEast offer Trump warnings amid Iran and US strikes",
      "url": "https://apnews.com/article/iran-regime-change-us-intervention-middle-east-de06f9958c3367769e6cdafd080bdb8b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d28814d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fc3%2F0a37559187a1b3adec7617fd4aba%2F9de9ac237ac84c6eadf64301b36cd96e"
    },
    {
      "author": null,
      "description": "European nations worked Monday to keep alive diplomatic efforts to curb the Israel-Iran war as the two countries traded strikes following the United States’ weekend attack on Iran’s nuclear program. Calls for Tehran to enter talks with Washington appeared to fall on deaf ears. Tehran reached out to ally Russia for support instead. At a meeting of European Union foreign ministers in Brussels, diplomats expressed concern about the potential for Iranian retaliation to spark a wider war and global economic instability. U.K. Foreign Secretary David Lammy urged Iran to meet European officials and to open talks with the U.S. But Iran has rejected negotiations with Washington and a European official said no more talks with Iran are currently planned.",
      "publishedAt": "2025-06-23T16:28:01Z",
      "title": "Europe tries to revive diplomacy after US strikes on Iran nuclear sites",
      "url": "https://apnews.com/article/iran-nuclear-us-strikes-europe-diplomacy-israel-114c02f97c8e0e1f5622a33b39802667",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d29762/2147483647/strip/true/crop/8182x4602+0+426/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F63%2Fb951677b68538c19fd4ac905eaed%2F14a56d76735e4cf58de54f479f363591"
    },
    {
      "author": null,
      "description": "An intense and nearly historic weather pattern is cooking much of America in a dangerous heat dome this week with triple-digit heat that hasn’t been seen in some places in more than a decade. This heat wave is especially threatening because it’s hitting cities like Boston, New York and Philadelphia with near-record temperatures and doing so early in the summer when people haven’t gotten their bodies adapted to the broiling conditions. Coming originally from the Pacific, a dome of high pressure is parking over the Eastern United States with hot air from the Southwest that already made an uncomfortable rest stop in the Midwest.",
      "publishedAt": "2025-06-23T20:02:32Z",
      "title": "Heat dome brings blistering temperatures across much of the East Coast",
      "url": "https://apnews.com/article/heat-dome-explained-forecast-nyc-9ad7ac6422e8d105e2bb302180620d9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/168a7a5/2147483647/strip/true/crop/7230x4067+0+377/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F81%2F780a295efc9109401c3bcf8ef44d%2F7803a9bf941e4669b221755449c4e930"
    },
    {
      "author": null,
      "description": "A search continues for two people still missing after six others were killed when a boat capsized on Lake Tahoe in California during a powerful weekend thunderstorm that whipped up high waves. The Coast Guard says swells of more than 8 feet were recorded around the time the 27-foot gold Chris-Craft vessel flipped over Saturday afternoon. Two people were rescued immediately and taken to a hospital in unknown condition. Six bodies were recovered later Saturday. Meteorologists say the intensity of the thunderstorm surprised even forecasters, who'd predicted some rain but nothing like the sudden squall that lashed the southern part of the lake.",
      "publishedAt": "2025-06-23T18:54:05Z",
      "title": "Search continues for 2 people still missing after 6 killed when boat capsized on Lake Tahoe",
      "url": "https://apnews.com/article/lake-tahoe-california-boat-capsize-75bf2d0fa4d3fa802cf2680b756575fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ead357/2147483647/strip/true/crop/810x456+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F6b%2F6c1bab584ae855e625f85779cba7%2F89fcd700fa404f45bdafa289567ba8e9"
    },
    {
      "author": null,
      "description": "A divided Supreme Court is allowing the Trump administration to restart swift removals of migrants to countries other than their homelands, lifting for now a court order requiring they get a chance to challenge the deportations. All three liberal justices dissented. The high court’s Monday action came after District Judge Brian Murphy in Boston found the administration had violated his order by sending eight people to South Sudan in May. The migrants had been convicted of serious crimes in the U.S. and immigration officials have said they were unable to return them quickly to their home countries. Authorities instead landed the plane at a U.S. naval base in Djibouti.",
      "publishedAt": "2025-06-23T20:45:10Z",
      "title": "Supreme Court lets Trump to swiftly deport migrants away from home countries",
      "url": "https://apnews.com/article/supreme-court-immigration-trump-south-sudan-c7ffbbcede3158a3352b2dbf4439780a",
      "urlToImage": "https://dims.apnews.com/dims4/default/56faea1/2147483647/strip/true/crop/4249x2390+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F87%2F02d0b09b71c8320f5eb052f8d862%2F0af4ef9921bb462084d0999875a37f5e"
    },
    {
      "author": null,
      "description": "A jury has watched nearly 20 minutes of recordings of marathon sex events that prosecutors and defense lawyers have both cited as important to the outcome of the sex trafficking trial of music mogul Sean “Diddy” Combs. The recordings shown to the jury Monday by prosecutors roughly doubled the time the jury has spent viewing the explicit footage of two of Combs' former girlfriends sexually involved with male sex workers while Combs filmed the encounters. Combs has pleaded not guilty to sex trafficking and racketeering conspiracy charges. Prosecutors expect to rest by Tuesday. After a defense presentation, closing arguments are expected to occur Thursday.",
      "publishedAt": "2025-06-23T17:29:40Z",
      "title": "Jury sees more sex videos as prosecutors wind down case against Sean 'Diddy' Combs",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-drugs-62083111db88dd2fee04ddc63dcabe0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d3a62e9/2147483647/strip/true/crop/2396x1348+0+125/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F2c%2Fab7c01fca4b716c9e1dfebac6abd%2F937ad5043233412b9f312a2b5541d372"
    },
    {
      "author": null,
      "description": "A new report finds that the number of abortions in the U.S. grew in 2024 as more women obtained pills through telehealth. The latest WeCount project for the Society of Family Planning finds that 1 in 4 abortions uses medications prescribed by a provider who does not see the patient in person. That is up from 1 in 20 in the months before the U.S. Supreme Court overturned Roe v. Wade in 2022. The number may explain why another recent study found that fewer women crossed state lines for abortion in 2024 than the year before.",
      "publishedAt": "2025-06-23T10:02:37Z",
      "title": "Abortion numbers rose in 2024 because of more telehealth prescriptions, report finds",
      "url": "https://apnews.com/article/abortion-data-wecount-pills-telehealth-anniversary-7d42e427bc1e26d2ea7b48b8f20a042e",
      "urlToImage": "https://dims.apnews.com/dims4/default/16a12f1/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F06%2F73291d06ac822ff712a752309d35%2F33c5ffe4ca7940c38f4ddcc6b0c2a4bc"
    },
    {
      "author": null,
      "description": "The price of oil rose and U.S. stock futures fell as global markets react to the U.S. strike against nuclear targets in Iran. The price of Brent crude oil, the international standard, rose 3.9% to $80 a barrel. U.S. crude rose 4.3% to $77 a barrel. Futures for the S&P 500 fell 0.5%. Treasury yields fell slightly. On Saturday, U.S. forces attacked three Iranian nuclear and military sites, further increasing the stakes in the war between Israel and Iran.",
      "publishedAt": "2025-06-22T22:09:05Z",
      "title": "Oil rises and US stock futures slide as markets react to US strike on Iran nuclear sites",
      "url": "https://apnews.com/article/stock-market-oil-iran-attack-2d05b0a9e52320e822b649b8e29d28aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c94d39/2147483647/strip/true/crop/7914x4452+0+414/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F90%2F2eecf142336eabf9d44737a36b3e%2F97ee0a90b79b440581a83c1113dd8e1f"
    },
    {
      "author": null,
      "description": "Mick Ralphs, the singer, songwriter, guitarist and founding member of the classic British rock bands Bad Company and Mott the Hoople, has died. A statement posted to the band’s official website Monday announced Ralphs’ death at age 81. Ralphs had a stroke days after his final performance with Bad Company in 2016, and had been bedridden ever since. Ralphs is set to become a member of the Rock & Roll Hall of Fame as a member of Bad Company in November. He wrote Bad Company's classic hit “Can't Get Enough” and co-wrote “Feel Like Makin' Love” with singer Paul Rodgers.",
      "publishedAt": "2025-06-23T21:50:51Z",
      "title": "Mick Ralphs, founding member of Bad Company and Mott the Hoople, dies at 81",
      "url": "https://apnews.com/article/mick-ralphs-bad-company-mott-hoople-ef15c40ac8543c705dbd6cc282749fbc",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff5aab5/2147483647/strip/true/crop/1992x1121+0+91/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F39%2Fff6436df389a4d99bf32dd6c267d%2F9600ff634d254735be81205c38d675cd"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}