{
  "articles": [
    {
      "author": "CHRIS MEGERIAN",
      "description": "Democrats are planning to fight President Donald Trump's efforts to pause federal grants and loans. The court battle will likely begin with a lawsuit from the New York attorney general. The funding freeze is scheduled to take effect Tuesday as Trump’s administration begins an across-the-board ideological review. Administration officials said the pause is necessary to ensure that spending complies with the president's executive orders. The Republican administration's decision could affect trillions of dollars and cause widespread disruption in health care research, education programs and other initiatives. Even grants that have been awarded but not spent are supposed to be halted. It’s unclear how sweeping the pause will be.",
      "publishedAt": "2025-01-28T12:44:43Z",
      "title": "Legal battle looms as Trump orders a funding freeze during a review of federal loans and grants",
      "url": "https://apnews.com/article/donald-trump-pause-federal-grants-aid-f9948b9996c0ca971f0065fac85737ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ebb43e/2147483647/strip/true/crop/5252x2954+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F6a%2F09123f0f5e13d9d5111301ac6cb1%2Fd6d49725e258467bbecd4048aeb09883"
    },
    {
      "author": "MARK SHERMAN, WILL WEISSERT",
      "description": "The Trump administration says it is offering buyouts to all federal employees who opt to leave their jobs by next week — an unprecedented move to shrink the U.S. government at breakneck speed. A memo Tuesday from the Office of Personnel Management, the government’s human resources agency, says it will begin subjecting all federal employees to “enhanced standards of suitability and conduct” and ominously warns of future downsizing. The email sent to employees says those who leave their posts voluntarily will receive about eight months of salary, but they have to chose to do so by Feb 6.",
      "publishedAt": "2025-01-28T22:59:33Z",
      "title": "President Trump offers buyout to all federal workers with 8 months' pay",
      "url": "https://apnews.com/article/trump-buyouts-to-all-federal-employees-f67f5751a0fd5ad8471806a5a1067b5e",
      "urlToImage": "https://dims.apnews.com/dims4/default/74bf431/2147483647/strip/true/crop/4143x2330+0+216/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Ff2%2F726063b1450f93f425992987800a%2Fe1317de814eb4c6084f4fe8c0e933802"
    },
    {
      "author": "BILL BARROW",
      "description": "A sweeping White House order to freeze federal grants and allocations reflects a theory of presidential power that Donald Trump clearly endorsed during his 2024 campaign. The approach was further outlined in the Project 2025 governing treatise that candidate Trump furiously denied was a blueprint for his second administration. At face value, the Monday memo from Trump's budget office is meant to bring federal spending in line with Trump’s deluge of executive actions, notably on LGBTQ civil rights, energy and environmental policy. The memo could affect operations that go well beyond the policy areas singled out. Nonetheless, the potentially far-reaching action is not surprising given the details that were available throughout the campaign.",
      "publishedAt": "2025-01-28T17:39:25Z",
      "title": "How Trump and Project 2025 previewed federal grant freeze",
      "url": "https://apnews.com/article/donald-trump-project-2025-grants-freeze-6cb624cd3ef92805a5600fe5622733f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/a0e3373/2147483647/strip/true/crop/8152x4586+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Feb%2F97167fed0d4db95ca1a87a8e5168%2F13693089dd8843e6a8daa53fa37e7f03"
    },
    {
      "author": "KATE PAYNE",
      "description": "Florida lawmakers have passed a sweeping immigration bill, setting aside half a billion dollars in public funds to help carry out President Donald Trump’s crackdown on people in the country illegally. In a state where roughly one in every five residents is an immigrant, the legislation requires every level of government — as well as government contractors — to cooperate with federal immigration enforcement “to the fullest extent possible.” The passage of the bill sets up a showdown between Republican Gov. Ron DeSantis and the state’s legislative leaders, who have sparred over whose proposals would better carry out Trump’s immigration crackdown. DeSantis has called the bill “weak.”",
      "publishedAt": "2025-01-29T03:23:18Z",
      "title": "Florida lawmakers pass sweeping immigration bill to help with Trump crackdown",
      "url": "https://apnews.com/article/florida-immigration-bill-trump-crackdown-desantis-98ba7a205e71d308087f9861047fd7dd",
      "urlToImage": "https://dims.apnews.com/dims4/default/e57fe8f/2147483647/strip/true/crop/4899x2756+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F2a%2F6527881fe9b6e139bc62a8766141%2Fd845fa42d5824d04816d630d1d8e65fe"
    },
    {
      "author": "AMANDA SEITZ, LISA MASCARO",
      "description": "Calling Robert F. Kennedy Jr. a “predator” who is addicted to power, Caroline Kennedy urged the U.S. Senate in a letter on Tuesday to reject the nomination of her cousin to be the nation’s health secretary. Ms. Kennedy, who previously served as a U.S. ambassador and is the daughter of former President John F. Kennedy, etched a damning sketch of her cousin. The letter is the latest condemnation Robert F. Kennedy Jr. has received from members of his prominent Democratic family, including several who denounced his bid for the presidency last year.",
      "publishedAt": "2025-01-28T20:00:13Z",
      "title": "Caroline Kennedy warns senators about cousin RFK Jr.",
      "url": "https://apnews.com/article/caroline-robert-kennedy-trump-health-secretary-f01f58305eac53560e31c51aaee5f171",
      "urlToImage": "https://dims.apnews.com/dims4/default/198862f/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F14%2Fd28909a60a39d1c7632ca36f5f0d%2Fec63c89286d64bbe8835c259c5cb52e4"
    },
    {
      "author": "ABDEL KAREEM HANA, WAFAA SHURAFA, SAMY MAGDY",
      "description": "More than 375,000 Palestinians have made their way back to homes in northern Gaza after 15 months on the run because of war. The Abu Jarad family returned to Beit Lahiya Monday to find that the orange, olive and palm trees that once stood in front of their house were bulldozed away. The roses and jasmine flowers were also gone. The house itself was a hollowed-out shell. But it stood. At the sight of it, Ne’man Abu Jarad; his wife, Majida; and their six daughters dropped the bags they had been lugging since dawn, fell to their knees and prayed. After 477 days of hell — fleeing the length of the Gaza Strip, hiding from bombardment, scrounging for food and water – they were finally home.",
      "publishedAt": "2025-01-28T22:14:44Z",
      "title": "This is what one family in Gaza returned home to after 15 months of war",
      "url": "https://apnews.com/article/gaza-palestinians-return-home-ceasefire-2495de01d4581b92789171cad34b7dce",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a8f7fa/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F51%2Fcf454c01443a9be35c34f513196b%2F322fd2e0c4634dbbb8b34a0e73651a72"
    },
    {
      "author": "ELLEN KNICKMEYER, SAMYA KULLAB, FARAI MUTSAKA, MATTHEW LEE",
      "description": "U.S.-funded aid programs worldwide have begun firing staff and preparing to shut down their operations as an unprecedented Trump administration freeze on foreign assistance brings their work to a sudden halt. Secretary of State Marco Rubio, who initially exempted only emergency food programs and military aid to Israel and Egypt from the aid pause, agreed Tuesday to at least temporarily keep spending money on humanitarian programs that provide life-saving medicine, medical services, food, shelter and subsistence assistance, according to a copy of a signed waiver obtained by The Associated Press. President Donald Trump ordered the funding pause last week.",
      "publishedAt": "2025-01-28T15:40:10Z",
      "title": "A US shutdown on foreign aid is hitting worldwide. Rubio adds more exemptions",
      "url": "https://apnews.com/article/trump-foreign-assistance-freeze-684ff394662986eb38e0c84d3e73350b",
      "urlToImage": "https://dims.apnews.com/dims4/default/6a6ec37/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2F9d%2F34f9adb0c79bcedd527f30260849%2Fc9c1e4f1efdf4bc1936bc6e4811af535"
    },
    {
      "author": "OMAR ALBAM, SALLY ABOU ALJOUD",
      "description": "Syria’s Civil Defense has uncovered over two dozen charred bodies in two basements in rural Damascus, adding to the growing tally of mass graves discovered since the ousting of Bashar Assad. The bodies, believed to include men, women and children, showed signs of gunshot wounds and burning. The civil defense said it has uncovered hundreds of unidentified body remains since Assad was overthrown in December, part of the ongoing search for thousands of Syrians who went missing during his rule. Members of Syria’s White Helmets, a volunteer civil defense group, exhumed the fragmented, weathered skeletal remains from the basement of two properties in the town of Sbeneh, southwest of the capital.",
      "publishedAt": "2025-01-28T20:20:17Z",
      "title": "The discovery of brutal mass graves in Syria reveals Assad's legacy of horror",
      "url": "https://apnews.com/article/syria-mass-graves-missing-assad-c60930806d5f221752b69e7302e149da",
      "urlToImage": "https://dims.apnews.com/dims4/default/67725cc/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F9d%2F25e08b99c467bb0df4be57780cab%2Fc23771702b364795b5d556075d20ba51"
    },
    {
      "author": "ZEKE MILLER, GEOFF MULVIHILL, HANNAH SCHOENBAUM",
      "description": "President Donald Trump has signed an executive order aimed at cutting federal support for gender transitions for people under age 19. Tuesday's order is the latest push by Trump to reverse policies set by the Biden administration to protect transgender people and their care. A day earlier, Trump directed the Pentagon to conduct a review that is likely to lead to them being barred from military service. And last week, he sought to define sex as only male or female. His efforts are already facing legal challenges and are likely to see more of them.",
      "publishedAt": "2025-01-28T22:14:58Z",
      "title": "Trump signs order aimed at curtailing gender transitions for people under 19",
      "url": "https://apnews.com/article/trump-transgender-transition-executive-order-301e4130233b411311978f66f455f1c4",
      "urlToImage": "https://dims.apnews.com/dims4/default/20d8972/2147483647/strip/true/crop/7830x4404+0+408/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2F1f%2F7c35684d4018c6d42adb801c7639%2F2e5ff6827e3244fd9f98d364eb807266"
    },
    {
      "author": "DAVE COLLINS",
      "description": "Homeland Security Secretary Kristi Noem joined federal agents in New York City to announce the arrests of immigrants wanted on criminal charges. The arrests included a man accused of kidnapping who was seen on a viral video entering a Colorado apartment with reputed gang members. Noem was the latest high-ranking official from President Donald Trump’s administration to tout the president’s ramped-up immigration enforcement in a city where arrests were being made. Border czar Tom Homan and acting Deputy Attorney General Emil Bove were in Chicago on Sunday as federal agents made arrests there.",
      "publishedAt": "2025-01-28T21:39:30Z",
      "title": "New Homeland Security secretary joins federal agents to tout immigrant arrests in NYC",
      "url": "https://apnews.com/article/immigration-arrests-new-york-trump-5abbbb293ca865e539e48e3b74d8db77",
      "urlToImage": "https://dims.apnews.com/dims4/default/3036e10/2147483647/strip/true/crop/5737x3227+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F1f%2Ffc722bbceb6c18403320c751570b%2F4f32e0915d364900abda93994863fc9e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}