{
  "articles": [
    {
      "author": "MICHELLE L. PRICE, JAMES POLLARD, MEG KINNARD and BILL BARROW",
      "description": "ROCK HILL, S.C. (AP) — Former President Donald Trump said Friday that he would “strongly support the availability of IVF\" and called on lawmakers in Alabama to preserve access to the treatment that has become a new flashpoint in the 2024 presidential election.",
      "publishedAt": "2024-02-23T19:45:55Z",
      "title": "Ahead of South Carolina primary, Trump says he strongly supports IVF after Alabama court ruling",
      "url": "https://apnews.com/8215336740a5963b57bbd970b47bb3a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72e5c7be2eb74e7eaf6e5a09c79a506a/1920.jpeg"
    },
    {
      "author": null,
      "description": "MONTGOMERY, Ala. (AP) — Lawmakers began scrambling for ways to protect Alabama in vitro fertilization services after multiple providers paused services in the wake of a state Supreme Court ruling that frozen embryos could be considered children under a state law.",
      "publishedAt": "2024-02-23T20:38:41Z",
      "title": "Facing backlash over IVF ruling, Alabama lawmakers look for a fix",
      "url": "https://apnews.com/aec76246aad81bc58cd9e51e422a4521",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a15c2ccc0244d0b9378caa97c513e13/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The longtime head of the National Rifle Association, Wayne LaPierre, misspent millions of dollars of the organization’s money, using the funds to pay for an extravagant lifestyle that included exotic getaways and trips on private planes and superyachts, a New York jury determined Friday.",
      "publishedAt": "2024-02-23T22:42:12Z",
      "title": "Former NRA chief Wayne LaPierre misspent gun rights group's money, owes more than $4M, jury finds",
      "url": "https://apnews.com/d4d9b950ee2cbd63380826eb2bf210e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/882a5f5d166c47259f94810b49920abc/2798.jpeg"
    },
    {
      "author": "KEN MILLER, PHILIP MARCELO and JAMIE STENGLE",
      "description": "OKLAHOMA CITY (AP) — A 16-year-old Oklahoma student who died the day after a fight in a high school bathroom was conscious and alert when telling police about the attack by three girls that occurred after the teen squirted them with water, according to police video released Friday.",
      "publishedAt": "2024-02-23T20:39:53Z",
      "title": "Video shows Oklahoma nonbinary teen after attack in school bathroom, the day before their death",
      "url": "https://apnews.com/669bdc63e49929dd40da44416d633fab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d045067de7094d8594948ef028aabf90/2880.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A private U.S. lunar lander tipped over at touchdown and ended up on its side near the moon’s south pole, hampering communications, company officials said Friday.",
      "publishedAt": "2024-02-23T16:37:34Z",
      "title": "Private US spacecraft is on its side on the moon with some antennas covered up, the company says",
      "url": "https://apnews.com/14dfdc76176f9f7a6a68a099c98bbbb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52c9dc2f09ee40f1ace106ad2fc4d82c/1920.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN and LORNE COOK",
      "description": "WASHINGTON (AP) — The United States and European Union on Friday heaped hundreds of new sanctions on Russia in connection with the second anniversary of its invasion of Ukraine and in retaliation for the death of noted Kremlin critic Alexei Navalny last week in an Arctic penal colony.",
      "publishedAt": "2024-02-23T10:48:23Z",
      "title": "US and EU pile new sanctions on Russia for the Ukraine war's 2nd anniversary and Navalny's death",
      "url": "https://apnews.com/28a5d7faabbcbc5fe3a0de3ec84fd87d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f84df6353a44387ad5ab1286f4b309f/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A long-awaited postwar plan by Israel's prime minister shows that his government seeks open-ended control over security and civilian affairs in the Gaza Strip. That was swiftly rejected Friday by Palestinian leaders and runs counter to Washington’s vision for the war-ravaged enclave.",
      "publishedAt": "2024-02-23T12:31:14Z",
      "title": "Netanyahu seeks open-ended control over security and civilian affairs in Gaza in new postwar plan",
      "url": "https://apnews.com/a5da6005cfa6734225af35ca460a75fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a0a4f93a6b046aeb7c6f4ada5566825/1920.jpeg"
    },
    {
      "author": "JAMES POLLARD",
      "description": "COLUMBIA, S.C. (AP) — A South Carolina man was found guilty Friday of killing a Black transgender woman in the nation’s first federal trial over an alleged hate crime based on gender identity.Jurors decided that Daqua Lameek Ritter fatally shot Dime Doe three times Aug.",
      "publishedAt": "2024-02-23T05:05:35Z",
      "title": "Man guilty in Black transgender woman's killing in 1st federal hate crime trial over gender identity",
      "url": "https://apnews.com/e8b625cc3fbc16eb2e22511d93411eb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/050b79cc07934004b16d9aa75fceaa32/1225.jpeg"
    },
    {
      "author": "TY O'NEIL, JOHN LOCHER and STEFANIE DAZIO",
      "description": "DEATH VALLEY NATIONAL PARK, Calif. (AP) — Kayakers have been paddling in one of the driest places on Earth after a series of record rainstorms battered California’s Death Valley and replenished Lake Manly.",
      "publishedAt": "2024-02-23T22:30:23Z",
      "title": "Kayakers paddle in Death Valley after rains replenish lake in one of Earth's driest spots",
      "url": "https://apnews.com/6d6a57c1e1236f10905efc4c2583b6ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62d17f297e1a4edc9772b495708027c6/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Donald Trump’s lawyers asked a New York judge Friday to suspend an $83.3 million defamation verdict against the former president, saying there was a “strong probability” that it would be reduced on appeal, if not eliminated.",
      "publishedAt": "2024-02-24T00:18:14Z",
      "title": "Trump's lawyers seek to suspend $83M defamation verdict, citing 'strong probability' it won't stand",
      "url": "https://apnews.com/01004f37766ef506dc9a3cea92e40478",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c06ab1a0dd4f4988bd9d81cb6dce20e1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}