{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — A prolonged communications blackout that severed telephone and internet connections compounded the misery Saturday in the besieged Gaza Strip, where a United Nations agency said hunger levels had spiraled in recent days.",
      "publishedAt": "2023-12-16T08:27:42Z",
      "title": "Communications blackout and spiraling hunger compound misery in Gaza Strip as war enters 11th week",
      "url": "https://apnews.com/7df1ec6f336d1cd357903d6b848a1a1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55d14edc443b48649291fb123bd75809/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES, LISA MASCARO and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — Prominent Latinos in Congress looked on quietly, at first, privately raising concerns with the Biden administration over the direction of border security talks.Democratic Sen.",
      "publishedAt": "2023-12-16T05:08:10Z",
      "title": "Latino Democrats in the Senate decry Biden's concessions in border and Ukraine talks",
      "url": "https://apnews.com/66531bcefb908d5440a52b54c543b006",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2ef3ef486ee4e0ba928d64038907ccf/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — Salsa music blares from the food court in a rundown Miami shopping center as Latinos head to a kiosk and an office showing signs for “Obamacare,” where they hope to renew their health coverage plans before the year ends.",
      "publishedAt": "2023-12-16T05:20:16Z",
      "title": "'Insurance godmothers' sign up Latinos for Obamacare in pro-Trump areas as he threatens to repeal it",
      "url": "https://apnews.com/89d5c33dc5761ab62dcdc680fca28446",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c2262606c3c41d186e0e5b358848374/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "LONDON (AP) — So much for women and children first.The phrase and its grave implications about who to save first in a catastrophe are rooted in the shipwrecks of centuries past and popularized by Hollywood's treatment of the Titanic disaster.",
      "publishedAt": "2023-12-16T05:03:34Z",
      "title": "Women and children first? Experts say that in most crises, it's more like everyone for themselves",
      "url": "https://apnews.com/24526080537db00a78945bfb2112f86d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bdfe2bf24384a1194909664ac18ea9f/1600.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — It could be a cold, grim New Year for thousands of migrant families living in New York City’s emergency shelter system. With winter setting in, they are being told they need to clear out, with no guarantee they’ll be given a bed elsewhere.",
      "publishedAt": "2023-12-16T06:00:52Z",
      "title": "No room at the inn? As holidays approach, migrants face eviction from New York City shelters",
      "url": "https://apnews.com/09cfae1acc86a8bc93ed34b955ffeaed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79340cefac87482dacfb03964c3dcf4a/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — It was the most painful inflation Americans had experienced since 1981, when “The Dukes of Hazzard” and “The Jeffersons” were topping the TV charts.",
      "publishedAt": "2023-12-16T05:01:23Z",
      "title": "Federal Reserve on cusp of what some thought impossible: Defeating inflation without steep recession",
      "url": "https://apnews.com/2e94988d686836926c0b7c617c5ff299",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c9b283bc0b54fc8bf0394e598c6b0ab/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Kuwait's ruling emir, the 86-year-old Sheikh Nawaf Al Ahmad Al Sabah, died Saturday after a three-year, low-key reign focused on trying to resolve the tiny, oil-rich nation's internal political disputes.",
      "publishedAt": "2023-12-16T09:57:06Z",
      "title": "Kuwait's ruling emir, Sheikh Nawaf Al Ahmad Al Sabah, dies at age 86",
      "url": "https://apnews.com/d4a0e02fd3e5aee29a220686c8df8654",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7e767fd7d7b43b5ae15851da4f8ccaa/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — A jury awarded $148 million in damages on Friday to two former Georgia election workers who sued Rudy Giuliani for defamation over lies he spread about them in 2020 that upended their lives with racist threats and harassment.",
      "publishedAt": "2023-12-15T15:22:18Z",
      "title": "Jury awards $148 million in damages to Georgia election workers over Rudy Giuliani’s 2020 vote lies",
      "url": "https://apnews.com/6f6446c4f5224f521db8ff7763fb12d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62dbcb3fec3e44a4a9eb692388fd5e08/1920.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russia and Ukraine each reported dozens of attempted drone attacks in the past day, just hours after Hungary vetoed 50 billion euros ($54.5 billion) of EU funding to Ukraine.",
      "publishedAt": "2023-12-16T09:04:01Z",
      "title": "Russia and Ukraine exchange drone attacks after EU funding stalled",
      "url": "https://apnews.com/ed8e99d1b730a72247b14f6b1791b093",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fafc2da78346412fad3d72cbeaf81436/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — A once-powerful cardinal and nine other people are to learn their fate Saturday when a Vatican tribunal hands down verdicts in a complicated financial trial that has aired the tiny city state's dirty laundry and tested its justice system.",
      "publishedAt": "2023-12-16T05:15:11Z",
      "title": "A cardinal and 9 others will learn their fate in a Vatican financial trial after 2 years of hearings",
      "url": "https://apnews.com/690128606e1e22534551b7f74b3d4814",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/412cea919ca54fb79646a1e640ffab79/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}