{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Thousands of Palestinian families fled Wednesday from the brunt of Israel’s expanding ground offensive into Gaza’s few remaining, overcrowded refuges, as the military launched heavy strikes across the center and south of the territory, killing dozens, Palestinian health officials said.",
      "publishedAt": "2023-12-27T11:23:57Z",
      "title": "On foot and by donkey cart, thousands flee widening Israeli assault in central Gaza",
      "url": "https://apnews.com/5fdc12a04cabd1c7d3cf8b52cf615992",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cad524e011f548a39469e01c9782bf4b/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. on Wednesday announced what officials say could be the final package of military aid to Ukraine unless Congress approves supplemental funding legislation that is stalled on Capitol Hill.",
      "publishedAt": "2023-12-27T22:45:03Z",
      "title": "US announces new weapons package for Ukraine, as funds dwindle and Congress is stalled on aid bill",
      "url": "https://apnews.com/4de07e760905039359042d42e9e17500",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2126662ffc34c72934a8b49d7202cd0/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — The Colorado Republican Party on Wednesday appealed that state's supreme court decision that found former President Donald Trump is ineligible for the presidency, the potential first step to a showdown at the nation's highest court over the meaning of a 155-year-old constitutional provision that bans from office those who “engaged in insurrection.”",
      "publishedAt": "2023-12-28T00:52:07Z",
      "title": "Trump ballot ban appealed to US Supreme Court by Colorado Republican Party",
      "url": "https://apnews.com/c51a09d231a5b29475505b0c402a2d89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1d5a7d98c3346338223696165d6f84b/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN and NICHOLAS RICCARDI",
      "description": "DENVER (AP) — Republican Rep. Lauren Boebert announced Wednesday she is switching congressional districts, avoiding a likely rematch against a Democrat who has far outraised her and following an embarrassing moment of groping and vaping that shook even loyal supporters.",
      "publishedAt": "2023-12-28T01:36:36Z",
      "title": "Boebert switches congressional districts, avoiding a Democratic opponent who has far outraised her",
      "url": "https://apnews.com/7eeaac591178e202786fa4891620fb2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92ac75fa7eb640e3a1b57ba2a54cc345/3000.jpeg"
    },
    {
      "author": "MARIA VERZA and EDGAR H. CLEMENTE",
      "description": "MEXICO CITY (AP) — Mexican officials moved to clear a migrant encampment on the banks of the Rio Grande river Wednesday as U.S. officials met with Mexico's president to press for measures to limit a surge of migrants reaching the U.S.",
      "publishedAt": "2023-12-27T05:01:05Z",
      "title": "US delegation meets with Mexico's government on migrant influx, as officials clear border tent camp",
      "url": "https://apnews.com/f39247c4848cb7cf1097fcbaa84edcbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5207da9f3fb4411ba9268045b3bfb7e/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "CHICAGO (AP) — The mayors of Chicago, New York City and Denver renewed pleas Wednesday for more federal help and coordination with Texas over the growing number of asylum-seekers arriving in their cities by bus and plane.",
      "publishedAt": "2023-12-27T22:47:57Z",
      "title": "Democratic mayors renew pleas for federal help and coordination with Texas over migrant crisis",
      "url": "https://apnews.com/19dc11f6aca43cd4829e8abae55767e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80adcf0fd9cd4de889eab93c2bd897fb/3000.jpeg"
    },
    {
      "author": null,
      "description": "DELANO, Calif. (AP) — “That '70s Show\" actor Danny Masterson has been sent to a California state prison to serve his sentence for two rape convictions.",
      "publishedAt": "2023-12-27T22:29:30Z",
      "title": "Danny Masterson sent to state prison to serve sentence for rape convictions, mug shot released",
      "url": "https://apnews.com/fd8f700ccadd136757e6ccdf2a45f905",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b35fae26d22042c7afdbd7aa73b9a061/3000.jpeg"
    },
    {
      "author": "FRAZIER MOORE and ANDREW DALTON",
      "description": "Tom Smothers, half of the Smothers Brothers and the co-host of one of the most socially conscious and groundbreaking television shows in the history of the medium, has died at 86.",
      "publishedAt": "2023-12-27T17:16:06Z",
      "title": "Comedian Tom Smothers, one-half of the Smothers Brothers, dies at 86",
      "url": "https://apnews.com/3e1727faf1b6469da7b2cfc7b2874c56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4df3379bb4994f899af777ec4b9e9bcb/1500.jpeg"
    },
    {
      "author": "GENE JOHNSON, JENNIFER SINCO KELLEHER, MARK THIESSEN and LINDSEY WASSON",
      "description": "LAHAINA, Hawaii (AP) — Sharlene Rabang and her calico cat fled the wildfire that destroyed her town on Maui and arrived at a family home on another Hawaii island after a 24-hour odyssey that included sleeping in a car.",
      "publishedAt": "2023-12-27T06:06:10Z",
      "title": "She died weeks after fleeing the Maui wildfire. Her family fought to have her listed as a victim.",
      "url": "https://apnews.com/7c846f4d8e6a80e5c629d33347dc50e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d1181c0966344e19ef278a4cb19867a/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO and DAVID BAUDER",
      "description": "NEW YORK (AP) — The New York Times is striking back against the threat that artificial intelligence poses to the news industry, filing a federal lawsuit Wednesday against OpenAI and Microsoft seeking to end the practice of using its stories to train chatbots.",
      "publishedAt": "2023-12-27T14:55:00Z",
      "title": "The New York Times sues OpenAI and Microsoft for using its stories to train chatbots",
      "url": "https://apnews.com/6ea53a8ad3efa06ee4643b697df0ba57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa883fd41f874b0aa83d70e38fe122c0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}