{
  "articles": [
    {
      "author": "ZEKE MILLER, SEUNG MIN KIM and WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden on Wednesday delivered a solemn call to voters to defend the country's democracy as he laid out in an Oval Office address his decision to drop his bid for reelection and throw his support behind Vice President Kamala Harris.",
      "publishedAt": "2024-07-24T22:35:53Z",
      "title": "Biden delivers solemn call to defend democracy as he lays out his reasons for quitting race",
      "url": "https://apnews.com/6fc0be75e1b9c9b15f5c07f42324c81b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46f4c8940a034946b1de90b10da043b4/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Israeli Prime Minister Benjamin Netanyahu is set to make a long-awaited White House visit Thursday to meet with President Joe Biden and likely Democratic nominee Vice President Kamala Harris at an important moment for all three politicians.",
      "publishedAt": "2024-07-25T04:06:08Z",
      "title": "Netanyahu will meet with Biden and Harris at a crucial moment for the US and Israel",
      "url": "https://apnews.com/41c4e0685e88fd75e9aa8e0d0d859b07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86f0b1b5c0504d71a4b5d4d85c7d0a5a/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Officials from Egypt, Israel, the United States and Qatar were expected to meet Thursday in Doha with the aim of resuming talks for a proposed three-phase cease-fire to end the war between Israel and Hamas and free the remaining hostages.",
      "publishedAt": "2024-07-25T09:16:41Z",
      "title": "Israel-Hamas war latest: Cease-fire talks face delays after Netanyahu's fiery speech to Congress",
      "url": "https://apnews.com/224c797388c5f3bcb47a8896784b9c2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0fa9bf2bf824214a6eacc18e40ae761/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN and HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — The former prisoners of war still puzzle over the strange events leading up to the night now seared into their memories, when an explosion ripped through the Russian-controlled Olenivka prison barracks and killed so many comrades two years ago.",
      "publishedAt": "2024-07-25T07:22:06Z",
      "title": "An explosion killed over 50 Ukrainian POWs in 2022. Survivors and an internal UN report blame Russia",
      "url": "https://apnews.com/15561a6d5cafc5b61a1f2643009c2a2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e2c6c0a17e945728278e540309d30b9/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "HOUSTON (AP) — Vice President Kamala Harris is slated to continue her days-old presidential push by speaking Thursday to the American Federation of Teachers, the first labor union to formally endorse her candidacy.",
      "publishedAt": "2024-07-25T04:19:17Z",
      "title": "Harris plans to continue to build presidential momentum in speech to teachers union",
      "url": "https://apnews.com/6d3aab384f62d9cc5bfa702539f614c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43e27ce43ffd486489f0baf024eceef2/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and ADRIANA GOMEZ LICON",
      "description": "CHARLOTTE, N.C. (AP) — Donald Trump unleashed a barrage of attack lines Wednesday against his likely new opponent, Vice President Kamala Harris, whom he called his “new victim to defeat” and accused of deceiving the public about President Joe Biden 's ability to run for a second term.",
      "publishedAt": "2024-07-24T04:28:16Z",
      "title": "Trump turns his full focus on Harris at first rally since Biden's exit from 2024 race",
      "url": "https://apnews.com/7c7e6e405fecc8927a63763c76f2db1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48447599f81b4e74bf4342241172c03e/3000.jpeg"
    },
    {
      "author": null,
      "description": "TAIPEI, Taiwan (AP) — A strong typhoon was expected to make landfall in China on Thursday after sweeping across Taiwan, where it caused landslides and flooding in low-lying areas and left three dead.",
      "publishedAt": "2024-07-25T04:26:50Z",
      "title": "Typhoon Gaemi heads for China after leaving 25 dead in Taiwan and the Philippines",
      "url": "https://apnews.com/5edd13684628eed4f596b5e1167edda4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e125f038b7a44e78d09b9f4af1935a4/1920.jpeg"
    },
    {
      "author": "JIM MUSTIAN and JOSHUA GOODMAN",
      "description": "MIAMI (AP) — In a WhatsApp chat that quickly devolved into depravity, a group of U.S. Drug Enforcement Administration agents boasted about their “world debauchery tour” of “boozing and whoring” on the government’s dime.",
      "publishedAt": "2024-07-25T04:54:04Z",
      "title": "Secret DEA files show agents joked about rape in WhatsApp chat. Then one of them was accused of it.",
      "url": "https://apnews.com/649db430c4953a083a7af33ec34b9781",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1648d06468c94b56a44eb49199f4e830/1330.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — Paris has long been a city of dreamers: Just look at the Eiffel Tower, for decades the world's loftiest structure. Audacity also underpins the French capital's plans for its first Olympic Games in a century, which open Friday with an opening ceremony for the ages.",
      "publishedAt": "2024-07-25T07:14:07Z",
      "title": "With big goals and gambles, Paris aims to reset the Olympics with audacious Games and a wow opening",
      "url": "https://apnews.com/f64992c91be8dc2095ef21863af6e7f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62f57866f1fa422d8a6e58595a9764a2/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Global shares retreated on Thursday, with Tokyo's benchmark losing more than 1,300 points at one point and closing down more than 3%, as pessimism set in over a nose-dive on Wall Street.",
      "publishedAt": "2024-07-25T08:50:35Z",
      "title": "Stock market today: Global shares tumble after a wipeout on Wall Street as Big Tech retreats",
      "url": "https://apnews.com/650649090272b04cda2a9ea6981d788d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61f556a3169d4546abfb8ba70ea34ac3/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}