{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and DAVID RISING",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Hamas was preparing to release 14 Israeli hostages Saturday for 42 Palestinian prisoners held by Israel, according to Egyptian officials, in an exchange that comes on the second day of a cease-fire that has allowed critical humanitarian aid into the Gaza Strip and given civilians their first respite after seven weeks of war.",
      "publishedAt": "2023-11-25T07:24:36Z",
      "title": "Hamas to release 14 Israeli hostages for Israel freeing 42 Palestinians in second swap during truce",
      "url": "https://apnews.com/7d83895eb736c09fab3eada4c31524b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecea10c927c04b5eacc5653e50a5786b/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "BEITUNIA, West Bank (AP) — Over three dozen Palestinian prisoners returned home to a hero's welcome in the occupied West Bank on Friday following their release from Israeli prisons as part of a cease-fire deal between Israel and Hamas.",
      "publishedAt": "2023-11-24T21:43:28Z",
      "title": "Palestinian families rejoice over release of minors and women in wartime prisoner swap",
      "url": "https://apnews.com/92545883b1fef86fb9b34549b7deca58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b1b35ecd3214837a9e59437f2464667/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "Derek Chauvin, the former Minneapolis police officer convicted of murdering George Floyd, was stabbed by another inmate and seriously injured Friday at a federal prison in Arizona, a person familiar with the matter told The Associated Press.",
      "publishedAt": "2023-11-25T01:54:52Z",
      "title": "Ex-officer Derek Chauvin, convicted in George Floyd's killing, stabbed in prison, AP source says",
      "url": "https://apnews.com/f24cde6aa28877d034530c2dc40ef7ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadee3019ddf47ebae68c654d55f1e30/2540.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO and ALEXANDRA OLSON",
      "description": "NEW YORK (AP) — Shoppers venturing out to malls and stores on Black Friday found perks from champagne to virtual reality experiences and old-fashioned doorbusters, as retailers tried to entice customers who are resisting splurges and impulse buying this year.",
      "publishedAt": "2023-11-24T05:02:14Z",
      "title": "Retailers offer bigger Black Friday discounts to lure hesitant shoppers hunting for the best deals",
      "url": "https://apnews.com/fe9ab8137c76aa0df2e5b0a7cc3ecda4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9cedaf6e78d4b44850206d1f2502137/1920.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russia launched Saturday morning its most intense drone attack on Ukraine since the beginning of its full-scale invasion in 2022, targeting the Ukrainian capital, military officials said.",
      "publishedAt": "2023-11-25T08:40:10Z",
      "title": "Russia launches largest drone attack on Ukraine since start of invasion, says Ukrainian military",
      "url": "https://apnews.com/ad3eef50f980a4df023fad78d7bc197d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8d9aa78575642a6852693baf5e122a0/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A container ship owned by an Israeli billionaire came under attack by a suspected Iranian drone in the Indian Ocean as Israel wages war on Hamas in the Gaza Strip, an American defense official said Saturday.",
      "publishedAt": "2023-11-25T08:08:40Z",
      "title": "An Israeli-owned ship was targeted in suspected Iranian attack in Indian Ocean, US official tells AP",
      "url": "https://apnews.com/39929cae42a191b2f242896a053123a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4930fac4a62f472fb63db99b68eb7526/2000.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — Gaza has always been a small, crowded space with hardly any exits. Now the world for Palestinians there has shrunk to the size of whatever refuge they can find: a jammed shelter, a car, the walls of a shared apartment, or floors and benches in hospital corridors.",
      "publishedAt": "2023-11-24T13:01:59Z",
      "title": "Gaza shrinks for Palestinians seeking refuge. 4 stories offer a glimpse into a diminished world",
      "url": "https://apnews.com/702f447ff7e52b03476555ec2513008b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f463660cc914657876bdcc857f94fe7/1600.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Ofri Bibas Levy has been haunted by nightmares since Oct. 7, when her brother, sister-in-law and their two young children were snatched by Hamas militants from their homes and dragged into the Gaza Strip.",
      "publishedAt": "2023-11-24T13:32:53Z",
      "title": "Families of hostages not slated for release from Gaza during current truce face enduring nightmare",
      "url": "https://apnews.com/6395a6113301e677bcac713f8db914b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecea10c927c04b5eacc5653e50a5786b/1920.jpeg"
    },
    {
      "author": "DAVID R. MARTIN and MICHAEL CASEY",
      "description": "ELMSFORD, N.Y. (AP) — When Sean Rafferty got his start in the grocery business, anything that wasn't sold got tossed out.But on a recent day, Rafferty, the store manager for ShopRite of Elmsford-Greenburgh in New York, was preparing boxes of bread, donuts, fresh produce and dairy products to be picked up by a food bank.",
      "publishedAt": "2023-11-25T05:08:52Z",
      "title": "Tackling climate change and alleviating hunger: States recycle and donate food headed to landfills",
      "url": "https://apnews.com/886b14d62a6b1d2961c94815630d4376",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b32d68e509a4640b3a827e518142365/3000.jpeg"
    },
    {
      "author": "JONATHAN MATTISE and MARIA SHERMAN",
      "description": "NASHVILLE, Tenn. (AP) — Daryl Hall has sued his longtime music partner John Oates, arguing that his plan to sell off his share of a joint venture would violate the terms of a business agreement the Hall &amp; Oates duo had forged.",
      "publishedAt": "2023-11-24T20:22:19Z",
      "title": "Daryl Hall is suing John Oates over plan to sell stake in joint venture. A judge has paused the sale",
      "url": "https://apnews.com/42fb0a9ec7252414d4d1b2a592b021d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84fb4234fe7741eaa49a48260c95c273/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}