{
  "articles": [
    {
      "author": "SAMY MAGDY and YOUSEF MURAD",
      "description": "DERNA, Libya (AP) — The city of Derna has buried thousands of people in mass graves, Libyan officials said Thursday, as search teams scoured ruins left by devastating floods and the city’s mayor said that the death toll could triple.",
      "publishedAt": "2023-09-14T08:07:24Z",
      "title": "Libyan city buries thousands in mass graves after flood, while mayor says death toll could triple",
      "url": "https://apnews.com/21b1a195d261a642e12dac13f0d19431",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94790f0fb3f14bfd92831c8066bd41fb/1920.jpeg"
    },
    {
      "author": "MICHAEL CASEY and KATHY McCORMACK",
      "description": "LEOMINSTER, Mass. (AP) — Hurricane Lee looks poised to wallop New England later this week even as the region still deals with the impact of days of wild weather that produced torrential rain, flooding, sinkholes and a likely tornado.",
      "publishedAt": "2023-09-14T04:21:49Z",
      "title": "Torrential rains, flash floods and a likely tornado hit New England. Hurricane Lee is up next",
      "url": "https://apnews.com/3d1a261d6b46e6fd30bc57b44794acbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3be770da2b74874b496999a97787805/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — On Capitol Hill, House Republicans were all-in Wednesday on House Speaker Kevin McCarthy's announcement of an impeachment inquiry into President Joe Biden.",
      "publishedAt": "2023-09-13T22:19:55Z",
      "title": "Biden White House strategy for impeachment inquiry: Dismiss. Compartmentalize. Scold. Fundraise.",
      "url": "https://apnews.com/269f3791a2cf5535e860ac08ba5a5807",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9554698f6cc24a4eae3225d1a2475046/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — Efforts by the Biden administration to limit pollution from automobile tailpipes — a major source of planet-warming emissions — face a crucial test as legal challenges brought by Republican-led states head to a federal appeals court.",
      "publishedAt": "2023-09-14T04:03:49Z",
      "title": "Biden's rules on clean cars face a crucial test as Republican-led challenges go to an appeals court",
      "url": "https://apnews.com/fe6bdf52420f083194574d8e0eae6a0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33c73e5d4dd245338102282e48c1ffb6/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and DASHA LITVINOVA",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un was expected to tour a Russian plant that builds fighter jets and visit the country’s Pacific Fleet, but his exact whereabouts remained uncertain Thursday following a summit at which he expressed unconditional support for Moscow.",
      "publishedAt": "2023-09-14T07:30:09Z",
      "title": "No sign of Kim Jong Un on his Russian travels as Seoul expresses concern over meetings with Putin",
      "url": "https://apnews.com/20aedd047c7112eeff2b8c77c7aa5e55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b599fd9b39ea487e8230f15531d85139/1921.jpeg"
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — While the nation has been transfixed by the two-week manhunt for escaped prisoner Danelo Souza Cavalcante in Pennsylvania, another fugitive drama has been playing out in the nation's capital with comparatively minimal attention.",
      "publishedAt": "2023-09-14T04:05:34Z",
      "title": "As all eyes are fixated on Pennsylvania manhunt, a DC murder suspect is on the run and off the radar",
      "url": "https://apnews.com/7156b18c8405f903a18d2c892d3f7a5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ca32191ae084beeae1cbb02b7168af8/1920.jpeg"
    },
    {
      "author": "HOLLY RAMER",
      "description": "Three decades ago, as a University of North Carolina student, he covered a deadly shooting for the school newspaper. Last month, as a journalism professor at the same school, Ryan Thornburg kept his students safe during a lockdown — after another shooting.",
      "publishedAt": "2023-09-14T04:22:39Z",
      "title": "At the University of North Carolina, two shootings 30 years apart show how much has changed",
      "url": "https://apnews.com/a30a351be99b8326917c0652b64a0904",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88916734d2034008821ddb6bbf5cc5a8/3000.jpeg"
    },
    {
      "author": "SAM METZ and MOHAMED BOUKDIRE",
      "description": "AMIZMIZ, Morocco (AP) — Rachid Alachoun, a 40-year-old plumber, washes clothes on the roof of his home. Half of it remains standing while the other half can be found in piles of rocks visible from the roof.",
      "publishedAt": "2023-09-14T10:11:41Z",
      "title": "Displaced by earthquake from their mountain homes, Moroccan families brace for shelterless nights",
      "url": "https://apnews.com/70fd7a36feb7b1cc57f2d61801eb27a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f096bb03ba545d2a129b2e0b54e38f5/1920.jpeg"
    },
    {
      "author": "JAN M. OLSEN",
      "description": "COPENHAGEN, Denmark (AP) — The operator of a luxury cruise ship that ran aground in Greenland with 206 people on board said Thursday that the MV Ocean Explorer was “successfully” pulled free by a fisheries research vessel at high tide.",
      "publishedAt": "2023-09-14T07:48:20Z",
      "title": "Stranded luxury cruise ship MV Ocean Explorer has been pulled free at high tide in Greenland",
      "url": "https://apnews.com/c487b66a2cfc8f2adcd4893a63a82be6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c43848ba3c0445298218c3a51a623672/2048.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — Boston firefighter Daniel Ranahan had heard about colleagues getting cancer but he was stunned when doctors discovered a large tumor in his chest.He was only 30 and had been in the Boston Fire Department less than a decade.",
      "publishedAt": "2023-09-14T04:16:00Z",
      "title": "Firefighters fear the toxic chemicals in their gear could be contributing to rising cancer cases",
      "url": "https://apnews.com/868e4eb6af158e7a34fb229c2dd79ebf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3ceb43b16e841e8b49fdba294fe3d31/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}