{
  "articles": [
    {
      "author": "DAVID SHARP, MICHAEL HILL, MARK SCOLFORO and PATRICK WHITTLE",
      "description": "First responders launched high-water and helicopter rescues of people trapped in cars and homes in rural New York and Pennsylvania as heavy rain from the remnants of Debby slammed the Northeast with intense floods.",
      "publishedAt": "2024-08-09T05:04:14Z",
      "title": "Flooding from the remnants of Debby leads to high water rescues in New York, Pennsylvania",
      "url": "https://apnews.com/30ce7215d31b651f4fb575e9dde5d63e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f073224caf054c0d8714a2821cb79a49/1920.jpeg"
    },
    {
      "author": "MATTHEW BROWN and AMY BETH HANSON",
      "description": "BOZEMAN, Mont. (AP) — Former President Donald Trump headed to Montana for a Friday night rally in hopes of ousting the state's Democratic senator, but his plane first had to divert to an airport on the other side of the Rocky Mountains because of a mechanical issue, according to airport staff.",
      "publishedAt": "2024-08-09T04:05:24Z",
      "title": "Trump plane heading to Montana rally was diverted but landed safely nearby, airport staff says",
      "url": "https://apnews.com/b2030ef3b1249cafaeb21b755721920c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aedcf8758d0d4285b479ea66f9bac470/2818.jpeg"
    },
    {
      "author": "GABRIEL SANDOVAL, DARLENE SUPERVILLE and NICHOLAS RICCARDI",
      "description": "PHOENIX (AP) — Vice President Kamala Harris and her new running mate will hold a rally in Arizona on Friday as part of their tour of electoral battlegrounds, visiting a state where Harris passed over a prominent Democrat in favor of Minnesota Gov.",
      "publishedAt": "2024-08-09T04:06:04Z",
      "title": "The latest battleground stop for Harris and Walz is Arizona, where a VP runner-up could still matter",
      "url": "https://apnews.com/44001d0be6b5d4ecc911ad06684421c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cefbb8a198a43fc9383a1344267cad5/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE and GABRIELA SÁ PESSOA",
      "description": "VINHEDO, Brazil (AP) — A passenger plane crashed into a gated residential community in Brazil’s Sao Paulo state Friday, killing all 61 people aboard and leaving a smoldering wreck, officials and the airline said.",
      "publishedAt": "2024-08-09T17:15:53Z",
      "title": "Plane crashes in Brazil's Sao Paulo state, killing all 61 aboard, airline says",
      "url": "https://apnews.com/394427322513643f4eaf517e4ac4c85e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30990f91e43b4ed892a91aeea60990f6/984.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "PARIS (AP) — Algerian boxer Imane Khelif has won a gold medal Friday at the Paris Olympics, emerging a champion from a tumultuous run at the Games where she endured intense scrutiny in the ring and online abuse from around the world over misconceptions about her womanhood.",
      "publishedAt": "2024-08-09T10:17:49Z",
      "title": "Boxer Imane Khelif wins gold to cap an Olympics marked by scrutiny over her sex",
      "url": "https://apnews.com/a177d6795d27dbc02db1313de0266753",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/350bee53ffb142dfa1532e1885b258ac/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "PARIS (AP) — Breanna Stewart and the U.S. women's basketball team cruised to a familiar place — the Olympic gold medal game.Stewart led a balanced offense as the Americans beat Australia 85-64 on Friday in the semifinals to extend their Olympic winning streak to 60 consecutive games dating back to the 1992 Barcelona Games.",
      "publishedAt": "2024-08-09T17:08:36Z",
      "title": "Breanna Stewart, US women's basketball team advance to gold medal game at Paris Olympics",
      "url": "https://apnews.com/5d8cf605882a080da9fb0e1615539fd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2a1fc4ca7f94d739fc59f990544acf8/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Lebanon’s militant Hezbollah group launched one of its deepest strikes into Israel in mid-May, using an explosive drone that scored a direct hit on one of Israel’s most significant air force surveillance systems.",
      "publishedAt": "2024-08-09T16:08:59Z",
      "title": "The threat Israel didn't foresee: Hezbollah's growing drone power",
      "url": "https://apnews.com/e1c0fdc0c963d57c0580d593d824ed8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7cb88f7c1174550b310811d962e40ff/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Russia declared a “federal-level” emergency in the Kursk region following a large-scale incursion from Ukraine and sent reinforcements there on Friday, four days after hundreds of Ukrainian troops poured across the border in what appeared to be Kyiv’s biggest attack on Russian soil since the war began.",
      "publishedAt": "2024-08-09T10:49:48Z",
      "title": "Russia declares an emergency in Kursk, under attack by Ukraine. 14 die in a Russian strike on a mall",
      "url": "https://apnews.com/3eba46949e065fac9d846987a106e17a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c527ce54d43417280a69f4d642900ee/3000.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "FERGUSON, Mo. (AP) — Michael Brown once told his father the “world is going to know my name,” words Michael Brown Sr. still takes to heart.Friday marks 10 years since the 18-year-old was killed by a police officer in Ferguson, Missouri, turning the St.",
      "publishedAt": "2024-08-09T04:07:56Z",
      "title": "Michael Brown's death 10 years ago sparked change in Ferguson",
      "url": "https://apnews.com/88a3dd50044c89800f5bd0e300c27351",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8d416fe9bff4bf1a458f5100235eccc/3000.jpeg"
    },
    {
      "author": "PHILIPP-MORITZ JENNE and STEFANIE DAZIO",
      "description": "VIENNA (AP) — Austrian authorities on Friday announced a third arrest in connection with the foiled conspiracy to attack three now-canceled Taylor Swift concerts, even as disappointed fans charmed Vienna by trading friendship bracelets and singing the pop star’s songs in the streets.",
      "publishedAt": "2024-08-09T08:55:34Z",
      "title": "3rd person in custody over foiled plot targeting now-canceled Taylor Swift shows in Vienna",
      "url": "https://apnews.com/feff9108d0a14d9941c4bc416c0eb05f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a0085b75ae740abb08d158ee7519cac/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}