{
  "articles": [
    {
      "author": null,
      "description": "Ukrainian authorities say two people were killed and some 17 injured after Russian drones attacked the southern Ukrainian port city of Odesa. A drone hit a residential tower block in the city, causing damage to three floors and trapping residents, emergency services said. The two killed in the attack were a married couple, and three children were among the injured, Odesa's regional governor reported. According to Russia's Defense Ministry, over 40 Ukrainian drones were shot down over western Russia and occupied Crimea.",
      "publishedAt": "2025-06-28T10:37:23Z",
      "title": "A Russian drone strike on Odesa kills a married couple and injures 17 people, Ukraine says",
      "url": "https://apnews.com/article/russia-ukraine-war-odesa-600b482ec8ebc1ad75629cd4c0ea178b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4736efc/2147483647/strip/true/crop/8231x4630+0+429/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F3a%2F685a25523b513339c04ce8ec0c70%2F0749646ed69447049bf5c65e27c3572b"
    },
    {
      "author": null,
      "description": "Thousands of mourners gathered in Tehran for the funeral of top Iranian commanders and scientists killed in a 12-day war with Israel. The caskets of Revolutionary Guard chief Gen. Hossein Salami and missile program head Gen. Amir Ali Hajizadeh were paraded Saturday through the city. Israel targeted Iranian military leaders, scientists, and nuclear sites, claiming to have killed 30 commanders and 11 scientists. Iran fired over 550 missiles at Israel, most were intercepted. The conflict caused over 1,000 deaths, at least 417 civilians, according to the Washington-based Human Rights Activists group. Saturday marked the first public funerals since the ceasefire.",
      "publishedAt": "2025-06-28T05:20:26Z",
      "title": "Thousands mourn top Iranian military commanders and scientists killed in Israeli strikes",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-28-2025-f53ad5751d7427deab42111e1ca7751d",
      "urlToImage": "https://dims.apnews.com/dims4/default/0fe6230/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Faf%2Fe739b0e3d039974cbacbeb119b46%2F871d320fcd104e5ea95e7af9549f8c79"
    },
    {
      "author": null,
      "description": "Israeli strikes in Gaza have killed at least 34 people, according to health officials. The attacks, which began late Friday and continued into Saturday, hit shelters and residential areas across Gaza, worsening its humanitarian crisis. U.S. President Donald Trump has suggested a ceasefire deal could happen within a week. Talks remain uncertain, however, as Israel demands Hamas disarm while Hamas insists on ending the war in exchange for freeing hostages. Meanwhile, Palestinians face severe food shortages, as Israeli is only letting a trickle of aid into the strip.",
      "publishedAt": "2025-06-28T08:32:56Z",
      "title": "At least 34 people killed in Israeli strikes in Gaza as ceasefire prospects inch closer",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-06-28-2025-0baefcaa74fad04b81c1e5f2b9236c75",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff2ff45/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F89%2F6da784fc318c1b3f229d797bce37%2F65b36ce8892c4826868d7ed49e10af42"
    },
    {
      "author": null,
      "description": "The Justice Department has fired at least three prosecutors involved in U.S. Capitol riot criminal cases, according to two people familiar with the matter. It’s the latest move by the Trump administration targeting attorneys connected to the massive prosecution of the Jan. 6, 2021, attack. Those dismissed include two attorneys who worked as supervisors overseeing the Jan. 6 prosecutions in the U.S. attorney’s office in Washington as well as a line attorney who prosecuted cases stemming from the Capitol attack. That’s according to people who spoke on the condition of anonymity to discuss personnel matters. Justice Department spokespeople did not not immediately respond to a message seeking comment Friday evening.",
      "publishedAt": "2025-06-28T02:27:47Z",
      "title": "Justice Department fires 3 lawyers involved in Jan. 6 cases",
      "url": "https://apnews.com/article/jan-6-prosecutions-capitol-riot-trump-bondi-1107441a68cef171dfff4e680e438452",
      "urlToImage": "https://dims.apnews.com/dims4/default/623f1d3/2147483647/strip/true/crop/5076x2855+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F30%2Fdb31f06393be93deaa40f7467193%2F4b8e111561104bbd85cd54aa9f410507"
    },
    {
      "author": null,
      "description": "A divided Supreme Court has ruled that individual judges lack the authority to grant nationwide injunctions, but the decision leaves unclear the fate of President Donald Trump’s restrictions on birthright citizenship. The outcome Friday was a victory for Trump, who has complained about individual judges throwing up obstacles to his agenda. But a conservative majority left open the possibility that the birthright citizenship changes could remain blocked nationwide. The Republican president’s order would deny citizenship to U.S.-born children of people who are in the country illegally.",
      "publishedAt": "2025-06-27T14:18:32Z",
      "title": "Supreme Court leaves fate of Trump birthright citizenship order unclear",
      "url": "https://apnews.com/article/supreme-court-trump-birthright-citizenship-immigration-9da9e11d83f2fd3cbf95e6a733651daf",
      "urlToImage": "https://dims.apnews.com/dims4/default/a519aa0/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F38%2F37255488e051ca68d07e2d0543d4%2F925c93a5304048459f79a7ffbd470f68"
    },
    {
      "author": null,
      "description": "The Supreme Court has ruled that Maryland parents who have religious objections can pull their children from public school lessons using LGBTQ storybooks. The justices Friday reversed lower-court rulings in favor of the Montgomery County school system in suburban Washington. The high court ruled that the schools likely could not require elementary school children to sit through lessons involving the books if parents expressed religious objections to the material. The decision was not a final ruling in the case, but the justices strongly suggested that the parents will win in the end. The court ruled that policies like the one at issue in the case are subjected to the strictest level of review, nearly always dooming them.",
      "publishedAt": "2025-06-27T14:53:33Z",
      "title": "Supreme Court says Maryland parents can pull kids from LGBTQ book lessons",
      "url": "https://apnews.com/article/supreme-court-lgbtq-books-religion-maryland-schools-c0b0fb4b96531636fcb98b08aabc3cf9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b9e9ef/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2Fb4%2F28aba2883a2a7268895fa56644b4%2Fee48c15dd5604f6281a7266388de25da"
    },
    {
      "author": null,
      "description": "Senate Republicans appear to have President Donald Trump’s big bill back on track after a flurry of last-minute revisions. But there's still a long way to go. Trump himself gave Congress some breathing room as senators race to meet his Fourth of July deadline, saying that date is “not the end all.” With their majority control of Congress, Republicans are trying to push the package past unified Democratic opposition. To do so, they are working through a punch list of still-unsettled issues, including Medicaid health care cuts. Republicans are relying on steep reductions in programs to help pay for $3.8 trillion in tax breaks.",
      "publishedAt": "2025-06-27T18:11:34Z",
      "title": "Senate GOP put Trump's bill back on track to meet July 4 deadline",
      "url": "https://apnews.com/article/trump-big-beautiful-bill-tax-cuts-snap-medicaid-salt-2c195fe68e849beaa681e3f75c8ed5ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0e7353/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F59%2F52e49af34313631a8ae564a0c6a0%2F9606a411c1664453864dad779823302a"
    },
    {
      "author": null,
      "description": "Thousands of motorists have been stranded in West Virginia after a mudslide sent water and debris onto highway. The mudslide after heavy rains caused a 12-mile traffic backup along the West Virginia Turnpike. Traffic was not rerouted, and many motorists along the mountainous route had no choice but to remain in their vehicles for more than eight hours. People posted on social media that they had no information on why the standstill occurred, that they had nothing to drink in their vehicles or that their children needed to use the bathroom. One lane reopened Friday morning, but traffic remained stopped for hours.",
      "publishedAt": "2025-06-27T23:30:17Z",
      "title": "Mudslide causes 12-mile overnight backup along West Virginia highway",
      "url": "https://apnews.com/article/west-virginia-highway-shutdown-several-weather-624ebe4033b45d62761f3d55cf48c24e",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f4ee2e/2147483647/strip/true/crop/1786x1005+0+168/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fa1%2F1e7850dacbe4479eadfb40a17d9d%2Fcd673ec58d8e476180315595ec979e81"
    },
    {
      "author": null,
      "description": "Democratic efforts in the Senate to prevent President Donald Trump from further escalating with Iran have fallen short. Republicans were opposed to a resolution Friday marking Congress’ first attempt to reassert its war powers following U.S. strikes on Iranian nuclear sites. The resolution, authored by Sen. Tim Kaine of Virginia, aimed to affirm that Trump should seek authorization from Congress before launching more military action against Iran. Asked Friday if he would bomb Iranian nuclear sites again if he deemed necessary, Trump said, “Sure, without question.” Passage of the resolution was seen as a long shot with one Democrat — Sen. John Fetterman — already opposed.",
      "publishedAt": "2025-06-27T21:30:32Z",
      "title": "Republicans block Senate proposal to limit Trump's war powers",
      "url": "https://apnews.com/article/trump-war-powers-iran-democrats-senate-vote-6cc19772c4ec53a5a05c4a0c942350df",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c1160d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F33%2F7f555fa388bb1bf80d005897dc5c%2Fca4e2a2337814ece8110ee1405cac9e7"
    },
    {
      "author": null,
      "description": "Sudan’s military says it has agreed to a proposal from the United Nations for a weeklong ceasefire in El Fasher to facilitate U.N. aid efforts to the area. U.N. Secretary-General António Guterres called Sudanese military leader Gen. Abdel-Fattah Burhan and asked him for the humanitarian truce in El Fasher to allow aid delivery. El Fasher is the capital of North Darfur province. Burhan agreed to the proposal and stressed the importance of implementing relevant U.N. Security Council resolutions. But it’s unknown whether the paramilitary Rapid Support Forces would agree and comply with the ceasefire. No further details were revealed about the specifics of the ceasefire, including when it could go into effect.",
      "publishedAt": "2025-06-27T19:44:46Z",
      "title": "Sudan's military accepts UN ceasefire proposal to let aid in",
      "url": "https://apnews.com/article/sudan-war-un-aid-rsf-el-fasher-6ccfe84779a2a2ab8b634563e26b2099",
      "urlToImage": "https://dims.apnews.com/dims4/default/90d60d8/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2Fe4%2Fa811d6b2249ef2a6c90adc85f4f4%2F6a1f888ae1c7442f881380867e8f0c28"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}