{
  "articles": [
    {
      "author": "Zeke Miller, Aamer Madhani, Seung Min Kim",
      "description": "White House national security adviser Mike Waltz is set to depart the Trump administration. That's according to two people familiar with the matter, which marks the first major staff shakeup of President Donald Trump’s second term. Waltz came under searing scrutiny in March after revelations that he added journalist Jeffrey Goldberg to a private text chain on the encrypted messaging app Signal, which was used to discuss planning for a sensitive March 15 military operation against Houthi militants in Yemen. A far-right ally of the president, Laura Loomer, has also targeted Waltz, telling Trump in a recent Oval Office conversation that he needs to purge aides who she believes are insufficiently loyal to the “Make America Great Again” agenda.",
      "publishedAt": "2025-05-01T15:46:19Z",
      "title": "Mike Waltz out as Trump national security adviser in major shakeup",
      "url": "https://apnews.com/article/trump-waltz-national-security-signal-db2443f6fed98e4067edd57f26f23603",
      "urlToImage": "https://dims.apnews.com/dims4/default/633aaf7/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fbf%2F721c1002d3d37c53bc7be38ef408%2F88f658a8fc0c464ca20bcea30dcf7bbf"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "A federal judge has barred the Trump administration from deporting any Venezuelans from South Texas under an 18th-century wartime law. U.S. District Court Judge Fernando Rodriguez Jr. is the first judge to rule that the Alien Enemies Act cannot be used against people who the Republican administration claims are gang members invading the United States. In March, President Donald Trump issued a proclamation claiming that the Venezuelan gang Tren de Aragua was invading the U.S. He said he had special powers to deport immigrants, identified by his administration as gang members, without the usual court proceedings.",
      "publishedAt": "2025-05-01T16:13:54Z",
      "title": "Judge bars deportations of Venezuelans from South Texas under 18th-century wartime law",
      "url": "https://apnews.com/article/trump-deportations-alien-enemies-act-venezuelans-texas-e0dda59f64b1f5752fb92a91ff7878f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/688a0fc/2147483647/strip/true/crop/2755x1550+0+143/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F9f%2Fb11ad3ef282db1cc8abf34a3792f%2F91244921105a4fecacef9624bef495e9"
    },
    {
      "author": null,
      "description": "The Trump administration has asked the Supreme Court to strip temporary legal protections from 350,000 Venezuelans, potentially exposing them to being deported. The Justice Department asked the high court Thursday to put on hold a ruling from a federal judge in San Francisco that kept in place Temporary Protected Status that would have otherwise expired last month. A federal appeals court had earlier rejected the administration’s request. President Donald Trump’s administration has moved aggressively to withdraw various protections that have allowed immigrants to remain in the country, including ending TPS for a total of 600,000 Venezuelans and 500,000 Haitians.",
      "publishedAt": "2025-05-01T20:46:07Z",
      "title": "Trump administration asks Supreme Court to strip legal protections from 350,000 Venezuelan migrants",
      "url": "https://apnews.com/article/trump-venezuela-immigrants-deportation-protection-80f61585197eaff8b254c9b621976780",
      "urlToImage": "https://dims.apnews.com/dims4/default/41efec0/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fe9%2F6ef4d323016b07e4f56d91781143%2F78ad037c00ff44b5b6d53c1bb4674ef6"
    },
    {
      "author": "Lolita Baldor",
      "description": "Detailed Army plans for a potential military parade on President Donald Trump’s birthday in June call for more than 6,600 soldiers, at least 150 vehicles, 50 helicopters, seven bands and potentially a couple thousand civilians. The Associated Press obtained the planning documents, which are dated April 29 and 30. They represent the Army’s most recent blueprint for its long-planned 250th birthday festival on the National Mall and the newly added element — a large military parade that Trump has long wanted but is still being discussed. The slides don't include any price estimates. But it would likely cost tens of millions of dollars to put on an event of that size.",
      "publishedAt": "2025-05-01T23:14:55Z",
      "title": "Army plans for a potential parade on Trump's birthday call for 6,600 soldiers, AP learns",
      "url": "https://apnews.com/article/army-parade-trump-birthday-96bb9c8e9af1ef285c56fdc3d1ba4b35",
      "urlToImage": "https://dims.apnews.com/dims4/default/5f68a6a/2147483647/strip/true/crop/3699x2081+0+331/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F76%2Fdab48fd28fc77f58b81ad9b735bb%2F6a84377e82cb492d8a5fe7ad61480f76"
    },
    {
      "author": null,
      "description": "Israel’s air force struck near Syria’s presidential palace early Friday hours after warning Syrian authorities not to march toward villages inhabited by members of a minority sect in southern Syria. The strike came after days of clashes between pro-Syrian government gunmen and fighters who belong to the Druze minority sect near the capital, Damascus. The clashes left dozens of people dead or wounded. The Israeli army said in a statement that fighter jets struck adjacent to the area of the Palace of President Hussein al-Sharaa in Damascus. It gave no further details. Pro-government Syrian media outlets said the strike hit close to the People’s Palace on a hill overlooking the city.",
      "publishedAt": "2025-05-02T02:16:10Z",
      "title": "Israeli military strikes near Syria's presidential palace after warning over sectarian attacks",
      "url": "https://apnews.com/article/syria-israel-damascus-palace-druze-eca1ecf0b649964a7ef8052cf350c800",
      "urlToImage": "https://dims.apnews.com/dims4/default/9fa8a04/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F17%2F8282dccf79ff1a10583772750347%2F408486abe33e464c83a52e26c93ab592"
    },
    {
      "author": "Jon Gambrell",
      "description": "Oman has announced that planned negotiations between Iran and the United States this weekend over Tehran’s rapidly advancing nuclear program have been postponed. A message online from Omani Foreign Minister Badr al-Busaidi made the announcement in a post on the social platform X. Al-Busaidi did not elaborate. Iran and the U.S. both acknowledged the talks would not be happening. They were to be held on Saturday in Rome. A person familiar with the U.S. negotiators said the U.S. expected the talks to occur in the near future.",
      "publishedAt": "2025-05-01T14:15:32Z",
      "title": "Iran-US nuclear talks postponed",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-oman-8121e584d9e6c63c5f3cd8e4b1654f81",
      "urlToImage": "https://dims.apnews.com/dims4/default/10e612c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F6c%2F6b0926d74b7f3b46c797a3c00f77%2F2c0db1dcce4d4e049345e370ba1c2e53"
    },
    {
      "author": "The Associated Press",
      "description": "China's Commerce Ministry says Beijing is evaluating multiple approaches by the Trump administration for trade talks. However, in a ministry statement it said one-sided tariffs of up to 145% imposed by President Donald Trump remain an obstacle and undermine trust. The statement reiterated China’s stance that is open to talks, but also that Beijing is determined to fight if it must. The statement cited an unnamed ministry spokesperson as saying that Beijing had taken note of various statements by senior U.S. officials indicating a willingness to negotiate over tariffs. But it emphasized that China would regard overtures without a change in President Donald Trump’s sharp tariff hikes as insincere.",
      "publishedAt": "2025-05-02T02:55:06Z",
      "title": "China says it's evaluating US overtures for trade talks, but tariffs remain an obstacle",
      "url": "https://apnews.com/article/china-tariffs-trump-trade-8637f1b88cf6801c9b9d2b3481389bee",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ba933a/2147483647/strip/true/crop/8064x4536+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F34%2F32a02947e71808d2d1c760b2a7e2%2F413ad7abc2514b3fafa36a4217c2c507"
    },
    {
      "author": "Yuri Kageyama",
      "description": "Shouting “banzai!” or “live long,” thousands of people gathered in a Tokyo park on Thursday and marched through the streets to the banging of traditional drums, as Japan kicked off celebrations to mark May Day. The holiday, also known as International Workers’ Day or Labor Day, marks the struggles and achievements of workers and the labor movement around the world. Thousands of people are expected to attend rallies and marches across the U.S., including in Chicago, Los Angeles, New York and Philadelphia. Junko Kuramochi, a member of a mothers’ group who joined the march in Japan’s capital, said: “For our children to be able to live with hope, the rights of workers must be recognized.\"",
      "publishedAt": "2025-05-01T05:48:25Z",
      "title": "From Tokyo to Los Angeles, workers observe May Day with marches and demonstrations",
      "url": "https://apnews.com/article/may-day-workers-labor-unions-rallies-marches-trump-46de8196d7f01d7458c3d77ccd5e0e54",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b3d59f/2147483647/strip/true/crop/6550x3684+0+341/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2Fcf%2F886f747e06354e6583476720dc56%2F466482b70e64441baf9813fd2f97388f"
    },
    {
      "author": "Lolita Baldor",
      "description": "U.S. defense officials say the number of sexual assaults reported across the military fell by nearly 4% last year and there was a significant drop in the Army. It’s the second year in a row with a decrease. That reverses a troubling trend that’s plagued the Defense Department for more than a decade. The officials say that while the decline is a good sign, the numbers of reported assaults are still too high and the military needs to do more to get victims to report the often undisclosed crime. The officials spoke on condition of anonymity because the report hasn’t been publicly released.",
      "publishedAt": "2025-05-01T04:04:14Z",
      "title": "Sex assault reports in the US military fell last year, AP learns",
      "url": "https://apnews.com/article/military-sexual-assault-reports-harassment-7afab0cb897287768ac1199139ba793f",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea76c6a/2147483647/strip/true/crop/5025x2827+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F02%2F10b21570bc30cb4e3e5b3674c33b%2F4400b5605ce74e84930e9c14dd5f5d88"
    },
    {
      "author": "John O’connor",
      "description": "Police say the driver of a car that barreled through a building used for a popular after-school camp in central Illinois, killing three children and a teenager, may have had a medical emergency. Tests show she was not under the influence of drugs or alcohol. Illinois State Police Director Brendan F. Kelly said at a Thursday news conference that no decision has been made on whether to file charges against the 44-year-old driver. The car went off the road, crossed a field and smashed into the side of the building in Chatham used by Youth Needing Other Things Outdoors. Six other children were hospitalized. One was critical.",
      "publishedAt": "2025-05-01T18:52:29Z",
      "title": "Driver who killed 4 by smashing through Illinois after-school building may have had health emergency",
      "url": "https://apnews.com/article/chatham-illinois-after-school-building-crash-f4adc0f01c8e464d95ee0a3221e3b473",
      "urlToImage": "https://dims.apnews.com/dims4/default/17ec8b9/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F43%2F7d917af4af964fd3d58c7357404a%2F13cdf1f214404a6484b26c6d530d5a70"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}