{
  "articles": [
    {
      "author": "Babar Dogar",
      "description": "Pakistan’s army spokesman, Lt. Gen. Ahmad Sharif, said an Indian drone attacked a military target near Lahore overnight, wounding four soldiers, while the country’s air defense system intercepted and shot down 12 Indian drones that entered Pakistani airspace at various locations. He said the military target was partially damaged in the attack in Lahore. He added that in southern Sindh province, one civilian was killed and another wounded when debris from downed drones fell in a populated area.",
      "publishedAt": "2025-05-08T05:01:41Z",
      "title": "Pakistan says it shot down 12 Indian drones and 1 attacked military target",
      "url": "https://apnews.com/article/india-pakistan-drone-lahore-kashmir-4a33b5884b0860c01f266e2a93688ef7",
      "urlToImage": "https://dims.apnews.com/dims4/default/abf66ee/2147483647/strip/true/crop/7636x4295+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F6a%2F925d12c8461c2a2d423cdc8c7831%2Ff2528a4a5a374e9cad84934c6f64e82a"
    },
    {
      "author": "Nicole Winfield",
      "description": "Cardinals are returning to the Sistine Chapel to continue voting for a new pope. The first conclave ballot failed to find a winner, sending black smoke through the chapel chimney. Some cardinals expected a short conclave to replace Pope Francis, but it may take a few rounds of voting for one man to secure the two-thirds majority needed. The secretive ritual began Wednesday with Cardinal Pietro Parolin leading the proceedings. Thousands gathered in St. Peter’s Square to watch the event on video screens. The cardinals are sequestered from the outside world until they find a new pope.",
      "publishedAt": "2025-05-08T05:01:25Z",
      "title": "Cardinals return to the Sistine Chapel to elect the new pope",
      "url": "https://apnews.com/article/conclave-pope-francis-cardinals-vatican-d7991a37a679f09792ed220cc1f6bbed",
      "urlToImage": "https://dims.apnews.com/dims4/default/206cb3b/2147483647/strip/true/crop/7870x4427+0+410/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F11%2F92feac4b807bc3558b6ea8cb8300%2F2eb1b8ff8d6847208a39e94a93186d81"
    },
    {
      "author": "Zeke Miller, Jill Lawless",
      "description": "The United States and Britain are expected to announce a trade deal that will lower the burden of President Donald Trump’s sweeping tariffs. A deal would be seem as a political victory for U.K. Prime Minister Keir Starmer. Trump said that a deal is due to be announced at 10 a.m. EDT or 1400 GMT. He said that it will be a “full and comprehensive one that will cement the relationship between the United States and the United Kingdom for many years to come.” Starmer’s office said the prime minister would give an “update” about U.S. trade talks later on Thursday. Trump placed a 10% tax on imports from Britain as well as 25% tariffs on autos, steel and aluminum.",
      "publishedAt": "2025-05-08T09:01:55Z",
      "title": "US and UK expected to announce a trade deal that Trump says will cement their relationship",
      "url": "https://apnews.com/article/us-uk-trump-starmer-trade-deal-79d55b8ade0dd8c9265ada9400d079db",
      "urlToImage": "https://dims.apnews.com/dims4/default/ceb0e23/2147483647/strip/true/crop/8064x4536+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F8e%2F1f2b28af29017dd50f92cc82757e%2F4732a8d9916e4c228176431017d4ebd0"
    },
    {
      "author": "Vanessa Gera",
      "description": "Cardinals are meeting in a secret, sacred conclave for a second day as they seek a new pontiff to follow Pope Francis. The conclave opened at the Vatican on Wednesday afternoon but a first round of voting resulted in black smoke billowing from the Sistine Chapel. Black smoke signals that no pope was chosen. One hundred and thirty-three cardinals are trying again Thursday. Here are some things to know about the election of the 267th pontiff of the Catholic Church, which has 1.4 billion faithful across the world.",
      "publishedAt": "2025-05-08T05:04:08Z",
      "title": "What to know on the second day of the conclave to elect the next pope",
      "url": "https://apnews.com/article/vatican-conclave-what-to-know-14851c7840575f5d8c95263e66db3969",
      "urlToImage": "https://dims.apnews.com/dims4/default/baec035/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Fca%2F51c048b5e0dce824ed9640bde6fb%2Fa3764202ce6743c8aaf18c849d66839f"
    },
    {
      "author": "Adrian Sainz, Jonathan Mattise, Graham Lee Brewer",
      "description": "After three former Memphis police officers were acquitted in the beating death of Tyre Nichols, community and civil rights leaders are expressing outrage over another disappointment in the long push for police reform. Nichols’s death more than two years ago sparked nationwide protests and renewed calls for systemic change as the first post-George Floyd case that revealed the limits of an unprecedented reckoning over racial injustice in Black America. Now, Wednesday’s acquittals again show the need for reforms at the federal level, civil rights leaders say.",
      "publishedAt": "2025-05-08T05:25:11Z",
      "title": "Police reform called for after officers acquitted in Tyre Nichols' death",
      "url": "https://apnews.com/article/tyre-nichols-police-reform-memphis-4be9f28531bb70e4be07c12dd8431d84",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb91551/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F4e%2F5ee249d01c40f018a22bf06930d7%2Fa0c7bfc48cc54850b3fa5c08e1133ffc"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking",
      "description": "As Republican leaders draft President Donald Trump’s big bill of $4.5 trillion in tax breaks and $1.5 trillion in spending cuts, dozens of more moderate Republicans from contested congressional districts have positioned themselves at the center of the negotiating table. The GOP centrists warn fellow Republicans they won't vote for steep Medicaid cuts or rollbacks to several Biden-era green energy tax breaks. Some want to revive and bump up a deduction that allows taxpayers to write-off a portion of their state and local taxes, called SALT. It comes amid growing unease over Trump's economic policies. And it's complicating Speaker Mike Johnson's efforts to pass the bill from the House by Memorial Day.",
      "publishedAt": "2025-05-08T11:30:38Z",
      "title": "GOP centrists decry deep cuts to Medicaid and other programs in Trump budget",
      "url": "https://apnews.com/article/tax-cuts-medicaid-cuts-food-stamps-tariffs-9adf4640c67535117c71165b106f6379",
      "urlToImage": "https://dims.apnews.com/dims4/default/6dc5b1b/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F71%2F45088b864c9d831d243aea2d7005%2F42204a9ed8924c29b1d4f3acdff8bd2f"
    },
    {
      "author": "Fatima Hussein, Amelia Thomson-DeVeaux",
      "description": "A poll finds that as the Social Security Administration undergoes massive changes and staffing cuts ushered in by the Trump administration, an increasing share of older Americans, particularly Democrats, aren’t confident the benefit will be available to them. The Associated Press-NORC Center for Public Affairs Research poll from April shows the share of older Americans who are “not very” or “not at all” confident has risen somewhat since 2023. That shift looks very different depending on older Americans’ political party. There has been a substantial decrease in confidence among older Democrats. But older Republicans have become more confident Social Security will be there for them.",
      "publishedAt": "2025-05-08T11:03:32Z",
      "title": "Social Security a concern for rising share of older Americans: AP-NORC poll",
      "url": "https://apnews.com/article/social-security-poll-cuts-trump-musk-doge-87bbca747933860b38c9150965b202ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/b8b21d1/2147483647/strip/true/crop/4548x2558+0+237/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2F5a%2F4ce755f44222662cc14791c24cd0%2Fa7008dfe4ee54443b679ff237150c87c"
    },
    {
      "author": "Gene Johnson",
      "description": "A federal judge has temporarily blocked the Trump administration from imposing new transit and homelessness grant conditions. The conditions were on millions of dollars worth of mass transit grants for the Seattle area. They also included homelessness services grants for Boston, New York and San Francisco. The lawsuit was filed last week by eight cities and counties. It said the new conditions were designed to further President Donald Trump’s efforts to eliminate DEI policies and assist mass deportation efforts. The judge in Seattle wrote in her decision Wednesday that the local governments had shown they were likely to win the case.",
      "publishedAt": "2025-05-08T02:24:45Z",
      "title": "Judge temporarily blocks Trump administration's new transit and homelessness grant conditions",
      "url": "https://apnews.com/article/trump-cities-grants-lawsuit-48cb4f5754eeae14157d136757d0a2f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c41a85/2147483647/strip/true/crop/6074x3417+0+142/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2Fdf%2Fb2496f94d618dedc988aa8749297%2Fb442a1e6d4984c1d84bb3211c7e0dca1"
    },
    {
      "author": "Mohammad Jahjouh, Sam Mednick",
      "description": "For burn patients, shortages of medicines in Gaza are particularly excruciating under Israel's blockade of the territory, now in its third month. Burns are painful and very susceptible to infection, but hospitals are short on painkillers, anesthetics, wound dressings and hygiene materials, aid workers say. At the same time, the number of burn patients has surged after Israel renewed its bombardment in Gaza in mid-March, with Nasser Hospital — the biggest in southern Gaza — seeing a fivefold increase in cases.",
      "publishedAt": "2025-05-08T05:09:36Z",
      "title": "Burn patients face excruciating recovery as medicines dwindle under Israeli blockade of Gaza",
      "url": "https://apnews.com/article/gaza-airstrikes-burns-blockade-344e7fbc980abd9ba081329d81894a0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/c9318dc/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2F92%2Fb22f7a9c9221bd6cc13ec14b9162%2F3129482f534c46f3918c7885a74ffcfd"
    },
    {
      "author": "Marc Levy",
      "description": "Pennsylvania Sen. John Fetterman was meeting recently with representatives from a teachers union when things quickly devolved. Fetterman began repeating himself, shouting and slamming his hands on a desk. That's according to two people who were briefed about the meeting and were granted anonymity to discuss it. Fetterman said in a statement through his office that he and the officials “had a spirited conversation\" and said he will always support teachers. The interaction adds to the questions being raised about the Democratic senator's mental health and behavior barely three years after a he survived a stroke and two years after being treated for depression.",
      "publishedAt": "2025-05-08T02:13:37Z",
      "title": "Sen. John Fetterman raises alarms with outburst at meeting with union officials, AP sources say",
      "url": "https://apnews.com/article/john-fetterman-trump-democrats-senate-pennsylvania-8129e206ed9479ad8534eac3fd128abe",
      "urlToImage": "https://dims.apnews.com/dims4/default/728be7f/2147483647/strip/true/crop/4736x2664+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F4e%2F1698c395e1127e1e02ab1324204d%2Fd0af05cab7ee4cfbb23d73d057f99130"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}