{
  "articles": [
    {
      "author": "NATALIE MELZER and KAREEM CHEHAYEB",
      "description": "NAHARIYA, Israel (AP) — Hezbollah fired over 100 rockets early Sunday across northern Israel, with some landing near the city of Haifa, as Israel launched hundreds of strikes on Lebanon. A Hezbollah leader declared an “open-ended battle” was underway as both sides appeared to be spiraling closer toward all-out war.",
      "publishedAt": "2024-09-22T04:52:27Z",
      "title": "Hezbollah hits back with rockets as it declares an 'open-ended battle' with Israel",
      "url": "https://apnews.com/fb1aa8ae061885ba86855f7fe9ec5be7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a302024d11f14e40886ebeb05d87240c/1920.jpeg"
    },
    {
      "author": "NASSER KARIMI",
      "description": "TEHRAN, Iran (AP) — An explosion in a coal mine in eastern Iran killed at least 34 workers and injured 17 others, officials said Sunday, marking one of the worst mining disasters in the country's history as others remained missing hours after the blast.",
      "publishedAt": "2024-09-22T04:50:26Z",
      "title": "An explosion at a coal mine in eastern Iran kills at least 34 workers",
      "url": "https://apnews.com/f118b458f3350d7d655116c36ec261b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a8c18456c30409f9d6e40d28d87b896/1707.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — Donald Trump has long pledged to deport millions of people, but he's bringing more specifics to his current bid for the White House: invoking wartime powers, relying on like-minded governors and using the military.",
      "publishedAt": "2024-09-22T13:02:14Z",
      "title": "Trump's goal of mass deportations fell short. But he has new plans for a second term",
      "url": "https://apnews.com/844f3050ba99552b900ed9f3a1dec22d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe5bb75cdfa34301a32be4707874e153/3000.jpeg"
    },
    {
      "author": "HOLLY MEYER, PETER SMITH and AMELIA THOMSON-DEVEAUX",
      "description": "Vice President Kamala Harris is a Baptist who was influenced by religious traditions in her mother’s home country of India.",
      "publishedAt": "2024-09-22T12:14:20Z",
      "title": "Are Trump and Harris particularly Christian? That's not what most Americans would say: AP-NORC poll",
      "url": "https://apnews.com/badf15a55529afe5b7dd4a5bbdd2722e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca88093a30594222812b82906a211889/3000.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — Sidewalks once teeming with tents, tarps and people passed out next to heaps of trash have largely disappeared from great swaths of San Francisco, a city widely known for its visible homeless population.",
      "publishedAt": "2024-09-22T04:05:05Z",
      "title": "More shelter beds and a crackdown on tents mean fewer homeless encampments in San Francisco",
      "url": "https://apnews.com/c5dad968b8fafaab83b51433a204c9ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87a3364ea56645f088caa6bc32721212/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — Facing a swirl of conflicts and crises across a fragmented world, leaders attending this week’s annual U.N. gathering are being challenged: Work together — not only on front-burner issues but on modernizing the international institutions born after World War II so they can tackle the threats and problems of the future.",
      "publishedAt": "2024-09-22T04:11:26Z",
      "title": "World leaders are gathering in New York for the U.N. General Assembly. The outlook is gloomy",
      "url": "https://apnews.com/c8dec645b01be23f67c542666c229d9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f1125da528740b78405c4d58224ad07/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Russia launched new strikes in the Ukrainian city of Kharkiv that hit high-rise apartment buildings, leaving at least 21 wounded in a second consecutive nighttime attack, authorities said.",
      "publishedAt": "2024-09-22T08:41:11Z",
      "title": "21 wounded after Russia strikes apartment buildings in Ukrainian city of Kharkiv",
      "url": "https://apnews.com/948212c68bd29bb1b860851f2efa2163",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95ef2e3a20124ab59719fde98d3186d9/3000.jpeg"
    },
    {
      "author": "DAVID BILLER and BRUNA PRADO",
      "description": "Tens of thousands of Brazilians gathered at Rio de Janeiro’s mega-festival Rock in Rio on Friday, with many staking out spots of artificial grass all day to hear the headliner, Katy Perry. As her music keyed up, the enormous screens around the stage showed someone else in their bottom corners — a sign language interpreter.",
      "publishedAt": "2024-09-22T14:24:12Z",
      "title": "Rock in Rio's sign language pumps up Brazil's deaf audience",
      "url": "https://apnews.com/7dfcf27e39440881b216fc105d55b100",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c0a7adec212445eb436bde4bc7a4486/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "BIRMINGHAM, Ala. (AP) — A mass shooting killed four people and wounded 17 others in a popular nightlife area in Birmingham, Alabama, with many of the victims caught in the crossfire, police said Sunday.",
      "publishedAt": "2024-09-22T07:25:33Z",
      "title": "Mass shooting kills 4 and wounds 17 in nightlife district in Birmingham, Alabama",
      "url": "https://apnews.com/5293c5068e6fec5779d19dd100fc37f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2dc683eba1d04bbf9d6e98e1c684d07a/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "A'ja Wilson and Caitlin Clark had record-breaking seasons, putting up stats the WNBA had never seen before.",
      "publishedAt": "2024-09-22T14:59:22Z",
      "title": "A'ja Wilson and Caitlin Clark are unanimous choices for WNBA AP Player and Rookie of the Year",
      "url": "https://apnews.com/55eb092dba5a1face9dff9031a564d15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4505d1c3d59f479dbac677a0f871b2c9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}