{
  "articles": [
    {
      "author": "MATTHEW LEE and ABBY SEWELL",
      "description": "TEL AVIV, Israel (AP) — Secretary of State Antony Blinken said Tuesday that the U.N.",
      "publishedAt": "2024-06-11T10:03:52Z",
      "title": "Blinken welcomes UN vote in favor of Gaza cease-fire plan and again calls on Hamas to accept it",
      "url": "https://apnews.com/d3733d55c6a66222da1a4a051997094c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04eba96f17424ddbb1623a9c9fb02524/1920.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "GENEVA (AP) — The U.N. human rights office is citing possible war crimes by Israeli forces and Palestinian armed groups in connection with a deadly raid by Israeli forces that freed four hostages over the weekend and killed hundreds of Palestinians.",
      "publishedAt": "2024-06-11T09:32:42Z",
      "title": "UN says Israeli forces, Palestinian armed groups may have committed war crimes in deadly raid",
      "url": "https://apnews.com/40a3e17012915c409e8a5d50475dd122",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f19c9ed42494c4598ad4f2a2c26c9b9/3000.jpeg"
    },
    {
      "author": "RANDALL CHASE, CLAUDIA LAUER, MICHAEL KUNZELMAN and ALANNA DURKIN RICHER",
      "description": "WILMINGTON, Del. (AP) — Jurors will resume deliberations Tuesday in the criminal case against Hunter Biden over a gun President Joe Biden's son bought in 2018 when prosecutors say he was in the throes of a crack cocaine addiction.",
      "publishedAt": "2024-06-11T04:10:20Z",
      "title": "Jurors will resume deliberations in the federal gun case against President Joe Biden's son Hunter",
      "url": "https://apnews.com/5dd8a9380235c6360a1ddb691ef24a06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05503507dc7846debe8e29a3ae1975a7/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Groups pushing tighter gun laws have been building political muscle through multiple elections, boosted by the outcry following mass shootings at schools and other public places, to say nothing of the nation's daily gun violence.",
      "publishedAt": "2024-06-11T04:15:12Z",
      "title": "Biden and gun-control advocates want to flip an issue long dominated by the NRA",
      "url": "https://apnews.com/069fa483fc8af1e321ef8b53040f70ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd45e67258e4432fa8ab4513defaf36b/3000.jpeg"
    },
    {
      "author": "GREGORY GONDWE and GERALD IMRAY",
      "description": "BLANTYRE, Malawi (AP) — Malawian Vice President Saulos Chilima and nine other people died when the small military plane they were traveling in crashed in bad weather in a mountainous region in the north of the country, the president said Tuesday.",
      "publishedAt": "2024-06-11T08:06:08Z",
      "title": "Malawi's vice president and 9 others are confirmed dead after the wreckage of their plane is located",
      "url": "https://apnews.com/c071c832931d7cfeae92f9bb1c199075",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b81275f99fe147d8b17ec2f944952b5b/1920.jpeg"
    },
    {
      "author": "KEN MORITSUGU and DIDI TANG",
      "description": "BEIJING (AP) — Chinese police have detained a suspect in a stabbing attack on four instructors from Iowa’s Cornell College who were teaching at a Chinese university in the northeast city of Jilin, officials said Tuesday.",
      "publishedAt": "2024-06-11T04:29:50Z",
      "title": "Chinese police say a suspect is in custody in the stabbing of 4 US college instructors",
      "url": "https://apnews.com/59ebabadcfe4da3bf76e08121e1a1e9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70ca9e70f05c4d75a4bc29c819ad60a4/3000.jpeg"
    },
    {
      "author": "TRISHA THOMAS",
      "description": "LECCE, Italy (AP) — It was a scene straight out of “The Godfather.” On the night of Feb. 1, a bloody goat head with a butcher’s knife through it was left on the doorstep of Judge Francesca Mariano’s home in southern Italy, with note beside it reading, “like this.”",
      "publishedAt": "2024-06-11T04:04:58Z",
      "title": "In Italy's Puglia region, women take the lead in challenging the local mafia at great personal risk",
      "url": "https://apnews.com/f8dddb166121d92cd88a411744b78eed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3f65d3c959741488d976fbacfe95df5/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "LONDON (AP) — He has no political experience. No high-profile endorsements. No party affiliation. What Fidias Panayiotou does have are 2.6 million followers on YouTube and more on TikTok. And now he has won a seat in the European Parliament representing Cyprus, one of several unusual candidates who launched improbable campaigns only to snag membership in the 720-seat legislature.",
      "publishedAt": "2024-06-11T05:24:10Z",
      "title": "These candidates who won seats in the European Parliament this week aren't who you might expect",
      "url": "https://apnews.com/2e508a3dd2bc3695f0ec48286f7aaaf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac0745a30de842b89c30387471c9b3cb/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Gas prices are once again on the decline across the U.S., bringing some relief to drivers now paying a little less to fill up their tanks.The national average for gas prices on Monday stood around $3.44, according to AAA.",
      "publishedAt": "2024-06-11T04:02:21Z",
      "title": "US gas prices are falling. Experts point to mild demand at the pump ahead of summer travel",
      "url": "https://apnews.com/62e6c0a321892350830b0fe301494459",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0275ffe614f4453c9d3a843f2b199afe/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "ORLANDO, Fla. (AP) — A new attraction starring the first Black Disney princess is opening at the company’s U.S. theme park resorts, and some Disney followers see it as a fitting replacement to a former ride based on a movie that contained racist tropes.",
      "publishedAt": "2024-06-11T05:06:04Z",
      "title": "Attraction starring Disney's first Black princess replaces ride based on film many viewed as racist",
      "url": "https://apnews.com/e22e9169433365fcb77a51da507a2739",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74a680cf67e34973a7e290ed3a3b09c4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}