{
  "articles": [
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — The arrival of Israeli Prime Minister Benjamin Netanyahu has touched off a flurry of protests in the nation’s capital, including a sit-in at a congressional office building that ended with multiple arrests.",
      "publishedAt": "2024-07-24T04:08:10Z",
      "title": "Netanyahu visit sparks wave of protests in DC, with all sides criticizing the Israeli PM",
      "url": "https://apnews.com/9a7885972989b2397b49e5b971ffe0e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58aba8d56d8b45658d70f60180150d09/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Israeli Prime Minister Benjamin Netanyahu speaks before Congress on Wednesday in hopes of bolstering U.S.",
      "publishedAt": "2024-07-24T04:04:45Z",
      "title": "Netanyahu looks to boost US support in a speech to Congress but faces protests and lawmaker boycotts",
      "url": "https://apnews.com/6ea5daf3cd1988b0ad6e874bd450f9bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47b2ba9b0a6243d6af69c3bac00704cb/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Voters in Indiana haven't backed a Democratic presidential candidate in nearly 16 years. But when Vice President Kamala Harris heads to the solidly Republican state on Wednesday, she'll speak to a constituency she hopes will turn out for her in massive numbers in November: women of color.",
      "publishedAt": "2024-07-24T09:04:43Z",
      "title": "Harris will address a historically Black sorority as her campaign hopes to win women of color",
      "url": "https://apnews.com/031e3afa51f9ed42e0acd979e80019a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e404ea8a92a14582a941becff2260603/2453.jpeg"
    },
    {
      "author": "LISA MASCARO and JILL COLVIN",
      "description": "WASHINGTON (AP) — Republican leaders are warning party members against using overtly racist and sexist attacks against Vice President Kamala Harris, as they and former President Donald Trump 's campaign scramble to adjust to the reality of a new Democratic rival less than four months before Election Day.",
      "publishedAt": "2024-07-24T01:02:20Z",
      "title": "Republican leaders urge colleagues to steer clear of racist and sexist attacks on Harris",
      "url": "https://apnews.com/76f8e90d24004e49449087787ac031a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c58eb8e19fad4ca491410afacb39125e/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Even though President Joe Biden won't be on the ballot this November, voters still will be weighing his legacy.As Vice President Kamala Harris moves to take his place as the Democratic standard-bearer, Biden’s accomplishments remain very much at risk should Republican Donald Trump prevail.",
      "publishedAt": "2024-07-24T04:15:21Z",
      "title": "Biden will make a case for his legacy - and for Harris to continue it - in his Oval Office address",
      "url": "https://apnews.com/0f92ccfe6f948770b760e983869fa989",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7728446f9a1f4b3c9faebb14ae6f425e/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "CHARLOTTE, N.C. (AP) — Donald Trump is holding his first public campaign rally since President Joe Biden dropped out of a 2024 matchup that both major parties had spent months preparing for, leaving the former president to direct his ire toward his likely new opponent, Vice President Kamala Harris.",
      "publishedAt": "2024-07-24T04:28:16Z",
      "title": "Trump expected to turn his full focus on Harris at first rally since Biden's exit from 2024 race",
      "url": "https://apnews.com/7c7e6e405fecc8927a63763c76f2db1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79b5ed2016c04d7bba5c1db8c9256899/3000.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — A plane crashed Wednesday just after taking off from Nepal’s capital, killing 18 people and injuring a pilot who was the lone survivor.Police official Basanta Rajauri said authorities have pulled out all 18 bodies.",
      "publishedAt": "2024-07-24T06:08:10Z",
      "title": "Plane crashes just after takeoff from Nepal's capital, killing 18 people. Pilot is lone survivor",
      "url": "https://apnews.com/a6ff1b2d560c55d2088b83eea1dab6d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f3fbd9d857340e5b8f78988c6bcfe69/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Taiwan shuttered offices, schools and tourist sites across the island on Wednesday ahead of a powerful typhoon that already worsened seasonal rains in the Philippines, killed at least 13 people and displaced 600,000.",
      "publishedAt": "2024-07-24T02:24:27Z",
      "title": "Taiwan prepares for a strong typhoon that worsened monsoon rains in the Philippines, killing 13",
      "url": "https://apnews.com/f847a7f030e3a8f1dba865aa4b159f4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9079e082d724d2fb63626ba61078919/1920.jpeg"
    },
    {
      "author": "GRAHAM DUNBAR",
      "description": "PARIS (AP) — Salt Lake City will be an Olympics host again after the IOC formally awarded the 2034 Winter Games to the United States bid on Wednesday, after a power move by Olympic officials who want to shut down a U.S.",
      "publishedAt": "2024-07-24T10:34:51Z",
      "title": "IOC awards 2034 Winter Games to Salt Lake City. Utah last hosted the Olympics in 2002",
      "url": "https://apnews.com/958fe633a5ce9ef0f7f497c9e5ee3255",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08d2d41aca694cefb5235eb5cc304df9/3000.jpeg"
    },
    {
      "author": "ALANIS THAMES",
      "description": "PARIS (AP) — When Naomi Osaka lifts her racket on the red clay courts at Roland Garros during the Paris Olympics later this month, it'll represent more than a high-stakes competition for the tennis star.",
      "publishedAt": "2024-07-24T09:44:42Z",
      "title": "Biles, Richardson, Osaka comebacks 'bigger than them.' They highlight issues facing Black women",
      "url": "https://apnews.com/be8d453e79641419e0b4376f5f040f0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/477db848a09e4164b125b1d41f293eb7/2862.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}