{
  "articles": [
    {
      "author": "WAFAA SHURAFA, BASSEM MROUE, JULIA FRANKEL and DAVID RISING",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli fighter jets hit targets in the Gaza Strip minutes after a weeklong truce expired on Friday, as the war with Hamas resumed in full force. Black smoke billowed from the besieged territory and Israel dropped leaflets over parts of southern Gaza urging people to leave their homes, suggesting it was preparing to widen its offensive.",
      "publishedAt": "2023-12-01T05:05:56Z",
      "title": "Warplanes hit targets in Gaza as Israel resumes offensive, warning of attacks to come in south",
      "url": "https://apnews.com/c944c736efdf8993c7a17cf683d6e364",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88359f97455d4c0bb62323591627886e/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "JERUSALEM (AP) — There was no trace of Hanan Yablonka — not on the 42-year-old Israeli's social media accounts nor on his phone, found in the bullet-riddled car he and four friends tried to flee in after Hamas militants attacked the music festival they were attending in southern Israel.",
      "publishedAt": "2023-12-01T06:06:31Z",
      "title": "Nearly 2 months into the war, many Israelis have no idea if their relatives are dead or alive",
      "url": "https://apnews.com/095f64d06108416ff9c58ea7550b9a74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d47f36b52c1475cb9db4ec5a0dc4250/3000.jpeg"
    },
    {
      "author": "JAMES JORDAN, SAMYA KULLAB and ILLIA NOVIKOV",
      "description": "KHARKIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy says the war with Russia is in a new stage, with winter expected to complicate fighting after a summer counteroffensive that failed to produce desired results due to enduring shortages of weapons and ground forces.",
      "publishedAt": "2023-12-01T05:03:26Z",
      "title": "The AP Interview: Ukraine's Zelenskyy says the war with Russia is in a new phase as winter looms",
      "url": "https://apnews.com/75f1f785b17452fc23819d459e6ab64b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e6dbcf4f4224084b9c23fdcbaf4d22d/1920.jpeg"
    },
    {
      "author": "PETER PRENGAMAN",
      "description": "DUBAI, United Arab Emirates (AP) — Ask most people what the annual U.N. climate talks are and the likely answer will be: “Huh?” Ask those who do know and the answer may be: “Why should I care?\"The negotiations, called Conference of Parties, are nearly two weeks long and in their 28th iteration in Dubai.",
      "publishedAt": "2023-12-01T05:52:37Z",
      "title": "Why hold UN climate talks 28 times? Do they even matter?",
      "url": "https://apnews.com/8df2b30f6420477e9e404ed6bc23b2b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d06d4f2b97ad4559ab01771f6df566f3/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN and SETH BORENSTEIN",
      "description": "DUBAI, United Arab Emirates (AP) — International climate talks turned to a power game on Friday as dozens of world leaders including the Saudi crown prince and India's prime minister were to speak, but two of the world's most powerful men — President Joe Biden of the U.S.",
      "publishedAt": "2023-12-01T05:54:16Z",
      "title": "Top world leaders will speak at UN climate summit. Global warming, fossil fuels will be high in mind",
      "url": "https://apnews.com/f72309c3d0a17c40817b7d2bbf55829b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ad9b04bb67c4461943e06e8f9f11a06/3000.jpeg"
    },
    {
      "author": "JEFF McMILLAN",
      "description": "When Sam Schultz was sexually assaulted, it felt like a part of them died.It took eight years and the burgeoning #MeToo movement to spur them to go public and make a police report, and an additional five years for their attackers to plead guilty.",
      "publishedAt": "2023-12-01T05:09:14Z",
      "title": "For a male sexual assault survivor, justice won in court does not equal healing",
      "url": "https://apnews.com/183cd34b8b86543b10ca3d041f8aacd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70d4a3b96d6b442eabf8186bcf693c65/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "BANGKOK (AP) — About two weeks into a major offensive against Myanmar's military-run government by an alliance of three well-armed militias of ethnic minorities, an army captain, fighting in a jungle area near the northeastern border with China, lamented that he'd never seen such intense action.",
      "publishedAt": "2023-12-01T01:01:50Z",
      "title": "Myanmar's military is losing ground against coordinated nationwide attacks, buoying opposition hopes",
      "url": "https://apnews.com/8e9381ba35dd07620ae20772486a5ecd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f9dabd9d9ca4ffabbac9513b7a62644/2000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — More Americans now believe the death penalty, which is undergoing a yearslong decline of use and support, is being administered unfairly, a finding that is adding to its growing isolation in the U.S., according to an annual report on capital punishment.",
      "publishedAt": "2023-12-01T05:06:21Z",
      "title": "Report: Belief death penalty is applied unfairly shows capital punishment's growing isolation in US",
      "url": "https://apnews.com/fa998133f3b8b0bbe2b80b21c08534f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d4ed2714fba4f7d8934bdc635c290a3/1776.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Rep. George Santos of New York is facing a critical vote to expel him from the House on Friday as lawmakers weigh whether his actions, fabrications and alleged lawbreaking warrant the chamber's most severe punishment.",
      "publishedAt": "2023-12-01T05:13:33Z",
      "title": "Rep. George Santos is facing a vote on his expulsion from Congress as lawmakers weigh accusations",
      "url": "https://apnews.com/fd0f1524065883c6b2fe3e6f9afd84db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fa53e2cb27b4d19a283e852f3b4221b/1920.jpeg"
    },
    {
      "author": "CATERINA MORBIATO",
      "description": "MEXICO CITY (AP) — The day he was arrested, Luis was in a government office trying to get a document attesting to his clean criminal history so he could apply for a call center job.“What I wanted at that time was something better for my life,” said the 23-year-old, who was working as a baker.",
      "publishedAt": "2023-12-01T05:01:48Z",
      "title": "Detainees in El Salvador's gang crackdown cite abuse during months in jail",
      "url": "https://apnews.com/a9e7cae418f5de74837bd666cdeabe98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f61a796832254edeb1aa275fecf90d64/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}