{
  "articles": [
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — President Volodymyr Zelenskyy worked to shore up U.S. support for Ukraine on a whirlwind visit to Washington on Thursday, delivering an upbeat message on the war's progress while facing new questions about the flow of American dollars that for 19 months have helped keep his troops in the fight against Russian forces.",
      "publishedAt": "2023-09-21T04:04:07Z",
      "title": "Zelenskyy delivers upbeat message to US lawmakers on war progress as some Republican support softens",
      "url": "https://apnews.com/1d20574fb3ea4fb5efcc7db5458a33a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d1d424cf597444eaf180d7e1eed5ffe/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "JACUMBA HOT SPRINGS, Calif. (AP) — A group of migrants from China surrendered to a Border Patrol agent in remote Southern California as gusts of wind drowned the hum of high-voltage power lines, joining others from Ecuador, Brazil, Colombia and elsewhere in a desert campsite with shelters made from tree branches.",
      "publishedAt": "2023-09-21T18:30:43Z",
      "title": "After a lull, asylum-seekers adapt to US immigration changes and again overwhelm border agents",
      "url": "https://apnews.com/48790c1ee9f1928a2f3216558e599df4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83a47a5369ba41b997d628e4c78d630b/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — With House Speaker Kevin McCarthy's latest funding plan in ruins and lawmakers leaving town for the weekend, there's no endgame in sight as hard-right Republicans push dangerously closer to a disruptive federal shutdown.",
      "publishedAt": "2023-09-21T16:07:51Z",
      "title": "Government shutdown risk spikes as House Republicans leave town in disarray amid hard-right revolt",
      "url": "https://apnews.com/deff84c0e2ff7d3bd076b8c38e14cca4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b1f165fc6ba4a4abd7a0f85c4862ebc/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — The allegation of India’s involvement in the killing of a Sikh Canadian is based on surveillance of Indian diplomats in Canada, including intelligence provided by a major ally, a Canadian official told The Associated Press on Thursday.",
      "publishedAt": "2023-09-21T08:30:42Z",
      "title": "Surveillance of Indian diplomats in Canada led to allegations around Sikh killing, official says",
      "url": "https://apnews.com/381e973e84f8d0c10b0bd53b03ccbdf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1def945779747938b69d147ba14f148/1920.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI and MICHELLE L. PRICE",
      "description": "LANSING, Mich. (AP) — When former President Donald Trump visits Detroit next week, he’ll be looking to blunt criticisms from a United Auto Workers union leadership that has said a second term for him would be a “disaster\" for workers.",
      "publishedAt": "2023-09-21T17:28:36Z",
      "title": "Trump says he always had autoworkers' backs. Union leaders say his first-term record shows otherwise",
      "url": "https://apnews.com/dfcb805fd4e749b13aaf827e1463da73",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/304a396100d74df4ac4cab55efb66662/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Magnate Rupert Murdoch's surprise announcement Thursday that he's stepping down as leader of his two companies leaves his son Lachlan firmly in line of succession at Fox and the rest of the media empire.",
      "publishedAt": "2023-09-21T13:28:43Z",
      "title": "Rupert Murdoch's surprise exit from Fox leaves son Lachlan in line of succession at media empire",
      "url": "https://apnews.com/30286a4a3107b7bde612adbfc7891958",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/086aa32db7a9453c886735c66e333952/3000.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN and DEEPTI HAJELA",
      "description": "MIDDLETOWN, N.Y. (AP) — A charter bus carrying high school students to a band camp veered off a New York highway and tumbled down an embankment Thursday, killing two adults and seriously injuring several others, officials said.",
      "publishedAt": "2023-09-21T18:52:16Z",
      "title": "Bus carrying high school students to band camp crashes, killing 2 and seriously injuring others",
      "url": "https://apnews.com/076b1835bdeac2b6d86ebd40ff065911",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ba279c19c034fb09468371c58712496/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — When an Ohio father learned that his 11-year-old daughter had been manipulated into sending explicit photos to an adult, he turned to the police for help.",
      "publishedAt": "2023-09-21T20:40:24Z",
      "title": "Police suggested charging a child for her explicit photos. Experts say the practice is common",
      "url": "https://apnews.com/0477a43e82b1d9120b35d8ce223af007",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e14d127d2c87472dbf934812ab64cd3a/3000.jpeg"
    },
    {
      "author": "DIANE JEANTET and ELÉONORE HUGHES",
      "description": "RIO DE JANEIRO (AP) — Indigenous people celebrated Thursday after Brazil's Supreme Court ruled to enshrine their land rights, removing the imminent threat those protections could be rolled back.The justices had been evaluating a lawsuit brought by Santa Catarina state, backed by farmers, seeking to block an Indigenous group from expanding the size of its territorial claim.",
      "publishedAt": "2023-09-22T00:12:35Z",
      "title": "Indigenous people in Brazil shed tears of joy as the Supreme Court enshrines their land rights",
      "url": "https://apnews.com/715fc33861a5d9b3c6ee98a8362d802f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e40bc84910f469faae9355c5dac3d19/3000.jpeg"
    },
    {
      "author": "JOSH DUBOW",
      "description": "SANTA CLARA, Calif. (AP) — Christian McCaffrey scored a touchdown in his 12th straight game, Brock Purdy threw two TD passes and the San Francisco 49ers won their 13th straight regular season game, 30-12 over the New York Giants on Thursday night.",
      "publishedAt": "2023-09-22T03:34:18Z",
      "title": "Christian McCaffrey and the 49ers win 13th straight in the regular season, beat the Giants 30-12",
      "url": "https://apnews.com/ade65719a305de2516a28509a9ec6385",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56363f5f0efe448ca9dbf43ecb155187/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}