{
  "articles": [
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Speaker Kevin McCarthy’s grip on the gavel was at serious risk Tuesday after the House voted to move ahead with a historic vote, an effort by hard-right critics to oust the embattled Republican leader from the job.",
      "publishedAt": "2023-10-03T15:31:45Z",
      "title": "Speaker McCarthy's job at risk after House votes to move ahead with hard-right effort to oust him",
      "url": "https://apnews.com/327e294a39f8de079ef5e4abfb1fa555",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8015162e5d6f40c4bbf393d2cf878a7d/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, BOBBY CAINA CALVAN and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A New York judge imposed a limited gag order on defendant Donald Trump Tuesday after the former president disparaged a key court staffer during his civil business fraud trial.Judge Arthur Engoron issued the order, which applies to all parties in the case and pertains only to verbal attacks on court staff.",
      "publishedAt": "2023-10-03T04:03:56Z",
      "title": "New York judge issues limited gag order after Trump makes disparaging post about court clerk",
      "url": "https://apnews.com/371675a2482c1de01f516f29b5a43d33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f28ebbd0f33248a8bee1ed616bb37a8b/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST, CLAUDIA LAUER and RANDALL CHASE",
      "description": "WILMINGTON, Del. (AP) — Hunter Biden pleaded not guilty on Tuesday to three federal firearms charges filed after his earlier deal imploded, setting the case on a track toward a possible trial in 2024 while his father is campaigning for reelection.",
      "publishedAt": "2023-10-03T04:06:27Z",
      "title": "Hunter Biden pleads not guilty to three federal gun charges filed after his plea deal collapsed",
      "url": "https://apnews.com/68b186294bb36071c02428834ec5f470",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c0afd7b3a07470fa6291f5b62da97f5/1920.jpeg"
    },
    {
      "author": "ASHRAF KHALIL and DIDI TANG",
      "description": "WASHINGTON (AP) — Wearing an “I Love Pandas” T-shirt and clutching a panda-covered diary, Kelsey Lambert bubbled with excitement as she glimpsed the real thing. She and her mother, Alison, had made a special trip from San Antonio just to watch the National Zoo's furry rock stars casually munching bamboo and rolling around on the grass.",
      "publishedAt": "2023-10-03T04:30:27Z",
      "title": "Pandas could be gone from America's zoos by the end of next year",
      "url": "https://apnews.com/1f0eee3fc0114296bcfe5472c43a373e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1552674b58f4ba58542352d12c022f9/3000.jpeg"
    },
    {
      "author": "SARA BURNETT",
      "description": "Donald Trump 's campaign is calling on the Republican National Committee to cancel all remaining presidential primary debates, saying the RNC must instead “refocus its manpower” on defeating Joe Biden next year.",
      "publishedAt": "2023-10-03T15:46:41Z",
      "title": "Donald Trump wants future Republican debates to be canceled after refusing to participate in them",
      "url": "https://apnews.com/a3ff8c83bd605876b4b53bbebfb7ed7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07f5ccd31ee04863bbe3b262242fbbb5/3000.jpeg"
    },
    {
      "author": "MAYSOON KHAN",
      "description": "MOREAU, N.Y. (AP) — A fingerprint on a ransom note led police to a kidnapping suspect's camper in New York where 9-year-old Charlotte Sena was found hidden in a cabinet, ending a two-day search sparked by the girl's disappearance during a family camping trip, officials said.",
      "publishedAt": "2023-10-03T15:19:40Z",
      "title": "Kidnapping suspect who left ransom note also gave police a clue — his fingerprints",
      "url": "https://apnews.com/d40214566d16512582eaa620dcbd56f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8532193782a34bbd95cea8c79c8ca059/2536.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "A Florida sheriff released body camera video Monday that he says shows his officers were justified when they repeatedly punched, elbowed and kneed a drug suspect who appeared to resist arrest even after being zapped with a stun gun and pinned to the ground.",
      "publishedAt": "2023-10-03T01:41:48Z",
      "title": "Jacksonville sheriff says body camera video shows officers were justified in beating suspect",
      "url": "https://apnews.com/e784cf81f8a16219e08ddc387d070df4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fee4048e9c6245a7afe94cd1a79d58d4/2000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — India has told Canada to remove 41 of its 62 diplomats in the country, an official familiar with the matter said Tuesday, ramping up a confrontation between the two countries over Canadian accusations that India may have been involved in the killing of a Sikh separatist leader in suburban Vancouver.",
      "publishedAt": "2023-10-03T11:52:12Z",
      "title": "India tells Canada to remove 41 of its 62 diplomats in the country, an official says",
      "url": "https://apnews.com/090f136eebed1dd50c9a199e40360826",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/deac9e4f8aff41e89d1d84c23c04b906/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Jury selection began Tuesday in the fraud trial of FTX founder Sam Bankman-Fried after a prosecutor revealed that no discussions about a potential plea agreement took place in the 10 months since the cryptocurrency executive was arrested and brought to the United States.",
      "publishedAt": "2023-10-03T04:18:42Z",
      "title": "Jury selection begins in trial of fallen cryptocurrency mogul Sam Bankman-Fried",
      "url": "https://apnews.com/e1a6ca570bc401937a04bd15a404f8bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e15bdd40cc7d4e339c06b3c7e185e9ff/3000.jpeg"
    },
    {
      "author": null,
      "description": "PHILADELPHIA (AP) — Michael Lorenzen, Byron Buxton, Johnny Cueto and Jonathan Hernández were among the players left off rosters for Wild Card Series that started Tuesday, while the Texas Rangers made the surprise inclusion of former top draft pick Matt Bush.",
      "publishedAt": "2023-10-03T15:58:18Z",
      "title": "Lorenzen, Buxton, Hernández, Cueto out for Wild Card Series; Correa, Siri, Bush on rosters",
      "url": "https://apnews.com/9b5381f14e9b1db18b7c64033417a379",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db985c6a64904e99a225b4da9967d6a1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}