{
  "articles": [
    {
      "author": "JOSEPH KRAUSS",
      "description": "It has been a devastating week for Hezbollah and the people of Lebanon.Bombs hidden in the group's pagers and walkie-talkies killed dozens of people and wounded thousands — many of them Hezbollah members.",
      "publishedAt": "2024-09-25T04:06:43Z",
      "title": "Israel has landed heavy blows on Hezbollah. The victory it seeks could prove elusive",
      "url": "https://apnews.com/cce53839bbcf0a9a36af45ed2fa7dbb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa6770bd09a44f159f1603eb10f55d7b/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and NATALIE MELZER",
      "description": "BEIRUT (AP) — Israel killed a top Hezbollah commander Tuesday as part of a two-day bombing campaign that has left more than 560 people dead and prompted thousands in southern Lebanon to seek refuge from the widening conflict.",
      "publishedAt": "2024-09-24T09:24:58Z",
      "title": "Israel bombards Hezbollah, killing a top commander, while families flee southern Lebanon",
      "url": "https://apnews.com/640a0046aceea1b5cfb395a54ff36bce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/217a1b8f644e457ea8f60f1ebdf344a9/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and LORNE COOK",
      "description": "KYIV, Ukraine (AP) — The victory plan that President Volodymyr Zelenskyy will present to the White House this week asks the Biden administration to do something it has not achieved in the two and a half years since Russia invaded Ukraine: act quickly to support Kyiv’s campaign.",
      "publishedAt": "2024-09-25T04:09:50Z",
      "title": "Zelenskyy's victory plan sets Ukraine's terms in a desperate war against Russia",
      "url": "https://apnews.com/d5e0d1aa9bf7d17e13609c2564d26489",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42314674f05849d982f79f5b4c03328b/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — Ukraine’s president dismissed the notion of peace talks with Moscow on Tuesday, calling instead for unspecified global “action” to force Russia into peace for invading his country and to comply with the U.N.",
      "publishedAt": "2024-09-25T01:48:16Z",
      "title": "Ukraine's president calls for unspecified global 'action' to force Russia into peace",
      "url": "https://apnews.com/db3954c29fa826601f42101e05fd6db0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b0b2208a36a48699e179f418af30b85/2816.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and LUIS ALBERTO CRUZ",
      "description": "Tropical Storm Helene was rapidly strengthening in the Caribbean Sea and expected to become a hurricane Wednesday while moving north along Mexico's coast toward the U.S., prompting residents to evacuate, schools to close and officials to declare emergencies in Florida and Georgia.",
      "publishedAt": "2024-09-25T04:45:17Z",
      "title": "Tropical Storm Helene strengthens as hurricane warnings cover parts of Florida and Mexico",
      "url": "https://apnews.com/a953d0a51d219226f7d76178af2d3f4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/916e006061924a2782ec76ac28e3cdb2/1592.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "INDIANA, Pa. (AP) — From former President Donald Trump to Ohio Senate candidate Bernie Moreno, male Republican candidates are struggling to speak to female voters, using language criticized as tone deaf and patronizing as they try to win support from women and speak to issues important to them.",
      "publishedAt": "2024-09-25T04:09:37Z",
      "title": "Trump tells women he 'will be your protector' as GOP struggles with outreach to female voters",
      "url": "https://apnews.com/697ce355f7386bfd192b99bb00322705",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b04b713f1d6473b9e8a00de8b2e3e3e/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A man who authorities say staked out Donald Trump for 12 hours on his golf course in Florida and wrote of his desire to kill him was indicted Tuesday on an attempted assassination charge.",
      "publishedAt": "2024-09-24T22:17:03Z",
      "title": "Man who staked out Trump at Florida golf course charged with attempting an assassination",
      "url": "https://apnews.com/b4c956e1a126e4acfb3c4eae0c06ddb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a7e29ac38c344589ba6d0bf450c316e/2187.jpeg"
    },
    {
      "author": "DAVID KOENIG, LINDSEY WASSON and MANUEL VALDES",
      "description": "SEATTLE (AP) — Boeing is giving the union representing striking factory workers more time to consider a revised contract offer with bigger pay increases and more bonus money, but it was unclear Tuesday whether the union would schedule a ratification vote on the proposal.",
      "publishedAt": "2024-09-24T19:31:41Z",
      "title": "Boeing gives union more time to vote on an offer that's getting poor reviews from striking workers",
      "url": "https://apnews.com/cb3de0dc02082efcb0d5f7d6287ea7a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2af84756fd04484f91bded3fcd3f6230/1920.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "MEXICO CITY (AP) — Many Mexicans will feel a deep sense of loss when folksy, charismatic, nationalistic President Andrés Manuel López Obrador leaves office on Sept.",
      "publishedAt": "2024-09-25T04:16:55Z",
      "title": "Mexico's most popular president in decades is retiring. What will he leave behind?",
      "url": "https://apnews.com/55df42c3ebaea69ca2df1d3ccbfe6205",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cae2388df9294c7781e5542cdc8df431/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — Waverly B. Woodson Jr., who was part of the only African American combat unit involved in the D-Day invasion during World War II, spent more than a day treating wounded troops under heavy German fire — all while injured himself.",
      "publishedAt": "2024-09-24T15:39:18Z",
      "title": "80 years after D-Day the family of a Black World War II combat medic receives his medal for heroism",
      "url": "https://apnews.com/55c1b2287617c23c19a5b29893c03789",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a61a0b6048c94387bfa6965ee8f7db75/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}