{
  "articles": [
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump has identified what he sees as an all-purpose fix for what ails America: Slap huge new tariffs on foreign goods entering the United States.On Monday, Trump sent shockwaves across the nation's northern and southern borders, vowing sweeping new tariffs on Mexico, Canada, as well as China, as soon as he takes office as part of his effort to crack down on illegal immigration and drugs.",
      "publishedAt": "2024-11-26T16:29:02Z",
      "title": "Trump’s latest tariff plan aims at multiple countries. What does it mean for the US?",
      "url": "https://apnews.com/0fb9740a4b42c734c75b64ba09c901d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2ef4fb52d7b468a820e2acbe0de75ca/3000.jpeg"
    },
    {
      "author": "SIMINA MISTREANU and KEN MORITSUGU",
      "description": "YIWU, China (AP) — Visitors who bought fridge magnets at Times Square or other tourist hotspots around New York in recent years most likely were purchasing the work of Du Jing or one of her fellow exporters in a small Chinese city that supplies the U.S.",
      "publishedAt": "2024-11-26T13:52:32Z",
      "title": "Trump's sharp tariff hikes could speed up China's shift to new markets and offshore factories",
      "url": "https://apnews.com/98701fd34985e232ae61e4f9aa4c6540",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ed662aa205940f0b748c180eb25ce89/1920.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — President Claudia Sheinbaum suggested Tuesday that Mexico could retaliate with tariffs of its own, after U.S. President-elect Donald Trump threatened to impose 25% import duties on Mexican goods if the country doesn’t stop the flow of drugs and migrants across the border.",
      "publishedAt": "2024-11-26T14:23:04Z",
      "title": "Mexico suggests it would impose its own tariffs to retaliate against any Trump tariffs",
      "url": "https://apnews.com/fac0b0c6ee8c425a928418de7332b74a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7220243d9664ce9980222320482d50c/2410.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT, MAYA SWEEDLER, PARKER KAUFMANN and HUMERA LODHI",
      "description": "It’s a daunting reality for Democrats: Republican Donald Trump's support has grown broadly since he last sought the presidency.",
      "publishedAt": "2024-11-26T16:04:28Z",
      "title": "Trump won about 2.5M more votes than in 2020, some in unexpected places",
      "url": "https://apnews.com/79f4495b4a0d2039a0a92b5dbdceb7aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70139fa7565e48b68348d1515e9cf1e4/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Israeli warplanes struck central Beirut and the city's southern suburbs on Tuesday, raising smoke over the Lebanese capital ahead of a planned vote by Israel's leadership on whether to accept a U.S.-brokered ceasefire aimed at ending more than a year of fighting with Hezbollah militants.",
      "publishedAt": "2024-11-26T12:36:43Z",
      "title": "Israel ramps up strikes on Beirut as its leadership prepares to vote on ceasefire with Hezbollah",
      "url": "https://apnews.com/aa165645d900a3d681ad127e05b0c561",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a98110970054a0b9ef2b48bf2041148/1920.jpeg"
    },
    {
      "author": "SALLY ABOU AL JOUD",
      "description": "BEIRUT (AP) — Carol Zeghayer gripped her IV as she hurried down the brightly lit hallway of Beirut’s children’s cancer center. The 9-year-old's face brightened when she spotted her playmates from the oncology ward.",
      "publishedAt": "2024-11-26T14:59:35Z",
      "title": "Childhood cancer patients in Lebanon must battle disease while under fire",
      "url": "https://apnews.com/15734faad510f820b6cf4947a4e9e8a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/331e8db0727a4fd0b15e232e04f75733/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — Millions of Americans with obesity would be eligible to have popular weight-loss drugs like Wegovy or Zepbound covered by Medicare or Medicaid under a new rule the Biden administration proposed Tuesday morning.",
      "publishedAt": "2024-11-26T10:16:27Z",
      "title": "Biden proposes Medicare and Medicaid cover costly weight-loss drugs for millions of obese Americans",
      "url": "https://apnews.com/caaa2f888435af1d32bedb83e9ddbc0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55f3ae2339a341439771c497c5c09e92/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Russia launched 188 drones against most regions of Ukraine in a nighttime blitz, the Ukrainian air force said Tuesday, describing it as a record number of drones deployed in a single attack.",
      "publishedAt": "2024-11-26T10:02:12Z",
      "title": "Ukraine says Russian attack sets a new record for the number of drones used",
      "url": "https://apnews.com/4d388b0a02fc3fc785b1a67a6a22ebae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/495219fe56b84663986119e09280a561/2000.jpeg"
    },
    {
      "author": "GISELA SALOMON",
      "description": "MIAMI (AP) — Cuba’s at one of its lowest points since the 1959 revolution, with nationwide scarcity fueling massive emigration, occasional protests and government crackdowns.",
      "publishedAt": "2024-11-26T14:47:04Z",
      "title": "Presidents have used immigration 'parole' since the 1950s. Now it could disappear under Trump",
      "url": "https://apnews.com/bdb62fd4883252b81b4cb3122dc57301",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9b830a9070d47ac8e241a81a43b62ed/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "People with HIV who need a kidney or liver transplant will be able to receive an organ from a donor with HIV under a new rule announced Tuesday by U.S.",
      "publishedAt": "2024-11-26T14:38:20Z",
      "title": "New rule allows HIV-positive organ transplants",
      "url": "https://apnews.com/5392b80df9c54b3799605483ce00d2dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec04afa4e37e49feb4b0a3218379ea91/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}