{
  "articles": [
    {
      "author": null,
      "description": "Pakistan has test-fired a ballistic missile as tensions with India spiked over last week’s deadly attack on tourists in the disputed Kashmir region. The surface-to-surface missile has a range of about 280 miles, the Pakistani military said. The launch of the Abdali Weapon System on Saturday was aimed at ensuring the “operational readiness of troops and validating key technical parameters,” including the missile’s advanced navigation system and enhanced manoeuvrability features, according to a statement from the military. Pakistan’s President Asif Ali Zardari and Prime Minister Shehbaz Sharif congratulated the scientists, engineers and those behind the successful missile test.",
      "publishedAt": "2025-05-03T08:21:05Z",
      "title": "Pakistan test fires ballistic missile as tensions with India spike after Kashmir gun massacre",
      "url": "https://apnews.com/article/paksitan-india-ballistic-missile-kashmir-tensions-70ad575139eeef3673c0c99cbed30302",
      "urlToImage": "https://dims.apnews.com/dims4/default/055ad38/2147483647/strip/true/crop/6384x3591+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2Ffb%2F165e80b8f7e94187b72ae22cfb9a%2F3085fefe176143e7b329c054267b08d8"
    },
    {
      "author": "Sam Mednick, Lee Keath",
      "description": "Israel has blocked aid from entering Gaza for two months and says it won’t allow food, fuel, water or medicine into the besieged territory until it can prevent Hamas and other militants from siphoning it away from Palestinian civilians. But officials from the U.N. and aid groups say proposals Israel has floated to use its military to distribute vital supplies are untenable. They are problematic, these officials say, because they allow military and political objectives to impede humanitarian goals, put restrictions on who is eligible to give and receive aid, and could force large numbers of Palestinians to move — which would violate international law.",
      "publishedAt": "2025-05-03T05:15:33Z",
      "title": "Groups fear Israeli proposal for controlling aid in Gaza will forcibly displace people",
      "url": "https://apnews.com/article/gaza-aid-displacement-humanitarian-crisis-ddcd504e37edeb52ef70772a70e76941",
      "urlToImage": "https://dims.apnews.com/dims4/default/41aae50/2147483647/strip/true/crop/7669x4314+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F09%2Fb246b4d46d1ce2e4c7342d571e2d%2Ffd080e0692d743899cc02f95445649ab"
    },
    {
      "author": "Bassem Mroue",
      "description": "Four days of clashes between pro-government gunmen and members of a minority sect in Syria have left nearly 100 people dead and raised fears of deadly sectarian violence. The deeply divided country is trying to emerge from decades of dictatorship. The clashes are the worst between forces loyal to the government and Druze fighters since the fall of President Bashar Assad in early December, whose family had ruled Syria with an iron grip for more than five decades. The situation between the two sides has been tense for weeks and a smaller clash broke out in March in a suburb of Damascus.",
      "publishedAt": "2025-05-02T17:56:02Z",
      "title": "What is behind the latest round of clashes in Syria between Druze and pro-government gunmen",
      "url": "https://apnews.com/article/syria-druze-government-clashes-assad-829a35ecc50c7a2f56b61a692bd45c37",
      "urlToImage": "https://dims.apnews.com/dims4/default/67be3cc/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F0d%2F0909e96e1af2cd3b32c7b6912ea4%2F082881ade14f4f0d984a6b9c44de5138"
    },
    {
      "author": "Rod McGuirk",
      "description": "Australians are voting in Australia’s general election as Prime Minister Anthony Albanese and his rival Peter Dutton ended campaigning along the east coast. Both Albanese and Dutton began Saturday in the electorally-crucial city of Melbourne. Albanese returned home to Sydney and Dutton to his hometown of Brisbane to vote. Albanese’s center-left Labor Party is seeking a second three-year term. Dutton wants to become the first opposition leader to oust a first-term government since 1931, when Australians were reeling from the Great Depression. The election is taking place against a backdrop of what both sides of politics describe as a cost of living crisis.",
      "publishedAt": "2025-05-02T22:04:34Z",
      "title": "Australians vote in election with high prices and shortage of housing major issues",
      "url": "https://apnews.com/article/australia-election-albanese-dutton-251063e866513dfa48b773fb4d6b0d29",
      "urlToImage": "https://dims.apnews.com/dims4/default/d6d926d/2147483647/strip/true/crop/3229x1816+0+168/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fb2%2Fb393301a1742a069b09a89840dcf%2Ff6ef0e95342d4a8780460d5808631de5"
    },
    {
      "author": null,
      "description": "Russia launched a major drone assault on the Ukrainian city of Kharkiv, wounding 47. Ukraine reported 183 drones and decoys fired, with 150 intercepted or jammed, alongside two ballistic missiles. President Volodymyr Zelenskyy urged stronger support from Ukraine's allies. Russia said it downed 170 Ukrainian drones. Four people were injured in a Ukrainian drone strike on the Black Sea port city of Novorossiysk. The attacks follow a recent U.S.-Ukrainian deal granting American access to Ukraine’s mineral resources.",
      "publishedAt": "2025-05-03T07:24:19Z",
      "title": "Russian drone attack wounds 47 in Ukraine’s second city, Kharkiv",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-kharkiv-4396be6394f46a6320cac4bf82be2941",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6f720b/2147483647/strip/true/crop/2000x1125+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F8a%2Ff964c0354c0fc89a107b67da90ae%2F68cd7d548a32432ca38395e4ca477840"
    },
    {
      "author": "Hyung-Jin Kim",
      "description": "South Korea’s main conservative party has nominated former Labor Minister Kim Moon Soo as its presidential candidate. The People Power Party says Kim won the party ticket to run for the June 3 election during a party primary that ended Saturday. Observers say Kim will likely try to align with former Prime Minister Han Duck-soo to unify behind one of them in a bid to boost prospects for a conservative win against liberal front-runner Lee Jae-myung. The election was arranged after conservative President Yoon Suk Yeol was removed from office in early April over his ill-fated imposition of martial law.",
      "publishedAt": "2025-05-03T06:51:58Z",
      "title": "South Korea’s main conservative party nominates Kim Moon Soo as its presidential candidate",
      "url": "https://apnews.com/article/south-korea-election-conservative-party-nominated-kim-moon-503473489b9daeb3785ab3ff9d5dee8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/5cf644d/2147483647/strip/true/crop/2546x1432+0+132/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F5c%2Fc3bfcb68d728ca2af4bdd2a94da9%2Fc3645f68a24542b7850bf09f925d83dc"
    },
    {
      "author": "Darlene Superville, Julie Carr Smyth",
      "description": "President Donald Trump has dispatched Vice President JD Vance all over the world in the opening months of the administration. Vance took a five-day trip to Europe, a hastily reorganized trek to Greenland and toured Italy and India. The vice president is usually accompanied by his wife, Usha, and their three children, and he routinely mixes business with cultural excursions, pairing sometimes prickly official remarks with lighter events. Experts say such trips aren't unusual. His quick shifts between work and leisure may be emblematic of his generation.",
      "publishedAt": "2025-05-03T04:01:11Z",
      "title": "VP Vance's global trips blend diplomacy, deals, soft power and family time",
      "url": "https://apnews.com/article/vice-president-vance-travel-europe-india-greenland-fa3297665373eefe988f552ca0e0e51a",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c917d8/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F9b%2F6011715043ec0c0de6e45f23dd15%2F8c247e1ac9254e05b3f21554e42167fe"
    },
    {
      "author": "Nicole Winfield",
      "description": "Vatican workers have installed the simple stove in the Sistine Chapel where ballots will be burned during the upcoming conclave to elect a new pope. The Holy See released a video Saturday of the preparations for the May 7 conclave, which include installing the stove and a false floor in the frescoed Sistine Chapel to make it even. The footage also showed workers lining up simple wooden tables where the cardinals will sit and cast their votes. The preparations are all leading up to the solemn pageantry of the start of the conclave to elect a successor to Pope Francis, who died April 21 at age 88.",
      "publishedAt": "2025-05-03T06:16:12Z",
      "title": "Vatican workers install Sistine Chapel stove where ballots are burned during conclave to elect pope",
      "url": "https://apnews.com/article/vatican-conclave-sistine-chapel-stove-89ce55cc96c1a69c613435e47740c335",
      "urlToImage": "https://dims.apnews.com/dims4/default/6bf21b3/2147483647/strip/true/crop/6250x3516+0+326/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F0f%2Faf244e980153465ead3f022ea213%2F78c23151d5bc4458badb878f3540d5b2"
    },
    {
      "author": "Maria Grazia Murru, Sylvia Hui",
      "description": "Growing numbers of people are making bets on next week’s conclave to elect the next pope. From cash bets on websites to online games and casual wagers among friends, experts and participants say the popularity of gambling and guessing on the future of the papacy is increasing worldwide. Bookmakers cite notable interest globally, with hundreds of thousands of people from some 140 countries checking odds. They note special eagerness in the U.K., Ireland and U.S. In Italy, betting on the papal election is forbidden. But a game called Fantasy Pope has become a hit. Players choose a team of cardinals, mimicking popular fantasy football and soccer leagues. There's no cash prize, but the co-founder says it creates fun around the curiosity of the event.",
      "publishedAt": "2025-05-03T05:58:47Z",
      "title": "Betting on the next pope gains popularity ahead of conclave",
      "url": "https://apnews.com/article/pope-conclave-betting-online-game-bd5f5cd3ee061ce544e3834f5b7bf188",
      "urlToImage": "https://dims.apnews.com/dims4/default/ac87da9/2147483647/strip/true/crop/7000x3937+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2Ff9%2F32de8be15ff874430aab125f4b26%2F4b822a5b443749bd9022554b3f5c0255"
    },
    {
      "author": "Andrew DeMillo",
      "description": "May the 4th be with you. “Star Wars” fans around the world are celebrating the space epic and its surrounding franchise this weekend through an unofficial, fan-made holiday. A sly nod to one of the most popular catchphrases in the films, May the 4th is known as Star Wars Day and has been embraced by businesses and communities over the years. The May the 4th phrase appeared as early as 1979 in a British political ad and has exploded in recent years. The day is being marked with events ranging from special bobbleheads to a daylong celebration in a town sharing the first film's name.",
      "publishedAt": "2025-05-03T04:04:51Z",
      "title": "Why is Star Wars Day celebrated on May the 4th?",
      "url": "https://apnews.com/article/star-wars-day-may-4th-holiday-ea1b5b43b00c23f53294dc159da2bae9",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d5d75b/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F3d%2Fd94a80543f7a2732d1d2ed1c8deb%2Ffe785274e1614b5690ead84e1be86c39"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}