{
  "articles": [
    {
      "author": null,
      "description": "The German government says that Ukrainian President Volodymyr Zelenskyy will visit Berlin on Wednesday to join Chancellor Friedrich Merz for talks with European and U.S. leaders ahead of the Trump-Putin summit later this week. Merz has convened a series of virtual meetings on Wednesday in an attempt to have the voice of European and Ukraine’s leaders heard ahead of a summit that they have been sidelined from. Zelenskyy is due to meet with European leaders first, to prepare for a virtual call with U.S. President Donald Trump and Vice President JD Vance about an hour later.",
      "publishedAt": "2025-08-13T07:07:59Z",
      "title": "Zelenskyy to visit Berlin for meetings ahead of Trump-Putin summit",
      "url": "https://apnews.com/article/russia-ukraine-war-berlin-talks-trump-zelenskyy-merz-9f613b905f81af71920f754da503657a",
      "urlToImage": "https://dims.apnews.com/dims4/default/55d4614/2147483647/strip/true/crop/5279x2969+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F43%2F60e5d3759a99474de40d51af6570%2F03c38a734df54128bb9c578e96e8a2c6"
    },
    {
      "author": null,
      "description": "Wildfires are raging across southern Europe, killing at least three people in Spain, Turkey and Albania. Thinly-stretched crews are fighting to contain blazes after weeks of searing heat. A nightlong battle to protect the perimeter of Greece’s third-largest city, Patras, has so far failed to contain the gale-fueled blaze. In southern Albania a wildfire caused explosions after detonating buried World War II-era artillery shells. Officials said Wednesday an 80-year-old man died in one blaze south of the capital, Tirana. A firefighting volunteer died in Spain, while a forestry worker was killed in southern Turkey.",
      "publishedAt": "2025-08-13T09:03:47Z",
      "title": "At least 3 dead and thousands displaced as wildfires rage across southern Europe",
      "url": "https://apnews.com/article/wildfires-europe-greece-spain-albania-turkey-6a81120e83b8c24551948f6923728866",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed9f5f2/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2F91%2F7a4812ab1c66fa8d6b6951714d58%2Fde51d78ffeb4433e9339759ea456d253"
    },
    {
      "author": null,
      "description": "Typhoon Podul has made landfall in southeastern Taiwan, where schools and government offices are closed to wait out the storm. Authorities are also on alert for heavy rains that could damage agriculture. On Wednesday, the storm made landfall around noon, losing speed as it moved westward across the island toward China. High waves and winds were reported, but no major rain yet and the capital Taipei in the north was windy but sunny. Flights were delayed or canceled in affected areas. Recovery crews are on alert due to recent heavy rains that caused power outages and major damage to agriculture.",
      "publishedAt": "2025-08-13T03:51:42Z",
      "title": "Typhoon Podul makes landfall in Taiwan",
      "url": "https://apnews.com/article/taiwan-typhoon-crop-damage-7ac077d3644bb29e9ba43467a0c77c3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/ab88de2/2147483647/strip/true/crop/3097x1742+0+161/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2F30%2F0e6f5c6c9d15dd85dfc7a0de50d7%2F171f5f67cbd6486c990835f6c263e428"
    },
    {
      "author": null,
      "description": "Billionaire SpaceX, Tesla and X owner Elon Musk says he plans to sue Apple for not featuring X and its Grok artificial intelligence chatbot app in its top recommended apps in its App Store. Musk posted the comments on X, saying, “Hey @Apple App Store, why do you refuse to put either X or Grok in your ‘Must Have’ section when X is the #1 news app in the world and Grok is #5 among all apps?\" He added that “Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation. xAI will take immediate legal action.”",
      "publishedAt": "2025-08-12T05:16:56Z",
      "title": "Musk says he plans to sue Apple for not featuring X or Grok among its top apps",
      "url": "https://apnews.com/article/musk-apple-twitter-lawsuit-antitrust-app-c60e3690d2e232e0cd0c41cbe86f66be",
      "urlToImage": "https://dims.apnews.com/dims4/default/32823a6/2147483647/strip/true/crop/7681x4321+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F95%2F2d45a1779cc63a588d5a2f4abd68%2F75024abe5e4645f495e49bc95ea27402"
    },
    {
      "author": null,
      "description": "Sections of Alaska’s capital city are bracing for the arrival of what could be record floodwaters due to rainwater and snowmelt flowing downstream from a basin dammed by the Mendenhall Glacier. Residents in some parts of Juneau have evacuated. Flooding from the basin has become an annual concern for residents. On Tuesday, officials confirmed water had started escaping the ice dam and was flowing downstream, with flooding expected into Wednesday. In past years the flooding has swept away houses and swamped hundreds of homes. The Mendenhall Glacier is a thinning, retreating glacier that acts as a dam for Suicide Basin, which fills each spring and summer with rainwater and snowmelt.",
      "publishedAt": "2025-08-13T05:01:23Z",
      "title": "Alaska's capital braces for floodwaters from Mendenhall Glacier",
      "url": "https://apnews.com/article/alaska-juneau-mendenhall-glacier-flooding-55b9de835689f312b99805753ebe9a14",
      "urlToImage": "https://dims.apnews.com/dims4/default/aef5491/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2F21%2F974960b61019f0bed48f009492c5%2Fa0dc0b93e35b40f08924e4ff5de31844"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu is hinting that ceasefire efforts are now focused on a comprehensive deal that would release the remaining hostages in Gaza all at once. Arab officials told The Associated Press last week that mediators Egypt and Qatar are preparing a new framework for a deal that would include the release of all hostages in one go in return for a lasting ceasefire and the withdrawal of Israeli forces. The long-running indirect talks appeared to break down last month. But Egyptian state-run media reports that a Hamas delegation arrived in Cairo for talks on Tuesday.",
      "publishedAt": "2025-08-12T17:15:02Z",
      "title": "Netanyahu hints that Gaza ceasefire talks now focus on the release of all hostages at once",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-08-12-2025-1735f5b4ee74d3d531498c1ee8a5f56c",
      "urlToImage": "https://dims.apnews.com/dims4/default/5bae07c/2147483647/strip/true/crop/7112x4001+0+370/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2Fc0%2F0955ce490def09b34d5b378e9141%2F5cbae11d12094e71aa401fa2ae861e83"
    },
    {
      "author": null,
      "description": "Shares have advanced in Europe and Asia after the U.S. stock market rallied to records when data showed inflation across the United States improved slightly last month. U.S. futures also gained, while benchmarks in Tokyo and several other Asian markets jumped more than 1%. A recent rally in share prices has been driven partly by relief over an extended truce in President Donald Trump's trade war with China, and partly by persisting hopes the Federal Reserve will cut interest rates. On Tuesday, the S&P 500 rose 1.1% and topped its all-time high. The Dow industrials jumped 1.1% and the Nasdaq composite surged 1.4% to set its own record. Lower rates can help boost the economy and investment prices.",
      "publishedAt": "2025-08-13T05:13:58Z",
      "title": "World shares charge higher after US stocks rally to records",
      "url": "https://apnews.com/article/stocks-markets-inflation-73a3ac1beb306de02617ce7d6a836f89",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9c2a0f/2147483647/strip/true/crop/4235x2382+0+220/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fad%2Fa27f613027b3b45cab6fc34b6951%2F0e24522052b143da82a0ba3737e162ff"
    },
    {
      "author": null,
      "description": "Officials are still working to determine the cause of an explosion that rocked a steel plant outside Pittsburgh, leaving two dead and 10 injured. The blast occurred Monday at the Clairton plant in the Mon Valley. Emergency services say a fire started late morning, and a rescue effort continued into the night. The plant is still partially operational. Allegheny Health Network treated seven patients, discharging five. The rumbling from the explosion, and several smaller blasts that followed, was felt through the community about 15 miles southeast of Pittsburgh. U.S. Steel, now part of Nippon Steel, has promised a full investigation.",
      "publishedAt": "2025-08-12T04:16:10Z",
      "title": "Officials investigate what caused Pennsylvania steel plant explosion",
      "url": "https://apnews.com/article/pennsylvania-steel-plant-explosion-c0f27dce378e1f6654682c5479620196",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dc7a22/2147483647/strip/true/crop/7974x4485+0+415/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F35%2Fc707d413a64158f99433dc75f23f%2F5c6b65a5eabf44d6bfb62fb79595e1d9"
    },
    {
      "author": null,
      "description": "Paramount and UFC have announced a billion-dollar rights deal, marking a significant shift for the fight company. UFC CEO Dana White is set to meet with Donald Trump to discuss a proposed Fourth of July fight card at the White House. The seven-year deal with Paramount, starting in 2026, is worth $1.1 billion annually. It will feature all UFC content on Paramount+ and select events on CBS. This deal simplifies offerings for fans and could impact fighter pay. White is optimistic about the future, aiming to elevate UFC's status in the sports world.",
      "publishedAt": "2025-08-12T13:25:35Z",
      "title": "A UFC fight at the White House? Dana White says it's happening",
      "url": "https://apnews.com/article/ufc-tko-paramount-ultimate-fighting-49b2c5562755178e327079e99ce44e39",
      "urlToImage": "https://dims.apnews.com/dims4/default/76aa066/2147483647/strip/true/crop/5097x2867+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2Ff4%2Fe532b7aeac850fdc04383f04a901%2F6cbd6b502ec9463e8c46bad0ddf693ff"
    },
    {
      "author": null,
      "description": "Washington, D.C., Mayor Muriel Bowser has responded to President Donald Trump's plan to take over the Metropolitan Police Department and call in the National Guard. Bowser emphasized that crime has been dropping and Trump's state of emergency doesn't match the numbers. She acknowledged that the city has little choice but to comply. Bowser linked the takeover to the larger issue of D.C. statehood, stating that limited autonomy makes the city vulnerable. Trump's decision fits a pattern of using emergency declarations to rule by executive order. Bowser maintains that violent crime has decreased, a claim supported by Trump's former U.S. attorney nominee.",
      "publishedAt": "2025-08-12T04:02:21Z",
      "title": "Washington, D.C., grapples with notion of Trump federal intervention",
      "url": "https://apnews.com/article/washington-dc-takeover-trump-mayor-crime-48b8c936a19531cacf6bfb75e2f32231",
      "urlToImage": "https://dims.apnews.com/dims4/default/417b2b1/2147483647/strip/true/crop/5061x2847+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F39%2F4c600552f7f6b04ebfe148c13a86%2F9997c994e7ef427b9c88953d4de9358d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}