{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A judge agreed Friday to postpone Donald Trump’s sentencing in his hush money case until after the November election, granting him a hard-won reprieve as he navigates the aftermath of his criminal conviction and the homestretch of his presidential campaign.",
      "publishedAt": "2024-09-06T17:12:42Z",
      "title": "Judge delays Donald Trump’s sentencing in hush money case until after November election",
      "url": "https://apnews.com/be5a6fd3481055187543236c8dd3b045",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b56c621d08f4412b33ea70984c20dd5/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, MICHELLE L. PRICE and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Shortly after appearing in court for an appeal of a decision that found him liable for sexual abuse, Donald Trump stepped in front of television cameras Friday and brought up a string of past allegations of other acts of sexual misconduct, potentially reminding voters of incidents that were little-known or forgotten.",
      "publishedAt": "2024-09-06T15:06:37Z",
      "title": "Trump assails women who accused him of misconduct, days before his debate with Harris",
      "url": "https://apnews.com/5f5b808c6befaeaacc1d9c2071ebd631",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0deee8f4ec444328c7244e1a4576dab/3000.jpeg"
    },
    {
      "author": "JEFF AMY and JEFF MARTIN",
      "description": "WINDER, Ga. (AP) — The 14-year-old suspect in a shooting that killed four people at a Georgia high school and his father, who was arrested for allowing his son to have a weapon, will stay in custody after their lawyers decided not to seek bail Friday.",
      "publishedAt": "2024-09-06T04:44:27Z",
      "title": "Teen charged in Georgia school shooting and his father to stay in custody after hearings",
      "url": "https://apnews.com/e13b91e80c7fbefd7e3104e710afeb8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/150875a3ea284325bf7abd17b47f1091/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Just a couple of weeks ago, a special panel of Georgia state senators convened to study potential laws aimed at keeping firearms safely locked up and out of the hands of children.",
      "publishedAt": "2024-09-06T13:21:36Z",
      "title": "Georgia school shooting stirs debate about safe storage laws for guns",
      "url": "https://apnews.com/cbcf464d68dcf8266c6a40d84d7176c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b4c6fbd765549409b7fefb3c20f38ce/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and AREF TUFANA",
      "description": "NABLUS, West Bank (AP) — Israeli soldiers killed an American woman participating in an anti-settlement protest in the West Bank on Friday, another protester who witnessed the shooting told The Associated Press.",
      "publishedAt": "2024-09-06T13:07:36Z",
      "title": "Israeli soldiers shoot and kill an American woman during a West Bank protest, witness says",
      "url": "https://apnews.com/b2f1c741cea3d56eb1a339240dbf036e",
      "urlToImage": ""
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — Vice presidential candidate Tim Walz said Thursday that those protesting American support for Israel's war against Hamas in Gaza are doing so for “all the right reasons,\" as the Democratic ticket looks to balance its support for Israel with the humanitarian plight of civilians in the war-torn enclave.",
      "publishedAt": "2024-09-06T17:16:15Z",
      "title": "Walz says Gaza demonstrators are protesting for 'all the right reasons' while condemning Hamas",
      "url": "https://apnews.com/fd797e42ad3c919026c5341ae4297500",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/649594cf0dab403b81c3627ba7d6d6b7/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, ALANNA DURKIN RICHER and CAL WOODWARD",
      "description": "WASHINGTON (AP) — Inside Washington’s federal courthouse, there’s no denying the reality of Jan. 6, 2021. Day after day, judges and jurors silently absorb the chilling sights and sounds from television screens of rioters beating police, shattering windows and hunting for lawmakers as democracy lay under siege.",
      "publishedAt": "2024-09-06T07:00:26Z",
      "title": "January 6 crimes did happen. Court cases, video and thousands of pages of evidence prove it",
      "url": "https://apnews.com/4839d3db7a153541fd9402068c870d9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8bfc2e909104a9f831344c9a7b1b0ec/3000.jpeg"
    },
    {
      "author": "JOHN RABY",
      "description": "CLARKSBURG, W.Va. (AP) — A former Mafia hitman already serving life in prison was sentenced to 25 years Friday in the 2018 fatal prison bludgeoning of notorious Boston gangster James “Whitey” Bulger.",
      "publishedAt": "2024-09-06T05:01:33Z",
      "title": "An ex-Mafia hitman serving life gets more time in the slaying of gangster James ‘Whitey’ Bulger",
      "url": "https://apnews.com/9487e4e369ffb12f639322d0f9c6baf0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0883131d29664f3e89fa1d92d008e216/2860.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — It could be a well-rehearsed zinger, a too-loud sigh — or a full performance befuddled enough to shockingly end a sitting president's reelection bid.",
      "publishedAt": "2024-09-06T04:00:44Z",
      "title": "From stirring to cringey: Memorable moments from past presidential debates",
      "url": "https://apnews.com/307d382833641056e325a8892208d97e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c010da134ffd4d70bcc183bdd0ca7eb8/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Hiring by America’s employers picked up a bit in August from July’s tepid pace, and the unemployment rate dipped for the first time since March in a sign that the job market may be cooling but remains sturdy.",
      "publishedAt": "2024-09-06T04:01:19Z",
      "title": "Sluggish US jobs report clears the way for Federal Reserve to cut interest rates",
      "url": "https://apnews.com/bac1b453d3873d5f23f2061344d28fd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8c42606e515464d9db146581a62ab23/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}