{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel will take “overall security responsibility” in Gaza indefinitely after its war with Hamas, Prime Minister Benjamin Netanyahu said, the clearest indication yet that Israel plans to maintain control over the coastal enclave one month into a conflict that has claimed thousands of lives and leveled whole swaths of the territory.",
      "publishedAt": "2023-11-07T07:21:59Z",
      "title": "A month into war, Netanyahu says Israel will have an 'overall security' role in Gaza indefinitely",
      "url": "https://apnews.com/6e1425d218de6a73f8a51e4c036cfd39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6538427c017a4d02a0b91b8efe34a9cd/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and KAREEM CHEHAYEB",
      "description": "BUREIJ REFUGEE CAMP, Gaza Strip (AP) — What was once Gaza’s busiest thoroughfare has become a terrifying escape route for Palestinian civilians fleeing combat on foot or on donkey carts. On their way south, those running for their lives said they raised their hands and waved white flags to move past Israeli tanks along the four-lane highway.",
      "publishedAt": "2023-11-07T05:29:59Z",
      "title": "Civilians fleeing northern Gaza's combat zone report a terrifying journey on foot past Israeli tanks",
      "url": "https://apnews.com/656545c0bd132d5dc2b6d108687ff13e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d45e60fa507d45969963884c1b7b7217/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, MICHAEL R. SISAK, JENNIFER PELTZ and ERIC TUCKER",
      "description": "NEW YORK (AP) — A defiant Donald Trump sparred with a New York judge and slammed the state attorney general suing him Monday, using the witness stand at his civil fraud trial to defend his riches and lash out at a case that imperils his real estate empire.",
      "publishedAt": "2023-11-06T05:30:28Z",
      "title": "Trump lashes out from the witness stand at judge, NY attorney general as he testifies in fraud trial",
      "url": "https://apnews.com/dca74420da0f92ee9bc9caff7a92c3b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9271a1ad1a284aa2a9420ac57ba52f5b/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — Ohio becomes the latest flashpoint on Tuesday in the nation's ongoing battle over abortion access since the U.S. Supreme Court overturned a constitutional right to the procedure last year.",
      "publishedAt": "2023-11-07T05:04:16Z",
      "title": "Ohio is the lone state deciding an abortion-rights question Tuesday, providing hints for 2024 races",
      "url": "https://apnews.com/fe3e06747b616507d8ca21ea26485270",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fd3219dbcf04b9886f6af7476adc6d3/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Death, destruction and despair. For the past month it has reigned on both sides of the border separating Israel and the Gaza Strip.Grief is in the tears of Israelis burying the 1,400 people — mostly civilians, including babies — slain by Hamas militants who stormed into Israel on Oct.",
      "publishedAt": "2023-11-07T04:16:50Z",
      "title": "AP PHOTOS: Death, destruction and despair reigns a month into latest Israel-Gaza conflict",
      "url": "https://apnews.com/0d3960dc03ddd8b4fe3d81111cf177a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d180e96c896f4624a4ea3e5399727601/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "TOKYO (AP) — Fresh from a whirlwind tour of the Middle East, U.S. Secretary of State Antony Blinken shifted his intense diplomacy on the Israel-Hamas war to Asia on Tuesday with an appeal for the Group of Seven leading industrial democracies to forge consensus on how to deal with the crisis.",
      "publishedAt": "2023-11-07T07:58:14Z",
      "title": "Blinken seeks G7 unity on Israel-Hamas war among items on crisis-heavy global agenda",
      "url": "https://apnews.com/834aa74998f4c1fa92f2d3326831345a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/596f5ccfaae34955add4412e89994948/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN and COLLEEN SLEVIN",
      "description": "BRIGHTON, Colo. (AP) — A jury has acquitted a Denver-area police officer of manslaughter, following trial testimony that he put Elijah McClain in a neck hold before the Black man was injected with the powerful sedative ketamine by paramedics and died.",
      "publishedAt": "2023-11-07T09:55:58Z",
      "title": "What to know about Elijah McClain's death and the cases against police and paramedics",
      "url": "https://apnews.com/eb312d1f447cbf00a9ea1eab50ef2039",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b107ddc6b0134ebea7168713c1aa3c03/3000.jpeg"
    },
    {
      "author": "ADAM BEAM and OLGA R. RODRIGUEZ",
      "description": "PARADISE, Calif. (AP) — On the day Paradise burned, Gwen Nordgren stopped her car just long enough to rescue a young woman escaping by foot.By that time on Nov. 8, 2018, the sky was black even though the sun had been up for hours.",
      "publishedAt": "2023-11-07T05:32:02Z",
      "title": "Five years after California's deadliest wildfire, survivors forge different paths toward recovery",
      "url": "https://apnews.com/b4434481c38e6a02e9f2d376ac172b04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/883165fea7fc4114b1a5b10de6c2d8fc/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — WeWork has filed for Chapter 11 bankruptcy protection, marking a stunning fall for the office sharing company once seen as a Wall Street darling that promised to upend the way people went to work around the world.",
      "publishedAt": "2023-11-07T03:55:44Z",
      "title": "WeWork seeks bankruptcy protection, a stunning fall for a firm once valued at close to $50 billion",
      "url": "https://apnews.com/be8c36b9720377334645e37c73d55e6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/570a05bb48af445282851871469f907d/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "Exonerated “Central Park Five” member Yusef Salaam is poised to win a seat Tuesday on the New York City Council, marking a stunning reversal of fortune for a political newcomer who was wrongly imprisoned as a teenager in the infamous rape case.",
      "publishedAt": "2023-11-07T05:20:42Z",
      "title": "Exonerated 'Central Park Five' member set to win council seat as New York votes in local elections",
      "url": "https://apnews.com/0377cedcbd29f424753c9790551a85de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03103718a64f4ca5972938dc7b62df3b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}