{
  "articles": [
    {
      "author": "JOSEPH KRAUSS and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu joined with a top political rival Wednesday to create a wartime Cabinet to oversee the fight to avenge the gruesome weekend attack by Hamas militants.",
      "publishedAt": "2023-10-11T04:25:48Z",
      "title": "As strikes devastate Gaza, Israel forms unity government to oversee war sparked by Hamas attack",
      "url": "https://apnews.com/e4ae51a640a3fc04b23ea9561703f874",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a98e44694b6481da8be663e8350a834/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, KEVIN FREKING and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Deeply divided Republicans nominated Rep. Steve Scalise on Wednesday to be the next House speaker but struggled to quickly unify and elect the conservative in a public floor vote after the historic ousting of Rep.",
      "publishedAt": "2023-10-11T04:07:09Z",
      "title": "Republicans nominate Steve Scalise to be House speaker but struggle to unite quickly and elect him",
      "url": "https://apnews.com/b90b887d079a4b58e35da7b213916457",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d46136f1681b439b8dba9d850b469e73/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — The United Auto Workers union significantly escalated its strikes against Detroit Three automakers Wednesday when 8,700 workers walked off their jobs at Ford's Kentucky truck plant.The surprise move about 6:30 p.m.",
      "publishedAt": "2023-10-11T17:13:09Z",
      "title": "Auto workers escalate strike as 8,700 workers walk out at Ford Kentucky Truck Plant in Louisville",
      "url": "https://apnews.com/60f444a85a51b1261b093fdaaae4bdb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3a32c902e5447cd96f95c0cc7cca788/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — Former President Donald Trump on Wednesday defended his record governing the nation for four years without any new wars, and criticized President Joe Biden’s foreign policy as the world watches a war that has already claimed 2,300 lives unfold in Gaza, ignited by Hamas’ attack on Israel.",
      "publishedAt": "2023-10-11T19:23:55Z",
      "title": "Donald Trump attacks President Biden on foreign policy as Israel-Hamas war rages",
      "url": "https://apnews.com/8380c43e9cfcb96b3457bf7e1002b6f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/baab3669c7df45e2adbcf6a3594db8e3/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Federal Reserve officials regarded the U.S. economy’s outlook as particularly uncertain last month, according to minutes released Wednesday, and said they would “proceed carefully” in deciding whether to further raise their benchmark interest rate.",
      "publishedAt": "2023-10-11T18:08:16Z",
      "title": "Federal Reserve minutes: Officials signal cautious approach to rates amid heightened uncertainty",
      "url": "https://apnews.com/03576b04e927b9ebda87f19dd81f68f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c7bf5cce35440aa8251c80ea4407786/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "After serving more than a month of in-school suspension over his dreadlocks, a Black student in Texas was told he will be removed from his high school and sent to a disciplinary alternative education program on Thursday.",
      "publishedAt": "2023-10-11T22:08:59Z",
      "title": "Black student suspended over his hairstyle to be sent to an alternative education program",
      "url": "https://apnews.com/d4c682d334f52eac813d109b7499901e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b710736606d4d7ba5a18ca0e54b8090/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — NASA on Wednesday showed off its first asteroid samples delivered last month by a spacecraft — a jumble of black dust and rubble that's the most ever returned to Earth.",
      "publishedAt": "2023-10-11T16:00:29Z",
      "title": "NASA shows off its first asteroid samples delivered by a spacecraft",
      "url": "https://apnews.com/44952603fedb780e1e45c0e92f2b8585",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e63c23076d1a40639838b25c64348356/1920.jpeg"
    },
    {
      "author": "DAVE CAMPBELL",
      "description": "MINNEAPOLIS (AP) — José Abreu homered for the third time in two games, a two-run rocket in the fourth inning that launched the Houston Astros to their seventh straight AL Championship Series appearance with a 3-2 win that eliminated the Minnesota Twins in Game 4 of their Division Series on Wednesday night.",
      "publishedAt": "2023-10-12T02:07:35Z",
      "title": "José Abreu homers again to power the Astros past the Twins 3-2 and into their 7th straight ALCS",
      "url": "https://apnews.com/dd4b25e553695b17a743215dacceec5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0f9d058516640b5b0b74273cf1d900c/3000.jpeg"
    },
    {
      "author": "EBRAHIM NOROOZI and RAHIM FAIEZ",
      "description": "CHAHAK, Afghanistan (AP) — Another strong earthquake shook western Afghanistan on Wednesday morning after an earlier one killed more than 2,000 people and flattened whole villages in Herat province in what was one of the most destructive quakes in the country’s recent history.",
      "publishedAt": "2023-10-11T01:24:38Z",
      "title": "Another strong earthquake flattens homes and worsens misery in western Afghanistan",
      "url": "https://apnews.com/c0181a41ae82e68892f7ba8ff988a07b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae83ef4018114bfb9153c24d4225b4e5/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA and AMI BENTOV",
      "description": "TEL AVIV, Israel (AP) — One of those taken hostage is a grandmother who learned Arabic in hopes of building bridges with her neighbors. Others include 10 members of an extended family, one an elderly man in a wheelchair who requires hospital care.",
      "publishedAt": "2023-10-11T18:51:38Z",
      "title": "Families in Israel and abroad wait in agony for word of their loved ones taken hostage by militants",
      "url": "https://apnews.com/822b214252a77f3c3556bb71d9ce7c89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1373ff58caf14363ac1c6aead8fb6297/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}