{
  "articles": [
    {
      "author": "AAMER MADHANI, COLLEEN LONG, ZEKE MILLER AND WILL WEISSERT",
      "description": "NEW YORK (AP) — Vice President Kamala Harris made a surprise appearance on “Saturday Night Live” in the final days before the election, playing herself as the mirror-image double of Maya Rudolph's version of her.",
      "publishedAt": "2024-11-02T23:32:43Z",
      "title": "Harris appears on 'Saturday Night Live' as mirror image of Maya Rudolph with election looming",
      "url": "https://apnews.com/f58069ca1db9ec077b092a52bd118ac5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47e48791fae541439b1eca8aeb355b1d/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, JILL COLVIN and DARLENE SUPERVILLE",
      "description": "CHARLOTTE, N.C. (AP) — Democrat Kamala Harris and Republican Donald Trump zeroed in on the Sun Belt on Saturday as they embarked on one last weekend quest to sway every undecided voter in the battleground states.",
      "publishedAt": "2024-11-02T14:31:19Z",
      "title": "Harris and Trump focus on Sunbelt states during final weekend push for votes",
      "url": "https://apnews.com/437e0faf54c19bee5944650166383bfb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49bc3d01e8694577b0e0c5382786a5fa/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE, JULIA FRANKEL and LEE KEATH",
      "description": "JERUSALEM (AP) — They were built to be places of healing. But once again, three hospitals in northern Gaza are encircled by Israeli troops and under fire.Bombardment is pounding around them as Israel wages a new offensive against Hamas fighters that it says have regrouped nearby.",
      "publishedAt": "2024-11-03T04:21:55Z",
      "title": "Still wrecked from past Israeli raids, hospitals in northern Gaza come under attack again",
      "url": "https://apnews.com/7f3d7db74304cbe1b12d2b2e950dec82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfea9e368894445abbdeff20bf77487f/3000.jpeg"
    },
    {
      "author": "ADAM SCHRECK and SAMY MAGDY",
      "description": "JERUSALEM (AP) — An attack on a central Israeli town early Saturday injured 11 people as Iran's supreme leader vowed a punishing response to Israel's attack last week and Israeli airstrikes continued in Gaza and Lebanon.",
      "publishedAt": "2024-11-02T10:55:38Z",
      "title": "Attack on central Israel injures 11 as Iran's leader promises a punishing response",
      "url": "https://apnews.com/f7a3c3f1d6b6ea2c54615a367ffb6ac1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2046a43cfcd24c689ee5c525aa04aa22/3000.jpeg"
    },
    {
      "author": "LUJAIN JO and BASSEM MROUE",
      "description": "BATROUN, Lebanon (AP) — Israeli naval forces captured a senior Hezbollah operative in north Lebanon, an Israeli military official said Saturday, as the conflict between the Iran-backed group and Israel showed few signs of easing.",
      "publishedAt": "2024-11-02T13:51:00Z",
      "title": "Israeli forces capture senior Hezbollah operative in north Lebanon, Israeli military official says",
      "url": "https://apnews.com/e4c2f600d821e8208069703aa1e8a00a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dde7885412f4ee099bbb045b11b4033/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "PAIPORTA, Spain (AP) — The pictures of the smiling toddlers on the wall somehow survived.Most everything else in the daycare — the cradles, the highchairs, the toys — was ruined when a crushing wall of water swept through Paiporta, turning the Valencia municipality of 30,000 into the likely epicenter of Spain's deadliest natural disaster in living memory.",
      "publishedAt": "2024-11-02T10:50:37Z",
      "title": "'It is all in ruins.' The shattered lives of Paiporta at the epicenter of Spain's floods",
      "url": "https://apnews.com/f52e40c9fdf2af44814617948afdb920",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ac00c89b3f249baa1813a2d16c1b068/3000.jpeg"
    },
    {
      "author": "SAFIYAH RIDDLE",
      "description": "MONTGOMERY, Ala. (AP) — The FBI is investigating the death of a Black man in Alabama, who was found hanging in an abandoned house, following a request from a local sheriff amid fears among community members who accuse local law enforcement of longstanding, unchecked misconduct.",
      "publishedAt": "2024-11-02T04:03:57Z",
      "title": "Local sheriff asks FBI to investigate death of Black man found hanging in Alabama",
      "url": "https://apnews.com/2e2222fe1ce9d5e37b67837734fb4339",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e446d733580c481caa03136d3c345b20/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukraine's President Volodymyr Zelenskyy urged its allies to stop “watching” and take steps before North Korean troops deployed in Russia reach the battlefield, and the country's army chief warned that his troops are facing “one of the most powerful offensives” by Moscow since the all-out war started more than two years ago.",
      "publishedAt": "2024-11-02T11:40:44Z",
      "title": "Ukraine's Zelenskyy urges allies to act before North Korean troops reach the front",
      "url": "https://apnews.com/912e5e54ad3170bd77580405c6f97018",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc03e63b9e8942e8a4130ab94aa98da7/3000.jpeg"
    },
    {
      "author": "MARIA CHENG and RUTH ALONGA",
      "description": "GOMA, Congo (AP) — Some health officials say mpox cases in Congo appear to be “stabilizing” — a possible sign that the main epidemic for which the World Health Organization made a global emergency declaration in August might be on the decline.",
      "publishedAt": "2024-11-03T04:01:17Z",
      "title": "Mpox cases in Congo may be stabilizing. Experts say more vaccines are needed to stamp out virus",
      "url": "https://apnews.com/928b3954e0e47f60bbdc8988fe644107",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff4b5468442b4ae1814d4ba4e673a58e/3000.jpeg"
    },
    {
      "author": null,
      "description": "CIUDAD JUAREZ, Mexico (AP) — Nearly 200 families gathered Saturday along a stretch of the U.S.-Mexico border for heartfelt but brief reunions with loved ones they had not seen for years because they live in opposite countries.",
      "publishedAt": "2024-11-02T23:27:43Z",
      "title": "Nearly 200 families separated by US-Mexico border reunite briefly in annual event",
      "url": "https://apnews.com/33c6141bee2d0455d433eea785490110",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f89b40d7de941669a8f0166e181d685/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}