{
  "articles": [
    {
      "author": null,
      "description": "A massive search is stretching into its second day for a man who authorities say posed as a police officer and fatally shot a Democratic state lawmaker in her suburban Minneapolis home. Authorities say the suspect also shot and wounded a second lawmaker. Authorities have identified him as 57-year-old Vance Boelter. Melissa Hortman, a former Minnesota House Speaker, and her husband were fatally shot early Saturday in their Brooklyn Park home. The second state lawmaker, Sen. John Hoffman, and his wife were shot multiple times in nearby Champlin. Gov. Tim Walz has called it “a politically motivated assassination.” The FBI has issued a reward of up to $50,000 for information leading to Boelter's arrest and conviction.",
      "publishedAt": "2025-06-15T04:02:22Z",
      "title": "Authorities still searching for suspect in shooting of 2 Minnesota state lawmakers",
      "url": "https://apnews.com/article/minnesota-lawmakers-shot-8ce70a94c9eb90688baaa1a71faef6cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/7110fa9/2147483647/strip/true/crop/2781x1564+0+145/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F76%2F42e5c295dbd8e15f27ad47e31f10%2F757ac56de9114bbc9bd6b0411b1327a9"
    },
    {
      "author": null,
      "description": "Iran has fired a new wave of missile attacks on Israel, triggering air raid sirens across the country as emergency services reported at least five killed and dozens more wounded in the fourth day of a conflict between the regional foes that showed no sign of slowing. Powerful explosions, likely from Israel’s defense systems intercepting Iranian missiles, rocked Tel Aviv shortly before dawn on Monday. Plumes of black smoke rose into the sky over the major coastal city. The latest salvo comes after a weekend of escalating tit-for-tat attacks between Israel and Iran that raised fears of a wider, more dangerous regional war.",
      "publishedAt": "2025-06-16T06:09:23Z",
      "title": "The Latest: Iran launches a new wave of missile attacks on Israel as conflict enters fourth day",
      "url": "https://apnews.com/article/israel-palestinians-iran-war-latest-06-16-2025-8633d291e79806ac498645ee04e059be",
      "urlToImage": "https://dims.apnews.com/dims4/default/4262bb6/2147483647/strip/true/crop/6121x3443+0+318/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F13%2Faf5d143442c4f33feae3014c1c53%2Fa5b3cea0a7614d9993960723b46d5ca1"
    },
    {
      "author": null,
      "description": "Iran has launched a new wave of missile attacks on Israel, triggering air raid sirens across the country as emergency services reported at least five killed and dozens more wounded in the fourth day of open warfare between the regional foes. Iran announced it had launched some 100 missiles and vowed further retaliation for Israel’s surprise attack on its nuclear program and military leadership, which has killed at least 224 in the country since it began last Friday. In announcing the latest salvo after a weekend of escalating tit-for-tat attacks, Iran’s paramilitary Revolutionary Guard vowed that further rounds of strikes would be “more forceful, severe, precise and destructive than previous ones.”",
      "publishedAt": "2025-06-16T03:22:11Z",
      "title": "Iran renews missile attacks on Israel, killing 5 and wounding dozens",
      "url": "https://apnews.com/article/israel-iran-missile-attacks-nuclear-news-06-16-2025-c98074e62ce5afd4c3f6d33edaffa069",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0d1999/2147483647/strip/true/crop/7008x3942+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2Fd0%2F99fa7dfec960317a8d6039efe3df%2F043ef287fb774cc5961b4fba662da29b"
    },
    {
      "author": null,
      "description": "When U.S. President Donald Trump last came to Canada for a Group of Seven summit, the enduring image was of him seated with his arms folded defiantly as then-German Chancellor Angela Merkel stared daggers at him. If there is a shared mission at this year’s G7 summit, which begins Monday in Canada’s Rocky Mountains, it's a desire to minimize any fireworks at a moment of combustible tensions. Trump already has hit several dozen nations with severe tariffs that risk a global economic slowdown. There's little progress on settling the wars in Ukraine and Gaza and now a new and escalating conflict between Israel and Iran over Tehran’s nuclear program.",
      "publishedAt": "2025-06-16T04:02:29Z",
      "title": "G7 summit opening in Canada with a focus on trade, wars and not riling Trump",
      "url": "https://apnews.com/article/trump-g7-carney-canada-trade-iran-75c17fffe96c9031d8ebb22af923d86c",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec4f4a4/2147483647/strip/true/crop/4592x2583+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F01%2F61389d040cdf8673d4e1e6bb6adc%2Fc0676942a7ed4eed8d8bc518a1e6d97f"
    },
    {
      "author": null,
      "description": "No-bid contracts with politically connected companies have become crucial to the Republican Trump administration’s push for more space to hold immigrants for deportation. Those contracts include one for a now-shuttered private prison in Kansas. An agreement with Tennessee-based private prison firm CoreCivic for reopening a 1,033-bed prison in Leavenworth, Kansas, is part of a surge of contracts issued by U.S. Immigration and Customs Enforcement without seeking competitive bids first. ICE cites a “compelling urgency” for more detention beds for immigrants in the U.S. illegally. ICE's moves have delighted industry analysts on company earnings calls and promised bigger profits but have also drawn criticism. Skeptical city officials argue CoreCivic needs a special use permit.",
      "publishedAt": "2025-06-16T10:57:34Z",
      "title": "ICE using no-bid contracts, boosting big firms, to get more detention beds",
      "url": "https://apnews.com/article/immigration-detention-centers-ice-deportations-trump-e92b67a388f041b84593d7a29fd93c54",
      "urlToImage": "https://dims.apnews.com/dims4/default/8aa7679/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2Fa0%2F69cc03842c6e2fecbe1de1c102e9%2F76658cb275544016832d58a406d9571a"
    },
    {
      "author": null,
      "description": "The head of the International Atomic Energy Agency says there is a possibility of both radiological and chemical contamination within Iran’s main nuclear enrichment facility in Natanz. IAEA Director General Rafael Mariano Grossi said Monday that radiation levels outside the complex are presently normal. Grossi said that the radiation poses a significant danger if uranium is inhaled or ingested. He added that the risk can be effectively managed with appropriate protective measures, such as using respiratory protection devices while inside the facilities. Satellite photos analyzed by The Associated Press show extensive damage at Natanz after Friday's strikes.",
      "publishedAt": "2025-06-16T10:49:10Z",
      "title": "Nuclear agency head warns of radiological and chemical contamination inside Iran’s main nuclear site",
      "url": "https://apnews.com/article/iran-nuclear-israel-radiation-natanz-a58c0e06ad30b3a8bf21159a4f54c35a",
      "urlToImage": "https://dims.apnews.com/dims4/default/1fd9094/2147483647/strip/true/crop/8394x4722+0+436/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F45%2F5f%2F3175ce4952f82b5d49a60a3fe283%2F57d6713c038a486b99ca190f979e6d25"
    },
    {
      "author": null,
      "description": "A new poll shows most U.S. adults don’t think the government is overspending on the programs Republicans in Congress have focused on cutting, like Medicaid and food stamps. The Associated Press-NORC Center for Public Affairs Research poll shows Americans broadly support increasing or maintaining existing levels of funding for popular safety net programs, including Social Security and Medicare. They’re more divided on spending around the military and border security. As Republican senators debate President Donald Trump’s bill that could slash federal spending and extend tax cuts, the survey points to a disconnect between Republicans’ policy agenda and public sentiment around the domestic programs that are up for debate.",
      "publishedAt": "2025-06-16T11:00:54Z",
      "title": "US adults want more funding for Medicaid and food stamps, AP-NORC poll says",
      "url": "https://apnews.com/article/poll-government-spending-medicare-medicaid-social-security-0ccb0538c06d715b43bbbcaa4a1348cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/f7bef2f/2147483647/strip/true/crop/7927x4459+0+414/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2F74%2F1c9d47957aafdf7c3c5d484091eb%2Fdbaf18436e0f4e1e9bc758059855abea"
    },
    {
      "author": null,
      "description": "Medical students who survived when an Air India plane crashed into their hostel in Ahmedabad say their first reaction was to help treat the injured. Navin Chaudhary says he had just begun eating his meal when a loud bang startled him. He turned back to see a massive fire taking over the medical college's dining area. He rushed toward a window and jumped. Soon later, he was helping the injured alongside his colleagues at the medical trauma center. At least 270 were killed on Thursday, including 242 aboard the plane and 29 others on the ground.",
      "publishedAt": "2025-06-16T09:39:00Z",
      "title": "A plane crashed on a doctors' hostel in India. Those who survived began treating the injured",
      "url": "https://apnews.com/article/air-india-plane-crash-doctors-hostel-7b6517028d22876c1102ddee615adcf8",
      "urlToImage": "https://dims.apnews.com/dims4/default/056fea2/2147483647/strip/true/crop/6982x3927+0+363/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F3b%2Fbd37f49105046ca47b2cc8a90cdc%2F039b6948fe414dfaa3a9b760a435ad36"
    },
    {
      "author": null,
      "description": "Nearly 3,000 white crosses on a hill in South Africa are a memorial to white people killed on farms over the last three decades. It's a visceral snapshot seized on by some in South Africa to drive a discredited narrative that white farmers in the majority Black country are being targeted in a widespread, race-based system of persecution. The false narrative has been amplified by South African-born Elon Musk and U.S. President Donald Trump. Yet the killings of farmers and farmworkers, regardless of race, are a tiny percentage of the country’s high level of crime. And research shows that robbery — not racial animus — is the most common motive for violent crimes on farms.",
      "publishedAt": "2025-06-16T04:08:59Z",
      "title": "A memorial to South Africa's farm killings tells only part of the story",
      "url": "https://apnews.com/article/south-africa-farm-killings-musk-trump-misinformation-d60c4417f6613afb8de7460433819bfa",
      "urlToImage": "https://dims.apnews.com/dims4/default/4dd1dbd/2147483647/strip/true/crop/1715x965+0+89/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2Fb7%2F009b1322109ba21372886c9f8892%2Fa0815baa2d874201adbac712ca54e018"
    },
    {
      "author": null,
      "description": "The Boston Red Sox have traded Rafael Devers to the San Francisco Giants in a blockbuster deal. The Giants sent right-hander Jordan Hicks, lefty Kyle Harrison, outfield prospect James Tibbs III and minor league righty Jose Bello to the Red Sox for the 28-year-old designated hitter, who had bristled at his demotion from third base this year. Devers is one of baseball’s most feared sluggers. He is batting .272 with 15 homers and 58 RBIs in 73 games after he connected for a solo drive in Boston’s 2-0 victory over the New York Yankees.",
      "publishedAt": "2025-06-16T00:07:32Z",
      "title": "Red Sox send Rafael Devers to Giants in a blockbuster trade",
      "url": "https://apnews.com/article/devers-red-sox-giants-trade-9e0d65350cae0d62409f8c66e19c914d",
      "urlToImage": "https://dims.apnews.com/dims4/default/e204d94/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F2f%2F901ece321ef78866b920ee0e40e1%2F4b0c03915f434605a2d2f61c908e262f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}