{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "WASHINGTON (AP) — Jury selection in the hush money trial of Donald Trump enters a pivotal and potentially final stretch Thursday as lawyers look to round out the panel of New Yorkers that will decide the first-ever criminal case against a former president.",
      "publishedAt": "2024-04-18T04:07:01Z",
      "title": "Jury selection in Trump hush money trial faces pivotal stretch as former president returns to court",
      "url": "https://apnews.com/b514cb52bb31a82579cb827c40166173",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d82d4f257c34c998f292403b4d64455/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Prime Minister Benjamin Netanyahu said Israel would decide whether and how to respond to Iran’s major air assault earlier this week, brushing off calls for restraint from close allies.",
      "publishedAt": "2024-04-17T07:32:14Z",
      "title": "The Latest | Netanyahu says Israel will decide how to respond as Iran warns against retaliation",
      "url": "https://apnews.com/7e4ba24fbb150f020a2d240dad9d462f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2464f0b906424cf6b734fc479b53d6f2/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "JERUSALEM (AP) — Every year, Alon Gat’s mother led the family's Passover celebration of the liberation of the ancient Israelites from Egypt thousands of years ago. But this year, Gat is struggling with how to reconcile a holiday commemorating freedom after his mother was slain and other family members abducted when Hamas attacked Israel.",
      "publishedAt": "2024-04-18T04:28:00Z",
      "title": "Israelis grapple with how to celebrate Passover, a holiday about freedom, while many remain captive",
      "url": "https://apnews.com/a750b8a3150c32836af4515c11dc31c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dd4902dacff44ca9e28c2fb8f0256df/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and SHEIKH SAALIQ",
      "description": "AHMEDABAD, India (AP) — Hindu nationalism, once a fringe ideology in India, is now mainstream.",
      "publishedAt": "2024-04-18T04:20:47Z",
      "title": "Once a fringe Indian ideology, Hindu nationalism is now mainstream, thanks to Modi's decade in power",
      "url": "https://apnews.com/79c30c8ae750a9c037d86b9e2c1b640c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a86e6e9fd09d4cb88b4ac6697c99731c/2970.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN and LINLEY SANDERS",
      "description": "Like many Americans, Ron Theusch is getting more worried about climate change.",
      "publishedAt": "2024-04-18T04:03:07Z",
      "title": "Climate change concerns grow, but few think Biden's climate law will help, AP-NORC poll finds",
      "url": "https://apnews.com/f9943ab6a37674ef2345f4041618cf5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf8241dec45b463c8d836c44e8485d8e/3000.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "The U.S. Justice Department has agreed to pay approximately $100 million to settle claims with about 100 people who say they were sexually assaulted by sports doctor Larry Nassar, a source with direct knowledge of the negotiations told The Associated Press on Wednesday.",
      "publishedAt": "2024-04-17T23:00:41Z",
      "title": "Lawyers for Nassar assault survivors have reached $100M deal with Justice Department, AP source says",
      "url": "https://apnews.com/e3a2759d2f33eeafcfb8d5d49cc947f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da5bbc36793b4dfe9ef264efd5d77556/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Speaker Mike Johnson has unveiled a long-awaited package of bills that will provide military aid to Ukraine and Israel, replenish U.S.",
      "publishedAt": "2024-04-17T22:50:19Z",
      "title": "What's inside the $95 billion House package focused on aiding Ukraine and Israel",
      "url": "https://apnews.com/9097da3511a7cd9b0e9a7b9ce52141b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c7134d2ab6b446db4d5dfe466601bef/3000.jpeg"
    },
    {
      "author": "JACQUES BILLEAUD",
      "description": "PHOENIX (AP) — Democrats in the Arizona Senate cleared a path to bring a proposed repeal of the state’s near-total ban on abortions to a vote after the state’s highest court concluded the law can be enforced and the state House blocked efforts to undo the long-dormant statute.",
      "publishedAt": "2024-04-17T23:44:39Z",
      "title": "Democrats clear path to bring proposed repeal of Arizona’s near-total abortion ban to a vote",
      "url": "https://apnews.com/fa237b1115703a0143a369c6c3683135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10246844f2aa4581a41172db8c13a204/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "DENVER (AP) — Hours after she escaped the Columbine High School shooting, 14-year-old Missy Mendo slept between her parents in bed, still wearing the shoes she had on when she fled her math class.",
      "publishedAt": "2024-04-18T02:48:28Z",
      "title": "25 years after Columbine, trauma shadows survivors of the school shooting",
      "url": "https://apnews.com/f27755b01ce9593bc2ac9b59deef91a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b589a049bc94fe3b8696dc1dc76fe01/3000.jpeg"
    },
    {
      "author": "EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Indonesian authorities issued a tsunami alert Wednesday after eruptions at Ruang mountain sent ash thousands of feet high. Officials ordered more than 11,000 people to leave the area.",
      "publishedAt": "2024-04-17T18:19:50Z",
      "title": "Tsunami alert after a volcano in Indonesia has several big eruptions and thousands are told to leave",
      "url": "https://apnews.com/cdf4f66287a38504ed25138c2cb70dc1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a707524252740b4be5739d263bef210/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}