{
  "articles": [
    {
      "author": "Bill Barrow, Josh Boak",
      "description": "President Donald Trump has used his social media account to share a video about election conspiracy theories that includes a racist depiction of former President Barack Obama and his wife, Michelle Obama, as primates in a jungle. The Republican president's Thursday night post also amplified his false claims that his 2020 election defeat was fraudulent. Trump's post has drawn bipartisan backlash for its treatment of the nation’s first Black president and first lady, who are Democrats. Black Republican Sen. Tim Scott is among those criticizing the post as racist. The White House is pushing back against criticism of the post. An Obama spokeswoman says the former president has no response.",
      "publishedAt": "2026-02-06T14:02:22Z",
      "title": "Trump shares racist video depicting Obamas as primates in a jungle",
      "url": "https://apnews.com/article/trump-obama-racist-video-a48a6b8884a88f9ec30cd4913e352b51",
      "urlToImage": "https://dims.apnews.com/dims4/default/781ded9/2147483647/strip/true/crop/3058x2038+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2Fe4%2Ffe9ad159c9a632db4105b1f86493%2Fb86a9d230cfb4abaa18ba133dee43ee2"
    },
    {
      "author": "Eric Tucker",
      "description": "Attorney General Pam Bondi says a key participant in the 2012 attack on a U.S. compound in Benghazi, Libya, that killed four Americans is in custody. Bondi says the man landed Friday morning at Joint Base Andrews in Maryland. The attack killed Americans including Ambassador Chris Stevens and immediately emerged as a divisive political issue. Republicans challenged President Barack Obama and Secretary of State Hillary Clinton on security at the facility, the military response to the violence and the Democratic administration’s changing narrative about who was responsible. A Libyan militant suspected of being a mastermind of the attacks was convicted in the U.S. and is serving a prison sentence.",
      "publishedAt": "2026-02-06T15:02:47Z",
      "title": "Key participant in 2012 Benghazi attack is in custody, Bondi says",
      "url": "https://apnews.com/article/fbi-benghazi-justice-department-a0eadc00e01e892e6dba827ccfadbae0",
      "urlToImage": "https://dims.apnews.com/dims4/default/ace5296/2147483647/strip/true/crop/2000x1333+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F95%2F666a53e7b891ebd420fe0622236e%2F114241de7ed9450b8c857fc0c416c150"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States are poised Friday to hold negotiations in Oman at least over Tehran’s nuclear program. The talks follow a chaotic week that initially saw plans for regional countries to take part in talks in Turkey. Previous rounds of meetings turned to ash following Israel’s launch of a 12-day war against Iran back in June. The U.S. bombed Iranian nuclear sites during that war. Meanwhile, nationwide protests have shaken Iran's theocracy. It responded with a bloody crackdown that killed thousands and reportedly saw tens of thousands arrested. President Donald Trump has threatened to strike the country in the time since, spurring the talks.",
      "publishedAt": "2026-02-06T02:59:03Z",
      "title": "Iran and US set for talks in Oman over nuclear program",
      "url": "https://apnews.com/article/iran-us-protests-nuclear-negotiations-oman-muscat-32d621b98f7a3a68831f885d262bb70e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a239a1/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Ffc%2F656f9a9b6faed54cc26b99bc5926%2F265e9954c2334a6c863434b160aa85b2"
    },
    {
      "author": "Chan Ho-him",
      "description": "World shares are mixed after Wall Street extended losses driven by heavy selling of technology stocks. European benchmarks were little changed and U.S. futures rose. In Asian trading early Friday, Tokyo's benchmark Nikkei 225 index gained 0.8% as tech shares in Japan bounced back. The price of bitcoin rebounded from its biggest losses, trading about 7% lower. Oil prices were higher, while gold prices rose. On Thursday, the S&P 500 was down 1.2%, the Dow Jones Industrial Average dropped 1.2% and the Nasdaq composite fell 1.6%.",
      "publishedAt": "2026-02-06T04:31:10Z",
      "title": "World shares are mixed as bitcoin bounces",
      "url": "https://apnews.com/article/stocks-markets-trump-gold-tech-199d4d65b7596d7c34f3a5d9a77c2326",
      "urlToImage": "https://dims.apnews.com/dims4/default/f156a28/2147483647/strip/true/crop/7685x5121+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2F72%2Fb997d5f5fa362dd98b89d0c2f7d5%2Ff08d0ce1368f4d838f2a2caad831a37d"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "UK police search two properties linked to Peter Mandelson as part of Epstein probe",
      "url": "https://apnews.com/article/peter-mandelson-jeffrey-epstein-investigation-f2f33eae657a3d3e4e1937eb7ae657f2",
      "urlToImage": null
    },
    {
      "author": "Howard Fendrich",
      "description": "The unprecedented four-site, dual-cauldron Milan Cortina Winter Games opening ceremony replete with references to Italian icons and culture has started. The Olympics are returning to Italy on Friday, 20 years after the country last hosted them in Turin. This is the most spread-out Olympics in history, with competition venues dotting an area of about a space roughly the size of the entire state of New Jersey. The main hub Friday is in Milan at San Siro soccer stadium. There are three other places where athletes will be marching, some carrying their country’s flag: Cortina in the heart of the Dolomite mountains; Livigno in the Alps; Predazzo in the autonomous province of Trento.",
      "publishedAt": "2026-02-06T08:10:09Z",
      "title": "Milan Cortina Olympics opening ceremony starts",
      "url": "https://apnews.com/article/olympics-opening-ceremony-milan-cortina-e98f512c4dd8328bff2da166224740fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/09654a7/2147483647/strip/true/crop/8085x5387+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F2f%2Ff7c0b07fa0b2da1ea96c5f10048c%2F188b47cbda4444678efbb0d343709604"
    },
    {
      "author": "Mike Stobbe",
      "description": "U.S. births slightly decreased in 2025. That's according to new provisional data from the Centers for Disease Control and Prevention. It reports just over 3.6 million births, about 24,000 fewer than in 2024. This decline aligns with expert predictions that the 2024 increase wouldn't start an upward trend. The CDC updated its data last week, covering nearly all of the babies born in 2025. Final numbers may add only a few thousand more. Despite efforts to encourage births, like expanding in vitro fertilization access, the fertility rate has been declining. Economic conditions and uncertainty continue to impact childbearing decisions.",
      "publishedAt": "2026-02-06T17:08:36Z",
      "title": "How many US births were there in 2025?",
      "url": "https://apnews.com/article/how-many-us-births-2025-7d1e0ed60d47cda819eb122b6cb78fdb",
      "urlToImage": "https://dims.apnews.com/dims4/default/cde802a/2147483647/strip/true/crop/2572x1714+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F63%2Fb97b8a4ce7e0c92d79b96b8b7c61%2F1597dfbd5b7a4ba08c21e03cbab4c7c1"
    },
    {
      "author": "Elliot Spagat",
      "description": "A federal judge says the Trump administration must bring back three deported families who should have been allowed to remain in the United States under a court settlement involving the separation of children from their parents at the border. U.S. District Judge Dana Sabraw in San Diego says the government relied on “lies, deception and coercion” to deport them. His order Thursday found the deported families could have stayed in the U.S. under terms of a legal settlement over the first Trump administration’s separation of thousands of families at the border.",
      "publishedAt": "2026-02-07T00:36:55Z",
      "title": "Judge orders Trump administration to return 3 deported families",
      "url": "https://apnews.com/article/trump-border-family-deported-separation-children-honduras-aa301c06c779e277b6487673cfd126af",
      "urlToImage": "https://dims.apnews.com/dims4/default/55d28e4/2147483647/strip/true/crop/5760x3838+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F72%2F93cea266b66f095c832753ce40c4%2F68a7cd74f85d42389900534a37b83d78"
    },
    {
      "author": null,
      "description": "A New Mexico grand jury has indicted Timothy Busfield has been indicted on four counts of criminal sexual contact with a child. A county district attorney announced the indictment Friday in a social media post. Authorities had issued an arrest warrant for Busfield over allegations of misconduct from when he was working as a director on the set of the TV series “The Cleaning Lady.” Busfield has denied the allegations. He turned himself in to authorities and later was released from jail. An attorney for Busfield says there are weaknesses in the state's evidence.",
      "publishedAt": "2026-02-06T17:33:27Z",
      "title": "'West Wing' actor Timothy Busfield indicted on 4 counts of sexual contact with a child",
      "url": "https://apnews.com/article/timothy-busfield-sexual-misconduct-355c30edad16d0ba079b192eb673cb0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d3d7ae0/2147483647/strip/true/crop/4523x3014+67+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2F4a%2F91cc4d6ef20437752ec96c8009b4%2F29c83010f0e048bc9bf9db3a2cffb2e4"
    },
    {
      "author": "Jesse Bedayn, Matthew Brown",
      "description": "A Colorado funeral home owner who stashed 189 decomposing bodies and gave families fake ashes has been sentenced to 40 years in prison for corpse abuse. Family members of the deceased called defendant Jon Hallford a “monster” during Friday's sentencing hearing. Hallford co-owned Return to Nature Funeral Home in Colorado Springs with his then-wife Carie. They pleaded guilty in December. Investigators discovered the bodies in 2023 after reports of a stench. Families of the deceased were devastated to learn the ashes they received were not their loved ones. Carie Hallford is scheduled to be sentenced in April.",
      "publishedAt": "2026-02-06T05:02:26Z",
      "title": "Victims say Colorado man who abused nearly 200 corpses is a 'monster'",
      "url": "https://apnews.com/article/funeral-home-decomposing-bodies-sentencing-94d5253b78791102b9eaa7dbe810d448",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff967bc/2147483647/strip/true/crop/3000x1999+0+38/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F67%2F473415e9084a9b9530a99508bc2a%2F056174e5f55e460dae8a3aaf5f136afa"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}