{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, WAFAA SHURAFA and JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israel's military announced on Sunday that it would pause fighting throughout daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries destined for desperate Palestinians enduring a humanitarian crisis sparked by the war, now in its ninth month.",
      "publishedAt": "2024-06-16T04:01:50Z",
      "title": "Israel's army says it will pause daytime fighting along a route in southern Gaza to help ramp up aid",
      "url": "https://apnews.com/8c111f2dcf783f8671e6dd6f19547b17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdbab80a96e641d689b818c0b242583f/3000.jpeg"
    },
    {
      "author": null,
      "description": "ROCHESTER HILLS, Mich. (AP) — Nine people were injured, including two young children and their mother, after a shooter opened fire at a splash pad in a Detroit suburb where families gathered to escape the summer heat Saturday.",
      "publishedAt": "2024-06-15T23:59:39Z",
      "title": "Shooting in Detroit suburb injures 9, leaving an 8-year-old in critical condition",
      "url": "https://apnews.com/7d2700a7efdf003e151917d85deb1a35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6bcaeb33c364c5988a163562ec36342/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "MINA, Saudi Arabia (AP) — Masses of pilgrims on Sunday embarked on a symbolic stoning of the devil in Saudi Arabia under the soaring summer heat. The ritual marks the final days of the Hajj, or Islamic pilgrimage, and the start of the Eid al-Adha celebrations for Muslims around the world.",
      "publishedAt": "2024-06-16T04:07:04Z",
      "title": "Pilgrims commence the final rites of Hajj as Muslims celebrate Eid al-Adha",
      "url": "https://apnews.com/0278c6e1040eac5f0b834f762f41db27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26ff0d4cc3cf4f21b45b4ab90dd7dc3c/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and JOEY CAPPELLETTI",
      "description": "DETROIT (AP) — Donald Trump blamed immigrants for stealing jobs and government resources as he courted separate groups of Black voters and hardcore conservatives in battleground Michigan on Saturday.",
      "publishedAt": "2024-06-15T11:32:46Z",
      "title": "Trump blasts immigrants for taking jobs as he courts voters at a Black church, MAGA event in Detroit",
      "url": "https://apnews.com/2ddab35eceecb42ee8899f0720715b32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/351d61f62e4f452ba26aaab5189401d7/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Donald Trump on Saturday night suggested President Joe Biden “should have to take a cognitive test,\" only to confuse who administered the test to him in the next sentence.",
      "publishedAt": "2024-06-16T00:35:03Z",
      "title": "Trump challenges Biden to a cognitive test but confuses the name of the doctor who tested him",
      "url": "https://apnews.com/0d45b6d89ae295b690f5ad12ca0bd38a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d8bcc571c5e477ab352c4b1581b1ae1/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "LOS ANGELES (AP) — Some of Hollywood's brightest stars headlined a glitzy fundraiser for President Joe Biden, helping raise what his reelection campaign said was $28 million and hoping to energize would-be supporters for a November election that they argued was among the most important in the nation's history.",
      "publishedAt": "2024-06-15T04:02:37Z",
      "title": "Clooney and Roberts help Biden raise $28 million at a fundraiser featuring dire warnings about Trump",
      "url": "https://apnews.com/40081471c93faa68de5c4aa30455303b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e51436efa08245069b387cd501383ffa/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES and GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — Thousands of demonstrators took to the streets of Sao Paulo on Saturday as protests sweep across Brazil in opposition to a bill that would further criminalize abortions. If passed, the law would equate the termination of a pregnancy after 22 weeks with homicide.",
      "publishedAt": "2024-06-15T21:50:05Z",
      "title": "Outraged Brazilian women stage protests against bill to equate late abortions with homicide",
      "url": "https://apnews.com/21ee9a590cafdaa11108b54029660ba8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/258babab8e684cee975d784f8e40831b/1920.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — Chinese Premier Li Qiang on Sunday promised a new pair of giant pandas to a zoo and urged Australia to set aside its differences with Beijing at the outset of the first visit to the country by China's second-highest ranking leader in seven years.",
      "publishedAt": "2024-06-16T02:48:30Z",
      "title": "Chinese premier promises more pandas and urges Australia to put aside differences",
      "url": "https://apnews.com/8f7f8cebf751d0adaa14554aa10fced0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3de12968a6ae407e8181978926ee7978/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "After days of intense flooding in Florida, that state and many others are bracing for an intense heat wave, while the Pacific Northwest will experience unseasonably cold weather and there is a potential for late-season snow in the Rocky Mountains early next week.",
      "publishedAt": "2024-06-15T15:18:45Z",
      "title": "Much of US braces for extreme weather, from southern heat wave to possible snow in the Rockies",
      "url": "https://apnews.com/5e50d6dc87e708717486e68fccdce1a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59ff91f705eb460784934f0e7870ea5a/3000.jpeg"
    },
    {
      "author": null,
      "description": "KUALA LUMPUR, Malaysia (AP) — An oil spill caused by a dredger boat hitting a stationary cargo tanker has blackened part of Singapore’s southern coastline, including the popular resort island of Sentosa, and sparked concerns it may threaten marine wildlife as a clean-up operation was underway Sunday.",
      "publishedAt": "2024-06-16T03:31:55Z",
      "title": "Singapore rushes to clean-up oil slick after boat hits stationary fuel supply ship",
      "url": "https://apnews.com/a7e50fa7b5f41594152840e3c6938360",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10c9872577964e31b1292dcd4d889b4f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}