{
  "articles": [
    {
      "author": "RANDALL CHASE, CLAUDIA LAUER, MICHAEL KUNZELMAN, COLLEEN LONG and ALANNA DURKIN RICHER",
      "description": "WILMINGTON, Del. (AP) — Hunter Biden was convicted Tuesday of all three felony charges related to the purchase of a revolver in 2018 when, prosecutors argued, the president’s son lied on a mandatory gun-purchase form by saying he was not illegally using or addicted to drugs.",
      "publishedAt": "2024-06-11T04:10:20Z",
      "title": "President Joe Biden's son, Hunter Biden, is convicted of all 3 felonies in federal gun trial",
      "url": "https://apnews.com/5dd8a9380235c6360a1ddb691ef24a06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db1d369218254a44a16612c9f30024df/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE and ABBY SEWELL",
      "description": "TEL AVIV, Israel (AP) — U.S. Secretary of State Antony Blinken said Tuesday that the U.N.",
      "publishedAt": "2024-06-11T10:03:52Z",
      "title": "Blinken calls on Hamas to accept Gaza cease-fire plan after UN Security Council strongly endorses it",
      "url": "https://apnews.com/d3733d55c6a66222da1a4a051997094c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04eba96f17424ddbb1623a9c9fb02524/1920.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "GENEVA (AP) — The U.N. human rights office is citing possible war crimes by Israeli forces and Palestinian armed groups in connection with a deadly raid by Israeli forces that freed four hostages over the weekend and killed hundreds of Palestinians.",
      "publishedAt": "2024-06-11T09:32:42Z",
      "title": "UN says Israeli forces and Palestinian armed groups may have committed war crimes in a deadly raid",
      "url": "https://apnews.com/40a3e17012915c409e8a5d50475dd122",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f19c9ed42494c4598ad4f2a2c26c9b9/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Groups pushing tighter gun laws have been building political muscle through multiple elections, boosted by the outcry following mass shootings at schools and other public places, in addition to the nation's daily gun violence.",
      "publishedAt": "2024-06-11T04:15:12Z",
      "title": "Biden and gun control advocates want to flip an issue long dominated by the NRA",
      "url": "https://apnews.com/069fa483fc8af1e321ef8b53040f70ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd45e67258e4432fa8ab4513defaf36b/3000.jpeg"
    },
    {
      "author": "GREGORY GONDWE and GERALD IMRAY",
      "description": "BLANTYRE, Malawi (AP) — Malawi's Vice President Saulos Chilima and nine other people died when the small military plane they were traveling in crashed in bad weather in a mountainous region in the north of the country, the president said Tuesday.",
      "publishedAt": "2024-06-11T08:06:08Z",
      "title": "Malawi's vice president and 9 others are confirmed dead after their plane's wreckage is found",
      "url": "https://apnews.com/c071c832931d7cfeae92f9bb1c199075",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2aafbeaada86417998d0ce410ebb5adb/1920.jpeg"
    },
    {
      "author": "KATHY McCORMACK",
      "description": "CONCORD, N.H. (AP) — Pamela Smart, who is serving life in prison for plotting with her teenage student to have her husband killed in 1990, accepted full responsibility for his death for the first time in a videotaped statement released Tuesday as part of her latest sentence reduction request.",
      "publishedAt": "2024-06-11T14:52:56Z",
      "title": "Pamela Smart, serving life, accepts responsibility for her husband's 1990 killing for the first time",
      "url": "https://apnews.com/8f3e0ca7d1a908cdcf2392b0e8f4ee83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f482808607364646a9bf582c5d0fd210/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "LONDON (AP) — He has no political experience. No high-profile endorsements. No party affiliation. What Fidias Panayiotou does have are 2.6 million followers on YouTube and more on TikTok. And now he has won a seat in the European Parliament representing Cyprus, one of several unusual candidates who launched improbable campaigns only to snag membership in the 720-seat legislature.",
      "publishedAt": "2024-06-11T05:24:10Z",
      "title": "These candidates who won seats in the European Parliament this week aren't who you might expect",
      "url": "https://apnews.com/2e508a3dd2bc3695f0ec48286f7aaaf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac0745a30de842b89c30387471c9b3cb/3000.jpeg"
    },
    {
      "author": "SCOTT McFETRIDGE",
      "description": "DES MOINES, Iowa (AP) — As the U.S. dairy industry confronts a bird flu outbreak, with cases reported at dozens of farms and the disease spreading to people, the egg industry could serve as an example of how to slow the disease but also shows how difficult it can be to eradicate the virus.",
      "publishedAt": "2024-06-11T04:22:38Z",
      "title": "With 100M birds dead, poultry industry could serve as example as dairy farmers confront bird flu",
      "url": "https://apnews.com/492fd92ae68d11d9defc15bc260e9301",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3010d1b0c7c64bcdaa1693739bb3c794/3000.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS, JIM SALTER and CAMILLE FASSETT",
      "description": "WEST ALTON, Mo. (AP) — Devastating flooding, driven in part by climate change, is taking an especially damaging toll on communities that once thrived along the banks of America's most storied river.",
      "publishedAt": "2024-06-11T14:21:32Z",
      "title": "For shrinking Mississippi River towns, frequent floods worsen fortunes",
      "url": "https://apnews.com/56e825cdda0f57d895cce753b08f9987",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f349d256209349cd92cf21218cbdd279/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "USA Basketball said experience was a major reason Caitlin Clark was not on the U.S. women's Olympic roster that was officially revealed Tuesday.",
      "publishedAt": "2024-06-11T15:01:23Z",
      "title": "US opts for experience and versatility on Olympic women's basketball roster, passes on Caitlin Clark",
      "url": "https://apnews.com/61e849cb0ca15bd430566a5acde97470",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d44d7d23164045dda8ba5d5b8b60f2f7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}