{
  "articles": [
    {
      "author": "Colleen Slevin, Eric Tucker",
      "description": "Authorities are searching for evidence after a man with a makeshift flamethrower yelled “Free Palestine” and hurled an incendiary device into a group that had assembled to raise attention for Israeli hostages in Gaza. Eight people were injured in the Sunday attack, some with burns. The suspect, 45-year-old Mohamed Sabry Soliman, was booked into the Boulder County jail north of Denver and expected to face charges in connection with the attack the FBI was investigating as a terrorist act. The burst of violence at the popular Pearl Street pedestrian mall unfolded against the backdrop of a war between Israel and Hamas that continues to inflame global tensions.",
      "publishedAt": "2025-06-02T14:56:31Z",
      "title": "Authorities say 8 injured in attack by man with makeshift flamethrower who yelled 'Free Palestine'",
      "url": "https://apnews.com/article/boulder-colorado-attack-israel-palestine-flamethrower-pearl-street-7e680648371c3d1cb7c026d888d99279",
      "urlToImage": "https://dims.apnews.com/dims4/default/4009241/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F67%2F1325918e6c550ec8466cfbd68be2%2F5b7212360f65423691518ec570047cfb"
    },
    {
      "author": "Colleen Slevin, Olga R. Rodriguez",
      "description": "Eight people calling for the release of Israeli hostages in Gaza were injured at an outdoor mall in Boulder, Colorado, by a man who used a makeshift flamethrower and hurled an incendiary device into the crowd. The FBI immediately called it a “targeted terror attack.” Officials said the man yelled “Free Palestine” as he attacked people Sunday calling for the immediate release of Israeli hostages in Gaza. The FBI identified the suspect as 45-year-old Mohamed Sabry Soliman. Charges were not immediately filed against him, but officials said they expect to hold him “fully accountable.”",
      "publishedAt": "2025-06-02T03:07:15Z",
      "title": "What we know about the suspect and victims in the Boulder attack",
      "url": "https://apnews.com/article/boulder-terror-attack-colorado-c90a20758b3ebee597c84eb296e44e91",
      "urlToImage": "https://dims.apnews.com/dims4/default/1de4b8e/2147483647/strip/true/crop/5110x2874+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2Ff0%2Fc2c0080b3d87f48f17e10e52ea97%2F0ba1178b52e943c2aa1587a0e5691a3b"
    },
    {
      "author": "Hyung-Jin Kim, Kim Tong-hyung",
      "description": "Millions of South Koreans are voting for a new president in a snap election triggered by the ouster of Yoon Suk Yeol, a conservative who faces a criminal trial over his short-lived imposition of martial law in December. Pre-election surveys suggest liberal Lee Jae-myung appears headed for an easy win in Tuesday’s election, riding on deep public frustration over the conservatives in the wake of Yoon’s martial law debacle. Conservative candidate Kim Moon Soo has struggled to restore public confidence. The winning candidate will be immediately sworn in as president Wednesday for a full, single five-year term.",
      "publishedAt": "2025-06-02T21:06:57Z",
      "title": "South Koreans vote for new president in wake of Yoon's ouster over martial law",
      "url": "https://apnews.com/article/south-korea-election-da088cf36a61641e23795688df01ee01",
      "urlToImage": "https://dims.apnews.com/dims4/default/76f35dc/2147483647/strip/true/crop/7635x4295+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F82%2Fc476c0e4304ebd399d5a35a7114b%2Fa3567d0a111e4554b2d565c2948fb367"
    },
    {
      "author": "Becky Bohrer, Mark Thiessen",
      "description": "Three Trump Cabinet members have toured a key point of operations at a prolific oil field near the Arctic Ocean in Alaska. Their visit comes as part of a multiday trip aimed at highlighting President Donald Trump’s push to expand oil and gas drilling, mining and logging in the state. Interior Secretary Doug Burgum, Energy Secretary Chris Wright and Environmental Protection Agency Administrator Lee Zeldin arrived at Deadhorse on Monday. That stop of the trip came hours after Burgum’s agency said it would follow through with plans to repeal Biden-era restrictions on future leasing and industrial development in portions of the National Petroleum Reserve-Alaska.",
      "publishedAt": "2025-06-02T18:58:22Z",
      "title": "Trump officials visit key operations at prolific Alaska oil field amid push to expand drilling",
      "url": "https://apnews.com/article/alaska-trump-energy-pipeline-oil-burgum-10e25f00ad75f9a5785bbd64cf39f4b1",
      "urlToImage": "https://dims.apnews.com/dims4/default/f5fc794/2147483647/strip/true/crop/5584x3141+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Fba%2Fe15c2c36fea677984a8327b068e4%2F6a38cebe19c9483d9a46757ec99f979d"
    },
    {
      "author": "Lindsay Whitehurst",
      "description": "A split Supreme Court is declining to hear a challenge to state bans on assault weapons, semiautomatic rifles that are popular among gun owners and that have also been used in multiple mass shootings. The justices on Monday turned down a case against a decade-old Maryland law similar to those in several other states. The decision comes three years after the high court handed down a landmark ruling that expanded Second Amendment rights. Gun advocates and attorneys for Maryland disagree over whether the AR-15 and similar weapons are protected by the Second Amendment.",
      "publishedAt": "2025-06-02T13:42:17Z",
      "title": "Supreme Court won't hear challenge to Maryland assault weapons ban",
      "url": "https://apnews.com/article/supreme-court-assault-weapons-ban-0ce9bfd44c9e6696d7fd8f69af699152",
      "urlToImage": "https://dims.apnews.com/dims4/default/0dac2cd/2147483647/strip/true/crop/4393x2471+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fbb%2Fbc2e8af23f5440f635cd2c255779%2F7bfae501f63a4e5ea53f8cc32266b776"
    },
    {
      "author": "Mehmet Guzel",
      "description": "Delegations from Russia and Ukraine are in Turkey for their second round of direct peace talks in just over two weeks. Expectations are low for any significant progress Monday on ending the three-year war after a string of major attacks over the weekend. Ukraine said Sunday it launched a spectacular surprise attack on five Russian airbases thousands of kilometers apart, ranging from air bases close to Moscow to targets in Russia’s Arctic, Siberia, and Far East. Ukraine claimed more than 40 Russian warplanes were destroyed in what Ukrainian President Volodymyr Zelenskyy called a “brilliant operation.” Meanwhile, Russia on Sunday launched the biggest number of drones — 472 — on Ukraine since the full-scale invasion in February 2022.",
      "publishedAt": "2025-06-02T07:43:46Z",
      "title": "Ukraine and Russia hold talks with little hope for a breakthrough",
      "url": "https://apnews.com/article/russia-ukraine-war-peace-talks-drone-attacks-0c2e0a4aeccd86c3fe18edf5cc73b250",
      "urlToImage": "https://dims.apnews.com/dims4/default/cd4c5b2/2147483647/strip/true/crop/1975x1111+31+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fda%2Fe4c375027039389aadc75bbec655%2F291c558799c246ecb4b06fa62547573e"
    },
    {
      "author": null,
      "description": "Conservative Karol Nawrocki has won Poland’s weekend presidential runoff election, according to the final vote count. Nawrocki won 50.89% of votes in a very tight race against liberal Warsaw Mayor Rafał Trzaskowski, who received 49.11%. The close race had the country on edge since a first round two weeks earlier and through the night into Monday, revealing deep divisions in the country along the eastern flank of NATO and the European Union. An early exit poll released Sunday evening suggested Trzaskowski was headed to victory before updated polling began to reverse the picture hours later.",
      "publishedAt": "2025-06-02T03:55:54Z",
      "title": "Nawrocki narrowly wins Poland's presidential runoff election",
      "url": "https://apnews.com/article/poland-presidential-election-karol-nawrocki-80a99eeb7a2f3ae64260a9263e7028ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/483b587/2147483647/strip/true/crop/3842x2161+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F23%2F4f89ddf64a5f9aa6983db695d475%2F6bf83a8ec75b4d06bc0860faadd6e54f"
    },
    {
      "author": "Amanda Seitz",
      "description": "U.S. Health Secretary Robert F. Kennedy Jr.’s stark comments about children with autism have splintered a community of millions of people who are living with the disorder. The health secretary asserts children with autism will never pay taxes, hold a job or go out on a date. For some families, Kennedy’s remarks are an overdue recognition of the day-to-day difficulties for families with autistic loved ones. To others, Kennedy deeply misrepresents the realities of their disability, provoking concern about his ability to handle a sweeping assessment of the disorder. Kennedy plans to launch a broad-based study of what causes autism, a complex developmental disorder.",
      "publishedAt": "2025-06-02T11:21:28Z",
      "title": "RFK Jr. says autism 'destroys' families. Some families speak out",
      "url": "https://apnews.com/article/rfk-jr-kennedy-autism-families-e8932a9acd4c904aaebdfb503259ae4d",
      "urlToImage": "https://dims.apnews.com/dims4/default/94a169d/2147483647/strip/true/crop/5728x3222+0+299/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F8d%2F4095aa9f7cffb09a76852dea0d22%2F6456b3fb87c945c3a879a769fc0f45fe"
    },
    {
      "author": null,
      "description": "An Israeli strike on a residential building in the Gaza Strip has killed 14 people, mostly women and children, according to health officials. The Shifa and al-Ahli hospitals confirmed the toll from Monday’s strike in the built-up Jabaliya refugee camp, saying five women and seven children were among those killed. There was no immediate comment from the Israeli military. The Israeli military did not immediately respond to a request for comment. Israel says it only targets militants and tries to avoid harming civilians. It blames civilian deaths on Hamas because the militant group is entrenched in populated areas.",
      "publishedAt": "2025-06-02T11:42:33Z",
      "title": "An Israeli strike on Gaza kills 14 Palestinians, mostly women and children",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-aid-06-02-2025-13980028c67e29262ee9fd85371e0630",
      "urlToImage": "https://dims.apnews.com/dims4/default/dfe17c7/2147483647/strip/true/crop/7071x3977+0+368/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faa%2F16%2F48fa4069f959748c347f7924ef93%2F75b2496ce256459d9446d26518ffc25b"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A former personal assistant to Sean “Diddy” Combs who says he raped her has defended the loving text messages she sent him for years after her job ended in 2017, saying she was “brainwashed.” The testimony at the music mogul's sex trafficking and racketeering trial came Monday as a woman testifying under the pseudonym “Mia” spent a third day on the witness stand. The trial was entering its fourth week of witness testimony. The 55-year-old Combs has pleaded not guilty to charges. He has remained jailed without bail since his September arrest.",
      "publishedAt": "2025-06-02T16:43:56Z",
      "title": "Sean 'Diddy' Combs' former assistant testifies she was 'brainwashed'",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-mia-fb2828651ef11ce2ac0f86978f496355",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4647be/2147483647/strip/true/crop/1753x986+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F65%2F54a13cb40ffdb216bd6ed466ed07%2Fab10451bb17d49dba8de0d66346e85fb"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}