{
  "articles": [
    {
      "author": "VLADIMIR ISACHENKOV, ERIC TUCKER, ZEKE MILLER",
      "description": "President Donald Trump says he and Russian President Vladimir Putin have agreed to begin “negotiations” on ending the Ukraine war. The Republican said in a social media post Wednesday disclosing a call between the two leaders that they would “work together, very closely.” The call followed a prisoner swap that resulted in Russia releasing American schoolteacher Marc Fogel, of Pennsylvania, after more than three years of detention. Two U.S. officials say convicted Russian criminal Alexander Vinnik is being freed as part of the swap that saw Moscow’s release of Fogel. The officials spoke Wednesday on the condition of anonymity to discuss the swap.",
      "publishedAt": "2025-02-12T10:45:50Z",
      "title": "Trump says he and Russian leader Putin have agreed to begin ‘negotiations’ on ending Ukraine war",
      "url": "https://apnews.com/article/russia-us-marc-fogel-prisoner-swap-98418693957b1fa0189ee8ac4e8b4f2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/982db5e/2147483647/strip/true/crop/4710x2649+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F79%2F5e8265a896e6a2953ac5da7edcc1%2F095f262d10d749b084576fc686f6635e"
    },
    {
      "author": "LORNE COOK, TARA COPP",
      "description": "U.S. Defense Secretary Pete Hegseth says NATO membership for Ukraine is unrealistic. In sweeping remarks Wednesday, Hegseth suggested that the way forward for Ukraine is for the country to abandon hopes of a return to its pre-2014 borders and prepare for a negotiated settlement with Russia — one that should be backed up with an international force of troops. Hegseth made the comments during the first trip to NATO and the Ukraine Defense Contact Group by a member of the new Trump administration. Allies have been waiting to hear how much continued military and financial support Washington intends to provide to Ukraine’s government.",
      "publishedAt": "2025-02-12T11:27:10Z",
      "title": "US defense chief Hegseth calls NATO membership for Ukraine unrealistic",
      "url": "https://apnews.com/article/nato-ukraine-us-hegseth-trump-russia-a3ca747b102cae6737436596444a32d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/be830f8/2147483647/strip/true/crop/4440x2498+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F75%2Fc48623817adf3e131cfb0146a24a%2F2093a683b188458eb2730c1c129154a7"
    },
    {
      "author": "DANICA KIRKA",
      "description": "An annual review of the global military situation says Russia’s stockpiles of Cold War-era weapons and larger population have allowed it to withstand heavy battlefield losses in Ukraine as the West fails to provide Ukraine with the aid needed to mount a counteroffensive. The International Institute for Strategic Studies says Russia has lost an estimated 800,000 soldiers killed or wounded since its full-scale invasion of Ukraine began some three years ago, Moscow appears to be keeping its forces up to strength. The report says Wednesday that Ukraine has suffered a “serious drain on its personnel,” even though the number of casualties was lower.",
      "publishedAt": "2025-02-12T17:28:59Z",
      "title": "New report says Russia is better able to withstand heavy battlefield losses than Ukraine",
      "url": "https://apnews.com/article/britain-russia-ukraine-defense-spending-16f8ede3be601111774cb4f3f6c0fe29",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "The Senate has confirmed Tulsi Gabbard as President Donald Trump’s director of national intelligence. The vote Wednesday came after Republicans who had initially questioned her experience and judgment fell in line behind her nomination. Gabbard was an unconventional pick to oversee and coordinate the country’s 18 different intelligence agencies. She had made past comments sympathetic to Russia, she once met with now-deposed Syrian President Bashar Assad and had expressed previous support for government leaker Edward Snowden. Gabbard is a military veteran and a former Democratic congresswoman from Hawaii. She has no formal intelligence experience and has never run a government agency or department.",
      "publishedAt": "2025-02-12T15:05:07Z",
      "title": "Senate confirms Gabbard as Trump's director of national intelligence",
      "url": "https://apnews.com/article/tulsi-gabbard-trump-senate-national-intelligence-director-a1045b3f6bf91e491892e347b42cdc90",
      "urlToImage": "https://dims.apnews.com/dims4/default/47e5fc0/2147483647/strip/true/crop/7441x4186+0+387/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F37%2F758f3a9dde28883c7d3a2870ddc4%2Fbcc41f93d07c461a9c703542e15498e4"
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "A member of the Equal Employment Opportunity Commission who was abruptly dismissed by President Donald Trump says she believes her firing and the move to reshape the panel that protects workers from discrimination is part of the administration’s “agenda to erase the existence of trans people.” Jocelyn Samuels said in an interview with The Associated Press that the actions are unlawful and indicative of a looming wider rollback of work protections for women and minorities. The EEOC was created by Title VII of the 1964 Civil Rights Act as a bipartisan five-member panel to protect workers from discrimination on the basis of race, gender, disability and other protected characteristics.",
      "publishedAt": "2025-02-12T23:30:06Z",
      "title": "Dismissed EEOC commissioner warns that Trump plans to 'erase the existence of trans people'",
      "url": "https://apnews.com/article/discrimination-equal-employment-opportunity-trump-trans-samuels-00de2a3c8d5068e83f6ac1d9a073fc02",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f4b9fb/2147483647/strip/true/crop/4751x2672+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2Faf%2F361240af12df86d4e144e68f5ec5%2Fd0c4cb8abb124a6c822871821ba412b1"
    },
    {
      "author": "ALANNA DURKIN RICHER, ANTHONY IZAGUIRRE",
      "description": "President Donald Trump’s newly installed attorney general, Pam Bondi, is going after New York leaders over the state’s immigration policies. She announced a lawsuit against them in the latest effort by the Republican administration to carry out the president’s hardline immigration campaign pledges. Bondi stood in front of federal agents who have been tasked with helping with Trump’s immigration enforcement efforts and echoed the president’s rhetoric as she accused New York leaders of prioritizing “illegal aliens over American citizens.” New York Attorney General Letitia James said in a statement that she’s prepared to defend the state’s laws, which she said “protect the rights of all New Yorkers and keep our communities safe.”",
      "publishedAt": "2025-02-13T00:45:39Z",
      "title": "Attorney General Pam Bondi rails against New York leaders as she announces immigration lawsuit",
      "url": "https://apnews.com/article/justice-department-immigration-pam-bondi-trump-4829db2b93afcfa35194014f160d7edb",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0b7601/2147483647/strip/true/crop/6728x3785+0+355/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2Fd8%2F603dd0f838449620586eb630ac86%2Fa5ca3ed54fa34ecba61c2c812c947e3a"
    },
    {
      "author": "TIFFANY STANLEY",
      "description": "Christian aid groups are being hard-hit after the Trump administration froze most foreign aid and sidelined the U.S. Agency for International Development. Faith-based humanitarian organizations that partner with USAID are now facing their own layoffs, furloughs and severe funding shortages. Remaining staff are being forced to choose which of their lifesaving programs can continue without government funding. Two of the 12 largest non-governmental recipients of USAID funds are faith-based: Catholic Relief Services and World Vision. These Christian nonprofits serve millions of people globally and provide food, water and health care in conflict zones.",
      "publishedAt": "2025-02-12T16:26:17Z",
      "title": "Christian aid groups weigh life-threatening choices about who to help after USAID funding pause",
      "url": "https://apnews.com/article/usaid-christian-nonprofits-funding-freeze-bbb000ea0e232765db1280c093301a8a",
      "urlToImage": "https://dims.apnews.com/dims4/default/8cee50c/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F3a%2F4c586410a27ff343efc50554320d%2F5c58a1940e9d4f55a88922a394e1a7a9"
    },
    {
      "author": "LINDSAY WHITEHURST, CHRIS MEGERIAN, MICHAEL CASEY",
      "description": "A federal judge has cleared the way for President Donald Trump’s plan to downsize the federal workforce with deferred resignation program. It was a significant legal victory for the Republican president after a string of courtroom setbacks. U.S. District Judge George O’Toole Jr. on Wednesday found that the labor unions that sued didn’t have legal standing to challenge the program, commonly described as a buyout. Trump wants to use financial incentives to encourage government employees to quit. According to the White House, tens of thousands of workers have taken the government up on its offer. The deferred resignation program has been spearheaded by Elon Musk, who is serving as Trump’s top adviser for reducing federal spending.",
      "publishedAt": "2025-02-12T23:08:58Z",
      "title": "Judge clears way for Trump’s plan to downsize federal workforce with deferred resignation program",
      "url": "https://apnews.com/article/trump-elon-musk-federal-workers-buyouts-e8cd4f40ac16220bd0a399a00c5b9f63",
      "urlToImage": "https://dims.apnews.com/dims4/default/09f41ce/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2Fe6%2F98688cbab133f07d85becb75a7ce%2F612175e501454cd792a2e4e9b3a0b214"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "U.S. inflation accelerated last month as the cost of groceries and gasoline rose, a trend that will likely underscore the Federal Reserve’s resolve to delay any further interest rate cuts. The consumer price index increased 3% in January from a year ago, Wednesday’s report from the Labor Department showed, up from 2.9% the previous month. It has increased from a 3 1/2 year low of 2.4% in September. The figures underscore the stickiness of inflation, which created a major political problem for former President Joe Biden. President Donald Trump pledged to reduce prices in last year’s campaign, though most economists worry that his many proposed tariffs could at least temporarily increase costs.",
      "publishedAt": "2025-02-12T08:01:37Z",
      "title": "US inflation got worse with rising groceries and gasoline prices",
      "url": "https://apnews.com/article/inflation-economy-federal-reserve-48e77a855078b37bf3ccd58c9db94c82",
      "urlToImage": "https://dims.apnews.com/dims4/default/eeaf6fd/2147483647/strip/true/crop/5419x3048+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2Feb%2F4de6d48edbce728241b9accf5374%2Ffabfc2caf6834d959d44a5246e66a86e"
    },
    {
      "author": "BEN FINLEY, JOHN RABY",
      "description": "Heavy snow and freezing rain from Kentucky to the nation's capital caused hundreds of crashes and left tens of thousands of residents in the dark. As the wintry mix turned over to rain amid rising temperatures, there's now a flood threat in several states. Authorities say one person died in a head-on crash on a snowy road Tuesday in Kentucky. By Wednesday, more than 190,000 customers in Virginia and nearly 16,000 in North Carolina had lost power. In California, an atmospheric river is expected to move in late Wednesday, likely flooding urban areas across central and Southern California.",
      "publishedAt": "2025-02-12T05:43:50Z",
      "title": "Eastern storm cuts power to tens of thousands as California braces for flooding",
      "url": "https://apnews.com/article/snow-freezing-rain-mid-atlantic-flooding-california-b94231bb4f5ed5c8dfc50a25f9fed738",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c8e830/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Fa7%2Fdd1418023087d4234d05b9bdca6d%2F64bf37b350e4464aa65c6891ff7cb6ea"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}