{
  "articles": [
    {
      "author": "MARK STEVENSON, MICHAEL BALSAMO and COLLEEN LONG",
      "description": "MEXICO CITY (AP) — The Biden administration will resume deporting Venezuelan migrants, the largest single group encountered at the U.S.-Mexico border last month, back to their economically troubled country as their arrivals continue to grow.",
      "publishedAt": "2023-10-04T18:03:05Z",
      "title": "Biden administration is resuming deportation flights for Venezuelan migrants as arrivals grow",
      "url": "https://apnews.com/3ea8f589019506d271906d83be432cdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/975e450c8e4c46048abcf0044f560530/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump’ s corporate executives once boosted the estimated worth of his Trump Tower penthouse by $20 million partly because of the value of his celebrity, according to trial testimony Thursday.",
      "publishedAt": "2023-10-05T16:02:50Z",
      "title": "Trump's penthouse value estimate boosted by millions due to his fame, execs testify in fraud trial",
      "url": "https://apnews.com/64ffc5238f77f0a851626877cd45a96f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b741a1c5ee434944a26365aac1f5ba88/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVE, FARNOUSH AMIRI and LISA MASCARO",
      "description": "WASHINGTON (AP) — For Republicans, it's a question with no clear answer: Who becomes House speaker after Kevin McCarthy?",
      "publishedAt": "2023-10-05T19:03:37Z",
      "title": "Who might replace McCarthy as House speaker? What are Republicans already demanding for their vote?",
      "url": "https://apnews.com/64fa61123be7a7af585233903256c0f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19d735de7f2041e892f7dbc9c926ecff/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL and CAMILLE FASSETT",
      "description": "Storms, floods, fires and other extreme weather events led to more than 43 million displacements involving children between 2016 and 2021, according to a United Nations report. More than 113 million displacements of children will occur in the next three decades, estimated the UNICEF report released Friday, which took into account risks from flooding rivers, cyclonic winds and floods that follow a storm.",
      "publishedAt": "2023-10-06T00:07:17Z",
      "title": "Millions of children are displaced due to extreme weather events. Climate change will make it worse",
      "url": "https://apnews.com/87e933b1ee0d81f9345daa801f311ea6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3db32b69003044b593cb9802344bb96c/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The ex-treasurer for U.S. Rep. George Santos pleaded guilty Thursday to a fraud conspiracy charge and implicated the indicted New York Republican in a scheme to embellish his campaign finance reports with a fake loan and fake donors.",
      "publishedAt": "2023-10-05T15:00:27Z",
      "title": "Ex-treasurer for Rep. George Santos pleads guilty to conspiracy, tells of bogus loan and fake donors",
      "url": "https://apnews.com/4d249e9d5e83fd25ed1a19a9e13d3246",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fc6a42dc43940949bd77ded15ce796c/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "HROZA, Ukraine (AP) — A Russian rocket blast turned a village cafe and store in eastern Ukraine into rubble Thursday, killing at least 51 civilians in one of the deadliest attacks in the war in months, according to President Volodymyr Zelenskyy and other top officials in Kyiv.",
      "publishedAt": "2023-10-05T08:49:52Z",
      "title": "Russian strike on cafe kills 51, Ukrainian officials say, as Zelenskyy seeks more Western support",
      "url": "https://apnews.com/f7c320ed2908b447f32bf32ede8caf2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5119676e3db94d6c86afcccdbbf9f122/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and ALBERT AJI",
      "description": "BEIRUT (AP) — A drone attack hit a crowded military graduation ceremony Thursday in the Syrian city of Homs, killing 80 people and wounding 240, the health minister said, in one of the deadliest recent attacks on an army that’s been fighting a civil war for more than a decade.",
      "publishedAt": "2023-10-05T07:27:09Z",
      "title": "Drone attack kills 80 and wounds 240 at a packed Syrian military graduation ceremony, official says",
      "url": "https://apnews.com/1de0a6b1572827dae766a6ba14fc7ac4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df31c60a113a47acae9f26fc77303513/3000.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — The former University of Southern California campus gynecologist at the center of more than $1 billion worth of university payouts stemming from sexual abuse allegations by hundreds of women was found dead inside his home Wednesday, his lawyer said.",
      "publishedAt": "2023-10-05T19:04:08Z",
      "title": "Ex-USC gynecologist charged with sexually assaulting students dies before going to trial",
      "url": "https://apnews.com/3b8b9e032d614f230a72e705c015f3d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b570914cc1d4f6193ba016ee5d70e67/3000.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A man who sprayed a New York City subway car with bullets during rush hour, wounding 10 people and sparking a citywide manhunt, was sentenced Thursday to life in prison after several of his victims tearfully and angrily recounted their ongoing trauma.",
      "publishedAt": "2023-10-05T04:11:13Z",
      "title": "‘Prophet of Doom’ who wounded 10 in New York City subway shooting is sentenced to life in prison",
      "url": "https://apnews.com/3cc4c99e94944514922844a6827138e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b79c68ffe2674d82a9fb51f66badf20d/3000.jpeg"
    },
    {
      "author": "ANDREW SELIGMAN",
      "description": "CHICAGO (AP) — A photo of Dick Butkus sneering behind his facemask filled the cover of Sports Illustrated’s 1970 NFL preview, topped by the headline, “The Most Feared Man in the Game.” Opponents who wound up on the business end of his bone-rattling hits could testify that wasn’t an exaggeration.",
      "publishedAt": "2023-10-05T22:56:19Z",
      "title": "Dick Butkus, fearsome Hall of Fame Chicago Bears linebacker, dies at 80",
      "url": "https://apnews.com/8272fe9638bf4d6aa9d65801966309d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4893210202a4ac9b85f8dde02ae5a90/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}