{
  "articles": [
    {
      "author": "ANITA SNOW and MORGAN LEE",
      "description": "PHOENIX (AP) — The Arizona Legislature devolved into shouts of “Shame! Shame!” on Wednesday as Republican lawmakers quickly shut down discussion on a proposed repeal of the state's newly revived 1864 law that criminalizes abortion throughout pregnancy unless a woman’s life is at risk.",
      "publishedAt": "2024-04-10T21:44:16Z",
      "title": "Shouts of ‘Shame! Shame!’ erupt in Arizona House as fight over abortion ban engulfs lawmakers",
      "url": "https://apnews.com/b43757f9a53848138c4d13e4315527ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/150a77a26d6e4944ac7633458bf71387/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, KAREEM CHEHAYEB and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — Israeli aircraft killed three sons of Hamas’ top political leader in the Gaza Strip on Wednesday, striking high-stakes targets at a time when Israel is holding delicate cease-fire negotiations with the militant group.",
      "publishedAt": "2024-04-10T07:24:52Z",
      "title": "An Israeli airstrike in Gaza kills 3 sons and 4 grandchildren of Hamas' top leader",
      "url": "https://apnews.com/fad770cbe77a7ae7d1de8568dbabd460",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b962828a2b247c78eefb231628a2eb0/1920.jpeg"
    },
    {
      "author": "BILL BARROW and ADRIANA GOMEZ LICON",
      "description": "ATLANTA (AP) — Donald Trump said Wednesday that an Arizona law that criminalizes nearly all abortions goes too far and called on Arizona lawmakers to change it, while also defending the overturning of Roe v.",
      "publishedAt": "2024-04-10T16:36:54Z",
      "title": "Trump says Arizona's abortion ban goes too far while defending the overturning of Roe v. Wade",
      "url": "https://apnews.com/7cdd6d2e3c320a89ec7a7c037824e7cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26c65ea66df9479db2e4efbc0857b64f/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and PHILIP MARCELO",
      "description": "NEW YORK (AP) — Allen Weisselberg, a retired executive in Donald Trump’s real estate empire, was sentenced Wednesday to five months in jail for lying under oath during his testimony in the civil fraud lawsuit brought against the former president by New York’s attorney general.",
      "publishedAt": "2024-04-10T04:03:25Z",
      "title": "Former Trump executive Allen Weisselberg sentenced to 5 months in jail for lying",
      "url": "https://apnews.com/b76cde56c6cb983ab8789f95d5a0c6c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/199535dc739a4e3cbcc7900efade0e8d/1920.jpeg"
    },
    {
      "author": "CLAUDIA LAUER",
      "description": "PHILADELPHIA (AP) — A joyful celebration of the end of Ramadan devolved into panic Wednesday in Philadelphia after rival groups exchanged gunfire, leaving at least three people injured and hundreds of parents and children to flee in search of safety.",
      "publishedAt": "2024-04-10T19:58:43Z",
      "title": "3 shot and 5 in custody after gunfire disrupts Philadelphia Eid event, police say",
      "url": "https://apnews.com/3b0b47dcdc49a5d7b9604d5aae87beb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a630cc8c8f842c8b44bd19d3b5cb1b8/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump is now 0 for 3 in last-minute attempts to get a New York appeals court to delay his looming hush money criminal trial. An appeals court judge Wednesday swiftly rejected the latest salvo from the former president’s lawyers, who argued he should be on the campaign trail rather than “in a courtroom defending himself” starting next week.",
      "publishedAt": "2024-04-10T19:25:14Z",
      "title": "New York appeals court rejects Donald Trump’s third request to delay Monday's hush money trial",
      "url": "https://apnews.com/43ce6ef13f3b7a2ea017a658e6b4e01b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d548f8630e84dd6868a127e9ccfd2b7/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden praised Prime Minister Fumio Kishida's “bold\" leadership on a series of global crises as he welcomed the Japanese leader to the White House on Wednesday for wide-ranging talks that touched on the delicate security situation in the Pacific, the war in Ukraine, the Israel-Hamas conflict and more.",
      "publishedAt": "2024-04-10T09:09:33Z",
      "title": "Biden praises Prime Minister Kishida's leadership and Japan's growing international clout",
      "url": "https://apnews.com/759416877deecdae289aea681963a194",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85e08a7fd77d4cb8a8671bb2714fe4e6/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "BRANDON, Miss. (AP) — Already sentenced to many years in federal prison, six white former Mississippi law enforcement officers who pleaded guilty to a long list of state and federal charges for torturing two Black men were sentenced Wednesday in state court.",
      "publishedAt": "2024-04-10T04:05:05Z",
      "title": "6 former Mississippi law officers sentenced in state court for torture of 2 Black men",
      "url": "https://apnews.com/3519cddc1f1e2827f28bb930045305d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3522e25e3694e05965df429f0f4f851/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — The top general for U.S. forces in Europe told Congress Wednesday that Ukraine will be outgunned 10 to one by Russia within a matter of weeks if Congress does not find a way to approve sending more ammunition and weapons to Kyiv soon.",
      "publishedAt": "2024-04-10T16:25:10Z",
      "title": "Ukraine will be outgunned by Russia 10 to 1 in weeks without US help, top Europe general says",
      "url": "https://apnews.com/b263dfaceef57fb2c1f74c53861734da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a44e0ed14a44b0995bb11ea328e6598/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "AUGUSTA, Ga. (AP) — More than golf's first major championship of the year, the Masters represents unification. This is the first time since July at the British Open the best players regardless of their tours compete against each other — same course, same tournament, same television network.",
      "publishedAt": "2024-04-10T19:41:34Z",
      "title": "Masters a reunion of the world's best players. But the numbers are shrinking",
      "url": "https://apnews.com/b227efc1bbb4ba14e098fe9a01c4fe54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5c26280c7b54cdfa1d9df041518cc6a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}