{
  "articles": [
    {
      "author": "ISABEL DEBRE, JULIA FRANKEL and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu told the nation Saturday night that the military has opened a “second stage” in the war against Hamas by sending ground forces into Gaza and expanding attacks from the ground, air and sea.",
      "publishedAt": "2023-10-28T05:34:13Z",
      "title": "Netanyahu says the Gaza war has entered a new stage and will be 'long and difficult'",
      "url": "https://apnews.com/c9bd7ecc5f4a9fe9d46486f66675244c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fad3aa872ee493b93cc5a5365661f28/1920.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — News from inside the besieged Gaza Strip trickles out in urgent tones from the few Palestinians still managing to connect with the outside world after intense Israeli bombardment plunged the crowded enclave into a communications blackout.",
      "publishedAt": "2023-10-28T20:41:47Z",
      "title": "Most Palestinians in Gaza are cut off from the world. Those who connect talk of horror, hopelessness",
      "url": "https://apnews.com/abd024625526f6d808c1583afd58e2e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afdc65367ba44931afc82f8b2bc89a88/2559.jpeg"
    },
    {
      "author": "JAKE BLEIBERG, PATRICK WHITTLE and DAVID SHARP",
      "description": "LEWISTON, Maine (AP) — Police missed two clear opportunities to end a dragnet that locked down and terrified Maine’s second-largest city after a gunman killed 18 people at a bowling alley and a bar following a recent spiral into paranoia.",
      "publishedAt": "2023-10-28T13:53:07Z",
      "title": "Maine mass killing suspect had mental health issues, purchased guns legally, authorities say",
      "url": "https://apnews.com/a13d50cfcda2d7ce19e7bfb1b64a5cb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f9ac3abb45b498a97099b95a6d115ea/1920.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — “Friends” star Matthew Perry, the Emmy-nominated actor whose sarcastic, but lovable Chandler Bing was among television’s most famous and most quotable characters, has died at 54.",
      "publishedAt": "2023-10-29T01:21:21Z",
      "title": "Matthew Perry, Emmy-nominated 'Friends' star, has died at 54, reports say",
      "url": "https://apnews.com/f2963e83691d2bd2a8626d85a69c73cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/408c9a35f03841df95e9ff299482abc3/3000.jpeg"
    },
    {
      "author": "TOM KRISHER, HALELUYA HADERO and COREY WILLIAMS",
      "description": "DETROIT (AP) — Jeep maker Stellantis reached a tentative contract agreement with the United Auto Workers union on Saturday as it escalated strikes against General Motors by adding a plant in Tennessee.",
      "publishedAt": "2023-10-28T17:12:26Z",
      "title": "UAW and Stellantis reach tentative contract deal as union adds strike at Tennessee GM factory",
      "url": "https://apnews.com/d32cb38791730c4c92a8b2112c205e59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce7e38ec0e844d7da93f8a09c84e15dc/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former Vice President Mike Pence on Saturday dropped his bid for the Republican presidential nomination, ending his campaign for the White House after struggling to raise money and gain traction in the polls.",
      "publishedAt": "2023-10-28T18:29:10Z",
      "title": "Pence ends White House campaign after struggling to gain traction. 'This is not my time,' he says",
      "url": "https://apnews.com/0ec44fc2a5b8683f34883e0ea72b2ab2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f141acc1a9547109e7ee30a0c8e5113/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — New House Speaker Mike Johnson inherits many of the same problems that bedeviled Republican leaders with far more experience.",
      "publishedAt": "2023-10-28T12:22:00Z",
      "title": "New Speaker Mike Johnson holds favor with conservatives. Can he unite the GOP where others failed?",
      "url": "https://apnews.com/92b118abced14e4b221f3ab0daf4e757",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/902af16961dc4bb3aca61270f18a697c/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel entered a new phase of its war on Hamas on Saturday, expanding its ground attacks after blacking out nearly all communication in the Gaza Strip with increased bombardment and artillery fire.",
      "publishedAt": "2023-10-28T06:45:04Z",
      "title": "Live updates | Israel pounds Gaza Strip, dismissing calls for cease-fire",
      "url": "https://apnews.com/3348f0544aa6d66b280c8cab1637a3db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59be4b3213dc4d0f86a6b0897307e0c1/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An Iranian teenage girl injured weeks ago in a mysterious incident on Tehran's Metro while not wearing a headscarf has died, state media reported Saturday.",
      "publishedAt": "2023-10-28T06:41:33Z",
      "title": "An Iranian teenager injured on Tehran Metro while not wearing a headscarf has died, state media say",
      "url": "https://apnews.com/16c4f49e15dd774121e7498f34bd6622",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b0764608fb94e1ab8b6cf0f90ad29d6/2920.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "ACAPULCO, Mexico (AP) — Kristian Vera stood on an Acapulco beach Saturday looking out toward dozens of sunken boats, including three of her own, all marked by floating buoys or just poking out of the water.",
      "publishedAt": "2023-10-28T05:04:37Z",
      "title": "Mexican security authorities raise Hurricane Otis death toll to 39",
      "url": "https://apnews.com/398e6957c0ea05e857d377d9f9c0b311",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/656aa74929d7467db04319f5e8dddc2d/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}