{
  "articles": [
    {
      "author": "BRIAN MELLEY",
      "description": "LONDON (AP) — WikiLeaks founder Julian Assange can appeal against extradition to the United States on espionage charges, a London court ruled on Monday — a decision that is likely to further drag out what has already been a long legal saga.",
      "publishedAt": "2024-05-20T06:02:22Z",
      "title": "London court rules WikiLeaks founder Assange can appeal against an extradition order to the US",
      "url": "https://apnews.com/28ebf4301cdd25efd5b087ab67d46c25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e9ffaac38714b8b86e04c75ae5c8a19/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — The chief prosecutor of the International Criminal Court said Monday he is seeking arrest warrants for Israeli and Hamas leaders, including Israeli Prime Minister Benjamin Netanyahu, in connection with their actions during the seven-month war between Israel and Hamas.",
      "publishedAt": "2024-05-20T11:16:12Z",
      "title": "ICC prosecutor seeks arrest warrant for Israeli and Hamas leaders, including Netanyahu",
      "url": "https://apnews.com/070941d21ccd1f2b9611032b88527575",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79716dd641134f2f9b461dc51a3fdebd/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iranian President Ebrahim Raisi, a hard-line protege of the country's supreme leader who helped oversee the mass executions of thousands in 1988 and later led the country as it enriched uranium near weapons-grade levels, launched a major attack on Israel and experienced mass protests, has died.",
      "publishedAt": "2024-05-20T04:43:25Z",
      "title": "Iranian President Ebrahim Raisi, supreme leader's protege, dies at 63 in helicopter crash",
      "url": "https://apnews.com/107ffb888540ef022a84ec719b81398c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a730dc7f962b43dcb25435d9ad5325d9/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY",
      "description": "LONDON (AP) — WikiLeaks founder Julian Assange can appeal against extradition to the United States on espionage charges, a London court ruled on Monday — a decision that is likely to further drag out what has already been a long legal saga.",
      "publishedAt": "2024-05-20T06:02:22Z",
      "title": "London court rules WikiLeaks founder Assange can appeal against an extradition order to the US",
      "url": "https://apnews.com/28ebf4301cdd25efd5b087ab67d46c25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e9ffaac38714b8b86e04c75ae5c8a19/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump's hush money trial is heading into the final stretch, with prosecutors' last and star witness back on the stand Monday for more grilling before the former president's lawyers get their chance to put on a case.",
      "publishedAt": "2024-05-20T04:02:40Z",
      "title": "Michael Cohen faces more grilling as Trump's hush money trial enters its final stretch",
      "url": "https://apnews.com/363a86879b97d2367831b1392f42689d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcdf87bf82ae406bb56522e76fe91edf/3000.jpeg"
    },
    {
      "author": null,
      "description": "BALTIMORE (AP) — The container ship that caused the deadly collapse of Baltimore's Francis Scott Key Bridge was refloated Monday and has begun slowly moving back to port.The Dali has remained at the collapse site since it lost power and crashed into one of the bridge’s supporting columns on March 26, killing six construction workers and snarling traffic into Baltimore Harbor.",
      "publishedAt": "2024-05-20T04:02:16Z",
      "title": "Ship that caused deadly Baltimore bridge collapse has been refloated and is moving back to port",
      "url": "https://apnews.com/83dde05d3ad999c88dd5270bb0cea1c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2bda657ce4b434abda71c2b12cd6f86/2000.jpeg"
    },
    {
      "author": "SIMINA MISTREANU and CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Taiwan’s new president, Lai Ching-te, said in his inauguration speech Monday that he wants peace with China and urged it to stop its military threats and intimidation of the self-governed island that Beijing claims as its own territory.",
      "publishedAt": "2024-05-20T01:18:20Z",
      "title": "Taiwan's new President Lai in his inauguration speech urges China to stop its military intimidation",
      "url": "https://apnews.com/af4ff1f254e11c24f751cea000fb42d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29ab99355f4949bf988c349f7c843a9d/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iranian President Ebrahim Raisi, the country’s foreign minister and several other officials were found dead on Monday, hours after their helicopter crashed in a foggy, mountainous region of the country’s northwest, state media reported.",
      "publishedAt": "2024-05-20T02:32:11Z",
      "title": "Iran's president, foreign minister and others found dead at helicopter crash site",
      "url": "https://apnews.com/426c6f4ae2dd1f0801c73875bb696f48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6f1e55a05be4be9bf37b9ba0b66b1ae/2500.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "People with HIV can breastfeed their babies, as long as they are taking medications that effectively suppress the virus that causes AIDS, a top U.S. pediatricians’ group said Monday in a sharp policy change.",
      "publishedAt": "2024-05-20T04:03:17Z",
      "title": "US pediatricians group reverses decades-old ban on breastfeeding for those with HIV",
      "url": "https://apnews.com/8e931d56f656e8c00f51bc3cd99c814e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44c093c7c0984531bfbf5484f03ad58c/2000.jpeg"
    },
    {
      "author": "PIYUSH NAGPAL and BISWAJEET BANERJEE",
      "description": "AYODHYA, India (AP) — When Indian Prime Minister Narendra Modi opened a Hindu temple on the site of a razed mosque in the holy city of Ayodhya in early 2024, he was making a bet on mixing Hindu nationalism and politics ahead of a national election in which he's seeking a rare third term.",
      "publishedAt": "2024-05-20T04:28:01Z",
      "title": "Modi's Hindu nationalist politics face a test as India holds fifth stage of national election",
      "url": "https://apnews.com/eb3af801bcddc2e2ae05318df8dfe856",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/912143ce00d84778be39d929bd16495d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}