{
  "articles": [
    {
      "author": "CHRIS MEGERIAN, JONATHAN J. COOPER and GARY D. ROBERTSON",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris and former President Donald Trump are making a beeline for swing states that they hope to flip in their favor this year, both of them trying to expand their narrow paths to victory in a closely fought presidential campaign.",
      "publishedAt": "2024-09-12T04:09:29Z",
      "title": "Harris and Trump are jockeying for battleground states after their debate",
      "url": "https://apnews.com/34bca16175c387a076131ad69bc18d47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/621836f883fc4320adc83ad9a21e9e62/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — New York City Police Commissioner Edward Caban resigned Thursday, one week after it emerged that his phone was seized as part of a federal investigation that touched several members of Mayor Eric Adams’ inner circle.",
      "publishedAt": "2024-09-12T16:01:56Z",
      "title": "New York City police commissioner resigns after his phone was seized in federal investigation",
      "url": "https://apnews.com/670388e653bc2d9bd19b7e7e9638e80d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d578afe788e4ce4a838dabd3ba7b226/3000.jpeg"
    },
    {
      "author": "ADAM GELLER and JALAL BWAITEL",
      "description": "JENIN, West Bank (AP) — In the web of battered, sun-baked streets winding up the hillside, bloodshed is as unrelenting as the heat. So it is not hard to see why, when raid sirens and gunfire erupted yet again on a morning in late May, 15-year-old Mahmoud Hamadneh turned his bike down an alley that held out the promise of refuge.",
      "publishedAt": "2024-09-12T11:03:25Z",
      "title": "As war rages in Gaza, Israel’s crackdown on West Bank insurgency is killing Palestinian youths",
      "url": "https://apnews.com/852c8a636713ed0d99956f0ec7504ecc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3485734a0eaa45cd91e8934c209aba9e/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A tech billionaire popped out from a SpaceX capsule hundreds of miles above Earth and performed the first private spacewalk Thursday, a high-risk endeavor once reserved for professional astronauts.",
      "publishedAt": "2024-09-12T06:00:40Z",
      "title": "Tech billionaire pulls off first private spacewalk high above Earth",
      "url": "https://apnews.com/87d4c78853f0249baf29631bedfac749",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6865b6d1ec0b49fba914bc549aa0c28e/1920.jpeg"
    },
    {
      "author": "DAVID SHARP and RON HARRIS",
      "description": "ATHENS, Ga. (AP) — The Postal Service’s new delivery vehicles aren’t going to win a beauty contest. They're tall and ungainly. The windshields are vast. Their hoods resemble a duck bill. Their bumpers are enormous.",
      "publishedAt": "2024-09-12T04:10:47Z",
      "title": "USPS' long-awaited new mail truck makes its debut to rave reviews from carriers",
      "url": "https://apnews.com/a2ebbfc7afec0eea2e036eef93bee4d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55ed4f6aa5ed4a03989d1b3afb6fd86c/3000.jpeg"
    },
    {
      "author": "ALI SWENSON and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Jim Duggan uses ChatGPT almost daily to draft marketing emails for his carbon removal credit business in Huntsville, Alabama. But he’d never trust an artificial intelligence chatbot with any questions about the upcoming presidential election.",
      "publishedAt": "2024-09-12T04:04:49Z",
      "title": "Most Americans don't trust AI-powered election information: AP-NORC/USAFacts survey",
      "url": "https://apnews.com/7131822c0f2ebe843b4c7e3cb111a3d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d7d3cebf34a4588b9962a64c6ac90ef/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Disgraced ex-movie mogul Harvey Weinstein has been indicted on additional sex crimes charges in New York ahead of a retrial in his landmark #MeToo case, Manhattan prosecutors said at a court hearing Thursday.",
      "publishedAt": "2024-09-12T14:33:04Z",
      "title": "Harvey Weinstein indicted on additional sex crimes charges ahead of New York retrial",
      "url": "https://apnews.com/76b7b85baf0472a2a3571824b100b5d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0e032722a7747678a7a90f4e3052da8/3000.jpeg"
    },
    {
      "author": "JAIMIE DING and AMY TAXIN",
      "description": "LOS ANGELES (AP) — A 4.7 magnitude earthquake rattled the Los Angeles area Thursday morning, unleashing boulders onto a Malibu road, visibly shaking Santa Monica's 1909 wooden pier and jolting some people from bed.",
      "publishedAt": "2024-09-12T14:51:30Z",
      "title": "A 4.7 magnitude earthquake rattles the Los Angeles area",
      "url": "https://apnews.com/25803cb194024135fba633f14a6b83ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2539512b23464aac9f8f879a1e7a1a0b/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — Health officials on Thursday said they don’t know how a Missouri person caught bird flu but believe it may be a rare instance of a “one-off\" standalone illness.Investigators trying to determine how the person caught the virus have not been able to confirm the exact strain of flu.",
      "publishedAt": "2024-09-12T16:57:39Z",
      "title": "Officials call Missouri bird flu case a 'one-off' and say risk to public is still low",
      "url": "https://apnews.com/808b4db88bc5e70ed32760d8b01f627b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21d4a63d2c6146d085f43b1be61f2e70/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "Coco loved being the life of the party — cracking jokes, doing pranks and making people laugh, her mom, Julianna Arnold, recalled recently.“Her favorite pastime was fashion,” Arnold said. “She didn’t like looking at magazines or going to fancy stores, but preferred to make her own creations from used clothing she would find at thrift stores....",
      "publishedAt": "2024-09-12T10:11:39Z",
      "title": "Dealers' paradise? How social media became a storefront for deadly fake pills as families struggle",
      "url": "https://apnews.com/8adb28d33f11cd3f52a104aa83a54e32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c1a2c4b28e1414a9621a73cffaa5a4d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}