{
  "articles": [
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory's health officials and emergency workers.",
      "publishedAt": "2024-06-21T18:21:32Z",
      "title": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50, Gaza health officials say",
      "url": "https://apnews.com/97701dddad7d558dc2ce92bf43016a95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f70e3c976e34aada1a46203ad0ea0ab/3000.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI",
      "description": "A relentless heat wave continued to bake most of the United States on Friday, with numerous areas expected to see record-breaking temperatures and forecasters warning there would likely be little relief through the weekend for most areas.",
      "publishedAt": "2024-06-21T17:35:30Z",
      "title": "Millions baking across the US as heat prolongs misery with little relief expected",
      "url": "https://apnews.com/e93d6f7d22ab0609c14a15fc5f14eef9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5b4a9dc54574fb7bec7fda872cf9d1e/1920.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The head of the Homeland Security Department said Friday that the agency tasked with responding to disasters across the country is prepared as it goes into what is expected to be an intense hurricane and wildfire season but he's concerned about looming budget shortfalls.",
      "publishedAt": "2024-06-21T20:55:53Z",
      "title": "FEMA is ready for an extreme hurricane and wildfire season, but money is a concern, Mayorkas says",
      "url": "https://apnews.com/f6b8c8c9713a4e0ea7a7bf28c7e55aa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22708f1bb8c647809ae106bd5a750f9b/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "Belinda Bukovitz was jolted into action by the sound of police outside her home shouting through a loudspeaker: “Go now, go now, go now!” Realizing this was not like other wildfires that had threatened her mountain village before, she, her husband, son and two cats bundled into three separate cars and fled.",
      "publishedAt": "2024-06-21T23:11:47Z",
      "title": "Escape from killer New Mexico wildfire was 'absolute sheer terror,’ says woman who fled the flames",
      "url": "https://apnews.com/be4907aa9570904e251ee193c05a2059",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c52019a8d7bc4ea6812da54025736ed0/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "FORT PIERCE, Fla. (AP) — Lawyers for Donald Trump made a longshot argument Friday that the Justice Department prosecutor who charged the former president with hoarding classified documents at his Florida estate was illegally appointed and that the case should therefore be dismissed.",
      "publishedAt": "2024-06-21T04:11:30Z",
      "title": "Trump lawyers in classified files case challenge prosecutor's appointment at start of 3-day hearing",
      "url": "https://apnews.com/00ca368253a7d53881ba54d83e7f6a6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b48d3b3044e4a84a6a7ce91ea5a5552/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Friday upheld a federal gun control law that is intended to protect victims of domestic violence.",
      "publishedAt": "2024-06-21T14:24:56Z",
      "title": "The Supreme Court upholds a gun control law intended to protect domestic violence victims",
      "url": "https://apnews.com/d63ee828e51911cc5e5a01780820f224",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef2323010b0f4ac4b027198b538cdc0a/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Prosecutors on Friday urged the judge overseeing Donald Trump’s criminal hush money case to uphold provisions of a gag order that bar him from criticizing jurors and court staff, while agreeing to lift a restriction on his public statements about trial witnesses.",
      "publishedAt": "2024-06-21T14:35:29Z",
      "title": "NY prosecutors urge judge to keep gag order blocking Trump from criticizing jurors who convicted him",
      "url": "https://apnews.com/017ee70af7749c225975bb428113dfd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e71698818ab43bbba7cff0fed2949b5/3000.jpeg"
    },
    {
      "author": "DIDI TANG and KEN MORITSUGU",
      "description": "BEIJING (AP) — With no obvious options, China appears to be keeping its distance as Russia and North Korea move closer to each other with a new defense pact that could tilt the balance of power among the three authoritarian states.",
      "publishedAt": "2024-06-21T06:55:39Z",
      "title": "Russia-North Korea pact could dent China's influence, but Beijing still holds sway over both",
      "url": "https://apnews.com/3998a978ed89fd42b6da654ab1572873",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf25a862584c4e7db29f79e6322ec617/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — President Joe Biden begins an intense period of private preparations Friday at Camp David for what may be the most consequential presidential debate in decades.",
      "publishedAt": "2024-06-21T04:12:22Z",
      "title": "How Biden and Trump are taking very different approaches to preparing for next week's debate",
      "url": "https://apnews.com/2f67b119f58136b310b625e42fad3d3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d8956ae2e9d4a5a9704194e7e19df75/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — The Food and Drug Administration on Friday authorized the first menthol-flavored electronic cigarettes for adult smokers, acknowledging that vaping flavors can reduce the harms of traditional tobacco smoking.",
      "publishedAt": "2024-06-21T15:26:37Z",
      "title": "FDA OKs first menthol e-cigarettes, citing potential to help adult smokers",
      "url": "https://apnews.com/6493efc348291434af9d7c88601154e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/258ccf320c6840bb956121fbece31820/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}