{
  "articles": [
    {
      "author": "Lindsey Bahr",
      "description": "Diane Keaton, the Oscar-winning star known for films like “Annie Hall” and “The Godfather,” has died at 79. People Magazine reported her death on Saturday in California, citing a family spokesperson. No further details were immediately available. The news has shocked fans worldwide. Her unique style and depth made her a standout actor of her generation. She became iconic with roles like Annie Hall and Kay Adams. Her career spanned decades, charming audiences in films like “Baby Boom,” “Father of the Bride,” and “First Wives Club.” Keaton's legacy in film remains timeless.",
      "publishedAt": "2025-10-11T20:00:06Z",
      "title": "Diane Keaton, 'Annie Hall,' 'The Godfather' actor, dead at 79",
      "url": "https://apnews.com/article/diane-keaton-dead-d2f890b961fb906cfbbbab4b7af309c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/f2be209/2147483647/strip/true/crop/2680x1508+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F12%2Fdf4b8e1b968463b5ea244a7c7611%2F2ae52a572ac94687b0a9c16f5dd1b03b"
    },
    {
      "author": null,
      "description": "National Guard troops sent to Illinois by President Donald Trump can stay in the state and under federal control, but can’t be deployed to protect federal property or go on patrol for now, an appeals court ruled Saturday. The decision comes after federal Judge April Perry on Thursday ruled to temporarily block the National Guard deployment for at least two weeks, finding no substantial evidence that a “danger of rebellion” is brewing in Illinois during Trump’s immigration crackdown.",
      "publishedAt": "2025-10-11T20:58:12Z",
      "title": "Court: National Guard troops can stay in Illinois for now but can’t be deployed",
      "url": "https://apnews.com/article/national-guard-troops-memphis-chicago-trump-96d489ab1b325c90da6f75a23efcf479",
      "urlToImage": "https://dims.apnews.com/dims4/default/be6551f/2147483647/strip/true/crop/7813x4395+0+407/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F06%2F691c2416b976a200014460019ece%2F91977f10a75d4d66afc50d52638b9d5d"
    },
    {
      "author": "Darlene Superville",
      "description": "President Donald Trump says he's directed the Defense Department to use “all available funds” to ensure that U.S. troops are paid on Wednesday despite the government shutdown. Trump said in a social media post Saturday that he was acting because “our Brave Troops will miss the paychecks they are rightfully due on October 15th.” He said he was using his authority as commander in chief to direct Defense Secretary Pete Hegseth “to use all available funds\" to make sure the troops are paid. They were in danger of not receiving their next paycheck on Wednesday after the government shut down on Oct. 1, the start of the federal budget cycle.",
      "publishedAt": "2025-10-11T18:00:37Z",
      "title": "Trump directs Pentagon to ensure troops are paid despite shutdown",
      "url": "https://apnews.com/article/trump-military-pay-troops-government-shutdown-8601ea092fe746cc35b88076e70c4598",
      "urlToImage": "https://dims.apnews.com/dims4/default/bdd7884/2147483647/strip/true/crop/6776x3812+0+352/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fc5%2F4becdb7f0c5810fc5e5b9453e074%2F7b3b03d314844f5191388161e98b8fd9"
    },
    {
      "author": "Abdel Kareem Hana, Sam Metz, Sarah El Deeb, Sam Mednick",
      "description": "Tens of thousands of displaced Palestinians are returning to their neighborhoods as a ceasefire between Israel and Hamas enters its second day. Aid groups are preparing to scale up relief work but many will find their homes reduced to rubble. UNICEF is urging Israel to reopen more border crossings to allow aid to flow freely. About 200 U.S. troops have arrived in Israel to help retrieve hostages and monitor the ceasefire. Israel’s military confirmed the ceasefire took effect Friday, and expanded aid deliveries are set to begin Sunday. The conflict has displaced around 90% of Gaza’s population.",
      "publishedAt": "2025-10-11T11:53:32Z",
      "title": "Palestinians return home to ruins as ceasefire holds",
      "url": "https://apnews.com/article/israel-hamas-gaza-trump-ceasefire-884178522d04ecf96a951a89d1a90e53",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f1b643/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F38%2Fc2e16d1da3acd72569803bf76dae%2Fa0214edde39442228aebaa1c91968933"
    },
    {
      "author": "The Associated Press",
      "description": "Fans and fellow actors are paying tribute to Diane Keaton after news of her death at age 79. The Oscar-winner's performances and style shaped iconic films like “The Godfather” and “Annie Hall.” Co-stars such as Bette Midler, Steve Martin and Mandy Moore shared heartfelt messages. Midler praised Keaton's originality and humor. Martin recalled their delightful relationship. Cynthia Nixon called Keaton her idol. Mandy Moore cherished working with her. Octavia Spencer thanked Keaton for her authenticity. And Ben Stiller hailed her as one of the greatest film actors ever.",
      "publishedAt": "2025-10-11T23:46:41Z",
      "title": "Steve Martin, Bette Midler and more react to news of Diane Keaton's death",
      "url": "https://apnews.com/article/diane-keaton-tributes-77ec4014b0bf2dcf25895d04fe7166b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/b080a91/2147483647/strip/true/crop/1980x1114+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F4e%2Fd2ede4a1b29304bace7736c4ccd1%2Fa758b2cb86fb4c948a8ed862e28249f8"
    },
    {
      "author": "Samy Magdy, Lee Keath",
      "description": "A ceasefire is holding in Gaza between Israel and Hamas after two years of war. The deal’s first phase is meant to free remaining hostages from Gaza within days in exchange for the release of hundreds of Palestinians imprisoned by Israel. Hamas is to begin releasing the remaining 48 hostages by Monday. Around 20 of them are believed to be alive. Many questions remain over what happens next. Israeli troop withdrawal and Hamas disarmament are among them, along with the future governance of Gaza. Here is what we know about the U.S.-proposed ceasefire deal.",
      "publishedAt": "2025-10-11T18:42:40Z",
      "title": "Next steps in plan to pause the war in Gaza",
      "url": "https://apnews.com/article/gaza-war-ceasefire-next-steps-israel-palestinians-3deb1b8a211c4658d8f42048cc7ac71f",
      "urlToImage": "https://dims.apnews.com/dims4/default/fdbd688/2147483647/strip/true/crop/7093x3990+0+370/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2Fca%2Fc822af4cc3301d210e5f23697c19%2F04822288b6234b3990af99a6f2d21ec9"
    },
    {
      "author": "Aung Shine Oo",
      "description": "Kyaukme, a once-thriving town in Myanmar’s Shan State, is in shambles, targeted by both sides in the Southeast Asian country’s bitter civil war because of its strategic location at a key junction on the trading route to China. An Associated Press journalist has confirmed the damage in a rare visit to the war-torn area allowed by the country’s military government. The town has changed hands twice since the army seized power in 2021. An ethnic minority guerrilla group captured the town in August last year, but it fell back into the hands of the military government on Oct. 1. The recapture of the town is a major victory for the government, coming after the resistance was widely believed to have won control of most of the country.",
      "publishedAt": "2025-10-12T03:15:25Z",
      "title": "Myanmar's civil war leaves a strategic town in shambles",
      "url": "https://apnews.com/article/myanmar-shan-tnla-civil-war-kyaukme-f01ac6752ba36f0ef6c34a151510f45e",
      "urlToImage": "https://dims.apnews.com/dims4/default/61c1749/2147483647/strip/true/crop/8033x4519+0+418/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2Fd8%2Fa27cc90394d122397f748b7ef055%2F97131cd55e2c4d99aff352bda306e0ed"
    },
    {
      "author": "The Associated Press",
      "description": "National Guard troops have started patrolling in Memphis, Tennessee. At least nine National Guard troops began their patrol Friday at a store and tourist center in Memphis. Protests have been ongoing at an Immigration and Customs Enforcement detention center near Chicago, and two U.S. senators say they were denied entry to the facility on Friday. A federal judge has blocked the deployment of Guard members to Chicago for at least two weeks, citing no significant evidence of a “danger of rebellion” to justify the deployment. Trump insists that crime is rampant in Democrat-led cities including Chicago and Portland, Oregon, where a separate court battle is keeping troops from being deployed.",
      "publishedAt": "2025-10-11T04:05:22Z",
      "title": "What to know about National Guard in Memphis and other US cities",
      "url": "https://apnews.com/article/national-guard-troops-memphis-cities-0554c0428e23cf336404fc8a21d632bf",
      "urlToImage": "https://dims.apnews.com/dims4/default/9aa094a/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F3d%2Fb451a8836128a38449d319cd91d2%2F158f0246f9f941e9a36165f5c1f52b4c"
    },
    {
      "author": "The Associated Press",
      "description": "Power has been restored to over 800,000 residents in Kyiv, a day after Russia launched major attacks on Ukraine's power grid, causing widespread blackouts. Russian drone and missile strikes wounded at least 20 people and damaged residential buildings. Ukraine’s largest private energy company, DTEK, said Saturday the main work to restore power is complete, though some outages remain. Ukrainian President Volodymyr Zelenskyy has called for stronger air defenses and tighter sanctions on Russia. Meanwhile, leaders of Britain, France, and Germany have agreed to proceed towards using hundreds of billions of frozen Russian assets to support Ukraine’s war effort.",
      "publishedAt": "2025-10-11T07:12:01Z",
      "title": "Power restored to 800,000 in Kyiv after major Russian strikes on Ukraine's energy grid",
      "url": "https://apnews.com/article/russia-ukraine-war-power-grid-assets-fe589dd9e12368d071fdfedf8819c15e",
      "urlToImage": "https://dims.apnews.com/dims4/default/30e43b4/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2Fdc%2Fc6f333bbcb9663b558d1fc71b819%2F044bb9be65804bbfafac5610e0971e85"
    },
    {
      "author": "Travis Loller",
      "description": "Officials are investigating a blast that leveled an explosives plant in rural Tennessee, as families of the 18 people missing and feared dead wait anxiously for answers. The blast occurred Friday at Accurate Energetic Systems, about 60 miles southwest of Nashville. The cause of the explosion is not yet known. The company processes explosives and ammunitions for the military. Residents miles away reported feeling the explosion. A mass of twisted metal, burned-out shells of cars and an array of debris were left behind. The company said in a post on social media on Friday that their “thoughts and prayers” are with the families and community impacted.",
      "publishedAt": "2025-10-11T04:49:20Z",
      "title": "Families of missing wait anxiously as officials probe deadly Tennessee plant explosion",
      "url": "https://apnews.com/article/tennessee-explosives-plant-blast-investigation-cb8f8621306d50d6c54b523041a21322",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba337fe/2147483647/strip/true/crop/2953x1661+36+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F8a%2F79004da919fd8ed0c645fc701c41%2F418b8a50f7d144a7bdcbc916edf9612d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}