{
  "articles": [
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — Louisiana has become the first state to require that the Ten Commandments be displayed in every public school classroom, the latest move from a GOP-dominated Legislature pushing a conservative agenda under a new governor.",
      "publishedAt": "2024-06-19T17:59:13Z",
      "title": "New law requires all Louisiana public school classrooms to display the Ten Commandments",
      "url": "https://apnews.com/571a2447906f7bbd5a166d53db005a62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8e026827351427c8a68b89dc84c6af1/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN and ELENA BECATOROS",
      "description": "JERUSALEM (AP) — The Israeli army’s chief spokesman on Wednesday appeared to question the stated goal of destroying the Hamas militant group in Gaza in a rare public rift between the country’s political and military leadership.",
      "publishedAt": "2024-06-19T20:34:04Z",
      "title": "Rifts seem to appear between Israel's political and military leadership over conduct of the Gaza war",
      "url": "https://apnews.com/e8a9f21df42e7602ada9c3d29d9bbf83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd4d5eda05b24577b249b5e1f7ebbf68/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — A blistering heat wave Wednesday extended from the Midwest to New England, leaving millions of people sweltering through the Juneteenth holiday, including in places like northern Maine where they rarely experience such conditions this early in the year.",
      "publishedAt": "2024-06-19T05:02:56Z",
      "title": "Scorching temperatures, humidity making life miserable for millions from Midwest to Maine",
      "url": "https://apnews.com/f4877dd84b047cdb7f4b5f2ae61da106",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91d1e964daad499ba9b2e8662a4a484e/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Both Russian President Vladimir Putin and North Korean leader Kim Jong Un say the strategic partnership they signed Wednesday is a breakthrough.",
      "publishedAt": "2024-06-19T15:50:46Z",
      "title": "What's known, and not known, about the partnership agreement signed by Russia and North Korea",
      "url": "https://apnews.com/7221909867dbb999de8adb23604e3c79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bd2c7d9afed4db2a8ff84a83e363793/1920.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDRÉS LEIGHTON",
      "description": "ROSWELL, N.M. (AP) — Heavy rain and hail fell Wednesday around an evacuated village in New Mexico threatened by wildfires that have killed at least one person and damaged more than 1,400 structures, offering the hope of some assistance for firefighters but adding the threat of high winds and flash floods.",
      "publishedAt": "2024-06-19T05:34:15Z",
      "title": "Rain could help fight growing New Mexico blazes, but floods and wind a danger",
      "url": "https://apnews.com/7d367792f6ea70d4fdb1248c15e6899d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3fd2182203f4d86bf03e3b8c4bb1ca4/1920.jpeg"
    },
    {
      "author": "JAMIE STENGLE and MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Tropical Storm Alberto formed on Wednesday in the southwestern Gulf of Mexico, the first named storm of what is forecast to be a busy hurricane season.",
      "publishedAt": "2024-06-19T15:05:01Z",
      "title": "Tropical Storm Alberto forms in southwest Gulf, 1st named storm of the hurricane season",
      "url": "https://apnews.com/53b8efa54caf43e7bc746126d28bfa04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45bd86dfffaf4ab88807a6cb74aea411/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — Scientists studying a family plagued by early-in-life Alzheimer’s found some carry a genetic oddity that delays their initial symptoms by five years.The finding points to novel ways of fighting the mind-robbing disease – if researchers can unravel how a single copy of that very rare gene variant offers at least a little protection.",
      "publishedAt": "2024-06-19T21:02:39Z",
      "title": "Colombian family's genes offer new clue to delaying onset of Alzheimer's",
      "url": "https://apnews.com/4faa3b786bfb39152915d23049e754fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/786bd5972d614209ab119beb618e0cef/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Hundreds of thousands of immigrants had reason to rejoice when President Joe Biden unveiled a highly expansive plan to extend legal status to spouses of U.S. citizens but, inevitably, some were left out.",
      "publishedAt": "2024-06-19T05:06:18Z",
      "title": "Immigrant families rejoice over Biden's expansive move toward citizenship, while some are left out",
      "url": "https://apnews.com/376a0a568c85dac1ff856af2157f677f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9322626f4e924ebba0af7e35bdb269d1/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and JON GAMBRELL",
      "description": "ABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA (AP) — The combat markings emblazoned on the F/A-18 fighter jet tell the story: 15 missiles and six drones, painted in black just below the cockpit windshield.",
      "publishedAt": "2024-06-19T10:42:31Z",
      "title": "A US aircraft carrier and its crew have fought Houthi attacks for months. How long can it last?",
      "url": "https://apnews.com/87e18d297b24e173da01b0ae1182ab6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05cc162bf78341c9a564bea53a3f6568/3000.jpeg"
    },
    {
      "author": null,
      "description": "MONTGOMERY, Ala. (AP) — Thousands of surnames grace the towering monument, representing the more than 4 million enslaved people who were freed after the Civil War.The Equal Justice Initiative, a criminal justice reform nonprofit, invoked the Juneteenth holiday — the day that commemorates the end of slavery in the U.S.",
      "publishedAt": "2024-06-19T20:41:48Z",
      "title": "On Juneteenth, monument dedicated in Alabama to those who endured slavery",
      "url": "https://apnews.com/6d6b721da53872a9b81cc913d209143a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5c9051f4f5c4c638eb9cde2c2c2d21d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}