{
  "articles": [
    {
      "author": "BASSEM MROUE, JOHNSON LAI, and JUSTIN SPIKE",
      "description": "BEIRUT (AP) — Walkie-talkies and solar equipment exploded in Beirut and other parts of Lebanon on Wednesday in an apparent second wave of attacks targeting devices a day after pagers used by Hezbollah blew up, state media and officials for the militant group said.",
      "publishedAt": "2024-09-18T06:12:52Z",
      "title": "Lebanon is rocked again by exploding devices as Israel declares a 'new phase' of war",
      "url": "https://apnews.com/ce6af3c2e6de0a0dddfae48634278288",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/718b7f9af95244a7ad35e66c38402e18/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — With Israel's defense minister announcing a “new phase” of the war and an apparent Israeli attack setting off explosions in electronic devices in Lebanon, the specter of all-out combat between Israel and Hezbollah seems closer than ever before.",
      "publishedAt": "2024-09-18T20:15:01Z",
      "title": "A war with Hezbollah may be looming. Is Israel prepared?",
      "url": "https://apnews.com/df4c835ee3d1471e79d1a7fe951226bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/961b243688a042ad8b77de2cbd3271d0/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, LARRY NEUMEISTER and ANDREW DALTON",
      "description": "NEW YORK (AP) — Sean “Diddy” Combs is staying locked up after a judge Wednesday rejected the hip-hop mogul’s proposal that he await his sex trafficking trial in the luxury of his Florida mansion instead of a grim Brooklyn federal jail.",
      "publishedAt": "2024-09-18T04:04:57Z",
      "title": "Sean 'Diddy' Combs will stay in jail after bail is denied for a second time",
      "url": "https://apnews.com/b60db3252403f2bfbe24c54b34f0cfdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90d318800f4e4362be7c4ad9e00e0b99/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MICHAEL BALSAMO",
      "description": "NEW YORK (AP) — As they unsuccessfully fought to keep Sean “Diddy” Combs out of jail after his sex trafficking arrest, the music mogul’s lawyers highlighted a litany of horrors at the Brooklyn federal lockup where he was headed: horrific conditions, rampant violence and multiple deaths.",
      "publishedAt": "2024-09-18T18:56:36Z",
      "title": "Inside the Brooklyn federal jail where Sean ‘Diddy’ Combs is locked up: violence, squalor and death",
      "url": "https://apnews.com/8c910839adf3ac54a8adc8d7cb3f0b79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdb675ee8372431ebf3b14660afdf0a2/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and DAVID KLEPPER",
      "description": "WASHINGTON (AP) — Iranian hackers sought to interest President Joe Biden's campaign in information stolen from rival Donald Trump's campaign, sending unsolicited emails to people associated with the then-Democratic candidate in an effort to interfere in the 2024 election, the FBI and other federal agencies said Wednesday.",
      "publishedAt": "2024-09-18T21:57:39Z",
      "title": "Iranian hackers tried but failed to interest Biden's campaign in stolen Trump info, FBI says",
      "url": "https://apnews.com/ae96f57f438772dac08e076be7aa4904",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d611764fa25e46febb28abe8147f11cf/3000.jpeg"
    },
    {
      "author": "MEG KINNARD, AAMER MADHANI and JILL COLVIN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris on Wednesday criticized Republican Donald Trump 's promise to deport millions of people who are in the United States illegally, questioning whether he would rely on massive raids and detention camps to carry it out.",
      "publishedAt": "2024-09-18T11:09:21Z",
      "title": "Harris hits Trump's promise of mass deportations as Trump rallies on Long Island",
      "url": "https://apnews.com/367611170a28f470afc537dcefe158ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1565a1a9314045059e66a62510d84dd2/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and TOM KRISHER",
      "description": "WASHINGTON (AP) — The International Brotherhood of Teamsters declined Wednesday to endorse Kamala Harris or Donald Trump for president, saying neither candidate had sufficient support from the 1.3 million-member union.",
      "publishedAt": "2024-09-18T19:12:52Z",
      "title": "Teamsters union declines to endorse Trump or Harris for president",
      "url": "https://apnews.com/2d29668ace1ce239b7b6b209409bb6f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/081191de5be24f12ad5eaf5347b62b37/2844.jpeg"
    },
    {
      "author": "KATE PAYNE",
      "description": "TALLAHASSEE, Fla. (AP) — Around the country, communities are being battered by a wave of school shooting threats, sparking emergency notifications, urgent group chats and heightened fears among parents that their child’s school could be the next Parkland or Sandy Hook or Uvalde — or any other town hit by mass shootings.",
      "publishedAt": "2024-09-18T21:24:17Z",
      "title": "Sheriff's posting of the mugshot of a boy accused of school threat draws praise, criticism",
      "url": "https://apnews.com/f574d20cc4926760672576de217726f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffa72effdfa24fdb9e88b8cc0ae43579/1450.jpeg"
    },
    {
      "author": "LEA SKENE and ALANNA DURKIN RICHER",
      "description": "BALTIMORE (AP) — The owner and manager of the cargo ship that caused the deadly Baltimore bridge collapse recklessly cut corners and ignored known electrical problems on the vessel, the Justice Department alleged Wednesday in a lawsuit seeking to recover more than $100 million that the government spent to clear the underwater debris and reopen the city’s port.",
      "publishedAt": "2024-09-18T14:31:40Z",
      "title": "Ship owner cut corners on repairs before deadly Baltimore bridge collapse, US says in $100M lawsuit",
      "url": "https://apnews.com/5a7b3d6a3f7ea04828bf7801df07a34e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f00d441639e44b52939a6634cac21183/1920.jpeg"
    },
    {
      "author": "CORA LEWIS",
      "description": "NEW YORK (AP) — The Federal Reserve has cut its benchmark interest rate from its 23-year high, with consequences for debt, savings, auto loans, mortgages and other forms of borrowing by consumers and businesses.",
      "publishedAt": "2024-09-18T18:12:42Z",
      "title": "The Federal Reserve is finally lowering rates. Here's what consumers should know",
      "url": "https://apnews.com/6127436dd3e6d8af48825aca6d3a7715",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a08e94d0a9df42718b6ea7a530a99638/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}