{
  "articles": [
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Over 75 million people in the United States were under extreme heat alerts Monday as a heat wave moved eastward, and the mid-Atlantic and New England were likely to see highs in the 90s as the week progresses.",
      "publishedAt": "2024-06-17T05:28:48Z",
      "title": "Over 75 million people in the US are under heat alerts. Go indoors and hydrate",
      "url": "https://apnews.com/43b96b6f2996b9735e8b201b8dd3cc31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/202dc979802c414699adfa41339284b3/1920.jpeg"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "The U.S. surgeon general has called on Congress to require warning labels on social media platforms and their effects on young people's lives, similar to those now mandatory on cigarette boxes.",
      "publishedAt": "2024-06-17T11:23:32Z",
      "title": "Tobacco-like warning label for social media sought by US surgeon general who asks Congress to act",
      "url": "https://apnews.com/df321c791493863001754401676f165c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b09ea9d836a24d9aad9189063f9bd63e/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JACK JEFFERY",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu disbanded his war Cabinet Monday, a move that consolidates his influence over the Israel-Hamas war and likely diminishes the odds of a cease-fire in the Gaza Strip anytime soon.",
      "publishedAt": "2024-06-17T18:45:00Z",
      "title": "Netanyahu dissolved his war Cabinet. How will that affect cease-fire efforts?",
      "url": "https://apnews.com/b50f7fe8913b06aaba377ae6b37c3fed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c38448b700c4e95b35cd3d7bd2096ee/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — He is among the very last survivors of his Gaza family, a clan so close they knew without thinking how blood and marriage bound them across generations and city blocks.Then, branch by branch, 173 of Youssef Salem’s relatives were killed in Israeli airstrikes in a matter of days in December.",
      "publishedAt": "2024-06-17T05:15:25Z",
      "title": "The war in Gaza has wiped out entire Palestinian families. AP documents 60 who lost dozens or more",
      "url": "https://apnews.com/a9f8bcfe402c17f1f78903eae67b7a7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c529c6fa62643198f06875bc622fd83/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden’s reelection campaign is spending $50 million through the end of June, a blitz that includes its first television ad trumpeting Donald Trump’s felony conviction and signals that the Democratic incumbent is seeking to make his Republican opponent’s legal woes a bigger issue heading into November.",
      "publishedAt": "2024-06-17T09:01:25Z",
      "title": "Biden's campaign announces a $50 million advertising blitz highlighting Trump's conviction",
      "url": "https://apnews.com/bab63848426b8eb2134bb144dbb4d05b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b7ee026064c44e8a6ac9acd18241c32/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES, SEUNG MIN KIM and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — President Joe Biden is planning to announce a sweeping new policy Tuesday that would lift the threat of deportation for tens of thousands of people married to U.S. citizens, an aggressive election-year action on immigration that had been sought by many Democrats.",
      "publishedAt": "2024-06-17T19:21:36Z",
      "title": "Biden will announce deportation protection and work permits for spouses of US citizens",
      "url": "https://apnews.com/509d520529867db6a77ddcf2dcebe2a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38946ef89221476186ecc10bd6c0cab8/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — New leaders of The Washington Post are being haunted by their pasts, with ethical questions raised about their actions as journalists in London that illustrate very different press traditions in the United States and England.",
      "publishedAt": "2024-06-17T21:51:51Z",
      "title": "The Washington Post's leaders are taking heat for journalism in Britain that wouldn't fly in the US",
      "url": "https://apnews.com/d215e7c2d598071ea23a63e5ddd62f0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da5042dc42b94021b86de1e5e39ab0e8/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "SEATTLE (AP) — BNSF Railway must pay nearly $400 million to a Native American tribe in Washington state, a federal judge ordered Monday after finding that the company intentionally trespassed when it repeatedly ran 100-car trains carrying crude oil across the tribe's reservation.",
      "publishedAt": "2024-06-17T19:02:35Z",
      "title": "Judge orders railway to pay Washington tribe nearly $400 million for trespassing with oil trains",
      "url": "https://apnews.com/779e51b8abc5970580ff940655f55288",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/498cc6fbf8d24cab8fa7bb051b5fd7d1/1600.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "FRANKFORT, Ky. (AP) — The Biden administration's effort to expand protections for LGBTQ+ students hit another roadblock Monday, when a federal judge in Kentucky temporarily blocked the new Title IX rule in six additional states.",
      "publishedAt": "2024-06-17T16:14:14Z",
      "title": "Biden's Title IX law expanding protections for LGBTQ+ students is dealt another setback",
      "url": "https://apnews.com/9f7b89ec50657436e0e8110799b576d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bc10d6bb3614eee871c363d270f6646/3000.jpeg"
    },
    {
      "author": "BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — Maryland Gov. Wes Moore ordered more than 175,000 pardons for marijuana convictions on Monday, saying the “most sweeping state-level pardon in any state” will help reverse harms from the past caused by the war on drugs.",
      "publishedAt": "2024-06-17T06:30:47Z",
      "title": "Tens of thousands of Marylanders receive pardons for marijuana convictions",
      "url": "https://apnews.com/003a11d2435eabaa060d2d26da63ce42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbf1fbafeec64fe68e94b8abb7a354b0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}