{
  "articles": [
    {
      "author": "Aamer Madhani, Zeke Miller",
      "description": "President Donald Trump is opening his four-day Mideast trip by paying a visit to Saudi Arabia's de facto ruler, Crown Prince Mohammed bin Salman. The two leaders on Tuesday are expected to hold talks on U.S. efforts to dismantle Iran’s nuclear program, end the war in Gaza, hold down oil prices and more. The crown prince is also expected to fete Trump with a formal dinner and a gathering of members of the Gulf Cooperation Council. It is made up of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates.",
      "publishedAt": "2025-05-13T04:04:02Z",
      "title": "Trump will open his Mideast trip by visiting the Saudi crown prince",
      "url": "https://apnews.com/article/trump-mideast-saudi-arabia-mbs-qatar-uae-b782fe922d09afced2e1074b65016e80",
      "urlToImage": "https://dims.apnews.com/dims4/default/7bdccb3/2147483647/strip/true/crop/1854x1043+0+141/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F3c%2F2066f6d60518b41f2254b6cda58d%2F087de7573919499cab0660a97efdee78"
    },
    {
      "author": "Zeke Miller, Bassem Mroue, Aamer Madhani",
      "description": "President Donald Trump will meet with Syrian President Ahmad al-Sharaa, the onetime insurgent who last year led the overthrow of former leader Bashar Assad. The U.S. has been weighing how to handle al-Sharaa since he took power in December. Gulf leaders, have rallied behind the new government in Damascus and will want Trump to follow, believing it is a bulwark against Iran’s return to influence in Syria, where it had helped prop up Assad’s government during a decade-long civil war.",
      "publishedAt": "2025-05-13T15:26:05Z",
      "title": "Trump to meet with Syria's Ahmad al-Sharaa in Saudi Arabia",
      "url": "https://apnews.com/article/ahmad-alsharaa-trump-syria-bashar-al-assad-6facdef5b881286955b95e0c5b2704d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/4bc3d0c/2147483647/strip/true/crop/4806x2703+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2Fab%2F0e154df7fa979eeec1fe9609ab05%2F0090c35234404204a8195a2bb3fe3cf6"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "The R&B singer Cassie is poised to testify in Sean “Diddy” Combs sex trafficking trial. Testimony resumes Tuesday in New York. Combs is accused of forcing women including Cassie into drugged-up sex parties he described as “freak-offs.” Prosecutors say he used his status as a powerful executive to coerce women into abusive sexual encounters. Lawyers for three-time Grammy winner told the jury that while Combs could be violent, he never veered into sex trafficking or racketeering. Cassie has been at the center of Combs’ stunning downfall. She sued him in 2023 alleging years of abuse. A surveillance video made public last year showed Combs beating her at a Los Angeles hotel in 2016.",
      "publishedAt": "2025-05-13T04:02:07Z",
      "title": "R&B singer Cassie set to testify in Sean 'Diddy' Combs sex trafficking trial",
      "url": "https://apnews.com/article/diddy-sex-trafficking-freak-offs-cassie-f61773689c057e0264d5a755b40b825a",
      "urlToImage": "https://dims.apnews.com/dims4/default/b23893a/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F21%2F0648a7fb5a77565263e0bf56bdf4%2F42829eefa2b842cf8e34d7f8cf1de00c"
    },
    {
      "author": "Thomas Adamson, John Leicester, Nicolas Vaux-montagny",
      "description": "Kim Kardashian has arrived at a Paris courthouse to testify against the men accused of robbing her at gunpoint in 2016, an event that reshaped her life and redefined celebrity security in the age of social media. This will be the first time she has faced the alleged assailants since that night, when she begged for her life as masked men bound her with zip ties and stole over $6 million in jewelry. Kardashian’s appearance is expected to be the emotional centerpiece of a trial that has captivated France.",
      "publishedAt": "2025-05-13T05:15:50Z",
      "title": "Kim Kardashian arrives to testify at Paris robbery trial",
      "url": "https://apnews.com/article/kim-kardashian-trial-paris-fashion-week-b06a96edfa5271de2d92870dcafe2796",
      "urlToImage": "https://dims.apnews.com/dims4/default/e9fd950/2147483647/strip/true/crop/3738x2103+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F29%2Fb0ec2a96a6727175c4ecfbe3febe%2F8a48e0dc91774e9fa60f50712d9b6acb"
    },
    {
      "author": "Lisa Mascaro, Kevin Freaking",
      "description": "Tax breaks tallying more than $5 trillion. But also sizable reductions in Medicaid health care, food stamps for older Americans and green energy strategies to fight climate change. Those are all up for debate Tuesday as the House Republicans launch marathon public hearings on President Donald Trump's “big, beautiful bill.” It’s a long day and night ahead as Republicans work to push Trump’s signature legislative package through a gauntlet of committee hearings over mounting opposition from Democrats, advocacy groups and even some wary Republicans themselves. House Speaker Mike Johnson hopes to send the Senate the bill by Memorial Day.",
      "publishedAt": "2025-05-13T17:33:35Z",
      "title": "House Republicans launch marathon hearings to push for Trump's budget bill",
      "url": "https://apnews.com/article/trump-budget-big-beautiful-tax-cuts-republicans-house-5588a1ba31875e5a4a2e23564244851b",
      "urlToImage": "https://dims.apnews.com/dims4/default/73f6bdf/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2F25%2F369171fdb34a27b2b876d99e47b4%2F55766a219ddf4338afdcc7480c4d320e"
    },
    {
      "author": "Illia Novikov",
      "description": "Ukrainian President Volodymyr Zelenskyy says that he will be waiting for Russian President Vladimir Putin in the Turkish capital this week to conduct face-to-face talks about the more than three-year war. Putin hasn’t yet said whether he will be at the talks. U.S. President Donald Trump has urged the two sides to attend the discussions as part of Washington’s efforts to stop the fighting. Zelenskyy told reporters in Kyiv he will be in Ankara on Thursday to conduct the negotiations. He said he plans to meet with Turkish President Recep Tayyip Erdogan and the two will wait for Putin to arrive. Zelenskyy said both leaders will travel to Istanbul if Putin chooses to hold the meeting there.",
      "publishedAt": "2025-05-13T09:25:49Z",
      "title": "Ukraine's Zelenskyy says he will be waiting for Russian leader Putin in Ankara on Thursday for talks",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-zelenskyy-istanbul-b4a256f946ce892d6b2a7dfb0f3fba5b",
      "urlToImage": "https://dims.apnews.com/dims4/default/aa52823/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F9b%2F6dc6f45efc957ecd9896d950e62f%2Fe47536612f1b40ac8a001fd7df1f0636"
    },
    {
      "author": "Mary Clare Jalonick",
      "description": "Senate Democratic Leader Chuck Schumer says he will hold up all Department of Justice nominations on the Senate floor until he gets more answers about the free Air Force One replacement that President Donald Trump says would be donated by Qatar. Trump said this week that he wants to accept the $400 million plane, and that it would later be donated to a presidential library. White House press secretary Karoline Leavitt told Fox News on Monday that the details of the donation are still being worked out. Schumer said the plan “is not just naked corruption, it is also a grave national security threat.”",
      "publishedAt": "2025-05-13T17:08:56Z",
      "title": "Schumer vows to hold up Justice Department nominees over luxury plane from Qatar",
      "url": "https://apnews.com/article/trump-plane-qatar-schumer-nominees-senate-8efd139a898c32cb7a1fa554c3e937c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/a02ee52/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F54%2Fa301ea265390bd6166580eec3bfd%2Fa8d9d4e2a81342758eefa8328d74cc51"
    },
    {
      "author": "Jaimie Ding",
      "description": "A Los Angeles judge is listening to arguments this week over whether Erik and Lyle Menendez should receive reduced sentences. The brothers have spent more than 30 years in prison for killing their parents at their Beverly Hills home in 1989. Their attorneys are expected to argue over the course of a two-day hearing starting Tuesday that the brothers have been rehabilitated in prison, and they have the support of their extended family. Prosecutors have said they oppose resentencing because the brothers have not admitted to lies told during their trial about why they killed their parents.",
      "publishedAt": "2025-05-13T04:05:02Z",
      "title": "LA judge to decide whether the Menendez brothers should be freed",
      "url": "https://apnews.com/article/menendez-brothers-resentencing-freedom-murder-95d642ef10b6d726d84c6f02a20a378c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e0b0f7b/2147483647/strip/true/crop/3021x1699+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fba%2F9e740e705ad91ac99653607675f3%2F2d6111198cb54fe4ab3accf920bcc1bd"
    },
    {
      "author": "Matthew Perrone",
      "description": "U.S. health officials say they plan to phase out fluoride-containing supplements used to strengthen children’s teeth, citing possible health risks. The announcement Tuesday is the latest action by Robert F. Kennedy Jr. against a substance that has been a mainstay of dental care for decades. The Food and Drug Administration will conduct a scientific review of the products by late October with the aim of removing them from the market. It was not immediately clear if the agency would issue a formal ban. Previous scientific reviews have not shown any serious health risks with the products.",
      "publishedAt": "2025-05-13T15:49:38Z",
      "title": "FDA and RFK Jr. aim to remove fluoride supplements used to protect kids' teeth",
      "url": "https://apnews.com/article/fluoride-fda-kennedy-cavities-teeth-water-22c5aefeb97c411e2fda0c4754b78cf2",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed3c36c/2147483647/strip/true/crop/2490x1401+0+130/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F75%2F0e8a5ab993bdbeacad43b5318cf4%2F3adebc57031f42c3a925a8941369ec88"
    },
    {
      "author": "Maya Sweedler",
      "description": "A new poll finds about 3 in 10 U.S. adults follow women's sports at least “somewhat” closely, lower than the share who follow men's sports. Those who follow women’s pro sports are more casual, tending to say they attend or watch games occasionally rather than frequently. People who follow men’s sports, by contrast, are more likely to identify attachments to teams as opposed to players. The Associated Press-NORC Center for Public Affairs Research poll comes ahead of the start of the 2025 WNBA season, an expansion year for the league. University of Iowa phenom-turned-WNBA star Caitlin Clark has helped bring wider attention to women’s basketball.",
      "publishedAt": "2025-05-13T11:50:05Z",
      "title": "About 3 in 10 Americans follow women's sports, poll finds",
      "url": "https://apnews.com/article/womens-sports-wnba-basketball-caitlin-clark-f579144ed4e3f1532e52b839e9054490",
      "urlToImage": "https://dims.apnews.com/dims4/default/4631fa9/2147483647/strip/true/crop/3095x1741+0+161/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2F62%2F1c4ccd0d5f4d01d325c6265c8516%2Fd2a91c3de95c461797c65aa80905f06c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}