{
  "articles": [
    {
      "author": "MEG KINNARD and ALANNA DURKIN RICHER",
      "description": "New charges — and a new defendant — added to the classified documents case against former President Donald Trump underscore how the Mar-a-Lago investigation is still very much ongoing, even as the focus has been on an expected indictment in a separate case related to the 2020 election.",
      "publishedAt": "2023-07-28T02:17:25Z",
      "title": "Donald Trump faces new charges in the Mar-a-Lago classified documents case. Here's what to know",
      "url": "https://apnews.com/bee867f48da593d351c5a91e87c356a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8d497cca6b64a5bb06baee018092205/3000.jpeg"
    },
    {
      "author": "THOMAS MACHOWICZ and ANITA SNOW",
      "description": "PHOENIX (AP) — Homeless in America's hottest big metro, Stefon James Dewitt Livengood was laid out for days inside his makeshift dwelling, struggling to breath, nauseous and vomiting.Every day this month, temperatures have soared past 110 degrees Fahrenheit (43.3 degrees Celsius).",
      "publishedAt": "2023-07-28T04:00:51Z",
      "title": "Homeless struggle to stay safe from record high temperatures in blistering Phoenix",
      "url": "https://apnews.com/a47f04ee21b96651585f3684ac35cb6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf3e7389befb48659767222480432da4/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un was joined by senior Russian and Chinese delegates as he displayed his most powerful nuclear-capable missiles in a military parade marking a major war anniversary with a show of defiance against the United States and deepening ties with Moscow as tensions on the peninsula are at their highest point in years.",
      "publishedAt": "2023-07-28T01:39:12Z",
      "title": "Russian and Chinese delegates join North Korean leader Kim at a parade showing his newest missiles",
      "url": "https://apnews.com/3171c3536c040e6edab073fa060c8138",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de46f9b00b6745d7acc66817bee37af9/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "FULTON, Mo. (AP) — At the entrance to Missouri prisons, large signs plead for help: “NOW HIRING” ... “GREAT PAY &amp; BENEFITS.\"No experience is necessary. Anyone 18 and older can apply. Long hours are guaranteed.",
      "publishedAt": "2023-07-28T04:20:32Z",
      "title": "Mounting job vacancies push state and local governments into a wage war for workers",
      "url": "https://apnews.com/74d1689d573e298be32f3848fcc88f46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eead6ef67e584eae9507d88ae206e6c5/2016.jpeg"
    },
    {
      "author": "YUCHENG TANG",
      "description": "BANGKOK (AP) — Shortly after China opened its borders with the end of “zero-COVID,” Zhang Chuannan lost her job as an accountant at a cosmetic firm in Shanghai and decided to explore the world.",
      "publishedAt": "2023-07-28T05:38:27Z",
      "title": "Young Chinese opt out of the rat race and pressures at home to pursue global nomad lifestyle",
      "url": "https://apnews.com/086c064470a11365acfafbd4457ba166",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15111bcb41704682ac5bc2961943b439/1440.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Randy Meisner, a founding member of the Eagles who added high harmonies to such favorites as “Take It Easy” and “The Best of My Love” and stepped out front for the waltz-time ballad “Take It to the Limit,” has died, the band said Thursday.",
      "publishedAt": "2023-07-27T23:41:28Z",
      "title": "Randy Meisner, founding member of the Eagles and singer of 'Take It to the Limit,' dies at 77",
      "url": "https://apnews.com/b4f9bdabdc17f8e789262fb8023c5f7d",
      "urlToImage": ""
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Amna al-Nour narrowly escaped death twice. The first was when militias torched her family’s home in Sudan’s Darfur region. The second was two months later when paramilitary fighters stopped her and others trying to escape as they tried to reach the border with neighboring Chad.",
      "publishedAt": "2023-07-28T06:07:13Z",
      "title": "Sudan conflict brings new atrocities to Darfur as militias kill, rape, burn homes in rampages",
      "url": "https://apnews.com/705bdb1ac90fc7b2903f68e6f666c3ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/249e9ebb49aa4017b69d9c53be5fbbe2/2844.jpeg"
    },
    {
      "author": "SAM MEDNICK and RENATA BRITO",
      "description": "SAINT-LOUIS, Senegal (AP) — The small mounds of sand that dot the beach in northern Senegal blend into the terrain. But thick rope juts out from beneath the piles.",
      "publishedAt": "2023-07-28T04:13:40Z",
      "title": "Unmarked Senegal beach graves hold untold number of West African migrants, officials and locals say",
      "url": "https://apnews.com/03de4c63bd8dabae4777550d52da5e96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f11a704fef74019981b68a213552cad/1920.jpeg"
    },
    {
      "author": "BY DREW COSTLEY",
      "description": "Nearly 200 million people in the United States, or 60% of the U.S. population, are under a heat advisory or flood warning or watch as high temperatures spread and new areas are told to expect severe storms.",
      "publishedAt": "2023-07-28T04:08:38Z",
      "title": "Nearly 200 million people in US are under heat or flood advisories",
      "url": "https://apnews.com/31d075a9357730ea3358d825b0d33c01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75d68e95af7c4c4da9b7e3700e4b030f/3000.jpeg"
    },
    {
      "author": "ERIC OLSON",
      "description": "Peggy Coppom hasn't quite seen it all with the Colorado Buffaloes, but she's seen much more than most, so believe her when she says Thursday was a good day to be a fan.The 98-year-old has been attending football games since her family moved from the high plains of eastern Colorado to Boulder in 1939 to escape the Dust Bowl, and she's missed only a couple home games since buying season tickets in 1966.",
      "publishedAt": "2023-07-28T10:00:21Z",
      "title": "Big 12 not quite the same, but it feels like home to a 98-year-old Colorado fan",
      "url": "https://apnews.com/86a0c8ad3f378333eface6c93712c008",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04fd41f958414d46a5a815812316367f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}