{
  "articles": [
    {
      "author": "STEVE KARNOWSKI and HEATHER HOLLINGSWORTH",
      "description": "BURNSVILLE, Minn. (AP) — A man armed with multiple guns and large amounts of ammunition shot at police officers from inside a suburban Minneapolis home that was filled with children on Sunday, killing two officers and a firefighter who was providing medical aid to one of the wounded, authorities said.",
      "publishedAt": "2024-02-18T17:03:35Z",
      "title": "2 officers, 1 first responder killed at the scene of a domestic call in Minnesota; suspect dead",
      "url": "https://apnews.com/e742b13f0d2ddca009e38337f46435b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dc9af9a3e7e40d0aef173c2d7c2cc91/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, KAREEM CHEHAYEB and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — Israeli Prime Minister Benjamin Netanyahu on Sunday brushed off growing calls to halt the military offensive in Gaza, vowing to “finish the job” as a member of his War Cabinet threatened to invade the southern city of Rafah if remaining Israeli hostages are not freed by the upcoming Muslim holy month of Ramadan.",
      "publishedAt": "2024-02-18T08:19:52Z",
      "title": "Israel vows to 'finish the job' in Gaza as War Cabinet member threatens a Ramadan deadline for Rafah",
      "url": "https://apnews.com/380f901e8c2f52d537d0aa9f9bf0a6bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fc05cdfc719487ca8510f43934f2b3e/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Over 300 people were detained in Russia while paying tribute to opposition leader Alexei Navalny, who died at a remote Arctic penal colony, a prominent rights group reported Sunday.",
      "publishedAt": "2024-02-18T09:30:59Z",
      "title": "Over 300 detained in Russia as country mourns the death of Alexei Navalny, Putin's fiercest foe",
      "url": "https://apnews.com/d0121f49840ee1cd6fbf94f6d7249e1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7aac174d6b64ca5bb78ade989f790aa/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Dwindling ammunition threatens Ukraine’s hold on the 1,000-kilometer (620-mile) front line under withering assault by Russian artillery. Defensive lines are in jeopardy. Ukrainian forces withdrew from the city of Avdiivka in the Donetsk region on Saturday after daily Russian onslaughts from three directions for the last four months.",
      "publishedAt": "2024-02-18T18:31:24Z",
      "title": "Ukrainian forces don't have enough artillery to battle Russia. A key withdrawal Saturday shows that",
      "url": "https://apnews.com/063ab1bd47a500ad4a815b12f3d1386d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e04487c3037a4ceda32c2708e7d0772e/1920.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — At least 53 men were massacred in a major escalation of tribal violence in Papua New Guinea, Australian media reported Monday.A tribe, their allies and mercenaries were on their way to attack a neighboring tribe when they were ambushed Sunday in Enga province in the South Pacific nation's remote highlands, Royal Papua New Guinea Constabulary Acting Superintendent George Kakas told Australian Broadcasting Corp.",
      "publishedAt": "2024-02-18T23:03:36Z",
      "title": "At least 53 men massacred in Papua New Guinea tribal violence, police tell Australian media",
      "url": "https://apnews.com/8b3615e28e5b64fa8bf8090d06fec3f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4ac3405039a4c2abe3ce097c6de7f84/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Celebrity pastor Joel Osteen's Houston megachurch held a special service Sunday dedicated to healing and thanksgiving a week after a woman opened fire in one of its hallways before being gunned down by security officers.",
      "publishedAt": "2024-02-18T05:04:42Z",
      "title": "Houston megachurch holds healing and thanksgiving service a week after deadly shooting",
      "url": "https://apnews.com/23fcb12563d39f9b9d421ef9677a8f81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/623ad9604a434768b53ac9ceb5dd1424/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "REHOBOTH BEACH, Del. (AP) — Sen. Tim Scott, a potential running mate if Donald Trump becomes the Republican presidential nominee, is treading carefully on questions about whether he would have certified the 2020 election had he been vice president at that time.",
      "publishedAt": "2024-02-18T18:20:29Z",
      "title": "Trump VP contender Tim Scott doesn't want to talk about vice president's role in certifying election",
      "url": "https://apnews.com/17c4866bce89cc334f8a04159907be59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40f0c6abe8b4496cbd9bc17f23221e1e/3000.jpeg"
    },
    {
      "author": "ELAINE GANLEY",
      "description": "SAINT-BREVIN-LES-PINS, France (AP) — The mayor of a small resort town on the Atlantic coast of France resigned, closed his medical practice and moved away after his house and two cars were set on fire.",
      "publishedAt": "2024-02-19T05:01:32Z",
      "title": "French mayors face violence and intimidation from xenophobic far-right groups",
      "url": "https://apnews.com/c507227bfad6598201a8642cfb95b19c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4dff4184e34c4fde8752221c17d95600/3000.jpeg"
    },
    {
      "author": "MIKE CORDER and JULIA FRANKEL",
      "description": "THE HAGUE, Netherlands (AP) — The United Nations' highest court opens historic hearings Monday into the legality of Israel's 57-year occupation of lands sought for a Palestinian state, plunging the 15 international judges back into the heart of the decades-long Israeli-Palestinian conflict.",
      "publishedAt": "2024-02-18T05:07:41Z",
      "title": "Top UN court to hold hearings on legality of the Israeli occupation of Palestinian-claimed lands",
      "url": "https://apnews.com/8e194a5d96bc6a2264a0bb3de8576210",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32db803a35dc495eab7ca900eb84d369/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Atom bomb epic “Oppenheimer” won seven prizes, including best picture, director and actor, at the 77th British Academy Film Awards on Sunday, cementing its front-runner status for the Oscars next month.",
      "publishedAt": "2024-02-18T10:45:19Z",
      "title": "'Oppenheimer' wins 7 prizes, including best picture, at the British Academy Film Awards",
      "url": "https://apnews.com/220af1ec73e47e6222abe2b0934cddc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07bac006198948beb753201da769eb8f/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}