{
  "articles": [
    {
      "author": "MATTHEW BROWN",
      "description": "BILLINGS, Mont. (AP) — Three-term incumbent Democratic U.S. Sen. Jon Tester of Montana faces perhaps his toughest reelection challenge yet on Tuesday, with control of the Senate on the line in a state that’s veered sharply rightward since the 68-year-old grain farmer's first election.",
      "publishedAt": "2024-11-05T08:11:15Z",
      "title": "3-term Democratic lawmaker tries to hold key US Senate seat in GOP-friendly Montana",
      "url": "https://apnews.com/f882b50bf4af6a87ec32e3a5f626eccb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3d63989b3604774bd446c5a397148c6/2700.jpeg"
    },
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE and WILL WEISSERT",
      "description": "WASHINGTON (AP) — A presidential campaign marked by upheaval and rancor was finally headed for an Election Day finale, as Americans decided whether to send Donald Trump back to the White House or elevate Kamala Harris to the Oval Office.",
      "publishedAt": "2024-11-05T11:29:35Z",
      "title": "America reaches Election Day and a stark choice between Trump and Harris",
      "url": "https://apnews.com/83c8e246ab97f5b97be45cdc156af4e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9af9542d62b6406fba8da181ece89d80/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Election Day is here. Voters are gearing up to head to the polls to cast their ballots for either Donald Trump or Kamala Harris in one of the nation’s most historic presidential races.",
      "publishedAt": "2024-11-05T11:18:20Z",
      "title": "The Latest: Trump and Harris cede stage to voters who'll also decide control of House and Senate",
      "url": "https://apnews.com/a2352c1cc3289d206d21260c5dc34da8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e98fd9af34c94cc9ae11b37c8d1cf447/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and ALI SWENSON",
      "description": "WASHINGTON (AP) — Election Day voting unfolded largely smoothly across the nation Tuesday but with scattered reports of extreme weather, ballot printing errors and technical problems causing delays.",
      "publishedAt": "2024-11-05T05:06:00Z",
      "title": "After all the talk, Election Day voting is going mostly smoothly",
      "url": "https://apnews.com/a8ae22f34417dcda060b430dac89bdbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9af9542d62b6406fba8da181ece89d80/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "While electing officials to make and enforce laws, voters in dozens of states are also deciding on more than 140 ballot proposals affecting the way people legally live, work and die. As 10 states consider measures related to abortion or reproductive rights on Tuesday's ballots, about a half-dozen states are weighing the legalization of marijuana for either recreational or medical use.",
      "publishedAt": "2024-11-05T05:02:42Z",
      "title": "Voters deciding dozens of ballot measures affecting life, death, taxes and more",
      "url": "https://apnews.com/64bada2b555df6c817151796fa81ae7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d6548988cba410e91ecab73848591cf/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — Voters in nine states are deciding whether their state constitutions should guarantee a right to abortion, weighing ballot measures that are expected to spur turnout for a range of crucial races.",
      "publishedAt": "2024-11-05T05:03:56Z",
      "title": "Abortion is on the ballot in nine states and motivating voters across the US",
      "url": "https://apnews.com/49c9073cbb6056b66a8a7d0d099795d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46903365a075482d98a3811db1bbc069/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Control of Congress is at stake Tuesday, with ever-tight races for the House and Senate that will determine which party holds the majority and the power to boost or block a president’s agenda, or if the White House confronts a divided Capitol Hill.",
      "publishedAt": "2024-11-05T05:01:59Z",
      "title": "Control of Congress is at stake and with it a president's agenda",
      "url": "https://apnews.com/94b49277db2a5c21f23236794a36afa6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9313367711d4ce49b516cb4ca0ba59f/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike in northern Gaza has killed at least 20 people, mostly women and children, Palestinian officials said Tuesday, as Israel wages a nearly monthlong air and ground operation in what was already the most isolated and heavily destroyed part of the territory.",
      "publishedAt": "2024-11-05T08:54:31Z",
      "title": "An Israeli airstrike kills 20 people in northern Gaza, Palestinian officials say",
      "url": "https://apnews.com/c1421d5624f91630523eee007c7a7d17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54b188e9a56147a294f62be73e2d4a3d/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian troops have for the first time engaged with North Korean units that were recently deployed to help Russia in the war with its neighbor, Ukraine's defense minister said Tuesday.",
      "publishedAt": "2024-11-05T11:30:04Z",
      "title": "Ukrainian troops have engaged with North Korean units for the 1st time in Russia, an official says",
      "url": "https://apnews.com/c8cf9599591e50caf1c48a98b6841fe4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f3a2acb10924b5f851f107aacee6cef/2457.jpeg"
    },
    {
      "author": "HERNÁN MUÑOZ and JOSEPH WILSON",
      "description": "SEDAVI, Spain (AP) — Francisco Murgui went out to try to salvage his motorbike when the water started to rise.He never came back.One week after catastrophic flooding devasted eastern Spain, María Murgui still holds out hope that her father is alive and among the unknown number of the missing.",
      "publishedAt": "2024-11-05T12:12:07Z",
      "title": "A week after Spain's floods, families hold out hope that loved ones are not among the dead",
      "url": "https://apnews.com/d032b706a16c1051ee2d741af10afa7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bea2453f11704439afc2361379d141ae/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}