{
  "articles": [
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — A container ship lost power and rammed into a major bridge in Baltimore early Tuesday, causing the span to buckle into the river below and plunging a construction crew and several vehicles into the dangerously cold waters.",
      "publishedAt": "2024-03-26T07:10:17Z",
      "title": "Baltimore bridge collapses after powerless cargo ship rams into support column; 6 people are missing",
      "url": "https://apnews.com/53169b379820032f832de4016c655d1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc347ac194c24ac8b825b18f498896fa/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A container ship struck a major bridge in Baltimore early Tuesday, causing it to plunge into the river below.",
      "publishedAt": "2024-03-26T12:01:19Z",
      "title": "A list of major US bridge collapses caused by ships and barges",
      "url": "https://apnews.com/1f2d6261d523ddc625aaaf3b32c626bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ccc0211108542268f8c2a39403265d7/2997.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, JACK JEFFERY and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu on Tuesday vowed to press ahead with the war in Gaza and blasted a U.N. Security Council resolution calling for a pause, saying it had emboldened Hamas to reject a separate proposal for a cease-fire and hostage release.",
      "publishedAt": "2024-03-26T08:02:44Z",
      "title": "Israel and Hamas dig in as international pressure builds for a cease-fire in Gaza",
      "url": "https://apnews.com/49326c412161df2473c167c311781363",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e958fab5c24545f68cd3c27e37ecfb6a/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Tuesday seemed likely to preserve access to a medication that was used in nearly two-thirds of all abortions in the U.S.",
      "publishedAt": "2024-03-26T04:04:12Z",
      "title": "Supreme Court seems likely to preserve access to the abortion medication mifepristone",
      "url": "https://apnews.com/4406d53e8af90f6a523264f535f5adf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1acbce6a1a3d402699f6f027235019b5/1920.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russian officials persisted Tuesday in saying Ukraine and the West had a role in last week's deadly Moscow concert hall attack despite vehement denials of involvement by Kyiv and a claim of responsibility by an affiliate of the Islamic State group.",
      "publishedAt": "2024-03-26T11:26:00Z",
      "title": "Russia persists in blaming Ukraine for concert attack despite its denial and Islamic State's claim",
      "url": "https://apnews.com/cf12eabb9cad1a7437ad8fae821b87ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/695b9d0be6d6489397bb385f4fd290e9/2750.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukraine has sunk or disabled a third of all Russian warships in the Black Sea in just over two years of war, the navy spokesman said Tuesday, a heavy blow to Moscow's military capability.",
      "publishedAt": "2024-03-26T15:38:24Z",
      "title": "Ukrainian navy says a third of Russian warships in the Black Sea have been destroyed or disabled",
      "url": "https://apnews.com/8f614d856370a564ffee1e49f5313343",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bac1dfd95cd432d8029769edb930d7c/3000.jpeg"
    },
    {
      "author": "SYLVIA HUI and JILL LAWLESS",
      "description": "LONDON (AP) — A British court ruled Tuesday that Julian Assange can’t be extradited to the United States on espionage charges unless U.S. authorities guarantee he won't get the death penalty, giving the WikiLeaks founder a partial victory in his long legal battle over the site's publication of classified American documents.",
      "publishedAt": "2024-03-26T10:43:25Z",
      "title": "UK court says Assange can't be extradited on espionage charges until US rules out death penalty",
      "url": "https://apnews.com/98c15267f0cdf63685bfb49766749a0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90796ce55a8640c3a99030c26fc75012/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Texas Attorney General Ken Paxton on Tuesday agreed to pay nearly $300,000 in restitution under a deal to end criminal securities fraud charges that have shadowed the Republican for nearly a decade.",
      "publishedAt": "2024-03-26T04:05:51Z",
      "title": "Texas AG Ken Paxton reaches deal to end securities fraud charges after 9 years",
      "url": "https://apnews.com/9ed5eecc30c1f967ec51f7e58ad9d0af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65963304407f434788bc79e9fec759c2/3000.jpeg"
    },
    {
      "author": null,
      "description": "DES MOINES, Iowa (AP) — Another day, another giant lottery jackpot.Next up is an estimated $1.1 billion Mega Millions prize on Tuesday night, enticing players who hope to win the 8th largest prize in U.S.",
      "publishedAt": "2024-03-26T16:22:26Z",
      "title": "$1.1 billion Mega Millions drawing nears, followed by $865 million Powerball prize",
      "url": "https://apnews.com/2ca3af2378b56cb272877f2c0a674cd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7366b7d0b7714264b18d2fde5bbf0768/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — Steve Martin has long marveled at the many phases of his life. There’s his youth as a Disneyland performer, surrounded by vaudeville performers and magicians. A decade as a stand-up before the sudden onset of stadium-sized popularity.",
      "publishedAt": "2024-03-26T15:26:05Z",
      "title": "The irony of Steve Martin's life isn't lost on him",
      "url": "https://apnews.com/e4ef0677cb85dc3cb2bd77691d18600a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96841d47c8a24399aca1621728f013f3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}