{
  "articles": [
    {
      "author": "Wafaa Shurafa, Fatma Khaled",
      "description": "Israeli airstrikes across Gaza have killed at least 17 people including children as the new U.S. ambassador to Israel made his first public appearance in Jerusalem. Gaza hospitals say among the dead early Friday were 10 people in the urban Jabaliya refugee camp, including eight from the same house. The strikes come a day after more than two dozen people died in Gaza as Israel ramps up attacks to pressure Hamas to return the hostages and disarm. U.S. Ambassador to Israel Mike Huckabee appeared at the Western Wall, the holiest Jewish prayer site in Jerusalem’s Old City, where he inserted a prayer handwritten by President Donald Trump.",
      "publishedAt": "2025-04-18T09:37:55Z",
      "title": "Israeli strikes kill at least 17 in Gaza and Huckabee makes first appearance as US ambassador",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-18-2025-4b267bb6600d0a41f899815bf3361563",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8f748b/2147483647/strip/true/crop/7633x4294+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2Fe9%2Fa9f3c44cebe120926face5ecd6ea%2F814c264b0c844b1c8305ecfea0730486"
    },
    {
      "author": "Jon Gambrell",
      "description": "Yemen's Houthi rebels say U.S. airstrikes targeting the Ras Isa oil port have killed 20 people and wounded 50 others. The strikes were confirmed by the U.S. military’s Central Command, which did not acknowledge any casualties. The airstrikes represent one of the highest death tolls so far in the campaign launched under President Donald Trump that has involved hundreds of strikes since March 15. Central Command said U.S. forces acted to eliminate fuel for the Houthis and deprive them of illegal revenue.",
      "publishedAt": "2025-04-18T01:21:03Z",
      "title": "US strikes on oil port in Yemen kill 20, Houthi rebels say",
      "url": "https://apnews.com/article/yemen-us-airstrikes-563f61bbd96e1f2de68373fdf76c8811",
      "urlToImage": "https://dims.apnews.com/dims4/default/55a57bd/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F64%2F7202dc2069d1c5e6e7f243dbb0a6%2F44231e4191474113b7476d5342b9fa2c"
    },
    {
      "author": "Angela Charlton, Hanna Arhirova",
      "description": "U.S. Secretary of State Marco Rubio says the U.S. may “move on” from efforts for a Russia-Ukraine peace deal if there is no progress in the coming days. He spoke in Paris after a marathon day of landmark talks among U.S., Ukrainian and European officials. Rubio said the discussions had been constructive and produced an outline for steps toward peace. French officials said a new meeting in the same format is expected in London in the coming days. Rubio said he could join that meeting, and it’s expected early in the week.",
      "publishedAt": "2025-04-18T07:29:24Z",
      "title": "Rubio says the US will drop Ukraine-Russia peace efforts if no progress within days",
      "url": "https://apnews.com/article/rubio-ukraine-russia-war-trump-a90e3e49c276b75ed2542f2f0422ddd6",
      "urlToImage": "https://dims.apnews.com/dims4/default/8d668ed/2147483647/strip/true/crop/6532x3674+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2Fe1%2F6f797f6937d75fa03de15b8c1c3a%2F7bdafe00088e49f485e901af67f65a9d"
    },
    {
      "author": "Kate Payne, David Fischer",
      "description": "When a 20-year-old opened fire at Florida State University, terrified students barricaded doors and fled across campus, abandoning chemistry notes and even shoes. By early Friday, memorials of candles and flowers dotted the campus and a school-wide vigil had been scheduled as students and faculty tried to start healing from the shooting that investigators said killed two men and wounded at least six others. Investigators say the son of a sheriff’s deputy opened fire with his mother’s former service weapon. Officers who arrived almost immediately shot and wounded the shooter who is believed to be a Florida State student.",
      "publishedAt": "2025-04-18T04:42:19Z",
      "title": "Florida State University students felt fear and panic in deadly shooting",
      "url": "https://apnews.com/article/florida-state-university-shooting-c9a33f571466ce1ab1045dafebb30b82",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb88c98/2147483647/strip/true/crop/3773x2122+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F8e%2F70fa7758688151cac453eb0c9c82%2F1f2a016d09314784a8ebcf4a2c174e66"
    },
    {
      "author": "Josh Funk",
      "description": "America’s only rare earths mine has fielded calls from anxious companies since China responded to President Donald Trump's tariffs by limiting exports of seven heavy metals. The mine in California can’t meet the U.S. demand for rare earths, which is why Trump is pushing for new mines. Rare earth elements are ingredients in electric vehicles, advanced fighter jets, smartphones and many other products. They aren’t actually rare, but it’s hard to find them in a high enough concentration to make a mine worth the investment. Experts say prices are likely to increase quickly if China extends its import controls but there is likely enough of a stockpile to keep factories operating for now.",
      "publishedAt": "2025-04-18T04:22:35Z",
      "title": "The US has a single rare earths mine. Chinese export limits are energizing a push for more",
      "url": "https://apnews.com/article/rare-earths-trump-tariffs-china-trade-war-effd6a7ec64b5830df9d3c76ab9b607a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ee06ef/2147483647/strip/true/crop/5272x2966+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F06%2F0ca95233108bf8560254a322c875%2F18d541af657345d08a2e763c09d31a52"
    },
    {
      "author": "Jon Gambrell, Amir Vahdat",
      "description": "As far as biographies go, the two men in charge of the delicate negotiations between Iran and the United States over Tehran’s rapidly advancing nuclear program couldn’t be more different. On the American side, billionaire real estate magnate Steve Witkoff leads the effort by President Donald Trump’s administration to restrict Tehran’s atomic program, which they fear could allow Iran to build a nuclear weapon. Representing Iran is Foreign Minister Abbas Araghchi, who like many of his generation is a veteran of the bloody Iran-Iraq war. He rose through the ranks of Iran’s diplomatic corps and served as a trusted negotiator during talks that led to Iran’s 2015 nuclear deal with world powers.",
      "publishedAt": "2025-04-18T08:32:23Z",
      "title": "Iran-US talks hinge on a billionaire and a seasoned diplomat",
      "url": "https://apnews.com/article/iran-us-nuclear-negotiators-witkoff-araghchi-5aeb1f0bec7a77637410800a2fd65d99",
      "urlToImage": "https://dims.apnews.com/dims4/default/10e612c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F6c%2F6b0926d74b7f3b46c797a3c00f77%2F2c0db1dcce4d4e049345e370ba1c2e53"
    },
    {
      "author": "Michael Kunzelman",
      "description": "A federal appeals court says it is “shocking” that The Trump administration claims it can’t do anything to free Kilmar Abrego Garcia from an El Salvador prison and return him to the U.S. A three-judge panel from the 4th U.S. Circuit Court of Appeals on Thursday unanimously refused to suspend a judge’s decision to order sworn testimony by Trump administration officials to determine if they complied with her instruction to facilitate Abrego Garcia’s return.",
      "publishedAt": "2025-04-17T19:29:41Z",
      "title": "Appeals court calls Trump officials defiance over Abrego Garcia 'shocking'",
      "url": "https://apnews.com/article/abrego-garcia-trump-maryland-el-salvador-2090f0dd508bbc3d2f60845842af27b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/0aca7d1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F26%2F51840e5ed136828d2845c3974d63%2Fa76685c0ca494bb3be86899cd908c3e3"
    },
    {
      "author": "Bernard Condon",
      "description": "Among the threats tariffs pose to the U.S. economy, none may be as strange as the sell-off in the dollar. Currencies rise and fall all the time over inflation fears and other factors, but economists worry the dramatic dollar drop shows a loss of confidence in the U.S. as President Donald Trump tries to reshape global trade. If true, the blow could be big. The special status of the dollar as the medium of international trade and a safe haven has allowed the U.S. government, consumers and businesses to borrow at low rates even as debts have ballooned, which has helped speed economic growth.",
      "publishedAt": "2025-04-18T10:00:07Z",
      "title": "Strange sell-off in the dollar raises the specter of investors losing trust in the US under Trump",
      "url": "https://apnews.com/article/dollar-trump-tariffs-trade-safe-haven-china-c108fd36a3122f85872ad34ba5f5d977",
      "urlToImage": "https://dims.apnews.com/dims4/default/c92106b/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F32%2F3380d7fbcab38cc15dbe52226266%2F45de034ab24e44db9919e2757edaebef"
    },
    {
      "author": "Morgan Lee",
      "description": "Thousands of Catholics are making the trek to a historic adobe church in the hills of northern New Mexico as part of a Holy Week tradition spanning generations. El Santuario de Chimayó just north of Santa Fe is one of the most important Catholic pilgrimage centers in the U.S. It culminates Friday in displays of faith, reflection and repentance on backcountry highways. The church at Chimayó is renowned for a tiny indoor well of holy dirt thought to have curative powers. The site also is significant because of the Nuestro Señor de Esquipulas crucifix, which was found on the site in the early 1800s.",
      "publishedAt": "2025-04-18T04:10:58Z",
      "title": "Thousands of pilgrims trek through New Mexico desert to historic adobe church for Good Friday",
      "url": "https://apnews.com/article/good-friday-pilgrimage-catholic-church-new-mexico-9283699d129d4a72a519ae21df0240cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/368df12/2147483647/strip/true/crop/5924x3332+0+342/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2Fc0%2Fdf2c7084c2790812011f21b16538%2F78472fb6f0ee4c0eb1a0ba0cf00dc570"
    },
    {
      "author": "Patrick Whittle",
      "description": "The recent launch of a website dedicated to frescoes in a Maine meeting house has created a new surge of interest in the paintings. Colby College students created the website for the South Solon Meeting House. The interior of the building is covered in 70-year-old fresco murals that encourage some in the state’s art community to describe it as Maine’s Sistine Chapel. The murals were painted by artists in the 1950s and have been appreciated by visitors for decades. Colby art professor Véronique Plesch hopes it inspires many more.",
      "publishedAt": "2025-04-18T04:15:19Z",
      "title": "Look inside Maine's 'Sistine Chapel' with 70-year-old frescoes",
      "url": "https://apnews.com/article/maine-easter-sistine-chapel-fresco-art-paintings-96efa17e1f3cae7a9fd05dfda30bad59",
      "urlToImage": "https://dims.apnews.com/dims4/default/71e6c0f/2147483647/strip/true/crop/4943x2780+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2Ff1%2F3e3e08cd7fee2cc6cc33b01a5b77%2F6825479739fe46cc9b6442e955185a60"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}