{
  "articles": [
    {
      "author": null,
      "description": "MOSCOW (AP) — Russian President Vladimir Putin on Saturday apologized to his Azerbaijani counterpart for what he called a “tragic incident” following the crash of an Azerbaijani airliner in Kazakhstan that killed 38 people, but stopped short of acknowledging that Moscow was responsible.",
      "publishedAt": "2024-12-28T13:09:49Z",
      "title": "Putin apologizes for 'tragic incident' but stops short of saying Azerbaijani plane was shot down",
      "url": "https://apnews.com/a5b0ffa3e410df53556b0cd824f32a6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d051a3d44ec742e1adb4b5ef1324c996/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAM MEDNICK",
      "description": "DEIR AL BALAH, Gaza Strip (AP) — Israel's army detained the director of one of northern Gaza 's last functioning hospitals as overnight strikes elsewhere in the territory killed nine people, including children, Palestinian medical officials said Saturday.",
      "publishedAt": "2024-12-28T10:53:05Z",
      "title": "Israel detains the director of one of northern Gaza's last functioning hospitals during a raid",
      "url": "https://apnews.com/57e00c5b1e72503e02a9cfd8d8ab64f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4ea996517144dce8ab89b71183023f8/1920.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and KEVIN S. VINEYS",
      "description": "Abortion has become slightly more common despite bans or deep restrictions in most Republican-controlled states, and the legal and political fights over its future are not over yet.It's now been two and a half years since the U.S.",
      "publishedAt": "2024-12-28T13:04:06Z",
      "title": "Abortions are up in the US. It's a complicated picture as women turn to pills, travel",
      "url": "https://apnews.com/5632f60aa1d797bcdec9fbc77a385413",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4954a667963d435aadfda24a5c331525/3000.jpeg"
    },
    {
      "author": "STEVEN GRATTAN",
      "description": "BOGOTA, Colombia (AP) — 2024 was a brutal year for the Amazon rainforest, with rampant wildfires and extreme drought ravaging large parts of a biome that’s a critical counterweight to climate change.",
      "publishedAt": "2024-12-28T14:30:19Z",
      "title": "Drought, fires and deforestation battered Amazon rainforest in 2024",
      "url": "https://apnews.com/fcf8dd6e6816ca6719e16f310000ca84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29fe33a447464cafb89b8273c8157a47/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Five months after their shock offensive into Russia, Ukrainian troops are bloodied and demoralized by the rising risk of defeat in Kursk, a region some want to hold at all costs while others question the value of having gone in at all.",
      "publishedAt": "2024-12-28T05:01:07Z",
      "title": "Bloodied Ukrainian troops risk losing more hard-won land in Kursk to Russia",
      "url": "https://apnews.com/d297a59fb9eb7db08bd742e1dd0aa753",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f945dad334dd41e6aa875932bd0605a7/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Afghanistan's Defense Ministry said Saturday that its forces hit several points inside Pakistan in retaliation for deadly airstrikes last week.Pakistan last Tuesday launched an operation to destroy a training facility and kill insurgents in Afghanistan’s eastern Paktika province.",
      "publishedAt": "2024-12-28T10:58:56Z",
      "title": "Afghan forces target Pakistan in retaliation for deadly airstrikes",
      "url": "https://apnews.com/7dbd4af5dce9c2e9016d429253467312",
      "urlToImage": ""
    },
    {
      "author": "AIJAZ HUSSAIN",
      "description": "NEW DELHI (AP) — Manmohan Singh, the former Indian prime minister widely regarded as the architect of the country’s economic reform program, was cremated after a state funeral on Saturday as politicians and the public mourned his death.",
      "publishedAt": "2024-12-28T06:48:46Z",
      "title": "Former Indian Prime Minister Manmohan Singh, who instituted economic reforms, cremated in New Delhi",
      "url": "https://apnews.com/1436674a166d7a26d13002d301e019f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ffce7ffaf7a481094a6f0ba0e33cbc9/1920.jpeg"
    },
    {
      "author": "MIMMI MONTGOMERY",
      "description": "GOTHENBURG, Sweden (AP) — Burial associations in Sweden are looking to acquire enough land for something they hope they'll never have to do: bury thousands of people in the event of war.The search follows recommendations from the Church of Sweden’s national secretariat, which reflect crisis preparedness guidelines from the Swedish Civil Contingencies Agency (MSB) and the Swedish Armed Forces.",
      "publishedAt": "2024-12-28T15:11:23Z",
      "title": "Sweden embarks on a sober search for more cemetery space in case of war",
      "url": "https://apnews.com/c360d18b81adba2e2b8bb2c8aae66409",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8eaf66288e564b0a8f87f26873d7f21f/1893.jpeg"
    },
    {
      "author": "SYLVIA HUI",
      "description": "LONDON (AP) — Olivia Hussey, the actor who starred as a teenage Juliet in the 1968 film “Romeo and Juliet,” has died, her family said on social media Saturday. She was 73. Hussey died on Friday, “peacefully at home surrounded by her loved ones,” a statement posted to her Instagram account said.",
      "publishedAt": "2024-12-28T11:36:23Z",
      "title": "Olivia Hussey, star of the 1968 film 'Romeo and Juliet,' dies at 73",
      "url": "https://apnews.com/7f4510db63e17566491a03622a37fd40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b9b46de4a78438b90051db59a95a0db/2687.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "At least one Mega Millions player has plenty of dough to ring in the New Year after drawing the winning number. After three months without anyone winning the top prize in the lottery, a ticket worth an estimated $1.22 billion was sold in California for the drawing Friday night, according to the Mega Millions website.",
      "publishedAt": "2024-12-28T05:25:50Z",
      "title": "Winning ticket for $1.22 billion lottery jackpot sold in California, Mega Millions says",
      "url": "https://apnews.com/9a4be2d6734d834d954e3646784b2c5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/395ccfa3a41b453f9ce3f7554f04ecad/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}