{
  "articles": [
    {
      "author": "Michael Kunzelman, Ben Finley",
      "description": "A federal judge in Maryland is expected to question the Trump administration about its continued refusal to retrieve a mistakenly deported Maryland man from an El Salvador prison. A hearing is scheduled for late Tuesday afternoon in a U.S. District Court. It comes a day after White House advisers repeated their claim that they lack the authority to return the Salvadoran national from his native country. The president of El Salvador also said Monday that he would not return Abrego Garcia, likening it to smuggling “a terrorist into the United States.” The U.S. Supreme Court ordered the Trump administration last week to facilitate Abrego Garcia's return to the U.S.",
      "publishedAt": "2025-04-15T18:36:55Z",
      "title": "US judge to question Trump officials' refusal to return Kilmar Abrego Garcia",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-el-salvador-trump-deported-e537cfb69a9840046b5d3e512509e9a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb12ce6/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fa1%2F726df7e1f7a6a35686bad4c19b16%2Fb884be15d57e413ea3e2515fab8a2613"
    },
    {
      "author": "Collin Binkley",
      "description": "On one side is Harvard, the nation’s oldest and wealthiest university, with a brand so powerful that its name is synonymous with prestige. On the other side is the Trump administration, determined to go farther than any other White House to reshape American higher education. Both sides are digging in for a clash that could test the limits of the government’s power and the independence that has made U.S. universities a destination for scholars around the world. On Monday, Harvard become the first university to openly defy the Trump administration as it demands sweeping changes to limit activism on campus.",
      "publishedAt": "2025-04-15T17:01:09Z",
      "title": "Harvard's challenge to Trump administration could test limits of government power",
      "url": "https://apnews.com/article/harvard-trump-administration-federal-cuts-037c3f5b259a7577358c5979e701c7c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5c3cf7/2147483647/strip/true/crop/2540x1429+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F5f%2F1d1fe8f795e8a21c613d398676b4%2Fb57cca02200840dbb798e899ecb2eb63"
    },
    {
      "author": "Alexa St. John",
      "description": "President Donald Trump is considering a delay of auto tariffs. A temporary pause won’t be enough for automakers to adjust their vast global supply chains but exemptions on parts could be key to the industry. It may also give car buyers a little more time to decide before vehicle prices are expected to rise significantly.",
      "publishedAt": "2025-04-15T17:21:59Z",
      "title": "As Trump considers auto tariffs pause, parts exemptions could be key for US industry",
      "url": "https://apnews.com/article/trump-tariffs-automakers-supply-chain-cost-car-buying-1e92a9dc09294234459fcf4acea3e788",
      "urlToImage": "https://dims.apnews.com/dims4/default/3cf39ce/2147483647/strip/true/crop/7070x3977+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F6b%2F9febabe54d3e70b2877dfd3843b5%2F4b1e1b79c4184b1abc6824fd26e36d61"
    },
    {
      "author": "Annie Ma, Makiya Seminera, Christopher Keller",
      "description": "The speed and scope of the federal government’s efforts to terminate the legal status of international students have stunned colleges and universities across the country. Few corners of higher education have been untouched, as schools ranging from prestigious private universities, large public research institutions and tiny liberal arts colleges discover status terminations one after another among their student body. At least 600 students at more than 90 colleges and universities have had their visas revoked or their legal status terminated in recent weeks, according to an Associated Press review of university statements and correspondence with school officials.",
      "publishedAt": "2025-04-15T17:56:55Z",
      "title": "Student visas revoked: Hundreds fear deportation without F-1 college visa",
      "url": "https://apnews.com/article/international-student-f1-visa-revoked-college-f12320b435b6bf9cf723f1e8eb8c67ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/6027827/2147483647/strip/true/crop/5220x2936+0+396/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F64%2F67daa7268c30838658b171108289%2F3f50ac1880414f58b42f3a9824d23558"
    },
    {
      "author": "Susan Montoya Bryan",
      "description": "Authorities have released a lengthy investigation report detailing some of the last internet searches done by Gene Hackman's wife in the days before her death. The records show she was searching for information on flu-like symptoms and breathing techniques. Authorities have said Betsy Arakawa died in February of hantavirus pulmonary syndrome — a rare, rodent-borne disease. Symptoms can range from flu-like illness to severe respiratory distress. Gene Hackman is believed to have died about a week later of heart disease with complications from Alzheimer’s disease. Authorities also are expected to release more police body camera footage from the investigation as the result of a recent court order.",
      "publishedAt": "2025-04-15T17:42:06Z",
      "title": "Records show Gene Hackman's wife researched symptoms of illness days before her death",
      "url": "https://apnews.com/article/gene-hackman-arakawa-investigation-records-0b5c41d51d882352499f21d0c2eb6cad",
      "urlToImage": "https://dims.apnews.com/dims4/default/b934ca5/2147483647/strip/true/crop/2284x1285+0+11/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F44%2F2fafb7afcb3c5253739e82352355%2F2b148e1657b14e3680088d6721bb4d2c"
    },
    {
      "author": "Bruce Shipkowski, Mark Scolforo",
      "description": "A family member says the man charged with setting fire to Pennsylvania Gov. Josh Shapiro’s mansion has struggled with mental illness. Dan Balmer says Tuesday that his 38-year-old brother, Cody Balmer, has been treated twice at a psychiatric hospital in recent years. His comments came a day after Cody Balmer told a judge he did not suffer from any mental illness. The fire left significant damage and forced Shapiro, his family and guests to evacuate the building early Sunday during the Jewish holiday of Passover. No injuries were reported, but authorities were still working to determine a possible motive, including whether it had anything to do with Shapiro’s politics or religious beliefs.",
      "publishedAt": "2025-04-15T21:12:53Z",
      "title": "What to know about Pennsylvania Gov. Josh Shapiro and the arson at his official residence",
      "url": "https://apnews.com/article/pennsylvania-governor-mansion-fire-cody-balmer-cd896e2bb8f5a00a73b07b9f1013df93",
      "urlToImage": "https://dims.apnews.com/dims4/default/e379d7d/2147483647/strip/true/crop/1500x844+0+78/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Fbf%2Fdefcb19bc1e037fb2ca29504d03d%2F158eff1a569d43ad8dbbbb926f9a2701"
    },
    {
      "author": "Steve Peoples, Fatima Hussein",
      "description": "Former President Joe Biden has returned to the national stage to help elevate concerns that President Donald Trump’s agenda is threatening the health of Social Security. The 82-year-old Democrat has largely avoided speaking publicly since leaving the White House in January, even as Trump frequently blames him for many of the nation’s problems. Biden fought back in a speech Tuesday to the national conference of Advocates, Counselors and Representatives for the Disabled in Chicago. Biden has made a handful of public appearances since leaving office, but this marks his highest-profile speech and focuses on a core issue for Democrats. Democratic House leader Hakeem Jeffries says it's \"an all hands on deck moment.”",
      "publishedAt": "2025-04-15T04:07:24Z",
      "title": "Biden warns that Trump administration 'taking hatchet' to Social Security",
      "url": "https://apnews.com/article/biden-speech-return-democrat-president-trump-f3e2a163db5e4e73635a60a8a61e1c7a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e9c3aad/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2Fb6%2F8b0ce3997ba2e4ccec0e596d5190%2Fe121fe7791e04a5d8f0198bd6d02094f"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "An Israeli airstrike has struck the northern gate of a field hospital in the Gaza Strip, killing a medic and wounding nine other people. The strike hit the Kuwaiti Field Hospital, in the Muwasi area, where hundreds of thousands have sought shelter in sprawling tent camps. A hospital spokesman said the wounded were all patients and medics. There was no immediate comment from the Israeli military, which has struck hospitals on several occasions during the 18-month war, accusing Hamas militants of hiding out in them or using them for military purposes. Hospital staff have denied the allegations.",
      "publishedAt": "2025-04-15T07:40:29Z",
      "title": "Israeli airstrike hits hospital entrance in Gaza, killing medic and wounding 9 other people",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-04-15-2025-24a021daf95ee5e90007cc7205506b7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/5549379/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2F64%2F4a087c951d5aa79334830a065534%2Ffdcc0d31ed85499b946861be5a9c58d8"
    },
    {
      "author": "Matt Sedensky",
      "description": "Elon Musk's federal cost-cutting team is touting its latest finding: Hundreds of millions of dollars in allegedly fraudulent unemployment claims. But the fraud the Department of Government Efficiency is claiming to have uncovered seems to mimic work that federal investigators already reported years ago. And when they looked into the fraud, they found even more. DOGE says its review found abuse including filings made by people with birthdates indicating they were just children, over the age of 115 or not even born yet. The Department of Labor's own inspector general found major problems in pandemic unemployment benefits, which it reported years ago on a scale far larger than what DOGE said it found.",
      "publishedAt": "2025-04-15T19:12:29Z",
      "title": "DOGE trumpets unemployment fraud that government already found",
      "url": "https://apnews.com/article/doge-trump-musk-unemployment-aa033544cb4e7167d0f310f0f93bbede",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f90ead/2147483647/strip/true/crop/5221x2937+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F66%2F541f59be874877d6d856f2d48c8d%2F2c061ff8ec9443d286b611eaf7775d13"
    },
    {
      "author": "Beth Harris",
      "description": "Wink Martindale, the genial host of such hit game shows as “Gambit” and “Tic-Tac-Dough,” has died. He was 91. Martindale began his career in radio and was did one of the first recorded television interviews with a young Elvis Presley before scoring hits as a game show host. “Gambit” started in 1976 but within a few short years was overtaken by “Wheel of Fortune” and other shows, but he bounced back in 1978 with “Tic-Tac-Dough,” which aired until 1985. Publicist Brian Mayes says Martindale died Tuesday at Eisenhower Health in Rancho Mirage after battling lymphoma for a year.",
      "publishedAt": "2025-04-15T23:42:27Z",
      "title": "Wink Martindale, the genial game-show host and an early TV interviewer of Elvis Presley, dies at 91",
      "url": "https://apnews.com/article/wink-martindale-dead-d2f333da86b6efb3b99b36bb7a71a7a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/99701bf/2147483647/strip/true/crop/3500x1969+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F99%2F30bbe3bf88a43c7fbcf8f1808c64%2F6c4476777f4542bc9c0bf9f89f53569a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}