{
  "articles": [
    {
      "author": "Tia Goldenberg",
      "description": "An Israeli official says Cabinet ministers have approved plans to intensify military operations in the Gaza Strip. The official said the plan was gradual and involved claiming more territory in the Palestinian enclave. The approval comes a day after Israel announced it was calling up tens of thousands of reservist for the expanded operations in Gaza, which Israel says are meant to increase pressure on the militant Hamas group to negotiate a ceasefire that better aligns with Israel’s terms. An eight-week ceasefire with the Hamas militant group collapsed in March when Israel resumed strikes in Gaza, killing hundreds of Palestinians, many of them women and children.",
      "publishedAt": "2025-05-05T05:26:52Z",
      "title": "Israel approves plans to intensify Gaza operations, official says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-05-2025-d22caabfd2cf89e83fe06e649e6438ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f14842/2147483647/strip/true/crop/3070x1727+0+160/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fb8%2F587422fe1fb2df6a5e1e55ec7f56%2Fa243f78be02e4bd595d740fc8841d116"
    },
    {
      "author": null,
      "description": "Iran’s foreign minister is in Pakistan to try and mediate in the escalation between Islamabad and New Delhi after last month’s deadly attack on tourists in the Indian-controlled section of Kashmir. Abbas Araghchi's visit was the first to Pakistan by a foreign dignitary since tensions flared in the wake of a deadly attack on tourists in the disputed Kashmir region. It comes just days after Tehran offered to help ease tensions between the nuclear-armed neighbors. Araghchi was welcomed by senior Pakistani officials after landing at an airport near Islamabad early on Monday. He is to meet his Pakistani counterpart, Ishaq Dar, as well as President Asif Ali Zardari and Prime Minister Shehbaz Sharif.",
      "publishedAt": "2025-05-05T05:44:15Z",
      "title": "Iran's top diplomat is in Pakistan to mediate in escalation with India over deadly Kashmir attack",
      "url": "https://apnews.com/article/pakistan-tensions-india-iran-araghchi-92770117a93b72814c494834348b73b8",
      "urlToImage": "https://dims.apnews.com/dims4/default/59c2f9c/2147483647/strip/true/crop/3970x2233+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2F70%2Fc37619e671e614e5c68591bb8ef0%2F12041b9ae896420b884ad7d870262586"
    },
    {
      "author": null,
      "description": "Cardinals hailing from 71 different countries will begin electing a pope this week in the most geographically diverse conclave in history. There is no rule that cardinals vote a certain way according to their nationality or region. But understanding their makeup in geographic terms can help explain some of their priorities. There are currently 135 cardinals who are under age 80 and eligible to vote in the conclave. Already two have formally told the Holy See that they cannot attend for health reasons, bringing the number of men who will enter the Sistine Chapel down to 133. A two-thirds majority is needed to be elected pope, meaning the winner must secure 89 votes.",
      "publishedAt": "2025-05-05T05:16:52Z",
      "title": "What's the geographic breakdown of the cardinals who will elect the new pope?",
      "url": "https://apnews.com/article/vatican-conclave-cardinal-d01b3bfd056836e89560e3b40337b89e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d87de66/2147483647/strip/true/crop/7019x3948+0+366/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2Fee%2Fd7c060819425e9183c3a2cf05fc5%2F68ada072c3b0401dbe5faeaef6da668c"
    },
    {
      "author": "Kerstin Sopke, Pietro De Cristofaro",
      "description": "Central Berlin was in ruins after the Red Army completed the Allied victory over the Nazis in an intense fight for the German capital in May 1945. After decades of division and its revival as the capital of a reunited, democratic Germany, the city is now transformed, blending painstakingly restored buildings with modern architecture. But the scars of the past remain visible in many places: facades riddled with bullet holes, or gaps in rows of houses sometimes plugged by new buildings. Berlin, the epicenter of Adolf Hitler’s power, was the ultimate prize as the Allies closed in from east and west on the disintegrating German defenses in the final stage of World War II.",
      "publishedAt": "2025-05-05T05:00:07Z",
      "title": "Berlin still bears scars 80 years after pivotal battle that sealed the defeat of Nazi Germany",
      "url": "https://apnews.com/article/berlin-war-anniversary-destruction-renewal-f416b674b65e52c65e9f0fe58fcc232d",
      "urlToImage": "https://dims.apnews.com/dims4/default/76324c9/2147483647/strip/true/crop/2560x1440+0+288/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F31%2F5636b7c6b869c0e91a3ce5b9dd04%2F9b80dfe9b1204a278303f49ce23fa292"
    },
    {
      "author": "Qassim Abdul-zahra",
      "description": "As a general amnesty law takes effect in Iraq, the country’s prisons are facing a crisis of overcrowding, housing more than double their intended capacity, the country’s justice minister said in an interview. Justice Minister Khaled Shwani has told The Associated Press that Iraq’s 31 prisons currently hold approximately 65,000 inmates, despite the system being built to accommodate only half that number. He acknowledged that the overcrowding has put a severe strain on prison healthcare and human rights standards.",
      "publishedAt": "2025-05-05T04:43:47Z",
      "title": "Iraq's justice minister says prisons are at double their capacity as amnesty law takes effect",
      "url": "https://apnews.com/article/iraq-prisons-amnesty-overcrowding-security-terrorism-577236f4f20125610c078e1625dcb33f",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e9a7b0/2147483647/strip/true/crop/7313x4114+0+314/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F49%2Ff1a3ac51db334b705df52c92f11b%2F3cc7a0c883484125b32fa29b3015cc46"
    },
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump, in a new interview, is circumspect about his duties to uphold due process rights laid out in the Constitution. He also says he doesn’t think military force would be needed to make Canada the “51st state.” And he's downplaying the possibility that he'd look to run for a third term in the White House. The comments came in a wide-ranging and at time combative interview with Kristen Walker that aired Sunday on NBC’s “Meet the Press.\" The Republican president’s efforts to quickly enact his agenda are beginning to face sharper headwinds just as his administration crossed the 100-day mark this past week.",
      "publishedAt": "2025-05-04T13:08:45Z",
      "title": "Trump, in a new interview, says he doesn't know if he backs due process rights",
      "url": "https://apnews.com/article/trump-due-process-canada-greenland-military-action-8da3e853b6cec944ec373fae4d317ac4",
      "urlToImage": "https://dims.apnews.com/dims4/default/b28a790/2147483647/strip/true/crop/2885x1623+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F88%2Fb89823e8ff67f89c97dfa3de1164%2Fc28eed8434c04d12ac9681ae96b8f635"
    },
    {
      "author": "Jill Colvin, Michael R. Sisak",
      "description": "President Donald Trump says he is directing his government to reopen and expand Alcatraz, the notorious former prison on a California island that has been closed for more than 60 years. In a message on his Truth Social site Sunday evening, Trump wrote that, “For too long, America has been plagued by vicious, violent, and repeat Criminal Offenders, the dregs of society, who will never contribute anything other than Misery and Suffering.\" He said, \"That is why, today, I am directing the Bureau of Prisons, together with the Department of Justice, FBI, and Homeland Security, to reopen a substantially enlarged and rebuilt ALCATRAZ, to house America’s most ruthless and violent Offenders.”",
      "publishedAt": "2025-05-04T23:18:30Z",
      "title": "Trump says he will reopen Alcatraz prison",
      "url": "https://apnews.com/article/trump-alcatraz-prison-fabe3385415ae03829d44e50efb3c1fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/7b9eb85/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F92%2F58da29538402bdf8914616a25d2c%2F1653f78dbb3f4435917d9a61fbb66a5e"
    },
    {
      "author": "Jill Colvin, Jake Coyle",
      "description": "President Donald Trump is opening a new salvo in his tariff war, targeting films made outside the U.S. Trump said Sunday night that he has authorized the Department of Commerce and the Office of the U.S. Trade Representative to slap a 100% tariff “on any and all Movies coming into our Country that are produced in Foreign Lands.” It wasn’t immediately clear how any such tariff on international productions could be implemented. It’s common for both large and smaller films to include production both in the U.S. and other countries. Big-budget movies like the upcoming “Mission: Impossible – The Final Reckoning,\" for instance, are shot around the world.",
      "publishedAt": "2025-05-05T02:22:36Z",
      "title": "Trump threatens 100% tariff on foreign-made films",
      "url": "https://apnews.com/article/trump-films-hollywood-tariff-movies-415367dff6ae5bb7dc0871db5ac97d48",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d76e1d/2147483647/strip/true/crop/4064x2286+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F79%2F869818b0562dd195e0ffe77b2b92%2F079347cc9f234eaab2a9cbca5a7ad604"
    },
    {
      "author": "Heather Hollingsworth, Sally Ho",
      "description": "In the months since President Donald Trump took back the White House and installed a loyalist to lead the federal housing department, HUD Secretary Scott Turner and his team have moved swiftly to undo, uproot and remake the agency’s decades of work and priorities. There is an intense focus on transgender people as the Department of Housing and Urban Development retreats from long-established fair-housing protections by closing their discrimination complaints and moving to undo the Obama-era Equal Access Rule that cemented transgender people’s rights to discrimination protection in housing. The Trump administration has both halted enforcement of the Equal Access Rule and proposed unspecified revisions to the policy. Homeless shelters also are struggling to comply with the Trump directives.",
      "publishedAt": "2025-05-05T05:24:15Z",
      "title": "In battle against transgender rights, Trump targets HUD’s housing policies",
      "url": "https://apnews.com/article/transgender-hud-fair-housing-trump-lgbtq-turner-915634741f56f3d5ea265e316cd396bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/448e92f/2147483647/strip/true/crop/5348x3008+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2Fa2%2F343bec2ac6b1925fe79369932caf%2F3249b6e7d1d34e18a99b326c2b2bc888"
    },
    {
      "author": "Kristie Rieken",
      "description": "With a chance to close out their first-round playoff series against the Golden State Warriors, the Houston Rockets instead delivered a playoff flop to end their season. The Rockets won consecutive games to claw back from a 3-1 deficit and force a Game 7 but played their worst game of the series to be sent packing with a 103-89 loss. Houston won 52 games to capture the No. 2 seed in the Western Conference and return to the postseason for the first time since 2020. The seven seed Warriors eliminated the Rockets in the playoffs for a fifth time after doing so four times between 2015 and 2019.",
      "publishedAt": "2025-05-05T05:47:11Z",
      "title": "Houston sent to early playoff exit with 103-89 loss to Warriors in Game 7",
      "url": "https://apnews.com/article/rockets-houston-nba-playoffs-warriors-1918281b4cb48b299e6630a3132851fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ff9566/2147483647/strip/true/crop/2657x1495+0+138/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F44%2F7e53375017b0d10192ea3ddda28a%2Fe722f3f880a540499dfd2db8ee291611"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}