{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Heavy fighting erupted Monday around a hospital in northern Gaza where thousands of patients and displaced people have been sheltering for weeks, as Israeli forces focus on clearing medical facilities that they say Hamas militants use for cover.",
      "publishedAt": "2023-11-20T07:44:40Z",
      "title": "Heavy fighting breaks out around another Gaza hospital after babies evacuated from Shifa",
      "url": "https://apnews.com/b566adebfdf002569457ecc949c8c4b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0292ec1778844e539749722b35559da2/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "QUSRA, West Bank (AP) — When Israeli warplanes swooped over the Gaza Strip following Hamas militants’ deadly attack on southern Israel, Palestinians say a different kind of war took hold in the occupied West Bank.",
      "publishedAt": "2023-11-20T05:02:53Z",
      "title": "With the world's eyes on Gaza, attacks are on the rise in the West Bank, which faces its own war",
      "url": "https://apnews.com/c1386ab6a633971cc18b2497169210d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3143dd1109054c93927281bc14168abb/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — The Washington chattering class, often unsure what to make of outsiders, dubbed Rosalynn Carter the “Steel Magnolia” when she arrived as first lady.A devout Baptist and mother of four, she was diminutive and outwardly shy, with a soft smile and softer Southern accent.",
      "publishedAt": "2023-11-19T20:29:25Z",
      "title": "Rosalynn Carter: Advocate for Jimmy Carter and many others, always leveraging her love of politics",
      "url": "https://apnews.com/69fadff26354d26bdda94c5d52558a7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/674cbce379d34819a1fd8f3820dcb541/2469.jpeg"
    },
    {
      "author": "DAVID BILLER and DANIEL POLITI",
      "description": "BUENOS AIRES, Argentina (AP) — His legions of fans call him “the crazy” and “the wig” due to his ferocity and unruly mop of hair, while he refers to himself as “the lion.” He thinks sex education is a Marxist plot to destroy the family, views his cloned mastiffs as his “children with four paws” and has raised the possibility people should be allowed to sell their own vital organs.",
      "publishedAt": "2023-11-20T06:45:06Z",
      "title": "The lion, the wig and the warrior. Who is Javier Milei, Argentina's president-elect?",
      "url": "https://apnews.com/82488d49cca5aee10d4b911bde530922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/326d3f810c8a4b03a1f49189828bc712/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A federal appeals court is hearing arguments Monday on whether to reinstate a gag order against Donald Trump in the federal case charging him with plotting to overturn the results of the 2020 presidential election.",
      "publishedAt": "2023-11-20T05:10:37Z",
      "title": "An appeals court is set to hear arguments asking for Trump's gag order to be put back in place",
      "url": "https://apnews.com/f6e37b4193a408a990dd3837609acc8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ad47745df62420fbc196f517ea97438/3000.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — China’s top diplomat welcomed four Arab foreign ministers and the Indonesian one to Beijing on Monday, saying his country would work with “our brothers and sisters\" in the Arab and Islamic world to try to end the war in Gaza as soon as possible.",
      "publishedAt": "2023-11-20T09:21:58Z",
      "title": "China welcomes Arab and Muslim foreign ministers for talks on ending the war in Gaza",
      "url": "https://apnews.com/92596ef24d1f8d8e4708e7ad95051c44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95dc61c6520d4c4486b245eb369c02b8/3000.jpeg"
    },
    {
      "author": "MIKE HOUSEHOLDER",
      "description": "MAYFIELD TOWNSHIP, Mich. (AP) — For Kylie Ossege, the 19-year-old college student who survived two deadly mass school shootings in Michigan — one as a senior at Oxford High School in 2021 and another 14 months later as a freshman at Michigan State University — Blaze stands as a source of comfort in a world otherwise shattered by bullets.",
      "publishedAt": "2023-11-20T05:07:27Z",
      "title": "Michigan school shooting survivor heals with surgery, a trusted horse and a chance to tell her story",
      "url": "https://apnews.com/450cc3cdd74058649740aa4cc3a7de8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ce8f11205c24ffa8a78f9fd9bccf712/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM",
      "description": "When Staff Sgt. Buck Aldridge fatally shot Leonard Cure during a roadside struggle after pulling him over for speeding, it wasn’t the first time a traffic stop involving the Camden County sheriff's deputy had spiraled into violence.",
      "publishedAt": "2023-11-20T05:16:17Z",
      "title": "Georgia deputy who shot absolved man had prior firing for excessive force. Critics blame the sheriff",
      "url": "https://apnews.com/a59c5ec381f11da36e9f6288d98fd6cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ede256eb369c4baca5fc9c070940dfba/2001.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "For most of her life, Claudia Stearns dreaded Thanksgiving. As a person who struggled with obesity since childhood, Stearns hated the annual turmoil of obsessing about what she ate — and the guilt of overindulging on a holiday built around food.",
      "publishedAt": "2023-11-20T08:00:20Z",
      "title": "No more Thanksgiving 'food orgy'? New obesity medications change how users think of holiday meals",
      "url": "https://apnews.com/bf8c1f8912eec7ac527bc00ebbbfa848",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f728ff9f1bc4721bb3cb02c211b42a7/2000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Microsoft announced Monday that it has hired Sam Altman and another architect of ChatGPT maker OpenAI after they unexpectedly departed the company days earlier in a corporate shakeup that shocked the artificial intelligence world.",
      "publishedAt": "2023-11-20T09:27:54Z",
      "title": "Microsoft hires OpenAI founders to lead AI research team after ChatGPT maker's shakeup",
      "url": "https://apnews.com/a110b173c3eff4a374992017f05cd45a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91096abbf81d485fa3cd897136a743a1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}