{
  "articles": [
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "TikTok’s app was removed from prominent app stores on Saturday just before a federal law that would have banned the popular social media platform was scheduled to go into effect. By 10:50pm Eastern Standard Time, the app was not found on Apple and Google’s app stores, which are prohibited from offering the platform under a law that required TikTok’s China-based parent company, ByteDance, to sell the platform or face a U.S. ban.",
      "publishedAt": "2025-01-19T04:00:45Z",
      "title": "TikTok ban takes effect in the US",
      "url": "https://apnews.com/article/tiktok-ban-trump-biden-china-bdc79b7ce741a81761f67ea56d410103",
      "urlToImage": "https://dims.apnews.com/dims4/default/94a4a39/2147483647/strip/true/crop/4557x2563+0+237/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fad%2Fd6d6f88d4609ffd206ec47505172%2Fbd1992778abf4beca8ebd6eff31b5841"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "TikTok arrived in the U.S. almost 6 1/2 years ago. The possibility the U.S. would outlaw the video-sharing app has kept influencers and users in anxious limbo for more than four of the years since then. Now, the moment its fans dreaded is here, but uncertainty over TikTok’s future lingers. On Friday, the Supreme Court upheld a federal law that bans the social media platform starting Sunday unless its China-based parent company sells to an approved buyer. An official says the Biden administration plans to leave the law’s implementation to President-elect Donald Trump, who takes office Monday. During its short life, TikTok has been both a global cultural phenomenon and the subject of political wrangling.",
      "publishedAt": "2025-01-18T05:07:43Z",
      "title": "Inside the rise and fall of TikTok in the US",
      "url": "https://apnews.com/article/tiktok-ban-trump-supreme-court-36c3c3b42f743a35c69e1c74341f1f30",
      "urlToImage": "https://dims.apnews.com/dims4/default/65cbccb/2147483647/strip/true/crop/5905x3322+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F76%2F6b0fa4c5c6d6cee232d67f732460%2Ff752640c351f4ec39e64f9c0a75a8f30"
    },
    {
      "author": "FU TING, DAVID COHEN",
      "description": "A rare wave of U.S.-China camaraderie broke out online in recent days as “refugees” from the popular short video platform TikTok poured onto a Chinese social media platform to protest a now-delayed ban on the service. As the fate of TikTok hangs in the balance, U.S. TikTok users are flocking to Xiaohongshu — making it the top downloaded app in the U.S. Some of the “TikTok refugees,” as they call themselves, say the TikTok alternative, a Chinese app, is being chosen in protest of the TikTok ban. Here’s what you need to know about Xiaohongshu, also known as RedNote.",
      "publishedAt": "2025-01-17T21:33:11Z",
      "title": "TikTok refugees are pouring to Xiaohongshu. What to know about the RedNote app",
      "url": "https://apnews.com/article/tiktok-refugee-xiaohongshu-rednote-855692624aa52825b30afc5474af881d",
      "urlToImage": "https://dims.apnews.com/dims4/default/feecbf5/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fe4%2F1caad0f712876cf275526eed2a0b%2F2d91d76b7a6b4c1e87c30e235997b41e"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "The ceasefire between Israel and Hamas is set to begin on Sunday, pausing the devastating 15-month war between Israel and the militant Hamas group in the Gaza Strip. The deal is the most significant breakthrough in the war, but its implementation is complex and fragile. It requires cooperation between Palestinian militant groups, the International Red Cross, the Israeli military, mediators from multiple countries and an Israeli government whose coalition is starting to fray as hard-line ministers express their disapproval.",
      "publishedAt": "2025-01-18T22:16:15Z",
      "title": "What to know about the ceasefire between Israel and Hamas",
      "url": "https://apnews.com/article/israel-gaza-hamas-war-ceasefire-hostages-qatar-prisoners-c707fef6191db7223a6d313a12c46d41",
      "urlToImage": "https://dims.apnews.com/dims4/default/c27ed15/2147483647/strip/true/crop/2084x1172+0+108/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2Fb6%2Ff0beb1a59ade6d9bb13c6c62815b%2F32f9d31bfa444cbca0354cc24f4c5ccf"
    },
    {
      "author": "TODD RICHMOND, ELLIOT SPAGAT",
      "description": "A U.S. official says immigration officers will target more than 300 people with histories of egregious, violent crimes next week after President-elect Donald Trump takes office. The operation will be concentrated largely in the Chicago area. Arrests are expected throughout the week, subject to possible weather delays. The official spoke to The Associated Press on condition of anonymity because the operation has not been made public. Immigrants and groups advocating for them have been preparing since Trump won the presidency in November. Trump has often criticized Chicago for its protections for people in the country illegally.",
      "publishedAt": "2025-01-18T19:27:26Z",
      "title": "Chicago prepares for deportation arrests targeting hundreds next week",
      "url": "https://apnews.com/article/chicago-ice-raids-trump-immigrant-community-b3b276656067b5302bed7dfcaf950f57",
      "urlToImage": "https://dims.apnews.com/dims4/default/3db980b/2147483647/strip/true/crop/5477x3081+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F6b%2F98a00cdb3833bc5e4654a38eddff%2F4c72fc00ec8b4da296ad325c12906d3f"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "South Korea’s impeached president, Yoon Suk Yeol, has been formally arrested, days after being apprehended at his presidential compound in Seoul. He faces possible imprisonment over his ill-fated declaration of martial law last month. Yoon’s arrest early on Sunday could mark the beginning of an extended period in custody for him, lasting months or more. The Seoul Western District Court granted law enforcement’s request for an arrest warrant on Yoon following an hourslong deliberation, saying he was a threat to destroy evidence. Yoon and his lawyers on Saturday appeared before the court’s judge during a hearing and argued for his release. His supporters broke into the court and rioted. Nearly 90 were arrested.",
      "publishedAt": "2025-01-18T02:26:45Z",
      "title": "South Korea court orders formal arrest of impeached President Yoon Suk Yeol",
      "url": "https://apnews.com/article/south-korea-yoon-martial-law-arrest-rebellion-court-hearing-da68666edc4ac5ad11049362da1a84d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/21c4258/2147483647/strip/true/crop/6987x3930+0+364/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F34%2Fd40c50e1a4744efcf514ece77246%2F5de4a1d8d5594c5e8d59a9a01a1b0c68"
    },
    {
      "author": "SAMY MAGDY, SAM MEDNICK, MELANIE LIDMAN",
      "description": "Preparations continue for the Gaza ceasefire that begins Sunday between Israel and Hamas. Mediator Qatar says it will go into effect at 8:30 a.m. local time. Israeli Prime Minister Benjamin Netanyahu said in a national address Saturday that the country is treating the ceasefire as temporary and retains the right to continue fighting if necessary. He claims he has the support of U.S. President-elect Donald Trump. Meanwhile, families of hostages held in Gaza are bracing for news of loved ones. Palestinians are preparing to receive freed detainees or try to return to their homes. And humanitarian groups hope to send a surge of aid into Gaza.",
      "publishedAt": "2025-01-18T07:54:14Z",
      "title": "Gaza ceasefire: Netanyahu says Israel retains 'right to return to fighting'",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-01-18-2025-a30917cd2a7740ce2a3ceeb33179391a",
      "urlToImage": "https://dims.apnews.com/dims4/default/75fcb69/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2F85%2F7c8049710f2a19173c0c102fd64f%2Faf1791759b08483aa3c097bbe300d60b"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "Donald Trump is headed back to Washington to kick off days of pageantry heralding his second inauguration as president. Trump departed from his adopted home state of Florida on Saturday afternoon with his wife Melania and son Barron an fly to the nation's capital. He will attend an evening reception and fireworks show at Trump National Golf Club in Sterling, Virginia. On Sunday, Trump is scheduled to participate in a wreath-laying ceremony at Arlington National Cemetery before heading to a rally at Capital One Arena in Washington. On Monday, he will be sworn in inside the Capitol because of the cold weather.",
      "publishedAt": "2025-01-18T05:04:58Z",
      "title": "Donald Trump heads to Washington for inaugural celebrations",
      "url": "https://apnews.com/article/trump-inauguration-return-to-washington-1389014f70bd04793a8dbc83048bba07",
      "urlToImage": "https://dims.apnews.com/dims4/default/9bcb107/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F5a%2F2c45b71fe70e31051804a82f195a%2F93ade4d718044edeb629aaf9472904f3"
    },
    {
      "author": "DARLENE SUPERVILLE, ADRIANA GOMEZ LICON",
      "description": "As Trump prepares to return to the White House, his family circle looks a little different than it did eight years ago. His youngest son, Barron, was in fifth grade when Trump's first administration began. He's now a college freshman. One of Trump's granddaughters is an aspiring social media influencer. Trump has tapped the fathers of his two sons-in-law for administration jobs. The president-elect has five children from his marriages to Ivana Trump, Marla Maples and current wife Melania Trump. He has 10 grandkids, and an 11th is on the way.",
      "publishedAt": "2025-01-18T12:27:06Z",
      "title": "Inside Trump's family circle as he returns to the White House",
      "url": "https://apnews.com/article/trump-family-then-now-white-house-add4a5054a88bd084392fbf92354977e",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d343bd/2147483647/strip/true/crop/4215x2371+0+220/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2Fc1%2Fd7d81ae8764eac368c14337059ee%2Fcbb03f448af74653acad44cc43f687cc"
    },
    {
      "author": "DAVE SKRETTA",
      "description": "Patrick Mahomes threw for 177 yards and a touchdown, Travis Kelce caught seven passes for 117 yards and the score and the Kansas City Chiefs beat the Houston Texans 23-14 to advance to the AFC championship game for the seventh straight season. The Chiefs will face Buffalo or Baltimore next weekend at Arrowhead Stadium as they try to become the first team to win three consecutive Super Bowl titles. Mahomes improved to 7-0 in the divisional round while Andy Reid became the fourth NFL coach with 300 career wins. The Texans still have never won in six trips to the divisional round.",
      "publishedAt": "2025-01-19T00:35:30Z",
      "title": "Mahomes, Kelce help Chiefs defeat Texans 23-14 to advance to AFC championship game",
      "url": "https://apnews.com/article/texans-chiefs-score-mahomes-nfl-playoffs-67b6cca111cfa36594f8527b8758fc01",
      "urlToImage": "https://dims.apnews.com/dims4/default/59e41f6/2147483647/strip/true/crop/3925x2208+0+145/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2Ff6%2Fd88fe7edac4f81d47353b83954dd%2F93d864b1a3fa4dd4bfa561c4de1fc628"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}