{
  "articles": [
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel's military pushed ahead with its punishing air and ground offensive in Gaza on Saturday, bolstered by a U.S. veto derailing U.N. Security Council efforts to end the war and word that an emergency sale of $106 million worth of tank ammunition had been approved by Washington.",
      "publishedAt": "2023-12-09T08:29:32Z",
      "title": "Israel presses on with its Gaza offensive after US veto derails Security Council efforts to halt war",
      "url": "https://apnews.com/7625885f326b5a294479c6e8fc61355c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a879dd1331834142a855dcdc12127caa/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL, ADAM GELLER and TIM SULLIVAN",
      "description": "HERZLIYA, Israel (AP) — After seven weeks held hostage in the tunnels of Gaza, they are finally free to laugh and chat and play. But some of the children who have come back from captivity are still reluctant to raise their voices above a whisper.",
      "publishedAt": "2023-12-09T13:14:56Z",
      "title": "‘Shadows of children:’ For the youngest hostages, life moves forward in whispers",
      "url": "https://apnews.com/b6ffc286ca7d4b48caaada43e9c6e411",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5253a1ac657c4b859a3088be8a765058/1600.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — The University of Pennsylvania’s president has resigned amid pressure from donors and criticism over testimony at a congressional hearing where she was unable to say under repeated questioning that calls on campus for the genocide of Jews would violate the school’s conduct policy.",
      "publishedAt": "2023-12-09T20:47:14Z",
      "title": "Liz Magill, U. Penn's president, and board chair resign as antisemitism testimony draws backlash",
      "url": "https://apnews.com/ae1294d644b3305cc51e8d9bb7252766",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/050bdf2a0124457a8337eb125e84fce0/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR",
      "description": "A woman whose fetus was unlikely to survive called more than a dozen abortion clinics before finding one that would take her, only to be put on weekslong waiting lists. A teen waited seven weeks for an abortion because it took her mother that long to get her an appointment.",
      "publishedAt": "2023-12-09T14:00:32Z",
      "title": "It's taking longer to schedule abortions in the US. Doctors fear riskier, more complex procedures",
      "url": "https://apnews.com/7b0a328bb34b0acb3d37e359a63712fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dae69589104a48c69a9de05394914184/3000.jpeg"
    },
    {
      "author": "BY RALPH D. RUSSO",
      "description": "NEW YORK (AP) — LSU quarterback Jayden Daniels overcame being outside the playoff race with a prolific season that Heisman Trophy voters could not ignore.Daniels won the Heisman Trophy on Saturday night, becoming the first player since 2016 to win college football's most prestigious player of the year award as part of a team that did not play for a conference championship.",
      "publishedAt": "2023-12-10T02:12:29Z",
      "title": "LSU QB Jayden Daniels overcomes being outside of playoffs to win Heisman Trophy with prolific season",
      "url": "https://apnews.com/1a10957defad0752b975a45a4d3f357d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b48c5976b9442eb9b3310f5ec34a57a/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — A deal to provide further U.S. assistance to Ukraine by year-end appears to be increasingly out of reach for President Joe Biden. The impasse is deepening in Congress despite dire warnings from the White House about the consequences of inaction as Republicans insist on pairing the aid with changes to America's immigration and border policies.",
      "publishedAt": "2023-12-09T05:35:39Z",
      "title": "New US aid for Ukraine by year-end seems increasingly of out reach as GOP ties it to border security",
      "url": "https://apnews.com/6bdcc5dde4dadb48b43ace75b5a55242",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59b84988d1af4f7b97ef769895a8bed7/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Behind bars in penal colonies or in self-exile abroad, Russian opposition figures vow they will still put up a fight against President Vladimir Putin as he seeks yet another term in office in an election in March.",
      "publishedAt": "2023-12-09T05:08:04Z",
      "title": "With Putin's reelection all but assured, Russia's opposition still vows to undermine his image",
      "url": "https://apnews.com/ed74cfa0fb957317188de39fe9ae7d15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c4c665106e44e5a9db137d3f22585cc/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT",
      "description": "SIOUX CENTER, Iowa (AP) — A trio of Republican presidential candidates shared stories of family and faith before hundreds of voters in northwest Iowa on Saturday, having congenial individual conversations with their hosts not long after dueling at the campaign's latest fractious debate. But off the stage at a small Christian college in Sioux Center, the rivals' sharp edges reemerged.",
      "publishedAt": "2023-12-09T05:18:27Z",
      "title": "GOP presidential candidates share stories of family and faith. Offstage, their sharp edges reemerged",
      "url": "https://apnews.com/6c8b449b695adf9e3fe04bd9b04d15a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/778b142c6bd54b1491dfdf94e383b4d2/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Activists designated Saturday a day of protest at the COP28 summit in Dubai. But the rules of the game in the tightly controlled United Arab Emirates at the site supervised by the United Nations meant sharp restrictions on what demonstrators could say, where they could walk and what their signs could portray.",
      "publishedAt": "2023-12-09T09:03:45Z",
      "title": "Protests at UN climate talks, from cease-fire calls to detainees, see 'shocking level of censorship'",
      "url": "https://apnews.com/79b2e3180385bb54ca1cc4b6cb4ae4d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b330ea5c3d57471390d84c59b6de6b3b/3000.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI",
      "description": "NASHVILLE, Tenn. (AP) — Severe storms that tore through central Tennessee killed six people Saturday and sent about two dozen to the hospital as homes and businesses were damaged in multiple cities.",
      "publishedAt": "2023-12-09T23:43:57Z",
      "title": "6 dead, nearly 2 dozen injured after severe storms tear through central Tennessee",
      "url": "https://apnews.com/3950302968eacc6724a93c18cf313a58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9243ae3dd48e4734ac76d8244e567c49/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}