{
  "articles": [
    {
      "author": "ERIC TUCKER, MICHELLE L. PRICE, ZEKE MILLER",
      "description": "In the first three weeks of his administration, President Donald Trump has moved with brazen haste to dismantle the federal government’s public integrity guardrails that he frequently tested during his first term. In a span of hours on Monday, word came that he had forced out leaders of offices responsible for government ethics and whistleblower complaints. And in a boon to corporations, he ordered a pause to enforcement of a decades-old law that prohibits American companies from paying bribes to win business in foreign countries. That’s all on top of the firings of more than a dozen inspectors general tasked with rooting out waste, fraud and abuse at government agencies.",
      "publishedAt": "2025-02-10T23:35:26Z",
      "title": "With firings and lax enforcement, Trump moving to dismantle government's public integrity guardrails",
      "url": "https://apnews.com/article/trump-inspectors-general-firing-justice-department-902d19ae20bcd10c2d11e92dd902d85e",
      "urlToImage": "https://dims.apnews.com/dims4/default/399aceb/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2Ff3%2F47e4ec1d5744d9cc2a6ba357a675%2Ffcf616edd0284549876fca3377dfa563"
    },
    {
      "author": "The Associated Press",
      "description": "President Donald Trump will host Jordan’s King Abdullah II at the White House on Tuesday as he escalates pressure on the Arab nation to take in refugees from Gaza as part of his audacious plan to remake the Middle East.",
      "publishedAt": "2025-02-11T07:38:00Z",
      "title": "Live updates: Trump to host Jordan's King as he escalates pressure on his Gaza resettlement plan",
      "url": "https://apnews.com/live/trump-presidency-updates-2-11-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/a206cc2/2147483647/strip/true/crop/4805x2703+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F7f%2Fb0bae52840a62f74ea67fcf69e4b%2Ffd1667cc764d47e5a8182c784853386f"
    },
    {
      "author": "MEG KINNARD",
      "description": "Rep. Nancy Mace of South Carolina is raising allegations against a former fiancé and his business associates. In a nearly hour-long speech on the House floor, Mace accused her ex-fiancé of physically abusing her and recording sex acts with her and others without their consent. She said she also has evidence of him conspiring with business associates in acts of rape and sexual misconduct. The former fiancé, Patrick Bryant, categorically denied all the allegations. Mace said she was speaking out because South Carolina's top prosecutor didn’t take action. South Carolina Attorney General Alan Wilson's office called Mace's comments about the prosecutor’s conduct “categorically false.”",
      "publishedAt": "2025-02-11T02:24:41Z",
      "title": "Rep. Nancy Mace accuses ex-fiancé and associates of misconduct in speech on House floor",
      "url": "https://apnews.com/article/nancy-mace-south-carolina-7d831f415ae00d703e30fa6c701f18de",
      "urlToImage": "https://dims.apnews.com/dims4/default/20b4ee1/2147483647/strip/true/crop/4896x2754+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fc4%2F902606cfbebbb3c1d4790f6d3710%2F4825183fe3a44b7b8422b671de35d5d7"
    },
    {
      "author": "DAVID CRARY",
      "description": "More than two-dozen Christian and Jewish groups representing millions of Americans have filed a federal court lawsuit challenging a Trump administration move giving immigration agents more leeway to make arrests at houses of worship. The plaintiffs range from the Episcopal Church and the Union for Reform Judaism to the Mennonites and Unitarian Universalists. There was no immediate government response to the suit.",
      "publishedAt": "2025-02-11T14:05:45Z",
      "title": "27 religious groups sue Trump administration to protect houses of worship from immigration arrests",
      "url": "https://apnews.com/article/immigration-arrests-church-ban-lawsuit-trump-administration-7e0f3060033fc25c5982bc583587562c",
      "urlToImage": "https://dims.apnews.com/dims4/default/680f9b0/2147483647/strip/true/crop/2595x1460+0+233/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Fa5%2Fca7da270f468e945da066f88e478%2F113c19c2837347f281657b984e371398"
    },
    {
      "author": "MATTHEW DALY",
      "description": "President Donald Trump says he is banning federal use of paper straws, saying they “don’t work” and don’t last very long. Instead he wants the government to exclusively move to plastic. Trump signed an executive order to reverse federal policies that encourage paper straws and restrict plastic straws. Trump has long railed against paper straws, and his 2019 reelection campaign sold Trump-branded reusable plastic straws. His move targets a Biden administration policy to phase out federal purchases of single-use plastics, including straws, by 2035. Several U.S. states and cities have banned plastic straws because they pollute oceans and waterways and harm marine life. Some restaurants no longer automatically give plastic straws to customers.",
      "publishedAt": "2025-02-10T22:50:09Z",
      "title": "Trump signs order for plastic straws as he declares paper ones 'don’t work'",
      "url": "https://apnews.com/article/trump-plastic-straws-pollution-oceans-packaging-e64e2671bbf7f8a8abaec0d5a491f7de",
      "urlToImage": "https://dims.apnews.com/dims4/default/a157d6b/2147483647/strip/true/crop/4763x2679+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1c%2F42%2Ff9d86616541562023fd882c9cdf5%2F2410975c3cb54edf8557060772484ddf"
    },
    {
      "author": "REBECCA SANTANA, CEDAR ATTANASIO",
      "description": "The acting head of the federal agency responsible for responding to disasters says he’s suspending payments sent to New York City to house migrants and that staff who made them will be held accountable. Cameron Hamilton is the acting administrator of the Federal Emergency Management Agency, and his Monday comments came after Elon Musk blasted the transactions. Musk posted on X that his team had discovered $59 million sent to New York City to house people in the country illegally in hotels. Musk gave no evidence. Information from the city indicated that the money the city has received from the federal government to care for migrants was appropriated by Congress and allocated to the city last year by FEMA. The city says it hasn’t been notified of any pause in funding,",
      "publishedAt": "2025-02-10T22:59:06Z",
      "title": "FEMA says it's halting payments for migrant housing in New York after Musk blasts money for hotels",
      "url": "https://apnews.com/article/fema-migrant-funding-new-york-hotels-immigration-elon-musk-doge-268ca7eda43011a501dfad0fa88a4775",
      "urlToImage": "https://dims.apnews.com/dims4/default/81c23cf/2147483647/strip/true/crop/4776x2687+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F01%2Fac89cc420ac62d41eda0ea29ae0d%2F27a06bc4303643b69b084790ca279051"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "Pope Francis has issued a major rebuke to the Trump administration’s mass deportation of migrants. He warned that the program to forcefully deport people purely because of their illegal status deprives them of their inherent dignity and “will end badly.” Francis took the remarkable step of addressing the migrant crackdown in a letter Tuesday to U.S. bishops. The letter appeared to take direct aim at Vice President JD Vance’s defense of the deportation program. History’s first Latin American pope has long made caring for migrants a priority of his pontificate, demanding that countries welcome, protect, promote and integrate those fleeing conflicts, poverty and climate disasters.",
      "publishedAt": "2025-02-11T11:54:14Z",
      "title": "Pope rebukes Trump administration over migrant deportations, and appears to take direct aim at Vance",
      "url": "https://apnews.com/article/pope-trump-migration-09a89091f8e7dc3270099f0947d04e90",
      "urlToImage": "https://dims.apnews.com/dims4/default/eafbbf4/2147483647/strip/true/crop/1692x952+0+89/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2F64%2F126345ddab147c38d2d7642ce9e2%2Ff35f2b30bfb041b0b007fa87ba4603f9"
    },
    {
      "author": "MOLLY QUELL",
      "description": "An Israeli army reservist’s dream vacation in Brazil ended abruptly last month over an accusation that he committed war crimes in the Gaza Strip. A pro-Palestinian legal group had convinced a federal judge in Brazil to open a war crimes investigation for his alleged participation in the demolition of civilian homes in Gaza. The group, the Hind Rajab Foundation, has brought dozens of complaints in more than 10 countries, using a legal concept called “universal jurisdiction,” which allows governments to prosecute people for the most serious crimes regardless of where they are allegedly committed. Its campaign has yet to yield any arrests. The army reservist vacationing in Brazil fled the country and returned to Israel.",
      "publishedAt": "2025-02-11T05:16:05Z",
      "title": "Some Israeli soldiers traveling abroad are targeted for alleged war crimes in Gaza",
      "url": "https://apnews.com/article/gaza-war-israel-palestinians-universal-jurisdiction-f1309c6b407fe157edd6cbd2bad3a8ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/68e9090/2147483647/strip/true/crop/5386x3030+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2Fc1%2Fc637d5f9b9357f77c80f384741ad%2F5a5977f130cc4dc8ae516d7cb629d448"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Lawmakers in some states are pushing measures to crack down on abortion pills or penalize women who obtain abortions. Some of the efforts appear to be stalled this year. It's too early to tell whether others will gain momentum. Several states have banned abortion, but only Louisiana so far has specifically classified mifepristone and misoprostol as controlled dangerous substances. The move can increase penalties for people who possess them without prescriptions. No state has passed a law to allow charges against a woman who obtains an abortion. One scholar says introducing legislation can normalize the debates on ideas previously seen as extreme.",
      "publishedAt": "2025-02-11T05:01:33Z",
      "title": "States propose bans on abortion pills and penalties for women",
      "url": "https://apnews.com/article/abortion-states-pills-criminalizing-women-indiana-oklahoma-3289e275b159a5eeabcd82afc4f35177",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c61e91/2147483647/strip/true/crop/8251x4641+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F96%2F36b8925cfdc62b923e78e246fc6c%2F6bfb08019f1148f1a5a6cb9d56f911d1"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "Ukraine has offered to strike a deal with U.S. President Donald Trump for continued American military aid in exchange for developing Ukraine’s mineral industry. It could provide a valuable source of the rare earth elements that are essential for many kinds of technology. Trump said that he wanted such a deal earlier this month. It was initially proposed last fall by Ukrainian President Volodymyr Zelenskyy as part of his plan to strengthen Kyiv’s hand in future negotiations with Moscow.",
      "publishedAt": "2025-02-11T05:17:40Z",
      "title": "Ukraine’s rare earth elements could help keep US military aid flowing",
      "url": "https://apnews.com/article/russia-ukraine-war-rare-earth-elements-trump-6a4a95d4370a2e46a81ce4a3a352bf8f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a0fc9a/2147483647/strip/true/crop/5160x2903+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F50%2F1b0a9d2ff0756bfcf4ce416bb975%2F1e0d6d6e405a46fa8ca378b2e95ba161"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}