{
  "articles": [
    {
      "author": "STEVE PEOPLES, JONATHAN J. COOPER and ZEKE MILLER",
      "description": "CHICAGO (AP) — Warning of a difficult fight ahead, former President Barack Obama and Michelle Obama on Tuesday called on the nation to embrace Kamala Harris in urgent messages to the Democratic National Convention that were at times both hopeful and ominous.",
      "publishedAt": "2024-08-20T10:32:31Z",
      "title": "Obamas close DNC's second night with rousing Harris endorsement and pointed warnings about Trump",
      "url": "https://apnews.com/ffb55cee591f8f162ad77b5d6b91152b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9813003dccb43b8a233da8c192087ce/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and NICHOLAS RICCARDI",
      "description": "CHICAGO (AP) — The Democratic National Convention's second night showcased a double dose of Obama firepower to validate Vice President Kamala Harris and deliver an unsparing indictment of Republican Donald Trump.",
      "publishedAt": "2024-08-21T00:58:28Z",
      "title": "A double dose of Obama firepower, a doting spouse and a dance party: Takeaways from Day 2 of the DNC",
      "url": "https://apnews.com/490981a504638749cf2c18848506c74b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6549da19ec7a4afb9a96df4879b928b7/1000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN, JAKE OFFENHARTZ, JOEY CAPPELLETTI and LEA SKENE",
      "description": "CHICAGO (AP) — Multiple pro-Palestinian demonstrators were arrested Tuesday after clashing with police during a protest that began outside the Israeli consulate and spilled out onto the surrounding streets on the second night of the Democratic National Convention.",
      "publishedAt": "2024-08-20T16:05:51Z",
      "title": "Pro-Palestinian protesters clash with police near Chicago's Israeli consulate on second night of DNC",
      "url": "https://apnews.com/f064683535bbbe93231d31ecc2dbafc7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1070a93c8c874e158a782bfb09fbf53b/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and MATTHEW LEE",
      "description": "JERUSALEM (AP) — U.S. Secretary of State Antony Blinken ended his ninth visit to the Middle East since the war in Gaza began without securing any major breakthrough for a cease-fire deal, warning on Tuesday that “time is of the essence” even as Hamas and Israel signaled that challenges remain.",
      "publishedAt": "2024-08-20T07:12:13Z",
      "title": "Blinken ends latest Mideast visit without a cease-fire, warning 'time is of the essence'",
      "url": "https://apnews.com/54dfaddce02c2d3cdf0415b140b3229c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d267c5325d2a41aa80652ce90ef3eab4/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "A year ago this week, President Vladmir Putin strode onto a stage in the Kursk region to commemorate the 80th anniversary of one of the Soviet army's proudest moments in World War II.Addressing a rapt audience that included soldiers fresh from fighting in Ukraine, Putin called the decisive victory in the Battle of Kursk “one of the great feats of our people.”",
      "publishedAt": "2024-08-21T04:13:07Z",
      "title": "Putin's slow response to the Kursk attack could test the patience of some of his backers in Russia",
      "url": "https://apnews.com/72d96d8cb52c105e9289dc6909900b13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8b8ec20401b48298557f822fed4a101/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI",
      "description": "TEHRAN, Iran (AP) — A bus carrying Shiite pilgrims from Pakistan to Iraq crashed in central Iran, killing at least 28 people, an official said Wednesday.The crash happened Tuesday night in the central Iranian province of Yazd, said Mohammad Ali Malekzadeh, a local emergency official, according to the state-run IRNA news agency.",
      "publishedAt": "2024-08-21T04:24:26Z",
      "title": "Bus carrying Shiite pilgrims from Pakistan to Iraq crashes in Iran, killing at least 28 people",
      "url": "https://apnews.com/3434de3b77c716f2430174ffdb39410a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0c383839e6c468299b83df88c228c6e/3000.jpeg"
    },
    {
      "author": "ISABELLA VOLMERT and BILL BARROW",
      "description": "HOWELL, Mich. (AP) — Former President Donald Trump pledged Tuesday to “Make America Safe Again\" while campaigning in Michigan as the Democrats who gathered in Chicago to nominate Kamala Harris branded him a career criminal.",
      "publishedAt": "2024-08-20T22:13:18Z",
      "title": "Trump campaigns to 'make America safe again' as Democratic convention zeroes in on his felony record",
      "url": "https://apnews.com/1cce84222d4a15f8174e6aa810152bd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0634beabba5a42f5a363db6b7082b48b/3000.jpeg"
    },
    {
      "author": "SEJAL GOVINDARAO and AMY BETH HANSON",
      "description": "PHOENIX (AP) — Voters in Arizona and Montana will be able to decide in November whether they want to protect the right to an abortion in their state constitutions.The Arizona Supreme Court ruled Tuesday that a 200-word summary that abortion advocates used to collect signatures for a ballot measure is valid, clearing the way for the issue to remain on the ballot.",
      "publishedAt": "2024-08-21T00:50:56Z",
      "title": "Voters in Arizona and Montana can decide on constitutional right to abortion",
      "url": "https://apnews.com/61c2a4c0565af8879801cdc7226410d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e3493cb459a4036ba61a9aea6c4dc0f/3000.jpeg"
    },
    {
      "author": "ANDREA ROSA and MIKE CORDER",
      "description": "PORTICELLO, Sicily (AP) — Specialist cave divers working in 12-minute underwater shifts were searching Tuesday for six missing passengers and crew, including British tech tycoon Mike Lynch, believed to be in the submerged wreck of a luxury yacht that was slammed by a powerful storm and swiftly sank off Sicily.",
      "publishedAt": "2024-08-20T13:34:58Z",
      "title": "What is known about the sinking of a luxury yacht off the coast of Sicily and those aboard",
      "url": "https://apnews.com/7eb9496d2f22f85b82e9cfccaa397657",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/144009b2790a440997d5edeeb712e34a/2890.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES",
      "description": "RIO DE JANEIRO (AP) — Two groups of men stood on opposite rooftops perched on a hillside overlooking Rio de Janeiro's Ipanema beach, taunting one another.",
      "publishedAt": "2024-08-21T04:27:05Z",
      "title": "Plaything or peril? Brazilian kites are endangering lives and prompting a push for a national ban",
      "url": "https://apnews.com/c88d815e5c7b13028287ada709f4f5d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a390dec311f4f678aed3ecdf33025a7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}