{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden is heading to Florida on Saturday for a firsthand look at Hurricane Idalia's destruction, but he won't be seeing the state's Republican governor and 2024 presidential hopeful, Ron DeSantis, who suggested such a meeting could hinder disaster response efforts.",
      "publishedAt": "2023-09-02T04:03:22Z",
      "title": "President Biden heads to Florida to see Idalia's destruction. But he won't be seeing Gov. DeSantis",
      "url": "https://apnews.com/3ff2f44e6a314dfaf1e329fa10ac1b5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b843cff4815409682d6f66c9bfb1309/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Singer-songwriter Jimmy Buffett, who popularized beach bum soft rock with the escapist Caribbean-flavored song “Margaritaville” and turned that celebration of loafing into a billion-dollar empire of restaurants, resorts and frozen concoctions, has died.",
      "publishedAt": "2023-09-02T08:15:33Z",
      "title": "'Margaritaville' singer Jimmy Buffett, who turned beach-bum life into an empire, dies at 76",
      "url": "https://apnews.com/4295f355b39237f40663d485c4c6d557",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a06cb1e57844206beeba1919efce837/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and SARUUL ENKHBOLD",
      "description": "ULAANBAATAR, Mongolia (AP) — Pope Francis on Saturday praised Mongolia’s tradition of religious freedom dating to the times of its founder, Genghis Khan, as he opened the first-ever papal visit to the Asian nation with a word of encouragement to its tiny Catholic flock.",
      "publishedAt": "2023-09-02T02:54:00Z",
      "title": "Pope starts Mongolia visit by praising the country's religious freedom dating back to Genghis Khan",
      "url": "https://apnews.com/98740116fdfefb395683b9b28c7e8c3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd36be52f6734c3196634575899dd9c9/1920.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "TAIPEI, Taiwan (AP) — As People’s Liberation Army fighter jets from China sped toward Taiwan on Friday, life on the self-governing island carried on as normal. Andy Huang, a restaurateur in Taipei, said he has become desensitized to military threats from the mainland.",
      "publishedAt": "2023-09-02T04:05:37Z",
      "title": "As Taiwan's government races to counter China, most people aren't worried about war",
      "url": "https://apnews.com/3dde05f227bb579bf406556c05b1d131",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1929da67b8614876845dce5180a5d3e2/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER and JAKE BLEIBERG",
      "description": "AUSTIN, Texas (AP) — Billionaires, burner phones, alleged bribes: The impeachment trial of Texas Attorney General Ken Paxton is going to test the will of Republicans senators to oust not only one of their own, but a firebrand who has helped drive the state's hard turn to the right for years.",
      "publishedAt": "2023-09-02T04:04:10Z",
      "title": "Texas AG Ken Paxton's impeachment trial is in the hands of Republicans who have been by his side",
      "url": "https://apnews.com/c5680e445a9663d5c3958892f68e4c88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e3d2672707441948d78875efa491c8a/3000.jpeg"
    },
    {
      "author": "KATHY McCORMACK",
      "description": "GOFFSTOWN, N.H. (AP) — A group of friends and neighbors meets for a weekly meal, choosing from a special menu of nutritious foods paid for by social programs meant to keep older adults eating healthy.",
      "publishedAt": "2023-09-02T12:08:37Z",
      "title": "More than a meal: Restaurant-based programs feed seniors' social lives",
      "url": "https://apnews.com/704da5411cd104b6e05bddc9ee4842eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35e58397e31f4441801514691d95b555/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "They were the kids most disrupted by the pandemic, the ones who were still learning to write their names and tie their shoes when schools shut down in the spring of 2020.",
      "publishedAt": "2023-09-02T04:06:50Z",
      "title": "Children hit hardest by the pandemic are now the big kids at school. Many still need reading help",
      "url": "https://apnews.com/53b0f3de56de526ead7a356bd7b853e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6288b43c27548cea9fb5fe78e5452b7/3000.jpeg"
    },
    {
      "author": null,
      "description": "STOCKHOLM (AP) — The Nobel Foundation on Saturday retracted its invitation for representatives of Russia, Belarus and Iran to attend this year’s Nobel Prize award ceremonies after the controversial decision “provoked strong reactions”.",
      "publishedAt": "2023-09-02T11:52:27Z",
      "title": "Nobel Foundation retracts invite to Russia, Belarus and Iran representatives to attend ceremonies",
      "url": "https://apnews.com/6f042c62945fc07e60ef828bd0263ffb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cee6415c70cc4782942e56e77140ccc9/3000.jpeg"
    },
    {
      "author": "FERNANDA PESCE",
      "description": "SAN FRANCISCO TEPEYACAC, Mexico (AP) — One family in central Mexico is struggling to preserve the production of cochineal dye, an intense, natural red pigment so prized that, after gold and silver, it was probably the most valuable thing the Spaniards found in Mexico after the 1521 conquest.",
      "publishedAt": "2023-09-02T04:07:10Z",
      "title": "Family in central Mexico struggles to preserve the natural way of producing intense red dye",
      "url": "https://apnews.com/6e6b998a78deb12e2b99a42f23358f08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b9eef6bfbee4a1ba410ac2fb8208866/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA and AIJAZ HUSSAIN",
      "description": "NEW DELHI (AP) — India launched its first space mission to study the sun on Saturday, less than two weeks after a successful uncrewed landing near the south polar region of the moon.",
      "publishedAt": "2023-09-02T06:44:30Z",
      "title": "India launches a spacecraft to study the sun after successful landing near the moon's south pole",
      "url": "https://apnews.com/19b9c94c42d0e4f0cd515a8fbe459cd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a2f3d274a634c00917be38113e8b434/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}