{
  "articles": [
    {
      "author": "SAMY MAGDY, MELANIE LIDMAN and LEE KEATH",
      "description": "CAIRO (AP) — Israeli tanks seized control of Gaza’s vital Rafah border crossing on Tuesday as Israel brushed off urgent warnings from close allies and moved into the southern city even as cease-fire negotiations with Hamas remained on a knife’s edge.",
      "publishedAt": "2024-05-07T05:59:14Z",
      "title": "Israeli forces seize Rafah border crossing in Gaza, putting cease-fire talks on knife's edge",
      "url": "https://apnews.com/113bf4ee5dad87dc5c003d76ed2785bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d35ba44e9f714ab6b88c3d3d8b0406ce/1920.jpeg"
    },
    {
      "author": "CHARLES REX ARBOGAST and STEVE LeBLANC",
      "description": "CHICAGO (AP) — Police cleared a pro-Palestinian tent encampment at the University of Chicago on Tuesday as tension ratcheted up in standoffs with demonstrators at other college campuses around the U.S.",
      "publishedAt": "2024-05-07T04:09:26Z",
      "title": "University of Chicago clears a pro-Palestinian demonstration as MIT confronts a new encampment",
      "url": "https://apnews.com/9bb8051253c45947509feb32ced78f8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f004579b43224bc2bf19bca2653ef43f/1920.jpeg"
    },
    {
      "author": "MIKE CORDER and BARBARA SURK",
      "description": "AMSTERDAM (AP) — Berlin police on Tuesday broke up a protest by several hundred pro-Palestinian activists who had occupied a courtyard on Berlin’s Free University earlier in the day. The protesters had put up about 20 tents and formed a human chain around the tents.",
      "publishedAt": "2024-05-07T06:49:43Z",
      "title": "Police break up pro-Palestinian student protest in Berlin as demonstrations spread across Europe",
      "url": "https://apnews.com/1eeb4e07231ebcc6776319ff0663db66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6052f4c9c984998bc311d21fb6f9efe/2053.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump returns to his hush money trial Tuesday facing a threat of jail time for additional gag order violations as prosecutors gear up to summon big-name witnesses in the final weeks of the case.",
      "publishedAt": "2024-05-07T04:02:20Z",
      "title": "Trump faces jail threat over gag order as prosecutors zero in on transactions at heart of the case",
      "url": "https://apnews.com/d853768fff5fafbdee55623579889140",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca46e9e432e04128b90266d56d6630e4/1920.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — Millions of Indian voters across 93 constituencies were casting ballots on Tuesday as Prime Minister Narendra Modi mounted an increasingly shrill election campaign, ramping up polarizing rhetoric in incendiary speeches that have targeted the Muslim minority.",
      "publishedAt": "2024-05-07T04:50:51Z",
      "title": "India votes in third phase of national elections as Modi escalates his rhetoric against Muslims",
      "url": "https://apnews.com/49a55f4caa199e72dfa9ae081b4e38b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7688d15883c43bfb02fbc6fd1a8240f/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "Vladimir Putin began his fifth term Tuesday as Russian leader at a glittering Kremlin inauguration, setting out on another six years in office after destroying his political opponents, launching a devastating war in Ukraine and concentrating all power in his hands.",
      "publishedAt": "2024-05-07T04:10:59Z",
      "title": "Putin begins his fifth term as president, more in control of Russia than ever",
      "url": "https://apnews.com/355bd36a2e833800187af848dc24a7dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db042ff505bc485ba035935a19cd2ca3/1920.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN, SEAN MURPHY and JIM SALTER",
      "description": "OKLAHOMA CITY (AP) — A tornado destroyed homes, forced the evacuation of a nursing home and toppled trees and power lines when it roared through a small Oklahoma town, one of several twisters that erupted in the central United States amid a series of powerful storms that stretched into Tuesday.",
      "publishedAt": "2024-05-07T04:34:39Z",
      "title": "Second tornado in 5 weeks damages Oklahoma town and causes 1 death as powerful storms hit central US",
      "url": "https://apnews.com/b8def43f7b0402d12911573ea5b4233b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a0dd0489fc44d7196eda1341ccd7bdb/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "SEATTLE (AP) — The Federal Aviation Administration said Monday it has opened an investigation into Boeing after the beleaguered company reported that workers at a South Carolina plant falsified inspection records on certain 787 planes.",
      "publishedAt": "2024-05-06T23:36:05Z",
      "title": "The FAA investigates after Boeing says workers in South Carolina falsified 787 inspection records",
      "url": "https://apnews.com/4b6ac28d8ab0d7687112e2cbb7bf6e00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14658c731f3c49188a0af9d73df85da7/3000.jpeg"
    },
    {
      "author": "JEROME PUGMIRE",
      "description": "The Olympic torch will finally enter France when it reaches the southern seaport of Marseille on Wednesday. And it's already been quite a journey. After being lit by the sun’s rays on April 16 in Ancient Olympia, the torch was carried around Greece before leaving Athens aboard a three-mast ship named Belem, headed for Marseille.",
      "publishedAt": "2024-05-07T06:31:55Z",
      "title": "From Marseille to Mont-Blanc: What to know about the journey of the Olympic torch to Paris",
      "url": "https://apnews.com/482c9f3d4847fd74a398911b721c4daf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac1882c215a840ee80919132e31fdae9/3000.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "NEW YORK (AP) — Sauntering through the hallways of the Metropolitan Museum of Art on the way to cocktails, James Corden spread his arms out comically, like he owned the place. “Let me know if you want me to talk you through any of this,” he said, pointing to the precious art on the walls, joking around with Jeff Bezos and his partner Lauren Sánchez, who happened to be walking behind him.",
      "publishedAt": "2024-05-07T07:25:13Z",
      "title": "Inside the Met Gala: A fairytale forest, woodland creatures, and some starstuck first-timers",
      "url": "https://apnews.com/f8486bf94244ce3da9c92aae143a0c4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b8ff5bb7fae4746a602ead8da7046e8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}