{
  "articles": [
    {
      "author": "ZEKE MILLER, CHRIS MEGERIAN, MICHELLE PRICE",
      "description": "Donald Trump will take the oath of office at noon, solidifying a political comeback without precedent in American history. He will become the 47th president on Monday after overcoming impeachments, criminal indictments and a pair of assassination attempts. He takes charge as Republicans assume unified control of Washington, giving Trump a fresh opportunity to reshape the country's institutions. The inaugural ceremony was moved indoors to the Capitol Rotunda because of frigid weather. Throngs of Trump supporters who descended on Washington to watch the proceedings from the National Mall will be left to find other places to view his ascension.",
      "publishedAt": "2025-01-20T05:06:30Z",
      "title": "Trump returning to power after unprecedented comeback, emboldened to reshape American institutions",
      "url": "https://apnews.com/article/donald-trump-inauguration-swearing-capitol-b3549ebe5dae74a872502aa79def7a11",
      "urlToImage": "https://dims.apnews.com/dims4/default/481f6df/2147483647/strip/true/crop/4640x2610+0+242/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F37%2F81bb095744c4d1704aeca5e00f91%2Fc0d0e91106c34b3aa9b8cd77ca9b183b"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "Carrie Underwood might not be Beyoncé or Garth Brooks in the celebrity superstar ecosystem. But the singer’s participation in President-elect Donald Trump’s inauguration is nevertheless a sign of the changing tides. Mainstream entertainers from Nelly to The Village People are more publicly and more enthusiastically associating with the new administration. Kid Rock, Billy Ray Cyrus, The Village People and Lee Greenwood all performed at a MAGA style rally Sunday. Those performing at inaugural balls include Nelly, country music band Rascal Flatts, country singer Jason Aldean and singer-songwriter Gavin DeGraw. Following the election, celebrity detractors have also been quieter than in 2017.",
      "publishedAt": "2025-01-20T05:11:06Z",
      "title": "Eight years ago, stars avoided Trump's inauguration. This time it’s different",
      "url": "https://apnews.com/article/trump-inauguration-celebrities-carrie-underwood-snoop-dogg-3668ca6c3b250af72a24c7b47622fece",
      "urlToImage": "https://dims.apnews.com/dims4/default/d322e84/2147483647/strip/true/crop/3683x2072+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F9e%2F07d84eed185d0833f1684142c7bf%2F87a8dbec320d4baa98a51cb5754b5a52"
    },
    {
      "author": "GISELA SALOMON, SOPHIA TAREEN",
      "description": "For millions in the U.S. illegally or with temporary legal status, the start of Donald Trump’s second term as president comes with a feeling their time in the U.S. may end soon. Trump made mass deportations a signature issue of his campaign and has promised a raft of orders to remake immigration policy when he takes office Monday. Plans for deportation arrests appear to be in flux after news leaked of an operation in Chicago this week. Trump’s “border czar” Tom Homan said on Fox News Sunday that Chicago was not off the table, but officials were reconsidering when and how to conduct enforcement. So-called sanctuary cities such as Chicago, which limit how local police cooperate with federal immigration authorities, have been a favorite Trump target.",
      "publishedAt": "2025-01-20T05:23:58Z",
      "title": "As Trump returns to the White House, families prepare for mass deportations",
      "url": "https://apnews.com/article/trump-deportation-immigration-homan-asylum-inauguration-ac10480dc636b758ab3c435b974aeb19",
      "urlToImage": "https://dims.apnews.com/dims4/default/371c6b7/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F54%2F32d72acb57b1059cde5885752880%2Fa064e4d4571f465daa90f052618d710a"
    },
    {
      "author": "ALAN SUDERMAN",
      "description": "The price of bitcoin has surged to over $109,000 just hours ahead of President-elect Donald Trump's inauguration, as a pumped up cryptocurrency industry expects early action by him soon after he takes office. Trump vowed on the campaign trail to take steps in early in his second presidency to make the U.S. the “crypto capital” of the world. His promises include creating a U.S. crypto stockpile, enacting industry-friendly regulation and even appointing a crypto “czar” for his administration. The crypto industry is celebrating Trump's inauguration with a first-ever “Crypto Ball.” The highly volatile nature of cryptocurrencies, and their use by criminals, scammers and rogue nations, has attracted plenty of critics.",
      "publishedAt": "2025-01-20T08:21:25Z",
      "title": "Bitcoin soars past $109,000 ahead of possible early action on crypto by Trump",
      "url": "https://apnews.com/article/bitcoin-crypto-trump-currency-cfa22616701c94590e6f9d409651acac",
      "urlToImage": "https://dims.apnews.com/dims4/default/b9f36be/2147483647/strip/true/crop/5439x3059+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2F51%2Fc24602bf43e1444c6d6e86b000f8%2Fd153db6eaad144ccb740dff75809647c"
    },
    {
      "author": "SIMINA MISTREANU",
      "description": "China’s vice president held meetings with the U.S. vice president-elect and U.S. business leaders, including Elon Musk, in Washington on the eve of Donald Trump’s inauguration, as the two major powers tackle ongoing tensions over trade and technology. Han Zheng, who serves as an envoy for Chinese President Xi Jinping at the inauguration, “discussed a range of topics including fentanyl, balancing trade and regional stability” with J.D. Vance, according to the Trump transition team. The Chinese official also met with Musk and other top U.S. business executives, including representatives of the U.S.-China Business Council and the U.S. Chamber of Commerce in Washington, D.C., according to the Chinese Foreign Ministry.",
      "publishedAt": "2025-01-20T06:03:11Z",
      "title": "The Chinese president's envoy meets with Vance and Musk on the eve of Trump's inauguration",
      "url": "https://apnews.com/article/han-zheng-vance-musk-trump-xi-2a82e553c50259d65f0e070c3079d8ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f75cee/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2F0f%2Fbe1cb74f932c0bd1c9243bcdcea5%2Fe5cdbf2255c84f6992a3634a38f332f5"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "Pope Francis says Donald Trump’s plans to impose mass deportations of immigrants would be a “disgrace.” History’s first Latin American pope was asked about the Trump administration pledges of deportations during an appearance Sunday night on a popular Italian talk show, Che Tempo Che Fa. He says mass deportations are not the way to resolve the immigration problem. It's not the first time that Francis has weighed in on Trump's immigration policy. During his first campaign for the presidency, in 2016, Francis was asked about Trump’s plans to build a wall along the U.S.-Mexico border. He famously said anyone who builds a wall to keep out migrants is “not Christian.”",
      "publishedAt": "2025-01-20T07:41:46Z",
      "title": "Pope Francis calls Trump's plans of mass deportation of immigrants 'a disgrace'",
      "url": "https://apnews.com/article/vatican-immigration-trump-pope-d3516b41de56641391f59c2094ee380e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ee2c03/2147483647/strip/true/crop/3800x2138+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2Fb3%2F4dc050c52a7816043ac711549c89%2F6815a5d4a2474f0b970d12136d44c67a"
    },
    {
      "author": null,
      "description": "Southern Californians are bracing for gusty winds and a heightened risk of wildfires less than two weeks after deadly blazes that have killed at least 27 people and ravaged thousands of homes. The National Weather Service has issued a warning of a “particularly dangerous situation” for parts of Los Angeles and Ventura counties from Monday afternoon through Tuesday morning because of low humidity and swift Santa Ana winds. Critical fire weather with wind gusts of up to 60 mph is also forecast for other Southern California communities stretching to San Diego. The warnings come as firefighters continue to battle two major blazes in the Los Angeles area.",
      "publishedAt": "2025-01-19T23:18:10Z",
      "title": "Southern California braces for gusty winds and heightened wildfire risk",
      "url": "https://apnews.com/article/california-fires-los-angeles-winds-red-flag-warnings-f65206e790a912a0ce7d7b99c52e4ea2",
      "urlToImage": "https://dims.apnews.com/dims4/default/57c4e01/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Fa7%2F02d8ee2aac3967a9e73068396e49%2F3203f687f64e484d9636896781f477fd"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "Billionaire's wealth has grown faster last year, and now the world can expect at least five trillionaires within a decade, even as the number of people in poverty has barely budged since 1990. The anti-poverty group Oxfam International's latest report on global inequality is calling for caps on CEO pay, better salaries for workers, and echoes outgoing President Joe Biden's call for higher taxes on the wealthiest to get them to pay their fair share. Oxfam's report was released Monday. The annual meeting of elites held by the World Economic Forum think tank in Davos, Switzerland, formally starts on Tuesday.",
      "publishedAt": "2025-01-20T02:10:50Z",
      "title": "Billionaires' wealth soared in 2024, anti-poverty group says as the elites prepare for another Davos",
      "url": "https://apnews.com/article/davos-2025-trump-wef-elon-musk-billionaires-ee121c56f6828021cb864de927383c7b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed59e5f/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F51%2Fe60f9969a3f3b22c03dc3a0a96b5%2F0f45f73f5cc84187a1526d48196da5d2"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "One of the Israeli hostages freed on the first day of the Gaza ceasefire said Monday in her first comments since being released that she has “returned to life.” Emily Damari, 28, was one of three hostages freed Sunday after spending 471 days in captivity. Officials at a hospital that received them said their condition was stable. In an Instagram story, which was shared by Israeli media, Damari thanked her family and the large protest movement that coalesced to advocate for the release of the hostages. “Thank you thank you thank you I’m the happiest in the world,” she said. Damari is a dual Israeli-British citizen. Her mother, Mandy Damari, said in a statement later Monday that Damari was \"doing much better than any of us could ever have anticipated.\"",
      "publishedAt": "2025-01-20T08:28:55Z",
      "title": "Middle East latest: Released Israeli hostage says she has 'returned to life'",
      "url": "https://apnews.com/article/israel-hamas-war-syria-lebanon-news-01-20-2025-51ff7d97ae0d6e3760377c1ac1c003f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e126349/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F92%2F00b3a6c7359f2df2c48d73e94071%2Fe78b998f227f4ea5a89649c98d54ca84"
    },
    {
      "author": "SAMY MAGDY, WAFAA SHURAFA",
      "description": "Even before the ceasefire deal between Israel and Hamas was fully in place, Palestinians in the war-battered Gaza Strip began to return to the remains of the homes they had evacuated during the 15-month war. They trekked through the wreckage, some on foot and others hauling their belongings on donkey carts. The return of the families comes amid looming uncertainty about whether the ceasefire deal will bring more than a temporary halt to the fighting, who will govern the enclave and how it will be rebuilt. The United Nations has said that reconstruction could take more than 350 years if Gaza remains under an Israeli blockade.",
      "publishedAt": "2025-01-19T12:32:47Z",
      "title": "Palestinians return to the remains of their homes as Gaza ceasefire takes hold",
      "url": "https://apnews.com/article/mideast-ceasefire-gaza-return-home-3942d995e85f0d33539c6625b2cd1ee5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d469c81/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F96%2Fc1b4624d0ed5f405d0466a72ed9e%2F1fef177a13d547158a4c3b8b2afb76d1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}