{
  "articles": [
    {
      "author": "MICHAEL KUNZELMAN, ERIC TUCKER, NOMAAN MERCHANT and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Donald Trump pleaded not guilty Thursday to trying to overturn the results of his 2020 election loss, answering for the first time to federal charges that accuse him of orchestrating a brazen and ultimately unsuccessful attempt to block the peaceful transfer of presidential power.",
      "publishedAt": "2023-08-03T04:04:52Z",
      "title": "Trump pleads not guilty to federal charges that he tried to overturn the 2020 election",
      "url": "https://apnews.com/a79f2d3683c7591058635c9b3d870070",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff6c6714c30941f6a40eb0119f354ba8/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — It was a routine part of a federal court hearing: The defendant was told not to discuss the case with any witnesses without lawyers present.But there's nothing routine about this case.",
      "publishedAt": "2023-08-04T04:24:40Z",
      "title": "Trump was told not to talk to witnesses in 2020 election conspiracy case. That could be a challenge.",
      "url": "https://apnews.com/3bb89a1e458ffa92baeb24ad69a93925",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d88402250ec94491a6da9b93129a5cbe/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden has his zingers (“This is not your father’s Republican Party”). He’s got patriotism (“This is the United States of America, dammit”).",
      "publishedAt": "2023-08-04T04:04:49Z",
      "title": "Play It Again, Joe. Biden bets that repeating himself is smart politics",
      "url": "https://apnews.com/b3540eef6f6c6bfa52d9fa3a95f6aff9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91bfdfa4a6524d1198266e15dbdbd3b8/3000.jpeg"
    },
    {
      "author": "JOHN FLESHER",
      "description": "SHARON TOWNSHIP, Mich. (AP) — Biologist Ashley Wilson carefully disentangled a bat from netting above a tree-lined river and examined the wriggling, furry mammal in her headlamp's glow. “Another big brown,” she said with a sigh.",
      "publishedAt": "2023-08-04T04:07:01Z",
      "title": "After helping prevent extinctions for 50 years, the Endangered Species Act itself may be in peril",
      "url": "https://apnews.com/12d1a8ef6d453ad8f6d4c2b6edb567e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c11cf236c6da44bf8f5454552133e778/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER, SAM MEDNICK and CARA ANNA",
      "description": "WASHINGTON (AP) — Ten days into a coup in Niger, life has become more challenging for U.S.",
      "publishedAt": "2023-08-04T04:34:12Z",
      "title": "In Niger, US seeks to hang on to its last, best counterterrorist outpost in West Africa",
      "url": "https://apnews.com/323c94199b9dff4c00479f1d0fcbbffe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ba703585527436da281f57c054227eb/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT, MARTHA MENDOZA, CLAIRE GALOFARO and JULIET LINDERMAN",
      "description": "The Afghan villager was afraid the American soldiers might come. And one cool night in fall, as his children lay asleep, helicopters roared overhead.At the first sound of gunshots, he yelled for his wife and 10 children to take cover.",
      "publishedAt": "2023-08-04T04:07:02Z",
      "title": "A baby was found in the rubble of a US raid in Afghanistan. But who exactly was killed and why?",
      "url": "https://apnews.com/1e73bba608994a53fca37b904dfd9a81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43bc37cc5b5a47a1a0fb7afe886d3716/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — An appeals court Thursday allowed a rule restricting asylum at the southern border to temporarily stay in place.",
      "publishedAt": "2023-08-04T00:20:07Z",
      "title": "Appeals court allows Biden asylum restrictions to temporarily stay in place as case plays out",
      "url": "https://apnews.com/2e25db44d7a6c4b51fe0d9c07832318d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc2b20027fdb447297378836187b7635/3000.jpeg"
    },
    {
      "author": "EVENS SANON and MEGAN JANETSKY",
      "description": "PORT-AU-PRINCE, HAITI (AP) — Haitians are expressing skepticism over an offer by Kenya to lead an international police force aimed at combatting the gang violence that has wracked the Caribbean nation.",
      "publishedAt": "2023-08-04T04:03:59Z",
      "title": "Haitians express skepticism over Kenya's offer to UN to send police to confront gangs",
      "url": "https://apnews.com/c53254477a4c523faf25de9e73a44cf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2443887feab4c5c91d14b2eef849811/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Focusing on the Bidens rather than Donald Trump's federal court appearance, House Republicans released a transcript Thursday of their interview with Hunter Biden’s former business associate detailing overseas financial dealings by the president’s son.",
      "publishedAt": "2023-08-03T19:09:39Z",
      "title": "Testimony from Hunter Biden associate provides new insight into their business dealings",
      "url": "https://apnews.com/16bab963461fe48ee3baccc51e693c9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/074341a32b4c4b0bbe9fdeef0bd0cb0e/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "PARKLAND, Fla. (AP) — Nine members of Congress are expected to tour the blood-stained and bullet-pocked halls at Marjory Stoneman Douglas High School on Friday, shortly before ballistics technicians reenact the massacre that left 14 students and three staff members dead.",
      "publishedAt": "2023-08-04T04:30:46Z",
      "title": "Congressional delegation to tour blood-stained halls where Parkland school massacre happened",
      "url": "https://apnews.com/7fe723cdffec5a3d746843da940cf20f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10dd4518f7cc499998707b941a5182b6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}