{
  "articles": [
    {
      "author": "TOM KRISHER, MIKE HOUSEHOLDER and JOHN SEEWER",
      "description": "DETROIT (AP) — Nearly one in 10 of America’s unionized auto workers went on strike Friday to pressure Detroit’s three automakers into raising wages in an era of big profits and as the industry begins a costly transition from gas guzzlers to electric vehicles.",
      "publishedAt": "2023-09-15T04:05:36Z",
      "title": "Workers strike at all 3 Detroit automakers, a new tactic to squeeze companies for better pay",
      "url": "https://apnews.com/7ce3ca9d94b911250d07556b7af376c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b873033a4e947fcb2a2aa29b6d6c57e/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Pentagon's Central Command has ordered interviews of roughly two dozen more service members who were at the Kabul airport when suicide bombers attacked during U.S. forces' chaotic Afghanistan withdrawal, as criticism persists that the deadly assault could have been stopped.",
      "publishedAt": "2023-09-15T18:02:07Z",
      "title": "US military orders new interviews on the deadly 2021 Afghan airport attack as criticism persists",
      "url": "https://apnews.com/fb5725ccf8ba641f79dc7976e7b9db79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d821e77f791a44b5948b95d39a82f06b/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, MICHELLE L. PRICE and THOMAS BEAUMONT",
      "description": "HAMPTON, Va. (AP) — Students were dancing in the aisles and their seats in the Hampton University auditorium long before Vice President Kamala Harris took the stage for the first stop of her fall college tour.",
      "publishedAt": "2023-09-15T15:04:33Z",
      "title": "Younger voters will be critical in 2024. Biden and Trump are taking different paths to reach them",
      "url": "https://apnews.com/ad7c5ab6417dd9c5a674467725113ace",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/800fc52b70234461bf1bbd45355829b7/3000.jpeg"
    },
    {
      "author": "MEAD GRUVER and JONATHAN J. COOPER",
      "description": "Mitt Romney's announcement this week that he will not seek another term in the U.S.",
      "publishedAt": "2023-09-15T14:27:35Z",
      "title": "Like his dad, retiring Mitt Romney embraced moderate conservatism. He fears the GOP has lost its way",
      "url": "https://apnews.com/d2035a423a05ee4a244d277338c05482",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3866c2a0a07c40f6ad46d03d84f8322b/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — President Joe Biden is trumpeting Medicare's new powers to negotiate directly with drugmakers on the cost of prescription medications — but a poll shows that any immediate political boost that Biden gets for enacting the overwhelmingly popular policy may be limited.",
      "publishedAt": "2023-09-15T04:03:08Z",
      "title": "Biden's Medicare price negotiation push is broadly popular. But he's not getting much credit",
      "url": "https://apnews.com/b82928109ae8564e750a6a196c98cfe9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd9ba065b18f4672bf2d6bbf92bc6a26/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER, JIM VERTUNO and JAKE BLEIBERG",
      "description": "AUSTIN, Texas (AP) — The impeachment trial of Texas Attorney General Ken Paxton moved Friday into the hands of a Senate jury that was deciding whether the embattled Republican should be removed from office over corruption allegations that have shadowed him for years.",
      "publishedAt": "2023-09-15T05:01:21Z",
      "title": "Texas Senate begins deliberations at Republican Attorney General Ken Paxton’s impeachment trial",
      "url": "https://apnews.com/9f367d56cce5cba71e539c6a7efd9b64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/180d581588394c7a887600415b4076be/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — New Mexico Gov. Michelle Lujan Grisham on Friday narrowed an order that broadly suspended the right to carry firearms in and around Albuquerque to apply only to public parks and playgrounds where children and their families gather.",
      "publishedAt": "2023-09-15T18:46:36Z",
      "title": "New Mexico governor amends order suspending right to carry firearms to focus on parks, playgrounds",
      "url": "https://apnews.com/cfc792724df5c6e653eefbce318c8d31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10250869097648b1969425058d4eb873/3000.jpeg"
    },
    {
      "author": "YOUSEF MOURAD",
      "description": "DERNA, Libya (AP) — Libyan authorities limited access to the flooded city of Derna on Friday to make it easier for searchers to dig through the mud and hollowed-out buildings for the more than 10,000 people still missing and presumed dead following a disaster that has already claimed more than 11,000 lives.",
      "publishedAt": "2023-09-15T07:33:56Z",
      "title": "Searchers look for more than 10,000 missing in flooded Libyan city where death toll eclipsed 11,000",
      "url": "https://apnews.com/72307547f3e0ff4fbf715a7f64c69383",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7af9420f7da34db0a14a9144249e8584/1920.jpeg"
    },
    {
      "author": "MANUEL RUEDA",
      "description": "BOGOTA, Colombia (AP) — Renowned Colombian painter and sculptor Fernando Botero, whose depictions of people and objects in plump, exaggerated forms became emblems of Colombian art around the world, has died.",
      "publishedAt": "2023-09-15T14:12:32Z",
      "title": "Colombian painter and sculptor Fernando Botero, known for his inflated forms, has died at age 91",
      "url": "https://apnews.com/701ff1a26225875fb86f25072a19e3eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7008cf3851b345d6b646a4b172476ad8/3000.jpeg"
    },
    {
      "author": "ROB MAADDI",
      "description": "PHILADELPHIA (AP) — Two losses in five days already puts the Minnesota Vikings in a big hole that’s been difficult for NFL teams to overcome.Since 1990, only 31 of the 270 clubs (11.5%) that began a season 0-2 advanced to the playoffs.",
      "publishedAt": "2023-09-15T13:50:43Z",
      "title": "History suggests 0-2 start is too difficult to overcome in the NFL",
      "url": "https://apnews.com/b71967ee092108a77deb7ee84ed4f3e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/530b608fafa945b499759fc0b6c9603d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}