{
  "articles": [
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump attacked the judge and the star witness in his criminal hush money trial and again tried to undermine New York's criminal justice system on Friday while seeking to turn his conviction on 34 felony charges into fuel — and not an impediment — to his bid to return to the White House.",
      "publishedAt": "2024-05-31T04:07:16Z",
      "title": "Trump responds to his guilty verdict by falsely blasting a 'rigged trial' and attacking star witness",
      "url": "https://apnews.com/4629840240cb308c5eae335532ad17ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daa301150efc4ddaba50cb84c77c946d/1920.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — The bravado behind Donald Trump' s boastful hypothesis in 2016 — “I could stand in the middle of Fifth Avenue and shoot somebody and I wouldn’t lose any voters\" — is headed for a real-world reckoning.",
      "publishedAt": "2024-05-31T17:20:27Z",
      "title": "Trump carries the stain of conviction like a crown. Will the verdict matter to voters?",
      "url": "https://apnews.com/99e6c20007751075a81e87a616861ed4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daa301150efc4ddaba50cb84c77c946d/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The Israeli military confirmed Friday that its forces are operating in central parts of Rafah in its expanding offensive in the southern Gaza city.Israel launched its ground assault into the city on May 6, triggering an exodus of around 1 million Palestinians out of the city and throwing U.N.",
      "publishedAt": "2024-05-31T13:29:03Z",
      "title": "Israel confirms its forces are in central Rafah in expanding offensive in the southern Gaza city",
      "url": "https://apnews.com/2f603675195f80c73c593020398ed72a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a89ee1c63a643e8ac5aa8c2543255c5/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV, MATTHEW LEE and KAREL JANICEK",
      "description": "KYIV, Ukraine (AP) — Germany joined the United States on Friday in authorizing Ukraine to hit some targets on Russian soil with the long-range weapons they are supplying — a significant policy change that comes as depleted Ukrainian troops are losing ground in the war.",
      "publishedAt": "2024-05-31T08:18:04Z",
      "title": "Berlin lets Ukraine use German weapons against targets in Russia after the US also eases its stance",
      "url": "https://apnews.com/9da696ff36130fe8c7033f3960eff382",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c70e16a38d8b4edd8cf1462617b707df/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, KEVIN FREKING and LEAH WILLINGHAM",
      "description": "WASHINGTON (AP) — Democratic Sen. Joe Manchin of West Virginia announced Friday he has switched his registration to independent, raising questions about his political plans since the move could help his chances should he seek elected office again in a state that has turned heavily Republican.",
      "publishedAt": "2024-05-31T14:37:20Z",
      "title": "Democratic Sen. Joe Manchin of West Virginia registers as independent, citing 'partisan extremism'",
      "url": "https://apnews.com/a4eb66f2cb773f822b6b607945cdeaef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13f54bbaea854380ab24df4529ba70c5/3000.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "NEW YORK (AP) — As high-stakes elections approach in the U.S. and European Union, publicly available artificial intelligence tools can be easily weaponized to churn out convincing election lies in the voices of leading political figures, a digital civil rights group said Friday.",
      "publishedAt": "2024-05-31T13:40:51Z",
      "title": "Tests find AI tools readily create election lies from the voices of well-known political leaders",
      "url": "https://apnews.com/2500813b642169478c27c168aab1b3e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8204675145a541a2bd8f6a158e300b82/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER and JAMIE STENGLE",
      "description": "AUSTIN, Texas (AP) — The Texas Supreme Court on Friday rejected a challenge to one of the most restrictive abortion bans in the U.S. following a lawsuit by women who had serious pregnancy complications.",
      "publishedAt": "2024-05-31T14:49:09Z",
      "title": "Texas Supreme Court rejects challenge to state's abortion law over medical exceptions",
      "url": "https://apnews.com/53b871dcd40b2660604980e5daa19512",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f8d89feecc24b1781f3b09a051d427d/3000.jpeg"
    },
    {
      "author": "LISA RATHKE",
      "description": "Vermont has become the first state to enact a law requiring fossil fuel companies to pay a share of the damage caused by climate change after the state suffered catastrophic summer flooding and damage from other extreme weather.",
      "publishedAt": "2024-05-31T12:32:03Z",
      "title": "Vermont becomes 1st state to enact law requiring oil companies pay for damage from climate change",
      "url": "https://apnews.com/b6565729f23e85eed4d3da44b04ae2e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11917dab48854eaab4ff4e40106f10b3/3000.jpeg"
    },
    {
      "author": "TERESA DE MIGUEL, MEGAN JANETSKY and RODRIGO ABD",
      "description": "AKTUN TUYUL CAVE SYSTEM, Mexico (AP) — Rays of sunlight slice through pools of crystal water as clusters of fish cast shadows on the limestone below. Arching over the emerald basin are walls of stalactites dripping down the cavern ceiling, which opens to a dense jungle.",
      "publishedAt": "2024-05-31T04:32:18Z",
      "title": "In Mexico's Yucatan Peninsula, a hidden underground world is under threat by the Maya Train",
      "url": "https://apnews.com/ce6db57e7043988a0ce4f04ef90a84ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0179cd02233474db5dfb402d9dfa71b/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN, MARY KATHERINE WILDEMAN and ANITA SNOW",
      "description": "David Hom suffered from diabetes and felt nauseated before he went out to hang his laundry in 108-degree weather, another day in Arizona's record-smashing, unrelenting July heat wave.",
      "publishedAt": "2024-05-31T14:38:49Z",
      "title": "AP analysis finds 2023 set record for US heat deaths, killing in areas that used to handle the heat",
      "url": "https://apnews.com/11de21a526e1cbe7e306c47c2f12438d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4b5277cb6244bfaa8764c94858da56b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}