{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER, JILL COLVIN and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump became the first former American president to be convicted of felony crimes Thursday as a New York jury found him guilty of all 34 charges in a scheme to illegally influence the 2016 election through a hush money payment to a porn actor who said the two had sex.",
      "publishedAt": "2024-05-30T04:03:01Z",
      "title": "Guilty: Trump becomes first former US president convicted of felony crimes",
      "url": "https://apnews.com/85558c6d08efb434d05b694364470aa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bc47508ad2f4f1aaa06173fc3097d69/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — A day after a New York jury delivered a historic guilty verdict in Donald Trump's criminal hush money trial, the presumptive Republican presidential nominee will likely look to cast the conviction and his campaign in a new light.",
      "publishedAt": "2024-05-31T10:21:42Z",
      "title": "The Latest | Following Trump's conviction in hush money case, he is set to hold news conference",
      "url": "https://apnews.com/f4a8c49cfe46f28f6daccd767e473188",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e59024032d6544d984f09c4890689222/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — Being convicted of a felony — let alone 34 of them – is the kind of blow that would normally tank any politician's ambitions. Donald Trump will instead try to turn what might otherwise be a career-ending judgment into campaign fuel.",
      "publishedAt": "2024-05-31T04:07:16Z",
      "title": "Trump will try to turn his guilty verdict into campaign fuel",
      "url": "https://apnews.com/4629840240cb308c5eae335532ad17ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ac19339ceff44a892d9e64ffa5fb6bd/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JILL COLVIN, MICHELLE L. PRICE and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump’s conviction on 34 felony counts marks the end of the former president’s historic hush money trial, but the fight over the case is far from over.",
      "publishedAt": "2024-05-30T22:35:31Z",
      "title": "Here's what you should know about Donald Trump's conviction in his hush money trial",
      "url": "https://apnews.com/a70941a7cd367f7b2aa3218ea91ad922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b521e49037043609340aa14d68bae92/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and LOLITA C. BALDOR",
      "description": "DUBAI, United Arab Emirates (AP) — Joint British-U.S. airstrikes targeting Yemen's Houthi rebels killed at least 16 people and wounded 42 others, the rebels said Friday, the highest publicly acknowledged death toll from the multiple rounds of strikes carried out over the rebels' attacks on shipping.",
      "publishedAt": "2024-05-31T08:07:06Z",
      "title": "Houthi rebels say at least 16 killed and 42 others wounded in joint US-British airstrikes in Yemen",
      "url": "https://apnews.com/12f99b7afc389a703f8dd333f2376b20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e7279765f2e4cea88e694271acac335/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV, MATTHEW LEE and KAREL JANICEK",
      "description": "KYIV, Ukraine (AP) — Germany joined the United States on Friday in authorizing Ukraine to hit some targets on Russian soil with the long-range weapons they are supplying — a significant policy change that comes as depleted Ukrainian troops are losing ground in the war.",
      "publishedAt": "2024-05-31T08:18:04Z",
      "title": "Berlin lets Ukraine use German weapons against targets in Russia after the US also eases its stance",
      "url": "https://apnews.com/9da696ff36130fe8c7033f3960eff382",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c70e16a38d8b4edd8cf1462617b707df/3000.jpeg"
    },
    {
      "author": "PAOLO SANTALUCIA, GIADA ZAMPANO, ANNIE RISEMBERG and BOUBACAR DIALLO",
      "description": "ROME (AP) — It was still dark and quiet outside when Ousmane Sylla performed his last prayer in the courtyard of an Italian migrant jail.“I miss my Africa very much and my mother too,” read a scribble in French on the wall nearby.",
      "publishedAt": "2024-05-31T06:24:57Z",
      "title": "Italy's migrant jails are squalid and chaotic. A young man from Guinea was desperate to escape",
      "url": "https://apnews.com/fb0892f51b4df5dd9164cea763fc74e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c6fec6f47344223bfd43d63170a1d6c/1920.jpeg"
    },
    {
      "author": "TERESA DE MIGUEL, MEGAN JANETSKY and RODRIGO ABD",
      "description": "AKTUN TUYUL CAVE SYSTEM, Mexico (AP) — Rays of sunlight slice through pools of crystal water as clusters of fish cast shadows on the limestone below. Arching over the emerald basin are walls of stalactites dripping down the cavern ceiling, which opens to a dense jungle.",
      "publishedAt": "2024-05-31T04:32:18Z",
      "title": "In Mexico's Yucatan Peninsula, a hidden underground world is under threat by the Maya Train",
      "url": "https://apnews.com/ce6db57e7043988a0ce4f04ef90a84ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de6bbd2095044430b27a050c5350b65b/1920.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — What did you do in the war, Granny?For British women who came of age during World War II, the answer to that question is often: quite a lot.",
      "publishedAt": "2024-05-31T05:04:25Z",
      "title": "Barred from combat, women working as codebreakers, cartographers and coxswains helped D-Day succeed",
      "url": "https://apnews.com/368259471e91c906309abb21b915086f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c28ba72871344608b6348a78e6ad3c5c/3000.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA",
      "description": "Earning her bachelor’s degree from the University of California at Riverside was surreal for Angelina Chavez, the culmination of overcoming her imposter syndrome and embracing the efforts of her mothers, who walked the stage with her during the Latinx ceremony.",
      "publishedAt": "2024-05-31T04:11:14Z",
      "title": "Degree attainment rates are increasing for US Latinos but pay disparities remain",
      "url": "https://apnews.com/c1fbbeee1368831a720cf70e533fccb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59f7c0d807774043b08268257f3af851/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}