{
  "articles": [
    {
      "author": "SAM METZ and MOSA'AB ELSHAMY",
      "description": "TAFEGHAGHTE, Morocco (AP) — Moroccan soldiers and aid teams in trucks and helicopters battled Monday to reach remote mountain towns devastated by a monstrous earthquake that killed more than 2,400 people, with survivors desperate for help to find loved ones feared trapped under the rubble.",
      "publishedAt": "2023-09-11T10:42:09Z",
      "title": "Moroccan soldiers and aid teams battle to reach remote, quake-hit towns as toll rises past 2,400",
      "url": "https://apnews.com/a1b2cbc0ce88afbfe7ad23e652ce11de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e5ff38ac92840f1bfa99a40115831d8/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Russia and North Korea confirmed Monday that North Korean leader Kim Jong Un will visit Russia in a highly anticipated meeting with President Vladimir Putin that has sparked Western concerns about a potential arms deal for Moscow’s war in Ukraine.",
      "publishedAt": "2023-09-11T08:22:37Z",
      "title": "Moscow and Pyongyang confirm North Korean leader Kim Jong Un will visit Russia to meet with Putin",
      "url": "https://apnews.com/674e9f1155de1c83ca1a819e7dbf96ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2512d0f76787470ea9fab4db9de0d529/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Americans are looking back on the horror and legacy of 9/11, gathering Monday at memorials, firehouses, city halls and elsewhere to observe the 22nd anniversary of the deadliest terror attack on U.S.",
      "publishedAt": "2023-09-11T04:04:54Z",
      "title": "The United States marks 22 years since 9/11, from ground zero to Alaska",
      "url": "https://apnews.com/47488758b18fd78f541674041e36d263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63852c6989f54dc69b3177e609cd6ae0/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and AAMER MADHANI",
      "description": "HANOI, Vietnam (AP) — President Joe Biden closed a visit to Vietnam on Monday by spotlighting new business deals and partnerships between the two countries and paying respects at a memorial honoring his late friend and colleague Sen.",
      "publishedAt": "2023-09-11T06:51:12Z",
      "title": "Biden highlights business deals and pays respects at John McCain memorial to wrap up Vietnam visit",
      "url": "https://apnews.com/58d7c84a3467aa49f878fb28fc77620c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/324570399a544d689fdb673f596c36c6/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — House Speaker Kevin McCarthy is a man who stays in motion — enthusiastically greeting tourists at the Capitol, dashing overseas last week to the G7 summit of industrial world leaders, raising funds back home to elect fellow Republicans to the House majority.",
      "publishedAt": "2023-09-11T04:00:50Z",
      "title": "McCarthy juggles government shutdown and Biden impeachment inquiry as House returns to messy fall",
      "url": "https://apnews.com/4d8c314763252429a6f87e7d13ad2b43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f73c1a32af84a068eae6e3a7ab46d4f/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Ambulance and fire truck sirens wailed outside as Elsie Rosales stripped linens from king-sized mattresses at a beachfront resort in Lahaina.She tried to focus on the work, but was beset by dread: Had a wildfire taken the home she scrimped to buy on a housekeeper’s wages?",
      "publishedAt": "2023-09-11T04:11:54Z",
      "title": "Lahaina's fire-stricken Filipino residents are key to tourism and local culture. Will they stay?",
      "url": "https://apnews.com/5a06eed3e5ebe7466d62b5a9e2f214a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5078db11208f4b2582acaaff52b59bac/3000.jpeg"
    },
    {
      "author": "KAT STAFFORD",
      "description": "DETROIT (AP) — Dr. Starling Tolliver knew she wanted to become a doctor. Yet, as a Black girl growing up in Akron, Ohio, it was a dream that felt out of reach.She rarely saw doctors who looked like her.",
      "publishedAt": "2023-09-11T04:08:01Z",
      "title": "Patients need doctors who look like them. Can medicine diversify without affirmative action?",
      "url": "https://apnews.com/c85e959fd1a08431377f18693ec6d77c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0ddbb53372c4adc824a1c7907966200/3000.jpeg"
    },
    {
      "author": null,
      "description": "PHOENIXVILLE, Pa. (AP) — Authorities searched Monday for an escaped murderer who has eluded capture since breaking out of a southeastern Pennsylvania prison a week and a half ago after they said over the weekend he slipped out of the search area, changed his appearance, stole a dairy delivery van and tried to contact acquaintances.",
      "publishedAt": "2023-09-11T11:09:30Z",
      "title": "Escaped murderer slips out of search area, changes appearance and tries to contact former co-workers",
      "url": "https://apnews.com/cef94b9cbab4f563269e02bfa6c232e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a87cc78210c49c7bf811f9acdcac855/1920.jpeg"
    },
    {
      "author": "TALES AZZONI",
      "description": "Spanish soccer is ready to move forward, three weeks after its women’s team won the Women's World Cup but had its celebrations marred by a kiss that ignited a crisis.",
      "publishedAt": "2023-09-11T11:59:36Z",
      "title": "With Rubiales finally out, Spanish soccer ready to leave embarrassing chapter behind",
      "url": "https://apnews.com/c7b6930f841f462571f91c459d557729",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/deede399cff8433cade3896d59126546/3000.jpeg"
    },
    {
      "author": "YUCHENG TANG",
      "description": "BANGKOK (AP) — Xinyu Wen traveled to Thailand in June, planning a two-week vacation around Bangkok's Pride parade.",
      "publishedAt": "2023-09-11T02:02:29Z",
      "title": "Thailand's LGBTQ+ community draws tourists from China looking to be themselves",
      "url": "https://apnews.com/64aa8fa85e11ff92ce0adad810af58a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bbbadcf2236434681f2ed18ef42623e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}