{
  "articles": [
    {
      "author": "KRUTIKA PATHI and ROB GILLIES",
      "description": "NEW DELHI (AP) — Canada expelled a top Indian diplomat as it investigates what Prime Minister Justin Trudeau called credible allegations its government may have had links to the assassination in Canada of a Sikh activist, an accusation that India rejected as “absurd” on Tuesday.",
      "publishedAt": "2023-09-19T03:23:54Z",
      "title": "Canada expels Indian diplomat as it probes possible link to Sikh's slaying. India denies allegation",
      "url": "https://apnews.com/3c5572d9027769ea6adbd047ec6f462a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bddbf859062c4238a207747cd9a1a85b/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy's visit to Washington this week comes at a critical juncture for his alliance with the United States as Republican leaders in Congress diverge on how to send more military and humanitarian aid to the country.",
      "publishedAt": "2023-09-19T04:16:12Z",
      "title": "Political divide emerges on Ukraine aid package as Zelenskyy heads to Washington",
      "url": "https://apnews.com/9bced4d9a8c16ae5bf148f640b6f2c31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab638f4dd76b49098691e4118095e622/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The classified documents indictment of Donald Trump would seem, on paper at least, to be the most straightforward of the four criminal cases the former president is facing.",
      "publishedAt": "2023-09-19T04:18:16Z",
      "title": "Florida jury pool could give Trump an advantage in classified documents case",
      "url": "https://apnews.com/68155de474a855cd37e2a5c27ce55cbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77903ab20b174109bbab33a370099692/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and LINLEY SANDERS",
      "description": "NEW YORK (AP) — As President Joe Biden prepares to meet Israeli Prime Minister Benjamin Netanyahu this week in New York, a new poll finds that while Americans generally view Israel as a partner or ally, many question whether his far-right government shares American values.",
      "publishedAt": "2023-09-19T04:14:23Z",
      "title": "Most Americans view Israel as a partner, but fewer see it as sharing US values, AP-NORC poll shows",
      "url": "https://apnews.com/41ba5cb189185f3e4956f4465c00999f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ca190fcc38145c7a10a6c7eccdc1ea3/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL, LUJAIN JO and MATTHEW LEE",
      "description": "DOHA, Qatar (AP) — Five Americans detained for years in Iran walked off a plane and into freedom Monday, most arm-in-arm, as part of a politically risky deal that saw President Joe Biden agree to the release of nearly $6 billion in frozen Iranian assets owed by a third country, South Korea.",
      "publishedAt": "2023-09-18T07:40:35Z",
      "title": "Five Americans detained in Iran walk free, released in deal for frozen Iranian assets",
      "url": "https://apnews.com/4e1fa477f8e6af45fb764acd259c2f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/302f213b5bd646e8825c79d31e3bd7f5/2790.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI and JONATHAN MATTISE",
      "description": "NASHVILLE, Tenn. (AP) — For nearly a week, families whose lives were upended by a Nashville elementary school shooting took turns sharing dark details to Tennessee lawmakers.",
      "publishedAt": "2023-09-19T04:03:44Z",
      "title": "Families upended by school shootings share trauma in push for gun law changes, but get mixed results",
      "url": "https://apnews.com/c3993a41bbe4cb35730aa5add6baf964",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1555c37b712549aca83426c3d008d64c/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Days before potentially crossing paths with Russia’s top diplomat at the United Nations, Ukrainian President Volodymyr Zelenskyy suggested Monday that the world body needs to answer for allowing his country's invader a seat at the tables of power.",
      "publishedAt": "2023-09-19T00:45:39Z",
      "title": "Heading for UN, Ukraine's president questions why Russia still has a place there",
      "url": "https://apnews.com/1e6b464628a7a391289b2ad386bd2d8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f6fdb15fb354fb583ad2940a694c927/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "The United Auto Workers and Detroit's Big Three carmakers resumed talks aimed at ending a strike now in its fourth day, and under the threat that the walkout could soon spread.Stellantis said it resumed negotiations with the union Monday and described the talks as “constructive.” A spokesman for General Motors said representatives of the company and the United Auto Workers also were continuing to negotiate.",
      "publishedAt": "2023-09-18T15:38:23Z",
      "title": "Carmakers and the United Auto Workers are talking. No signs of a breakthrough to end the strike",
      "url": "https://apnews.com/f948704cce3d6dc9ca484142c5d0d98e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/890251f98bf64f5c87669011e2e9a467/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden sued the Internal Revenue Service on Monday, claiming that two agents publicly alleging tax-probe interference wrongly shared his personal information, a case that comes amid escalating legal and political struggles as the 2024 election looms.",
      "publishedAt": "2023-09-18T12:34:44Z",
      "title": "Hunter Biden sues the IRS over tax disclosures after agent testimony before Congress",
      "url": "https://apnews.com/08a6ecce30fcab3a2be5019be6464c76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4306b7c97b084d409fea6448d4a1240f/2160.jpeg"
    },
    {
      "author": "SARA BURNETT",
      "description": "Donald Trump is facing new blowback from anti-abortion activists for refusing to commit to national abortion restrictions and for calling Florida Gov. Ron DeSantis' signing of a six-week ban on the procedure a “terrible mistake.”",
      "publishedAt": "2023-09-18T16:03:20Z",
      "title": "Trump calls DeSantis abortion ban 'a terrible mistake,' sparking anger from some key Republicans",
      "url": "https://apnews.com/5bdbba55f9c2f328d49b5fbe9727677e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/834f04fc976b446894391847e8a98070/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}