{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike early Thursday on a school sheltering displaced Palestinians in central Gaza killed more than 30 people, including 23 women and children, according to local health officials.",
      "publishedAt": "2024-06-06T03:45:56Z",
      "title": "Israeli strike kills at least 33 people at a Gaza school the military claims was being used by Hamas",
      "url": "https://apnews.com/3d07e712f8abc1e08339163180823fb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3695df503df84bbab36b57a7d344d6e8/1920.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "UTAH BEACH, France (AP) — Twelve U.S. and British World War II veterans were given Legion of Honor awards by French President Emmanuel Macron on Thursday, the 80th anniversary of D-Day.Macron pinned medals on the 11 Americans and one Briton at a ceremony at the American Cemetery overlooking Omaha Beach, attended by U.S.",
      "publishedAt": "2024-06-06T02:07:16Z",
      "title": "As the world marks 80th anniversary of D-Day landings, renewed war in Europe is on minds of many",
      "url": "https://apnews.com/7b6896a9d891fb2d2f75b29e1cfd67ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3eb74c938a724938a2f1bda104f5bab7/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "World War II veterans joined heads of state and others Thursday on the beaches of Normandy to commemorate the 80th anniversary of D-Day. The Allied invasion, which began on June 6, 1944, led to the defeat of the Nazis and the end of the war.",
      "publishedAt": "2024-06-06T04:31:01Z",
      "title": "The Latest | D-Day's 80th anniversary brings World War II veterans back to the beaches of Normandy",
      "url": "https://apnews.com/826e41ec3c56a0b2b397b1d1637a00a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75802ddc95c94efaa84c3e2f52cb35c0/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, RANDALL CHASE, COLLEEN LONG and MIKE CATALINI",
      "description": "WILMINGTON, Del. (AP) — Jurors in Hunter Biden's criminal trial got a look at the .38 caliber Colt revolver he bought back in October 2018. They saw Form 4473, the firearms transaction record at the center of the case.",
      "publishedAt": "2024-06-06T04:09:40Z",
      "title": "Jurors in Hunter Biden's trial hear from the clerk who sold him the gun at the center of the case",
      "url": "https://apnews.com/62de446479ddcdb040c6a5418c6d28fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0866e2fd3cf943109aeb2ba3617e58b5/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and JOEY CAPPELLETTI",
      "description": "In Michigan's Upper Peninsula, two Republican members of a county canvassing board last month refused to sign off on the results of an election that led to the recall of three GOP members of the county commission.",
      "publishedAt": "2024-06-06T04:03:54Z",
      "title": "Election certification disputes in a handful of states spark concerns over presidential contest",
      "url": "https://apnews.com/09bb9d1fdc11b495b7c50687e5576997",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2e3417c963942ae92a5de2caba42c6f/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK and JULIA FRANKEL",
      "description": "SOUTH HEBRON HILLS, West Bank (AP) — For weeks after being sanctioned by the United States, Yinon Levi struggled to pay the bills, living at his farming outpost atop a hill in the occupied West Bank.",
      "publishedAt": "2024-06-06T04:10:58Z",
      "title": "Israeli settlers in the West Bank were hit with international sanctions. It only emboldened them",
      "url": "https://apnews.com/354f8b0a44b70c25bf013614b4775900",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f572d612b6c44c12b1fedd4e6f7795b7/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "BARCELONA, Spain (AP) — Spain became on Thursday the first European country to ask a United Nations court for permission to join South Africa’s case accusing Israel of genocide in Gaza.",
      "publishedAt": "2024-06-06T08:56:57Z",
      "title": "Spain applies to join South Africa’s case at top UN court accusing Israel of genocide",
      "url": "https://apnews.com/67d4d9b8ecf6fd88e718319a5d93465a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daa443e8220744c3880a6be893dc3d4e/3000.jpeg"
    },
    {
      "author": null,
      "description": "LIVONIA, Mich. (AP) — A toddler was killed and his mother was injured when a tornado struck suburban Detroit without warning, while five people were injured when a tornado in Maryland collapsed structures and trapped people inside.",
      "publishedAt": "2024-06-06T05:22:18Z",
      "title": "Tornado hits Michigan without warning, killing toddler, while twister in Maryland injures 5",
      "url": "https://apnews.com/a95e55dfbad6dd7ecf847a1983876bdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/484746d50e9944ae8a9a8e51f9f407e2/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "Ahmed Othman isn't on TikTok and doesn't want to be.He and his younger sister got iPhones when they were in eighth and seventh grade respectively, but with no social media, just iMessage. Their parents, who are both computer scientists, spent the next year teaching them about social media, bombarding them with studies about its effects on teen mental health.",
      "publishedAt": "2024-06-06T04:02:19Z",
      "title": "A realistic way to protect kids from social media? Find a middle ground",
      "url": "https://apnews.com/5d6bcdccd154acd631ab09023e81b369",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b53156461604d94a60b6347640a1f9b/3000.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Inspired by an 18th century Scottish philosopher and the modern scourge of misinformation, Suzanne Collins is returning to the ravaged, post-apocalyptic land of Panem for a new “The Hunger Games” novel.",
      "publishedAt": "2024-06-06T11:31:37Z",
      "title": "Suzanne Collins is releasing a new 'Hunger Games' novel, 'Sunrise on the Reaping,' next year",
      "url": "https://apnews.com/b30163b4707f4db55eb68513f197affc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8efbf47aefa049cba6f64ee15f3f05ba/2631.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}