{
  "articles": [
    {
      "author": "Paul Wiseman, Anne D'Innocenzio",
      "description": "U.S. importers are bracing for the impact of President Donald Trump's staggering 145% levy on Chinese imports. One Chicago-area toymaker expects its tariff bill to climb from $2 million to $100 million. The tariffs could mark the end of an era of inexpensive consumer goods in America. For four decades, Americans have relied on Chinese factories for everything from smartphones to Christmas ornaments. Trump is taking a sledgehammer to that arrangement in a bid to bring manufacturing back to the United States. China has retaliated by imposing a 125% tariff on American-made products effective Saturday.",
      "publishedAt": "2025-04-12T10:12:38Z",
      "title": "Trump's China tariffs swing a sledgehammer at importers and cheap goods",
      "url": "https://apnews.com/article/trump-tariffs-china-36df035fc02b45e498cc50f213536e79",
      "urlToImage": "https://dims.apnews.com/dims4/default/f1d7466/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F18%2F68958fb84821287f50a12213dbe9%2F3820f6c2d5e64da383e6ebd90ba9be8b"
    },
    {
      "author": "Mae Anderson",
      "description": "The Trump administration says it will exclude electronics like smartphones and laptops from ‘reciprocal’ tariffs, a move that could help keep the prices down for popular consumer electronics that aren’t usually made in the U.S. It would also benefit big tech companies like Apple and Samsung. U.S. Customs and Border Protection said items like smartphones, laptops, machines used to make semiconductors and flat-panel monitors would be exempt.",
      "publishedAt": "2025-04-12T14:38:41Z",
      "title": "Trump administration says it will exclude some electronics from 'reciprocal' tariffs",
      "url": "https://apnews.com/article/trump-tariffs-smartphones-electronics-laptops-apple-10c31e91d7790bfe8fb004f547109359",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Josh Boak, Matt Brown",
      "description": "Democrats are quick to say that President Donald Trump’s tariffs are horrible, awful, terrible. But Democrats are also stressing that they’re not inherently anti-tariff. What the president’s political opponents say they really dislike is the “chaos” he's unleashed. Massachusetts Sen. Elizabeth Warren says “Trump is creating chaos\" that undercuts the economy. The Democrats' message is meant to convey that they’re reasonable, focused on capable governance and attuned to financial market distress. It’s a pitch toward swing voters who'd like to see more manufacturing yet are uncomfortable with the consequences of Trump’s approach to tariffs. To the Trump White House, that message is nothing but hypocrisy.",
      "publishedAt": "2025-04-12T12:00:14Z",
      "title": "Democrats dislike the 'chaos' of Trump's trade war but are OK with some tariffs",
      "url": "https://apnews.com/article/trump-democrats-chaos-tariffs-trade-2f39f7be95d34008155f4ee29eb67235",
      "urlToImage": "https://dims.apnews.com/dims4/default/fa09a53/2147483647/strip/true/crop/4594x2584+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2Fae%2F027031a35c1ed2a69804e92502c1%2Ff11b224b7b3c498e845287e8adbc7c60"
    },
    {
      "author": "Bernard Condon, Stan Choe",
      "description": "The upheaval in stocks has been grabbing all the headlines, but there is a bigger problem looming in another corner of the financial markets that rarely gets headlines: Investors are dumping U.S. government bonds. Normally, investors rush into them at a whiff of economic chaos but now not even the lure of higher interest payments on the bonds is getting them to buy. The freak development has experts worried that investors are losing faith in America as a good place to store their money. That could be bad news for consumers in need of a loan — and for President Donald Trump, who had hoped his tariff pause earlier this week would restore confidence in the markets.",
      "publishedAt": "2025-04-11T18:10:55Z",
      "title": "Freak sell-off of ‘safe haven’ US bonds raises fear that confidence in America is fading",
      "url": "https://apnews.com/article/treasurys-bond-market-yield-tariff-46b4818710f01b8cc93fd002081167b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/b857f96/2147483647/strip/true/crop/5577x3137+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F15%2Fd1a744bc791575810511169524a9%2F8f8f3944560144debdd244ad49ac08ed"
    },
    {
      "author": "Leah Askarinam",
      "description": "The U.S. House is rethinking its voting rules after a push from Republican Rep. Anna Paulina Luna to allow proxy voting for new parents. Luna of Florida said her experiences as a new mom in 2023 pointed to the need for allowing lawmakers to vote from afar. But her idea was fiercely opposed by Republican leaders. Speaker Mike Johnson repeatedly called proxy voting “unconstitutional.” After weeks of turmoil, Luna agreed to a compromise that helps accommodate lawmakers who are absent without voting by proxy. Members of the House are split on whether the new system goes far enough.",
      "publishedAt": "2025-04-12T04:01:28Z",
      "title": "Fight over proxy voting for new parents upended US House",
      "url": "https://apnews.com/article/proxy-voting-anna-paulina-luna-brittany-petterson-c2f824034002c53b9e7d5bc534ccca88",
      "urlToImage": "https://dims.apnews.com/dims4/default/01c1961/2147483647/strip/true/crop/4748x2671+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2F41%2F0eb6675efbf5705d55c388b2707e%2F72ec300ee7104326b5d59adeffd2c012"
    },
    {
      "author": "Will Weissert",
      "description": "President Donald Trump has summed up his annual physical by saying, “I did well.” He says he believes his doctors would release a report on Sunday. The 78-year-old spent nearly five hours at Walter Reed National Military Medical Center on Friday afternoon, undergoing what he called “every test you can imagine.” Trump said that \"overall, I felt I was in very good shape.\" He says he has a “good heart, a good soul” and took a cognitive test in which he says he got \"every answer right.\" Despite long questioning predecessor Joe Biden’s physical and mental capacity, Trump has routinely kept basic facts about his own health shrouded in secrecy.",
      "publishedAt": "2025-04-11T04:01:03Z",
      "title": "Trump proclaims himself 'in good shape' after a physical, but his health report is still pending",
      "url": "https://apnews.com/article/trump-physical-past-medial-records-oldest-president-fcac7240c4a2cf98c1c30709506ab4f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/980c7bf/2147483647/strip/true/crop/2099x1181+0+109/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F65%2Ff5b8f5487c8f797376bb84a81052%2Fadb77e02f342469cb53b470c611fe000"
    },
    {
      "author": "Christine Fernando",
      "description": "Many people involved in the abortion debate say a movement of so-called abortion abolitionists who want to punish women for having abortions is widening its influence. It began gaining momentum after the Supreme Court’s 2022 ruling overturning Roe v. Wade. And it's accelerated since Republicans won full political control in Washington in last year’s elections. The movement’s impact also is beginning to show up in statehouses. So far this year, bills introduced in at least 12 states would allow prosecutors to charge those who have abortions with homicide. Even leaders of mainstream anti-abortion groups who oppose criminal penalties have been targeted for attacks by abortion abolitionists.",
      "publishedAt": "2025-04-12T12:48:48Z",
      "title": "Anti-abortion faction wants criminal charges for abortions",
      "url": "https://apnews.com/article/abortion-abolitionists-trump-roe-criminal-homicide-d6d5c7a05419fe9ded04271cb517b001",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c1bfa8/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F97%2Fe0a561fa6ddda10230fca3e4e394%2F5a495719aeba4656b2a2c1c863c8e52e"
    },
    {
      "author": null,
      "description": "A U.S. District Court judge ordered the Trump administration to unfreeze federal aid to Maine to comply with requirements under a law aimed at prohibiting sex-based discrimination in education. District Court Judge John Woodcock issued a temporary restraining order on Friday in a case brought by the state of Maine against the U.S. Department of Agriculture. A email message seeking comment was sent Saturday to the Agriculture Department. The dispute between Maine and the Trump administration has roots in the president’s push to deny federal funding to the state over transgender athletes. In February, the president and governor sparred during a meeting at the White House over the policy.",
      "publishedAt": "2025-04-12T12:31:07Z",
      "title": "Trump administration ordered to unfreeze funding in dispute with Maine over transgender students",
      "url": "https://apnews.com/article/maine-usda-funding-freeze-title-ix-c50bdfa491f11273353844ecf43f4aeb",
      "urlToImage": "https://dims.apnews.com/dims4/default/faabfec/2147483647/strip/true/crop/5051x2841+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2Fb0%2F956d6725477cd34f2c5832920a39%2Fa43cb9ba5f754e53b22bcf2fcecc253c"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States have begun negotiations in Oman over Tehran’s rapidly advancing nuclear program. Esmail Baghaei, a spokesman for Iran’s Foreign Ministry, made the announcement on the social platform. No overall agreement is immediately likely, but the stakes of the negotiations couldn’t be higher for these two nations closing in on half a century of enmity. Trump repeatedly has threatened to unleash airstrikes targeting Iran’s nuclear program if a deal isn’t reached. Iranian officials increasingly warn that they could pursue a nuclear weapon with their stockpile of uranium enriched to near weapons-grade levels.",
      "publishedAt": "2025-04-12T09:45:31Z",
      "title": "Iran says ‘indirect talks’ over nuclear program begin with US envoy",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-oman-3aaca426accb6e450fef6395cc5de909",
      "urlToImage": "https://dims.apnews.com/dims4/default/f25ef95/2147483647/strip/true/crop/1280x720+0+171/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2Fb5%2Fa95b99f9077360196009ec5fc5ee%2F05e9b71cd6bd4542847bfbcf10a64d72"
    },
    {
      "author": null,
      "description": "An immigration judge has ruled that a Palestinian Columbia University graduate student who participated in protests against Israel can be deported. Mahmoud Khalil's attorneys plan to appeal. Federal immigration agents detained Khalil last month. It was the first arrest under President Donald Trump’s crackdown on students who joined campus protests against the war in Gaza. The legal U.S. resident was taken to an immigration detention center in Louisiana. There, a judge ruled the U.S. government had “established by clear and convincing evidence that he is removable.” Khalil’s attorneys say they will appeal to the Board of Immigration Appeals. They can also pursue an asylum case.",
      "publishedAt": "2025-04-12T04:06:35Z",
      "title": "Mahmoud Khalil and his attorneys' plan to appeal his deportation, what to know",
      "url": "https://apnews.com/article/mahmoud-khalil-columbia-protester-ruling-deport-82e85ed47a7e60b0295f4a048d677cfe",
      "urlToImage": "https://dims.apnews.com/dims4/default/5f565a7/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2Fc9%2Fa19f52a2e1515baefa11b9f77ef3%2Fdcf131bf16984a18a5165ef5048ef8e3"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}