{
  "articles": [
    {
      "author": "STEPHEN GROVES",
      "description": "The House is heading towards a final vote on a bill to require the detainment of unauthorized migrants accused of theft and violent crimes. It marks the first legislation that President Donald Trump can sign as Congress, with some bipartisan support, swiftly moved in line with his plans to crackdown on illegal immigration. The Laken Riley Act is named after a Georgia nursing student who was murdered last year by a Venezuelan man. Its passage would show just how sharply the political debate over immigration has shifted to the right following Trump’s election victory.",
      "publishedAt": "2025-01-22T21:32:34Z",
      "title": "House prepares to pass immigrant detention bill that would be Trump's first law to sign",
      "url": "https://apnews.com/article/congress-immigration-crackdown-laken-riley-act-trump-a3e52af60b6b952f487e4ae03ebfacde",
      "urlToImage": "https://dims.apnews.com/dims4/default/0cf2462/2147483647/strip/true/crop/5840x3285+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F14%2Ffbb8e73fe18ad65c6111d1db3629%2F161f7cff89db4d04b1c2b2accf131c91"
    },
    {
      "author": "LOLITA C. BALDOR, TARA COPP",
      "description": "The Pentagon says it has begun deploying 1,500 active duty troops to help secure the southern border. It puts in motion plans President Donald Trump laid out in executive orders shortly after he took office to crack down on immigration. Acting Defense Secretary Robert Salesses says the troops will fly helicopters to assist Border Patrol agents and help in the construction of barriers. The Pentagon also will provide military aircraft to support Department of Homeland Security deportation flights for more than 5,000 detained migrants. The active duty forces will join the roughly 2,500 U.S. National Guard and Reserve forces already there.",
      "publishedAt": "2025-01-22T17:34:21Z",
      "title": "Pentagon is sending 1,500 active duty troops to help secure the US-Mexico border",
      "url": "https://apnews.com/article/troops-border-deploy-active-duty-09324578d2b89db5c44e0ba08f42df47",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d299ae/2147483647/strip/true/crop/5381x3027+0+280/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2Fcb%2Fb1caf97b533fd2a37eb02126c3bb%2F2c789c8b0c2e4b389eb1ab3a7debc468"
    },
    {
      "author": "BILL BARROW",
      "description": "President Donald Trump began his second administration with a blitz of policy actions to reorient U.S. government priorities. He has covered issues from trade, immigration and U.S. foreign aid to demographic diversity, civil rights and the hiring of federal workers. Some have an immediate policy impact. Others are more symbolic. Some already are being challenged by federal lawsuits. In total, the Republican president’s sweeping actions reflect many of his campaign promises and determination to concentrate executive branch power in the West Wing, while moving the country sharply rightward.",
      "publishedAt": "2025-01-22T18:05:42Z",
      "title": "Everything Trump did in the first executive orders of his presidency",
      "url": "https://apnews.com/article/what-has-trump-done-trump-executive-orders-f061fbe7f08c08d81509a6af20ef8fc0",
      "urlToImage": "https://dims.apnews.com/dims4/default/e93f226/2147483647/strip/true/crop/4479x2519+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F70%2F5f7e23f4ef8e66616922e00aa2c7%2F1891260582d84f2598be01c9cd832936"
    },
    {
      "author": "LISA MASCARO, CHRIS MEGERIAN",
      "description": "President Donald Trump is threatening to withhold federal disaster aid for wildfire-ravaged Los Angeles unless California leaders change the state’s approach on its management of water. Trump in a Fox News interview on Wednesday repeated false claims that California’s fish conservation efforts in the northern part of the state are responsible for fire hydrants running dry in urban areas. He says the blame for Los Angeles’ struggles to tame some of the deadly fires lies with Democratic Gov. Gavin Newsom. Trump added, “I don’t think we should give California anything until they let the water run down.\" Newsom for his part has called for partnership amid the disaster.",
      "publishedAt": "2025-01-22T18:02:09Z",
      "title": "Trump threatens to withhold federal aid for wildfire-ravaged Los Angeles",
      "url": "https://apnews.com/article/donald-trump-republicans-taxes-eea4754a0f580d451aa0588f0639d52c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2969845/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F11%2F1048d1d2b42f921e4fe0aa5a25f7%2F71e2eb540dd446268e2b75d03693b839"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "Elon Musk is clashing with OpenAI CEO Sam Altman over the Stargate artificial intelligence infrastructure project touted by President Donald Trump, the latest in a feud between the two billionaires that started on OpenAI’s board and is now testing Musk’s influence with the new president. Trump declared the Stargate project “a resounding declaration of confidence in America’s potential” under his new administration, with an initial private investment of $100 billion that could reach five times that sum. But Musk, a close Trump adviser who helped bankroll his campaign and now leads a government cost-cutting initiative, questioned the value of the investment hours later.",
      "publishedAt": "2025-01-22T20:26:35Z",
      "title": "Musk clashes with OpenAI CEO Sam Altman over Trump-supported Stargate AI data center project",
      "url": "https://apnews.com/article/stargate-ai-project-trump-musk-openai-sam-altman-oracle-softbank-734610c6dbe62a244527c6fd621fa004",
      "urlToImage": "https://dims.apnews.com/dims4/default/61af382/2147483647/strip/true/crop/4109x2311+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F51%2Fa711738e55796dd07c3554b69353%2F43329787d6e94d05ae319a4e26bff758"
    },
    {
      "author": "TIFFANY STANLEY",
      "description": "The Right Rev. Mariann Edgar Budde, bishop of the Diocese of Washington, says she will continue to pray for President Donald Trump, hours after he lashed out at her over a sermon. She told The Associated Press that he was not her enemy, and she believes they can disagree respectfully. Budde made a direct appeal to Trump during a post-Inauguration prayer service he attended on Tuesday, asking him to show mercy to members of the LGBTQ+ community and migrants who are in the country illegally. Trump called Budde a “Radical Left hard line Trump hater” on his Truth Social site on Wednesday",
      "publishedAt": "2025-01-23T00:36:53Z",
      "title": "Episcopal bishop says she'll continue to pray for Trump, who lashed out at her over viral sermon",
      "url": "https://apnews.com/article/trump-episcopal-bishop-budde-sermon-d393ab9df6278d884ba09fb8e679f563",
      "urlToImage": "https://dims.apnews.com/dims4/default/e079142/2147483647/strip/true/crop/3724x2095+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2Fe1%2F5c0f2217f95912fc8f1b621a74fe%2F7132b645bbd9458da731330e240204d0"
    },
    {
      "author": "MICHAEL KUNZELMAN, LISA MASCARO",
      "description": "Oath Keepers founder Stewart Rhodes, the far-right extremist group leader convicted of seditious conspiracy in the Jan. 6, 2021, attack, has visited Capitol Hill after President Donald Trump commuted his 18-year prison sentence. Rhodes’ appearance on Wednesday came the day after he was released from prison as a result of Trump’s order of clemency benefitting the more than 1,500 people charged with federal crimes in the Jan. 6 attack. Rhodes was convicted in one of the most serious cases brought by the Justice Department over the riot that left more than 100 police officers injured.",
      "publishedAt": "2025-01-22T19:26:22Z",
      "title": "Oath Keepers founder Stewart Rhodes visits Capitol Hill",
      "url": "https://apnews.com/article/capitol-riot-pardons-trump-2e2275ff164550de29c34de8d12886ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/7550c55/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F85%2F80168bc88c45cb52947d5bb38007%2F0a6689a4b8fb4095a30f7bda35076314"
    },
    {
      "author": "CHRISTOPHER WEBER, MARCIO JOSE SANCHEZ",
      "description": "More than 50,000 are under evacuation orders or warnings as a new wind-driven wildfire spreads in the mountains north of Los Angeles. The Hughes Fire broke out late Wednesday morning. It quickly burned through more than 15 square miles of trees and brush. The flames sent up a huge plume of dark smoke near the Lake Castaic area. The fire comes as parched Southern California could get some badly needed rain this weekend. But even a small amount of precipitation could create new challenges like toxic ash runoff. Meanwhile, red flag warnings for critical fire danger are in effect through Thursday.",
      "publishedAt": "2025-01-22T05:16:47Z",
      "title": "Hughes Fire: Over 50,000 under evacuation orders or warnings",
      "url": "https://apnews.com/article/california-fires-los-angeles-winds-300bac5d21394adf9d44493c4ccd337b",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb00145/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fcc%2Fe77511e0b4f8cf49966b11264bf4%2F162294894f2f4c3c88e603c36e841bfb"
    },
    {
      "author": "SIBI ARASU",
      "description": "A record 47% of the European Union’s electricity now comes from solar and other renewables, a report Thursday said, in yet another sign of the growing gap between the bloc’s push for clean energy and the new U.S. administration’s pursuit of more fossil fuels. Nearly three-quarters of the EU’s electricity doesn’t emit planet-warming gases into the air — with another 24% of electricity in the bloc coming from nuclear power, a report released by the climate energy think tank Ember found. This is far higher than in countries like the United States and China, where nearly two-thirds of their energy is still produced from carbon-polluting fossil fuels like coal, oil and gas.",
      "publishedAt": "2025-01-22T23:02:42Z",
      "title": "Europe posts record year for clean energy use as Trump pulls US toward fossil fuels",
      "url": "https://apnews.com/article/europe-renewables-climate-change-solar-wind-fossil-fuels-4a6ff96bbde3251cb42109e1d9d4b399",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f15203/2147483647/strip/true/crop/3375x1898+0+176/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2Fde%2Ff9eea22533732b69b8f108d7d311%2F8d74896d769e4962a69b3662c088ebb2"
    },
    {
      "author": "CHALIDA EKVITTHAYAVECHNUKUL",
      "description": "Hundreds of LGBTQ+ couples in Thailand are expected to make their wedded status legal on the first day a law takes effect granting them the same rights as heterosexual couples. The enactment of the Marriage Equality Act makes Thailand the first country in Southeast Asia and the third place in Asia to legalize same-sex marriage, after Taiwan and Nepal. Marriage registration is customarily done at district offices, but on Thursday, around 300 couples are expected to complete the formalities at a daylong gala celebration in an exhibition hall at a shopping mall in central Bangkok. Hundreds more are predicted to register around the country.",
      "publishedAt": "2025-01-23T01:07:08Z",
      "title": "LGBTQ+ couples in Thailand register their marriages on the first day of law giving them equal status",
      "url": "https://apnews.com/article/thailand-lgbtq-marriage-law-c2162f07cd103ea86631a137d6b6d193",
      "urlToImage": "https://dims.apnews.com/dims4/default/ab8d52b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F12%2Fcb90c55628c60c46a8ccccb57c90%2Fe400220e44af49ce9414585e5a50137b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}