{
  "articles": [
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Wednesday agreed to decide whether former President Donald Trump can be prosecuted on charges he interfered with the 2020 election, calling into question whether his case could go to trial before the November election.",
      "publishedAt": "2024-02-28T22:05:15Z",
      "title": "Supreme Court sets April arguments over whether Trump can be prosecuted for election interference",
      "url": "https://apnews.com/ff4b251967b4f1ae85bd01a0db24931f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8843af5d61cb477e8c7fdc3f53288bb5/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY and JIM VERTUNO",
      "description": "CANADIAN, Texas (AP) — A cluster of wildfires scorched the Texas Panhandle on Wednesday, including a blaze that grew into one of the largest in state history, as flames moved with alarming speed and blackened the landscape across a vast stretch of small towns and cattle ranches.",
      "publishedAt": "2024-02-27T22:18:27Z",
      "title": "Wildfire grows into one of largest in Texas history as flames menace multiple small towns",
      "url": "https://apnews.com/2cad37f14581bac74a3691969aaaf956",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11753b3255f34a129b8ffdd9b9c8e3c3/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Aid convoys carrying food reached northern Gaza this week, Israeli officials said Wednesday, the first major delivery in a month to the devastated, isolated area, where the U.N.",
      "publishedAt": "2024-02-28T19:02:17Z",
      "title": "Food aid reaches north Gaza for first time in weeks. Israeli hostages' families push for release",
      "url": "https://apnews.com/a8610b08edbf64578abae14426f99ed7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b75ea35a444d47839003de33b2cdcc6b/1920.jpeg"
    },
    {
      "author": "MICHAEL TACKETT",
      "description": "WASHINGTON (AP) — Mitch McConnell, the longest-serving Senate leader in history who maintained his power in the face of dramatic convulsions in the Republican Party for almost two decades, will step down from that position in November.",
      "publishedAt": "2024-02-28T17:21:06Z",
      "title": "McConnell will step down as the Senate Republican leader in November after a record run in the job",
      "url": "https://apnews.com/ba478d570a4561aa7baf91a204d7e366",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e35b012f2fee4ae68fd0dfba96fe938f/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A New York appellate judge on Wednesday refused to halt collection of Donald Trump’s $454 million civil fraud penalty while he appeals, leaving the former president less than a month to pay the staggering sum or secure a bond covering the full amount he owes.",
      "publishedAt": "2024-02-28T16:54:22Z",
      "title": "Appellate judge refuses to halt Trump's $454 million fraud penalty while he appeals",
      "url": "https://apnews.com/3093352e94274f9daba3d84f0c43467e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b853c540ac8b4bfd8e321120de980098/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court appeared torn Wednesday about a challenge to a Trump-era ban on bump stocks, a gun accessory that allows semi-automatic weapons to fire rapidly like machine guns and was used in the deadliest mass shooting in modern U.S.",
      "publishedAt": "2024-02-28T05:05:52Z",
      "title": "The Supreme Court appears torn about a Trump-era ban on a gun accessory known as bump stocks",
      "url": "https://apnews.com/edd86133ac7c20839e4b1712657c2fe1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c5ef15b97354ef589e8d50c213c30f8/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Hunter Biden was defiant Wednesday in a closed-door deposition on Capitol Hill, blasting a Republican impeachment inquiry into his father and the family's business affairs as a “house of cards” built on “lies” as he faced a battery of probing questions from lawmakers.",
      "publishedAt": "2024-02-28T05:04:06Z",
      "title": "Hunter Biden in defiant deposition blasts GOP, insists he did not involve his father in business",
      "url": "https://apnews.com/f91915376997b5327eb2e747816690b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3b37c11b86442a398bb940716755a01/1920.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Richard Lewis, an acclaimed comedian known for exploring his neuroses in frantic, stream-of-consciousness diatribes while dressed in all-black, leading to his nickname “The Prince of Pain,” has died.",
      "publishedAt": "2024-02-28T21:02:22Z",
      "title": "Humorously morose comedian Richard Lewis, who recently starred on 'Curb Your Enthusiasm,' dies at 76",
      "url": "https://apnews.com/c4f69a5ecc8f03850222f8f2145f55ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60d4619b53b04ff1bb54426fef991288/2400.jpeg"
    },
    {
      "author": "SIMINA MISTREANU",
      "description": "CHENGDU, China (AP) — For a few days in October 2023, the capital of the science fiction world was Chengdu, China. Fans traveled from around the world as Worldcon, sci-fi ’s biggest annual event, was held in the country for the first time.",
      "publishedAt": "2024-02-29T02:43:09Z",
      "title": "How Chinese science fiction went from underground magazines to a Netflix blockbuster",
      "url": "https://apnews.com/9040ca9084fc8ec07935d461e4e65ac0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c9030d7752d4785870a673aebae866a/3000.jpeg"
    },
    {
      "author": "DAVE CAMPBELL",
      "description": "MINNEAPOLIS (AP) — Caitlin Clark has another career record on her astounding resume: the most points by any major college women's player to ever take the court.",
      "publishedAt": "2024-02-29T03:36:47Z",
      "title": "Caitlin Clark's 33-point game moves her past Lynette Woodard for the major college scoring record",
      "url": "https://apnews.com/6bad1ecd9fba1da853483e98ab84c632",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2edb181c5594dbb8971ca048d9b2858/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}