{
  "articles": [
    {
      "author": "MARK VANCLEAVE and JUAN A. LOZANO",
      "description": "MATAGORDA, Texas (AP) — Tropical Storm Beryl unleashed heavy rains and powerful winds along the Texas coast on Monday, knocking out power to more than 2 million homes and businesses and flooding streets with fast-rising waters as first responders raced to rescue stranded residents.",
      "publishedAt": "2024-07-08T04:30:46Z",
      "title": "Beryl unleashes high winds, heavy rains in Texas, stranding residents and leaving 2M without power",
      "url": "https://apnews.com/7dfd5353671ee30d0c6d11518ea5a370",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d723cdfec2644ff9b8c32e5019ad9eb/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden, in a letter to congressional Democrats, stood firm against calls for him to drop his candidacy and called for an end to the intraparty drama that has torn apart Democrats since his dismal public debate performance.",
      "publishedAt": "2024-07-08T04:06:38Z",
      "title": "Biden tells Hill Democrats he won't step aside amid party drama: 'It's time for it to end'",
      "url": "https://apnews.com/16c222f825558db01609605b3ad9742a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/622abf9cef934d2abaee51078fc957b6/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and CHRISTINE FERNANDO",
      "description": "MILWAUKEE (AP) — The Republican National Committee’s platform committee has adopted a policy document that reflects former President Donald Trump’s position opposing a federal abortion ban and ceding limits to states, omitting a national ban for the first time in 40 years.",
      "publishedAt": "2024-07-08T04:21:54Z",
      "title": "Republicans move at Trump's behest to change how they will oppose abortion, AP sources say",
      "url": "https://apnews.com/5561e857c5501df9864ab8ca666d8bc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a00b781029241a5bd9551d9c00e934c/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — Seemingly so close, and yet still so far away.French far-right leader Marine Le Pen looked to be nearer to power than ever last week after her National Rally party, strengthened by new allies, triumphed in the opening round of legislative elections. Its first place wasn't a hole-in- one but looked like an impressive position to possibly win or get close to an absolute parliamentary majority in the decisive runoff.",
      "publishedAt": "2024-07-08T16:06:44Z",
      "title": "The far right seemed to have a lock on France's legislative elections. Here's why it didn't win",
      "url": "https://apnews.com/5c4c8fa261b0fa2f2e35c14c072a60b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d58d78e825284a2eb74eeb7654657f82/3000.jpeg"
    },
    {
      "author": "RYAN DOAN-NGUYEN",
      "description": "NEW YORK (AP) — Ruben Berrios knows the scorching truth: When it comes to extreme heat, where you live can be a matter of life and death.The 66-year-old lives in Mott Haven, a low-income neighborhood in New York’s South Bronx, where more than 90 percent of residents are Latino or Black.",
      "publishedAt": "2024-07-08T04:06:38Z",
      "title": "Scorched by history: Discriminatory past shapes heat waves in minority and low-income neighborhoods",
      "url": "https://apnews.com/23a2bdc8fdd392c2ecd39a370fb90f9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/214ff704b3c24193b179bf3fbc447f56/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "A New Mexico judge decided Monday that actor Alec Baldwin 's role as co-producer isn't relevant to the involuntary manslaughter trial over a fatal shooting on the set of the Western film “Rust.”",
      "publishedAt": "2024-07-08T04:00:50Z",
      "title": "Judge rules Alec Baldwin's role as co-producer not relevant in fatal set shooting of cinematographer",
      "url": "https://apnews.com/7111ebd9d360a261eade601b5e4ec297",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ee5c8590f40495c9d2b14a6b0fcc681/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Dozens of Russian missiles blasted cities across Ukraine on Monday, striking apartment buildings and a large children’s hospital in the capital, where local residents joined emergency crews to search through piles of rubble.",
      "publishedAt": "2024-07-08T08:09:28Z",
      "title": "Russia's heaviest bombardment of Kyiv in 4 months hits a children's hospital",
      "url": "https://apnews.com/33aecd50cf252ff6184c0c14f90588b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/485af56767b346c29e96c190b18c19ac/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Several officials in the Middle East and the U.S. believe the level of devastation in the Gaza Strip caused by a nine-month Israeli offensive likely has helped push Hamas to soften its demands for a cease-fire agreement.",
      "publishedAt": "2024-07-08T06:16:45Z",
      "title": "Gaza destruction likely helped push Hamas to soften cease-fire demands, several officials say",
      "url": "https://apnews.com/a8b9cc1aeebf6471cd8ef9e7198cddf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee39fbf0afc04a7a9a9776f27b6038d6/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — The Vatican’s chief prosecutor has strongly defended the integrity and fairness of the city state’s justice system following criticism that Pope Francis' absolute power and his interventions in the so-called “trial of the century” last year violated the defendants’ fundamental rights.",
      "publishedAt": "2024-07-08T17:12:06Z",
      "title": "Chief prosecutor defends Vatican's legal system after recent criticism of pope's absolute power",
      "url": "https://apnews.com/d66a7a8e766234ef59165a425f2a04b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d92c06a5ec034a2ca276338e25eb005a/3000.jpeg"
    },
    {
      "author": "ROB GILLIES and HILLEL ITALIE",
      "description": "TORONTO (AP) — The daughter of the late Nobel laureate Alice Munro has accused the author's second husband, Gerard Fremlin, of sexual abuse, writing that her mother remained with him because she “loved him too much” to leave.",
      "publishedAt": "2024-07-08T16:54:42Z",
      "title": "Alice Munro's daughter alleges sexual abuse by the late author's husband",
      "url": "https://apnews.com/fd5e83dbd8766d38cf7b1efdd77cc847",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d276a4d6170a42f08978a1e4f0d946d1/2400.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}