{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — Palestinians have begun evacuating the main hospital in the southern Gaza town of Khan Younis, according to videos shared by medics on Wednesday. Weeks of heavy fighting had isolated the medical facility and claimed the lives of several people inside it.",
      "publishedAt": "2024-02-14T10:42:02Z",
      "title": "Displaced Palestinians leave one of Gaza's main hospitals after weeks of being isolated by fighting",
      "url": "https://apnews.com/15eb8cbd5f15d52928711193081fe9c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ddbb02a821349e6bab8dafc7ce89a4c/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Republican Speaker Mike Johnson said Wednesday the U.S. House will not feel “rushed” to pass the $95.3 billion foreign aid package for Ukraine, Israel and other allies, signaling a further stall over sending military hardware and munitions Kyiv badly needs to fight Russia.",
      "publishedAt": "2024-02-14T16:33:27Z",
      "title": "GOP Speaker Johnson says House won't be 'rushed' to approve aid for Ukraine as $95B package stalls",
      "url": "https://apnews.com/06889e166a5417d5b4bc7795813e37ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25acfb42e5dd4bcab45d08a47d66e30e/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukraine's military said Wednesday it used high-tech naval drones to sink a Russian landing ship in the Black Sea, a report that has not been confirmed by Russian authorities.The Caesar Kunikov amphibious ship sank 4 kilometers (2.5 miles) off Alupka, a city on the southern edge of the Crimean Peninsula that Moscow annexed in 2014, Ukraine’s General Staff said.",
      "publishedAt": "2024-02-14T08:30:04Z",
      "title": "Ukrainian military says it sank a Russian landing ship in the Black Sea",
      "url": "https://apnews.com/8d2a78ab1f1b2a9b04ec8c421782417d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/153bb25192784af3a8bf44bb6d626026/2400.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A Georgia judge who is deciding whether to toss Fulton County District Attorney Fani Willis off of the state's election interference case against former President Donald Trump has set a hearing for Thursday that is expected to focus on details of Willis' personal relationship with a special prosecutor she hired.",
      "publishedAt": "2024-02-14T05:05:10Z",
      "title": "Judge to consider whether to remove District Attorney Fani Willis from Georgia election case",
      "url": "https://apnews.com/33644e0501987d5a98938377f209cb47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a640ea6f351b4e10b3df7cbfd17c46d1/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Defense Minister Prabowo Subianto, an ex-general linked to past human rights atrocities, claimed victory in Indonesia's presidential election on Wednesday based on unofficial tallies.",
      "publishedAt": "2024-02-13T17:53:31Z",
      "title": "Indonesian defense chief linked to past rights abuses claims victory in presidential election",
      "url": "https://apnews.com/dd732adb2d0f3b674fc92aee4f547c6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01d105a57f504c21a3977c1bc1f0aef4/1920.jpeg"
    },
    {
      "author": "LORNE COOK and MATTHEW LEE",
      "description": "BRUSSELS (AP) — NATO Secretary-General Jens Stoltenberg said Wednesday that its European members and Canada have ramped up defense spending to record levels, as he warned that former U.S. President Donald Trump was undermining their security by calling into question the U.S.",
      "publishedAt": "2024-02-14T11:57:39Z",
      "title": "NATO chief hails record defense spending while warning that Trump's remarks undermine security",
      "url": "https://apnews.com/31295df578fd2dce5e1d259dcb59ed13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a952b61eae4d49fc8b615e66becaaa5a/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Nearly four years after Harvey Weinstein was convicted of rape and sent to prison, New York’s highest court will hear arguments Wednesday in his quest to overturn the landmark #MeToo-era verdict.",
      "publishedAt": "2024-02-14T05:09:02Z",
      "title": "Harvey Weinstein is appealing 2020 rape conviction. New York's top court to hear arguments",
      "url": "https://apnews.com/31e8c864564e7553fd5aa85a9d1e3725",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23afe4f4270944489806053b38b6d2a1/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "NEW YORK (AP) — A few months ago, Derek Carrier started seeing someone and became infatuated.He experienced a “ton” of romantic feelings but he also knew it was an illusion.That's because his girlfriend was generated by artificial intelligence.",
      "publishedAt": "2024-02-14T05:11:57Z",
      "title": "Artificial intelligence, real emotion. People are seeking a romantic connection with the perfect bot",
      "url": "https://apnews.com/113df1b9ed069ed56162793b50f3a9fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/089914121c3045ecaeb300c2e9d2eac7/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "In a classic “Saturday Night Live” sketch, a young man hands his girlfriend a Valentine’s Day gift: a bear dressed in a bee costume that he picked up at the drugstore.“When did you get this?” she asks with a strained smile.",
      "publishedAt": "2024-02-14T11:06:14Z",
      "title": "Chocolates, flowers and procrastination. For many Americans, Valentine's Day is a last-minute affair",
      "url": "https://apnews.com/8da2c24a5230b3aaad56aec1124be261",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bffe2f5bb26b4332b06b5f5d754b6978/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "Downtown Kansas City is turning into a sea of red for Valentine's Day as Chiefs fans prepare to celebrate their third Super Bowl title in five seasons with a parade.“It never gets old,” Kansas City Mayor Quinton Lucas posted on X, formerly known as Twitter, as he prepared to join Wednesday’s festivities to mark the Chiefs’ come-from-behind, 25-22 overtime win over the San Francisco 49ers.",
      "publishedAt": "2024-02-14T11:00:41Z",
      "title": "Kansas City turns red as Chiefs celebrate 3rd Super Bowl title in 5 seasons with a parade",
      "url": "https://apnews.com/c373ac902961ded32bccc11c67afbd37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/273bb5fe3c8946eaa4bc0e98dfd05ebe/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}