{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and JOSEPH KRAUSS",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Hamas on Friday freed an American woman and her teenage daughter who had been held hostage in Gaza, Israel said, the first such release from among the roughly 200 people the militant group abducted from Israel during its Oct.",
      "publishedAt": "2023-10-20T06:41:16Z",
      "title": "Israel says two Americans held hostage by Hamas, a mother and daughter, have been released",
      "url": "https://apnews.com/ed6875f15ea0d2bc196e4033b54b7194",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9add6c4db75f4721b4049cea85e7f28c/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI, STEPHEN GROVES and KEVING FREKING",
      "description": "WASHINGTON (AP) — Republicans abruptly dropped Rep. Jim Jordan on Friday as their nominee for House speaker, making the decision during a closed-door session after the hard-edged ally of Donald Trump failed badly on a third ballot for the gavel.",
      "publishedAt": "2023-10-20T04:14:35Z",
      "title": "House Republicans drop Jim Jordan as their nominee for speaker, stumbling back to square one",
      "url": "https://apnews.com/2e32f930b4fb83a4fcae2171c9e1c055",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0904e242ff74e4c817c878690185e16/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The White House on Friday released a sweeping set of proposals to bolster Israel and Ukraine in the midst of two wars as well as invest more in domestic defense manufacturing, humanitarian assistance and managing the influx of migrants at the U.S.-Mexico border.",
      "publishedAt": "2023-10-20T14:31:56Z",
      "title": "Biden asks Congress to secure $105 billion for Ukraine, Israel, the border and more",
      "url": "https://apnews.com/3762a0bdf00653e3c8a38175d3c3d3cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c81c311801a4427d91de357116e9533f/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The special counsel overseeing the Hunter Biden investigation is expected to testify before a Congressional committee behind closed doors as a GOP probe into the Justice Department's handling of the case continues to unfold.",
      "publishedAt": "2023-10-20T15:36:58Z",
      "title": "Hunter Biden prosecutor to appear for closed-door congressional testimony, AP sources say",
      "url": "https://apnews.com/0c8293f6da55859d4409fa9b668256f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ba717f106304421bbbbe625213825c0/2160.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Former President Donald Trump was fined $5,000 on Friday after his disparaging social media post about a key court staffer in his New York civil fraud trial lingered on his campaign website for weeks after the judge ordered it deleted.",
      "publishedAt": "2023-10-20T15:49:49Z",
      "title": "Judge fines Donald Trump $5,000 after post maligning court staffer is found on campaign website",
      "url": "https://apnews.com/ce593e3ee07d95bb6ec7e2de23f47dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e347e05267f4d2aa4e5a02f1b0b5386/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Lawyer Kenneth Chesebro pleaded guilty to a felony on Friday just as jury selection was getting underway in his trial on charges accusing him of participating in efforts to overturn Donald Trump’s loss in the 2020 election in Georgia.",
      "publishedAt": "2023-10-20T04:49:01Z",
      "title": "Lawyer Kenneth Chesebro pleads guilty over efforts to overturn Trump’s 2020 loss in Georgia",
      "url": "https://apnews.com/2e558eefdffd9c1eaa7ec8c31bf76044",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7f5f5adef4f45d0a731ac7ea8b31cc2/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — With three months to go before the Iowa caucuses that he has staked his campaign on, former Vice President Mike Pence faces mounting debt and lagging poll numbers that are forcing questions about not only whether he will qualify for the next debate, but whether it makes sense for him to remain in the race until then.",
      "publishedAt": "2023-10-20T18:14:06Z",
      "title": "Mike Pence faces a cash shortage and questions about how much longer his 2024 campaign can survive",
      "url": "https://apnews.com/50caaf71b004b25d866aa0dace68b1ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a647535ff3a4604b7366123ccfa03d2/3000.jpeg"
    },
    {
      "author": "LORNE COOK",
      "description": "BRUSSELS (AP) — Belgium’s justice minister resigned on Friday over what he described as a “monumental error” after it was discovered that Tunisia was seeking the extradition last year of an Islamic extremist who shot dead two Swedes and wounded a third this week.",
      "publishedAt": "2023-10-20T18:40:18Z",
      "title": "Belgian minister quits after 'monumental error' let Tunisian shooter slip through extradition net",
      "url": "https://apnews.com/eeed64dc6578be744d2f5681957fae84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80e772a10e0342349f7437d33adfb28e/3000.jpeg"
    },
    {
      "author": "LEA SKENE, MICHAEL KUNZELMAN and SARAH BRUMFIELD",
      "description": "HAGERSTOWN, Md. (AP) — Police are searching for a man suspected of fatally shooting a Maryland judge who had awarded custody of the suspect’s children to his wife on the day of the killing, authorities said Friday.",
      "publishedAt": "2023-10-20T04:18:15Z",
      "title": "A slain Maryland judge presided over the divorce case of man identified as a suspect in his killing",
      "url": "https://apnews.com/394b2eaf2570813d1f2845c45f8a99fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d0a6746e30b467eb9f04cbab74b9f6e/1920.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — There isn't much Cher hasn't done in her career. She's achieved EGOT status, she's the only artist to have a No. 1 song in each of the past six decades — heck, she's got her own gelato business, Cherlato.",
      "publishedAt": "2023-10-20T16:03:36Z",
      "title": "There isn't much Cher hasn't done in her career. A Christmas album is new territory, though",
      "url": "https://apnews.com/aba5f7731a645c502fb4a97d86a69c7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46710cf7a12049609c65a82a761fdf1c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}