{
  "articles": [
    {
      "author": "WAFAA SHURAFA, TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "RAFAH, Gaza Strip (AP) — Israel has failed to comply with an order by the United Nations' top court to provide urgently needed aid to desperate people in the Gaza Strip, Human Rights Watch said Monday, a month after a landmark ruling in The Hague ordered Israel to moderate its war.",
      "publishedAt": "2024-02-26T08:53:03Z",
      "title": "Human Rights Watch accuses Israel of blocking aid to Palestinians in violation of a UN court order",
      "url": "https://apnews.com/8682b5446e285a7fc641c9f869df9348",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96efaaa434c14a8280ed08ea7a1817c7/1920.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — A powerful winter storm is expected to dump several feet of snow in parts of West starting Monday while much of the central U.S. will be basking in unseasonably warm conditions.",
      "publishedAt": "2024-02-26T16:11:54Z",
      "title": "Wild weather's coming: West readies for snow as Midwest gets a taste of summer",
      "url": "https://apnews.com/dbbb5939c655a9a6e28ade6401b7ec88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c81c71ad988245f58a3f63e651a7dc25/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — Hungary’s parliament voted Monday to ratify Sweden's bid to join NATO, bringing an end to more than 18 months of delays that have frustrated the alliance as it seeks to expand in response to Russia's war in Ukraine.",
      "publishedAt": "2024-02-26T09:20:52Z",
      "title": "Hungary's parliament ratifies Sweden's NATO bid, clearing the final obstacle to membership",
      "url": "https://apnews.com/efc791c0d2e4da9fdcb247a2d6624cab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0cc1ed4889bc49f4be134d2935a7c8dd/3000.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO",
      "description": "WASHINGTON (AP) — An active-duty member of the U.S. Air Force has died after he set himself ablaze outside the Israeli Embassy in Washington, D.C., while declaring that he “will no longer be complicit in genocide.\"",
      "publishedAt": "2024-02-26T13:15:13Z",
      "title": "US airman dies after setting himself ablaze outside Israeli Embassy in Israel-Hamas war protest",
      "url": "https://apnews.com/f730a09009ce56d818f87a8f4dcc6ca7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4621f5aa4d74b39ae1bc1736da5ead4/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump has appealed his $454 million New York civil fraud judgment, challenging a judge’s finding that Trump lied about his wealth as he grew the real estate empire that launched him to stardom and the presidency.",
      "publishedAt": "2024-02-26T15:00:51Z",
      "title": "Donald Trump appeals $454 million judgment in New York civil fraud case",
      "url": "https://apnews.com/2f8cc521e00e4a34a1342b961c1416ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53b730f026b64a2a8e4e2a636f3ed065/3000.jpeg"
    },
    {
      "author": "SYLVAIN PLAZY and LORNE COOK",
      "description": "BRUSSELS (AP) — Farmers clashed with police in Belgium on Monday, spraying officers with liquid manure and throwing eggs and flares at them in a fresh show of force as the European Union's agriculture ministers met in search of ways to address the protesters’ concerns.",
      "publishedAt": "2024-02-26T08:27:28Z",
      "title": "Protesting farmers spray Brussels police with liquid manure near EU's base in a new display of power",
      "url": "https://apnews.com/c97ce9a135b74e8668ef5cdeec292f68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd2e198a301a4086bcaaf1a73cc2e21d/2834.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Don Henley testified Monday that a “poor decision” led to his arrest in 1980, when authorities said they found drugs and a 16-year-old sex worker suffering from an overdose at his Los Angeles home.",
      "publishedAt": "2024-02-26T14:56:49Z",
      "title": "Eagles' Don Henley testifies that a 'poor decision' led to his 1980 arrest",
      "url": "https://apnews.com/aa5300708de790099f9f7d0ba3b8afcf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db7e37402919477abfe23115d5d62a8a/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Associates of Russian opposition leader Alexei Navalny said Monday that talks were underway shortly before his death to exchange him for a Russian imprisoned in Germany.“Alexei Navalny could have been sitting here now, today.",
      "publishedAt": "2024-02-26T12:13:05Z",
      "title": "A swap for Navalny was in the final stages before the opposition leader's death, an associate says",
      "url": "https://apnews.com/ce214909b1088a1d67fa9cd323864f50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab2c73c070864e8ba9270453405335df/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A private lunar lander is expected to cease operations Tuesday, its mission cut short after landing sideways near the south pole of the moon.",
      "publishedAt": "2024-02-26T15:26:40Z",
      "title": "Sideways moon landing cuts mission short, private US lunar lander will cease operations Tuesday",
      "url": "https://apnews.com/28fdcd5ce5b50586d3feee68ae26864c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94d8e328720f476281018247a5055c24/3000.jpeg"
    },
    {
      "author": "DAVE SKRETTA",
      "description": "On the same night Caitlin Clark was adding to her NCAA women's basketball scoring record before a packed house in Indiana, and a national audience on television, the Iowa sensation was losing ground to the most prolific active scorer in her sport.",
      "publishedAt": "2024-02-26T14:20:16Z",
      "title": "Meet Grace Beyer, the small-school scoring phenom Iowa star Caitlin Clark might never catch",
      "url": "https://apnews.com/cf1668b650f11717b9a00abe0887e1ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73dc1ab7a0194779bc4cbf3ae411e204/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}