{
  "articles": [
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE, WILL WEISSERT, BILL BARROW and DARLENE SUPERVILLE",
      "description": "ATLANTA (AP) — President Joe Biden and his Republican rival, Donald Trump, will meet for a debate on Thursday that offers an unparalleled opportunity for both candidates to try to reshape the political narrative.",
      "publishedAt": "2024-06-27T04:08:30Z",
      "title": "How the Biden-Trump debate could change the trajectory of the 2024 campaign",
      "url": "https://apnews.com/0e7577e9a354a69f50675494fea54ca9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c893ff1f39934584a4143329d87f01f5/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court cleared the way Thursday for Idaho hospitals to provide emergency abortions, for now, in a procedural ruling that left key questions unanswered and could mean the issue ends up before the conservative-majority court again soon.",
      "publishedAt": "2024-06-27T14:27:41Z",
      "title": "The Supreme Court allows emergency abortions in Idaho for now in a limited ruling",
      "url": "https://apnews.com/bf74fc754fa7b1fff3539fc570f26905",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d19f877b5dae486e88e7ebed18d1cb84/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court is putting the Environmental Protection Agency’s air pollution-fighting “good neighbor” plan on hold while legal challenges continue, the conservative-led court’s latest blow to federal regulations.",
      "publishedAt": "2024-06-27T14:05:31Z",
      "title": "Supreme Court halts enforcement of the EPA's plan to limit downwind pollution from power plants",
      "url": "https://apnews.com/6665ba500aa2abb797bd9704e014909c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cc5c0690ed2486d930bdd99766ba324/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Thursday rejected a nationwide settlement with OxyContin maker Purdue Pharma that would have shielded members of the Sackler family who own the company from civil lawsuits over the toll of opioids but also would have provided billions of dollars to combat the opioid epidemic.",
      "publishedAt": "2024-06-27T14:08:49Z",
      "title": "The Supreme Court rejects a nationwide opioid settlement with OxyContin maker Purdue Pharma",
      "url": "https://apnews.com/9859e83721f74f726ec16b6e07101c7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1ca92c2cbc24c21a053d8895c525e80/3000.jpeg"
    },
    {
      "author": "PAOLA FLORES and ISABEL DEBRE",
      "description": "LA PAZ, Bolivia (AP) — Supporters of Bolivia's president rallied outside his palace on Thursday after a failed coup attempt a day earlier, giving some political breathing room to the embattled leader of this economically troubled country as they chanted pro-democracy slogans.",
      "publishedAt": "2024-06-27T11:55:30Z",
      "title": "After failed coup attempt, many Bolivians rally behind president, though some are wary",
      "url": "https://apnews.com/568a17444e3356bce9812b7979e933f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/176598bef4bc4894af8d0eded136df4e/3000.jpeg"
    },
    {
      "author": "NICK PERRY",
      "description": "DEDHAM, Mass. (AP) — Did Karen Read kill her police officer boyfriend by slamming into him with her Lexus and then leaving him to die in a brewing snowstorm after a night out drinking?",
      "publishedAt": "2024-06-27T04:02:14Z",
      "title": "Is she a murderer or was she framed? Things to know about the Boston-area trial of Karen Read",
      "url": "https://apnews.com/edbcb82c02d5700557a7ebb703c234f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fd62a857b9349e8bc503dc9d44e8907/1920.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "Even in a busy year of elections around the world, the next few days stand out.Over the next week, voters go to the polls in fledgling democracies like Mauritania and Mongolia, the Islamic Republic of Iran and in stalwart democracies — former imperial powers — Britain and France.",
      "publishedAt": "2024-06-27T14:21:11Z",
      "title": "Ballot box binge: Votes loom in coming days from Mongolia to Iran to Britain in a busy election year",
      "url": "https://apnews.com/0ac8b0f8334083ef504b0bc4a76e9992",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2bb4bc3e193451cb0ff080627a67900/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "McALESTER, Okla. (AP) — Oklahoma executed a man Thursday who was convicted of kidnapping, raping and killing his 7-year-old former stepdaughter in 1984.Richard Rojem, 66, received a three-drug lethal injection at the Oklahoma State Penitentiary in McAlester and was declared dead at 10:16 a.m., prison officials said.",
      "publishedAt": "2024-06-27T04:17:22Z",
      "title": "Oklahoma executes man convicted of kidnapping, raping and killing 7-year-old girl in 1984",
      "url": "https://apnews.com/57ca75b05212ecb59247747080fbce9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31e3c90c00dc4b8983f41daa3c1d94c0/1000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — He has run for office, published hundreds of thousands of leaked government documents online, and once lobbied to save his local swimming pool. One of the most polarizing and influential figures of the information age, Julian Assange is now free after five years in a British prison and seven years in self-imposed exile in a London embassy.",
      "publishedAt": "2024-06-27T12:29:44Z",
      "title": "Julian Assange is now free to do or say whatever he likes. What does his future hold?",
      "url": "https://apnews.com/1163c48e06e6cb23268889854a3731d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05b040cb5d8b43348b1d8757958859b5/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — It's a scenario that terrifies America's auto industry.Chinese carmakers set up shop in Mexico to exploit North American trade rules. Once in place, they send ultra-low-priced electric vehicles streaming into the United States.",
      "publishedAt": "2024-06-27T07:00:31Z",
      "title": "Prospect of low-priced Chinese EVs reaching US from Mexico poses threat to automakers",
      "url": "https://apnews.com/f526c5e52b95b624bb4b15d2038e289a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3a63bff5e244db68f886e4ef716a75d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}