{
  "articles": [
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump's court appearances are no longer distractions from his campaign to return to the White House. They are central to it.",
      "publishedAt": "2023-10-03T04:02:19Z",
      "title": "Trump turns his fraud trial into a campaign stop as he seeks to capitalize on his legal woes",
      "url": "https://apnews.com/fb73b4275be2d43b0f92031737d3e9eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68378886f4b7451b951c4f4a99fef3bd/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Speaker Kevin McCarthy is facing an extraordinary referendum on his leadership of the House after a conservative member of his own Republican majority, a longtime critic, moved to launch a vote to oust him from the helm.",
      "publishedAt": "2023-10-02T23:11:52Z",
      "title": "Rep. Matt Gaetz files motion to oust Speaker Kevin McCarthy, throwing House into new turmoil",
      "url": "https://apnews.com/e7e5ccc6cf79ccbf5b4a7b73b9d5a3ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87c3d7fbee264759b70d9212a330f317/3000.jpeg"
    },
    {
      "author": null,
      "description": "BANGKOK (AP) — Hundreds of shoppers fled a major shopping mall in the center of Thailand’s capital on Tuesday afternoon after what sounded like gunshots were heard inside.It was not immediately clear if shots had been fired, though police said there were injuries and some frightened shoppers were still hunkering down inside Bangkok’s Siam Paragon Mall.",
      "publishedAt": "2023-10-03T10:03:16Z",
      "title": "Shoppers flee major shopping mall in Bangkok after hearing what sounds like gunshots",
      "url": "https://apnews.com/75683f1cf1df114a81b2834de16993ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9c1dd66998a4320b7c50fe7a5ebf3e1/3000.jpeg"
    },
    {
      "author": "ASHRAF KHALIL and DIDI TANG",
      "description": "WASHINGTON (AP) — Wearing an “I Love Pandas” T-shirt and clutching a panda-covered diary, Kelsey Lambert bubbled with excitement as she glimpsed the real thing. She and her mother, Alison, had made a special trip from San Antonio just to watch the National Zoo's furry rock stars casually munching bamboo and rolling around on the grass.",
      "publishedAt": "2023-10-03T04:30:27Z",
      "title": "Panda Diplomacy: The departure of DC's beloved pandas may signal a wider Chinese pullback",
      "url": "https://apnews.com/1f0eee3fc0114296bcfe5472c43a373e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1552674b58f4ba58542352d12c022f9/3000.jpeg"
    },
    {
      "author": "DAVID KEYTON, SETH BORENSTEIN and MIKE CORDER",
      "description": "STOCKHOLM (AP) — Three scientists won the Nobel Prize in physics on Tuesday for their work on how electrons move around the atom during the tiniest fractions of seconds, a field that could one day lead to better electronics or disease diagnoses.",
      "publishedAt": "2023-10-03T06:51:57Z",
      "title": "Agostini, Krausz and L’Huillier win physics Nobel for looking at electrons in fractions of seconds",
      "url": "https://apnews.com/73b17b0f2c417a51f9d71964b170a395",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9c9c1c62af64d5382aa0370c4a06783/2922.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — The U.N. Security Council voted Monday to send a multinational armed force led by Kenya to Haiti to help combat violent gangs, marking the first time in almost 20 years that a force would be deployed to the troubled Caribbean nation.",
      "publishedAt": "2023-10-02T20:15:57Z",
      "title": "UN Security Council approves sending a Kenya-led force to Haiti to fight violent gangs",
      "url": "https://apnews.com/3749ac5db9d6c5903e61dee7b4206e6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/331a2fd3e5bd4997995226c3616458d2/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — Pope Francis on Wednesday is opening a global gathering of bishops and laypeople to discuss the future of the Catholic Church, including some hot-button issues that have previously been considered off-limits for discussion.",
      "publishedAt": "2023-10-03T04:23:43Z",
      "title": "Things to know about the Vatican's big meeting on the future of the Catholic Church",
      "url": "https://apnews.com/3c08b3e92e7a0084d1dc7b5147576e24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d655542e8674a2a9a0c1cee6c67d893/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and CLAUDIA LAUER",
      "description": "WILMINGTON, Del. (AP) — Hunter Biden is due back in a Delaware courtroom Tuesday, where he's expected to plead not guilty to federal firearms charges that emerged after his earlier deal collapsed.",
      "publishedAt": "2023-10-03T04:06:27Z",
      "title": "Hunter Biden returns to court in Delaware and is expected to plead not guilty to gun charges",
      "url": "https://apnews.com/68b186294bb36071c02428834ec5f470",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6425d952925d45b5b5ceea4653035371/2160.jpeg"
    },
    {
      "author": "MICHAEL TARM",
      "description": "CHICAGO (AP) — A day before the federal government executed a Texas man for the killing of an Iowa couple when he was 18, celebrity lawyer Alan Dershowitz pleaded with then-President Donald Trump — a former client — to call the execution off.",
      "publishedAt": "2023-10-03T04:05:18Z",
      "title": "Fuller picture emerges of the 13 federal executions at the end of Trump's presidency",
      "url": "https://apnews.com/c1b26807c5c40b337d14485c3d6df2de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9dfbdaaeeda547f38b5a62a5f1a00cb1/2000.jpeg"
    },
    {
      "author": "MADDIE BURAKOFF",
      "description": "NEW YORK (AP) — In the quest to build better for the future, some are looking for answers in the long-ago past.Ancient builders across the world created structures that are still standing today, thousands of years later — from Roman engineers who poured thick concrete sea barriers, to Maya masons who crafted plaster sculptures to their gods, to Chinese builders who raised walls against invaders.",
      "publishedAt": "2023-10-03T05:05:28Z",
      "title": "How are ancient Roman and Mayan buildings still standing? Scientists are unlocking their secrets",
      "url": "https://apnews.com/f5799b0009acc8145805610ee1972ac9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef2bb04a34214f17bcf308863ade731b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}