{
  "articles": [
    {
      "author": "Chris Megerian",
      "description": "President Donald Trump is preparing for his first big speech to Congress since returning to the White House. The House chamber will be packed with lawmakers on Tuesday night for the event. It's considered a joint address to Congress, not technically a State of the Union address, but there’s no distinguishable difference for anyone watching at home. These events are often carefully calibrated for maximum impact. What will the Republican president say about Ukraine and President Volodymyr Zelenskyy? Where will Elon Musk sit? How will Democrats react? How far does Trump stray off script?",
      "publishedAt": "2025-03-03T11:06:49Z",
      "title": "What to watch when Trump gives his speech to Congress",
      "url": "https://apnews.com/article/what-to-watch-trump-address-to-congress-801f114c4ded539007a5f1a238c9dc7e",
      "urlToImage": "https://dims.apnews.com/dims4/default/7dc2d31/2147483647/strip/true/crop/5500x3094+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Fa2%2F4da239898d01b4ccd09dd85dadbf%2F1d5e001b66b54ef2b92aa67576279b06"
    },
    {
      "author": "Zeke Miller",
      "description": "The White House says guests at President Donald Trump’s address to Congress will include the widow of a slain New York police officer, a Pennsylvania teacher who was detained in Russia and the family of a man killed at Trump’s assassination attempt in Pennsylvania. Trump on Tuesday will give an accounting of his turbulent first weeks in office as a divided nation struggles to keep pace. Some Americans fear for the country’s future after the Republican president’s aggressive early moves, while others cheer him on. Democrats are highlighting the impact of Trump’s actions by inviting as guests fired federal workers and people who’d be harmed by cuts to Medicaid and other programs.",
      "publishedAt": "2025-03-04T05:11:24Z",
      "title": "Trump will stand before Congress and offer divided nation an accounting of his turbulent first weeks",
      "url": "https://apnews.com/article/trump-speech-congress-immigration-tariffs-guests-93f6107ede260854f90c65c4bde60de8",
      "urlToImage": "https://dims.apnews.com/dims4/default/b426a2c/2147483647/strip/true/crop/5777x3250+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F95%2F045aec4086a891ea58abaa2a5668%2Fcf7b6a837c814f78acc74f0125803628"
    },
    {
      "author": "Meg Kinnard",
      "description": "President Donald Trump will stand at the front of the U.S. House chamber to address a joint session of Congress, the first of his second term in office. But Tuesday night's address won't be called the State of the Union. The president's first-year speech is called something else: a joint address to Congress. The term has its origins in the first term of President Ronald Reagan. According to the American Presidency Project, the impacts of these first-year speeches should be considered to have the same heft as the State of the Union addresses that follow in subsequent years.",
      "publishedAt": "2025-03-04T05:19:23Z",
      "title": "Why Trump's speech is not called the State of the Union",
      "url": "https://apnews.com/article/why-is-it-not-state-of-union-3bf88c02395141a6d9148a8f7c1e6e78",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6b8fe1/2147483647/strip/true/crop/4762x2679+0+326/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F7a%2Fb936eb9d76d676ee4f03cf2a22b9%2Fabcebb46e3784a7e922ac75ebe3a5526"
    },
    {
      "author": "Joey Cappelletti",
      "description": "Freshman Sen. Elissa Slotkin of Michigan will deliver the Democratic response to President Donald Trump’s first joint congressional address of his second presidency. Slotkin will deliver the response Tuesday night after just two months serving in the U.S. Senate. She won the battleground state's open Senate seat over Republican Mike Rogers in November while Trump carried the state in the presidential race. Slotkin is expected to focus on economic issues in her rebuttal after Trump announced Monday that 25% tariffs on imports from Mexico and Canada would begin Tuesday. Slotkin's speech comes as the Democratic party struggles to find a unified message against Trump.",
      "publishedAt": "2025-03-04T05:16:25Z",
      "title": "Michigan's Elissa Slotkin set to give Democratic rebuttal to Trump",
      "url": "https://apnews.com/article/trump-slotkin-democratic-response-fae53aacdc4796b2118ba5269fdd86de",
      "urlToImage": "https://dims.apnews.com/dims4/default/838dbec/2147483647/strip/true/crop/3302x1857+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F5b%2Fcb8b6db07a780fd5363bf9bb43a6%2Fbb9eff86b2ff4308ab2b2b6d8cf63ea9"
    },
    {
      "author": "Samya Kullab, Hanna Arhirova",
      "description": "Ukrainians are grappling with the consequences of the Trump administration’s decision to pause military aid vital for their fight against Russia’s invasion. That step came days after a disastrous Oval Office row that has deepened a rift between Kyiv and the White House. U.S. President Donald Trump directed the U.S. to pause all assistance to Ukraine as he seeks to pressure Ukrainian President Volodymyr Zelenskyy to engage in peace talks with Russia. Ukraine, which depends heavily on foreign help to hold back the Russian invasion that began on Feb. 24 2022, Kyiv has feared the possibility of aid being stopped to Ukraine ever since Trump took office.",
      "publishedAt": "2025-03-04T07:33:52Z",
      "title": "Ukrainians grapple with consequences of Trump's pause on all military aid",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-zelenskyy-military-aid-2ce8b167f0ba948b2b606381192de71d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e1edbb/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F91%2Ff1341c4558686103f9a903dee635%2Fb44068ffe5414269ada4c6acf253f811"
    },
    {
      "author": "Rebecca Santana",
      "description": "Republicans in Congress are taking aim at four cities over their policies limiting cooperation with immigration enforcement under President Donald Trump's administration. Mayors from Boston, Chicago, Denver and New York will appear Wednesday before the Committee on Oversight and Government Accountability over their cities' policies restricting authorities' cooperation with federal enforcement. These are often referred to as “sanctuary policies” and the localities as “sanctuary cities.” Courts have upheld the legality of most sanctuary laws. But Trump administration officials have targeted sanctuary policies, seeing them as a key impediment to deporting people in the large numbers he wants. New York’s mayor says he hopes for a “civil conversation” with the representatives.",
      "publishedAt": "2025-03-04T13:05:07Z",
      "title": "Republicans target 4 'sanctuary' cities as Trump pushes mass deportations",
      "url": "https://apnews.com/article/congress-sanctuary-cities-trump-immigration-border-49766af8d0bad4be8b4e46d0ffa0ab02",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c13362/2147483647/strip/true/crop/7300x4106+31+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2F27%2Ffe7fcad34ef6b032a443d8752179%2F41aac1ac93f640729085db47ab97f41b"
    },
    {
      "author": "Tim Sullivan, Rebecca Boone",
      "description": "President Donald Trump’s efforts to reduce illegal immigration have not included going after the businesses that hire workers in the U.S. illegally. A nearly 30-year-old government system called E-Verify makes it easy to check if potential employees can legally work in the U.S. But employers are almost never held to account. The debate over workplace enforcement is, in many ways, a reflection of America’s complex views on immigration, its economic dependence on immigrant labor and a quietly bubbling Republican divide. Yet a 2017 study from the Federal Reserve Bank of Dallas found that most states with E-Verify mandates saw reduced numbers of immigrants working illegally.",
      "publishedAt": "2025-03-04T05:00:31Z",
      "title": "The White House talks tough on illegal immigration but ignores a key tool that could reduce it",
      "url": "https://apnews.com/article/immigration-crackdown-trump-everify-8776045494550675c02736152d7c3992",
      "urlToImage": "https://dims.apnews.com/dims4/default/416441b/2147483647/strip/true/crop/3000x1688+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F50%2F4b6e9494c58660dbe8abf76cf2a6%2Fd6ee73bfa7eb439cb9abd2507a14215c"
    },
    {
      "author": "Josh Boak, Paul Wiseman, Rob Gillies",
      "description": "President Donald Trump’s long-threatened tariffs against Canada and Mexico have gone into effect, kicking off a trade war with America's neighbors. Starting just past midnight Tuesday, imports from Canada and Mexico are now taxed at 25%, with Canadian energy products subject to 10% import duties. In addition, the 10% tariff that Trump placed on Chinese imports in February was doubled to 20%. China retaliated Tuesday with additional tariffs of up to 15% on a wide array of U.S. farm exports, among other measures. Canada also has announced tariffs on American goods. Trump's moves have raised inflation fears, even as he has promised the American public that taxes on imports are the easiest path to national prosperity.",
      "publishedAt": "2025-03-04T05:03:54Z",
      "title": "Trump tariffs on Canada and Mexico take effect",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-643086a6dc7ff716d876b3c83e3255b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/dbd1fcd/2147483647/strip/true/crop/3000x1688+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fa8%2Fbdde94a2bac327067aab245c44c2%2F00c2c6a26d3b4061ba25590f48e727bb"
    },
    {
      "author": "Damian J. Troise, Alex Veiga",
      "description": "Stocks racked up more losses on Wall Street Tuesday as a trade war between the U.S. and its key trading partners escalated, wiping out all the gains since Election Day for the S&P 500. The benchmark index fell 1.2% and the Dow Jones Industrial Average shed 670 points, or 1.6%, The Nasdaq slipped 0.4% despite a rebound in big tech stocks such as Nvidia. The burgeoning trade war between the U.S., China, Canada and Mexico is helping to extend a recent slump for U.S. stocks. Shares of Target and Best Buy fell after the retailers warned of pressure on sales and higher prices for consumers.",
      "publishedAt": "2025-03-04T02:43:12Z",
      "title": "Wall Street falls again as losses wipe out all post-election gains for the S&P 500",
      "url": "https://apnews.com/article/stocks-markets-rates-tariffs-trump-1ca865fa6abcca716b5e7c9281ea6e07",
      "urlToImage": "https://dims.apnews.com/dims4/default/756be20/2147483647/strip/true/crop/8359x4702+0+435/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Fb4%2F18a2d287c4456e5918edd2032936%2Ffbd2c427baed49b2a99797dc366cdc35"
    },
    {
      "author": "Samy Magdy, Mohammad Jahjouh",
      "description": "Egyptian President Abdel Fattah el-Sissi says Arab leaders have endorsed Egypt's postwar plan for the Gaza Strip that would allow its roughly 2 million Palestinians to remain in the territory. Meeting in Cairo on Tuesday, the leaders endorsed a counterproposal to President Donald Trump’s plan to depopulate the territory and redevelop it as a beach destination. It was unclear if Israel or the United States would accept the Egyptian plan. The summit hosted by Egypt included the emir of Qatar, the vice president of the United Arab Emirates and the foreign minister of Saudi Arabia — countries whose support is crucial for any postwar plan.",
      "publishedAt": "2025-03-04T10:00:59Z",
      "title": "Arab leaders endorse a counterproposal to Trump's Gaza plan, with ceasefire uncertain",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-04-2025-35f1959c28ad3c57a209f5464f2b5411",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d7cea4/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F58%2F9da07c446f9c4fb566bdf50bb0f6%2Fa27527d5d2e044fd91e18a1f2f049d64"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}