{
  "articles": [
    {
      "author": "WAFAA SHURAFA, KAREEM CHEHAYEB and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — Israeli troops fired on a large crowd of Palestinians racing to pull food off an aid convoy in Gaza City on Thursday, witnesses said. More than 100 people were killed, bringing the death toll since the start of the Israel-Hamas war to more than 30,000, according to health officials.",
      "publishedAt": "2024-02-29T08:58:06Z",
      "title": "Palestinian deaths in Gaza pass 30,000 as witnesses say Israeli forces fire on crowd waiting for aid",
      "url": "https://apnews.com/f9b5a62a80d8b83eac4946d3c85af58b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1fe4f2afab14d6bb551897c86f9a831/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG, SEUNG MIN KIM and JILL COLVIN",
      "description": "EAGLE PASS, Texas (AP) — President Joe Biden and his likely Republican challenger Donald Trump both head to the U.S.-Mexico border in Texas on Thursday in a sign of how central immigration has become to the 2024 election and how much both candidates want to use it to their advantage.",
      "publishedAt": "2024-02-29T05:10:02Z",
      "title": "Biden and Trump try to work immigration to their political advantage during dueling trips to Texas",
      "url": "https://apnews.com/42c945d02742b169bde40601a27fde02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60df02d36bea46b9af3d3fea92197a4e/1920.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "AUSTIN, Texas (AP) — A federal judge on Thursday blocked a new Texas law that gives police broad powers to arrest migrants suspected of illegally entering the U.S., dealing a victory to the Biden administration in its feud with Republican Gov.",
      "publishedAt": "2024-02-29T16:30:37Z",
      "title": "Judge blocks Texas law that gives police broad powers to arrest migrants who illegally enter US",
      "url": "https://apnews.com/3bcded91620cbd9686575caa6bcac203",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78e12454f6a547bc958c74fc6c5a4d58/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY and JIM VERTUNO",
      "description": "CANADIAN, Texas (AP) — A wildfire spreading across the Texas Panhandle became the largest in state history Thursday, as a dusting of snow covered scorched prairie, dead cattle and burned out homes and gave firefighters a brief window of relief in desperate efforts to corral the blaze.",
      "publishedAt": "2024-02-29T05:26:45Z",
      "title": "A wildfire scorching the Texas Panhandle has grown to the largest in state history",
      "url": "https://apnews.com/cbbb6a279bef1bd020722ed48927114a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11753b3255f34a129b8ffdd9b9c8e3c3/1920.jpeg"
    },
    {
      "author": "MEG KINNARD and AMELIA THOMSON-DEVEAUX",
      "description": "GRAND RAPIDS, Mich. (AP) — Donald Trump's campaign has vowed not to talk about her anymore. Many pundits have written her off entirely. But Nikki Haley is still campaigning across the country — and plenty of Republican voters are coming to hear what she has to say.",
      "publishedAt": "2024-02-29T15:48:49Z",
      "title": "Nikki Haley can't win the Republican primary with 40%. But she can expose some of Trump's weaknesses",
      "url": "https://apnews.com/109ce563f68aa8e1b159d98769e943d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/049118d883c14008a476717448dc42e0/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Texas Sen. John Cornyn has informed his colleagues that he intends to run for Senate Republican leader, becoming the first senator to announce a campaign after Sen. Mitch McConnell said he will step down from the post in November.",
      "publishedAt": "2024-02-29T15:06:43Z",
      "title": "Texas Sen. Cornyn announces run for GOP leader as scramble to succeed McConnell begins in the Senate",
      "url": "https://apnews.com/d73676f2e1a1604719129b77cc28fc03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3bf38e003ac49fba091bd9823b7f469/3000.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS",
      "description": "VICKSBURG, Miss. (AP) — Thelma Sims Dukes grew up during the 1940s and ‘50s in a segregated Mississippi town steeped in Civil War history.As a small Black girl, she would walk to school through Vicksburg National Military Park — the hilly battlefield where Union and Confederate soldiers fought and died over whether the U.S.",
      "publishedAt": "2024-02-29T15:47:36Z",
      "title": "Black soldiers are honored, name by name, at a Civil War battlefield",
      "url": "https://apnews.com/72df46a6761c7b3504b1a5ebd3edb211",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8070063c10834d40b6b82eaae4530124/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — As Russia makes battlefield advances and Ukrainian soldiers run short on ammunition, U.S.",
      "publishedAt": "2024-02-29T05:03:09Z",
      "title": "US adults fracture along party lines in support for Ukraine military funding, AP-NORC poll finds",
      "url": "https://apnews.com/b772c9736b92c0fbba477938b047da2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a867befcf6644db58488e3fa7fe7cbb7/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — An inflation gauge favored by the Federal Reserve increased in January, the latest sign that the slowdown in U.S. consumer price increases is occurring unevenly from month to month.",
      "publishedAt": "2024-02-29T13:40:29Z",
      "title": "Federal Reserve's preferred inflation gauge picked up last month in sign of still-elevated prices",
      "url": "https://apnews.com/b455244810f36f459298b92568d22756",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73b97932df374fa6a5f08c89006cfb86/3000.jpeg"
    },
    {
      "author": "STEPHEN WADE",
      "description": "TOKYO (AP) — Baseball star Shohei Ohtani has stunningly revealed he's married.Ohtani wrote on Thursday on Instagram in Japanese: “The season is approaching but I would like to announce to everyone that I have gotten married.”",
      "publishedAt": "2024-02-29T08:15:20Z",
      "title": "Dodgers star Shohei Ohtani says he is married and his bride is Japanese",
      "url": "https://apnews.com/e5949dae4e5bc7b99607554cb78bbe3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26e4ea52592c4b15bd6bc1939d013e2c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}