{
  "articles": [
    {
      "author": "TARA COPP, MELANIE LIDMAN and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — U.S. Defense Secretary Lloyd Austin discussed with Israeli leaders Monday ways to scale back major combat operations in Gaza but said Washington was not imposing a timetable despite international calls for a cease-fire.",
      "publishedAt": "2023-12-18T07:59:44Z",
      "title": "US defense secretary, Israeli leaders discuss more targeted approach in Gaza",
      "url": "https://apnews.com/c094153a62262f8c8e56ef13f98f528f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ca2348661144405bce8421c095e8f2e/1920.jpeg"
    },
    {
      "author": "COURTNEY BONNELL",
      "description": "LONDON (AP) — The attacks on commercial vessels in the Red Sea by Yemen's Houthi rebels have scared off some of the world's top shipping companies and oil giants, effectively rerouting global trade away from a crucial artery for consumer goods and energy supplies that is expected to trigger delays and rising prices.",
      "publishedAt": "2023-12-18T13:11:00Z",
      "title": "Houthi attacks on commercial ships have upended global trade in vital Red Sea corridor",
      "url": "https://apnews.com/dcece18717aa59648ff9a6b04fbc798c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74284f34a1d5464ca1e711c1b6c86727/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and DAVID CRARY",
      "description": "ROME (AP) — Pope Francis formally approved letting Catholic priests bless same-sex couples, the Vatican announced Monday, a radical shift in policy that aimed at making the church more inclusive while maintaining its strict ban on gay marriage.",
      "publishedAt": "2023-12-18T14:06:17Z",
      "title": "Pope approves blessings for same-sex couples that must not resemble marriage",
      "url": "https://apnews.com/bfa5b71fa79055626e362936e739d1d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1216a7315dcf424982e4093c88207c6b/3000.jpeg"
    },
    {
      "author": "RENATA BRITO and FELIPE DANA",
      "description": "FASS BOYE, Senegal (AP) — A month had passed when the first four men decided to jump.Countless cargo ships had navigated past them, yet no one had come to their rescue. Their fuel was finished.",
      "publishedAt": "2023-12-18T09:03:22Z",
      "title": "36 days at sea: How these castaways survived hallucinations, thirst and desperation",
      "url": "https://apnews.com/a0ea8214f4c17883af34808eef3e7f88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1145c3e1a36445e4871367d2708dfe7f/3000.jpeg"
    },
    {
      "author": "JOVANA GEC",
      "description": "BELGRADE, Serbia (AP) — Serbia's weekend snap election was held in “unjust conditions,\" with multiple reports of irregularities, international observers said on Monday, as opponents of populist President Aleksandar Vucic took to the streets claiming the vote was rigged.",
      "publishedAt": "2023-12-18T10:05:41Z",
      "title": "Serbia's opposition takes to the streets claiming election fraud in Sunday's vote",
      "url": "https://apnews.com/068394fc25eadfbeb38402b34b10fd71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6c63a1bac584ecda3e342e6b7741bd7/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Justice Sandra Day O'Connor, the first woman to serve on the U.S. Supreme Court, was remembered Monday as a trailblazer who never lost sight of how the high court's decisions affected all Americans.",
      "publishedAt": "2023-12-18T05:23:11Z",
      "title": "The late Sandra Day O'Connor, the first woman to serve on the Supreme Court, honored as trailblazer",
      "url": "https://apnews.com/92f9145bd594b84f0911b3fa0a244761",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c26483ea6c074014bdd5907ea20a0d33/1920.jpeg"
    },
    {
      "author": "AMY BETH HANSON",
      "description": "A Utah mother of six who gave parenting advice via a once-popular YouTube channel called “8 Passengers\" pleaded guilty Monday to four felony counts of second-degree aggravated child abuse for abusing and starving two of her children and likely faces a prison sentence.",
      "publishedAt": "2023-12-18T16:58:35Z",
      "title": "YouTube mom who gave parenting advice, Ruby Franke, pleads guilty in child abuse case",
      "url": "https://apnews.com/e948e133d6df87f6cef484156b07c41a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97a64e1dd17d40faba369262fbd7db3b/336.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "PORTLAND, Maine (AP) — A storm barreled up the East Coast on Monday, flooding roads and downing trees in the Northeast, knocking out power to hundreds of thousands, and forcing flight cancellations and school closures.",
      "publishedAt": "2023-12-18T13:07:55Z",
      "title": "Storm batters Northeastern US, knocking out power, grounding flights and flooding roads",
      "url": "https://apnews.com/64d2276c10ce2e7633ecb6df64f45d33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34cce88462684937bf502e10c4c5e9a4/2326.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — A gloomy mood hangs over Ukraine's soldiers nearly two years after Russia invaded their country.Despite a disappointing counteroffensive this summer and signs of wavering financial support from allies, Ukrainian soldiers say they remain fiercely determined to win.",
      "publishedAt": "2023-12-18T05:04:05Z",
      "title": "A gloomy mood hangs over Ukraine's soldiers as war with Russia grinds on",
      "url": "https://apnews.com/afb3bc4714b1dca631bd4df6f931bd56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12cd46fbf7264b60940a11c0bc59b353/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "The commissioners from three of the remaining power conferences in college sports appeared together in a crowded convention center ballroom and were asked to ponder what was wrought by three tumultuous years of realignment that culminated in the destruction of a 108-year-old institution.",
      "publishedAt": "2023-12-18T14:30:34Z",
      "title": "AP Sports Story of the Year: Realignment, stunning demise of Pac-12 usher in super conference era",
      "url": "https://apnews.com/e0356caa1c9cf5ba2630e7b23a1a06ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/621534c5ed0e4068a47200d2495adcd3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}