{
  "articles": [
    {
      "author": "Nicole Winfield, Colleen Barry",
      "description": "A conclave to elect a successor to Pope Francis will begin on Wednesday, May 7, the Vatican announced Monday. The date of the conclave was chief on the agenda of cardinals holding informal meetings to hash out church business following the April 21 death of Pope Francis. They held off on announcing the opening of the conclave until after his funeral on Saturday. The Vatican said more than 180 participated in the fifth informal meeting in Rome on Monday. A smaller group of 135, known as the College of Cardinals, is eligible to elect a new pope.",
      "publishedAt": "2025-04-28T09:43:23Z",
      "title": "Conclave to elect a new pope will start on May 7",
      "url": "https://apnews.com/article/vatican-pope-conclave-electors-17091445fa0670cb1bd741b3af31365e",
      "urlToImage": "https://dims.apnews.com/dims4/default/c98c697/2147483647/strip/true/crop/5111x2875+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fcb%2F0e7e005e516bdf4634cf256e102a%2F5d90e88556a24ccca1848927418be00c"
    },
    {
      "author": "Jim Morris, Claire Rush, Rob Gillies",
      "description": "Murder charges have been filed against a suspect in a weekend car ramming attack that killed 11 people at a Filipino heritage festival in Vancouver. Hundreds attended vigils Sunday across the city for the victims and the Canadian prime minister visited the site on the eve of a federal election. Prosecutors have charged a 30-year-old man with eight counts of second degree murder and say more charges are possible. Investigators have ruled out terrorism and say he has a history of mental health issues. Those killed were between the ages of 5 and 65. Dozens were injured when a man driving an SUV struck people attending the Lapu Lapu Day festival on Saturday.",
      "publishedAt": "2025-04-28T04:07:41Z",
      "title": "Vancouver ramming attack suspect charged with murder as hundreds attend vigils for victims",
      "url": "https://apnews.com/article/canada-vancouver-filipino-festival-deaths-car-4bf1d6ba8963af0ee4f17257674cda39",
      "urlToImage": "https://dims.apnews.com/dims4/default/e806f22/2147483647/strip/true/crop/5121x2881+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2Fec%2F4d97e3efd17541432f517e07bc81%2F3d8a7608088b4f3898e677a5201259bc"
    },
    {
      "author": "Hannah Schoenbaum, Claire Rush",
      "description": "Vancouver's Filipino community is mourning after a man rammed his black Audi SUV into the crowd at a Filipino heritage festival, killing 11 people and injuring dozens. The British Columbia Prosecution Service has charged Kai-Ji Adam Lo, 30, with eight counts of second degree murder and says more charges were possible. The victims range in age from 5 to 65. Police say the suspect has a history of mental health issues. Attendees, vendors and other witnesses say they are struggling to process the trauma. Vancouver's Interim Police Chief Steve Rai has proclaimed Saturday “the darkest day in Vancouver’s history.”",
      "publishedAt": "2025-04-28T04:09:43Z",
      "title": "How people witnessed the 'darkest day in Vancouver' when a car slammed into a crowded festival",
      "url": "https://apnews.com/article/canada-vancouver-filipino-festival-deaths-car-d60b9ad5d3b7dbf58e4b086f72e23eea",
      "urlToImage": "https://dims.apnews.com/dims4/default/84d5bcc/2147483647/strip/true/crop/5509x3099+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F3a%2Fb3e3df8fef582b92b688d32f6c8c%2Fc44f23bdce38455ea4e2fa0bf1d28ca4"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Local health officials say Israeli strikes on the northern Gaza Strip killed at least 27 Palestinians early Monday. Israel has carried out daily strikes on Gaza since ending its ceasefire with Hamas last month. It has cut off the territory’s 2 million Palestinians from all imports, including food and medicine, since the beginning of March in what it says is an attempt to pressure the militant group to release hostages. The daily bombardment and widespread hunger is taking a heavy toll on Gaza’s most vulnerable residents, including pregnant women and children.",
      "publishedAt": "2025-04-28T10:21:31Z",
      "title": "Israeli strikes on Gaza kill at least 27 Palestinians",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-28-2025-52abd5665245fe4125f6a7de125b10e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/db28fb4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F56%2Fa6ea6d38940732ada28f30a05ed6%2F42625cb8af85474684158e1dd3f43138"
    },
    {
      "author": "Molly Quell, Mike Corder",
      "description": "A Palestinian diplomat has told the United Nations’ top court that Israel is killing and displacing civilians and targeting aid workers in Gaza in a “man-made catastrophe of unprecedented proportions.” Ambassador Ammar Hijazi was speaking Monday at the opening of a week of hearings at the International Court of Justice into Israel’s legal obligations to facilitate aid in the occupied territories. Israel denies deliberately targeting civilians and aid staff. Israel has criticized the case as part of its “systematic persecution and delegitimization.”",
      "publishedAt": "2025-04-28T04:17:28Z",
      "title": "Palestinian envoy tells UN court Israel is killing Gaza civilians. Israel says it’s being persecuted",
      "url": "https://apnews.com/article/israel-icj-court-un-gaza-palestinians-unrwa-df682203e07cea30d89c154c0f87d6e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/851ca63/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2Fcd%2F498ae52a1a57ba57ca0c80d31ac3%2Fb768048895e74e2aa8a0bbb5fe21a45b"
    },
    {
      "author": "Sarah El Deeb, Mohammed Jahjouh, Lee Keath",
      "description": "Israel’s military campaign decimating the Gaza Strip has made pregnancy and childbirth more dangerous for Palestinian women and their babies. It’s become worse since Israel seven weeks ago cut off food, medicine and supplies for the territory’s more than 2 million people. According to the United Nations Population Fund, up to 20% of Gaza’s estimated 55,000 pregnant women are malnourished, and half face high-risk pregnancies. In February and March, at least 20% of newborns were born prematurely or suffering from complications or malnutrition. Comprehensive records of miscarriages and stillbirths can’t be obtained. But records at one hospital show miscarriages in January and February were double the same period in 2023.",
      "publishedAt": "2025-04-28T05:01:32Z",
      "title": "Pregnancy and childbirth risks are increasing in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-pregnancy-childbirth-816e743a4d9ef190f55d03bd01b9881d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b298408/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fee%2F1dcb06c92fa48dbdd260d595f44a%2F7f06302c9c7c4bbab3f66e0704da2ab8"
    },
    {
      "author": "Vanessa Gera",
      "description": "The Vatican is closing the Sistine Chapel to the public as part of its preparations for the the conclave to elect the next pope after the death of Pope Francis. The date for the conclave has not yet been set but it can only begin after a nine-day period of mourning. When it does, the scarlet-robed cardinals will enter solemnly to participate in a secretive process said to be guided by the holy spirit that will result in the selection of the next leader of the 1.4 billion-strong Catholic church. For inspiration they will also have the great beauty of the frescos painted by Michelangelo and other renowned Renaissance artists.",
      "publishedAt": "2025-04-28T04:08:09Z",
      "title": "The Vatican closes the Sistine Chapel to the public and prepares for a papal conclave",
      "url": "https://apnews.com/article/vatican-sistine-chapel-conclave-27a32119a225f7aff20cfe3619124b75",
      "urlToImage": "https://dims.apnews.com/dims4/default/cce4ea5/2147483647/strip/true/crop/2040x1148+0+93/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2F66%2F697c97dc004adeb6d3e16e694409%2F9ae7d857afd742c1a744dec16178b458"
    },
    {
      "author": null,
      "description": "North Korea has confirmed for the first time that it has dispatched troops to Russia to support its war against Ukraine. U.S., South Korean and Ukraine intelligence officials have said North Korea last fall sent about 10,000-12,000 troops to Russia. But North Korea hadn’t until Monday confirmed its troops’ movements. North Korea’s state-run Korean Central News Agency said leader Kim Jong Un decided to send combat troops to Russia under a mutual defense treaty. It cited Kim as saying that the troops’ deployment was meant to “annihilate and wipe out the Ukrainian neo-Nazi occupiers and liberate the Kursk area in cooperation with the Russian armed forces.”",
      "publishedAt": "2025-04-27T23:42:38Z",
      "title": "North Korea confirms dispatch of troops to Russia to support its war against Ukraine",
      "url": "https://apnews.com/article/north-korea-south-korea-russia-ukraine-war-34716db67af6176d0d5e0ebf1b887881",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Rob Gillies",
      "description": "Canadians are set to decide whether to extend the Liberal Party’s decade in power or instead hand control to the Conservatives. They’ll pick either Prime Minister Mark Carney or opposition leader Pierre Poilievre to lead the way forward, but Monday's election is also a referendum of sorts on a non-Canadian: Donald Trump. Until the American president won a second term and began threatening Canada’s economy and sovereignty, even suggesting the country should become the 51st state, the Liberals looked headed for defeat. But Trump’s truculence has infuriated many Canadians and led to a tightening of the race. Whichever candidate becomes prime minister will face big challenges, including a trade war and resetting of Canada's relationship with the United States.",
      "publishedAt": "2025-04-28T04:19:36Z",
      "title": "Canadians are set to vote in an election dominated by Trump's trade war and bluster",
      "url": "https://apnews.com/article/canada-election-trump-carney-poilievre-861f5b00794355b231ee3f218568949b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d78b11/2147483647/strip/true/crop/6385x3592+0+333/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F00%2F485e78f2fab8ccbabe93a7fc54f5%2F8c154e3f704e4f94aefd20066808e277"
    },
    {
      "author": "Justin Spike",
      "description": "A violin made in 1941 inside the Nazi concentration camp at Dachau was found to contain a hidden note from its maker, Polish Jewish prisoner Franciszek Kempa. Discovered by Hungarian art dealers decades later, the note explained the instrument was crafted under dire conditions with no proper tools or wood. Experts were struck by the contrast between the violin’s masterful construction and its poor materials. Kempa’s violin is believed to be the only known instrument built within Dachau, where most surviving instruments were brought in by prisoners. Dubbed the “violin of hope,” it stands as a testament to resilience. Dachau, the first Nazi concentration camp, was liberated in 1945 after at least 40,000 deaths.",
      "publishedAt": "2025-04-28T06:07:14Z",
      "title": "A secret note hidden in Dachau-built ‘Violin of Hope’ tells a tale of survival and craftsmanship",
      "url": "https://apnews.com/article/hungary-dachau-nazi-violin-note-franciszek-kempa-62782ac2443386b7194901c3c4d47ea0",
      "urlToImage": "https://dims.apnews.com/dims4/default/7c09384/2147483647/strip/true/crop/3840x2160+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F56%2F6998d3165c94a01a1d0fc13d191e%2Fdff80ca7721047a888d9e24dd8cb25d0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}