{
  "articles": [
    {
      "author": "Olga R. Rodriguez, Julie Watson",
      "description": "Crews have pushed through mountainous wilderness in California near Lake Tahoe during a snowstorm to rescue six backcountry skiers who survived an avalanche but were trapped by its snow and ice. Nine others from their tour group remain missing. The Nevada County Sheriff's Office says two of the six were taken to a hospital for treatment. The sheriff’s office says there were 15 skiers on the trip — not 16 as initially believed. Extreme weather conditions in the Northern California mountains slowed the rescue effort. It took crews several hours to reach the skiers and take them to safety, where they were evaluated by the Truckee Fire Department.",
      "publishedAt": "2026-02-18T07:13:40Z",
      "title": "A California avalanche hits 16 backcountry skiers. 6 survivors located and 9 are missing",
      "url": "https://apnews.com/article/california-avalanche-backcountry-skiers-rescue-missing-f7b4a89c38af634e39a152a874db17f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/0985967/2147483647/strip/true/crop/1105x736+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Fe5%2F8782f1d55bd764c87f978c7e1f1f%2Fb41d651afd5548d28cb86c303a1d8f7e"
    },
    {
      "author": "Julie Carr Smyth",
      "description": "Les Wexner’s long-time friendship with the late sexual predator Jeffrey Epstein will be the subject of a closed-door congressional deposition in Ohio. The billionaire retail magnate on Wednesday is expected to face questions about new revelations contained in Epstein-related documents released by the Justice Department. The 88-year-old Wexner is the retired founder of L Brands. He says he intends to cooperate with House Oversight Committee members' inquiry. As one of Epstein’s most prominent former friends, Wexner has already spent years answering for their association. He denies any knowledge of or involvement in Epstein’s crimes. Wexner's name appears more than 1,000 times.",
      "publishedAt": "2026-02-18T05:03:20Z",
      "title": "Retail mogul Les Wexner to face congressional questions over Epstein files",
      "url": "https://apnews.com/article/epstein-wexner-congress-subpoena-733833f6d648c09e6b3473eb1cd4009d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e81a72/2147483647/strip/true/crop/2137x1424+0+13/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2F8a%2F28bf0f9d4c76cb438701f5e89440%2Fc52c436d62e047a789003bffb411305c"
    },
    {
      "author": "Sylvie Corbet",
      "description": "Paris prosecutors have opened two new investigations tied to Jeffrey Epstein, and they call on possible victims in France to come forward. Prosecutor Laurence Beccuau says one case covers sex abuse crimes and the other covers financial wrongdoing. She says investigators want to use newly released U.S. files, media reports, and fresh complaints to build a broader picture. She called on Wednesday on people who may never have spoken up before to file formal complaints or give witness accounts. She also says older French files will get reviewed.",
      "publishedAt": "2026-02-18T11:03:52Z",
      "title": "Paris prosecutors open Epstein-related investigations in France",
      "url": "https://apnews.com/article/france-epstein-paris-prosecutor-opens-investigation-a6d1f3e6bf750b2aff55da9716323fa3",
      "urlToImage": "https://dims.apnews.com/dims4/default/085c435/2147483647/strip/true/crop/5472x3646+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2F83%2F604adbe3ef003ef43b40924d6295%2F8776076848c143e49eb7b7df5c0a43c7"
    },
    {
      "author": "Samya Kullab, Susie Blann",
      "description": "The former Ukrainian army general widely seen as the top political rival to President Volodymyr Zelenskyy has spoken publicly for the first time about a deep rift between the two men. The comments made by Valerii Zaluzhnyi during an interview with the AP signal his possible desire to run for the presidency after the war is over. Zelenskyy ousted Zaluzhnyi as head of the army in 2024 and later appointed him as the country’s ambassador to Britain. Zaluzhnyi told AP that their strained relationship reached a boiling point in 2022, when domestic intelligence agents raided his office, a previously unreported incident he alleges was an act of intimidation. Zelenskyy's office and the country's security service declined to comment. The AP could not confirm Zaluzhnyi's account of the raid.",
      "publishedAt": "2026-02-18T09:30:23Z",
      "title": "Ukraine's ex-army chief reveals to AP a rift with Zelenskyy",
      "url": "https://apnews.com/article/ukraine-war-zaluzhnyi-zelenskyy-raid-5ff9e5e2054e0b17c10daf58d7eab63e",
      "urlToImage": "https://dims.apnews.com/dims4/default/130d989/2147483647/strip/true/crop/8102x5399+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Fd8%2Fda0855024609fe581195f3c4af1e%2Fd9e26c6dab1e435eba22c75e8f5317e3"
    },
    {
      "author": "Linley Sanders",
      "description": "Democratic candidates have notched a series of wins in recent special elections — but a new AP-NORC poll finds views of the Democratic Party among rank-and-file Democrats have not bounced back since President Donald Trump’s victory in 2024. Democrats’ favorability among the party’s rank-and-file plummeted after the 2024 election. The latest measure of how Democrats view their party hasn't improved since then. The midterm elections are still many months away, and lackluster favorability doesn’t spell electoral doom. Other factors could benefit Democrats this year, including broadly negative views of Trump and other Republicans. But the lack of enthusiasm could be a longer-term problem for the party.",
      "publishedAt": "2026-02-18T12:08:42Z",
      "title": "Many Democrats are still down on the Democrats, new poll shows",
      "url": "https://apnews.com/article/poll-trump-democrats-republicans-parties-abc06b4ddc9b3aca7065ead47d43c75b",
      "urlToImage": "https://dims.apnews.com/dims4/default/991e400/2147483647/strip/true/crop/8570x5710+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2Fc1%2F93d32e6cb7ad7e0f2886bfb40a52%2F58b7c80d6a774481958734f14731f008"
    },
    {
      "author": "Kim Chandler",
      "description": "Some Republican legislators are pushing to limit state environmental regulations. Alabama lawmakers approved legislation Tuesday limiting state agencies from adopting pollution rules stricter than federal standards set by the Environmental Protection Agency. It follows efforts by the Trump administration to roll back rules at the agency. The Alabama measure would allow new state pollution limits only if there is a direct link between exposure and bodily harm. Supporters say the bill reduces regulatory burdens and aligns with President Donald Trump’s deregulatory agenda. Environmental groups and Democrats say the bill prioritizes industry over public health. The bill now goes to Gov. Kay Ivey.",
      "publishedAt": "2026-02-18T15:17:14Z",
      "title": "Trump and some GOP states aim to limit pollution rules",
      "url": "https://apnews.com/article/alabama-environmental-regulations-ffe1e8efb9cecc41c4480d28503cdeeb",
      "urlToImage": "https://dims.apnews.com/dims4/default/a25c9d8/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2Ff4%2F1d4eb13d476bb65398f0b58ecbfe%2F4c1ba6f873bf4c77b86533b2f1e979bb"
    },
    {
      "author": "Aaron Morrison, Sophia Tareen",
      "description": "The Rev. Jesse Jackson kept up his more than half-century-long fight for civil and human rights through his final years despite challenges over his health, the coronavirus pandemic, racial injustice and political divisions. Whether appearing at the funerals of Black people killed by police or participating in COVID-19 vaccination drives to address hesitancy in communities of color, Jackson built on a life in public advocacy that included running for president, international diplomacy and influencing the lexicon of racial identity in America. Jackson, a protégé of the Rev. Martin Luther King Jr., died on Tuesday. He was 84.",
      "publishedAt": "2026-02-17T16:02:39Z",
      "title": "Jesse Jackson kept the Civil Rights Movement alive long after King",
      "url": "https://apnews.com/article/jesse-jackson-dead-8ed88b7da0b911ed842f3c219cee77e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4513057/2147483647/strip/true/crop/3032x2020+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2F83%2F93c5babbaace0ffcfe2e2d74cc72%2F4b2f1d1a34a64a48b6e7db123671e95b"
    },
    {
      "author": "Jamey Keaten, Illia Novikov",
      "description": "U.S.-brokered talks between Russian and Ukrainian envoys are continuing in Geneva, with both sides apparently still far apart on peace terms. Ukrainian delegate Rustem Umerov said working groups on Wednesday are reviewing political and military issues. The talks mark a third round of direct meetings organized by the U.S., after earlier sessions in Abu Dhabi. Trump envoy Steve Witkoff said U.S. efforts have made meaningful progress, but gave no details. Fighting continues along the long front line. Ukraine reports Russia launched a ballistic missile and more than 100 drones overnight. A drone strike in Zaporizhzhia killed a woman and injured seven.",
      "publishedAt": "2026-02-18T09:25:16Z",
      "title": "Ukrainian and Russian envoys hold a second day of US-brokered talks in Geneva",
      "url": "https://apnews.com/article/russia-ukraine-war-talks-geneva-0f22fa796cafd6606a88ad1b101ab3fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/147a2c4/2147483647/strip/true/crop/10867x7241+0+455/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F04%2F7f94c7ea4c4c5447745ae566cb00%2F7c8db2b42d99414faa55f536e3d73769"
    },
    {
      "author": "David Bauder",
      "description": "Late-night host Stephen Colbert isn't backing down from his public dispute with CBS bosses over what he can air on his show. He said Tuesday night that he was surprised by a network statement that denied Colbert had been told he couldn't air an interview with a Texas Senate candidate for fear of triggering a little-known “equal time” rule by the FCC. CBS said its lawyers had only advised him that he couldn't broadcast the interview, which aired on YouTube instead. Colbert said that he was surprised that CBS parent company Paramount “would not stand up to these bullies” in the Trump administration.",
      "publishedAt": "2026-02-18T12:19:55Z",
      "title": "Stephen Colbert mocks CBS statement over late-night show controversy",
      "url": "https://apnews.com/article/colbert-talarico-cbs-trump-fcc-014a0531715f098fbcd7902476a22590",
      "urlToImage": "https://dims.apnews.com/dims4/default/80088f9/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2Fb4%2F633c069725bd8fd9dd0cabc47b79%2F949d149e933b479687a2801cebf07086"
    },
    {
      "author": "Steve Douglas",
      "description": "Mikaela Shiffrin’s eight-year Olympic medal drought is over. The American skiing standout has put in two dominant runs to win the women’s slalom by 1.50 seconds. The race isn’t officially over yet with dozens of lower-tier racers still to take the course. But Shiffrin is the leader after the fastest 30 skiers from the first run. World champion Camille Rast was in silver medal position and Anna Swenn Larsson in third.",
      "publishedAt": "2026-02-18T10:04:05Z",
      "title": "US star Mikaela Shiffrin wins slalom to break 8-year Olympic drought",
      "url": "https://apnews.com/article/milan-cortina-olympics-mikaela-shiffrin-skiing-eee2ed4bf10364e2d922f29273152502",
      "urlToImage": "https://dims.apnews.com/dims4/default/69b6a60/2147483647/strip/true/crop/3588x2391+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F1f%2Fcbfe18c02f5132a9ae0b6d2b73df%2F622a72c5ebd244c09e243007b2dd2093"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}