{
  "articles": [
    {
      "author": "MARY CLARE JALONICK, BRIAN SLODYSKO and MEG KINNARD",
      "description": "WASHINGTON (AP) — The federal indictment of Donald Trump on Tuesday marks the first time that the former president has been formally held accountable for his efforts to overturn his 2020 election defeat.",
      "publishedAt": "2023-08-02T01:06:13Z",
      "title": "Takeaways from the Trump indictment that alleges a campaign of 'fraud and deceit'",
      "url": "https://apnews.com/4b5fea593f3684241a64650798aa598e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cb30c5be7104d1f904bbdedd63d864c/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — Donald Trump was indicted on felony charges Tuesday for working to overturn the results of the 2020 election in the run-up to the violent riot by his supporters at the U.S.",
      "publishedAt": "2023-08-01T21:27:59Z",
      "title": "Trump indicted for efforts to overturn 2020 election and block transfer of power",
      "url": "https://apnews.com/debb59bb7a4d9f93f7e2dace01feccdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f873853adebe451a929869b1d375bc8e/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Russian drones on Wednesday hit a Ukrainian port city along the border with NATO member Romania, causing significant damage and a huge fire at facilities that are key to Ukrainian grain exports following the end of a deal with Russia that allowed Ukrainian shipments to world markets.",
      "publishedAt": "2023-08-02T06:29:59Z",
      "title": "Russian drone strikes hit Ukrainian port on Romania border that is key to grain exports",
      "url": "https://apnews.com/8b20147a55f29a0c0bc465b59274357e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5edf72bb0044b3da4381ea4ceb9e9c2/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Human-caused global warming made July hotter for four out of five people on Earth, with more than 2 billion people feeling climate change-boosted warmth daily, according to a flash study.",
      "publishedAt": "2023-08-02T10:10:48Z",
      "title": "Climate change made July hotter for 4 of 5 humans on Earth, scientists find",
      "url": "https://apnews.com/3d7d0ee31e022aab535adf57b54618ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4b8bc19d9c34a619021a99052f84b81/3000.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — Rhonda Hicks could have kept working into her 60s. She loved teaching and loved her students in Philadelphia’s public schools. As a Black woman, she took pride in being a role model for many children of color.",
      "publishedAt": "2023-08-02T04:06:06Z",
      "title": "More teachers are quitting their jobs. Educators of color often are more likely to leave",
      "url": "https://apnews.com/b0c39ec0d4320e12f2767a342e503f85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e57956186d34032ab590a39b61678b1/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD, HELENA ALVES and BARRY HATTON",
      "description": "LISBON, Portugal (AP) — Pope Francis challenged Europe to retake its role as a peacemaker and bridgebuilder as he arrived Wednesday in Portugal to open World Youth Day, hoping to inspire the next generation of Catholics to work together to combat conflicts, climate change and other problems facing the world.",
      "publishedAt": "2023-08-02T03:35:32Z",
      "title": "Pope Francis urges Europe to work for peace as he lands in Portugal for World Youth Day",
      "url": "https://apnews.com/4db3ac2405da84abb9beced2b1f8b7c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93a06cb95e174e15a6ed3627a6892f15/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Foreign nationals lined up outside an airport in Niger's capital Wednesday morning to wait for a French military evacuation flight, while a regional bloc continued talks about its response to the military coup that took place last week.",
      "publishedAt": "2023-08-02T07:52:19Z",
      "title": "Foreign nationals evacuate Niger as regional tensions rise after coup",
      "url": "https://apnews.com/ca8ad99410a2f0e04a6a361595e4c768",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c39bd9a612e4a90b545da217879485e/1920.jpeg"
    },
    {
      "author": "COLLEEN BARRY and NICOLE WINFIELD",
      "description": "MILAN (AP) — During Europe's heat wave last month, Floriana Peroni’s vintage clothing store had to close for a week.",
      "publishedAt": "2023-08-02T04:16:03Z",
      "title": "As the summer breezes fade, sweltering Europeans give air conditioning a skeptical embrace",
      "url": "https://apnews.com/3f1b8ad9275297da02ae137a72b77a8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f873fdaa9b547dbae086d4fc6bf048b/3000.jpeg"
    },
    {
      "author": "TY O'NEIL, STEFANIE DAZIO and RIO YAMAT",
      "description": "MOJAVE NATIONAL PRESERVE, Calif. (AP) — Firefighters aided by rain fought to contain a massive blaze that swept through the California desert into Nevada and could threaten the region's famous spiky Joshua trees.",
      "publishedAt": "2023-08-02T04:33:01Z",
      "title": "Progress made against massive California-Nevada wildfire but flames may burn iconic Joshua trees",
      "url": "https://apnews.com/3fe4fc9ea8bb500bb48e7589f16911ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f295fa30f6348dcbbbb735d236f7357/1280.jpeg"
    },
    {
      "author": "ANDY WONG and HUIZHONG WU",
      "description": "ZHUZHOU, Hebei (AP) — China's capital has recorded its heaviest rainfall in at least 140 years over the past few days after being deluged with heavy rains from the remnants of Typhoon Doksuri.The city recorded 744.8 millimeters (29.3 inches) of rain between Saturday and Wednesday morning, the Beijing Meteorological Bureau said Wednesday.",
      "publishedAt": "2023-08-02T04:27:30Z",
      "title": "Beijing records heaviest rainfall in at least 140 years, causing severe flooding and 21 deaths",
      "url": "https://apnews.com/1a8f968799bd539d11f3421010b8f2a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f59df53fb20e4602835a0caece16b598/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}