{
  "articles": [
    {
      "author": null,
      "description": "The Senate is slogging through an overnight session as Republican leaders search for ways to secure support for President Donald Trump’s big bill of tax breaks and spending cuts. For almost 18 hours the Senate has been in what's called vote-a-rama, fending off proposed amendments mostly from Democrats trying to defeat the package. Senate Majority Leader John Thune of South Dakota is working to strike a last-minute agreement between Republicans worried the bill’s reductions to Medicaid will leave millions without care and his conservative flank seeking steeper cuts to hold down deficits ballooning with the tax cuts. Trump urged them on in a midnight social media post.",
      "publishedAt": "2025-07-01T06:50:57Z",
      "title": "Senate Republicans seek support for Trump’s big bill in overnight session",
      "url": "https://apnews.com/article/congress-tax-cuts-trump-big-bill-bf3f94471b13db3e5d50f0cd1f8fe793",
      "urlToImage": "https://dims.apnews.com/dims4/default/aec4038/2147483647/strip/true/crop/4721x2656+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F53%2Fa7888428f4914c2efaa988a84b6d%2F9cd159c826b24f5f8d70765ee4132785"
    },
    {
      "author": null,
      "description": "At some 940-pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations. Now it’s up to the Republican-controlled Congress to decide whether President Donald Trump’s signature’s domestic policy package will become law. The bill is nearing a final Senate vote. If it passes, it would then move to the House. Democrats are united against it. The bill would make permanent many of the tax breaks passed in Trump's first term while adding new ones such as no tax on tips or overtime.",
      "publishedAt": "2025-06-30T19:56:54Z",
      "title": "What's in the latest version of Trump's big bill",
      "url": "https://apnews.com/article/trump-tax-cuts-bill-republicans-medicaid-snap-4ff35843e6a5247f37d048bde9b1f5ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/640fa02/2147483647/strip/true/crop/5876x3305+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2F4f%2F9b40c7c90634883fa7b2cbb22d9f%2F4848db0607744a889293d7af549eb407"
    },
    {
      "author": null,
      "description": "International charities, including Oxfam and Amnesty, are urging the disbandment of an Israeli and U.S.-backed aid mechanism in Gaza. They cite repeated chaos and deadly violence at aid distribution sites. Between late Monday and early Tuesday, at least seven Palestinians were killed while seeking aid in southern and central Gaza. Earlier Monday, Israeli forces killed at least 74 people in Gaza through airstrikes and gunfire. The ongoing war — sparked by a Hamas attack in October 2023 in which some 1,200 people were killed and 251 taken hostage — has killed over 56,000 Palestinians. Israeli Prime Minister Netanyahu plans to meet U.S. officials next week.",
      "publishedAt": "2025-07-01T09:59:14Z",
      "title": "International charities and NGOs call for end to controversial Israeli-backed aid group in Gaza",
      "url": "https://apnews.com/article/mideast-wars-gaza-netanyahu-trump-d0cf0cc79fa687d76807dfe40ddf7b21",
      "urlToImage": "https://dims.apnews.com/dims4/default/af204e9/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F14%2Fc2aa0f39dcf79bf6996aedf06ca2%2F797dfd8322b84775b7540490551248e4"
    },
    {
      "author": null,
      "description": "Attorney General Pam Bondi’s comments about evidence the Justice Department is reviewing from its Jeffrey Epstein sex trafficking investigation have fueled anticipation about the expected release of more files related to the New York financier. But weeks after Bondi’s claim about “tens of thousands” of Epstein videos, it's unclear what she was referring to. The Associated Press spoke with lawyers and law enforcement officials in criminal cases of Epstein and ex-girlfriend Ghislaine Maxwell who said they hadn’t seen and didn’t know of recordings like what Bondi described. One of Maxwell's lawyers says salacious videos of Epstein with children never surfaced. The department has declined AP requests to speak with officials overseeing the Epstein review.",
      "publishedAt": "2025-07-01T11:21:32Z",
      "title": "Mystery about Epstein files after Bondi cites 'tens of thousands' of videos",
      "url": "https://apnews.com/article/justice-department-jeffrey-epstein-pam-bondi-trump-fa39193d5b5ff91970428bf077a5ce44",
      "urlToImage": "https://dims.apnews.com/dims4/default/623f1d3/2147483647/strip/true/crop/5076x2855+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F30%2Fdb31f06393be93deaa40f7467193%2F4b8e111561104bbd85cd54aa9f410507"
    },
    {
      "author": null,
      "description": "Officials say a Ukrainian drone has struck an industrial plant deep inside Russia, injuring several people and causing a fire. Ukrainian officials say the plant produces drones and air defense systems. The attack Tuesday came as Ukraine prioritizes drone development to counter Russia's expanded drone attacks. Both nations are ramping up drone capabilities, turning the war into a testing ground for advanced unmanned weaponry. In June, Russia launched a record 5,438 drones at Ukraine, according to data collated by The Associated Press. Ukraine has been using long-range drones to target Russian facilities deep inside its territory. Meanwhile, Russian drones struck a large southern Ukrainian city, leaving many without power.",
      "publishedAt": "2025-07-01T10:05:20Z",
      "title": "Ukrainian drone strikes a Russian plant",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-c1aa7c5ce5deb89a4654cd41af6a5ec9",
      "urlToImage": "https://dims.apnews.com/dims4/default/c45bc03/2147483647/strip/true/crop/6250x3516+0+326/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F66%2Fe2c6b29b056e3a1063f24c950356%2Fcbf4124f0e5349ea85b0d47216e0e58b"
    },
    {
      "author": null,
      "description": "Thailand’s Constitutional Court has suspended Prime Minister Paetongtarn Shinawatra from office pending an investigation over a leaked phone call with a senior Cambodian leader. The judges voted unanimously Tuesday to take the petition accusing her of a breach of ethics, and voted 7 to 2 to suspend her from duty. Paetongtarn has faced growing dissatisfaction over her handling of the latest border dispute with Cambodia in which a Cambodian soldier was killed. The leaked phone call while she engaged in diplomacy over the dispute set off a string of complaints and public protests. Paetongtarn said she would accept the process and would do her best to defend herself.",
      "publishedAt": "2025-07-01T04:55:44Z",
      "title": "Thailand court suspends PM Paetongtarn Shinawatra over leaked phone call",
      "url": "https://apnews.com/article/thailand-cabinet-paetongtarn-leak-call-cambodia-f44701c7e21a99f894fa94981a79ee8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/af2b543/2147483647/strip/true/crop/5532x3112+0+288/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2F1a%2F6c8936580c6aab252dadf4eb5c82%2F9ea377f6aa2d4947bacea20b2180168c"
    },
    {
      "author": null,
      "description": "A 20-year-old man’s life appeared to have begun to unravel in the months before law enforcement say he fatally shot two firefighters and severely wounded a third as they responded to a wildfire near Coeur d’Alene, Idaho. Wess Roley was living out of his vehicle and his former roommate, T.J. Franks Jr., said he shaved off his long hair and started to “kind of go downhill.” Authorities say the man had set a fire and the firefighters who rushed to put out the blaze instead found themselves under fire. They took cover behind fire trucks. Kootenai County Sheriff Bob Norris says it appears the man later killed himself.",
      "publishedAt": "2025-07-01T05:45:57Z",
      "title": "Suspected Idaho shooter once aspired to be a firefighter before life began to unravel",
      "url": "https://apnews.com/article/idaho-firefighters-shooting-law-enforcement-suspect-5b74e94f9862cf0f0689b725c1d565ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/83e178a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F86%2Fadc96fa995d92e5f8d324923f981%2F3525bb7167224f0eb1218d2e1acd88b9"
    },
    {
      "author": null,
      "description": "Bryan Kohberger has agreed to plead guilty to murdering four University of Idaho students as part of a deal with prosecutors to avoid the death penalty. Shanon Gray, an attorney for the family of victim Kaylee Goncalves, has confirmed that families of the victims received the news in a letter from prosecutors Monday. A change of plea hearing is set for Wednesday. Kohberger, 30, is accused in the stabbing deaths of Goncalves, Ethan Chapin, Xana Kernodle and Madison Mogen at a rental home near campus in Moscow, Idaho, in November 2022. Kohberger was arrested in Pennsylvania weeks after the killings. He had been a criminal justice graduate student at Washington State University.",
      "publishedAt": "2025-07-01T05:07:36Z",
      "title": "Kohberger to plead guilty to murder in University of Idaho student stabbings",
      "url": "https://apnews.com/article/kohberger-idaho-students-killed-plea-deal-9226e0768186084d1748d72fa1ed587e",
      "urlToImage": "https://dims.apnews.com/dims4/default/c7efc15/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2F64%2Fc6b1d75e4190ea061f27d5b355f8%2F0ac5d9f239a84c93b4fab2197cef16f2"
    },
    {
      "author": null,
      "description": "Authorities say two firefighters were killed and another was critically injured after they were shot while responding to a wildfire near Coeur d’Alene, Idaho. The gunman was found dead after Sunday's attack with a shotgun nearby. A shelter-in-place order was lifted Sunday night after a tactical response team used cellphone data to narrow the search in a wooded area where they found the suspect’s body. A law enforcement official has identified the suspect as Wess Roley and authorities say he acted alone. The official spoke to The Associated Press on Monday on the condition of anonymity because they weren’t authorized to discuss the investigation.",
      "publishedAt": "2025-06-30T06:03:28Z",
      "title": "What to know about the Idaho shooting",
      "url": "https://apnews.com/article/idaho-shooting-coeur-dalene-firefighters-mountain-d3ceec2c795aaa13d0ede2993f1681ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/3871106/2147483647/strip/true/crop/4946x2782+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F47%2Ffa4626af9281e697956345942f4e%2F54cc571c762045f7858078c8a9cbe3b8"
    },
    {
      "author": null,
      "description": "A jury returns to deliberate for a second day Tuesday at the sex trafficking trial of music mogul Sean “Diddy” Combs. Jurors deliberated over five hours on Monday after they received instructions on the law from the trial judge. They are deciding whether prosecutors have proven racketeering conspiracy and sex trafficking charges during a trial that began in early May. Defense lawyers say prosecutors are unjustly basing federal crimes on what Combs did in the bedroom with his girlfriends as they participated in the swinger lifestyle and on acts of domestic violence involving their client.",
      "publishedAt": "2025-07-01T04:05:34Z",
      "title": "Jury returns to deliberate for a second day at Sean 'Diddy' Combs' sex trafficking trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-jury-deliberations-25c62300cae33ca9f18aee28788449b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d03410e/2147483647/strip/true/crop/4905x2759+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F80%2F09a6b0c1f96f0fd7919de74d9b2f%2Feac8d5a12d124ca885a751f871fa203c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}