{
  "articles": [
    {
      "author": null,
      "description": "A federal judge in New Hampshire says he will certify a class action lawsuit including all children who will be affected by President Donald Trump’s executive order ending birthright citizenship and issue a preliminary injunction blocking it. The judge announced his decision Thursday after an hour-long hearing and said a written order will follow. He says the order will include a seven-day stay to allow for appeal. Plaintiffs originally sought to include parents as plaintiffs.",
      "publishedAt": "2025-07-10T04:01:25Z",
      "title": "New Hampshire judge to pause Trump’s birthright citizenship order",
      "url": "https://apnews.com/article/birthright-citizenship-classaction-lawsuit-055227e3f219fd890c78cd21c89fd5d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/8e08f48/2147483647/strip/true/crop/5533x3112+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F11%2F023b54efde6b27cd04e746ad9429%2Fad15bb51227c47edb926cda9a4d1f7e1"
    },
    {
      "author": null,
      "description": "Ukrainian officials say that Russia pounded the capital with yet another major missile and drone attack. At least least two people were killed in the attack overnight into Thursday. The strikes caused fires across Kyiv a day after the heaviest aerial attack of the war so far. An official in Kyiv said at least 16 people were wounded in the latest barrage. Russia has recently sought to overwhelm Ukraine’s air defenses with major attacks that include increasing numbers of decoy drones. The pressure has caused alarm among Ukrainian officials who are uncertain about continuing vital military aid from the United States and U.S. President Donald Trump’s policy toward Russia.",
      "publishedAt": "2025-07-10T02:23:26Z",
      "title": "Russia hits Kyiv with more missiles and drones",
      "url": "https://apnews.com/article/russia-drone-attack-ukraine-war-d16f45fdbb8fbd0152c7a2c7c5d3cf9f",
      "urlToImage": "https://dims.apnews.com/dims4/default/90313ff/2147483647/strip/true/crop/7742x4355+0+403/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F9e%2F042c82ebace1188ee87ab18164df%2F3e5f2267a91e445f947d16e1491c7d92"
    },
    {
      "author": null,
      "description": "The Los Angeles Fire Department says 31 workers have been safely removed from an industrial tunnel after part of the structure collapsed. The workers were up to 6 miles from the tunnel’s only entrance Wednesday. Some workers scrambled over a tall mound of loose soil to reach coworkers. They were shuttled to the entrance and hoisted out. Paramedics were evaluating 27 of the workers and officials say none had major injuries. A Los Angeles County Sanitation Districts spokesperson says authorities are still investigating the cause of the cave-in at the nearly $700 million project.",
      "publishedAt": "2025-07-10T04:40:33Z",
      "title": "Wilmington tunnel collapse: 31 construction workers reach safety",
      "url": "https://apnews.com/article/tunnel-collapse-los-angeles-2dfef5cb607394c6a71e3b84436fde12",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c1ee5d/2147483647/strip/true/crop/3561x2003+0+185/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2Fb5%2F925938b2796433c01bf936499302%2F629c5b24962e4e6fbd17bf91bcdd7882"
    },
    {
      "author": null,
      "description": "Britain and France have agreed to a pilot plan that will send some migrants who cross the English Channel on small boats back to France as the U.K. government struggles to tamp down criticism that it has lost control of the country’s borders. U.K. Prime Minister Keir Starmer and French President Emmanuel Macron announced the deal Thursday in London. While the initial program will involve only 50 people a week, U.K. officials suggest it is a major breakthrough because it sets a precedent that migrants who reach Britain illegally can be returned to France.",
      "publishedAt": "2025-07-10T04:05:07Z",
      "title": "UK and France agree to send some migrants arriving in Britain by boat back to France",
      "url": "https://apnews.com/article/macron-france-english-channel-migration-33d17944840acdfbd991d13eea7ef854",
      "urlToImage": "https://dims.apnews.com/dims4/default/cfdd707/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F49%2Fc9f12209d9c94130dbbb2e8b50ea%2Fcf7a1ac141984aa7a3a5b12201a6939e"
    },
    {
      "author": null,
      "description": "Several hundred people have gathered for a worship ceremony at a high school stadium in Texas. The vigil was held Wednesday evening to remember of the at least 120 people who died in the catastrophic flash floods over the July Fourth holiday. More than 160 are still believed to be missing in hard-hit Kerr County. People in the crowd clutched one another and brushed away tears during the vigil. Search crews and volunteers are continuing to scour miles along the Guadalupe River for the people still missing. The floods are now the deadliest from inland flooding in the U.S. since 1976.",
      "publishedAt": "2025-07-10T04:06:59Z",
      "title": "Hundreds gather at Texas vigil following deadly floods",
      "url": "https://apnews.com/article/texas-floods-worship-ceremony-dead-missing-39afd477993c6220d0ce8c080cea0828",
      "urlToImage": "https://dims.apnews.com/dims4/default/d68995b/2147483647/strip/true/crop/5595x3147+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Faa%2F76838ea47c9996d1b02db06cfdb6%2F802f091d658043249f88c93c62d4568a"
    },
    {
      "author": null,
      "description": "Europe and Israel have reached a new deal to allow more food and fuel into Gaza. The European Union’s foreign policy chief said on Thursday that the plan could result in “more crossings open, aid and food trucks entering Gaza, repair of vital infrastructure and protection of aid workers.” The announcement came as an Israeli airstrike killed 10 children and five adults gathered outside a medical clinic to receive critical nutritional supplements and other care. The Israeli military says it was targeting a militant when it struck near the clinic.",
      "publishedAt": "2025-07-10T11:39:41Z",
      "title": "Europe unveils deal for more food and fuel for Gaza. Israeli strike kills 15 waiting outside clinic",
      "url": "https://apnews.com/article/israel-gaza-hamas-palestinians-war-news-07-10-2025-ca29a1cbf0293764de9a8376333643ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/2b30e4a/2147483647/strip/true/crop/5103x2870+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F16%2F54b328569e518e361d209928702b%2F89c809a9029a417bbd3ad4041ff938ff"
    },
    {
      "author": null,
      "description": "Palestinian activist Mahmoud Khalil, whose role in campus protests against Israel led to his detention for over three months in immigration jail, is now seeking $20 million in damages from the Trump administration. His lawyers filed a claim Thursday, alleging false imprisonment and malicious prosecution after his March arrest by federal agents. Khalil, a legal U.S. resident, said he suffered severe anguish in jail, and continues to fear for his safety. The government has accused him of leading protests aligned with Hamas, but has not provided any evidence of a link to the terror group.",
      "publishedAt": "2025-07-10T17:30:32Z",
      "title": "Columbia protester Mahmoud Khalil files $20M claim against Trump administration",
      "url": "https://apnews.com/article/mahmoud-khalil-ice-release-trump-columbia-protests-570f7af32010c16b1a00dd7e78f4c687",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a854db/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F0b%2F1707ee42dc801ea05ef3c0cc72fb%2F2842eafedc8b44c78b115a81aad738b8"
    },
    {
      "author": null,
      "description": "Stocks are off to a sluggish start on Wall Street, while Delta Air Lines led a rally in airline stocks after releasing a solid outlook for the rest of 2025. The S&P 500 slipped 0.1% in the first few minutes of trading Thursday. The Dow Jones Industrial Average edged down 28 points, or 0.1%, and the Nasdaq composite fell 0.1%. The Nasdaq, which is heavily weighted with big technology companies, set an all-time high the day before. Cereal maker WK Kellogg soared after agreeing to be acquired by Nutella maker Ferrero Group. Copper prices rose.",
      "publishedAt": "2025-07-10T04:37:20Z",
      "title": "Stocks slip on Wall Street even as Delta soars",
      "url": "https://apnews.com/article/financial-markets-tech-rally-6c4b36029125cb5dd0ee2eedbd0a238a",
      "urlToImage": "https://dims.apnews.com/dims4/default/584fca0/2147483647/strip/true/crop/4218x2373+0+220/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2F05%2F909bcf0e14a39f8f8b96874bda53%2Fd32f9dd768394ec89155ef61b717d760"
    },
    {
      "author": null,
      "description": "Italian confectioner Ferrero, known for brands like Nutella and Kinder, is buying the century-old U.S. cereal company WK Kellogg in a deal valued at approximately $3.1 billion. Kellogg was founded in Battle Creek, Michigan, in 1906. It makes Froot Loops, Special K, Frosted Flakes and Rice Krispies. Kellogg has been struggling with falling U.S. cereal consumption as consumers opt for protein bars and other products. But industry watchers say its large distribution network and relations with grocers are appealing to Ferrero. The deal still needs the approval of WK Kellogg's shareholders.",
      "publishedAt": "2025-07-10T13:08:04Z",
      "title": "Ferrero plans to buy century-old cereal maker WK Kellogg for $3 billion",
      "url": "https://apnews.com/article/kellogg-ferrero-cereal-chocolate-fruit-loops-a148780f0abe5ee39f1c5450204e41e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/77cbd46/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F44%2Ff054fd9d9eda9918e2ca65463aee%2F3b933c6a93964d22bf3b771826d1dc70"
    },
    {
      "author": null,
      "description": "Amanda Anisimova has upset No. 1-ranked Aryna Sabalenka 6-4, 4-6, 6-4 at Wimbledon to reach the first Grand Slam final of her career a little more than a year after taking a break from tennis because of burnout. Thursday’s match was the second major semifinal of the 13th-seeded Anisimova’s career. The American lost at that stage at the 2019 French Open at age 17. She took time off from the tour in May 2023 and said she had been struggling with her mental health for nearly a year. Anisimova will face either Iga Swiatek or Belinda Bencic on Saturday for the trophy.",
      "publishedAt": "2025-07-10T15:19:13Z",
      "title": "Anisimova upsets Sabalenka at Wimbledon, into 1st Slam final",
      "url": "https://apnews.com/article/wimbledon-women-sabalenka-anisimova-swiatek-bencic-00b68fdc5afc9287c6dd285bc7d888be",
      "urlToImage": "https://dims.apnews.com/dims4/default/2216d9e/2147483647/strip/true/crop/5103x2870+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F36%2F9e10f7ac201b095741fdcc4f6ce8%2F4b058e50f087455db6f90d61385349be"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}