{
  "articles": [
    {
      "author": "Chris Megerian, Farnoush Amiri",
      "description": "President Donald Trump is again banning people from countries his administration deems dangerous from coming to America. The travel ban issued Wednesday is a repeat of an order of his first administration that led to widespread confusion at airports. This version includes Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. The Republican president’s first travel ban was issued in 2017 and banned travel to the U.S. by citizens of seven predominantly Muslim countries. After legal challenges, the order was retooled until a version was upheld by the Supreme Court in 2018. Trump has said the initial ban was aimed at protecting the country.",
      "publishedAt": "2025-06-04T23:52:57Z",
      "title": "Trump announces travel ban affecting a dozen countries set to go into effect Monday",
      "url": "https://apnews.com/article/trump-travel-ban-adeaec442cb0f00f4f8a34d208118445",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3a24eb/2147483647/strip/true/crop/4228x2378+0+220/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F56%2F93656c591b5f21b0b81df4d87365%2F868792d3b05b4a26be43dc920cccd18d"
    },
    {
      "author": "Melanie Lidman, Natalie Melzer",
      "description": "Israel says it has recovered the bodies of two hostages taken in Hamas’ Oct. 7, 2023, attack that ignited the war in the Gaza Strip. Prime Minister Benjamin Netanyahu said in a statement Thursday that the bodies of Judih Weinstein and Gad Haggai had been recovered and returned to Israel. Weinstein and Haggai, both in their early 70s, were talking a morning walk near their kibbutz when they were abducted. They were survived by four children and seven grandchildren.",
      "publishedAt": "2025-06-05T06:44:08Z",
      "title": "Israel says it has recovered the bodies of 2 hostages from the Gaza Strip",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostages-06-05-2025-017ad072824c251a570852a8a2ca374b",
      "urlToImage": "https://dims.apnews.com/dims4/default/83be630/2147483647/strip/true/crop/7971x4484+0+415/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F3a%2F9a39579a5631a3cea6b2bb457f03%2F31a704aec6ad4436a766654caad607ad"
    },
    {
      "author": "Hanna Arhirova, Michelle L. Price",
      "description": "President Donald Trump said Russian President Vladimir Putin told him “very strongly” in a phone call Wednesday that he will respond to Ukraine’s weekend drone attack on Russian airfields. The president said in a social media post that “It was a good conversation, but not a conversation that will lead to immediate Peace.” The call that lasted for an hour and 15 minutes was Trump’s first known with Putin since May 19. Trump said he and Putin also discussed Iran’s nuclear program.",
      "publishedAt": "2025-06-04T14:30:58Z",
      "title": "Trump says Putin told him that Russia will respond to Ukrainian attack",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-truce-peace-b211da51905cd117b913bc0fac658de3",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c85c3e/2147483647/strip/true/crop/8214x4620+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2Ff2%2Fc2b54242de9431efbebeb6b743a4%2F5e233c2ecc9c496ca2f9091939454b46"
    },
    {
      "author": null,
      "description": "The European Central Bank is cutting its benchmark interest rate for an eighth time, aiming to support businesses and consumers with more affordable borrowing as U.S. President Donald Trump’s trade war threatens to slow already tepid growth. The bank’s rate-setting council cut interest rates by a quarter of a point Thursday at the bank’s skyscraper headquarters in Frankfurt. Analysts expected a cut, given the gloomier outlook for growth since Trump announced a slew of new tariffs April 2.",
      "publishedAt": "2025-06-05T09:54:38Z",
      "title": "ECB cuts benchmark interest rate for 8th time",
      "url": "https://apnews.com/article/europe-trade-war-trump-ce797e9968df2af9fa5be449cc5ea30a",
      "urlToImage": "https://dims.apnews.com/dims4/default/23d8941/2147483647/strip/true/crop/7393x4159+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F6a%2F93ccad667abbbbdc8c096813b67b%2F67d265db9e0940da8d61ddca88410804"
    },
    {
      "author": "Lorne Cook",
      "description": "NATO defense ministers are set to approve plans to buy more weapons and military equipment to better defend Europe, the Arctic and North Atlantic. The “capability targets” are assigned to each of the 32 member countries and are part of a U.S. push to ramp up security spending. Priority purchases include air and missile defense systems, artillery, ammunition, drones and “strategic enablers” like air-to-air refueling, heavy air transport and logistics. NATO Secretary-General Mark Rutte said Thursday that the targets help fill “the gaps we have, not only to be able to defend ourselves today, but also three, five, seven years from now.\" U.S. Defense Secretary Pete Hegseth says that “to be an alliance, you’ve got to be more than flags.\"",
      "publishedAt": "2025-06-05T06:55:29Z",
      "title": "NATO is set to approve new military purchases as part of a major defense spending hike",
      "url": "https://apnews.com/article/nato-capability-targets-plans-defense-spending-trump-b123977c8f3c1bce277fb1b9957b1b78",
      "urlToImage": "https://dims.apnews.com/dims4/default/0b9a03b/2147483647/strip/true/crop/5124x2882+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2Fff%2Fa46f792d479214a1b967366f32c7%2Ff4be2dbfbeca440eae6306c64638a321"
    },
    {
      "author": null,
      "description": "President Donald Trump and Chinese counterpart Xi Jinping have spoken amid stalled negotiations between their countries over tariffs that have roiled global trade. The Chinese foreign ministry says Trump initiated the call. The White House hasn't commented. The discussion Thursday followed Trump suggesting it was tough to reach a deal with Xi. Trump posted Wednesday on social media he likes Xi but Xi “is VERY TOUGH, AND EXTREMELY HARD TO MAKE A DEAL WITH!!!” Trade negotiations between the United States and China stalled shortly after a May 12 agreement between both countries to reduce their tariff rates to have talks. Behind the gridlock has been the continued competition for an economic edge.",
      "publishedAt": "2025-06-05T13:02:18Z",
      "title": "Trump speaks with Xi amid stalled talks between US and China over tariffs",
      "url": "https://apnews.com/article/trump-china-xi-tariffs-negotiations-trade-f2e4b48205001d7169ee34250089d8c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/e76e99c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F07%2F8954d09e8ed15383df854f161c69%2F52995df6fc0d41d09b45b0ba1ecae428"
    },
    {
      "author": "Ayaka Mcgill",
      "description": "Eager customers have lined up outside electronics stores hours in advance in Tokyo to collect Nintendo’s much-anticipated Switch 2 video game consoles. The Switch 2 is an upgrade to its eight-year-old predecessor, with new social features meant to draw players into online gaming. The new consoles were sold through a competitive lottery system that Nintendo said got about 2.2 million applications in Japan alone. Outside the official draw, some retailers offered their own lottery to pre-order the devices. The new console comes with a larger and higher resolution screen than its predecessor, with improved processing power, offering smoother and more vivid graphics.",
      "publishedAt": "2025-06-05T08:56:28Z",
      "title": "Nintendo Switch 2 launch draws eager fans",
      "url": "https://apnews.com/article/japan-nintendo-switch-launch-gaming-8289bd5f6e8ad9c3950d07849e2bd1c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/67a68d8/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fd5%2F6665517e91e5f03179e8a0cb6e62%2F0e78f7a546074f36ac69fa8a9260ab3d"
    },
    {
      "author": null,
      "description": "Another ex-girlfriend who alleges she was abused by Sean “Diddy” Combs and forced to participate in drug-fueled sex marathons is expected to testify at the music mogul's sex trafficking trial in New York. The woman, testifying under the pseudonym “Jane,” is set to take the stand Thursday. She is one of several witnesses accusing Combs of violence toward them, including his former girlfriend, the R&B singer Casandra “Cassie” Ventura. Combs has pleaded not guilty to charges of running his business empire as a racketeering enterprise, allegedly using employees to enable and conceal the sexual and physical abuse of women over two decades.",
      "publishedAt": "2025-06-05T15:00:18Z",
      "title": "Diddy's ex-girlfriend 'Jane' is the next witness at his trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-aad8d02031e67364d84843d20efbe390",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4647be/2147483647/strip/true/crop/1753x986+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F65%2F54a13cb40ffdb216bd6ed466ed07%2Fab10451bb17d49dba8de0d66346e85fb"
    },
    {
      "author": null,
      "description": "A unanimous Supreme Court has made it easier to bring lawsuits over so-called reverse discrimination, siding with an Ohio woman who claims she didn’t get a job and was demoted because she's straight. The justices’ decision Thursday affects lawsuits in 20 states and the District of Columbia where, until now, courts had set a higher bar when members of a majority group, including those who are white and heterosexual, sue for discrimination under federal law. The court ruled in an appeal from Marlean Ames, who's worked for the Ohio Department of Youth Services for years. Justice Ketanji Brown Jackson says federal civil rights law draws no distinction between members of majority and minority groups.",
      "publishedAt": "2025-06-05T14:08:34Z",
      "title": "Supreme Court makes it easier to claim 'reverse discrimination' in employment",
      "url": "https://apnews.com/article/supreme-court-discrimination-lawsuit-ohio-205f07a2d47d7a46cfc96a5fefdf9269",
      "urlToImage": "https://dims.apnews.com/dims4/default/a519aa0/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F38%2F37255488e051ca68d07e2d0543d4%2F925c93a5304048459f79a7ffbd470f68"
    },
    {
      "author": null,
      "description": "Coco Gauff has reached her second final at Roland-Garros by beating Loïs Boisson 6-1, 6-2 to end the surprising, upset-filled run by a French wild-card entry who is ranked No. 361. The victory on Thursday by No. 2 Gauff sets up a blockbuster championship match against No. 1 Aryna Sabalenka. It will be just the second 1 vs. 2 women's final at the French Open in the last 30 years. Sabalenka got there by ending Iga Swiatek’s 26-match winning streak at the clay-court Grand Slam tournament. Sabalenka’s 7-6 (1), 4-6, 6-0 win in the semifinals prevents Swiatek from becoming the first woman to win four consecutive championships at Roland-Garros.",
      "publishedAt": "2025-06-05T15:33:56Z",
      "title": "Coco Gauff, Aryna Sabalenka set up 1 vs. 2 French Open final",
      "url": "https://apnews.com/article/french-open-semifinals-swiatek-sabalenka-gauff-boisson-fb2327785605efe1c59ff81db4b58fb7",
      "urlToImage": "https://dims.apnews.com/dims4/default/aa383c1/2147483647/strip/true/crop/8183x4603+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Fcd%2Ff73521751f299e39422a59f0025b%2F83bd588d70264eca9430ad6801c8f331"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}