{
  "articles": [
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — A 15-year-old student killed a teacher and another teenager with a handgun Monday at a Christian school in Wisconsin, terrifying classmates including a second grader who made the 911 call that sent dozens of police officers rushing to the small school just a week before its Christmas break.",
      "publishedAt": "2024-12-16T17:47:46Z",
      "title": "Teacher and a teenage student killed in a shooting at a Christian school in Wisconsin",
      "url": "https://apnews.com/498c8ad26d299602553201ad639a4a5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5523b8e22ab420b94bc62b81b80b327/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Two people were killed and others were injured Monday in a shooting at a private Christian school in Madison, Wisconsin.",
      "publishedAt": "2024-12-16T20:18:05Z",
      "title": "Things to know about the shooting at a Christian school in Wisconsin",
      "url": "https://apnews.com/3df4f40327e70aa863c4b5b36fd0a04b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5523b8e22ab420b94bc62b81b80b327/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A judge Monday refused to throw out President-elect Donald Trump’s hush money conviction because of the U.S.",
      "publishedAt": "2024-12-17T00:16:36Z",
      "title": "Judge rejects Trump’s bid to toss hush money conviction because of Supreme Court immunity ruling",
      "url": "https://apnews.com/908465ed0b7f2005c72226b5b2546260",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38871df356fe4eceba6c2dd3cb88250a/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and TARA COPP",
      "description": "KYIV, Ukraine (AP) — Ukraine’s military intelligence agency and the Pentagon said Monday that some North Korean troops have been killed during combat against Ukrainian forces in Russia’s Kursk border region.",
      "publishedAt": "2024-12-16T11:50:22Z",
      "title": "Ukraine and US say some North Korean troops have been killed fighting alongside Russian forces",
      "url": "https://apnews.com/33bf427736c5802fb97df41fdbf61396",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32c3dab2383d43569e011a317a00a715/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "After months of deadlock, Israel and Hamas appear to be moving closer toward a ceasefire to end their 14-month war.",
      "publishedAt": "2024-12-16T22:13:45Z",
      "title": "Negotiators say Israel and Hamas are inching toward a ceasefire deal. This is what it may look like",
      "url": "https://apnews.com/264087c7a547031a9433ecbbdcd920d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0e10fe5ddd24e558b9fa141f197f322/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and JILL COLVIN",
      "description": "PALM BEACH, Fla. (AP) — In a freewheeling press conference at his Mar-a-Lago club, President-elect Donald Trump said Monday he would consider pardoning embattled New York Mayor Eric Adams, declared the country was “not going to lose\" the polio vaccine and weighed in on the flurry of drone sightings over New Jersey.",
      "publishedAt": "2024-12-16T16:50:55Z",
      "title": "Trump weighs in on NY mayor, vaccines and drones in freewheeling press conference at Mar-a-Lago",
      "url": "https://apnews.com/44beea6cf8c93f070638842712bf3aca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b24a33acf87488591c1b99434408617/1920.jpeg"
    },
    {
      "author": "JOHN SEEWER and MARK SCOLFORO",
      "description": "Up in the sky, is that a drone, a plane or a helicopter?Experts who study unmanned aircraft systems — better known as drones — say it can be tough to tell from miles away.",
      "publishedAt": "2024-12-16T23:26:42Z",
      "title": "Is that a drone or a plane? Experts help explain the differences",
      "url": "https://apnews.com/57a0d051a2a94d21787089ceaf47b175",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bff3eae80fda46acbb80121ddfa9cf30/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — An Australian state government on Tuesday proposed new restrictions on protesters in response to rising antisemitism, including a ban on demonstrations outside places of worship.",
      "publishedAt": "2024-12-17T02:56:35Z",
      "title": "Australian state proposes ban on protests at places of worship to fight rising antisemitism",
      "url": "https://apnews.com/0df991f4df85c68a4b9cc49d8ec2c6d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cd74da3beef45108042790c49720dd6/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau faced the biggest test of his political career after Finance Minister Chrystia Freeland, long one of his most powerful and loyal ministers, resigned from the Cabinet on Monday.",
      "publishedAt": "2024-12-16T14:42:53Z",
      "title": "Canada's finance minister resigns as unpopular Trudeau faces biggest test of his political career",
      "url": "https://apnews.com/a8355a62870edd962fee8138dc6bfc77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc35a8328ac6446189512fa1209c1ac6/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — TikTok on Monday asked the Supreme Court to step in on an emergency basis to block the federal law that would ban the popular platform in the United States unless its China-based parent company agreed to sell it.",
      "publishedAt": "2024-12-16T20:27:25Z",
      "title": "TikTok asks the Supreme Court for an emergency order to block a US ban unless it's sold",
      "url": "https://apnews.com/101afd280e5018bc1296613517f041d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af5bd4c467994d769d0d85bce0ea3ce5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}