{
  "articles": [
    {
      "author": "SOPHIA TAREEN, JOEY CAPPELLETTI and LEA SKENE",
      "description": "CHICAGO (AP) — Protesters broke through a fence set up by police near the site of the Democratic National Convention on its opening day Monday as thousands took to the streets to voice their opposition to the war in Gaza.",
      "publishedAt": "2024-08-19T06:16:05Z",
      "title": "Protesters break through security fence near site of Democratic National Convention",
      "url": "https://apnews.com/87d32321eb5714e2005fe8410b928513",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd73264bf9a94898902fe9ff075c3ff8/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI, STEVE PEOPLES, ZEKE MILLER and BILL BARROW",
      "description": "CHICAGO (AP) — A refreshed Democratic Party gathered Monday night for a valedictory speech from President Joe Biden, whose decision to end his reelection bid released newfound energy with Vice President Kamala Harris ′ rise to the top of the ticket.",
      "publishedAt": "2024-08-19T04:06:05Z",
      "title": "Democrats will honor Biden while pivoting to Harris on first day of convention",
      "url": "https://apnews.com/0a0e65ab69a1e338d9c1f3f137a45e82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/828aeba5fe034711b63c36b78f7205a7/1920.jpeg"
    },
    {
      "author": "JILL COLVIN and ADRIANA GOMEZ LICON",
      "description": "YORK, Pa. (AP) — As Democrats kick off their convention in Chicago, Donald Trump is trying to regain his footing after weeks of struggling to adjust to Vice President Kamala Harris as his rival.",
      "publishedAt": "2024-08-19T04:08:53Z",
      "title": "Trump is visiting battleground states this week as he struggles to adjust to Harris as his new rival",
      "url": "https://apnews.com/48f5d991866e33af23e4494467240592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b73e55654154488ab45ae2ca6ff8b3a6/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — U.S. intelligence officials said Monday they were confident that Iran was responsible for the hack of Donald Trump's presidential campaign, casting the cyber intrusion as part of a brazen and broader effort by Tehran to interfere in American politics and undermine faith in democratic institutions.",
      "publishedAt": "2024-08-19T21:54:24Z",
      "title": "US intelligence officials say Iran is to blame for hacks targeting Trump, Biden-Harris campaigns",
      "url": "https://apnews.com/52641cd66412d7c01d73876acab3d989",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7f8e6630e0a43fb8b4cceaa060dc96f/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "TEL AVIV, Israel (AP) — U.S. Secretary of State Antony Blinken said Monday that Israel has accepted a proposal to bridge differences holding up a cease-fire and hostage release in Gaza, and he called on Hamas to do the same, without saying whether concerns cited by the militant group had been addressed.",
      "publishedAt": "2024-08-19T06:38:11Z",
      "title": "Blinken says Israel OKs a plan to break the cease-fire impasse and urges Hamas to do the same",
      "url": "https://apnews.com/34f91f99c9a4f63e98134aaecb7af971",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d03eeebfa084ee69cccfaa66229997a/1920.jpeg"
    },
    {
      "author": "ALEX BABENKO",
      "description": "POKROVSK, Ukraine (AP) — Civilians with small children in their arms and lugging heavy suitcases fled Monday from Ukraine’s eastern city of Pokrovsk, where the Russian army was bearing down fast despite a lightning Ukrainian incursion into Russia’s Kursk region.",
      "publishedAt": "2024-08-19T10:26:46Z",
      "title": "Civilians flee Pokrovsk as Russia's army bears down on the key eastern Ukraine city",
      "url": "https://apnews.com/b8c4c6cc0dd81658fecdf1c83145908d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf9c3337d8554a8395e7e61cfc437794/1920.jpeg"
    },
    {
      "author": "PHILIP MARCELO and MICHAEL R. SISAK",
      "description": "CENTRAL ISLIP, N.Y. (AP) — George Santos, who spun lies about his life into an 11-month stint in Congress, pleaded guilty Monday to wire fraud and aggravated identity theft in a case that led to his expulsion from office and the admission that he'd allowed ambition to cloud his judgment.",
      "publishedAt": "2024-08-19T04:13:33Z",
      "title": "George Santos pleads guilty, acknowledging lies and blaming ambition for conning his way to Congress",
      "url": "https://apnews.com/90741d068fd94090419fc0fd79be30cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68205667ea0342b080e14417a763c13f/1920.jpeg"
    },
    {
      "author": null,
      "description": "GALVESTON, Texas (AP) — The parents of a former student accused of killing 10 people in a 2018 school shooting near Houston cannot be held responsible for what happened, a jury decided Monday.",
      "publishedAt": "2024-08-19T04:16:37Z",
      "title": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligent",
      "url": "https://apnews.com/4405cb94df864c97ba46461f8aca4700",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bc31ff3440745c48124478dfff3909c/2400.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and ANDREA ROSA",
      "description": "PORTICELLO, Sicily (AP) — British tech magnate Mike Lynch and five other people were missing after their luxury superyacht sank during a freak storm off Sicily early Monday, Italy’s civil protection and authorities said.",
      "publishedAt": "2024-08-19T07:58:46Z",
      "title": "Search continues for British tech magnate and 5 others after luxury superyacht sinks off Sicily",
      "url": "https://apnews.com/060bf26f426708c8eb59e81d88787d11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2e5f4e0c8fa47008746c9a200e7c130/1920.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "Phil Donahue, whose pioneering daytime talk show launched an indelible television genre that brought success to Oprah Winfrey, Montel Williams, Ellen DeGeneres and many others, has died.",
      "publishedAt": "2024-08-19T13:56:16Z",
      "title": "Phil Donahue, whose pioneering daytime talk show launched an indelible television genre, has died",
      "url": "https://apnews.com/337b3630524a576407c1119f590d1dd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4398a071513e4cccb97a3b19bbb61464/2500.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}