{
  "articles": [
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — A day before a potential government shutdown, the House resoundingly rejected President-elect Donald Trump's new plan Thursday to fund operations and suspend the debt ceiling, as Democrats and dozens of Republicans refused to accommodate his sudden demands.",
      "publishedAt": "2024-12-19T16:26:07Z",
      "title": "House rejects Trump-backed plan on government shutdown, leaving next steps uncertain",
      "url": "https://apnews.com/e4b5c93d12838d180740a35daecc118d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/530150e32ac945eb94cc44c83ea2c7eb/1920.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "A debate over the debt ceiling is at the center of a dispute over funding that is pushing Washington to the brink of a federal government shutdown.President-elect Donald Trump has demanded that a provision raising or suspending the nation's debt limit — something that his own party routinely resists — be included in legislation to avert a government shutdown.",
      "publishedAt": "2024-12-19T20:16:11Z",
      "title": "What to know about the debt ceiling debate as a government shutdown looms in Washington",
      "url": "https://apnews.com/22ff94a8f8b188c722ff8fab3f7093d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e352c419e76f45969f82271d8d4e918c/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER, GIOVANNA DELL'ORTO and TODD RICHMOND",
      "description": "MADISON, Wis. (AP) — The Wisconsin 15-year-old who shot and killed a teacher and a fellow student Monday was only in her first semester at the school but seemed to be settling in, a school official said Thursday as families of the victims remembered them as people of faith who had deep connections within the Christian school.",
      "publishedAt": "2024-12-19T21:03:47Z",
      "title": "Official says Wisconsin shooter was new student at Christian school where her victims had deep ties",
      "url": "https://apnews.com/32ef21b182db91a097dfffa317dfec53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/378f7cf32b794b40965ce1b8fb40e8a6/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, LARRY NEUMEISTER and MARK SCOLFORO",
      "description": "NEW YORK (AP) — The man accused of killing UnitedHealthcare’s CEO was whisked back to New York by plane and helicopter Thursday to face new federal charges of stalking and murder, which could bring the death penalty if he's convicted.",
      "publishedAt": "2024-12-19T06:07:46Z",
      "title": "Man accused in UnitedHealthcare CEO killing faces federal charge that's eligible for death penalty",
      "url": "https://apnews.com/d6575764b6f4c58108e505e6e5ea896d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28d83043e89f4e578f1dac1aa1c9a4a2/1920.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ AND ELLIOT SPAGAT",
      "description": "McALLEN, Texas (AP) — U.S. Immigration and Customs Enforcement deported more than 270,000 people to 192 countries over a recent 12-month period, the highest annual tally in a decade, according to a report released Thursday that illustrates some of the financial and operational challenges that President-elect Donald Trump will face to carry out his pledge of mass deportations.",
      "publishedAt": "2024-12-19T22:24:19Z",
      "title": "Immigration agency deports highest numbers since 2014, aided by more flights",
      "url": "https://apnews.com/e09b2f8b9eb5e91ebc8f143748f0021a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a06cdeb8b3454ea987dfaa8b53f17b14/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A state appeals court on Thursday removed Fulton County District Attorney Fani Willis from the Georgia election interference case against Donald Trump and others, the latest legal victory for the president-elect in criminal cases that once threatened his career and freedom.",
      "publishedAt": "2024-12-19T14:59:49Z",
      "title": "Prosecutor Fani Willis is removed from the Georgia election case against Trump and others",
      "url": "https://apnews.com/0aa6db3b7abed22eb08ed9323f687972",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b9dcb53e31549d28c4b06e4c43864fb/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Amazon workers affiliated with the Teamsters union launched a strike at seven of the company's delivery hubs less than a week before Christmas.",
      "publishedAt": "2024-12-19T21:56:29Z",
      "title": "Amazon workers are striking at multiple delivery hubs. Here's what you should know",
      "url": "https://apnews.com/39b86c286d67219e42309566f3975cba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98b34582751f4442b5a45e4a2108197c/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and ISAIA MONTELIONE",
      "description": "When Pope Francis left the Vatican earlier this month for his traditional Christmastime outing downtown, he acknowledged what many Romans have been complaining about for months: That his big plans for a Holy Year had turned their city into a giant construction pit, with traffic-clogging roadworks tearing up major thoroughfares, scaffolding covering prized monuments and short-term rentals gobbling up apartment blocks.",
      "publishedAt": "2024-12-20T03:27:21Z",
      "title": "For some, the pope's big Holy Year only aggravates housing crisis as overtourism pushes out Romans",
      "url": "https://apnews.com/5c683bc7a905e0a9ec9274c64f786078",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/858027eb97644d8f9017543b7aaebedc/2048.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "A large number of mysterious drones have been reported flying over New Jersey and across the eastern U.S., sparking speculation and concern over where they came from and why.",
      "publishedAt": "2024-12-14T18:21:17Z",
      "title": "Mystery drone sightings continue in New Jersey and across the US. Here's what we know",
      "url": "https://apnews.com/e6f565f5d51d9d47ad140e7e7d131842",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5e8e598ddc64153a160fe9c93854ec2/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR and JAKE COYLE",
      "description": "‘Tis the season for spirited and winless debates about what the best Christmas movie is. No one needs us to remind you about the obvious holiday movies playing on repeat on cable, whether it's \"It's a Wonderful Life\", “Home Alone\" or “Love, Actually,\" or even those holiday adjacent classics like “Eyes Wide Shut” and “The Godfather.” But perhaps you are looking to go beyond the obvious this year (sorry, “Christmas Story,\" “White Christmas” etc, etc).",
      "publishedAt": "2024-12-19T13:44:33Z",
      "title": "The best Christmas movies for every mood",
      "url": "https://apnews.com/1483b45d748a303df3efd2e547870bc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75c6667068ce44daaa35d3dd23ce6b12/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}