{
  "articles": [
    {
      "author": "TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "TEL AVIV, Israel (AP) — Israel's Cabinet was set to convene Thursday to discuss Hamas' latest response to a U.S.-backed proposal for a phased cease-fire in Gaza, as diplomatic efforts aimed at ending the nine-month war stirred back to life after a weekslong hiatus.",
      "publishedAt": "2024-07-04T10:53:47Z",
      "title": "Israel weighs Hamas' latest response to Gaza cease-fire proposal as diplomatic efforts are revived",
      "url": "https://apnews.com/c4f97c1ebfb2d8941f58c4651d4776e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/008958a7ee29413287968a08375a2ad4/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — The Lebanese Hezbollah group said it launched over 200 rockets on Thursday at several military bases in Israel in retaliation for a strike that killed one of its senior commanders. The attack by the Iran-backed militant group was one of the largest in the monthslong conflict along the Lebanon-Israel border, with tensions escalating in recent weeks.",
      "publishedAt": "2024-07-04T09:20:50Z",
      "title": "Hezbollah fires over 200 rockets into Israel after killing of senior commander",
      "url": "https://apnews.com/5358640d72d7bbbe59b1a0f21dc713ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b44023092024cefa5897ce42941cf02/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — British voters are picking a new government Thursday in a parliamentary election that is widely expected to bring the Labour Party to power against a gloomy backdrop of economic malaise, mounting distrust in institutions and a fraying social fabric.",
      "publishedAt": "2024-07-04T04:01:31Z",
      "title": "Labour is hopeful and Conservatives morose as voters deliver their verdict on UK's election day",
      "url": "https://apnews.com/3c89a7974f05748943adfbebf03d3db6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bda0ad9d515648e2aae92e54b11116bf/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, ZEKE MILLER, MICHAEL BALSAMO, AAMER MADHANI and SYLVIE CORBET",
      "description": "WASHINGTON (AP) — President Joe Biden's conduct behind closed doors, in the Oval Office, on Air Force One and in meetings around the world is described in the same dual way by those who regularly see him in action.",
      "publishedAt": "2024-07-03T23:59:06Z",
      "title": "Biden at 81: Often sharp and focused but sometimes confused and forgetful",
      "url": "https://apnews.com/7c366fda83a697265d9ecc77e8a32fd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cef2001ae8e4805919ae707bc95829d/3000.jpeg"
    },
    {
      "author": "MELISSA GOLDIN",
      "description": "Former President Donald Trump on Tuesday misrepresented in a social media post what the U.S. Supreme Court’s Monday ruling on presidential immunity means for his civil and criminal cases.",
      "publishedAt": "2024-07-03T20:01:47Z",
      "title": "FACT FOCUS: Trump wasn’t exonerated by the presidential immunity ruling, even though he says he was",
      "url": "https://apnews.com/f5ee8ff71d2153da3efbf7bb0818d249",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d59e6eb9c78b43968a4778c2aa7938ed/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — A spokesperson for Ukraine’s military said its army has retreated from a neighborhood in the outskirts of Chasiv Yar, a strategically important town in the eastern Donetsk region which has been reduced to rubble under a months-long Russian assault.",
      "publishedAt": "2024-07-04T10:26:19Z",
      "title": "Ukraine’s army retreats from positions as Russia gets closer to seizing strategically important town",
      "url": "https://apnews.com/889d04cd5b88754771dfd51c888c9079",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f687145059dc4221ad57c3e256c88583/3000.jpeg"
    },
    {
      "author": "MARTÍN SILVA and FERNANDO LLANO",
      "description": "PLAYA DEL CARMEN, Mexico (AP) — Hurricane Beryl ripped off roofs in Jamaica, jumbled fishing boats in Barbados and damaged or destroyed 95% of homes on a pair of islands in St. Vincent and the Grenadines before rumbling toward the Cayman Islands and taking aim at Mexico's Caribbean coast after leaving at least seven dead in its wake.",
      "publishedAt": "2024-07-04T04:48:13Z",
      "title": "Hurricane Beryl roars toward Mexico after leaving destruction in Jamaica and eastern Caribbean",
      "url": "https://apnews.com/04eda74885bbe45ae3630e2ca713ef92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fbace3055d8428b98830ee24d3ea2b4/1920.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "The age question for presidential candidates is more than four decades old. President Ronald Reagan answered it with a pledge to resign if he became impaired, and later with a clever joke that reset his campaign from a stumbling debate performance to a 49-state landslide and a second term.",
      "publishedAt": "2024-07-04T04:00:53Z",
      "title": "The questions about Biden's age and fitness are reminiscent of another campaign: Reagan's in 1984",
      "url": "https://apnews.com/292069ac97df6841ae84c215e63c84ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/110fdbaa6b6d45229e85c1b57923b7c0/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "Many Americans weren't letting worries about their pocketbooks keep them from traveling and enjoying fireworks as they celebrate their nation’s birth with parades, cookouts and fiery splashes of colors against the evening sky.",
      "publishedAt": "2024-07-04T04:07:05Z",
      "title": "Americans to celebrate Fourth of July with parades, cookouts — and lots of fireworks",
      "url": "https://apnews.com/602108ca0e195ca52479d37cc1c04b9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8fb4a6ce5a74cd6a5ddaf6eaf74edf1/3000.jpeg"
    },
    {
      "author": null,
      "description": "BERLIN (AP) — The Swifties are about to take over the German city formerly known as Gelsenkirchen, where American superstar Taylor Swift is set to give three Eras Tour concerts later this month.In honor of the singer, the city has renamed itself “Swiftkirchen\" — at least temporarily — to welcome the tens of thousands of fans who are expected to come for her shows on July 17, 18 and 19, German news agency dpa reported.",
      "publishedAt": "2024-07-04T10:55:33Z",
      "title": "With Taylor Swift heading to Germany, one city has taken her name — at least for a few weeks",
      "url": "https://apnews.com/63a8cf1b2c6e7bcc44d09c00839e1b29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42f1da45f35e421196e7c6fbd5bc98c5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}