{
  "articles": [
    {
      "author": "DAN MERICA, GARANCE BURKE and ALI SWENSON",
      "description": "WASHINGTON (AP) — With the 2024 election looming, the first since the mass popularization of generative artificial intelligence, experts feared the worst: social media flooded with AI-generated deepfakes that were so realistic, baffled voters wouldn’t know what to believe.",
      "publishedAt": "2024-09-21T04:03:10Z",
      "title": "AI is helping shape the 2024 presidential race. But not in the way experts feared",
      "url": "https://apnews.com/256282c31fa9316c4059f09036c70fa9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/033c5eb12c2a405583bc3059ff60b96f/3000.jpeg"
    },
    {
      "author": "SEJAL GOVINDARAO",
      "description": "PHOENIX (AP) — The Arizona Supreme Court unanimously ruled Friday that nearly 98,000 people whose citizenship documents hadn’t been confirmed can vote in state and local races, a significant decision that could influence ballot measures and tight legislative races.",
      "publishedAt": "2024-09-21T01:18:47Z",
      "title": "Court rules nearly 98,000 Arizonans whose citizenship hadn't been confirmed can vote the full ballot",
      "url": "https://apnews.com/15703fd0ee76359af0eb1b7539df1cc7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6df1067e1634ac8857c91413357a11d/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli airstrike in Beirut killed at least 14 people and wounded dozens more, Lebanese health officials said.",
      "publishedAt": "2024-09-20T11:21:00Z",
      "title": "Israel-Hamas war latest: Israel strikes Beirut after Hezbollah rockets land in northern Israel",
      "url": "https://apnews.com/03ffd81ceb3afc8737fbfbb2c89413ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/471a932fa11d4897a02e7ea3d86637ff/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration is taking a more hands-off approach than usual during a week of dramatic escalation between Israel and Hezbollah militants in Lebanon, with top U.S.",
      "publishedAt": "2024-09-21T04:03:32Z",
      "title": "The US is more hands-off than usual in the Middle East. It fears making things worse",
      "url": "https://apnews.com/8d80f42131c5b5af88fffe9ca85fc725",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96bb4428fa3b4b76bd57fadc7e701837/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN and KAREEM CHEHAYEB",
      "description": "GENEVA (AP) — Human rights advocates are calling for an independent investigation into the deadly explosions of pagers and walkie-talkies in Lebanon and Syria, suggesting the blasts may have violated international law if the devices were fashioned as booby traps.",
      "publishedAt": "2024-09-20T19:11:02Z",
      "title": "Did Middle East device attack violate international law? Advocates want an investigation",
      "url": "https://apnews.com/1d0044e23cdb902036884e66e8fea086",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/edd1ab09d2d540e69f12a1dcdba2ca5b/2067.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "AVIGNON, France (AP) — The trial of dozens of men accused of raping an unconscious woman whose husband repeatedly drugged her over the course of nearly a decade has highlighted the difficulties that sexual violence victims can face in France.",
      "publishedAt": "2024-09-21T04:07:53Z",
      "title": "Shocking rape trial highlights the systematic struggles French sexual abuse victims face",
      "url": "https://apnews.com/3b82c8b9df2e402b301e3c93d07849a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74a08c20a4ba4c4396a16ab6ef57a699/3000.jpeg"
    },
    {
      "author": "KRISHAN FRANCIS, SHEIKH SAALIQ and BHARATHA MALLAWARACHI",
      "description": "COLOMBO, Sri Lanka (AP) — Sri Lankans began voting Saturday in a presidential election that will determine the course of the country's recovery from its worst economic crisis and resulting political upheaval.",
      "publishedAt": "2024-09-21T01:33:18Z",
      "title": "Sri Lankans vote in a presidential election that will decide how it recovers from economic crisis",
      "url": "https://apnews.com/600aca821db3f86e3eb37adbb89f74bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1847558b4ed4eb798b70d31d17e97b8/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI and CHARLOTTE GRAHAM-McLAY",
      "description": "JAKARTA, Indonesia (AP) — The New Zealand pilot who’s been held hostage for more than a year in the restive Papua region has been freed by separatist rebels, Indonesian authorities said Saturday.",
      "publishedAt": "2024-09-21T04:18:41Z",
      "title": "Separatist rebels release New Zealand pilot after 19 months in Indonesia's Papua region",
      "url": "https://apnews.com/9c6e448d35bc09cd4de9c7a6d6172076",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a313985766c492b980c35f25006ba49/1440.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "COLUMBIA, S.C. (AP) — South Carolina put inmate Freddie Owens to death Friday as the state restarted executions after an unintended 13-year pause because prison officials couldn’t get the drugs needed for lethal injections.",
      "publishedAt": "2024-09-20T04:03:08Z",
      "title": "South Carolina inmate dies by lethal injection in state’s first execution in 13 years",
      "url": "https://apnews.com/0e15aef91dfe9ac9667264dce7df0193",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e26ed86722e34aa8915289efdbce7e70/1920.jpeg"
    },
    {
      "author": "BRUCE SCHREINER and DYLAN LOVAN",
      "description": "WHITESBURG, Ky. (AP) — Residents of a tiny Appalachian town struggled Friday to cope with a shooting involving two of its most prominent citizens: a judge who was gunned down in his courthouse chambers and a local sheriff charged with his murder.",
      "publishedAt": "2024-09-20T14:53:58Z",
      "title": "Tiny Kentucky town is rocked as their sheriff is jailed in the killing of a prominent judge",
      "url": "https://apnews.com/d8df59f414023489527e9aef49f4c8cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddcff12f77024ab2971cce88ed53da58/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}