{
  "articles": [
    {
      "author": "JONATHAN J. COOPER, MICHELLE L. PRICE and GABRIEL SANDOVAL",
      "description": "PHOENIX (AP) — Robert F. Kennedy Jr. suspended his independent campaign for the White House and endorsed Donald Trump on Friday, a late-stage shakeup of the race that could give the former president a modest boost from Kennedy’s supporters.",
      "publishedAt": "2024-08-23T03:29:03Z",
      "title": "RFK Jr. suspends his presidential bid and backs Donald Trump before appearing with him at his rally",
      "url": "https://apnews.com/a2638f89ddcb5de03edbe4574ca17d45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2342a1f581954110a01b0fe5333430a9/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Young girls screamed and elbowed each other in a crush of bodies in southern Gaza, trying desperately to reach the front of the food line. Men doled out rice and chicken as fast as they could, platefuls of the nourishment falling to the ground in the tumult.",
      "publishedAt": "2024-08-24T06:07:30Z",
      "title": "Israeli evacuation orders cram Palestinians into shrinking 'humanitarian zone' where food is scarce",
      "url": "https://apnews.com/f4833f8faf3cdb683e2ddd964767b438",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63b64adf9edd4af3ac1c5973baf40365/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Fires broke out Friday on a Greek-flagged oil tanker previously attacked by Yemen's Houthi rebels this week, with the vessel now appearing to be adrift in the Red Sea, authorities said.",
      "publishedAt": "2024-08-23T16:42:56Z",
      "title": "Fires break out on abandoned Greek-flagged oil tanker Sounion that Yemen rebels attacked in Red Sea",
      "url": "https://apnews.com/9eb36bb2450b986bb677d67a32ec5ef0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/301d189df31d4474a726a31a77c62227/1920.jpeg"
    },
    {
      "author": "ALI SWENSON, FARNOUSH AMIRI and GARY FIELDS",
      "description": "CHICAGO (AP) — Before dropping his bid for reelection, President Joe Biden framed voters’ choice in November in dark and ominous terms, painting Republican nominee Donald Trump as a menace to American democracy and questioning whether the country could survive if he won.",
      "publishedAt": "2024-08-24T04:06:34Z",
      "title": "Harris isn’t backing away from Biden’s democracy focus. But she’s putting her own spin on it",
      "url": "https://apnews.com/f156ff565ec70f1b0ada8f295869271f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24d0035ff2ba4c748c909f9736ec651f/3000.jpeg"
    },
    {
      "author": "MARTHA IRVINE",
      "description": "CHICAGO (AP) — Bearded and bespectacled, YM Masood has a quiet nature that suggests he's older than age 20. A political science major, he plans to graduate from college in December, well ahead of schedule.",
      "publishedAt": "2024-08-24T04:10:45Z",
      "title": "Portrait of a protester: Outside the Democratic convention, a young man talks of passion and plans",
      "url": "https://apnews.com/b08b13802194c245e6a40a1b9be657a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c67f11911694e9eb0c2f6d6e2e54e45/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Conflicting federal policies may force thousands of residents in flood-prone areas to pay more for flood insurance or be left unaware of danger posed by dams built upstream from their homes and worksites, according to an Associated Press review of federal records and data.",
      "publishedAt": "2024-08-24T04:12:43Z",
      "title": "Conflicting federal policies may cost residents more on flood insurance, and leave them at risk",
      "url": "https://apnews.com/05637fd8a49e4ddcc080981d776e59e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/351474b61e2e4e42831699a431c62420/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and STEPHANIE LIECHTENSTEIN",
      "description": "SOLINGEN, Germany (AP) — Special police units on Saturday joined the search for an unknown man who carried out a stabbing attack at a crowded festival in the western German city of Solingen, killing three people and wounding at least eight others, five of them seriously.",
      "publishedAt": "2024-08-24T06:38:10Z",
      "title": "German police scour a western city for a knife attacker who killed 3 at a community festival",
      "url": "https://apnews.com/84ad7df23ca5ecc8c2145d57e75090d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59f3007d67004be3ab305d5b9d3c0705/1920.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — Shohei Ohtani is baseball's fastest 40-40 man.The Japanese superstar blasted a two-out grand slam in the ninth inning for his 40th homer after earlier stealing his 40th base, lifting the Los Angeles Dodgers to a 7-3 win over the Tampa Bay Rays on Friday night.",
      "publishedAt": "2024-08-24T03:19:04Z",
      "title": "Ohtani hits grand slam in 9th inning, becomes fastest player in MLB history to join 40-40 club",
      "url": "https://apnews.com/95275537b52aa8334aa06dd9589671ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/625bc18d0c43429d9aa5fdfc9edebc0d/2452.jpeg"
    },
    {
      "author": "BARBARA SURK",
      "description": "Two weeks after French star swimmer Léon Marchand extinguished the Olympic flame to close the Paris Olympics, the spotlight is now on its Paralympic counterpart.",
      "publishedAt": "2024-08-24T06:09:15Z",
      "title": "Under sea and over land, the Paris Paralympics flame is beginning an exceptional journey",
      "url": "https://apnews.com/9d776abdf8b3a84f464e82073ea60d49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85fc776dae894468b399d6b79a39de6d/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "BIXBY, Okla. (AP) — Oklahoma's Bixby school district has lots to show off for a fast-growing Tulsa suburb: a state-of-the-art new high school set to open by 2025, a new ninth grade gymnasium and plans for a $12 million upgrade to a football complex that already rivals that of many small colleges.",
      "publishedAt": "2024-08-24T04:06:04Z",
      "title": "Oklahoma teachers were told to use the Bible. There's resistance from schools as students return",
      "url": "https://apnews.com/19e235a16d9aefd350df9106a5d759b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a3fd299caff413a96ff9e11a177aea8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}