{
  "articles": [
    {
      "author": "MELANIE LIDMAN, NAJIB JOBAIN and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — Israel and Hamas agreed Thursday to extend their cease-fire by another day, just minutes before it was set to expire. Any further renewal of the truce in Gaza appeared increasingly difficult as most women and children held by the militants have already been released in swaps for Palestinian prisoners.",
      "publishedAt": "2023-11-30T06:10:08Z",
      "title": "Truce in Gaza extended another day but talks over remaining hostages held by Hamas could get tougher",
      "url": "https://apnews.com/ea1a8fad4e2f4a394e5427a7c5815d38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/433c7028ee5841a2b5e57f4e3fc17496/1920.jpeg"
    },
    {
      "author": "NANCY BENAC",
      "description": "WASHINGTON (AP) — All these years later, the scene still is almost too bizarre to imagine: a tearful president and his perplexed aide, neither very religious, kneeling in prayer on the floor of a White House bedroom in the waning hours of a shattered presidency.",
      "publishedAt": "2023-11-30T05:04:32Z",
      "title": "Henry Kissinger was a trusted confidant to President Nixon until the bitter, bizarre end",
      "url": "https://apnews.com/d760662fa0b911ed86333c219cee77e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9835bac5ec674741bd7f3397bed9daad/1920.jpeg"
    },
    {
      "author": "FOSTER KLUG and GEIR MOULSON",
      "description": "TOKYO (AP) — Global leaders paid tribute to former U.S. Secretary of State Henry Kissinger on Thursday, but there was also sharp criticism of the man who remained an influential figure decades after his official service as one of the most powerful diplomats in American history.",
      "publishedAt": "2023-11-30T03:35:01Z",
      "title": "Global leaders pay tribute to Henry Kissinger, but his record also draws criticism",
      "url": "https://apnews.com/4e98e88ae257d21603924651c75a383d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a661416637b4436291ad6c03f71ea6d5/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI and TARA COPP",
      "description": "TOKYO (AP) — Japan suspended flights by its Osprey aircraft Thursday, officials said, the day after a U.S. Air Force Osprey based in Japan crashed into the sea during a training mission. Tokyo has also asked the U.S.",
      "publishedAt": "2023-11-30T02:08:18Z",
      "title": "Japan suspends its Osprey flights after the fatal crash of a US Air Force aircraft",
      "url": "https://apnews.com/be23b708b16a3d3202a944424b7558c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5605b21753f34011ab4364dfb50bbe45/3000.jpeg"
    },
    {
      "author": "FOSTER KLUG",
      "description": "CHEORWON, South Korea (AP) — To the steady rat-tat-tat of machine guns and exploding bursts of smoke, amphibious tanks slice across a lake not far from the big green mountains that stand along the world’s most heavily armed border.",
      "publishedAt": "2023-11-30T01:10:45Z",
      "title": "South Koreans want their own nukes. That could roil one of the world’s most dangerous regions",
      "url": "https://apnews.com/543e85e5e6832c50ba9dc26a91ef071b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6c8506cab7d46d8952bb1a56c92bd53/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "DUBAI, United Arab Emirates (AP) — The Middle East plays host to its second straight U.N. climate conference over the next two weeks, with countries hoping to agree on new ways to keep the planet from heating too much by the end of the century.",
      "publishedAt": "2023-11-30T05:08:39Z",
      "title": "A look at what to expect as latest UN climate talks get under way in oil-rich UAE",
      "url": "https://apnews.com/df60c0f31eda51aed0cc7fbc88ff2447",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87b2f305408447308432e1ca8363be9d/3000.jpeg"
    },
    {
      "author": "COURTNEY BONNELL and JOSH BOAK",
      "description": "LONDON (AP) — The OPEC oil cartel led by Saudi Arabia and allied producers including Russia will try to agree Thursday on cuts to the amount of crude they send to the world, with prices having tumbled lately despite their efforts to prop them up.",
      "publishedAt": "2023-11-30T05:02:33Z",
      "title": "OPEC+ suppliers struggle to agree on cuts to oil production even as prices tumble",
      "url": "https://apnews.com/b7e7be4f92afc9ad1ba35830aa0da818",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2423f17afc44120b8077a8757aecd16/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, THOMAS BEAUMONT and HOLLY RAMER",
      "description": "DES MOINES, Iowa (AP) — Florida Gov. Ron DeSantis and former United Nations Ambassador Nikki Haley are increasingly outsourcing central parts of their campaigns, drawing on the growing urgency of Donald Trump opponents to find a single alternative to the former president.",
      "publishedAt": "2023-11-30T05:14:35Z",
      "title": "Haley and DeSantis are relying more on outside campaign groups with time running out to stop Trump",
      "url": "https://apnews.com/f2128c30b26e064fa42ba9c6004df732",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d76f49040fc54ba98b2eeff9c4903e48/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER and ASHOK SHARMA",
      "description": "NEW YORK (AP) — An Indian government official directed a plot to assassinate a prominent Sikh separatist leader living in New York City, United States prosecutors said Wednesday as they announced charges against a man they said was part of the thwarted conspiracy.",
      "publishedAt": "2023-11-29T10:24:51Z",
      "title": "An Indian official plotted to assassinate a Sikh separatist leader in New York, US prosecutors say",
      "url": "https://apnews.com/69968608495e33e8ed88a86bff71b381",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98fb5d173d9a442894fe1567c018751d/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — In the depths of captivity, they formed an unlikely but prized friendship. And reunited in a video call this week, the bond between a recently freed Israeli mother and daughter and a Thai woman who had been held hostage alongside them filled an Israeli hospital room with unbridled joy.",
      "publishedAt": "2023-11-30T09:14:11Z",
      "title": "A friendship forged over 7 weeks of captivity lives on as freed women are reunited",
      "url": "https://apnews.com/12500b311693e2dd156e00a7cb5870d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bf653405af64abb9ce4474a6521d403/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}