{
  "articles": [
    {
      "author": "JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The man accused of killing UnitedHealthcare's CEO has been charged with murder as an act of terrorism, prosecutors said Tuesday as they worked to bring him to a New York court from a Pennsylvania jail.",
      "publishedAt": "2024-12-17T20:28:30Z",
      "title": "Suspect charged with killing UnitedHealthcare's CEO as an act of terrorism",
      "url": "https://apnews.com/fccc9e875e976b9901a122bc15669425",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e2ae7a1e94a4927a718cdbadc64ede0/2667.jpeg"
    },
    {
      "author": "DEVI SHASTRI and SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — The motive for a shooting that killed a teacher and a student and wounded others at a Wisconsin school appears to be a “combination of factors,” a police chief said Tuesday as he appealed to the public to share what they might know about the 15-year-old girl who attacked a study hall before shooting herself.",
      "publishedAt": "2024-12-17T05:17:11Z",
      "title": "Police chief says motive for Wisconsin school shooting was a 'combination of factors'",
      "url": "https://apnews.com/a8e1ee353d7fdab2b86dfb355938d871",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/378f7cf32b794b40965ce1b8fb40e8a6/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — A couple hundred North Korean troops fighting alongside Russian forces against Ukraine have been killed or wounded during battle in the Kursk border region, a senior military official said Tuesday.",
      "publishedAt": "2024-12-17T22:24:11Z",
      "title": "A couple hundred North Korean troops killed, wounded in battles with Ukrainian forces",
      "url": "https://apnews.com/a1207ba61ded5061f721ffa0f0650851",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/461aa1978fe347928fca89bc1ab1641c/2323.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congressional leaders have unveiled a stopgap spending bill that will keep the federal government funded through March 14 and provide more than $100 billion in emergency aid to help states and local communities recover from Hurricanes Helene and Milton and other natural disasters.",
      "publishedAt": "2024-12-17T17:52:24Z",
      "title": "Congress unveils funding deal with more than $100 billion in disaster aid",
      "url": "https://apnews.com/4c6ae1e0033637bb6398b00c4799ba0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41ad759a230643ec9b606b44c2554def/3000.jpeg"
    },
    {
      "author": "ELAINE KURTENBACH",
      "description": "BANGKOK (AP) — Japanese automakers Nissan Motor Corp. and Honda Motor Co. confirmed Wednesday that they are discussing closer collaboration but denied reports they have decided on a merger. Nissan’s share price soared more than 22% in Tokyo after reports citing unnamed sources said it might merge with Honda to form the world’s third-largest automaking group.",
      "publishedAt": "2024-12-18T03:48:38Z",
      "title": "Nissan, Honda confirm talks on closer collaboration but say there's been no decision on a merger",
      "url": "https://apnews.com/56199be5bf5b99b0c739acfb1a9244dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb5d6b2847124e348902bf339d98b0ae/2250.jpeg"
    },
    {
      "author": "MARTHA BELLISLE",
      "description": "The secretary general of the International Biathlon Union apologized to any athlete who was mistreated during his tenure at U.S. Biathlon while speaking to a 90-minute meeting Tuesday that focused on concerns about athlete safety brought to light by multiple Associated Press reports.",
      "publishedAt": "2024-12-18T01:49:17Z",
      "title": "Biathlon official apologizes to athletes who have suffered mistreatment",
      "url": "https://apnews.com/3c51491dfeadcfad93630bf442b6d5a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48b276794c4348bebc24d398c001bd26/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN and RICK CALLAHAN",
      "description": "MICHIGAN CITY, Ind. (AP) — An Indiana man convicted in the 1997 killings of his brother and three other men was set to receive a lethal injection by early Wednesday in the state's first execution in 15 years, without any independent witness present under the state's laws shielding information about the death penalty.",
      "publishedAt": "2024-12-17T05:15:14Z",
      "title": "Man who killed brother and 3 others set to be put to death in Indiana's first execution in 15 years",
      "url": "https://apnews.com/de652ee2b3ecf6f4e1f9f83e3b68a047",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0741e6514f1f4ce5aceabd938a07791d/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Rayful Edmond, a drug kingpin once believed to control about a third of the cocaine trade in the nation’s capital during the crack epidemic of the 1980s, has died in federal custody, the Bureau of Prisons confirmed Tuesday.",
      "publishedAt": "2024-12-18T02:40:20Z",
      "title": "Rayful Edmond, notorious DC drug kingpin, dies in federal custody at 60",
      "url": "https://apnews.com/95c6cd0114006bb25b32a96ae4dc39eb",
      "urlToImage": ""
    },
    {
      "author": "DAVID BAUDER",
      "description": "President-elect Donald Trump sued the Des Moines Register and its pollster for “brazen election interference” in publishing a survey the weekend before the election that showed Democrat Kamala Harris with a surprising lead of three percentage points in the state.",
      "publishedAt": "2024-12-17T20:27:46Z",
      "title": "Trump sues Des Moines Register, pollster for 'election interference' after pre-election poll",
      "url": "https://apnews.com/09698af51779943e13ffdc680e4fdbd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f85b067238ac4666887ea812ae146e38/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Prime Minister Benjamin Netanyahu said Tuesday that Israeli forces will stay in a buffer zone on the Syrian border, seized after the ouster of Syria's President Bashar Assad, until another arrangement is in place “that ensures Israel's security.”",
      "publishedAt": "2024-12-17T16:38:39Z",
      "title": "Netanyahu says Israeli troops will occupy a buffer zone inside Syria for the foreseeable future",
      "url": "https://apnews.com/4d7f0b35e08d5e853c776193272fb2d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0e147fc1a1a41f0b519be165553733c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}