{
  "articles": [
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "ALBUQUERQUE, N.M. (AP) — A bag of Cheetos gets dropped and left on the floor. Seems inconsequential, right?Hardly.Rangers at Carlsbad Caverns National Park in southern New Mexico describe it as a “world-changing” event for the tiny microbes and insects that call this specialized subterranean environment home.",
      "publishedAt": "2024-09-12T12:03:17Z",
      "title": "A bag of Cheetos created a huge impact on a national park ecosystem",
      "url": "https://apnews.com/04f30c48dfa7fa3deee29702e083aa56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07b9ae567f2849bba06eda15bce788c4/1466.jpeg"
    },
    {
      "author": "BILL BARROW, CHRIS MEGERIAN, JONATHAN J. COOPER and GARY D. ROBERTSON",
      "description": "CHARLOTTE (AP) — Kicking off a day of battleground campaigning by Kamala Harris and Donald Trump, the Democratic vice president is highlighting her support from Republicans who have endorsed her and emphasizing her defense of abortion rights and heath care access.",
      "publishedAt": "2024-09-12T04:09:29Z",
      "title": "Harris tries to pull away swing-state voters from Trump by highlighting Republican endorsements",
      "url": "https://apnews.com/34bca16175c387a076131ad69bc18d47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/621836f883fc4320adc83ad9a21e9e62/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Justice Department is preparing criminal charges in connection with an Iranian hack that targeted Donald Trump's presidential campaign in a bid to shape the outcome of the November election, two people familiar with the matter said Thursday.",
      "publishedAt": "2024-09-12T22:05:25Z",
      "title": "The US is preparing criminal charges in Iran hack targeting Trump, AP sources say",
      "url": "https://apnews.com/9e4870739885399ccad9dae900ae43d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa765acfad8641d38eb75641becd5be9/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — The judge overseeing the Georgia election interference case against Donald Trump and others on Thursday tossed out three counts in the indictment — including two counts brought against the former president — saying that they lie beyond the state’s jurisdiction.",
      "publishedAt": "2024-09-12T20:48:33Z",
      "title": "Judge tosses some counts in Georgia election case against Trump and others",
      "url": "https://apnews.com/32c6cbcb02de94a166567b15365d82ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60ef4b1d63e242dcae917a14d879c16d/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WARSAW (AP) — U.S. Secretary of State Antony Blinken wrapped up a three-nation, Ukraine-focused European tour in Poland on Thursday after hearing repeated appeals from Ukrainian officials to use Western-supplied weaponry for long-range strikes inside Russia.",
      "publishedAt": "2024-09-12T08:50:37Z",
      "title": "Blinken wraps up Ukraine-focused Europe trip in Poland with arms requests on the table",
      "url": "https://apnews.com/54232b14cae7785df02f9d48a77e7823",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a40c0ad222f45798b614bce108b017a/3000.jpeg"
    },
    {
      "author": "PATRICK AFTOORA ORSAGOS, MIKE CATALINI and JULIE CARR SMYTH",
      "description": "SPRINGFIELD, Ohio (AP) — The father of an Ohio boy killed last year when a Haitian immigrant driver hit a school bus is imploring Donald Trump and other politicians to stop invoking his son's name in the debate about immigration.",
      "publishedAt": "2024-09-12T17:42:01Z",
      "title": "Father of Ohio boy asks Trump not to invoke his son's death in immigration debate",
      "url": "https://apnews.com/d119b387175434c08597784ba82860ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/808db39cf78e49c0bfdbee403eb1fa16/1920.jpeg"
    },
    {
      "author": "DIDI TANG and ELSIE CHEN",
      "description": "WASHINGTON (AP) — The U.S. House this week approved a sweeping package of bills to counter China's influence, shoring up a largely bipartisan push to ensure America comes out ahead in the competition between the world's superpowers.",
      "publishedAt": "2024-09-12T20:02:37Z",
      "title": "US House clears a largely bipartisan package of bills to counter China",
      "url": "https://apnews.com/b5a56798058c7bd823280eecebf59c65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c90a1f41598b4f0cbfb14d47fae553db/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and JAMIE STENGLE",
      "description": "U.S. Border Patrol agents who rushed to the school shooting in Uvalde, Texas in 2022 failed to establish command and had inadequate training to confront what became one of the nation’s deadliest classroom attacks, according to a federal report released Thursday.",
      "publishedAt": "2024-09-12T20:21:42Z",
      "title": "Border Patrol response to Uvalde school shooting marred by breakdowns and poor training, report says",
      "url": "https://apnews.com/090d36868527e0dc3626cfe2ab87831a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10827e54a7014760a3a11d266b868c23/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — New York City lawmakers approved legislation Thursday to study the city's significant role in slavery and consider reparations to descendants of enslaved people.If signed into law, the package of bills passed by the City Council would follow in the footsteps of several other municipalities across the U.S.",
      "publishedAt": "2024-09-12T21:35:00Z",
      "title": "New York City lawmakers approve bill to study slavery and reparations",
      "url": "https://apnews.com/5a9a707552b782c25df1ab2375bc6be8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09b177b8975b47daa75df731b58e623f/3000.jpeg"
    },
    {
      "author": "ADAM GELLER and JALAL BWAITEL",
      "description": "JENIN, West Bank (AP) — In the web of battered, sun-baked streets winding up the hillside, bloodshed is as unrelenting as the heat. So it is not hard to see why, when raid sirens and gunfire erupted yet again on a morning in late May, 15-year-old Mahmoud Hamadneh turned his bike down an alley that held out the promise of refuge.",
      "publishedAt": "2024-09-12T11:03:25Z",
      "title": "As war rages in Gaza, Israel’s crackdown on West Bank insurgency is killing Palestinian youths",
      "url": "https://apnews.com/852c8a636713ed0d99956f0ec7504ecc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3485734a0eaa45cd91e8934c209aba9e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}