{
  "articles": [
    {
      "author": "LISA MASCARO, ZEKE MILLER, MICHAEL BALSAMO and AAMER MADHANI",
      "description": "WASHINGTON (AP) — Democrats at the highest levels are making a critical push for President Joe Biden to reevaluate his election bid, with former President Barack Obama expressing concerns to allies and Speaker Emerita Nancy Pelosi privately telling Biden the party could lose the ability to seize control of the House if he doesn’t step away from the 2024 race.",
      "publishedAt": "2024-07-18T05:33:53Z",
      "title": "Obama, Pelosi and other Democrats make a fresh push for Biden to reconsider 2024 race",
      "url": "https://apnews.com/3f9e3d15431fd4974771a54e1d0e4ea7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bda4e437589b4da9a6062825033969c0/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The 20-year-old Pennsylvania man who tried to assassinate Donald Trump had photos on his phone of the former Republican president, President Joe Biden and other officials, including Attorney General Merrick Garland and FBI Director Chris Wray, according to two people familiar with the matter.",
      "publishedAt": "2024-07-18T17:20:54Z",
      "title": "Rally shooter had photos of Trump, Biden and other US officials on his phone, AP sources say",
      "url": "https://apnews.com/2a90bdfd23ba9c3569cb9c29a459e87b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/589dd71e5faa4610affeca162abda3d0/3000.jpeg"
    },
    {
      "author": "MICHAEL SISAK and MARYCLAIRE DALE",
      "description": "FREEPORT, Pa. (AP) — Thousands of mourners filed into a Pennsylvania banquet hall Thursday to remember the former fire chief who was fatally shot during the attempted assassination of former President Donald Trump, who sent a note of condolence hailing him as a hero.",
      "publishedAt": "2024-07-18T04:22:13Z",
      "title": "Thousands gather at banquet hall to celebrate life of former fire chief killed at Trump rally",
      "url": "https://apnews.com/8c09711e88a56432424ef3f980321ed2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e7a6f5b35224f07b35eaaba6253f4f7/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, JONATHAN J. COOPER and JILL COLVIN",
      "description": "MILWAUKEE (AP) — Just five days after surviving an assassination attempt, Donald Trump is set to address the Republican National Convention on Thursday to accept his party's presidential nomination in a speech designed to unify his party — and the nation — behind his third consecutive White House bid.",
      "publishedAt": "2024-07-18T11:03:25Z",
      "title": "Trump, in highly personal speech, will accept GOP nomination again days after assassination attempt",
      "url": "https://apnews.com/5f1f337ac39477e9d1c53d3e027edda3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/939a62af12d24854a0cf277d130b1fae/1920.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Bob Newhart, the deadpan accountant-turned-comedian who became one of the most popular TV stars of his time after striking gold with a classic comedy album, has died at 94.",
      "publishedAt": "2024-07-18T19:53:12Z",
      "title": "Comedian Bob Newhart, deadpan master of sitcoms and telephone monologues, dies at 94",
      "url": "https://apnews.com/799460b72b3c47e7aaf4eeb246f00b8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b15132eae27c42438b7117f124f5b85f/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu made a surprise visit to troops in southern Gaza on Thursday, saying it was essential that Israel keep control of a strip of territory along the territory's border with Egypt, just days before he was set to give a speech to the U.S.",
      "publishedAt": "2024-07-18T06:40:16Z",
      "title": "Israel's Netanyahu makes surprise Gaza visit as far-right politician tours flashpoint Jerusalem site",
      "url": "https://apnews.com/f92f49c9f2254702f07a6a2af677c89e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51021bf023a34f50a32a66cb9f6415bf/3000.jpeg"
    },
    {
      "author": "PAUL WEBER and VALERIE GONZALEZ",
      "description": "AUSTIN, Texas (AP) — Employees of the largest housing provider for unaccompanied migrant children in the U.S. repeatedly sexually abused and harassed children in their care for at least eight years, the Justice Department said Thursday, alleging a shocking litany of offenses that took place as the company amassed billions of dollars in government contracts.",
      "publishedAt": "2024-07-18T18:47:15Z",
      "title": "Largest housing provider for migrant children engaged in pervasive sexual abuse, U.S. says",
      "url": "https://apnews.com/0bfd45735aa6d41a4233abe6059f0e1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f54fc405b79b445cae229c3f9bd548fb/3000.jpeg"
    },
    {
      "author": "KIRILL ZARUBIN and EMMA BURROWS",
      "description": "YEKATERINBURG, Russia (AP) — Closing arguments in the espionage trial of U.S. journalist Evan Gershkovich will be held Friday, a court said, as the proceedings in Russia's highly politicized legal system picked up speed in a case that has seen the reporter held behind bars for over a year.",
      "publishedAt": "2024-07-18T06:32:38Z",
      "title": "Closing arguments in espionage trial of Wall Street Journal reporter will be Friday, court says",
      "url": "https://apnews.com/fcc03e6ec79f5a9a8a2cded213ec3edc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57d5802e530d486d89fc61ab75b6a894/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — Police and government supporters clashed Thursday with student activists trying to shut down transportation across Bangladesh as part of dayslong protests over the allocation of government jobs, and media reports said 19 people died in the violence.",
      "publishedAt": "2024-07-18T07:47:49Z",
      "title": "19 more die in Bangladesh clashes as student protesters try to impose a 'complete shutdown'",
      "url": "https://apnews.com/09879fc7539bc2a9daf7cdd4b2cb1776",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7343c6ab198f42f986bfca1618c92cdd/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "CHILLICOTHE, Mo. (AP) — The Missouri Supreme Court has cleared the way for the release of a Missouri woman whose murder conviction was overturned after she served 43 years in prison, but she still remained in custody as of Thursday evening.",
      "publishedAt": "2024-07-18T16:39:00Z",
      "title": "Missouri high court clears the way for a woman's release after 43 years in prison",
      "url": "https://apnews.com/e20d285cef54c227167a290f39fd4b68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0c401c011974b81b6de21a95737b375/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}