{
  "articles": [
    {
      "author": "Jim Morris, Claire Rush, Rob Gillies",
      "description": "Murder charges have been filed against a suspect in a weekend car ramming attack that killed 11 people at a Filipino heritage festival in Vancouver. Hundreds attended vigils Sunday across the city for the victims and the Canadian prime minister visited the site on the eve of a federal election. Prosecutors have charged a 30-year-old man with eight counts of second degree murder and say more charges are possible. Investigators have ruled out terrorism and say he has a history of mental health issues. Those killed were between the ages of 5 and 65. Dozens were injured when a man driving an SUV struck people attending the Lapu Lapu Day festival on Saturday.",
      "publishedAt": "2025-04-28T04:07:41Z",
      "title": "Vancouver ramming attack suspect charged with murder as hundreds attend vigils for victims",
      "url": "https://apnews.com/article/canada-vancouver-filipino-festival-deaths-car-4bf1d6ba8963af0ee4f17257674cda39",
      "urlToImage": "https://dims.apnews.com/dims4/default/e806f22/2147483647/strip/true/crop/5121x2881+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2Fec%2F4d97e3efd17541432f517e07bc81%2F3d8a7608088b4f3898e677a5201259bc"
    },
    {
      "author": "Hannah Schoenbaum, Claire Rush",
      "description": "Vancouver's Filipino community is mourning after a man rammed his black Audi SUV into the crowd at a Filipino heritage festival, killing 11 people and injuring dozens. The British Columbia Prosecution Service has charged Kai-Ji Adam Lo, 30, with eight counts of second degree murder and says more charges were possible. The victims range in age from 5 to 65. Police say the suspect has a history of mental health issues. Attendees, vendors and other witnesses say they are struggling to process the trauma. Vancouver's Interim Police Chief Steve Rai has proclaimed Saturday “the darkest day in Vancouver’s history.”",
      "publishedAt": "2025-04-28T04:09:43Z",
      "title": "How people witnessed the 'darkest day in Vancouver' when a car slammed into a crowded festival",
      "url": "https://apnews.com/article/canada-vancouver-filipino-festival-deaths-car-d60b9ad5d3b7dbf58e4b086f72e23eea",
      "urlToImage": "https://dims.apnews.com/dims4/default/84d5bcc/2147483647/strip/true/crop/5509x3099+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F3a%2Fb3e3df8fef582b92b688d32f6c8c%2Fc44f23bdce38455ea4e2fa0bf1d28ca4"
    },
    {
      "author": "Jon Gambrell",
      "description": "Yemen’s Houthi rebels say an alleged U.S. airstrike that hit a prison holding African migrants killed at least 30 people. That’s according to the Houthis’ al-Masirah satellite news channel on Monday. There was no immediate independent confirmation of the death toll and the U.S. military has not acknowledged conducting the strike in Yemen’s Saada governorate, a stronghold of the Houthis. Some 100 prisoners were held at the site, the news channel said. Graphic footage aired by al-Masirah showed what appeared to be dead bodies and others wounded there.",
      "publishedAt": "2025-04-28T02:06:33Z",
      "title": "Houthi rebels say alleged US airstrike that hit prison holding migrants kills at least 30 people",
      "url": "https://apnews.com/article/yemen-houthis-rebels-us-airstrikes-israel-hamas-gaza-287d8e969bc33fbe34d33bba32f4ad80",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb4da0c/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F3e%2F24b447739d4dc847ce185d31fd14%2F2019fecef2e74f339b016cbb3cf80f01"
    },
    {
      "author": "Sarah El Deeb, Mohammed Jahjouh, Lee Keath",
      "description": "Israel’s military campaign decimating the Gaza Strip has made pregnancy and childbirth more dangerous for Palestinian women and their babies. It’s become worse since Israel seven weeks ago cut off food, medicine and supplies for the territory’s more than 2 million people. According to the United Nations Population Fund, up to 20% of Gaza’s estimated 55,000 pregnant women are malnourished, and half face high-risk pregnancies. In February and March, at least 20% of newborns were born prematurely or suffering from complications or malnutrition. Comprehensive records of miscarriages and stillbirths can’t be obtained. But records at one hospital show miscarriages in January and February were double the same period in 2023.",
      "publishedAt": "2025-04-28T05:01:32Z",
      "title": "Pregnancy and childbirth risks are increasing in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-pregnancy-childbirth-816e743a4d9ef190f55d03bd01b9881d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b298408/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fee%2F1dcb06c92fa48dbdd260d595f44a%2F7f06302c9c7c4bbab3f66e0704da2ab8"
    },
    {
      "author": "Vanessa Gera",
      "description": "The Vatican is closing the Sistine Chapel to the public as part of its preparations for the the conclave to elect the next pope after the death of Pope Francis. The date for the conclave has not yet been set but it can only begin after a nine-day period of mourning. When it does, the scarlet-robed cardinals will enter solemnly to participate in a secretive process said to be guided by the holy spirit that will result in the selection of the next leader of the 1.4 billion-strong Catholic church. For inspiration they will also have the great beauty of the frescos painted by Michelangelo and other renowned Renaissance artists.",
      "publishedAt": "2025-04-28T04:08:09Z",
      "title": "The Vatican closes the Sistine Chapel to the public and prepares for a papal conclave",
      "url": "https://apnews.com/article/vatican-sistine-chapel-conclave-27a32119a225f7aff20cfe3619124b75",
      "urlToImage": "https://dims.apnews.com/dims4/default/cce4ea5/2147483647/strip/true/crop/2040x1148+0+93/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2F66%2F697c97dc004adeb6d3e16e694409%2F9ae7d857afd742c1a744dec16178b458"
    },
    {
      "author": null,
      "description": "North Korea has confirmed for the first time that it has dispatched troops to Russia to support its war against Ukraine. U.S., South Korean and Ukraine intelligence officials have said North Korea last fall sent about 10,000-12,000 troops to Russia. But North Korea hadn’t until Monday confirmed its troops’ movements. North Korea’s state-run Korean Central News Agency said leader Kim Jong Un decided to send combat troops to Russia under a mutual defense treaty. It cited Kim as saying that the troops’ deployment was meant to “annihilate and wipe out the Ukrainian neo-Nazi occupiers and liberate the Kursk area in cooperation with the Russian armed forces.”",
      "publishedAt": "2025-04-27T23:42:38Z",
      "title": "North Korea confirms dispatch of troops to Russia to support its war against Ukraine",
      "url": "https://apnews.com/article/north-korea-south-korea-russia-ukraine-war-34716db67af6176d0d5e0ebf1b887881",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "John Raby",
      "description": "Authorities say more than 100 immigrants suspected of being in the United States illegally were taken into custody during a raid at an illegal after-hours nightclub in Colorado Springs, Colorado. Video posted online by the Drug Enforcement Administration showed agents announcing their presence outside the building early Sunday. DEA special agent in charge John Pullen says the club has been under investigation for several months for alleged activities including drug trafficking, prostitution and “crimes of violence.” Pullen says U.S. Immigration and Customs Enforcement took the immigrants into custody. Also among those detained were a dozen active-duty military service members who either were patrons or were working as armed security.",
      "publishedAt": "2025-04-27T18:30:56Z",
      "title": "More than 100 immigrants detained at an illegal after-hours nightclub in Colorado",
      "url": "https://apnews.com/article/colorado-nightclub-raid-immigration-c0e46855c2a8b18d532560f12158e394",
      "urlToImage": "https://dims.apnews.com/dims4/default/10ccbed/2147483647/strip/true/crop/4868x2738+14+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F74%2Fe74d33ddd1ed94bc8964cb18f88b%2Fda72bde3fbb74076a2fdbaffd4738ac5"
    },
    {
      "author": "Jake Offenhartz",
      "description": "A New York City woman says she feared for her life as she was chased, kicked and pelted with objects by a mob of men who mistook her as a participant in a protest against Israel’s far-right security minister. The incident Thursday night near the Brooklyn headquarters of the Chabad-Lubavitch movement happened as an appearance by Itamar Ben-Gvir set off clashes between pro-Palestinian activists and members of the neighborhood’s large Orthodox Jewish community. The woman has told The Associated Press she wasn't involved in the protests but walked by because she was curious. Police eventually drove her to safety.",
      "publishedAt": "2025-04-28T04:12:50Z",
      "title": "Mob chased Brooklyn woman after mistaking her for protester at speech by Israeli security minister",
      "url": "https://apnews.com/article/itamar-bengvir-brooklyn-mob-woman-chased-090da170e8800307c54e2520320f6a2c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Nina Schwendemann, Brian Inganga",
      "description": "Boys become warriors in an ancient initiation ceremony in Kenya’s Maasai community. This rite of passage is known as \"Enkipaata.\" It has been declared an Intangible Cultural Heritage by UNESCO but has had to adapt to modern times. The training was traditionally a year and involved. But now it's been condensed to a month time to coincide with school holidays. The latest cohort is made up of 900 teenage boys. This new generation of Maasai leaders faces unique challenges. Kenya’s 1.2 million Maasai people are profoundly affected both by climate change and the shrinking of the grazing land available to them both because of urbanization and agricultural expansion.",
      "publishedAt": "2025-04-28T04:11:10Z",
      "title": "A new generation of Maasai warriors is born in Kenya",
      "url": "https://apnews.com/article/kenya-massai-warriors-initiation-tribes-rites-5e7b274307ac79396a222dbfeae412fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/ac6f8b5/2147483647/strip/true/crop/7867x4425+0+410/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F0b%2F3a9262d5bc98672f57b6fe7c9bb0%2Fc7ea88b827ac45b08a5a4f552e7b7151"
    },
    {
      "author": "Mark Kennedy",
      "description": "First-time nominees Chubby Checker, Joe Cocker and Bad Company will be inducted into the Rock & Roll Hall of Fame. They're in a class that also includes pop star Cyndi Lauper, the hip-hop pioneers Outkast, the rock duo The White Stripes and grunge masters Soundgarden. Salt-N-Pepa, the first female rap act to achieve gold and platinum status, and the late singer-songwriter Warren Zevon will get the Musical Influence Award. The late record producer Thom Bell, pianist Nicky Hopkins and bassist Carol Kaye will each get the Musical Excellence Award. The induction ceremony will take place in Los Angeles this fall.",
      "publishedAt": "2025-04-28T00:40:32Z",
      "title": "Chubby Checker, Joe Cocker, Bad Company, Cyndi Lauper and Outkast get into Rock & Roll Hall of Fame",
      "url": "https://apnews.com/article/rock-hall-fame-2025-artists-8a7cde717004e0f459a382eb2e9bdb2c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b122c9/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F18%2Fa0a8737d3f11925986a96bc8dde8%2F8834b8716e4948288f4fda7f508914c0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}