{
  "articles": [
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes in Yemen on Thursday targeted the Houthi rebel-held capital of Sanaa and the port city of Hodeida, and the World Health Organization's director-general said the bombardment occurred as he was about to board a flight in Sanaa, injuring a crew member.",
      "publishedAt": "2024-12-26T06:34:41Z",
      "title": "Israel strikes against Houthi rebels in Yemen's capital, and WHO chief says he was 'meters' away",
      "url": "https://apnews.com/2e8c33648410c2da94ae7d0d73c0b1a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3f5e312cf5c41cd81721def593718a0/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "ATLANTA (AP) — Republicans plan to move quickly in their effort to overhaul the nation’s voting procedures, seeing an opportunity with control of the White House and both chambers of Congress to push through long-sought changes that include voter ID and proof-of-citizenship requirements.",
      "publishedAt": "2024-12-26T12:46:25Z",
      "title": "Trump has pressed for voting changes. GOP majorities in Congress will try to make that happen",
      "url": "https://apnews.com/88342cf09d01b0555851aa3d64c45432",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/785239cd44f143828e1abec71c44038e/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER and LINLEY SANDERS",
      "description": "NEW YORK (AP) — As a Democrat who immersed himself in political news during the presidential campaign, Ziad Aunallah has much in common with many Americans since the election. He's tuned out.“People are mentally exhausted,” said Aunallah, 45, of San Diego.",
      "publishedAt": "2024-12-26T12:04:03Z",
      "title": "Americans are exhausted by political news. TV ratings and a new AP-NORC poll show they're tuning out",
      "url": "https://apnews.com/b67aebae1a0853a1a3170ac588100bbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9fe661021624496a95e368cfc41cfd0/3000.jpeg"
    },
    {
      "author": "ELENA BECATOROS",
      "description": "EIN ZIVAN, Golan Heights (AP) — A dry mountain wind whipped through a cluster of Israeli flags at the entrance of a kibbutz in the Israeli-annexed Golan Heights, where the tranquility belies the tumultuous events unfolding nearby.",
      "publishedAt": "2024-12-26T05:05:03Z",
      "title": "Israel's plan to double the number of settlers in the Golan Heights is met with conflicting emotions",
      "url": "https://apnews.com/41341a9598e44afbdad77f1683c2407e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffb332d9b47e44bdb0cf30a37048d992/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "NEW YORK (AP) — What a wonderful year 2024 has been for investors.U.S. stocks ripped higher and carried the S&amp;P 500 to records as the economy kept growing and the Federal Reserve began cutting interest rates.",
      "publishedAt": "2024-12-26T12:00:53Z",
      "title": "How the stock market defied expectations again this year, by the numbers",
      "url": "https://apnews.com/5e8bddd4ca301d66480249b41b4836ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/710b6934cba74e9cb05a43fcda569aaa/3000.jpeg"
    },
    {
      "author": "CHARLES MANGWIRO",
      "description": "MAPUTO, Mozambique. (AP) — At least 6,000 inmates escaped from a high-security prison in Mozambique’s capital on Christmas Day after a rebellion, the country's police chief said, as widespread post-election riots and violence continue to engulf the country.",
      "publishedAt": "2024-12-26T13:22:40Z",
      "title": "6,000 inmates escape from a high-security prison in Mozambique amid post-election violence",
      "url": "https://apnews.com/c8e63a5b622316203371b2af258ded3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb9b84be92174684b3743b3d4d03c9dd/1920.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO and HALELUYA HADERO",
      "description": "Sales rose this year during the holiday shopping season even as Americans wrestled with elevated prices for many groceries and other necessities, according to new data.Holiday sales from the beginning of November through Christmas Eve climbed 3.8%, outpacing the 3.1% increase from a year earlier, according to Mastercard SpendingPulse, which tracks all kinds of payments including cash and debit cards.",
      "publishedAt": "2024-12-26T15:27:52Z",
      "title": "Holiday shoppers increased spending by 3.8% despite higher prices",
      "url": "https://apnews.com/0e11efb764f5ff0ad84ddb4505e17398",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ae17d23e6d6416fbf5eac20cb480f0b/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Azerbaijani airliner has crashed in Kazakhstan after being diverted, killing 38 of 67 people on board.",
      "publishedAt": "2024-12-26T11:35:16Z",
      "title": "What is known about a plane crash in Kazakhstan that killed 38 of 67 people on board",
      "url": "https://apnews.com/1e3ca32f895b577755b5776806e1eda7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d051a3d44ec742e1adb4b5ef1324c996/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis inaugurated his Holy Year at Rome’s main prison on Thursday, bringing a message of hope to inmates and involving them in the Catholic Church’s once every quarter-century celebration that is expected to bring about 32 million pilgrims to Rome.",
      "publishedAt": "2024-12-26T08:31:03Z",
      "title": "Pope brings Holy Year and prayers for better future to Rome prison, a 'cathedral of pain and hope'",
      "url": "https://apnews.com/a3e481931b8fd254e29725344dcefd8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/093c9635f18549fa9134274ea3656da1/1920.jpeg"
    },
    {
      "author": "DEEPA BHARATH and JESSIE WARDARSKI",
      "description": "MIRANDO CITY, Texas (AP) — The late Amada Cardenas was called many things — the “angel of peyote,” the “peyote rose” or simply “Grandma Amada.”The beloved Mexican American peyotera — who was the first authorized dealer of peyote in the United States — not only played a vital role in the history of the peyote trade, but was also revered as an elder and healer by Native American peyote people.",
      "publishedAt": "2024-12-26T13:15:43Z",
      "title": "Why this Mexican American woman played a vital role in the US sacramental peyote trade",
      "url": "https://apnews.com/d1a23bea0054904eef6759aa09b7f9ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c791f46a7c564afebd3607d0f9c05ec7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}