{
  "articles": [
    {
      "author": "BASSEM MROUE, KAREEM CHEHAYEB and TIA GOLDENBERG",
      "description": "TYRE, Lebanon (AP) — A ceasefire between Israel and the Lebanese militant group Hezbollah appeared to be holding Wednesday, as residents in cars heaped with belongings streamed back toward southern Lebanon despite warnings from the Israeli and Lebanese military that they stay away from certain areas.",
      "publishedAt": "2024-11-27T07:44:05Z",
      "title": "Israel-Hezbollah ceasefire appears to hold and Lebanese begin streaming south to their homes",
      "url": "https://apnews.com/f2c5ad31f5519f8dd368504e6634cd2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b5945f728144a7f97f4c025f053d275/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Long-displaced residents of south Lebanon started returning to their homes hours after a ceasefire between Israel and the Hezbollah militant group took effect early Wednesday morning.",
      "publishedAt": "2024-11-27T05:27:39Z",
      "title": "Middle East latest: Displaced people return to south Lebanon as ceasefire appears to hold",
      "url": "https://apnews.com/c86bbc47034ad517f04cf9ea63f0a145",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffe32f870c3d4ceeb243dea271480889/3000.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "A ceasefire deal that went into effect on Wednesday could end more than a year of cross-border fighting between Israel and Lebanon's Hezbollah militant group, raising hopes and renewing difficult questions in a region gripped by conflict.",
      "publishedAt": "2024-11-26T22:01:56Z",
      "title": "What to know about the ceasefire deal between Israel and Lebanon's Hezbollah",
      "url": "https://apnews.com/3ed296f8317ecaa89c4e3548c75c9602",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25e424f411f84186ad1ecc8de50a6b8a/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — In a Monday evening announcement, President-elect Donald Trump railed against Mexico and Canada, accusing them of allowing thousands of people to enter the U.S.Hitting a familiar theme from the campaign trail and his first term in office, Trump portrayed the country's borders as insecure and immigrants as contributing to crime and the fentanyl crisis.",
      "publishedAt": "2024-11-26T22:20:11Z",
      "title": "Trump vows tariffs over immigration. What the numbers say about border crossings, drugs and crime",
      "url": "https://apnews.com/1528ef9c04f786478184a279ad26abb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2696e379122d4b2a890ac639d3180ac6/1920.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE (AP) — The International Criminal Court’s chief prosecutor asked judges on Wednesday to issue an arrest warrant for the head of Myanmar’s military regime for crimes committed against the country’s Rohingya Muslim minority.",
      "publishedAt": "2024-11-27T08:51:37Z",
      "title": "ICC prosecutor requests arrest warrants for the head of Myanmar's military regime",
      "url": "https://apnews.com/1184ed9e6197bc4189feb8b22b9b4ee7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7b4c7fd62174d7c9fa540653d282f9d/1603.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — Authorities reopened roads linking Pakistan's capital with the rest of the country, ending a four-day lockdown, on Wednesday after using tear gas and firing into the air to disperse supporters of imprisoned former Prime Minister Imran Khan who marched to Islamabad to demand his release from prison.",
      "publishedAt": "2024-11-27T07:08:09Z",
      "title": "Pakistan ends lockdown of its capital after Imran Khan supporters are dispersed by police",
      "url": "https://apnews.com/b172154133ea27ae1e9cb4a6dea42a88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58bc97a75b2a49bdb8051fedbcca69b4/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "Last time Donald Trump was president, rumors of immigration raids terrorized the Oregon community where Gustavo Balderas was the school superintendent.",
      "publishedAt": "2024-11-27T05:11:28Z",
      "title": "Trump promised mass deportations. Educators worry fear will keep immigrants' kids from school",
      "url": "https://apnews.com/9747be35d2eb109693930f114f148b94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2ac8b246ccd4330acd8026db17581b5/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "LINCOLN CITY, Ore. (AP) — Drumming made the floor vibrate and singing filled the conference room of the Chinook Winds Casino Resort in Lincoln City, on the Oregon coast, as hundreds in tribal regalia danced in a circle.",
      "publishedAt": "2024-11-27T05:15:11Z",
      "title": "Long-sought court ruling restores Oregon tribe's hunting and fishing rights",
      "url": "https://apnews.com/ee2c9fd73c372298aa4d505e3c992761",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87a742f9aebf464b9f33da47ff40ee6a/3000.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "NORTHEAST HARBOR, Maine (AP) — When Donald Trump was elected president earlier this month, Caroline Pryor’s mind turned immediately to the man who lives down the road — Leonard Leo.",
      "publishedAt": "2024-11-27T05:03:47Z",
      "title": "Conservatives love him. Liberals disdain him. For residents of Maine town, it's more complicated",
      "url": "https://apnews.com/42c43a9da87fbde92170f06601519ce7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/109353b12b9e4d4385db23b3034342ae/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — The biggest November snowstorm to hit South Korea’s capital in more than a half century blanketed the capital on Wednesday, grounding hundreds of flights, disrupting commuter traffic and leaving at least two dead.",
      "publishedAt": "2024-11-27T05:38:55Z",
      "title": "Biggest November snowstorm in half century hits Seoul and grounds flights",
      "url": "https://apnews.com/235283f04bc17a171e94b476e82ffd8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52c3528cd4264daea4872818b63c5019/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}