{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — The World Food Program said Tuesday it has paused deliveries of food to isolated northern Gaza because of increasing chaos across the territory, hiking fears of potential starvation.",
      "publishedAt": "2024-02-20T07:35:18Z",
      "title": "Food deliveries into northern Gaza are halted because of the war's chaos, increasing famine risk",
      "url": "https://apnews.com/26d2afd9b81868c74ff2e4393692f91f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19697591478c49c5a3037274ff010889/1920.jpeg"
    },
    {
      "author": "RIO YAMAT and LINDSAY WHITEHURST",
      "description": "LAS VEGAS (AP) — A former FBI informant charged with making up a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company had contacts with Russian intelligence-affiliated officials, prosecutors said Tuesday.",
      "publishedAt": "2024-02-20T23:16:54Z",
      "title": "Ex-FBI informant charged with lying about Bidens had Russian intelligence contacts, prosecutors say",
      "url": "https://apnews.com/ef48c7543e7a45cd3b8b671d0e2f60e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/240cfb012400421f82f19697cee99c0f/3000.jpeg"
    },
    {
      "author": "NICK INGRAM and MARGERY A. BECK",
      "description": "KANSAS CITY, Mo. (AP) — Two men charged with murder in last week's shooting after the Kansas City Chiefs’ Super Bowl parade were strangers who pulled out guns and began firing within seconds of starting an argument, according to court documents released Tuesday.",
      "publishedAt": "2024-02-20T20:09:42Z",
      "title": "2 men are charged with murder in the deadly shooting at Kansas City's Super Bowl celebration",
      "url": "https://apnews.com/7cb29dc9956d325103df9bf766a0c407",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/472fe44100454bba9b915d8caf085574/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — The Supreme Court on Tuesday left in place the admissions policy at an elite public high school in Virginia that some parents claimed discriminates against highly qualified Asian Americans.",
      "publishedAt": "2024-02-20T14:58:58Z",
      "title": "The Supreme Court leaves in place the admissions plan at an elite Virginia public high school",
      "url": "https://apnews.com/bdac4a3d720c0355f9da1c9539b05c2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a079ac430db41118edc8424c842934d/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MEG KINNARD",
      "description": "GREENVILLE, S.C. (AP) — There are no wins on the horizon for Nikki Haley.Those close to the former United Nations ambassador, the last major Republican candidate standing in Donald Trump's path to the GOP's 2024 presidential nomination, are privately bracing for a blowout loss in her home state's primary election in South Carolina on Saturday.",
      "publishedAt": "2024-02-20T15:30:30Z",
      "title": "Nikki Haley hasn't yet won a GOP contest. But she's vowing to keep fighting Donald Trump",
      "url": "https://apnews.com/b1582a35c3617eee49b36288523a1ea6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6009165ae47647779dcc24cf4c33781a/1920.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "Divers have recovered the body of 11-year-old Audrii Cunningham from a Texas river days after the girl went missing, and authorities are preparing to file a murder charge against a friend of her father who lived on her family’s property, a sheriff said Tuesday afternoon.",
      "publishedAt": "2024-02-20T21:33:31Z",
      "title": "Divers find body in Texas river of Audrii Cunningham, 11-year-old girl missing since last week",
      "url": "https://apnews.com/e4a37d5077fc1ddb3cd27f6dcaadda88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/262bb46f14934f889d9425627ce9b3ef/1920.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "SALT LAKE CITY (AP) — Ruby Franke, a Utah mother of six who gave parenting advice to millions via a once-popular a YouTube channel, shared a tearful apology to her children for physically and emotionally abusing them before a judge delivered a sentence that could put her in prison for years, if not decades.",
      "publishedAt": "2024-02-20T17:26:07Z",
      "title": "YouTube mom Ruby Franke apologizes at sentencing in child abuse case",
      "url": "https://apnews.com/4f4985c1cab9243d4eaf8b6a58f087ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f552d0fea1e47849391369ef2bcb54c/1920.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — The Alabama Supreme Court has ruled that frozen embryos can be considered children under state law, a decision critics said could have sweeping implications for fertility treatment in the state.",
      "publishedAt": "2024-02-20T16:19:38Z",
      "title": "Alabama Supreme Court rules frozen embryos are 'children' under state law",
      "url": "https://apnews.com/161390f0758b04a7638e2ddea20df7ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/716b6b7041c04ff68452d83dc0f0f8aa/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Julian Assange's lawyers opened a final U.K. legal challenge Tuesday to stop the WikiLeaks founder from being sent to the United States to face spying charges, arguing that American authorities are seeking to punish him for exposing serious criminal acts by the U.S.",
      "publishedAt": "2024-02-20T05:18:16Z",
      "title": "WikiLeaks founder Assange faces his last legal roll of the dice in Britain to avoid US extradition",
      "url": "https://apnews.com/48e6786241f35064833e40060a90279a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47a9862a31524ce682d0fe60cc9f4572/3000.jpeg"
    },
    {
      "author": "KEN SWEET",
      "description": "NEW YORK (AP) — Americans have become increasingly reliant on their credit cards since the pandemic. So much so that Capital One is willing to bet more than $30 billion that they won't break the habit.",
      "publishedAt": "2024-02-20T21:21:27Z",
      "title": "Americans' reliance on credit cards is the key to Capital One's bid for Discover",
      "url": "https://apnews.com/76598912b86a2dadc0c39ab3229f2fe9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fce73348e79340b2a868110e84c106cc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}