{
  "articles": [
    {
      "author": "CHRISTINE FERNANDO, STEVE PEOPLES and JILL COLVIN",
      "description": "MILWAUKEE (AP) — Donald Trump's campaign chiefs designed the Republican convention opening this week to feature a softer and more optimistic message, focusing on themes that would help a divisive leader expand his appeal among moderate voters and people of color.",
      "publishedAt": "2024-07-15T11:11:03Z",
      "title": "Anger and anxiety loom over the Republican convention, but there is good news for Trump in court",
      "url": "https://apnews.com/58c09e396b79751c44baed14a1b432a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56be2fbeefb044fa8f8a9916b7374b30/1920.jpeg"
    },
    {
      "author": "JILL COLVIN and STEVE PEOPLES",
      "description": "MILWAUKEE (AP) — Former President Donald Trump said he plans to announce his vice presidential pick on Monday, the first day of the Republican National Convention.",
      "publishedAt": "2024-07-15T11:46:56Z",
      "title": "Trump is expected to pick his vice presidential nominee on Monday, first day of the GOP convention",
      "url": "https://apnews.com/6cc438a8370a21b2631f5a53b06b71d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/111c41ae4a5e4f8b8554b76d46ff9fb0/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Republican National Convention kicks off this week, with delegates and officials descending on Wisconsin amid the tumult that follows a Saturday assassination attempt on former President Donald Trump as he prepares to become the GOP’s official nominee.",
      "publishedAt": "2024-07-15T11:56:56Z",
      "title": "The Latest: Trump is expected to announce his VP pick as RNC begins",
      "url": "https://apnews.com/d86aeb42e5bc290c521ce94f5d49d899",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68328fcfdc034064a1a625c3152dca26/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "On a sweltering weekend evening, beneath a clear blue sky, Donald Trump supporters in red “Make America Great Again” hats packed the fairgrounds in Butler, Pennsylvania.It was a friendly and festive venue for the once and maybe future president's final rally before the Republican National Convention the following week.",
      "publishedAt": "2024-07-15T16:29:34Z",
      "title": "At the Trump rally, it was evening sun, songs and blue sky. Then came bullets, screams and blood",
      "url": "https://apnews.com/734900d303fcfbf349162047f8059601",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/251d527340f148e1beb9b02754047635/1920.jpeg"
    },
    {
      "author": "JAMES POLLARD",
      "description": "GALVESTON, Texas (AP) — Vacuums sucked the water out of the seaside inn run by Nick Gaido’s family in Galveston since 1911 as power was still spotty nearly one week after a resurgent Hurricane Beryl swept into Texas.",
      "publishedAt": "2024-07-15T05:13:23Z",
      "title": "In beachy Galveston, locals buckle down without power after Beryl's blow during peak tourist season",
      "url": "https://apnews.com/6e5d7dabb7ef03173fa6a70c1cb34619",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b695650a574049f794d2782a29710ffa/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and MELANIE LIDMAN",
      "description": "MUWASI, Gaza Strip (AP) — Hamas said Sunday that Gaza cease-fire talks were ongoing and the group’s military commander was in good health, a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials said killed at least 90 people, including children.",
      "publishedAt": "2024-07-14T13:45:44Z",
      "title": "Hamas says Gaza cease-fire talks haven't paused and claims military chief survived Israeli strike",
      "url": "https://apnews.com/728bb0842141ba246456422ebf93deb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3244e069d064628ab39974254b69e84/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The federal judge presiding over the classified documents case against former President Donald Trump in Florida dismissed the prosecution on Monday, siding with defense lawyers who said the special counsel who filed the charges was illegally appointed by the Justice Department.",
      "publishedAt": "2024-07-15T14:03:59Z",
      "title": "Federal judge dismisses Trump classified documents case over concerns with prosecutor's appointment",
      "url": "https://apnews.com/c66d5ffb7ba86c1b991f95e89bdeba0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/778cde0a188d4cb78e8d79ac6876921a/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — Scientists have confirmed a cave on the moon, not far from where Neil Armstrong and Buzz Aldrin landed 55 years ago, and suspect there are hundreds more that could house future astronauts.",
      "publishedAt": "2024-07-15T15:05:45Z",
      "title": "Scientists have confirmed a cave on the moon that could be used to shelter future explorers",
      "url": "https://apnews.com/2dc57751f41a6e24f377c2259e8668ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0861c6b3d9e0480dbbb707f905493c1e/3000.jpeg"
    },
    {
      "author": "DEREK GATOPOULOS and ANTON SHTUKA",
      "description": "NORTHERN UKRAINE (AP) — Struggling with manpower shortages, overwhelming odds and uneven international assistance, Ukraine hopes to find a strategic edge against Russia in an abandoned warehouse or a factory basement.",
      "publishedAt": "2024-07-15T04:10:32Z",
      "title": "From basement to battlefield: Ukrainian startups create low-cost robots to fight Russia",
      "url": "https://apnews.com/b07de714659ef859e16c51d7cda4256b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2362cd9028c4264baa6c7c8988198fe/3000.jpeg"
    },
    {
      "author": null,
      "description": "THE HAGUE, Netherlands (AP) — A giant panda has given birth to a cub at a Dutch zoo, in a boost to the captive population of the vulnerable mammals.Ouwehands Dierenpark announced Friday's birth on Monday, and released video of mom Wu Wen as she gave birth to her cub, whose gender has yet to be determined.",
      "publishedAt": "2024-07-15T15:02:43Z",
      "title": "A giant panda has given birth to a cub in a Dutch zoo, in a boost for the endangered mammals",
      "url": "https://apnews.com/067fa047b62136b1ee13143d93ad327f",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}