{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "LIVE OAK, Fla. (AP) — President Joe Biden on Saturday saw from the sky Hurricane Idalia's impact across a swath of Florida before he set out on a walking tour of a city recovering from the storm.",
      "publishedAt": "2023-09-02T04:03:22Z",
      "title": "Biden tells Idalia's Florida victims 'your nation has your back.' DeSantis rejects meeting with him",
      "url": "https://apnews.com/3ff2f44e6a314dfaf1e329fa10ac1b5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73786c8ad0794ad2a6d54fbe1e635c93/1920.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "A Florida redistricting plan pushed by Republican Gov. Ron DeSantis violates the state constitution and is prohibited from being used for any future U.S.",
      "publishedAt": "2023-09-02T22:09:35Z",
      "title": "DeSantis' redistricting map in Florida is unconstitutional and must be redrawn, judge says",
      "url": "https://apnews.com/d04d4d69a5c52e2997e94fa842f8757e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed1bc2ab03db495e9f226ced4589ec87/3000.jpeg"
    },
    {
      "author": null,
      "description": "RENO, Nev. (AP) — Thousands of Burning Man attendees trudged in sloppy mud on Saturday — many barefoot or wearing plastic bags on their feet — as flooding from storms swept through the Nevada desert, forcing organizers to close vehicular access to the counterculture festival.",
      "publishedAt": "2023-09-02T20:16:14Z",
      "title": "Thousands told to shelter in place at Burning Man fest in Nevada with access closed due to flooding",
      "url": "https://apnews.com/d6cd88ee009c6e1f6d2d92739ec1ca18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eeca78822834573a1795eb3b7c6dcde/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — Taiwan suspended flights, rail transport and ferry services along with classes, outdoor events, and officials urged workers to stay home as the island prepared for the arrival of Typhoon Haikui later Sunday.",
      "publishedAt": "2023-09-03T03:28:48Z",
      "title": "Taiwan suspends work, transport and classes as island braces for arrival of Typhoon Haikui",
      "url": "https://apnews.com/96100ee731a8175c37488e84812adcdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6ebd6e782b54ee69ac56a0f2543870f/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russia said Saturday its forces destroyed three Ukrainian naval drones being used in an attempt to attack a key bridge linking Russia to the Moscow-annexed Crimean Peninsula, forcing its temporary closure for a third time in less than a year.",
      "publishedAt": "2023-09-02T08:24:16Z",
      "title": "Russia says it thwarted attacks on Crimea bridge. Shelling and strikes leave at least 3 dead",
      "url": "https://apnews.com/be0a8f3cb98c278aa4cbb14f8588cae4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2c839dd2872495ebd5f01996a89d23e/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and SARUUL ENKHBOLD",
      "description": "ULAANBAATAR, Mongolia (AP) — With China's crackdown on religious minorities as a backdrop, Pope Francis joined Mongolian shamans, Buddhist monks and a Russian Orthodox priest Sunday to highlight the role that religions can play in forging world peace, as he presided over an interfaith meeting highlighting Mongolia's tradition of religious tolerance.",
      "publishedAt": "2023-09-03T03:42:09Z",
      "title": "Pope joins shamans, monks and evangelicals to highlight Mongolia's faith diversity, harmony",
      "url": "https://apnews.com/1d7cf3a3987b3565d00d0d8f5b43182c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78af66176b6d451894da7cf081edcc05/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Bill Richardson, a two-term Democratic governor of New Mexico and an American ambassador to the United Nations who dedicated his post-political career to working to secure the release of Americans detained by foreign adversaries, has died.",
      "publishedAt": "2023-09-02T16:39:49Z",
      "title": "Bill Richardson, a former governor and UN ambassador who worked to free detained Americans, dies",
      "url": "https://apnews.com/c1e6ed9705564452824d537293945662",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db9c1aa330534286a10b3f236a143b01/1904.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and CHRISTINE FERNANDO",
      "description": "COLUMBUS, Ohio (AP) — The wording of a proposed constitutional amendment on Ohio's fall ballot to ensure abortion rights seems straightforward: It would enshrine the right “to make and carry out one's own reproductive decisions.”",
      "publishedAt": "2023-09-02T12:25:46Z",
      "title": "An Ohio ballot measure seeks to protect abortion access. Opponents' messaging is on parental rights",
      "url": "https://apnews.com/7cff281bd9d719038218a2fd9491e47a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7607348777394defaaa71881d8a7693e/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER and JAKE BLEIBERG",
      "description": "AUSTIN, Texas (AP) — Billionaires, burner phones, alleged bribes: The impeachment trial of Texas Attorney General Ken Paxton is going to test the will of Republicans senators to oust not only one of their own, but a firebrand who has helped drive the state's hard turn to the right for years.",
      "publishedAt": "2023-09-02T04:04:10Z",
      "title": "Texas AG Ken Paxton's impeachment trial is in the hands of Republicans who have been by his side",
      "url": "https://apnews.com/c5680e445a9663d5c3958892f68e4c88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e3d2672707441948d78875efa491c8a/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "They were the kids most disrupted by the pandemic, the ones who were still learning to write their names and tie their shoes when schools shut down in the spring of 2020.",
      "publishedAt": "2023-09-02T04:06:50Z",
      "title": "Children hit hardest by the pandemic are now the big kids at school. Many still need reading help",
      "url": "https://apnews.com/53b0f3de56de526ead7a356bd7b853e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6288b43c27548cea9fb5fe78e5452b7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}