{
  "articles": [
    {
      "author": "THOMAS BEAUMONT",
      "description": "Pete Hegseth has been sworn as the nation’s 29th secretary of defense. Hegseth took the oath Saturday in Washington from Vice President JD Vance less than 12 hours after a dramatic late-night vote in the Senate installed him as the Pentagon's leader. The unusually narrow confirmation came after questions from members in both parties over Hegseth’s qualifications to lead the military amid allegations of heavy alcohol use and aggressive behavior toward women. Hegseth thanked Trump for his support and pledged that as defense secretary, he'll be focused on “putting America first” and rebuilding the U.S. military.",
      "publishedAt": "2025-01-25T16:21:24Z",
      "title": "Pete Hegseth quickly sworn in as defense secretary",
      "url": "https://apnews.com/article/pete-hegseth-confirmed-pentagon-trump-defense-secretary-1b9c9725e77812071d300a0de3a4c510",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ee061c/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F67%2Fe529ebacb426b05392cfce561e98%2F8c7cc9a76f4e4dd4833bb225a4384805"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "The Senate has confirmed Kristi Noem as homeland security secretary, putting the South Dakota governor in charge of a sprawling agency that is essential to national security and President Donald Trump’s plans to clamp down on illegal immigration. Republicans kept the Senate working Saturday to install the latest member of Trump’s national security team. Defense Secretary Pete Hegseth was confirmed Friday night, joining Secretary of State Marco Rubio and CIA Director John Ratcliffe.",
      "publishedAt": "2025-01-25T05:07:11Z",
      "title": "Senate confirms Kristi Noem as homeland security secretary",
      "url": "https://apnews.com/article/kristi-noem-border-trump-44925ad8670cd4ad57427513915bb140",
      "urlToImage": "https://dims.apnews.com/dims4/default/194c1b3/2147483647/strip/true/crop/5921x3331+0+309/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fa6%2F182a753a42455a13bb68a15a1a07%2F7069a409e2db44c29709d97eb45919d6"
    },
    {
      "author": "ZEKE MILLER, ERIC TUCKER, WILL WEISSERT",
      "description": "The Trump administration has fired more than a dozen independent inspectors general at federal agencies. The sweeping action removes oversight of his new administration and some members of Congress are suggesting the dismissals violate federal oversight laws. The dismissals began Friday night and were effective immediately. That's according to a person familiar with the actions who spoke on condition of anonymity to provide details that have not been made public. The firings were carried out without giving Congress 30-day notices of removal of inspectors general. Even a top Republican said the move violated the law.",
      "publishedAt": "2025-01-25T16:32:45Z",
      "title": "Trump fires more than a dozen independent inspectors general",
      "url": "https://apnews.com/article/trump-inspectors-general-fired-congress-unlawful-4e8bc57e132c3f9a7f1c2a3754359993",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a82e2d/2147483647/strip/true/crop/3260x1834+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F3a%2F45156d9923f0a909da3442cb6f56%2F0d0db091ad5549a9b5e51b660f63643b"
    },
    {
      "author": "ZEKE MILLER, JOSH BOAK",
      "description": "Donald Trump’s first week in office isn’t over yet, but what the Republican president has done so far offers clues about how his next four years in the White House may unfold. The early days of Trump's second term indicate that Trump is still Trump, but he seems emboldened like never before. He’s much more organized this time around. And he's betting he can fix everything. Trump doesn't have to worry about reelection. The Supreme Court has now granted presidents expansive immunity. And Trump is backed by a Republican Congress. So there's little to restrain him today.",
      "publishedAt": "2025-01-25T13:08:59Z",
      "title": "Takeaways from the Donald Trump’s first week in office",
      "url": "https://apnews.com/article/trump-takeaways-inauguration-pardons-first-week-b153c325399ede1cc7044bf41f9a9e1e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6a99ae/2147483647/strip/true/crop/4680x2633+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F0e%2F4e865d435d4f60d61408ee0a26e2%2F3b43c63b0bf743749a64e04679c3c24f"
    },
    {
      "author": "MATT BROWN",
      "description": "President Donald Trump’s pledge to help make Martin Luther King Jr.’s dream a reality is viewed with skepticism by many prominent Black and Hispanic civil rights leaders. But among the conservatives of color who surround Trump, his inauguration was an endorsement of their biggest hopes. At galas preceding Trump’s inauguration, conservative Black and Hispanic activists and lawmakers toasted to a new era in Washington. Rep. Byron Donalds of Florida said Trump is \"bringing Black people and Hispanic people into the Republican Party.” Trump in last year's election won record margins among heavily Black and Hispanic regions of the country compared to past Republican presidential candidates.",
      "publishedAt": "2025-01-25T05:05:08Z",
      "title": "Conservatives of color have high hopes for Trump's second term",
      "url": "https://apnews.com/article/black-hispanic-conservatives-trump-term-7081c60c7d3f146caea72be05f739182",
      "urlToImage": "https://dims.apnews.com/dims4/default/ddea9da/2147483647/strip/true/crop/4564x2567+0+237/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2Ff7%2Fe3718d239946908885c146b5e769%2Fe531db514713489fa15db568fc8f122b"
    },
    {
      "author": "THOMAS BEAUMONT, MEG KINNARD",
      "description": "Allies of President Donald Trump have been quick to threaten primary challengers for Republican senators who don’t back Trump's Cabinet picks and legislative priorities. Five senators in particular have drawn early attention. They are Joni Ernst of Iowa, Thom Tillis of North Carolina, Bill Cassidy of Louisiana, John Cornyn of Texas, and Lindsey Graham of South Carolina. But all bring their own strengths and a history of winning in their states.",
      "publishedAt": "2025-01-25T14:58:13Z",
      "title": "How key Republican senators are responding to Trump allies' primary threats",
      "url": "https://apnews.com/article/ernst-tillis-cassidy-cornyn-graham-musk-9a70ea4d8f1f75d5f3f62689da430b50",
      "urlToImage": "https://dims.apnews.com/dims4/default/108e255/2147483647/strip/true/crop/5417x3047+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F35%2Fd232875bf7a7bcc6f5be2e3bf221%2F900f5e3b24954503805b589c0aa47a26"
    },
    {
      "author": "ELLEN KNICKMEYER, FARNOUSH AMIRI",
      "description": "The State Department has frozen new funding for almost all U.S. aid programs worldwide, making exceptions to allow humanitarian food programs and military aid to Israel and Egypt to continue. The order was sent Friday in a cable to U.S. embassies worldwide. The order threatened a quick halt to many of the billions of dollars in U.S.-funded projects globally to support health, education, development, job training, anti-corruption, security assistance and other efforts. The State Department will conduct a review of which of the thousands of programs can continue. Its order spells out the execution of an executive order signed by President Donald Trump on Monday.",
      "publishedAt": "2025-01-24T19:11:02Z",
      "title": "State Department freezes new funding for nearly all US aid programs worldwide",
      "url": "https://apnews.com/article/state-department-trump-foreign-aid-bf047e17ef64cb42a1a1b7fdf05caffa",
      "urlToImage": "https://dims.apnews.com/dims4/default/0dd4ec6/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F6b%2F6fda641d2cd43a37c10569f0253a%2F02007acf720a4451aa00629cbe1fbe6c"
    },
    {
      "author": "BECKY BOHRER",
      "description": "In the early days of President Donald Trump’s second term, Alaska Sen. Lisa Murkowski had openly challenged or rebuked him at least three times. The defiance by a congressional Republican months after Trump's political comeback has stood out. But the centrist Murkowski has a history of bucking her party and Trump. She was the first GOP senator to publicly break ranks with him on the nomination of Pete Hegseth as defense secretary. She disagreed with Trump’s move to change the name of North America’s tallest peak, which is in Alaska. And she condemned his pardon of people involved in assaulting Capitol police on Jan. 6, 2021.",
      "publishedAt": "2025-01-25T14:01:41Z",
      "title": "Alaska Sen. Murkowski shows she's willing to defy Trump",
      "url": "https://apnews.com/article/trump-murkowski-alaska-hegseth-republicans-defy-dc08e3a49881bbe06aa1dfb0435b0a40",
      "urlToImage": "https://dims.apnews.com/dims4/default/6a61b8f/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F1d%2F64daaf460d55a4229679a544fde0%2Ff301d8c4c2094f7c8265433713b5ce1d"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "China’s veteran foreign minister has issued a veiled warning to America’s new secretary of state: Behave yourself. Foreign Minister Wang Yi conveyed the message in a phone call Friday, their first conversation since Marco Rubio’s confirmation as secretary of state. Wang used a phrase typical of a Chinese teacher or boss warning a student or employee to behave and be responsible for their actions. The phrase seemed aimed at Rubio’s vocal criticism of China and its human rights record when he was a U.S. senator, which prompted the Chinese government to put sanctions on him twice in 2020.",
      "publishedAt": "2025-01-25T08:30:55Z",
      "title": "China warns Rubio to behave himself",
      "url": "https://apnews.com/article/china-us-rubio-wang-phone-0c2dfd278aa002cfb6100683daec5b7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/f7a0bf1/2147483647/strip/true/crop/4852x2729+0+253/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F18%2F3b153abc416b3cb09ae8d3d26e52%2F29f76ff48834477c9a9ad7b003406231"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "Israel and Hamas are expected to swap more hostages for Palestinian prisoners. It would be the second such exchange since a ceasefire began in the Gaza Strip last weekend. It is another test for the truce that is aimed at winding down the deadliest and most destructive war ever fought between Israel and the militant group. The fragile deal has so far held, quieting airstrikes and rockets and allowing for increased aid to flow into the tiny coastal territory. When the ceasefire began Sunday, three hostages held by the militants were released in exchange for 90 Palestinian prisoners, all women and children. On Saturday, four hostages are expected to be freed for 200 prisoners.",
      "publishedAt": "2025-01-25T03:41:50Z",
      "title": "Israel and Hamas are set to swap more hostages for prisoners in another test of the Gaza ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-25-2025-150674e17bd8b22f2c2c3aa4991cf061",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b0ac5a/2147483647/strip/true/crop/5267x2963+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F7b%2F6892e7a3d64804b0c00056288851%2F2f20458ee9294e5bb5d01ba7c3d1df67"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}