{
  "articles": [
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE, JILL COLVIN and JOSH BOAK",
      "description": "PHILADELPHIA (AP) — Kamala Harris pressed a forceful case against Donald Trump on Tuesday in their first and perhaps only debate before the presidential election, repeatedly goading him in an event that showcased their starkly different visions for the country on abortion, immigration and American democracy.",
      "publishedAt": "2024-09-10T04:05:35Z",
      "title": "Harris presses a more forceful case against Trump than Biden did on abortion, economy and democracy",
      "url": "https://apnews.com/6ad8c03f6bf1ae88870b7db26276236e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51491049ac9540a68919802d22a90418/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES, JONATHAN J. COOPER and NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — Donald Trump and Kamala Harris faced each other on the debate stage Tuesday night for the first — and possibly the last — time.",
      "publishedAt": "2024-09-11T02:26:48Z",
      "title": "Key takeaways from a debate that featured tense clashes and closed with a Taylor Swift endorsement",
      "url": "https://apnews.com/b648ff0b9baf10d4625548e815d7cfe3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/961088285aff4bc6a8082424ad0dcd04/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Former President Donald Trump persisted Tuesday in saying during a nationally televised presidential debate that he had won the 2020 election and continued to take no responsibility for any of the mayhem that unfolded at the U.S.",
      "publishedAt": "2024-09-11T03:38:01Z",
      "title": "Trump repeats false claims over 2020 election loss, deflects responsibility for Jan. 6",
      "url": "https://apnews.com/144e136901013ddc9c8fab6a1d2bdf07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3339b1d9e22439f9d724410da12b5be/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "In their first and perhaps only debate, former President Donald Trump and Vice President Kamala Harris described the state of the country in distinctly different ways.",
      "publishedAt": "2024-09-10T04:01:59Z",
      "title": "FACT FOCUS: A look at false and misleading claims made during Trump and Harris' debate",
      "url": "https://apnews.com/0e368102d38d87d708a8a497a38f4fb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03d4d121c150485c9377c31eac3b8666/3000.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — To many Democrats, Kamala Harris was everything Joe Biden was not in confronting Donald Trump on the debate stage: forceful, fleet of foot, relentless in going after her opponent.",
      "publishedAt": "2024-09-11T04:39:58Z",
      "title": "To pumped-up Democrats, Harris was everything Biden was not in confronting Trump in debate",
      "url": "https://apnews.com/319079a18ea993066bea750b57f6e0fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db739489e539420793cc8b9d065a4689/3000.jpeg"
    },
    {
      "author": null,
      "description": "HANOI, Vietnam (AP) — A flash flood swept away an entire hamlet in northern Vietnam, killing 22 people and leaving dozens missing as deaths from a typhoon and its aftermath climbed to 141 on Wednesday.",
      "publishedAt": "2024-09-11T03:32:46Z",
      "title": "Flash flood sweeps away hamlet as Vietnam's storm toll rises to 141 dead",
      "url": "https://apnews.com/682dff62798f943244bc96f072072ef7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7b80832586d4eaa87308425432800ee/1920.jpeg"
    },
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — Hurricane Francine barreled early Wednesday toward Louisiana and is expected to make landfall in coming hours as forecasters raised threats of potentially deadly storm surge, widespread flooding and destructive winds on the northern U.S.",
      "publishedAt": "2024-09-11T04:28:06Z",
      "title": "Amid fears of storm surge and flooding, Hurricane Francine takes aim at Louisiana coast",
      "url": "https://apnews.com/e9ca39ec56ad28d128d3baa147d249b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4520429464b4b538ecddd04eb4c4ef4/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and NINIEK KARMINI",
      "description": "DILI, East Timor (AP) — Pope Francis flew to Singapore on Wednesday for the final leg of his trip through Asia, heading to one of the world’s richest countries from one of its poorest after a record-setting final Mass in East Timor.",
      "publishedAt": "2024-09-11T02:09:40Z",
      "title": "Pope heads to economic power Singapore after a joyous visit to impoverished, devout East Timor",
      "url": "https://apnews.com/7bfdcd65b84bd4704b035b139acaf131",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a78244866d8d4e9daecf6beec5b74761/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The U.S. is remembering the lives taken and those reshaped by 9/11, marking an anniversary laced this year with presidential campaign politics.",
      "publishedAt": "2024-09-11T04:08:12Z",
      "title": "US commemorates 9/11 attacks with victims in focus, but politics in view",
      "url": "https://apnews.com/52ddad8ed7f62e155644f0ae6eda96ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91a8fcfb278045e4a988f6fc0d263010/2000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Taylor Swift, one of the music industry's biggest stars, endorsed Kamala Harris for president shortly after the debate ended on Tuesday night.",
      "publishedAt": "2024-09-11T03:19:05Z",
      "title": "Taylor Swift endorses Kamala Harris for president after debate ends",
      "url": "https://apnews.com/3a36b6f9695c20153891bba35c47f21d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c848134ad604db1933c034659eec0b7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}