{
  "articles": [
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "RAFAH, Gaza Strip (AP) — The storming by Israeli troops of southern Gaza's main hospital brought chaos to hundreds of staff and patients inside, as health officials Friday said four people in intensive care died after their oxygen cut off.",
      "publishedAt": "2024-02-16T08:30:59Z",
      "title": "4 patients die as oxygen runs out in Gaza hospital seized by Israeli forces, health officials say",
      "url": "https://apnews.com/21e09d731eb09f95bfea8e0ce3c0500c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f40a8fe019f498fbaf46e2607ea0211/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and LISA MASCARO",
      "description": "WASHINGTON (AP) — An FBI informant has been charged with fabricating a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company, a claim that is central to the Republican impeachment inquiry in Congress.",
      "publishedAt": "2024-02-15T22:14:37Z",
      "title": "FBI informant charged with lying about Joe and Hunter Biden's ties to Ukrainian energy company",
      "url": "https://apnews.com/6969656f6012780a23a4b8841ce2689b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6bccbc748d04117b52440f32919e136/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A verdict is expected Friday in Donald Trump’s New York civil fraud trial, adding to a consequential week on the former president’s legal calendar.Trump could be hit with millions of dollars in penalties and other sanctions in the decision by Judge Arthur Engoron, who has already ruled that the former president inflated his wealth on financial statements that were given to banks, insurers and others to make deals and secure loans.",
      "publishedAt": "2024-02-16T05:19:12Z",
      "title": "Verdict in Donald Trump’s civil fraud trial expected Friday, capping busy week of court action",
      "url": "https://apnews.com/244024861f0df886543c157c9fc5b3e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0deebd7eefe546dbadb11014d690d4ae/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and ALANNA DURKIN RICHER",
      "description": "ATLANTA (AP) — Allegations of misconduct have taken center stage in Donald Trump's 2020 Georgia election case, thrusting top prosecutors' private lives into the spotlight and forcing them to answer deeply personal questions in court as they try to defend against efforts to derail the high-stakes case.",
      "publishedAt": "2024-02-16T05:20:41Z",
      "title": "Fani Willis to return to the witness stand as she fights an effort to derail Trump's election case",
      "url": "https://apnews.com/f03734cfd3d27ba34fba4cbbba621355",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74da5313c2344325a3a9bfec0567ece5/1920.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — Ukrainian President Volodymyr Zelenskyy is expected to sign bilateral security agreements with Germany and France on Friday as Kyiv works to shore up Western support nearly two years after Russia launched its full-scale war.",
      "publishedAt": "2024-02-16T07:58:13Z",
      "title": "Ukraine's Zelenskyy will sign security agreements with Germany, France as Kyiv shores up support",
      "url": "https://apnews.com/eefc83817062c5bb5d7a9e16a276aeaf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee1bb0f5789d4ff1afb947a97e0465d8/3000.jpeg"
    },
    {
      "author": "SUMMER BALLENTINE and DAVID A. LIEB",
      "description": "JEFFERSON CITY, Mo. (AP) — The shooting that wounded more than 20 people and killed one during the Kansas City Chiefs' Super Bowl victory parade occurred in a state with few gun regulations and historic tension over how major cities handle crime.",
      "publishedAt": "2024-02-16T05:05:20Z",
      "title": "Gun rights are expansive in Missouri, where shooting at Chiefs' Super Bowl parade took place",
      "url": "https://apnews.com/938583b1e9aa3b3a45f8a012e7b80fee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06ddfc8c3005412fa9d50e501cfd58d7/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Beleaguered British Prime Minister Rishi Sunak on Friday urged voters and his party to stick with him, after two English districts elected opposition-party lawmakers in seats that Sunak’s Conservatives had held for years.",
      "publishedAt": "2024-02-16T06:51:06Z",
      "title": "UK voters deliver double blow to Rishi Sunak, electing Labour lawmakers in two special elections",
      "url": "https://apnews.com/4f91c5ce14e8f0a2a4f70a02b97e0f03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0854bcd2df19485eb5191a5c56f0622e/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "REIM, Southern Israel (AP) — Each year as spring approaches, wildflowers erupt across Israel, a splash of color before the punishing Middle Eastern summer. Nowhere is the show more dramatic than in southern Israel, near Gaza, where brilliant red anemones burst forth with such intensity that rolling hills seem to be covered in red carpets.",
      "publishedAt": "2024-02-16T06:04:14Z",
      "title": "Southern Israel was filled with blood and death. Brilliant red wildflowers now bloom among the ashes",
      "url": "https://apnews.com/9cf6cf4ac0a8abf9b5a273d10e31aee9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cef4ac31d2774fd19c331b9e9f81343a/3000.jpeg"
    },
    {
      "author": "PETER SMITH and DASHA LITVINOVA",
      "description": "Greece has become the first majority-Orthodox Christian nation to legalize same-sex marriage under civil law.",
      "publishedAt": "2024-02-16T05:34:12Z",
      "title": "Greece just legalized same-sex marriage. Will other Orthodox countries join them any time soon?",
      "url": "https://apnews.com/16b1f311b703d228301a5e5713069cd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/501d42de066a48e78f3baef19d289b93/3000.jpeg"
    },
    {
      "author": "TRISHA THOMAS",
      "description": "CASTEL VOLTURNO, Italy (AP) — Mamadou Kouassi’s searing, epic journey over African deserts, through illegal prisons and across the Mediterranean Sea in a smugglers’ boat informed Italian director Matteo Garrone’s Oscar-nominated film “Io Capitano.” Some episodes that the Ivorian migrant witnessed on his three-year odyssey were too strong to make the final cut.",
      "publishedAt": "2024-02-16T05:22:00Z",
      "title": "Migrant's 3 brutal years trying to reach Italy inspired the Oscar-nominated film 'Io Capitano'",
      "url": "https://apnews.com/3d87df3ae3ed6f426e25bae04f0d2ab0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/046ded6da2f540f9994875fc9604ccde/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}