{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — The Israeli army severed northern Gaza from the rest of the besieged territory and pounded it with airstrikes Monday, preparing for expected ground battles with Hamas militants in Gaza's largest city and an even bloodier phase of the month-old war.",
      "publishedAt": "2023-11-06T07:37:38Z",
      "title": "Israeli forces cut off north Gaza to isolate Hamas as Palestinian deaths surpass 10,000",
      "url": "https://apnews.com/51286d15dddd77ae0dd7ea76ee52bc71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/073389c3dcf144b092d6475ecf0a7b9c/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli troops divided the northern and southern parts of Gaza, as communications across the besieged territory were temporarily cut Monday for a third time since the war started. The troops are expected to enter Gaza City on Monday or Tuesday, Israeli media reported.",
      "publishedAt": "2023-11-06T05:32:24Z",
      "title": "Live updates | Israeli troops divide north and south Gaza, as reported death toll exceeds 10,000",
      "url": "https://apnews.com/c01bc7cf6db1e07ab4d235225cef7320",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/723fd6a2521a45c4b9b5a206c8677803/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "ANKARA, Turkey (AP) — U.S. Secretary of State Antony Blinken wrapped up a grueling Middle East diplomatic tour on Monday in Turkey after only limited success in efforts to forge a regional consensus on how best to ease civilian suffering in Gaza as Israel intensifies its war against Hamas.",
      "publishedAt": "2023-11-06T09:50:26Z",
      "title": "Blinken wraps up frantic Mideast tour with tepid, if any, support for pauses in Gaza fighting",
      "url": "https://apnews.com/9ff3aae906aaae71613fb2a9afed2bdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca0f546ac69f459f844a9fdd30006820/2086.jpeg"
    },
    {
      "author": "JILL COLVIN, MICHAEL R. SISAK, JENNIFER PELTZ and ERIC TUCKER",
      "description": "NEW YORK (AP) — The judge presiding over the civil fraud trial of Donald Trump repeatedly admonished him to keep his answers concise Monday, reminding him that “this is not a political rally” as the former president and leading Republican presidential candidate testified in a lawsuit accusing him of dramatically inflating his net worth.",
      "publishedAt": "2023-11-06T05:30:28Z",
      "title": "Judge chides Trump as ex-president testifies in civil fraud trial: 'This is not a political rally'",
      "url": "https://apnews.com/dca74420da0f92ee9bc9caff7a92c3b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/378e3ae857064dc3a551c3944c9e101f/1920.jpeg"
    },
    {
      "author": "BRENDAN FARRINGTON",
      "description": "TALLAHASSEE, Fla. (AP) — A Florida governor wins reelection by record numbers and later finds himself running as a party conservative in a crowded presidential primary. In New Hampshire, he tip-toes around the explosive abortion rights issue, discusses ongoing Israeli military operations, promises he'll secure the Mexican border and warns that the current administration's fiscal insanity will cause more inflation, not reduce it.",
      "publishedAt": "2023-11-06T05:16:48Z",
      "title": "Can a Floridian win the presidency? It hasn't happened yet as Trump and DeSantis vie to be first",
      "url": "https://apnews.com/84a6a2eb53cfd3d1f46de55704e74160",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3166010a083344e7af3d605ac64dadd1/3000.jpeg"
    },
    {
      "author": "SALLY HO and GARANCE BURKE",
      "description": "Some are orphans, others seized from their parents. Many are older and have overwhelming needs or disabilities. Most bear the scars of trauma from being hauled between foster homes, torn from siblings or sexually and physically abused.",
      "publishedAt": "2023-11-06T05:17:25Z",
      "title": "Inspired by online dating, AI tool for adoption matchmaking falls short for vulnerable foster kids",
      "url": "https://apnews.com/f803bf3faa02bc90d285e68b1d2bc560",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9b547f18fc34822bb5851dd5b78bcdd/3000.jpeg"
    },
    {
      "author": null,
      "description": "LEWISTON, Maine (AP) — Two senators from Maine asked the U.S. Army inspector general on Monday to provide a full accounting of interactions with a reservist before he killed 18 people and injured 13 others in the deadliest shooting in the state's history.",
      "publishedAt": "2023-11-06T11:07:02Z",
      "title": "US senators seek answers from Army after reservist killed 18 in Maine",
      "url": "https://apnews.com/430a610f7f80ab7499edca9d78439432",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab5a874de0454db2adff4aeafd6e7822/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Ruth Glenn knows from harrowing personal experience the danger of putting a gun in the hands of a violent spouse or partner, the issue at the heart of a case before the Supreme Court.",
      "publishedAt": "2023-11-06T05:23:48Z",
      "title": "Why one survivor of domestic violence wants the Supreme Court to uphold a gun control law",
      "url": "https://apnews.com/debeb3aeaabc6c81dcdb369963ea2bec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70d899d415bf443e8c821138c64762e5/1920.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Aid trickled in to villages Monday in Nepal’s northwest mountains flattened by a strong earthquake over the weekend as villagers searched through the rubble of their collapsed homes to salvage what was left of their belongings.",
      "publishedAt": "2023-11-06T08:25:08Z",
      "title": "Aid trickles in as survivors salvage belongings from rubble in Nepal villages struck by earthquake",
      "url": "https://apnews.com/41f843df12711fcd2d7470e32ebc2757",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10d1ffa8362041b8b31db983e4add1a5/1920.jpeg"
    },
    {
      "author": "LARRY LAGE and MIKE HOUSEHOLDER",
      "description": "EAST LANSING, Mich. (AP) — College football tailgates are as synonymous with the game as blocking and tackling. Burgers, brats and beer go along with the cornhole and camaraderie for tens of thousands of people every Saturday, a beloved tradition seen outside stadiums big and small.",
      "publishedAt": "2023-11-06T11:10:28Z",
      "title": "AP survey finds 55 of 69 schools in major college football now sell alcohol at stadiums on game day",
      "url": "https://apnews.com/9bf00cc799a48dc363bee02e9560ccba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbd80b334f7549bfb39372f3380dda53/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}