{
  "articles": [
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Iryna Reva stares at her phone, replaying the last video her 25-year-old son Vladyslav sent her from the front line before the volunteer soldier disappeared 19 months ago in a battle with Russian forces in Ukraine’s eastern Donetsk region.",
      "publishedAt": "2024-02-23T05:07:39Z",
      "title": "Thousands of Ukrainians live in agony and uncertainty as they search for their missing loved ones",
      "url": "https://apnews.com/34e42072d806dd738b3bc31ce969224c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c39d0059d3247dba71741865e24475f/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The Treasury Department plans to impose more than 500 new sanctions on Russia and its war machine on Friday as the U.S. vows to keep up its financial pressure on Moscow with the war entering its third grueling year.",
      "publishedAt": "2024-02-22T18:43:59Z",
      "title": "US is imposing more than 500 new sanctions on Russia's war machine, indicts Russian businessmen",
      "url": "https://apnews.com/fa532f69286ab48a8c477c5c1aae089c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aaa0ad95c5d24cac9bfeaadaaebbebd7/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Hamas says its political leader, Ismail Haniyeh, has left Egypt after holding talks with Egyptian officials about a possible cease-fire in the Gaza Strip and an exchange of hostages held by the militants for Palestinians imprisoned in Israel.",
      "publishedAt": "2024-02-23T06:50:55Z",
      "title": "Live updates | Hamas leader leaves Egypt after cease-fire talks with officials there",
      "url": "https://apnews.com/280c63ec334e5a5651e466436f5470c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2389c0a20e14d4b8b9d92be8e695d83/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "KIBBUTZ BE'ERI, Israel (AP) — Gillian and Pete Brisley are picking up the pieces of their shattered lives. They are cleaning up the house where their daughter and granddaughters were killed by Hamas on Oct.",
      "publishedAt": "2024-02-23T05:18:51Z",
      "title": "Relatives of hostages in Gaza endure a nightmare, but dream their loved ones will be freed",
      "url": "https://apnews.com/98c2dbb2634eefbe52de11c1e06528af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e892f0dcde4b448694c9b73290462017/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A private lander on Thursday made the first U.S. touchdown on the moon in more than 50 years, but managed just a weak signal back until flight controllers scrambled to gain better contact.",
      "publishedAt": "2024-02-22T17:45:09Z",
      "title": "Private lander makes first US moon landing in more than 50 years",
      "url": "https://apnews.com/9c896bfca61582773d381f4045fd35d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15a0732e6f674b63b950cd7893a53c14/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST, RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — A former FBI informant who claims to have links to Russian intelligence and is charged with lying about a multimillion-dollar bribery scheme involving President Joe Biden's family was again taken into custody Thursday in Las Vegas, two days after a judge released him.",
      "publishedAt": "2024-02-22T22:29:40Z",
      "title": "Ex-FBI source accused of lying about Bidens and having Russian contacts is returned to US custody",
      "url": "https://apnews.com/e6de5f083e7ea7c2f1aa6233d24d7cfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84eb1a784aff472787e43b692e0b97ca/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Former President Donald Trump's legal team filed multiple motions Thursday night urging a Florida judge to dismiss the criminal case charging him with illegally retaining classified documents, claiming in part that presidential immunity protects him from prosecution — an argument they have already submitted to the U.S.",
      "publishedAt": "2024-02-23T05:28:00Z",
      "title": "Trump's lawyers call for dismissal of classified documents case, citing presidential immunity",
      "url": "https://apnews.com/cfbb3a9cc50495da1652fa63315dcb05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/856c2e72be3e41ac8c4902b839613c1d/3000.jpeg"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "AT&amp;T said the hourslong outage to its U.S. cellphone network Thursday appeared to be the result of a technical error, not a malicious attack. The outage knocked out cellphone service for thousands of its users across the U.S.",
      "publishedAt": "2024-02-22T12:27:22Z",
      "title": "AT&T says the outage to its US cellphone network was not caused by a cyberattack",
      "url": "https://apnews.com/02d8dfd93019e79e5e2edbeed08ee450",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e98be4682d34cb7a1b1368fc1509f42/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "LA PARAGUA, Venezuela (AP) — The collapse of an illegally operated gold mine in a remote area of central Venezuela has exposed the sense of abandonment felt by small or rural communities bypassed by a quasi-economic renaissance seen in the South American country's capital and cities.",
      "publishedAt": "2024-02-23T05:01:15Z",
      "title": "Collapse of illegal gold mine in Venezuela lays bare feelings of abandonment in rural communities",
      "url": "https://apnews.com/e221f07f200c0d135435bc2b7792eef1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83f8a7e58f3b419f938a6722dea94ff0/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — Last year more than two dozen opposition parties in India came together to take on Narendra Modi, one of the country's most popular prime ministers in generations. But the broad alliance, beset with ideological differences and personality clashes, is cracking at a crucial time, just months before the country votes in a national election.",
      "publishedAt": "2024-02-23T04:03:36Z",
      "title": "The opposition alliance that aimed to oust Modi appears to be cracking just before India's elections",
      "url": "https://apnews.com/ce93caddc7eb0ea4880b1bd77069efc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f4708f3ce5d4c4585e1842d0d6b1ab8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}