{
  "articles": [
    {
      "author": "Lindsay Whitehurst, Rebecca Santana",
      "description": "Following reports of deportations to South Sudan, the Trump administration says it's deported eight migrants convicted of crimes in the United States. Immigration authorities declined on Wednesday to say what their final destinations would be. But officials said their home countries had refused to receive the migrants. Immigration rights lawyers have said that the deportations violated a court order against deporting people to countries other than their homelands without first allowing them to argue the removal could put them in danger.",
      "publishedAt": "2025-05-21T13:09:44Z",
      "title": "After reports of deportations to South Sudan, US says it's removed 8 people convicted of crimes",
      "url": "https://apnews.com/article/deportation-immigration-south-sudan-department-of-homeland-security-a09612dbd055c5d1d88902c415bdf3e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/70e079c/2147483647/strip/true/crop/5342x3005+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2F92%2F44ce1721a97fce4c47ea9cba5f5e%2Ff608bcc36bcb46a1ac03e5eebc7d322e"
    },
    {
      "author": "Cara Anna",
      "description": "The United States once cheered the creation of South Sudan as an independent nation. Now the U.S. is being asked to explain why it appears to be deporting migrants from as far away as Vietnam to a chaotic country that’s once again in danger of civil war. A U.S. judge ordered Trump administration officials to appear at an emergency hearing Wednesday. Here’s a look at South Sudan, whose own people had been granted U.S. temporary protected status because of insecurity at home.",
      "publishedAt": "2025-05-21T14:48:45Z",
      "title": "A look at South Sudan, where the US is accused of quietly sending migrants",
      "url": "https://apnews.com/article/south-sudan-explainer-trump-deportees-3552af27dab8a5f68087d4b4e2201118",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ae18a5/2147483647/strip/true/crop/3000x1688+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2Fc4%2Fb59ccd77600f1ed1bb466ac748ad%2Fd9c64c86e6a9459c9d1e3479ab6c4585"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy, Melanie Lidman",
      "description": "Hospitals in Gaza say Israeli strikes overnight and into Wednesday have killed at least 45 people, including several women and a week-old infant. Israel began allowing dozens of humanitarian trucks into Gaza on Tuesday, but the aid has not yet reached Palestinians in desperate need, according to aid groups. In the southern city of Khan Younis, where Israel recently ordered new evacuations pending an expected expanded offensive, 24 people were killed, 14 of them from the same family. The week-old infant was killed in central Gaza.",
      "publishedAt": "2025-05-21T08:52:09Z",
      "title": "In Gaza, 45 killed in strikes as desperately needed aid fails to reach Palestinians",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-05-21-2025-11444e8b684b983dbb64daa5854b7b14",
      "urlToImage": "https://dims.apnews.com/dims4/default/050d410/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F33%2Fa07c8a6c9cd80b38b2026d7b24bd%2F3a9d20d3484d41329a3bf4dac9322f78"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking, Leah Askarinam, Joey Cappelletti",
      "description": "President Donald Trump’s multitrillion-dollar tax breaks package is at risk of stalling. House Speaker Mike Johnson and conservative Republican holdouts are heading to the White House later Wednesday for the last-ditch talks to salvage the bill. Johnson had hoped to vote as soon as Wednesday on the 1,000-page plus bill after grinding through an all-night committee hearing. But debate dragged into midday. Democrats lack the votes to stop Trump’s package, so they're using all available tools to press their opposition. Conservatives are angry at last-minute deals and worried the package will added to the nation’s debt. The Congressional Budget Office says the tax provisions would add $3.8 trillion to federal deficits.",
      "publishedAt": "2025-05-21T04:02:19Z",
      "title": "Republicans head to White House as Trump's tax break package is in trouble",
      "url": "https://apnews.com/article/congress-republicans-tax-cuts-bill-deficit-trump-2baff1acf9bdf6060fd584c93c97a88b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d259390/2147483647/strip/true/crop/3513x1976+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2F6a%2F01e3d68a399ff2d872cd06d5dabe%2F487b3fa55ba04f0e82e9dd3f1b8bdf16"
    },
    {
      "author": null,
      "description": "The Pentagon says Defense Secretary Pete Hegseth has accepted a gifted Boeing 747 from Qatar for President Donald Trump to use as Air Force One. Pentagon spokesman Sean Parnell said Wednesday that the department will “work to ensure proper security measures” on the aircraft to make it safe for use by the president. He said the plane was accepted “in accordance with all federal rules and regulations.”",
      "publishedAt": "2025-05-21T17:16:48Z",
      "title": "Defense Department accepts Boeing 747 from Qatar for Trump's use",
      "url": "https://apnews.com/article/trump-qatar-air-force-one-gift-plane-c4e1d73c3dbe18397c10e3d3d267bcd6",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bb810d/2147483647/strip/true/crop/4505x2534+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F88%2F6eb23c0a9719485ade637f02df3b%2F544e008651bd498b93cba817ea0280ef"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "Rapper and actor Kid Cudi is expected to testify at the Sean “Diddy” Combs sex trafficking trial on Thursday. He'll tell the jury about his brief relationship 14 years ago with Combs' ex-girlfriend, the R&B singer Cassie. Cassie testified last week that Combs was enraged when she left him for a period of time in 2011 and began dating Cudi. Prosecutors say Combs was so upset that he arranged to have Cudi’s convertible firebombed. Combs has pleaded not guilty to charges that he oversaw a racketeering enterprise that controlled Cassie and others through threats and violence. His lawyers say the evidence doesn't amount to a criminal racket or sex trafficking.",
      "publishedAt": "2025-05-21T04:03:27Z",
      "title": "Rapper Kid Cudi to testify at Sean 'Diddy' Combs trial this week",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-kid-cuti-7bebd603e6ed8a58451c48f64cf798c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ea1b4d/2147483647/strip/true/crop/3696x2079+0+189/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2F4d%2Fffd8e5164f9feb72a552d8860947%2F61fb4985fce540a7b867e92a75727be0"
    },
    {
      "author": "Olivia Diaz",
      "description": "U.S. Rep. Gerry Connolly has died at age 75. His family says he died at home Wednesday morning, surrounded by family members. He is best known as an outspoken Democrat who sought key reforms in the federal government while bringing transformational development to his populous Virginia district. He served in Congress as ranking member of the House Oversight Committee. Before that, Connolly had steered the transition of northern Virginia’s Tysons Corner from a traffic-heavy mall area to a downtown business hub. He also sought key investments in transportation development for northern Virginia. Connolly announced in 2024 that he had esophageal cancer. He said a few months later that he would retire from Congress.",
      "publishedAt": "2025-05-21T12:58:48Z",
      "title": "Gerry Connolly, a Democratic congressman and fixture of Virginia politics, dies at 75",
      "url": "https://apnews.com/article/gerry-connolly-dies-congress-virginia-44d5c141f417ca966850e4ffaa27c1b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d7faaa/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Ff4%2F2f4cfc4c7e6726d3d7c77095bd86%2Fe8d2520d9ce04fb2bc992b5f5b344e41"
    },
    {
      "author": "Alan Suderman",
      "description": "Bitcoin hit a new all-time high as the world’s most popular cryptocurrency reached price levels not seen since President Donald Trump’s inauguration. The digital asset traded above $109,400 Wednesday morning, a huge increase from recent lows of about $75,000 last month. Several other cryptocurrencies have seen similar large gains in recent days. That includes Trump’s official meme coins, which have jumped up about 75% in the last month. Bitcoin’s price increase comes after the crypto industry scored a major win with the U.S. Senate advancing legislation that creates a federal framework to regulate the stablecoins, a fast-growing form of cryptocurrency whose values are often tied to the U.S. dollar.",
      "publishedAt": "2025-05-21T15:45:15Z",
      "title": "Bitcoin hits new price highs as crypto industry scores wins",
      "url": "https://apnews.com/article/bitcoin-trump-meme-coins-price-high-2bdb8db9bfea9acc5d0f88a99759c855",
      "urlToImage": "https://dims.apnews.com/dims4/default/6f5c80e/2147483647/strip/true/crop/3726x2096+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2F7b%2Fef18ee9bc84a3e74448beaf412a6%2F829aacfb077d4647b93522fb786ef4ff"
    },
    {
      "author": "Dave Campbell",
      "description": "NFL owners voted against a proposed ban on the tush push on Wednesday, according to a person with knowledge of the decision. The prohibition of the popular and polarizing short-yardage play failed by two votes to reach the required majority, a 22-10 decision that will allow quarterbacks to continue to be aided by teammates when plunging into the line. The person spoke to The Associated Press on condition of anonymity because details of the discussions by the owners had not yet been made public.",
      "publishedAt": "2025-05-21T10:00:07Z",
      "title": "NFL owners vote down proposed tush push ban",
      "url": "https://apnews.com/article/nfl-owners-meetings-tush-push-b46978e8073d5213da514766aeacc188",
      "urlToImage": "https://dims.apnews.com/dims4/default/c06fb0a/2147483647/strip/true/crop/3458x1945+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fcc%2Fd7ba19c416392b08559c46401716%2F5c2d943ad7734ba6b2b8cff6ccf0352e"
    },
    {
      "author": "Leanne Italie",
      "description": "Emotional well-being. Fall prevention. Chair yoga has a lot to offer people of all ages. As older adults have become more active, chair yoga has grown in popularity. Sitting down to exercise may not sound like a workout, but devotees see a world of benefits. Desk workers can squeeze in 15 minutes of chair yoga, for instance. Many companies offer it as a way to cut down on stress and improve overall health. People with injuries may not be ready to get down on a yoga mat, but they can stretch in a chair. New York City yoga instructor Whitney Chapman points to improved flexibility, strength and balance.",
      "publishedAt": "2025-05-21T14:00:51Z",
      "title": "Chair yoga's benefits range from emotional health to fall prevention",
      "url": "https://apnews.com/article/chair-yoga-senior-fitness-wellness-c6355cdfe81336493bfbb0dbc8dba10f",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7f4c8c/2147483647/strip/true/crop/5382x3027+0+280/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fbb%2Fea6442995b84375c90672d4045a8%2F67a6065620e94ae880ff7e5006960b0f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}