{
  "articles": [
    {
      "author": null,
      "description": "Ukrainian officials say that a massive Russian drone-and-missile attack targeted the country for a second consecutive night, killing at least twelve people and injuring dozens. The attack early on Sunday came on the third day of a planned prisoner swap between Russia and Ukraine, the only tangible outcome from peace talks in Istanbul earlier this month which have so far failed to produce a ceasefire. Ukraine’s President Volodymyr Zelenskyy and Russia’s defense ministry said each side brought home 307 more soldiers on Saturday, a day after each released a total of 390 combatants and civilians. Further releases were expected on Sunday.",
      "publishedAt": "2025-05-25T05:24:51Z",
      "title": "A massive Russian drone-and-missile attack on Ukraine kills at least 12",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-dbefc3d0a83826c865908aa29dd40f93",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ef8ea2/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fd9%2Fd3ab0a5e78158586ab83c2e6968d%2Faff05b9e9af543d78d9f71004eb1165b"
    },
    {
      "author": "Mark Vancleave, Kendria Lafleur",
      "description": "Thousands are marking the fifth anniversary of George Floyd's murder at religious services, concerts and vigils nationwide. In Houston, the Rev. Al Sharpton spoke Sunday morning at a private graveside service for Floyd. Sharpton told those in attendance that Floyd represented all of those ‘who are defenseless against people who thought they could put their knee on our neck.’ Events at George Floyd Square in Minneapolis will include concerts and a worship service.",
      "publishedAt": "2025-05-25T04:09:27Z",
      "title": "Thousands mark 5th anniversary of George Floyd's murder",
      "url": "https://apnews.com/article/george-floyd-anniversary-minneapolis-houston-trump-a54d12a09926f6943ceb5aa932212e30",
      "urlToImage": "https://dims.apnews.com/dims4/default/372ba52/2147483647/strip/true/crop/5599x3149+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2Fce%2F0d94adb12a2e103d596b72a85be8%2Fa1b9f68daf04416ab13034fc5df1be08"
    },
    {
      "author": "Barbara Ortutay, Claire Rush",
      "description": "One initiative distributes laptops in rural Iowa. Another helped people get back online in North Carolina after Hurricane Helene washed away computers and phones. And there are efforts in Oregon and rural Alabama teach digital skills to older people, including some who’ve never touched a computer. Those and others are in jeopardy after President Donald Trump said he's cutting a program aimed at filling gaps in the digital divide. The Digital Equity Act was intended to cover unmet needs that surfaced during the country's broadband rollout. Trump has branded the program as racist and illegal, and claims it amounts to “woke handouts based on race.”",
      "publishedAt": "2025-05-25T11:36:03Z",
      "title": "Trump looks to end digital equity program he says is racist",
      "url": "https://apnews.com/article/digital-equity-act-trump-broadband-rural-diversity-90d1c8a618d289ecb16e1667194e37d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/e9e03db/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2Fb1%2F4d8687340c46ebd5cf6e9d695907%2F3a97ed6c0d2649d9a12c3e5b5fe954e3"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Health officials the Gaza Strip say Israeli strikes overnight and into Sunday killed at least 14 Palestinians, including a mother and her two children who were inside a tent that was struck. Israel says it plans to seize full control of Gaza and facilitate what it refers to as the voluntary migration of much of its population of 2 million Palestinians. Such a plan that has been rejected by Palestinians and much of the international community, and experts say it would likely violate international law. The Israeli military said earlier Sunday it intercepted a missile fired by Yemen’s Houthi rebels. There were no reports of casualties.",
      "publishedAt": "2025-05-25T08:17:20Z",
      "title": "Israeli strikes kill 14 in Gaza including a woman and her 2 children, medics say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-05-25-2025-204369bb7122a0d5add97d69b994bca2",
      "urlToImage": "https://dims.apnews.com/dims4/default/9238744/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F86%2F3f9bfcdca1caf9371fd81ce1f911%2F9d2069eb99404d10852c290ec50e8fa8"
    },
    {
      "author": "The Associated Press",
      "description": "In what had long been celebrated every May 30 to honor America’s fallen soldiers, Memorial Day officially became a federal holiday in 1971, observed on the last Monday in May. Businesses increasingly have chosen to stay open on the holiday, leading to what is now one of the biggest retail sales and travel weekends of the year. Government offices, post offices and schools are closed, as is the stock market, banks and a handful of businesses. The vast majority of retailers will be open, with many trying to lure customers with big promotional sales.",
      "publishedAt": "2025-05-25T13:51:06Z",
      "title": "What's open and closed on Memorial Day?",
      "url": "https://apnews.com/article/memorial-day-2025-stores-open-closed-217c9b4b29bcfd58f0f825ba549a4d1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c177ba/2147483647/strip/true/crop/2038x1146+0+106/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F13%2F4ea0709690e713d23a452a907b80%2F892dd88881ba448daaa5aa2c5c9d7fd5"
    },
    {
      "author": "Christina Larson, Adithi Ramakrishnan, Jamey Keaten",
      "description": "As the Trump administration cut billions of dollars in federal funding to scientific research, thousands of scientists in the U.S. lost their jobs or grants. And governments and universities around the world spotted an opportunity and launched programs to lure researchers from the U.S. Since World War II, the U.S. has invested huge amounts of money in scientific research conducted at independent universities and federal agencies. That funding helped the U.S. to become the world’s leading scientific power. But today that system is being shaken by deep cuts. The Trump administration says it is reviewing the previous administration’s projects, identifying waste and realigning research spending to match the “American people’s priorities.”",
      "publishedAt": "2025-05-25T04:43:55Z",
      "title": "Foreign universities hope to lure scientists from the US after Trump research cuts",
      "url": "https://apnews.com/article/trump-research-funding-cuts-brain-drain-f1ac9fe5c8a90f5d5ec9b2726475e10e",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b15cc2/2147483647/strip/true/crop/5347x3008+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2Fd0%2F917000883c32c200acea29e4da9d%2F8fe8d54f49264dce8fb25db4b1874524"
    },
    {
      "author": "Regina Garcia Cano",
      "description": "Venezuela is going to the polls to elect lawmakers, governors and other officials against a backdrop of heightened government repression. But voters are weighing whether to heed opposition calls to boycott the election. Sunday's poll is the first to allow broad voter participation since last year’s presidential contest, which President Nicolás Maduro claimed to have won despite credible evidence to the contrary. Voting is taking place two days after the government detained dozens of people, including a prominent opposition leader, and linked them to an alleged plot to hinder the vote.",
      "publishedAt": "2025-05-25T05:11:13Z",
      "title": "Venezuelans vote for lawmakers and governors as opposition calls for election boycott",
      "url": "https://apnews.com/article/venezuela-maduro-regional-election-machado-boycott-repression-2b994304869b9d89740b3ba59023d94a",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba7ed6e/2147483647/strip/true/crop/5191x2920+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F28%2F4d96cd6d65ec643c8052fb1903b0%2F12b93fcac0024dc1bd15f2cf1f4cf3d0"
    },
    {
      "author": "Russ Bynum",
      "description": "Pope Leo XIV’s election as the first American to lead the Catholic Church elevated him to the rare position of being a U.S. citizen who is also a foreign head of state. The new pope was born in Chicago in 1955 as Robert Prevost. He holds dual citizenship in the U.S. and Peru. As pope he's the leader of the Catholic Church and Vatican City, an independent state. It seems unlikely being pope will force Leo to give up U.S. citizenship. The U.S. State Department can review the citizenship status of Americans who become foreign leaders. But the U.S. Supreme Court has held that Americans must voluntarily renounce their citizenship to lose it.",
      "publishedAt": "2025-05-25T11:10:21Z",
      "title": "Pope Leo holds U.S. citizenship. Can he still be a foreign head of state?",
      "url": "https://apnews.com/article/pope-leo-us-citizenship-head-of-state-7eaefc0dc366b2846ab948ceb97fdbc9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7823660/2147483647/strip/true/crop/1068x601+0+56/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2Fbc%2Fa06c96fe9a1cbd9ec139ab7884a6%2F94ed16c924a248e798b7d2a7b9953df9"
    },
    {
      "author": "Jenna Fryer",
      "description": "The start of the Indianapolis 500 has been delayed because of rain sprinkles around the track — a weather disruption that could ruin Kyle Larson’s attempt to run “the double” for a second consecutive year. The NASCAR star is trying to complete 1,100 miles of racing in one day — a feat only accomplished once, by Tony Stewart. His bid at completing “the double” failed last year because a rain delay in Indianapolis made him miss the Coca-Cola 600 in North Carolina. Larson and Hendrick Motorsports have promised NASCAR that Larson will be at Charlotte Motor Speedway for the start of Sunday's Cup Series race.",
      "publishedAt": "2025-05-25T13:24:37Z",
      "title": "Rain delays Indy 500, jeopardizing Kyle Larson's double attempt",
      "url": "https://apnews.com/article/indy-500-bc71ef31fd4ce00e4c36f50ca2feba9a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ec407d/2147483647/strip/true/crop/8363x4704+0+436/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F25%2F4e9ee6ff1a9e2ec5ff9ff1d95af0%2Fbc42abde9a0c4297925fb2a23121d0dc"
    },
    {
      "author": "Andrew Dalton",
      "description": "“Lilo & Stich” team with Tom Cruise for what may be a record-breaking Memorial Day box office weekend. According to studio estimates Sunday, Disney's “Lilo & Stich” earned a staggering $145.5 million in North American theaters, the second biggest opening of the year after “A Minecraft Movie.” Paramount Pictures’ “Mission: Impossible – The Final Reckoning,” the eighth and probably last appearance of Tom Cruise as Ethan Hunt in a nearly three decade run, was a very distant second domestically, but still brought in a franchise record $63 million through Sunday, out-earning “Mission Impossible: Fallout,” which opened domestically to $61 million in 2018.",
      "publishedAt": "2025-05-25T16:44:41Z",
      "title": "'Lilo & Stich' team with Tom Cruise and 'Mission Impossible' for a monster Memorial Day weekend",
      "url": "https://apnews.com/article/lilo-stich-mission-impossible-039dac917c7077a7dd23d7ca6349711b",
      "urlToImage": "https://dims.apnews.com/dims4/default/540a05f/2147483647/strip/true/crop/3351x1885+574+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2Fbb%2Fd55890735495224d5fae815dc308%2F5ec04cc7572d4dc08e54ffc5a934865d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}