{
  "articles": [
    {
      "author": "Zeke Miller, Aamer Madhani",
      "description": "U.S. President Donald Trump has left Qatar for the United Arab Emirates on the final leg of his Middle East tour. Trump will visit the country’s largest mosque, where the country's founder is buried in a courtyard. Trump also will be hosted for a state visit by the UAE's president at a palace. Trump wrapped up his visit to Qatar by stopping at a U.S. installation Thursday, telling troops his “priority is to end conflicts.” Earlier in the day, Trump said he wasn't surprised Russian President Vladimir Putin will be a no-show for anticipated peace talks with Ukraine in Turkey. Earlier this week, Trump met with Syria’s president and announced plans to ease sanctions on the war-torn country.",
      "publishedAt": "2025-05-15T04:02:17Z",
      "title": "Trump will visit US troops in Qatar during Middle East tour",
      "url": "https://apnews.com/article/trump-qatar-syria-aludeid-air-base-9c868799582685b3a115c6f0c243d606",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1e4cdc/2147483647/strip/true/crop/3639x2047+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F87%2F977425b8fdf10152ee6e528b1b9f%2Fa766ae442522424fbcd4b464315650e7"
    },
    {
      "author": "Mohammad Jahjouh, Tia Goldenberg",
      "description": "A hospital in southern Gaza says 54 people have been killed in overnight airstrikes on the city of Khan Younis. An Associated Press cameraman counted 10 airstrikes on the city overnight into Thursday and saw numerous bodies taken to the morgue in Nasser Hospital. Some bodies arrived in pieces, with some body bags containing the remains of multiple people. The hospital’s morgue confirmed 54 people had been killed. The strikes come as U.S. President Donald Trump visits the Middle East, visiting Gulf states but not Israel. There had been hope that Trump’s regional visit could usher in a ceasefire or renewal of humanitarian aid to Gaza. An Israeli blockade of the territory is now in its third month.",
      "publishedAt": "2025-05-15T06:43:42Z",
      "title": "54 people killed in overnight airstrikes on southern Gaza city, hospital says",
      "url": "https://apnews.com/article/mideast-wars-israel-hamas-gaza-05-15-2025-b32d055195ffec2b349a0948582c68e3",
      "urlToImage": "https://dims.apnews.com/dims4/default/28db1cd/2147483647/strip/true/crop/6886x3873+0+358/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F9d%2F7e2901282351a444195d5008cb28%2Fe174e34502a344e4a5be151e05fe3585"
    },
    {
      "author": "Mehmet Guzel",
      "description": "Russian officials say Russia’s delegation has arrived in Istanbul for peace talks with Ukraine. However, President Vladimir Putin was not part of the delegation, according to a list released by the Kremlin Wednesday night, prompting criticism from Western officials that Moscow isn’t serious about the peace effort. Earlier this week, Ukraine’s President Volodymyr Zelenskyy challenged the Russian leader to meet in person in Turkey. Earlier this week, Ukrainian President Volodymyr Zelenskyy challenged the Russian leader to meet in person in Turkey. Ukraine’s presidential adviser, Mykhailo Podolyak, said Zelenskyy will sit at the table only with Putin.",
      "publishedAt": "2025-05-15T07:55:07Z",
      "title": "A Russian delegation has arrived in Istanbul for Ukraine talks. It doesn't include Putin",
      "url": "https://apnews.com/article/russia-ukraine-war-istanbul-talks-zelenskyy-putin-05795eea960b9035f93a143c3e177c3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/b85eaa7/2147483647/strip/true/crop/2955x1662+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fff%2F322926c1aa03f855d06788296976%2F681b2f6ad2704ee79556d44b68b9303b"
    },
    {
      "author": null,
      "description": "Federal courts have so far uniformly blocked President Donald Trump’s order seeking to end birthright citizenship for children born in the United States to someone in the country illegally. The Supreme Court is hearing arguments Thursday in appeals of three of those orders that prevented the Trump administration’s citizenship restrictions from taking effect anywhere in the United States. At issue are the meaning of the Citizenship Clause of the 14th Amendment and the authority of judges to universally block, or enjoin, policies, rather than apply them more narrowly. Four federal judges have explained why they believe Trump’s executive order is unconstitutional. Nine appellate judges also have weighed in.",
      "publishedAt": "2025-05-15T11:16:50Z",
      "title": "What judges have said about birthright citizenship",
      "url": "https://apnews.com/article/supreme-court-birthright-citizenship-trump-immigration-735d28a2572f623f199f97b3bc97644a",
      "urlToImage": "https://dims.apnews.com/dims4/default/efcd6ef/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F9a%2F51edd74f866732477ccaf4a2053e%2F1b8c34a992d6461191c82ca3c07ace49"
    },
    {
      "author": "David A. Lieb",
      "description": "Missouri lawmakers have approved a referendum seeking to repeal an abortion-rights amendment passed by voters six months ago. The Republican-led Senate voted Wednesday to place a new amendment on the statewide ballot that would instead impose a ban on most abortions, with exceptions for rape and incest. The vote came after the GOP majority used a rare procedural move to cut off debate by Democrats who opposed the measure. The new referendum would go before voters in November 2026 unless Republican Gov. Mike Kehoe calls a special election sooner than that.",
      "publishedAt": "2025-05-14T22:44:48Z",
      "title": "Missouri lawmakers back repeal of abortion-rights amendment",
      "url": "https://apnews.com/article/abortion-rights-ban-missouri-sick-leave-c4f7beb07e7b3de64f3e2460bcb539c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Nicole Winfield",
      "description": "Before becoming Pope Leo XIV, Cardinal Robert Prevost presided over one of the most revolutionary reforms of Pope Francis’ pontificate by having women serve on the Vatican board that vets nominations for bishops. But he also has said women cannot be ordained as priests. Despite working for years in Peru, where women often lead church communities, he seems noncommittal on whether they could ever serve in any ministerial capacity. Still, the women who've worked closely with Prevost praise his leadership style, ability to listen and respect for their opinions. They tell The Associated Press that they expect him as pope to continue to promote women in church governance positions — but with limits.",
      "publishedAt": "2025-05-15T05:09:40Z",
      "title": "Pope Leo XIV creates some limited optimism for elevating women's roles in the church",
      "url": "https://apnews.com/article/pope-leo-women-priests-ordination-42d51fae16606dd561553362b16e500f",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe36019/2147483647/strip/true/crop/5996x3373+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F10%2F51e9fcf61dbbced3b1da1a85fa87%2F947da46b5aea42d381790954ab85c78b"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "The R&B singer Cassie is set to continue testifying Wednesday against her ex-boyfriend Sean “Diddy” Combs in his sex trafficking trial, a day after taking the witness stand to detail what she says was years of grotesque sexual and physical abuse. Cassie spent about five hours on the witness stand Wednesday. Combs is accused of exploiting his status as a powerful music executive to coerce women including Cassie into drugged-up sex parties he called “freak offs.” He has pleaded not guilty. His lawyers say all sexual acts were consensual.",
      "publishedAt": "2025-05-14T04:02:55Z",
      "title": "Cassie due back for 2nd day of testimony in Sean 'Diddy' Combs' trial",
      "url": "https://apnews.com/article/diddy-sex-trafficking-freak-offs-cassie-b2bb8f6d7017b1ebc227c49b44f86d6a",
      "urlToImage": "https://dims.apnews.com/dims4/default/deb7c37/2147483647/strip/true/crop/3872x2178+0+11/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fc7%2Fa896760638f8637dd3703d090966%2Ffde0b54fcc7147ad88d825532de42341"
    },
    {
      "author": "Jocelyn Gecker, Linley Sanders",
      "description": "A new poll suggests that while the overall concept of diversity, equity and inclusion is divisive, some of the DEI initiatives being affected by the Trump administration’s policies are less controversial. The Associated Press-NORC Center for Public Affairs Research poll shows about 4 in 10 Americans “strongly” or “somewhat” favor DEI programs in colleges and universities, about 3 in 10 oppose and about 3 in 10 are neutral. Support is higher for courses on racism and scholarships for students of color. The findings underscore that while “DEI” has become a politically toxic and unpopular term for many Americans, some of the components of DEI programs have much less opposition.",
      "publishedAt": "2025-05-15T11:49:14Z",
      "title": "Americans are divided over DEI programs on college campuses, poll finds",
      "url": "https://apnews.com/article/dei-race-higher-education-diversity-equity-inclusion-29e6d46c36e5eae6323551ca2f9c00ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c82a62/2147483647/strip/true/crop/4744x2669+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2Fa4%2F97392cf83b300d6e90a571bd2c47%2F7157ced4fd484525a87ad7a0462d49f8"
    },
    {
      "author": "Sibi Arasu",
      "description": "Indigenous women in India have watched their villages’ common areas under threat from climate change. Now they are leading their communities’ most significant effort yet to speak up for their needs. Armed with “dream maps” of how their lands should be, they are making a pitch to Indian authorities to protect and restore them. The nation of more than 1.4 billion people is trying to adapt to a warming world. India is among the most vulnerable nations to climate change, and its Indigenous peoples are even more so. The women have never led an outward-facing project like this and feel confident about it.",
      "publishedAt": "2025-05-15T02:47:11Z",
      "title": "In India, Indigenous women and their 'dream maps' seek to protect lands from climate change",
      "url": "https://apnews.com/article/india-women-farmers-climate-change-indigenous-fe099e6b33589330f7aa1bb27da75005",
      "urlToImage": "https://dims.apnews.com/dims4/default/4929644/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F64%2F7d8fdd11accc1525b1698f9a8780%2F210cd29aacac49a7a1bfb05308e53262"
    },
    {
      "author": "Anne D'Innocenzio",
      "description": "Walmart’s first quarter profit slipped and it said it must raise prices due to higher costs from tariffs implemented by President Donald Trump. The nation’s largest retailers posted strong quarterly sales Thursday and said it expects sales growth of 3.5% to 4.5% in the second quarter. Like many other U.S. companies, however, it did not issue a profit outlook for the quarter because of the chaotic environment, with stated U.S. tariff policies changing constantly. The company maintained its full year guidance issued in February. Walmart earned $4.45 billion, or 56 cents per share, in the quarter, down from $5.10 billion, or 63 cents per share, in the same period last year.",
      "publishedAt": "2025-05-15T11:10:08Z",
      "title": "Walmart says it will raise prices due to tariff costs after posting solid first quarter sales",
      "url": "https://apnews.com/article/walmart-earnings-tariff-consumers-inflation-773f7de5081c40a98c98fbb293fa5f96",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7e29c8/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2Fdb%2F47f386a9ea2f183e988bb64ba461%2F44fadc0d6083475eb90d8c7fa45765e5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}