{
  "articles": [
    {
      "author": "HAVEN DALEY and MIKE SCHNEIDER",
      "description": "BELLEAIR BEACH, Fla. (AP) — Florida’s storm-battered Gulf Coast raced against a Category 5 hurricane Monday as workers sprinted to pick up heaps of appliances and other street debris left over from Helene two weeks ago and highways were clogged with people fleeing ahead of the storm.",
      "publishedAt": "2024-10-07T04:14:16Z",
      "title": "Hurricane Milton is a Category 5. Florida orders evacuations and scrambles to clear Helene's debris",
      "url": "https://apnews.com/557c5c512135e0a8661b298e45e17c92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9d5608a0c1e42739d9b66281ce01ebd/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Not even two weeks after Hurricane Helene swamped the Florida coastline, Milton has strengthened rapidly into a Category 5 hurricane on a path toward the state.",
      "publishedAt": "2024-10-07T22:26:06Z",
      "title": "What to know about Hurricane Milton as it speeds toward Florida",
      "url": "https://apnews.com/d40b1e47fd78844bf1ed528bab5099f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5db12c55e1a45a3abfd59f6084e7b07/3000.jpeg"
    },
    {
      "author": "MELINA WALLING and SETH BORENSTEIN",
      "description": "Hurricanes are humanity’s reminder of the uncontrollable, chaotic power of Earth’s weather. Milton’s powerful push toward Florida just days after Helene devastated large parts of the Southeast likely has some in the region wondering if they are being targeted.",
      "publishedAt": "2024-10-07T21:32:49Z",
      "title": "Control the path and power of hurricanes like Helene? Forget it, scientists say",
      "url": "https://apnews.com/735eaed734e132d6260ee94701c72d5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2d29f50bacb4e0288d6c2e732855b10/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and TIA GOLDENBERG",
      "description": "RE'IM, Israel (AP) — Israelis held somber ceremonies Monday to mark a year since the deadliest attack in the country’s history, a Hamas-led raid that shattered its sense of security and has since spiraled into wars on two fronts with no end in sight.",
      "publishedAt": "2024-10-07T03:35:39Z",
      "title": "War rages on multiple fronts as Israel marks a year since Hamas' Oct. 7 attack",
      "url": "https://apnews.com/cf123f95609051e8e8eaf6aebe661b6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4f320928ac64d17a1ad8862a4a1ac89/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court took the bench again on Monday, ready to hear cases on ghost guns, a death sentence and transgender rights.",
      "publishedAt": "2024-10-07T04:29:19Z",
      "title": "Supreme Court takes the bench with ghost guns, a capital case and transgender rights on the docket",
      "url": "https://apnews.com/926e78c1100f3201fbd99b3d1ef2b747",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e64a423984704f1da451fd5e9a0b0bef/3000.jpeg"
    },
    {
      "author": "JOHN RABY",
      "description": "The head of the U.S. disaster response agency continued to forcefully push back Monday against false claims and conspiracy theories about her agency’s response to Hurricane Helene as the death toll from the storm continued to climb.",
      "publishedAt": "2024-10-07T20:56:25Z",
      "title": "FEMA administrator continues pushback against false claims as Helene death toll hits 230",
      "url": "https://apnews.com/826effecab238ff0acf0556ad64b0df2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12d0aab850c447feb61943b5673e744e/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — Soon, the ballots will be cast, the polls will close and a campaign marked by assassination attempts, animosity and anxiety will come to an end. But for U.S. adversaries, the work to meddle with American democracy may be entering its most critical phase.",
      "publishedAt": "2024-10-07T04:04:50Z",
      "title": "For US adversaries, Election Day won't mean the end to efforts to influence Americans",
      "url": "https://apnews.com/efff7f7fcbc71032b1152d011c953eba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab611f5a543d471ba279258759ae8c1d/3000.jpeg"
    },
    {
      "author": "JONATHAN LANDRUM Jr. and HILLEL ITALIE",
      "description": "LOS ANGELES (AP) — Cissy Houston, a two-time Grammy-winning soul and gospel artist who sang with Aretha Franklin, Elvis Presley and other stars and knew triumph and heartbreak as the mother of Whitney Houston, has died.",
      "publishedAt": "2024-10-07T18:56:54Z",
      "title": "Cissy Houston, a Grammy-winning gospel singer and Whitney Houston's mother, dies at 91",
      "url": "https://apnews.com/de8e3486134c7acd599ee3f16fb997c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/707d38812af345ada69a2c7dd40b33bc/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A spacecraft blasted off Monday to investigate the scene of a cosmic crash.",
      "publishedAt": "2024-10-07T14:53:41Z",
      "title": "A spacecraft is on its way to a harmless asteroid slammed by NASA in a previous save-the-Earth test",
      "url": "https://apnews.com/e716ac29b5b056861a995c0bf6342c2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f66a35c71e441508360e005af77d0b6/3000.jpeg"
    },
    {
      "author": "SCOTT McFETRIDGE",
      "description": "DES MOINES, Iowa (AP) — The cost of buying a Mega Millions jackpot dream will soon more than double, but lottery officials said they're confident players won't mind paying more after changes that will lead to larger prizes and more frequent winners.",
      "publishedAt": "2024-10-07T18:51:04Z",
      "title": "Mega Millions tickets will climb to $5, but officials promise bigger prizes and better odds",
      "url": "https://apnews.com/6d07dbc300b42565f3d87c058841b816",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4715d641d791470fbfdc85dfe47db0cd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}