{
  "articles": [
    {
      "author": "SARAH EL DEEB",
      "description": "DAMASCUS (AP) — At Damascus’ international airport, the new head of security — one of the rebels who marched across Syria to the capital — arrived with his team.",
      "publishedAt": "2024-12-15T05:04:09Z",
      "title": "One week into a new Syria, rebels aim for normalcy and Syrians vow not to be silent again",
      "url": "https://apnews.com/c06673aa3317a194619710948264cdf1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31b428c55aa7422e845cf22d92e028bb/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "DAMASCUS, Syria (AP) — In churches across long-stifled Syria, Christians marked the first Sunday services since the sudden collapse of Bashar Assad's regime in an air of transformation.",
      "publishedAt": "2024-12-15T10:30:14Z",
      "title": "Christians in Syria mark country's transformation with tears as UN envoy urges an end to sanctions",
      "url": "https://apnews.com/3f0031108d7e58c2343bd6a8fd42254c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e03e468c9fd4468585ba343b71d2f57a/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and NATALIE MELZER",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel said Sunday it will close its embassy in Ireland as relations deteriorated over the war in Gaza, where Palestinian medical officials said new Israeli airstrikes killed over 30 people including several children.",
      "publishedAt": "2024-12-15T15:57:55Z",
      "title": "Israel will close its Ireland embassy over Gaza tensions as Palestinian death toll nears 45,000",
      "url": "https://apnews.com/b97bfffe851f87328ab24017da8d7a32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/760638bb35e64bd6985fae8fe8029028/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s opposition leader offered Sunday to work with the government to ease the political tumult as officials sought to reassure allies and markets, a day after the opposition-controlled parliament voted to impeach conservative President Yoon Suk Yeol over a short-lived attempt to impose martial law.",
      "publishedAt": "2024-12-15T02:35:44Z",
      "title": "South Korean leaders seek calm after Yoon is impeached",
      "url": "https://apnews.com/ca583315453be30766372702120f94e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3ed00d3cae948fcbd6cf56382364f85/1920.jpeg"
    },
    {
      "author": "NOAH TRISTER, TARA COPP and AAMER MADHANI",
      "description": "LANDOVER, Md. (AP) — President-elect Donald Trump huddled with allies and a Republican cause célèbre at Saturday's Army-Navy football game, taking in one of the most storied rivalries in college sports while spotlighting his emerging national security team.",
      "publishedAt": "2024-12-14T14:16:38Z",
      "title": "Trump gets warm welcome as he watches Army-Navy game alongside key allies, nominees and Daniel Penny",
      "url": "https://apnews.com/85da138b3ac130b211afc414bf43514a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4562d4be94e04e2884ae68dfc36bb377/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — ABC News has agreed to pay $15 million toward Donald Trump’s presidential library to settle a defamation lawsuit over anchor George Stephanopoulos' inaccurate on-air assertion that the president-elect had been found civilly liable for raping writer E.",
      "publishedAt": "2024-12-14T20:52:54Z",
      "title": "ABC agrees to give $15 million to Donald Trump's presidential library to settle defamation lawsuit",
      "url": "https://apnews.com/04aea8663310af39ae2a85f4c1a56d68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07511248e1bb437b83cf5bdeea5c0081/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and SYLVIE CORBET",
      "description": "CAPE TOWN, South Africa (AP) — Cyclone Chido left at least 11 people dead and caused widespread damage in the largely poor French island territory of Mayotte in the Indian Ocean before making landfall Sunday in Mozambique on the east coast of Africa.",
      "publishedAt": "2024-12-15T10:24:09Z",
      "title": "Cyclone Chido leaves 11 dead in the French territory of Mayotte and hits Mozambique next",
      "url": "https://apnews.com/2b49b97217a47e2013dc9021d9324eb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18bfe0d44bcc479fb71c4081694af000/1920.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — A tornado near a mall in central California swept up cars, uprooted trees and sent several people to the hospital. In San Francisco, authorities issued the first-ever tornado warning.",
      "publishedAt": "2024-12-15T08:20:40Z",
      "title": "Storms across US bring heavy snow, dangerous ice and a tornado in California",
      "url": "https://apnews.com/46d9848b6908aed8f79d0e1064699ee0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6caad8cc05464a6db088bfcd4263fcef/3000.jpeg"
    },
    {
      "author": "PAOLO SANTALUCIA and SILVIA STELLACCI",
      "description": "AJACCIO, Corsica (AP) — Pope Francis on the first papal visit ever to the French island of Corsica on Sunday called for a dynamic form of laicism, promoting the kind of popular piety that distinguishes the Mediterranean island from secular France as a bridge between religious and civic society.",
      "publishedAt": "2024-12-15T06:07:43Z",
      "title": "Pope Francis makes 1st papal visit to France's Corsica awash in expressions of popular piety",
      "url": "https://apnews.com/1422ac7938a526d02a82f739a51bcfcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ac8e45d020547aabe929dded4405a9b/3000.jpeg"
    },
    {
      "author": "MIKE FITZPATRICK",
      "description": "NEW YORK (AP) — Travis Hunter turned every play into prime time — on both sides of the ball — and ultimately took home the Heisman Trophy.Now he’s got a leg up on his celebrity coach at Colorado.",
      "publishedAt": "2024-12-15T01:57:47Z",
      "title": "Colorado two-way star Travis Hunter wins Heisman Trophy as college football's top player",
      "url": "https://apnews.com/c76c411ca04108018eefb18beaa649fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2cd5029ed2b4af4a9e62409333c876a/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}