{
  "articles": [
    {
      "author": "JALAL BWAITEL and JULIA FRANKEL",
      "description": "KHIRBET ZANUTA, West Bank (AP) — An entire Palestinian community fled their tiny West Bank village last fall after repeated threats from Israeli settlers with a history of violence.",
      "publishedAt": "2024-09-08T04:25:26Z",
      "title": "Chased away by Israeli settlers, these Palestinians returned to a village in ruins",
      "url": "https://apnews.com/b426fa223791d88e97bcd48d3e618081",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f2b93ed6ffa4b048e1eed715b21eec4/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Huge numbers of Israelis again poured into the streets to protest the government's failure to secure the return of remaining hostages in Gaza, while hospital and local authorities said Israeli air raids in the territory killed more than a dozen people overnight into Saturday.",
      "publishedAt": "2024-09-07T10:40:01Z",
      "title": "Israelis surge into the streets again in protest as the toll in Gaza grows",
      "url": "https://apnews.com/ea11e05b51ad898a0a980246cd8d7ad4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fb8a1653d14403b8e1d92759cb529f7/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM and CLAIRE RUSH",
      "description": "The mother of the 14-year-old who has been charged with murder over the fatal shooting of four people at his Georgia high school called the school before the killings, warning staff of an “extreme emergency” involving her son, a relative said.",
      "publishedAt": "2024-09-07T04:06:12Z",
      "title": "Mother of Georgia shooting suspect called school to warn of emergency, aunt says",
      "url": "https://apnews.com/92fce6b86f5e2ad23c3337aff1997cab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e1b4facf3fc4cd9b3e28fd6e1437ab9/1920.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG, JILL COLVIN and SCOTT BAUER",
      "description": "MOSINEE, Wis. (AP) — With just days to go before his first — and likely only — debate against Vice President Kamala Harris, former President Donald Trump posted a warning on his social media site threatening to jail those “involved in unscrupulous behavior” this election, which he said would be under intense scrutiny.",
      "publishedAt": "2024-09-07T04:04:52Z",
      "title": "Trump threatens to jail adversaries in escalating rhetoric ahead of pivotal debate",
      "url": "https://apnews.com/a6923d6c5758dabb6d959417ea9d7d12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc08189ef62f485da1e0c64c0e9c9962/3000.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "WASHINGTON (AP) — Minnesota Gov. Tim Walz touted Vice President Kamala Harris' record of defending LGBTQ+ rights on Saturday night, pledging to a supportive crowd that she will advance their cause if elected president.",
      "publishedAt": "2024-09-08T03:07:04Z",
      "title": "Walz touts Democratic record of defending LGBTQ+ rights, says Harris will advance cause if elected",
      "url": "https://apnews.com/44cc5b75d61ae14025a4133a3123d915",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7528822e06b45d6a718932cf4a1b8d4/3000.jpeg"
    },
    {
      "author": "JORGE RUEDA and JOSHUA GOODMAN",
      "description": "CARACAS, Venezuela (AP) — Former Venezuelan opposition presidential candidate Edmundo González has fled into exile after being granted asylum in Spain, delivering a major blow to millions who placed their hopes in his upstart campaign to end two decades of single party rule.",
      "publishedAt": "2024-09-08T03:30:27Z",
      "title": "Venezuela says opposition presidential candidate González has left the country for asylum in Spain",
      "url": "https://apnews.com/749131a560dd9d762e04e201e43b9495",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e2a6d750a154880b2763dd0d37fa016/3000.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "LONDON, Ky. (AP) — A manhunt was underway early Sunday as police searched for a gunman in a rural area of southeastern Kentucky near Interstate 75, according to authorities who said up to seven people were hurt in the shooting and a vehicle accident that accompanied the violence.",
      "publishedAt": "2024-09-07T23:56:29Z",
      "title": "Authorities search for shooter along I-75 in southeastern Kentucky with up to 7 people hurt",
      "url": "https://apnews.com/08391eb00af983c81a9bc8856201f572",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15230712d7f7418695dfc8e2c8ee29d0/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VANIMO, Papua New Guinea (AP) — Pope Francis celebrated the Catholic Church of the peripheries on Sunday as he traveled to the remote jungles of Papua New Guinea, bringing with him a ton of medicine and toys and a message of love overcoming violence for the people who live there.",
      "publishedAt": "2024-09-07T23:11:56Z",
      "title": "Pope arrives in remote jungles of Papua New Guinea, brings in a ton of humanitarian aid and toys",
      "url": "https://apnews.com/33fb0e7ca68a8c9595812271586388d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4670b9366dfe451cab5e6fd5031b5302/1920.jpeg"
    },
    {
      "author": "KATIE TAM and KANIS LEUNG",
      "description": "HONG KONG (AP) — In months, Lo Yuet-ping will bid farewell to a centuries-old village he has called home in Hong Kong for more than seven decades. The Cha Kwo Ling village in east Kowloon is filled with small houses built from metal sheets and stones, as well as old granite buildings, contrasting sharply with the high-rise structures that dominate much of the Asian financial hub.",
      "publishedAt": "2024-09-08T03:16:51Z",
      "title": "Villagers reluctant to say goodbye to one of Hong Kong's last squatter settlements",
      "url": "https://apnews.com/77079e3f9b555aa174124d06259b8f49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62169870a7b44e20996bf6b7698f71cb/3000.jpeg"
    },
    {
      "author": "JEROME PUGMIRE and CIARÁN FAHEY",
      "description": "PARIS (AP) — France defeated Argentina 3-2 on penalties under the lights of the Eiffel Tower for the gold medal in blind football on the penultimate day of the Paralympic Games.Frederic Villeroux scored the decisive spot kick to get the partisan home fans’ party underway after the teams drew 1-1 in normal time on Saturday.",
      "publishedAt": "2024-09-07T17:24:16Z",
      "title": "France wins gold in blind football at Paralympics under Eiffel Tower lights",
      "url": "https://apnews.com/433505c2a2cd6082debda6958b2d811d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a22e8dd0d0542cd82b5fe19eb0c8cff/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}