{
  "articles": [
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Joe Biden's name wasn't on the ballot, but history will likely remember Kamala Harris' resounding defeat as his loss too.",
      "publishedAt": "2024-11-07T05:01:54Z",
      "title": "Joe Biden gets blamed by Harris allies for the vice president's resounding loss",
      "url": "https://apnews.com/5588bafd05471d4c4fb0145db21291d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ba51477b042455ebb01cd81f4b36e2a/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, WILL WEISSERT and JILL COLVIN",
      "description": "WEST PALM BEACH, Fla. (AP) — Donald Trump spent his first day as president-elect receiving congratulatory phone calls from his defeated opponent, world leaders and President Joe Biden as he began the process of turning his election victory into a government.",
      "publishedAt": "2024-11-06T20:58:12Z",
      "title": "Trump receives congratulations and an invitation to the White House as Biden nudges on transition",
      "url": "https://apnews.com/f33e3d9f1647ee62709046993ffa082a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/191427a8518a4877965e40abc3361f7f/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, DARLENE SUPERVILLE and MATT BROWN",
      "description": "WASHINGTON (AP) — Faced with a sweeping rejection by American voters, Kamala Harris conceded the presidential election to Donald Trump on Wednesday and encouraged supporters to continue fighting for their vision of the country.",
      "publishedAt": "2024-11-06T17:12:57Z",
      "title": "Harris says nation must accept election results while urging supporters to keep fighting",
      "url": "https://apnews.com/ddeae9fb378530159201ef4196cba9b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcef89f168e0474fa2ca6b52494eeaf1/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Several large airstrikes hit Beirut’s southern suburbs early Thursday, including one on a site adjacent to Lebanon’s only international airport.",
      "publishedAt": "2024-11-07T06:31:52Z",
      "title": "Middle East latest: Large airstrikes hit Beirut suburbs as Israel expands northern Gaza operations",
      "url": "https://apnews.com/9e9fe099be1b073c96cc4613a92ba6c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32248f0630ab4af68b0e12295c2f4a6b/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — Hungary's fiery, right-wing leader says Donald Trump’s victory will help his own battle against immigration and multiculturalism and restore traditional family values.In Argentina, a president who once bear-hugged Trump at a political conference in Maryland is attacking his critics as rats and parasites, ranting against what he calls a corrupt elite and calling climate change “a socialist lie.”",
      "publishedAt": "2024-11-07T05:19:03Z",
      "title": "Trump's second term could realign US diplomacy toward authoritarian leaders",
      "url": "https://apnews.com/ff69aeab1d5a357848d5ee4001dc1591",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21b0ea2ea5294bd3b331f67645a5ff4b/3000.jpeg"
    },
    {
      "author": "SIMINA MISTREANU",
      "description": "TAIPEI, Taiwan (AP) — The first time China faced Donald Trump in the White House, there was a trade war, a breach of protocol involving Taiwan’s former leader, and a president-to-president bromance that turned sour.",
      "publishedAt": "2024-11-07T00:02:43Z",
      "title": "China is bracing for fresh tensions with Trump over trade, tech and Taiwan",
      "url": "https://apnews.com/7351ce1069654f1c1aefb560b36dcc17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5f8f800866c4fbe8c024144db2c20df/3000.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — American presidential elections are a moment when the nation holds up a mirror to look at itself. They are a reflection of values and dreams, of grievances and scores to be settled.",
      "publishedAt": "2024-11-06T22:14:41Z",
      "title": "Trump has vowed to shake some of democracy's pillars",
      "url": "https://apnews.com/4bf1465b465ea1da92fb7474f2f9becd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c09c8358d3d74687a8b12b47ad5091bc/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Federal Reserve officials are poised Thursday to reduce their key interest rate for a second straight time, responding to a steady slowdown of the inflation pressures that exasperated many Americans and contributed to Donald Trump's presidential election victory.",
      "publishedAt": "2024-11-07T05:01:27Z",
      "title": "Federal Reserve is set to cut interest rates again as post-election uncertainty grows",
      "url": "https://apnews.com/e6b837fd85cff5ad71d4e40939b97237",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5c24f0db3db429c901dd2fab25e70f8/3000.jpeg"
    },
    {
      "author": "ANDREA RODRÍGUEZ",
      "description": "HAVANA (AP) — Cuba was left reeling Thursday after a fierce Category 3 hurricane ripped across the island and knocked out the country’s power grid.",
      "publishedAt": "2024-11-07T04:15:52Z",
      "title": "Cuba left reeling after Category 3 hurricane ravages island and knocks out power grid",
      "url": "https://apnews.com/fc83c4db8e13b9da1a3fa7ec5b6f3319",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfb2004980bd4e5dab61353f1c8f7e1d/1920.jpeg"
    },
    {
      "author": "MELINA WALLING",
      "description": "CHICAGO (AP) — For the second year in a row, Earth will almost certainly be the hottest it's ever been. And for the first time, the globe this year reached more than 1.5 degrees Celsius (2.7 degrees Fahrenheit) of warming compared to the pre-industrial average, the European climate agency Copernicus said Thursday.",
      "publishedAt": "2024-11-07T03:04:27Z",
      "title": "European climate agency says this will likely be the hottest year on record -- again",
      "url": "https://apnews.com/92c46dfd01133f14c437c5d2bf5a5f8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a8fea1aa29c4712a64f3619f915dac2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}