{
  "articles": [
    {
      "author": "TIA GOLDENBERG, JACK JEFFERY and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Israel and Hamas agreed to extend their cease-fire for two more days past Monday, the Qatari government said, raising the prospect of a longer halt to their deadliest and most destructive war and further exchanges of militant-held hostages for Palestinians imprisoned by Israel.",
      "publishedAt": "2023-11-27T07:58:51Z",
      "title": "Israel and Hamas agree to extend truce for two more days, and to free more hostages and prisoners",
      "url": "https://apnews.com/852065d35c4643f4c874fb5993313b13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5206d2bf71b409d8dd59b4a786f5e1b/1920.jpeg"
    },
    {
      "author": "LISA RATHKE",
      "description": "Three college students of Palestinian descent who were outside getting some fresh air were seriously injured in Vermont over the weekend after a man approached them and shot them — an attack that is now being investigated as a possible hate crime, authorities said Monday.",
      "publishedAt": "2023-11-26T18:55:41Z",
      "title": "Suspect in shooting of 3 men of Palestinian descent near the University of Vermont pleads not guilty",
      "url": "https://apnews.com/ab836d1941e4237b3649353eaceb4092",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86b1972e86524f3691d2f6b38e8731e5/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — The five armed assailants captured by U.S. forces after seizing a commercial ship near Yemen over the weekend were likely Somali and not Iranian-backed Houthi rebels, the Pentagon said Monday.",
      "publishedAt": "2023-11-27T17:01:44Z",
      "title": "Assailants in latest ship attack near Yemen were likely Somali, not Houthi rebels, Pentagon says",
      "url": "https://apnews.com/bfa041bf410a40d4b79a086a6f88dd92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/212264d8a0a1439dbea32a85868b62b1/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump's company no longer prepares the sweeping financial statements that New York state contends were full of deceptive numbers for years, an executive testified Monday at the former president's civil fraud trial.",
      "publishedAt": "2023-11-27T16:52:01Z",
      "title": "As Trump's fraud trial eyes his sweeping financial reports, executive says they're not done anymore",
      "url": "https://apnews.com/18273bb1bab14eb90593cebebe1f960c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b55ffcfe016e41f5804c2430d9aab0bf/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Consumers are scouring the internet for online deals as they begin to cap off the five-day post-Thanksgiving shopping bonanza with Cyber Monday.Even though e-commerce is now part and parcel of our everyday lives and much of the holiday shopping season, Cyber Monday –- a term coined back in 2005 by the National Retail Federation –- continues to be the biggest online shopping day of the year, thanks to the deals and the hype the industry has created to fuel it.",
      "publishedAt": "2023-11-27T05:01:26Z",
      "title": "Cyber Monday marks the year's biggest online shopping day, and one more chance to save on gifts",
      "url": "https://apnews.com/edb7b802ff51d76db4274293439dafa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73b69ae810af460ab88c695d6fd1746e/3000.jpeg"
    },
    {
      "author": "GISELA SALOMON and SOPHIA TAREEN",
      "description": "HOMESTEAD, Fla. (AP) — In New York, migrants at a city-run shelter grumble that relatives who settled before them refuse to offer a bed. In Chicago, a provider of mental health services to people in the country illegally pivoted to new arrivals sleeping at a police station across the street.",
      "publishedAt": "2023-11-27T11:21:55Z",
      "title": "Tensions simmer as newcomers and immigrants with deeper US roots strive for work permits",
      "url": "https://apnews.com/ec0cfd003abab70bdba5f113f14bbdbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ad319ca25ed441b8bffa609b0ccec28/3000.jpeg"
    },
    {
      "author": "SHARON LURYE",
      "description": "SPRINGFIELD, La. (AP) — Arliya Martin accepted her high school diploma with relief and gratitude. It was her ticket to better-paying work, she felt, after getting kicked out of high school and toiling for eight years at factory jobs to support her children.",
      "publishedAt": "2023-11-27T08:08:39Z",
      "title": "Diplomas for sale: $465, no classes required. Inside one of Louisiana’s unapproved schools",
      "url": "https://apnews.com/a37a44dab69f11e2c37132549f9cd450",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcd95fc74fd14160a089d48015609d7c/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden plans to skip the annual climate talks in Dubai this week, an event that is expected to draw heads of state and diplomats from roughly 200 nations and the Vatican.",
      "publishedAt": "2023-11-27T15:05:48Z",
      "title": "President Joe Biden plans to skip U.N. climate talks beginning this week in Dubai",
      "url": "https://apnews.com/ab76a0325549b8b15b453361b2ca43b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4109034ad19042d59d16297891f0d2dc/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "AMERICUS, Ga. (AP) — Rosalynn Carter embarked on her final journey Monday to the Jimmy Carter Presidential Center as her family began three days of memorials for the former first lady and global humanitarian who died Nov.",
      "publishedAt": "2023-11-27T05:03:29Z",
      "title": "Rosalynn Carter tributes highlight her reach as first lady, humanitarian and small-town Baptist",
      "url": "https://apnews.com/2e798e487dc7e727a18f104d02248ad8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e39eb734b7fb42e4a8b1bf0980414294/3000.jpeg"
    },
    {
      "author": "THALIA BEATY",
      "description": "What motivates people to donate to charities or causes they care about is often deeply personal.",
      "publishedAt": "2023-11-27T05:58:40Z",
      "title": "Why do they give? Donors speak about what moves them and how they plan end-of-year donations",
      "url": "https://apnews.com/a0a954303a6e916e4cec3141201a82bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a79fbb674b84c329e52a6abf7a2d08f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}