{
  "articles": [
    {
      "author": "Olga R. Rodriguez, Julie Watson",
      "description": "Crews have pushed through mountainous wilderness in California near Lake Tahoe during a snowstorm to rescue six backcountry skiers who survived an avalanche but were trapped by its snow and ice. Nine others from their tour group remain missing. The Nevada County Sheriff's Office says two of the six were taken to a hospital for treatment. The sheriff’s office says there were 15 skiers on the trip — not 16 as initially believed. Extreme weather conditions in the Northern California mountains slowed the rescue effort. It took crews several hours to reach the skiers and take them to safety, where they were evaluated by the Truckee Fire Department.",
      "publishedAt": "2026-02-18T07:13:40Z",
      "title": "A California avalanche hits 16 backcountry skiers. 6 survivors located and 9 are missing",
      "url": "https://apnews.com/article/california-avalanche-backcountry-skiers-rescue-missing-f7b4a89c38af634e39a152a874db17f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/0985967/2147483647/strip/true/crop/1105x736+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2Fe5%2F8782f1d55bd764c87f978c7e1f1f%2Fb41d651afd5548d28cb86c303a1d8f7e"
    },
    {
      "author": "Kaitlyn Huamani, Barbara Ortutay",
      "description": "Mark Zuckerberg and opposing lawyers dueled in a Los Angeles courtroom Wednesday, where the Meta CEO answered questions about young people’s use of Instagram, his congressional testimony and internal advice he’s received to be “authentic” and not “robotic.” The plaintiff, a now 20-year-old woman, is seeking to hold social media companies responsible for harms to children who use their platforms. Meta and YouTube are the two remaining defendants in the case, which TikTok and Snap settled.",
      "publishedAt": "2026-02-18T06:00:06Z",
      "title": "Zuckerberg testifies at landmark social media addiction trial",
      "url": "https://apnews.com/article/mark-zuckerberg-trial-testimony-instagram-c8cbaa32ccbf4933ec3a7beebd6cf34b",
      "urlToImage": "https://dims.apnews.com/dims4/default/3041a46/2147483647/strip/true/crop/3782x2520+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2F26%2F042b435dd6ddd00d95ae97a8de42%2F6ccb3c7493c34209afe921060a87bb34"
    },
    {
      "author": "Julie Carr Smyth",
      "description": "Les Wexner’s long-time friendship with the late sexual predator Jeffrey Epstein will be the subject of a closed-door congressional deposition in Ohio. The billionaire retail magnate on Wednesday is expected to face questions about new revelations contained in Epstein-related documents released by the Justice Department. The 88-year-old Wexner is the retired founder of L Brands. He says he intends to cooperate with House Oversight Committee members' inquiry. As one of Epstein’s most prominent former friends, Wexner has already spent years answering for their association. He denies any knowledge of or involvement in Epstein’s crimes. Wexner's name appears more than 1,000 times.",
      "publishedAt": "2026-02-18T05:03:20Z",
      "title": "Retail mogul Les Wexner to face congressional questions over Epstein files",
      "url": "https://apnews.com/article/epstein-wexner-congress-subpoena-733833f6d648c09e6b3473eb1cd4009d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e81a72/2147483647/strip/true/crop/2137x1424+0+13/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2F8a%2F28bf0f9d4c76cb438701f5e89440%2Fc52c436d62e047a789003bffb411305c"
    },
    {
      "author": "Sam Metz, Samy Magdy",
      "description": "U.S. President Donald Trump’s Board of Peace is set to meet for the first time on Thursday in Washington. It's an early test of whether one of his marquee foreign policy initiatives can gain broad support or advance the shaky ceasefire agreement in the Gaza Strip. Trump’s ballooning ambitions for the board extend from governing and rebuilding Gaza as a futuristic metropolis to challenging the United Nations Security Council’s role in solving conflicts. But they could be tempered by the realities in Gaza, where there has so far been limited progress in achieving the narrower aims of the ceasefire.",
      "publishedAt": "2026-02-18T16:39:09Z",
      "title": "Trump's Board of Peace to meet as Gaza truce faces challenges",
      "url": "https://apnews.com/article/board-of-peace-explainer-trump-gaza-meeting-32c489a86937f91d6649df4f48f1dcdc",
      "urlToImage": "https://dims.apnews.com/dims4/default/5322733/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F69%2Fdea5f93f11ca12e9d11683458c52%2F787cb054fdff442db0892ed6ca4d7bae"
    },
    {
      "author": "Matt Brown",
      "description": "The Rev. Jesse Jackson’s two presidential runs and his life of activism inspired leaders across generations. Politicians and activists shared tributes after Jackson's death Tuesday and said his message still guides their work. Georgia Sen. Raphael Warnock says Jackson showed him what was possible and pushed him to fight for justice. Jackson’s 1984 and 1988 presidential campaigns led Democrats to open up their primary system. That shift helped former President Barack Obama win two decades later. Jackson also mentored young leaders through his Rainbow PUSH Coalition. Scores of activists, political operatives and members of Congress credited their careers to Jackson.",
      "publishedAt": "2026-02-18T17:52:18Z",
      "title": "Jesse Jackson’s 1988 presidential run inspired generations",
      "url": "https://apnews.com/article/jesse-jackson-legacy-politics-race-ethnicity-7c88b376fbfc94697f2b57797edb24bf",
      "urlToImage": "https://dims.apnews.com/dims4/default/487631b/2147483647/strip/true/crop/3000x1999+0+56/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2Fd3%2Fd8909a63bbac5804a4f519a45df5%2Ff9ad8b525b1346e9acfc282972ce8e82"
    },
    {
      "author": "Josh Funk",
      "description": "The federal Transportation Department says more than 550 commercial driving schools in the U.S. that train truckers and bus drivers must close after investigators found they employed unqualified instructors, failed to adequately test students and other safety issues. The department plans to announce this latest move to improve safety in the trucking industry later Wednesday. And unlike the previous action last fall to decertify up to 7,500 schools that included many defunct operations, this is focused on active schools with significant shortcomings. The department has been aggressively going after states that handed out commercial driver’s licenses to immigrants who shouldn’t have qualified for them ever since a fatal crash in Florida in August.",
      "publishedAt": "2026-02-18T19:57:42Z",
      "title": "Transportation Department to shut down driving schools for failing to meet safety standards",
      "url": "https://apnews.com/article/commercial-drivers-license-cdl-mills-duffy-schools-9af984e6d3318cfb722d1fcf48b2c2a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Linley Sanders",
      "description": "Democratic candidates have notched a series of wins in recent special elections — but a new AP-NORC poll finds views of the Democratic Party among rank-and-file Democrats have not bounced back since President Donald Trump’s victory in 2024. Democrats’ favorability among the party’s rank-and-file plummeted after the 2024 election. The latest measure of how Democrats view their party hasn't improved since then. The midterm elections are still many months away, and lackluster favorability doesn’t spell electoral doom. Other factors could benefit Democrats this year, including broadly negative views of Trump and other Republicans. But the lack of enthusiasm could be a longer-term problem for the party.",
      "publishedAt": "2026-02-18T12:08:42Z",
      "title": "Many Democrats are still down on the Democrats, new poll shows",
      "url": "https://apnews.com/article/poll-trump-democrats-republicans-parties-abc06b4ddc9b3aca7065ead47d43c75b",
      "urlToImage": "https://dims.apnews.com/dims4/default/991e400/2147483647/strip/true/crop/8570x5710+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2Fc1%2F93d32e6cb7ad7e0f2886bfb40a52%2F58b7c80d6a774481958734f14731f008"
    },
    {
      "author": "Jamey Keaten, Illia Novikov",
      "description": "U.S.-brokered talks between Russian and Ukrainian envoys are continuing in Geneva, with both sides apparently still far apart on peace terms. Ukrainian delegate Rustem Umerov said working groups on Wednesday are reviewing political and military issues. The talks mark a third round of direct meetings organized by the U.S., after earlier sessions in Abu Dhabi. Trump envoy Steve Witkoff said U.S. efforts have made meaningful progress, but gave no details. Fighting continues along the long front line. Ukraine reports Russia launched a ballistic missile and more than 100 drones overnight. A drone strike in Zaporizhzhia killed a woman and injured seven.",
      "publishedAt": "2026-02-18T09:25:16Z",
      "title": "Ukrainian and Russian envoys hold a second day of US-brokered talks in Geneva",
      "url": "https://apnews.com/article/russia-ukraine-war-talks-geneva-0f22fa796cafd6606a88ad1b101ab3fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/147a2c4/2147483647/strip/true/crop/10867x7241+0+455/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F04%2F7f94c7ea4c4c5447745ae566cb00%2F7c8db2b42d99414faa55f536e3d73769"
    },
    {
      "author": "David Bauder",
      "description": "Late-night host Stephen Colbert isn't backing down from his public dispute with CBS bosses over what he can air on his show. He said Tuesday night that he was surprised by a network statement that denied Colbert had been told he couldn't air an interview with a Texas Senate candidate for fear of triggering a little-known “equal time” rule by the FCC. CBS said its lawyers had only advised him that he couldn't broadcast the interview, which aired on YouTube instead. Colbert said that he was surprised that CBS parent company Paramount “would not stand up to these bullies” in the Trump administration.",
      "publishedAt": "2026-02-18T12:19:55Z",
      "title": "Stephen Colbert mocks CBS statement over late-night show controversy",
      "url": "https://apnews.com/article/colbert-talarico-cbs-trump-fcc-014a0531715f098fbcd7902476a22590",
      "urlToImage": "https://dims.apnews.com/dims4/default/80088f9/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2Fb4%2F633c069725bd8fd9dd0cabc47b79%2F949d149e933b479687a2801cebf07086"
    },
    {
      "author": null,
      "description": "American superstar Mikaela Shiffrin has put in two dominant runs to win the women’s slalom by a massive 1.50 seconds. It ended a run of eight straight Olympic races without a medal for arguably the greatest Alpine skier of all time. Canada avoided what would have been a stunning quarterfinal exit at the Olympics by rallying to beat Czechia 4-3 in overtime. Johannes Hoesflot Klaebo’s golden run continued as the Norwegian cross-country star secured his fifth gold at these Games and a record 10th overall by winning the men’s team sprint. Su Yiming of China won the gold medal in men’s slopestyle snowboarding.",
      "publishedAt": "2026-02-18T18:33:33Z",
      "title": "Shiffrin wins slalom at Olympics, Klaebo claims 10th gold, Canada wins in OT",
      "url": "https://apnews.com/article/milan-cortina-winter-olympics-da916c274b64073a1c4320eb31647619",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a8a172/2147483647/strip/true/crop/2016x1343+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F7b%2Faa3d9f36262aba544de8277e11a8%2F0264cda9e018449cb1107a4a9259ffb7"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}