{
  "articles": [
    {
      "author": "Jamey Keaten, David Mchugh",
      "description": "U.S. and Chinese officials say they have reached a deal to roll back most of their recent tariffs and call a 90 day pause so they can keep talking to resolve their trade disputes. U.S. Trade Representative Jamieson Greer said Monday the U.S. has agreed to drop its 145% tariff rate on Chinese goods by 115 percentage points to 30%, while China has agreed to lower its rate on U.S. goods by the same amount to 10%. Greer and Treasury Secretary Scott Bessent announced the tariff reductions at a news conference in Geneva. They say the two sides have set up consultations to continue discussing their trade issues. The announcement by the U.S. and China sent shares surging.",
      "publishedAt": "2025-05-12T08:10:50Z",
      "title": "US and China reach deal to roll back most tariffs for 90 days",
      "url": "https://apnews.com/article/china-us-switzerland-tariffs-negotiations-b3f5174d086e39b2522ab848ddad9372",
      "urlToImage": "https://dims.apnews.com/dims4/default/e92fc37/2147483647/strip/true/crop/6524x3670+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1c%2F8d%2F4d1ff242558da5101f83aea40341%2F91a6937c3792489ab181893c5f91e436"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy, Tia Goldenberg",
      "description": "The Hamas militant group says it will release an American-Israeli hostage held in Gaza during the day. In a statement, Hamas did not immediately disclose further details about the release expected on Monday. Hamas had announced on Sunday that it would free Edan Alexander as a good will gesture for the Trump administration. Alexander, an Israeli soldier, was taken captive on Oct. 7, 2023. Israeli authorities earlier acknowledged Alexander's planned release, without saying when it would happen. It would be the first hostage release since Israel shattered an 8-week ceasefire with Hamas.",
      "publishedAt": "2025-05-12T07:36:30Z",
      "title": "Hamas says it will release American-Israeli hostage Edan Alexander on Monday",
      "url": "https://apnews.com/article/mideast-wars-gaza-hostages-05-12-2025-72ca1188e3df7677870fb518191c14df",
      "urlToImage": "https://dims.apnews.com/dims4/default/464f1a1/2147483647/strip/true/crop/6510x3662+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2F58%2Ffd77369edf973ca68eb5ad1efba8%2F41e2edda21d14e8abb1f75df74171a78"
    },
    {
      "author": "Jon Gambrell, Tia Goldenberg",
      "description": "U.S. President Donald Trump’s visit to the Middle East this week as scheduled won’t include a visit to Israel to discuss the war in Gaza, or talks with Iran about its nuclear program. Instead, Trump will travel to Saudi Arabia, Qatar and the United Arab Emirates, three energy-rich monarchies home to existing or planned Trump-branded real estate projects – places where he aims to leverage American economic interests to do what he personally revels in: making business deals. But Trump won’t be able to avoid altogether diplomacy on Gaza or Iran: The Gulf countries hosting him are also interested in easing the regional tensions that emanate from these two places.",
      "publishedAt": "2025-05-12T05:13:10Z",
      "title": "Trump visiting the Mideast as regional crises flare",
      "url": "https://apnews.com/article/trump-middle-east-saudi-qatar-iran-israel-452018863e00f7739078d5b912293894",
      "urlToImage": "https://dims.apnews.com/dims4/default/ab7e560/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2Ff8%2F8c3f7ed0597742befb1f85279357%2Fdebebfb71acd43fe88ccf7e1507c9255"
    },
    {
      "author": null,
      "description": "A Kurdish militant group announced a historic decision Monday to disband and disarm as part of a new peace initiative with Turkey, after four decades of armed conflict. The decision by the Kurdistan Workers’ Party, or PKK, was announced by the Firat News Agency, a media outlet close to the group. It comes days after it convened a party congress in northern Iraq.",
      "publishedAt": "2025-05-12T06:17:25Z",
      "title": "PKK militant group to disband and disarm as part of peace initiative with Turkey",
      "url": "https://apnews.com/article/turkey-kurdish-militants-disarm-9f4347a04cba48ceb509d2e82023a19e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8dc1bd0/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2Fa1%2F50d68e8567d9ae1052a10f927e06%2Fbbd113952f27400aaa795696690df7f6"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy says he is pleased to see that Russia is finally engaging with finding an end to the war, but there must be a ceasefire before peace talks can start. Calling it a “positive sign,” he said in a post on X Sunday that “the entire world has been waiting for this for a very long time. And the very first step in truly ending any war is a ceasefire.” Russian President Vladimir Putin in remarks to the media overnight effectively rejected the ceasefire proposal and proposed restarting direct talks with Ukraine in Istanbul on May 15 instead.",
      "publishedAt": "2025-05-11T08:32:26Z",
      "title": "Ukrainian president welcomes Russian overtures but insists on ceasefire before peace talk",
      "url": "https://apnews.com/article/russia-ukraine-war-ceasefire-2b3d2fad88436c5406ea63f81ac554ef",
      "urlToImage": "https://dims.apnews.com/dims4/default/09b03ee/2147483647/strip/true/crop/5000x2813+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F15%2F505170ed1ddbc772ba9d2b82f075%2F47a85f1fedd6499fbeaaeef8b44612ff"
    },
    {
      "author": "Rajesh Roy",
      "description": "Indian and Pakistan authorities say there are no reported incidents of firing along the heavily militarized region between their countries overnight, the first time in recent days that the two nations have not been shooting at each other. Senior military officials from India and Pakistan are scheduled to speak later Monday to assess where the ceasefire holds. India and Pakistan on Saturday reached an understanding to stop all military actions on land, in the air and at the sea, in a U.S.-brokered ceasefire to stop escalating hostilities between the two nuclear-armed rivals that threatened regional peace.",
      "publishedAt": "2025-05-12T05:23:04Z",
      "title": "First night of calm reported along India-Pakistan border, ceasefire holds",
      "url": "https://apnews.com/article/india-pakistan-ceasefire-war-kashmir-214bde245a63339617dd644e061fbbd2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6f1787/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F5d%2F3e70166b40e93a5eda6c4b7ea62a%2F0425c53778a04861bf3d6804036b8e6a"
    },
    {
      "author": "Lisa Mascaro",
      "description": "House Republicans have unveiled the cost-saving centerpiece of President Donald Trump’s “big, beautiful bill.” Tallying hundreds of pages, it involves at least $880 billion in cuts largely to Medicaid, the nation's health care program for more than 70 million Americans. The savings are needed to help cover the cost of $4.5 trillion in tax breaks. But it's setting off the biggest political fight over health care since Republicans tried to repeal and replace the Affordable Care Act, or Obamacare, during Trump’s first term in 2017 — which ended in failure. While Republicans insist they are simply rooting out “waste, fraud and abuse” to generate health care savings, Democrats warn that millions of Americans will lose coverage.",
      "publishedAt": "2025-05-12T04:36:35Z",
      "title": "House Republicans unveil Medicaid cuts in Trump's big bill",
      "url": "https://apnews.com/article/medicaid-cuts-trump-tax-cuts-bill-1e2b12a91a3d12ceb0420ce7053de58e",
      "urlToImage": "https://dims.apnews.com/dims4/default/73f6bdf/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2F25%2F369171fdb34a27b2b876d99e47b4%2F55766a219ddf4338afdcc7480c4d320e"
    },
    {
      "author": "Will Weissert, Amanda Seitz",
      "description": "President Donald Trump says he’ll sign an executive order that, if implemented, could bring down the costs of some medications. He's reviving a failed effort from his first term on an issue he’s talked up since even before he became president. The order Trump is promising to sign Monday will direct the Department of Health and Human Services to tie what Medicare pays for medications administrated in a doctor’s office to the lowest price paid by other countries. In his post Sunday on his social media site, Trump said: “I will be instituting a MOST FAVORED NATION’S POLICY whereby the United States will pay the same price as the Nation that pays the lowest price anywhere in the World.\"",
      "publishedAt": "2025-05-11T23:17:19Z",
      "title": "Trump to sign executive order to cut prices of medicines",
      "url": "https://apnews.com/article/trump-prescription-drugs-most-favored-nation-35c281b542f0f3938489ee7e9360322b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3be99c/2147483647/strip/true/crop/4966x2793+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F2c%2Fa4ec3858b48224502293eddebe15%2Fc07f49e079da4cdb998abe010c115503"
    },
    {
      "author": "Jiang Junzhe, Elaine Kurtenbach",
      "description": "World shares and U.S. futures have surged after the U.S. and China announced they were suspending for 90 days most of the sharp tariff hikes each has imposed since U.S. President Donald Trump escalated his trade war. A joint statement said the U.S. would cut tariffs on Chinese goods to 30% from as high as 145%. China said its tariffs on U.S. goods would fall to 10% from 125%. U.S. futures gained more than 2% early Monday and shares in Asia and Europe also jumped. The agreement to talk followed two days of meetings in Geneva, Switzerland. On Friday, the S&P 500 slipped 0.1% and the Dow industrials fell 0.3%. The Nasdaq composite was little changed.",
      "publishedAt": "2025-05-12T03:58:45Z",
      "title": "World shares and US futures advance after China-US trade pact",
      "url": "https://apnews.com/article/stocks-markets-trade-trump-catl-62fbd84396aaea011c68231363b283de",
      "urlToImage": "https://dims.apnews.com/dims4/default/952c5a2/2147483647/strip/true/crop/4260x2396+0+222/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F14%2F9b1c1975bdfed1398d39ae13c0bf%2Fb87abd4f8618423aa05bb33607186420"
    },
    {
      "author": "The Associated Press",
      "description": "For over half a century, Gérard Depardieu stood as a towering figure in French cinema, a titan known for his commanding physical presence, instinct, sensibility and remarkable versatility.",
      "publishedAt": "2025-05-12T06:48:38Z",
      "title": "A timeline of the rise and fall of French movie star Gérard Depardieu",
      "url": "https://apnews.com/article/france-depardieu-timeline-photos-6bab221342ae3edeefbabb096f668d60",
      "urlToImage": "https://dims.apnews.com/dims4/default/7837055/2147483647/strip/true/crop/3093x1740+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fe7%2Fc66c8285b9b40acc52d55085f91f%2Fdee7d31711ca4c9880030b22887f4edc"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}