{
  "articles": [
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Former President Donald Trump pleaded not guilty on Thursday and sought to sever his case from some other defendants who are accused along with him of illegally trying to overturn the results of the 2020 election in Georgia.",
      "publishedAt": "2023-08-31T15:17:36Z",
      "title": "Trump pleads not guilty in Georgia election subversion case, seeks to sever his case from others",
      "url": "https://apnews.com/25a0d9cffd038eb88b805525c85ed0c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a788909e1564c4db652f18a3a2a2646/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Supreme Court Justice Clarence Thomas acknowledged Thursday that he took three trips last year aboard a private plane owned by Republican megadonor Harlan Crow even as he rejected criticism over his failure to report trips in previous years.",
      "publishedAt": "2023-08-31T14:35:19Z",
      "title": "Justice Clarence Thomas reports he took 3 trips on Republican donor's plane last year",
      "url": "https://apnews.com/08ec6e88a7c29c55c9d3991903ca0db7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acc2915556f6413394622ecabce537c5/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — A former organizer of the far-right Proud Boys extremist group was sentenced on Thursday to 17 years in prison for spearheading an attack on the U.S.",
      "publishedAt": "2023-08-31T16:43:02Z",
      "title": "Ex-Proud Boys organizer gets 17 years in prison, second longest sentence in Jan. 6 Capitol riot case",
      "url": "https://apnews.com/5c8bf8a8e5dc6381e7387e31e554cee6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe453f688b0146d8a1c60d9667c7f27c/2446.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and CHRISTINA A. CASSIDY",
      "description": "WASHINGTON (AP) — More than a dozen people nationally have been charged with threatening election workers by a Justice Department unit trying to stem the tide of violent and graphic threats against people who count and secure the vote.",
      "publishedAt": "2023-08-31T15:54:19Z",
      "title": "Election workers have gotten death threats and warnings they will be lynched, the US government says",
      "url": "https://apnews.com/f17df44d63156a28eaa0862b0aa08f0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17dc7e6ad6a24d6bb0113d78c6d25115/3000.jpeg"
    },
    {
      "author": "REBECCA BLACKWELL and TERRY SPENCER",
      "description": "HORSESHOE BEACH, Fla. (AP) — Tropical Storm Idalia headed out to sea Thursday after thrashing parts of Florida and Georgia with punishing rains and destructive winds, leaving residents to begin the arduous process of clearing fallen trees, restoring electricity and picking through the debris of devastated homes.",
      "publishedAt": "2023-08-31T05:54:09Z",
      "title": "Tropical Storm Idalia leaves shredded homes, roads blocked with powerlines in Florida and Georgia",
      "url": "https://apnews.com/6fcf457b3c1da43c208730bb998cdd0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/354eb1cf48a1451b89d781da3a8ed899/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "KANSAS CITY, Mo. (AP) — A Missouri judge ruled Thursday that the 84-year-old white homeowner who shot a Black teenager after he mistakenly went to the man’s house must stand trial. Clay County Judge Louis Angles issued the ruling after hearing from several witnesses at a preliminary hearing, including Ralph Yarl, the teenager who was shot by Andrew Lester on April 13 when Yarl went to the wrong house to pick up his younger brothers.",
      "publishedAt": "2023-08-31T16:47:45Z",
      "title": "Judge rules white man will stand trial for shooting Black teen Ralph Yarl, who went to wrong house",
      "url": "https://apnews.com/d2d210695772de5435c70039f0b36504",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f6fa2a3e3b34d41aa78a52ee0d68090/2429.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Biden administration is proposing a rule that would require thousands more firearms dealers to run background checks, in an effort to combat rising gun violence nationwide.",
      "publishedAt": "2023-08-31T17:28:47Z",
      "title": "Biden administration proposes rule that would require more firearms dealers to run background checks",
      "url": "https://apnews.com/d53441dc0242c515b6b1478ab27a5dac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d4a3250cf5e41988b7d6ec9ad5a9d4e/3000.jpeg"
    },
    {
      "author": "RANDALL CHASE",
      "description": "DOVER, Del. (AP) — A federal judge in Delaware ordered prosecutors and defense attorneys on Thursday to provide a status report regarding a felony gun charge against Hunter Biden.Judge Maryellen Noreika directed lawyers to provide the report by next Wednesday, including any steps they believe the court needs to take.",
      "publishedAt": "2023-08-31T18:11:28Z",
      "title": "Delaware judge orders status report on felony gun charge against Hunter Biden",
      "url": "https://apnews.com/5887025e2caefef9bb5ddb23b69820e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0acd81aedc754c7592c2b3bfe3f16ab8/2344.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — A nighttime fire ripped through a rundown apartment building mainly occupied by homeless people and squatters in Johannesburg early Thursday, leaving at least 74 dead, officials said.",
      "publishedAt": "2023-08-31T05:23:04Z",
      "title": "At least 74 are dead, many of them homeless, as fire rips through a rundown building in South Africa",
      "url": "https://apnews.com/a365fc66541584e61ec5cd3e7b375e67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cf7d73945b640879b8776f9a3982588/1920.jpeg"
    },
    {
      "author": "ROB MAADDI",
      "description": "One No. 12 started the clock on the countdown to his gold jacket and another switched numbers, conferences and shades of green.The biggest storyline in the first NFL season this century without Tom Brady centers on Aaron Rodgers’ quest to turn the New York Jets into a championship contender.",
      "publishedAt": "2023-08-31T17:40:49Z",
      "title": "Aaron Rodgers' quest to turn Jets into contenders is NFL's top storyline entering the season",
      "url": "https://apnews.com/a21e885746d1ae8c5d40dc9e8c0eeefa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6adb2c6a826b4bc8bc6f42c95df5e754/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}