{
  "articles": [
    {
      "author": "KATE PAYNE and BILL BARROW",
      "description": "PLAINS, Ga. (AP) — Jimmy Carter 's long public goodbye began Saturday in south Georgia where the 39th U.S. president's life began more than 100 years ago.",
      "publishedAt": "2025-01-04T15:19:48Z",
      "title": "Jimmy Carter's 6-day funeral begins with a motorcade through south Georgia",
      "url": "https://apnews.com/39d9be789f75b477b34fccdc2531238c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16792f849b6047579018dfb105ad1ebc/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — This time was supposed to be different. But while House Speaker Mike Johnson on Friday avoided the dayslong ordeal that his predecessor, Kevin McCarthy, endured to become speaker, his relatively swift victory was hardly a unifying moment.",
      "publishedAt": "2025-01-04T13:29:08Z",
      "title": "House Speaker Mike Johnson held onto his job, but there are signs of trouble ahead",
      "url": "https://apnews.com/be61b59070a468862119799e847ae8d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c78702d1e8a245938425bcb3abf58274/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Inside the Capitol, reminders of the violence are increasingly hard to find.Scars on the walls have been repaired. Windows and doors broken by the rioters have been replaced.",
      "publishedAt": "2025-01-04T13:33:58Z",
      "title": "Reminders of Jan. 6 attack fade in the Capitol as Trump retakes power",
      "url": "https://apnews.com/af6fe32d72b36c880aec0639ba92e869",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9387e016d1374120a867627cdc220f6a/1920.jpeg"
    },
    {
      "author": "JIM MUSTIAN, JACK BROOK, STEPHEN SMITH and SARA CLINE",
      "description": "NEW ORLEANS (AP) — The man who rammed a pickup truck into a crowd of New Year's revelers in New Orleans had suspected bomb-making materials at his home and reserved the vehicle used in the deadly attack more than six weeks earlier, law enforcement officials told The Associated Press on Friday.",
      "publishedAt": "2025-01-04T15:27:20Z",
      "title": "New Orleans attacker had suspected bomb materials at home, reserved truck weeks ago, officials say",
      "url": "https://apnews.com/15400d7a4cb29c9cfce212b99cac637b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a19f8a435a947e0a998c611c1248d45/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — The State Department has informed Congress of a planned $8 billion weapons sale to Israel, U.S. officials say, as the American ally presses forward with its war against Hamas in Gaza.",
      "publishedAt": "2025-01-04T15:17:36Z",
      "title": "Congress is notified by the Biden administration of a planned $8 billion weapons sale to Israel",
      "url": "https://apnews.com/f6a8f788773ad12a34ad8fb6f7966026",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de953b9117754031ba758d3c5b9c1fb7/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Faced with the never-before-seen dilemma of how, when or even whether to sentence a former and future U.S. president, the judge in President-elect Donald Trump 's hush money case made a dramatic decision that could nevertheless bring the case to a muted end.",
      "publishedAt": "2025-01-04T05:09:04Z",
      "title": "Trump's sentencing is set for Jan. 10. Here's what could happen next",
      "url": "https://apnews.com/1347190de38eeef2efdac482e8144663",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16351d6c50564bedbcf9c42dbaba8f4b/3000.jpeg"
    },
    {
      "author": "BERNARD CONDON",
      "description": "NEW YORK (AP) — Your car is spying on you.That is one takeaway from the fast, detailed data that Tesla collected on the driver of one of its Cybertrucks that exploded in Las Vegas earlier this week.",
      "publishedAt": "2025-01-04T14:00:27Z",
      "title": "Tesla data helped police after Las Vegas truck explosion, but experts have wider privacy concerns",
      "url": "https://apnews.com/789dc864a0c138fd7c36ca8c94b0fbfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/872df8b62c804785916e2e9c94cec65f/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The congressional joint session to count electoral votes on Monday is expected to be much less eventful than the certification four years ago that was interrupted by a violent mob of supporters of then-President Donald Trump who tried to stop the count and overturn the results of an election he lost to Democrat Joe Biden.",
      "publishedAt": "2025-01-04T13:46:43Z",
      "title": "How Congress will certify Trump's Electoral College victory on Jan. 6",
      "url": "https://apnews.com/36d63d51027cce9c0a73a42c408ca6f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/744d7b1797aa4266bcc16bbe84e21e53/1920.jpeg"
    },
    {
      "author": null,
      "description": "A major winter storm forecast to produce heavy snow, significant ice and frigid temperatures was set to begin in the central U.S. on Saturday and move east over the next several days, according to the National Weather Service.",
      "publishedAt": "2025-01-04T05:08:24Z",
      "title": "What to know as snow, freezing rain and bitter cold heads through much of the US",
      "url": "https://apnews.com/400452961aa30309a5cf10dfa132c710",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b1930e6b0124b1f8ded3702660db319/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Former Secretary of State Hillary Clinton, Democratic philanthropist George Soros and actor-director Denzel Washington will be awarded the nation's highest civilian honor on Saturday in a White House ceremony.",
      "publishedAt": "2025-01-04T10:04:57Z",
      "title": "Hillary Clinton, George Soros and Denzel Washington will receive the highest US civilian honor",
      "url": "https://apnews.com/4b19a363d3058ac3b8107e2002b93651",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66b91fcf911244969333c25bd0ad75b1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}