{
  "articles": [
    {
      "author": "WILL WEISSERT, BILL BARROW and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden and his predecessor, Donald Trump, romped through more than a dozen states on Super Tuesday, all but cementing a November rematch and increasing pressure on the former president’s last major rival, Nikki Haley, to leave the Republican race.",
      "publishedAt": "2024-03-05T05:06:26Z",
      "title": "Biden and Trump dominate Super Tuesday races and move closer to a November rematch",
      "url": "https://apnews.com/e36971a222a2b50d35cb0a2c603ce4d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e00b5dc903a447dd9ffb6cc88decac68/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — The picture of the presidential race has hardly been cloudy for some time, even if it is one that most voters say they don't want to see. On not-so-Super Tuesday, there were few surprises.",
      "publishedAt": "2024-03-06T03:01:16Z",
      "title": "Super Tuesday takeaways: Biden and Trump momentum can't be slowed, Haley's hopes get even dimmer",
      "url": "https://apnews.com/9b61e8faf14e471ca4f7ea2d004221f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a89ef1410c64889ad434af6bcf1ac99/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Over the last five months, Israel has killed thousands of Hamas fighters, destroyed dozens of their tunnels and wreaked unprecedented destruction on the Gaza Strip.But it still faces a dilemma that was clear from the start of the war and will ultimately determine its outcome: It can either try to annihilate Hamas, which would mean almost certain death for the estimated 100 hostages still held in Gaza, or it can cut a deal that would allow the militants to claim a historic victory.",
      "publishedAt": "2024-03-06T05:04:20Z",
      "title": "Hostage crisis poses dilemma for Israel and offers a path to victory for Hamas",
      "url": "https://apnews.com/0b4720545d294b4eb25eb97055c238eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d2aaebea71b461a89782db6dbac9b5a/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Nearly five months of fighting has left much of Gaza in ruins and created a worsening humanitarian catastrophe, with many, especially in the devastated northern region, scrambling for food to survive while pressure grows internationally for Israel and Hamas to reach a deal.",
      "publishedAt": "2024-03-06T09:30:50Z",
      "title": "The Latest | As conditions worsen for Palestinians in Gaza, international pressure grows for a deal",
      "url": "https://apnews.com/5d64f0e7e09acce55231151109519601",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bcf4261d5ce4a0a9bf51b42f57c2684/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — When charismatic opposition leader Boris Nemtsov was gunned down on a bridge near the Kremlin in February 2015, more than 50,000 Muscovites expressed their shock and outrage the next day at the brazen assassination.",
      "publishedAt": "2024-03-06T05:15:58Z",
      "title": "How Putin's crackdown on dissent became the hallmark of the Russian leader’s 24 years in power",
      "url": "https://apnews.com/532705369591610a94e9e86340233380",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6918a1a30eb94e84805431786f6a1a4b/2774.jpeg"
    },
    {
      "author": "EVENS SANON, JOSHUA GOODMAN and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haiti’s prime minister landed in Puerto Rico on Tuesday, answering a key question on the minds of all Haitians ever since armed gangs plunged the long-suffering Caribbean nation into near anarchy: Where in the world is he?",
      "publishedAt": "2024-03-05T17:51:44Z",
      "title": "Haitian PM arrives in Puerto Rico after long absence as he struggles to get home to quell violence",
      "url": "https://apnews.com/0116d2ebac1b14a587baa176818055cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa345191699c41a2a4a8c91c670bedda/1920.jpeg"
    },
    {
      "author": "EILEEN NG",
      "description": "KUALA LUMPUR, Malaysia (AP) — A decade ago on March 8, a Malaysia Airlines flight vanished without a trace, becoming one of aviation’s biggest mysteries.",
      "publishedAt": "2024-03-06T04:21:08Z",
      "title": "MH370 disappeared a decade ago. Here's what we know about one of aviation's biggest mysteries",
      "url": "https://apnews.com/91b69d63a6bc57d6ad2bf3c1eaf6e4ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12f35574e6024152af768f575b8c7393/1920.jpeg"
    },
    {
      "author": "MICHAEL R. BLOOD",
      "description": "LOS ANGELES (AP) — Republican former baseball star Steve Garvey and Democratic Rep. Adam Schiff will compete in November for the U.S.",
      "publishedAt": "2024-03-05T05:10:41Z",
      "title": "Democrat Adam Schiff and Republican Steve Garvey set to compete for California Senate seat",
      "url": "https://apnews.com/1fc10223e5f54f247516d039ec9f062b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2880b487cccd4bfc947280627509d369/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden was sweeping every Democratic contest on Super Tuesday — except for American Samoa.",
      "publishedAt": "2024-03-06T03:03:22Z",
      "title": "Who is Jason Palmer? A previously unknown Democrat beats Biden in American Samoa's Democratic caucus",
      "url": "https://apnews.com/c4bc109a16c7ee7b083f6216b44ba0c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4388499bce374874861658338972fe41/1920.jpeg"
    },
    {
      "author": "SYLVIA HUI",
      "description": "LONDON (AP) — For Anna Gittins, three months would have spelled the difference between life and death. The elementary school principal from Hereford in western England was shocked when she found out she had advanced colorectal cancer in 2022.",
      "publishedAt": "2024-03-06T05:02:11Z",
      "title": "King Charles' diagnosis throws UK's long cancer treatment waiting times into sharp relief",
      "url": "https://apnews.com/1d519afeb31d840ed084e356f968fdc7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c71d892f46246c987b7eba94fe51b29/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}