{
  "articles": [
    {
      "author": "Laura Bargfeld, Hannah Schoenbaum",
      "description": "A man has sprayed an unknown substance on U.S. Rep. Ilhan Omar before being tackled to the ground during a town hall she was hosting. The incident took place in Minneapolis, where tensions over federal immigration enforcement have come to a head after agents fatally shot an intensive care nurse and a mother of three this month. The audience cheered as the man was pinned down and his arms were tied behind his back. In video of the incident, someone in the crowd can be heard saying, “Oh my god, he sprayed something on her.” Omar continued the town hall after he was ushered out of the room.",
      "publishedAt": "2026-01-28T01:22:27Z",
      "title": "Man arrested after spraying substance on Rep. Ilhan Omar",
      "url": "https://apnews.com/article/ilhan-omar-town-hall-sprayed-7f6ad0b9ece2ae8804b2efe5badd2991",
      "urlToImage": "https://dims.apnews.com/dims4/default/21a61d3/2147483647/strip/true/crop/1616x1077+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F06%2F82eb07a58391c0524318c5c1e8bb%2F13f1eb069abc42e8b2b79822232fcc89"
    },
    {
      "author": null,
      "description": "The chief federal judge in Minnesota says the Trump administration has failed to comply with orders to hold hearings for detained immigrants and has ordered the head of Immigration and Customs Enforcement to appear before him Friday to explain why he shouldn’t be held in contempt. In an order dated Monday, Chief Judge Patrick J. Schiltz said Todd Lyons, the acting director of ICE, must appear personally in court. Schlitz took the administration to task over its handling of bond hearings for immigrants it has detained. The order says Schlitz recognizes that ordering the head of a federal agency to appear personally is extraordinary, but that the “extent of ICE’s violation of court orders is likewise extraordinary.”",
      "publishedAt": "2026-01-27T13:27:48Z",
      "title": "ICE chief must appear in court to explain why detainees have been denied due process",
      "url": "https://apnews.com/article/immigration-enforcement-minnesota-ice-b0cec9d1c5bae4b62469011775082300",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Authorities in Arizona say one person was shot and in critical condition Tuesday in a shooting involving the Border Patrol near the U.S.- Mexico border. The Pima County Sheriff’s Department said it was working with the FBI and U.S. Customs and Border Protection in response to the shooting in Arivaca, Arizona, a community about 10 miles from the border. U.S. Customs and Border Protection and the FBI did not immediately respond to emails and telephone calls seeking more information.",
      "publishedAt": "2026-01-27T19:37:22Z",
      "title": "Person shot near US-Mexico border in Border Patrol incident",
      "url": "https://apnews.com/article/arizona-border-patrol-shooting-arivaca-5d097088d4851c86a2dcd3ba58250f2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Sam Metz, Wafaa Shurafa, Samy Magdy, Melanie Lidman",
      "description": "Israel is marking the end of a painful chapter after the return of the remains of the last hostage held in Gaza. Across the country, people removed yellow pins from their lapels and marked what many described as the fulfillment of a pledge to “bring them all home.” The return of Ran Gvili followed days of forensic work in northern Gaza, where teams combed a cemetery to locate, exhume and identify his remains, drawing on search units, intelligence officers and forensic dentists. Prime Minister Benjamin Netanyahu said Tuesday that Israel will reopen Gaza’s border crossing with Egypt in both directions, but he did not say when.",
      "publishedAt": "2026-01-27T16:11:50Z",
      "title": "Israel marks recovery of last hostage's remains",
      "url": "https://apnews.com/article/israel-final-hostage-return-gvili-d45bf64ffe40152dfc3e5113b2ae52d5",
      "urlToImage": "https://dims.apnews.com/dims4/default/810f592/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F45%2Fca%2F298a8064f58635faeaa98b62cce4%2Faac9001eef3946458b531764e72a83b2"
    },
    {
      "author": "Sophie Bates, Kristin Hall, Russ Bynum",
      "description": "Three Texas siblings who died in an icy pond are among several dozen deaths in U.S. states gripped by frigid cold. Crews scrambled Tuesday to repair power outages in the shivering South. Forecasters have warned the winter weather is expected to get worse. Brutal cold has lingered after a massive storm dumped deep snow across more than 1,300 miles from Arkansas to New England. Freezing temperatures have hovered as far south as Tennessee, Arkansas and North Carolina, with more record lows forecast down into Florida. More than 410,000 homes and businesses remain without power with over half the outages in Tennessee and Mississippi.",
      "publishedAt": "2026-01-27T05:59:57Z",
      "title": "Winter storm deaths rise and power outages drag on",
      "url": "https://apnews.com/article/frigid-temperatures-arctic-air-us-south-tennessee-9d4beb4d548e29d5ce737fd001d67a64",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6ecca0/2147483647/strip/true/crop/5600x3731+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2Fca%2Ff30d6a3098a34e0f211870f226e2%2F56b34b7c25cd4c6a98a46491172af869"
    },
    {
      "author": "Ken Moritsugu",
      "description": "U.K. Prime Minister Keir Starmer visits Beijing for a four-day visit to China aimed at repairing ties and expanding opportunities for British businesses in the world’s second-largest economy. He is the first British leader to come to Beijing since Theresa May in 2018. The relationship has deteriorated in recent years over growing concern about Chinese spying and surveillance, China’s support for Russia in the Ukraine war and Beijing’s crackdown on civil liberties in Hong Kong, the former British colony.",
      "publishedAt": "2026-01-28T07:56:27Z",
      "title": "Keir Starmer in China: Aiming to mend ties amid Chinese spying concerns",
      "url": "https://apnews.com/article/uk-china-starmer-visit-beijing-xi-trade-ecf9f2736489546818673c8f1b53483a",
      "urlToImage": "https://dims.apnews.com/dims4/default/66010cb/2147483647/strip/true/crop/2419x1612+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2Fd2%2Fd22f9b976cd4183ca56870b19d53%2F707d52abe1f1488fb483186b588b121c"
    },
    {
      "author": "Rajesh Roy",
      "description": "A private plane carrying a deputy chief minister has crashed in western India, killing the official and four other people. The aircraft, traveling from Mumbai to Baramati, crash-landed in an open field and burst into flames on Wednesday. The crash also claimed the lives of two of Ajit Pawar's staff members and two crew members. The aviation authorities confirmed there were no survivors. The reason for the crash was not immediately known. Television footage showed smoke rising from the wreckage in an open field. Pawar was a senior leader in state politics and part of Prime Minister Narendra Modi’s ruling coalition.",
      "publishedAt": "2026-01-28T06:31:53Z",
      "title": "Plane crash in western India kills deputy state minister and 4 others",
      "url": "https://apnews.com/article/india-plane-crash-ajit-pawar-modi-c9c3e127107bb606b24b6ae77e9fe939",
      "urlToImage": "https://dims.apnews.com/dims4/default/dd82f1c/2147483647/strip/true/crop/3648x2431+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F3b%2F7bdfb771902b3824c6e6a2ec8d24%2F1a9e445f0a3e4e82b3970a035e0ac5e6"
    },
    {
      "author": "Sam McNeil",
      "description": "The European Union and India have reached a free trade agreement to deepen economic and strategic ties after nearly two decades of negotiations. The agreement announced Tuesday reflects a new priority for the 27-nation EU, the world’s largest trading bloc, after the Trump administration threatened to impose tariffs because of opposition to American control of Greenland. It comes as many European leaders are calling for limiting the old consensus with Washington in favor of new partnerships across the globe. The accord could affect as many as 2 billion people and will see free trade on almost all goods between the EU’s 27 members and India.",
      "publishedAt": "2026-01-28T06:32:37Z",
      "title": "EU trade deal with India shows that Europe is seeking new partnerships",
      "url": "https://apnews.com/article/india-eu-european-union-trade-deal-4d2b0333040d7f4d055a7dfe9d8484a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/97f76da/2147483647/strip/true/crop/2647x1764+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fff%2F1786a55355ebc5ef00868d1638a6%2Fd3d0ed2451624237a90f08fa8bfc4668"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iranian officials have reached out to the Middle East as fears grow of a possible U.S. military strike. Saudi Arabia and the UAE have said they won't allow their airspace to be used for attacks. The U.S. has moved military assets into the region, but it's unclear what President Trump will decide. Protests in Iran have led to a violent crackdown, with over 6,000 people reportedly killed. Iran's state media calls protesters \"terrorists,\" and internet access has been cut off. Diplomacy efforts are ongoing, with calls between Iran and Arab nations to prevent further instability.",
      "publishedAt": "2026-01-28T09:30:23Z",
      "title": "Worry pervades Mideast over possible US strike on Iran",
      "url": "https://apnews.com/article/iran-protests-us-military-crackdown-5f6cb15275c575cefbb8fb41868a018a",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed36bc4/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F87%2F9cf0f7d5315c0b6ba12982bc8556%2F7ccc5efc079542b08e8698c701a25a3a"
    },
    {
      "author": "Meg Kinnard",
      "description": "Organizers are planning what they anticipate will be the largest \"No Kings\" protests yet, targeting what they call authoritarianism under President Donald Trump. Scheduled for March 28, the demonstrations will focus on the immigration crackdown in Minneapolis, where recent clashes have resulted in deaths. Ezra Levin from Indivisible predicts up to 9 million participants. This will be the third \"No Kings\" event, following protests last year against Trump's policies. Organizers emphasize nonviolent resistance and ongoing training to defend constitutional rights. They stress that the movement is about preserving democracy, not partisan politics.",
      "publishedAt": "2026-01-28T10:16:55Z",
      "title": "More 'No Kings' protests planned for March 28 following Minneapolis deaths",
      "url": "https://apnews.com/article/no-kings-protest-alex-pretti-minneapolis-immigration-0b34386da0bb3eeac939d9f934680b6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/07abc75/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F93%2F9f74971855b13a4c4307cc65ad4c%2F466a7a6141254e0c8c2197771df7c126"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}