{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and LEE KEATH",
      "description": "RAFAH, Gaza Strip (AP) — Israeli ground troops have advanced to “the gates of Gaza City” in heavy fighting with militants, the military said Wednesday, as hundreds of foreign nationals and dozens of seriously injured Palestinians were allowed to leave Gaza after more than three weeks under siege.",
      "publishedAt": "2023-11-01T06:39:52Z",
      "title": "After weeks in besieged Gaza, some foreign nationals and wounded Palestinians are allowed to leave",
      "url": "https://apnews.com/24a6ad56ff87a4154f250c708b5310dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c36e5178d5864580a83e231a1a37b1d1/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and AAMER MADHANI",
      "description": "MINNEAPOLIS (AP) — President Joe Biden said he thought there should be a humanitarian “pause” in the Israel-Hamas war, after his campaign speech Wednesday evening was interrupted by a protester calling for a cease-fire.",
      "publishedAt": "2023-11-02T01:11:32Z",
      "title": "Biden calls for humanitarian 'pause' in Israel-Hamas war",
      "url": "https://apnews.com/422ed95081e5fe224dd9f0ed7920c4e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1e1af18137b4403b653c8bed3294a80/2449.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "RABAT, Morocco (AP) — Arab nations that have normalized or are considering improving relations with Israel are coming under growing public pressure to cut those ties because of Israel's war with Hamas.",
      "publishedAt": "2023-11-01T20:47:56Z",
      "title": "Opposition mounts in Arab countries that normalized relations with Israel",
      "url": "https://apnews.com/0c4707ff246c0c25d1ca001f8b1e734a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16b2db99a11f4c4d9f2c706b1854a03b/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump Jr. testified Wednesday that he never worked on his father's financial statements, the documents now at the heart of the civil fraud trial that threatens former President Donald Trump’s real estate empire.",
      "publishedAt": "2023-11-01T04:05:27Z",
      "title": "Donald Trump Jr. testifies he never worked on the key documents in his father's civil fraud trial",
      "url": "https://apnews.com/3ceb1a1d9eefdc9fddec5d04ce813ea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23b3388064d64611becc3b183e1fde6d/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — The effort to ban former President Donald Trump from the ballot under the Constitution's “insurrection clause” turned to distant history on Wednesday, when a law professor testified about how the post-Civil War provision was indeed intended to apply to presidential candidates.",
      "publishedAt": "2023-11-01T18:22:44Z",
      "title": "Hearing to determine if Trump can be barred from office reaches far back in history for answers",
      "url": "https://apnews.com/ca5a632f46066bc31349849fe60a781a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29899847602f477cb5eb93116ec99907/3000.jpeg"
    },
    {
      "author": "DAVID BRANDT",
      "description": "PHOENIX (AP) — Nathan Eovaldi pitched six gutsy innings, Mitch Garver broke a scoreless tie with an RBI single in the seventh and the Texas Rangers are World Series champions for the first time in their 63-season franchise history after beating the Arizona Diamondbacks 5-0 in Game 5 on Wednesday night.",
      "publishedAt": "2023-11-02T03:05:39Z",
      "title": "Texas Rangers win first World Series title with 5-0 win over Arizona Diamondbacks in Game 5",
      "url": "https://apnews.com/c7ad4ecac587ddece819faf6475a539c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/495aec17006146de80ed596cc46d0484/3000.jpeg"
    },
    {
      "author": "MICHAEL MAROT",
      "description": "BLOOMINGTON, Ind. (AP) — Bob Knight, the brilliant and combustible coach who won three NCAA titles at Indiana and for years was the scowling face of college basketball, has died. He was 83.Knight's family made the announcement on social media on Wednesday night.",
      "publishedAt": "2023-11-01T23:04:40Z",
      "title": "Bob Knight, Indiana’s combustible coaching giant, dies at age 83",
      "url": "https://apnews.com/c29a7cb601f64e9181564037e8c78758",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac2a70f5ee164e10b01f1a12de099959/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Rep. George Santos easily survived a vote Wednesday to expel him from the House as most Republicans and 31 Democrats opted to withhold punishment while both his criminal trial and a House Ethics Committee investigation proceed.",
      "publishedAt": "2023-11-01T18:47:04Z",
      "title": "Rep. George Santos survives effort to expel him from the House. But he still faces an ethics report",
      "url": "https://apnews.com/249bd2341d157bc6727b77607d8d45ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16b7bcf0772f4221a45641de41d298ca/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and LOLITA BALDOR",
      "description": "WASHINGTON (AP) — Republican senators angrily challenged Sen. Tommy Tuberville on his blockade of almost 400 military officers Wednesday evening, taking over the Senate floor for more than four hours to call for individual confirmation votes after a monthslong stalemate.",
      "publishedAt": "2023-11-01T16:49:41Z",
      "title": "Republicans confront Tuberville over military holds in extraordinary showdown on Senate floor",
      "url": "https://apnews.com/99a156198d325a329a98208785ea80f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f30b4a6fcee84c98aa6f668549e4b7fc/2811.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — The mayors of Chicago, Denver, Houston, Los Angeles and New York are pressing to meet with President Joe Biden about getting federal help in managing the surge of migrants they say are arriving in their cities with little to no coordination, support or resources from his administration.",
      "publishedAt": "2023-11-01T16:10:24Z",
      "title": "The mayors of five big cities seek a meeting with Biden about how to better manage arriving migrants",
      "url": "https://apnews.com/f498da66af8fb0ff8df653969f3f7a7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e65bcf5a8d74fb194d0a57c1ae2b36c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}