{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Key Republicans and Democrats have been stalwart supporters of Ukrainian President Volodymyr Zelenskyy. But a blowup between the Ukrainian leader and President Donald Trump is threatening to change that. Zelenskyy had traveled to Washington to sign a deal Friday that would give the U.S. access to its mineral riches as Trump attempts to pressure Ukraine into a deal to end the war with Russia. Instead, the fallout from a heated Oval Office exchange between Trump, Zelenskyy and Vice President JD Vance further splintered American political support for Ukraine. Sen. Lindsey Graham, who has backed Ukraine, called the meeting a “complete, utter disaster.\"",
      "publishedAt": "2025-02-28T20:36:21Z",
      "title": "What US lawmakers are saying about the White House clash between Trump and Zelenskyy",
      "url": "https://apnews.com/article/republicans-trump-zelenskyy-meeting-64ec4a67fce4f04a2d189a1e0204b023",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb2a819/2147483647/strip/true/crop/5486x3086+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F70%2F8d4d345a334f1f6406ca4e6cf9bb%2F48c8bd586cbb436ab7967789d563bb64"
    },
    {
      "author": "Justin Spike",
      "description": "Ukrainians have rallied around President Volodymyr Zelenskyy as a defender of their country’s interests in the hours after he left the White House after an astonishing Oval Office blowout with President Donald Trump. Trump and Vice President JD Vance berated Zelenskyy during an Oval Office meeting on Friday for what they saw as a lack of gratitude for past U.S. aid, a confrontation that pleased Moscow. The friction cast doubt on future U.S. support for Ukraine amid its war with Russia. But despite the diplomatic fallout, many Ukrainians supported Zelenskyy’s firm stance. Officials across Ukraine praised their leader's resilience, while some cautioned against losing crucial U.S. backing.",
      "publishedAt": "2025-02-28T23:59:51Z",
      "title": "Ukrainians rally around Zelenskyy as defender of national interest after Oval Office blowout",
      "url": "https://apnews.com/article/oval-office-blowout-ukrainians-rally-zelenskyy-af89022fa54f57113666f180e23e2edd",
      "urlToImage": "https://dims.apnews.com/dims4/default/93e2f28/2147483647/strip/true/crop/5883x3309+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fd0%2Ffc0329cc4d049a27a346229e60a3%2Fac68587c620846f69bbc4787e2ea52a2"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Zelenskyy embraced by British prime minister a day after White House clash",
      "url": "https://apnews.com/article/zelenskyy-starmer-uk-british-white-house-trump-a05e6ec1c37aabdbb5067d8ce87d6d1e",
      "urlToImage": null
    },
    {
      "author": "Zeke Miller",
      "description": "President Donald Trump’s Oval Office thrashing of Ukraine’s Volodymyr Zelenskyy has laid bare the limits of a full-court press by America’s allies aimed at reshaping Trump’s determination to end Russia’s invasion even if the terms are not to Ukraine’s liking. It also shows the profound ways Trump feels emboldened to redirect U.S. foreign policy priorities toward his “America First” agenda in ways that extend well beyond those of his tumultuous first term. The episode has left in doubt the future of the U.S.-Ukraine relationship, and Kyiv’s ability to defend itself in the brutal conflict with Russia.",
      "publishedAt": "2025-03-01T05:02:31Z",
      "title": "Trump's Oval Office thrashing of Zelenskyy shows limits of Western allies' ability to sway US leader",
      "url": "https://apnews.com/article/trump-zelenskyy-oval-office-ukraine-russia-blowup-8aa63e55c859e8fea963911478c376ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/da358e0/2147483647/strip/true/crop/3889x2188+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F78%2Fa90e4688c7e28534410a87cf704b%2Fff78f74835e4497ebd26f9ffc7d865c9"
    },
    {
      "author": "Adriana Gomez Licon",
      "description": "President Donald Trump and Vice President JD Vance had a heated exchange with Ukrainian President Volodymyr Zelenskyy in the Oval Office over the war in Ukraine, accusing him of not showing gratitude after he challenged Vance on the question of diplomacy with Russia’s Vladimir Putin. The argument, broadcast globally on Friday, was perhaps unique in American history. It led to the rest of Zelenskyy’s White House visit being canceled and called into question how much the U.S. will still support Ukraine in its defense against Russia’s 2022 invasion.",
      "publishedAt": "2025-02-28T20:58:30Z",
      "title": "A transcript of Trump and Zelenskyy's Oval Office argument",
      "url": "https://apnews.com/article/trump-zelenskyy-vance-transcript-oval-office-80685f5727628c64065da81525f8f0cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c9e3b4/2147483647/strip/true/crop/3000x1688+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F49%2Fd2ae134e0b373d79553f54764f30%2F8fd972c8997a4122bb7524d4a3c3b60e"
    },
    {
      "author": "Samy Magdy, David Rising",
      "description": "A senior Hamas official says no progress has been made in the latest round of talks on the second phase of the ceasefire between Israel and the Palestinian militant group Hamas. It remained unclear whether the talks would resume. The first phase of the ceasefire, which paused 15 months of fighting, saw the release of 33 hostages, including eight bodies, in exchange for nearly 2,000 Palestinian prisoners. Phase one expires on Saturday, but under the terms of the deal, fighting is not to resume while negotiations are underway on the second phase, which could end the war in Gaza and see the remaining living hostages returned home.",
      "publishedAt": "2025-03-01T10:45:57Z",
      "title": "Hamas says 'no progress' on second ceasefire phase in indirect talks with Israel",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-03-01-2025-943564ec594b1246c7690d2560a65498",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ffe9e0/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2Fe8%2F6d819feb42a177f14da64274d288%2Fee2313152a394984b08698c7fdeb49af"
    },
    {
      "author": "Rodrique Ngowi, Jonathan J. Cooper",
      "description": "Demonstrators have gathered outside Tesla stores across the U.S. to protest the automaker’s billionaire leader, Elon Musk. Protesters are targeting Musk over his push to slash government spending on behalf of President Donald Trump. The demonstrations are part of a growing backlash in North America and Europe to Musk’s disruptive role in Washington. Critics of Trump, Musk and their cost-cutting initiative known as DOGE hope to discourage and stigmatize Tesla purchases, ultimately denting Musk’s fortune. Shares in Tesla, the world’s most valuable automaker, make up a significant portion of Musk’s wealth.",
      "publishedAt": "2025-03-02T00:01:38Z",
      "title": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line",
      "url": "https://apnews.com/article/elon-musk-tesla-protests-doge-3b3eba9313074ccf8e959a92486d900f",
      "urlToImage": "https://dims.apnews.com/dims4/default/3205b34/2147483647/strip/true/crop/4431x2492+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F7f%2F4cc8234bd1a561dc683cb229d948%2Fc1ec8750985f4763b793405b3ac57ff8"
    },
    {
      "author": "Andrew Wilks",
      "description": "Kurdish militants who have waged a 40-year insurgency in Turkey have declared a ceasefire, just two days after their imprisoned leader called for the group to disarm. The statement from the Kurdistan Workers’ Party, or PKK, was published on Saturday by the Firat News Agency, a media outlet close to the group. The group said the call by its leader indicated that a “new historical process has begun.\" The conflict between Turkey and the PKK, which has been declared a terrorist organization by Ankara and its Western allies, has led to tens of thousands of deaths since it began in 1984.",
      "publishedAt": "2025-03-01T07:01:25Z",
      "title": "Kurdish militants declare ceasefire in 40-year insurgency in Turkey",
      "url": "https://apnews.com/article/pkk-turkey-kurdish-militants-ceasefire-66bae6dd7d08c8144b683f92042fbfc9",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc42221/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2Fc3%2Ff7cc7d1a2ce1402b8d2aaf5d4da4%2F0f3d2ee1e7984193b4d1a9fffb82f118"
    },
    {
      "author": "Abdulrahman Shaheen",
      "description": "Some restaurants and coffee shops in Syria were closed during the day as observant Muslims began fasting during the holy month of Ramadan. Ramdan, which started in Syria on Saturday, is the first since the fall of the Assad family after five decades of rule. Syria’s interim Ministry of Religious Endowments reportedly ordered that all restaurants, coffee shops and street food stands be closed during the day and that people must not eat or drink in public or face punishment. Under Assad’s rule, during the Muslim holy month of Ramadan — when observant Muslims abstain from eating and drinking from sunrise to sunset — people were allowed to eat in public unlike this year.",
      "publishedAt": "2025-03-01T17:37:46Z",
      "title": "Syrians begin fasting during first Ramadan without Assad family rule in decades",
      "url": "https://apnews.com/article/ramadan-syria-assad-fasting-alsharaa-27be52ec156bf5f2f449dda332d0cd89",
      "urlToImage": "https://dims.apnews.com/dims4/default/6053a16/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2Fc6%2Fe4e8f9152cf700979bc426d74448%2Fcb08eb5dac6042ff93551811437e488f"
    },
    {
      "author": "Alanna Durkin Richer",
      "description": "A federal judge has ruled that the head of a federal watchdog agency must remain in his job, saying President Donald Trump’s bid to remove the special counsel was unlawful. U.S. District Judge Amy Berman Jackson sided Saturday with Hampton Dellinger, who leads the Office of Special Counsel, in a legal battle over the president’s authority to oust the head of the independent agency. Dellinger sued Trump last month after he was fired even though the law says special counsels can be removed by the president “only for inefficiency, neglect of duty, or malfeasance in office.” The Justice Department quickly filed court papers indicating it will challenge the ruling to Washington’s federal appeals court.",
      "publishedAt": "2025-03-02T01:40:37Z",
      "title": "Judge rules head of watchdog agency must keep his job, says Trump's bid to oust him was unlawful",
      "url": "https://apnews.com/article/trump-special-counsel-dellinger-whistleblower-firing-cdeb3bf8f2ce9175b03f4c3961a0ce88",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e04019/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2F7b%2F96b93a33df0106c2d38e716ed67f%2F4a02a14f0a0d447ba5f369d269aabba7"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}