{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump says he’s deploying 2,000 California National Guard troops to Los Angeles to respond to immigration protests, over the objections of California Gov. Gavin Newsom. It’s not the first time Trump has activated the National Guard to quell protests. In 2020, he asked governors of several states to send troops to Washington, D.C. to respond to demonstrations that arose after George Floyd was killed by Minneapolis police officers. Here are some things to know about when and how the president can deploy troops on U.S. soil.",
      "publishedAt": "2025-06-08T04:24:03Z",
      "title": "What to know about Trump's deployment of National Guard troops to LA protests",
      "url": "https://apnews.com/article/insurrection-act-trump-troops-newsom-military-national-guard-a842f79e1c0e244039be274a6f266a7a",
      "urlToImage": "https://dims.apnews.com/dims4/default/84a9b9b/2147483647/strip/true/crop/2974x1673+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2Fae%2Fa7bb5b876204248d3fcacd653669%2Ffbe5a926360b401d8c56d0bc5cda2a32"
    },
    {
      "author": null,
      "description": "Russian officials say that Moscow is still awaiting confirmation from Kyiv on a planned exchange of 6,000 bodies of soldiers killed in action and is accusing Ukraine of delaying the process. Lt. Gen. Alexander Zorin, a Russian negotiator, said on Sunday that Russia delivered 1,212 bodies of Ukrainian troops to a border site and is receiving “signals” the transfer may be postponed until next week. The swap was agreed during direct talks in Istanbul, though both sides have since accused each other of undermining the plan. Ukraine has denied a date was agreed and accused Russia of manipulating facts and submitting incorrect repatriation lists.",
      "publishedAt": "2025-06-08T09:41:32Z",
      "title": "Russia accuses Ukraine of delaying exchange of dead fighters",
      "url": "https://apnews.com/article/russia-ukraine-war-prisoner-swap-bodies-743d264ed87083e16846e668c35144f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/5abe438/2147483647/strip/true/crop/4129x2323+0+215/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2Ff7%2F9b91deb17e6413ef3d21324c0e4e%2Ff3fe84febe914d4c956d35f1bba6324e"
    },
    {
      "author": null,
      "description": "Palestinian health officials and witnesses say that at least four people were killed and others were wounded by Israeli fire around a kilometer from an aid distribution point in the Gaza Strip run by an Israeli and U.S.-backed group. Israel’s military said it fired warning shots at people who approached its forces. The bodies were brought to Nasser Hospital in Gaza's southern city of Khan Younis, which confirmed the toll. Palestinian witnesses said Israeli forces had fired on them at a roundabout in the nearby city of Rafah as they went to get food from a site run by the Gaza Humanitarian Foundation. There was no immediate comment from the foundation.",
      "publishedAt": "2025-06-08T08:32:09Z",
      "title": "At least 4 are killed by Israeli fire near a Gaza aid site, Palestinians say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-08-2025-e6a2ae2ca7bc02225ef3c75e7d62ebc4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Six decades after the federal government ordered Concordia Parish to desegregate its schools, the district remains racially divided. Black students make up more than 92% of Ferriday High School, while 15 minutes away, Vidalia High is 62% white. Yet state and local officials say it’s time to free Concordia Parish and other districts from court-ordered desegregation orders dating back decades. In a stunning shift that reverses decades of policy, they have allies in the federal government. The Trump administration has vowed to lift more desegregation plans from the 1960s. Civil rights activists say it would leave families with little recourse when they face discrimination.",
      "publishedAt": "2025-06-08T04:01:20Z",
      "title": "School desegregation: Trump officials vow to end Civil Rights-era orders",
      "url": "https://apnews.com/article/desegregation-race-consent-decree-school-1dd1a8be59bb0f9568d5685b8459f413",
      "urlToImage": "https://dims.apnews.com/dims4/default/53fe72e/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F4e%2Fd2424279efd6868272c0337ad51b%2F3f25246eef8a4b088a920d86b0749719"
    },
    {
      "author": null,
      "description": "Mohammad Sharafoddin, his wife and young son managed to make it out of Afghanistan as refugees nine years ago, at one point walking 36 hours over mountain passes. Sharafoddin hoped his wife's niece could follow them to their new home in South Carolina. But President Donald Trump's travel ban on people from Afghanistan and 11 other countries appears to have shut that door. Sharafoddin says his niece wants to be a doctor, and it is especially hard because she can't study in her home country under the Taliban, who returned to power in 2021 .",
      "publishedAt": "2025-06-08T04:10:24Z",
      "title": "Travel ban may shut door for Afghan family to bring niece to US for a better life",
      "url": "https://apnews.com/article/trump-travel-ban-afghanistan-d8221314a74a83a80cec37dd1bf101bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/20458ee/2147483647/strip/true/crop/5460x3071+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F26%2Fdd2bdb3c8d0c0032133b4f984f93%2Fd49625447f4141f1b116ff367768da3c"
    },
    {
      "author": null,
      "description": "Italians vote over two days on referendums that would make it easier for children born in Italy to foreigners to obtain citizenship, and on providing more job protections. But apparent low public awareness risks rendering the vote invalid if turnout is not high enough. Campaigners for the change in the citizenship law say it will help second-generation Italians born in the country to non-EU parents better integrate in a culture they already see as theirs. The referendum risks failure if 50% plus one of eligible voters don’t turn out. The measures were proposed by Italy’s main union and left-wing opposition parties.",
      "publishedAt": "2025-06-08T04:56:17Z",
      "title": "Italians vote on citizenship and job protections, but low turnout risks invalidation",
      "url": "https://apnews.com/article/italy-referendum-citizenship-foreigners-labor-meloni-93d77109b6b48fc10c7ba78dc03a929a",
      "urlToImage": "https://dims.apnews.com/dims4/default/73c54b6/2147483647/strip/true/crop/5479x3082+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F53%2F298aede3d32bd91bd4ffefdc418b%2F853683ad5201433284aab581ad2f13b4"
    },
    {
      "author": null,
      "description": "U.S.-China trade talks in London this week are expected to take up a series of disputes that have buffeted relations. Both sides agreed in Geneva last month to a 90-day suspension of most of the tariffs they had imposed on each other in an escalating trade war. Since then, the U.S. and China have exchanged angry words over advanced semiconductors, “rare earths” that are vital to many industries and visas for Chinese students at American universities. The meeting in London follows a phone call last week between U.S. President Donald Trump and Chinese leader Xi Jinping.",
      "publishedAt": "2025-06-08T07:36:34Z",
      "title": "What's at stake in US-China trade talks in London",
      "url": "https://apnews.com/article/us-china-tariff-trump-xi-trade-london-talks-7db44c1697a7c4cf781e0e1796470625",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0c4813/2147483647/strip/true/crop/3775x2123+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fe5%2F278a1c94f1d2c83094bbe54211bc%2F7af34119a3a64029b839891e5bea5a08"
    },
    {
      "author": null,
      "description": "This year's Boulder Jewish Festival is being reimagined to focus on community healing. That comes after an attack during a weekly gathering of a group that has been calling for Hamas to release Israeli hostages. The cultural celebration kicks off Sunday morning at the popular Pearl Street pedestrian mall — the same location where police say a man yelled “Free Palestine” and threw Molotov cocktails at the demonstrators. The man, Mohamed Sabry Soliman, has been charged with attempted murder and other crimes in a Colorado court. The festival will center the demonstrators' cause — raising awareness of the 58 people believed to still be in captivity in the Gaza Strip.",
      "publishedAt": "2025-06-08T04:18:19Z",
      "title": "Boulder Jewish Festival proceeds with enhanced security after attack",
      "url": "https://apnews.com/article/boulder-attack-jewish-festival-85a7660f14959ec5c6d27d0d665ae079",
      "urlToImage": "https://dims.apnews.com/dims4/default/c0b32c5/2147483647/strip/true/crop/3000x1688+0+371/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2Fbe%2Fe888e204708efc1b91e7402538ac%2F7e5ac8bb065c4047980bb91df39acc7e"
    },
    {
      "author": null,
      "description": "A pair of singing androids. Two Pulitzer Prize-winning plays. A drunken Mary Todd Lincoln. A musical with a corpse as its hero. A “Romeo and Juliet” with teddy bears and rave music. Not to mention George Clooney. Broadway has had a stuffed season with seemingly something for everyone and now it’s time to recognize the best with the Tony Awards. They're set for Sunday night on CBS and streaming on Paramount+ with Cynthia Erivo as host. Broadway buzz is usually reserved for musical but this year plays powered by A-list talent are driving the conversation.",
      "publishedAt": "2025-06-08T04:24:25Z",
      "title": "2025 Tony Awards offer many intriguing matchups",
      "url": "https://apnews.com/article/tony-awards-2025-337e617e5b3601503d65dbd7159856e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e37dcf2/2147483647/strip/true/crop/8058x4533+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F00%2Ffd6fc0d067ad7d1c01bb85004392%2F23d5fa950f61431f917517d9251aebac"
    },
    {
      "author": null,
      "description": "Jannik Sinner faces defending champion Carlos Alcaraz in the French Open final in a match pitting the world’s top two men’s players. They share seven major titles, four for Alcaraz and three for Sinner, who is in the French Open final for the first time. The top-ranked Sinner has not yet dropped a set at Roland-Garros while the No.2-ranked Alcaraz has dropped four sets. Sinner is on a 20-match winning streak in Grand Slam tournaments after winning the U.S. Open and the Australian Open. The 22-year-old Alcaraz has beaten the 23-year-old Sinner in their past four meetings and leads him 7-4 overall.",
      "publishedAt": "2025-06-08T06:00:06Z",
      "title": "Alcaraz takes on Sinner in men's French Open final",
      "url": "https://apnews.com/article/french-open-men-final-alcaraz-sinner-e0de8f0c10f4b3e988f31257a3e08a9c",
      "urlToImage": "https://dims.apnews.com/dims4/default/595ba96/2147483647/strip/true/crop/7094x3990+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2Fbd%2F68e26e6fd0fef8ea8bcd89fc9992%2F27fca6fb5c7d4944bae6a889f2b8d187"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}