{
  "articles": [
    {
      "author": "SAM MEDNICK, JOSEF FEDERMAN and BASSEM MROUE",
      "description": "JERUSALEM (AP) — Hamas announced Monday it has accepted an Egyptian-Qatari proposal for a cease-fire to halt the seven-month-long war with Israel in Gaza, hours after Israel ordered about 100,000 Palestinians to begin evacuating from the southern city of Rafah, signaling that a long-promised ground invasion there could be imminent.",
      "publishedAt": "2024-05-06T05:29:00Z",
      "title": "Hamas accepts a Gaza cease-fire proposal, but Israel hasn't commented",
      "url": "https://apnews.com/8659eae6e0a7362504f0aa4aa4be53e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1ef4bd1ac2d4564b00c5cdbb77d058c/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The judge presiding over Donald Trump's hush money trial fined him $1,000 on Monday and warned of jail time for future gag order violations while jurors heard testimony for the first time about the financial reimbursements at the center of the case.",
      "publishedAt": "2024-05-06T04:24:11Z",
      "title": "Trump fined $1,000 for gag order violation in hush money case as judge warns of possible jail time",
      "url": "https://apnews.com/c41df6a82434247352fe7a110daae981",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afeed8c0750740c088b93e3d21978124/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — French President Emmanuel Macron put trade disputes and Ukraine-related diplomatic efforts on top of the agenda for talks Monday with Chinese President Xi Jinping, who arrived in France for a two-day state visit opening his European tour.",
      "publishedAt": "2024-05-06T04:31:58Z",
      "title": "Macron puts trade and Ukraine as top priorities as China's Xi opens European visit in France",
      "url": "https://apnews.com/c7f48d55fd9ccb345fc6e9eda105f89b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5824275dfd24110aa8febbd8628a01d/1920.jpeg"
    },
    {
      "author": "GARANCE BURKE and ALAN SUDERMAN",
      "description": "FORT LAUDERDALE, Fla. (AP) — Donald Trump’s former campaign manager looked squarely into the camera and promised his viewers they were about to witness a bold new era in politics.“You’re going to see some of the most amazing new technology in artificial intelligence that’s going to replace polling in the future across the country,” said Brad Parscale in a dimly lit promotional video accentuated by hypnotic beats.",
      "publishedAt": "2024-05-06T04:04:09Z",
      "title": "Brad Parscale helped Trump win in 2016 using Facebook ads. Now he’s back, and an AI evangelist",
      "url": "https://apnews.com/3ff2c8eba34b87754cc25e96aa257c9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c9f0a1d2e2d4f5cbf8a60fcc462b19c/3000.jpeg"
    },
    {
      "author": "COURTNEY SUBRAMANIAN",
      "description": "WASHINGTON (AP) — President Joe Biden’s campaign and Democratic candidates are in a fevered race with Republicans over who can best exploit the potential of artificial intelligence, a technology that could transform American elections — and perhaps threaten democracy itself.",
      "publishedAt": "2024-05-06T04:08:58Z",
      "title": "Nervous about falling behind the GOP, Democrats are wrestling with how to use AI",
      "url": "https://apnews.com/520f22de269ba1eff24d1544ca38d569",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0db2d38979484f57a8725289600327e8/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russia on Monday threatened to strike British military facilities and said it would hold drills simulating the use of battlefield nuclear weapons amid sharply rising tensions over comments by senior Western officials about possibly deeper involvement in the war in Ukraine.",
      "publishedAt": "2024-05-06T08:10:42Z",
      "title": "Russia warns Britain and plans nuclear drills over the West's possible deepening role in Ukraine",
      "url": "https://apnews.com/b007cffdc4fc57922042a35fbe47907f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd18bb754c01456fbae88c8961fc323f/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE and LEKAN OYEKANMI",
      "description": "HOUSTON (AP) — Floodwaters closed some Texas schools on Monday after days of heavy rains pummeled the Houston area and led to hundreds of rescues including people who were stranded on rooftops.",
      "publishedAt": "2024-05-06T04:30:11Z",
      "title": "Heavy rains ease around Houston but flooding remains after hundreds of rescues and evacuations",
      "url": "https://apnews.com/117b0f63c9bd53be31ee34e11547da21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17ac42d1aa354cefabf39501b0c73d7e/1920.jpeg"
    },
    {
      "author": "RAFAL NIEDZIELSKI and VANESSA GERA",
      "description": "OSWIECIM, Poland (AP) — U.S. university presidents joined Holocaust survivors and thousands of Israelis on Monday for the March of the Living, a yearly memorial march at the site of Auschwitz that honors the 6 million Jews killed by Nazi Germany and celebrates the state of Israel.",
      "publishedAt": "2024-05-06T14:25:31Z",
      "title": "The yearly memorial march at the former death camp at Auschwitz overshadowed by the Israel-Hamas war",
      "url": "https://apnews.com/a7996e224bb4be1c76059b6fafbbd19d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a76ce180b10b44a2a1e69591a209f898/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "BOCA RATON, Fla. (AP) — When teachers at A.D. Henderson School, one of the top-performing schools in Florida, are asked how they succeed, one answer is universal: They have autonomy.",
      "publishedAt": "2024-05-06T04:08:01Z",
      "title": "Want to show teachers appreciation? This top school gives them more freedom",
      "url": "https://apnews.com/103044d32bde4d4a756409c34b9a2c82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c49194e54fa342888e2da82808501af6/1920.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "Brittney Griner continues her efforts to settle into a normal routine following her release from a Russian prison 17 months ago.",
      "publishedAt": "2024-05-06T10:00:47Z",
      "title": "Brittney Griner still adjusting after Russian prison ordeal. WNBA star details experience in book",
      "url": "https://apnews.com/3ad3b4052744fd426415329129ffebf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0ffe9448ee145799021fa2376df0276/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}