{
  "articles": [
    {
      "author": "ZEKE MILLER",
      "description": "WILMINGTON, Del. (AP) — President Joe Biden said Saturday that he believes Israeli Prime Minister Benjamin Netanyahu is “hurting Israel more than helping Israel” in how he is approaching its war against Hamas in Gaza.",
      "publishedAt": "2024-03-09T23:33:38Z",
      "title": "Biden: Netanyahu 'hurting Israel' by not preventing more civilian deaths in Gaza",
      "url": "https://apnews.com/2d4e5657db45ccbe2bb793f06f74c913",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5e350e6798f4e53a77a5d0999cf0a4c/3000.jpeg"
    },
    {
      "author": "MENELAOS HADJICOSTIS",
      "description": "NICOSIA, Cyprus (AP) — Another top donor to the U.N. agency aiding Palestinians said Saturday that it would resume funding, weeks after more than a dozen countries halted hundreds of millions of dollars of support in response to Israeli allegations against the organization.",
      "publishedAt": "2024-03-09T19:05:58Z",
      "title": "Another top donor says it will resume funding the UN agency for Palestinians as Gaza hunger grows",
      "url": "https://apnews.com/6f4514fa1f4ad1f18a9d4331d81f917f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0b3b8ffc8fb4c4299ab5776cf402a8b/3000.jpeg"
    },
    {
      "author": "JOSH BOAK, MICHELLE PRICE and JILL COLVIN",
      "description": "ATLANTA (AP) — President Joe Biden said Saturday that he regretted using the term “illegal” during his State of the Union address to describe the suspected killer of Laken Riley, as his all-but-certain 2024 GOP rival, Donald Trump, blasted the Democrat's immigration policies and blamed them for her death at a rally attended by the Georgia nursing student’s family and friends.",
      "publishedAt": "2024-03-09T22:17:15Z",
      "title": "Trump blasts Biden over Laken Riley's death after Biden says he regrets using term 'illegal'",
      "url": "https://apnews.com/04924ffb3be76d60e1b6e8796a968051",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f73a1d25ec741f4aa3062e8ff529c1c/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and MICHELLE L. PRICE",
      "description": "ATLANTA (AP) — President Joe Biden and former President Donald Trump warned of dire consequences for the country if the other wins another term in the White House as the pair held dueling rallies in Georgia Saturday fresh off strong wins in Super Tuesday contests that positioned them for an all-but-certain rematch this November.",
      "publishedAt": "2024-03-09T05:00:47Z",
      "title": "Biden, Trump issue dire warnings of the other, as rematch comes into view in Georgia",
      "url": "https://apnews.com/5ae87db6c20f95eae55d7f3c603144e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7b78856c6bc4f629b392a4a164e64a8/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "KURIGA, Nigeria (AP) — Rashidat Hamza is in despair. All but one of her six children are among the nearly 300 students abducted from their school in Nigeria’s conflict-battered northwest.",
      "publishedAt": "2024-03-10T02:56:10Z",
      "title": "5 of her kids were abducted from a Nigerian school. All she has left is hope and prayers",
      "url": "https://apnews.com/3fd64cbd482c2011d2e8c18acc18ba0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/007c1e43d087472a8da5be1e8b6a2ae3/3000.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM",
      "description": "CHARLESTON, W.Va. (AP) — West Virginia's GOP-controlled state Legislature voted Saturday to allow some students who don't attend traditional public schools to be exempt from state vaccination requirements that have long been held up as among the most strict in the country.",
      "publishedAt": "2024-03-10T03:34:23Z",
      "title": "West Virginia lawmakers OK bill drawing back one of the country's strictest child vaccination laws",
      "url": "https://apnews.com/73c0b996458a89f22d41ed0b0245df68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/075ea53c1b164f6684baa160e6631aab/2200.jpeg"
    },
    {
      "author": "AMIR AMAN KIYARO",
      "description": "NEBAR HADNET, Ethiopia (AP) — The cruel realities of war and drought seem to have merged for Tinseu Hiluf, a widow living in the arid depths of Ethiopia's Tigray region who is raising four children left behind by her sister's recent death in childbirth.",
      "publishedAt": "2024-03-10T04:06:27Z",
      "title": "Ethiopia's Tigray region is now peaceful, but extreme hunger afflicts its children",
      "url": "https://apnews.com/7e085f5bd2ac138a27fdc0ec544fb296",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b050b6f9fb54c75b377adbf36a8d008/3000.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "TUBA CITY, Ariz. (AP) — Melissa Blackhair is not eager to spring forward Sunday. “I’m dreading it. I just don’t want to see how much we have to adjust,\" Blackhair said while sitting in her home office in Tuba City on the Navajo Nation, the only area in Arizona that follows daylight saving time.",
      "publishedAt": "2024-03-09T05:05:04Z",
      "title": "The US is springing forward to daylight saving. For Navajo and Hopi tribes, it's a time of confusion",
      "url": "https://apnews.com/a1016ce873b772ffae544de9fbcd29d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2776aebe35449888a994ae4527f493b/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "SEATTLE (AP) — The Department of Justice has launched a criminal investigation into the Boeing jetliner blowout that left a gaping hole on an Alaska Airlines plane this January, the Wall Street Journal reported on Saturday.",
      "publishedAt": "2024-03-09T19:27:40Z",
      "title": "DOJ opens criminal investigation into the Alaska Airlines 737 plane blowout, report says",
      "url": "https://apnews.com/2d23408a25eff999579c88071836dbec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c33f2df275a4317a2f23fe45fa84c33/3000.jpeg"
    },
    {
      "author": null,
      "description": "PADANG, Indonesia (AP) — Torrential rains have triggered flash floods and a landslide on Indonesia’s Sumatra island, killing at least 19 people and leaving seven others missing, officials said Sunday.",
      "publishedAt": "2024-03-09T12:07:50Z",
      "title": "At least 19 dead and 7 missing as landslide and flash floods hit Indonesia’s Sumatra island",
      "url": "https://apnews.com/c20bbf9ecb72b843b6cdbde133d31e7c",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}