{
  "articles": [
    {
      "author": "SEUNG MIN KIM, WILL WEISSERT and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — A defiant President Joe Biden vowed Wednesday to keep running for reelection, rejecting growing pressure from Democrats to withdraw after a disastrous debate performance raised questions about his readiness to keep campaigning, much less win in November.",
      "publishedAt": "2024-07-03T16:45:30Z",
      "title": "Biden vows to keep running as signs point to rapidly eroding support for him on Capitol Hill",
      "url": "https://apnews.com/7794155c12bc78c084e4b964545e2b7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f814ba87fa874caea0fdd867e5fab4f5/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — President Joe Biden's disastrous debate performance is reverberating across the Democratic Party, forcing lawmakers to grapple with a crisis that could upend the presidential election — and their own —and even change the course of American history.",
      "publishedAt": "2024-07-03T04:08:38Z",
      "title": "Democrats in Congress are torn between backing Biden for renomination and sounding the alarm",
      "url": "https://apnews.com/aa619e71e1e09868abe22d19fc48e351",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae05868543424073a94c4445cbc04eec/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump likes to be the one in the spotlight.But in the days since President Joe Biden's disastrous debate performance, the presumptive Republican nominee has kept a low profile, leaving the focus on the drama engulfing the Democratic Party as he and his campaign revel in a series of legal and political victories heading into the Republican National Convention this month.",
      "publishedAt": "2024-07-03T11:17:07Z",
      "title": "Trump, for now, is ceding the spotlight to Biden as the president's campaign reels from bad debate",
      "url": "https://apnews.com/86bfc24cc618906fa9b46ab029e65789",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43099fdb35c04a1a85750b809350f21d/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — An Israeli airstrike slammed into a residential building next to the main medical center in Gaza’s southern city of Khan Younis, wounding at least seven people, hospital authorities and witnesses said Wednesday.",
      "publishedAt": "2024-07-03T22:13:18Z",
      "title": "Life and death in Gaza's 'safe zone' where food is scarce and Israel strikes without warning",
      "url": "https://apnews.com/43536b7dfe84aa3c39668c30032bdfcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be3a9a9ea20a44d4b2a2655953af5551/3000.jpeg"
    },
    {
      "author": "JOHN MYERS JR. and RENLOY TRAIL",
      "description": "KINGSTON, Jamaica (AP) — Hurricane Beryl was roaring by Jamaica Wednesday, bringing fierce winds and heavy rain after the powerful Category 4 storm earlier killed at least six people and caused significant damage in the southeast Caribbean.",
      "publishedAt": "2024-07-03T09:06:06Z",
      "title": "Hurricane Beryl roars by Jamaica after killing at least 6 people in the southeast Caribbean",
      "url": "https://apnews.com/774803fc70e187ea96e7df10f84d8a50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2062a6f18fae46c8a29c3d1288be5836/1920.jpeg"
    },
    {
      "author": "WALTER BERRY and ANITA SNOW",
      "description": "PHOENIX (AP) — Organizers in Arizona and Nebraska said Wednesday that they turned in far more signatures than required to get ballot measures on abortion rights before voters in November's election.",
      "publishedAt": "2024-07-03T04:02:42Z",
      "title": "Abortion measures could be on Arizona and Nebraska ballots after organizers submit signatures",
      "url": "https://apnews.com/83cb053919be342d7bbb60217129fe49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdd2c70d4f55457b821cff6ca872e449/3000.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS and JOHN HANNA",
      "description": "ST. LOUIS (AP) — Early last week, floodwater in rural Minnesota pushed debris against a more than century-old dam and then carved a path around it, eroding so much of the riverbank that most of a house fell into the river.",
      "publishedAt": "2024-07-03T15:14:57Z",
      "title": "Worsening floods and deterioration pose threats to US dam safety",
      "url": "https://apnews.com/1e40fa79a59b4e307d944beb258b91be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b4933f454644127ae20455259f5eb62/2000.jpeg"
    },
    {
      "author": "JOHN SEEWER",
      "description": "Violence and mass shootings often surge in the summer months, especially around the Fourth of July, historically one of the deadliest days of the year.A flurry of shootings around the holiday a year ago left more than a dozen people dead and over 60 wounded.",
      "publishedAt": "2024-07-03T12:01:20Z",
      "title": "Why mass shootings and violence increase in the summer",
      "url": "https://apnews.com/d5919ea324df5dbc732baf227123f849",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abd45ad762104a07b61d78233a5598d0/2668.jpeg"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "To save the imperiled spotted owl from potential extinction, U.S. wildlife officials are embracing a contentious plan to deploy trained shooters into dense West Coast forests to kill almost a half-million barred owls that are crowding out their cousins.",
      "publishedAt": "2024-07-03T12:46:33Z",
      "title": "To save spotted owls, US officials plan to kill hundreds of thousands of another owl species",
      "url": "https://apnews.com/9081f926f3ebd27ac3ddc2ceaf332ca2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/113e7669030f4a09b5ca3ca835eb7d56/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO, HALELUYA HADERO and DEE-ANN DURBIN",
      "description": "NEW YORK (AP) — TikTok and its bite-sized videos arrived in the United States as a global version of the Chinese app Douyin.",
      "publishedAt": "2024-07-03T08:59:34Z",
      "title": "From 'latte makeup' to 'girl dinners,' TikTok has launched tons of trends. Will its influence last?",
      "url": "https://apnews.com/6cc74619493f226827b103da4f652a84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2113e8434e914c139402802d788c7434/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}