{
  "articles": [
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — Texas' plans to arrest migrants suspected of entering the U.S. illegally were again on hold Wednesday after setting off uncertainty along the border and anger from Mexico flared during a brief few hours that the law was allowed to take effect.",
      "publishedAt": "2024-03-20T06:19:56Z",
      "title": "Texas' migrant arrest law is back on hold after briefly taking effect",
      "url": "https://apnews.com/8e232b8a0c2979943c87c7309652ed34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d47ba06403c4c2e9de92309d61dcf5d/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Mourners held funeral prayers Wednesday morning outside a hospital in central Gaza for 28 people killed in three separate Israeli airstrikes on urban refugee camps the previous night. Associated Press footage showed mourners praying over the bodies, which were wrapped in funeral shrouds, before the bodies were taken away in donkey carts for burial.",
      "publishedAt": "2024-03-20T06:44:19Z",
      "title": "The Latest | Palestinians mourn 28 killed in Israeli airstrikes on urban refugee camps in Gaza",
      "url": "https://apnews.com/e80b024bd930b3f3deed7d483d5f131b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db4d55a1b49c4e6db76f07a61e71e311/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Catastrophic hunger is so dire in two world hotspots that famine is imminent in northern Gaza and approaching in Haiti, with hundreds of thousands of people in both places struggling to avoid starvation.",
      "publishedAt": "2024-03-19T18:41:45Z",
      "title": "Gaza and Haiti are on the brink of famine, experts say. Here's what that means",
      "url": "https://apnews.com/16215137be084e51849c41a83335119d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53378c23351e42dcb35842864e34a4ca/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, JONATHAN J. COOPER and PATRICK ORSAGOS",
      "description": "TEMPE, Arizona (AP) — As Joe Biden and Donald Trump moved closer to a November rematch, primary voters around the country on Tuesday urged their favored candidate to keep up the fight and worried about what might happen if their side loses this fall.",
      "publishedAt": "2024-03-19T04:04:29Z",
      "title": "Biden and Trump notch more wins Tuesday as primary voters urge them to keep up the fight",
      "url": "https://apnews.com/8b2414273d7e4d46f5696268ae89a7f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10c38cef1ba54a8bb37d40c41eccb0d2/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump suggested Tuesday that he’d support a national ban on abortions around 15 weeks of pregnancy, voicing for the first time support for a specific limit on the procedure.",
      "publishedAt": "2024-03-20T02:39:02Z",
      "title": "Trump suggests he'd support a national ban on abortions around 15 weeks of pregnancy",
      "url": "https://apnews.com/91a9e0ce87d11dff0fa761f327bd0566",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/690f648384ff4b33b8d790b305af6fe8/2872.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — Warnings about deepfakes and disinformation fueled by artificial intelligence. Concerns about campaigns and candidates using social media to spread lies about elections. Fears that tech companies will fail to address these issues as their platforms are used to undermine democracy ahead of pivotal elections.",
      "publishedAt": "2024-03-20T04:05:29Z",
      "title": "Election misinformation is a problem in any language. But some gets more attention than others",
      "url": "https://apnews.com/ed829171343812cbe55fab99615c77e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a221fb50a61c47ae955ed5681b024a16/3000.jpeg"
    },
    {
      "author": "YAYAN ZAMZAMI and EDNA TARIGAN",
      "description": "BANDA ACEH, Indonesia (AP) — A wooden boat carrying dozens of Rohingya Muslims capsized about 16 miles (25 Kilometers) from the coastline of Kuala Bubon beach in Indonesia’s northernmost province of Aceh on Wednesday.",
      "publishedAt": "2024-03-20T09:36:27Z",
      "title": "A wooden boat carrying dozens of Rohingya Muslim migrants capsizes off Indonesia’s Aceh province",
      "url": "https://apnews.com/4b51073972482f0090893e66a1fca7d7",
      "urlToImage": ""
    },
    {
      "author": "ELÉONORE HUGHES and MAURICIO SAVARESE",
      "description": "RIO DE JANEIRO (AP) — As Brazilian President Jair Bolsonaro's term wound down in the final days of December 2022, he had decided to skip the ritual of handing over the presidential sash to his successor, and instead made plans to travel abroad.",
      "publishedAt": "2024-03-20T04:10:43Z",
      "title": "Several probes target Brazil's Bolsonaro, but his COVID decisions are catching up to him first",
      "url": "https://apnews.com/2e9194bb1a6dc56e421f71016487e76f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9f37f1ccab14545b007a3e5f7302da9/1920.jpeg"
    },
    {
      "author": "ROSS D. FRANKLIN",
      "description": "PHOENIX (AP) — Bruce Springsteen and the E Street Band returned to the stage Tuesday evening at the Footprint Center in Phoenix in a triumphant reboot of the Boss’ postponed 2023 world tour.",
      "publishedAt": "2024-03-20T08:24:48Z",
      "title": "Bruce Springsteen returns to the stage in Phoenix after health issues postponed his 2023 world tour",
      "url": "https://apnews.com/59a9e3ed6f85d2d0934820ca246307c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c4da320604a46e1a15673e5c3da37f4/3000.jpeg"
    },
    {
      "author": "MITCH STACY",
      "description": "DAYTON, Ohio (AP) — Joel Scott scored a season-high 23 points and had 11 rebounds as Colorado State won an NCAA Tournament game for the first time in 11 years, blowing out Virginia 67-42 in the First Four on Tuesday night.",
      "publishedAt": "2024-03-20T03:45:32Z",
      "title": "Joel Scott scores 23 as Colorado State routs Virginia 67-42 to cap Day 1 of March Madness",
      "url": "https://apnews.com/938315eb2267dedcd2fd09257090b6da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fe1e103b6f64e7395364d126831f7b8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}