{
  "articles": [
    {
      "author": "MELANIE LIDMAN, TIA GOLDENBERG and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Prime Minister Benjamin Netanyahu said Monday that a “tragic mistake” was made in an Israeli strike in the southern Gaza city of Rafah that set fire to a camp housing displaced Palestinians and, according to local officials, killed at least 45 people.",
      "publishedAt": "2024-05-27T13:21:19Z",
      "title": "Netanyahu says deadly Israeli strike in Rafah was the result of a 'tragic mistake'",
      "url": "https://apnews.com/7b743a848ef8bfbe69a9659a4a5dd047",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ad1f8562a794fdab121d14f646a7ebe/1920.jpeg"
    },
    {
      "author": "BRUCE SCHREINER and JULIO CORTEZ",
      "description": "A series of powerful storms swept over the central and southern U.S. over the Memorial Day holiday weekend, killing at least 22 people and leaving a wide trail of destroyed homes, businesses and power outages.",
      "publishedAt": "2024-05-27T04:09:10Z",
      "title": "At least 22 dead in Memorial Day weekend storms that devastated several US states",
      "url": "https://apnews.com/91b0ff5c06f9bdc8b8ca68f36afbafa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/132ede06e6dd4b17aeb08fd73b6ad91d/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden marked Memorial Day with a pledge that the country would continue the work of the nation's fallen toward a more perfect union, \"for which they lived, and for which they died.\"",
      "publishedAt": "2024-05-27T16:38:09Z",
      "title": "Biden says each generation has to 'earn' freedom, in solemn Memorial Day remarks",
      "url": "https://apnews.com/d9c2dfd45fb6ea837ba970f397b0be8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e78b63cdbfaf460dabd8590a51f1ed7c/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The testimony in Donald Trump's New York hush money trial is all wrapped up after more than four weeks and nearly two dozen witnesses, meaning the case heads into the pivotal final stretch of closing arguments, jury deliberations and possibly a verdict.",
      "publishedAt": "2024-05-27T13:08:34Z",
      "title": "Closing arguments, jury instructions and maybe a verdict? Major week looms in Trump hush money trial",
      "url": "https://apnews.com/a1984e2353de3df5d0520e4f0705f7f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bb1e89ed0784faaa9c6a00826727864/2374.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "BANGKOK (AP) — The Papua New Guinea government said more than 2,000 people are believed to have been buried alive in a landslide in the South Pacific island nation, after the side of a mountain came down in the early hours of Friday morning when the village of Yambali was asleep.",
      "publishedAt": "2024-05-27T10:54:59Z",
      "title": "At least 2,000 feared dead in Papua New Guinea landslide. These are some challenges rescuers face",
      "url": "https://apnews.com/1e142cb337dc04b5a81e031537909482",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc6ad1ef9487477197fcf9ac09ab5d1b/1500.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — Iran has further increased its stockpile of uranium enriched to near weapons-grade levels, according to a confidential report on Monday by the United Nations’ nuclear watchdog, the latest in Tehran's attempts to steadily exert pressure on the international community.",
      "publishedAt": "2024-05-27T15:38:35Z",
      "title": "Iran further increases its stockpile of uranium enriched to near weapons-grade levels, watchdog says",
      "url": "https://apnews.com/2190f0d7247a6160fb13f28304d4b6ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f51f23c83ea4669a60ff8279382ebe5/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM, KIM TONG-HYUNG and MARI YAMAGUCHI",
      "description": "SEOUL, South Korea (AP) — A rocket launched by North Korea to deploy the country's second spy satellite exploded shortly after liftoff Monday, state media reported, in a setback for leader Kim Jong Un's hopes to field satellites to monitor the U.S.",
      "publishedAt": "2024-05-27T14:14:41Z",
      "title": "North Korean rocket carrying its 2nd spy satellite explodes in mid-air",
      "url": "https://apnews.com/28efd0f15318594fdcf5ec8f416c196b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c7b51722a9041178258e2b2cc8f2e68/3000.jpeg"
    },
    {
      "author": "TERRY TANG and MIKE SCHNEIDER",
      "description": "The federal government recently reclassified race and ethnicity groups in an effort to better capture the diversity of the United States, but some groups feel the changes miss the mark.",
      "publishedAt": "2024-05-27T13:07:23Z",
      "title": "Armenians, Hmong and other groups feel US race and ethnicity categories don't represent them",
      "url": "https://apnews.com/52c0a6b7e3a06bfb763132b32d135378",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61d4f19851d14c6984eb54a8f16a7453/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "Bill Walton was never afraid to be himself.Larger than life, only in part because of his nearly 7-foot frame, Walton was a two-time NCAA champion at UCLA, a two-time champion in the NBA, a Basketball Hall of Fame inductee, an on-court icon in every sense of the word.",
      "publishedAt": "2024-05-27T17:36:06Z",
      "title": "Bill Walton, Hall of Fame player who became a star broadcaster, dies of cancer at 71",
      "url": "https://apnews.com/1921f95e9b0676bec4cfb6c3ea599472",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62f2f4354cfc44cf80dab681021e8ac3/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — Americans who spend Memorial Day scouting sales online and in stores may find more reasons to celebrate the return of warmer weather. Major retailers are stepping up discounts heading into the summer months, hoping to entice inflation-weary shoppers into opening their wallets.",
      "publishedAt": "2024-05-27T12:39:15Z",
      "title": "Major retailers are offering summer deals to entice inflation-weary shoppers",
      "url": "https://apnews.com/65fbc568804f20919a609c594531e129",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a948d60786a2436c84dc7ad3f4369735/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}