{
  "articles": [
    {
      "author": "FATIMA HUSSEIN",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump declared a win on stopping illegal immigration through Mexico on Wednesday after talking with that country’s leader. But Mexican President Claudia Sheinbaum suggested Mexico was already doing its part and had no interest in closing its borders.",
      "publishedAt": "2024-11-28T01:59:29Z",
      "title": "Trump claims a win on immigration after a call with Mexico's president. But she suggests no change",
      "url": "https://apnews.com/5fd2fc21950f47e5dbaf5c062c4725b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4e0e569c9bd4adab91f022e56758035/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — A number of President-elect Donald Trump 's most prominent Cabinet picks and appointees have been targeted by bomb threats and “swatting attacks,\" Trump's transition team said Wednesday.",
      "publishedAt": "2024-11-27T17:56:07Z",
      "title": "Trump transition says Cabinet picks, appointees were targeted by bomb threats, swatting attacks",
      "url": "https://apnews.com/0a7f2166087f7c455cbba5b717dae439",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30f4bc16c2f84315ae8824f772ec759d/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and FATIMA HUSSEIN",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump said Wednesday that he has chosen Keith Kellogg, a highly decorated retired three-star general, to serve as his special envoy for Ukraine and Russia.",
      "publishedAt": "2024-11-27T18:25:08Z",
      "title": "Trump selects longtime adviser Keith Kellogg as special envoy for Ukraine and Russia",
      "url": "https://apnews.com/68b413ecde625f6643aebe5759a752e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aee092849ef341088dd545e8d3c9356d/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE, KAREEM CHEHAYEB and TIA GOLDENBERG",
      "description": "TYRE, Lebanon (AP) — Thousands of Lebanese displaced by the war between Israel and Hezbollah militants returned home Wednesday as a ceasefire took hold, driving cars stacked with personal belongings and defying warnings from Lebanese and Israeli troops to avoid some areas.",
      "publishedAt": "2024-11-27T07:44:05Z",
      "title": "Thousands of Lebanese return to their homes as Israel-Hezbollah ceasefire takes hold",
      "url": "https://apnews.com/f2c5ad31f5519f8dd368504e6634cd2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c98e3afa788c4dfe8dcd6d79cb22c5a4/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "Last time Donald Trump was president, rumors of immigration raids terrorized the Oregon community where Gustavo Balderas was the school superintendent.",
      "publishedAt": "2024-11-27T05:11:28Z",
      "title": "Schools are bracing for upheaval over fear of mass deportations",
      "url": "https://apnews.com/9747be35d2eb109693930f114f148b94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2ac8b246ccd4330acd8026db17581b5/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and GEOFF MULVIHILL",
      "description": "COLUMBUS, Ohio (AP) — Transgender students from kindergarten through college at Ohio public and private schools will be banned from using multiperson bathrooms that fit their gender identities under a measure that Republican Gov.",
      "publishedAt": "2024-11-27T14:54:03Z",
      "title": "Ohio governor signs bill limiting bathroom use by transgender students",
      "url": "https://apnews.com/3fe7c4d9178c17c97a64103d79668df0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78d532cd188840778cd4b73b2cb82af3/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, AAMER MADHANI and MATTHEW LEE",
      "description": "WASHINGTON (AP) — Three American citizens imprisoned for years by China have been released and are returning to the United States, the White House said Wednesday, announcing a rare diplomatic agreement with Beijing in the final months of the Biden administration.",
      "publishedAt": "2024-11-27T14:07:12Z",
      "title": "3 Americans held for years in China have been released, the White House says",
      "url": "https://apnews.com/365258f044ec5a650aaeccf33d817d64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2845c59db1214c21a1e1a10ab5fe9b91/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "DENVER (AP) — Amid renewed interest in the killing of JonBenet Ramsey triggered in part by a new Netflix documentary, police in Boulder, Colorado, refuted assertions this week that there is viable evidence and leads about the 1996 killing of the 6-year-old girl that they are not pursuing.",
      "publishedAt": "2024-11-27T20:23:52Z",
      "title": "Police deny sitting on evidence as Netflix doc brings renewed attention to JonBenet Ramsey's killing",
      "url": "https://apnews.com/a5333bfcb7a7794795bbb6ac3e9de0d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b33de357f5d4497e823463ec9eedcfe1/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Former TV host Charlie Rose has resolved a sexual harassment lawsuit brought by three women in the wake of his #MeToo-era ouster from CBS News in 2017 and the cancellation of his long-running, eponymous PBS talk show.",
      "publishedAt": "2024-11-28T01:13:12Z",
      "title": "Ex-TV host Charlie Rose settles sexual harassment lawsuit years after his #MeToo-era ouster",
      "url": "https://apnews.com/d100abee49b1fd7ecb8a27a9658302e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cda8afe9ce154d5ea7f2d488a2629678/2860.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — They're up, up and — almost — away. The massive helium balloons that will float through New York City for the Macy’s Thanksgiving Day Parade took shape on Wednesday, when they were filled with helium ahead of the big event.",
      "publishedAt": "2024-11-27T23:10:09Z",
      "title": "Massive balloons take shape ahead of the Macy’s Thanksgiving Day Parade",
      "url": "https://apnews.com/cfbfbd01cf1c40052d227e12ae2d32d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35590b3dbf5c4e32b443fde08b7e0ee7/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}