{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Follow along for live updates on the second 2024 Republican presidential debate. The field's early front-runner, Donald Trump, is skipping the event, just as he did the first.",
      "publishedAt": "2023-09-26T18:26:49Z",
      "title": "The candidates went after Biden — and Trump — at the second GOP debate. Follow live updates",
      "url": "https://apnews.com/0f49b45111d36110f03346f3fd17485d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b2bfd7ba1ba4a86819869dc3a5eeaea/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — As the Senate marches ahead with a bipartisan approach to prevent a government shutdown, House Speaker Kevin McCarthy is back to square one — asking his hard-right Republicans to do what they have said they would never do: approve their own temporary House measure to keep the government open.",
      "publishedAt": "2023-09-27T16:03:16Z",
      "title": "House Speaker McCarthy is back to square one as the Senate pushes ahead to avert a federal shutdown",
      "url": "https://apnews.com/18ef8a03363d31742c5b4c5ecb23506f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b04ce8047e34e779ac991ebc2eff575/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — U.S. District Judge Tanya Chutkan said Wednesday she won’t recuse herself from Donald Trump’s 2020 election interference case in Washington, rejecting the former president’s claims that her past comments raise doubts about whether she can be fair.",
      "publishedAt": "2023-09-27T21:48:58Z",
      "title": "Judge Chutkan denies Trump’s request to recuse herself in federal election subversion case",
      "url": "https://apnews.com/8439ca0fcae8e7cf2a15663f9888e75a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/024f96bd04a6422f97918c9aa6ce243b/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY and ANDREW DALTON",
      "description": "NEW YORK (AP) — With the Hollywood writers strike over, actors will now get a shot at cutting their own deal with studios and streaming services.",
      "publishedAt": "2023-09-27T14:09:47Z",
      "title": "Hollywood actors to resume negotiations with studios next week, as protracted writers strike ends",
      "url": "https://apnews.com/28316c5104765576b7259b180e15c05b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70e6f502c334443bb5a9a6d88d1af3fd/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER, ALANNA DURKIN RICHER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — U.S. Sen. Bob Menendez of New Jersey pleaded not guilty on Wednesday to federal charges accusing him of pocketing bribes of cash and gold bars in exchange for wielding his political influence to secretly advance Egyptian interests and do favors for local businessmen.",
      "publishedAt": "2023-09-27T04:09:54Z",
      "title": "US Sen. Bob Menendez pleads not guilty to pocketing bribes in a wide-ranging corruption case",
      "url": "https://apnews.com/49599ba95fbf19ed5169055e24817fea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bced26b5a644bdea54ee89ac8f14a6f/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE, KIM TONG-HYUNG and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. has secured the release of a U.S. soldier who sprinted across a heavily fortified border into North Korea more than two months ago, and he is on his way back to America, officials announced Wednesday.",
      "publishedAt": "2023-09-27T10:30:06Z",
      "title": "US secures the release of the soldier who crossed into North Korea 2 months ago",
      "url": "https://apnews.com/00c171778e378d95fe1115fe31612ec2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc854c195426410fa5b13df770b3febd/1920.jpeg"
    },
    {
      "author": null,
      "description": "PHILADELPHIA (AP) — Dozens of people faced criminal charges Wednesday after a night of social media-fueled mayhem in which groups of thieves, apparently working together, smashed their way into stores in several areas of Philadelphia, stuffing plastic bags with merchandise and fleeing, authorities said.",
      "publishedAt": "2023-09-27T03:17:37Z",
      "title": "Over 50 arrested after mobs ransacked Philadelphia stores. Dozens of liquor outlets are shut down",
      "url": "https://apnews.com/f2351d631f691aa081233b1df1bee54d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/079260726ffa4d61b7922a5c0f95feae/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG and TOM KRISHER",
      "description": "DETROIT (AP) — The United Auto Workers union says it will announce on Friday how it plans to expand its strike against Detroit's three automakers.The union says President Shawn Fain will make the announcement at 10 a.m.",
      "publishedAt": "2023-09-27T18:19:30Z",
      "title": "Auto workers union to announce plans on Friday to expand strike in contract dispute with companies",
      "url": "https://apnews.com/7e8d2b5dd74513fd299fa29f541d25d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6315ed6842e442a89d3455c0cce50ae9/3000.jpeg"
    },
    {
      "author": "LARRY LAGE",
      "description": "Michigan State fired Mel Tucker on Wednesday, saying the suspended football coach failed to present adequate reasons why he should not be fired for cause after having what he described as consensual phone sex with an activist and rape survivor.",
      "publishedAt": "2023-09-27T16:43:56Z",
      "title": "Michigan State fires coach Mel Tucker for bringing ridicule to school, breaching his contract",
      "url": "https://apnews.com/72f41733fc07520eba176020918151be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49c46f34197a48cab5160db619f1d69e/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — After a 148-day strike, Hollywood screenwriters secured significant guardrails against the use of artificial intelligence in one of the first major labor battles over generative AI in the workplace.",
      "publishedAt": "2023-09-27T21:35:23Z",
      "title": "In Hollywood writers' battle against AI, humans win (for now)",
      "url": "https://apnews.com/39ab72582c3a15f77510c9c30a45ffc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99c8040d99444528b00e514b722920c0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}