{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Internet and telephone services collapsed across the Gaza Strip on Thursday for lack of fuel, the main Palestinian provider said, bringing a potentially long-term communications blackout even as Israel signaled its offensive against Hamas could next target the south of the territory, where most of the population has taken refuge.",
      "publishedAt": "2023-11-16T07:42:34Z",
      "title": "Internet, phone networks collapse in Gaza, threatening to worsen humanitarian crisis",
      "url": "https://apnews.com/6c7daa3b8c3a6b8dddf186ce631dfaad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c24c257f8c2451e83bb08f5d47d8c74/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and DAVID CRARY",
      "description": "As the Israel-Hamas war rages in Gaza, there’s a bitter battle for public opinion flaring in the United States, with angry rallies on many college campuses and disruptive protests at prominent venues in several major cities.",
      "publishedAt": "2023-11-16T16:09:02Z",
      "title": "Longtime Israeli policy foes are leading US protests against Israel's action in Gaza. Who are they?",
      "url": "https://apnews.com/c94bb0cd246bcc692de86b76b9b2a8cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fbba5a27e194932a0ab92fcb991ec80/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House Ethics Committee in a scathing report Thursday said it has amassed “overwhelming evidence” of lawbreaking by Republican Rep. George Santos of New York that has been sent to the Justice Department, concluding flatly that he “cannot be trusted” after a monthslong investigation into his conduct.",
      "publishedAt": "2023-11-16T15:10:49Z",
      "title": "Rep. George Santos won't seek reelection after scathing ethics report cites evidence of lawbreaking",
      "url": "https://apnews.com/5ebffe514d8779fbc16a77fa1ab5e0df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3152945471584470a2a5318171245530/3000.jpeg"
    },
    {
      "author": "VICTORIA MILKO",
      "description": "If it still seems strange to think of fish growing on farms, it shouldn’t.Aquaculture has been the fastest growing food sector in the world for decades, and people now eat more farmed fish than wild fish.",
      "publishedAt": "2023-11-16T15:46:30Z",
      "title": "Demand for seafood is soaring, but oceans are giving up all they can. Can we farm fish in new ways?",
      "url": "https://apnews.com/5fe2db082cc3d79731a15cf4547b023b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd1ae5dd27bb4aafbbb2be54ee358121/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Republican chairman of the House Intelligence Committee called Thursday for the renewal of a key U.S.",
      "publishedAt": "2023-11-16T18:02:46Z",
      "title": "Key GOP lawmaker calls for renewal of surveillance tool as he proposes changes to protect privacy",
      "url": "https://apnews.com/1c89e362e82aefc36e029f29d0ec5c7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09661991576f4ca3bbd1c79ce813e8d0/3000.jpeg"
    },
    {
      "author": "JOHN ANTCZAK and JULIE WATSON",
      "description": "LOS ANGELES (AP) — A college professor was arrested Thursday in connection with the death of a Jewish protester during Southern California demonstrations over the Israel-Hamas war, authorities said.",
      "publishedAt": "2023-11-16T16:00:33Z",
      "title": "California authorities arrest college professor in connection with death of Jewish demonstrator",
      "url": "https://apnews.com/13eb9cd0305dc0d0d822c355db7b1de6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb297f73d7bd4625aa3ff3293348c35f/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and AAMER MADHANI",
      "description": "SAN FRANCISCO (AP) — Fresh off his meeting with the leader of China, President Joe Biden on Thursday is addressing CEOs who are grappling with the risks to their businesses from world crises.",
      "publishedAt": "2023-11-16T05:03:01Z",
      "title": "Biden is turning his attention to Asia-Pacific economies after meeting with China's Xi",
      "url": "https://apnews.com/76fdd3babf4a1d6e0e27efde3969e6a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e2a4344b0f64d298ea793ca52bedca1/1920.jpeg"
    },
    {
      "author": "NATHAN GILLES, Columbia Insight",
      "description": "SHERWOOD, Ore. (AP) — Deep inside a forest in Oregon’s Willamette Valley stands a dead “Tree of Life.”Its foliage, normally soft and green, is tough and brown or missing altogether. Nonetheless, the tree’s reddish bark, swooping branches and thick, conical base identify it as the Pacific Northwest’s iconic western red cedar.",
      "publishedAt": "2023-11-16T16:06:03Z",
      "title": "Climate change is hastening the demise of Pacific Northwest forests",
      "url": "https://apnews.com/d1f58b79c5c92376f4fe835f6b433602",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f6ec89e652b4f90b257d35e162f1537/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — United Auto Workers union members have voted to approve a new contract with General Motors, making the company the first Detroit automaker to get a ratified deal that could end a contentious labor dispute and a series of crippling strikes.",
      "publishedAt": "2023-11-16T05:03:44Z",
      "title": "General Motors becomes 1st of Detroit automakers to seal deal with unionized workers",
      "url": "https://apnews.com/98c9d3a5b50ca7db05fddf94fd0ce783",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9530973014f411cbe8945b443c61945/3000.jpeg"
    },
    {
      "author": null,
      "description": "ARLINGTON, Texas (AP) — Major League Baseball will play its 2025 All-Star Game in Atlanta, four years after moving the game from Truist Park to Denver’s Coors Field over objections to changes in Georgia’s votings rights laws.",
      "publishedAt": "2023-11-16T19:01:24Z",
      "title": "Atlanta to host 2025 MLB All-Star Game after losing 2021 game over objections to voting law",
      "url": "https://apnews.com/a830ce7ccfe7906eb4cd696899b498b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f54c9d146444ea68367b8d969d47381/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}