{
  "articles": [
    {
      "author": null,
      "description": "Denmark’s prime minister is saying after U.S. President Donald Trump announced he agreed a “framework of a future deal” on Arctic security with the head of NATO that her country can’t negotiate on its sovereignty and she has been “informed that this has not been the case.” Trump on Wednesday abruptly scrapped the tariffs he had threatened to impose on eight European nations to press for U.S. control over Greenland, a semiautonomous territory of NATO ally Denmark. Trump offered few details, saying they were still being worked out. Danish Prime Minister Mette Frederiksen said Thursday that she had spoken with NATO Secretary General Mark Rutte “on an ongoing basis,” including before and after he met Trump in Davos.",
      "publishedAt": "2026-01-22T07:45:22Z",
      "title": "Danish leader says kingdom can't negotiate sovereignty after Trump's Greenland about-turn",
      "url": "https://apnews.com/article/denmark-greenland-trump-arctic-security-nato-d74c0ffcf1db904a2a9c3b2c5c5b8d03",
      "urlToImage": "https://dims.apnews.com/dims4/default/748b570/2147483647/strip/true/crop/6624x3726+0+345/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F2d%2F94a44c4a400072cde43c392cbd87%2F174253c28b8e47659522f22c868233a1"
    },
    {
      "author": "Josh Boak, Aamer Madhani",
      "description": "President Donald Trump is set to unveil his proposed Board of Peace at the World Economic Forum. It's an idea that was initially envisioned as a small group of world leaders overseeing the Gaza ceasefire. But it has morphed into something far more ambitious. The rollout of the board has been overshadowed by Trump’s pressure campaign over acquiring Greenland. Some European leaders have said they'll take a pass on the new panel that Trump has suggested could eventually make the United Nations obsolete. Trump wants to spotlight the proposed board on Thursday.",
      "publishedAt": "2026-01-22T05:10:58Z",
      "title": "Trump unveils Board of Peace in Davos after Greenland furor",
      "url": "https://apnews.com/article/trump-davos-peace-board-zelenskyy-gaza-f3b265cff4032d51cb5f14bc1cd2d2a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/d3378fa/2147483647/strip/true/crop/3603x2027+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F64%2F4f789b615093e5ee8fa0c5a8cab3%2F8f36066958c340d1bd4469cf785cf845"
    },
    {
      "author": "Steven Sloan, Matt Brown",
      "description": "Joe Biden promised Europe that \"America is back\" early in his presidency, aiming to mend ties after Donald Trump's tenure. However, nearly five years later, Trump's influence over Europe has grown. Recently, Trump demanded Denmark cede Greenland to the U.S., causing turmoil within NATO. European leaders are responding by exploring alliances that exclude the U.S. Canadian Prime Minister Mark Carney highlighted a global shift, calling the rules-based order an \"illusion.\" European leaders criticized Trump's approach, while some Republicans supported him. Democrats urged stronger responses, stressing the need for a lasting shift in U.S. politics to rebuild trust.",
      "publishedAt": "2026-01-22T05:07:36Z",
      "title": "Trump's European threats leave America with uncertain standing in the world",
      "url": "https://apnews.com/article/trump-nato-europe-greenland-denmark-627268004024f111097d7e1c5c2da357",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7a1374/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2Fdd%2F499ec77b090b8210dc051b5c1bce%2F4ea8c5ab271948a58542e1ceac250aef"
    },
    {
      "author": "Suman Naishadham",
      "description": "Two fatal train crashes in two days have rocked Spain. There is national mourning and the tragedies have led to questions about safety on the country’s railway system. A high-speed train in southern Spain derailed on Sunday and dozens were killed. Spanish authorities reported more than 150 other people were injured. Another train crash occurred in northeastern Spain and one person was killed. That crash involved a Barcelona commuter train. While Spain’s high-speed rail network generally runs smoothly, the commuter rail service is plagued by reliability issues. However, crashes causing injury or death are not common.",
      "publishedAt": "2026-01-19T12:29:49Z",
      "title": "What to know about the train crashes in Spain",
      "url": "https://apnews.com/article/spain-train-crash-adamuz-06d996533125414a2dc5948ef666ce15",
      "urlToImage": "https://dims.apnews.com/dims4/default/d654ec7/2147483647/strip/true/crop/2240x1260+0+117/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F43%2F0070c36e45fa5b954a0e7ecdb364%2F1925b23951764c46890cf4e9681c4c48"
    },
    {
      "author": "Samy Magdy",
      "description": "Hospitals in Gaza say Israeli forces have killed at least 11 Palestinians on one of the deadliest days since the ceasefire between Hamas and Israel took effect in October. Among the dead are three Palestinian journalists who were killed while filming near a displacement camp in central Gaza. The Israeli military says it spotted suspects who were operating a drone posing a threat to its troops. Also killed in separate incidents were two 13-year-old boys. The strikes came as the United States is trying to push the ceasefire forward and implement its challenging second phase.",
      "publishedAt": "2026-01-21T13:41:01Z",
      "title": "Israeli fire strikes journalists and children on one of Gaza's deadliest days since ceasefire",
      "url": "https://apnews.com/article/gaza-israel-fire-palestinian-deaths-d40bf79679b73bc11e2d7d6743724290",
      "urlToImage": "https://dims.apnews.com/dims4/default/176e4f0/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2Fbe%2F4a2df79027cdfa3e1f779af1d338%2F69929a5d70354b14b055b3d532dcd8b9"
    },
    {
      "author": "Jeff Martin",
      "description": "Millions of Americans are bracing for a potentially catastrophic ice storm from New Mexico to the Carolinas. Forecasters say it could crush trees, power lines, and cause power outages for days. Northern states up to New England might see enough snow to make travel nearly impossible. The National Weather Service says about 100 million people were under some type of winter weather watch, warning, or advisory on Wednesday. The storm is expected to begin Friday and continue through the weekend, as an atmospheric river of moisture could pull precipitation across Texas and other Gulf Coast states.",
      "publishedAt": "2026-01-22T05:03:39Z",
      "title": "Millions brace for winter ice and snow as storm is poised to barrel from New Mexico to the Carolinas",
      "url": "https://apnews.com/article/winter-weather-snow-ice-weekend-storm-e82e152fea39809180714137d7aa56a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/04c9724/2147483647/strip/true/crop/6843x3849+0+356/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F47%2Fbb06e15f640408ba8e4fe636ba16%2F1e4f44b175e44b228bc95c942f3db0e4"
    },
    {
      "author": "Jack Brook, Patrick Whittle",
      "description": "Maine has become the latest target in the Trump administration’s immigration enforcement wave. The Department of Homeland Security named the enforcement operation Catch of the Day, an apparent play on the state’s seafood industry. Maine has relatively few residents who are in the United States illegally but has a notable presence of refugees in its largest cities. An appeals court on Wednesday suspended a decision that prohibited federal officers from using tear gas or pepper spray against peaceful protesters in Minnesota. The government persuaded the court to freeze a judge’s ruling while it pursues an appeal.",
      "publishedAt": "2026-01-21T06:05:09Z",
      "title": "Court freezes decision to stop tear gas, other tactics by immigration officers in Minnesota",
      "url": "https://apnews.com/article/subpoenas-minnesota-investigation-lawsuit-federal-officers-8693014921e7a240108cb7f58dc56a46",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2931ec/2147483647/strip/true/crop/5429x3054+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2Fc0%2Ff04107d3203cc09c6d4f9108f4b7%2Fbd817de7a87347388fe8b239a2ffa040"
    },
    {
      "author": "Michael Biesecker, Ryan J. Foley",
      "description": "A medical examiner has determined that an Cuban migrant held in solitary confinement at an immigration detention facility in Texas died as a result of homicide. Geraldo Lunas Campos died Jan. 3 following an altercation with guards. ICE claims the 55-year-old father of four was attempting suicide and staff tried to save him. But a witness told The Associated Press last week that Lunas Campos was handcuffed as at least five guards held him down and at least one put an arm around his neck and squeezed until he was unconscious. The autopsy report released Wednesday by the El Paso County Medical Examiner’s Office determined the cause of death was asphyxia due to neck and torso compression.",
      "publishedAt": "2026-01-22T00:11:58Z",
      "title": "Autopsy finds Cuban immigrant in ICE custody died of homicide",
      "url": "https://apnews.com/article/ice-immigration-detention-death-texas-f04b5cb76f175255e58b947f0e14bc12",
      "urlToImage": "https://dims.apnews.com/dims4/default/84fdea6/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F3f%2Fec3cb7edca4d61144d1ffe5dbbaf%2F1f9ed0cd9c954094a545d39ee6519c52"
    },
    {
      "author": "Rod McGuirk",
      "description": "Three people were killed and another was wounded on Thursday in a shooting at an Australian country town, police said. Emergency services were called to an address at Lake Cargelligo, a town of around 1,500 people in New South Wales state, following reports of shooting, a police statement said. Three people — two women and a man — were dead, and another man was taken to hospital in serious but stable condition, police said. The shooter or shooters appeared to be at large. Police urged the public to avoid the area and for local residents to stay inside.",
      "publishedAt": "2026-01-22T07:53:03Z",
      "title": "Shooting in Australian town leaves 3 dead and 1 wounded",
      "url": "https://apnews.com/article/australia-shooting-lake-cargelligo-7644bf4eac20bc1c47d24417e8f315da",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Valerie Gonzalez, Jim Vertuno",
      "description": "A former Uvalde schools police officer who was among the first to respond to the mass shooting at a Texas elementary school has been acquitted of criminal charges that he failed his duty to confront the gunman. Adrian Gonzales had faced 29 charges of child abandonment and endangerment and up to two years in prison. A jury acquitted him Wednesday. Prosecutors had alleged at trial that Gonzales abandoned his training and could have stopped the gunman outside Robb Elementary School on May 24, 2022. Gonzales’ lawyers insisted he never saw the gunman before he entered the school. The trial was a rare prosecution of an officer for allegedly failing to act to stop a crime and protect lives.",
      "publishedAt": "2026-01-21T05:01:50Z",
      "title": "Ex-officer acquitted in trial over police response to 2022 mass shooting at Texas school",
      "url": "https://apnews.com/article/uvalde-school-shooting-officer-trial-63c0598465a28955db41ca7cfbc727ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/72a38a0/2147483647/strip/true/crop/5622x3162+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2F9c%2F85425024577b30bcde66bae3113a%2F6e919e5dd8bf42e29b8c05ed8d09e3c2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}