{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump has authorized the deployment of an additional 2,000 National Guard members to help respond to protests in Los Angeles over immigration raids. The authorization followed mostly peaceful protests Monday. The 2,000 Guard members are an addition to the 2,100 Guard troops the president previously mobilized for the protests Sunday morning. Trump also deployed 700 Marines to help them Monday. Gov. Gavin Newsom called the deployments reckless and “disrespectful to our troops.\" Trump said Monday that the city would have been “completely obliterated” if he had not deployed the Guard.",
      "publishedAt": "2025-06-10T05:34:56Z",
      "title": "Marines deployed to LA to respond to immigration protests",
      "url": "https://apnews.com/article/los-angeles-protests-ice-national-guard-9dfd2d025070bb6060d908dd3cf9b1f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e867fc/2147483647/strip/true/crop/8172x4597+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F2c%2F240e2cf4aad83dc1c20040efda7d%2Fcf8990a828ee4430972f17bf4e2786f0"
    },
    {
      "author": null,
      "description": "U.S. Rep. LaMonica McIver has been indicted on federal charges alleging she “forcibly impeded\" immigration officers during a skirmish outside a New Jersey detention center. McIver has disputed the allegations as baseless. The skirmish happened last month as Newark’s mayor was arrested after trying to join McIver and two fellow Democratic representatives who said they went to conduct congressional oversight at Delaney Hall, where other people were protesting outside. Police bodycam video shows McIver’s elbows pushing into an officer, but it isn’t clear from the video whether that contact was intentional, incidental or a result of jostling in the chaotic scene.",
      "publishedAt": "2025-06-10T23:24:15Z",
      "title": "Rep. McIver indicted on charges from skirmish at New Jersey immigration center",
      "url": "https://apnews.com/article/lamonica-mciver-assault-charge-alina-habba-immigration-7b6a5b0fc8079a9efd0606ab68e3f02d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d05cca/2147483647/strip/true/crop/4000x2250+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2F40%2Ff1988fec691aceb9237efc1ab853%2F3e6f73bcb44d4a659b50a744180f6562"
    },
    {
      "author": null,
      "description": "President Donald Trump plans to speak at Fort Bragg to celebrate the 250th anniversary of the U.S. Army. The Republican president's trip to the North Carolina base comes as he faces criticism over deploying the National Guard and now U.S. Marines in an attempt to quell immigration protests in Los Angeles. Defense Secretary Pete Hegseth and Army Secretary Dan Driscoll will also be at Tuesday’s event, along with service members, veterans and their families. Trump has promoted the Army’s anniversary as a reason to hold a military parade in Washington, D.C., on Saturday, which is also his 79th birthday.",
      "publishedAt": "2025-06-10T04:02:45Z",
      "title": "Trump visits Fort Bragg as he sends military to Los Angeles protests",
      "url": "https://apnews.com/article/donald-trump-fort-bragg-6df36485dec1df2350d5b7be0882a703",
      "urlToImage": "https://dims.apnews.com/dims4/default/b9812f6/2147483647/strip/true/crop/5576x3137+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2Fb7%2Fbc975010af41e4511bd3c2d38fd6%2Fbf2e7bdee8b046e7a7f6af05667da6ed"
    },
    {
      "author": null,
      "description": "Defense Secretary Pete Hegseth is expected to field sharp questions from members of Congress about his tumultuous start as Pentagon chief in a series of hearings beginning Tuesday. He's likely to be asked about his sharing of sensitive military details over a Signal chat. Lawmakers have made it clear they are unhappy that Hegseth has not provided details on the administration’s first proposed defense budget, which President Donald Trump has said would total $1 trillion. It will be members’ first chance to ask about a myriad of other controversial spending by the Pentagon and the deployment of troops to quell protests in Los Angeles.",
      "publishedAt": "2025-06-10T04:07:42Z",
      "title": "Hegseth faces Congress for first time since Signal leaks",
      "url": "https://apnews.com/article/pentagon-congress-hegseth-signal-hearings-c53cd37c2eae4327dd74e4c717057469",
      "urlToImage": "https://dims.apnews.com/dims4/default/c17bcef/2147483647/strip/true/crop/4004x2252+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F08%2Fabddb42d7a5bb289b5a6c59ec028%2F709d6e04dd1d48e0ba9128f7a3bf936b"
    },
    {
      "author": null,
      "description": "More than 10,000 church representatives are gathered in Dallas for the annual meeting of the Southern Baptist Convention. Casting a pall over the gathering is the recent death of one of the most high-profile whistleblowers in the Southern Baptists’ scandal of sexual abuse. Jennifer Lyell, a onetime denominational publishing executive who went public in 2019 with allegations that she had been sexually abused by a seminary professor while a student, died Saturday at 47. Friends reported that the backlash Lyell received after going public took a devastating toll on her. Several abuse survivors and advocates for reform are skipping this year’s gathering, citing lack of progress.",
      "publishedAt": "2025-06-10T20:25:05Z",
      "title": "Whistleblower's death casts pall on Southern Baptist meeting",
      "url": "https://apnews.com/article/southern-baptists-meeting-sexual-abuse-jennifer-lyell-8ebb5246978918f46d243d6ce2d9f4a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/aa75a9b/2147483647/strip/true/crop/4875x2742+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F16%2F3374d750ba3858bd083905daf513%2F66c82199427f43eb996759c3aebb1afc"
    },
    {
      "author": null,
      "description": "Protests that sprang up in Los Angeles over immigration enforcement raids are beginning to spread across the country. From Seattle to Austin to Washington, D.C., marchers have chanted slogans, carried signs and snarled traffic through downtown avenues and outside federal offices. While many were peaceful, a few have resulted in clashes with law enforcement as officers made arrests and used chemical irritants to disperse crowds. And activists plan even larger events in the coming days, with so-called “No Kings” events across the country on Saturday to coincide with President Donald Trump’s planned military parade through Washington.",
      "publishedAt": "2025-06-10T18:42:15Z",
      "title": "Protests over immigration raids popping up across the country with more planned",
      "url": "https://apnews.com/article/immigration-protests-arrests-austin-aa726c826047f8d7eb4091acc8929b8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2466caa/2147483647/strip/true/crop/4000x2250+0+138/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F04%2Fa934b7bf209a14a173aabc6144bc%2Fa3326b0f3e6c41049cdeed6a68471352"
    },
    {
      "author": null,
      "description": "Activist Greta Thunberg is being deported from Israel, Israel’s Foreign Ministry said Tuesday, after the Gaza-bound ship she was on was seized by the Israeli military. In a post on X, the Foreign Ministry shared a photo of Thunberg on a plane, saying that she was headed for France. Thunberg was one of 12 passengers on board the Madleen, a boat carrying aid destined for people in war-torn Gaza. The activists said they were protesting the ongoing war and the humanitarian crisis in Gaza. Israel says such ships violate its naval blockade of Gaza.",
      "publishedAt": "2025-06-10T07:12:28Z",
      "title": "Israel deports Greta Thunberg after seizing the Gaza-bound ship she was on",
      "url": "https://apnews.com/article/thunberg-deported-mideast-gaza-israel-7d6868f213dfcf78969f8e3d982788c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/7dc5f28/2147483647/strip/true/crop/4201x2363+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2Fbe%2Fcdf95d1118e2e5b03413f490bb76%2Ff3acc905ea994a0c9fcc01045e7512d9"
    },
    {
      "author": null,
      "description": "Correspondent Terry Moran is out at ABC News, two days after the network suspended him for an online remark that Trump administration deputy chief of staff Stephen Miller was a “world-class hater.” The veteran correspondent's late-night posting was quickly deleted, but the damage was done. ABC said Tuesday that it was at the end of its contract with Moran and decided not to renew based on his post, which was a clear violation of the network's standards for objectivity. Moran had only recently interviewed Trump for ABC News.",
      "publishedAt": "2025-06-10T21:25:47Z",
      "title": "Terry Moran out at ABC News after remarks about Stephen Miller",
      "url": "https://apnews.com/article/terry-moran-abc-news-stephen-miller-3a0f54c0cc0b255130747a57ecee9cdd",
      "urlToImage": "https://dims.apnews.com/dims4/default/2032355/2147483647/strip/true/crop/2000x1125+0+152/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2F3f%2F6b3adbd7b9361dab568062b9d718%2F85842fb522b64d14a7646ff24e8af7b3"
    },
    {
      "author": null,
      "description": "Several people have been killed at a school in the Austrian city of Graz on Tuesday, authorities said. Police said they deployed to the school after shots were heard there. The Interior Ministry said there were several fatalities but did not specify how many. There was also no immediate information on any injuries or on the status of the perpetrator. Special forces were among those sent to the high school after a call at 10 a.m. Graz, Austria’s second-biggest city, is located in the southeast of the country and has about 300,000 inhabitants.",
      "publishedAt": "2025-06-10T08:54:11Z",
      "title": "Several people dead in a shooting at a school in the Austrian city of Graz",
      "url": "https://apnews.com/article/austria-graz-school-police-deployment-43bc60f2016faa40f8a73dfa372b8a1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The Associated Press has asked for a full hearing before the U.S. Court of Appeals in Washington, seeking to overturn last week's decision by three judges of that court that continues to allow the Trump administration to restrict the outlet's access to cover presidential events. The panel had put a pause on a lower court ruling that Trump's blockade of the AP improperly punished the agency to refusing to rename the Gulf of Mexico as the president wishes. The two judges who ruled against AP in a 2-1 margin last week were appointees of President Donald Trump. The full court has nine Democrats and six Republicans.",
      "publishedAt": "2025-06-10T21:44:39Z",
      "title": "Associated Press seeks full appeals court hearing on access to Trump",
      "url": "https://apnews.com/article/trump-white-house-ap-access-press-freedom-23aefe14ee2e85dafe499c2a07a1e2f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/88b3b74/2147483647/strip/true/crop/3277x1843+0+170/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2F69%2Fd617b9435cf21201439a83213beb%2F56edb8e9591e478b899fc9a6965f06d9"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}