{
  "articles": [
    {
      "author": "ABDULRAHMAN SHAHEEN and ABBY SEWELL",
      "description": "DAMASCUS, Syria (AP) — The Syrian government collapsed early Sunday, falling to a lightning rebel offensive that seized control of the capital of Damascus and sent crowds into the streets to celebrate the end of the Assad family's 50 years of iron rule.",
      "publishedAt": "2024-12-08T07:23:26Z",
      "title": "Syrian government falls to fast-moving rebels, ending 50 years of iron rule by the Assad family",
      "url": "https://apnews.com/816e538565d1ae47e016b5765b044d31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4668495aaab43d5a4fcebd723a53105/1920.jpeg"
    },
    {
      "author": "ZEINA KARAM and ABBY SEWELL",
      "description": "BEIRUT (AP) — Syrian President Bashar Assad fled the country on Sunday, bringing to a dramatic close his nearly 14-year struggle to hold onto control as his country fragmented in a brutal civil war that became a proxy battlefield for regional and international powers.",
      "publishedAt": "2024-12-08T05:11:00Z",
      "title": "The fall of Bashar Assad after 14 years of war in Syria brings to an end a decades-long dynasty",
      "url": "https://apnews.com/1468a97ff95bb782f5933856d99c9a8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20ecebea421d40dab2c0ca91b99117a2/2000.jpeg"
    },
    {
      "author": "CARA ANNA",
      "description": "Syria’s government appears to have fallen after opposition fighters said they entered Damascus following a stunning advance.Syrian Prime Minister Mohammed Ghazi Jalali said the government was ready to “extend its hand” to the opposition and hand over its functions to a transitional government.",
      "publishedAt": "2024-12-07T20:45:59Z",
      "title": "Opposition fighters reportedly drive Syrian leader from the country. Who are they and what now?",
      "url": "https://apnews.com/0a5fddb5ee4065e93be374cbcdb01ff7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c0d2850478b4ce4bbf9a17bee65d55f/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — They have seen him smiling on a hostel security camera, but don’t know his name.",
      "publishedAt": "2024-12-08T00:11:11Z",
      "title": "Search for UnitedHealthcare CEO's killer yields evidence, but few answers",
      "url": "https://apnews.com/b6a0bcc8f517604bb612511acea164b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dad5417a12243c793d537f5b7514c9a/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean prosecutors on Sunday detained a former defense minister who allegedly recommended last week’s brief but stunning martial law imposition to President Yoon Suk Yeol, making him the first figure detained over the case.",
      "publishedAt": "2024-12-08T02:19:04Z",
      "title": "South Korean prosecutors detain ex-defense chief over martial law imposition",
      "url": "https://apnews.com/5bb4ed3108a9c7fb0ff1d01df924bf0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5bb4552d5de44fdbd898213c27bafea/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "SIMI VALLEY, Calif. (AP) — Republican Sen. Joni Ernst made her most expansive comments yet on Pete Hegseth, telling a largely GOP audience at a California security conference Saturday that she needs to hear more from President-elect Donald Trump’s embattled defense secretary pick on key issues before she decides whether to support him.",
      "publishedAt": "2024-12-08T01:46:42Z",
      "title": "Sen. Joni Ernst wants to hear from Hegseth on sex assault in the military and women in combat",
      "url": "https://apnews.com/138c79c9199c8525d43b77417674d81e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47758f8203f841feb70273bb5068509e/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "SIMI VALLEY, Calif. (AP) — The United States will provide nearly $1 billion more in longer-term weapons support to Ukraine, Defense Secretary Lloyd Austin said Saturday as the Biden administration rushes to spend all the congressionally approved money it has left to bolster Kyiv before President-elect Donald Trump takes office next month.",
      "publishedAt": "2024-12-07T21:36:01Z",
      "title": "US announces nearly $1 billion more in longer-term weapons support for Ukraine",
      "url": "https://apnews.com/7b2560ad6bd54a6275da0ceb5241c0e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07d329eef4324e8589164957e2267d68/1920.jpeg"
    },
    {
      "author": "VASILISA STEPANENKO and EVGENIY MALOLETKA",
      "description": "IZIUM, Ukraine (AP) — Hopes for victory, a swift end to the war and prayers for their loved ones' survival or return from Russian captivity are among the wishes scattered throughout letters sent to a volunteer group by Ukrainian children living in frontline areas.",
      "publishedAt": "2024-12-08T05:13:05Z",
      "title": "'Reindeer' volunteers bring holiday magic to Ukrainian children living on the frontlines",
      "url": "https://apnews.com/55edecb85450421ba69eda70c17ed307",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f3c5570111e411fb22a7e996a0a47de/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Shortly after Donald Trump’s win in last month’s U.S. election, Israeli Prime Minister Benjamin Netanyahu rushed to congratulate the president-elect: “History’s greatest comeback!” he gushed.",
      "publishedAt": "2024-12-08T05:18:13Z",
      "title": "Trump's return may be a boon for Netanyahu, but challenges abound in a changed Middle East",
      "url": "https://apnews.com/c5aebb98b47d6100c5bd3c5c7f945e1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9074ed8c77834ca2b80e1fc663948ce5/3000.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — At the Westonaria agricultural park near Bekkersdal, east of Johannesburg, farm workers are busy tilling the soil and planting tomatoes and lettuce.",
      "publishedAt": "2024-12-08T05:40:39Z",
      "title": "A farming project in South Africa is helping deaf people build skills and find jobs",
      "url": "https://apnews.com/3f560197d84b2329a60efd3c6d86e86e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5675795f5cc94025b2daa044ac317f36/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}