{
  "articles": [
    {
      "author": null,
      "description": "Mike Waltz will face questioning from lawmakers for the first time since he was ousted as national security adviser. President Donald Trump has nominated him to be U.S. ambassador to the United Nations, and he's set to appear before the Senate Foreign Relations Committee for his confirmation hearing Tuesday. It will provide senators with the first opportunity to grill Waltz over revelations that he added a journalist to a private text chain on the unclassified Signal messaging app that was used to discuss sensitive military plans. Waltz took responsibility for the episode. He faces lawmakers after months of delay, including the withdrawal of the previous U.N. nominee.",
      "publishedAt": "2025-07-15T04:05:58Z",
      "title": "Mike Waltz to face Senate grilling over Signal chat",
      "url": "https://apnews.com/article/waltz-trump-signal-united-nations-ambassador-14e98e2f6326877083a19f15992b8e54",
      "urlToImage": "https://dims.apnews.com/dims4/default/d601c1b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Ff5%2F3e92967098140e0fdf8fcf51b71f%2Fea55acd40c7140e680ccd65060fae7d4"
    },
    {
      "author": null,
      "description": "President Donald Trump and Sen. David McCormick of Pennsylvania plan to announce $70 billion of energy investments at a new summit focusing on energy and innovation. The Republican president has repeatedly pledged U.S. “energy dominance” in the global market. Pennsylvania is a swing state critical to Trump's wins in 2016 and 2024, and is at the forefront of his energy agenda. Coal is a key part of that and is a big industry in the state. McCormick says Tuesday's summit is meant to bring together top energy companies and artificial intelligence leaders, global investors and labor behind Trump’s energy policies. Participating companies include Blackstone, Bridgewater, SoftBank, Amazon Web Services, BlackRock and ExxonMobil.",
      "publishedAt": "2025-07-15T04:02:37Z",
      "title": "Trump to promote energy investments in Pennsylvania",
      "url": "https://apnews.com/article/trump-pennsylvania-energy-innovation-summit-b11f7f4053bac2603664ffbd1dc4c6da",
      "urlToImage": "https://dims.apnews.com/dims4/default/8fdd808/2147483647/strip/true/crop/4142x2330+0+215/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F9d%2Fca1bb20271cbdae519d9a2afe892%2F74eff457b01848539dcfe55a637ab9a7"
    },
    {
      "author": null,
      "description": "Gaza health officials say Israeli strikes overnight and into Tuesday killed more than 90 Palestinians across the Gaza Strip, including several families. One strike in the northern Shati refugee camp killed a 68-year-old Hamas member of the Palestinian legislature, as well as a man and a woman and their six children in the same building, according to officials from Shifa Hospital, where the casualties were taken. There was no immediate comment from the Israeli military on the strikes.",
      "publishedAt": "2025-07-15T15:27:08Z",
      "title": "Israeli strikes in Gaza kill 93 Palestinians, including several families, health officials say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-07-15-2025-43e559363cba4eb99cd7238c00d1de12",
      "urlToImage": "https://dims.apnews.com/dims4/default/a214d01/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fcb%2Fae31c6aad39b4ed091252e46505f%2Fe6f045c3650948fe8a528fd434033262"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy has expressed gratitude for U.S. President Donald Trump's plan to send more weapons to Ukraine, particularly Patriot air defense missile systems. But Ukrainians remain skeptical about the impact on the war of Washington's decision. Trump delayed “very severe” sanctions on Russia for 50 days, sparking criticism from Ukrainians and European leaders who see the delay as too long. Moscow saw the postponement as a reprieve.",
      "publishedAt": "2025-07-15T10:41:14Z",
      "title": "Ukrainians welcome US aid but see Trump’s 50-day ultimatum to Putin as too long",
      "url": "https://apnews.com/article/ukraine-trump-support-tariffs-russia-delay-9b620082c8fe3c457b23b0fe01241da2",
      "urlToImage": "https://dims.apnews.com/dims4/default/462d12a/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F4b%2F620c40a55af02735a0f56a73633d%2Fc591d44040584ee2a93d7c62cd32cc13"
    },
    {
      "author": null,
      "description": "Inflation rose last month to its highest level in four months as the cost of gas, food, and groceries rose, reversing several months of cooling price pressures. The Labor Department said that consumer prices rose 2.7% in June from a year earlier, up from an annual increase of 2.4% in May. On a monthly basis, prices climbed 0.3% from May to June, after rising just 0.1% the previous month. Worsening inflation poses a political challenge for President Donald Trump, who promised during last year’s presidential campaign to immediately lower costs.",
      "publishedAt": "2025-07-15T04:01:38Z",
      "title": "US inflation accelerated last month to highest level since February",
      "url": "https://apnews.com/article/inflation-trump-fed-powell-prices-8842d6ebca9d1870983e678e578d2091",
      "urlToImage": "https://dims.apnews.com/dims4/default/a401eb8/2147483647/strip/true/crop/3710x2087+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F64%2Ff2eaf15206095a0936f38346bdcf%2F571f44c4323a4a299337c0b4af17522c"
    },
    {
      "author": null,
      "description": "Senate Republicans are exploring changes to President Donald Trump’s request to cancel $9.4 billion in previously approved spending targeted by DOGE. The negotiations signal potential difficulties ahead of an important test vote. Trump is looking to claw back $1.1 billion of funding authority from the Corporation for Public Broadcasting and about $8.3 billion from foreign aid programs that aim to fight famine and disease and promote global stability. Congress has until Friday to get a bill to the president’s desk for his signature, or the spending stands. Senate Majority Leader John Thune says some GOP senators would like to see “modest changes” to the bill.",
      "publishedAt": "2025-07-15T16:52:31Z",
      "title": "Republicans mull changes to Trump's request for $9.4B in spending cuts",
      "url": "https://apnews.com/article/trump-republicans-budget-cuts-pepfar-pbs-npr-b224d4dd5962f141b23e76a4893e0d39",
      "urlToImage": "https://dims.apnews.com/dims4/default/8706680/2147483647/strip/true/crop/2820x1586+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F0c%2F5d29f3080d62bc69820a199e8ef6%2F73d24f40c01d40e8a85e57f358b7dce5"
    },
    {
      "author": null,
      "description": "Two men who cut down England’s iconic Sycamore Gap tree have been sentenced to over four years in prison. The tree stood for nearly 150 years near Hadrian’s Wall before it was felled in September 2023. Prosecutors called it a “moronic mission.” The 39-year-old Daniel Graham and 32-year-old Adam Carruthers were convicted of criminal damage for destroying the tree and harming the ancient wall. The tree was famous for its scenic location and a cameo in the 1991 film “Robin Hood: Prince of Thieves.” It was a beloved landmark. Justice Christina Lambert handed down the sentences at Newcastle Crown Court on Tuesday.",
      "publishedAt": "2025-07-15T04:10:19Z",
      "title": "Sycamore Gap vandals sentenced to more than 4 years in prison",
      "url": "https://apnews.com/article/britain-sycamore-gap-tree-trial-sentencing-chainsaw-28a6db1552e6acea118aa7e8bcf69ecb",
      "urlToImage": "https://dims.apnews.com/dims4/default/d244f91/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2Fc6%2F57e4c692c21aae00e7a866f52d2d%2F29485d195f92419da45769c8313bfd8c"
    },
    {
      "author": null,
      "description": "The Emmy nominations are nearly here, and “Severance” seems to be the show to beat. The Apple TV+ split-personality series is very likely to get nominations for best drama with lead acting nominations for stars Adam Scott and Britt Lower. “Severance” could get serious competition from fellow dramas “The Pitt” and “The White Lotus.” On the comedy side, another Apple show, Seth Rogen's Hollywood satire “The Studio,” will vie for reconition with Emmy veterans “Hacks” and “The Bear.” And among limited series, Netflix's acclaimed “Adolescence” seems likely to dominate both nominations and the awards when they're handed out on CBS in September.",
      "publishedAt": "2025-07-15T04:03:33Z",
      "title": "'Severance' could be the show to beat at this year's Emmys",
      "url": "https://apnews.com/article/emmy-nominations-2025-04fb965b3ad873e87a1b869db0c2780c",
      "urlToImage": "https://dims.apnews.com/dims4/default/f30c444/2147483647/strip/true/crop/2400x1350+0+125/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F22%2F1bb0667acf396415a243f1376c49%2F9bcfb2fdd80b45ad80a10a69efb4164e"
    },
    {
      "author": null,
      "description": "President Donald Trump’s strategy has been to downplay the uproar over the Jeffrey Epstein sex trafficking case as his supporters demand the Justice Department release much-hyped records in the investigation. Trump's problem is the nothing-to-see-here approach doesn’t work for those who've learned from him they must not give up until the government’s deepest, darkest secrets are exposed. Last week, the Justice Department and the FBI abruptly walked back the notion there's an Epstein client list of elites who participated in the wealthy New York financier’s trafficking of underage girls. The Republican president quickly defended Attorney General Pam Bondi, but the online backlash was swift.",
      "publishedAt": "2025-07-15T11:04:49Z",
      "title": "Trump's embrace of conspiracy theories haunts him with Epstein case",
      "url": "https://apnews.com/article/trump-epstein-conspiracy-theories-bondi-bongino-fbi-a143076353acbc1193cb9697e7fc4a90",
      "urlToImage": "https://dims.apnews.com/dims4/default/a0d6c91/2147483647/strip/true/crop/14845x8350+0+775/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F8e%2Fafb2d5bebc6c4ca0afc6e85011b9%2F0e75b10afbd7443abf9931ace520814f"
    },
    {
      "author": null,
      "description": "Authorities say two people in New Jersey were killed after their vehicle was swept up in flood waters during a storm that moved across the U.S. Northeast overnight. Authorities said Tuesday their names haven't been released yet. Meanwhile, York City’s subway system is fully operational following overnight heavy rains. But some roads in New Jersey remained closed and there were dozens of flight delays and cancelations at area airports, including 159 total cancelations at Newark Liberty Airport.",
      "publishedAt": "2025-07-15T13:10:32Z",
      "title": "2 dead in New Jersey after flood waters carry away vehicle during heavy rains that hit Northeast",
      "url": "https://apnews.com/article/new-york-city-new-jersey-flooding-f55d98547abc20e94dbb6be16a7f72cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/2b545f2/2147483647/strip/true/crop/3200x1800+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F49%2Ffcc0a7208c4fce51b56a67b40577%2F576dd22c55ab499db07ba1afe4ce14f0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}