{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and ELENA BECATOROS",
      "description": "RAFAH, Gaza Strip (AP) — Israeli warplanes struck parts of the Gaza Strip overnight into Saturday in relentless bombardments, including some of the dwindling slivers of land Palestinians had been told to evacuate to in the territory’s south.",
      "publishedAt": "2023-12-09T08:29:32Z",
      "title": "Israel presses on with Gaza bombardments, including in areas where it told civilians to flee",
      "url": "https://apnews.com/7625885f326b5a294479c6e8fc61355c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41e9d60ad82847e49960d45a918b28f8/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United States vetoed a United Nations resolution Friday backed by almost all other Security Council members and dozens of other nations demanding an immediate humanitarian cease-fire in Gaza.",
      "publishedAt": "2023-12-08T20:22:49Z",
      "title": "US vetoes UN resolution backed by many nations demanding immediate humanitarian cease-fire in Gaza",
      "url": "https://apnews.com/6d3bfd31d6c25168e828274d96b85cf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f4ea6500cd148c9a7e06bddfb716162/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN, SIBI ARASU and JAMEY KEATEN",
      "description": "DUBAI, United Arab Emirates (AP) — The oil industry is starting to sweat as United Nations climate talks heat up and threaten to plug fossil fuel-belching wells for good, veteran negotiation observers say.",
      "publishedAt": "2023-12-09T04:50:12Z",
      "title": "Observers see OPEC 'panicking' as COP28 climate talks focus on possible fossil fuel phase-out",
      "url": "https://apnews.com/0085b295b9637adae16ddf8fed5e499a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e41216efe484bcb88301081debcd778/3000.jpeg"
    },
    {
      "author": "JULIE WATSON",
      "description": "CASPAR BEACH, Calif. (AP) — A welding hammer strapped to her wrist, Joy Hollenback slipped on blue fins and swam into the churning, chilly Pacific surf one fall morning to do her part to save Northern California's vanishing kelp forests.",
      "publishedAt": "2023-12-09T05:11:39Z",
      "title": "From urchin crushing to lab-grown kelp, efforts to save California's kelp forests show promise",
      "url": "https://apnews.com/efc686ed56303f0f418dd9c84ae8c277",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2edb43d53e5b40c0b6661667c70594ba/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — A deal to provide further U.S. assistance to Ukraine by year-end appears to be increasingly out of reach for President Joe Biden. The impasse is deepening in Congress despite dire warnings from the White House about the consequences of inaction as Republicans insist on pairing the funding with changes to America's immigration and border policies.",
      "publishedAt": "2023-12-09T05:35:39Z",
      "title": "Ukraine aid in growing jeopardy as Republicans double down on their demands for border security",
      "url": "https://apnews.com/6bdcc5dde4dadb48b43ace75b5a55242",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59b84988d1af4f7b97ef769895a8bed7/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Behind bars in penal colonies or in self-exile abroad, Russian opposition figures vow they will still put up a fight against President Vladimir Putin as he seeks yet another term in office in an election in March.",
      "publishedAt": "2023-12-09T05:08:04Z",
      "title": "With Putin's reelection all but assured, Russia's opposition still vows to undermine his image",
      "url": "https://apnews.com/ed74cfa0fb957317188de39fe9ae7d15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c4c665106e44e5a9db137d3f22585cc/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA, KARL RITTER and MONIKA SCISLOWSKA",
      "description": "KORCZOWA, Poland (AP) — Pickup trucks and tourniquets bound for Ukraine’s battlefield are stuck in a mileslong line at the border with Poland. Components to build drones to fight off Russian forces are facing weeks of delays.",
      "publishedAt": "2023-12-09T05:30:12Z",
      "title": "Polish truck drivers are blocking the border with Ukraine. It's hurting on the battlefield",
      "url": "https://apnews.com/cbb2524630fdefcd4f58718d3a04d16a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f653dd49e6c94d0cb238fd8d03089dd1/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and DÁNICA COTO",
      "description": "CARACAS, Venezuela (AP) — A century-old territorial dispute deepened by the discovery of oil is boiling over between neighbors Guyana and Venezuela.",
      "publishedAt": "2023-12-09T05:02:27Z",
      "title": "Tensions are soaring between Guyana and Venezuela over century-old territorial dispute",
      "url": "https://apnews.com/d956cc4d5d2a70e3a1e762b744e397de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a80e0df606b465fbca95afb80419841/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and WILL WEISSERT",
      "description": "LOS ANGELES (AP) — If you're a Democrat with money to burn and friends in high places, you can spend thousands on tickets to a fundraiser with President Joe Biden.",
      "publishedAt": "2023-12-09T05:40:34Z",
      "title": "Big money, fancy homes, old jokes — inside Joe Biden's fundraisers",
      "url": "https://apnews.com/05c6322953201c86d9ed764d5d37c182",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0227161d98154a0181c329baeb82f2f7/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — The Texas Supreme Court on Friday night put on hold a judge's ruling that approved an abortion for a pregnant woman whose fetus has a fatal diagnosis, throwing into limbo an unprecedented challenge to one of the most restrictive bans in the U.S.",
      "publishedAt": "2023-12-09T03:49:03Z",
      "title": "Texas Supreme Court pauses lower court's order allowing pregnant woman to have an abortion",
      "url": "https://apnews.com/10767891a475e7ce2c82b1404450908a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/edcd7b7f370248d59cfe4c9d1b85b88d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}