{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "A ceasefire in the Gaza Strip took effect on Sunday following an almost three-hour delay. Hamas has released three prisoners and Israel is expected to release 90 Palestinian prisoners later Sunday.",
      "publishedAt": "2025-01-19T10:30:00Z",
      "title": "Live updates: Three Israeli hostages arrive in Israel as ceasefire passes first hurdle",
      "url": "https://apnews.com/live/mideast-israel-gaza-updates-1-19-25",
      "urlToImage": "https://dims.apnews.com/dims4/default/513779e/2147483647/strip/true/crop/8419x4736+0+438/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2Fcf%2Fc6f7c20ea902ef1f2b9cf14e1e8f%2F63f2988d952f4e0092d5fea2fd3ba1ac"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "Three hostages held by Hamas have been released after 471 days in captivity as part of a ceasefire between Israel and the Palestinian militant group. The release Sunday will be followed by that of dozens of other captives over the next several weeks under the ceasefire agreement. The truce has sparked hope and trepidation among Israelis. Many fear that the three-phase deal could collapse before all the hostages return, or that they will arrive in poor health. Others worry that the number of captives who have died is more than predicted.",
      "publishedAt": "2025-01-19T13:44:59Z",
      "title": "Who are the Israelis released on the first day of the ceasefire?",
      "url": "https://apnews.com/article/israel-gaza-hamas-hostages-ceasefire-709efbcf93714a562640133d836bb31c",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f2e8b7/2147483647/strip/true/crop/850x478+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F57%2F6a933259db778bd45d73f50e7bc3%2F12dbc01311e24b81bc12e0635b91ac81"
    },
    {
      "author": "SAMY MAGDY, WAFAA SHURAFA",
      "description": "Even before the ceasefire deal between Israel and Hamas was fully in place, Palestinians in the war-battered Gaza Strip began to return to the remains of the homes they had evacuated during the 15-month war. They trekked through the wreckage, some on foot and others hauling their belongings on donkey carts. The return of the families comes amid looming uncertainty about whether the ceasefire deal will bring more than a temporary halt to the fighting, who will govern the enclave and how it will be rebuilt. The United Nations has said that reconstruction could take more than 350 years if Gaza remains under an Israeli blockade.",
      "publishedAt": "2025-01-19T12:32:47Z",
      "title": "Palestinians return to the remains of their homes as Gaza ceasefire takes hold",
      "url": "https://apnews.com/article/mideast-ceasefire-gaza-return-home-3942d995e85f0d33539c6625b2cd1ee5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d469c81/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F96%2Fc1b4624d0ed5f405d0466a72ed9e%2F1fef177a13d547158a4c3b8b2afb76d1"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "Israel’s far-right national security minister resigned from Prime Minister Benjamin Netanyahu’s Cabinet to express his disapproval of the Gaza ceasefire deal. The resignation of Itamar Ben-Gvir does not threaten the ceasefire, but it does weaken Netanyahu’s governing coalition. If other far-right lawmakers leave the government — as Ben-Gvir has encouraged them to do — the prime minister could lose his parliamentary majority, potentially forcing early elections. Ben-Gvir opposed the deal because it requires Israel to free hundreds of Palestinian prisoners and to withdraw troops from Gaza’s southern border with Egypt — and because it leaves open the possibility of Hamas staying in power in Gaza.",
      "publishedAt": "2025-01-19T12:10:17Z",
      "title": "Who is Ben-Gvir? The minister resigned from Netanyahu's Cabinet",
      "url": "https://apnews.com/article/itamar-bengvir-resigns-gaza-ceasefire-netanyahu-d63bc4ac1e4f741cafa6fab4d932f891",
      "urlToImage": "https://dims.apnews.com/dims4/default/e97f570/2147483647/strip/true/crop/5479x3082+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F06%2F599ad13bef32a6ed8ca1a5bf59c1%2Fc1e51ab8e930455dae326cdc8bd54b6d"
    },
    {
      "author": null,
      "description": "Aerial footage on Sunday showed the devastation caused to the city of Khan Younis in the Gaza Strip following 15 months of fighting between Israel and Hamas.",
      "publishedAt": "2025-01-19T15:18:00Z",
      "title": "Drone footage shows destruction in Gaza's Khan Younis",
      "url": "https://apnews.com/video/gaza-strip-israel-hamas-war-war-and-unrest-israel-hamas-1276852d97cc482d85cb222dc532fcf0",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc68f44/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F3f%2F4d4b901ab846dfbcba32feb0adea%2Fgaz-khan-younis-destruction-20250119cr-1920x1080.jpg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Millions of TikTok users in the United States are no longer able to watch videos on the social media platform as a federal ban on the immensely popular app takes effect. The company’s app was removed Saturday evening from prominent app stores, including the ones operated by Apple and Google, while its website told users that the short-form video platform was no longer available. The blackout began just hours before the law took effect.",
      "publishedAt": "2025-01-19T04:00:45Z",
      "title": "TikTok ban takes effect in the US",
      "url": "https://apnews.com/article/tiktok-ban-trump-biden-china-bdc79b7ce741a81761f67ea56d410103",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a10aa3/2147483647/strip/true/crop/7237x4071+0+366/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F3c%2F3cd26eaf3cf0e1ee427e16bb6063%2Ff9683bfdcdd24f338c9fab4ef5a83d6b"
    },
    {
      "author": "DAVID HAMILTON",
      "description": "If it feels like TikTok has been around forever, that’s probably because it has, at least if you’re measuring via internet time. What’s now in question is whether it will be around much longer and, if so, in what form? The Chinese social video app merged in 2017 with the competing app Musical.ly, which also launched in China. That kicked off a remarkable seven years during which TikTok grew from a niche teen app into a global trendsetter, but also emerged as a potential national security threat, according to U.S. officials.",
      "publishedAt": "2025-01-19T13:27:11Z",
      "title": "How TikTok grew from an app for teens into a potential national security threat",
      "url": "https://apnews.com/article/tiktok-ban-biden-timeline-india-119969bfc584e92d47baa189a3e1c4fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c872ba/2147483647/strip/true/crop/4644x2612+0+242/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F90%2F5b9351a8a339761784aa99977006%2Ffded76dbaf0e42cfb6861ecfe88166e8"
    },
    {
      "author": "FU TING, DAVID COHEN",
      "description": "A rare wave of U.S.-China camaraderie broke out online in recent days as “refugees” from the popular short video platform TikTok poured onto a Chinese social media platform to protest a now-delayed ban on the service. As the fate of TikTok hangs in the balance, U.S. TikTok users are flocking to Xiaohongshu — making it the top downloaded app in the U.S. Some of the “TikTok refugees,” as they call themselves, say the TikTok alternative, a Chinese app, is being chosen in protest of the TikTok ban. Here’s what you need to know about Xiaohongshu, also known as RedNote.",
      "publishedAt": "2025-01-17T21:33:11Z",
      "title": "TikTok refugees are pouring to Xiaohongshu. What to know about the RedNote app",
      "url": "https://apnews.com/article/tiktok-refugee-xiaohongshu-rednote-855692624aa52825b30afc5474af881d",
      "urlToImage": "https://dims.apnews.com/dims4/default/feecbf5/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fe4%2F1caad0f712876cf275526eed2a0b%2F2d91d76b7a6b4c1e87c30e235997b41e"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, TIA GOLDENBERG",
      "description": "The deadline for the start of a ceasefire in the Gaza Strip has passed. Israeli Prime Minister Benjamin Netanyahu said Sunday that Hamas had not lived up to its commitment to provide the names of the three hostages it was set to release later on Sunday in exchange for scores of Palestinian prisoners. Rear Adm. Daniel Hagari, the top Israeli military spokesman, said the army “continues to attack” and would until Hamas complies with the agreement. Hamas blamed the delay in handing over the names on “technical field reasons.” An Israeli official said mediators have provided assurances that the list will be delivered and the deal is still expected to go forward, though the timing remains in question.",
      "publishedAt": "2025-01-19T05:44:46Z",
      "title": "Gaza ceasefire delayed until Hamas provides names of first hostages, Israel says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-19-2025-437f7f1bf49c9d2936718cf78bdf272c",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e7a25d/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F9c%2Fccafde69596b4a8791084575fd05%2Ff65c384dd88b4224a130e71d6f4cb61c"
    },
    {
      "author": "WILL WEISSERT, FATIMA HUSSEIN, JOSH BOAK",
      "description": "A raucous victory rally highlighted President-elect Donald Trump’s first full day back in Washington since the election. The Republican on Sunday celebrated his return to the White House and projected defiant optimism despite deep national political divisions on the eve of his inauguration. Supporters filled most of the 20,000-plus-seat Capital One Arena to hear a performance by Kid Rock. Others taking the stage included billionaire Elon Musk and Lee Greenwood, whose “God Bless the USA” was the anthem of Trump’s reelection campaign. Trump was set to speak later in the evening.",
      "publishedAt": "2025-01-19T12:09:42Z",
      "title": "Raucous MAGA rally punctuates events celebrating Trump on the eve of his inauguration",
      "url": "https://apnews.com/article/trump-inauguration-rally-republicans-arlington-maga-1fb77ff176d21975620a9d452d943b74",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c0b128/2147483647/strip/true/crop/4403x2477+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F64%2F22a6c67ff024d02204f7bd88b2dd%2F69fdd1a82a004584a12616c905a83edd"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}