{
  "articles": [
    {
      "author": "MOLLY QUELL and RAF CASERT",
      "description": "STRASBOURG, France (AP) — Europe’s highest human rights court ruled Tuesday that its member nations must protect their citizens from the consequences of climate change in a landmark ruling that sided with a group of 2,000 Swiss women against their government in a case that could have implications across the continent.",
      "publishedAt": "2024-04-09T04:37:53Z",
      "title": "Swiss women score a landmark climate win in a court decision that could ripple across Europe",
      "url": "https://apnews.com/3b540a965aff7e2b49f1451c7a328e77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6011171566444eaaf3b15f4bd6c0baa/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "DALLAS (AP) — Whether you saw the moon completely block the sun, were foiled by cloudy weather or weren't along the path of Monday's total solar eclipse, there are still more chances to catch a glimpse.",
      "publishedAt": "2024-04-09T05:05:20Z",
      "title": "Can't get enough of the total solar eclipse or got clouded out? Here are the next ones to watch for",
      "url": "https://apnews.com/c3bc0a68e1ad187729297296a5f582f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5e0a2eaa72843d8865010b83d0f538c/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli Prime Minister Benjamin Netanyahu has escalated his pledge to invade the southern Gaza city of Rafah, which is filled with around 1.4 million Palestinians, most of whom are displaced from other parts of the Gaza Strip.",
      "publishedAt": "2024-04-09T07:02:01Z",
      "title": "The Latest | Netanyahu vows to carry out Rafah invasion, which US says would be a mistake",
      "url": "https://apnews.com/69ef99967e002cdb3c23924916561e52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e715168db27741b680563a3998e7ac97/3000.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — Germany on Tuesday strongly rejected a case brought by Nicaragua at the United Nations' top court accusing Berlin of facilitating breaches of the Geneva Convention and international humanitarian law by providing arms and other support to Israel in its deadly assault on Gaza.",
      "publishedAt": "2024-04-09T09:42:26Z",
      "title": "Germany rejects allegations that it's facilitating acts of genocide in Gaza at UN court",
      "url": "https://apnews.com/91a605921b44110ae5534e6438405997",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf71e243445f4fa2b56797329ece2ca3/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith's team urged the Supreme Court on Monday night to reject former President Donald Trump's claim that he is immune from prosecution in a case charging him with scheming to overturn the results of the 2020 presidential election.",
      "publishedAt": "2024-04-09T00:25:16Z",
      "title": "Prosecutors urge Supreme Court to reject Trump's immunity claims in election subversion case",
      "url": "https://apnews.com/f8bd5c4e7fb2251587e4443d9ded7178",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfe69042dbb945569a884563f3edc979/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Japanese Prime Minister Fumio Kishida begins a much-anticipated visit to Washington on Tuesday aiming to spotlight shared concerns about provocative Chinese military action in the Pacific and at a rare moment of public difference between the two nations over a Japanese company's plan to buy an iconic U.S.",
      "publishedAt": "2024-04-09T04:05:08Z",
      "title": "Biden to meet Japan's PM Kishida amid shared concerns about China and differences on US Steel deal",
      "url": "https://apnews.com/f72d7162f0bd20c42e096c25e4b845c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5e136a7126b491795725d77f6a4e34b/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "SIEM REAP, Cambodia (AP) — A baby monkey struggles and squirms as it tries to escape the man holding it by the neck over a concrete cistern, repeatedly dousing it with water. In another video clip, a person plays with the genitals of a juvenile male macaque sitting on a limestone block from an ancient temple to get it excited for the camera.",
      "publishedAt": "2024-04-09T04:15:38Z",
      "title": "Cruelty for clicks: Cambodia is investigating YouTubers' abuse of monkeys at the Angkor UNESCO site",
      "url": "https://apnews.com/38233596360b5d51b47d17abfb6820f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8067a08565a0403f8a6b10330522cc4e/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "GLENDALE, Ariz. (AP) — A basketball beatdown. A coaching clinic. A double-digit domination. Take one guess who finished off a romp through college basketball again. You bet, it’s UConn — a team built to win now, and often, and by a lot every time it takes the court.",
      "publishedAt": "2024-04-09T03:32:38Z",
      "title": "UConn concludes a dominant run to its 2nd straight NCAA title, beating Zach Edey and Purdue 75-60",
      "url": "https://apnews.com/525f5f96f6b007034a2cb928dc8a4dbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44fdc14519c74fa4a73c45be5fd6ca68/1920.jpeg"
    },
    {
      "author": "BROOKE SCHULTZ",
      "description": "With a compact mirror in one hand and an eyelash curler in the other, Grace Xu told her roughly 300,000 TikTok followers she was likely about to be laid off. She was right, she tells them in a subsequent clip.",
      "publishedAt": "2024-04-09T10:00:47Z",
      "title": "Content creation holds appeal for laid-off workers seeking flexibility",
      "url": "https://apnews.com/876cbfb5cb067b46496f9c99e79f0c56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6402d7388e77426e8b29d5b03cec4412/3000.jpeg"
    },
    {
      "author": "KRISTIE RIEKEN",
      "description": "HOUSTON (AP) — Houston’s Yordan Alvarez might be the top left-handed hitter in Major League Baseball. Teammate Framber Valdez ranks among the best left-handed pitchers, too.Other than that, those guys are all right.",
      "publishedAt": "2024-04-09T10:00:31Z",
      "title": "Who's really left-handed? In baseball, it can be hard to tell",
      "url": "https://apnews.com/4eb62b7acebb3d0e5617bf49b3925049",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5ccc0a62f2043b7a027da07a513e980/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}