{
  "articles": [
    {
      "author": "Nicole Winfield, Colleen Barry",
      "description": "Cardinals are meeting at the Vatican to make the first decisions about running the Catholic Church following the death of Pope Francis. They need to decide when Francis' body will be moved into St. Peter’s Basilica for public viewing, when the funeral and burial will take place, and when the conclave will begin to elect his successor. The Congregation of Cardinals, the Tuesday gathering of the cardinals currently in Rome, could choose to begin the public viewing as soon as Wednesday. Under norms approved by Francis last year, the funeral and burial must occur between Friday and Sunday.",
      "publishedAt": "2025-04-22T05:56:55Z",
      "title": "Cardinals meet Tuesday at Vatican to choose date for Pope Francis' funeral",
      "url": "https://apnews.com/article/pope-francis-death-funeral-conclave-e9688b14b9d9e19bbdd6a868d57a4699",
      "urlToImage": "https://dims.apnews.com/dims4/default/600f41d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F08%2F53e7de4bea571c4022bfcba5b7a6%2F61096b564416415cb9e008e78a91906f"
    },
    {
      "author": "Nicole Winfield, Vanessa Gera",
      "description": "Pope Benedict XVI stunned the world when he announced his resignation in 2013, the first in 600 years. That led some to wonder, as he grew increasingly frail and sick, if Pope Francis would follow in his predecessor's footsteps. While Francis kept open the possibility, and even had a resignation letter prepared, he said more recently that he believed that the papacy was for life and pointed out the risks that papal resignations might become a “fashion” or the norm.",
      "publishedAt": "2025-04-22T11:16:44Z",
      "title": "While Pope Benedict XVI resigned, Francis saw his duty to be 'ad vitam'",
      "url": "https://apnews.com/article/vatican-pope-francis-benedict-xvi-resignation-16b4bb60a7e87a88c719570d1490f5db",
      "urlToImage": "https://dims.apnews.com/dims4/default/441137d/2147483647/strip/true/crop/2000x1125+0+105/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F45%2Fc8%2F8658e0ff41b46f4ea0ac61bcc0d2%2Fb54d8c3e575b4ffc86e242ee45d523f3"
    },
    {
      "author": "Almudena Calatrava, Isabel DeBre",
      "description": "Pope Francis never set foot in his native Argentina during his papacy. That left many of the faithful in his homeland feeling puzzled and snubbed by the world’s first Latin American pope. Analysts and Vatican insiders attributed the decision by Francis as an effort to avoid the polarizing politics that characterized his country in recent decades. Francis died on Monday at the age of 88. He was known to have tense relationships with some of Argentina’s leaders. But his stark ideological differences with current President Javier Milei created even more challenges.",
      "publishedAt": "2025-04-22T10:12:12Z",
      "title": "Pope Francis never visited his home country of Argentina while he was pope",
      "url": "https://apnews.com/article/pope-francis-argentina-visit-politics-1a0f4ed32521901cd0c2486a3adf1b29",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a39ef9/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F60%2Fcd8b7c04c9f10289127821f79ec0%2Fa231af4884ec4598ae03703787c9abd7"
    },
    {
      "author": "Stan Choe",
      "description": "U.S. stocks are rallying as companies report fatter profits than expected. The S&P 500 climbed 2.6% Tuesday and recovered all of its drop from Monday, which came on worries about President Donald Trump’s trade war and his attacks on the head of the Federal Reserve. The Dow Jones Industrial Average rose 1,021 points, or 2.7%. and the Nasdaq composite climbed 3%. Equifax, PulteGroup and 3M helped lead the way following better-than-expected profit reports. The value of the U.S. dollar also stabilized after sliding against the euro and other competitors, while Treasury yields held steadier in the bond market.",
      "publishedAt": "2025-04-22T04:38:28Z",
      "title": "Wall Street rallies and recovers all of Monday's slide as the dollar and US bond market steady",
      "url": "https://apnews.com/article/stock-markets-trump-tariffs-investments-7ee60dbf71e262843eac15ae1564f4cb",
      "urlToImage": "https://dims.apnews.com/dims4/default/fa6bfaa/2147483647/strip/true/crop/4573x2572+0+238/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2F7a%2Fc07c62008501857699300cc7c5b0%2Fda981930352741c6a504d5f2edfb770c"
    },
    {
      "author": "Jon Gambrell",
      "description": "Negotiations between Iran and the United States over Tehran’s rapidly advancing nuclear program will move to what’s known as the “expert level” — a sign analysts say shows that the talks are moving forward rapidly. However, experts not involved in the talks who spoke with The Associated Press warn that this doesn’t necessarily signal a deal is imminent. Instead, it means that the talks between Iranian Foreign Minister Abbas Araghchi and U.S. Mideast envoy Steve Witkoff haven’t broken down at what likely is the top-level trade — Tehran limiting its atomic program in exchange for the lifting of economic sanctions.",
      "publishedAt": "2025-04-22T05:04:57Z",
      "title": "What do 'expert' talks signal for Iran-US nuclear negotiations?",
      "url": "https://apnews.com/article/iran-us-nuclear-negotiations-expert-talks-explainer-4b47bfb4074469b1832f6b5009c84b58",
      "urlToImage": "https://dims.apnews.com/dims4/default/9190b70/2147483647/strip/true/crop/3500x1969+0+79/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F65%2Fa8926521ea3924857d4082ce7978%2F9405781ae7a147a7a66c67ef509dafd4"
    },
    {
      "author": "Tara Copp",
      "description": "Defense Secretary Pete Hegseth pulled the airstrike information he posted into Signal chats with his wife, brother and dozens of others from a secure communications channel from U.S. Central Command. This raises new questions as to whether the embattled Pentagon head leaked classified information over an open, unsecured network. NBC News first reported that the launch times and bomb drop times of U.S. warplanes that were about to strike Houthi targets in Yemen were taken from secure U.S. Central Command communications. A person familiar with the second chat confirmed it to The Associated Press. The news comes as Hegseth has shaken up much of his inner circle.",
      "publishedAt": "2025-04-22T15:28:22Z",
      "title": "NBC News: Hegseth pulled airstrike info from secure military channel for Signal posts",
      "url": "https://apnews.com/article/hegseth-leaks-signal-trump-classified-09f58fa650e44f740c9416c3e6997f5b",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c0a756/2147483647/strip/true/crop/5735x3226+0+299/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2Fde%2Fbefb720c71fc3e2503249d8d589d%2Ffdf25b4815934df0a1ba0fad8e2975bc"
    },
    {
      "author": "Aijaz Hussain",
      "description": "Indian police say gunmen have killed at least 20 tourists at a resort in Indian-controlled Kashmir. Tuesday's attack appears to be a major shift in the regional conflict in which tourists have largely been spared from violence. Two senior police officers say at least four gunmen, whom they described as militants, fired at dozens of tourists from close range. The officers say at least three dozen others were injured, with many in serious condition. The region's top elected official says the attack is “much larger than anything we’ve seen directed at civilians in recent years.”",
      "publishedAt": "2025-04-22T11:08:50Z",
      "title": "Indian police say gunmen kill at least 20 tourists at a Kashmir resort",
      "url": "https://apnews.com/article/kashmir-tourist-attack-dc7067a18899d9e7ff7726d4e05982c3",
      "urlToImage": "https://dims.apnews.com/dims4/default/f1748f1/2147483647/strip/true/crop/4880x2745+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F3c%2Ffe1b8431a61aa736909bd5e7460f%2F10132ed887014c49bd9a455cc4ff70ef"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court’s conservative majority is signaling support for the religious rights of Maryland parents who want to remove their children from elementary school classes using storybooks with LGBTQ characters. The court seemed likely Tuesday to find the Montgomery County school system could not require elementary school children to sit through lessons involving the books if parents expressed religious objections to them. The court has repeatedly endorsed claims of religious discrimination in recent years. The school board introduced the storybooks in an effort to better reflect the district’s diversity. Parents sued after the school system stopped allowing them to pull their kids from lessons that included the books.",
      "publishedAt": "2025-04-22T11:24:41Z",
      "title": "Supreme Court signals support for parents who object to LGBTQ books in public schools",
      "url": "https://apnews.com/article/supreme-court-lgbtq-books-religion-maryland-069d155fa862d2a16619fc7f513819ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/280403d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Ff4%2F1cb4658ed6dce97cd5da87709baa%2Fd2094ff4d73649b1bc669f3707412db2"
    },
    {
      "author": "Michael Casey",
      "description": "The much-anticipated retrial of Karen Read is set to begin. Both sides will make opening statements Tuesday. A new set of jurors is expected to wrestle over two theories in the death of Read's Boston police officer boyfriend. Prosecutors say she killed him. Defense attorneys say she was a victim of a conspiracy involving the police. Read has been charged with second-degree murder, manslaughter and leaving the scene. A mistrial was declared last year after jurors said they were at an impasse. Many of the factors that made the first trial must-see television will be featured in the second. The biggest difference will be the lead prosecutor, Hank Brennan.",
      "publishedAt": "2025-04-22T04:08:11Z",
      "title": "Karen Read faces second trial over boyfriend's 2022 death",
      "url": "https://apnews.com/article/karen-read-murder-trial-boston-4bbe13cf634635aed2aba2816aaaf7f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/3540d8e/2147483647/strip/true/crop/3372x1897+0+176/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2Fe4%2Fd3a789532631692ed305cab65bf4%2Fa1790b0da8c343118fadeed542e4efda"
    },
    {
      "author": "JoNel Aleccia, Matthew Perrone",
      "description": "U.S. health officials plan to phase out eight petroleum-based colors from the nation's food supply. The move would trigger an overhaul of scores of products on U.S. grocery store shelves. Details of the plan were expected to be announced Tuesday afternoon by Health Secretary Robert F. Kennedy Jr. and Food and Drug Administration Commissioner Marty Makary. The FDA currently allows 36 color additives, including eight synthetic dyes. In January, the agency banned the color known as Red 3. Food producers would likely replace the dyes with natural substitutes.",
      "publishedAt": "2025-04-22T16:52:02Z",
      "title": "RFK Jr. plans to phase out eight artificial dyes from the US food supply",
      "url": "https://apnews.com/article/fda-artificial-food-dyes-kennedy-6f6c1aa08aafdae1925718804f360c0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ac2a150/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F32%2Ff48c0d88794b4cd1e47f64a08b0c%2F71309e437e4840968d76370352bf4fd3"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}