{
  "articles": [
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — From her earliest campaigns in California to her serving as President Joe Biden's running mate, Kamala Harris has honed an aggressive but calibrated approach to debates.",
      "publishedAt": "2024-09-09T04:02:54Z",
      "title": "Harris' past debates: A prosecutor's style with narrative flair but risks in a matchup with Trump",
      "url": "https://apnews.com/240d0978bd7d38d9757b5d314359b7d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e38fc71173f459a86e49083808d5b3c/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — He claimed she would raise taxes and accused her of supporting open border policies that would allow an influx of unvetted migrants into the country. He blamed her for a litany of the current administration's failures and cast her potential presidency as four more years of the same.",
      "publishedAt": "2024-09-09T04:04:34Z",
      "title": "What the Trump-Clinton debates might tell us about Tuesday's match with Harris",
      "url": "https://apnews.com/fa04981a2d74df1fb2f269d54aaac081",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/efdb5b174d3441ac955957c35bc7294e/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "ATLANTA (AP) — The mother of a student at the Georgia high school where a teen allegedly killed four people says information indicating staff were warned he was having a crisis shows the shooting could have been prevented.",
      "publishedAt": "2024-09-08T21:19:34Z",
      "title": "Mother's warning to Georgia school raises questions about moments before shooting",
      "url": "https://apnews.com/cbaf55d23ae14a68a2e70b9bd3f6dd29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d33736ce58d1414ebcd447fef3551cdf/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — Kate, the princess of Wales, has completed chemotherapy and will make a limited number of public appearances in the coming months, bolstering Britain’s royal family after it was rocked by the twin cancer diagnoses of the princess and King Charles III.",
      "publishedAt": "2024-09-09T15:34:39Z",
      "title": "Kate, princess of Wales, says she completed chemotherapy and will return to limited public duties",
      "url": "https://apnews.com/ee5a195bc0c4af3516245f9262ffc306",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe16a56b83c945adafb007e33884b237/3000.jpeg"
    },
    {
      "author": "IMAD ISSIED",
      "description": "NABLUS, West Bank (AP) — The Palestinian Authority held a funeral procession Monday for an American activist who a witness says was shot and killed by Israeli forces last week following a demonstration against settlements in the occupied West Bank.",
      "publishedAt": "2024-09-09T13:39:25Z",
      "title": "Funeral held for an American activist a witness says was shot dead by Israeli troops",
      "url": "https://apnews.com/ff3ed17b295793bce4631fdb2a35332c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/868a8f77add54586a329edce13dfb54c/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and NINIEK KARMINI",
      "description": "DILI, East Timor (AP) — Pope Francis received a raucous welcome Monday as he arrived in East Timor to celebrate its recovery from a bloody and traumatic independence battle, even as he indirectly acknowledged an abuse scandal involving its Nobel Peace Prize-winning hero.",
      "publishedAt": "2024-09-09T05:23:45Z",
      "title": "Pope cheers East Timor's recovery while acknowledging a bishop's abuse scandal",
      "url": "https://apnews.com/324de6a22f78299cf4bc4b664fc50de9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a837d658c3a6433eb142fa54f17d3e9d/1920.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "LONDON, Ky. (AP) — More than a dozen school districts shut down Monday across a wide swath of southeastern Kentucky as a grueling search stretched into a third day for a gunman who opened fire on an interstate highway and wounded five people over the weekend.",
      "publishedAt": "2024-09-09T04:41:48Z",
      "title": "Schools close as police search for the gunman who wounded 5 people on a Kentucky interstate",
      "url": "https://apnews.com/12c876f065c5ce9e0265dd1b65e772f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c847356bf804dc8a9bea50c8bead986/3000.jpeg"
    },
    {
      "author": "SARA CLINE and JAMIE STENGLE",
      "description": "BATON ROUGE, La. (AP) — Tropical Storm Francine formed in the Gulf of Mexico on Monday and was expected to drench the Texas coast with rain before coming ashore in Louisiana as a hurricane on Wednesday night.",
      "publishedAt": "2024-09-09T15:08:31Z",
      "title": "Tropical Storm Francine forms off Mexico and is expected to hit Louisiana as a hurricane",
      "url": "https://apnews.com/d12cf03820106f9eb7451e00de1015c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a5e0ef589bc4a31bc956cd879cd9867/1920.jpeg"
    },
    {
      "author": "ADRIAN SAINZ",
      "description": "MEMPHIS, Tenn. (AP) — Jury selection was scheduled to begin Monday in the federal trial of three former Memphis officers charged with violating the civil rights of Tyre Nichols, the 29-year-old man whose fatal beating was caught on police cameras, triggering protests and calls for police reform.",
      "publishedAt": "2024-09-09T07:12:16Z",
      "title": "Trial for 3 former Memphis officers charged in Tyre Nichols' death set to begin",
      "url": "https://apnews.com/7b87593e6287139ba0be09a03c11a632",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f86804fecc9343608844d165f9369471/2811.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "AURORA, Colo. (AP) — She was eight months pregnant when she was forced to leave her Denver homeless shelter. It was November.Ivanni Herrera took her 4-year-old son Dylan by the hand and led him into the chilly night, dragging a suitcase containing donated clothes and blankets she’d taken from the Microtel Inn &amp; Suites.",
      "publishedAt": "2024-09-09T05:42:53Z",
      "title": "On the streets of a Colorado city, pregnant migrants struggle to survive",
      "url": "https://apnews.com/34be1de4adf3b04e9de8c4bbc68fc127",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49946660d16d4eb69666949bc753ed7a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}