{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump is threatening to cut Elon Musk’s government contracts as their fractured alliance rapidly escalated into a public feud. Hours after Trump lamented his breakup with Musk and said Thursday that he was “disappointed” in his former backer and adviser and Musk responded on social media, Trump escalated the feud by threatening to use the U.S. government to hurt Musk’s bottom line. “The easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elon’s Governmental Subsidies and Contracts,” Trump wrote on his social media network. “I was always surprised that Biden didn’t do it!”",
      "publishedAt": "2025-06-05T16:18:53Z",
      "title": "Trump and Musk's relationship flames out just as intensely as it started",
      "url": "https://apnews.com/article/trump-musk-tax-bill-6e7845081259c34db785182c51569c0c",
      "urlToImage": "https://dims.apnews.com/dims4/default/51b07d1/2147483647/strip/true/crop/5416x3047+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F45%2F77%2Fd3eb6925efa2db56d7f7e332899d%2F45909fb1233f453889423d2489bd695e"
    },
    {
      "author": null,
      "description": "Officials say Ukraine was under an ongoing Russian ballistic missile and drone attack early Friday that wounded at least three people. Multiple explosions were heard in the capital, Kyiv, where falling debris sparked fires across several districts as air defense systems attempted to intercept incoming targets. Three people were wounded, local officials said. They urged residents to seek shelter. Authorities reported damage in several districts, and rescue workers were responding at multiple locations. In northern Chernihiv region, a Shahed drone exploded near an apartment building, shattering windows and doors, according to the regional military administration chief. He added that explosions from ballistic missiles were also recorded on the outskirts of the city.",
      "publishedAt": "2025-06-06T00:44:54Z",
      "title": "Ukraine is under an ongoing Russian missile and drone attack",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-zelenskyy-trump-80c8984bc2e52da0212da4e0d4cf8220",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5f5e59/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F6e%2F169b28ea7ecf7fa345c645d731e8%2Fa2c16881857c45358f027dce9a6a7c7b"
    },
    {
      "author": null,
      "description": "A man accused of yelling “Free Palestine” and throwing Molotov cocktails at demonstrators calling for the release of Israeli hostages in Gaza has been charged with attempted murder and explosives crimes. Mohamed Sabry Soliman was advised of the charges during a brief hearing Thursday in a state courtroom at the jail in Boulder, Colorado. He has been held there since his arrest following Sunday’s fiery attack. Authorities say he injured 15 people, ranging in age from 25 to 88, and a dog.",
      "publishedAt": "2025-06-05T05:40:00Z",
      "title": "Man charged with attempted murder after throwing Molotov cocktails at demonstrators in Colorado",
      "url": "https://apnews.com/article/boulder-firebombing-attack-9820f4b51d73efc3da72150b80634ea2",
      "urlToImage": "https://dims.apnews.com/dims4/default/07cb7b7/2147483647/strip/true/crop/3000x1688+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2Fcc%2F579bb011fc2233bbcb45a52df329%2F1c05780b9bcc4edd9fae1f7ebdb56da5"
    },
    {
      "author": null,
      "description": "Harvard University is challenging President Donald Trump’s move to block foreign students from coming to the United States to attend the Ivy League school, calling it illegal retaliation for Harvard’s rejection of White House demands. In an amended complaint filed Thursday, Harvard called the president’s action an end-run around a previous court order. Last month, a federal judge blocked the Department of Homeland Security from revoking Harvard’s ability to host foreign students. The filing attacks Trump’s legal justification for the action — a federal law allowing him to block a “class of aliens” deemed detrimental to the nation’s interests.",
      "publishedAt": "2025-06-05T19:40:36Z",
      "title": "Harvard challenges Trump's block on foreign students",
      "url": "https://apnews.com/article/trump-harvard-ban-acceptance-foreign-students-6a2c96addad4c63ad10afe19eb425acd",
      "urlToImage": "https://dims.apnews.com/dims4/default/522f3cf/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F43%2F17539080e40906ffc39187606494%2Fd40f246ff3d74956921b77278cc509fc"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu said that Israel has “activated” some local clans of Palestinians in Gaza in the fight against Hamas. In a video posted to his X account, Netanyahu said the government made the move on the advice of “security officials” in order to save lives of Israeli soldiers. The announcement Thursday came hours after a political opponent criticized him for arming unofficial groups of Palestinians in Gaza.",
      "publishedAt": "2025-06-05T17:57:58Z",
      "title": "Netanyahu: Israel has 'activated' Palestinian clans in fight against Hamas",
      "url": "https://apnews.com/article/netanyahu-palestinian-clans-activated-armed-8f2461f5253550d0a4ce4ea661c580ef",
      "urlToImage": "https://dims.apnews.com/dims4/default/e0b55cd/2147483647/strip/true/crop/5148x2896+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F8f%2F5eeccd792e47b52c1a498bdc2420%2F202b4804d2b647d29421023952a48d10"
    },
    {
      "author": null,
      "description": "An immigration judge has granted bond to a Massachusetts high school student who was arrested on his way to volleyball practice over the weekend. Eighteen-year-old Marcelo Gomes da Silva, who came to the U.S. from Brazil at age 7, was detained by U.S. Immigration and Customs Enforcement agents Saturday. Authorities have said the agents were looking for the Milford High School teen's father, who owns the car Gomes da Silva was driving at the time and had parked in a friend’s driveway. Authorities said that although they never intended to apprehend him, he was found to be in the U.S. illegally. His lawyer says he's “as clean as a whistle” and was expected to be released later Thursday on $2,000 bond.",
      "publishedAt": "2025-06-05T15:09:19Z",
      "title": "Judge grants bond to Massachusetts student arrested by ICE",
      "url": "https://apnews.com/article/marcelo-gomes-ice-massachusetts-arrest-volleyball-1356302a723f6f5b0a95028754f7291e",
      "urlToImage": "https://dims.apnews.com/dims4/default/200abf5/2147483647/strip/true/crop/4200x2363+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F1a%2Fd3ed6eacc9423257570506a5132f%2Fe4b34875bdd8429fa3266f7b95305b30"
    },
    {
      "author": null,
      "description": "A unanimous Supreme Court has made it easier to bring lawsuits over so-called reverse discrimination, siding with an Ohio woman who claims she didn’t get a job and was demoted because she's straight. The justices’ decision Thursday affects lawsuits in 20 states and the District of Columbia where, until now, courts had set a higher bar when members of a majority group, including those who are white and heterosexual, sue for discrimination under federal law. The court ruled in an appeal from Marlean Ames, who's worked for the Ohio Department of Youth Services for years. Justice Ketanji Brown Jackson says federal civil rights law draws no distinction between members of majority and minority groups.",
      "publishedAt": "2025-06-05T14:08:34Z",
      "title": "Supreme Court makes it easier to claim 'reverse discrimination' in employment",
      "url": "https://apnews.com/article/supreme-court-discrimination-lawsuit-ohio-205f07a2d47d7a46cfc96a5fefdf9269",
      "urlToImage": "https://dims.apnews.com/dims4/default/a519aa0/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F38%2F37255488e051ca68d07e2d0543d4%2F925c93a5304048459f79a7ffbd470f68"
    },
    {
      "author": "Chris Megerian, Farnoush Amiri",
      "description": "President Donald Trump is again banning people from countries his administration deems dangerous from coming to America. The travel ban issued Wednesday is a repeat of an order of his first administration that led to widespread confusion at airports. This version includes Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. The Republican president’s first travel ban was issued in 2017 and banned travel to the U.S. by citizens of seven predominantly Muslim countries. After legal challenges, the order was retooled until a version was upheld by the Supreme Court in 2018. Trump has said the initial ban was aimed at protecting the country.",
      "publishedAt": "2025-06-04T23:52:57Z",
      "title": "Trump announces travel ban affecting a dozen countries set to go into effect Monday",
      "url": "https://apnews.com/article/trump-travel-ban-adeaec442cb0f00f4f8a34d208118445",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3a24eb/2147483647/strip/true/crop/4228x2378+0+220/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F56%2F93656c591b5f21b0b81df4d87365%2F868792d3b05b4a26be43dc920cccd18d"
    },
    {
      "author": null,
      "description": "A private lunar lander from Japan has apparently crashed into the moon. The Tokyo-based company ispace confirmed the mission as a failure Friday several hours after communication was lost with the lander. Flight controllers tried to gain contact, but were met with only silence. Communication ceased less than two minutes before the spacecraft’s scheduled landing on the moon with a mini rover. It was ispace’s second lunar strikeout. The encore came two years after ispace’s first lander slammed into the moon.",
      "publishedAt": "2025-06-05T04:30:08Z",
      "title": "Private moon lander failed while attempting a moon touchdown",
      "url": "https://apnews.com/article/japan-moon-landing-resilience-be77f0a34032ce5a4fc524fe96888bfa",
      "urlToImage": "https://dims.apnews.com/dims4/default/228733e/2147483647/strip/true/crop/2991x1682+0+4/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2Fff%2F1b8db6a2b16fbfef6f0446e0e223%2F46c41d55b8cc4afd99fba75f32f5d74b"
    },
    {
      "author": null,
      "description": "Tyrese Haliburton scored with 0.3 seconds left for Indiana’s first and only lead of the game and the Pacers, the last-minute comeback kings of these playoffs, did it again to beat the Oklahoma City Thunder 111-110 in Game 1 of the NBA Finals on Thursday night. The Pacers were down by 15 with 9:42 left, matching the biggest fourth-quarter comeback in a finals game since Dallas came from 15 down to beat Miami on June 2, 2011. The coach of those Mavericks: Rick Carlisle. The coach of these Pacers: Rick Carlisle.",
      "publishedAt": "2025-06-05T13:35:14Z",
      "title": "NBA Finals: Haliburton caps huge rally with winning jumper as Pacers stun Thunder 111-110 in Game 1",
      "url": "https://apnews.com/article/nba-finals-2025-thunder-pacers-8966a303b1059b4e11b3b178dcea0567",
      "urlToImage": "https://dims.apnews.com/dims4/default/895a11d/2147483647/strip/true/crop/5458x3070+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2Fb0%2F3c5002469f85e5036c227191b2f1%2F2bd18b3cbfb24aabb9d7d1debd7a638a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}