{
  "articles": [
    {
      "author": "Munir Ahmed",
      "description": "Pakistan’s army spokesman says India has fired missiles at three air bases inside the country, but most of the missiles have been intercepted. Lt. Gen. Ahmad Sharif said the assets of the Pakistan Air Force are safe. He made this announcement during his televised address, saying some of the Indian missiles have also hit India’s eastern Punjab.",
      "publishedAt": "2025-05-09T23:03:19Z",
      "title": "Pakistan's army spokesman says India has fired missiles at 3 Pakistani air bases",
      "url": "https://apnews.com/article/india-pakistan-missiles-air-bases-1de0ca13c13899f0bd3530b4808d45ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2a69bd/2147483647/strip/true/crop/7203x4052+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F5b%2Ff167ac4b2dd36820616fff87a055%2Ff2f652c417164790a65310dc0aed29c6"
    },
    {
      "author": "Paul Wiseman, Didi Tang, Jamey Keaten",
      "description": "The U.S. Treasury Secretary and America’s top trade negotiator will meet with high-ranking Chinese officials in Switzerland this weekend to de-escalate a dispute that threatens to cut off trade between the world’s two biggest economies and damage the global economy. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson will meet in Geneva with a Chinese delegation led by Vice Premier He Lifeng. Prospects for a major breakthrough appear dim. But there is hope that the two countries will scale back the massive taxes – tariffs – they’ve slapped on each other’s goods, a move that would relieve world financial markets and companies on both sides of the Pacific Ocean that depend on U.S.-China trade.",
      "publishedAt": "2025-05-10T04:15:16Z",
      "title": "US and Chinese officials meet in Geneva to discuss tariffs as the world looks for signs of hope",
      "url": "https://apnews.com/article/china-trump-trade-tariffs-bessent-economy-71a6e410a0e5771c70ac853563a8b75d",
      "urlToImage": "https://dims.apnews.com/dims4/default/18e45de/2147483647/strip/true/crop/7440x4185+0+388/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fd3%2F6d65f5826aba92fe309c8898314f%2F39f00ddbfa87492488a621511b32c1d3"
    },
    {
      "author": "Simina Mistreanu",
      "description": "Talks planned this weekend between U.S. and Chinese officials in Switzerland are a culmination of more than three months of dizzying rounds of retaliatory tariffs between the two countries that have crippled each other’s exporters and dragged on their economies. Washington and Beijing are entering talks with tariffs on each other’s goods at an all-time high. U.S. duties on Chinese imports stand at 145%, while China’s retaliatory tariffs on U.S. goods have reached 125%.",
      "publishedAt": "2025-05-10T04:24:02Z",
      "title": "How US-China tariffs reached sky-high levels in 3 months",
      "url": "https://apnews.com/article/china-us-tariffs-timeline-negotiations-switzerland-d9f1d0e10d328a5d32413016d9d909f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Janie Har",
      "description": "A California judge has ordered the Trump administration to halt much of its massive downsizing of the federal workforce. Judge Susan Illston in San Francisco said President Donald Trump and his administration failed to get approval from Congress to initiate the cuts. That is required by the Constitution. The order issued Friday comes in response to a lawsuit filed by a a coalition of labor unions, nonprofit groups, cities and counties. Department of Justice lawyers say Trump’s executive order and a DOGE memo calling for large-scale reductions merely provided guidance and general principles.",
      "publishedAt": "2025-05-10T02:03:14Z",
      "title": "Judge pauses much of Trump administration's massive downsizing of federal agencies",
      "url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
      "urlToImage": "https://dims.apnews.com/dims4/default/0142294/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F4c%2F4e5e5a52515a083a14de566519fd%2F0314be4a6a1342faae0428bd9287873d"
    },
    {
      "author": "Jake Offenhartz, Claudia Lauer",
      "description": "The mayor of Newark, New Jersey, has been released from custody after being arrested at a federal immigration detention center where he has been protesting its opening this week. A federal prosecutor says on the social platform X that Ras Baraka committed trespass Friday and ignored warnings to leave the Delaney Hall facility. Witnesses say Baraka tried to enter the center with three members of New Jersey’s congressional delegation who arrived unannounced to inspect it. They say he was arrested after returning to public property. Baraka has protested the construction and opening of the 1,000-bed detention center, including filing a lawsuit challenging its permits.",
      "publishedAt": "2025-05-10T04:33:14Z",
      "title": "Mayor of Newark, New Jersey, released after arrest at immigration detention center",
      "url": "https://apnews.com/article/immigration-ice-newark-mayor-arrested-2b044ff4355240511e579275b8961270",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f51ec0/2147483647/strip/true/crop/4000x2250+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2Fad%2F9b992a4a81f65ae192b4f7994a3e%2F78cebe2e2f8b447fa10f0adecb25babc"
    },
    {
      "author": "Mauricio Savarese, Steven Grattan",
      "description": "For years before becoming Pope Leo XIV — as a parish priest and then bishop in Peru — Robert Prevost built ties with interfaith environmental networks and Indigenous organizations to place forest protection and rights at the center of Church concern. All of this is bringing hope that the new pope will make protecting the Amazon and curbing climate change central tenants of his papacy. The Amazon is a key regulator of the climate, as its dense forests absorb carbon dioxide, a greenhouse gas that when released into the atmosphere heats the planet. Chicago-born Prevost, who spent about two decades in Peru’s countryside, was chosen pontiff on Thursday.",
      "publishedAt": "2025-05-10T04:06:04Z",
      "title": "'Leo will follow Francis.' Amazon Catholics hope the new pope will protect the rain forest",
      "url": "https://apnews.com/article/brazil-amazon-catholics-new-pope-3d97c4977a56fd09bb0d1a55f7c06224",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec84ea3/2147483647/strip/true/crop/4080x2295+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2Fcd%2F4dcf14eb3d365386af34c5b3a78b%2F09d0334e64a44141b91a5785a47ec3eb"
    },
    {
      "author": "Jack Brook, Deepa Bharath",
      "description": "The election of Pope Leo XIV, who is the first U.S. pope and has Creole roots, is raising more awareness about the complexity of the Creole identity. The pope has not openly spoken about his racial identity, but historical records highlight a story of migration common to African American families leaving the racism of the Jim Crow South. Black and Creole Catholics in the U.S. say that a pope who holds these multiple identities is just what the Catholic Church needs to unify the global church and elevate the profile of Black Catholics, whose history and contributions, they say, have been overlooked.",
      "publishedAt": "2025-05-10T04:03:37Z",
      "title": "Pope Leo XIV has Creole roots in New Orleans, historian says",
      "url": "https://apnews.com/article/pope-leo-creole-roots-new-orleans-black-b5794961d9582941413fe3154b30cc87",
      "urlToImage": "https://dims.apnews.com/dims4/default/008bfdc/2147483647/strip/true/crop/1418x798+0+74/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2Fc2%2F26ae7c6e26e434796e4436bc17c8%2Fe5c6e4c84c6c4b00bf08595dbe7e51d8"
    },
    {
      "author": "Kim Tong-hyung",
      "description": "South Korea’s embattled conservative party has taken the unprecedented step of nullifying its primary and replacing presidential candidate Kim Moon Soo with former Prime Minister Han Duck-soo just one week after Kim’s selection. The move deepens internal turmoil ahead of the June 3 presidential by-election. Saturday’s move by the People Power Party’s leadership underscores the desperation and disarray within the party following the ouster of former President Yoon Suk Yeol over his ill-fated attempt to impose martial law in December. PPP’s leadership has spent the past week pressuring Kim to step aside and back Han, whom they believe stands a stronger chance against liberal Democratic Party frontrunner Lee Jae-myung.",
      "publishedAt": "2025-05-10T03:28:30Z",
      "title": "South Korean conservative party moves to switch presidential candidates as election turmoil deepens",
      "url": "https://apnews.com/article/south-korea-election-conservative-party-candidates-cc3141d0582486c6199b62f25d37445a",
      "urlToImage": "https://dims.apnews.com/dims4/default/a43cf1b/2147483647/strip/true/crop/3365x1893+0+175/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F82%2F6dc6dcfe2a7a20a56cd873d48a5b%2F4524a2dca403416ebbaf42c0c5a96837"
    },
    {
      "author": "Hallie Golden",
      "description": "Google will pay $1.4 billion to Texas to settle claims the company collected data on users without permission. The state’s attorney general announced the settlement Friday. The agreement settles several claims Texas made against the search giant in 2022 related to geolocation, incognito searches and biometric data. The state argued Google was “unlawfully tracking and collecting users’ private data.” Google spokesperson José Castañeda said the agreement settles an array of “old claims,” some of which relate to product policies the company has already changed. Paxton said the $1.4 billion is the largest amount won by any state in a settlement with Google over this type of data-privacy violations.",
      "publishedAt": "2025-05-09T23:36:05Z",
      "title": "Google will pay Texas $1.4B to settle claims the company collected users' data without permission",
      "url": "https://apnews.com/article/texas-google-settlement-8097e181cc7cb8522781db8a9a897eea",
      "urlToImage": "https://dims.apnews.com/dims4/default/f06590d/2147483647/strip/true/crop/4813x2707+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2F5c%2F0c67c12ba503b99ba37c360dfc02%2F2b87ee5b4df540a7ab9031b31d92e5d9"
    },
    {
      "author": "Anne D'Innocenzio, Didi Tang",
      "description": "Toy dolls have become the latest rhetorical poster child for President Donald Trump's tariffs crusade. Trump asserted that children will be fine having two or three dolls instead of 30 if U.S. import taxes increase consumer prices. The response on social media included memes of him portrayed as the Grinch. The president’s comments also touched a nerve with parents who acknowledged their own kids have more toys than they need. Either way, the U.S. toy industry has a lot riding on a possible deescalation of the administration's trade standoff with China, which produces most of America's playthings. Some smaller importers say they won't have enough holiday inventory without a reprieve in the next two weeks.",
      "publishedAt": "2025-05-09T17:21:25Z",
      "title": "Two dolls instead of 30? Toys become the latest symbol of Trump's trade war",
      "url": "https://apnews.com/article/trump-two-dolls-tariffs-toys-7b0e5d3a9035471317e6dc4ee1fbfbc1",
      "urlToImage": "https://dims.apnews.com/dims4/default/b342540/2147483647/strip/true/crop/4458x2508+0+199/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2Ff7%2F2f25d1e85a93a49caa40f0ae7fba%2F3d06d0fb30a6424eabc037ad7ed7acec"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}