{
  "articles": [
    {
      "author": "MELANIE LIDMAN and BASSEM MROUE",
      "description": "JERUSALEM (AP) — The Israeli military said it struck 300 targets Monday in Lebanon in one of the most intense barrages of airstrikes in nearly a year of fighting against the Hezbollah militant group.",
      "publishedAt": "2024-09-23T06:21:29Z",
      "title": "Lebanon says Israeli strikes kill 100 people. That would make it the deadliest day since October",
      "url": "https://apnews.com/e3ca9c83642056f962fdf76319e3b8de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22c3bb53a1a54ec6b27ca2d40036d35c/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — For almost a week, ophthalmologist Elias Jaradeh has worked around the clock, trying to keep up with the flood of patients whose eyes were injured when pagers and walkie-talkies exploded en masse across Lebanon.",
      "publishedAt": "2024-09-23T04:05:59Z",
      "title": "Lebanese doctor races to save the eyes of those hurt by exploding tech devices",
      "url": "https://apnews.com/1ef861481aa43c86bfede3781734a85a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3d4d269d0e348d090f435c1888ac4aa/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — One presidential candidate is talking up gun ownership and promising tough border security measures. The other vows to cap credit card interest rates and force insurance companies to cover in vitro fertilization.",
      "publishedAt": "2024-09-23T04:02:43Z",
      "title": "Harris owns a gun? Trump wants to cap credit card rates? Party lines blur in campaign's last stretch",
      "url": "https://apnews.com/87cd75cfa0d82b0e2b026c69278ff912",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d2689cc5bcb4e8190825ed12a405575/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congressional leaders announced an agreement Sunday on a short-term spending bill that will fund federal agencies for about three months, averting a possible partial government shutdown when the new budget year begins Oct.",
      "publishedAt": "2024-09-22T21:12:35Z",
      "title": "Spending deal averts a possible federal shutdown and funds the government into December",
      "url": "https://apnews.com/d51de0cd895db687a6f5b35fc0dab13e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae6c212d82304e67bace5f33d2b0de9e/2479.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM and TARA COPP",
      "description": "SCRANTON, Pa. (AP) — Under tight security, Ukrainian President Volodymyr Zelenskyy on Sunday visited a Pennsylvania ammunition factory to thank the workers who are producing one of the most critically needed munitions for his country's fight to fend off Russian ground forces.",
      "publishedAt": "2024-09-22T20:24:26Z",
      "title": "Ukraine's Zelenskyy visits Pennsylvania ammunition plant to thank workers and ask for more",
      "url": "https://apnews.com/c0e1fe5ebfa11ecfe92e842860e6440c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6032480d1494a86bd1716502933b6f2/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.N. General Assembly adopted a “Pact for the Future” to meet the challenges of the 21st century. Now comes the hard part: uniting the world’s divided nations to move quickly to implement its 56 actions.",
      "publishedAt": "2024-09-23T04:02:32Z",
      "title": "At the UN, world leaders try to lay out a vision for the future — and actually make it happen",
      "url": "https://apnews.com/351c195ef839d505d875e6ab862d58b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f65fc97782254b4199900ddc80650fc9/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "The co-founder of the company that owned the experimental submersible that imploded en route to the wreckage of the Titanic is scheduled to testify before the U.S.",
      "publishedAt": "2024-09-23T04:03:14Z",
      "title": "Co-founder of Titan to testify before Coast Guard about submersible that imploded",
      "url": "https://apnews.com/e8b5ef4b797b86b43e8b65e721216b26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42d8b25bfe4842bb8ce6bcdb1e23ffd3/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "BIRMINGHAM, Ala. (AP) — Authorities have reported no arrests after a weekend mass shooting killed four people and left 17 others injured in what police described as a targeted “hit” by multiple shooters who opened fire outside a popular Alabama nightspot.",
      "publishedAt": "2024-09-23T04:03:59Z",
      "title": "Search underway for suspects in Alabama mass shooting that killed 4 and injured 17",
      "url": "https://apnews.com/ca21a844e8363ddc8b38c89964194953",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09d2068f414c49bea79a56a88c8f815f/2664.jpeg"
    },
    {
      "author": "BHARATHA MALLAWARACHI",
      "description": "COLOMBO, Sri Lanka (AP) — Marxist politician Anura Dissanayake won Sri Lanka’s presidential election over the weekend, dealing a blow to a political old guard that has been widely blamed for the unprecedented economic crisis that hit the South Asian island nation two years ago.",
      "publishedAt": "2024-09-23T11:23:57Z",
      "title": "Who is Anura Kumara Dissanayake, Sri Lanka's new Marxist president?",
      "url": "https://apnews.com/b451271b4bd9bf4318a76b599fe9d0b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/325a313cb517477aa327f15f89b03762/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — At only 6 years old, Esai Reed has endured three emergency evacuations from orphanages across Haiti as gangs pillage and plunder their way through once peaceful communities.",
      "publishedAt": "2024-09-23T05:04:12Z",
      "title": "Families from Tennessee to California seek humanitarian parole for adopted children in Haiti",
      "url": "https://apnews.com/ddfac1a89699b90c6027ea9cc8275236",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1103104e79c84a0b8892e8eb8502e879/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}