{
  "articles": [
    {
      "author": null,
      "description": "MOSCOW (AP) — Russia has put Estonian Prime Minister Kaja Kallas on a wanted list, an official register showed Tuesday, as tensions soar between Russia and the West over Ukraine.Kallas’ name appeared on the Interior Ministry’s register of people wanted in connection with criminal charges.",
      "publishedAt": "2024-02-13T09:52:11Z",
      "title": "Russia puts Estonian Prime Minister Kaja Kallas on a wanted list but doesn't specify the charges",
      "url": "https://apnews.com/4ca301df09eace6643be66a9a4a93fe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2caf9d20d48142978290ee4aa5cdb962/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Bodies of 133 people killed in Israeli strikes have been brought to hospitals in the Gaza Strip over the past day, health officials there said as the Palestinian death toll from an Israeli hostage rescue operation in Rafah rose to 74 on Tuesday.",
      "publishedAt": "2024-02-13T09:23:37Z",
      "title": "Live updates | Bodies of 133 people killed in Israeli strikes brought to Gaza hospitals",
      "url": "https://apnews.com/db72263b0c7c2bd9f61a9d0030981a8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1b6581d8f49440db27f33bc035cbf05/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson late Monday sharply criticized a $95.3 billion aid package for Ukraine, Israel and other countries, casting serious doubts about the future of the package just as Senate leaders were slowly muscling it toward a final vote.",
      "publishedAt": "2024-02-13T02:00:33Z",
      "title": "House speaker casts doubts on Ukraine and Israel aid package as senators grind toward final vote",
      "url": "https://apnews.com/6970b539025d2de5ade9e3aff165c54f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71585f5fbc934f8085fbb60ccd2e3577/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Former President Donald Trump is asking the Supreme Court to extend the delay in his election interference trial, saying he is immune from prosecution on charges he plotted to overturn his 2020 election loss.",
      "publishedAt": "2024-02-12T13:21:06Z",
      "title": "Trump asks Supreme Court to put off his election interference trial, claiming immunity",
      "url": "https://apnews.com/60bd61263299a88e48d4005d70b6094f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d072711d824b08b562f6bfcbc4c7fb/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Pakistan’s parliamentary elections left no clear winner.Allies of imprisoned ex-Prime Minister Imran Khan won the most seats in the lower house of parliament in the elections last Thursday.",
      "publishedAt": "2024-02-12T12:59:59Z",
      "title": "Pakistan's election left no clear winner. So who is likely to govern and what happens next?",
      "url": "https://apnews.com/089949a2f225c272aba2ba3000d7df5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/198a7dfc470f439fa76301fce6a2d0f5/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Having failed to impeach Homeland Security Secretary Alejandro Mayorkas the first time, House Republicans are determined to try again Tuesday, but it's not at all certain the do-over vote will produce a better tally after last week's politically embarrassing setback.",
      "publishedAt": "2024-02-13T05:02:38Z",
      "title": "House GOP will try again to impeach Mayorkas after failing once. But outcome is still uncertain",
      "url": "https://apnews.com/80cbd5bbb8f512c6814f155f825a1214",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/426f2c57b8e84b7aa7e5f092013f2892/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Inflation may have fallen below a 3% annual rate last month, which would be the lowest level in nearly three years and a potentially significant milestone as the Biden administration seeks to bolster Americans' views of the economy before the November elections.",
      "publishedAt": "2024-02-13T05:01:47Z",
      "title": "Inflation might have dropped below 3% last month for 1st time in 3 years, a milestone for Biden",
      "url": "https://apnews.com/539b662f32a3cea4a514407ae4389174",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/628d58c7a68d45368e35c1dae5af477e/2578.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "HARTFORD, Conn. (AP) — Parts of the Northeast were preparing Monday for a coastal storm that was expected to pack high winds and dump a foot or more of snow in some areas, leading to school closures, warnings against road travel and the possible disruption of flights.",
      "publishedAt": "2024-02-12T19:44:07Z",
      "title": "Difficult driving, closed schools, canceled flights: What to expect from Northeast snowstorm",
      "url": "https://apnews.com/9a6c20e113d79059785e4d3d3b7ba344",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13580f7a88094ceab04205c8b8606590/3000.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "The longest Super Bowl game will also go down as the most-watched program in television history.According to Nielsen and Adobe Analytics, Kansas City's 25-22 overtime victory over San Francisco on Sunday night averaged 123.4 million viewers across television and streaming platforms.",
      "publishedAt": "2024-02-13T03:41:28Z",
      "title": "Super Bowl thriller was the most-watched program ever, averaging 123.4 million viewers",
      "url": "https://apnews.com/e2f0288ea474bd564ee4df430e41b8bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/532b6be2b8814629a9cd160ec0813c4c/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A typical Carnival day in Brazil starts around 7 a.m., when the first blocos — as the free street parties are known — start their loud and colorful musical journey down the city’s streets.",
      "publishedAt": "2024-02-13T05:28:22Z",
      "title": "AP PHOTOS: A Carnival day in Brazil, from a morning street party to an evening samba parade",
      "url": "https://apnews.com/a41c0c6579632578e8270a00d1508977",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb8586d3f89a443692f401824c880577/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}