{
  "articles": [
    {
      "author": "EMMA BURROWS",
      "description": "Alexei Navalny’s spokesperson confirmed Saturday that the Russian opposition leader had died at a remote Arctic penal colony, saying he was “murdered,\" but it was unclear where his body was as his family and friends searched for answers.",
      "publishedAt": "2024-02-17T07:48:17Z",
      "title": "Kremlin foe Alexei Navalny's team confirms his death and says his mother is searching for his body",
      "url": "https://apnews.com/37da0915157576372d6493be7ad04b5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1323ef706de4158baf7baf7b0144462/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel has not presented specific evidence for its claim that Hamas is diverting U.N. aid, and its recent targeted killings of Gaza police commanders safeguarding truck convoys have made it “virtually impossible” to distribute the goods safely, a top U.S.",
      "publishedAt": "2024-02-17T11:36:29Z",
      "title": "US envoy says Israel has not presented evidence that Hamas diverted U.N. aid deliveries in Gaza",
      "url": "https://apnews.com/410725a8850f658950726772911f93e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ca792ab8920425bbe05c689107bed3e/3000.jpeg"
    },
    {
      "author": "BALINT SZLANKO",
      "description": "LONDON (AP) — As Israel-Hamas cease-fire talks flounder, Israel is vowing to press ahead with its offensive in the southern Gaza Strip despite warnings from the U.S. to work harder to protect civilians.",
      "publishedAt": "2024-02-17T13:03:28Z",
      "title": "What to know about the situation in the Middle East this week",
      "url": "https://apnews.com/b7c29d2d2ed5875d7bb790c2a8f3f27e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28e1c8a9206b40b1a7662a0fe0b6ed6c/3000.jpeg"
    },
    {
      "author": "MATT BROWN and JOCELYN NOVECK",
      "description": "Fulton County District Attorney Fani Willis is used to prosecuting high-profile, challenging cases. But as she parried questions about her own personal conduct from the witness stand against the legal teams for defendants her office has accused of election interference, many Black women recognized a dispiriting scene.",
      "publishedAt": "2024-02-17T05:14:29Z",
      "title": "Fani Willis' testimony evokes long-standing frustrations for Black women leaders",
      "url": "https://apnews.com/7ac852848693c0180cbbfc2af358bb52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e359af32b66e47c19c30b7a19f7caa61/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A New York judge ordered Donald Trump on Friday to pay $355 million in penalties, finding that the former president lied about his wealth for years in a sweeping civil fraud verdict that pierces his billionaire image but stops short of putting his real estate empire out of business.",
      "publishedAt": "2024-02-16T05:19:12Z",
      "title": "Judge orders Trump to pay $355 million for lying about his wealth in staggering civil fraud ruling",
      "url": "https://apnews.com/244024861f0df886543c157c9fc5b3e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c317a5a94f5e4a4ca46ca1b3c9a9c307/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Ukraine’s military chief said early Saturday that he’s withdrawing troops from the city of Avdiivka in eastern Ukraine, where outnumbered defenders have battled a Russian assault for four months.",
      "publishedAt": "2024-02-16T11:21:37Z",
      "title": "Ukraine is withdrawing from Avdiivka, where outnumbered defenders held out for 4 months",
      "url": "https://apnews.com/c31eb7439d1983532a3f940061efe6e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b59d65701f8441da9efb78233ebd332/3000.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "BETHLEHEM, Pa. (AP) — Just blocks from the shuttered Bethlehem Steel plant, the Hispanic Center Lehigh Valley was bustling on a recent day with scores of older people eating lunch. Downstairs, out of sight, a constant stream of visitors was shopping in its massive food pantry.",
      "publishedAt": "2024-02-17T14:02:54Z",
      "title": "Saving democracy is central to Biden's campaign messaging. Will it resonate with swing state voters?",
      "url": "https://apnews.com/176e42a3877eaf33160c71d1b73c96cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ed4a26bec214cac95820de0a37bb5f2/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — It's not just you. A lot people think Google searches are getting worse. And the rise of generative AI chatbots is giving people new and different ways to look up information.",
      "publishedAt": "2024-02-17T13:37:25Z",
      "title": "One Tech Tip: Ready to go beyond Google? Here's how to use new generative AI search sites",
      "url": "https://apnews.com/522a9e432246700082baeb6b7a128ded",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bb8a05ce21e4fcc891939932cba3394/3000.jpeg"
    },
    {
      "author": "DAVID GINSBURG",
      "description": "COLLEGE PARK, Md. (AP) — Lefty Driesell, the Hall of Fame coach whose folksy drawl belied a fiery on-court demeanor that put Maryland on the college basketball map and enabled him to rebuild several struggling programs, died Saturday.",
      "publishedAt": "2024-02-17T15:11:30Z",
      "title": "Lefty Driesell, folksy, fiery coach who put Maryland on college basketball’s map, dies at 92",
      "url": "https://apnews.com/56a8f9c7a0b811ed8d6d3c219cee77e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84a6cc68b2634ae98a4d4f729e76065f/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "The U.S. Constitution doesn’t mention Christianity or any specific religion. The Declaration of Independence famously proclaims that people’s rights come from a “Creator” and “Nature’s God” — but doesn’t specify who that is.",
      "publishedAt": "2024-02-17T13:00:31Z",
      "title": "Christian-nation idea fuels US conservative causes, but historians say it misreads founders' intent",
      "url": "https://apnews.com/4ea388e8d80c54016a6a4460cbef9b82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d731f369bd98450b877fd4ad10e6adf0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}