{
  "articles": [
    {
      "author": "ILLIA NOVIKOV and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — The Kremlin warned Monday that President Joe Biden’s decision to let Ukraine strike targets inside Russia with U.S.-supplied longer-range missiles adds “fuel to the fire” of the war and would escalate international tensions even higher.",
      "publishedAt": "2024-11-18T09:39:19Z",
      "title": "Moscow warns the US over allowing Ukraine to hit Russian soil with longer-range weapons",
      "url": "https://apnews.com/5cd4f9fe2cee1ae8aed67d63c22b0703",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32b662bb045a4b6694c6ae7ba1f26bc0/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — The U.S. will allow Ukraine to use American-supplied longer-range weapons to conduct strikes deeper inside Russian territory, a long-sought request by Kyiv.",
      "publishedAt": "2024-11-18T14:29:51Z",
      "title": "What does Biden's decision to allow Ukraine to use longer-range US weapons mean?",
      "url": "https://apnews.com/8d8621321af8c673bd42a5693c2ad1f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32b662bb045a4b6694c6ae7ba1f26bc0/1920.jpeg"
    },
    {
      "author": "SALLY ABOU ALJOUD",
      "description": "BEIRUT (AP) — An Israeli airstrike slammed into a densely populated residential area in Lebanon’s capital near key government and diplomatic buildings late Monday, killing at least five people as the U.S.",
      "publishedAt": "2024-11-18T17:11:23Z",
      "title": "Israeli airstrike hits central Beirut near key government buildings and embassies",
      "url": "https://apnews.com/e97ba8991d02530306d10b1962b1c6e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47453c28a5e641a2b9d8ac47a36a2787/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli airstrikes targeted a neighborhood in the heart of Lebanon's capital late Monday evening, slamming into an area near the Parliament, several embassies and the U.N. headquarters, according to Lebanon’s state-run National News Agency.",
      "publishedAt": "2024-11-18T09:03:23Z",
      "title": "Middle East latest: Israel strikes in the heart of Lebanon's capital near parliament and embassies",
      "url": "https://apnews.com/f8b998f646051a1ef19303b51225a7ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25d2b6804f54410c8fbf1f4a264949d4/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS and DAVID KOENIG",
      "description": "NEW YORK (AP) — Spirit Airlines, the largest budget carrier in the U.S., filed for Chapter 11 bankruptcy protection Monday.",
      "publishedAt": "2024-11-18T21:11:21Z",
      "title": "Spirit Airlines filed for bankruptcy. What does that mean for travelers?",
      "url": "https://apnews.com/dfdeda1daaf35da84900ad9a6ca96976",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a30a8254005b4a96ba496c9ba878e556/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — President Joe Biden is requesting nearly $100 billion in emergency disaster aid after Hurricanes Helene and Milton, and other natural disasters, telling lawmakers that the money is “urgently needed.”",
      "publishedAt": "2024-11-18T19:20:29Z",
      "title": "Biden seeks nearly $100 billion in emergency disaster aid after Hurricanes Helene and Milton",
      "url": "https://apnews.com/10dab08476e9a798219878baeeb76e31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b18b3e779464d04b30beae5a4db16ed/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES, MAURICIO SAVARESE and DAVID BILLER",
      "description": "RIO DE JANEIRO (AP) — Brazil pushed for concerted action to alleviate hunger Monday as it hosted a summit of the Group of 20 leading economies amid global uncertainty over two major wars and incoming U.S.",
      "publishedAt": "2024-11-18T05:05:14Z",
      "title": "Host Brazil focuses G20 summit on fighting hunger amid wars and Trump's return",
      "url": "https://apnews.com/12f7a09b8f79229509de52c92c0a074c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17b14431f3a1494ab34539d0fe671f0b/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — New York City on Monday issued its first drought warning in 22 years after months of little rain -- and will restart the flow of drinking water from an out-of-service aqueduct as supplies run low.",
      "publishedAt": "2024-11-18T21:12:15Z",
      "title": "NYC issues first drought warning in 22 years, pauses aqueduct repairs to bring in more water",
      "url": "https://apnews.com/6f61ab90093bf8917b637a63a1687996",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/359ee30f150943ae8b8f7712b156b887/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — With Thanksgiving less than two weeks away, Walmart, Target, Aldi and other grocers are competing for a place on holiday tables with turkey dinner deals and other promotions to tempt Americans who haven't recovered from recent food price inflation.",
      "publishedAt": "2024-11-18T17:29:16Z",
      "title": "Grocery chains vie for a place on Thanksgiving tables with turkey dinner deals and store brands",
      "url": "https://apnews.com/f1850209ebeac7d768efc4717efc57e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f04e4674719a4530a3d240aefd73efc8/1920.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "Jimmy O. Yang once played “Chinese Teenager #1.” He's now No. 1 on the call sheet in “Interior Chinatown” — despite playing downtrodden background actor Willis Wu in the new Hulu series.",
      "publishedAt": "2024-11-18T18:12:22Z",
      "title": "'Interior Chinatown': Its cast has faced Hollywood struggles uncannily like its characters",
      "url": "https://apnews.com/945dc249a00d138544acf98d210da5e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bec11c17747d47909e98817482a616f5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}