{
  "articles": [
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The gunman in the attempted assassination of former President Donald Trump is believed to have done a Google search one week before the shooting of “How far away was Oswald from Kennedy?” FBI Director Christopher Wray said Wednesday, revealing new details about a suspect he said had taken a keen interest in public figures but had otherwise not left behind clear clues of an ideological motive.",
      "publishedAt": "2024-07-24T04:18:11Z",
      "title": "Trump rally gunman looked online for information about Kennedy assassination, FBI director says",
      "url": "https://apnews.com/f1ff0a636f3e2e1a28762c400852167e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1b78107c6a84c25a84549c1ed95bbcd/3000.jpeg"
    },
    {
      "author": "ASHRAF KHALIL and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Thousands of protesters condemning Israel's war in Gaza descended on Washington on Wednesday, chanting “Free, Free Palestine” as some tried to block streets ahead of Israeli Prime Minister Benjamin Netanyahu's speech to Congress.",
      "publishedAt": "2024-07-24T04:08:10Z",
      "title": "Thousands descend on Washington to protest war in Gaza ahead of Netanyahu's speech to Congress",
      "url": "https://apnews.com/9a7885972989b2397b49e5b971ffe0e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58aba8d56d8b45658d70f60180150d09/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER, FARNOUSH AMIRI and ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — Israeli Prime Minister Benjamin Netanyahu seeks to bolster U.S. support for his country's fight against Hamas and other Iran-backed armed groups in a speech to Congress Wednesday that sparked boycotts by some top Democrats and drew thousands of protesters to the Capitol to condemn the war in Gaza and the humanitarian crisis it has created.",
      "publishedAt": "2024-07-24T04:04:45Z",
      "title": "Netanyahu seeks support for Gaza war in address to Congress that sparks large protests and boycotts",
      "url": "https://apnews.com/6ea5daf3cd1988b0ad6e874bd450f9bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c42e1c52ad14dcf8ada4844bef02508/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "INDIANAPOLIS (AP) — Vice President Kamala Harris told members of the historically Black sorority Zeta Phi Beta on Wednesday that “we are not playing around” and asked for their help in electing her president in November.",
      "publishedAt": "2024-07-24T09:04:43Z",
      "title": "Harris asks for 2024 support from women of color during an address at a historically Black sorority",
      "url": "https://apnews.com/031e3afa51f9ed42e0acd979e80019a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52d9bac6b4394bdca38b3b503295f4a8/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and JILL COLVIN",
      "description": "WASHINGTON (AP) — Republican leaders are warning party members against using overtly racist and sexist attacks against Vice President Kamala Harris, as they and former President Donald Trump's campaign scramble to adjust to the reality of a new Democratic rival less than four months before Election Day.",
      "publishedAt": "2024-07-24T01:02:20Z",
      "title": "Republican leaders urge colleagues to steer clear of racist and sexist attacks on Harris",
      "url": "https://apnews.com/76f8e90d24004e49449087787ac031a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c58eb8e19fad4ca491410afacb39125e/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Even though President Joe Biden won't be on the ballot i n November, voters still will be weighing his legacy.",
      "publishedAt": "2024-07-24T04:15:21Z",
      "title": "Biden will make a case for his legacy - and for Harris to continue it - in his Oval Office address",
      "url": "https://apnews.com/0f92ccfe6f948770b760e983869fa989",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7728446f9a1f4b3c9faebb14ae6f425e/3000.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON",
      "description": "BUFFALO, N.Y. (AP) — A man who severely injured author Salman Rushdie in a frenzied knife attack in western New York faces new terrorism charges.",
      "publishedAt": "2024-07-24T15:03:23Z",
      "title": "Man who attacked author Salman Rushdie charged with supporting terrorist group",
      "url": "https://apnews.com/dc21d10a1da6fde94ce6b4642b0d4cf1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63d8fde8296048d2a516ea0b4118375a/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN, AMY BETH HANSON and MEAD GRUVER",
      "description": "BILLINGS, Mont. (AP) — A surprise eruption of steam in a Yellowstone National Park geyser basin that sent people scrambling for safety as large rocks shot into the air has highlighted a little-known hazard that scientists hope to be able to predict someday.",
      "publishedAt": "2024-07-24T17:15:17Z",
      "title": "Surprise Yellowstone geyser eruption highlights little known hazard at popular park",
      "url": "https://apnews.com/17e575de4b9a22823d50f08086478a5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a1f2176d7ca4c13a33faf8578225b7f/1200.jpeg"
    },
    {
      "author": null,
      "description": "SAINT-ETIENNE, France (AP) — Morocco fans crashed the pitch to protest a late goal by Argentina at the opening match of the Paris Olympics men’s soccer tournament, an angry and bizarre scene that left the game suspended for nearly two hours with only minutes remaining.",
      "publishedAt": "2024-07-24T16:41:47Z",
      "title": "Morocco fans rush field during Olympic soccer opener vs Argentina. Game suspended, goal disallowed",
      "url": "https://apnews.com/ed408ab5f6fa529ba63ad59aee082d75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bf0f402bcbc49bfafdde7ab309ef2ca/3000.jpeg"
    },
    {
      "author": "JEROME PUGMIRE",
      "description": "PARIS (AP) — Uzbekistan lost the match but won over the crowd on Wednesday as competition at the Paris Olympics officially began with soccer matches in Paris and Saint-Etienne.",
      "publishedAt": "2024-07-24T13:04:10Z",
      "title": "Uzbekistan loses the match but wins over crowd as soccer competition kicks off Paris Olympics",
      "url": "https://apnews.com/f7994d66f4131cbe1c2137be246d15f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2175b9d84e41438d9868e7502b273170/2961.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}