{
  "articles": [
    {
      "author": "TIA GOLDENBERG and ISAAC SCHARF",
      "description": "JERUSALEM (AP) — Israeli lawmakers gathered in a stormy session Monday to vote on a key portion of Prime Minister Benjamin Netanyahu’s divisive plan to reshape the country’s justice system, despite massive protests that have exposed unprecedented fissures in Israeli society.",
      "publishedAt": "2023-07-24T06:27:39Z",
      "title": "Israeli lawmakers prepare to vote on divisive judicial overhaul after Netanyahu leaves the hospital",
      "url": "https://apnews.com/fb595629e7033ee34d246ee9a367c4d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9933caa4d8384e27994149b6ace93f05/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — The American-led U.N. Command said Monday it has started a conversation with North Korea about a U.S.",
      "publishedAt": "2023-07-24T02:59:09Z",
      "title": "UN Command says it's communicating with North Korea about detained US soldier",
      "url": "https://apnews.com/1b589852d02e436add2fa1574e21b0cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/810de12bf3404e808d5e916fc008206b/3000.jpeg"
    },
    {
      "author": "FELIPE DANA and DASHA LITVINOVA",
      "description": "KYIV, Ukraine (AP) — Russian authorities accused Ukraine of launching a drone attack on Moscow early Monday that saw one of the aircraft fall near the Defense Ministry’s main headquarters, while the Russian military unleashed new strikes on port infrastructure in southern Ukraine.",
      "publishedAt": "2023-07-24T07:44:15Z",
      "title": "Russia says Moscow and Crimea hit by Ukrainian drones while Russian forces bombard Ukraine's south",
      "url": "https://apnews.com/3aeae8508ec55b87c0a1c85e257fe5d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4b2f4668069483e8973bb0f5db174b0/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Stephanie Pullman died on a sweltering Arizona day after her electricity was cut off because of a $51 debt.Five years later, the 72-year-old's story remains at the heart of efforts to prevent others in Arizona from having their power cut off, leaving them without life-saving air conditioning in temperatures that have topped 110 degrees Fahrenheit (43 degrees Celsius) on every day this month.",
      "publishedAt": "2023-07-24T11:03:52Z",
      "title": "Arizona woman's heat death after her power was cut off spurred changes, but advocates want more",
      "url": "https://apnews.com/3fce53af423293d9fb15d7889dee9e13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80775b39c29b45238b1d465aa0249424/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Set aside the polls, the fundraising numbers or Donald Trump’s name recognition as metrics of his early dominance of the Republican presidential contest.",
      "publishedAt": "2023-07-24T04:07:04Z",
      "title": "How Trump is gaining an advantage in the nitty-gritty battle for delegates",
      "url": "https://apnews.com/e573d5d9840572b05906268d49f9a3cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1711de3945b47fa8063b0364bc93ba2/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — When Chair Jerome Powell and other Federal Reserve officials gather this week for their latest decision on interest rates, they will do so on the cusp of achieving an elusive “soft landing” — the feat of curbing inflation without causing a deep recession.",
      "publishedAt": "2023-07-24T10:01:19Z",
      "title": "Key question as Federal Reserve meets: Can the central bank pull off a difficult 'soft landing'?",
      "url": "https://apnews.com/c08901d250144a322f4c423517112e5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85f39e65d2294a1e978e09f81788d26a/3000.jpeg"
    },
    {
      "author": "CIARÁN GILES",
      "description": "MADRID (AP) — Spaniards woke up Monday to find their country in political disarray after a general election a day earlier left no party with a clear path to forming a government.",
      "publishedAt": "2023-07-24T11:07:10Z",
      "title": "Election leaves Spain in political disarray with no party having an easy path to form a government",
      "url": "https://apnews.com/0424325a834f390b5a884482c478107c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d986e2859f244924a6c1914b8fdfe7b9/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — The Jesuits said Monday that a famous artist priest is definitively expelled from the religious order for sexually, spiritually and psychologically abusing women, and lamented they couldn't prosecute him more vigorously under the Vatican's internal procedures.",
      "publishedAt": "2023-07-24T04:45:54Z",
      "title": "Jesuits confirm expulsion of a priest artist and lament that Vatican norms block harsher sanctions",
      "url": "https://apnews.com/42138bff2b2545a8d206c4b5b12ceef0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6640bbd6fb34499aa147882f81443fd9/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — Elon Musk has unveiled a new black and white “X” logo to replace Twitter's famous blue bird as he follows through with a major rebranding of the social media platform he bought for $44 billion last year.",
      "publishedAt": "2023-07-24T09:56:27Z",
      "title": "Elon Musk reveals new black and white X logo to replace Twitter's blue bird",
      "url": "https://apnews.com/0689e9a5c3a217afc2fbefeaf0e6d8a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46f2d45bf3f74548bf648871991fa867/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "NEW YORK (AP) — The clock is ticking. As the deadline to reach a new contract nears, a potential UPS strike feels closer than ever.",
      "publishedAt": "2023-07-21T19:25:48Z",
      "title": "A UPS strike could be just around the corner. Here's what you need to know",
      "url": "https://apnews.com/7be8c3d04e043d6b653f563075a6a39f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8fa080ce8a542b5b9d61434f85860aa/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}