{
  "articles": [
    {
      "author": "Zeke Miller, Jon Gambrell, Aamer Madhani",
      "description": "President Donald Trump is set to meet with Syrian President Ahmad al-Sharaa, in a face-to-face with the onetime insurgent leader who spent years imprisoned by U.S. forces after being captured in Iraq. The White House says Trump has agreed to “say hello” Wednesday to al-Sharaa before the U.S. leader wraps up his visit to Saudi Arabia and moves on to Qatar. Trump is also scheduled to attend a meeting of the Gulf Cooperation Council, the grouping of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, and the United Arab Emirates. He then sets off Wednesday for Qatar, the second stop in his Mideast tour. Trump will be honored with a state dinner in Qatar.",
      "publishedAt": "2025-05-14T04:01:32Z",
      "title": "Trump to meet Syria's president before heading to Qatar on his Mideast tour",
      "url": "https://apnews.com/article/trump-middle-east-syria-qatar-saudi-arabia-8bd63b3f9fc1856532a00adf1795e38f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dec3055/2147483647/strip/true/crop/2864x1611+0+149/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F39%2Fd7cbf10f9a7ec7b06e6342a87fec%2Ff8967972e51647fd82d8aa094b8e694a"
    },
    {
      "author": null,
      "description": "At least 22 children were killed in Gaza overnight Tuesday and early Wednesday in a punishing series of Israeli airstrikes on homes in northern Gaza. The strikes killed at least 48 people in total, the Indonesian Hospital in Jabaliya reported. The strikes came a day after Hamas released an Israeli-American hostage in a deal brokered by the United States, and as President Donald Trump was visiting Saudi Arabia. On Tuesday, Israeli Prime Minister Benjamin Netanyahu said there was “no way” Israel would halt its war in Gaza, dimming hopes for a ceasefire.",
      "publishedAt": "2025-05-14T07:18:11Z",
      "title": "Israeli airstrikes in Gaza kill 48 people, including 22 children, hospitals say",
      "url": "https://apnews.com/article/mideast-wars-israel-hamas-gaza-05-14-2025-bc5c95bdcf4106da61dda4fff762e5fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/538c79c/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Ff3%2F08b24d635facd2fc7d35ae745505%2Ffe43995e54974c46b5b805b8baa0a8e5"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "The R&B singer Cassie is set to continue testifying Wednesday against her ex-boyfriend Sean “Diddy” Combs in his sex trafficking trial, a day after taking the witness stand to detail what she says was years of grotesque sexual and physical abuse. Cassie spent about five hours on the witness stand Wednesday. Combs is accused of exploiting his status as a powerful music executive to coerce women including Cassie into drugged-up sex parties he called “freak offs.” He has pleaded not guilty. His lawyers say all sexual acts were consensual.",
      "publishedAt": "2025-05-14T04:02:55Z",
      "title": "Cassie due back for 2nd day of testimony in Sean 'Diddy' Combs' trial",
      "url": "https://apnews.com/article/diddy-sex-trafficking-freak-offs-cassie-b2bb8f6d7017b1ebc227c49b44f86d6a",
      "urlToImage": "https://dims.apnews.com/dims4/default/deb7c37/2147483647/strip/true/crop/3872x2178+0+11/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fc7%2Fa896760638f8637dd3703d090966%2Ffde0b54fcc7147ad88d825532de42341"
    },
    {
      "author": "Olivia Diaz",
      "description": "A federal judge has ordered that a Georgetown scholar from India be released from immigration detention after he was detained in the Trump administration’s crackdown on foreign college students. The judge issued the ruling Wednesday. Khan Suri was arrested by masked, plain-clothed officers on the evening of March 17 outside his apartment complex in Arlington, Virginia. Officials said his visa was revoked because of his social media posts and his wife’s connection to Gaza as a Palestinian American. They accused him of supporting Hamas, which the U.S. has designated as a terrorist organization.",
      "publishedAt": "2025-05-14T17:20:32Z",
      "title": "Judge says Georgetown student can be released from immigration detention as case proceeds",
      "url": "https://apnews.com/article/badar-khan-suri-georgetown-immigration-case-c598f7ff6a7bda7a948e793b14770a43",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ce8aeb/2147483647/strip/true/crop/5581x3139+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2Fd1%2Fe22baa1170879fd54b8a252ac0c5%2Fac8672434b814d0b8ab448c65ff39c32"
    },
    {
      "author": "Andrew Dalton",
      "description": "The trials of Lyle and Erik Menendez and their conviction for killing their parents came at a time when televised trials captured national audiences in the 1990s. The brothers' resentencing Tuesday for the 1989 murder of their parents, and the possibility that they'll go free, comes at time of similar cultural obsession, reflected by true-crime documentaries and docudramas. The initial trial was the first major case aired on Court TV, and came just before the O.J. Simpson trial made televised murder trials much bigger. The Menendez brothers had mostly faded from memory, but two Netflix shows brought renewed attention to their case.",
      "publishedAt": "2025-05-14T22:59:40Z",
      "title": "The Menendez brothers case reflects a shifting culture across decades",
      "url": "https://apnews.com/article/erik-lyle-menendez-brothers-resentenced-trials-tv-82412a2a10acf4fa02330445048cb9fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ad4749/2147483647/strip/true/crop/3000x1688+0+151/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2F0e%2F932b83581d89d0bea98f6a8433bb%2F37cdc4c4ea854830a386783a8939c33a"
    },
    {
      "author": "Michael Phillis",
      "description": "The Environmental Protection Agency says it will roll back limits on several types of what are known as forever chemicals in drinking water. The agency, however, will keep limits on the two most common types, called PFOA and PFOS, although it will offer a two-year deadline extension for utilities to comply. PFAS are a group of chemicals that have been around for decades and are incredibly useful in household products, but that resilience also makes them hazardous.",
      "publishedAt": "2025-05-14T21:28:38Z",
      "title": "What the EPA's partial rollback of the 'forever chemical' drinking water rule means",
      "url": "https://apnews.com/article/pfas-forever-chemicals-trump-zeldin-epa-water-a1c15348e9fc42bd22b10d0329b2f321",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c45be1/2147483647/strip/true/crop/5782x3252+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2F33%2F1e9424ec8a9568680e2e3f5aff46%2F176d635a329446a4a16eb5901f9cc12b"
    },
    {
      "author": "Amanda Seitz",
      "description": "Robert F. Kennedy Jr. is making his first appearance as health secretary before the powerful Senate health committee. Kennedy is expected to face intense scrutiny Wednesday about the thousands of jobs he’s eliminated at the Department of Health and Human Services, the steep cuts he’s made to vaccination campaigns and his response to a measles outbreak that’s sickened 1,000 people. Kennedy will speak about the agency’s budget request for the year, which includes a $500 million boost for his “Make America Healthy Again” initiative to promote nutrition and healthier lifestyles. The proposed budget also makes deep cuts, including to infectious disease prevention, maternal health and preschool programs.",
      "publishedAt": "2025-05-14T10:55:33Z",
      "title": "What to expect at RFK Jr.'s first Senate hearing as health secretary",
      "url": "https://apnews.com/article/rfk-jr-hhs-senate-vaccines-layoffs-measles-8c99853031507ecb5408b4132329cdea",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e6769b/2147483647/strip/true/crop/5788x3256+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F45%2F1e05de176b3be34ec8ef9143076a%2F5a6c80f910ad4aa5abf5fdbb9a396740"
    },
    {
      "author": "David A. Lieb",
      "description": "Missouri lawmakers have approved a referendum seeking to repeal an abortion-rights amendment passed by voters six months ago. The Republican-led Senate voted Wednesday to place a new amendment on the statewide ballot that would instead impose a ban on most abortions, with exceptions for rape and incest. The vote came after the GOP majority used a rare procedural move to cut off debate by Democrats who opposed the measure. The new referendum would go before voters in November 2026 unless Republican Gov. Mike Kehoe calls a special election sooner than that.",
      "publishedAt": "2025-05-14T22:44:48Z",
      "title": "Missouri lawmakers back repeal of abortion-rights amendment",
      "url": "https://apnews.com/article/abortion-rights-ban-missouri-sick-leave-c4f7beb07e7b3de64f3e2460bcb539c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Mike Stobbe, Geoff Mulvihill",
      "description": "There were 30,000 fewer U.S. drug overdose deaths in 2024 than the year before — the largest one-year decline ever recorded. An estimated 80,000 people died from an overdose 2024. That’s down 27% from the 110,000 in 2023. The Centers for Disease Control and Prevention data released the data Wednesday. The CDC has been collecting comparable data for 45 years. The previous largest one-year drop was 4% in 2018. Experts say several things could be driving the decline. They include increased availability of the overdose-reversing drug naloxone, expanded addiction treatment and shifts in how people use drugs.",
      "publishedAt": "2025-05-14T14:16:14Z",
      "title": "US overdose deaths fell 27% last year, the largest one-year decline ever seen",
      "url": "https://apnews.com/article/us-overdose-deaths-opioids-1561a9f189255ad60c533462f10490a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/c378dc7/2147483647/strip/true/crop/2420x1361+0+227/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2Fa4%2F3ea8d34da8b4cbfbd83442210478%2F03d1f53b1a9444258ec690c4c4d009d2"
    },
    {
      "author": null,
      "description": "This year’s Cannes Film Festival has barely started and already has been an attention-grabbing affair, from new rules for its red carpets, nerves about potential U.S. tariffs and the return of Tom Cruise. And that says nothing about the films, which are expected to be a strong slate at a time that Cannes is seen as increasingly important to Oscars best picture hopefuls. Cannes opened Tuesday with a starry tribute to Robert De Niro, 49 years after “Taxi Driver” won the festival’s top prize. Tom Cruise took the spotlight on Day 2 with the latest “Mission: Impossible” installment.",
      "publishedAt": "2025-05-14T17:08:46Z",
      "title": "What's happened at the Cannes Film Festival so far — and what's still to come",
      "url": "https://apnews.com/article/cannes-2025-what-to-know-eb7a019eba6e1fd2b323f65599aa880a",
      "urlToImage": "https://dims.apnews.com/dims4/default/769e4e1/2147483647/strip/true/crop/5480x3083+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fe4%2F8d5e5ef7038105db3a05ba4e8d31%2F4985615455344213aa489bfd8ddc1c19"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}