{
  "articles": [
    {
      "author": "ERIC TUCKER, KATE BRUMBACK and JILL COLVIN",
      "description": "ATLANTA (AP) — A scowling Donald Trump posed for a mug shot Thursday as he surrendered inside a jail in Atlanta on charges that he illegally schemed to overturn the 2020 election in Georgia, creating a historic and humbling visual underscoring the former president's escalating legal troubles.",
      "publishedAt": "2023-08-24T04:42:08Z",
      "title": "Mug shot of Donald Trump shows scowling former president during speedy booking at Atlanta jail",
      "url": "https://apnews.com/7f4e9860859fbb71221b6a5163aaa42f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7313904ffea485fa039b7fe083b4a44/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS and AAMER MADHANI",
      "description": "WASHINGTON (AP) — A preliminary U.S. intelligence assessment concluded that an intentional explosion caused the plane crash presumed to have killed a mercenary leader who was eulogized Thursday by Vladimir Putin, even as suspicions grew that the Russian president was the architect of the assassination.",
      "publishedAt": "2023-08-24T07:33:57Z",
      "title": "US intelligence says an intentional explosion brought down Wagner chief Prigozhin’s plane",
      "url": "https://apnews.com/382515214f691e47daa2e3635d64e612",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4e802c7f5dc4b7cb14df152b7732f5b/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Republican support for gun restrictions is slipping a year after Congress passed the most comprehensive firearms control legislation in decades with bipartisan support, according to a poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-08-25T04:31:13Z",
      "title": "GOP support for gun restrictions slips a year after Congress passed firearms law",
      "url": "https://apnews.com/83c7ece4a3ffb6ff033a07737303d772",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a04779b8bc394556b55669cf077c98c2/3000.jpeg"
    },
    {
      "author": "NATHAN ELLGREN and GARY FIELDS",
      "description": "WASHINGTON (AP) — Fencing and construction workers greet visitors to the Lincoln Memorial, signaling that — for the moment — the monument to the nation’s 16th president is a work in progress. And so is the nation Abraham Lincoln saved and the dream that Martin Luther King Jr.",
      "publishedAt": "2023-08-25T04:25:42Z",
      "title": "Visitors to Lincoln Memorial say America has its flaws but see gains made since March on Washington",
      "url": "https://apnews.com/3d293b2027b56094a906a6fac426d77f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/345269e4beae47c59a88b929b61e73dc/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and GENE JOHNSON",
      "description": "HONOLULU (AP) — Maui County sued Hawaiian Electric Company on Thursday over the fires that devastated Lahaina, saying the utility negligently failed to shut off power despite exceptionally high winds and dry conditions.",
      "publishedAt": "2023-08-24T20:57:28Z",
      "title": "Maui County sues utility, alleging negligence over fires that ravaged Lahaina",
      "url": "https://apnews.com/c3513c2f8e451df6dab2e59a6c2f670d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2f7ed7b141f448bb968681023849876/1920.jpeg"
    },
    {
      "author": "EUGENE GARCIA, AMY TAXIN and JOHN ANTCZAK",
      "description": "TRABUCO CANYON, Calif. (AP) — The retired police sergeant who opened fire during a lively Wednesday evening at a popular Southern California biker bar had traveled from Ohio to confront his estranged wife, shooting her in the face before turning his gun on the crowd, authorities said.",
      "publishedAt": "2023-08-24T03:57:17Z",
      "title": "Retired police sergeant who killed 3 at California bar shot his estranged wife first, officials say",
      "url": "https://apnews.com/be474bdb916250261808d34cc20f67b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d3661fd721443ee835779e6cff7e089/1920.jpeg"
    },
    {
      "author": "ASHOK SHARMA",
      "description": "NEW DELHI (AP) — India’s prime minister and China's leader agreed Thursday to intensify efforts to de-escalate tensions at the disputed border between them and bring home thousands of their troops deployed there, according to an official from India's foreign ministry.",
      "publishedAt": "2023-08-24T18:16:16Z",
      "title": "India's Modi and Chinese President Xi Jinping agree on efforts to de-escalate border tensions",
      "url": "https://apnews.com/8491c234c15ab3457f2fc60fcac6ab66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc93eb9ebc574f10b6eb97af9243a407/3000.jpeg"
    },
    {
      "author": "JAMES POLLARD",
      "description": "COLUMBIA, S.C. (AP) — When the South Carolina Supreme Court upheld a ban on most abortions this week, the majority wrote that they were leaving “for another day” a decision on when, exactly, the “fetal heartbeat” limit begins during pregnancy.",
      "publishedAt": "2023-08-25T04:22:39Z",
      "title": "South Carolina abortion ban with unclear 'fetal heartbeat' definition creates confusion, doctors say",
      "url": "https://apnews.com/a2f515537739a0a4b16c049f90821a3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afb52dac02474d89816a70feedf9a111/3000.jpeg"
    },
    {
      "author": "JIM MUSTIAN and JOSHUA GOODMAN",
      "description": "FAIRFAX, Va. (AP) — In a secluded stairwell at CIA headquarters last year, officer trainee Ashkan Bayatpour came up behind a colleague, wrapped a scarf around her neck and plainly spoke as he tried to kiss her on the mouth.",
      "publishedAt": "2023-08-24T15:16:12Z",
      "title": "CIA stairwell attack among flood of sexual misconduct complaints at spy agency",
      "url": "https://apnews.com/8ca2f3a4b41c9d6f3da34364aea42dad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e467478b70bf412a9fa79e0bba142d8b/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "JACKSON HOLE, Wyoming (AP) — When Federal Reserve Chair Jerome Powell delivers a high-profile speech Friday in Jackson Hole, Wyoming, many analysts think he could make one thing clear: That the Fed plans to keep its benchmark interest rate at a peak level for longer than had been expected.",
      "publishedAt": "2023-08-25T04:01:30Z",
      "title": "Fed Chair Powell could signal the likelihood of high rates for longer in closely watched speech",
      "url": "https://apnews.com/9a720711618c0cfd851b51b0786af4f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22f24c23f8f94cccb3e8b322761f0a8c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}