{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Gaza was plunged into another communications blackout Wednesday, with internet and phone service cut for several hours as Israeli troops battled Hamas militants.",
      "publishedAt": "2023-11-01T06:39:52Z",
      "title": "Gaza's communications cut again for hours, as dozens of foreigners and wounded prepare to exit",
      "url": "https://apnews.com/24a6ad56ff87a4154f250c708b5310dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b61b364f9ea64efd86412b14d142c990/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Dozens of people entered the Rafah crossing from Gaza to Egypt on Wednesday. It appeared to be the first time foreign passport holders have been allowed to leave the besieged territory since the start of the Israel-Hamas war more than three weeks ago.",
      "publishedAt": "2023-11-01T05:23:46Z",
      "title": "Live updates | Foreign passport holders enter Rafah crossing",
      "url": "https://apnews.com/7016eb9ebd6a7852c0ed71bc97f14d92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3727c4a43f564248b209aabaa5b92458/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "Over the past five days, Israeli ground troops have pushed deeper and deeper into Gaza in their war against Hamas, launched in response to a bloody Oct.",
      "publishedAt": "2023-10-31T19:16:40Z",
      "title": "Has Israel invaded Gaza? The military has been vague, even if its objectives are clear",
      "url": "https://apnews.com/6ba5bf06f81c315252a9e53735f3de47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de741def319b45e7aeb8af07ebd26547/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — When Donald Trump became president in 2017, he handed day-to-day management of his real estate empire to his eldest sons, Donald Jr. and Eric. Now, as the Trumps fight to keep the family business intact, the brothers are set to testify in the New York civil fraud case that threatens their Trump Organization’s future.",
      "publishedAt": "2023-11-01T04:05:27Z",
      "title": "Donald Trump’s sons Don Jr. and Eric set to testify at fraud trial that threatens family’s empire",
      "url": "https://apnews.com/3ceb1a1d9eefdc9fddec5d04ce813ea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ec7c665d7804212bec9164dea63f9c1/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, SEUNG MIN KIM and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden's administration is preparing to announce that it will develop a national strategy to combat Islamophobia, according to people briefed on the matter, as it faces skepticism from many in the Muslim American community for its staunch support of Israel's military assault on Hamas in Gaza.",
      "publishedAt": "2023-11-01T03:40:11Z",
      "title": "White House will develop an anti-Islamophobia strategy but faces skepticism from Muslim Americans",
      "url": "https://apnews.com/a0b26f1e11ef5a1b80c2b6a05c3a63bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00c7cc7ecea74ce3b96f8ffdafd10fe6/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN and JILL LAWLESS",
      "description": "BLETCHLEY PARK, England (AP) — Digital officials, tech company bosses and researchers are converging Wednesday at a former codebreaking spy base near London to discuss and better understand the extreme risks posed by cutting-edge artificial intelligence.",
      "publishedAt": "2023-11-01T07:55:02Z",
      "title": "UK summit aims to tackle thorny issues around cutting-edge AI risks",
      "url": "https://apnews.com/885d09550b0ad19f7a1cdfbd6e2b910b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16a86114e84842828c7af9bd0ebc705b/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Taiwan said Wednesday that China sent 43 military aircraft and seven ships near the self-ruled island, the latest sign that Beijing plans no let-up in its campaign of harassment, threats and intimidation.",
      "publishedAt": "2023-11-01T06:42:59Z",
      "title": "China keeps up military pressure on Taiwan, sending 43 planes and 7 ships near self-governing island",
      "url": "https://apnews.com/5dd5c16577e33b7cf464a7de00e54092",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a60d31094678469ebe6ea011251e8f98/3000.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "NIAGARA FALLS, N.Y. (AP) — Inside the columned church on the corner, the rich tones of the organ have wrapped congregants in their embrace. The time has come for the Rev. Jimmie Hardaway Jr. to preach the lessons embodied by the Prince of Peace.",
      "publishedAt": "2023-10-31T12:01:16Z",
      "title": "Two pastors worry for their congregants’ safety. Are more guns the answer or the problem?",
      "url": "https://apnews.com/a44329af27040d18a0c55844cc4945ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16c5457fb80c4d26b6ab63529d45e292/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "LEWISTON, Maine (AP) — Children were back in school in Lewiston and on the streets dressed as dinosaurs and princesses for Halloween, after a chaotic week that saw the deadliest mass shooting in Maine’s history and a massive search for the suspect as people sheltered indoors.",
      "publishedAt": "2023-10-31T15:31:51Z",
      "title": "Children return to school and trick-or-treat as Maine community starts to heal from mass shooting",
      "url": "https://apnews.com/ea276b1835c9e68f8ed7e4619ee8a3b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47d95fb07f92498381cc4b99fbdcecc6/1920.jpeg"
    },
    {
      "author": "MARÍA VERZA and FERNANDA PESCE",
      "description": "MEXICO CITY (AP) — The Day of the Dead in Mexico smells like cempasuchil flowers and copal incense.",
      "publishedAt": "2023-11-01T00:18:31Z",
      "title": "The Day of the Dead in Mexico is a celebration for the 5 senses",
      "url": "https://apnews.com/6397d16bc3ed28fec9d3acbe133053dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c16b3825eda49aea5dc8367e64b5045/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}