{
  "articles": [
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — President Joe Biden's imperiled re-election campaign hit new trouble Wednesday as House Speaker Emerita Nancy Pelosi said merely “it's up to the president to decide” if he should stay in the race, celebrity donor George Clooney said he should not run and Democratic senators and lawmakers expressed fresh fear about his ability to beat Republican Donald Trump.",
      "publishedAt": "2024-07-10T13:45:10Z",
      "title": "Biden's candidacy faces new peril as Pelosi, Clooney and more Democrats weigh in",
      "url": "https://apnews.com/333c0774dec4de05c32c353255b5f627",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8281706a5d34f4284862e04b7226f2d/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — He’s calling int to his favorite morning cable news show, bashing the “elites” of his party and dismissing unfavorable polls. He’s talking up his crowd sizes.As an increasingly defiant President Joe Biden rejects calls to step aside after a disastrous debate performance, he’s been embracing some of the tactics used by a man he calls a mortal threat to democracy: his rival, former President Donald Trump.",
      "publishedAt": "2024-07-10T16:51:14Z",
      "title": "A defiant Biden borrows some tactics from his rival as he tries to put debate debacle behind him",
      "url": "https://apnews.com/5132abffb5de5166a26423d9fdba050b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26bccdf42b854163bc8a2ce81cd5f960/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military urged all Palestinians to leave Gaza City and head south Wednesday, pressing ahead with a fresh offensive across the north, south and center of the embattled territory that has killed dozens of people over the past 48 hours.",
      "publishedAt": "2024-07-10T08:56:10Z",
      "title": "Israeli military orders the evacuation of Gaza City, an early target of its war with Hamas",
      "url": "https://apnews.com/6358a61735f0e30132decce781860594",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/909da4d733af4aa89c788522fc1a574e/3000.jpeg"
    },
    {
      "author": null,
      "description": "HOUSTON (AP) — The return of searing heat in the Houston area has deepened the misery for people still without power after Hurricane Beryl left residents in search of places to cool off and fuel up as the extended outages strained one of the nation’s largest cities.",
      "publishedAt": "2024-07-10T04:17:24Z",
      "title": "Houston residents stew and swelter after storm Beryl leaves millions without power",
      "url": "https://apnews.com/ceb5fdc1db4d89d2376abb22bfd45d99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9de4450792004f39922ede47733be81f/1920.jpeg"
    },
    {
      "author": "ALI SWENSON and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The U.S. House of Representatives on Wednesday was poised to vote on a proof-of-citizenship requirement for voter registration, a proposal Republicans have prioritized as an election-year talking point even as research shows noncitizens illegally registering and casting ballots in federal elections is exceptionally rare.",
      "publishedAt": "2024-07-10T16:55:20Z",
      "title": "House GOP wants proof of citizenship to vote, boosting an election-year talking point",
      "url": "https://apnews.com/8056bde9ea64b13fd20985d56a6a0fde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4249d4baa93245ac8654ad9e28fd379b/3000.jpeg"
    },
    {
      "author": "PAN PYLAS",
      "description": "LONDON (AP) — British police said they found Wednesday the man suspected of killing the wife and two daughters of a BBC radio commentator near London and that the suspect is receiving medical treatment for his injuries.",
      "publishedAt": "2024-07-10T08:52:53Z",
      "title": "Man suspected of killing the family of BBC radio commentator has been found, British police say",
      "url": "https://apnews.com/2b87c445df143d2bca2d6c12fe54dedc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da7bb3c9c00a47198476f822df9eb8f3/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A judge said Wednesday he was leaning toward throwing out Rudy Giuliani 's bankruptcy case after lawyers for the cash-strapped former New York City mayor and his biggest creditors — two ex-Georgia election workers who won a $148 million defamation judgment against him — agreed this was the best way forward.",
      "publishedAt": "2024-07-10T17:25:19Z",
      "title": "Judge says Rudy Giuliani bankruptcy case likely to be dismissed. But his debts aren't going away",
      "url": "https://apnews.com/02c348d419440f085d215fd261886a8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1fc8f0d4675414a8fcefd910eebe853/3000.jpeg"
    },
    {
      "author": "LEANNE ITALIE",
      "description": "NEW YORK (AP) — Michael Solender and his wife have been together for 42 years. They slept in the same bed for the first 10, taking to separate rooms after that.Their sleep separation was due to his developing chronic and heavy snoring that eventually led to a diagnosis of sleep apnea and his use of a CPAP machine.",
      "publishedAt": "2024-07-10T14:20:48Z",
      "title": "Specialists say there are benefits to couples sleeping separately",
      "url": "https://apnews.com/8597b78ed697256aab2d78d1bb54ad05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eaeebb13d854c15a858500967c422bc/1920.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — A defense attorney told jurors Wednesday that the shooting death of cinematographer Halyna Hutchins was an “unspeakable tragedy” but that “ Alec Baldwin committed no crime; he was an actor, acting.”",
      "publishedAt": "2024-07-10T05:03:04Z",
      "title": "Defense attorney says 'Alec Baldwin committed no crime; he was an actor, acting' at trial openings",
      "url": "https://apnews.com/9f969f6e020028749f5c3f93c549b0d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c94d34e1714e4520b16759e2f128cff0/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "LONDON (AP) — Lorenzo Musetti reached his first Grand Slam semifinal by eliminating Taylor Fritz 3-6, 7-6 (5), 6-2, 3-6, 6-1 at Wimbledon on Wednesday and will take on Novak Djokovic next.The 25th-seeded Musetti, a 22-year-old from Italy, had never been past the third round at the All England Club — or the fourth round at any major tournament — until now.",
      "publishedAt": "2024-07-10T12:22:40Z",
      "title": "Lorenzo Musetti reaches his first Grand Slam semifinal at Wimbledon and will face Novak Djokovic",
      "url": "https://apnews.com/11a285a305a48d33e7b49fcd713e85bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ab3b781369340df9d3d1653ac6f4632/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}