{
  "articles": [
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The war in Ukraine and its visiting president take center stage at the United Nations this week, but developing countries will be vying for the spotlight as well as they push for faster action on poverty and inequality at the first full-on meeting of world leaders since the COVID-19 pandemic disrupted travel three years ago.",
      "publishedAt": "2023-09-17T19:06:52Z",
      "title": "The spotlight is on Ukraine at UN leaders' gathering, but is there room for other global priorities?",
      "url": "https://apnews.com/27e5e572b91d2598d4249c6cc029bfa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/163cc0f9d61d4b11a93bb20dfbb16719/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON",
      "description": "NEW YORK (AP) — It’s been a central argument for the United Auto Workers union: If Detroit's three automakers raised CEO pay by 40% over the past four years, workers should get similar raises.UAW President Shawn Fain has repeatedly cited the figure, contrasting it with the 6% pay raises autoworkers have received since their last contract in 2019.",
      "publishedAt": "2023-09-17T13:14:01Z",
      "title": "UAW justifies wage demands by pointing to CEO pay raises. So how high were they?",
      "url": "https://apnews.com/dacdfe9ec0736f4fbf3ce7ee38b4bcf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a83c3193cf54db3bf3c98b94a29b5fe/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "NEW YORK (AP) — Yelling that the future and their lives depend on ending fossil fuels, tens of thousands of protesters on Sunday kicked off a week where leaders will try once again to curb climate change primarily caused by coal, oil and natural gas.",
      "publishedAt": "2023-09-17T18:43:17Z",
      "title": "Tens of thousands march to kick off climate summit, demanding end to warming-causing fossil fuels",
      "url": "https://apnews.com/200f35470e1d6f34f238e9c3c3f7f137",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c30e19ef0a6c447f97b355d7cad71add/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Former President Donald Trump repeatedly declined in an interview aired Sunday to answer questions about whether he watched the Capitol riot unfold on television, saying he would “tell people later at an appropriate time.”",
      "publishedAt": "2023-09-17T14:22:25Z",
      "title": "Trump refuses to say in a TV interview how he watched the Jan. 6 attack unfold at the US Capitol",
      "url": "https://apnews.com/59460113ce82ce6f6140d47856261a56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/728b67fccc794c769e76b256b44a2f7f/2811.jpeg"
    },
    {
      "author": null,
      "description": "TAIPEI, Taiwan (AP) — China’s military sent 103 warplanes toward Taiwan in a 24-hour period in what the island’s defense ministry said Monday was a daily record in recent times.The planes were detected between 6 a.m.",
      "publishedAt": "2023-09-18T02:00:25Z",
      "title": "China flies 103 military planes toward Taiwan in a new high of activity the island calls harassment",
      "url": "https://apnews.com/b8a78493341bd3af15f4fd58be692e4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/207dd22fb6504e639b157017aa1b6455/3000.jpeg"
    },
    {
      "author": "ROBERT F. BUKATY and DAVID SHARP",
      "description": "BAR HARBOR, Maine (AP) — Atlantic storm Lee — which made landfall at near-hurricane strength, bringing destructive winds and torrential rains to New England and Maritime Canada — kept weakening Sunday after officials withdrew warnings and predicted the storm would disappear early this week.",
      "publishedAt": "2023-09-17T05:27:49Z",
      "title": "Atlantic storm Lee delivers high winds and rain before forecasters call off all warnings",
      "url": "https://apnews.com/b40d9806887070c318487ecd1f81ef13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/880f6cf6cbc94d409e9876e30754a17c/1920.jpeg"
    },
    {
      "author": "CLAIRE RUSH and LAURA UNGAR",
      "description": "Alisha Alderson placed her folded clothes and everything she needed for the last month of her pregnancy in various suitcases. She never imagined she would have to leave the comfort of her home in rural eastern Oregon just weeks before her due date.",
      "publishedAt": "2023-09-17T14:08:43Z",
      "title": "Rural hospitals are closing maternity wards. People are seeking options to give birth closer to home",
      "url": "https://apnews.com/e67a91d927eb545459e83bc7b2b95a0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d1ae76470c04653840647f672e5833b/3000.jpeg"
    },
    {
      "author": "HAZEM TURKIA and JACK JEFFERY",
      "description": "TRIPOLI, Libya (AP) — Zahra el-Gerbi wasn't expecting much of a response to her online fundraiser, but she felt she had to do something after four of her relatives died in the flooding that decimated the eastern Libyan city of Derna.",
      "publishedAt": "2023-09-17T05:54:23Z",
      "title": "For a divided Libya, disastrous floods have become a rallying cry for unity",
      "url": "https://apnews.com/6de10ab7bd3b3181b3477ed3fc6a4cd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd2717167f89414ebafd775f71a5a19f/3000.jpeg"
    },
    {
      "author": "MARTÍN ADAMES ALCÁNTARA",
      "description": "SANTO DOMINGO, Dominican Republic (AP) — The president of the Dominican Republic on Sunday defended his decision to close air, sea and land traffic with neighboring Haiti in their dispute over construction of a canal targeting a river that runs through both countries.",
      "publishedAt": "2023-09-17T23:59:46Z",
      "title": "Dominican Republic's president stands resolute on his closing of all borders with Haiti",
      "url": "https://apnews.com/888b4812d5684c6b700313ada1af9bf6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c095cacc7c6422488e6f943cabcadf4/2907.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "No. 13 Alabama is out of the top 10 of The Associated Press college football poll for the first time in eight years, and Georgia remained No. 1 on Sunday.Georgia received 57 first-place votes in the AP Top 25. Michigan held at No.",
      "publishedAt": "2023-09-17T18:01:17Z",
      "title": "AP Top 25: No. 13 Alabama is out of the top 10 for the first time since 2015. Georgia remains No. 1",
      "url": "https://apnews.com/188d4c0030d2618e8f23b1dddb1470bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9091a758490e429fae6ae8a8211315be/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}