{
  "articles": [
    {
      "author": "MATT O'BRIEN, BERNARD CONDON",
      "description": "When Elon Musk bought Twitter in 2022, he laid off thousands of employees, stopped paying rent and auctioned off coffee makers and office chairs in hopes of a big turnaround. Now the world’s richest man has brought the same slash-and-burn strategy to the federal government. Some people who experienced Musk’s takeover at Twitter have a warning: Expect chaos, cuts driven by ideology as much as by cost concerns, intimidation and plenty of lawsuits. Since assuming leadership of the Department of Government Efficiency, Musk has consolidated control over large swaths of the government, sidelined career officials, gained access to sensitive databases and invited a constitutional clash over the limits of presidential authority.",
      "publishedAt": "2025-02-07T15:47:42Z",
      "title": "The slash-and-burn tactics Musk brings to Washington often backfired at Twitter",
      "url": "https://apnews.com/article/elon-musk-twitter-takeover-x-doge-government-efficiency-e78ac431e7bbf2ae8513594078f1408b",
      "urlToImage": "https://dims.apnews.com/dims4/default/435a9b7/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F57%2F23bd03832f6008ed4a976fdb0328%2Fc12e78bcaf4b413ba6ac1612b9a13982"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "Iowa Sen. Joni Ernst has hailed Elon Musk and the Trump administration’s Department of Government Efficiency. So has Iowa Gov. Kim Reynolds. Their constituents are following the cost-cutting effort closely. Unlike their top elected officials, several of them are expressing concerns. Some question the delivery of government services or whether Musk has the necessary authority. Others back Musk, saying his action is needed given the risk of doing nothing to sharply curb federal spending.",
      "publishedAt": "2025-02-07T05:02:52Z",
      "title": "Here's what Iowans had to say about Musk and DOGE",
      "url": "https://apnews.com/article/trump-doge-iowa-elon-musk-joni-ernst-29c2756648bc889a33dbc0a0fd9cc05d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5fd1388/2147483647/strip/true/crop/5319x2992+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2Fa9%2F0e8f612af5e1b6620c5fda851c1d%2F07456cc00d5149d79c443ba5e47dfa40"
    },
    {
      "author": "COLLIN BINKLEY, BIANCA VÁZQUEZ TONESS",
      "description": "Democrats are opposing Elon Musk’s Department of Government Efficiency as it turns its attention to the Education Department, with lawmakers raising questions about DOGE’s access to internal systems containing personal information on tens of millions of Americans. A group of Democrats tells the acting education secretary it's seeking to intervene as DOGE appears to gain increasing access to student loan databases. Democrats fear it could lay the groundwork for a takeover akin to Musk’s attempt to close the U.S. Agency for International Development. The Democrats want details about DOGE’s work and vow to fight any attempt to close of the Education Department. The Republican president has set out to abolish the department.",
      "publishedAt": "2025-02-07T16:24:16Z",
      "title": "Musk team's access to student loan systems raises alarms over personal information for millions",
      "url": "https://apnews.com/article/education-department-trump-doge-8c5bba3883b3d924b28114a4f291bec4",
      "urlToImage": "https://dims.apnews.com/dims4/default/35e2aaa/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F4e%2F5e57491a43ba76990d8453773490%2Fe0dbde17e75f4556a52f5a3fa64620b7"
    },
    {
      "author": "DAVE COLLINS",
      "description": "Democratic attorneys general in several states are vowing to file a lawsuit to stop Elon Musk’s Department of Government Efficiency from accessing federal payment systems containing Americans’ sensitive personal information. Thirteen attorneys general, including New York’s Letitia James, said in a statement issued Thursday that they were taking action in defense of the Constitution, people's right to privacy and essential funding that individuals and communities are counting on. Government officials and labor unions have been among those raising concerns about DOGE’s involvement with the payment system for the federal government. They say it could lead to security risks or missed payments for programs such as Social Security and Medicare.",
      "publishedAt": "2025-02-06T21:48:09Z",
      "title": "13 states to sue over DOGE access to government payment systems containing personal data",
      "url": "https://apnews.com/article/elon-musk-trump-doge-states-47912249bf4b79477cbe211565c9743c",
      "urlToImage": "https://dims.apnews.com/dims4/default/792a1ee/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F4b%2F2a922679318da2b2fe1757712380%2F43fb2bae60ee400097258000820369c5"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "Vice President JD Vance says Elon Musk’s Department of Government Efficiency should rehire a staff member who resigned after he was linked to social media posts that espoused racism. And President Donald Trump says he's endorsing Vance's view. The Wall Street Journal reported that 25-year-old DOGE employee Marko Elez resigned Thursday after the newspaper linked him to a deleted social media account on X. Posts on the account included statements that “I was racist before it was cool” and “You could not pay me to marry outside of my ethnicity.” Vance, in a post on Musk-owned X, said Elez should be brought back and blamed “journalists who try to destroy people.”",
      "publishedAt": "2025-02-07T20:00:29Z",
      "title": "Vance says DOGE staffer who resigned over racist posts should be brought back",
      "url": "https://apnews.com/article/trump-doge-marko-elez-musk-vance-racist-posts-959272aca0eece7385cdbc470930bf37",
      "urlToImage": "https://dims.apnews.com/dims4/default/2797ccf/2147483647/strip/true/crop/8139x4578+0+424/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F2a%2Fb3f20c8268081b3cd4bc93f3e414%2Fe50c01eb0edc4d5194145e662f8b779c"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "Forced leaves have begun in Washington and worldwide for most employees of the U.S. Agency for International Development. Under a Trump administration plan, the agency is to be left with fewer than 300 workers out of many thousands. The leaves at USAID started Friday. Federal workers associations have turned to the courts to try to roll back orders dismantling most of the agency and U.S.- funded aid programs around the world. It's not clear whether the reduction to 300 would be permanent or temporary, potentially allowing more workers to return after what Trump administration says is a review of the aid and development programs it wants to resume.",
      "publishedAt": "2025-02-07T13:55:18Z",
      "title": "Forced leaves start for thousands at USAID under a Trump plan to gut the foreign aid agency",
      "url": "https://apnews.com/article/usaid-foreign-aid-trump-rubio-48f8460804d33bdaa18d7765c4b24f9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/75a7e4b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F06%2F50d0ce2890d770e8b85e9bdc4574%2F786b30dbc5b847ecadb76eeabd1c5461"
    },
    {
      "author": "JOSH FUNK",
      "description": "Recent aviation disasters and close calls definitely have people worried about the safety of flying. The midair collision that killed 67 near Washington and the fiery plane crash in Philadelphia and now a missing plane in Alaska are only the most high-profile disasters. There was also a plane that clipped a parked plane while taxiing at the Seattle airport earlier this week and a United Airlines plane that caught fire during takeoff at the Houston airport. But even with all these incidents the statistics show that flying remains the safest form of transportation compared with driving or even riding on a train.",
      "publishedAt": "2025-02-07T18:24:36Z",
      "title": "Recent aviation disasters cause fears about the safety of flying",
      "url": "https://apnews.com/article/aviation-safety-crash-close-call-fire-faa-fe26b6cf0a4857f9b9336c3f5680e97b",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e32f16/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F02%2F634297a2d29b46de29bc986e1398%2F628a750089134264827651e42b8d6664"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "The Associated Press has obtained audio of what military officials say is a broadcast from a Russian spy ship that suffered a fire and drifted uncontrolled off Syria's coast last month. The NATO-nation military officials spoke to the AP on condition of anonymity to discuss the fire and radio transmission that Russian authorities haven’t publicly reported. The officials said a NATO-nation ship recorded the radio exchanges involving the Russian eavesdropping vessel Kildin. The audio provides an unusual peek inside Russia’s fleet of spy ships that NATO nations are watching closely. A retired French vice admiral said the blaze highlights logistical difficulties for Russia of maintaining naval forces in the Mediterranean.",
      "publishedAt": "2025-02-07T03:08:22Z",
      "title": "Listen to audio from a Russian spy ship that officials say caught fire",
      "url": "https://apnews.com/article/russia-nato-spy-ship-audio-mediterranean-syria-2e6c4d6fa184d7333a3001344f2ea58c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e045cae/2147483647/strip/true/crop/2000x1125+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F5d%2F6b51f25bb925702ad5bb721df00e%2Ff0dd049708ff4438b4531eb5577a55f7"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "The State Department has told Congress that it plans to sell more than $7 billion in weapons to Israel, including thousands of bombs and missiles, just two days after President Donald Trump met with Israeli Prime Minister Benjamin Netanyahu at the White House. The massive arms sale comes as a fragile ceasefire agreement between Israel and Hamas holds, even as Trump continues to tout his widely criticized proposal to move all Palestinians from Gaza and redevelop it as an international travel destination.",
      "publishedAt": "2025-02-07T21:48:47Z",
      "title": "State Department lays out plans for $7 billion-plus arms sale to Israel as Netanyahu visits DC",
      "url": "https://apnews.com/article/israel-weapons-us-sale-netanyahu-trump-gaza-c53a61873314be2336c3733b97d89ff3",
      "urlToImage": "https://dims.apnews.com/dims4/default/409b6cd/2147483647/strip/true/crop/2675x1505+0+142/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F19%2F0e84de5f8cf6447a6548a7befc42%2F7b606b7cf83a4229b2f0a4317b4c7f54"
    },
    {
      "author": "AAMER MADHANI, MARI YAMAGUCHI",
      "description": "President Donald Trump plans to cover a range of issues in his meeting with Japanese Prime Minister Shigeru Ishiba. He wants to talk about joint training exercises, Japanese investment in the U.S. economy, improving cyber security, increasing space cooperation, and promoting joint business opportunities to develop critical technologies. Ishiba, for his part, will look to remind Trump about the long-running U.S.-Japan alliance. Japanese companies employ nearly 1 million Americans and have held the top spot for cumulative foreign direct investment into the U.S. over the last five years. Ishiba arrived at the White House around midday on Friday and he and Trump are holding their first face-to-face talks.",
      "publishedAt": "2025-02-07T12:03:07Z",
      "title": "Japan's Ishiba makes a whirlwind Washington trip to try to forge a personal connection with Trump",
      "url": "https://apnews.com/article/trump-ishiba-us-japan-cd84a0e7306ab4b8b7e03bc8b76aa06c",
      "urlToImage": "https://dims.apnews.com/dims4/default/892c2c7/2147483647/strip/true/crop/5502x3095+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Fa5%2F15535aa6353a940e3ed516bc6340%2Fb2c2dc7635d04d44b87afb8fedb373da"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}