{
  "articles": [
    {
      "author": "Nicole Winfield",
      "description": "Pope Francis has died. He was history’s first Latin American pontiff who charmed the world with his humble style and concern for the poor but alienated conservatives with critiques of capitalism and climate change. He was 88. The Vatican camerlengo made the announcement Monday. Francis suffered from chronic lung disease and had part of one lung removed as a young man. He was admitted to Gemelli hospital on Feb. 14, 2025, for a respiratory crisis that developed into double pneumonia. He spent 38 days there. From his first greeting as pope of a simple “Good evening” to his embrace of refugees and the downtrodden, Francis signaled a very different tone for the papacy, stressing humility over hubris for a Catholic Church beset by scandal and accusations of indifference.",
      "publishedAt": "2025-04-21T07:57:28Z",
      "title": "Pope Francis, first Latin American pontiff, dies at 88",
      "url": "https://apnews.com/article/vatican-pope-francis-dead-01ca7d73c3c48d25fd1504ba076e2e2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3b5904/2147483647/strip/true/crop/6000x3375+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F54%2F19a37d6f3bdd9709f683e4aad98a%2Ffffe3c39b04f4699abe4376bdc4e04d0"
    },
    {
      "author": null,
      "description": "Pope Francis was the first pope from the Americas, the first Jesuit pontiff and the first to take the name of Francis, after St. Francis of Assisi. Jorge Mario Bergoglio was born Dec. 17, 1936, in Buenos Aires, Argentina, to Italian immigrants. He was the eldest of five children. He was ordained a Jesuit priest in 1969 and led the order in Argentina during the country’s murderous dictatorship that began in the 1970s. After being named archbishop of Buenos Aires, he was elevated to cardinal in 2001 by St. John Paul II. He was elected the 266th pope on March 13, 2013, on the fifth ballot.",
      "publishedAt": "2025-04-21T09:02:47Z",
      "title": "A look at Pope Francis' life in brief",
      "url": "https://apnews.com/article/pope-francis-dead-brief-041c348c9882f079f5be2e93a8d38d0a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d042adb/2147483647/strip/true/crop/3800x2138+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F0e%2Fda894dee3c9c1ea8db3531f0bb99%2F85034775e27641d5811fe9870b059a6d"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Francis changed the Catholic Church’s teaching in areas such as the death penalty and nuclear weapons. But he upheld it in other areas, such as abortion and celibacy for priests. Francis defended the church’s opposition to artificial contraception, but he also said Catholics should instead practice “responsible parenthood” through approved methods. And he suggested that women threatened with the Zika virus could use artificial contraception. He divided the church by issuing an opening to divorced and civilly married Catholics to receive Communion.",
      "publishedAt": "2025-04-21T08:56:16Z",
      "title": "Pope Francis altered some church teachings, upheld others",
      "url": "https://apnews.com/article/pope-francis-career-highlights-589cbd4ffd574d6c9c2674add1b564c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/121047f/2147483647/strip/true/crop/512x288+0+30/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F06%2Fedb6d407c05d7e2a497ad5fc2ae1%2F5fe2727588704ef5b0fb05228ca87acf"
    },
    {
      "author": null,
      "description": "The first pope from the Americas was born Jorge Mario Bergoglio in Buenos Aires, Argentina, on Dec. 17, 1936. He was chosen to lead the church on March 13, 2013. He picked the name Francis, after St. Francis of Assisi. He was the eldest of five children. His father was Mario Jose Bergoglio, an accountant who had moved from Italy. His mother was Regina María Sívori, the daughter of Italian immigrants. He was ordained a priest with the Jesuit religious order in 1969 and elevated to cardinal in 2001 by St. John Paul II.",
      "publishedAt": "2025-04-21T08:21:35Z",
      "title": "Key dates in the life of Pope Francis",
      "url": "https://apnews.com/article/pope-francis-key-dates-0d33f7c8adca4c22a8e9bebeb5d3cdcc",
      "urlToImage": "https://dims.apnews.com/dims4/default/61c8cb5/2147483647/strip/true/crop/512x288+0+27/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2Fb7%2F12b293605fecae18160000691ff3%2F8ee5c69759194224b538d9658115fb78"
    },
    {
      "author": "Jon Gambrell",
      "description": "U.S. airstrikes targeting Yemen’s capital killed 12 people and wounded 30 others, the Houthi rebels said early Monday. The deaths mark the latest in America’s intensified campaign of strikes targeting the rebels. The U.S. military’s Central Command declined to answer questions about the strike or discuss civilian casualties from its campaign. The Houthis described the strike as hitting the Farwa neighborhood market in Sanaa’s Shuub district. That area has been targeted before by the Americans. Strikes overnight into Monday also hit other areas of the country.",
      "publishedAt": "2025-04-21T01:34:01Z",
      "title": "US airstrikes kill at least 12 people in Yemen's capital Sanaa, Houthis rebels say",
      "url": "https://apnews.com/article/yemen-us-airstrikes-iran-04-21-2025-05d9133558d6cfdf0cbd8fe9e3778647",
      "urlToImage": "https://dims.apnews.com/dims4/default/784a3bb/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F10%2Fec8ba5fbc7b41b7cb07949f5f6a7%2F9cda6ef3ad0e4808906d34c7a7fa9ee5"
    },
    {
      "author": "Tara Copp",
      "description": "Defense Secretary Pete Hegseth created another Signal messaging chat that included his wife and brother where he shared similar details of a March military airstrike against Yemen’s Houthi militants that were sent in another chain with top Trump administration leaders. The New York Times on Sunday reported the second chat, and a person familiar with the contents and those who received the messages confirmed it to The Associated Press. That person, who spoke on condition of anonymity to discuss sensitive matters, said the unclassified chat included 13 people. The White House late Sunday dismissed the report as a “non-story,” insisting that no classified information was shared.",
      "publishedAt": "2025-04-20T23:20:11Z",
      "title": "Hegseth had a second Signal chat where he shared details of Yemen strike, New York Times reports",
      "url": "https://apnews.com/article/hegseth-signal-chat-houthis-attack-8dbf9dd6c711796438a5c1c84831c40b",
      "urlToImage": "https://dims.apnews.com/dims4/default/9335f23/2147483647/strip/true/crop/5096x2867+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2Fab%2F008b3a8acd8abb1be8984e5d19a8%2F56e2016498f3408db0fa2a0ea546de1f"
    },
    {
      "author": null,
      "description": "China is warning other countries against making trade deals with the United States to China’s detriment. Governments including those of Taiwan, Japan and South Korea have begun negotiations with Washington after President Donald Trump announced sweeping tariffs against most of America’s trading partners on April 2. The import taxes were mostly paused after markets panicked, but he increased his already steep tariffs against China. The Commerce Ministry said Monday that China “firmly opposes any party reaching a deal at the expense of China’s interests” and China would retaliate if that happened. U.S. Treasury Secretary Scott Bessent said earlier the countries currently negotiating trade deals with the U.S. should “approach China as a group” together with Washington.",
      "publishedAt": "2025-04-21T07:06:15Z",
      "title": "China warns countries against making trade deals with the US unfavorable to Beijing",
      "url": "https://apnews.com/article/chian-us-tariffs-retaliation-18b3da9bed1aa1b3ee3a79e91c197730",
      "urlToImage": "https://dims.apnews.com/dims4/default/1945fd8/2147483647/strip/true/crop/6464x3636+0+337/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2Fbf%2F6effe8661b810baa5620da0210ac%2F93c63917a4c8463ca6bfa44d2ad356c6"
    },
    {
      "author": "Marcos Aleman, Megan Janetsky",
      "description": "El Salvador President Nayib Bukele proposed carrying out a prisoner swap with Venezuela on Sunday, suggesting he would exchange Venezuelan deportees from the United States his government has kept imprisoned for who he called “political prisoners” in Venezuela. In a post on the social media platform X, Bukele listed off a number of family members of high-level opposition figures in Venezuela, journalists and activists detained during the government’s electoral crackdown last year.",
      "publishedAt": "2025-04-20T22:08:14Z",
      "title": "El Salvador president proposes prisoner swap with Maduro for Venezuelan deportees",
      "url": "https://apnews.com/article/el-salvador-bukele-maduro-venezuela-prisoners-6728d1df2445d85bd16c6ab8a85056a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/9873d5b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F31%2F88861a09ae0c62b77bf74643a109%2Fc5ff3e97bfbc4c86bca73ae00fd948f3"
    },
    {
      "author": "Aaron M. Kessler, Michael Biesecker",
      "description": "An Associated Press analysis of an aviation safety database reveals that drones last year accounted for nearly two-thirds of reported near midair collisions involving commercial aircraft taking off and landing at major U.S. airports. Over the last decade, a majority of such incidents involved drones. Safety experts say a collision between an airliner and drone could be catastrophic and are urging authorities to take action to reduce the risks.",
      "publishedAt": "2025-04-21T04:03:36Z",
      "title": "As drones become more popular, they are posing an increasing risk to airliners",
      "url": "https://apnews.com/article/drones-risk-airports-planes-safety-collisions-d8bb7192173d90b46258c91152454cf3",
      "urlToImage": "https://dims.apnews.com/dims4/default/88ef237/2147483647/strip/true/crop/6066x3412+0+316/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2Fb4%2Fac33a8c2e0d45684545f957088a9%2Fbbc79c5d7b0d4d51b2bbfc349bdd1e6e"
    },
    {
      "author": "The Associated Press",
      "description": "A woman in the southern African country of Namibia runs a program that harnesses the power but also the gentleness of horses to help children with learning disabilities and conditions like attention-deficit/hyperactivity disorder and autism. Each weekday morning, Susan de Meyer’s dusty paddock is enlivened by a group of eight to 10 children from one of the special schools she helps who come to ride the horses. The program received an award last year from the International Equestrian Federation. De Meyer says it helps kids with their confidence, balance and coordination and makes “the world different” for them.",
      "publishedAt": "2025-04-21T04:15:57Z",
      "title": "A horse therapy program in Namibia brings joy to children with learning disabilities",
      "url": "https://apnews.com/article/horse-therapy-autism-children-kids-namibia-e5b482af0ce9365d18104fe725ac1aa3",
      "urlToImage": "https://dims.apnews.com/dims4/default/1bf011f/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fd0%2F183af6c3c69f02e059687e81cd05%2Fb46dd41e7445424e8d1e9d9f758251f6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}