{
  "articles": [
    {
      "author": "JILL COLVIN and JONATHAN J. COOPER",
      "description": "LITITZ, Pa. (AP) — Donald Trump gave a profane and conspiracy-laden speech two days before the presidential election, talking about reporters being shot and suggesting he “shouldn't have left” the White House after his 2020 loss to Democrat Joe Biden.",
      "publishedAt": "2024-11-03T18:46:15Z",
      "title": "Trump talks about reporters being shot and says he shouldn't have left White House after 2020 loss",
      "url": "https://apnews.com/a310fbc211ad8f0f5e290547ec284187",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d08ebfa1f0e4da5a1d7af01a48f83cb/1920.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "WASHINGTON (AP) — The results on Election Day will come down to seven states: Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin.",
      "publishedAt": "2024-11-03T12:45:07Z",
      "title": "When polls close in battleground states on Election Day",
      "url": "https://apnews.com/964d07d7d6a9d6d034850497821f9cd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f47db4aef3d4378a92f30afa46cdbdd/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and JONATHAN J. COOPER",
      "description": "GASTONIA, N.C. (AP) — Donald Trump says he will be the “protector” of women, whether they like it or not.",
      "publishedAt": "2024-11-03T16:48:26Z",
      "title": "Trump wants to narrow his deficit with women but he's not changing how he talks about them",
      "url": "https://apnews.com/c4ba3f564e981aec7cd12f24d390aced",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fce644f26abb4bb68ec96a5af82cc368/3000.jpeg"
    },
    {
      "author": null,
      "description": "RALEIGH, N.C. (AP) — North Carolina had already surpassed its early-voting record set in 2020, but the State Board of Elections announced Sunday that more than 4.2 million voters cast ballots at early in-person voting sites, with turnout in western counties hit by Hurricane Helene outpacing the rest of the state.",
      "publishedAt": "2024-11-03T17:45:29Z",
      "title": "North Carolina sees turnout record with more than 4.2M ballots cast at early in-person voting sites",
      "url": "https://apnews.com/ae9e422b7ad70e981b83bf9b726296ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/843b1323f83142f39f3a3860ce2f0f9c/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — The Israeli military said Sunday it has carried out a ground raid into Syria, seizing a Syrian citizen involved in Iranian networks. It was the first time in the current war that Israel announced its troops operated in Syrian territory.",
      "publishedAt": "2024-11-03T08:07:35Z",
      "title": "Israel says it carried out ground raid into Syria, seizing a Syrian citizen connected to Iran",
      "url": "https://apnews.com/9806fad6404f68737c5192c6fa1c7b9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5324d1a0f32472b8da5da3f9c9ff52d/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE , JULIA FRANKEL and LEE KEATH",
      "description": "JERUSALEM (AP) — One of the most startling aspects of Israel’s campaign against Hamas in Gaza has been the destruction wreaked on the territory’s health sector. Over the past 13 months, the Israeli military has besieged and raided at least 10 hospitals, saying the attacks are a military necessity because Hamas uses the facilities as command and control bases.",
      "publishedAt": "2024-11-03T18:25:06Z",
      "title": "Takeaways from AP's report on three hospitals in northern Gaza raided by Israeli troops",
      "url": "https://apnews.com/d066117ec80bce83657447add762b2e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea98a4e1a5164d06b16248c22ecfe6b6/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — An Israeli court on Sunday loosened a gag order on a case investigating leaks of classified information suspected to involve one of Prime Minister Benjamin Netanyahu’s media advisers.",
      "publishedAt": "2024-11-03T15:01:32Z",
      "title": "Israel investigates leaks that appear to have bolstered Netanyahu as Gaza truce talks stalled",
      "url": "https://apnews.com/6075c848c8b32c8fd69835434c67046a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02aa47e437d846f2abe380840b08a413/3000.jpeg"
    },
    {
      "author": "BY STEPHEN McGRATH and VADIM GHIRDA",
      "description": "CHISINAU, Moldova (AP) — Moldova’s pro-Western President Maia Sandu has won a second term in office in a pivotal presidential runoff against a Russia-friendly opponent, in a race that was overshadowed by claims of Russian interference, voter fraud, and intimidation in the European Union candidate country.",
      "publishedAt": "2024-11-03T05:07:28Z",
      "title": "Moldova’s pro-Western president wins 2nd term in runoff overshadowed by Russian meddling claims",
      "url": "https://apnews.com/5886447779a4a818e9f30fdadcb8bbe5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9662c4976704198ad766b760e6da45b/1920.jpeg"
    },
    {
      "author": "JUAN KARITA and ISABEL DEBRE",
      "description": "LAUCA Ñ, Bolivia (AP) — Bolivia's transformative and divisive former President Evo Morales said Sunday that he would press on with a hunger strike until the government of his protégé-turned-rival agreed to a political dialogue.",
      "publishedAt": "2024-11-03T22:10:09Z",
      "title": "Bolivia's Evo Morales tells AP he'll press on with a hunger strike until his rival accepts dialogue",
      "url": "https://apnews.com/8f14b568425ee257ff5d454b7fbc5a7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd4a2fe2b0d149ba89bcc2f166b5fa28/3000.jpeg"
    },
    {
      "author": "DAVID MELERO and JOSEPH WILSON",
      "description": "PAIPORTA, Spain (AP) — A crowd of enraged survivors hurled clots of mud left by storm-spawned flooding at the Spanish royal couple on Sunday during their first visit to the epicenter of their nation's deadliest natural disaster in living memory.",
      "publishedAt": "2024-11-03T12:37:57Z",
      "title": "Spain flood survivors hurl mud at the royals and top government officials",
      "url": "https://apnews.com/a8525bd82cf4cc3fc6273d535cbb9d66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d00e3d6815645d8b93ab6ff5cfc0d34/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}