{
  "articles": [
    {
      "author": "NAJIB JOBAIN and JACK JEFFREY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Battles between Israel and Hamas around hospitals forced thousands of Palestinians to flee from some of the last perceived safe places in northern Gaza, stranding critically wounded patients, newborns and their caregivers with dwindling supplies and no electricity, health officials said Monday.",
      "publishedAt": "2023-11-13T07:30:24Z",
      "title": "Medics and patients, including babies, stranded as battles rage around Gaza hospitals",
      "url": "https://apnews.com/c98faefe9d5bb213d3e44cf9defd5990",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/899dd762765c4deca3bc08f662caaa3d/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Gaza’s Shifa Hospital has become the focus of a dayslong stalemate in Israel’s war against the Hamas militant group.Shifa is Gaza’s largest and best-equipped hospital. But Israel claims the facility also is used by Hamas for military purposes.",
      "publishedAt": "2023-11-13T22:00:39Z",
      "title": "Israel says Hamas is using Gaza's biggest hospital for cover. Hundreds of people are trapped inside",
      "url": "https://apnews.com/ce8fda9821a011a6cb6e4a3df5c90916",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a5fdd4fc05a41ed8a1d5821ca2fcc1f/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and AAMER MADHANI",
      "description": "WASHINGTON (AP) — U.S. officials expressed hope Monday that this week's highly anticipated face-to-face meeting between President Joe Biden and Chinese President Xi Jinping will produce some concrete results, including the possible reestablishment of military communication between the two nations and a shared effort to combat illicit fentanyl trafficking.",
      "publishedAt": "2023-11-13T22:58:36Z",
      "title": "White House hoping Biden-Xi meeting brings progress on military communications, fentanyl fight",
      "url": "https://apnews.com/78b97bad7800b9d006c62d28cb9d898d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e75a0b7a358344f084e705545951c450/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, MEG KINNARD and THOMAS BEAUMONT",
      "description": "COLUMBIA, S.C. (AP) — The Republican Party’s once-crowded 2024 presidential primary field has suddenly shrunk to just a handful of viable candidates.",
      "publishedAt": "2023-11-13T22:35:11Z",
      "title": "The 2024 Republican presidential field is rapidly shrinking. But is it too late to stop Trump?",
      "url": "https://apnews.com/c64fa9a5e8ffc0694331d7d148aac5c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d43b7fc3510745dc88a7400947b6d7d0/1920.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ",
      "description": "SAN FRANCISCO (AP) — Paul Pelosi recounted publicly for the first time Monday what happened the night he was attacked by a man in the San Francisco home he shares with former U.S. House Speaker Nancy Pelosi, recalling how shocking it was to see a man standing at his bedroom door, then how the man whacked him in the head with a hammer.",
      "publishedAt": "2023-11-13T18:15:29Z",
      "title": "Paul Pelosi testifies about being attacked with a hammer at his San Francisco home",
      "url": "https://apnews.com/fb32db568be375e4c4fc26f41d283d7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3abc7a6a8f1e46dd847237680005ec8c/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Monday adopted its first code of ethics, in the face of sustained criticism over undisclosed trips and gifts from wealthy benefactors to some justices, but the code lacks a means of enforcement.",
      "publishedAt": "2023-11-13T19:03:06Z",
      "title": "The Supreme Court says it is adopting a code of ethics, but it has no means of enforcement",
      "url": "https://apnews.com/64d393ceb6f05402d762dca06f0f4187",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d27ce8f0f6d445b8a5169a18c6a902d0/1920.jpeg"
    },
    {
      "author": "JOHN ANTCZAK, JULIE WATSON and JEFF McMURRAY",
      "description": "LOS ANGELES (AP) — Arson was the cause of a massive weekend fire that charred and indefinitely closed a vital section of a Los Angeles freeway, causing major traffic headaches for hundreds of thousands of commuters, California authorities said Monday.",
      "publishedAt": "2023-11-13T05:18:29Z",
      "title": "Arson likely caused fire that damaged vital artery of Los Angeles freeway, governor says",
      "url": "https://apnews.com/0ea64aa3e4bdf72ab020a911aa3a8470",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8ee010bb9774007b24cb49b683b8010/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump Jr. returned to court Monday as something of a character witness for his father's real estate empire, waxing exuberantly about the former president’s “incredible vision” and portfolio of “great, iconic projects\" at the New York civil fraud trial now threatening his company’s future.",
      "publishedAt": "2023-11-13T05:31:28Z",
      "title": "Donald Trump Jr. lauds dad’s real estate exploits as ex-president's civil fraud trial begins defense",
      "url": "https://apnews.com/4727a8f5345c1ab794d33d0c9bcc990f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23b3388064d64611becc3b183e1fde6d/1920.jpeg"
    },
    {
      "author": "MARYCLAIRE DALE and KAREN MATTHEWS",
      "description": "NEW YORK (AP) — Maryanne Trump Barry, a retired federal judge and former President Donald Trump 's oldest sister, has died at age 86 at her home in New York.",
      "publishedAt": "2023-11-13T19:14:26Z",
      "title": "Maryanne Trump Barry, the former president's older sister and a retired federal judge, dies at 86",
      "url": "https://apnews.com/3e05d8455810eaae170dd92f98098a43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4e43fb82ff64688b968057245da2775/2796.jpeg"
    },
    {
      "author": "JENNA FRYER",
      "description": "LAS VEGAS (AP) — There is no such thing as a flawless first-year event, so go ahead and accept that there will be bumps and bruises in Formula One’s $500 million Las Vegas Grand Prix.",
      "publishedAt": "2023-11-13T18:44:43Z",
      "title": "Column: F1 learns it overestimated fan demand for Las Vegas, the most expensive race of the year",
      "url": "https://apnews.com/9ea9e86d014c29b6bc72d8e07692e2db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48a8d59f62a743f2b909478e2886fb1c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}