{
  "articles": [
    {
      "author": null,
      "description": "The Justice Department has asked a federal court to unseal grand jury transcripts in Jeffrey Epstein’s case amid a firestorm over the Trump administration’s handling of records related to the wealthy financier. Deputy Attorney General Todd Blanche filed a motion urging the court to release the transcripts a day after President Donald Trump directed the Justice Department to do so. The Trump administration has been embroiled in controversy since the Justice Department last week announced that it would not be releasing any more evidence in its possession from Epstein’s investigation.",
      "publishedAt": "2025-07-18T21:35:58Z",
      "title": "Justice Department asks court to unseal Epstein grand jury records",
      "url": "https://apnews.com/article/trump-jeffrey-epstein-grand-jury-justice-department-ece8a837f9bd179771f801a765e242e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a6123a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F33%2F278e792edd2f2ae8b32ba5c589c0%2F46b57647c17e4e13a21fda90437d14d9"
    },
    {
      "author": null,
      "description": "Under intense pressure from President Donald Trump’s own supporters, his administration now says it will push a court to unseal secret documents related to Jeffrey Epstein’s case. It's an effort to put to rest for good a political crisis largely of the administration's own making. But even if those records eventually become public, it’s far from certain they will appease critics enraged over the administration’s unfulfilled promises of full transparency about the evidence against the wealthy financier. Meanwhile, the administration remains dogged by questions about its refusal to release other records in its possession.",
      "publishedAt": "2025-07-18T17:46:32Z",
      "title": "Trump administration seeks release of more Epstein records",
      "url": "https://apnews.com/article/trump-jeffrey-epstein-justice-department-bondi-91f911d2d7a909f78259cdca7b55d9a6",
      "urlToImage": "https://dims.apnews.com/dims4/default/192af96/2147483647/strip/true/crop/5776x3249+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F1f%2F00dcaaf0fa0f1cd71b471264fa01%2F29ee39764b114d3998767bf2b9741e99"
    },
    {
      "author": null,
      "description": "President Donald Trump on Friday will sign into law a new set of regulations for a type of cryptocurrency that are seen as a way to legitimize the burgeoning industry. The GENIUS Act sets initial guardrails and consumer protections for stablecoins, a type of cryptocurrency that is tied to a stable asset like the U.S. dollar to reduce price volatility. It passed both the House and Senate with wide bipartisan margins. The measure is meant to bolster consumer confidence in the rapidly growing crypto sector. Its passage comes as Trump makes it a mission to establish the U.S. as the “crypto capital of the world.”",
      "publishedAt": "2025-07-18T15:56:45Z",
      "title": "President Donald Trump will sign a new cryptocurrency bill into law on Friday",
      "url": "https://apnews.com/article/donald-trump-stablecoins-congress-cryptocurrency-94fa3c85e32ec6fd5a55576cf46e58ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/7b91de4/2147483647/strip/true/crop/5822x3275+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F66%2Faf6e09b0e9fdc6a76ef3c68be5e3%2Fb0e943886a084705b089ac3ff45c0736"
    },
    {
      "author": null,
      "description": "U.S. Attorney General Pam Bondi says at least three people are dead after an incident at a Los Angeles County Sheriff’s Department facility. There was a reported explosion at the facility Friday morning. The Los Angeles County Sheriff’s Department has not confirmed any deaths. The U.S. Attorney’s Office did not immediately respond to a request for comment. California Gov. Gavin Newsom’s office said he’s been briefed on the matter. The blast happened about 7:30 a.m. in East Los Angeles. That is according to the Los Angeles County Fire Department. Aerial footage from KABC-TV shows the explosion happened in a parking lot filled with sheriff patrol cars and box trucks.",
      "publishedAt": "2025-07-18T16:13:32Z",
      "title": "Attorney General Bondi says at least 3 dead after incident at LA sheriff facility",
      "url": "https://apnews.com/article/facility-sheriff-los-angeles-dead-explosion-da7ad1fdc444bbb7d8c14f33b44333e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Venezuela has released 10 jailed Americans in exchange for getting home scores of migrants deported by the United States to El Salvador months ago under the Trump administration’s immigration crackdown. The resolution represents a diplomatic achievement for Venezuelan President Nicolás Maduro and helps President Donald Trump in his goal of bringing home Americans jailed abroad. El Salvador will send back some 300 Venezuelan migrants whom the Trump administration agreed to pay $6 million to house in a notorious Salvadoran prison. The arrangement drew immediate blowback when Trump invoked an 18th century wartime law to quickly remove men his administration had accused of belonging to the violent Tren de Aragua street gang.",
      "publishedAt": "2025-07-18T20:04:43Z",
      "title": "Venezuela releases jailed Americans in swap for deported migrants",
      "url": "https://apnews.com/article/prisoner-swap-venezuela-united-states-el-salvador-a0c3070355fbdc31f028a16096c5655c",
      "urlToImage": "https://dims.apnews.com/dims4/default/678dead/2147483647/strip/true/crop/5190x2919+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F14%2Fe650656efe23b516bb1fc65c968c%2F86d355025ad3404fae12c826802af416"
    },
    {
      "author": null,
      "description": "Top church leaders have visited Gaza after its only Catholic church was struck by an Israeli shell the day before. The attack Thursday killed three people and wounded ten, including a priest who had developed a close friendship with the late Pope Francis. The strike drew condemnation from the pope and U.S. President Donald Trump, and prompted a statement of regret from Israel, which said it was a mistake. Since ending a ceasefire in March, Israel has regularly launched far deadlier strikes across Gaza against what it says are Hamas militants, frequently killing women and children. Strikes killed 18 people overnight, health officials said Friday.",
      "publishedAt": "2025-07-18T11:20:43Z",
      "title": "Christian patriarchs visit Gaza after pope and Trump condemn Israeli strike on church",
      "url": "https://apnews.com/article/israel-gaza-war-palestinians-church-pizzaballa-theophilos-8797732b94777534379f1adc4468cbb9",
      "urlToImage": "https://dims.apnews.com/dims4/default/8862afb/2147483647/strip/true/crop/4854x2730+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F15%2Fea4681973fd7018c32248958f9df%2F71ca9098f8ec4c58815eaf3adb036aaa"
    },
    {
      "author": null,
      "description": "Brazil’s former President Jair Bolsonaro has been ordered to wear an ankle monitor, his press office has confirmed. The development on Friday came as federal police conducted searches at his home and his party’s headquarters in Brasília. The former president is facing trial at the Supreme Court for allegedly leading a coup attempt to overturn the 2022 election, which he lost to President Luiz Inácio Lula da Silva. On Tuesday, Brazil’s chief prosecutor accused Bolsonaro of inciting insurrection. Bolsonaro has called the trial a “witch hunt,” echoing statements by former U.S. President Donald Trump, who has defended him.",
      "publishedAt": "2025-07-18T12:52:42Z",
      "title": "Brazil's Bolsonaro ordered to wear ankle monitor",
      "url": "https://apnews.com/article/brazil-bolsonaro-investigation-supreme-court-b1e2c1fbb7f776103895b6efca94af4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/5445a72/2147483647/strip/true/crop/3744x2106+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F68%2Fdf12178979347f74c7f5623d142a%2F45e93e35abef4edfa7b000086cf12442"
    },
    {
      "author": null,
      "description": "U.S. Envoy to Syria Tom Barrack says that Israel and Syria have agreed to a ceasefire, following Israel’s intervention this week in fighting between Syrian government forces and Bedouin tribes and armed groups from the Druze minority. The announcement came as clashes continued between Druze groups and members of Bedouin clans in Syria’s southern Sweida province, leaving tens of thousands of people displaced in a worsening humanitarian crisis. Government forces had withdrawn from Sweida following a separate ceasefire agreed upon with Druze groups on Wednesday after Israel launched dozens of airstrikes on convoys of government fighters.",
      "publishedAt": "2025-07-18T07:54:52Z",
      "title": "US envoy says Syria, Israel agree to ceasefire as Druze minority and Bedouin clans clash",
      "url": "https://apnews.com/article/syria-druze-bedouins-israel-clashes-fighting-54476ab26aac668babe858aa805b7170",
      "urlToImage": "https://dims.apnews.com/dims4/default/56a3c97/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2Fc5%2Fd3aba79d2c1046b0267d67bba4f6%2Fb3210adf3e9f41df91abadee0a2a2348"
    },
    {
      "author": null,
      "description": "CBS parent Paramount insists that this week's decision to cancel Steven Colbert's “Late Show” was strictly financial, and had nothing to do with politics. Skeptics abound — Colbert has been a fierce critic of President Donald Trump — but there's no denying the economics of television are not looking good. TV is rapidly losing eyeballs to streaming services and making hard decisions about programming. Late-night was once a valuable audience for advertisers because the genre had a lot of hard-to-reach young men. Now many of them are streaming, either to watch something else or see highlights of late-night comics that are hard for networks to monetize.",
      "publishedAt": "2025-07-18T21:33:10Z",
      "title": "Colbert cancellation illustrates challenging economics of TV",
      "url": "https://apnews.com/article/colbert-tv-late-night-politics-economics-paramount-cbs-e2b5852238685a83ae5b6cea579e0f0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad7c1c2/2147483647/strip/true/crop/8466x4762+0+441/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F85%2F7417e618d58553ffc515490399e4%2Fb722e57b8694431197934295dcd3bbc0"
    },
    {
      "author": null,
      "description": "Oscar-winning lyricist Alan Bergman has died at 99. A family spokesperson said he died late Thursday in Los Angeles. Bergman teamed with his wife, Marilyn, for an enduring and loving partnership that produced such old-fashioned hits as “How do You Keep the Music Playing?,” “It Might Be You” and the classic “The Way We Were.” The Bergmans were among the most successful and prolific teams of their time. They provided words and occasional music for hundreds of songs, including movie themes that became as famous as the films themselves. Frank Sinatra, Michael Jackson, Barbra Streisand, Tony Bennett and many other artists performed their material.",
      "publishedAt": "2025-07-18T14:42:06Z",
      "title": "Alan Bergman, Oscar-winning lyricist, dies at 99",
      "url": "https://apnews.com/article/alan-bergman-dies-composer-77e4bf9dd39a17a26b3fc2f809a7efee",
      "urlToImage": "https://dims.apnews.com/dims4/default/6cd399d/2147483647/strip/true/crop/2525x1420+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F9a%2F1a63fd64c085a098d793160af2a4%2F54fd55ae89a14c29b2bacffae13345ad"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}