{
  "articles": [
    {
      "author": "DAVID RISING, JILL LAWLESS and NICHOLAS RICCARDI",
      "description": "BANGKOK (AP) — Whether on the left or the right, regardless of how long they’ve been in power, sitting governments around the world have been drubbed this year by disgruntled voters in what has been called the “super year” for elections.",
      "publishedAt": "2024-11-17T05:08:10Z",
      "title": "The 'super year' of elections has been super bad for incumbents as voters punish them in droves",
      "url": "https://apnews.com/c80fbd4e667de86fe08aac025b333f95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8ee9a034c8f43109694fffa64355307/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and DAN GELSTON",
      "description": "NEW YORK (AP) — President-elect Donald Trump walked out to a roaring standing ovation just ahead of the start of the UFC pay-per-view card at Madison Square Garden on Saturday night, combining two things close to his heart: fierce battles inside the octagon and New York City.",
      "publishedAt": "2024-11-16T18:23:17Z",
      "title": "Trump attends UFC championship fight in New York, taking a break from Cabinet picks",
      "url": "https://apnews.com/8d5bfbccd32c1115cf2f6b54b8c58a0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/812cc909db894661803d7ecd86747040/2798.jpeg"
    },
    {
      "author": "NATALIE MELZER, WAFAA SHURAFA and KAREEM CHEHAYEB",
      "description": "TEL AVIV, Israel (AP) — Israeli strikes in the Gaza Strip overnight killed 12 people, Palestinian medical officials said Sunday. Israeli police meanwhile arrested three suspects after flares were fired at Prime Minister Benjamin Netanyahu's private residence in the coastal city of Caesarea.",
      "publishedAt": "2024-11-17T07:05:05Z",
      "title": "Israeli strikes kill 12 in Gaza as arrests are made over flares fired at Netanyahu's home",
      "url": "https://apnews.com/060c45c86b937d255270d272590884a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45b7afb94a96499baee896953912cfde/3000.jpeg"
    },
    {
      "author": "GIADA ZAMPANO",
      "description": "ROME (AP) — Pope Francis has called for an investigation to determine if Israel’s attacks in Gaza constitute genocide, according to excerpts released Sunday from an upcoming new book ahead of the pontiff's jubilee year.",
      "publishedAt": "2024-11-17T10:43:10Z",
      "title": "Pope Francis calls for investigation to determine if Israel's attacks in Gaza constitute 'genocide'",
      "url": "https://apnews.com/62907898cead13dbcfd603592263904c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed33a6b7bbe04fe4b672b2f6e084a1ed/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russia on Sunday launched a massive drone and missile attack on Ukraine, described by officials as the largest over the past months, targeting energy infrastructure and killing civilians.",
      "publishedAt": "2024-11-17T08:31:14Z",
      "title": "Russia launches one of the fiercest missile and drone attacks at Ukraine's infrastructure",
      "url": "https://apnews.com/6af214839d9436731e9b960f0d3a7a8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6039bf151b9453d81817cc6d543e431/2000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — When Russian tanks rolled into Ukraine in February 2022, the conventional wisdom was that the capital, Kyiv, would soon fall and the rest of the country wouldn’t last long against a much larger enemy.",
      "publishedAt": "2024-11-17T05:50:39Z",
      "title": "Russia grinds deeper into Ukraine after 1,000 days of grueling war",
      "url": "https://apnews.com/f7f56e494df1dbbcdec1853001796c45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8045c73a453e4a7eafb9d2ac0aa0705b/2000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — A powerful typhoon wrecked houses, caused towering tidal surges and forced hundreds of thousands of people to flee to emergency shelters as it cut across the northern Philippines on Sunday in the sixth major storm to hit the country in less than a month.",
      "publishedAt": "2024-11-17T04:00:27Z",
      "title": "Latest typhoon lashes the Philippines, causing tidal surges and displacing massive numbers of people",
      "url": "https://apnews.com/520b17b3c2b0ccfd33c7421f65ba177d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/990344dae34e4c7baa46f195e83d1dcb/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM",
      "description": "SAVANNAH, Ga. (AP) — As the third named storm to emerge during November, Tropical Storm Sara serves as a reminder that the Atlantic hurricane season hasn't quite ended.Sara formed in the western Caribbean Sea before making landfall Thursday on the northern coast of Honduras, dumping torrential rains in a slow weekend crawl across parts of Central America.",
      "publishedAt": "2024-11-17T05:28:17Z",
      "title": "A third November storm, Sara, serves notice that a busy hurricane season isn't over yet",
      "url": "https://apnews.com/a88648635e3910edd190388563cc7b52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa27dd703e9b4614a1dbf04f55aff031/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and SIBI ARASU",
      "description": "BAKU, Azerbaijan (AP) — Distractions were bigger than deals in the first week of United Nations climate talks, leaving a lot to be done, especially on the main issue of money.In week one, not a lot of progress was made on the issue of how much money rich countries should pay to developed ones to move away from dirty fuels and how to cope with rising seas and temperatures and pay for damage already caused by climate-driven extreme weather.",
      "publishedAt": "2024-11-17T05:08:36Z",
      "title": "As talks in Baku cross the halfway point, nations are no closer to a goal on cash for climate action",
      "url": "https://apnews.com/8d726f485bd544d1ad483755c34c0f70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86acb3f0842b4002a8195d679f354e99/3000.jpeg"
    },
    {
      "author": "MARK BANCHEREAU",
      "description": "DAKAR, Senegal (AP) — Polls opened in Senegal on Sunday for a parliamentary election that is set to determine if the country’s newly elected president can carry out ambitious reforms.More than 7 million registered voters in the West African country are choosing 165 lawmakers in the national assembly, where the party of President Bassirou Diomaye Faye currently does not hold a majority.",
      "publishedAt": "2024-11-17T08:45:02Z",
      "title": "Senegal votes in election that will decide if president can carry out the reforms he promised",
      "url": "https://apnews.com/52d97319ade0efc750ea3bc5f50877f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8df595fc1954c5bbb539cd98e11416d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}