{
  "articles": [
    {
      "author": "LEA SKENE and BRIAN WITTE",
      "description": "BALTIMORE (AP) — The largest crane on the Eastern Seaboard was being transported to Baltimore so crews on Friday can begin removing the wreckage of a collapsed highway bridge that has halted a search for four workers still missing days after the disaster and blocked the city's vital port from operating.",
      "publishedAt": "2024-03-29T04:08:40Z",
      "title": "Cranes arriving to start removing wreckage from deadly Baltimore bridge collapse",
      "url": "https://apnews.com/7d27a5c561f9f3359935a56139623108",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5502d5205184b8e9abd10e4c2405673/1920.jpeg"
    },
    {
      "author": "BEN FINLEY and BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — Rebuilding Baltimore’s collapsed Francis Scott Key Bridge could take anywhere from 18 months to several years, experts say, while the cost could be at least $400 million — or more than twice that.",
      "publishedAt": "2024-03-29T04:10:34Z",
      "title": "Building a new Key Bridge could take years and cost at least $400 million, experts say",
      "url": "https://apnews.com/a126a3b732af95e86d1fbef01e9fb487",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98069b3fc77645b6a085e66af04c7dc3/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — Americans are more worried about legal immigrants committing crimes in the U.S. than they were a few years ago, a change driven largely by increased concern among Republicans, while Democrats continue to see a broad range of benefits from immigration, a new poll shows.",
      "publishedAt": "2024-03-29T04:02:50Z",
      "title": "Many Americans say immigrants contribute to economy but there's worry over risks, AP-NORC poll finds",
      "url": "https://apnews.com/39246ef896ebccc51b67f6ed46de8061",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a760d8a327f4fe28d12e8da42256fb1/3000.jpeg"
    },
    {
      "author": "REESE DUNKLIN, RYAN J. FOLEY, JEFF MARTIN, JENNIFER McDERMOTT, HOLBROOK MOHR and JOHN SEEWER",
      "description": "Carl Grant, a Vietnam veteran with dementia, wandered out of a hospital room to charge a cellphone he imagined he had. When he wouldn’t sit still, the police officer escorting Grant body-slammed him, ricocheting the patient’s head off the floor.",
      "publishedAt": "2024-03-28T10:01:53Z",
      "title": "Why did more than 1,000 people die after police subdued them with force that isn't meant to kill?",
      "url": "https://apnews.com/02881a2bd3fbeb1fc31af9208bb0e310",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e8f74af45d04d729beaf2088d939f77/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Hours before gunmen last week carried out the bloodiest attack in two decades in Russia, authorities made an addition to a government register of extremist and terrorist groups: They included the international LGBTQ+ “movement.”",
      "publishedAt": "2024-03-29T04:04:23Z",
      "title": "The Moscow concert massacre was a major security blunder. What's behind that failure?",
      "url": "https://apnews.com/431ed84d40412100b08c1473a7f4ad32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67fd6d8876274ffcace09755059c3594/3000.jpeg"
    },
    {
      "author": "MIKE CORDER and JOSEF FEDERMAN",
      "description": "THE HAGUE, Netherlands (AP) — The top United Nations court on Thursday ordered Israel to take measures to improve the humanitarian situation in Gaza, including opening more land crossings to allow food, water, fuel and other supplies into the war-ravaged enclave.",
      "publishedAt": "2024-03-28T16:28:59Z",
      "title": "UN top court orders Israel to open more land crossings for aid into Gaza",
      "url": "https://apnews.com/7f2cb03fa2ec6736315a32e9ee291dbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be5fb3529bc045f189fc3bfe605e7c21/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and KAREEM CHEHAYEB",
      "description": "DEIR AL-BALAH, Gaza (AP) — An international team of doctors visiting a hospital in central Gaza was prepared for the worst. But the gruesome impact Israel’s war against Hamas is having on Palestinian children still left them stunned.",
      "publishedAt": "2024-03-28T04:16:20Z",
      "title": "Doctors visiting a Gaza hospital are stunned by the war's toll on Palestinian children",
      "url": "https://apnews.com/7c7a6117efae29e22a61e82151144613",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1890f34d8e5e43a3bd07175c1d4ebeef/1920.jpeg"
    },
    {
      "author": "GERALD IMRAY",
      "description": "CAPE TOWN, South Africa (AP) — A bus carrying worshippers on a long-distance trip from Botswana to an Easter weekend church gathering in South Africa plunged off a bridge on a mountain pass Thursday and burst into flames as it hit the rocky ground below, killing at least 45 people, authorities said.",
      "publishedAt": "2024-03-28T22:40:35Z",
      "title": "Bus plunges off a bridge in South Africa, killing 45 people. An 8-year-old is the only survivor",
      "url": "https://apnews.com/a5b31e9085a5f843f90d0582676ded37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7ce83db65e94b99ab0206d085f6c06f/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Republicans on Thursday invited President Joe Biden to testify before Congress in what appears to be a last-ditch effort to deliver on their stalled monthslong impeachment inquiry into the Biden family businesses.",
      "publishedAt": "2024-03-28T20:09:18Z",
      "title": "House Republicans invite President Biden to testify at public hearing as impeachment inquiry stalls",
      "url": "https://apnews.com/a2ffd73660b71cbb31b97ad4bfe44c07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6365906f369b401f8e27874d9aa5b5db/3000.jpeg"
    },
    {
      "author": "FERNANDA PESCE",
      "description": "TAXCO, Mexico (AP) — A mob in the Mexican tourist city of Taxco brutally beat a woman to death Thursday because she was suspected of kidnapping and killing a young girl, rampaging just hours before the city’s famous Holy Week procession.",
      "publishedAt": "2024-03-28T21:21:48Z",
      "title": "Mob in Mexico brutally beats suspected kidnapper to death hours before Holy Week procession",
      "url": "https://apnews.com/f48c9aa7cad7141b2f6025fba6e216fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbb4a950f28b4d5681bbe38d550df5c3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}