{
  "articles": [
    {
      "author": "Angela Charlton, Hanna Arhirova",
      "description": "U.S. Secretary of State Marco Rubio says the U.S. may “move on” from efforts for a Russia-Ukraine peace deal if there is no progress in the coming days. He spoke in Paris after a marathon day of landmark talks among U.S., Ukrainian and European officials. Rubio said the discussions had been constructive and produced an outline for steps toward peace. French officials said a new meeting in the same format is expected in London in the coming days. Rubio said he could join that meeting, and it’s expected early in the week.",
      "publishedAt": "2025-04-18T07:29:24Z",
      "title": "Rubio says the US will drop Ukraine-Russia peace efforts if no progress within days",
      "url": "https://apnews.com/article/rubio-ukraine-russia-war-trump-a90e3e49c276b75ed2542f2f0422ddd6",
      "urlToImage": "https://dims.apnews.com/dims4/default/8d668ed/2147483647/strip/true/crop/6532x3674+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2Fe1%2F6f797f6937d75fa03de15b8c1c3a%2F7bdafe00088e49f485e901af67f65a9d"
    },
    {
      "author": "Jon Gambrell",
      "description": "Yemen's Houthi rebels say U.S. airstrikes targeting the Ras Isa oil port have killed 20 people and wounded 50 others. The strikes were confirmed by the U.S. military’s Central Command, which did not acknowledge any casualties. The airstrikes represent one of the highest death tolls so far in the campaign launched under President Donald Trump that has involved hundreds of strikes since March 15. Central Command said U.S. forces acted to eliminate fuel for the Houthis and deprive them of illegal revenue.",
      "publishedAt": "2025-04-18T01:21:03Z",
      "title": "US strikes on oil port in Yemen kill 20, Houthi rebels say",
      "url": "https://apnews.com/article/yemen-us-airstrikes-563f61bbd96e1f2de68373fdf76c8811",
      "urlToImage": "https://dims.apnews.com/dims4/default/55a57bd/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F64%2F7202dc2069d1c5e6e7f243dbb0a6%2F44231e4191474113b7476d5342b9fa2c"
    },
    {
      "author": "Wafaa Shurafa, Fatma Khaled",
      "description": "Israeli airstrikes across Gaza have killed at least 17 people including children as the new U.S. ambassador to Israel made his first public appearance in Jerusalem. Gaza hospitals say among the dead early Friday were 10 people in the urban Jabaliya refugee camp, including eight from the same house. The strikes come a day after more than two dozen people died in Gaza as Israel ramps up attacks to pressure Hamas to return the hostages and disarm. U.S. Ambassador to Israel Mike Huckabee appeared at the Western Wall, the holiest Jewish prayer site in Jerusalem’s Old City, where he inserted a prayer handwritten by President Donald Trump.",
      "publishedAt": "2025-04-18T09:37:55Z",
      "title": "Israeli strikes kill at least 17 in Gaza and Huckabee makes first appearance as US ambassador",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-18-2025-4b267bb6600d0a41f899815bf3361563",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8f748b/2147483647/strip/true/crop/7633x4294+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2Fe9%2Fa9f3c44cebe120926face5ecd6ea%2F814c264b0c844b1c8305ecfea0730486"
    },
    {
      "author": "Meg Kinnard",
      "description": "There was the pool furniture in the background. There were the tropical drinks, which looked to be margaritas garnished with cherries. And then there were the deported prisoner and the American senator, sitting and chatting. That senator, Chris Van Hollen of Maryland, accused El Salvador’s government of aiming to paint the picture of a leisurely respite for the wrongly deported Kilmar Abrego Garcia by staging their meeting with drinks appearing to be alcohol, and angling to set the meeting by a hotel pool. Van Hollen referred to the stagecraft with a term that had ricocheted around social media for much of the day: “Margaritagate.”",
      "publishedAt": "2025-04-18T22:06:31Z",
      "title": "Tropical drinks by the pool? Not so fast, says senator who visited Abrego Garcia in El Salvador",
      "url": "https://apnews.com/article/margaritagate-bukele-van-hollen-abrego-garcia-e346ea5bcca8b4bc7ead1b12f304d3d2",
      "urlToImage": "https://dims.apnews.com/dims4/default/006d568/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F47%2F7a2358c5c636292a81db1c184a6f%2Fb65aba878b274623a1b353bf7fadae80"
    },
    {
      "author": "Kate Payne, David Fischer",
      "description": "When a 20-year-old opened fire at Florida State University, terrified students barricaded doors and fled across campus, abandoning chemistry notes and even shoes. By early Friday, memorials of candles and flowers dotted the campus and a school-wide vigil had been scheduled as students and faculty tried to start healing from the shooting that investigators said killed two men and wounded at least six others. Investigators say the son of a sheriff’s deputy opened fire with his mother’s former service weapon. Officers who arrived almost immediately shot and wounded the shooter who is believed to be a Florida State student.",
      "publishedAt": "2025-04-18T04:42:19Z",
      "title": "Florida State University students felt fear and panic in deadly shooting",
      "url": "https://apnews.com/article/florida-state-university-shooting-c9a33f571466ce1ab1045dafebb30b82",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb88c98/2147483647/strip/true/crop/3773x2122+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F8e%2F70fa7758688151cac453eb0c9c82%2F1f2a016d09314784a8ebcf4a2c174e66"
    },
    {
      "author": null,
      "description": "Two people were killed and six others were injured when a gunman opened fire at Florida State University. Among those killed Thursday was Robert Morales, a university dining coordinator who had worked at FSU since 2015. His father, Ricardo Morales, was a Cuban exile turned CIA operative in South Florida with the nickname, “Monkey.” The other victim killed was 45-year-old Tiru Chabba, who was an executive at the food service vendor Aramark. Chabba was a Greenville, South Carolina resident who was a married father of two children. Authorities say the 20-year-old campus shooter was a Florida State student and the son of a sheriff’s deputy.",
      "publishedAt": "2025-04-18T18:38:44Z",
      "title": "FSU shooting victims include a school employee whose dad was a Cuban exile turned CIA operative",
      "url": "https://apnews.com/article/florida-state-university-shooting-victims-morales-214d279eb925181531f25b501551ae51",
      "urlToImage": "https://dims.apnews.com/dims4/default/05000a8/2147483647/strip/true/crop/2613x1470+0+136/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F01%2F08179af3589a08ee382bb53fd18b%2Fb806153fa3b64d1489dca2e6987872c0"
    },
    {
      "author": null,
      "description": "Approximately 10,000 pages of records related to the 1968 assassination of Sen. Robert F. Kennedy have been released. The Friday release continues the disclosure of national secrets ordered by President Donald Trump. Director of National Intelligence Tulsi Gabbard says in a statement the RFK files’ release will “shine a long-overdue light on the truth.” Gabbard says, “Nearly 60 years after the tragic assassination of Senator Robert F. Kennedy, the American people will, for the first time, have the opportunity to review the federal government’s investigation thanks to the leadership of President Trump.” The U.S. National Archives and Records Administration posted roughly 229 files containing the pages on its website.",
      "publishedAt": "2025-04-18T14:38:11Z",
      "title": "10,000 pages of records related to the 1968 assassination of Robert F. Kennedy are released",
      "url": "https://apnews.com/article/rfk-assassination-files-released-74af7098faf255d92a5bff32899a7ce7",
      "urlToImage": "https://dims.apnews.com/dims4/default/cad272d/2147483647/strip/true/crop/2983x1678+0+318/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F02%2F8682526de983ff108e1ef6a3166d%2F9d900b37d98843d5ad73d1f4ce8d3480"
    },
    {
      "author": "Mark Sherman",
      "description": "The federal judiciary is warning that Congress is not providing enough money for judges’ security, at a time of escalating threats and chilling efforts at intimidation. More than five dozen judges handling lawsuits against the Trump administration are receiving “enhanced online security screening” that typically includes scrubbing their personal information from the internet. That's according to two federal judges appointed by Republican presidents and writing in a letter on behalf of the judiciary in a letter to congressional appropriators. President Donald Trump, senior aide Stephen Miller and billionaire Elon Musk have railed at judges who have blocked parts of Trump’s agenda, threatening impeachment and launching personal attacks.",
      "publishedAt": "2025-04-18T17:51:55Z",
      "title": "Judges warn Congress that more money is needed for security at a time of escalating threats",
      "url": "https://apnews.com/article/federal-courts-threats-judges-security-trump-bd2a28dacd847845b1ffc430162a8985",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Jon Gambrell, Amir Vahdat",
      "description": "As far as biographies go, the two men in charge of the delicate negotiations between Iran and the United States over Tehran’s rapidly advancing nuclear program couldn’t be more different. On the American side, billionaire real estate magnate Steve Witkoff leads the effort by President Donald Trump’s administration to restrict Tehran’s atomic program, which they fear could allow Iran to build a nuclear weapon. Representing Iran is Foreign Minister Abbas Araghchi, who like many of his generation is a veteran of the bloody Iran-Iraq war. He rose through the ranks of Iran’s diplomatic corps and served as a trusted negotiator during talks that led to Iran’s 2015 nuclear deal with world powers.",
      "publishedAt": "2025-04-18T08:32:23Z",
      "title": "Iran-US talks hinge on a billionaire and a seasoned diplomat",
      "url": "https://apnews.com/article/iran-us-nuclear-negotiators-witkoff-araghchi-5aeb1f0bec7a77637410800a2fd65d99",
      "urlToImage": "https://dims.apnews.com/dims4/default/10e612c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F6c%2F6b0926d74b7f3b46c797a3c00f77%2F2c0db1dcce4d4e049345e370ba1c2e53"
    },
    {
      "author": "Morgan Lee",
      "description": "Thousands of Catholics are making the trek to a historic adobe church in the hills of northern New Mexico as part of a Holy Week tradition spanning generations. El Santuario de Chimayó just north of Santa Fe is one of the most important Catholic pilgrimage centers in the U.S. It culminates Friday in displays of faith, reflection and repentance on backcountry highways. The church at Chimayó is renowned for a tiny indoor well of holy dirt thought to have curative powers. The site also is significant because of the Nuestro Señor de Esquipulas crucifix, which was found on the site in the early 1800s.",
      "publishedAt": "2025-04-18T04:10:58Z",
      "title": "Thousands of pilgrims trek through New Mexico desert to historic adobe church for Good Friday",
      "url": "https://apnews.com/article/good-friday-pilgrimage-catholic-church-new-mexico-9283699d129d4a72a519ae21df0240cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/7709094/2147483647/strip/true/crop/1233x694+0+153/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F99%2Fe87ef72f6ffd5c0265c3122ce6f9%2F083d377a477a489b9fda8c36d3acc338"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}