{
  "articles": [
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Israel carried out another series of punishing airstrikes Friday, hitting suburban Beirut and cutting off the main border crossing between Lebanon and Syria for tens of thousands of people fleeing the Israeli bombardment of the Hezbollah militant group.",
      "publishedAt": "2024-10-04T06:51:52Z",
      "title": "Israeli airstrikes rock southern suburbs of Beirut and cut off a key crossing into Syria",
      "url": "https://apnews.com/5f2e512d5334b6f7fd7f5a46400e6979",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49686bee1dc54266904e832893420ce5/1920.jpeg"
    },
    {
      "author": "AMIR VAHDAT",
      "description": "TEHRAN, Iran (AP) — Iran’s supreme leader on Friday praised the country’s recent missile strike on Israel and said it was ready to do it again if necessary, state TV reported.",
      "publishedAt": "2024-10-04T10:42:26Z",
      "title": "Iranian supreme leader praises missile attack on Israel, saying Iran will do it again if necessary",
      "url": "https://apnews.com/2bce5479abfdac5fd953d5547d04941c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5eb8876b34c64592a7238d4489807e8f/3000.jpeg"
    },
    {
      "author": "NASSER NASSER and AREF TUFAHA",
      "description": "TULKAREM, West Bank (AP) — An Israeli airstrike on a West Bank cafe that the military said targeted Palestinian militants also killed a family of four, including two young children, relatives told The Associated Press on Friday.",
      "publishedAt": "2024-10-04T12:12:22Z",
      "title": "Relatives say a whole family was killed in Israel's deadliest West Bank strike since Oct. 7",
      "url": "https://apnews.com/1656f77bb28acdfb3d72ec5fccd628e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85b90dd56dda4d019e0523107bebfec6/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "PENSACOLA, N.C. (AP) — The search for victims of Hurricane Helene dragged into its second week on Friday, as exhausted rescue crews and volunteers continued to work long days — navigating past washed out roads, downed power lines and mudslides — to reach the isolated and the missing.",
      "publishedAt": "2024-10-04T04:11:07Z",
      "title": "Sheriff says rescuers 'will not rest' as search for Helene's victims drags into second week",
      "url": "https://apnews.com/1a2255b9d1dd5cd9554a76b45c7a695c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/898ad2fe763d489ba229b1a5925c001b/1920.jpeg"
    },
    {
      "author": "DAVID FISCHER and TERRY SPENCER",
      "description": "INDIAN ROCKS BEACH, Fla. (AP) — Aiden Bowles was stubborn, so even as Florida officials told residents of the barrier island north of St. Petersburg that Hurricane Helene's storm surge could be deadly, the retired restaurant owner stayed put.",
      "publishedAt": "2024-10-04T14:01:13Z",
      "title": "Helene’s powerful storm surge killed 12 near Tampa. They didn't have to die",
      "url": "https://apnews.com/0284042dade78e04e453ad821e6e15c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39f0eb071b6a420ea7be832d122c06a8/1920.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — America’s employers added a surprisingly strong 254,000 jobs in September, easing concerns about a weakening labor market and suggesting that the pace of hiring is still solid enough to support a growing economy.",
      "publishedAt": "2024-10-04T04:01:26Z",
      "title": "US adds a robust 254,000 jobs and unemployment dips to 4.1% in sign of still-sturdy labor market",
      "url": "https://apnews.com/87447d5187b37bb0f5cf996e25bad808",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ecc692773d44c0abcac95a32be88c24/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "DETROIT (AP) — Vice President Kamala Harris will visit the union stronghold of Flint, Michigan, on Friday as she battles with Donald Trump for working-class voters who could tip the scales in this year's election.",
      "publishedAt": "2024-10-04T04:05:18Z",
      "title": "Harris and Trump battle for labor support as dockworkers suspend strike",
      "url": "https://apnews.com/98eee32bc975ed5bc284d3e0785e5d7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45c5908aff3a427a958eebe0cd75de16/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court left in place Friday two Biden administration environmental regulations aimed at reducing industry emissions of planet-warming methane and toxic mercury.",
      "publishedAt": "2024-10-04T15:37:28Z",
      "title": "Supreme Court leaves in place two Biden administration environmental regulations",
      "url": "https://apnews.com/af42c5f91ce0c56f2f54b5ea01d3a247",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/138b81889c324019b34b06104716efa6/3000.jpeg"
    },
    {
      "author": "ELDAR EMRIC",
      "description": "KISELJAK, Bosnia-Herzegovina (AP) — A severe rainstorm struck Bosnia overnight Friday, killing at least 16 people in floods and landslides in several towns and villages in central and southern parts of the country, with surging waters rushing into people's homes as they were sleeping.",
      "publishedAt": "2024-10-04T08:29:10Z",
      "title": "Rainstorms and heavy floods hit large parts of Bosnia, killing at least 16 people",
      "url": "https://apnews.com/5c50ea065f9fbbef8307d500ddd3fbb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e630507a0e34a26997d164897d374ec/1920.jpeg"
    },
    {
      "author": "MARK LEWIS",
      "description": "STAVANGER, Norway (AP) — Wars, a refugee crisis, famine and artificial intelligence could all be recognized when Nobel Prize announcements begin next week under a shroud of violence.The prize week coincides with the Oct.",
      "publishedAt": "2024-10-04T07:40:50Z",
      "title": "The Nobel Prizes will be announced against a backdrop of wars, famine and artificial intelligence",
      "url": "https://apnews.com/c72eac3761a1169356b5c8d32dbe177e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f339b43ee1e04d47b963ec815173bf6d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}