{
  "articles": [
    {
      "author": "ERIC TUCKER, DASHA LITVINOVA and MATTHEW LEE",
      "description": "WASHINGTON (AP) — The United States and Russia completed their biggest prisoner swap in post-Soviet history on Thursday, with Moscow releasing journalist Evan Gershkovich and fellow American Paul Whelan, along with dissidents including Vladimir Kara-Murza, in a multinational deal that set two dozen people free.",
      "publishedAt": "2024-08-01T13:29:35Z",
      "title": "3 newly freed Americans are back on US soil after a landmark prisoner exchange with Russia",
      "url": "https://apnews.com/d803e266cb4e60135ec5d668d684529f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce35deec68e044b39cf45ed12696aa74/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris ' campaign announced Friday that it raised $310 million last month, an eyepopping sum showing that donors who once seemed spooked about the prospects for November's election with President Joe Biden are now offering mountains of cash to boost his former No.",
      "publishedAt": "2024-08-02T10:25:01Z",
      "title": "Harris raised a massive $310 million in July, as she looks to reset November's race against Trump",
      "url": "https://apnews.com/fbc14aa926444b4f961f579c63811766",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/773f172524c04b6099ee742d51060752/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO, GABRIELA SÁ PESSOA and E. EDUARDO CASTILLO",
      "description": "CARACAS, Venezuela (AP) — The stakes grew higher for Venezuela's electoral authority to show proof backing its decision to declare President Nicolás Maduro the winner of the country's presidential election after the United States on Thursday recognized opposition candidate Edmundo González as the victor, discrediting the official results of the vote.",
      "publishedAt": "2024-08-01T18:37:17Z",
      "title": "US recognizes opposition candidate González as the winner of Venezuela's presidential election",
      "url": "https://apnews.com/fa5780b54ffd166b4e20513d5b457512",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c7d4035c40944d4b4121a859e96177b/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "United States President Joe Biden says he’s “very concerned” that the violence in the Middle East could escalate, adding that the killing of a top Hamas leader in Iran has “not helped” efforts to negotiate a cease-fire in the Israel-Hamas war.",
      "publishedAt": "2024-08-02T08:02:58Z",
      "title": "Israel-Hamas war latest: International calls for cease-fire grow after assassinations in the Mideast",
      "url": "https://apnews.com/4b5d030519f35181cf92d0313cb583d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94199dda03284cd3be9dc775c21b628d/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and AMELIA THOMSON-DEVEAUX",
      "description": "Most Americans have doubts about the Secret Service's ability to keep presidential candidates safe after last month's attempt on former President Donald Trump’s life, a new poll from the Associated Press-NORC Center for Public Affairs Research finds.",
      "publishedAt": "2024-08-02T04:18:59Z",
      "title": "Few Americans trust the Secret Service after a gunman nearly killed Trump, an AP-NORC poll finds",
      "url": "https://apnews.com/e5ef28f72d61080088a0835a1b9a7d39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32954b9652824e92be3df95815165df8/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Several suspects arrested in violent protests that erupted after the fatal stabbing of three children in northwest England were due in court Friday as officials braced for more clashes that Prime Minister Keir Starmer condemned and blamed on “far-right hatred.”",
      "publishedAt": "2024-08-02T10:24:00Z",
      "title": "UK police brace for more far-right protests as government warns of tough response",
      "url": "https://apnews.com/5929ca5b0514dee578e29764b8961036",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6828620ebd4346e9bdd5d55484e6d458/3000.jpeg"
    },
    {
      "author": "NAMU SAMPATH of The Springfield Republican, MONICA OBRADOVIC of The St. Louis Post-Dispatch, HILARY BURNS of The Boston Globe, and CHRISTOPHER L. KELLER of The Associated Press",
      "description": "AMHERST, Mass. (AP) — Since her arrest at a protest at the University of Massachusetts, Annie McGrew has been pivoting between two sets of hearings: one for the misdemeanor charges she faces in court, and another for violations of the college's conduct code.",
      "publishedAt": "2024-08-02T04:04:22Z",
      "title": "Thousands were arrested at college protests. For students, the fallout was only beginning",
      "url": "https://apnews.com/7cb75debddc2e8bd795d16515d07de09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b7c48b711594cb1b45bd8d83943baa6/3000.jpeg"
    },
    {
      "author": "RISHI LEKHI",
      "description": "WAYANAD, India (AP) — When Deva Das was jolted awake by the roar of gushing water and boulders banging at the door, he grabbed his parents and his kids and began running for higher ground.The family waded through slush and muck, climbed a hill, and stayed there in the pouring rain for nearly four hours.",
      "publishedAt": "2024-08-02T09:17:10Z",
      "title": "They ran for their lives as boulders and water banged at their door. Now everything is buried in mud",
      "url": "https://apnews.com/faf58294716a24ac2d31c04618f335ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cc486221e7a40e39d55d745686d99cf/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Mexican farm worker Avelino Vazquez Navarro didn't have air conditioning in the motor home where he died last month in Washington state as temperatures surged into the triple digits.",
      "publishedAt": "2024-08-02T04:14:17Z",
      "title": "Heat deaths of people without air conditioning, often in mobile homes, underscore energy inequity",
      "url": "https://apnews.com/095cc1820abab04ed9729c6de73f21ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02f24060c1a3446f86ba13b482945206/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — Simone Biles huddled with Sunisa Lee. She looked to her husband Jonathan Owens in the stands.",
      "publishedAt": "2024-08-01T18:44:14Z",
      "title": "Simone Biles makes history with second all-around Olympic gymnastics title, 8 years after her first",
      "url": "https://apnews.com/ee448ffdf28570d3b99da0fa4cbec640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cecb4524df4341c5a2df8bd1f80ea7a5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}