{
  "articles": [
    {
      "author": "MEG KINNARD and WILL WEISSERT",
      "description": "CHARLESTON, S.C. (AP) — Former President Donald Trump is looking to win his fourth straight primary state on Saturday over Nikki Haley in South Carolina, aiming to hand a home-state embarrassment to his last remaining major rival for the Republican nomination.",
      "publishedAt": "2024-02-24T05:02:39Z",
      "title": "Trump enters South Carolina's Republican primary looking to embarrass Haley in her home state",
      "url": "https://apnews.com/13237d287ce770e0a45e9bccee78e8ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/831b40702452413db7ed4747de899269/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS and JOANNA KOZLOWSKA",
      "description": "The body of Russian opposition leader Alexei Navalny has been handed over to his mother, a top aide to Navalny said Saturday on his social media account.",
      "publishedAt": "2024-02-24T09:10:53Z",
      "title": "The body of Russian opposition leader Alexei Navalny has been handed over to his mother, aide says",
      "url": "https://apnews.com/78fa6a0d6792ee868ad41fd672dea510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b322a7204fc4d73a3e09798ac713a53/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — President Volodymyr Zelenskyy welcomed Western leaders to Kyiv Saturday to mark the second anniversary of Russia's full-scale invasion, as Ukrainian forces run low on ammunition and foreign aid hangs in the balance.",
      "publishedAt": "2024-02-24T05:59:52Z",
      "title": "Western leaders rally around Kyiv to mark 2 years since Russia's full-scale invasion",
      "url": "https://apnews.com/65088ba9eb9bd729cf8c677e2115cb35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd609c302f1548fdabbcb8779a80a4d9/2953.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. and Britain struck 18 Houthi targets in Yemen on Saturday, answering a recent surge in attacks by the Iran-backed militia group on ships in the Red Sea and Gulf of Aden, including a missile strike this past week that set fire to a cargo vessel.",
      "publishedAt": "2024-02-24T09:29:12Z",
      "title": "US and British strikes on Houthi sites in Yemen answer militants’ surge in Red Sea attacks on ships",
      "url": "https://apnews.com/89b3f92ae9dd6279b56d945439010a27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fa75f7c6d6945f6bc6a42800f60628a/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and KIMBERLEE KRUESI",
      "description": "COLUMBUS, Ohio (AP) — The resignation letter was short and direct.“I can no longer be under an oath to uphold the New Constitution of Ohio,\" wrote Sabrina Warner in her letter announcing she was stepping down from the state's Republican central committee.",
      "publishedAt": "2024-02-24T13:56:04Z",
      "title": "Oaths and pledges have been routine for political officials. That's changing in a polarized America",
      "url": "https://apnews.com/26682555293bdac60a9cb3d926b2a7bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdc62a69ab5d4562b2ddcece7a692e68/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "COLUMBIA, S.C. (AP) — At least one member of the Republican National Committee is working to slow Donald Trump's attempted takeover of the organization by pushing to keep the committee neutral until Trump is officially the presidential nominee and avoid picking up his legal bills.",
      "publishedAt": "2024-02-24T20:21:23Z",
      "title": "An RNC member is trying to stop the party from paying Donald Trump's legal bills",
      "url": "https://apnews.com/ff51a7ae8b5d872344e64a9a18851350",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe1efade176247299281714ad36a133c/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Authorities in the eastern Caribbean said they were trying to locate two people believed to be U.S. citizens who were aboard a yacht that was hijacked by three escaped prisoners from Grenada.",
      "publishedAt": "2024-02-24T16:25:25Z",
      "title": "Caribbean officials search for 2 people who were on yacht allegedly hijacked by 3 escaped prisoners",
      "url": "https://apnews.com/f8752c4f9a7f936a78cff2e7c3733cda",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cefeeae132674ffab79704209b1b0382/3000.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN",
      "description": "Areli Sanchez’s daughter, Aida, used to be one of 20 million American kids who ride a diesel bus to school each day. Aida has asthma. When she was little, she complained about the smell and cloud of fumes on her twice-daily trip.",
      "publishedAt": "2024-02-24T14:59:46Z",
      "title": "Tired of diesel fumes, these moms are pushing for electric school buses",
      "url": "https://apnews.com/4263455c7d55e34acd6f35dceb6db7c0",
      "urlToImage": ""
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — Warren Buffett credited his longtime partner — the late Charlie Munger — with being the architect of the Berkshire Hathaway conglomerate he's received the credit for leading and warned shareholders in his annual letter Saturday not to listen to Wall Street pundits or financial advisors who urge them to trade often.",
      "publishedAt": "2024-02-24T14:08:46Z",
      "title": "Warren Buffett uses his annual letter to warn about Wall Street and recount Berkshire's successes",
      "url": "https://apnews.com/41d58fcfe54fa1eba8f5492aac0542a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb539bd175ca4f38a445d751a45ca166/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "Since Netflix launched into original films, the streaming service has been an annual force in Hollywood's awards season. On Saturday, at the Screen Actors Guild Awards, it will play host, too.",
      "publishedAt": "2024-02-24T05:45:13Z",
      "title": "The SAG Awards will stream Saturday live on Netflix. Here's how to watch and what to know",
      "url": "https://apnews.com/0ef5ed6895af04c56237f07b138c8a61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c84eebde5fc04948ae0ff54e13b4d756/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}