{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump's order imposing new tariffs on 68 countries and the European Union starting in seven days has injected a new dose of uncertainty in an already uncertain process. Trump has promised these tariffs will boost the U.S. economy and create jobs, but critics warn they could harm America's global standing and increase inflation. The legality of the tariffs is being questioned in court, with judges expressing skepticism. Major companies have warned of financial impacts, and there are concerns about rising inflation and job losses in manufacturing.",
      "publishedAt": "2025-08-01T01:49:56Z",
      "title": "Trump injects new dose of uncertainty in tariffs as he pushes start date back to Aug. 7",
      "url": "https://apnews.com/article/trump-tariffs-effect-05bc12428163b9f28ef80f952cf9dafd",
      "urlToImage": "https://dims.apnews.com/dims4/default/32c5dc2/2147483647/strip/true/crop/1516x853+0+79/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F97%2F555a6fbb3113ead7aaefd4f423cf%2F0c74853e2f824205b5f9a528fac63f48"
    },
    {
      "author": null,
      "description": "President Donald Trump says there will be a 90-day negotiating period with Mexico after a call with that country’s leader, Claudia Sheinbaum, as the 25% tariff rates stay in place. Trump posted on Truth Social on Thursday his phone conversation with Sheinbaum was “very successful in that, more and more,\" they are \"getting to know and understand each other.” Trump says goods from Mexico imported into the U.S. would continue to face a 25% tariff he has ostensibly linked to fentanyl trafficking. The Republican president says autos would face a 25% tariffs, while copper, aluminum and steel would be taxed at 50%.",
      "publishedAt": "2025-07-31T15:15:07Z",
      "title": "Trump announces 90-day negotiating period with Mexico on tariffs",
      "url": "https://apnews.com/article/trump-tariffs-mexico-3b03b98296424e59c7dc19a865d21969",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb0a4f9/2147483647/strip/true/crop/4697x2642+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Fbe%2Fce85f03d3ea9cca2f765b5e09e56%2F12c52b8a660241b7ba3fc62aef2442f9"
    },
    {
      "author": null,
      "description": "A California judge is extending migrant status protections ended by the Trump administration for more than 60,000 people from Central America and Nepal. The order Thursday by U.S. District Judge Trina Thompson in San Francisco affects 7,000 Nepalese whose Temporary Protected Status designations were scheduled to expire Tuesday. About 51,000 people from Honduras and nearly 3,000 from Nicaragua were scheduled to have their status terminated in September. Homeland Security Secretary Kristi Noem ended the program after determining that conditions in their home countries no longer warranted protections. The National TPS Alliance is challenging the terminations as arbitrary and racist.",
      "publishedAt": "2025-08-01T00:20:05Z",
      "title": "Judge extends TPS for 60,000 from Central America and Nepal",
      "url": "https://apnews.com/article/trump-tps-nepal-honduras-nicaragua-noem-3a9de82ede381c6d969fd5aac13635f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f7b1d4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2F88%2Fb57bad21c9b54b0c266b8287d725%2Fac3a87103ef3441dbda6363bc23c6d4b"
    },
    {
      "author": null,
      "description": "President Donald Trump’s special envoy has arrived in Israel to address the worsening humanitarian crisis in Gaza. Over the past 24 hours, at least 91 Palestinians have been killed and more than 600 wounded while trying to get aid, according to the Gaza Health Ministry. The Israeli military has not commented on the strikes, stating it targets militants and blames civilian deaths on Hamas. The envoy, Steve Witkoff, plans to meet with Prime Minister Benjamin Netanyahu to discuss the situation and a possible ceasefire. Meanwhile, international pressure on Israel to increase aid continues to grow.",
      "publishedAt": "2025-07-31T12:37:05Z",
      "title": "Death toll rises in Gaza as Trump's envoy visits to discuss aid",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-07-31-2025-d9d578ecf303c0f4e8b14074eb980101",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb9a63c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fdc%2F78c0d5f0471302eef9db365ff3fe%2Fce82a63cfbb946e0b8b637fbc29f1d8a"
    },
    {
      "author": null,
      "description": "International outcry over images of emaciated children and increasing reports of hunger-related deaths have pressured Israel to let more aid into the Gaza Strip. This week, Israel paused fighting in parts of Gaza and airdropped food. But aid groups and Palestinians say the changes have only been incremental and are not enough to reverse what food experts say is a “worst-case scenario of famine” unfolding in the war-ravaged territory. The new measures have brought an uptick in the number of aid trucks entering Gaza. But almost none of it reaches U.N. warehouses for distribution.",
      "publishedAt": "2025-07-31T19:51:48Z",
      "title": "Why Israel's latest aid efforts in Gaza fall short of meeting the need",
      "url": "https://apnews.com/article/aid-gaza-starvation-famine-looting-9fc8e7a652c06d9ae505b43e0c399fc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/51b4f41/2147483647/strip/true/crop/4322x2431+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F94%2Facdcc0010ff0c5946a706dc4875d%2F407725a746e749f68f19aaa5c12b4607"
    },
    {
      "author": null,
      "description": "Two top leaders in a rural Texas county were asleep and a third was out of town in the initial hours of a catastrophic flood that caused widespread destruction and killed more than 130 people. Texas lawmakers began questioning local Kerr County officials over their preparedness and response to the deadly July 4 floods. Lawmakers have filed bills to address improving emergency communications and providing additional funding for affected areas. Republican lawmakers have been careful not to scrutinize the state’s response while emergency officials faced scrutiny from Democrats at a hearing last week.",
      "publishedAt": "2025-07-31T03:36:38Z",
      "title": "Texas county was missing key leaders when flooding first started",
      "url": "https://apnews.com/article/texas-floods-kerr-county-9f0f73636e1ff3bee0cb44befdef4497",
      "urlToImage": "https://dims.apnews.com/dims4/default/bcf46ce/2147483647/strip/true/crop/7876x4430+0+410/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F23%2F9f9e22ef833db4731942ddd9afc6%2Fb0d5626b8429425797d892fd58539947"
    },
    {
      "author": null,
      "description": "A father and mother who died on an Arkansas hiking trail were stabbed to death and a 28-year-old schoolteacher has been charged in the killings. Arkansas State Police Col. Mike Hagar said during a news conference Thursday that authorities are trying to determine a motive for the attack. They have no reason to believe Andrew James McGann knew the couple or their children. Clinton and Cristen Brink were found dead on a walking trail at Devil’s Den State Park on Saturday. Two of their three daughters who were with them at the time were not hurt in the attack.",
      "publishedAt": "2025-07-31T05:27:50Z",
      "title": "Arkansas teacher charged in the stabbing deaths of a couple at Devil's Den State Park",
      "url": "https://apnews.com/article/arkansas-devils-den-f4939dc9a3097e498fe98b655357e377",
      "urlToImage": "https://dims.apnews.com/dims4/default/c027f27/2147483647/strip/true/crop/7632x4293+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F2a%2F6a1809761a82c0cdda73404f85e7%2F515a9e42d79347ca9bdbae06470cebe9"
    },
    {
      "author": null,
      "description": "Strong storms with the potential to cause dangerous flash flooding are sparking flood watch alerts by the National Weather Service from northern Virginia to Connecticut. New Jersey Lt. Gov. Tahesha Way declared a state of emergency for the state in advance of the storms expected Thursday afternoon and evening. The National Weather Service says heavy to excessive rainfall and potentially severe thunderstorms are expected along the Washington-Philadelphia-New York City corridor. Flood watches were in effect until late Thursday and Friday, with 4 to 6 inches of rain possible in some areas. Some thunderstorms could produce strong winds and hail.",
      "publishedAt": "2025-07-31T17:53:37Z",
      "title": "Severe storms to bring heavy rain to the East Coast",
      "url": "https://apnews.com/article/storms-east-coast-flood-watch-5a8748ff2ddd561021d0d6471770192a",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Mourners packed a Bronx mosque to pay respects to a New York City police officer who was among the four people killed when a gunman opened fire this week at the Manhattan skyscraper that houses the NFL's offices. New York's mayor and governor were among those who remembered Officer Didarul Islam for his devotion to his family, faith and the police department. The police commissioner said the 36-year-old Bangladeshi immigrant described policing as “a blanket of the community, there to provide comfort and care,. Islam was a married father of two, with a third child on the way.",
      "publishedAt": "2025-07-31T03:50:33Z",
      "title": "NYPD officer killed in the attack at the NFL headquarters building is remembered for his service",
      "url": "https://apnews.com/article/new-york-city-office-shooting-police-funeral-214eb97d2143934190cf0f017bb60784",
      "urlToImage": "https://dims.apnews.com/dims4/default/f310cc2/2147483647/strip/true/crop/4800x2700+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2F11%2F7e8c5b5d0acf05f8328f34e66d81%2Fbbc0f523fcda4fe0ab15cce0f77575db"
    },
    {
      "author": null,
      "description": "Professional wrestler Hulk Hogan died of a heart attack last week. That's according to a medical examiner’s report released on Thursday. The report from the District Six Medical Examiner in Florida said that Hogan, whose real name was Terry Bollea, also previously had leukemia and an irregular heart rhythm. Hogan died July 24 in Florida at age 71. He was pronounced dead at a hospital less than 90 minutes after medics in Clearwater arrived at his home to answer a morning call about a cardiac arrest.",
      "publishedAt": "2025-07-31T17:01:16Z",
      "title": "Hulk Hogan died of a heart attack, medical examiner says",
      "url": "https://apnews.com/article/hulk-hogan-cause-of-death-heart-attack-0449e1dae512338e984340c393e50dd5",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6131a/2147483647/strip/true/crop/1807x1016+0+94/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2Fbb%2F944b60dce2173ba69683026567ee%2Fba8d4f311bd64227b722ce5036c0d3bd"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}