{
  "articles": [
    {
      "author": "STEVE PEOPLES",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump clinched their parties' presidential nominations Tuesday with decisive victories in a slate of low-profile primaries, setting up a general election rematch that many voters do not want.",
      "publishedAt": "2024-03-12T04:05:50Z",
      "title": "Biden and Trump clinch nominations, setting the stage for a grueling general election rematch",
      "url": "https://apnews.com/15bb0084ad656903ffef14cfae822abd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/106c5589330a4caa93df31a5b09f72f0/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "President Vladimir Putin said Wednesday that Russia is ready to use nuclear weapons if its sovereignty or independence is threatened, issuing another blunt warning to the West just days ahead of an election in which he’s all but certain to win another six-year term.",
      "publishedAt": "2024-03-13T06:40:03Z",
      "title": "Putin warns again that Russia is ready to use nuclear weapons if its sovereignty is threatened",
      "url": "https://apnews.com/82ced2419d93ae733161b56fbd9b477d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e10f8d5ced7d4847b06fa2d96d95e3bb/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Violent clashes overnight have left multiple Palestinians dead in the West Bank, and Israeli police say a Palestinian stabbed and wounded two people at a checkpoint near Jerusalem before being shot Wednesday.",
      "publishedAt": "2024-03-13T07:58:44Z",
      "title": "The Latest | Stabbing near Jerusalem after deadly violence erupts in the occupied West Bank",
      "url": "https://apnews.com/98e9588ce6815ae31d829e9695c29046",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9680dfd098284d569a05495b26892cb4/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — When Shawn Landis, an evangelical Christian from Pennsylvania, heard about the Oct. 7 Hamas attack on southern Israel, he knew he would come to Israel to volunteer as soon as it was safe.",
      "publishedAt": "2024-03-13T05:03:01Z",
      "title": "Evangelical Christians are fierce Israel supporters. Now they are visiting as war-time volunteers",
      "url": "https://apnews.com/462329e04459191fd6ae061e722cae30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/731c05574a74491481a77b70194c4e91/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Special counsel Robert Hur was thanking the president for his time. He understood, Hur said, that there were a lot of things going on that demanded Joe Biden’s attention.“We may be interrupted by one,” Biden said, explaining that he’d just gotten off the phone with Israeli Prime Minister Benjamin Netanyahu.",
      "publishedAt": "2024-03-13T04:02:15Z",
      "title": "Hur transcript reveals Biden presidency's profound and mundane moments",
      "url": "https://apnews.com/346b3538309207f23b3fd147b5ebeb34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/240630cf76d54051977c7f8969e2dc25/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — A bill that could lead to a ban of the popular video app TikTok in the United States is expected to pass the House on Wednesday as lawmakers act on concerns that the company's ownership structure is a threat to national security.",
      "publishedAt": "2024-03-13T04:05:02Z",
      "title": "House is likely to pass a bill that could ban TikTok, but it faces an uncertain path in the Senate",
      "url": "https://apnews.com/8fa7258fae1a4902d344c9d978d58a37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8b225cbf1c54818b9d9597a68e6cd20/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO and EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Politicians across Haiti are scrambling for power after Prime Minister Ariel Henry announced Tuesday that he would resign once a transitional presidential council is created.",
      "publishedAt": "2024-03-12T04:33:00Z",
      "title": "Haiti is preparing itself for new leadership. Gangs want a seat at the table",
      "url": "https://apnews.com/28acaecc1d80d993c99fe43a5e1e1f7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56f5dbb1be484170b667c56858edf671/1920.jpeg"
    },
    {
      "author": "RUSS BYNUM",
      "description": "SAVANNAH, Ga. (AP) — There was no green beer, no pickup trucks towing parade floats or throngs of tourists in gaudy green outfits. Instead, just a few dozen of Savannah's early Irish immigrants marched a half-mile from a hotel near the riverfront to attend a special service at what then was the city's only Roman Catholic church.",
      "publishedAt": "2024-03-13T04:27:09Z",
      "title": "Savannah plans a supersized 200th anniversary celebration of its beloved St. Patrick's Day parade",
      "url": "https://apnews.com/5ff1075fa42e99959ee16aff11774755",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2826c9f32e2b47fcb2158a5992cccba8/2100.jpeg"
    },
    {
      "author": "DENISE LAVOIE and LEA SKENE",
      "description": "RICHMOND, Va. (AP) — Employees of the Richmond Wildlife Center in Virginia are doing their best to act like mother foxes as they feed and care for an orphaned kit that found her way into their care.",
      "publishedAt": "2024-03-12T23:48:38Z",
      "title": "Staff at a Virginia wildlife center pretend to be red foxes as they care for an orphaned kit",
      "url": "https://apnews.com/3619d06c1c92e37bb9356108e74629b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4421aa849ac54bf98eda672200355800/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Muslims around the world are observing the holy month of Ramadan, with worship, charity, dawn-to-dusk fasting and nightly feasts.",
      "publishedAt": "2024-03-12T23:01:17Z",
      "title": "AP PHOTOS: Muslims around the world observe holy month of Ramadan with prayer, fasting",
      "url": "https://apnews.com/83ead097a3b0921f387bb70ad2b6b3fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eef5f6bb012444b4a068d213a875cd3c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}