{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and MARK SCOLFORO",
      "description": "ALTOONA, Pa. (AP) — The gun found on the man charged with killing United Healthcare’s CEO matched shell casings found at the site of the shooting, New York City’s police commissioner said Wednesday as authorities scrutinized evidence and the suspect's experiences with the victim's industry.",
      "publishedAt": "2024-12-11T05:07:34Z",
      "title": "Gun found on suspect in killing of UnitedHealthcare CEO matches shell casings at scene, police say",
      "url": "https://apnews.com/64ba21747f41c3a81f661900e797b6d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f18a92bf82ff45728637089b785bba40/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Palestinian medical officials say Israeli airstrikes have killed at least 28 people in the Gaza Strip, including seven children and a woman, hours after the U.N. General Assembly overwhelmingly approved a resolution demanding an immediate ceasefire in Gaza.",
      "publishedAt": "2024-12-12T07:37:57Z",
      "title": "Middle East latest: Israeli airstrikes kill 28 in Gaza, including 7 children, health officials say",
      "url": "https://apnews.com/b17c7ab064079d80fd006ab9d058966b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe898d0230344552b3e84e0c39e27c87/1920.jpeg"
    },
    {
      "author": "SALLY ABOU ALJOUD and LUJAIN JO",
      "description": "BEIRUT (AP) — Isatta Bah wakes up from a nap in a crowded shelter on the outskirts of Beirut, clutching her baby, Blessing.The 24-year-old from Sierra Leone spends her days waiting for an exit visa that could put her and her 1-year-old on a plane back to the West African nation.",
      "publishedAt": "2024-12-12T05:23:38Z",
      "title": "Migrant workers in Lebanon are trying to return home after alleged abuses and then war",
      "url": "https://apnews.com/9c696b80aa3bd5099ffc26394474d1fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/461d75c149fb49daaea8817a73007a7b/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden is commuting the sentences of roughly 1,500 people who were released from prison and placed on home confinement during the coronavirus pandemic and is pardoning 39 Americans convicted of nonviolent crimes.",
      "publishedAt": "2024-12-12T10:00:45Z",
      "title": "Biden commutes roughly 1,500 sentences and pardons 39 people in biggest single-day act of clemency",
      "url": "https://apnews.com/4432002d67334e6716c2776fd73f3cc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1831d1c2a5e04427947ac38eade15d07/2764.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, COLLEEN LONG and DAVID BAUDER",
      "description": "NEW YORK (AP) — Donald Trump used his image as a successful New York businessman to become a celebrity, a reality television star and eventually the president.",
      "publishedAt": "2024-12-11T17:50:53Z",
      "title": "Donald Trump will ring the New York Stock Exchange bell as he's named Time's Person of the Year",
      "url": "https://apnews.com/eb10badaba2347eeb3d44e7ddf805c88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5aca641397f4aa6ab8432329da5e107/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — President-elect Donald Trump said Wednesday that he's picking Kari Lake as director of Voice of America, installing a staunch loyalist who ran unsuccessfully for Arizona governor and a Senate seat to head the congressionally funded broadcaster that provides independent news reporting around the world.",
      "publishedAt": "2024-12-12T03:22:37Z",
      "title": "Trump taps immigration hard-liner Kari Lake as head of Voice of America",
      "url": "https://apnews.com/e894cf2e84791b35528baa0cbdd66b22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/101c1166aa1041dba0b11228df135856/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean President Yoon Suk Yeol defended his martial law decree as an act of governance and denied rebellion charges, vowing Thursday to “fight to the end” in response to attempts to impeach him and intensifying investigations into last week’s dramatic move.",
      "publishedAt": "2024-12-12T01:01:49Z",
      "title": "South Korea's Yoon defends martial law as an act of governance and vows to 'fight to the end'",
      "url": "https://apnews.com/76af91dfc6a252a536ee1d80c0bdfccd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c4fb26852f445a3b72091295522601b/1920.jpeg"
    },
    {
      "author": "MARK BANCHEREAU",
      "description": "DAKAR, Senegal (AP) — Mali’s armed forces, supported by Russian mercenaries, committed abuses against civilians since the withdrawal of a U.N.",
      "publishedAt": "2024-12-12T05:08:38Z",
      "title": "Rights group accuses Russian mercenaries of abuses against civilians in Mali",
      "url": "https://apnews.com/ee01ab840c6323c176ded02d1d7be5bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea6262206c4e4eedbc438fdbf6fd387c/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER WEBER, JAE C. HONG and GABRIELA AOUN ANGUEIRA",
      "description": "MALIBU, Calif. (AP) — Cooler temperatures, calmer winds and a chance of rainfall in Southern California this week are forecast to help firefighters as they battle a wind-driven blaze in steep, rugged terrain that's driven thousands, including celebrities, from their homes in Malibu.",
      "publishedAt": "2024-12-12T06:23:27Z",
      "title": "Southern California forecast of cool temps, calm winds to help firefighters battle Malibu blaze",
      "url": "https://apnews.com/fa7cd32cd116e21b6b0f4ab5145d8424",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14c0f3b78ccd4900b7a90c30ffb896bf/1920.jpeg"
    },
    {
      "author": "ROB MAADDI and AARON BEARD",
      "description": "Bill Belichick had seemingly been waiting for the right opportunity to return to an NFL sideline. Instead, the six-time Super Bowl-winning head coach is headed to the college ranks to take over at North Carolina.",
      "publishedAt": "2024-12-12T00:31:47Z",
      "title": "North Carolina announces 5-year deal with Bill Belichick to take over as coach of the Tar Heels",
      "url": "https://apnews.com/8d004be5ec1a4b55ba84adc75238c758",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b75d5664f9874d278de207d57c777aaf/2637.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}