{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump’s sentencing in his hush money case has been postponed until after the November election, granting the former president a hard-won reprieve as he navigates the homestretch of his current campaign and the aftermath of his criminal conviction.",
      "publishedAt": "2024-09-06T17:12:42Z",
      "title": "Judge delays Donald Trump’s sentencing in hush money case until after November election",
      "url": "https://apnews.com/be5a6fd3481055187543236c8dd3b045",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c68f8efd2e044d72ae838faaac2e8770/1920.jpeg"
    },
    {
      "author": "JILL COLVIN, MICHELLE L. PRICE and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Shortly after appearing in court for an appeal of a decision that found him liable for sexual abuse, Donald Trump stepped in front of television cameras Friday and brought up a string of past allegations of other acts of sexual misconduct, potentially reminding voters of incidents that were little-known or forgotten.",
      "publishedAt": "2024-09-06T15:06:37Z",
      "title": "Trump assails women who accused him of misconduct, days before his debate with Harris",
      "url": "https://apnews.com/5f5b808c6befaeaacc1d9c2071ebd631",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0deee8f4ec444328c7244e1a4576dab/3000.jpeg"
    },
    {
      "author": "MEAD GRUVER",
      "description": "CHEYENNE, Wyo. (AP) — Former Vice President Dick Cheney, a lifelong Republican, will vote for Kamala Harris for president, he announced Friday.",
      "publishedAt": "2024-09-06T19:50:00Z",
      "title": "Former Vice President Dick Cheney says he will vote for Kamala Harris",
      "url": "https://apnews.com/17304eb4f0c3faeabbc37c5da4b6bf51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f75bec321d047ce9b31a7f4be97a9fe/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and MATT BROWN",
      "description": "ANN ARBOR, Mich. (AP) — President Joe Biden on Friday signed an executive order for federal grants that will prioritize projects with labor agreements, wage standards, and benefits such as access to child care and apprenticeship programs.",
      "publishedAt": "2024-09-06T09:01:18Z",
      "title": "Biden signs 'common sense' order prioritizing federal grants for projects with higher worker wages",
      "url": "https://apnews.com/42dea47f3b51f480fdeef683b75726aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5339be828ff4ff2b46c214af9226890/3000.jpeg"
    },
    {
      "author": "JEFF AMY and JEFF MARTIN",
      "description": "WINDER, Ga. (AP) — The 14-year-old suspect in a shooting that killed four people at a Georgia high school and his father, who was arrested for allowing his son to have a weapon, will stay in custody after their lawyers decided not to seek bail Friday.",
      "publishedAt": "2024-09-06T04:44:27Z",
      "title": "Teen charged in Georgia school shooting and his father to stay in custody after hearings",
      "url": "https://apnews.com/e13b91e80c7fbefd7e3104e710afeb8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/150875a3ea284325bf7abd17b47f1091/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Just a couple of weeks ago, a special panel of Georgia state senators convened to study potential laws aimed at keeping firearms safely locked up and out of the hands of children.",
      "publishedAt": "2024-09-06T13:21:36Z",
      "title": "Georgia school shooting stirs debate about safe storage laws for guns",
      "url": "https://apnews.com/cbcf464d68dcf8266c6a40d84d7176c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bc3f6e4f4ca4969883c1918a3219122/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and AREF TUFANA",
      "description": "NABLUS, West Bank (AP) — Israeli soldiers killed an American woman demonstrating against settlements in the West Bank on Friday, according to two witnesses who said what began as a peaceful demonstration devolved into a clash between stone-throwing protesters and troops firing live ammunition.",
      "publishedAt": "2024-09-06T13:07:36Z",
      "title": "Israeli soldiers fatally shot an American woman at a West Bank protest, witnesses say",
      "url": "https://apnews.com/b2f1c741cea3d56eb1a339240dbf036e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0be6e6659b184c7494ddd921f8e3408d/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — Vice presidential candidate Tim Walz said Thursday that those protesting American support for Israel's war against Hamas in Gaza are doing so for “all the right reasons,\" as the Democratic ticket looks to balance its support for Israel with the humanitarian plight of civilians in the war-torn enclave.",
      "publishedAt": "2024-09-06T17:16:15Z",
      "title": "Walz says Gaza demonstrators are protesting for 'all the right reasons' while condemning Hamas",
      "url": "https://apnews.com/fd797e42ad3c919026c5341ae4297500",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/649594cf0dab403b81c3627ba7d6d6b7/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, ALANNA DURKIN RICHER and CAL WOODWARD",
      "description": "WASHINGTON (AP) — Inside Washington’s federal courthouse, there’s no denying the reality of Jan. 6, 2021. Day after day, judges and jurors silently absorb the chilling sights and sounds from television screens of rioters beating police, shattering windows and hunting for lawmakers as democracy lay under siege.",
      "publishedAt": "2024-09-06T07:00:26Z",
      "title": "January 6 crimes did happen. Court cases, video and thousands of pages of evidence prove it",
      "url": "https://apnews.com/4839d3db7a153541fd9402068c870d9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8bfc2e909104a9f831344c9a7b1b0ec/3000.jpeg"
    },
    {
      "author": "JOHN RABY",
      "description": "CLARKSBURG, W.Va. (AP) — A former Mafia hitman already serving life in prison was sentenced to 25 years Friday in the 2018 fatal prison bludgeoning of notorious Boston gangster James “Whitey” Bulger.",
      "publishedAt": "2024-09-06T05:01:33Z",
      "title": "A hitman serving life in prison gets more time for killing ‘Whitey’ Bulger",
      "url": "https://apnews.com/9487e4e369ffb12f639322d0f9c6baf0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0883131d29664f3e89fa1d92d008e216/2860.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}