{
  "articles": [
    {
      "author": "SILVIA STELLACCI and COLLEEN BARRY",
      "description": "VATICAN CITY (AP) — Pope Francis in his traditional Christmas message on Wednesday urged “all people of all nations” to find courage during this Holy Year “to silence the sounds of arms and overcome divisions” plaguing the world, from the Middle East to Ukraine, Africa to Asia.",
      "publishedAt": "2024-12-25T09:17:25Z",
      "title": "Pope calls for nations to overcome divisions in Christmas address as communities celebrate worldwide",
      "url": "https://apnews.com/189cce9b0fb73af2a02d117bcad8d4da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84b5195a482f44a89b4d51f3a9b045d1/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Azerbaijan on Thursday observed a nationwide day of mourning for the victims of the air crash that killed 38 people and left all 29 survivors injured as speculation mounted about a possible cause of the crash that remained unknown.",
      "publishedAt": "2024-12-26T09:43:12Z",
      "title": "Azerbaijan observes day of mourning for air crash victims as speculation mount about its cause",
      "url": "https://apnews.com/872800d95273ee96e0950192a32e5228",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c223c8b5811d4f338230f6b266354384/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The fate of President-elect Donald Trump’s Cabinet is still unclear after Republican senators spent much of December carefully dodging questions about Robert F.",
      "publishedAt": "2024-12-25T12:19:03Z",
      "title": "Fate of Trump's Cabinet picks unclear as Republicans prepare to take power in Senate",
      "url": "https://apnews.com/b123a8612121b6e34ed015cbb6ac4dc0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ea17ea660624ead9a8531afdf5cf69b/2240.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "ORLANDO, Fla. (AP) — A man accused of attempting to assassinate President-elect Donald Trump in South Florida won't be tried until September 2025, a federal judge ruled this week.",
      "publishedAt": "2024-12-25T17:26:45Z",
      "title": "Trial of man accused in Trump assassination attempt in Florida pushed back to September",
      "url": "https://apnews.com/56bccedcae955f4db74613d49c7b7262",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/750af7c4a4604f21866c8d5243525c84/2187.jpeg"
    },
    {
      "author": "SAM MEDNICK, TIA GOLDENBERG and FATMA KHALED",
      "description": "JERUSALEM (AP) — A baby girl froze to death overnight in Gaza, while Israel and Hamas accused each other of complicating ceasefire efforts that could wind down the 14-month war.",
      "publishedAt": "2024-12-25T14:47:32Z",
      "title": "A baby froze to death overnight in Gaza as Israel and Hamas trade accusations of ceasefire delays",
      "url": "https://apnews.com/be8508e8a1a89343b94e963137e42d5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5834e40f0e1445578178d3290157a266/1920.jpeg"
    },
    {
      "author": "SAM MCNEIL",
      "description": "MODIIN, Israel (AP) — For more than 400 days after being critically wounded during Hamas’ Oct. 7, 2023, attack on southern Israel, Yona Brief tried to recover. But after losing both legs and enduring medically induced comas, the combat medic died in late November.",
      "publishedAt": "2024-12-25T08:49:24Z",
      "title": "An Israeli soldier who died 417 days after his Oct. 7 wounds has become a symbol of sacrifice",
      "url": "https://apnews.com/11f076ba459453f4ee9e4f046537873f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90f61a9ce7994d87a0abe7ba20f8caaf/1920.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "As the U.S. Census Bureau gets public feedback about how it should tally people into new race and ethnicity groups, the agency has released new research reflecting how U.S.",
      "publishedAt": "2024-12-25T05:03:03Z",
      "title": "US census data shows how Middle Eastern and Hispanic residents differ in racial identity",
      "url": "https://apnews.com/ea8d2cda1d63695d6a4b3029a0706af4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38bd150df90043999a4bb6ac787d4a0b/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russia launched a massive missile and drone barrage targeting Ukraine's energy infrastructure on Wednesday, striking a thermal power plant and prompting Ukrainians to take shelter in metro stations on Christmas morning.",
      "publishedAt": "2024-12-25T08:27:44Z",
      "title": "Russia targets Ukrainian energy infrastructure on Christmas Day",
      "url": "https://apnews.com/906dafcdbc66bc4976b0428a5cc0d263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15ef40930dfe4735ab7e82455559c52c/2000.jpeg"
    },
    {
      "author": "RIAZ KHAN and MUNIR AHMED",
      "description": "PESHAWAR, Pakistan (AP) — Pakistan’s airstrikes on eastern Afghanistan killed 46 people, mostly women and children, a Taliban government official said Wednesday, raising fears of further straining relations between the two neighbors.",
      "publishedAt": "2024-12-25T09:36:47Z",
      "title": "Taliban say Pakistani airstrikes killed 46 people in eastern Afghanistan, mostly women and children",
      "url": "https://apnews.com/1eb6ebd92403795d03856b1b97cac0da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/383628517cab4c84ae828b41d352d5c0/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Blake Lively’s claims that “It Ends With Us” director and co-star Justin Baldoni unleashed a smear campaign against her have gained support from a new lawsuit that Baldoni’s former publicist filed against him.",
      "publishedAt": "2024-12-25T19:54:49Z",
      "title": "Blake Lively's claims that movie co-star launched smear campaign gets support in publicist's suit",
      "url": "https://apnews.com/db7ba52a04919dbf8fe7b914e612300a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a215f9cdc754483ad6938fd8e4c052b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}