{
  "articles": [
    {
      "author": "LEA SKENE and BRIAN WITTE",
      "description": "BALTIMORE (AP) — Teams of engineers are now focused on the formidable job of hauling the shattered remains of the Francis Scott Key Bridge out of Maryland’s Patapsco River, the first step toward reopening the Port of Baltimore and recovering the bodies of four workers who are still missing and presumed dead.",
      "publishedAt": "2024-03-30T04:04:36Z",
      "title": "At collapsed Baltimore bridge, focus shifts to the weighty job of removing the massive structure",
      "url": "https://apnews.com/3edebfb3b7fb48fd81be81cf69ebfbf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47e9928fabe447b3837fbdb92493e6ac/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and RICHARD LARDNER",
      "description": "With the 95,000-ton cargo ship Dali powerless and hurtling helplessly toward the Francis Scott Key Bridge, the harbor pilot commanding the vessel had just minutes to make his last, desperate attempts to avoid disaster.",
      "publishedAt": "2024-03-29T16:57:33Z",
      "title": "Could tugboats have helped avert the bridge collapse tragedy in Baltimore?",
      "url": "https://apnews.com/33e1b42c7e0cd9a558d3732ffdaa6220",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6346e7b5f5dc40b88ed0a32c87e76cdd/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israel's Supreme Court ruling curtailing subsidies for ultra-Orthodox men has rattled Prime Minister Benjamin Netanyahu's governing coalition and raised questions about its viability as the country presses on with the war in Gaza.",
      "publishedAt": "2024-03-30T04:27:25Z",
      "title": "Israel's high court says the government must stop funding seminaries. Could that topple Netanyahu?",
      "url": "https://apnews.com/1536d26e9a2720d19210f513697ff5ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0eaa96422264ab79819c92cd1de6a56/3000.jpeg"
    },
    {
      "author": "MITCH WEISS and KRISTIN M. HALL",
      "description": "BRISTOL, Tenn. (AP) — It was in the den that Karen Goodwin most strongly felt her son’s presence: On the coffee table were his ashes, inside a clock with its hands forever frozen at 12:35 a.m., the moment that a doctor had pronounced him dead.",
      "publishedAt": "2024-03-29T10:04:12Z",
      "title": "For years she thought her son had died of an overdose. The police video changed all that",
      "url": "https://apnews.com/e318b9b7c8e673f2a5f8e0c1174ccb93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7aeca25d781a43d290ac1ebdffccb021/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — President Joe Biden’s reelection campaign is raising gobs of cash.",
      "publishedAt": "2024-03-30T04:05:32Z",
      "title": "President Joe Biden is lapping Donald Trump when it comes to campaign cash — and he'll need it",
      "url": "https://apnews.com/9c0a1daa97da1ab2945ae3254333eac8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1da6a47d496745d9a69bb8ffb59b3825/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "The largest uranium producer in the United States is ramping up work just south of Grand Canyon National Park on a long-contested project that largely has sat dormant since the 1980s. The work is unfolding as global instability and growing demand drive uranium prices higher.",
      "publishedAt": "2024-03-30T04:16:32Z",
      "title": "Uranium is being mined near the Grand Canyon as prices soar and the US pushes for more nuclear power",
      "url": "https://apnews.com/98d43974de13924fb3c36f62b55f53b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cb50b4fe78345cabb8c94b55ef44357/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Japanese government health officials raided a factory Saturday producing health supplements that they say have killed at least five people and hospitalized more than 100 others.About a dozen people wearing dark suits solemnly walked into the Osaka plant of Kobayashi Pharmaceutical Co. in the raid shown widely on Japanese TV news, including public broadcaster NHK.",
      "publishedAt": "2024-03-30T03:55:48Z",
      "title": "Japanese authorities raid a factory making health supplements linked to 5 deaths",
      "url": "https://apnews.com/a6c881aff4c4cc67627d09af269a45a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b09e6d88da842bcabfa4a708bbbc9eb/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD, ANDREW MEDICHINI, SILVIA STELLACCI and ARITZ PARRA",
      "description": "ROME (AP) — Pope Francis skipped the traditional Good Friday procession at Rome’s Colosseum to protect his health, the Vatican said, making a last-minute decision that added to concerns about his frail condition during a particularly busy period.",
      "publishedAt": "2024-03-29T20:29:06Z",
      "title": "Pope skips Good Friday event to preserve health ahead of Easter, Vatican says",
      "url": "https://apnews.com/a36f1533f9716933ba4965663fa4dd7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0af6dcbc138946f8a39fe747022510a5/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Climate change is making giant heat waves crawl slower across the globe and they are baking more people for a longer time with higher temperatures over larger areas, a new study finds.",
      "publishedAt": "2024-03-29T18:12:08Z",
      "title": "Study says since 1979 climate change has made heat waves last longer, spike hotter, hurt more people",
      "url": "https://apnews.com/797aae046df8165f5f8be7d3f40a8b74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c480701a81f14eefbecf1e9c4d96c915/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — Louis Gossett Jr., the first Black man to win a supporting actor Oscar and an Emmy winner for his role in the seminal TV miniseries “Roots,” has died.",
      "publishedAt": "2024-03-29T12:57:15Z",
      "title": "Louis Gossett Jr., 1st Black man to win supporting actor Oscar, dies at 87",
      "url": "https://apnews.com/1e86e1441ec8b614a282f3de22490a07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d64ce47929147978aabcdd0cd7a0130/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}