{
  "articles": [
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — A jury convicted a movie weapons supervisor of involuntary manslaughter Wednesday in the fatal shooting of a cinematographer by actor Alec Baldwin during a rehearsal on the set of the Western movie “Rust.”",
      "publishedAt": "2024-03-06T19:20:54Z",
      "title": "'Rust' armorer convicted of involuntary manslaughter in fatal shooting by Alec Baldwin on movie set",
      "url": "https://apnews.com/3fdc75c2510804065a19a9fa374cfefd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/343ea8b9d88643d88381bf6c930b6e9a/1920.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Alabama Gov. Kay Ivey signed legislation into law Wednesday shielding in vitro fertilization providers from potential legal liability raised by a court ruling that equated frozen embryos to children.",
      "publishedAt": "2024-03-06T06:01:46Z",
      "title": "Alabama governor signs legislation protecting IVF providers from legal liability into law",
      "url": "https://apnews.com/cab8171e80c88a088778dc7a187b7b5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac34968751524046864f9df4b909d47d/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and STEVE PEOPLES",
      "description": "WASHINGTON (AP) — The third-party presidential movement No Labels is planning to move toward fielding a presidential candidate in the November election, even as high-profile contenders for the ticket have decided not to run, two people familiar with the matter said Wednesday.",
      "publishedAt": "2024-03-07T01:10:58Z",
      "title": "Third-party group No Labels is expected to move forward with a 2024 campaign, AP sources say",
      "url": "https://apnews.com/ea3f28a5e35f0789e873ac42369b0a77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27dc77db37784b2e8abe325685dff6c5/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and WAFAA SHURAFA",
      "description": "RAFAH, Gaza Strip (AP) — Efforts to get desperately needed humanitarian aid to war-wracked northern Gaza gained momentum Wednesday with the European Union increasing pressure for the creation of a sea route from Cyprus to Gaza and British Foreign Minister David Cameron saying that Israel’s allies were losing patience.",
      "publishedAt": "2024-03-06T18:31:08Z",
      "title": "Pressure grows on Israel to open more aid routes into Gaza by land and sea as hunger worsens",
      "url": "https://apnews.com/3e4bc85bc4e184312763fc331fbffedb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/341e42df725447daa4d7b2953ad4b736/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL and TARA COPP",
      "description": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen's Houthi rebels on a commercial ship in the Gulf of Aden on Wednesday killed three of its crew members and forced survivors to abandon the vessel, the U.S.",
      "publishedAt": "2024-03-06T01:23:36Z",
      "title": "Houthi missile attack kills 3 crew members in Yemen rebels' first fatal assault on shipping",
      "url": "https://apnews.com/89c5440d9943216a787b39912bd969e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d412abc8acb438082ae569d68d4e656/891.jpeg"
    },
    {
      "author": "EILEEN NG",
      "description": "KUALA LUMPUR, Malaysia (AP) — Over the past decade, Grace Subathirai Nathan graduated from law school, got married, opened a law firm and had two babies. But part of her is frozen in time, still in denial over the loss of her mother on a missing Malaysia Airlines plane in 2014.",
      "publishedAt": "2024-03-07T02:21:19Z",
      "title": "Frozen in time: Families of those on missing Flight 370 cannot shake off their grief without answers",
      "url": "https://apnews.com/e3a5a40ed7fc49cca79871583c236209",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36a0c827a00b41afa0ea395153fad87a/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — Former Honduran President Juan Orlando Hernández took the witness stand in his defense at his New York trial on Tuesday, denying that he teamed up with drug dealers to protect them in return for millions of dollars in bribes.",
      "publishedAt": "2024-03-05T18:53:38Z",
      "title": "Ex-Honduran president defends himself at New York drug trafficking trial",
      "url": "https://apnews.com/7fe5042423fe1124ac85eccaf08e40c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c8c219ebb43424b93f008d39e279c98/3000.jpeg"
    },
    {
      "author": "EVENS SANON and BERT WILKINSON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haitian politicians started pursuing new alliances Wednesday, seeking a coalition that could lead the country out of the gang violence that has fueled lawlessness, closed the main airport and prevented embattled Prime Minister Ariel Henry from returning home.",
      "publishedAt": "2024-03-06T15:17:47Z",
      "title": "Politicians seek new alliances to lead Haiti as gangs take over and premier tries to return home",
      "url": "https://apnews.com/da9914daa7530f7fd46684378dceb1c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf9434b63df74fe8a0c1a9f2550809c4/1920.jpeg"
    },
    {
      "author": "ADAM BEAM",
      "description": "SACRAMENTO, Calif. (AP) — A wealthy campaign donor of California Gov. Gavin Newsom said the Panera Bread restaurants he owns will start paying workers at least $20 an hour on April 1 after controversy over whether a new state minimum wage law for fast food workers applies to his businesses.",
      "publishedAt": "2024-03-06T21:36:14Z",
      "title": "Gov. Gavin Newsom's campaign donor says his Panera Bread restaurants will follow minimum wage law",
      "url": "https://apnews.com/faca8695e96b0f3224da2ba6d0657e3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4a66878a37e41ec96eb385dbbad8a9d/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "WASHINGTON (AP) — A woman ascends toward the heights of American politics, with the nation's top elected office — the presidency — looming far out of reach. A man at the bottom predicts, unhelpfully: “You'll never make it, sister!”",
      "publishedAt": "2024-03-06T16:30:55Z",
      "title": "Haley's exit from the GOP race pushes off — again — the day Americans could elect a woman president",
      "url": "https://apnews.com/36f6361c31a8216a0aaa4815f57dd51d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71062144ba5f41a99e2d7a54670ea7b3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}