{
  "articles": [
    {
      "author": "ALBERT STUMM",
      "description": "Prince Bhojwani never thought of himself as a negative person, until three trips to the hospital in one month forced him to reconsider.Before May 2018, he was a healthy but chronically worried start-up founder who regularly did 20-mile (32-kilometer) bike rides.",
      "publishedAt": "2024-06-08T04:04:54Z",
      "title": "Here's how you can improve your health by stopping negativity and embracing optimism",
      "url": "https://apnews.com/39fb842af1cf9c08fe5c0bfa0ac368ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2448b9393a6a4bdbac6ccaa53c27a507/2192.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, MICHAEL KUNZELMAN, RANDALL CHASE and ALANNA DURKIN RICHER",
      "description": "WILMINGTON, Del. (AP) — Jurors in Hunter Biden’s gun trial began deliberating Monday whether the president’s son is guilty of federal firearms charges over a revolver he bought in 2018 when prosecutors say he was addicted to crack cocaine.",
      "publishedAt": "2024-06-10T04:21:11Z",
      "title": "Jurors in Hunter Biden’s gun trial begin deliberating whether he’s guilty of federal firearm charges",
      "url": "https://apnews.com/774dd2f5661b246085c7409139dedaef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69a9016644604d589f6029aa0071fa80/1920.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "CUPERTINO, Calif. (AP) — Apple has jumped into the race to bring generative artificial intelligence to the masses, spotlighting a slew of features Monday designed to soup up the iPhone, iPad and Mac.",
      "publishedAt": "2024-06-10T04:08:47Z",
      "title": "Apple leaps into AI with an array of upcoming iPhone features and a ChatGPT deal to smarten up Siri",
      "url": "https://apnews.com/4217d67977f95ead880835a71ecce098",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8e81e844947478d9bee864d6b8d9ff5/3000.jpeg"
    },
    {
      "author": "GREGORY GONDWE and GERALD IMRAY",
      "description": "BLANTYRE, Malawi (AP) — Soldiers are searching mountainous forests near a city in northern Malawi after a military plane carrying the country's vice president and a former first lady went missing in the area Monday, President Lazarus Chakwera said.",
      "publishedAt": "2024-06-10T16:19:30Z",
      "title": "Soldiers in Malawi search for missing military plane carrying vice president and former first lady",
      "url": "https://apnews.com/2850e56f58e4635b3aeadc205713947f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95a9ac8e62b54101bfebca731a3886dd/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.N. Security Council on Monday overwhelmingly approved its first resolution endorsing a cease-fire plan aimed at ending the eight-month war between Israel and Hamas in Gaza.",
      "publishedAt": "2024-06-10T17:05:48Z",
      "title": "UN Security Council adopts a cease-fire resolution aimed at ending Israel-Hamas war in Gaza",
      "url": "https://apnews.com/834734f606a5245cc46a2487a70ae3fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e2db10132644d0fa214fbd3e59f2548/3000.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — The main shipping channel into Baltimore’s port has fully reopened to its original depth and width following the March 26 collapse of the Francis Scott Key Bridge, which blocked most maritime traffic into the harbor.",
      "publishedAt": "2024-06-10T23:08:03Z",
      "title": "Baltimore shipping channel fully reopens after bridge collapse",
      "url": "https://apnews.com/cf12f3b3e2914efa05a91dd399b0dd64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97c0b60d4f3343d6a308dd2ff816f75d/3000.jpeg"
    },
    {
      "author": "LORNE COOK",
      "description": "BRUSSELS (AP) — A four-day election has shaken the foundations of the European Union, with the far right rocking ruling parties in France and Germany, the bloc’s traditional driving forces.",
      "publishedAt": "2024-06-10T08:10:28Z",
      "title": "The main takeaways after the far right rocks European politics, sparking a snap election in France",
      "url": "https://apnews.com/f3823de802e9a90570abc53e7f6b6931",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e7b8283f40340f7ac6f62eb45cb10b9/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — A closely watched Alzheimer's drug from Eli Lilly won the backing of federal health advisers on Monday, setting the stage for the treatment's expected approval for people with mild dementia caused by the brain-robbing disease.",
      "publishedAt": "2024-06-10T20:05:28Z",
      "title": "Alzheimer's drug that can slow disease gets backing from FDA advisers",
      "url": "https://apnews.com/2e86433bf976fc627a7a81e3c58da2ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c412715b6ca4fc08032e056e06fd533/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER WEBER, TRAVIS LOLLER and ADRIAN SAINZ",
      "description": "LOS ANGELES (AP) — The Rev. James Lawson Jr., an apostle of nonviolent protest who schooled activists to withstand brutal reactions from white authorities as the Civil Rights Movement gained traction, has died, his family said Monday.",
      "publishedAt": "2024-06-10T19:27:57Z",
      "title": "The Rev. James Lawson Jr. has died at 95, civil rights leader's family says",
      "url": "https://apnews.com/d0abdb6dda2a4d0597e47fea48f161a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e634b63db2b4e569564ab2db88d940d/1920.jpeg"
    },
    {
      "author": "LEANNE ITALIE",
      "description": "NEW YORK (AP) — As a city kid, Amy Attas had big dreams of roaming the countryside, healing animals a la James Herriot's classic “All Creatures Great and Small.”",
      "publishedAt": "2024-06-10T12:25:18Z",
      "title": "This NYC vet makes house calls. In 'Pets and the City,' she's penned a memoir full of tails",
      "url": "https://apnews.com/5fc3d81e2437cfa76dd53ecb66b9abf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6299e2a1d854c3b92ca04614f25232c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}