{
  "articles": [
    {
      "author": "NICHOLAS RICCARDI and BRIAN SLODYSKO",
      "description": "MILWAUKEE (AP) — The Republican National Convention marched into its second day Tuesday, showcasing classic GOP themes like border security and public safety that have become the centerpieces of former President Donald Trump's campaign.",
      "publishedAt": "2024-07-17T02:29:05Z",
      "title": "Unity at the RNC, knocks on Trump's prosecutions and Senate politics: Takeaways from day 2",
      "url": "https://apnews.com/73281582594bb4548c0272c00c8f5d93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da401c75c7a94adbb6658d1fc86b33c6/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, ZEKE MILLER and WILL WEISSERT",
      "description": "LAS VEGAS (AP) — President Joe Biden returned to the campaign trail on Tuesday for the first time since the attempted assassination of Donald Trump, continuing his calls to calm the divisive rhetoric on both sides but also arguing that doing so \"doesn’t mean we should stop telling the truth” about his Republican rival.",
      "publishedAt": "2024-07-16T09:03:10Z",
      "title": "Biden says cooling political rhetoric doesn't mean he'll 'stop telling the truth' about Trump",
      "url": "https://apnews.com/3f9386fae612adbb7630bad3c62b683d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b5130278c1b40a787dae08cc64dc659/3000.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER, MARTHA BELLISLE, JIM MUSTIAN and PETER SMITH",
      "description": "BETHEL PARK, Pa. (AP) — After three days, an enigmatic portrait emerged of the 20-year-old man who came close to killing former President Donald Trump with a high-velocity bullet: He was an intelligent loner with few friends, an apparently thin social media footprint and no hints of strong political beliefs that would suggest a motive for an attempted assassination.",
      "publishedAt": "2024-07-17T04:01:35Z",
      "title": "Three days after attempted assassination, Trump shooter remains an elusive enigma",
      "url": "https://apnews.com/08e925cb85e52c5266878cd76e796ad2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac840f318bfa4b24a6974effe34fa936/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — Dr. Hassan Hamdan was one of the few trained plastic surgeons in Gaza, a specialist in wound reconstruction. His skills were vitally needed as Israel’s military onslaught filled hospitals with patients torn by blasts and shrapnel, so the 65-year-old came out of retirement to help.",
      "publishedAt": "2024-07-17T04:02:19Z",
      "title": "As Gaza’s doctors struggle to save lives, many lose their own in Israeli airstrikes",
      "url": "https://apnews.com/72e511121502914a76ac9b03030b5c98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2258ebbff8340c2ac0b90749eaef960/2000.jpeg"
    },
    {
      "author": "ABDEL KEREEM HANA, WAFAA SHURAFA, and DREW CALLISTER",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza. Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.",
      "publishedAt": "2024-07-17T03:35:00Z",
      "title": "A Gaza father mourns his baby boy, killed in bed by an Israeli airstrike",
      "url": "https://apnews.com/81c6480635f860c485b66d5454e948ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c4c2d0ac0894471a1c0b803f7dd1f19/3000.jpeg"
    },
    {
      "author": "BARRY HATTON and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — After almost 30 months of war with Russia, Ukraine’s difficulties on the battlefield are mounting even as its vital support from the United States is increasingly at the mercy of changing political winds.",
      "publishedAt": "2024-07-17T05:01:46Z",
      "title": "Ukraine faces twin challenges of fighting Russia and shifting political sands in the US",
      "url": "https://apnews.com/db70c6c00b77e048d61b52c904b8c2a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aaae053a8be34145857b239e451cebbc/3000.jpeg"
    },
    {
      "author": null,
      "description": "BANGKOK (AP) — The chief of the Thai police forensic division said Wednesday that police have found traces of cyanide in the cups of six people found dead in a central Bangkok luxury hotel.",
      "publishedAt": "2024-07-17T05:19:10Z",
      "title": "Traces of cyanide discovered alongside 6 victims found dead in a Bangkok hotel room, Thai police say",
      "url": "https://apnews.com/795719445377c5be993a792aeba48586",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af2d34ef067a4ec885dc63cd15f09453/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Britain’s new Labour Party government campaigned on a promise to bring bold change at modest cost.",
      "publishedAt": "2024-07-17T04:17:37Z",
      "title": "UK's new Labour government sets out plans to 'take the brakes off' the economy in King's Speech",
      "url": "https://apnews.com/11a7ca8b4a7c2f452daa542103a9e11a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82052e7d87164058883504d395920135/3000.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "CIUDAD NEZAHUALCOYOTL, Mexico (AP) — Last year, the Hernández Pacheco family began to notice a number of Haitians arriving at an apartment across the street from their medical clinic on the outskirts of Mexico City.",
      "publishedAt": "2024-07-17T04:03:58Z",
      "title": "With Haitian migration growing, a Mexico City family of doctors is helping out",
      "url": "https://apnews.com/8e759bc1fca270ec4d276881e1ae45ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a239354802643ae855b0424f164d75e/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — With no clear successor to “Succession,” the drama field could be wide open when nominations for the Emmy Awards are announced on Wednesday morning.",
      "publishedAt": "2024-07-17T04:05:35Z",
      "title": "'Shogun' could rise and 'The Bear' may feast as Emmy nominations are announced",
      "url": "https://apnews.com/9fb103d953536e223a35e5f4bfd0e1db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77d2b100212843ba953d7750632a5357/2702.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}