{
  "articles": [
    {
      "author": "MICHAEL LIEDTKE",
      "description": "U.S. regulators want a federal judge to break up Google to prevent the company from continuing to squash competition through its dominant search engine after a court found it had maintained an abusive monopoly over the past decade.",
      "publishedAt": "2024-11-21T04:01:31Z",
      "title": "US regulators seek to break up Google, forcing Chrome sale as part of monopoly punishment",
      "url": "https://apnews.com/84e07fec51c5c59751d846118cb900a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26ddd32ffc40438ca117f857e5efea19/3000.jpeg"
    },
    {
      "author": "MARTHA BELLISLE, HALLIE GOLDEN and LISA BAUMANN",
      "description": "ISSAQUAH, Wash. (AP) — A major storm battered the U.S. Northwest with strong winds and rain, causing widespread power outages, closing schools and downing trees that killed at least two people.",
      "publishedAt": "2024-11-20T07:01:30Z",
      "title": "'Bomb cyclone' kills 2 and knocks out power to over half a million homes across the US Northwest",
      "url": "https://apnews.com/aadbd4863dd989189d31c1c2187b5025",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77bd75bc372048de87339f6d23f31bc7/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, STEPHEN GROVES and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Ethics Committee Republicans voted Wednesday against releasing the panel’s long-running investigation into President-elect Donald Trump’s nominee for attorney general, former Rep.",
      "publishedAt": "2024-11-20T16:58:00Z",
      "title": "Republicans on House Ethics reject for now releasing report on Matt Gaetz",
      "url": "https://apnews.com/5f9c684bb695df143beffbf8f956b09c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43ae43bd99084652a2c09d9203000aab/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ZEKE MILLER and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — As senators prepare to consider President-elect Donald Trump's picks for his Cabinet, they may be doing so without a well-established staple of the confirmation process: an FBI background check.",
      "publishedAt": "2024-11-20T19:42:00Z",
      "title": "Lawmakers are concerned about background checks of Trump's Cabinet picks as red flags surface",
      "url": "https://apnews.com/ac9afcd41d598a62ae34442ecf96a652",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c17eb3ecd29a4957907ad63763376412/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — An Indian businessman who is one of the world’s richest people has been indicted in the U.S. on charges he duped investors by concealing that his company's huge solar energy project on the subcontinent was being facilitated by an alleged bribery scheme.",
      "publishedAt": "2024-11-20T21:10:46Z",
      "title": "US charges billionaire Gautam Adani with defrauding investors, hiding plan to bribe Indian officials",
      "url": "https://apnews.com/9f4c7ff20e7a47ae560c2ad72f4dda44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5e655fdfdcb4efa872f5435179d2543/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — Israeli officials demanded Wednesday the freedom to strike Lebanon's Hezbollah as part of any cease-fire deal, raising a potential complication as a top U.S.",
      "publishedAt": "2024-11-20T15:09:55Z",
      "title": "Israeli officials demand the right to strike Hezbollah under any cease-fire deal for Lebanon",
      "url": "https://apnews.com/1b39fe8499097c2f2579fce50d083263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03c9055296b4433b8a2537a5c6fb9a10/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. decision to provide Ukraine with antipersonnel land mines expands the use of a weapon that the international community has long condemned because of its danger to innocent civilians.",
      "publishedAt": "2024-11-20T18:43:07Z",
      "title": "The US is sending antipersonnel land mines to Ukraine. Here's what it means",
      "url": "https://apnews.com/76fb21ce12f70aa965d3d7fbccb35c9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/606e7b52322e4c13a6e3db76ce3c60ea/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden has been notably quiet since the Democrats' gut-wrenching defeat at the polls. After warning voters for years that a Donald Trump win would be calamitous for American democracy, Biden has gone largely silent on his concerns about what lays ahead for America and he has yet to substantively reflect on why Democrats were decisively defeated up and down the ballot.",
      "publishedAt": "2024-11-20T22:10:31Z",
      "title": "Biden has become notably quiet after the 2024 election and Democrats' loss",
      "url": "https://apnews.com/49f2146c848656c9588986e83812b6d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/feacf2b64352443688e0f98acd978bbe/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS and MAKIYA SEMINERA",
      "description": "COLUMBIA, S.C. (AP) — A parole board decided unanimously Wednesday that Susan Smith should remain in prison, despite her plea that God has forgiven her for infamously killing her two young sons 30 years ago by rolling her car into a South Carolina lake while they were strapped in their car seats.",
      "publishedAt": "2024-11-20T05:02:59Z",
      "title": "Susan Smith is denied parole 30 years after drowning 2 sons by rolling car into South Carolina lake",
      "url": "https://apnews.com/3c7c12e0cd0a23eee0e42a599b689597",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f250e97da8f4a3f87a581789b22d9c9/1920.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "Chris Stapleton took home four Country Music Association Awards and hardly left the stage on Wednesday night, while an absent Morgan Wallen was shut out all evening until taking the night's biggest prize, entertainer of the year.",
      "publishedAt": "2024-11-20T05:24:40Z",
      "title": "Chris Stapleton wins 4 CMA Awards, but Morgan Wallen gets entertainer of the year",
      "url": "https://apnews.com/32859c3a9f19a64df6fbffe1ff20b302",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a71ed5fd12b4a9baa6718da2440b6f3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}