{
  "articles": [
    {
      "author": "JAKE OFFENHARTZ, KAREN MATTHEWS and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Investigators are searching for clues that could help them identify the masked gunman who stalked and killed the leader of one of the largest U.S.",
      "publishedAt": "2024-12-05T05:10:29Z",
      "title": "Police hunt for the gunman who killed UnitedHealthcare's boss in Manhattan",
      "url": "https://apnews.com/7f6581ba6b0b520938d82c361e77a83c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9b1df71c98c4ae9a5e7becb8ac9b3de/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s president replaced his defense minister Thursday as opposition parties moved to impeach both men over the stunning-but-brief imposition of martial law that brought armed troops into Seoul streets.",
      "publishedAt": "2024-12-05T01:50:27Z",
      "title": "Yoon replaces the defense minister as South Korea's parliament moves to vote on their impeachments",
      "url": "https://apnews.com/8e1ffc82990d6bdce8d80dffc3815f62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8273102dc33a4dfeaefde05250989000/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli strike on a tent camp housing displaced people in southern Gaza killed at least 21 people and wounded 28 on Wednesday, said the director of Nasser Hospital, Atif al-Hout, in the nearby city of Khan Younis.",
      "publishedAt": "2024-12-04T09:26:43Z",
      "title": "Middle East latest: An Israeli strike on a Gaza tent camp kills at least 21 people",
      "url": "https://apnews.com/1369e179a32e5272ac99f6818f69cb8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/556609cff825444c8ab16ea06441e2d7/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Amnesty International accused Israel of committing genocide in the Gaza Strip during its war with Hamas, saying it has sought to deliberately destroy Palestinians by mounting deadly attacks, demolishing vital infrastructure and preventing the delivery of food, medicine and other aid.",
      "publishedAt": "2024-12-05T00:03:00Z",
      "title": "Amnesty International says Israel is committing genocide in Gaza. Israel rejects the allegations",
      "url": "https://apnews.com/19aa8fb76f7271942e73d5d7a42434e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de870ad706c74328affe3c508684bf41/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIRUT (AP) — Syrian insurgents said Thursday they have entered parts of the central city of Hama after three days of intense clashes with government forces on its outskirts, part of an ongoing offensive in which they seized Syria's largest city of Aleppo.",
      "publishedAt": "2024-12-05T10:08:51Z",
      "title": "Syrian insurgents say they have entered the city of Hama after fierce fighting",
      "url": "https://apnews.com/0189297bbdc76eee67cb4fdc62136bef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/494f11acbf33481c8339ea9e1515e409/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — President-elect Donald Trump campaigned on the promise that his policies would reduce high borrowing costs and lighten the financial burden on American households.But what if, as many economists expect, interest rates remain elevated, well above their pre-pandemic lows?",
      "publishedAt": "2024-12-05T08:00:26Z",
      "title": "Why Trump and the Federal Reserve could clash in the coming years",
      "url": "https://apnews.com/ec0eac23ffc0181cbc9b7312d2ee438f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c755bea321cc4991ba5c905af937a824/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "NEW YORK (AP) — Bitcoin has topped the $100,000 mark as a massive rally in the world's most popular cryptocurrency sparked by the election of Donald Trump rolls on. The milestone comes just hours after the President-elect signaled a lighter regulatory approach to the crypto industry when he said he intends to nominate cryptocurrency advocate Paul Atkins to be the next chair the Securities and Exchange Commission.",
      "publishedAt": "2024-12-05T03:16:17Z",
      "title": "Bitcoin tops $100,000 as big rally sparked by Trump election win rolls on",
      "url": "https://apnews.com/c45a747d9c32591bc4e5dcd6e5cc0c22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b819030e84c4b3894fef09e0d174f94/3000.jpeg"
    },
    {
      "author": "ADRIAN SAINZ, JONATHAN MATTISE and ALANNA DURKIN RICHER",
      "description": "MEMPHIS, Tenn. (AP) — The fatal beating of Tyre Nichols by officers after he ran away from a traffic stop in January 2023 exposed serious problems in the Memphis Police Department, from the use of excessive force to its mistreatment of Black people in the majority-Black city, a federal investigation has found.",
      "publishedAt": "2024-12-05T08:39:29Z",
      "title": "Justice Department and the city of Memphis to address results of scathing police investigation",
      "url": "https://apnews.com/be8957ed6b228bcd4a93a9f11ebee4b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42271c2fe93744a5838318111befb3f2/3000.jpeg"
    },
    {
      "author": "EVELYNE MUSAMBI and DESMOND TIRO",
      "description": "NAIROBI, Kenya (AP) — Growing up on the semi-arid plains of eastern Kenya, Evans Munzaa had planned his future. He envisioned an information technology job, a wife and two children by age 30.",
      "publishedAt": "2024-12-05T05:26:04Z",
      "title": "Some young Kenyans turn to kung fu for self-improvement in difficult times",
      "url": "https://apnews.com/25a59638933ff53483cb32d8e97d0f72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e93295a57f9e468ca458c0970a20cf40/3000.jpeg"
    },
    {
      "author": null,
      "description": "PALERMO, Calif. (AP) — Two children were in “extremely critical condition” Wednesday after being shot at a tiny religious K-8 school in Northern California and the gunman died at the scene, apparently from a self-inflicted gunshot, police said.",
      "publishedAt": "2024-12-05T08:08:35Z",
      "title": "2 kindergarteners wounded and gunman dead after shooting at California religious school",
      "url": "https://apnews.com/1a183fcd1670d47dedeff81d9f1ce492",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e3513fa7a7d43d3a5e6597df9813e4c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}