{
  "articles": [
    {
      "author": "GERALD IMRAY",
      "description": "Groups representing some of South Africa’s white minority have responded to a plan by U.S. President Donald Trump to offer them refugee status and resettlement in the United States by saying: thanks, but no thanks. The plan was detailed in an executive order Trump signed Friday that stopped all aid and other financial assistance to South Africa as punishment for what his administration said were “rights violations” against white South Africans. The South African government denies it. Two of the most prominent groups representing Afrikaners said Saturday they are here to stay, but thanked Trump for raising their issues.",
      "publishedAt": "2025-02-08T15:44:24Z",
      "title": "Trump says some white South Africans are oppressed and could be resettled in the US. They say no thanks",
      "url": "https://apnews.com/article/trump-south-africa-afrikaners-0120efec17122b47e3371e0e39fe1db8",
      "urlToImage": "https://dims.apnews.com/dims4/default/9d8ae7a/2147483647/strip/true/crop/4205x2365+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2Fe0%2F6245833f772feedd0622dcb3a7d3%2F25f71951df3e41a6ac24ac101dbadc5c"
    },
    {
      "author": "MELISSA GOLDIN",
      "description": "False and misleading social media posts are circulating online as the Trump administration moves to dismantle the U.S. Agency for International Development. They raise questions about funding for certain projects and organizations, often claiming without evidence that the money was used inappropriately. White House Press Secretary Karoline Leavitt said to reporters on Tuesday, for example, that USAID had spent $70,000 for the production of a “DEI musical” in Ireland; $47,000 for a “transgender opera” in Colombia, $32,000 for a “transgender comic book” in Peru. USAID did not fund those programs. They were awarded by the Department of State's Office of the Under Secretary for Public Diplomacy and Public Affairs.",
      "publishedAt": "2025-02-07T20:56:01Z",
      "title": "False and misleading social media posts about USAID funding are spreading online",
      "url": "https://apnews.com/article/usaid-funding-trump-musk-misinformation-c544a5fa1fe788da10ec714f462883d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb80598/2147483647/strip/true/crop/4788x2693+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2F04%2F2f2336329934e6a1b86830591205%2F7f9b3da86dab46a3b01c2e8dc778494b"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "Forced leaves have begun in Washington and worldwide for most employees of the U.S. Agency for International Development. Under a Trump administration plan, the agency is to be left with fewer than 300 workers out of many thousands. The leaves at USAID started Friday. Federal workers associations have turned to the courts to try to roll back orders dismantling most of the agency and U.S.- funded aid programs around the world. It's not clear whether the reduction to 300 would be permanent or temporary, potentially allowing more workers to return after what Trump administration says is a review of the aid and development programs it wants to resume.",
      "publishedAt": "2025-02-07T13:55:18Z",
      "title": "Forced leaves start for thousands at USAID under a Trump plan to gut the foreign aid agency",
      "url": "https://apnews.com/article/usaid-foreign-aid-trump-rubio-48f8460804d33bdaa18d7765c4b24f9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/75a7e4b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F06%2F50d0ce2890d770e8b85e9bdc4574%2F786b30dbc5b847ecadb76eeabd1c5461"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "A federal judge has blocked Elon Musk’s Department of Government Efficiency from accessing Treasury Department records that contain sensitive personal data such as Social Security and bank account numbers for millions of Americans. U.S. District Judge Paul Engelmayer issued the order early Saturday after 19 Democratic attorneys general sued President Donald Trump. The case alleges the Trump administration allowed Musk’s team access to the Treasury Department’s central payment system in violation of federal law. Musk’s Department of Government Efficiency was created to discover and eliminate what the Trump administration has deemed to be wasteful government spending.",
      "publishedAt": "2025-02-08T00:06:40Z",
      "title": "Federal judge blocks Elon Musk's DOGE from accessing sensitive records",
      "url": "https://apnews.com/article/elon-musk-doge-lawsuit-attorneys-general-5733f8985e4cf7ad5b233fddefef4d01",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b5d9bd/2147483647/strip/true/crop/5652x3179+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F7d%2F2f6dfa75e820e887756123a5e9f0%2Ff628a3db342e445b98c6f04b3f277d40"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "Iowa Sen. Joni Ernst has hailed Elon Musk and the Trump administration’s Department of Government Efficiency. So has Iowa Gov. Kim Reynolds. Their constituents are following the cost-cutting effort closely. Unlike their top elected officials, several of the constituents are expressing concerns. Some question the delivery of government services or whether Musk has the necessary authority. Others back Musk, saying his action is needed given the risk of doing nothing to sharply curb federal spending.",
      "publishedAt": "2025-02-07T05:02:52Z",
      "title": "Are Americans paying attention to Musk and Trump's DOGE? Here's what people in Iowa had to say",
      "url": "https://apnews.com/article/trump-doge-iowa-elon-musk-joni-ernst-29c2756648bc889a33dbc0a0fd9cc05d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5fd1388/2147483647/strip/true/crop/5319x2992+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2Fa9%2F0e8f612af5e1b6620c5fda851c1d%2F07456cc00d5149d79c443ba5e47dfa40"
    },
    {
      "author": "WAFAA SHURAFA, MOHAMMAD JAHJOUH, TIA GOLDENBERG",
      "description": "Hamas-led militants have released three gaunt, frail-looking Israeli hostages and Israel freed 183 Palestinian prisoners in the fifth exchange of a ceasefire agreement that has paused the war in Gaza. The hostages’ condition and scenes of Hamas forcing them to speak in the handover sparked outrage in Israel. It could increase pressure on Prime Minister Benjamin Netanyahu to extend the ceasefire beyond its current six-week phase. U.S. President Donald Trump’s stunning proposal to transfer the Palestinian population out of Gaza does not appear to have affected the truce's current phase. But it could complicate talks over the second and more difficult one.",
      "publishedAt": "2025-02-08T04:17:11Z",
      "title": "Israel confirms it has received 3 hostages freed by Hamas",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-08-2025-bf94014ccedeb15b4d235a1df57b563a",
      "urlToImage": "https://dims.apnews.com/dims4/default/189a088/2147483647/strip/true/crop/5700x3206+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Ff1%2F5a3b2f25e9a9e05e9d20fb85851f%2Fd5366490090d455b8682ff2d136f42e9"
    },
    {
      "author": "ANDRE MUGGIATI",
      "description": "The waters of Cape Cod Bay are coming for the big brown house perched on a sandy bluff high above the beach. It’s just a matter of when. The luxury house near Wellfleet, Massachusetts, is expected to tumble into the bay sometime in the next three years as erosion gnaws away at the bluff. The owner removed parts of the house before stopping work. He’s since sold the place to a salvage company, his attorney said, that says it won’t pay to remove it. Town officials worry the home's collapse will damage delicate beds in their harbor where farmers grow the famed Wellfleet oyster. The home's certain fate is a reminder of the fragility of building along the cape, where thanks to climate change sea level rise has accelerated in recent years.",
      "publishedAt": "2025-02-05T14:31:26Z",
      "title": "A multimillion-dollar home is close to falling into the Cape Cod Bay. What happens next?",
      "url": "https://apnews.com/article/wellfleet-cape-cod-erosion-seashore-house-2e2ad831ac97e19b7ddfbb577ab84c79",
      "urlToImage": "https://dims.apnews.com/dims4/default/5eaf24f/2147483647/strip/true/crop/4000x2250+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2F46%2F35b4dfea1f7e41415c33d40b9215%2F5645329b902942c582184577ca8f4323"
    },
    {
      "author": "CEDAR ATTANASIO",
      "description": "New York City is trying to deter dangerous “subway surfing” through education programs, but some transportation advocates and lawmakers say it's not enough. They say making trains harder to climb and train surfers more easy to detect might need to be part of the solution. One subway driver says locking the doors at the ends of train cars might help prevent people from climbing onto the roof. Six people died surfing New York City subway trains last year, which was one more than in 2023. The NYPD reported that arrests of alleged subway surfers rose to 229 last year, up from 135 the year before. The youngest was 9 years old.",
      "publishedAt": "2025-02-07T05:18:34Z",
      "title": "Kids in New York keep dying while 'subway surfing' on top of trains. Can they be stopped?",
      "url": "https://apnews.com/article/subway-surfing-nyc-deaths-tiktok-41a85ff57f1d2493a52679a9fc6fd367",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcb4b0c/2147483647/strip/true/crop/7957x4476+0+415/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F9e%2Fce5cb6562cb85e0ba36d86933c49%2F95352c18edfe4621a1ba22e2dafef62d"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "Israel has released 183 Palestinian prisoners in the latest exchange for Israeli hostages held in Gaza, part of a ceasefire that has paused the war but whose future is uncertain. Israel views the prisoners as terrorists, while Palestinians see them as freedom fighters resisting a decadeslong military occupation. Nearly every Palestinian has a friend or family member who has been jailed by Israel at some point, for militant attacks or lesser offenses such as rock-throwing, protesting or membership in a banned political group. Some are held for months or years without trial.",
      "publishedAt": "2025-02-08T11:40:46Z",
      "title": "Who are the Palestinian prisoners released in exchange for Israeli hostages?",
      "url": "https://apnews.com/article/palestinian-prisoners-gaza-ceasefire-israel-hamas-080ad5704f8e4763f28a94274d9efa2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7cebbb9/2147483647/strip/true/crop/5500x3094+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2Fc8%2F80cbe298e7f3081979d294e0650d%2F1d2b96b4a5c04fbd85f3014ea315eee0"
    },
    {
      "author": "OLGA R. RODRIGUEZ, TERRY CHEA, MAKIYA SEMINERA",
      "description": "President Donald Trump’s order declaring diversity, equity and inclusion policies illegal has thrown into doubt the future of research Kendra Dahmer has been doing on intestinal parasites in India and Benin. Dahmer, a postdoctoral researcher at the University of California, Berkeley, has a grant from the National Institutes of Health. She also received diversity-based funding as the first college graduate in her family and a woman in science. The grant is supposed to cover her research through the summer of 2026, but now she wonders if that will be possible.",
      "publishedAt": "2025-02-08T05:02:40Z",
      "title": "Trump's DEI order leaves academic researchers fearful of political influence over grants",
      "url": "https://apnews.com/article/trump-academic-research-funding-dei-5c8f89118da6c9604329120a576ba183",
      "urlToImage": "https://dims.apnews.com/dims4/default/a77bbd9/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F02%2Fa3f1237f2d119e5f9fc2a44d10fe%2F3ddbf55e5f5b4953b0ffbcfaf19307aa"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}