{
  "articles": [
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump isn’t known for letting slights pass.Yet for weeks, the famously combative presumptive Republican nominee has sat silently — to the point of sometimes seeming asleep — in a sterile Manhattan courtroom amid a barrage of accusations and insults.",
      "publishedAt": "2024-05-24T04:07:17Z",
      "title": "Trump swaps bluster for silence, and possibly sleep, in his hush money trial",
      "url": "https://apnews.com/25ebe6e0d4c3a0aac938ef55ffd681a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/224129f3612d4d6e9e363ec801508238/2000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — As he tries to secure his legacy, President Joe Biden has unleashed a flurry of election-year rules on the environment and other topics, including a landmark regulation that would force coal-fired power plants to capture smokestack emissions or shut down.",
      "publishedAt": "2024-05-24T04:04:24Z",
      "title": "'Green blitz': As election nears, Biden pushes slew of rules on environment, other priorities",
      "url": "https://apnews.com/fec31a2f2198b776c5f24d2d9f66684b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99175255d60d440e9c6d89d5c565d852/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "The NCAA and the nation's five biggest conferences announced Thursday night that they have agreed to pay nearly $2.8 billion to settle a host of antitrust claims, a monumental decision that sets the stage for a groundbreaking revenue-sharing model that could start steering millions of dollars directly to athletes as soon as the 2025 fall semester.",
      "publishedAt": "2024-05-23T23:48:39Z",
      "title": "NCAA, leagues back $2.8 billion settlement, setting stage for current, former athletes to be paid",
      "url": "https://apnews.com/b6ff58d62f93359789dde1626f827bf1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5af5ad7af7e14ad88d2ab4d69dd7a6f5/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER SHERMAN",
      "description": "MEXICO CITY (AP) — President Andrés Manuel López Obrador swept into office nearly six years ago with a simple motto laying out his administration’s priorities: “For the good of all, first the poor.”",
      "publishedAt": "2024-05-24T04:28:34Z",
      "title": "Mexico's poorest receiving less government funds under president who brought poor to the fore",
      "url": "https://apnews.com/182061c29209528ea5553ce89d6db09c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/266a68229eac4030a50977f6a9dbf8df/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "It began last month with the arrest of a Russian deputy defense minister. Then the head of the ministry’s personnel directorate was hauled into court.",
      "publishedAt": "2024-05-24T04:24:31Z",
      "title": "Top Russian military officials are being arrested. Why is it happening?",
      "url": "https://apnews.com/5557e109f658ba727b19acb10fe95d68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea100a487c7b4ca09a029578c6c3bac9/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and MARGERY A. BECK",
      "description": "GREENFIELD, Iowa (AP) — The skies were blue and the wind was blowing as residents of the small city of Greenfield, Iowa, worked to clean up two days after a destructive tornado ripped apart more than 100 homes in just one minute, took the lives of four residents and injured at least 35 more.",
      "publishedAt": "2024-05-24T05:00:25Z",
      "title": "More severe weather forecast in Midwest as Iowa residents clean up tornado damage",
      "url": "https://apnews.com/3d67033f4275a0db321c9c39673931c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24da3b8cbe7546ed90288eed420a2528/1920.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — More than 100 people are believed to have been killed Friday in a landslide that buried a village in a remote part of Papua New Guinea, Australian Broadcasting Corp.",
      "publishedAt": "2024-05-24T04:08:19Z",
      "title": "More than 100 people believed killed by a landslide in Papua New Guinea, Australian media report",
      "url": "https://apnews.com/86fcf41e600122fd54ddcfb56bcab403",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "TAIPEI, Taiwan (AP) — Taiwan tracked dozens of Chinese warplanes and navy vessels off its coast Friday on the second day of a large exercise China's People’s Liberation Army held in response to the inauguration of the island’s new leadership.",
      "publishedAt": "2024-05-24T02:50:38Z",
      "title": "Taiwan tracks dozens of Chinese warplanes and navy vessels off its coast on 2nd day of drills",
      "url": "https://apnews.com/b7ebf10c18a40417b8017510b833224d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff94afbcbc704f2aa95830108d770f37/1920.jpeg"
    },
    {
      "author": "SEBABATSO MOSAMO, FARAI MUTSAKA and GERALD IMRAY",
      "description": "LILANDA, Zambia (AP) — Extreme weather events have hit parts of Africa relentlessly in the last three years, with tropical storms, floods and drought causing crises of hunger and displacement.",
      "publishedAt": "2024-05-24T05:22:18Z",
      "title": "Extreme weather. A lack of lifesaving vaccines. Africa's cholera crisis is worse than ever",
      "url": "https://apnews.com/8eaaa62265fe93c8a7243b2ea6ce89a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d39cd239523545488b86fc6c3ce459bb/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER and LINDSAY WHITEHURST",
      "description": "WILMINGTON, Del. (AP) — Attorneys for Hunter Biden are due in court Friday for the final hearing before the president's son is expected to stand trial on federal firearms charges in Delaware as his father's reelection campaign unfolds.",
      "publishedAt": "2024-05-24T04:03:21Z",
      "title": "Hunter Biden's lawyers expected in court for final hearing before June 3 gun trial",
      "url": "https://apnews.com/61ae47f6c9296f02d1462d82b1a47897",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c59b8090f09466694c03c76df1e5998/1549.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}