{
  "articles": [
    {
      "author": null,
      "description": "Israeli troops have opened fire on Palestinians near food distribution hubs in southern Gaza, killing at least 32 people. Witnesses say the shootings happened Saturday as crowds approached centers run by the U.S.- and Israeli-backed Gaza Humanitarian Foundation. The foundation, established to replace U.N.-led aid efforts, claims Hamas diverts supplies, a charge the U.N. denies. Local health officials report hundreds have died near these hubs in recent months. Gaza faces a dire humanitarian crisis, with over 2 million residents on the brink of famine. The ongoing conflict has caused massive casualties and displacement, with no progress in ceasefire talks.",
      "publishedAt": "2025-07-19T09:08:38Z",
      "title": "Over 30 Palestinians killed trying to reach US group's food distribution sites, Gaza authorities say",
      "url": "https://apnews.com/article/israel-hamas-gaza-ghf-mideast-war-e3eead77195dc9c4dd07ac5fe640d00e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a09b987/2147483647/strip/true/crop/5108x2873+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Fc5%2Fadfaf9b6d45b1b697522493358d3%2Fd73c9bfec8d54b439ce020ed515a80fe"
    },
    {
      "author": null,
      "description": "Syria’s interim President Ahmad al-Sharaa has urged Sunni Bedouin tribes to honor a ceasefire aimed at ending deadly clashes with Druze-linked militias Sweida. The violence has left hundreds dead and drawn Israeli airstrikes targeting Syrian forces. Al-Sharaa blamed \"armed groups from Sweida” for reigniting the conflict on Thursday and criticized Israeli intervention. A separate U.S.-brokered ceasefire was announced early Saturday between Syria and Israel, but tensions remain high. Al-Sharaa emphasized unity, vowing to protect minorities and thanking the U.S. and Arab mediators for their support during Syria’s ongoing crisis.",
      "publishedAt": "2025-07-19T10:54:57Z",
      "title": "Syria's interim president urges Bedouin tribes to commit to ceasefire ending clashes with the Druze",
      "url": "https://apnews.com/article/syria-ahmad-sharaa-druze-bedouins-clashes-israel-1804408501f1de8e7a6050cafcad799f",
      "urlToImage": "https://dims.apnews.com/dims4/default/80a27ae/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F27%2F5e736cef5a2ec3c1ced34cd4e6cf%2F2d40a944638f44c68e6418f8e268dee0"
    },
    {
      "author": null,
      "description": "When House Speaker Mike Johnson gifted to President Donald Trump the gavel used to enact the Republicans' tax breaks and spending bill, it was a memorable moment at the White House. The image from the bill signing on Independence Day underscored the symbolic transfer of political power from a compliant Congress to the White House during Trump's second term. Since Trump’s return to office in January, the Republicans in control of Congress have shown an unusual willingness to give the president of their party what he wants. And that poses a risk to Congress, an equal branch of government but one the Founding Fathers placed first in the Constitution.",
      "publishedAt": "2025-07-19T12:44:50Z",
      "title": "Trump is chiseling away at the power of a compliant Congress",
      "url": "https://apnews.com/article/trump-congress-compliant-ceding-power-republicans-4508b5e6f893da17e9064426e6fefc6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a25bbd/2147483647/strip/true/crop/2825x1589+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F5b%2F9fd719f84999ac37bb7aa2147d5d%2Fd5286240b8d34b61b8ad903358af6876"
    },
    {
      "author": null,
      "description": "The Los Angeles Fire Department reports a vehicle has driven into a crowd in East Hollywood, injuring over 20 people. The incident happened on Santa Monica Boulevard. Authorities said Saturday that up to five people are in critical condition, with 8 to 10 others seriously injured. Another 10 to 15 are reported to be in fair condition. Emergency responders are on the scene, and investigations are ongoing.",
      "publishedAt": "2025-07-19T10:43:14Z",
      "title": "Vehicle drives into crowd in East Hollywood, injuring more than 20",
      "url": "https://apnews.com/article/los-angeles-car-into-crowd-east-hollywood-74109553b3f12ded236dc4e2d72c919b",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Russia has launched a massive overnight drone and missile attack on Ukraine, killing at least one person. Ukrainian President Volodymyr Zelenskyy said over 300 drones and 30 cruise missiles were fired during the attack overnight into Saturday, with Odesa heavily targeted. The city's mayor said one person died, and five were rescued from a fire in a high-rise building. Six others, including a child, were wounded. Critical infrastructure in the Sumy region was also damaged. Analysts note Russia has intensified its drone attacks, with barrages now surpassing previous records in scale and frequency.",
      "publishedAt": "2025-07-19T08:36:08Z",
      "title": "Russia pounds Ukraine with over 300 drones, killing 1 in Odesa",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-odesa-zelenskyy-621c5e482c5f5cb38d56b4be0c59d622",
      "urlToImage": "https://dims.apnews.com/dims4/default/b3b4ed4/2147483647/strip/true/crop/2000x1125+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F9d%2F1d62e85a6984403185e910c8bc4f%2Fbd2bb990ef3a4d1c857a2eefd176a82c"
    },
    {
      "author": null,
      "description": "Moving at the “speed of Trump” is one of the White House’s favorite phrases, but when it comes to presidential travel, Donald Trump’s pace is about the same as that of his Democratic predecessor, Joe Biden. By his six-month mark in office on July 20, Trump will have made 49 trips to 14 states and seven foreign countries. That’s not far off from Biden's pace. The Democrat made 45 trips to 17 states and three foreign countries early in his presidency during the pandemic. Trump’s second-term travel is also less prolific than his first, at least in terms of visiting different parts of the United States.",
      "publishedAt": "2025-07-19T12:20:45Z",
      "title": "Trump's travel pace largely mirrors Biden's, with more sports events and golf",
      "url": "https://apnews.com/article/trump-presidential-travel-biden-first-six-months-c619e9e39f2f57081ce7d29c3f986acc",
      "urlToImage": "https://dims.apnews.com/dims4/default/1061f73/2147483647/strip/true/crop/2357x1326+162+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Ffc%2F1be364fdc0394b83af50f8c3c498%2F18a7d52732c34136b92a2b083ebdadd0"
    },
    {
      "author": null,
      "description": "Authorities are investigating a Southern California couple after their infant child was taken to a hospital with a traumatic head injury and 21 children were discovered in their custody. Many of the children were born by surrogate, and at least eight women have spoken out on social media about the couple aggressively pursuing them or misleading them in the surrogacy process. Charges have not been filed against Silvia Zhang and Guojun Xuan, but detectives are still investigating the couple for potential child abuse. The couple did not respond to phone calls and emails seeking comment.",
      "publishedAt": "2025-07-19T04:07:06Z",
      "title": "Surrogates speak out about California couple under investigation",
      "url": "https://apnews.com/article/california-couple-investigation-kids-surrogates-360635ce8dba2ff31f09506c15aa539a",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dc64e3/2147483647/strip/true/crop/5280x2970+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Fe0%2Fcc766dfc14b00d5235a08f08902d%2Fc8ee06289d964effbff7776729971bdb"
    },
    {
      "author": null,
      "description": "State media in Vietnam have reported that 18 people were killed and nearly two dozen others are missing after a tourist boat capsized during a sudden thunderstorm. The capsizing on Saturday afternoon occurred during a sightseeing excursion. The reports said that the Wonder Sea boat was carrying 48 passengers and five crew members during the tour of Ha Long Bay. The destination is a popular destination for visitors. VNExpress newspaper reported that rescue workers saved 12 people and recovered the 18 bodies near the site of the capsizing. Twenty-three people were still missing. The newspaper said that the boat turned upside down because of strong winds. A 14-year-old boy was among the survivors and he was rescued four hours after being trapped in the overturned hull.",
      "publishedAt": "2025-07-19T14:08:08Z",
      "title": "Tourist boat capsizes during a thunderstorm in Vietnam, leaving 18 dead and 23 missing",
      "url": "https://apnews.com/article/vietnam-tourist-boat-capsized-ha-long-bay-75b00eb19792f355efcda286d3a60c0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c7b855/2147483647/strip/true/crop/2711x1525+0+142/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F45%2F0bb0c723bb9785c3928aee8ca7e2%2F680dca14afad42218d07bf1f03a6dab3"
    },
    {
      "author": null,
      "description": "Three Democratic-led states that led the way in offering free health care to low-income people who are in the U.S. without legal permission are either limiting or ending the programs because of significant budget concerns. Minnesota stopped coverage for adults, and Illinois ended its program for people ages 42-64. California will cap enrollment starting next year. Doctors and advocates say it will only cost states more in the long run because more people will end up in hospitals. The Trump administration has shared Medicaid enrollment data with U.S. Immigration and Customs Enforcement officials.",
      "publishedAt": "2025-07-19T13:01:48Z",
      "title": "Medicaid for immigrants in US illegally being limited or ended in 3 states",
      "url": "https://apnews.com/article/medicaid-immigrants-california-illinois-minnesota-ice-f43d5681a6e9d45d274790c2eae716ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/8bf6681/2147483647/strip/true/crop/4107x2310+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F82%2F1ae63c2e6a311257456c3cbfe153%2F6db3a86796b14285a8fa61a6011333bf"
    },
    {
      "author": null,
      "description": "Newer airport screening machines that operate like medical CT scanners are better at spotting liquid explosives, but many airports still lack that expensive equipment. So security experts remain concerned about vulnerabilities that were exposed by a thwarted 2006 bombing plot that led to restrictions on the amount of liquids in travelers' carry-on bags. Only 255 of the United States' 432 airports have the new screening machines. The United Kingdom was planning to relax its liquid rules last year, but that was delayed because several major airports still lacked the new machines.",
      "publishedAt": "2025-07-19T13:08:33Z",
      "title": "New airport screening machines can better detect explosives, but they are not everywhere yet",
      "url": "https://apnews.com/article/airport-liquids-tsa-kristi-noem-homeland-security-6b904af29658f740e57e6f94a2ac12bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/148db27/2147483647/strip/true/crop/3888x2187+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F69%2F2b089ac1b53cf70efc62ad4c4d27%2Fba765178ada74908a826b226aa538d54"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}