{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump says he's not planning to extend a 90-day pause on tariffs on most nations beyond July 9. He says his administration will notify countries that the trade penalties will take effect unless there are deals with the United States. During a wide-ranging interview with Fox News Channel's “Sunday Morning Futures,” the Republican president also said a group of investors will step forward within weeks to announce a plan to buy TikTok. And he floated the idea of giving some relief to hotels and farms reeling from immigration raids.",
      "publishedAt": "2025-06-29T17:28:42Z",
      "title": "Trump says he's not planning to extend a tariffs pause beyond July 9",
      "url": "https://apnews.com/article/trump-tariffs-china-tiktok-iran-immigration-trade-9041fa893f99cfba5eb3663749dd10d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b7e666/2147483647/strip/true/crop/4290x2413+0+223/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fd4%2F745bde5de8af81f37e1be93803ec%2F769af5a146ca43839e6f81278cf53ecc"
    },
    {
      "author": null,
      "description": "Russia has launched its biggest aerial attack against Ukraine overnight. The escalating bombing campaign has further dashed hopes for a breakthrough in efforts to end the 3-year-old war. Ukraine’s air force says the assault involved 537 aerial weapons including drones and missiles, of which 249 were intercepted and 226 were likely jammed. The strikes targeted several regions, including western Ukraine, far from the front lines. Officials confirmed two deaths, one in Kherson and another in the Kharkiv region. Ukraine’s air force said one of its F-16 warplanes supplied by its Western partners crashed after sustaining damage while shooting down air targets. The pilot died.",
      "publishedAt": "2025-06-29T07:04:20Z",
      "title": "Ukraine says Russia launches biggest aerial attack since war began",
      "url": "https://apnews.com/article/russia-ukraine-war-biggest-aerial-attack-9fda235a9345d506cf6c796ddfa80e33",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6dce5f/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2Fb1%2F8b863b0952c4e46954f040e9ec8a%2Fukr-war-smila-attack-20250629cr-1920x1080.jpg"
    },
    {
      "author": null,
      "description": "Iran’s judiciary reports that at least 71 people were killed in Israel's attack on Tehran’s Evin prison. The attack occurred Monday and targeted several prison buildings. A judiciary spokesperson said Sunday that the dead included staff, soldiers, prisoners and visiting family members. Rights groups have raised concerns about inmate safety following the incident. Iran also confirmed Sunday that top prosecutor Ali Ghanaatkar, known for prosecuting dissidents, was among those killed. Ghanaatkar had faced criticism from human rights groups for his actions, including prosecuting Nobel Peace Prize winner Narges Mohammadi. He will be buried at a shrine in Qom.",
      "publishedAt": "2025-06-29T07:18:42Z",
      "title": "Iran's judiciary says at least 71 killed in Israel's attack on Tehran's notorious Evin prison",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-29-2025-da0d0f6e1a9bf89a30a2589e73cff2ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/bc05acf/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F47%2F7ffc348a02d9ec126bd26625eafb%2F7d46f901139d4c73b1f182cfc8e42228"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump is calling for a deal on the war in Gaza. In between posts about a Senate vote on his tax cuts and spending bill, Trump pleaded early Sunday on his social media platform Truth Social for a deal and the release of hostages. Trump has suggested a ceasefire agreement could happen within a week. An Israeli official says plans are underway for Prime Minister Benjamin Netanyahu to travel to Washington in the coming weeks, with a top adviser already heading there for discussions. In Gaza, Israel has ordered evacuations in northern areas during intensifying military operations.",
      "publishedAt": "2025-06-29T07:50:40Z",
      "title": "Signs of progress as Trump calls for a Gaza deal",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-06-29-2025-f72d5701a985213e12b1ff80d1357670",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6b9379/2147483647/strip/true/crop/7456x4194+0+389/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F3c%2F7209a7a2eb06f6c6798293190d3a%2F83ebd299747441bf97a9ea4b4e27f7f7"
    },
    {
      "author": null,
      "description": "The Republican-controlled Senate has advanced President Donald Trump’s package of tax breaks, spending cuts and increased deportation money, but there's more weekend work ahead as Congress races to meet his Fourth of July deadline for passage. By a 51-49 tally and with Vice President JD Vance at the Capitol to break a potential tie, the Senate cleared a key procedural step Saturday as midnight approached. Voting had come to a standstill, dragging for more than three hours, with holdout senators huddling for negotiations and taking private meetings off the Senate floor. The Senate's top Democrat has forced a full reading of 940-page bill. That began late Saturday and has continued into Sunday morning.",
      "publishedAt": "2025-06-29T12:40:14Z",
      "title": "After a dramatic vote, the Senate pushes ahead on Trump's bill",
      "url": "https://apnews.com/article/senate-trump-tax-breaks-spending-cuts-daf7c76ac9481d177050df5932025c56",
      "urlToImage": "https://dims.apnews.com/dims4/default/0d9d2e6/2147483647/strip/true/crop/5066x2850+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2F42%2Ffe1360f9b2859b5c254cb7bbb2c9%2F3b0ac930f04b4f3da94958b2a5934698"
    },
    {
      "author": null,
      "description": "Pope Leo XIV is marking a feast day as the Vatican launches a new campaign to boost donations from the faithful. Leo celebrated Mass at St. Peter’s Basilica on Sunday, marking the Feast of Saints Peter and Paul, typically used for a special collection for Peter's Pence, a key fundraising initiative. The Vatican’s promotional efforts this year include videos, posters, and online donation options. Peter’s Pence funds both the Vatican's operations and papal charity work, but it has faced scandals over mismanagement. Vatican officials hope that with an American pope, donors will be reassured their money is managed and spent well.",
      "publishedAt": "2025-06-29T09:33:01Z",
      "title": "Pope Leo XIV marks feast day as Vatican launches campaign to help erase its $57-68 million deficit",
      "url": "https://apnews.com/article/vatican-peters-pence-leo-pope-c359be9fec676bb0c92e0d548c3674a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b1d7a6/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F28%2Fea3a7f691d1b51400f79ae3ee620%2F52aa2471a4ee4edf9f4f9e4cde5a0b0a"
    },
    {
      "author": null,
      "description": "Zohran Mamdani, an outspoken critic of Israel, is the expected Democratic nominee for mayor in America’s most Jewish city and that's raising alarms among some in the New York's Jewish community. They're worried about rising antisemitism and their waning influence. Mamdani's performance in this past week's Democratic primary also signals a sea change in the priorities of one of the party’s most loyal voting groups. An ideological realignment has been taking place among American Jews since the Hamas attack on Israel in 2023. And many Democratic voters, including Jews, have grown dismayed by Israel’s conduct in the war.",
      "publishedAt": "2025-06-29T12:56:06Z",
      "title": "How Democrats in America’s most Jewish city turned to Mamdani for mayor",
      "url": "https://apnews.com/article/new-york-mamdani-mayor-democrats-jews-israel-39e3a3df4ce9d05c090a78ba7a1eb48b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f6f369c/2147483647/strip/true/crop/5053x2842+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2Fba%2F4ddcfa80c511baddba9960d5b937%2F07db4d8ba49d4f75a0c2407f4d9d1303"
    },
    {
      "author": null,
      "description": "Some Iranians are getting arrested by immigration authorities after living decades in the United States. The Homeland Security Department hasn't released numbers but the National Iranian American Council, an advocacy group, says there has has been a surge of arrests. Mandonna “Donna” Kashanian lived in the United States for 47 years before being piked up by immigration officers this month in New Orleans. Like other Iranians, she has faced the possibility of being deported to Iran before, because of severed diplomatic relations with the U.S. Now the future appears more uncertain.",
      "publishedAt": "2025-06-29T03:59:25Z",
      "title": "Iranians who've been in the US for decades are being arrested in Trump deportation drive",
      "url": "https://apnews.com/article/iran-immigration-arrests-us-trump-deportations-9a4136657bda3a277125738807848368",
      "urlToImage": "https://dims.apnews.com/dims4/default/937a6dc/2147483647/strip/true/crop/1044x587+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F85%2F741f8ac741dccf7c0b06250302d3%2F0d397f52c9334010888db8e3d5ef0e5d"
    },
    {
      "author": null,
      "description": "Flint, Michigan, is still working on replacing all of its lead pipes. The effort was supposed to be finished years ago, but slow work, poor record-keeping and residents' mistrust in their local government caused extensive delays. There's now a federal mandate for communities to replace their lead pipes, so lessons from Flint's failures are valuable nationwide. One place that used them was Newark, New Jersey, which experienced a lead crisis after Flint. They made it easier for residents to approve pipe replacement work and targeted properties systematically.",
      "publishedAt": "2025-06-29T13:12:56Z",
      "title": "Flint lead pipe replacements remain unfinished a decade after water crisis",
      "url": "https://apnews.com/article/flint-water-crisis-lead-pipe-replacement-d4f7e458dce73c6f153281276548d1da",
      "urlToImage": "https://dims.apnews.com/dims4/default/25d0aac/2147483647/strip/true/crop/5292x2977+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2Ff7%2Feb3f4f0aeff41b376cea644e8bce%2F34eb1bf0647747ed991e0d9d731b8a02"
    },
    {
      "author": null,
      "description": "Lando Norris has held off a race-long challenge from his McLaren teammate Oscar Piastri to win the Austrian Grand Prix and lift his Formula 1 title hopes. Norris and Piastri battled for the lead early on, with the Australian briefly into the lead before Norris took the position back. Piastri lost ground at the pit stops but recovered to put Norris under pressure in the final laps, though he wasn't quite close enough to try overtaking. Max Verstappen's title defense suffered a blow as he was hit by Kimi Antonelli on the opening lap.",
      "publishedAt": "2025-06-29T06:52:56Z",
      "title": "Lando Norris holds off Oscar Piastri to win Formula 1's Austrian Grand Prix",
      "url": "https://apnews.com/article/f1-austria-lando-norris-oscar-piastri-af112ed829655862c1a5d270691a0eb9",
      "urlToImage": "https://dims.apnews.com/dims4/default/3832c2c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F01%2Fc9ba7537bac15ab0e1da600bb691%2F5483e519ffb14ca0a86db66d0712f6e9"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}