{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli strikes pounded Gaza City overnight and into Sunday as ground forces battled Hamas militants near the territory's largest hospital, where health officials say thousands of medics, patients and displaced people are trapped with no electricity and dwindling supplies.",
      "publishedAt": "2023-11-12T06:59:32Z",
      "title": "Heavy fighting rages near main Gaza hospital as Netanyahu dismisses calls for a cease-fire",
      "url": "https://apnews.com/20f5dcd135b7eb34238a7b25ce560d0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4bacc4aa6c640d08e87a3aa15889d11/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — The head of surgery at Gaza’s largest and most advanced hospital held up his phone Saturday to the hammering of gunfire and artillery shelling. “Listen,” said Dr. Marwan Abu Sada as fighting raged around Shifa Hospital.",
      "publishedAt": "2023-11-11T20:26:02Z",
      "title": "Hospitals have special protection under the rules of war. Why are they in the crosshairs in Gaza?",
      "url": "https://apnews.com/be55b16dd18e55be1b8ad395163ca19b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2089880b26734851a47179337d53f73e/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — The United States and China are the two global economic heavyweights. Combined, they produce more than 40% of the world's goods and services. So when Washington and Beijing do economic battle, as they have for five years running, the rest of the world suffers, too.",
      "publishedAt": "2023-11-12T06:00:28Z",
      "title": "A fragile global economy is at stake as US and China seek to cool tensions at APEC summit",
      "url": "https://apnews.com/ddfdbfd267a8dabb1138a8157b7c88ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9aaf196bd064bfcb6853fb708ae7dd7/3000.jpeg"
    },
    {
      "author": "GREGOIRE MEROT",
      "description": "MAMOUDZOU, Mayotte (AP) — Drop by disappearing drop, water is an ever more precious resource on Mayotte, the poorest place in the European Union. Taps flow just one day out of three in this French territory off Africa’s eastern coast, because of a drawn-out drought compounded by years of underinvestment and water mismanagement.",
      "publishedAt": "2023-11-12T08:11:57Z",
      "title": "Drought and mismanagement have left a French island parched. That holds lessons for the mainland",
      "url": "https://apnews.com/f079fb9b8f2b4057cd06687bb88d9fb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7f1ff24402f439d8631b9f17bce2062/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — Latvia’s president says Russia is planning for a long war in Ukraine and he has a message for countries wavering on continuing military support to Kyiv: Keep supplying arms or the Ukrainians will lose and Russia will have a green light for threatening others in the future.",
      "publishedAt": "2023-11-12T01:57:14Z",
      "title": "Latvia's president says West must arm Ukraine to keep Russia from future global adventures",
      "url": "https://apnews.com/cde2138165701ee9dbaf9823e761664c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e80e510a2a5849db9fad4e6aa1634a0f/2987.jpeg"
    },
    {
      "author": "KEVIN FREKING and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson unveiled his proposal on Saturday to avoid a partial government shutdown by extending government funding for some agencies and programs until Jan.",
      "publishedAt": "2023-11-11T22:25:02Z",
      "title": "House Republicans look to pass two-step package to avoid partial government shutdown",
      "url": "https://apnews.com/d942acf1a8b163f0b52f209da42953c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/667a3cdf33534ce5a6ae8327cb239b73/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Fighters from a paramilitary force and their allied Arab militias rampaged through a town in Sudan’s war-ravaged region of Darfur, reportedly killing more than 800 people in a multiday attack, doctors and the U.N.",
      "publishedAt": "2023-11-11T19:48:49Z",
      "title": "More than 800 Sudanese reportedly killed in attack on Darfur town, UN says",
      "url": "https://apnews.com/1d7becc3b9c4dbf1e814892f3b88396e",
      "urlToImage": ""
    },
    {
      "author": "MIKE CORDER",
      "description": "TER APEL, Netherlands (AP) — It is a familiar sight in this remote rural town: a migrant in a headscarf and thick winter coat carrying her belongings to the overcrowded reception center as a storm brews over the flat landscape.",
      "publishedAt": "2023-11-12T06:07:52Z",
      "title": "Dutch election candidates make migration a key campaign issue in the crowded Netherlands",
      "url": "https://apnews.com/e3d33eab084ffdbc87b7501f11076ec8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c52d6fb817a745d394768f66623578d9/3000.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME",
      "description": "DUNDEE, South Africa (AP) — On weekdays, 14-year-old Luyanda Hlali gets up before dawn to fetch firewood and cow dung to start a fire and boil some water before her four siblings and parents wake up.",
      "publishedAt": "2023-11-12T06:05:22Z",
      "title": "Long walk to school: 30 years into freedom, many kids in South Africa still walk miles to class",
      "url": "https://apnews.com/ce5750af0ff0e6e1570b2fd6248bd62b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fe6f0d0dbff4fa591ac96d4ff2365dc/3000.jpeg"
    },
    {
      "author": "BISWAJEET BANERJEE",
      "description": "LUCKNOW, India (AP) — Millions of Indians celebrated Diwali on Sunday with a new Guinness World Record number of bright earthen oil lamps as concerns about air pollution soared in the South Asian country.",
      "publishedAt": "2023-11-12T06:54:04Z",
      "title": "Millions of Indians set a new world record celebrating Diwali as worries about air pollution rise",
      "url": "https://apnews.com/922f8aeb41972c6ce4cb121a1c04d6aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccf2a8fe3b854abbbb8e39e7ced4d61d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}