{
  "articles": [
    {
      "author": "KRYSTA FAURIA, ETHAN SWOPE, JAKE OFFENHARTZ and JOSEPH B. FREDERICK",
      "description": "LOS ANGELES (AP) — Police removed barricades and began dismantling a pro-Palestinian demonstrators’ fortified encampment early Thursday at the University of California, Los Angeles, after hundreds of protesters defied police orders to leave, about 24 hours after counterprotesters attacked a tent encampment on the campus.",
      "publishedAt": "2024-05-02T04:03:30Z",
      "title": "Police move in and begin dismantling pro-Palestinian demonstrators' encampment at UCLA",
      "url": "https://apnews.com/ec3f62c51c08599f8fcecd99f7cf9e33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44af2be98ce14ea69bcc87e7ac6eafa9/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "If the Israel-Hamas war stopped today, it would still take until 2040 to rebuild all the homes that have been destroyed in nearly seven months of Israel’s bombardment and ground offensives in the territory, according to United Nations estimates released Thursday.",
      "publishedAt": "2024-05-02T09:01:08Z",
      "title": "The Latest | It would take until 2040 to rebuild all homes destroyed so far in Gaza, UN report says",
      "url": "https://apnews.com/674ba9c58c74dd5741f72dd0bb6ea353",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/905ca9c249f440f4a35bd158e4c8e63e/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump faces the prospect of additional sanctions in his hush money trial as he returns to court Thursday for another contempt hearing followed by testimony from a lawyer who represented two women who have said they had sexual encounters with the former president.",
      "publishedAt": "2024-05-02T04:03:50Z",
      "title": "Trump faces prospect of additional sanctions in hush money trial as key witness resumes testimony",
      "url": "https://apnews.com/fe6995afbc96650b67f46d813ab05f06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51c5a7cad32e4735bd8f4b44e5b787c8/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Two years after a leaked draft of a U.S. Supreme Court opinion signaled that the nation's abortion landscape was about to shift dramatically, the issue is still consuming the nation's courts, legislatures and political campaigns — and changing the course of lives.",
      "publishedAt": "2024-05-02T04:12:21Z",
      "title": "Abortion is still consuming US politics and courts 2 years after a Supreme Court draft was leaked",
      "url": "https://apnews.com/9ee070c3540cb730b251d707e5f98ffc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60986915986f4ad58aba0fab284879ef/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KHARKIV, Ukraine (AP) — During pitched battles with far better-armed Russian forces, Ukrainian soldier Batyar’s unit has few options.Devastating Russian aerial glide bombs that can drop up to 1.5 tons of explosives out of range of most of Ukraine's air defenses are gnawing away at his men’s positions in a new tactic.",
      "publishedAt": "2024-05-02T04:04:43Z",
      "title": "No safety in retreat: Ukrainian soldiers say rear defensive lines barely exist amid Russian advance",
      "url": "https://apnews.com/8a72981dfdb755de6f8011b13f4d062e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/884511ef1fd849dd84aac77e2ad512ca/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — The death toll from a collapsed highway in southeastern China climbed to 48 on Thursday as searchers dug for a second day through a treacherous and mountainous area.",
      "publishedAt": "2024-05-02T08:15:22Z",
      "title": "Death toll jumps to at least 48 as a search continues in southern China highway collapse",
      "url": "https://apnews.com/9cf1836ea73ebc008ee6fcaeed942f51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c73ae36c65b642849d0726c03331de68/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "FORT LIBERTY, N.C. (AP) — The video is unsettling, with haunting images of faceless people, fire and soldiers. The voiceover is a cascade of recognizable historical voices as the screen pulses cryptic messages touting the power of words, ideas and “invisible hands.”",
      "publishedAt": "2024-05-02T04:31:30Z",
      "title": "Faceless people, invisible hands: New Army video aims to lure recruits for psychological operations",
      "url": "https://apnews.com/f216951fdaff4fa0130386a8f85c76e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e335fbbf17534b94a18b1113a36b0aab/2560.jpeg"
    },
    {
      "author": "DAVID KLEPPER and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — Bollywood stars seldom weigh in on politics, so videos showing two celebrities criticizing Indian Prime Minister Narendra Modi — and endorsing his main opposition, the Congress party — were bound to go viral.",
      "publishedAt": "2024-05-02T05:13:23Z",
      "title": "As India votes, misinformation surges on social media: 'The whole country is paying the price'",
      "url": "https://apnews.com/703a56c73f9341393f05400ea218b87d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2f0cd67a6f54cc48ee0061539e1c95e/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "DUESSELDORF, Germany (AP) — Herbert Rubinstein was 5 years old when he and his mother where taken from the Jewish ghetto of Chernivtsi and put on a cramped cattle wagon waiting to take them to their deaths.",
      "publishedAt": "2024-05-02T04:12:15Z",
      "title": "At time of rising antisemitism, Holocaust survivors take on denial and hate in new digital campaign",
      "url": "https://apnews.com/3706dc209ecee009a7e0d6651498d8bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d537cafebd24d0b94efe89dbfadb525/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER and CHRISTINE FERNANDO",
      "description": "NEW YORK (AP) — Ordered by police to leave the scene of a UCLA campus protest after violence broke out, Catherine Hamilton and three colleagues from the Daily Bruin suddenly found themselves surrounded by demonstrators who beat, kicked and sprayed them with a noxious chemical.",
      "publishedAt": "2024-05-02T04:54:14Z",
      "title": "Student journalists are put to the test, and sometimes face danger, in covering protests on campus",
      "url": "https://apnews.com/b9ff00a494cdb69d45bd1f99db28288b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d647323b5774d0596f76f33a3f4613c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}