{
  "articles": [
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Conservative Supreme Court justices appeared skeptical Wednesday that state abortion bans taking effect after their sweeping ruling overturning Roe v.",
      "publishedAt": "2024-04-24T04:01:39Z",
      "title": "Supreme Court appears skeptical that state abortion bans conflict with federal health care law",
      "url": "https://apnews.com/45766f0a1ab576ce0f6515c5a1bd9e2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/213305c336bf407cb11676d80a2ee35a/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden said on Wednesday that he was immediately rushing badly needed weaponry to Ukraine as he signed into law a $95 billion war aid measure that also included assistance for Israel, Taiwan and other global hotspots.",
      "publishedAt": "2024-04-24T09:03:37Z",
      "title": "Biden says the US is rushing weaponry to Ukraine as he signs a $95 billion war aid measure into law",
      "url": "https://apnews.com/b72aed9b195818735d24363f2bc34ea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/efbbe9834072412ca16c562d58e30aee/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — Ukraine for the first time has begun using long-range ballistic missiles provided secretly by the United States, bombing a Russian military airfield in Crimea last week and Russian forces in another occupied area overnight, American officials said Wednesday.",
      "publishedAt": "2024-04-24T16:32:37Z",
      "title": "Ukraine uses long-range missiles secretly provided by US to hit Russian-held areas, officials say",
      "url": "https://apnews.com/4d2254639eb5a503d8b0a291ed0680e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db5c6303024e444bbdf736b6bed1a57c/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "NEW YORK (AP) — Doctors have transplanted a pig kidney into a New Jersey woman who was near death, part of a dramatic pair of surgeries that also stabilized her failing heart.Lisa Pisano’s combination of heart and kidney failure left her too sick to qualify for a traditional transplant, and out of options.",
      "publishedAt": "2024-04-24T13:01:55Z",
      "title": "She was too sick for a traditional transplant. So she received a pig kidney and a heart pump",
      "url": "https://apnews.com/f708d90b6059f974d492d26c283a16cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06706a171df047bdb0af340ea64566e6/3000.jpeg"
    },
    {
      "author": "NICK PERRY and KAREN MATTHEWS",
      "description": "NEW YORK (AP) — Columbia University averted another confrontation between students and police early Wednesday, but the situation remained tense with campus officials saying it would continue talks with pro-Palestinian protesters for another 48 hours.",
      "publishedAt": "2024-04-24T05:23:23Z",
      "title": "Columbia University extends talks with Gaza war protesters, averting another confrontation",
      "url": "https://apnews.com/47f4f7f0916a6493b79eede3e4d0a55d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b0bbd048dd34f7e87a3d76213c10376/1920.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — About one-quarter of U.S. adults over age 50 say they expect to never retire and 70% are concerned about prices rising faster than their income, an AARP survey finds.",
      "publishedAt": "2024-04-24T15:49:52Z",
      "title": "About 1 in 4 US adults over 50 say they expect to never retire, an AARP study finds",
      "url": "https://apnews.com/c4f1353d97e8c0a9973c9c67a8eab800",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3646364f44c0470384b066e167ed3376/3000.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "HARTFORD, Conn. (AP) — Telecommuting, a pandemic-era novelty that has become a permanent alternative for many people, has some Connecticut and New Jersey employees of New York-based companies questioning why they still have to pay personal income tax to the Empire State.",
      "publishedAt": "2024-04-24T04:01:32Z",
      "title": "New Jersey is motivating telecommuters to appeal their New York tax bills. Connecticut may be next",
      "url": "https://apnews.com/ba70ead2f72827bb8f7f3bddb078af39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c59673b702d84244974ec777a4a7fd2e/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "The nation's school meals will get a makeover under new nutrition standards that limit added sugars for the first time, the U.S. Department of Agriculture announced Wednesday. The final rule also trims sodium in kids' meals, although not by the 30% first proposed in 2023. And it continues to allow flavored milks — such as chocolate milk — with less sugar, rather than adopting an option that would have offered only unflavored milk to the youngest kids.",
      "publishedAt": "2024-04-24T12:31:56Z",
      "title": "USDA updates rules for school meals that limit added sugars for the first time",
      "url": "https://apnews.com/aa17b295f959c72ef5c41ac3cd50e68d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f9d30141a5749eabddce7d38bae4d43/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "“ Barbenheimer ” is a hard act to follow. But as Hollywood enters another summer movie season, armed with fewer superheroes and a landscape vastly altered by the strikes, it’s worth remembering the classic William Goldman quote about what works: “Nobody knows anything.”",
      "publishedAt": "2024-04-24T14:13:45Z",
      "title": "The summer after Barbenheimer and the strikes, Hollywood charts a new course",
      "url": "https://apnews.com/dd4640580b4d32cb235996eb69665ea9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc2db53ffc4041d1994f8ea14c0c5c94/2424.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "LOS ANGELES (AP) — Reggie Bush has his Heisman back.The Heisman Trust reinstated the former Southern California tailback as the 2005 Heisman Trophy winner on Wednesday, citing fundamental changes in the structure of college athletics during the 14 years since Bush forfeited the trophy and the honor.",
      "publishedAt": "2024-04-24T14:01:52Z",
      "title": "Reggie Bush is reinstated as 2005 Heisman Trophy winner, with organizers citing NIL rule changes",
      "url": "https://apnews.com/5ec9ed713534ca1081a0777b699d0385",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71a3a5b1785b4ddd8e3a03a252a21322/2588.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}