{
  "articles": [
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris moved swiftly Monday to lock up Democratic delegates behind her campaign for the White House after President Joe Biden stepped aside amid concerns from within their party that he would be unable to defeat Republican Donald Trump.",
      "publishedAt": "2024-07-22T04:16:47Z",
      "title": "Harris wins Pelosi endorsement, claims many of the delegates she needs for the nomination",
      "url": "https://apnews.com/9fbd153493cb3f088994854fe61a73e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81affd8f52e54bf6b90a1955555c4f8f/1920.jpeg"
    },
    {
      "author": "JILL COLVIN and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump's campaign has spent the last year-and-a-half viciously attacking Joe Biden, ridiculing his policies, mocking his fumbles and relishing a rematch they felt they were winning.",
      "publishedAt": "2024-07-22T00:15:45Z",
      "title": "Trump's campaign quickly pivots to Harris after Biden announces decision to leave the race",
      "url": "https://apnews.com/920d7fe1c364e82290abeb9e0d1411c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/215f19a6dc364aafbc7a0b664487ef56/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, FARNOUSH AMIRI and CLAUDIA LAUER",
      "description": "WASHINGTON (AP) — Secret Service Director Kimberly Cheatle said Monday that her agency failed in its mission to protect former President Donald Trump during a highly contentious congressional hearing with lawmakers of both major political parties demanding she resign over security failures that allowed a gunman to scale a roof and open fire at a campaign rally.",
      "publishedAt": "2024-07-22T13:39:17Z",
      "title": "Secret Service director, grilled by lawmakers on the Trump assassination attempt, says 'we failed'",
      "url": "https://apnews.com/fabaf9a0e57d5545e5b60f0b2215778f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a81403a4efd465ebd1daec0afce2769/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, SEUNG MIN KIM, ZEKE MILLER and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — At 1:45 p.m. Sunday, President Joe Biden’s senior staff was notified that he was stepping away from the 2024 race.",
      "publishedAt": "2024-07-21T23:18:32Z",
      "title": "Biden's decision to drop out crystallized Sunday. His staff knew one minute before the public did",
      "url": "https://apnews.com/be10da43b9447ef1230c178b15c4760a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31cbe8c808e644fca74b0cd0c6d2d86b/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — For the past year, the presidential campaign seemed destined to be a monotonous slog featuring two candidates, President Joe Biden and former President Donald Trump, who voters didn’t really want.",
      "publishedAt": "2024-07-22T04:14:59Z",
      "title": "Harris gets a chance to press reset on the 2024 race against Trump",
      "url": "https://apnews.com/90b9d5c6dc5553703af88dfa442a6bac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9439d1814ac845ebbdb573997a4531ac/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "Joe Biden's withdrawal from the U.S. presidential race injects greater uncertainty into the world at a time when Western leaders are grappling with wars in Ukraine and Gaza, a more assertive China in Asia and the rise of the far right in Europe.",
      "publishedAt": "2024-07-22T02:02:54Z",
      "title": "Biden's withdrawal injects uncertainty into wars, trade disputes and other foreign policy challenges",
      "url": "https://apnews.com/a627c5f773d5f440541bd299efe3dbc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ff95bfc102b4f5e9407e4e3a1df5389/2567.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and AAMER MADHANI",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu left for Washington on Monday, leaving behind a brutal war to make a politically precarious speech before the U.S.",
      "publishedAt": "2024-07-21T20:48:50Z",
      "title": "Israel's Netanyahu walks political tightrope on Washington trip following Biden's exit from race",
      "url": "https://apnews.com/9e207697206c7d4f31e4ca07e19c5565",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47b2ba9b0a6243d6af69c3bac00704cb/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and MELANIE LIDMAN",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military ordered the evacuation Monday of part of a crowded area in the Gaza Strip it had designated a humanitarian zone, saying it is planning an operation against Hamas militants there.",
      "publishedAt": "2024-07-22T06:30:32Z",
      "title": "Israel orders evacuation of part of Gaza humanitarian zone as war's toll passes 39,000 Palestinians",
      "url": "https://apnews.com/e99dde86d4333a636d280d9a632835a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/781f79f3cb2e4f88a3c542706f8af39c/1920.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "Swallowing a handful of pills is a daily ritual for many people, from young adults coping with anxiety to older adults managing chronic conditions.",
      "publishedAt": "2024-07-22T15:39:09Z",
      "title": "Too many pills? How to talk to your doctor about reviewing what’s needed",
      "url": "https://apnews.com/039c5a415b108129a89e6fcbef7235f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de8cd02ba90d42e5b554763bf0522ba1/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "LeBron James wasn’t totally sure what the opening ceremony was all about when he was picked for his first Olympics in 2004.",
      "publishedAt": "2024-07-22T11:07:43Z",
      "title": "LeBron James selected as Team USA male flagbearer for Paris Olympics opening ceremony",
      "url": "https://apnews.com/c06c923974bb9d336883410a581636db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a54a013d1f04bb8857dcf4afecaa542/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}