{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Israel’s defense minister has confirmed that Israel assassinated Hamas’ top leader last summer and is threatening to take similar action against the leadership of the Houthi rebel group in Yemen.",
      "publishedAt": "2024-12-23T08:35:17Z",
      "title": "Middle East latest: Israeli's defense minister acknowledges it killed Hamas leader",
      "url": "https://apnews.com/d7d28b67bb47c390a7be0ddd925f1c46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2787976db70d44dbbc6768c41cd07403/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.N. organization assisting in investigating the most serious crimes in Syria said Monday the country’s new authorities were “very receptive” to its request for cooperation during a just-concluded visit to Damascus, and it is preparing to deploy.",
      "publishedAt": "2024-12-24T00:26:32Z",
      "title": "UN investigative team says Syria's new authorities `very receptive' to probe of Assad war crimes",
      "url": "https://apnews.com/e476c58e02556a547a41797e85f5c585",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4249d344b52d45339a8d81ad969371d2/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden on Monday announced that he is commuting the sentences of 37 of the 40 people on federal death row, converting their punishments to life imprisonment just weeks before President-elect Donald Trump, an outspoken proponent of expanding capital punishment, takes office.",
      "publishedAt": "2024-12-23T10:00:56Z",
      "title": "Biden gives life in prison to 37 of 40 federal death row inmates before Trump can resume executions",
      "url": "https://apnews.com/f67b5e04453cd1aa6383c516bc14f300",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d267045be5a4afe9b3a92dc073a2fba/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House Ethics Committee on Monday accused Matt Gaetz of “regularly” paying for sex, including once with a 17-year-old girl, and purchasing and using illicit drugs as a member of Congress, as lawmakers released the conclusions of a nearly four-year investigation that helped sink his nomination for attorney general.",
      "publishedAt": "2024-12-23T14:47:41Z",
      "title": "House Ethics Committee accuses Gaetz of paying for sex, including with 17-year-old girl",
      "url": "https://apnews.com/538cb5387bf95925245bf87fa6b1adcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71e1034b31054cc3aea7a9fdfff72c12/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The man accused of fatally shooting the CEO of UnitedHealthcare pleaded not guilty on Monday to state murder and terror charges while his attorney complained that comments coming from New York’s mayor would make it tough to receive a fair trial.",
      "publishedAt": "2024-12-23T05:30:42Z",
      "title": "Luigi Mangione pleads not guilty to murder and weapons charges in UnitedHealthcare CEO's death",
      "url": "https://apnews.com/8079a5bbe5f3e0539d09332a7240168d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/281d69b119b9471893d7b0d89e6d2ea2/1920.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE and SUSAN HAIGH",
      "description": "A man is facing murder and arson charges in New York City for allegedly setting a woman on fire inside a subway train and then watching her die after she was engulfed in flames, police said Monday.",
      "publishedAt": "2024-12-23T16:28:25Z",
      "title": "Man faces murder charges in the death of a woman who was lit on fire in New York City subway",
      "url": "https://apnews.com/c946bb951f67116e1bfb399f99ab5062",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e366d6449274f0eba154745e99270aa/3000.jpeg"
    },
    {
      "author": "KRISHAN FRANCIS",
      "description": "KURUKKAL MADAM, Sri Lanka (AP) — Pulled from the mud as an infant after the devastating Indian Ocean tsunami in 2004, and reunited with his parents following an emotional court battle, the boy once known as “Baby 81” is now a 20-year-old dreaming of higher education.",
      "publishedAt": "2024-12-24T04:22:45Z",
      "title": "20 years after the Indian Ocean tsunami, a boy found in the mud embraces being known as 'Baby 81'",
      "url": "https://apnews.com/fe6edec6968f1b90382c1288bb5f86a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4001fc099c1445ccaad5cd986e8b2fe5/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s main opposition party said Tuesday it will seek to impeach acting leader Han Duck-soo after he missed an opposition-set deadline to approve independent investigations into impeached President Yoon Suk Yeol and his wife.",
      "publishedAt": "2024-12-24T04:35:07Z",
      "title": "South Korea's opposition party vows to impeach acting president",
      "url": "https://apnews.com/dd42c95aa46de258e25bbe9373d5e3e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/341d623a389a4c6b908a306fbb4884fc/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WEST PALM BEACH, Fla. (AP) — First it was Canada, then the Panama Canal.",
      "publishedAt": "2024-12-23T15:23:25Z",
      "title": "Trump again calls to buy Greenland after eyeing Canada and the Panama Canal",
      "url": "https://apnews.com/a52858e3075f9b5ad95e78753293fc1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc620e18fff248c69b7eda92e5d06acf/1920.jpeg"
    },
    {
      "author": null,
      "description": "SYDNEY (AP) — There have been plenty of “firsts” in the history of the Sydney to Hobart yacht race which was first held in 1945. An all-Filipino crew of 15 sailors will make it another when the annual ocean classic begins in Sydney on Thursday.",
      "publishedAt": "2024-12-24T02:28:49Z",
      "title": "An all-Filipino crew is set to make history in the Sydney to Hobart yacht race",
      "url": "https://apnews.com/bf567e9ecb73b825696c03969d9f228e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec6c044bfdd844a7a5d8740278a83d0b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}