{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "Donald Trump’s legal team told a judge overseeing the election conspiracy case against him on Monday that prosecutors' proposed protective order aimed at preventing the public disclosure of evidence is too broad and would restrict his First Amendment rights.",
      "publishedAt": "2023-08-07T21:18:48Z",
      "title": "Trump lawyers urge judge to narrow proposed rules on evidence sharing in election subversion case",
      "url": "https://apnews.com/7188eddf6cac0a34379aae71eb16a226",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e934080427da4f1e8707ed3dec2ba8b5/1920.jpeg"
    },
    {
      "author": "ASHRAF KHALIL and JEFFREY COLLINS",
      "description": "WASHINGTON (AP) — At least two people died, thousands of U.S. flights were canceled or delayed, and more than 1.1 million homes and businesses lost power Monday as severe storms, including hail and lightning, moved through the eastern U.S.",
      "publishedAt": "2023-08-07T20:31:02Z",
      "title": "2 dead, thousands of flight cancellations, 1.1 million lose power in eastern US storms",
      "url": "https://apnews.com/31b54effe7bd180bb22d5bd422b9f98b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c1d8da8bd17465cb85292008d2180dd/3000.jpeg"
    },
    {
      "author": "MELINA WALLING",
      "description": "Even in Antarctica — one of the most remote and desolate places on Earth — scientists say they are finding shattered temperature records and an increase in the size and number of wacky weather events.",
      "publishedAt": "2023-08-08T04:29:02Z",
      "title": "Even frozen Antarctica is being walloped by climate extremes, scientists find",
      "url": "https://apnews.com/d9eff33e1acc06512e4e47156745237a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21a52850b0b14e31ba476883abfe4ae2/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Ohio concludes a hastily called and highly charged special election Tuesday, a contest that could determine the fate of abortion rights in the state and fuel political playbooks nationally heading into 2024.",
      "publishedAt": "2023-08-08T04:04:47Z",
      "title": "Proposed constitutional change before Ohio voters could determine abortion rights in the state",
      "url": "https://apnews.com/227cde039f8d51723612878525164f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbdc34f5de374e0fae8e0531c2cf889f/1920.jpeg"
    },
    {
      "author": "DAVID BILLER and FABIANO MAISONNAVE",
      "description": "BELEM, Brazil (AP) — The diminutive woman with a white feather headdress stood on the stage of the majestic colonial theater in Brazil’s Amazon on Monday and addressed the crowd.The woman, Minister of Indigenous People Sonia Guajajara, declared the day “the milestone of Indigenous participation,” then cited the national statistics institute’s freshly released census data that revealed the full scope of the nation’s Indigenous population: 1,693,535 people.",
      "publishedAt": "2023-08-08T02:44:36Z",
      "title": "Brazil has 1.7 million Indigenous people, near double the count from prior census, government says",
      "url": "https://apnews.com/41405ae42bb3b9661e0d27244983b9f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01956d934e2443a6b91b0147e5e64a3f/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — Following his debut solo tour earlier this year, Suga, the K-pop superstar rapper/singer/songwriter, has become the third member of BTS to begin South Korea's compulsory military service.",
      "publishedAt": "2023-08-08T00:15:28Z",
      "title": "K-pop star Suga becomes 3rd BTS member to begin military service in South Korea",
      "url": "https://apnews.com/6bf17a23a2c2126d1eed6bb03d36002e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a365e359b6c44fd9c8c6af34963e3ed/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "ATLANTA (AP) — Georgia could join other states requiring children to have their parents' explicit permission to create social media accounts.Two top Republicans in the Georgia state Senate — Lt.",
      "publishedAt": "2023-08-08T04:07:47Z",
      "title": "Georgia kids would need parental permission to join social media if Senate Republicans get their way",
      "url": "https://apnews.com/793e64968d7092753b2a428174f9d366",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f87b184f552d42c898bbf0e608a1e93f/2000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — Tou Thao, the last former Minneapolis police officer convicted in state court for his role in the killing of George Floyd, did not show any repentance or admit any wrongdoing as he was sentenced Monday to 4 years and 9 months.",
      "publishedAt": "2023-08-07T04:47:01Z",
      "title": "Ex-Minneapolis officer unrepentant as he gets nearly 5 years in George Floyd killing",
      "url": "https://apnews.com/586deaeb4d14807ef3f2bdd0196d0b86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5718d32e6c814e9f82f727116335ffd1/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK and ELLEN KNICKMEYER",
      "description": "NIAMEY, Niger (AP) — A senior U.S. diplomat said coup leaders in Niger refused to allow her to meet Monday with the West African country’s democratically elected president, whom she described as under “virtual house arrest.”",
      "publishedAt": "2023-08-07T06:33:54Z",
      "title": "Niger coup leaders refuse to let senior US diplomat meet with nation's president",
      "url": "https://apnews.com/6cc3fa0b61adc6d9bcb2fb9745c4dcdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/443bdf9edf71451b8d905e985af76639/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}