{
  "articles": [
    {
      "author": "PAUL J. WEBER and JUAN A. LOZANO",
      "description": "AUSTIN, Texas (AP) — Republican Texas Attorney General Ken Paxton was fully acquitted Saturday of corruption charges following a historic impeachment trial, a resounding verdict that reaffirms the power of the GOP's hard right and puts an indicted incumbent who remains under FBI investigation back into office.",
      "publishedAt": "2023-09-16T04:16:23Z",
      "title": "Republican Texas AG Ken Paxton is acquitted of corruption charges at historic impeachment trial",
      "url": "https://apnews.com/871fb9c57b38fbda5bec5c2e5f280755",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f9f4c97099042d9835aadf775e3548d/2800.jpeg"
    },
    {
      "author": "ROBERT F. BUKATY and DAVID SHARP",
      "description": "BAR HARBOR, Maine (AP) — Once a hurricane and still almost as strong as one, storm Lee brought high winds, rough surf and torrential rains Saturday to a large swath of New England and Maritime Canada, toppling trees, swamping coastlines and cutting power to tens of thousands.",
      "publishedAt": "2023-09-16T05:28:52Z",
      "title": "No longer a hurricane but still fierce, Lee pounds New England and Canada with rain, wind, waves",
      "url": "https://apnews.com/feed749d5e31b0286d943424e202f007",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/880f6cf6cbc94d409e9876e30754a17c/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "DALLAS (AP) — Car shoppers are heading for a new round of sticker shock if the strike by the United Auto Workers doesn’t end soon, particularly for popular vehicles that are already in short supply.",
      "publishedAt": "2023-09-16T13:41:07Z",
      "title": "The auto workers strike will drive up car prices, but not right away — unless consumers panic",
      "url": "https://apnews.com/98905c8e0fcf633d21a1f83183f9fd49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e66cd1c35084a619783a2d6d1578194/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — On one side of the Capitol, two senators have steered the debate over government funding mostly clear of partisan fights, creating a path for bills to pass with bipartisan momentum.",
      "publishedAt": "2023-09-16T14:51:39Z",
      "title": "The Senate's bipartisan approach to government funding is putting pressure on a divided House",
      "url": "https://apnews.com/5c8af4f0a5ea3a9d93f54e6566d50aeb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/772afbf344684a9a91bfb7ab9775fcc2/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and THOMAS BEAUMONT",
      "description": "DES MOINES, Iowa (AP) — Some of Donald Trump 's top rivals for the Republican presidential nomination will address a gathering of influential Iowa evangelical Christians on Saturday night, hoping to woo them away from the former president at an event he is skipping.",
      "publishedAt": "2023-09-16T16:13:02Z",
      "title": "Trump skips Iowa gathering of evangelical Christians. His rivals hope for a chance to gain ground",
      "url": "https://apnews.com/4fa52a5cfbb003e29d0c9a57ace0edd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97fceb554a7c4652b916961b82a42426/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — In the months since a single senator froze military promotions over the Pentagon’s abortion policy, the uniformed officers affected have been largely silent, wary of stepping into a political fray.",
      "publishedAt": "2023-09-16T04:21:14Z",
      "title": "Military officers begin to speak out on the harm done by Sen. Tuberville's holds on promotions",
      "url": "https://apnews.com/664c15d00d330b2b06b75ebeda8e3f01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f77fa65ebfe0497f8f7ad5944b9ac123/3000.jpeg"
    },
    {
      "author": "JEFF McMURRAY",
      "description": "When a small city abruptly parked all its buses to launch a publicly subsidized van service offering $1.50 trips anywhere in town, only one of its bus drivers — a big-city transplant — went along for the ride.",
      "publishedAt": "2023-09-16T04:15:41Z",
      "title": "What if public transit was like Uber? A small city ended its bus service to find out",
      "url": "https://apnews.com/675f6f7a6e550a2ec8113bda5b001ffa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95b2fc97813a40fab136349c70173226/3000.jpeg"
    },
    {
      "author": "TOM MURPHY",
      "description": "When she prescribes the popular weight-loss drug Wegovy, Dr. Angela Fitch sends patients on a quest she likens to “The Hunger Games.\"",
      "publishedAt": "2023-09-16T12:01:35Z",
      "title": "Supply problems and insurance issues make popular weight-loss drugs hard to get",
      "url": "https://apnews.com/64014bc2887a518b33c597b2bf936e37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f03b37bdecb3445e8d935c55be4313ae/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "The heat is about to be turned up on fossil fuels, the United States and President Joe Biden.As a record-smashing and deadly hot summer draws to a close, the United Nations and the city that hosts it are focusing on climate change and the burning of coal, oil and natural gas that causes it.",
      "publishedAt": "2023-09-16T13:29:40Z",
      "title": "Special UN summit, protests, week of talk turn up heat on fossil fuels and global warming",
      "url": "https://apnews.com/a42d71553a452069ceb01944b7fd8744",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec24d31b65ed4167b2c2821888b0a8cd/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — “The Drew Barrymore Show” will begin airing fresh episodes on Monday but a lot of off-air controversy will be clinging to its typically bubbly host.Barrymore — a daughter of a proud acting dynasty — is making new batches of her syndicated talk show despite picketers outside her studio, as daytime TV becomes the latest battlefield in the ongoing Hollywood labor strife.",
      "publishedAt": "2023-09-16T15:01:20Z",
      "title": "Hollywood strikes enter a new phase as daytime shows like Drew Barrymore's return despite pickets",
      "url": "https://apnews.com/3a6e2fea61755395edd0cf505203d23c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f16e466dd4d64e6db772bb4ff7c058ca/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}