{
  "articles": [
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "MIAMI (AP) — In their first debate since the outbreak of the Israel-Hamas war, the Republican presidential candidates all declared hawkish support for Israel but squabbled over China and Ukraine as they faced growing pressure to try to catch Donald Trump — who was again absent.",
      "publishedAt": "2023-11-08T05:07:27Z",
      "title": "GOP presidential candidates unified on Israel but divided on China as they debate without Trump",
      "url": "https://apnews.com/7c6ec4e9257fe3c166185eff94482686",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45b57e5eab1449b482716842a65fe024/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Palestinians living in the heart of Gaza’s largest city said Wednesday they could see and hear Israeli ground forces closing in from multiple directions, accelerating the exodus of thousands of civilians as food and water become scarce and urban fighting between Israel and Hamas heats up.",
      "publishedAt": "2023-11-08T06:39:16Z",
      "title": "Israel-Hamas fight heats up in Gaza City, accelerating exodus of Palestinians to the south",
      "url": "https://apnews.com/1d414b19e39fc46a5541d0541a880350",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01f2ec39a1cb43cebdeef42612044e35/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Hollywood’s actors union reached a tentative deal with studios Wednesday to end its strike and months of labor strife that ground the film and television industries to a historic halt.",
      "publishedAt": "2023-11-09T01:07:43Z",
      "title": "Hollywood actors strike is over as union reaches tentative deal with studios",
      "url": "https://apnews.com/5769ab584bca99fe708c67d00d2ec241",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dfb21d54c2f4414bd9f4adde9a2a0e1/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Five candidates sparred with one another at a whittled-down third Republican presidential debate in Miami while front-runner Donald Trump held his own event a short drive away.What to know",
      "publishedAt": "2023-11-08T21:07:19Z",
      "title": "5 Republican candidates spar at debate, while Trump holds a rally nearby. Follow live updates",
      "url": "https://apnews.com/9b7991b74be8e2028871720db446d5f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45c82f9214714ed695f83ed2094f81c0/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO and ELLIOT SPAGAT",
      "description": "AUSTIN, Texas (AP) — Eight people died Wednesday when the driver of a car suspected of carrying smuggled migrants fled police and smashed into an oncoming vehicle on a South Texas highway.The crash happened around 6:30 a.m.",
      "publishedAt": "2023-11-08T23:13:21Z",
      "title": "8 dead in crash after police chased a suspected human smuggler, Texas officials say",
      "url": "https://apnews.com/2eee4b9725a3de7646c83bbea7da9f8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31abd28bfd5e4f378a18954e6cb2f2fa/2000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Ivanka Trump didn't want to testify. But on the stand Wednesday in her father's civil fraud trial, she took the opportunity to contend the family business has “overdelivered,” even as she kept her distance from financial documents that New York state says were fraudulent.",
      "publishedAt": "2023-11-08T05:28:04Z",
      "title": "Ivanka Trump’s testimony: She worked on dad’s deals, not financial documents key to civil fraud case",
      "url": "https://apnews.com/1795382ea1d2c33faefbb40a0907feca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab290be80b374e3eadbf4b8352555e8f/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Republicans issued subpoenas Wednesday to members of President Joe Biden's family, taking their most aggressive step yet in an impeachment inquiry bitterly opposed by Democrats that is testing the reach of congressional oversight powers.",
      "publishedAt": "2023-11-08T19:00:58Z",
      "title": "House Republicans subpoena Hunter and James Biden as their impeachment inquiry ramps back up",
      "url": "https://apnews.com/37fe9652539c2c501d8b8bd8c3cc8901",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/caaabc54a8c04c1fa4741b31efa986b0/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — Voters threw their support behind abortion rights in Ohio, Virginia and elsewhere as Democrats look to springboard off those wins by using the issue to drive turnout and shape next year’s races for the White House, Congress and other elections.",
      "publishedAt": "2023-11-08T18:43:56Z",
      "title": "Democrats see abortion wins as a springboard for 2024 as GOP struggles to find a winning message",
      "url": "https://apnews.com/90255a62d83ad9f1d86b407c9455bb0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c32c299e93314193a1232b5f4e38f846/1920.jpeg"
    },
    {
      "author": "JESSE BEDAYN and MEAD GRUVER",
      "description": "COLORADO SPRINGS, Colo. (AP) — The owners of a Colorado funeral home were arrested Wednesday in Oklahoma on charges linked to the discovery of 190 sets of decaying remains at one of their facilities, including some that apparently had been languishing there for four years.",
      "publishedAt": "2023-11-08T15:53:35Z",
      "title": "Funeral home stored bodies for 4 years, deceived families about loved ones' ashes, prosecutors say",
      "url": "https://apnews.com/5748f57f94c8ae5365f2e950f56f5061",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1efb77c75e445e48df6925960e02e5b/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. carried out an airstrike on a weapons warehouse in eastern Syria used by Iranian-backed militias, in retaliation for what has been a growing number of attacks on bases housing U.S.",
      "publishedAt": "2023-11-08T22:51:47Z",
      "title": "US launches airstrike on site in Syria in response to attacks by Iranian-backed militias",
      "url": "https://apnews.com/5be245a2927334ad0d78b8ec35fa55b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07c45fecc7c24e15944900735d4720fd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}