{
  "articles": [
    {
      "author": "Kevin Freking",
      "description": "Speaker Mike Johnson’s ability to carry out President Donald Trump's “play call” for funding the government is being put to the test. The House is holding a procedural vote Tuesday on a bill that would end the partial government shutdown. Johnson will need near-unanimous support from his Republican conference to proceed. The legislation funds most of the federal government through Sept. 30 and the Department of Homeland Security for two weeks as lawmakers negotiate potential changes for the agency that enforces the nation’s immigration laws, often referred to as ICE. Trump urged lawmakers to back the bill in a social media post.",
      "publishedAt": "2026-02-03T05:12:18Z",
      "title": "GOP leaders labor for support ahead of key test vote on ending shutdown",
      "url": "https://apnews.com/article/government-shutdown-ice-funding-471e55ba4c3247051739ee1b50b2857a",
      "urlToImage": "https://dims.apnews.com/dims4/default/0762e30/2147483647/strip/true/crop/5328x3550+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fea%2Fc3e194ba4b9704510345ac5dd390%2Febb4e2568cef4b5f9bf132ffd6282021"
    },
    {
      "author": null,
      "description": "U.S. Central Command says a U.S. Navy fighter jet shot down an Iranian drone that was approaching the aircraft carrier USS Abraham Lincoln in the Arabian Sea. In an emailed statement Tuesday, U.S. Central Command says the drone “aggressively approached” the aircraft carrier with “unclear intent” and it “continued to fly toward the ship despite de-escalatory measures taken by U.S. forces operating in international waters.” The U.S. military says the shootdown also occurred within hours of another incident in which Iranian forces harassed a U.S.-flagged and U.S.-crewed merchant vessel that was sailing in the Strait of Hormuz.",
      "publishedAt": "2026-02-03T17:45:24Z",
      "title": "US military says it shot down Iranian drone",
      "url": "https://apnews.com/article/us-iran-drone-shot-down-military-634f406a5bb416b7a1a8bec8cc72b4b8",
      "urlToImage": "https://dims.apnews.com/dims4/default/072efe5/2147483647/strip/true/crop/4879x3251+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2Fcf%2F02e9e41a9c1be97b8a06ccc96ea7%2F6310313575204abc9c201340230aba6b"
    },
    {
      "author": "Stephen Groves",
      "description": "Former President Bill Clinton and former Secretary of State Hillary Clinton have finalized an agreement with House Republicans to testify this month in a House investigation into Jeffrey Epstein. They bowed to the threat of a contempt of Congress vote against them. Hillary Clinton will testify before the House Oversight Committee on Feb. 26. Bill Clinton will appear on Feb. 27. It will mark the first time that lawmakers have compelled a former president to testify. The arrangement comes after months of negotiating between the two sides as Republicans sought to make the Clintons a focal point in a House committee’s investigation into Epstein.",
      "publishedAt": "2026-02-03T17:52:33Z",
      "title": "Clintons finalize agreement to testify in House Epstein probe, bowing to threat of contempt vote",
      "url": "https://apnews.com/article/bill-clinton-jeffrey-epstein-contempt-716148204e58a42153c5ab20a97c3011",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d8e20a/2147483647/strip/true/crop/2858x1904+0+56/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F84%2Facbd6f614b2cc86e808cf0104cb6%2F9f458d327dc045faa1fc0ed7e3ef29f6"
    },
    {
      "author": "Jill Lawless",
      "description": "British police have opened a criminal investigation into politician Peter Mandelson over alleged misconduct related to his ties to Jeffrey Epstein. The British government says newly released Epstein files include documents that suggest Mandelson may have shared market-sensitive information with the convicted sex offender while Mandelson was a member of the British government a decade and a half ago. The Metropolitan Police force said detectives had reviewed reports of misconduct and decided they met the threshold for a full investigation. Misconduct in public office carries a maximum sentence of life in prison.",
      "publishedAt": "2026-02-03T10:40:09Z",
      "title": "UK police open criminal investigation into politician Peter Mandelson over alleged leaks to Epstein",
      "url": "https://apnews.com/article/uk-peter-mandelson-jeffrey-epstein-allegations-police-bd7d7f9831ad1eeaee4e5c7a951f2aeb",
      "urlToImage": "https://dims.apnews.com/dims4/default/a108c09/2147483647/strip/true/crop/4583x3054+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F0b%2F3ae27bdefcacf772864a93493d04%2Fee686039062c4bdb97337641c1428e04"
    },
    {
      "author": "Ryan Murphy, Sarah Raza, Steve Karnowski",
      "description": "Immigration officers with guns drawn arrested some activists who were trailing their vehicles Tuesday in Minneapolis. It's a sign tensions have not eased since the departure of a high-profile commander. At least one person wearing an anti-ICE message was handcuffed while face-down on the ground. An Associated Press photographer witnessed the arrests. There was no immediate response from the Department of Homeland Security. A federal judge ordered officers not to arrest motorists who are following but not obstructing their operations, but an appeals court set the order aside. Meanwhile, a man charged with squirting apple cider vinegar on Democratic Rep. Ilhan Omar will remain in jail.",
      "publishedAt": "2026-02-03T18:16:33Z",
      "title": "Activists in Minneapolis are arrested while trailing immigration agents",
      "url": "https://apnews.com/article/minneapolis-immigration-crackdown-arrests-29ab636ca0f7db5389418463ca8b67c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/a93bf60/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F7a%2F42d4ad32d670d6ec4fea6998ad99%2F993633c2806d4e02a1c58fb949934710"
    },
    {
      "author": "Jacques Billeaud, Sejal Govindarao",
      "description": "“Today” show host Savannah Guthrie is asking for prayers to help bring her mother home. Authorities in Arizona believe 84-year-old Nancy Guthrie was kidnapped, abducted or otherwise taken against her will. In a social media post, Savannah Guthrie said \"raise your prayers with us and believe with us that she will be lifted by them in this very moment.” For a second day Tuesday, “Today” opened with the disappearance and Savannah Guthrie wasn't at the anchor’s desk. The Pima County sheriff says it’s imperative Nancy Guthrie is found soon because she could die without her medication. She was last seen Saturday night at her home in the Tucson area.",
      "publishedAt": "2026-02-03T13:20:15Z",
      "title": "'Today' host Savannah Guthrie seeks prayers for missing mom in Arizona",
      "url": "https://apnews.com/article/savannah-guthrie-mother-missing-arizona-tucson-74d845b070fefe2d94cb92d655308e91",
      "urlToImage": "https://dims.apnews.com/dims4/default/039ef24/2147483647/strip/true/crop/3485x2322+8+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F89%2F33973dc649dbe34e480442b6c920%2F2dfae915dd9c47bab6b313653ef01709"
    },
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump is set to welcome Colombian President Gustavo Petro to the White House for talks. Tuesday's meeting comes weeks after Trump accused the Colombian leader of pumping cocaine into the United States and threatened military action against his South American country. U.S. administration officials say the meeting will focus on regional security cooperation and counternarcotics efforts. Bad blood between the leaders looms large ahead of the sit-down. Trump, on the heels of an operation to capture Venezuela’s Nicolás Maduro, warned Petro last month that he could be next. The conservative Trump and leftist Petro are ideologically far apart, but both leaders share a tendency for verbal bombast and unpredictability. That's giving the visit an anything-could-happen vibe.",
      "publishedAt": "2026-02-03T05:08:11Z",
      "title": "What to expect when Trump and Colombia's Petro meet on Tuesday",
      "url": "https://apnews.com/article/trump-colombia-petro-venezuela-36bc47d628886ea20c471a63156ec550",
      "urlToImage": "https://dims.apnews.com/dims4/default/c60485d/2147483647/strip/true/crop/2307x1537+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2Fcf%2F1de38f38197c2c74d1c677bb9637%2F7b59a9c7d81546d78d6a76ec1e46f344"
    },
    {
      "author": "Sylvie Corbet",
      "description": "French prosecutors have searched the offices of Elon Musk’s social media platform X as part of an investigation into alleged offences, including spreading child sexual abuse images and deepfakes. The investigation began in January last year and involves the prosecutors’ cybercrime unit. Prosecutors are looking into alleged complicity in possessing and spreading pornographic images of minors, among other charges. They have asked Elon Musk and former CEO Linda Yaccarino to attend voluntary interviews on April 20. Employees of X have also been summoned as witnesses. Europol is supporting the French authorities in this investigation.",
      "publishedAt": "2026-02-03T10:50:45Z",
      "title": "Paris prosecutors search Elon Musk's social media platform X offices",
      "url": "https://apnews.com/article/france-x-investigation-seach-elon-musk-1116be84d84201011219086ecfd4e0bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/a38bc68/2147483647/strip/true/crop/7681x5118+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2Fd0%2F47e3b063ae6efd879a729a33596e%2F255b9d2c8cd447a5ab63ce0bc23df02b"
    },
    {
      "author": null,
      "description": "The first husband of former first lady Jill Biden has been charged with killing his wife at their Delaware home in late December. William Stevenson was married to Jill Biden from 1970 to 1975. The 77-year-old remains in jail after failing to post $500,000 bail after his arrest Monday on first-degree murder charges. He is charged with killing 64-year-old Linda Stevenson on Dec. 28. Police were called to the home for a reported domestic dispute after 11 p.m. and found the victim unresponsive in the living room, according to a prior news release. It is not clear if William Stevenson has a lawyer.",
      "publishedAt": "2026-02-03T18:56:18Z",
      "title": "Jill Biden's first husband charged with killing wife in domestic dispute at their Delaware home",
      "url": "https://apnews.com/article/jill-biden-exhusband-murder-domestic-violence-delaware-523e98ae72c7df4ff1fbb65369dc2e15",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb929c3/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F99%2Fc66e0726d9e953d3fce7f1fb5e64%2Fa3cca37a7f554475ad14d97b326cdd68"
    },
    {
      "author": "Andrew Dampf",
      "description": "Lindsey Vonn is “confident” she can compete at the upcoming Milan Cortina Winter Olympics despite the left knee injury she sustained in a crash four days ago. Vonn says she “completely ruptured” her ACL, has bone bruising “plus meniscal damage.” She's had three days of physical therapy and consultations with doctors. Vonn has been skiing with a brace on her knee. She says, \"It feels stable, it feels strong.” She is “confident” to race. Vonn crashed in a downhill in Crans-Montana, Switzerland on Friday and ended up in the safety nets.",
      "publishedAt": "2026-02-03T15:07:39Z",
      "title": "Lindsey Vonn is 'confident' she can race at Olympics despite ruptured ACL in left knee",
      "url": "https://apnews.com/article/vonn-crash-injury-olympics-milan-bdb3be60608cc894af5f2c0c5a54dea1",
      "urlToImage": "https://dims.apnews.com/dims4/default/458aa0c/2147483647/strip/true/crop/8256x5501+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F76%2F07f6664199f510c717e418d055cf%2Ffe2ab4e3c2fd466c9f788a0251344dda"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}