{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — Mexico's government says it will not accept migrants ordered to leave US under Texas' strict new immigration law.",
      "publishedAt": "2024-03-19T23:00:22Z",
      "title": "Mexico's government says it will not accept migrants ordered to leave US under Texas' strict new immigration law",
      "url": "https://apnews.com/a17a0669686997e3c43c34b87a17b9cd",
      "urlToImage": ""
    },
    {
      "author": "JILL LAWLESS and SYLVIA HUI",
      "description": "LONDON (AP) — The late Queen Elizabeth II used to say that the royal family has to be seen to be believed.That became glaringly evident as the absence of Kate, the Princess of Wales, from public view unleashed an escalating frenzy of wild speculation, skepticism and flat-out conspiracy theories fueled by online armchair detectives.",
      "publishedAt": "2024-03-19T09:38:15Z",
      "title": "A newspaper says video of Prince William and Kate should halt royal rumor mill. That's a tall order",
      "url": "https://apnews.com/c7f3483e8850b859845897a1433b60c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d87a007b40c43e3ad12673582169d21/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "Mexico’s government said Tuesday it would not accept the return of migrants that Texas orders to leave the U.S. after the Supreme Court allowed the state to enforce a strict new immigration law signed by Republican Gov.",
      "publishedAt": "2024-03-19T18:26:17Z",
      "title": "Mexico says it won't accept migrants sent back under Texas' new immigration law",
      "url": "https://apnews.com/13ffaed316d16f42e928f6958f0658f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e486f5f981c14cf2a59d28b23e598ebc/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — The U.S. Supreme Court will allow Texas to start arresting migrants who cross the U.S.-Mexico border and ordering them to leave, while the legal battle over Republican Gov. Greg Abbott's latest immigration move plays out.",
      "publishedAt": "2024-03-16T04:05:55Z",
      "title": "How Texas' plans to arrest migrants for illegal entry will work",
      "url": "https://apnews.com/2edc0f202156bf792cd531e814bbf2f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc8d09a6b0ea487884254d38ca3d6eac/1920.jpeg"
    },
    {
      "author": "PATRICK ORSAGOS, CODY JACKSON, MICHELLE L. PRICE and BILL BARROW",
      "description": "COLUMBUS, Ohio (AP) — Five states are holding presidential primaries on Tuesday as President Joe Biden and former President Donald Trump continue to lock up support around the country after becoming their parties’ presumptive nominees.",
      "publishedAt": "2024-03-19T04:04:29Z",
      "title": "Tuesday's primaries include a key Senate race in Ohio and clues for the Biden-Trump rematch",
      "url": "https://apnews.com/8b2414273d7e4d46f5696268ae89a7f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6372e7417e6d41c0aa761a9218016a8e/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump is hurtling toward a critical deadline in his most costly legal battle to date. If the former president doesn’t come up with a financial guarantee by Monday, New York’s attorney general can start the process of collecting on the more than $454 million Trump owes the state in a civil fraud lawsuit.",
      "publishedAt": "2024-03-19T18:23:17Z",
      "title": "Key questions as Trump hurtles toward deadline to pay $454 million fraud penalty",
      "url": "https://apnews.com/b8d05874b48b7d7096d7c0f4a3248b54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30d1984948164492bc0cdac70351eb70/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — The top two U.S. generals who oversaw the evacuation of Afghanistan as it fell to the Taliban in August 2021 blamed the Biden administration for the chaotic departure, telling lawmakers Tuesday that it inadequately planned for the evacuation and did not order it in time.",
      "publishedAt": "2024-03-19T19:35:44Z",
      "title": "Top former US generals say failures of Biden administration in planning drove chaotic fall of Kabul",
      "url": "https://apnews.com/620fd2ca8187389da38ddcf3f9466fbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c44d2f92cdd406dafe7540580d25827/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Lawyers for Donald Trump urged the U.S. Supreme Court on Tuesday to dismiss an indictment charging the former president with conspiring to overturn the results of the 2020 election, renewing their arguments that he is immune from prosecution for official acts taken in the White House.",
      "publishedAt": "2024-03-19T20:39:02Z",
      "title": "Trump asks Supreme Court to dismiss case charging him with plotting to overturn 2020 election",
      "url": "https://apnews.com/8976f74a66ace32376fc8bcc88b611c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/597c83fa4a4b46fb8abfd305b20161d7/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Catastrophic hunger is so dire in two world hotspots that famine is imminent in northern Gaza and approaching in Haiti, with hundreds of thousands of people in both places struggling to avoid starvation.",
      "publishedAt": "2024-03-19T18:41:45Z",
      "title": "Gaza and Haiti are on the brink of famine, experts say. Here's what that means.",
      "url": "https://apnews.com/16215137be084e51849c41a83335119d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53378c23351e42dcb35842864e34a4ca/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and ALANNA DURKIN RICHER",
      "description": "MIAMI (AP) — Former White House adviser Peter Navarro reported to prison Tuesday for a contempt of Congress conviction, becoming the first senior Trump administration official to be locked up for a crime related to the Jan.",
      "publishedAt": "2024-03-19T16:27:30Z",
      "title": "Peter Navarro is 1st Trump White House official to serve prison time related to Jan. 6 attack",
      "url": "https://apnews.com/ea6f0e60dda1a7bcaef31012cd2c7678",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c606db1172045f19312f99a3a9afdfb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}