{
  "articles": [
    {
      "author": "Kamila Hrabchuk",
      "description": "Negotiators from Moscow and Kyiv are holding a second day of U.S.-brokered talks in Abu Dhabi to end their war. The discussions come amid increased Russian attacks on Ukraine’s power grid and after a rise in civilian casualties. Ukrainian President Volodymyr Zelenskyy is urging allies to pressure Moscow to end the invasion, which began in 2022. He emphasizes the need for security guarantees to prevent future Russian attacks. Fighting continues alongside the talks, with Russia targeting Ukraine’s electricity network. Human Rights Watch reports a 31% increase in Ukrainian civilian casualties last year. Almost 15,000 civilians have been killed since the war began.",
      "publishedAt": "2026-02-05T09:06:30Z",
      "title": "Abu Dhabi hosts second day of US-brokered talks to end Moscow-Kyiv conflict",
      "url": "https://apnews.com/article/russia-ukraine-talks-peace-abu-dhabi-witkoff-31ccc70ae7599507bc5a98a6cd87e2aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/91481ca/2147483647/strip/true/crop/8099x5397+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Fa0%2Fd20f343055ac3e270c725f80d644%2Fd005242a68d7456da1604160df4244e6"
    },
    {
      "author": "Jill Lawless",
      "description": "British Prime Minister Keir Starmer has apologized to victims of Jeffrey Epstein for appointing Peter Mandelson as the U.K.'s ambassador to Washington. On Thursday, he expressed regret for believing Mandelson's lies and appointing him. Starmer fired Mandelson in September after emails showed Mandelson maintained a friendship with Epstein following the financier’s 2008 conviction for sex offenses involving a minor. The prime minister now faces fresh pressure over the appointment after newly released documents revealed more details of Mandelson’s close relationship with Epstein. British police are investigating Mandelson over potential misconduct in public office. He is not accused of any sexual offenses.",
      "publishedAt": "2026-02-05T11:41:25Z",
      "title": "UK's Starmer says sorry to Epstein victims for appointing Mandelson as ambassador",
      "url": "https://apnews.com/article/uk-starmer-peter-mandelson-epstein-ea1e52adb8399eb97825f5c34b3c7343",
      "urlToImage": "https://dims.apnews.com/dims4/default/803197c/2147483647/strip/true/crop/5336x3556+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F30%2Ff767e0fccacbf569dab6ba9010b6%2Fbd26b5e792d247198d9ff07c2f01a731"
    },
    {
      "author": "Philip Marcelo",
      "description": "Nude photos. The names and faces of sexual abuse victims. Bank account and Social Security numbers in full view. All of these things appeared in the mountain of documents released publicly by the U.S. Justice Department as part of its effort to comply with a law requiring it to open its investigative files on Jeffrey Epstein. A review by The Associated Press and other news organizations has found countless examples of sloppy, inconsistent or nonexistent redactions that have revealed sensitive private information. Lawyers for some of the accusers have called on the Justice Department to temporarily take down the information. The Justice Department says it is taking down all inadvertently disclosed private information it’s been made aware of.",
      "publishedAt": "2026-02-04T23:23:13Z",
      "title": "Nude photos and potential victims exposed in Epstein files",
      "url": "https://apnews.com/article/jeffrey-epstein-files-28a28aeebcfd49890e0810eb69992724",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a3bd63/2147483647/strip/true/crop/5712x3806+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F15%2Ffd43a7b69b7c5e89658d4efd4bf4%2Fe1d4a2fb22ac4d79887a443282010a67"
    },
    {
      "author": "Sejal Govindarao, Jacques Billeaud",
      "description": "There has been no public sign of a response to NBC “Today” show host Savannah Guthrie’s message to her 84-year-old mother’s kidnapper. In a recorded video posted Wednesday on social media, Guthrie said her family is ready to talk. But she says they want proof that Nancy Guthrie, who authorities believe was taken from her home in Arizona against her will, is still alive. Guthrie says her family heard media reports about a ransom letter. Nancy Guthrie was last seen Saturday night and she was reported missing midday Sunday after she didn’t appear at a church. Authorities on Wednesday offered no detailed update on their search. Their next news conference is scheduled for Thursday.",
      "publishedAt": "2026-02-05T12:34:13Z",
      "title": "No sign of response to Guthrie's message to her mom's kidnapper",
      "url": "https://apnews.com/article/savannah-guthrie-nancy-guthrie-mom-missing-2765f354b498e6146b955162c3b71d4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/156b2e7/2147483647/strip/true/crop/2341x1560+329+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F19%2Fc59e122a370290bd5210f2e5762f%2Ff085a4ce99ef43ceab5ce9c26dfa3a55"
    },
    {
      "author": "Claire Rush",
      "description": "A judge says U.S. immigration agents in Oregon must stop arresting people without warrants unless they are likely to escape. U.S. District Judge Mustafa Kasubhai issued the preliminary injunction Wednesday. The ruling came in response to a lawsuit filed by a nonprofit law firm representing a man who was detained by immigration officers without a warrant despite having a valid work permit. In a memo last week, the acting head of U.S. Immigration and Customs Enforcement emphasized that agents should not make arrests without an administrative arrest warrant issued by a supervisor unless they develop probable cause to believe the person is likely to escape from the scene.",
      "publishedAt": "2026-02-05T01:57:31Z",
      "title": "Federal judge restricts warrantless immigration arrests in Oregon",
      "url": "https://apnews.com/article/immigration-warrantless-arrests-ice-oregon-lawsuit-f21f3856e3c60e283e7be4bac1f04272",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c650f0/2147483647/strip/true/crop/6374x4247+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F2d%2Ff13bc428578d7795cdf09d62974d%2F3eb754e9c80d42bc9bd58b0c92672662"
    },
    {
      "author": "Sam Metz",
      "description": "As Israeli strikes killed two dozen Palestinians on Wednesday, many in Gaza wondered what had become of the ceasefire reached between Israel and Hamas in October. Both sides accuse the other of violations, even as they continue to push ahead with the fragile process. At least 556 Palestinians have been killed in Israeli strikes since the U.S.-brokered truce came into effect, according to Gaza’s Health Ministry. Four Israeli soldiers have been killed in Gaza in the same period, with more injured, including a soldier who was severely wounded overnight. Little progress has been made on larger issues concerning Gaza's future.",
      "publishedAt": "2026-02-05T05:01:06Z",
      "title": "Violence is flaring in Gaza months after the Israel-Hamas ceasefire",
      "url": "https://apnews.com/article/israel-hamas-war-ceasefire-explainer-4c39a62c2ab250a7e365c8edcbadcfd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/b56a2fa/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fb5%2F03580b698a0ed7b70b30d85a6b80%2F3710198f136f4a0ea0adda0f75d06b31"
    },
    {
      "author": "Regina Garcia Cano, Joshua Goodman",
      "description": "In Venezuela, political critics are emerging from hiding following the U.S.-backed ouster of President Nicolás Maduro. Andrés Velásquez, a former governor, is among those speaking out after years of self-imposed silence. He recently appeared in videos supporting Maduro's removal and calling for the release of political prisoners. He likened the shift to glasnost, with media outlets reopening to critical voices. However, concerns remain about the true extent of political liberalization, as the repressive state apparatus is still in place. The future of Venezuela's democratic transition remains uncertain.",
      "publishedAt": "2026-02-05T15:41:45Z",
      "title": "Venezuelan critics test limits of free speech after Maduro's ouster",
      "url": "https://apnews.com/article/venezuela-democracy-trump-maduro-rodriguez-oil-6b28b2713d73c7527a661ff47c122423",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f6e40d/2147483647/strip/true/crop/3598x2397+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2F70%2Fc9393097501aa4a119513bb159fa%2F25072b3d979448aba3dafcf74bed539e"
    },
    {
      "author": "Alanna Durkin Richer",
      "description": "The Justice Department is intensifying efforts to choke off cartels’ financial networks, targeting the money launderers who are increasingly relying on cryptocurrency to move drug proceeds from the U.S. to Mexico. The cases of four defendants recently sent from Mexico to the U.S. for prosecution provide a glimpse into shadowy money laundering networks that keep the Jalisco New Generation Cartel and other violent groups in business pumping drugs into American communities. Indictments have been filed in Kentucky’s federal court. The prosecutions underscore the Justice Department’s efforts to turn up the pressure on cartels and stay ahead of their evolving and sophisticated tactics to launder massive drug proceeds across the border without detection.",
      "publishedAt": "2026-02-05T12:45:26Z",
      "title": "Justice Department targets cartels' financial networks",
      "url": "https://apnews.com/article/justice-department-cartels-money-laundering-cryptocurrency-4f64f93f0a4e7135bbba184f2832a041",
      "urlToImage": "https://dims.apnews.com/dims4/default/911d188/2147483647/strip/true/crop/5842x3893+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F11%2Ffaa5b1e288aed03e23d672c149ae%2F298dfb8c856f48aba8bc6544f17521e0"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "Shares have retreated in Asia on heavy selling of technology stocks, while the price of bitcoin fell as much as 8%. South Korea's Kospi dropped nearly 4%, while U.S. futures edged lower. Oil prices sank more than $1 a barrel. On Wednesday, the S&P 500 fell 0.5% for its fifth modest loss in the last six days. The Dow Jones Industrial Average rose 0.5%, and the Nasdaq composite sank 1.5%. More than twice as many stocks rose within the S&P 500 than fell, but the index sank as Advanced Micro Devices and other influential tech stocks weakened. AMD dropped even though the chip company reported a stronger profit for the latest quarter than analysts expected.",
      "publishedAt": "2026-02-05T03:00:52Z",
      "title": "Bitcoin plunges 8% and Korea's Kospi sinks 4% in latest tech-led sell-off",
      "url": "https://apnews.com/article/stocks-markets-tech-rates-gold-trump-d4ed66429ffa2f50f2feea99b0e583ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/785313e/2147483647/strip/true/crop/6705x4468+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F51%2Fd3a1cafb47bfe1e9033851fd6227%2Fa18d7f7ae07a430693a82db5d0935439"
    },
    {
      "author": "Steve Megargee",
      "description": "Giannis Antetokounmpo and Ja Morant are waiting to learn whether they’ll be changing addresses after a former MVP and plenty of other big-name players already have switched teams ahead of the Thursday's NBA trade deadline. Antetokounmpo has been the center of attention heading into the trade deadline amid reports that the Milwaukee Bucks have started listening to offers for the two-time MVP and nine-time all-NBA selection. The trade deadline is at 3 p.m. Eastern. Antetokounmpo repeatedly has said that he loves playing in Milwaukee, but he also has emphasized that he wants to continue playing for teams committed to competing for championships.",
      "publishedAt": "2026-02-05T14:58:03Z",
      "title": "Antetokounmpo is the center of attention heading into trade deadline",
      "url": "https://apnews.com/article/nba-milwaukee-bucks-memphis-grizzlies-d4122fece6c1115cfdb8733d51e70bb1",
      "urlToImage": "https://dims.apnews.com/dims4/default/de48a06/2147483647/strip/true/crop/5164x3441+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F75%2Ff1bb9a2458c5c0e8c910281db714%2F779ebbd76ebd484b8d11bc3aeabb139a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}