{
  "articles": [
    {
      "author": "DAN MERICA and ALI SWENSON",
      "description": "WASHINGTON (AP) — Former President Donald Trump has been active on his social accounts as Democrats gather for their convention in Chicago, but some of his posts don’t have much to do with reality.",
      "publishedAt": "2024-08-20T19:48:44Z",
      "title": "Trump’s post of fake Taylor Swift endorsement is his latest embrace of AI-generated images",
      "url": "https://apnews.com/fec99c412d960932839e3eab8d49fd5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e7ebbb8003d43fc9e2f0053ac03372f/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "ASHEBORO, N.C. (AP) — Donald Trump is holding his first outdoor rally since narrowly surviving an attempted assassination in Pennsylvania last month.",
      "publishedAt": "2024-08-21T16:31:56Z",
      "title": "Trump is set to hold his first outdoor rally since last month's assassination attempt",
      "url": "https://apnews.com/60de08931c1a964e8e1fb21d3778d35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef8ad18dc61b44f7bace7b38e1fa769b/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, JONATHAN J. COOPER and ZEKE MILLER",
      "description": "CHICAGO (AP) — Vice presidential nominee Tim Walz and former President Bill Clinton are headlining the Democratic National Convention on Wednesday, the third day of the party’s choreographed rollout of a new candidate, Kamala Harris, and her pitch to voters.",
      "publishedAt": "2024-08-21T10:27:26Z",
      "title": "Tim Walz and Bill Clinton headline the Democrats' third day with a focus on 'fight for freedoms'",
      "url": "https://apnews.com/4f299bd2684c0284dd100f7f0731172f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65059596e1b841b99383ffdbe3afffdf/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN, JAKE OFFENHARTZ, JOEY CAPPELLETTI and LEA SKENE",
      "description": "CHICAGO (AP) — At least 55 protesters were arrested following violent clashes with police in Chicago on the second night of the Democratic National Convention, a situation the police chief called “a danger to our city.”",
      "publishedAt": "2024-08-21T16:50:29Z",
      "title": "At least 55 arrested after clashes with police outside Israeli Consulate in Chicago during DNC",
      "url": "https://apnews.com/ea3bc9193cc99a5c95ebfd1a42db924f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a7002a5f4bb454ca9e735901d371e58/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD, DANICA KIRKA and SILVIA STELLACCI",
      "description": "PORTICELLO, Sicily (AP) — Divers searching the wreck of a superyacht that sank off Sicily found the bodies of five passengers Wednesday and searched for one more as questions intensified about why the vessel sank so quickly when a nearby sailboat remained largely unscathed.",
      "publishedAt": "2024-08-21T14:13:01Z",
      "title": "Divers find 5 bodies during search of superyacht wreckage after it sank off Sicily, 1 still missing",
      "url": "https://apnews.com/cb3a667f240fba758198164678eaf01b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76aae4cf0bc54f378b1934712e6e4d83/1920.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "FORT LAUDERDALE, Fla. (AP) — A former babysitter pleaded guilty to manslaughter Wednesday for the 2019 death of a man she was accused of disabling as an infant 40 years ago.Terry McKirchy, 62, accepted a plea deal for the death of Benjamin Dowling, who died at 35 after a life of severe disabilities caused by a brain hemorrhage he suffered in 1984 when he was 5 months old while at McKirchy’s suburban Fort Lauderdale home.",
      "publishedAt": "2024-08-21T14:29:28Z",
      "title": "Babysitter pleads guilty to manslaughter for 2019 death of man she injured as baby in 1984",
      "url": "https://apnews.com/b03429448bcfe1b739d744cfd26e2930",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Moscow came under one of the largest attacks by Ukrainian drones since the start of fighting in 2022, Russian authorities reported Wednesday, saying they destroyed all of those headed toward the capital.",
      "publishedAt": "2024-08-21T07:13:36Z",
      "title": "Moscow sees one of Ukraine's largest drone attacks as fighting rages in Kursk and eastern Ukraine",
      "url": "https://apnews.com/829eac0d80851258f03d8d9cbaf71eea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37fe6d3e1d9a42ac91e16722fd456069/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "A year ago this week, President Vladmir Putin strode onto a stage in the Kursk region to commemorate the 80th anniversary of one of the Soviet army's proudest moments in World War II.Addressing a rapt audience that included soldiers fresh from fighting in Ukraine, Putin called the decisive victory in the Battle of Kursk “one of the great feats of our people.”",
      "publishedAt": "2024-08-21T04:13:07Z",
      "title": "Putin's slow response to the Kursk attack could test the patience of some of his backers in Russia",
      "url": "https://apnews.com/72d96d8cb52c105e9289dc6909900b13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8b8ec20401b48298557f822fed4a101/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Lebanon’s Hezbollah on Wednesday launched more than 50 rockets, hitting a number of private homes in the Israeli-annexed Golan Heights.The attack came a day after U.S. Secretary of State Antony Blinken met with fellow mediators Egypt and Qatar as he pressed ahead with the latest diplomatic mission to secure a cease-fire in the war in Gaza, even as Hamas and Israel signaled that challenges remain.",
      "publishedAt": "2024-08-21T07:50:36Z",
      "title": "Israel-Hamas war latest: Hezbollah fires more than 50 rockets, hitting Israeli-annexed Golan Heights",
      "url": "https://apnews.com/e81f90961a6b16e47e3203e3a0261218",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/136fe8a5e91d41999694aa96465d8a1f/1920.jpeg"
    },
    {
      "author": "DEVI SHASTRI, DEVNA BOSE and KENYA HUNTER",
      "description": "Federal officials affirmed this month that the pain people might feel when getting an IUD can be more than doctors' promises of “just a pinch.\"The local anesthetic lidocaine “might be useful for reducing patient pain” when inserting intrauterine devices, according to new guidance from the U.S.",
      "publishedAt": "2024-08-21T14:44:34Z",
      "title": "It’s not just IUDs. Gynecologists and patients are focused on making procedures less painful",
      "url": "https://apnews.com/f25a198bada157a53514e84dbf57c5a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55a7803b515f46708e4ce5ddeec016b1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}