{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — After prosecutors’ lead witness painted a tawdry portrait of “catch and kill” tabloid schemes, defense lawyers in Donald Trump’s hush money trial are poised Friday to dig into an account of the former publisher of the National Enquirer and his efforts to protect Trump from negative stories during the 2016 election.",
      "publishedAt": "2024-04-26T04:01:57Z",
      "title": "Trump's lawyers will grill ex-tabloid publisher as 1st week of hush money trial testimony wraps",
      "url": "https://apnews.com/868e6b9d30a039d5009ec6a9d7e96ff7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c38f937b70d544f2b5dab82dda041a99/1920.jpeg"
    },
    {
      "author": "BERNARD CONDON",
      "description": "NEW YORK (AP) — Rooting for Donald Trump to fail has rarely been this profitable.Just ask a hardy band of mostly amateur Wall Street investors who have collectively made tens of millions of dollars over the past month by betting that the stock price of his social media business — Truth Social — will keep dropping despite massive buying by Trump loyalists and wild swings that often mirror the candidate’s latest polls, court trials and outbursts on Trump Social itself.",
      "publishedAt": "2024-04-26T04:05:59Z",
      "title": "Rooting for Trump to fail has made his stock shorters millions",
      "url": "https://apnews.com/986566b8b876cd5ddae909029fd410c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9bcb2af74734e129650daa8c36ee0f6/2553.jpeg"
    },
    {
      "author": "STEVE LeBLANC and NICK PERRY",
      "description": "The students at Columbia University who inspired pro-Palestinian demonstrations across the country dug in at their encampment for the 10th day Friday as administrators and police at campuses from California to Massachusetts wrestled with how to address protests that have seen scuffles with police and hundreds of arrests.",
      "publishedAt": "2024-04-26T04:23:05Z",
      "title": "As some universities negotiate with pro-Palestinian protesters, others quickly call the police",
      "url": "https://apnews.com/e8a2e657e2614f94373beae602e9ba9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4d639e4bb834e6caf7ced952db52639/1920.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH and WAFAA SHURAFA",
      "description": "RAFAH, Gaza Strip (AP) — A premature Palestinian infant, rescued from her mother's womb shortly after the woman was killed in an Israeli airstrike, has died, her uncle said Friday.",
      "publishedAt": "2024-04-26T09:15:52Z",
      "title": "Premature baby girl rescued from her dead mother's womb dies in Gaza after 5 days in an incubator",
      "url": "https://apnews.com/c39c281b545485aa4076f60459f2234a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4904bccf6da0446180955b9e9de70474/3000.jpeg"
    },
    {
      "author": "RYAN J. FOLEY, CARLA K. JOHNSON and SHELBY LUM",
      "description": "Demetrio Jackson was desperate for medical help when the paramedics arrived.The 43-year-old was surrounded by police who arrested him after responding to a trespassing call in a Wisconsin parking lot.",
      "publishedAt": "2024-04-26T10:16:50Z",
      "title": "Dozens of deaths reveal risks of injecting sedatives into people restrained by police",
      "url": "https://apnews.com/621909ba7491abc2af8ad2e33ba3415b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4af54dfcdc9a466b8b0be09baad3ef52/1920.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "NEW YORK (AP) — #MeToo founder Tarana Burke has heard it before. Every time there’s a legal setback, the movement is declared dead in the water. A legal success, and presto, it’s alive again.So Burke, who nearly two decades ago coined the phrase “Me too” from her work with sexual assault survivors, found herself again declaring after New York's highest court on Thursday overturned Harvey Weinstein’s 2020 rape conviction: The #MeToo reckoning is greater than any court case.",
      "publishedAt": "2024-04-26T04:43:08Z",
      "title": "‘The movement will persist’: Advocates stress Weinstein reversal doesn’t derail #MeToo reckoning",
      "url": "https://apnews.com/8272c7113b53714c51cb54111cd01bee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/144d5fea3d954a8d99e3d8815667fdbc/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "BEIJING (AP) — U.S. Secretary of State Antony Blinken met Friday with Chinese President Xi Jinping and senior Chinese officials, stressing the importance of “responsibly managing” the differences between the United States and China as the two sides butted heads over a number of contentious bilateral, regional and global issues.",
      "publishedAt": "2024-04-26T02:23:16Z",
      "title": "Antony Blinken meets with China's President Xi as US, China spar over bilateral and global issues",
      "url": "https://apnews.com/8c1c453df3afbd6ec87ced0c8d618064",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cb4d7db9c294c16b860d749839d36e3/1920.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — TikTok is in the crosshairs of authorities in the U.S., where new legislation threatens a nationwide ban unless its China-based parent ByteDance divests.",
      "publishedAt": "2024-04-26T09:32:09Z",
      "title": "These are the countries where TikTok is already banned",
      "url": "https://apnews.com/376f32d78861e14e65ec4bc78e808a0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fd8f045133d468093cc6a9104ae92d1/3000.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — As 72-year-old Nonki Kunene walks through the corridors of Thabisang Primary School in Soweto, South Africa, she recalls the joy she and many others felt 30 years ago when they voted for the first time.",
      "publishedAt": "2024-04-26T05:23:39Z",
      "title": "South Africa will mark 30 years of freedom amid inequality, poverty and a tense election ahead",
      "url": "https://apnews.com/2c38c670bc9a90b65b53670439220c56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/451596866f0f4f52a878fd03bfd75a76/1992.jpeg"
    },
    {
      "author": "ROB MAADDI",
      "description": "DETROIT (AP) — Caleb Williams swiftly walked on stage, looked out and screamed “Woooo! Yeah!” Long-suffering Bears fans felt his joy.Williams is heading to the Windy City, aiming to become the franchise quarterback Chicago has sought for decades.",
      "publishedAt": "2024-04-26T00:20:16Z",
      "title": "Quarterbacks Williams, Daniels, Maye, Penix, McCarthy and Nix selected in top 12 of NFL draft",
      "url": "https://apnews.com/36120e9df01c0cdaebf0e621cfbd2a8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44e815103c134771b1b837f0322b8846/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}