{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike early Thursday on a school-turned-shelter in central Gaza that the military claimed was being used as a Hamas compound killed at least 30 people, including five children, according to local health officials.",
      "publishedAt": "2024-06-06T03:45:56Z",
      "title": "An Israeli strike on a Gaza school that the military claims was being used by Hamas kills 30 people",
      "url": "https://apnews.com/3d07e712f8abc1e08339163180823fb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff35140e31054aa5a622ee3a86eec385/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK and JULIA FRANKEL",
      "description": "SOUTH HEBRON HILLS, West Bank (AP) — For weeks after being sanctioned by the United States, Yinon Levi struggled to pay the bills, living at his farming outpost atop a hill in the occupied West Bank.",
      "publishedAt": "2024-06-06T04:10:58Z",
      "title": "Israeli settlers in the West Bank were hit with international sanctions. It only emboldened them",
      "url": "https://apnews.com/354f8b0a44b70c25bf013614b4775900",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f572d612b6c44c12b1fedd4e6f7795b7/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "UTAH BEACH, France (AP) — As the sun sets on the D-Day generation, it’s rising again over Normandy beaches where soldiers fought and died exactly 80 years ago Thursday, kicking off intense anniversary commemorations against the backdrop of renewed war in Europe, in Ukraine.",
      "publishedAt": "2024-06-06T02:07:16Z",
      "title": "The sun rises over Normandy's beaches on D-Day's 80th anniversary",
      "url": "https://apnews.com/7b6896a9d891fb2d2f75b29e1cfd67ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eba6cf7d3bd4394b754705ce2f18e6d/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, RANDALL CHASE, COLLEEN LONG and MIKE CATALINI",
      "description": "WILMINGTON, Del. (AP) — Jurors in Hunter Biden's criminal trial got a look at the .38 caliber Colt revolver he bought back in October 2018. They saw Form 4473, the firearms transaction record at the center of the case.",
      "publishedAt": "2024-06-06T04:09:40Z",
      "title": "Jurors in Hunter Biden's trial hear from the clerk who sold him the gun at the center of the case",
      "url": "https://apnews.com/62de446479ddcdb040c6a5418c6d28fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aafbfc8b583047fbb8d1294aa59dd7a8/2851.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and JOEY CAPPELLETTI",
      "description": "In Michigan's Upper Peninsula, two Republican members of a county canvassing board last month refused to sign off on the results of an election that led to the recall of three GOP members of the county commission.",
      "publishedAt": "2024-06-06T04:03:54Z",
      "title": "Election certification disputes in a handful of states spark concerns over presidential contest",
      "url": "https://apnews.com/09bb9d1fdc11b495b7c50687e5576997",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2e3417c963942ae92a5de2caba42c6f/3000.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — Polls opened in the Netherlands on Thursday to kick off four days of voting in European Union parliamentary elections across the 27 member states that are expected to deliver gains for the hard right.",
      "publishedAt": "2024-06-06T04:00:41Z",
      "title": "Netherlands kicks off 4 days of European Union elections across 27 nations",
      "url": "https://apnews.com/d1a866c87bf53f16211cf8d2adc0685a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f33f3d135124e85b6a1b7a9b5a8df8f/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — India’s bruised and battered opposition was largely written off in the lead-up to the national election as too weak and fragmented to take on Prime Minister Narendra Modi and his powerful Hindu nationalist governing party.",
      "publishedAt": "2024-06-06T03:07:41Z",
      "title": "India’s opposition, written off as too weak, makes a stunning comeback to slow Modi's juggernaut",
      "url": "https://apnews.com/0fdadcf9aaa0d80072c3f15b6759969c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21c760cc93fd428cb923e776d0eb3d63/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY",
      "description": "CAPE TOWN, South Africa (AP) — South Africa is in a moment of deep soul-searching after an election that brought a jarring split from the African National Congress, the very party that gave it freedom and democracy 30 years ago.",
      "publishedAt": "2024-06-06T04:04:20Z",
      "title": "South Africa questions its very being. Yet a difficult change has reinforced its young democracy",
      "url": "https://apnews.com/3a3db2d2454c1de1ef60e55d9c1ecd54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4792545c3ddb401ea0492426539e3ff6/3000.jpeg"
    },
    {
      "author": null,
      "description": "LIVONIA, Mich. (AP) — A toddler was killed and his mother was injured when a tornado struck suburban Detroit without warning, while five people were injured when a tornado in Maryland collapsed structures and trapped people inside.",
      "publishedAt": "2024-06-06T05:22:18Z",
      "title": "Tornado hits Michigan without warning, killing toddler, while twister in Maryland injures 5",
      "url": "https://apnews.com/a95e55dfbad6dd7ecf847a1983876bdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/484746d50e9944ae8a9a8e51f9f407e2/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and ELLIOT SPAGAT",
      "description": "DULZURA, Calif. (AP) — Abigail Castillo was about to cross the U.S. border illegally when she heard President Joe Biden was halting asylum. She continued anyway, walking hours through the mountains east of San Diego with her toddler son, hoping it wasn't too late.",
      "publishedAt": "2024-06-06T04:11:51Z",
      "title": "Migrants are rattled and unsure as deportations begin under new rule halting asylum",
      "url": "https://apnews.com/47ce1480fc34814e9e622fb99b2ed7e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b9db99725134d02b91b53de049b9900/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}