{
  "articles": [
    {
      "author": "NICK PERRY and KAREN MATTHEWS",
      "description": "NEW YORK (AP) — Columbia University said early Wednesday that it was making “important progress” with pro-Palestinian student protesters who set up a tent encampment and that it was extending a deadline to clear out, yet standoffs remained tense on the Ivy League campus in upper Manhattan.",
      "publishedAt": "2024-04-24T05:23:23Z",
      "title": "Columbia University cites progress with Gaza war protesters following encampment arrests",
      "url": "https://apnews.com/47f4f7f0916a6493b79eede3e4d0a55d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b0bbd048dd34f7e87a3d76213c10376/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT, MICHELLE L. PRICE and CHRIS MEGERIAN",
      "description": "NEW YORK (AP) — Student protests over the war in Gaza have created a new and unpredictable challenge for President Joe Biden as he resists calls to cut off U.S.",
      "publishedAt": "2024-04-24T04:05:58Z",
      "title": "Biden tries to navigate the Israel-Hamas war protests roiling college campuses",
      "url": "https://apnews.com/2337121fb3620d2a4a6b2e22aaaf59bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ab15e36117644118bb7b4fdc054b524/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United Nations called Tuesday for “a clear, transparent and credible investigation” of mass graves uncovered at two major hospitals in war-torn Gaza that were raided by Israeli troops.",
      "publishedAt": "2024-04-23T22:21:30Z",
      "title": "UN calls for investigation into mass graves uncovered at two Gaza hospitals raided by Israel",
      "url": "https://apnews.com/dbaf873d023a7ba66dda05fb49074434",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e626e20a1f63426abc6e3310b800d232/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Supreme Court hears arguments Thursday over whether Donald Trump is immune from prosecution in a case charging him with plotting to overturn the results of the 2020 presidential election.",
      "publishedAt": "2024-04-24T04:09:08Z",
      "title": "What to listen for during Supreme Court arguments on Donald Trump and presidential immunity",
      "url": "https://apnews.com/38fd48f47324bf812e2194831ef75471",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e08354a76ec48a889e4de8e633112a5/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — A big, new package of U.S. military aid will help Ukraine avoid defeat in its war with Russia. Winning will still be a long slog.",
      "publishedAt": "2024-04-24T05:52:27Z",
      "title": "Ukraine gets a big boost of US aid. It still faces a long slog to repel Russia",
      "url": "https://apnews.com/43072858c26195f6c91565c1ebbf1629",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79b58c7dc1754f90b9a080e70e43a2d8/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden's long, painful battle with Republicans in Congress to secure urgently needed assistance for Ukraine will end Wednesday when he signs into law a $95 billion war aid measure that also includes support for Israel, Taiwan and other allies.",
      "publishedAt": "2024-04-24T09:03:37Z",
      "title": "Biden's long fight with Republicans over Ukraine aid has ended, but significant damage has been done",
      "url": "https://apnews.com/b72aed9b195818735d24363f2bc34ea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daa4672e6a854190b4c159448f4ffae1/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "No, TikTok will not suddenly disappear from your phone. Nor will you go to jail if you continue using it after it is banned. After years of attempts to ban the Chinese-owned app, including by former President Donald Trump, a measure to outlaw the popular video-sharing app has won congressional approval and is on its way to President Biden for his signature.",
      "publishedAt": "2024-04-24T04:01:27Z",
      "title": "US banning TikTok? Your key questions answered",
      "url": "https://apnews.com/5e1ff786e89da10a1b799241ae025406",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/348c2221d65b4c118835a57153557d6b/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court will consider Wednesday when doctors can provide abortions during medical emergencies in states with bans enacted after the high court’s sweeping decision overturning Roe v.",
      "publishedAt": "2024-04-24T04:01:39Z",
      "title": "Supreme Court will consider when doctors can provide emergency abortions in states with bans",
      "url": "https://apnews.com/45766f0a1ab576ce0f6515c5a1bd9e2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23a13e03407a4afca0eb307ec7f6e080/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "A conservative quest to limit diversity, equity and inclusion initiatives is gaining momentum in state capitals and college governing boards, with officials in about one-third of the states now taking some sort of action against it.",
      "publishedAt": "2024-04-24T04:09:02Z",
      "title": "A conservative quest to limit diversity programs gains momentum in states",
      "url": "https://apnews.com/597b65d8f06062cff60b2e185281870a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4010f0c3912e4a84bfd23c7918263b6d/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — Several military horses bolted during routine exercises Wednesday and ran loose through central London, injuring four people and damaging vehicles during the morning rush hour. A spokesperson for the London Ambulance Service said it was called at 8:25 a.m.",
      "publishedAt": "2024-04-24T09:42:37Z",
      "title": "Military horses run loose in central London, injuring 4 people and causing havoc",
      "url": "https://apnews.com/d0525d510fac63e28e1f6ea663e2c786",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b010d48b3b1742139399b25d241140d2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}