{
  "articles": [
    {
      "author": "WILL WEISSERT and BILL BARROW",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump are poised to move much closer to winning their parties' nominations Tuesday during the biggest day of the primary campaign, despite many voters preferring something other than a November rematch from four years ago.",
      "publishedAt": "2024-03-05T05:06:26Z",
      "title": "Biden and Trump barrel into Super Tuesday, toward a likely November rematch despite voter concerns",
      "url": "https://apnews.com/e36971a222a2b50d35cb0a2c603ce4d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4a196aa6a9b42f4bebd0e2b85668589/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Super Tuesday primaries are the largest voting day of the year in the United States aside from the November general election.Voters in 16 states and one territory are choosing presidential nominees.",
      "publishedAt": "2024-03-05T16:21:34Z",
      "title": "The Latest | President Joe Biden wins in Iowa",
      "url": "https://apnews.com/45ccad900e41fe12cb68a9e0982c610e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/627dff36671646628c8866b9940b4553/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY, TIA GOLDENBERG and WAFAA SHURAFA",
      "description": "CAIRO (AP) — Three days of negotiations with Hamas over a cease-fire in Gaza and the release of Israeli hostages failed to achieve a breakthrough on Tuesday, Egyptian officials said, less than a week before the start of the Muslim holy month of Ramadan, the informal deadline for a deal.",
      "publishedAt": "2024-03-05T13:23:42Z",
      "title": "Gaza cease-fire talks fail to achieve a breakthrough with Ramadan just days away, Egypt says",
      "url": "https://apnews.com/a13c5fa6e23fedbda42e3028a96ca14e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9207bd440a44917b148191a5a948720/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — More of President Joe Biden’s top Senate allies are demanding that the U.S. act directly to ease Palestinian civilian suffering in Gaza and are joining calls to cut military aid if Israeli Prime Minister Benjamin Netanyahu refuses to change course.",
      "publishedAt": "2024-03-05T18:21:10Z",
      "title": "Biden's closest allies are stepping up pressure on White House to do more to ease suffering in Gaza",
      "url": "https://apnews.com/8d5334a6ffbe36eb77301647affc4e01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b43e6befe68d46f28923691de3832e5a/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — Independent Sen. Kyrsten Sinema of Arizona announced on Tuesday that she won’t run for a second term after her estrangement from the Democratic Party left her politically homeless and without a clear path to reelection.",
      "publishedAt": "2024-03-05T19:27:35Z",
      "title": "Independent Sen. Kyrsten Sinema of Arizona says she won’t seek reelection, avoiding a 3-way race",
      "url": "https://apnews.com/8043c3333e6d87da2404f58339f1e1e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db0ca1b4b6dd445db7e6a89e93e84d0f/3000.jpeg"
    },
    {
      "author": "EVENS SANON, JOSHUA GOODMAN and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — It’s the one question on the minds of all Haitians ever since armed gangs plunged the long-suffering Caribbean nation into near anarchy: Where in the world is the prime minister?",
      "publishedAt": "2024-03-05T17:51:44Z",
      "title": "Haitian leader who was mysteriously absent arrives in Puerto Rico on his way home to quell violence",
      "url": "https://apnews.com/0116d2ebac1b14a587baa176818055cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ac5138d3d694433897e6b91673b8349/1920.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Alabama lawmakers facing public pressure to restart in vitro fertilization services in the state advanced legislation Tuesday to shield providers from the fallout of a court ruling that equated frozen embryos to children.",
      "publishedAt": "2024-03-05T05:34:08Z",
      "title": "Alabama lawmakers advance legislation to protect IVF providers, with final approval still ahead",
      "url": "https://apnews.com/68d773d6ee89107c9a2e569110e7e31f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa7ead41a36240629dfd00f11f7fb6a7/3000.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "Liberty University has agreed to pay an unprecedented $14 million fine for the Christian school's failure to disclose information about crimes on its campus and for its treatment of sexual assault survivors, the U.S.",
      "publishedAt": "2024-03-05T18:04:33Z",
      "title": "Liberty University will pay $14 million, the largest fine ever levied under the federal Clery Act",
      "url": "https://apnews.com/ac7f365762fb8ac8a4abb86cf4613d33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86b9ab57a4114d5fa77c4205e1696b6a/3000.jpeg"
    },
    {
      "author": "JIMMY GOLEN",
      "description": "HANOVER, N.H. (AP) — The Dartmouth men's basketball team voted to unionize Tuesday in an unprecedented step toward forming the first labor union for college athletes and another blow to the NCAA's deteriorating amateur business model.",
      "publishedAt": "2024-03-05T18:11:10Z",
      "title": "Dartmouth men's basketball team votes to unionize, though steps remain before forming labor union",
      "url": "https://apnews.com/2fd912fade62ffd81218a6dc91461962",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f3a04d10ef34266800fa2f05634de2f/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR and JAKE COYLE",
      "description": "The Academy Awards honor many things in movies but not some of the most important. Ahead of Sunday’s Oscars, AP Film Writers Lindsey Bahr and Jake Coyle make selections for their own awards — some more offbeat than others.",
      "publishedAt": "2024-03-05T21:36:54Z",
      "title": "Best cameo? Best hat? Ahead of the Oscars, AP hands out its own awards",
      "url": "https://apnews.com/bc5784b39e47a79c3108b09b9a937517",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb26069044e7498592aee0df48c019b0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}