{
  "articles": [
    {
      "author": null,
      "description": "JERUSALEM (AP) — Israel's military chief says 'misidentification' in complex conditions caused Gaza airstrikes that killed aid workers.",
      "publishedAt": "2024-04-02T22:45:46Z",
      "title": "Israel's military chief says 'misidentification' in complex conditions caused Gaza airstrikes that killed aid workers",
      "url": "https://apnews.com/b018cd8f9d8e7a738900034a66b39d80",
      "urlToImage": ""
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Some of Israel's closest allies on Tuesday condemned the deaths of seven aid workers who were killed by airstrikes in Gaza — a loss that prompted multiple charities to suspend food deliveries to Palestinians on the brink of starvation.",
      "publishedAt": "2024-04-02T05:29:52Z",
      "title": "With famine looming, aid group halts food delivery in Gaza after Israeli strike kills 7 workers",
      "url": "https://apnews.com/9bdf66771b62af37d85a2800f71c0e6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02671691e4474775b6ff86256cf6c86b/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "CAIRO (AP) — It wasn’t lack of food that pushed Heba al-Haddad and her family to leave their home in Gaza City.",
      "publishedAt": "2024-04-02T06:02:37Z",
      "title": "Forced from their Gaza home by Israeli troops, a family makes a frightening walk through a war zone",
      "url": "https://apnews.com/f1d9838c60225a8c454e372df72ca245",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3d0fd8b633e41088ae4b70bf6222466/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI and KAREEM CHEHAYEB",
      "description": "TEHRAN, Iran (AP) — Iran on Tuesday vowed to respond to an airstrike widely attributed to Israel that destroyed Iran’s Consulate in the Syrian capital of Damascus the previous day and killed 12 people, including two Iranian generals and a member of the Lebanese militant Hezbollah group.",
      "publishedAt": "2024-04-02T07:16:33Z",
      "title": "Tehran vows response after strike blamed on Israel destroyed Iran's Consulate in Syria and killed 12",
      "url": "https://apnews.com/f7a1af3a9fc67de1962d4f1589d7e9f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/253cf65cd23344669fe73ea97de7360b/3000.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — Crews opened a second temporary channel on Tuesday allowing a limited amount of marine traffic to bypass the mangled wreckage of Baltimore’s collapsed Francis Scott Key Bridge, which had blocked the vital port’s main shipping channel since its destruction one week ago.",
      "publishedAt": "2024-04-02T13:14:41Z",
      "title": "Second channel opened allowing some vessels to bypass wreckage at the Baltimore bridge collapse site",
      "url": "https://apnews.com/a533659d18ddd8a8befa80c41141e41d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc0dd2cd10b94c8194fd9a6e35776e31/1920.jpeg"
    },
    {
      "author": "EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — More than 53,000 people have fled Haiti’s capital in less than three weeks, the vast majority to escape unrelenting gang violence, according to a United Nations report released Tuesday.",
      "publishedAt": "2024-04-02T18:48:31Z",
      "title": "Haiti's surge in gang violence has led more than 53,000 to flee the capital in less than three weeks",
      "url": "https://apnews.com/9283c96bc990827e6c020f6c59710be6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb375a5023544a32a020962971c62290/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, DIDI TANG and FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — President Joe Biden and Chinese President Xi Jinping discussed Taiwan, artificial intelligence and security issues Tuesday in a call meant to demonstrate a return to regular leader-to-leader dialogue between the two powers.",
      "publishedAt": "2024-04-02T15:29:26Z",
      "title": "Biden and Xi discuss Taiwan, AI and fentanyl in a push to return to regular leader talks",
      "url": "https://apnews.com/c3317fae3e45b04cffcda5bb63adee56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7389071b8d2e4e7797cdc44bc3c886e2/3000.jpeg"
    },
    {
      "author": "AARON BEARD",
      "description": "Bruiser Flint remembers being a Massachusetts assistant coach building a resume that would one day have him running his own program. He had twice interviewed elsewhere before his moment arrived with mentor John Calipari bolting for the NBA, vacating the big chair for the Minutemen.",
      "publishedAt": "2024-04-02T16:27:29Z",
      "title": "Going from assistant to top job remains a tough climb for Black coaches in major men's conferences",
      "url": "https://apnews.com/b3cc2d7fd9b60a9060dc120ce715dbe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b00e1b973f6f44d1a381c143babd5fa6/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "NEW YORK (AP) — Book Richardson doesn’t sleep much past 5:30 a.m. anymore. That was around the time seven years ago that FBI agents pounded on his door, barged in, handcuffed him and dragged him away while his 16-year-old son, E.J., looked on helplessly.",
      "publishedAt": "2024-04-02T16:22:05Z",
      "title": "Black coaches were 'low-hanging fruit' in FBI college hoops case that wrecked careers, then fizzled",
      "url": "https://apnews.com/c2f7e25d0086aaa42f1185a6c3fa6a57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf3c8cc6787144328213db3037397790/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "BUCHA, Ukraine (AP) — Days after Russian forces withdrew from the outskirts of Kyiv in the dramatic first weeks of their full-scale invasion two years ago, a photo revealed what had become of Nataliia Verbova's missing husband.",
      "publishedAt": "2024-04-02T04:59:51Z",
      "title": "Life has returned to Ukraine's Bucha. But 2 years after the killings, some families can't move on",
      "url": "https://apnews.com/3daa8c042d8d38c4a3ecc8a9ceb5e532",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e4453fa5b6c462e80fafd3dbd170d0f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}