{
  "articles": [
    {
      "author": "FATIMA HUSSEIN",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump declared a win on stopping illegal immigration through Mexico on Wednesday after talking with that country’s leader. But Mexican President Claudia Sheinbaum suggested Mexico was already doing its part and had no interest in closing its borders.",
      "publishedAt": "2024-11-28T01:59:29Z",
      "title": "Trump claims a win on immigration after a call with Mexico's president. But she suggests no change",
      "url": "https://apnews.com/5fd2fc21950f47e5dbaf5c062c4725b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4e0e569c9bd4adab91f022e56758035/3000.jpeg"
    },
    {
      "author": "ARMANDO SOLÍS",
      "description": "URUAPAN, Mexico (AP) — Mexicans are worried that threats by Donald Trump to impose 25% tariffs could affect a wide range of iconic Mexican products and threaten entire regional economies.",
      "publishedAt": "2024-11-28T16:30:10Z",
      "title": "Avocados, tequila and other iconic Mexican products are jeopardized by Trump's tariff threats",
      "url": "https://apnews.com/7729d1b49ccb3f8daefffb29dce5e615",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d5753723fc84c0096de7de950e7645f/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and JULIA FRANKEL",
      "description": "BEIRUT (AP) — The Israeli military on Thursday said its warplanes fired on southern Lebanon after detecting Hezbollah activity at a rocket storage facility, the first Israeli airstrike a day after a ceasefire between Israel and Hezbollah took hold.",
      "publishedAt": "2024-11-28T11:09:25Z",
      "title": "Israel launches first airstrike on Lebanon since ceasefire after saying Hezbollah violated the truce",
      "url": "https://apnews.com/0ec22c89f22c471fdb44c26afc4712b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e4ed490481a4863af47f62cc47a5902/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Russia conducted a “massive” attack against Ukraine’s energy infrastructure on Thursday, firing nearly 200 missiles and drones and leaving more than a million households without power, Ukrainian officials said.",
      "publishedAt": "2024-11-28T07:12:47Z",
      "title": "Latest 'massive' Russian aerial attack cuts power to 1 million homes in Ukraine",
      "url": "https://apnews.com/4fd663599d47898be34aa858dcc48fdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f46014f6dd94ff0891e757e65ab8fc7/2267.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — The Macy's Thanksgiving Day Parade was drenched in rain Thursday and briefly disrupted by Pro-Palestinian demonstrators.",
      "publishedAt": "2024-11-28T05:20:19Z",
      "title": "Macy’s Thanksgiving Day Parade: Big balloons, wet weather and 21 protesters arrested",
      "url": "https://apnews.com/065ada5cb626421d1db6732134f5cbf0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d81474da4e6409791b1ba880146f507/1920.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — After weeks of plugging increasingly inviting discounts, retailers in the United States and several other countries are preparing for prime time: Black Friday, the bargain bonanza that still reigns as the unofficial kickoff of the holiday shopping season even if it's lost some luster.",
      "publishedAt": "2024-11-28T12:23:25Z",
      "title": "Why retailers still see Black Friday as the high point of the holiday shopping season",
      "url": "https://apnews.com/c51d6d0435fd3d1c959fbc1fc815fe87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/007edebdc7d74d6ca2ef1eaf7ba47545/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — A social media ban for children under 16 passed the Australian Senate Thursday and will soon become a world-first law.",
      "publishedAt": "2024-11-28T12:24:24Z",
      "title": "A social media ban for under-16s passes the Australian Senate and will soon be a world-first law",
      "url": "https://apnews.com/d0cde2603bdbc7167801da1d00ecd056",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d029fc91de34552a65762b520e4be41/3000.jpeg"
    },
    {
      "author": "DAN MERICA and ALI SWENSON",
      "description": "WASHINGTON (AP) — With artificial intelligence at a pivotal moment of development, the federal government is about to transition from one that prioritized AI safeguards to one more focused on eliminating red tape.",
      "publishedAt": "2024-11-28T13:06:56Z",
      "title": "The outlook is uncertain for AI regulations as the US government pivots to full Republican control",
      "url": "https://apnews.com/1d766b1ecbc4e880b61a7dcbb291565d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f90f3c865f94b009a7a5755d00f94e3/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "LUCERNE, Switzerland (AP) — Would you trust an “AI Jesus” with your innermost thoughts and troubles? Researchers and religious leaders on Wednesday released findings from a two-month experiment through art in a Catholic chapel in Switzerland, where an avatar of “Jesus” on a computer screen — tucked into a confessional — took questions by visitors on faith, morality and modern-day woes, and offered responses based on Scripture.",
      "publishedAt": "2024-11-28T06:36:08Z",
      "title": "'AI Jesus' avatar tests man's faith in machines and the divine",
      "url": "https://apnews.com/66268027fbcf4b48972d1d62541f0b16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1e4b181c97145aeaf149a495729d3fe/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN and BECKY BOHRER",
      "description": "ANCHORAGE, Alaska (AP) — In the remotest reaches of Alaska, there’s no relying on DoorDash to have Thanksgiving dinner — or any dinner — delivered.",
      "publishedAt": "2024-11-28T05:08:39Z",
      "title": "'It's a bird! It's a plane!' In Alaska, it's both, with a pilot tossing turkeys to rural homes",
      "url": "https://apnews.com/9865b07e98826a77dd3570c679600f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc08255e57354af78f617f27c914acbe/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}