{
  "articles": [
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — A divisive mobilization law in Ukraine came into force on Saturday, as Kyiv struggles to boost troop numbers after Russia launched a new offensive that some fear could close in on Ukraine’s second-largest city.",
      "publishedAt": "2024-05-18T10:19:03Z",
      "title": "Ukraine's divisive mobilization law comes into force as a new Russian push strains front-line troops",
      "url": "https://apnews.com/599753d08518b46e22bf38d1360cce86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50ca54e60b4347b7b9dd7fc3ed11a72f/3000.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "NEW YORK (AP) — One political party is holding urgent news conferences and congressional hearings over the topic. The other says it’s a dangerous distraction meant to seed doubts ahead of this year's presidential election.",
      "publishedAt": "2024-05-18T04:10:18Z",
      "title": "Noncitizen voting, already illegal in federal elections, becomes a centerpiece of 2024 GOP messaging",
      "url": "https://apnews.com/1c65429c152c2a10514b5156eacf9ca7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6cc54eb6ba743c6aa5c923362fb0495/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "DALLAS (AP) — Former President Donald Trump is expected to address thousands of members of the National Rifle Association in Texas a day after campaigning in Minnesota in the midst of his hush money trial.",
      "publishedAt": "2024-05-18T04:11:44Z",
      "title": "Donald Trump will address the NRA in Texas. He's called himself the best president for gun owners",
      "url": "https://apnews.com/de03ae7672f2b1e213da6acbf25df378",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc390af9327f43bdbe178bf01f8732d0/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "JEFFERSON CITY, Mo. (AP) — By the time Jesse Fernandez turned 18, the federal government had paid out thousands of dollars in Social Security survivor's benefits because of the death of his mother. But Jesse's bank account was empty.",
      "publishedAt": "2024-05-18T04:16:38Z",
      "title": "For decades, states have taken foster children's federal benefits. That's starting to change",
      "url": "https://apnews.com/c326723c64df9370b0e3331e49d4c297",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44eba5fb40ff47a09606ab182f3a9bc6/3000.jpeg"
    },
    {
      "author": "JAN GEBERT",
      "description": "PEZINOK, Slovakia (AP) — Slovak Prime Minister Robert Fico ’s condition was serious but stable Saturday as the man accused of trying to assassinate him faced his first court appearance.",
      "publishedAt": "2024-05-18T10:09:02Z",
      "title": "The Slovak prime minister is stable after 'miracles' in the hospital as suspect appears in court",
      "url": "https://apnews.com/25b24fa1f6caf68556a67a2d1e5f302c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a6f0c22860745559be5895aab0cdfa3/1920.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — Robert F. Kennedy Jr. has long argued that the biggest hurdle of his presidential campaign is the perception that independent candidates can't win.",
      "publishedAt": "2024-05-18T04:10:52Z",
      "title": "Here's how Robert F. Kennedy Jr. could make the first debate stage under stringent Biden-Trump rules",
      "url": "https://apnews.com/d3c5466a9a307ea4480508160f660a55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81b5769ee3294a099993ce6af5f30068/3000.jpeg"
    },
    {
      "author": "RAHIM FAIEZ",
      "description": "ISLAMABAD (AP) — Flash floods from heavy seasonal rains in western Afghanistan have killed at least 50 people and dozens remain missing, a Taliban official said on Saturday, adding the death toll was based on preliminary reports and might rise.",
      "publishedAt": "2024-05-18T07:57:24Z",
      "title": "Flash floods due to unusually heavy seasonal rains kill at least 50 people in western Afghanistan",
      "url": "https://apnews.com/25a54bd187d29df8c8cbf6d63a7656c8",
      "urlToImage": ""
    },
    {
      "author": "LEKAN OYEKANMI and DAVID J. PHILLIP",
      "description": "HOUSTON (AP) — As the Houston area works to clean up and restore power to thousands after deadly storms, it will do so Saturday under a smog warning and as all of southern Texas starts to feel the heat.",
      "publishedAt": "2024-05-18T04:12:46Z",
      "title": "Widespread power outages from deadly Houston storm raise new risk: hot weather",
      "url": "https://apnews.com/86643a6d7decd28e971774e03b52e51d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd93920052dd49afa14706675bb8cdb7/1920.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "RANCHO PALOS VERDES, Calif. (AP) — A decades-old landslide that’s rapidly accelerating has forced the dismantling of Wayfarers Chapel, an iconic Southern California church that was designed by one of famed architect Frank Lloyd Wright's sons and built among soaring redwoods and sweeping Pacific Ocean views.",
      "publishedAt": "2024-05-18T04:07:17Z",
      "title": "Landslide forces closure of iconic Southern California chapel designed by Frank Lloyd Wright's son",
      "url": "https://apnews.com/7bbb024ff5abd2db97507c89bf36db65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea916e5dcf634a5db968a362e1f4c18f/3000.jpeg"
    },
    {
      "author": "MICHAEL MAROT",
      "description": "INDIANAPOLIS (AP) — Indiana Pacers coach Rick Carlisle challenged his team to play more physically and more tenaciously Friday night.His desperate team responded with one of its most inspired performances all season.",
      "publishedAt": "2024-05-18T03:23:05Z",
      "title": "Siakam helps Pacers beat Knicks 116-103 in Game 6 to send Eastern Conference semifinals to the limit",
      "url": "https://apnews.com/dabf112b38ff4524ad3e384ef5864310",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e63760ffa31a4270974aef1d87535e48/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}