{
  "articles": [
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — As the Earth sizzled through a summer with four of the hottest days ever measured, Vice President Kamala Harris and former President Donald Trump have starkly different visions on how to address a changing climate while ensuring a reliable energy supply.",
      "publishedAt": "2024-08-31T04:04:27Z",
      "title": "Harris and Trump offer starkly different visions on climate change and energy",
      "url": "https://apnews.com/0989a331574665365330b21108f7f9b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/066c637bf9bf490aad1e54ae39119a26/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — At first glance, there's little that a 78-year-old former president and a 23-year-old internet personality might have in common.Donald Trump admitted in a recent appearance on Adin Ross' show that he only “more or less” understood livestreaming, the publishing of live video on social media.",
      "publishedAt": "2024-08-31T04:01:54Z",
      "title": "Trump courts conservative male influencers to try to reach younger men",
      "url": "https://apnews.com/dc293b71917193920e751d93030fabae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cded91040e0e4808848f26f7de73c5a7/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The U.N. health agency and partners are launching a campaign starting Sunday to vaccinate 640,000 Palestinian children in Gaza against polio, an ambitious effort amid a devastating war that has destroyed the territory's healthcare system.",
      "publishedAt": "2024-08-31T04:05:00Z",
      "title": "3 days, 640,000 children, 1.3M doses. The plan to vaccinate Gaza's young against polio",
      "url": "https://apnews.com/3acaa0dcf9744810c51032f45e609a2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ade9fce19bc4907aa2a178c9b56509b/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — The United States military and Iraq launched a joint raid targeting suspected Islamic State group militants in the country's western desert that killed at least 15 people and saw seven American troops hurt, officials said Saturday.",
      "publishedAt": "2024-08-31T01:47:38Z",
      "title": "7 US troops hurt in raid with Iraqi forces targeting Islamic State group militants that killed 15",
      "url": "https://apnews.com/4215a262b3e0bf7a2afb896c84ed6b55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58711381cf51479fb0ec71bf34e5e625/3000.jpeg"
    },
    {
      "author": "VASILISA STEPANENKO and SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — When the air raid siren bellows in the dead of night, the women in arms rush to duty. Barely two months since joining the mobile air-defense unit, 27-year-old Angelina has perfected the drill to a tee: Combat gear fitted, anti-aircraft machine gun in place, she cruised behind the wheel of a pickup, singing along to a Ukrainian song about rebellion.",
      "publishedAt": "2024-08-31T04:16:30Z",
      "title": "With men at the front lines, women watch over Ukraine's night sky for Russian drones",
      "url": "https://apnews.com/c93d97de4c39ca5a12d5906c3ee014c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cca192451364baab52cc414f9d4011b/3000.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA and MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — Brazil started blocking Elon Musk’s social media platform X early Saturday, making it largely inaccessible on both the web and through its mobile app after the company refused to comply with a judge’s order.",
      "publishedAt": "2024-08-31T04:03:18Z",
      "title": "Brazil blocks Musk’s X after company refuses to name local representative amid feud with judge",
      "url": "https://apnews.com/10dfeef83f442f6e76540ffbdf7d4c77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46bd73bfb66c49ed844ca1da0c19b900/1920.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME",
      "description": "PRETORIA, South Africa (AP) — It's a worrying question for health officials in one of the richest and most developed areas of the African continent: Why are babies being born with HIV when free medication is available to prevent mother-to-child transmission?",
      "publishedAt": "2024-08-31T04:11:14Z",
      "title": "In South Africa's richest area, mother-to-baby HIV transmission is a concern despite free prevention",
      "url": "https://apnews.com/a0760764cf494010d71896b6f2b72def",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb320af25be2463f84e94ea678cb346b/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — The sale of tickets for Oasis ’ reunion tour got off to a creaky start on Saturday as online platforms strained under demand from hundreds of thousands of fans.",
      "publishedAt": "2024-08-31T09:10:13Z",
      "title": "Error messages and lengthy online queues greet fans scrambling to secure Oasis reunion tickets",
      "url": "https://apnews.com/0ae64966bcb589faafcc5dfa28dc18bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbe7257b8b4e495e8c6aa110fa73df5e/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — Novak Djokovic did not go easy on himself when assessing the listless way he performed from the start of the U.S.",
      "publishedAt": "2024-08-31T03:51:08Z",
      "title": "Defending champion Novak Djokovic is shocked at the US Open one night after Carlos Alcaraz's loss",
      "url": "https://apnews.com/9c45dd85cf725b23c82e2ec825f741b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c5092418cf24f6aabc4931d50a27f93/2251.jpeg"
    },
    {
      "author": "JOCELYN GECKER",
      "description": "SACRAMENTO, Calif. (AP) — When she was in fifth grade, Scarlett Goddard Strahan started to worry about getting wrinkles.By the time she turned 10, Scarlett and her friends were spending hours on TikTok and YouTube watching influencers tout products for achieving today’s beauty aesthetic: a dewy, “glowy,” flawless complexion.",
      "publishedAt": "2024-08-31T04:08:10Z",
      "title": "Young girls are using anti-aging products they see on social media. The harm is more than skin deep",
      "url": "https://apnews.com/f59bb09114ab93323e3a47197a1ad914",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b40a4722bbc14a988b39744963977e80/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}