{
  "articles": [
    {
      "author": "KATE BRUMBACK and ERIC TUCKER",
      "description": "ATLANTA (AP) — Donald Trump and 18 allies were indicted in Georgia on Monday over their efforts to overturn his 2020 election loss in the state, with prosecutors using a statute normally associated with mobsters to accuse the former president, lawyers and other aides of a “criminal enterprise” to keep him in power.",
      "publishedAt": "2023-08-14T16:23:05Z",
      "title": "Trump and 18 allies charged in Georgia election meddling as former president faces 4th criminal case",
      "url": "https://apnews.com/d39562cedfc60d64948708de1b011ed3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7baad1574bfd44a58e432693f48b8667/1920.jpeg"
    },
    {
      "author": "CLAIRE RUSH, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — Hawaii officials worked painstakingly to identify the 99 people confirmed killed in wildfires that ravaged Maui and expected to release the first names Tuesday, even as teams intensified the search for more dead in neighborhoods reduced to ash.",
      "publishedAt": "2023-08-15T05:10:19Z",
      "title": "Hawaii works to identify 99 confirmed dead after Maui wildfires as teams intensify search",
      "url": "https://apnews.com/c3da091a10e7aaa69022f002d3e241b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5342bd8060f9465d9f8d471185dfd82e/1920.jpeg"
    },
    {
      "author": "CLAIRE GALOFARO, MATT SEDENSKY and CLAIRE RUSH",
      "description": "LAHAINA, Hawaii (AP) — The smoke was starting to blot out the sun. Winds were howling, and heat bore down as flames licked the trees on the horizon.",
      "publishedAt": "2023-08-14T18:41:26Z",
      "title": "They were alone in a fight to survive. Maui residents had moments to make life-or-death choices",
      "url": "https://apnews.com/8a8bf7e4257c1cedaa161e4002b3e7fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/334dc031e945423bbe6deb62f704959f/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — A massive explosion at a gas station in Russia’s southern republic of Dagestan killed 35 people and injured scores more, Russian officials said Tuesday. Russia's Health Ministry said 115 people were injured in the blast and subsequent fire, and 35 of them died, including three children.",
      "publishedAt": "2023-08-15T05:34:44Z",
      "title": "Massive explosion at a gas station in Russia's Dagestan kills 35 and injures scores more",
      "url": "https://apnews.com/0565233354e942ad1481eb5ade1aa53c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6774291ae66946b58a394603619c1016/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and DAVID McHUGH",
      "description": "TALLINN, Estonia (AP) — Russia’s central bank made a big interest rate hike Tuesday, an emergency move designed to fight inflation and strengthen the ruble after the country's currency reached its lowest value since early in the war with Ukraine.",
      "publishedAt": "2023-08-15T07:35:09Z",
      "title": "Russia's central bank makes huge interest rate hike to try to prop up falling ruble",
      "url": "https://apnews.com/a680b840eaae767471180e2dca34fc86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcdab6a83fc749c5b6909de7cc8f395b/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — The unprecedented violence shaking Ecuador claimed the life of another political leader Monday, bringing the number of politics-related slayings within the last four weeks to three, including that of a presidential candidate.",
      "publishedAt": "2023-08-15T04:22:06Z",
      "title": "Political leader in Ecuador is killed less than a week after presidential candidate's assassination",
      "url": "https://apnews.com/14a5fd781e52d31855f3fc4e9711ff84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/297ef12ea7794c58810c5e7f08e22840/3000.jpeg"
    },
    {
      "author": "JEFF McMILLAN and HANNAH SCHOENBAUM",
      "description": "States that declared themselves refuges for transgender people have essentially issued an invitation: Get your gender-affirming health care here without fearing prosecution at home.",
      "publishedAt": "2023-08-15T05:01:44Z",
      "title": "States that protect transgender health care now try to absorb demand",
      "url": "https://apnews.com/630f0a8ff873c33b7258cf0c3f6a2859",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2d820cec62c497a8d67248d7523aed8/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — Texas wants Planned Parenthood to give back millions of dollars in Medicaid reimbursements — and pay far more in fines on top of that — in a lawsuit that appears to be the first of its kind brought by a state against the largest abortion provider in the U.S.",
      "publishedAt": "2023-08-15T04:34:23Z",
      "title": "Texas wants Planned Parenthood to repay millions of dollars",
      "url": "https://apnews.com/6c016b80c0cf76e3b8f9577ad6ea8e69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ed6dc24b9f24d57a1ded62f16ca7d32/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — A strong tropical storm lashed central and western Japan with heavy rain and high winds Tuesday, causing flooding and power blackouts and paralyzing air and ground transportation while many people were traveling for a Buddhist holiday week.",
      "publishedAt": "2023-08-15T00:53:50Z",
      "title": "A strong tropical storm is lashing parts of Japan and disrupting holiday travel",
      "url": "https://apnews.com/44e746440df4ca30d30ec3a6cad9dfcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16039ed11f93484aab8bfa3f50f690e6/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The wildfire that swept across Maui a week ago turned one of the nation’s most celebrated island vistas into an ashen moonscape and killed at least 99 people, a number that officials warn could rise by scores as the search continues.",
      "publishedAt": "2023-08-15T04:21:06Z",
      "title": "AP PHOTOS: A week after Maui wildfire, islanders survey aftermath and look ahead to recovery",
      "url": "https://apnews.com/ec6e573ffb19e9fed9a8123878a09a5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0821eaeef3354ba79f5aec4d76474474/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}