{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Thousands of Palestinian families fled Wednesday from the brunt of Israel’s expanding ground offensive into Gaza’s few remaining, overcrowded refuges, as the military launched heavy strikes across the center and south of the territory, killing dozens, Palestinian health officials said.",
      "publishedAt": "2023-12-27T11:23:57Z",
      "title": "Thousands flee widening Israeli assault in central Gaza as military launches new strikes",
      "url": "https://apnews.com/5fdc12a04cabd1c7d3cf8b52cf615992",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e095fa394206477ab929471d7398cf6e/3000.jpeg"
    },
    {
      "author": "COREY WILLIAMS and NICHOLAS RICCARDI",
      "description": "Michigan’s Supreme Court is keeping former President Donald Trump on the state’s primary election ballot. The court said Wednesday it will not hear an appeal of a lower court’s ruling from groups seeking to keep Trump from appearing on the ballot.",
      "publishedAt": "2023-12-27T14:21:15Z",
      "title": "Michigan Supreme Court will keep Trump on 2024 ballot",
      "url": "https://apnews.com/b5a5d9ffa75efa63ab4780b04329e2a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f330bb5f2a44ebe8e25ad558f046f49/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "GILBERT, S.C. (AP) — Standing inside a rustic barn a short drive from the state capital, Henry McMaster shocked many South Carolina Republicans seven years ago by backing Donald Trump for president.",
      "publishedAt": "2023-12-27T05:17:39Z",
      "title": "Nikki Haley has bet her 2024 bid on South Carolina. But much of her home state leans toward Trump",
      "url": "https://apnews.com/56c0ceb5b1b93a46df87e9e88342f7f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19b88d2cd24441e5a1002b8be40ccdaa/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN AND ELLIOT SPAGAT",
      "description": "MIAMI (AP) — Pedro Naranjo idolized his father growing up and followed him into the Venezuelan air force to fly helicopters. So deep was their bond that when the older Naranjo feared being jailed for plotting against Nicolás Maduro’s socialist government, father and son fled to the United States together.",
      "publishedAt": "2023-12-27T05:34:27Z",
      "title": "Deported by US, arrested in Venezuela: One family's saga highlights Biden's migration challenge",
      "url": "https://apnews.com/ff26a7ca3143ef9603da9399ba8ecdf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adbecc8a05bd4bc795bf45718e5354ca/2000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — With the GOP presidential primaries just about to start, many Republicans aren't certain that votes will be counted correctly in their contest, as pessimism spreads about the future of both the Democratic and Republican parties, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-12-27T05:17:01Z",
      "title": "Americans sour on the primary election process and major political parties, an AP-NORC poll says",
      "url": "https://apnews.com/f2d3cca7c3b5803a28c06a85d7d8772b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1671e0fcbba34793b56ef20b42028671/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Tom Smothers, half of the Smothers Brothers and the co-host of one of the most socially conscious and groundbreaking television shows in the history of the medium, has died at 86.",
      "publishedAt": "2023-12-27T17:16:06Z",
      "title": "Comedian Tom Smothers, one-half of the Smothers Brothers, dies at 86",
      "url": "https://apnews.com/3e1727faf1b6469da7b2cfc7b2874c56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4df3379bb4994f899af777ec4b9e9bcb/1500.jpeg"
    },
    {
      "author": "ANNE M. PETERSON",
      "description": "LAS VEGAS (AP) — Najiah Knight drops her 100-pound frame onto a snorting 1,300-pound bull and adjusts her ropes, warming the sticky rosin. Music blares across the arena, but Najiah can hear only her dad, in the chute with her, and her mom, cheering from the stands.",
      "publishedAt": "2023-12-27T11:00:47Z",
      "title": "Teenager Najiah Knight wants to be the first woman at bull riding's top level. It's an uphill dream",
      "url": "https://apnews.com/0834620680ef1bc819f577d71c451d8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/551fb3f8f5f540c0bbdffbf0866b2e13/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON, JENNIFER SINCO KELLEHER, MARK THIESSEN and LINDSEY WASSON",
      "description": "LAHAINA, Hawaii (AP) — Sharlene Rabang and her calico cat fled the wildfire that destroyed her town on Maui and arrived at a family home on another Hawaii island after a 24-hour odyssey that included sleeping in a car.",
      "publishedAt": "2023-12-27T06:06:10Z",
      "title": "She died weeks after fleeing the Maui wildfire. Her family fought to have her listed as a victim.",
      "url": "https://apnews.com/7c846f4d8e6a80e5c629d33347dc50e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d1181c0966344e19ef278a4cb19867a/3000.jpeg"
    },
    {
      "author": null,
      "description": "GIBBSTOWN, N.J. (AP) — Two neighboring New Jersey towns may feel even closer next year when they're governed by two brothers.John Giovannitti, 61, will be sworn in Jan. 2 as mayor of Paulsboro, one day before newly-reelected younger brother Vince Giovannitti, 57, is sworn in to a second term as mayor of Gibbstown.",
      "publishedAt": "2023-12-27T16:06:32Z",
      "title": "Neighboring New Jersey towns will have brothers as mayors next year",
      "url": "https://apnews.com/975b1085d8b54fb439c0469b8d8876f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97abed244fe74709b05c8bd3b1de66c9/2400.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — Eight years ago, Steven Spielberg predicted that the superhero movie would one day go “the way of the Western.”",
      "publishedAt": "2023-12-27T15:01:27Z",
      "title": "Was 2023 a tipping point for movies? 'Barbie' success and Marvel struggles may signal a shift",
      "url": "https://apnews.com/933312ca505200e8b73808592f89ca68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f24e1359db2b4ad58051958c53fe3eeb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}