{
  "articles": [
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV will celebrate his first Mass after his historic election as the first North American pope. He will meet on Friday with the cardinals who chose him to lead the Catholic Church and follow in Pope Francis’ reform-minded footsteps. Leo, the Chicago-born Augustinian missionary Robert Prevost, surprised the world on Thursday when he emerged on the loggia of St. Peter’s Basilica, since there had long been a taboo against a pope from the United States. He spoke to the crowd in Italian and Spanish, but not English, and honored Pope Francis for his final salute to the crowd on Easter Sunday.",
      "publishedAt": "2025-05-09T05:00:24Z",
      "title": "Pope Leo XIV celebrates first Mass as Francis' successor",
      "url": "https://apnews.com/article/vatican-pope-prevost-leo-cardinals-1c1752bacc935c02af5f839a05de9a39",
      "urlToImage": "https://dims.apnews.com/dims4/default/c5a2ace/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F9f%2Febbfc2d8cc573d37091e642f4be5%2F9bc7f431112d4b6eb0cb9c3ae6a2e274"
    },
    {
      "author": "Obed Lamy, Hallie Golden",
      "description": "When white smoke poured out of the Sistine Chapel revealing that a new pope had been chosen, John Prevost turned on his television in Illinois and watched in awe as his brother’s name was announced. He said Thursday that he was in “disbelief” and then felt an incredible sense of pride that his brother, Cardinal Robert Prevost, had become the 267th pontiff to lead the Catholic Church, taking the name Leo XIV. That makes the Chicago-born missionary the first U.S. pope. John Prevost described his brother as being very concerned for the poor and those who don’t have a voice. He said he expects him to be a “second Pope Francis.”",
      "publishedAt": "2025-05-09T05:00:19Z",
      "title": "Leo XIV's brother recalls feeling of 'disbelief' over his sibling becoming pope",
      "url": "https://apnews.com/article/pope-leo-xiv-brother-john-prevost-631d38eeef66ea85ab905b204c61d799",
      "urlToImage": "https://dims.apnews.com/dims4/default/8dfb4f1/2147483647/strip/true/crop/2543x1430+0+133/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F20%2F7129faca13ee341526dc8d0d55ab%2Fe8771a49602d4906b316928ff41624aa"
    },
    {
      "author": "Aijaz Hussain, Munir Ahmed, Sheikh Saaliq, Rajesh Roy",
      "description": "Indian and Pakistani soldiers exchanged heavy volleys of shells and gunfire across their frontier in Kashmir overnight, killing at least five civilians amid a growing military standoff that erupted following an attack on tourists in the India-controlled portion of the disputed region. In Pakistan, an unusually intense night of artillery exchanges left at least four civilians dead and wounded 12 others in areas near the Line of Control that divides Kashmir, local police official Adeel Ahmad said. In India, military officials said Pakistani troops barraged their posts overnight with artillery, mortars and gunfire at multiple locations. A woman was killed and two other civilians were injured in Uri sector, police said.",
      "publishedAt": "2025-05-09T06:02:56Z",
      "title": "Indian and Pakistan troops swap intense artillery fire overnight",
      "url": "https://apnews.com/article/kashmir-india-pakistan-military-strikes-conflict-1fe7cb3d7e0ea613f8461ca190a73eb0",
      "urlToImage": "https://dims.apnews.com/dims4/default/59a3e66/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F35%2F53ab0815c638fa3f5ef842eda6cf%2F249b46041af647dc8fc11a236ca16f03"
    },
    {
      "author": "David Rising",
      "description": "India’s missile and bomb strikes on targets in Pakistan and Pakistani-controlled Kashmir have spiked tensions between the two nuclear-armed neighbors, with Pakistan’s leader calling the attacks an act of war. Claims on exactly what was hit and where have differed widely, with neither India nor Pakistan releasing many specific details. Making the ongoing conflict even more confusing, researchers say the internet has been flooded with disinformation, false claims, and manipulated photos and videos.",
      "publishedAt": "2025-05-09T10:26:28Z",
      "title": "India's clash with Pakistan sees use of Chinese missiles, French jets, Israeli drones, and more",
      "url": "https://apnews.com/article/pakistan-india-weapons-missiles-rafale-073a6c4514a547924271fe1a47d5fabc",
      "urlToImage": "https://dims.apnews.com/dims4/default/4cb5930/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F52%2F49ecb5d4bbf8e910ce1ba0025a13%2F60f3cd38c9274412a31cdfd70aeaab73"
    },
    {
      "author": "Seung Min Kim",
      "description": "President Donald Trump has floated cutting tariffs on China from 145% to 80% ahead of a weekend meeting as he looks to deescalate the trade war. Top U.S. officials are set to meet with a high-level Chinese delegation in Switzerland in the first major talks between the two nations since Trump sparked a trade war with stiff tariffs on imports. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson Greer will meet with their counterparts in Geneva in the most-senior known conversations between the two countries in months. It comes amid growing U.S. market worry over the impact of the tariffs on the prices and supply of consumer goods.",
      "publishedAt": "2025-05-09T11:39:51Z",
      "title": "Trump floats cutting China tariffs to 80% ahead of meeting",
      "url": "https://apnews.com/article/trump-tariffs-china-41d189bfe510e3ed7692da8647a14e64",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c358f6/2147483647/strip/true/crop/5858x3295+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F63%2F5642ecbdae186798c3b77fc70415%2F20c88dc7dbae4c338f80acb05908381d"
    },
    {
      "author": "Michael Kunzelman",
      "description": "President Donald Trump said he is naming Fox News host Jeanine Pirro, a former county prosecutor and elected judge, to be the top federal prosecutor for the nation’s capital after abandoning his first pick for the job. He made the announcement in a post on Thursday on Truth Social. Pirro co-hosts the show “The Five” on Fox on weekday evenings. She was elected as a judge in New York’s Westchester County Court in 1990 before serving three terms as the county’s elected district attorney. Trump tapped Pirro to lead the nation’s largest U.S. Attorney’s office after pulling his nomination of conservative activist Ed Martin Jr. for the position.",
      "publishedAt": "2025-05-08T22:47:03Z",
      "title": "Trump says he is naming Fox News host Jeanine Pirro as DC federal prosecutor",
      "url": "https://apnews.com/article/jeanine-pirro-washington-dc-fox-news-ed-martin-d654d957a15045a4b904224c2c97c059",
      "urlToImage": "https://dims.apnews.com/dims4/default/1267d51/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2F1c%2F2df81ec03e1e1afb91e5a9b2fedf%2Fbac918afe92c4371b5f6edfb7fe354d8"
    },
    {
      "author": "Jocelyn Gecker, Linley Sanders",
      "description": "A new poll shows a majority of U.S. adults disapprove of President Donald Trump’s handling of issues related to colleges and universities, as his Republican administration ramps up threats to cut federal funding unless schools comply with his political agenda. The Associated Press-NORC Center for Public Affairs Research poll finds 56% of Americans disapprove of Trump’s approach on higher education, while about 4 in 10 approve, in line with his overall job approval. Trump has tried to force change at universities he says have become hotbeds of liberalism and antisemitism. The poll shows a disconnect between Trump’s targeting of universities and an American public that sees them as key to scientific research, new ideas and innovative technology.",
      "publishedAt": "2025-05-09T11:01:46Z",
      "title": "Most Americans disapprove of Trump's treatment of colleges, new poll finds",
      "url": "https://apnews.com/article/poll-college-trump-harvard-higher-education-109dae2e19d5fe570a7c02e105bab6e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/bec86b8/2147483647/strip/true/crop/5348x3008+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F64%2F0a80eb50cbade2d3612394906126%2F672601d8223d4e788ec6e504d08a844f"
    },
    {
      "author": "Megan Janetsky",
      "description": "Vaccination teams are part of an effort by health authorities across Mexico to contain the country’s biggest measles outbreak in decades. Cases are climbing not only in Mexico, but in the U.S. and Canada. Mexico's cases have been concentrated in the Mennonite community in the northern border state of Chihuahua. It's a community long skeptical of vaccines and distrustful of authorities. Officials say results of the campaign alongside Mennonite leaders are mixed. They cite tens of thousands of vaccinations in Chihuahua. But infections have ballooned, spreading past the community to Indigenous and other populations. Vaccination teams say door-to-door efforts are helping, even if not everyone is open to the shot. Some ask questions and follow up later. Others won't even open the door.",
      "publishedAt": "2025-05-09T05:10:51Z",
      "title": "In Mexico's measles outbreak, Mennonites face vaccine misinformation",
      "url": "https://apnews.com/article/mexico-measles-vaccines-misinformation-mmr-mennonites-misinformation-ea6158b9a4d513b20f33cbc09034e5c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/1464010/2147483647/strip/true/crop/5159x2902+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F7c%2F115dd305ec231e3fca875ee5cafb%2F28cf2a2f53194d4aade1d8f86e3e1a97"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "China's exports to the United States have tumbled while its trade with other economies surged in April. Data released Friday showed China's total exports rose 8% last month from a year earlier, much faster than most economists had been expecting. Exports to the U.S. sank 21% as President Donald Trump's tariffs on Chinese exports rose to as high as 145%. But China's total exports remained resilient, with exports to Latin America, India and Southeast Asia expanding at a double-digit pace in the first four months of the year. Treasury Secretary Scott Bessent and other senior trade officials are due to meet with Chinese officials in Geneva for talks this weekend.",
      "publishedAt": "2025-05-09T03:34:21Z",
      "title": "China's exports to US sink, offset by trade with other economies, as US tariffs hit global trade",
      "url": "https://apnews.com/article/china-economy-trade-exports-trump-1ccca562b7381cd8546263342c640f52",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6c620b/2147483647/strip/true/crop/4096x2304+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F62%2Fdd35674ffcc82efc9be8db722f1f%2Fe2579b6e064347c483e6da45e1112b7b"
    },
    {
      "author": "Sara Cline, Stephen Smith",
      "description": "Two years after a Louisiana mother donated her kidney to her daughter, the duo graduated together from nursing school. Ambrealle Brown was forced to put her dreams of becoming a nurse on hold after being bedridden during dialysis to address a life-threatening kidney disease. Her mother, Nija Bulter, stepped in and donated one of her healthy kidneys. The two both attended nursing school in Baton Rouge together following the surgery. They both graduated with their registered nurse licenses last month.",
      "publishedAt": "2025-05-09T04:05:32Z",
      "title": "Daughter says mom 'gave me life twice' with kidney donation as pair graduate nursing school together",
      "url": "https://apnews.com/article/mother-daughter-kidney-transplant-nursing-louisiana-b6326dffe1fb0d84b41cd9a3c12c9604",
      "urlToImage": "https://dims.apnews.com/dims4/default/08a4ec6/2147483647/strip/true/crop/3024x1701+0+158/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2F19%2F283b1fe0d7d46974795bb6917d3b%2F9dbd40a3395143a2ab6f99235ca90297"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}