{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and ERIC TUCKER",
      "description": "NEW YORK (AP) — The first of Donald Trump’s four criminal trials will begin April 15, a Manhattan judge ruled Monday, tearing into the former president’s lawyers for what he said were unfounded claims that the hush-money case had been tainted by prosecutorial misconduct.",
      "publishedAt": "2024-03-25T04:25:41Z",
      "title": "Trump's New York hush money case is set for trial April 15",
      "url": "https://apnews.com/b8fb980a6ec745e918a13e676b7f1460",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4f2b544b2c049a8b1093e74f6a4e15b/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A New York appeals court on Monday agreed to hold off collection of former President Donald Trump’s more than $454 million civil fraud judgment if he puts up $175 million within 10 days.",
      "publishedAt": "2024-03-25T04:07:01Z",
      "title": "Court agrees to pause collection of Trump's massive civil fraud judgment if he puts up $175M",
      "url": "https://apnews.com/8447c48d0436083737204b13401438d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab25ef1ec7f54085800218e159a0f066/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United Nations Security Council on Monday issued its first demand for a cease-fire in Gaza, with the U.S. angering Israel by abstaining from the vote. Israel responded by canceling a visit to Washington by a high-level delegation in the strongest public clash between the allies since the war began.",
      "publishedAt": "2024-03-25T04:01:55Z",
      "title": "UN demand for Gaza cease-fire provokes strongest clash between US and Israel since war began",
      "url": "https://apnews.com/b7985fede65e5477aba2c8d2e62a6632",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d636c50859874c28ae5b48a18f11fab6/3000.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "TALLINN, Estonia (AP) — Flames were still leaping from the Moscow concert hall besieged by gunmen when Russian officials began suggesting who was really to blame.",
      "publishedAt": "2024-03-25T21:06:15Z",
      "title": "Moscow theater shooting fans flames of a disinformation war",
      "url": "https://apnews.com/4a64c9726f5e711e9c08e77a1d4000bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebf7392b6d88406594b1c1bcd8e286d4/3000.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "TALLINN, Estonia (AP) — The four men charged with the massacre at a Moscow theater have been identified by authorities as citizens of Tajikistan, some of the thousands who migrate to Russia each year from the poorest of the former Soviet republics to scrape out marginal existences.",
      "publishedAt": "2024-03-25T16:46:26Z",
      "title": "Russian massacre suspects' homeland is plagued by poverty and religious strife",
      "url": "https://apnews.com/f593d4fb318198a7674a3f51fdd018c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bada6cece4a44c93a2670fb7bf0625d4/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Republicans threatened to hold Attorney General Merrick Garland in contempt of Congress if he did not turn over unredacted materials related to the special counsel probe into President Joe Biden's handling of classified documents.",
      "publishedAt": "2024-03-25T20:57:04Z",
      "title": "Republicans threaten to hold Attorney General Garland in contempt over Biden documents case",
      "url": "https://apnews.com/1e38dc659e9b7609c9f92b78a38458c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6365906f369b401f8e27874d9aa5b5db/3000.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO and COLLEEN LONG",
      "description": "NEW YORK (AP) — Two properties belonging to rapper Sean “Diddy” Combs in Los Angeles and Miami were searched Monday by federal Homeland Security Investigations agents and other law enforcement as part of an ongoing sex trafficking investigation by federal authorities in New York, two law enforcement officials told The Associated Press.",
      "publishedAt": "2024-03-25T21:43:15Z",
      "title": "Feds search Sean 'Diddy' Combs’ properties as part of sex trafficking probe, AP sources say",
      "url": "https://apnews.com/8883ed2c7308f3fcdb2cdf03fbe329d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68517258f9404bc28bbef43d76b357ba/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court will again wade into the fractious issue of abortion this week when it hears arguments over a medication used in the most common way to end a pregnancy, a case with profound implications for millions of women no matter where they live in America and, perhaps, for the race for the White House.",
      "publishedAt": "2024-03-25T10:47:04Z",
      "title": "Supreme Court again confronts the issue of abortion, this time over access to widely used medication",
      "url": "https://apnews.com/6351df63f71c1038244c700c7328145a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdfc4abdcddc40859d401319c3bc8ca4/2924.jpeg"
    },
    {
      "author": "JILL COLVIN and ZEKE MILLER",
      "description": "WASHINGTON (AP) — As President Joe Biden visited five cities in a multiday trip last week, former President Donald Trump was hardly seen in public, spending most of his time in South Florida.",
      "publishedAt": "2024-03-25T04:21:11Z",
      "title": "As Biden tours the country and visits swing states, Trump is fundraising and playing golf",
      "url": "https://apnews.com/a542c061048ed8556a4955e83b480ec9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13b1cd523fca45f889a5466a3bcad9ff/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "LOS ANGELES (AP) — Shohei Ohtani said Monday he never bet on sports or knowingly paid any gambling debts accumulated by his longtime interpreter, Ippei Mizuhara.Instead, the Los Angeles Dodgers star claims his close friend lied to him for years and stole millions from the two-time MVP.",
      "publishedAt": "2024-03-25T17:19:40Z",
      "title": "Shohei Ohtani says he never bet on sports, interpreter Ippei Mizuhara stole money, told lies",
      "url": "https://apnews.com/e330999371308631f35c18d81be76e11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ac172b357914874b12f612eb9764cb8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}