{
  "articles": [
    {
      "author": "TIA GOLDENBERG, JACK JEFFERY and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — Three sons of Hamas ' top political leader were killed Wednesday by an Israeli airstrike in the Gaza Strip, and the leader accused Israel of acting in “the spirit of revenge and murder.”",
      "publishedAt": "2024-04-10T07:24:52Z",
      "title": "3 sons of top Hamas leader are killed in Israeli airstrike in Gaza",
      "url": "https://apnews.com/fad770cbe77a7ae7d1de8568dbabd460",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b962828a2b247c78eefb231628a2eb0/1920.jpeg"
    },
    {
      "author": "BILL BARROW and ADRIANA GOMEZ LICON",
      "description": "ATLANTA (AP) — Donald Trump said Wednesday that an Arizona law that criminalizes nearly all abortions goes too far and called on Arizona lawmakers to change it, while also defending the overturning of Roe v.",
      "publishedAt": "2024-04-10T16:36:54Z",
      "title": "Trump says Arizona's abortion ban goes 'too far' and defends the overturning of Roe v. Wade",
      "url": "https://apnews.com/7cdd6d2e3c320a89ec7a7c037824e7cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83d4ec39d6944f4a8ef7f4e7da10d96b/2508.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and PHILIP MARCELO",
      "description": "NEW YORK (AP) — Allen Weisselberg, a retired executive in Donald Trump’s real estate empire, was sentenced Wednesday to five months in jail for lying under oath during his testimony in the civil fraud lawsuit brought against the former president by New York’s attorney general.",
      "publishedAt": "2024-04-10T04:03:25Z",
      "title": "Former Trump executive Allen Weisselberg sentenced to 5 months in jail for lying",
      "url": "https://apnews.com/b76cde56c6cb983ab8789f95d5a0c6c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/199535dc739a4e3cbcc7900efade0e8d/1920.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "BRANDON, Miss. (AP) — Already sentenced to many years in federal prison, six white former Mississippi law enforcement officers who pleaded guilty to a long list of state and federal charges for torturing two Black men were sentenced Wednesday in state court.",
      "publishedAt": "2024-04-10T04:05:05Z",
      "title": "6 former Mississippi law officers sentenced in state court for torture of 2 Black men",
      "url": "https://apnews.com/3519cddc1f1e2827f28bb930045305d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3522e25e3694e05965df429f0f4f851/1920.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS",
      "description": "The Biden administration on Wednesday finalized strict limits on certain so-called “forever chemicals” in drinking water that will require utilities to reduce them to the lowest level they can be reliably measured.",
      "publishedAt": "2024-04-10T09:05:18Z",
      "title": "Biden administration sets first-ever limits on 'forever chemicals' in drinking water",
      "url": "https://apnews.com/1c8804288413a73bb7b99fc866c8fa51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b6963704ed64cad974c8b4936b04afe/3000.jpeg"
    },
    {
      "author": "ANDREW WILKS and NINIEK KARMINI",
      "description": "ISTANBUL (AP) — Muslims around the world celebrated the Eid al-Fitr holiday Wednesday, marking the end of the holy month of Ramadan. But events were overshadowed by the worsening crisis in Gaza and Israel’s expected military offensive in Rafah city after six months of war.",
      "publishedAt": "2024-04-10T03:59:23Z",
      "title": "Muslims worldwide celebrate Eid al-Fitr in the shadow of Gaza's misery",
      "url": "https://apnews.com/868fcffe89540389339ae67f64d070cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4a9d1638fa5418a88c8c5289df0390f/1920.jpeg"
    },
    {
      "author": "KEVIN McGILL and SARA CLINE",
      "description": "NEW ORLEANS (AP) — People in New Orleans and its suburbs were sloshing through flooded streets as forecasters warned of even more rain Wednesday after high winds ripped through the South, collapsing the roof of an apartment building in Slidell, Louisiana.",
      "publishedAt": "2024-04-10T13:48:34Z",
      "title": "Storms bring flooding rain and damaging winds to states across the South",
      "url": "https://apnews.com/958b29bf4dcca71d8fce3916ad7fe640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a320b42505774be8ac30e9e0776a0bd0/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — The top general for U.S. forces in Europe told Congress Wednesday that Ukraine will be outgunned 10 to one by Russia within a matter of weeks if Congress does not find a way to approve sending more ammunition and weapons to Kyiv soon.",
      "publishedAt": "2024-04-10T16:25:10Z",
      "title": "Ukraine will be outgunned by Russia 10 to 1 in weeks without US help, top Europe general says",
      "url": "https://apnews.com/b263dfaceef57fb2c1f74c53861734da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a44e0ed14a44b0995bb11ea328e6598/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "BOISE, Idaho (AP) — An Idaho man charged with three murders in an unusual doomsday-focused case crafted an alternate reality so that he could fulfill “his desire for sex, money and power,” a prosecutor told jurors Wednesday morning.",
      "publishedAt": "2024-04-10T04:03:22Z",
      "title": "In triple-murder trial, prosecutor says Chad Daybell built 'alternate reality' to gain sex and money",
      "url": "https://apnews.com/34476875bdcbda3b4dc3a4c59539e134",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9988bbf24dee4e008af934389c9657b7/3000.jpeg"
    },
    {
      "author": "CORA LEWIS",
      "description": "NEW YORK (AP) — Much like nutritional labels on food products, “broadband labels” for internet packages will soon tell you just what is going into the pricing of your service, thanks to new rules adopted by the Federal Communications Commission this week.",
      "publishedAt": "2024-04-10T09:01:27Z",
      "title": "Internet providers must now be more transparent about fees, pricing, FCC says",
      "url": "https://apnews.com/6a6065a88900332dc9004f303bc6657f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c34e693cf1f84b75a0c32468b5f5f768/1882.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}