{
  "articles": [
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — Scientists have discovered the longest pair of jets streaming from a black hole in a distant galaxy.",
      "publishedAt": "2024-09-18T15:04:00Z",
      "title": "Scientists detect longest pair of jets streaming from a supermassive black hole",
      "url": "https://apnews.com/66f40762fa2bb367aa7c91f1dbc24ee5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09364b87db0c437dbb4f0a3e86d20c1e/2088.jpeg"
    },
    {
      "author": "BASSEM MROUE and JULIA FRANKEL",
      "description": "BEIRUT (AP) — Israel launched a rare airstrike that killed a senior Hezbollah military official in a densely populated southern Beirut neighborhood on Friday, the Israeli army said. It was the deadliest such attack on Lebanon’s capital in years, with Lebanese health authorities reporting at least 12 people killed and dozens more wounded in the attack.",
      "publishedAt": "2024-09-20T11:44:41Z",
      "title": "Israel says its strike on Beirut killed a top Hezbollah military official as Lebanon reports 12 died",
      "url": "https://apnews.com/a6a95169a21b45dc86d86182e255fa7e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83342e56a24b49a89b1ad86ea97c0158/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA, ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Communication breakdowns with local law enforcement hampered the Secret Service's performance ahead of a July assassination attempt on former President Donald Trump, according to a new report that lays out a litany of missed opportunities to stop a gunman who opened fire from an unsecured roof.",
      "publishedAt": "2024-09-20T17:01:39Z",
      "title": "Secret Service report details communication failures preceding July assassination attempt on Trump",
      "url": "https://apnews.com/7dca5e30730287f46cceaa35437f0d47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf80507782314475ab7d6461f5d9e29f/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — In-person voting for this year’s presidential election began Friday, a milestone that kicked off a six-week sprint to Election Day after a summer of political turmoil.",
      "publishedAt": "2024-09-20T04:08:53Z",
      "title": "In-person voting begins for the US presidential contest, kicking off the sprint to Election Day",
      "url": "https://apnews.com/7fb7a8ff28490f71cd15529321dfe765",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfd7fcffcbda4ab2a266b3f68648c7bf/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and AMANDA SEITZ",
      "description": "WASHINGTON (AP) — For the first time since she ascended to the top of the Democratic ticket, Vice President Kamala Harris is set to give a speech focused squarely on abortion rights and she'll do so in Georgia, where news reports have documented women's deaths in the face of the state's six-week ban.",
      "publishedAt": "2024-09-20T11:10:53Z",
      "title": "Harris focusing on personal stories as she campaigns on abortion rights",
      "url": "https://apnews.com/5ba5dabf0dc3c98de12389c34b47475d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6470b84eebdb49a99b27e3d9105aca6f/2658.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Georgia's State Election Board on Friday voted to approve a new rule that requires poll workers to count the number of paper ballots by hand. The board voted 3-2 to approve the rule, going against the advice of the state attorney general's office, the secretary of state's office and an association of county election officials.",
      "publishedAt": "2024-09-20T16:54:25Z",
      "title": "Georgia State Election Board approves rule requiring hand count of ballots",
      "url": "https://apnews.com/da1f271f360b15353abebdf9ff183b3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/091cf2bccadd4bb1a2f2b71ad877fcaf/3000.jpeg"
    },
    {
      "author": "HOLLY MEYER",
      "description": "Florida pastor Melvin Adams knows a few hours of church programming every week is no match for the more than 30 hours children spend at secular schools, absorbing lessons that he says run counter to their family’s Christian beliefs.",
      "publishedAt": "2024-09-20T12:19:21Z",
      "title": "Vouchers ease start-up stress for churches seeing demand for more Christian schools",
      "url": "https://apnews.com/12518eeab977b74847292c17fc0b7fe3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3e18f7b3b5b4914a8bf0043589b897d/3000.jpeg"
    },
    {
      "author": "BRUCE SCHREINER and DYLAN LOVAN",
      "description": "WHITESBURG, Ky. (AP) — Residents of a tiny Appalachian town struggled Friday to cope with a shooting involving two of its most prominent citizens: a judge who was gunned down in his courthouse chambers and a local sheriff charged with his murder.",
      "publishedAt": "2024-09-20T14:53:58Z",
      "title": "Tiny Kentucky town is rocked as their sheriff is jailed in the killing of a prominent judge",
      "url": "https://apnews.com/d8df59f414023489527e9aef49f4c8cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddcff12f77024ab2971cce88ed53da58/1920.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "A paid passenger on an expedition to the Titanic with the company that owned the Titan submersible testified before a U.S. Coast Guard investigatory panel Friday that the mission he took part in was aborted due to an apparent mechanical failure.",
      "publishedAt": "2024-09-20T04:06:15Z",
      "title": "Passenger on a previous Titan sub dive says his mission was aborted due to apparent malfunction",
      "url": "https://apnews.com/ce07039ec4abf4e83ba38bf13a40829f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1aabfcf14a84eb3bd2d9c23422b694c/1920.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA and DEE-ANN DURBIN",
      "description": "CACONDE, Brazil (AP) — Silvio Almeida’s coffee plantation sits at an ideal altitude on a Brazilian hillside, whose clay-rich soil does well at retaining moisture from rainfall and a nearby reservoir.",
      "publishedAt": "2024-09-20T04:28:43Z",
      "title": "Brazil drought punishes coffee farms and threatens to push prices even higher",
      "url": "https://apnews.com/a6516a4b314e6ba7c11513c08afb6996",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51995a380285426082e357a4a85c3481/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}