{
  "articles": [
    {
      "author": "MICHAEL BALSAMO, JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — The masked gunman who stalked and killed the leader of one of the largest U.S. health insurance companies outside a Manhattan hotel used ammunition emblazoned with the words “deny,” “defend” and “depose,” two law enforcement officials said Thursday.",
      "publishedAt": "2024-12-05T05:10:29Z",
      "title": "Police release new photos as they search for the gunman who killed UnitedHealthcare CEO",
      "url": "https://apnews.com/7f6581ba6b0b520938d82c361e77a83c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/227f3de3c5e244c5a9b554504aa4fd75/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — It's DOGE time at the U.S. Capitol.Billionaire Elon Musk and fellow entrepreneur Vivek Ramaswamy arrived Thursday on Capitol Hill meeting with legislators behind closed doors about President-elect Donald Trump's plans to “dismantle” the federal government.",
      "publishedAt": "2024-12-05T15:20:15Z",
      "title": "Elon Musk and Vivek Ramaswamy are bringing Trump's DOGE to Capitol Hill",
      "url": "https://apnews.com/ce55aa7ca8c921511d18e837c2a2db64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3c603d94a1e4af5aec09f21ee38fad7/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK, LISA MASCARO and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Pete Hegseth has spent the week on Capitol Hill trying to reassure Republican senators that he is fit to lead President-elect Donald Trump’s Department of Defense in the wake of high-profile allegations about excessive drinking and sexual assault.",
      "publishedAt": "2024-12-05T17:37:30Z",
      "title": "Hegseth faces senators' concerns not only about his behavior but also his views on women in combat",
      "url": "https://apnews.com/194e39797595d87f621db641d0f35ff1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ece87aea7ff46aebb5f6ff085c280cf/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "ISTANBUL (AP) — A Hamas official said Thursday that international mediators have resumed negotiating with the militant group and Israel over a ceasefire in Gaza, and that he was hopeful a deal to end the 14-month war was within reach.",
      "publishedAt": "2024-12-05T19:33:12Z",
      "title": "Hamas official says Gaza ceasefire talks have resumed after weekslong hiatus",
      "url": "https://apnews.com/d09bb192b298adb3fa76d0e819721fdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ad1e2bf910a45adb4d2e8070a0985da/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — One of the darkest moments in the modern history of the Arab world happened more than four decades ago, when then-Syrian President Hafez Assad launched what came to be known as the Hama Massacre.",
      "publishedAt": "2024-12-05T20:26:31Z",
      "title": "Why the rebel capture of Syria's Hama, a city with a dark history, matters",
      "url": "https://apnews.com/799f37fd2608532a253cccb48df4e613",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f8bc67de69d428396fe7a50c773ae15/1920.jpeg"
    },
    {
      "author": "TOM NOUVIAN, SYLVIE CORBET and JOHN LEICESTER",
      "description": "PARIS (AP) — French President Emmanuel Macron vowed Thursday to stay in office until the end of his term, due in 2027, and announced that he will name a new prime minister within days in efforts to overcome the political deadlock following the resignation of ousted Prime Minister Michel Barnier.",
      "publishedAt": "2024-12-05T11:50:03Z",
      "title": "France's Macron vows to stay in office till end of term, says he'll name a new prime minister soon",
      "url": "https://apnews.com/24681982fc526ffdafd57e53773ef855",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d43c6eeb518482fa46d2a2422327b29/1920.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ and STEFANIE DAZIO",
      "description": "SAN FRANCISCO (AP) — A 7.0 magnitude earthquake shook a large area of Northern California on Thursday, knocking items off grocery store shelves, sending children scrambling under desks and prompting a brief tsunami warning for 5.3 million people along the U.S.",
      "publishedAt": "2024-12-05T19:08:22Z",
      "title": "7.0 earthquake off Northern California prompts brief tsunami warning",
      "url": "https://apnews.com/e1c73514097b78dfc082e40f98d0d426",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b75cefcd73b47e4b36cefe4b04b6912/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s president replaced his defense minister Thursday as opposition parties moved to impeach both men over the stunning-but-brief imposition of martial law that brought armed troops into Seoul streets.",
      "publishedAt": "2024-12-05T01:50:27Z",
      "title": "Yoon replaces the defense minister as South Korea's parliament moves to vote on their impeachments",
      "url": "https://apnews.com/8e1ffc82990d6bdce8d80dffc3815f62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8273102dc33a4dfeaefde05250989000/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MICHAEL BALSAMO",
      "description": "WASHINGTON (AP) — The federal Bureau of Prisons is permanently closing its “rape club” women’s prison in California and will idle six facilities in a sweeping realignment after years of abuse, decay and mismanagement, The Associated Press has learned.",
      "publishedAt": "2024-12-05T17:05:36Z",
      "title": "The US government is closing a women's prison and other facilities after years of abuse and decay",
      "url": "https://apnews.com/c02c96b6f6a3c5535cc3e3025d5d2585",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73f4c93b94ea4fbcae931698ff8c19f1/3000.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — Born from the ashes of the 2008 global financial crisis, bitcoin arrived after trust had withered in the financial system and in Washington's ability to protect those who must participate in it.",
      "publishedAt": "2024-12-05T17:53:54Z",
      "title": "From outsider to the Oval Office, bitcoin surges as a new administration embraces crypto",
      "url": "https://apnews.com/6ee18c4f1a8fc2365ff939600cad2d44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b1a734d33304108bc15a98157f8d531/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}