{
  "articles": [
    {
      "author": "SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Ohio authorities on Friday released bodycam video showing a police officer fatally shooting Ta’Kiya Young in her car in what her family denounced as a “gross misuse of power and authority” against the pregnant Black mother.",
      "publishedAt": "2023-09-01T05:08:53Z",
      "title": "Ta'Kiya Young's family urges officer's arrest after video shows him killing the pregnant Black woman",
      "url": "https://apnews.com/95daff91130a64bb43848431ea4441af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44cfd7773975471b926cbd32d1de4228/1920.jpeg"
    },
    {
      "author": "REBECCA BLACKWELL and LAURA BARGFELD",
      "description": "HORSESHOE BEACH, Fla. (AP) — The worst of Hurricane Idalia left residents of a region of tight-knit communities trying to find places to live as they rebuild — if they decide it's even worth it — and waiting potentially weeks for electricity to be restored after winds and water took out entire power grids.",
      "publishedAt": "2023-09-01T05:04:09Z",
      "title": "No power and nowhere to stay as rural Florida starts recovering from Hurricane Idalia",
      "url": "https://apnews.com/b62b7350fae6870b4a541d9915c198b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7685b601bb0748b48d063e3b8e02ca65/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A former member of the far-right Proud Boys extremist group who smashed a window at the U.S. Capitol in the building's first breach of the Jan.",
      "publishedAt": "2023-09-01T17:37:48Z",
      "title": "Proud Boy who smashed Capitol window on Jan. 6 gets 10 years in prison, then declares, 'Trump won!'",
      "url": "https://apnews.com/58173200af1664716cbaec8ed2c2a145",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ed1b730ffb5416784ee71f041100c11/2952.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — Silicon Valley billionaires behind a secretive $800 million land-buying spree in Northern California have finally released some details about their plans for a new green city, but they still must win over skeptical voters and local leaders.",
      "publishedAt": "2023-09-01T17:25:08Z",
      "title": "Billionaires want to build a new city in rural California. They must convince voters first",
      "url": "https://apnews.com/35f91416dd7d84ecb03ed08199d87dd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/085fac030a5146f6945a94292ace804e/1920.jpeg"
    },
    {
      "author": "PAUL J. WEBER, ACACIA CORONADO and KENDRIA LaFLEUR",
      "description": "AUSTIN, Texas (AP) — A vision of armed officers at every school in Texas is crashing into the reality of not enough money or police as a new mandate took effect Friday, showing how a goal more states are embracing in response to America's cycle of mass killings is proving unworkable in many communities.",
      "publishedAt": "2023-09-01T04:33:03Z",
      "title": "Texas wanted armed officers at every school after Uvalde. Many can't meet that standard",
      "url": "https://apnews.com/9a68ff8935fa376965ad754056de1673",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1bcd508a3ca43e5a30066248c885c66/1920.jpeg"
    },
    {
      "author": "ED KOMENDA",
      "description": "BREMERTON, Wash. (AP) — An assistant high school football coach in Washington state who lost his job during a controversy over his public post-game prayers is back on the sideline after the U.S.",
      "publishedAt": "2023-09-01T05:33:11Z",
      "title": "After years of fighting, a praying football coach got his job back. Now he's unsure he wants it",
      "url": "https://apnews.com/6a4bfa0f15771aa7ae4abeebe60d6c01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7716436d42cf49319f9b01950666083a/3000.jpeg"
    },
    {
      "author": "BRITTANY PETERSON",
      "description": "Maggie T. Sutrov showered, drank treated tap water and watered her garden before she learned that she shouldn't be using the water in her home on Maui after wildfires devastated the island.",
      "publishedAt": "2023-09-01T13:40:07Z",
      "title": "After Maui's wildfires, thousands brace for long process of restoring safe water service",
      "url": "https://apnews.com/f6f386419ebf091a5a08133a0268041d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28b7f8fa7e984a299629f74f47f2ecf1/3000.jpeg"
    },
    {
      "author": null,
      "description": "ATLANTA (AP) — Five people were stabbed, one fatally, during a dispute among men being held at an overcrowded jail in Atlanta that is already the subject of a federal civil rights investigation, authorities said Friday.",
      "publishedAt": "2023-09-01T19:05:04Z",
      "title": "One dead, four injured in stabbings at notorious jail in Atlanta that's under federal investigation",
      "url": "https://apnews.com/98d79190e695b7592f6f5f28e667efa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee5f6548e97d4e279e93eaa4e5ae268d/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "BUCHA, Ukraine (AP) — In a small courtyard at a school in Bucha, scene of some of the worst atrocities committed by Russian soldiers during the war, Ukrainian children gathered Friday to celebrate the first day of the new school year.",
      "publishedAt": "2023-09-01T14:44:17Z",
      "title": "It's joy mixed with sorrow as Ukrainian children go back to school in the midst of war",
      "url": "https://apnews.com/4377ff67610b1996d37b99a3c90573cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ace871271196486cbb6e7a60e00d9014/3000.jpeg"
    },
    {
      "author": "MATT SEDENSKY",
      "description": "NEW YORK (AP) — The federal government will, for the first time, dictate staffing levels at nursing homes, the Biden administration said Friday, responding to systemic problems bared by mass COVID-19 deaths.",
      "publishedAt": "2023-09-01T10:31:47Z",
      "title": "US will regulate nursing home staffing for first time, but proposal lower than many advocates hoped",
      "url": "https://apnews.com/ebd1aad4a8bb13f892b930cae2f3f1cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f7d5addff564220a4163f7b9034a2b4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}