{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JILL COLVIN, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump's fixer-turned-foe, Michael Cohen, directly implicated the former president in a hush money scheme Monday, telling jurors that his celebrity client approved hefty payouts to stifle stories about sex that he feared could be harmful to his 2016 White House campaign.",
      "publishedAt": "2024-05-13T04:22:31Z",
      "title": "'Make sure it doesn't get released;' Star witness Michael Cohen implicates Trump in hush money case",
      "url": "https://apnews.com/f96dd7289cf952145cdd6737b29add3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d84050d1cbcc4ee5b1cb2460b66d08bb/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Israeli military is fighting Palestinian militants in Rafah while ordering the population to evacuate from some parts of the southern Gaza city.",
      "publishedAt": "2024-05-13T10:04:22Z",
      "title": "The Latest | Fighting in Rafah and northern Gaza as hundreds of thousands flee",
      "url": "https://apnews.com/18bde11f5581a7d296d2242b9f204ce9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c8e33aa3f5141fe8a0ec4e76d1650f0/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "REHOBOTH BEACH, Del. (AP) — Secretary of State Antony Blinken on Sunday delivered some of the Biden administration’s strongest public criticism yet of Israel’s conduct of the war in Gaza, saying Israeli tactics have meant “a horrible loss of life of innocent civilians” but failed to neutralize Hamas leaders and fighters and could drive a lasting insurgency.",
      "publishedAt": "2024-05-12T17:16:48Z",
      "title": "Blinken delivers some of the strongest US public criticism of Israel's conduct of the war in Gaza",
      "url": "https://apnews.com/6e0f887bd307f707a05190b33708fe58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8819ca152ff4e69aab5cf2051619a8b/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russian troops were locked in intense battles with Ukrainian soldiers around the embattled town of Vovchansk in northeast Ukraine on Monday, pushing ahead with a ground offensive that opened a new front and put more pressure on overstretched Ukrainian forces.",
      "publishedAt": "2024-05-13T08:18:17Z",
      "title": "Russian assault opens new front, diverting Ukraine forces as Western aid trickles in",
      "url": "https://apnews.com/397dd892f936726bd1acbd45991a18a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41381aff7c0047b29cf3c547ddc8eda2/1920.jpeg"
    },
    {
      "author": null,
      "description": "FORT NELSON, British Columbia (AP) — An intense wildfire could reach a town in western Canada on Monday, fire experts and officials warned, based on forecasts of strong winds that have fueled the out-of-control blaze which has forced the evacuation of thousands of people.",
      "publishedAt": "2024-05-13T10:37:33Z",
      "title": "Town prepares for possible 'last stand' as wildfires rage in Western Canada",
      "url": "https://apnews.com/dace46a958c9426056eb7da908a3f115",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f31c6275ddfe4b1cab8cc295ff08571d/2048.jpeg"
    },
    {
      "author": "THALIA BEATY",
      "description": "NEW YORK (AP) — Melinda French Gates will step down as co-chair of the Bill &amp; Melinda Gates Foundation, the nonprofit she and her ex-husband Bill Gates founded and built into one of the world's largest philanthropic organizations over the past 20 years.",
      "publishedAt": "2024-05-13T17:09:09Z",
      "title": "Melinda French Gates resigns as Gates Foundation co-chair, 3 years after her divorce from Bill Gates",
      "url": "https://apnews.com/cb0440349285c302184d54923cc72bd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3835c2de11474087bb40eac34a3fdec8/3000.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "A tiny contingent of Duke University graduates opposed pro-Israel comedian Jerry Seinfeld speaking at their commencement in North Carolina Sunday, with about 30 of the 7,000 students leaving their seats and chanting “free Palestine” amid a mix of boos and cheers.",
      "publishedAt": "2024-05-13T05:08:47Z",
      "title": "Pro-Palestinian protests dwindle on campuses as some US college graduations marked by defiant acts",
      "url": "https://apnews.com/6326e580e2455444aad32b7ebe599025",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9095db527b147489aa100f041f8820e/3000.jpeg"
    },
    {
      "author": "FU TING, ALI SWENSON and DIDI TANG",
      "description": "NEW YORK (AP) — It was 7 a.m. on a recent Friday when Wang Gang, a 36-year-old Chinese immigrant, jostled for a day job in New York City's Flushing neighborhood.When a potential employer pulled up near the street corner, home to a Chinese bakery and pharmacy, Wang and dozens of other men swarmed around the car.",
      "publishedAt": "2024-05-13T04:14:11Z",
      "title": "Trump suggests Chinese migrants are in the US to build an 'army.' The migrants tell another story",
      "url": "https://apnews.com/05478af9702aa8cc0264bb52c8ba7bd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a9ee68a13fd49b09a533375cf729413/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "PROVIDENCE, R.I. (AP) — The voice Alexis “Lexi” Bogan had before last summer was exuberant.She loved to belt out Taylor Swift and Zach Bryan ballads in the car. She laughed all the time — even while corralling misbehaving preschoolers or debating politics with friends over a backyard fire pit.",
      "publishedAt": "2024-05-13T09:02:32Z",
      "title": "Illness took away her voice. AI created a replica she carries in her phone",
      "url": "https://apnews.com/a6512c33481072c22182c116d2cbe419",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54644b9d2c134c92bcbbd0cb2900c110/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "The Cannes Film Festival rarely passes without cacophony but this year’s edition may be more raucous and uneasy than any edition in recent memory.",
      "publishedAt": "2024-05-12T05:34:11Z",
      "title": "A combustible Cannes is set to unfurl with 'Furiosa,' 'Megalopolis' and a #MeToo reckoning",
      "url": "https://apnews.com/0eee7ebe75363e76fba89ca3bfe010b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b668fbe1d0f1493dbbad55d8a7d480f2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}