{
  "articles": [
    {
      "author": "NINIEK KARMINI",
      "description": "JAKARTA, Indonesia (AP) — The Eid al-Fitr holiday marking the end of the Islamic holy month of Ramadan was celebrated by Muslims on Wednesday with family reunions, new clothes and sweet treats.In Indonesia, the world's most populous Muslim nation, nearly three-quarters of the population were traveling for the annual homecoming known locally as “mudik” that is always welcomed with excitement.",
      "publishedAt": "2024-04-10T03:59:23Z",
      "title": "Muslims celebrate Eid al-Fitr with family reunions, new clothes, treats and prayers",
      "url": "https://apnews.com/868fcffe89540389339ae67f64d070cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfd9312894da43f4b31370b7426c663f/3000.jpeg"
    },
    {
      "author": "JACQUES BILLEAUD and MORGAN LEE",
      "description": "PHOENIX (AP) — The Arizona Supreme Court has delivered a landmark decision in giving the go-ahead to enforce a long-dormant law that bans nearly all abortions, drastically altering the legal landscape within the state around terminating pregnancies.",
      "publishedAt": "2024-04-10T02:45:32Z",
      "title": "What to know about the Arizona Supreme Court ruling that reinstates an 1864 near-total abortion ban",
      "url": "https://apnews.com/797a4bbbc738497fe2284d6870c5be24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6177fe5640e94ee49a180de541b5b798/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The federal judge presiding over the classified documents case against former President Donald Trump granted a request by prosecutors on Tuesday aimed at protecting the identities of potential government witnesses.",
      "publishedAt": "2024-04-09T23:54:33Z",
      "title": "Judge in Trump's classified files case agrees to redact witness names, granting prosecution request",
      "url": "https://apnews.com/bad5cb148471724b76e4aced04e0337f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/787372846d68443490ccc24f6d615ac5/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Japanese Prime Minister Fumio Kishida began a much-anticipated visit to Washington on Tuesday that spotlights shared concerns about provocative Chinese military action in the Pacific and at a rare moment of public difference between the two nations over a Japanese company's plan to buy an iconic U.S.",
      "publishedAt": "2024-04-09T04:05:08Z",
      "title": "Biden meets Japan's PM Kishida over shared concerns about China and differences on US Steel deal",
      "url": "https://apnews.com/f72d7162f0bd20c42e096c25e4b845c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d5494ce40ad4661b83fe11fa7b1703d/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korean President Yoon Suk Yeol faces a crucial test Wednesday, as voters go to the polls for a parliamentary election that could determine whether he becomes a lame duck for his remaining three years in office.",
      "publishedAt": "2024-04-09T14:04:59Z",
      "title": "South Korea's president faces a crucial test in as voters choose parliament",
      "url": "https://apnews.com/c362a024e6eff3d4a410927be00b4d0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d546470c203e41cf845d15a5abfba6a5/1920.jpeg"
    },
    {
      "author": null,
      "description": "HONG KONG (AP) — A fire in a large, mostly residential building in Hong Kong on Wednesday morning killed at least five people and left another 34 injured.The blaze in the New Lucky House in the Jordan neighborhood was extinguished later in the morning, but police said people inside the building still were calling for help.",
      "publishedAt": "2024-04-10T02:57:56Z",
      "title": "Fire in large Hong Kong residential building kills at least 5 people and injures 34",
      "url": "https://apnews.com/69c58ceaf51d9d83d10772756500356b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fb88b663ee64daba4c84600839c143e/1920.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "PONTIAC, Mich. (AP) — The first parents convicted in a U.S. mass school shooting were sentenced to at least 10 years in prison Tuesday as a Michigan judge lamented missed opportunities that could have prevented their teenage son from possessing a gun and killing four students in 2021.",
      "publishedAt": "2024-04-09T04:11:10Z",
      "title": "Michigan school shooter's parents sentenced to 10 years in prison for not stopping a 'runaway train'",
      "url": "https://apnews.com/e5888f615c76c3b26153c34dc36d5436",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98052ec904bb4ea68a215033baefcd01/1920.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "JACKSON, Miss (AP) — Six former Mississippi law enforcement officers who pleaded guilty to a long list of state and federal charges for torturing two Black men will be sentenced Wednesday in state court.",
      "publishedAt": "2024-04-10T04:05:05Z",
      "title": "6 former Mississippi law officers to be sentenced in state court for torture of 2 Black men",
      "url": "https://apnews.com/3519cddc1f1e2827f28bb930045305d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/457d82e1221644d289f8d81c7e95a5f4/3000.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "The women's NCAA championship game drew a bigger television audience than the men's title game for the first time, with an average of 18.9 million viewers watching undefeated South Carolina beat Iowa and superstar Caitlin Clark, according to ratings released Tuesday.",
      "publishedAt": "2024-04-09T20:42:03Z",
      "title": "Women's NCAA title game outdraws the men's championship with an average of 18.9 million viewers",
      "url": "https://apnews.com/b592435cc286c75a7ac9278c97326ad8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d4e606220a1451ca19751862e35101f/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN and KATHLEEN FOODY",
      "description": "CHICAGO (AP) — Plainclothes Chicago police officers fired nearly 100 gunshots over 41 seconds during a traffic stop that left one man dead and one officer injured, according to graphic video footage a police oversight agency released Tuesday.",
      "publishedAt": "2024-04-09T18:32:16Z",
      "title": "Videos show Chicago police fired nearly 100 shots over 41 seconds during fatal traffic stop",
      "url": "https://apnews.com/0529419b830040e41bff495f1b8f0313",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f56d2b78ac20423f959ce5a000c4066f/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}