{
  "articles": [
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — Insurgents breached Syria’s second-largest city Aleppo after blowing up two car bombs on Friday and were clashing with government forces on the city's western edge, according to a Syria war monitor and fighters.",
      "publishedAt": "2024-11-29T10:20:34Z",
      "title": "Insurgents breach Syria's second-largest city Aleppo in shock offensive",
      "url": "https://apnews.com/9c07da6f83036f34d4b18a479de9d085",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab57464ce3f54cb0801c09323a8ef267/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Hours after a U.S.-brokered ceasefire to end the war between Israel and Hezbollah went into effect, Lebanon woke up to the sound of celebratory gunfire instead of Israeli airstrikes and drones buzzing overhead.",
      "publishedAt": "2024-11-29T05:04:33Z",
      "title": "Battered by war and divisions, Lebanon faces a long list of challenges after ceasefire deal",
      "url": "https://apnews.com/be0df65fa96162ca5ca02da73f172614",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d45e4b6121184d11b1b2cc41f9fdafea/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Two children and a woman were crushed to death Friday as a crowd of Palestinians pushed to get bread at a bakery in the Gaza Strip amid a worsening food crisis in the war-ravaged territory, medical officials said.",
      "publishedAt": "2024-11-29T12:46:10Z",
      "title": "Middle East latest: 2 children and a woman crushed to death outside Gaza bakery amid food shortage",
      "url": "https://apnews.com/841bab5c3c9cbc1c0bc7f94b5d4cae56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdf0434d0a9141c8993819dcf57e8ce5/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — President-elect Donald Trump is set to create a National Energy Council that he says will establish American “energy dominance” around the world as he seeks to boost U.S.",
      "publishedAt": "2024-11-29T05:11:00Z",
      "title": "Donald Trump's call for 'energy dominance' is likely to run into real-world limits",
      "url": "https://apnews.com/24529ef90795fb854e4eb35f75c18247",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18ee3569f1794bc299cd8d7baad33733/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO, HALELUYA HADERO and ALEXANDRA OLSON",
      "description": "NEW YORK (AP) — After weeks of pushing early deals, retailers in the United States and some other countries tried to seduce customers with promises of bigger discounts on Black Friday, the sales event that still reigns as the unofficial kickoff of the holiday shopping season even if it's lost some luster.",
      "publishedAt": "2024-11-29T05:19:09Z",
      "title": "Is Black Friday still a holiday shopping juggernaut in 2024?",
      "url": "https://apnews.com/2678816a0683519071426a991d89fecb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d0edcad0bd844429c9890ea127cf03c/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB and VOLODYMYR YURCHUK",
      "description": "KYIV, Ukraine (AP) — Desertion is starving the Ukrainian army of desperately needed manpower and crippling its battle plans at a crucial time in its war with Russia, which could put Kyiv at a clear disadvantage in future ceasefire talks.",
      "publishedAt": "2024-11-29T05:26:47Z",
      "title": "Desertion threatens to starve Ukraine's forces at a crucial time in its war with Russia",
      "url": "https://apnews.com/def676562552d42bc5d593363c9e5ea0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e29ca8eca6c49a8b90c9ad998bf6dfe/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "ABUJA, Nigeria (AP) — At least 100 people, most of them women, were missing after a boat transporting them to a food market capsized along the River Niger in northern Nigeria, authorities said Friday.",
      "publishedAt": "2024-11-29T14:31:02Z",
      "title": "At least 100 people are missing after a boat capsized in northern Nigeria",
      "url": "https://apnews.com/076f1d007d1af1b5709084b3048c9dc6",
      "urlToImage": ""
    },
    {
      "author": "BRIAN MELLEY",
      "description": "LONDON (AP) — British lawmakers are expected to vote Friday on a law proposed to help terminally ill adults end their lives.",
      "publishedAt": "2024-11-28T17:43:54Z",
      "title": "Bill to legalize assisted dying in England and Wales faces heated parliamentary debate",
      "url": "https://apnews.com/fdd390388f1135f2cab25f8b2abc6507",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34315f13d0ae484e89388c9e648a9901/3000.jpeg"
    },
    {
      "author": "THOMAS ADAMSON and JOHN LEICESTER",
      "description": "PARIS (AP) — After more than five years of frenetic, but sometimes interrupted, reconstruction work, Notre Dame Cathedral showed itself anew to the world Friday, with rebuilt soaring ceilings and creamy good-as-new stonework erasing somber memories of its devastating fire in 2019.",
      "publishedAt": "2024-11-29T08:41:55Z",
      "title": "Notre Dame Cathedral unveils its new interior 5 years after devastating fire",
      "url": "https://apnews.com/0a6c183693b55a55e0dc3a909000cb02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60bbc7247a1343b4babdba58ffdda846/1920.jpeg"
    },
    {
      "author": "TRAVIS LOLLER",
      "description": "ON BOARD THE SANTA TRAIN (AP) — Since 1943, the people of Appalachian Kentucky, Virginia, and Tennessee have looked forward to Santa's arrival. Not in a sleigh on their rooftops, but on a train. The Santa Train marks its 82nd running this year, bringing presents and joy to small towns along a 110-mile portion of the CSX rail line tucked into remote coal-country river valleys.",
      "publishedAt": "2024-11-29T05:15:35Z",
      "title": "Santa's annual train visit delivers hope and magic to one corner of coal country",
      "url": "https://apnews.com/0b757fdebde6f6134d2c5966c06d1dda",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9f66e554df34802ae5bd63f6c77d856/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}