{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Officials say police and firefighters are responding to an explosion that rocked the city of Palm Springs. The city of Palm Springs says the explosion happened at 11 a.m. local time and that residents were being asked to avoid the area around North Indian Canyon Drive near East Tachevah Drive. Palm Springs is a tony community in the desert about a two-hour drive west of Los Angeles, known for upscale resorts and a history of celebrity residents.",
      "publishedAt": "2025-05-17T19:32:07Z",
      "title": "Police and firefighters respond to an explosion rocking the California city of Palm Springs",
      "url": "https://apnews.com/article/california-explosion-palm-springs-eb8887fbe5877a20a40916aba86554ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Corey Williams",
      "description": "As a punishing heat wave takes hold of Texas, weather forecasters are warning that severe storms with hail and even hurricane-force winds could hobble parts of Appalachia and the Midwest. Tornadoes were also a risk for Friday. The National Weather Service said severe weather was likely across parts of the central Appalachians and the Mid-Atlantic states. Residents in Kentucky, southern Indiana, southern Illinois and parts of Tennessee, Missouri, Arkansas and Ohio should brace for intense storms that could include baseball-sized hail.",
      "publishedAt": "2025-05-16T14:57:30Z",
      "title": "Forecasters warn severe storms, hail and high winds could hobble parts of Appalachia and Midwest",
      "url": "https://apnews.com/article/tornado-weather-thunderstorms-great-lakes-22395202a65b0c37cc06c541ea772172",
      "urlToImage": "https://dims.apnews.com/dims4/default/b395bc4/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F28%2Fb2cfb0f20689406b3f24ba245490%2F70703d337c5840db9f1de0dd0d08fb09"
    },
    {
      "author": "Volodymyr Yurchuk, Hanna Arhirova",
      "description": "A Russian drone has struck a passenger bus in Ukraine’s northeastern Sumy region, killing nine people and injuring four others. Ukrainian officials said the attack happened on Saturday, just hours after Moscow and Kyiv held their first direct peace talks in years which failed to yield a ceasefire. The Sumy regional administration said in a post on the Telegram messaging app that “this is another war crime by Russia — a deliberate strike on civilian transport that posed no threat.” The peace talks ended after less than two hours on Friday, with both sides agreeing on a large prisoner swap while a ceasefire remained elusive.",
      "publishedAt": "2025-05-17T06:50:56Z",
      "title": "Russian drone strike kills 9 people in Ukraine, officials say",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-strike-sumy-e90d68ea2ef45f329a4cda16e200c141",
      "urlToImage": "https://dims.apnews.com/dims4/default/ccc0fa4/2147483647/strip/true/crop/4771x2684+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F41%2F753e359785c8611482f2987c1239%2F7e27a55f093f4772993eb1c541e59731"
    },
    {
      "author": null,
      "description": "Israel says it has launched a new military operation in the Gaza Strip to pressure Hamas to release the remaining hostages. Israel’s defense minister said Saturday that Operation Gideon Chariots began and is being led with “great force” by Israel’s army. The announcement comes after days of intensive strikes across Gaza that killed hundreds of people. Israel’s Prime Minister Benjamin Netanyahu vowed earlier in the week to escalate pressure on Hamas with the aim of destroying the militant group that has ruled Gaza for nearly two decades.",
      "publishedAt": "2025-05-17T11:52:46Z",
      "title": "Israel launches a new military operation in Gaza to pressure Hamas to release hostages",
      "url": "https://apnews.com/article/mideast-wars-israel-gaza-hamas-hostages-05-17-2025-baec52efaea911bf56f8ec25758b7011",
      "urlToImage": "https://dims.apnews.com/dims4/default/d130dc5/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F04%2F951d7b7f28998ece5db1526d8886%2Fc9f69b0fbdcb4706b80c121a597b9b56"
    },
    {
      "author": "Matt Brown, Leah Askarinam",
      "description": "House Republicans are in the final rounds of negotiations over a sweeping budget plan that has been significantly influenced by President Donald Trump's priorities. Many GOP lawmakers expect the bill will only make it through the finish line if Trump personally weighs with members. It is not unusual in the modern era for a president to direct the legislative priorities in Congress, but many House Republicans see Trump’s role as singular and decisive as they aim to pass the bill before Memorial Day.",
      "publishedAt": "2025-05-17T04:05:38Z",
      "title": "Republicans forge their tax bill in Trump's image",
      "url": "https://apnews.com/article/trump-big-beautiful-bill-tax-cuts-medicaid-42f594eb6f1b99373ed1093515088076",
      "urlToImage": "https://dims.apnews.com/dims4/default/f756479/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F0e%2F7cde487126e3ae0510c17c5b79f9%2F0d3da90a193e4689ad3345084c51429e"
    },
    {
      "author": "Alanna Durkin Richer",
      "description": "The Trump administration will allow the sale of forced-reset triggers, which make semiautomatic rifles fire more rapidly. A settlement announced Friday by the Justice Department means the federal government is ending a ban as part of a deal that also requires it to return seized devices. The settlement resolves a series of cases over the aftermarket trigger the government had previously argued qualify as machine guns under federal law. Gun control advocates say the settlement will worsen gun violence.",
      "publishedAt": "2025-05-17T13:06:49Z",
      "title": "Justice Department deal ends a ban on an aftermarket trigger",
      "url": "https://apnews.com/article/justice-department-guns-forced-reset-triggers-c7e5e6ee65171c50c10d4384dd181fec",
      "urlToImage": "https://dims.apnews.com/dims4/default/bbff345/2147483647/strip/true/crop/7546x4245+0+393/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F1b%2F7ce1bd722ad7165c90753c133c58%2F69e247bc6f1b4c71a28b191bcf10e2c1"
    },
    {
      "author": "Sean Murphy",
      "description": "Beginning next school year, the curriculum standards for Oklahoma high school students will including conspiracy theories about the 2020 presidential election. The standards were revised at the direction of state School Superintendent Ryan Walters. The first-term conservative has leaned into fighting what he describes as “wokeness” in public schools. A lawsuit has been filed challenging the new standards, and even the GOP governor and state legislators have expressed concern over letting the standards take effect for the upcoming school year. One Democratic state lawmaker says Walters' push is \"harmful posturing and political theater.\"",
      "publishedAt": "2025-05-17T12:08:06Z",
      "title": "New Oklahoma school standards promote misinformation about the 2020 vote",
      "url": "https://apnews.com/article/oklahoma-curriculum-2020-election-misinformation-bbc05b14c3d7a858014f6acefc326ec6",
      "urlToImage": "https://dims.apnews.com/dims4/default/03539e7/2147483647/strip/true/crop/3741x2104+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F78%2Fd05891b4ceb261ec6bc2b00ef98b%2F0557b5fa67b9415dac4d9b80f3699c80"
    },
    {
      "author": "Deepti Hajela",
      "description": "The slang term at the center of a political firestorm around former FBI Director James Comey likely originated as food-service-industry jargon before extending to other uses. In a since-deleted Instagram post, Comey shared a photo of shells in the shapes of “86 47.” He said he took it as a political message, since President Donald Trump is the 47th president, and to “86” something can be to get rid of it, like a rowdy patron at a bar. But Trump and other Republicans took it more ominously, saying Comey was advocating violence, given that “86” has at times been used as a way to mean someone’s killing.",
      "publishedAt": "2025-05-17T12:30:41Z",
      "title": "Here's where the term '86,' suddenly controversial, likely originated",
      "url": "https://apnews.com/article/comey-trump-online-post-threat-slang-term-8ff18dd19d66ef35a85a0e3d7187bd4b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4d5af2/2147483647/strip/true/crop/3496x1966+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fc4%2F1c562d7a33f51fbf1acf4f027c05%2Fa14e8316d1d04992bd17e91eaa328ec8"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump on Saturday ripped into the retailer Walmart, saying on social media that it should eat the additional costs created by his import taxes. As the U.S. president has jacked up tariffs, he has tried to assure a skeptical public that foreign producers would pay for the taxes and that retailers and automakers would absorb the additional expenses. Most economic analyses are deeply skeptical of those claims and have warned that the tariffs would worsen inflation, but Walmart warned on Thursday that everything from bananas to children’s car seats could increase in price.",
      "publishedAt": "2025-05-17T15:55:20Z",
      "title": "Trump warns Walmart not to raise prices due to his tariffs",
      "url": "https://apnews.com/article/trump-tariffs-walmart-inflation-import-taxes-e2012e0d9e242b0be0b9474aa58d41fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/92eb22a/2147483647/strip/true/crop/2122x1194+0+110/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F8d%2F29a045c4c05201c99dcb69e9e0e5%2F99a9a56643ae4e22901f19eead5cc5f6"
    },
    {
      "author": null,
      "description": "Testimony in the Sean “Diddy” Combs sex trafficking trial has opened a window into what prosecutors say was the sordid world of group sex, drugs and violence beneath his glittering, jet-set persona. Much of the testimony that began on Monday was hard to watch. Combs ex-girlfriend, Cassie, recounted being beaten and pressured into degrading sexual performances with strangers. A lawyer for the Bad Boy Records founder conceded Combs was a jerk and a swinger prone to violence, but argued he wasn't a sex trafficker.",
      "publishedAt": "2025-05-17T04:11:43Z",
      "title": "Key moments from first week of Sean ‘Diddy’ Combs’ sex trafficking trial",
      "url": "https://apnews.com/article/combs-diddy-cassie-freak-offs-sex-trial-afa3c282e1482406783af679b88a78e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a7dd2b/2147483647/strip/true/crop/512x288+0+48/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F78%2Feba14378c78f40c8ca244f418f23%2F65c97abd995443cc8781d48b5e643605"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}