{
  "articles": [
    {
      "author": "BARBARA SURK and HELENA ALVES",
      "description": "PARIS (AP) — A coalition on the left that came together unexpectedly ahead of France’s snap elections won the most parliamentary seats in the vote, according to polling projections Sunday. The surprise projections put President Emmanuel Macron’s centrist alliance in second and the far right in third.",
      "publishedAt": "2024-07-07T04:00:38Z",
      "title": "French leftists win most seats in elections, pollsters say. Lack of majority to create turmoil",
      "url": "https://apnews.com/08f10a7416a2494c85dcd562f33401d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f51256f4c1446cab8dce7267d339fc0/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and WILL WEISSERT",
      "description": "PHILADELPHIA (AP) — President Joe Biden urged supporters to stay unified behind him at a rousing Black church service Sunday where the pastor referenced biblical teachings in declaring “never count Joseph out,” and blamed jealousy for intensifying pressure from some Democrats to abandon his reelection bid.",
      "publishedAt": "2024-07-07T14:45:53Z",
      "title": "Biden tells supporters to 'stick together' amid growing calls for him to leave the presidential race",
      "url": "https://apnews.com/77b050b1c5c39aec2ef633281d082566",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/622abf9cef934d2abaee51078fc957b6/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Growing skepticism about President Joe Biden's reelection chances has European leaders heading to the NATO summit in Washington confronting the prospect that the military alliance's most prominent critic, Donald Trump, may return to power over its mightiest military.",
      "publishedAt": "2024-07-07T11:03:34Z",
      "title": "Can you 'Trump-proof' NATO? As Biden falters, Europeans look to safeguard the military alliance",
      "url": "https://apnews.com/e45273ef1bd408d72245f8f7fd1ec5c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8eefcce104d4f15a01443b64580d9ea/3000.jpeg"
    },
    {
      "author": "MARGERY A. BECK",
      "description": "A long-running heat wave that has already shattered previous records across the U.S. will persist, baking parts of the West with dangerous temperatures that will soar into the 100s and holding the East in its hot and humid grip throughout the week, forecasters said Sunday.",
      "publishedAt": "2024-07-07T04:24:47Z",
      "title": "Persistent heat wave in the US expected to shatter new records as it bakes West and swelters in East",
      "url": "https://apnews.com/f64b0459aaf83e0a4a12ab6d5e626bb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f4647201c0b42ed8051c90405555a39/1920.jpeg"
    },
    {
      "author": "MARK VANCLEAVE and JUAN LOZANO",
      "description": "MATAGORDA BAY, Texas (AP) — The outer bands of Beryl brought rain and intensifying winds to Texas on Sunday as coastal residents boarded up windows, left beach towns under evacuation orders and braced for the tropical storm that forecasters expected to strengthen back into a hurricane before landfall.",
      "publishedAt": "2024-07-07T04:06:37Z",
      "title": "Beryl bears down on Texas, where it's expected to hit Monday and regain hurricane strength",
      "url": "https://apnews.com/a01a44797f9de77a54b3a8be454ea37f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9e849ac7bb94d3b89d99a123c44d7ed/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Marking nine months since the war in Gaza started, Israeli protesters blocked highways across the country Sunday, calling on Prime Minister Benjamin Netanyahu to step down and pushing for a cease-fire to bring back scores of hostages held by Hamas.",
      "publishedAt": "2024-07-07T09:41:42Z",
      "title": "Israeli protesters block highways, call for cease-fire to return hostages 9 months into war in Gaza",
      "url": "https://apnews.com/d78b75084f38c98e219e64db588374b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f33d7c67fd2944e99ab9c4a870519984/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — A village in a border region of western Russia was evacuated Sunday following a series of explosions after debris from a downed Ukrainian drone set fire to a nearby warehouse, local officials said.",
      "publishedAt": "2024-07-07T09:30:19Z",
      "title": "A Ukrainian drone triggers warehouse explosions in Russia as a war of attrition grinds on",
      "url": "https://apnews.com/c9f2a4ac5de59bb0716335472e840913",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a8fba0d580c43fb80cd3f3b8a6b2249/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY",
      "description": "LONDON (AP) — British Prime Minister Keir Starmer headed Sunday on a tour of the four corners of the U.K.",
      "publishedAt": "2024-07-07T12:00:02Z",
      "title": "British prime minister hits the road to 'reset' ties with Scotland, Northern Ireland and Wales",
      "url": "https://apnews.com/5d0b0111764809f98708c63cb16c94cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d379205400442649554bed235924f99/3000.jpeg"
    },
    {
      "author": "OHAD ZWIGENBERG",
      "description": "RAFAH, Gaza Strip (AP) — Two months ago, before Israeli troops invaded Rafah, the city sheltered most of Gaza's more than 2 million people.",
      "publishedAt": "2024-07-07T09:46:16Z",
      "title": "Rafah is a dusty, rubble-strewn ghost town 2 months after Israel invaded to root out Hamas",
      "url": "https://apnews.com/a30f9f2fbad8439be94e1b9f12ae9609",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19d0eecb91554aba8cc56028f12fb659/1920.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "JOANETES, Spain (AP) — Xavier Pallàs plants his feet on the belfry floor, grips the rope, and with one tug fills the lush Spanish valley below with the reverberating peal of a church bell.Clang-clong!",
      "publishedAt": "2024-07-07T04:56:25Z",
      "title": "Church bells speak again in Spain thanks to effort to recover the lost 'language' of ringing by hand",
      "url": "https://apnews.com/316a9fcb69b01f239e915983c6c361d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb3da0e2b99f44c99d2fd3fe46f49aa3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}