{
  "articles": [
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President-elect Donald Trump said Thursday he will nominate former Florida Attorney General Pam Bondi to lead the Justice Department, turning to a longtime ally after his first choice, Matt Gaetz, withdrew his name from consideration amid scrutiny over sex trafficking allegations.",
      "publishedAt": "2024-11-21T17:33:02Z",
      "title": "Trump chooses loyalist Pam Bondi for attorney general pick after Matt Gaetz withdraws",
      "url": "https://apnews.com/248b46ba0c882dd46d661568e8bd3bd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96c8ca8dc86c40c99fa5f6049450680f/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and COLLEEN LONG",
      "description": "NEW YORK (AP) — Pam Bondi, the former Florida attorney general, was chosen Thursday by Donald Trump to serve as U.S.",
      "publishedAt": "2024-11-22T02:21:58Z",
      "title": "What to know about Pam Bondi, Trump's new pick for attorney general",
      "url": "https://apnews.com/eec1d16075c7debda62223b475e3977d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50c500ca8af8429584fa33b0470fe4d8/2742.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and COLLEEN LONG",
      "description": "WASHINGTON (AP) — In the two weeks since Donald Trump won the presidency, he's tried to demonstrate his dominance by naming loyalists for top administration positions, even though many lack expertise and some face sexual misconduct accusations.",
      "publishedAt": "2024-11-21T22:43:27Z",
      "title": "Trump convinced Republicans to overlook his misconduct. But can he do the same for his nominees?",
      "url": "https://apnews.com/c881a3825db6765f642bfe3fd6df183b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0f0b147567a4c91b56e74bd61555a24/3000.jpeg"
    },
    {
      "author": "GODOFREDO A. VÁSQUEZ, JANIE HAR and CHRISTOPHER WEBER",
      "description": "FORESTVILLE, Calif. (AP) — A major storm moving through Northern California on Thursday dropped heavy snow and record rain, flooding some areas, after killing two people and knocking out power to hundreds of thousands in the Pacific Northwest.",
      "publishedAt": "2024-11-21T06:12:06Z",
      "title": "Storm dumps record rain and heavy snow on Northern California. Many in Seattle still without power",
      "url": "https://apnews.com/8d3f42726c42c64355a47e3f25de27d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77bd75bc372048de87339f6d23f31bc7/1920.jpeg"
    },
    {
      "author": "BRIAN MELLEY",
      "description": "The decision by the International Criminal Court to issue arrest warrants for the Israeli prime minister and a top Hamas official puts them in a small group of leaders to be accused of crimes against humanity.",
      "publishedAt": "2024-11-21T21:03:35Z",
      "title": "Warrants put Israeli PM and others in a small group of leaders accused of crimes against humanity",
      "url": "https://apnews.com/8668a2683972297c5a22ea30164a1445",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d950c675b124746a50e02513d9f752b/3000.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — The U.N. nuclear watchdog’s board on Thursday condemned Iran for failing to cooperate fully with the agency, the second time it has done so in just five months.",
      "publishedAt": "2024-11-21T21:00:13Z",
      "title": "UN nuclear agency’s board condemns Iran for the 2nd time this year for failing to fully cooperate",
      "url": "https://apnews.com/4706276a489b1a4cce2ca6260d0b3182",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e03dab7e745a424b8e85722fd51b26ae/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The new ballistic missile fired by Russia struck a military-industrial facility in the central Ukrainian city of Dnipro, but its real mission was delivering a deadly new message to NATO.",
      "publishedAt": "2024-11-21T20:32:30Z",
      "title": "Putin touts Russia's new missile and delivers a menacing warning to NATO",
      "url": "https://apnews.com/d50183ccfc28b10c71e93f3e68159a61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70e4fb696d6340bcaaaba612b0e860b5/3000.jpeg"
    },
    {
      "author": "JOHN O'CONNOR and SOPHIA TAREEN",
      "description": "SPRINGFIELD, Ill. (AP) — The Illinois Supreme Court on Thursday overturned actor Jussie Smollett’s conviction on charges of staging a racist and homophobic attack against himself in 2019 and lying to Chicago police, saying he should not have been charged a second time after reaching a deal with prosecutors.",
      "publishedAt": "2024-11-21T15:53:09Z",
      "title": "Jussie Smollett’s conviction in 2019 attack on himself is overturned",
      "url": "https://apnews.com/91178cf27f6ef0aec8a5eef67a3a6125",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73f0a8ec3b9a42a78b4c313b082eb5a8/1920.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "ATMORE, Ala. (AP) — An Alabama man convicted in the 1994 killing of a hitchhiker cursed at the prison warden and made obscene gestures with his hands shortly before he was put to death Thursday evening in the nation’s third execution using nitrogen gas.",
      "publishedAt": "2024-11-21T05:11:07Z",
      "title": "Alabama carries out nation’s third nitrogen gas execution on a man for a hitchhiker's killing",
      "url": "https://apnews.com/09450359e223a9d38a5fb24e87fcfb45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a100992fbc9d4787ac009e8f34425d45/3000.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — Shohei Ohtani keeps setting records, even after the season is over.The Los Angeles Dodgers star added his third Most Valuable Player award to his collection and first in the National League when he was chosen unanimously by the Baseball Writers' Association of America on Thursday.",
      "publishedAt": "2024-11-21T15:46:35Z",
      "title": "Shohei Ohtani wins third MVP award, first in NL. Aaron Judge earns second AL honor in 3 seasons",
      "url": "https://apnews.com/b1084cc2de55746a1595e4fa2fd29bdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03c2098b03454c08a627285375c160d2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}