{
  "articles": [
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israel's prime minister, Benjamin Netanyahu, entered Syrian territory Tuesday and said Israeli troops would remain in the area indefinitely, blurring the border with its northern neighbor.",
      "publishedAt": "2024-12-18T04:57:45Z",
      "title": "Israel's borders have shifted throughout its history. Action in Syria may reshape them again",
      "url": "https://apnews.com/5fdf8fdbe2ec2cee7b9cf7f78fbb1c8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd367eb1a6e14c4791406fe3698a864a/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — As the war in Gaza rages, Syria's government transforms, and the Israeli-occupied West Bank seethes, Armenian residents of the Old City of Jerusalem fight a different battle — one that is quieter, they say, but no less existential.",
      "publishedAt": "2024-12-18T06:06:23Z",
      "title": "As wars rage around them, Armenian Christians in Jerusalem's Old City feel the walls closing in",
      "url": "https://apnews.com/6c1b4d324bd4a657be4836c092077e39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0f03413da684c2e80fbdcfff729072e/3000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — Vanuatu's capital was without water on Wednesday, a day after reservoirs were destroyed by a violent magnitude 7.3 earthquake that wrought havoc on the South Pacific island nation, with the number of people killed and injured expected to rise.",
      "publishedAt": "2024-12-18T02:18:56Z",
      "title": "Rescuers dig for survivors of Vanuatu earthquake with no water and unclear death toll",
      "url": "https://apnews.com/85f483b151f928cc25175038c33fb6d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84076072bc0540319b350ef83df4e396/1920.jpeg"
    },
    {
      "author": "DEVI SHASTRI and SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — Community members in Wisconsin continued to wrestle with grief and called for change in the aftermath of a school shooting that killed a teacher and a student and wounded six others.",
      "publishedAt": "2024-12-18T05:53:37Z",
      "title": "Community members wrestle with grief in aftermath of Wisconsin school shooting",
      "url": "https://apnews.com/f7596d62f72b6b358add8c35f0e2eee4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/378f7cf32b794b40965ce1b8fb40e8a6/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The man accused of killing UnitedHealthcare's CEO has been charged with murder as an act of terrorism, prosecutors said Tuesday as they worked to bring him to a New York court from a Pennsylvania jail.",
      "publishedAt": "2024-12-17T20:28:30Z",
      "title": "Suspect charged with killing UnitedHealthcare's CEO as an act of terrorism",
      "url": "https://apnews.com/fccc9e875e976b9901a122bc15669425",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e2ae7a1e94a4927a718cdbadc64ede0/2667.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russia's security service said Wednesday that it has detained a suspect in the killing of a senior general in Moscow.",
      "publishedAt": "2024-12-18T07:20:02Z",
      "title": "Russia says suspect detained in the killing of a senior general in Moscow",
      "url": "https://apnews.com/32e504b029d8db0b8d52474d75efc383",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/edee12e786e947ca8e364cf9fbeb5cd1/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT, SARAH PARVINI and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — Elon Musk, clad in tuxedo and black tie, took the stage at President-elect Donald Trump's Mar-a-Lago resort shortly after the election with all the swagger of the winning candidate himself.",
      "publishedAt": "2024-12-18T05:03:02Z",
      "title": "Musk and Trump are viewed roughly the same by Americans, an AP-NORC poll finds",
      "url": "https://apnews.com/8506a4eed5ac5dcfe818a277e4adf42a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b54f56d1c8814605961c6c023eb808f7/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN and RICK CALLAHAN",
      "description": "MICHIGAN CITY, Ind. (AP) — An Indiana man convicted of killing four people including his brother and his sister’s fiancé decades ago was put to death early Wednesday, marking the state’s first execution in 15 years.",
      "publishedAt": "2024-12-18T07:17:22Z",
      "title": "Man convicted of quadruple homicide is put to death in Indiana's 1st execution in 15 years",
      "url": "https://apnews.com/fc5f9c8fa9055e8fbc0aafd300e6d7ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0741e6514f1f4ce5aceabd938a07791d/3000.jpeg"
    },
    {
      "author": "ELAINE KURTENBACH",
      "description": "BANGKOK (AP) — Japanese automakers Nissan Motor Corp. and Honda Motor Co. confirmed Wednesday that they are discussing closer collaboration but denied reports they have decided on a merger. Nissan’s share price soared more than 22% in Tokyo after reports citing unnamed sources said it might merge with Honda to form the world’s third-largest automaking group.",
      "publishedAt": "2024-12-18T03:48:38Z",
      "title": "Nissan, Honda confirm talks on closer collaboration but say there's been no decision on a merger",
      "url": "https://apnews.com/56199be5bf5b99b0c739acfb1a9244dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6ab5e25370447ca98774c58c64b0b0b/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "AVIGNON, France (AP) — French judges plan to deliver hugely anticipated verdicts this week in a historic drugging-and-rape trial that has turned the victim, Gisèle Pelicot, into a feminist hero.",
      "publishedAt": "2024-12-18T04:58:18Z",
      "title": "Verdicts are due in the historic French rape trial that turned Gisèle Pelicot into a feminist hero",
      "url": "https://apnews.com/63c34498ece4d41a4b6396101ca0178c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d610341ab4e542d692c64d5543987107/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}