{
  "articles": [
    {
      "author": "TODD RICHMOND, SCOTT BAUER and RYAN J. FOLEY",
      "description": "MADISON, Wis. (AP) — The shooter who killed a student and teacher at a religious school in Wisconsin brought two guns to the school and was in contact with a man in California whom authorities say was planning to attack a government building, according to authorities and court documents that became public Wednesday.",
      "publishedAt": "2024-12-18T18:47:02Z",
      "title": "Wisconsin school shooter had 2 guns and got messages from man accused of plotting his own attack",
      "url": "https://apnews.com/62313e9e9d20f3ed59fcf8d2c7fc3b44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/378f7cf32b794b40965ce1b8fb40e8a6/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump delivered a likely death blow to bipartisan congressional budget negotiations on Wednesday, rejecting the measure as full of giveaways to Democrats after billionaire ally Elon Musk whipped up outrage toward the bill and cheered on Republican lawmakers who announced their opposition.",
      "publishedAt": "2024-12-18T22:57:41Z",
      "title": "Trump brings chaos back to Washington by attempting to kill bipartisan budget deal with Musk's help",
      "url": "https://apnews.com/5dc9fd8672f9807189032811d4ab0528",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d7f96feb85442da86adc0415f0bbef6/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — New York prosecutors are using a 9/11-era anti-terrorism law in their case against the man charged with gunning down UnitedHealthcare's CEO outside a midtown Manhattan hotel.",
      "publishedAt": "2024-12-18T22:28:46Z",
      "title": "How New York prosecutors used a terrorism law in the charges against Luigi Mangione",
      "url": "https://apnews.com/7fcb28dcc0106c980b6ecf4aa9cf682f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5c32f18582444ae8fcabe7173c91f9e/1741.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A series of intense Israeli airstrikes shook Yemen's rebel-held capital and a port city early Thursday, shortly after a Houthi missile targeted central Israel. The strikes further escalate Israel's campaign against the Iranian-backed Houthis, who have so far avoided the same level of intense military strikes that have targeted the Palestinian Hamas militant group and Lebanon's Hezbollah, members of Tehran's self-described “Axis of Resistance.”",
      "publishedAt": "2024-12-19T01:54:11Z",
      "title": "Israeli airstrikes hit Yemen's rebel-held capital and port city after Houthi attack targets Israel",
      "url": "https://apnews.com/8f73755ccc47a34261cc041658403b4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e506d8fecf541d29d038cbc9a1b284a/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House Ethics Committee voted in secret to release the long-awaited ethics report into ex-Rep. Matt Gaetz, raising the possibility that the allegations against the Florida Republican who was President-elect Donald Trump's first choice for attorney general could be made public in the coming days.",
      "publishedAt": "2024-12-18T16:47:32Z",
      "title": "House Ethics Committee secretly voted to release Matt Gaetz ethics report, source says",
      "url": "https://apnews.com/4db3ee2d94dbcbfb6ed5e641d455d734",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d331d7fc20f84c479ba9465549f66ef8/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — U.S. auto safety regulators have backed away from seeking a giant recall of nearly 50 million air bag inflators and will investigate further after the auto industry raised questions about whether all of the inflators are defective.",
      "publishedAt": "2024-12-18T20:16:43Z",
      "title": "US retreats from massive air bag recall and says industry comments show need for more investigation",
      "url": "https://apnews.com/21d7eefff210677668f44d9edcfeeda9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b136cb3f69c647d9986f30e984c20ac1/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — The federal judge who presided over the seditious conspiracy case against Oath Keepers members said Wednesday that it would be \"frightening\" if the anti-government group's founder, Stewart Rhodes, is pardoned for orchestrating a violent plot to keep Donald Trump in the White House after he lost the 2020 presidential election.",
      "publishedAt": "2024-12-18T17:59:08Z",
      "title": "Judge: Pardoning Oath Keepers leader Stewart Rhodes for Capitol riot plot would be 'frightening'",
      "url": "https://apnews.com/d2a498d980bc9fa3186e1072a94c0dad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/755ccdf62dab4d41a561742f0e41da04/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK, ADRIENNE SURPRENANT and SYLVIE CORBET",
      "description": "MAMOUDZOU, Mayotte (AP) — They clustered around water taps, rare sources of electricity and each other. Four days after the strongest cyclone in nearly a century ripped through the French island territory of Mayotte off the coast of Africa, survivors recalled the horror of the storm that caught many by surprise.",
      "publishedAt": "2024-12-18T14:03:03Z",
      "title": "Survivors recount 'very apocalyptic' cyclone that ripped through French territory of Mayotte",
      "url": "https://apnews.com/e073dfc2eda629af0a297e74f2f333fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4243bf5f5e994ae09e0cff3525020dff/1920.jpeg"
    },
    {
      "author": "AMY BETH HANSON",
      "description": "HELENA, Mont. (AP) — Montana’s Supreme Court on Wednesday upheld a landmark climate ruling that said the state was violating residents’ constitutional right to a clean environment by permitting oil, gas and coal projects without regard for global warming.",
      "publishedAt": "2024-12-18T20:11:47Z",
      "title": "Global warming can't be ignored, Montana's top court says, upholding landmark climate case",
      "url": "https://apnews.com/7c4b6261f610d504995743f7320533e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27ef8715cec24d06a2d94567f3f4f19b/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — The Federal Reserve cut its key interest rate Wednesday by a quarter-point — its third cut this year — but also signaled that it expects to reduce rates more slowly next year than it previously envisioned, mostly because of still-elevated inflation.",
      "publishedAt": "2024-12-18T05:01:25Z",
      "title": "Federal Reserve cuts its key rate by a quarter-point but envisions fewer reductions next year",
      "url": "https://apnews.com/7474747d890c0fdcc87454fd4c80aaa4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28070e49aaa04cf8a69c131e815c7356/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}