{
  "articles": [
    {
      "author": null,
      "description": "MADISON, Wis. (AP) — Settlement shows how Trump lawyers crafted plan for fake electors to file papers falsely saying he won Wisconsin in 2020.",
      "publishedAt": "2024-03-04T16:24:03Z",
      "title": "Settlement shows how Trump lawyers crafted plan for fake electors to file papers falsely saying he won Wisconsin in 2020",
      "url": "https://apnews.com/f88474293eb32c14e6f0789e230004db",
      "urlToImage": ""
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Monday unanimously restored Donald Trump to 2024 presidential primary ballots, rejecting state attempts to ban the Republican former president over the Capitol riot.",
      "publishedAt": "2024-03-04T05:04:32Z",
      "title": "Supreme Court restores Trump to ballot, rejecting state attempts to ban him over Capitol attack",
      "url": "https://apnews.com/51e79c0f03013034c8a042cb278b6446",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e88668599304ed88ee645e276da6c54/1920.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "MADISON, Wis. (AP) — Two attorneys for then-President Donald Trump orchestrated a plan for fake electors to file paperwork falsely saying the Republican won Wisconsin in a strategy to overturn Joe Biden’s 2020 victory there and in other swing states, according to a lawsuit settlement reached Monday that makes public months of texts and emails.",
      "publishedAt": "2024-03-04T16:25:54Z",
      "title": "Settlement in Wisconsin fake elector case offers new details on the strategy by Trump lawyers",
      "url": "https://apnews.com/f416cd04adfa9f92c382b7c9e8a94ce7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c9ce593830640468228eb421228a9b0/3000.jpeg"
    },
    {
      "author": "DREW CALLISTER",
      "description": "NEW YORK (AP) — Omar Abu Kuwaik is far from his home in Gaza. The 4-year-old's parents and sister were killed by an Israeli airstrike, when he lost part of his arm. He’s one of the lucky ones.",
      "publishedAt": "2024-03-04T05:15:51Z",
      "title": "A 4-year-old Gaza boy lost his arm – and his family. Half a world away, he’s getting a second chance",
      "url": "https://apnews.com/65b993f4b77b6d474c52062f6ca0fb10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84324bb6df0d44c887b1d014033f603b/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris on Monday is hosting a member of Israel’s wartime Cabinet who is visiting Washington in defiance of Israeli Prime Minister Benjamin Netanyahu.",
      "publishedAt": "2024-03-04T05:13:12Z",
      "title": "Harris will meet with Israeli Cabinet official who is in Washington despite Netanyahu's rebuke",
      "url": "https://apnews.com/e86e6f95a0707e290384fcc86367e4fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffc9e5a2c85c4de5a486a61966683d11/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Allen Weisselberg, the former chief financial officer of Donald Trump's company, pleaded guilty Monday in New York to perjury in connection with testimony he gave in the ex-president’s civil fraud case.",
      "publishedAt": "2024-03-04T14:32:57Z",
      "title": "Former Trump CFO Allen Weisselberg pleads guilty to perjury in ex-president’s civil fraud case",
      "url": "https://apnews.com/0101a9972cefd1e1fb4ba6d36e69fecb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cad054e1d0514b33aa50dfd193cabafd/2490.jpeg"
    },
    {
      "author": "JOSH BOAK and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — A poll finds that a significant share of U.S. adults doubt the mental capabilities of 81-year-old President Joe Biden and 77-year-old Donald Trump, the former president and current Republican front-runner in what could be a rematch of the 2020 election.",
      "publishedAt": "2024-03-04T05:02:29Z",
      "title": "6 in 10 US adults doubt mental capability of Biden and Trump, AP-NORC poll finds",
      "url": "https://apnews.com/66d8784586d21f30885d8153f949510c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2389ad1d0abf418390cd8ee195b653ce/1920.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — The European Union leveled its first antitrust penalty against Apple on Monday, fining the U.S. tech giant nearly $2 billion for unfairly favoring its own music streaming service by forbidding rivals like Spotify from telling users how they could pay for cheaper subscriptions outside of iPhone apps.",
      "publishedAt": "2024-03-04T12:05:49Z",
      "title": "Apple gets fined nearly $2 billion by the EU for hindering music streaming competition",
      "url": "https://apnews.com/439e3e8af91d844dee3dc8ff8012c68f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e114acc6005473c961dca224c08b905/3000.jpeg"
    },
    {
      "author": "EVENS SANON and PIERRE-RICHARD LUXAMA",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Authorities in Haiti have ordered a nighttime curfew after an explosion of violence when gang gunmen overran the two biggest prisons and freed thousands of inmates over the weekend.",
      "publishedAt": "2024-03-04T05:06:37Z",
      "title": "Haiti orders a curfew after gangs overrun its two largest prisons. Thousands have escaped",
      "url": "https://apnews.com/105ca137aa337b9e6681cf87add9a5c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f437685d4baf4661b3dd5fcfafa8adba/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG and MICHELLE CHAPMAN",
      "description": "JetBlue Airways and Spirit Airlines are ending their proposed $3.8 billion merger weeks after a federal judge blocked the the deal, saying it would hurt consumers who depend on Spirit's lower fares.",
      "publishedAt": "2024-03-04T13:51:33Z",
      "title": "JetBlue and Spirit are ending their $3.8 billion merger plan after a federal judge blocked the deal",
      "url": "https://apnews.com/2d9a640e7f7ecb87d5f60c1cbffbc163",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9b3d75bb9ac48bd89538c57b5719db0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}