{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "The fallout from the Jeffrey Epstein saga is rippling through Europe. Politicians, diplomats, officials and royals have seen reputations tarnished, investigations launched and jobs lost. It comes after a trove of more than 3 million pages of Epstein-related documents revealed their ties to the U.S. financier and convicted sex offender who died behind bars in 2019. Some experts note that the reckoning in Europe’s parliamentary democracies has been swifter and more severe for now than in the United States where Epstein built his empire and hobnobbed with many American elites.",
      "publishedAt": "2026-02-11T14:56:44Z",
      "title": "New revelations from Epstein files take a toll across Europe",
      "url": "https://apnews.com/article/epstein-files-europe-mandelson-andrew-jagland-juul-f83e424195d6af111ecec1cb9fda0ac9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e68d3c8/2147483647/strip/true/crop/5906x3935+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F1a%2F03eada37b49ac59df2e4215114b3%2Fd91d7c36a5d743e895513a65c8f7ee01"
    },
    {
      "author": "Konstantin Toropin, Jon Gambrell",
      "description": "The world’s largest aircraft carrier, the USS Gerald R. Ford, has been ordered to sail from the Caribbean Sea to the Middle East. That's according to a person familiar with the matter who spoke Thursday on condition of anonymity. It comes as U.S. President Donald Trump considers whether to take possible military action against Iran. The move, first reported by The New York Times, will put two carriers and their accompanying warships in the region as Trump increases pressure on Iran to make a deal over its nuclear program.",
      "publishedAt": "2026-02-13T04:44:52Z",
      "title": "Second US aircraft carrier is going to the Middle East, AP source says",
      "url": "https://apnews.com/article/trump-iran-aircraft-carrier-military-8db3fab10476949acda8b973be416204",
      "urlToImage": "https://dims.apnews.com/dims4/default/09e5af1/2147483647/strip/true/crop/4724x3148+2+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F1d%2F114777173880f03ca451fcd761a3%2Fd295d48c402440db8abee8c9da00efe3"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Trans-Atlantic tensions in focus as annual Munich security gathering opens",
      "url": "https://apnews.com/article/germany-munich-security-conference-europe-trump-rubio-ed14276dfe3b957490521deee3d78414",
      "urlToImage": null
    },
    {
      "author": "Will Weissert, Brian Slodysko",
      "description": "President Donald Trump says he's amassed a collection of campaign funds exceeding $1.5 billion, an unprecedented sum for a lame-duck president. He claims to have raked in that much just between Election Day 2024 and last August, though details on the exact figure are unclear. The funds could play a huge role in influencing this November's midterms and even the 2028 race to succeed Trump. But it's also possible the mountain of cash could benefit Trump's own business interests. In the past, Trump has spent little to support political causes beyond his own — raising questions about the political funds' true purpose and potential impact on future races.",
      "publishedAt": "2026-02-13T05:08:33Z",
      "title": "Trump's campaign war chest could rock the 2026 midterms",
      "url": "https://apnews.com/article/trump-fundraising-midterm-spending-super-pac-aeebc801e1394b0ac6e9ef66825f67b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/0212392/2147483647/strip/true/crop/3778x2517+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2F50%2F41cdd409b02452c913dd3371c818%2F2efc36a4d48645a7bbc4cd1f848779a5"
    },
    {
      "author": "Will Weissert",
      "description": "President Donald Trump is visiting Fort Bragg in North Carolina on Friday to praise special forces involved in the capture of Venezuela’s former leader, Nicolás Maduro. First lady Melania Trump is joining the president on Friday's trip, and they plan to meet with military families. The base is one of the largest in the world by population. Trump was last there in June at an event meant to recognize the 250th anniversary of the U.S. Army. But that celebration was overshadowed by Trump's partisan remarks at the time. Since Maduro's ouster, Trump has pushed for broad oversight of the South American country’s oil industry.",
      "publishedAt": "2026-02-13T05:15:39Z",
      "title": "Trump is going to Fort Bragg to celebrate Maduro's capture",
      "url": "https://apnews.com/article/trump-fort-bragg-venezuela-special-forces-economy-e0f3ef918509c5137c434110dc090ffe",
      "urlToImage": "https://dims.apnews.com/dims4/default/d9b5b28/2147483647/strip/true/crop/2166x1443+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F72%2F9cfbcb0e1572a3c7975f4cf8e1c0%2F19bcc59dea0d4763a2aa8d9543547ab7"
    },
    {
      "author": "Mariam Fam, Wafaa Shurafa",
      "description": "The Great Omari Mosque in Gaza City was hit by an Israeli strike during the war with Hamas. It is one of dozens of heritage sites that were damaged or destroyed during the war. With major military operations halted by a shaky ceasefire, Palestinians are gaining a clearer picture of the war's devastation, including the loss of buildings and artifacts testifying to the territory's rich history. Some repairs are underway, but full-scale restoration, and broader reconstruction of the war-ravaged territory, face major obstacles. Israel says it takes the sensitivity of heritage sites into careful account and accuses Hamas of positioning military assets beneath or near them and other civilian buildings.",
      "publishedAt": "2026-02-13T04:30:58Z",
      "title": "Palestinians look to salvage Gaza's history from the ruins of war",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-cultural-religious-historic-heritage-91aa321b535c6f92b6158403d4717072",
      "urlToImage": "https://dims.apnews.com/dims4/default/bc5c1c2/2147483647/strip/true/crop/6509x4337+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F93%2F1044edccf77cbdd21c6e3557f3fe%2F8e4c09ad7cfc4fbfbbc78807d36ef4e6"
    },
    {
      "author": "David Rising, Niniek Karmini",
      "description": "Indonesia is training troops for a new peacekeeping force in Gaza, backing a key part of President Donald Trump’s postwar plan. Earlier this week, the army chief said training has started even though Indonesia has no clear guidance yet. Officials now talk about sending 5,000 to 8,000 troops, focusing on engineering and medical units. Indonesia has long U.N. peacekeeping experience and has backed Gaza aid. But many at home doubt the plan, wondering who will pay the troops and how they will be used. An online petition also calls for Indonesia to reverse its decision to join Trump's Board of Peace, questioning its legitimacy.",
      "publishedAt": "2026-02-13T09:18:10Z",
      "title": "Indonesia readies up to 8,000 troops for Gaza peacekeeping force",
      "url": "https://apnews.com/article/indonesia-trump-prabowo-gaza-israel-peacekeeping-22185f61dd39e6f0c04f22bb541944da",
      "urlToImage": "https://dims.apnews.com/dims4/default/44ba063/2147483647/strip/true/crop/7269x4844+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Fee%2F867a835e5f7938725b1cfd3c5ff1%2F007686b1abd9486caefcdc7f6216ace4"
    },
    {
      "author": "Michael Biesecker, Jack Brook",
      "description": "Federal prosecutors in Minneapolis have moved to drop felony assault charges against two Venezuelan men, including one shot in the leg by a immigration officer, after new evidence emerged undercutting the government’s version of events. The U.S. Attorney’s Office for the District of Minnesota said in a filing Thursday that newly discovered evidence in the case against Alfredo Alejandro Aljorna and Julio Cesar Sosa-Celis is materially inconsistent with the allegations against them. The government’s motion asked the judge for dismissal with prejudice, meaning the charges cannot be resubmitted. The pending dismissal comes after a string of high-profile shootings involving federal immigration agents have seen claims made by federal officers called into question.",
      "publishedAt": "2026-02-13T05:35:47Z",
      "title": "Prosecutors move to dismiss case against men accused of assaulting ICE officer in Minnesota",
      "url": "https://apnews.com/article/immigration-prosecutors-assault-shooting-minneapolis-charges-d713836a06471af9f38ee6ee8976a20c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d3f9c86/2147483647/strip/true/crop/8261x5505+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Ff1%2F62e0fda7abda84475e301fc5a317%2Fd22523d053694d60b87218827e882500"
    },
    {
      "author": "Ed White",
      "description": "More than 4,000 calls came into an Arizona sheriff's department within 24 hours after the release of videos of a masked person on Nancy Guthrie’s porch. Many will be worthless. Others could have merit. Experts say one thing’s certain: The tips can’t be ignored. Images of a mysterious person have been the most significant clues shared with the public during Guthrie’s disappearance in the Tucson area. She is the mother of NBC “Today” co-anchor Savannah Guthrie. Roberto Villaseñor, a former Tucson police chief, says processing tips is a tremendous amount of work. The FBI says it has collected more than 13,000 tips since Feb. 1., and the sheriff's office says it's received at least 18,000.",
      "publishedAt": "2026-02-13T05:08:08Z",
      "title": "Investigators deluged with tips after public sees videos from Nancy Guthrie's porch",
      "url": "https://apnews.com/article/nancy-guthrie-kidnapping-tips-arizona-9a34c55e06f0ffd891ea4368f2b3a038",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb699eb/2147483647/strip/true/crop/3500x2332+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F02%2F345c2662ada454054e67cbba7cbb%2Fd5aa0c1bdc3f49aa9f131636a617c791"
    },
    {
      "author": "Ken Sweet",
      "description": "Goldman Sachs’ top lawyer Kathy Ruemmler is resigning after emails revealed she had a close relationship with Jeffrey Epstein. She described Epstein as “another older brother” and downplayed his sex crimes. Ruemmler had previously tried to distance herself from these emails. In a statement before her resignation, a Goldman Sachs spokesperson said Ruemmler “regrets ever knowing him.” Before joining Goldman in 2020, Ruemmler was White House counsel for President Barack Obama. During her private practice, she received expensive gifts from Epstein. Despite CEO David Solomon’s support in December, the controversy led to her resignation.",
      "publishedAt": "2026-02-13T02:01:40Z",
      "title": "Goldman Sachs' top lawyer to resign after release of Epstein emails",
      "url": "https://apnews.com/article/kathy-ruemmler-resigns-goldman-sachs-epstein-3ba7b9e87cc8e38f563f91917630e484",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e6828c/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Ff4%2F4ae461c5bfe3f3e3a015076f4791%2Fb01396fca75d45ef8354397abe7eeece"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}