{
  "articles": [
    {
      "author": "SARAH EL DEEB, BASSEM MROUE and TIA GOLDENBERG",
      "description": "DAMASCUS, Syria (AP) — Syria's prime minister said Monday that most cabinet ministers are still working from offices in Damascus after rebels entered the capital over the weekend and overthrew President Bashar Assad.",
      "publishedAt": "2024-12-09T08:06:03Z",
      "title": "Syrian prime minister says government is still functioning but foreign and domestic challenges loom",
      "url": "https://apnews.com/a8ecceee72a66f4d7e6168d6a21b8dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4f4ba3c985b4f8cbafcaf51b0f06b56/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli strikes killed at least six people in the central Gaza Strip, Palestinian medical officials said Monday, while also hitting suspected chemical and long-range weapons sites in Syria to keep them from rebels who seized Damascus.",
      "publishedAt": "2024-12-09T07:40:02Z",
      "title": "Middle East latest: Israeli strikes hit Gaza and also target suspected weapons sites in Syria",
      "url": "https://apnews.com/0a5c8edb3a7dc438f8407f44a0fd7154",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8568f19745e41d08db5f6e57c04bce0/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and ABDULRAHMAN SHAHEEN",
      "description": "DAMASCUS, Syria (AP) — Bashar Barhoum woke in his dungeon prison cell in Damascus at dawn Sunday, thinking it would be the last day of his life.",
      "publishedAt": "2024-12-09T05:11:22Z",
      "title": "Syrian rebels free prisoners from Assad's notorious dungeons who celebrate in Damascus streets",
      "url": "https://apnews.com/982edfde78e852431d94f3f1a51b26ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20a28e0625dc4af993dbaf53a9907b66/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s Justice Ministry on Monday imposed an overseas travel ban on President Yoon Suk Yeol as authorities investigate allegations of rebellion and other charges in connection with his short-lived declaration of martial law last week.",
      "publishedAt": "2024-12-09T02:07:09Z",
      "title": "South Korea's Justice Ministry imposes a travel ban on President Yoon over martial law",
      "url": "https://apnews.com/a196573506375f39d5645843bcf87828",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e29c1b3d69124b218f18db8f4b2369f5/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — In the history of American politics, there's no shortage of presidents who promised to shake up Washington once they got to the White House. But Donald Trump may prove to be in a class of his own, and he appears more interested in beating the federal government into submission than recalibrating it.",
      "publishedAt": "2024-12-09T05:08:46Z",
      "title": "In promising to shake up Washington, Trump is in a class of his own",
      "url": "https://apnews.com/c821974493749226e1f3dd633914a02f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15ab5377a0eb49c3a75ff311e32160ae/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said Monday that he's open to the potential deployment of Western troops in Ukraine to guarantee the country’s security as part of a broad effort to end the almost three-year war with Russia.",
      "publishedAt": "2024-12-09T13:47:09Z",
      "title": "Zelenskyy open to Western troops providing security for end to war in Ukraine",
      "url": "https://apnews.com/9bf883670879e2a398fe1a7ebfb71ddb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7466f0e5a7e340ffbb83e72d91fdab40/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A Marine veteran who used a chokehold on an agitated subway rider was acquitted on Monday in a death that became a prism for differing views about public safety, valor and vigilantism.",
      "publishedAt": "2024-12-09T05:02:32Z",
      "title": "Veteran Daniel Penny is acquitted in NYC subway chokehold case over Jordan Neely's death",
      "url": "https://apnews.com/305a4eb324f6466a67bdb6734a7b999a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/017cfaabb1f24bfb844cbdee015085ab/2692.jpeg"
    },
    {
      "author": "CEDAR ATTANASIO and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Police dogs and divers returned Monday to New York’s Central Park as the dragnet for UnitedHealthcare CEO Brian Thompson’s killer stretched into a sixth day.",
      "publishedAt": "2024-12-09T16:33:47Z",
      "title": "Police divers and dogs return to Central Park as search for UnitedHeathcare CEO's killer wears on",
      "url": "https://apnews.com/eaee0b7d31b319f42e0cf7f2f7badfb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d62a2089f30d454ba16c89342adf3fed/2548.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "Jacques Audiard’s audacious musical “Emilia Pérez,” about a Mexican drug lord who undergoes gender affirming surgery to become a woman, led nominations to the 82nd Golden Globes on Monday, scoring 10 nods to lead it over other contenders like the musical smash “Wicked,” the papal thriller “Conclave” and the postwar epic “The Brutalist.”",
      "publishedAt": "2024-12-09T05:07:42Z",
      "title": "'Emilia Pérez' leads Golden Globe nominations with 10, followed by 'The Brutalist' and 'Conclave'",
      "url": "https://apnews.com/84e022069bd2083252c08918242cf7f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27153dabec4549e3bb8b2340d1364380/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu is set to take to the witness stand Tuesday for the first time in his trial on corruption allegations, a pivotal point in the drawn-out proceedings that comes as the leader wages war in Gaza and faces an international arrest warrant for war crimes charges.",
      "publishedAt": "2024-12-09T06:53:49Z",
      "title": "Netanyahu is set to take the witness stand for the first time in his corruption trial in Israel",
      "url": "https://apnews.com/a84a5a2743d111bb13982be3a4a1ea7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a99377852cf44f3ca90fa3e1b7ce5009/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}