{
  "articles": [
    {
      "author": null,
      "description": "Israeli airstrikes have hit Yemen’s capital, Sanaa, just days after the Iran-backed rebels fired cluster munitions toward Israel. That's according to the rebel-run media office and a local television station, which reported the strikes on Sunday. The attack was the first to hit the rebel-held Sanaa since a week ago, when Israel said targeted energy infrastructure it believed was used by the rebels. Israel has not confirmed Sunday’s attack. The Houthis have launched missiles and drones toward Israel and targeted ships in the Red Sea for more than 22 months. They say they are carrying out the attacks in solidarity with the Palestinians amid the war in the Gaza Strip.",
      "publishedAt": "2025-08-24T13:25:15Z",
      "title": "Israeli airstrikes hit Yemen’s capital targeting Iran-backed Houthis, rebels and residents say",
      "url": "https://apnews.com/article/israel-gaza-yemen-houthi-rebels-fe4e0406f2b04cd3a07fd0b41771a5bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/a578b2c/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F25%2Fefb2f41d68b521779b2bab14b9b9%2Ffd3785d305264357b5770c17dedaae99"
    },
    {
      "author": null,
      "description": "Palestinians reported more deadly incidents near aid sites and in areas Israel plans to invade as it seeks control of Gaza’s largest city. Israeli forces on Sunday killed four aid seekers in a military zone where convoys have been overwhelmed by looters and desperate crowds traveling to an aid distribution point. Hospital officials and eyewitness reported the deaths in the Netzarim corridor as Palestinians in northern Gaza braces for a new Israeli offensive. Gaza City is the largest city in the besieged strip and where hundreds of thousands of displaced people are sheltering. Israel has invaded multiple times and believes a network of tunnels used by militants lie beneath the city.",
      "publishedAt": "2025-08-24T09:51:34Z",
      "title": "Israeli forces kill 4 more aid seekers as northern Gaza braces for looming offensive",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-08-24-2025-616dcac7f06b94119e692094d9515f16",
      "urlToImage": "https://dims.apnews.com/dims4/default/2df5f64/2147483647/strip/true/crop/5189x2919+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2F21%2F939d4603b40d2614570c8c8e855d%2F8e964e52c52442a8bd6791dc3a286e36"
    },
    {
      "author": null,
      "description": "Russia has accused Ukraine of drone strikes that sparked a fire at a nuclear power plant in the Kursk region Sunday as Ukraine marked its Independence Day. The fire was quickly extinguished with no injuries, though a transformer was damaged. Radiation levels remained normal. The U.N. nuclear watchdog called for protecting all nuclear facilities. Russia claimed to have shot down 95 Ukrainian drones overnight, while Ukraine intercepted 48 of 72 Russian drones. President Zelenskyy addressed the nation from Independence Square, calling for “just peace.” U.S. special envoy Keith Kellogg and Canada’s prime minister visited Kyiv, while Norway pledged $695 million in air defense systems, including Patriot missiles.",
      "publishedAt": "2025-08-24T09:17:53Z",
      "title": "Russia says Ukraine has struck a nuclear power plant in the Kursk region",
      "url": "https://apnews.com/article/russia-ukraine-war-independence-nuclear-164e25c537bf1054bbd426764b6e3bd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f1a0b1/2147483647/strip/true/crop/8563x4817+0+472/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F29%2F59ab765dbdd1c67670bccd0cca19%2F218a636b86d4467f978b5908defe36d3"
    },
    {
      "author": null,
      "description": "Pricey prescriptions and nagging medical costs are swamping some insurers and employers, which means patients may start paying more next year. Health insurance will grow more expensive in many corners of the market in 2026, and some coverage may shrink. That could leave patients exposed to more costs for doctor visits and prescription coverage changes. Price changes could be especially stark in individual coverage marketplaces, where insurers also are predicting the end of some government support that helps people buy coverage. Expensive gene therapies and diabetes and obesity treatments are pressuring prescription coverage.",
      "publishedAt": "2025-08-25T05:00:08Z",
      "title": "Expect health insurance prices to rise next year, brokers and experts say",
      "url": "https://apnews.com/article/health-insurance-drug-costs-2026-rates-c4d865ec09c7088ecc6b55dc520f3566",
      "urlToImage": "https://dims.apnews.com/dims4/default/3fdd661/2147483647/strip/true/crop/5242x2949+0+273/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F4a%2Fb5b35641daba538343869cf1623c%2Ffda3c5eda5444ebb9db72bf9d10c38f8"
    },
    {
      "author": null,
      "description": "A posthumous memoir by prominent Jeffrey Epstein accuser Virginia Roberts Giuffre is set for release on Oct. 21. Titled “Nobody's Girl: A Memoir of Surviving Abuse and Fighting for Justice,” the book was completed before Giuffre died by suicide in April. Publisher Alfred A. Knopf described it Sunday as an unsparing account of her experiences with Epstein, Ghislaine Maxwell, and others, including Britain's Prince Andrew. Giuffre had long alleged she was part of Epstein's sex-trafficking ring. The memoir aims to highlight systemic failures in addressing trafficking and seeks to foster discussions about these injustices. It's co-written by author-journalist Amy Wallace.",
      "publishedAt": "2025-08-24T17:27:07Z",
      "title": "Epstein accuser Virginia Giuffre's memoir will be published",
      "url": "https://apnews.com/article/virginia-giuffre-memoir-jeffrey-epstein-11a44440f4d0e50c8d6f3741640540d2",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3523a1/2147483647/strip/true/crop/3000x1688+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2Fc2%2Fcd1bcc38f489c84b692070574aa8%2F827ffcab645f4682afbac70dc83e9590"
    },
    {
      "author": null,
      "description": "Kilmar Abrego Garcia faces deportation to Uganda after checking in with immigration officials on Monday in Baltimore. The Trump administration requires this as part of an effort to deport the El Salvador national, who was released from jail in Tennessee last week. Immigration officials plan to deport him to Uganda, which has agreed to accept certain deportees from the United States. Abrego Garcia declined a plea deal to be removed to Costa Rica. His case has become a flashpoint in President Donald Trump’s immigration agenda after he was mistakenly deported to El Salvador in March. He has pleaded not guilty to human smuggling charges.",
      "publishedAt": "2025-08-25T04:04:55Z",
      "title": "Back home in Maryland, Kilmar Abrego Garcia faces deportation again as he reports to ICE office",
      "url": "https://apnews.com/article/abrego-garcia-deportation-uganda-el-savador-ce9c34d628536c4afa483466d37a2240",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc384a1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2Fdb%2F8d42db247ebfd59aea6b82a8837b%2Fe1ab28d891eb42fd9664a21472832478"
    },
    {
      "author": null,
      "description": "Actor Jerry Adler has died at 96. Adler started his career behind the scenes in theater and worked on more than 50 Broadway productions. He later transitioned to acting in his 60s, gaining fame for roles on “The Sopranos” and “The Good Wife.” A New York funeral home confirmed he died Saturday. Adler's acting career spanned more than 30 years, with appearances in shows like “Rescue Me” and “Mad About You.” He also returned to Broadway, onstage this time. He hailed from an entertainment family. His father worked in the theater industry and his cousin was famed acting teacher Stella Adler.",
      "publishedAt": "2025-08-24T13:08:11Z",
      "title": "Jerry Adler, 'Sopranos' actor, dies at 96",
      "url": "https://apnews.com/article/jerry-adler-dies-sopranos-actor-465526928932a9e992350004ca60ff3c",
      "urlToImage": "https://dims.apnews.com/dims4/default/a81f655/2147483647/strip/true/crop/2000x1125+0+152/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F4f%2F4996e8ceca42a508f2d3855d3f40%2Ffd6497181bcf4bd8880f06dd7abb989d"
    },
    {
      "author": null,
      "description": "President Donald Trump is threatening to deploy military forces to more Democratic-led cities. On Sunday, the president added Baltimore to a list that already includes Chicago and New York. This move comes in a dispute with Maryland's Democratic governor, Wes Moore, who has criticized Trump's use of federal power to combat crime and homelessness. Trump mentioned Moore in a Truth Social post, suggesting he might repeat a National Guard deployment similar to one earlier this year in Los Angeles. Moore had invited Trump to Maryland to discuss public safety. Illinois Governor JB Pritzker has criticized Trump's actions, calling them a manufactured crisis.",
      "publishedAt": "2025-08-24T18:19:16Z",
      "title": "Trump says he might also send troops to police Baltimore",
      "url": "https://apnews.com/article/trump-wes-moore-baltimore-sharpton-national-guard-6cdfd82a1a0dc14e85518c750e8bcc48",
      "urlToImage": "https://dims.apnews.com/dims4/default/647c730/2147483647/strip/true/crop/5526x3108+0+288/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F64%2F4da564b51c5f2302034694253dbe%2Fca6d505554c54bc4a79b86d5ed5db16b"
    },
    {
      "author": null,
      "description": "Immigration and Customs Enforcement, or ICE, is key in President Donald Trump's plan for mass deportations. Deportation officers in the Enforcement and Removal Operations unit handle immigration enforcement. They find and remove non-citizens who can't stay in the U.S. for various reasons. ICE also manages detention facilities for those suspected of immigration violations. The agency is rapidly hiring, with Congress approving $76.5 billion to speed up deportations. ICE plans to hire 10,000 more deportation officers by the end of the year. New recruits are trained at the Federal Law Enforcement Training Center in Georgia.",
      "publishedAt": "2025-08-24T11:43:39Z",
      "title": "What to know: Four ways ICE is training new agents and scaling up",
      "url": "https://apnews.com/article/border-immigration-mass-deportation-ice-trump-2bb1cfbafea8c65d167c0c44ca5d7b43",
      "urlToImage": "https://dims.apnews.com/dims4/default/049cec8/2147483647/strip/true/crop/5000x2813+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F90%2F3f83595ca610ae36e8149e27b267%2F9657ceed9b5041019388433ea578a4f2"
    },
    {
      "author": null,
      "description": "Wildfires in California wine country and central Oregon are expanding, prompting hundreds of evacuations. Hundreds of firefighters backed by helicopters were working Sunday to try to contain the blazes amid dry, hot weather. Calfire says the Pickett Fire in Napa County had grown to more than 10 square miles and was 11% contained as of early Sunday. In Oregon, the state Fire Marshal’s Office says the Flat Fire has grown to almost 34 square miles with no containment. Fire officials say that fire is threatening nearly 4,000 homes and about 10,000 people there are under some sort of evacuation notice.",
      "publishedAt": "2025-08-24T18:22:21Z",
      "title": "Wildfires in California, Oregon force hundreds to evacuate",
      "url": "https://apnews.com/article/wildfire-oregon-california-evacuations-9f109bcd8e7ab61b08f8c67b93dfb1ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/257d5dc/2147483647/strip/true/crop/6048x3402+0+315/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Ff8%2F27fa927cbc69b28a293f9369e704%2Fa557006638574437ab7836f530906758"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}