{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, PHILIP MARCELO and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Hope Hicks, a former adviser to Donald Trump, took the stand Friday at the former president's hush money trial and recounted how his 2016 campaign became embroiled in a political firestorm over a recording in which he boasted about grabbing women without their permission.",
      "publishedAt": "2024-05-03T04:05:51Z",
      "title": "Hope Hicks, ex-Trump adviser, recounts political firestorm in 2016 over 'Access Hollywood' tape",
      "url": "https://apnews.com/f4f26333698f3a5ed73943ff805734b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4764457189349f1af4b7c81c7ee3a5d/1920.jpeg"
    },
    {
      "author": "KAREN MATTHEWS, MICHAEL HILL, JULIE WATSON and CHRISTOPHER L. KELLER",
      "description": "NEW YORK (AP) — Police ordered pro-Palestinian protesters to abandon a tent encampment at New York University early Friday, following weeks of demonstrations and police crackdowns at college campuses nationwide that have resulted in more than 2,300 arrests.",
      "publishedAt": "2024-05-03T04:17:15Z",
      "title": "Arrests of Israel-Hamas war protesters exceed 2,300 as police clear more US campus encampments",
      "url": "https://apnews.com/df5f7cf1547a3ca8fb959b992d6ebe1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10a905b8d2a84cf2ba9389372ea258c6/1920.jpeg"
    },
    {
      "author": "PAUL WISEMAN and ANNE D'INNOCENZIO",
      "description": "WASHINGTON (AP) — The nation’s employers pulled back on their hiring in April but still added a decent 175,000 jobs in a sign that persistently high interest rates may be starting to slow the robust U.S.",
      "publishedAt": "2024-05-03T04:01:20Z",
      "title": "US employers scaled back hiring in April. How that could let the Fed cut interest rates",
      "url": "https://apnews.com/07a321981752503e5299882805ed36c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac13ee0ef1a04f05a0a229e8b7df8f5f/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "EDWARDS AIR FORCE BASE, Calif. (AP) — With the midday sun blazing, an experimental orange and white F-16 fighter jet launched with a familiar roar that is a hallmark of U.S. airpower. But the aerial combat that followed was unlike any other: This F-16 was controlled by artificial intelligence, not a human pilot.",
      "publishedAt": "2024-05-03T16:01:41Z",
      "title": "An AI-controlled fighter jet took the Air Force leader for a historic ride. What that means for war",
      "url": "https://apnews.com/6a1100c96a73ca9b7f41cbd6a2753fda",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8c118ca402f4f8aaf4beed0bc4d80bd/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and LEKAN OYEKANMI",
      "description": "HOUSTON (AP) — Officials in Southeast Texas, including the Houston area, on Friday urged residents to prepare for worsening flooding after days of heavy rains that have led to high-water rescues and mandatory evacuation orders.",
      "publishedAt": "2024-05-03T13:22:18Z",
      "title": "Heavy rains over Texas have led to water rescues, school cancellations and orders to evacuate",
      "url": "https://apnews.com/4ca8d5d9fbcc66c622114affac7b840e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5aaa9eade7a4bd4928c4d68310f0525/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Democratic U.S. Rep. Henry Cuellar of Texas denied any wrongdoing amid reports of pending indictments related to the former Soviet republic of Azerbaijan.The longtime congressman released a statement Friday saying he and his wife “are innocent of these allegations.”",
      "publishedAt": "2024-05-03T16:01:02Z",
      "title": "US Rep. Henry Cuellar of Texas denies wrongdoing amid reports of pending indictment",
      "url": "https://apnews.com/ddb1dea393ba88d8d823557ec6c0d93a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d45164c3c1243c8bf09be5526c19263/3000.jpeg"
    },
    {
      "author": "ANITA SNOW and MORGAN LEE",
      "description": "PHOENIX (AP) — Arizona Gov. Katie Hobbs' signing of the repeal of a Civil War-era ban on nearly all abortions was a stirring occasion for the women working to ensure that the 19th century law remains in the past.",
      "publishedAt": "2024-05-03T05:20:16Z",
      "title": "Arizona governor's signing of abortion law repeal follows political fight by women lawmakers",
      "url": "https://apnews.com/d617843b7616c5c7f8a55424fd52dfa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/182530b1c99041bcbfda46658b7ad2e6/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — He's visiting Manhattan construction sites, decrying local crime and holding court in his gilded Fifth Avenue penthouse.After a years-long breakup with his hometown, Donald Trump is back in New York, this time as a criminal defendant.",
      "publishedAt": "2024-05-03T04:03:01Z",
      "title": "New York made Donald Trump and could convict him. But for now, he's using it to campaign",
      "url": "https://apnews.com/56fd4f4bb7562772c701a2acab76e9fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f07aa639ea34c95a840198cd2ac6fcf/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN and ALANNA DURKIN RICHER",
      "description": "A former government employee has been charged with repeatedly submitting fake tips to the FBI reporting that several of his co-workers in the intelligence community were part of a mob that attacked the U.S.",
      "publishedAt": "2024-05-03T15:42:14Z",
      "title": "Ex-government employee charged with falsely accusing co-workers of joining Capitol riot",
      "url": "https://apnews.com/1c9a1c474e40a437d911b61551571b28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38a0802c4b4b4e89b0d93d7180cf9794/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOUISVILLE, Ky. (AP) — If Larry Demeritte is looking for a positive sign heading into his first Kentucky Derby as a trainer, it's right where his horse is assigned.",
      "publishedAt": "2024-05-03T10:00:39Z",
      "title": "Larry Demeritte is just the second Black trainer since 1951 to saddle a horse for the Kentucky Derby",
      "url": "https://apnews.com/bd2a9efde0b70f4236e263093fa80452",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96931f043f2a4263b2320fef692c24a7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}