{
  "articles": [
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — The 2024 presidential contest speeds into its final weekend with Democrat Kamala Harris and Republican Donald Trump locked in a razor-thin contest.",
      "publishedAt": "2024-11-02T04:02:18Z",
      "title": "What to watch over the final weekend of the 2024 presidential campaign",
      "url": "https://apnews.com/d2a5d8bac1988f0c23d9ea533e51c57a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39600047dc46449d9f6a5772494caba8/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER and AAMER MADHANI",
      "description": "MILWAUKEE (AP) — Vice President Kamala Harris and former President Donald Trump hosted rallies within 7 miles of each other Friday night in the Milwaukee area as part of a fevered final push for votes in swing-state Wisconsin's largest county.",
      "publishedAt": "2024-11-01T10:39:09Z",
      "title": "Trump and Harris host dueling rallies in the Milwaukee area in a final push to win Wisconsin",
      "url": "https://apnews.com/625bec7c053c449f8ebbd87fc120cf48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41cb7cbde2e6498980d6a2328a96eef3/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump has spent months laying the groundwork to challenge the results of the 2024 election if he loses — just as he did four years ago.",
      "publishedAt": "2024-11-02T04:03:08Z",
      "title": "Trump is using election lies to lay the groundwork for challenging 2024 results if he loses",
      "url": "https://apnews.com/52832138394282b8a3355b45c0b913a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01897aa06cf0434ea695e942cece638b/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's supreme leader on Saturday threatened Israel and the U.S. with “a crushing response” over attacks on Iran and its allies.Ayatollah Ali Khamenei spoke as Iranian officials are increasingly threatening to launch yet another strike against Israel after its Oct.",
      "publishedAt": "2024-11-02T08:48:28Z",
      "title": "Iran's supreme leader threatens Israel and US with 'a crushing response' over Israeli attack",
      "url": "https://apnews.com/30385c3a17d1fca9415eb37db86dc9c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/495329dae95c4b25b7003509fe0b3d3e/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB, JULIA FRANKEL and BASSEM MROUE",
      "description": "BEIRUT (AP) — Perched on a hilltop a short walk from the Israeli border, the tiny southern Lebanese village of Ramyah has almost been wiped off the map.",
      "publishedAt": "2024-11-02T06:26:49Z",
      "title": "Israel's path of destruction in southern Lebanon raises fears of an attempt to create a buffer zone",
      "url": "https://apnews.com/478f6970b049b3be52cc56c8e14b84e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a046ae2551924c318b7e08ba56193d59/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON and TERESA MEDRANO",
      "description": "CHIVA, Spain. (AP) — Mud cakes her boots, splatters her leggings and the gloves holding her broom. Brown specks freckle her cheeks.The mire covering Alicia Montero is the signature uniform of the impromptu army of volunteers who, for a third day Friday, shoveled and swept out the muck and debris that filled the small town of Chiva in Valencia after flash floods swept through the region.",
      "publishedAt": "2024-11-01T09:33:35Z",
      "title": "Mud-caked volunteers clean flood debris in a Spanish town as authorities struggle to respond",
      "url": "https://apnews.com/c49df08e233b3f791ed27921acdbb752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b889f44f85b4560bb5c5bf8473056e6/1920.jpeg"
    },
    {
      "author": "JEFF AMY and NICHOLAS RICCARDI",
      "description": "STONE MOUNTAIN, Ga. (AP) — Flags telling people to “Vote Here” fluttered in not only English, but Spanish, Korean, Vietnamese and Chinese at the Mountain Park Activity Building as a steady stream passed through its doors to cast their ballots in the 2024 election.",
      "publishedAt": "2024-11-01T18:20:11Z",
      "title": "Early voting reaches such heights that some Georgia polls may be Election Day 'ghost town'",
      "url": "https://apnews.com/baa0233478faf75c573f9bbe5b79007d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/790e57f6b3854f95b9131ed7e770c5bc/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALI SWENSON",
      "description": "WASHINGTON (AP) — A video purporting to depict voter fraud in Georgia is fake and the work of “Russian influence actors,\" U.S.",
      "publishedAt": "2024-11-01T17:41:30Z",
      "title": "FBI links video falsely depicting voter fraud in Georgia to 'Russian influence actors'",
      "url": "https://apnews.com/eebea4ab200682ccd3e97fb9f164e6ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec3fa762f2874028a15d2f97c9e434ac/3000.jpeg"
    },
    {
      "author": "DYLAN LOVAN",
      "description": "LOUISVILLE, Ky. (AP) — A federal jury on Friday convicted a former Kentucky police detective of using excessive force on Breonna Taylor during a botched 2020 drug raid that left her dead.The 12-member jury returned the late-night verdict after clearing Brett Hankison earlier in the evening on a charge that he used excessive force on Taylor's neighbors.",
      "publishedAt": "2024-11-01T23:33:07Z",
      "title": "Jury convicts former Kentucky officer of using excessive force on Breonna Taylor during deadly raid",
      "url": "https://apnews.com/3eccaf41592f8172e66e3557556a89be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3af64ac4ebe4f278ca10906c3932e32/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "COLUMBIA, S.C. (AP) — South Carolina put Richard Moore to death by lethal injection Friday for the 1999 fatal shooting of a convenience store clerk, despite a broad appeal for mercy by parties that included three jurors and the judge from his trial, a former prison director, pastors and members of his family.",
      "publishedAt": "2024-11-01T05:06:07Z",
      "title": "South Carolina executes Richard Moore despite broadly supported plea to cut sentence to life",
      "url": "https://apnews.com/e3e74f9309ec23eab220d93b7b0dfc29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4452631c70b24dce9834896c233cdb76/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}