{
  "articles": [
    {
      "author": "HALELUYA HADERO",
      "description": "A federal appeals court panel on Friday unanimously upheld a law that could lead to a ban on TikTok as soon as next month, handing a resounding defeat to the popular social media platform as it fights for its survival in the U.S.",
      "publishedAt": "2024-12-06T15:35:41Z",
      "title": "Federal appeals court upholds law requiring sale or ban of TikTok in the US",
      "url": "https://apnews.com/6bfd505295ad44126df0544fc083d6a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63068171209947e9b2a96af8438c9fbd/3000.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — The gunman who killed the CEO of the largest U.S. health insurer likely left New York City on a bus soon after the brazen ambush that has shaken corporate America, police officials said Friday.",
      "publishedAt": "2024-12-06T06:03:25Z",
      "title": "Police find bag carried by gunman who killed UnitedHealthcare's CEO, say he likely fled NYC on bus",
      "url": "https://apnews.com/48590215ba756741bbaadeeb6255d135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e60efc9a7fce40a9bbd7b7e99a152487/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and JILL COLVIN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump on Friday offered a public show of support for Pete Hegseth, his embattled choice to lead the Defense Department, whose confirmation by the Senate is in doubt as he faces questions over allegations of excessive drinking, sexual assault and his views on women in combat.",
      "publishedAt": "2024-12-06T14:53:52Z",
      "title": "Trump offers a public show of support for Hegseth and says he believes he can be confirmed",
      "url": "https://apnews.com/74d056e44c3cd14a1a9ae97704cda53e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ae84ee109fb454d96c3700ed4e290ef/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "MANAMA, Bahrain (AP) — Iran is poised to “quite dramatically” increase its stockpile of near weapons-grade uranium as it has started cascades of advanced centrifuges, the head of the International Atomic Energy Agency warned Friday.",
      "publishedAt": "2024-12-06T06:18:32Z",
      "title": "IAEA chief: Iran is poised to 'quite dramatically' increase stockpile of near weapons-grade uranium",
      "url": "https://apnews.com/26b332d54d39173db8524b006848b6c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/052a2503a8914e59abdc4e623e3ae93b/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN and ANNE D'INNOCENZIO",
      "description": "WASHINGTON (AP) — America’s job market rebounded in November, adding 227,000 workers in a solid recovery from the previous month, when the effects of strikes and hurricanes had sharply diminished employers’ payrolls.",
      "publishedAt": "2024-12-06T05:01:18Z",
      "title": "US added a strong 227,000 jobs in November in bounce-back from October slowdown",
      "url": "https://apnews.com/bb2c2cf596ffe8b080c45e98cdaeebc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88db3d85c0124869ba9e167658b9bb0a/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The picture of who will be in charge of executing President-elect Donald Trump's hard-line immigration and border policies has come into sharper focus after he announced his picks to head Customs and Border Protection and also the agency tasked with deporting immigrants in the country illegally.",
      "publishedAt": "2024-12-06T19:54:58Z",
      "title": "Trump taps forceful ally of hard-line immigration policies to head Customs and Border Protection",
      "url": "https://apnews.com/014036c30fe30e892915b49614df54f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc54bffcc1074ef6aaca6ac79be4c0c5/3000.jpeg"
    },
    {
      "author": "STEPHEN McGRATH",
      "description": "BUCHAREST, Romania (AP) — A top Romanian court on Friday annulled the first round of the country's presidential election, days after allegations emerged that Russia ran a coordinated online campaign to promote the far-right outsider who won the first round.",
      "publishedAt": "2024-12-06T13:19:49Z",
      "title": "Romania's top court annuls first round of presidential vote won by far-right candidate",
      "url": "https://apnews.com/585e8f8f3ce7013951f5c7cf4054179b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fa46a0bd3ba4fff8b603f3255860a6f/1920.jpeg"
    },
    {
      "author": "MARK SCOLFORO",
      "description": "The remains of a woman who fell into a sinkhole were recovered Friday, four days after she went missing while searching for her cat, a state police spokesperson said.Trooper Steve Limani said the body of 64-year-old Elizabeth Pollard was sent to the Westmoreland County Coroner’s Office for an autopsy after rescuers used machinery to bring her to the surface.",
      "publishedAt": "2024-12-06T17:39:06Z",
      "title": "Crews recover the body of a woman from a Pennsylvania sinkhole after a 4-day search",
      "url": "https://apnews.com/000140dd3659d51fba37604368968ec4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1f9bdbf9138467eb3b838c8b0bf4953/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — The judge overseeing the trial of a man accused of using a deadly chokehold on an unruly New York subway passenger dismissed the top charge in the case on Friday at prosecutors' request, allowing jurors to consider a lesser count after they deadlocked on whether Daniel Penny was guilty of manslaughter.",
      "publishedAt": "2024-12-06T16:31:13Z",
      "title": "Jury will consider lesser charge in NYC subway chokehold case, judge dismisses manslaughter charge",
      "url": "https://apnews.com/e7db3b52395aa61a80adbac5cf8ea9b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fb92ed430194d099640dd656a454b33/1629.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and GARY ROBERTSON",
      "description": "FAIRVIEW, N.C. (AP) — Vice President-elect JD Vance on Friday assured residents of western North Carolina still cleaning up from Hurricane Helene that they haven't been forgotten as he surveyed storm wreckage and talked to first responders in one of his first public appearances since the election.",
      "publishedAt": "2024-12-06T18:55:58Z",
      "title": "Vance tells residents in hurricane-stricken North Carolina that they haven't been forgotten",
      "url": "https://apnews.com/abe6421cc4bdf48c61348782df21a251",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db01f4c1ab974fbdab652955cc8acf54/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}