{
  "articles": [
    {
      "author": "BASSAM HATOUM, MELANIE LIDMAN and BASSEM MROUE",
      "description": "MARJAYOUN, Lebanon (AP) — Israeli strikes Monday on Lebanon killed more than 490 people, including more than 90 women and children, Lebanese authorities said, in the deadliest barrage since the 2006 Israel-Hezbollah war.",
      "publishedAt": "2024-09-23T06:21:29Z",
      "title": "Lebanon sees deadliest day of conflict since 2006 as Israeli strikes kill 492",
      "url": "https://apnews.com/e3ca9c83642056f962fdf76319e3b8de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aaff883c4e574d608dcdad8f0c47bf96/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel is bombing targets across many parts of Lebanon, striking senior militants in Beirut and apparently hiding bombs in pagers and walkie-talkies.",
      "publishedAt": "2024-09-23T14:30:28Z",
      "title": "Is this war? The Israeli-Hezbollah conflict is hard to define — or predict",
      "url": "https://apnews.com/57eb5ef4a77f3bcc0d2b920bc4536706",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1abdde1d82994d79b46ed1667e3d71e9/3000.jpeg"
    },
    {
      "author": "FADI TAWIL and MOHAMMAD ZAATARI",
      "description": "BEIRUT (AP) — Thousands of families from southern Lebanon packed cars and minivans with suitcases, mattresses, blankets and carpets and jammed the highway heading north toward Beirut on Monday to flee the deadliest Israeli bombardment since 2006.",
      "publishedAt": "2024-09-23T18:57:57Z",
      "title": "Thousands flee southern Lebanon in search of safety and shelter",
      "url": "https://apnews.com/3fa69d5575ed7167d65e9a58ef770e24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19ee54f6b6284d90827b7253ecf03132/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "BOULDER, Colo. (AP) — A mentally ill man who killed 10 people at a Colorado supermarket in 2021 was sentenced Monday to life in prison for murder after a jury rejected his attempt to avoid prison time by pleading not guilty by reason of insanity.",
      "publishedAt": "2024-09-23T19:40:06Z",
      "title": "Gunman who killed 10 at a Colorado supermarket is sentenced to life in prison",
      "url": "https://apnews.com/71d0750ba3b096dcbe51b390eee5d7db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/774f58193f644f2db4b8dc7bdf7e9ec0/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and WILL WEISSERT",
      "description": "SMITHTON, Pa. (AP) — Donald Trump sat in a large barn in rural Pennsylvania on Monday, asking questions of farmers and offering jokes, but, in a rarity for his campaign events, mostly listening.",
      "publishedAt": "2024-09-23T14:08:58Z",
      "title": "Trump listens during a farming event in rural Pennsylvania, then threatens John Deere with tariffs",
      "url": "https://apnews.com/dc1e402d7d829acc904a4326370ac04a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/651d6a7d4f4a4772b4d622150765d9fc/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and STEPHANY MATAT",
      "description": "WEST PALM BEACH, Fla. (AP) — The man accused in the assassination attempt of Donald Trump at a golf course in Florida left behind a note detailing his plans to kill the former president and kept in his car a handwritten list of dates and venues where Trump was to appear, the Justice Department said Monday.",
      "publishedAt": "2024-09-23T12:38:06Z",
      "title": "US to seek attempted assassination charge against man accused of staking out Trump at golf course",
      "url": "https://apnews.com/1295144a65f46059ce39b4ccd7288fbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9489a96ff37444cdb80704501330e506/1500.jpeg"
    },
    {
      "author": "NADIA LATHAN",
      "description": "AUSTIN, Texas (AP) — A federal jury in Texas on Monday rejected voter intimidation allegations against all but one of a group of former President Donald Trump supporters who surrounded a Biden-Harris campaign bus on an interstate days before the 2020 election.",
      "publishedAt": "2024-09-23T20:47:56Z",
      "title": "Texas jury clears most 'Trump Train’ drivers in civil trial over 2020 Biden-Harris bus encounter",
      "url": "https://apnews.com/018e1c725e17ab0593835468db202666",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb41d89a9ced441d917d472708ec2486/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "The co-founder of the company that owned the experimental submersible that imploded en route to the wreckage of the Titanic told a Coast Guard panel Monday he hoped the silver lining of the disaster would be that it inspires a renewed interest in exploration, including the deepest waters of the world's oceans.",
      "publishedAt": "2024-09-23T04:03:14Z",
      "title": "OceanGate co-founder says he hopes submersible tragedy yields renewed interest in exploration",
      "url": "https://apnews.com/e8b5ef4b797b86b43e8b65e721216b26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5703d8a6df874d1b944fd09960ebcd5d/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Violent crime in the U.S. dropped in 2023, according to FBI statistics that show a continued trend downward after a coronavirus pandemic-era crime spike.",
      "publishedAt": "2024-09-23T15:00:40Z",
      "title": "FBI finds violent crime declined in 2023. Here's what to know about the report",
      "url": "https://apnews.com/5bff94ec67f509740bbb53fb99576d5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66cbd6c495bc47df9eebda41de03cd2a/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.N. General Assembly adopted a “Pact for the Future” to meet the challenges of the 21st century. Now comes the hard part: uniting the world’s divided nations to move quickly to implement the agreement's 56 actions.",
      "publishedAt": "2024-09-23T04:02:32Z",
      "title": "At the UN, world leaders try to lay out a vision for the future — and actually make it happen",
      "url": "https://apnews.com/351c195ef839d505d875e6ab862d58b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f65fc97782254b4199900ddc80650fc9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}