{
  "articles": [
    {
      "author": "KIM TONG-HYUNG, HYUNG-JIN KIM and ELISE MORTON",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un is on his way home Sunday from Russia, ending a six-day trip that triggered global concerns about weapons transfer deals between the two countries locked in separate standoffs with the West.",
      "publishedAt": "2023-09-17T01:26:16Z",
      "title": "North Korean leader Kim Jong Un on his way home after concluding a trip to Russia's Far East",
      "url": "https://apnews.com/7f9fad83f4e56c684c11b9fffbd047e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a039d237e06945beb7690357672a1de2/3000.jpeg"
    },
    {
      "author": "HAZEM TURKIA and JACK JEFFERY",
      "description": "TRIPOLI, Libya (AP) — Zahra el-Gerbi wasn't expecting much of a response to her online fundraiser, but she felt she had to do something after four of her relatives died in the flooding that decimated the eastern Libyan city of Derna.",
      "publishedAt": "2023-09-17T05:54:23Z",
      "title": "For a divided Libya, disastrous floods have become a rallying cry for unity",
      "url": "https://apnews.com/6de10ab7bd3b3181b3477ed3fc6a4cd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd2717167f89414ebafd775f71a5a19f/3000.jpeg"
    },
    {
      "author": "ROBERT F. BUKATY and DAVID SHARP",
      "description": "BAR HARBOR, Maine (AP) — Atlantic storm Lee made landfall at near-hurricane strength Saturday, bringing destructive winds, rough surf and torrential rains to New England and Maritime Canada.",
      "publishedAt": "2023-09-17T05:27:49Z",
      "title": "Atlantic storm Lee delivers high winds and rain before forecasters call off warnings in some areas",
      "url": "https://apnews.com/b40d9806887070c318487ecd1f81ef13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/880f6cf6cbc94d409e9876e30754a17c/1920.jpeg"
    },
    {
      "author": "PAUL J. WEBER and JUAN A. LOZANO",
      "description": "AUSTIN, Texas (AP) — Newly acquitted of impeachment charges, Texas Attorney General Ken Paxton is back on the job and getting back to the usual. Promises to keep dragging the Biden administration into court.",
      "publishedAt": "2023-09-17T07:08:32Z",
      "title": "Texas AG Ken Paxton is back on job after acquittal but Republicans aren't done attacking each other",
      "url": "https://apnews.com/2b2fae98e0552b4e1da554c0752b9ddd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acdc903c1e2c496b80d93349ebdacf7e/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "DALLAS (AP) — Car shoppers are heading for a new round of sticker shock if the strike by the United Auto Workers doesn’t end soon, particularly for popular vehicles that are already in short supply.",
      "publishedAt": "2023-09-16T13:41:07Z",
      "title": "The auto workers strike will drive up car prices, but not right away — unless consumers panic",
      "url": "https://apnews.com/98905c8e0fcf633d21a1f83183f9fd49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e66cd1c35084a619783a2d6d1578194/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KRAMATORSK, Ukraine (AP) — In a basement in one of the front-line cities in Ukraine's Donetsk region, people gather three times a week in the morning for yoga to alleviate the stress caused by the constant shelling from Russian artillery.",
      "publishedAt": "2023-09-17T04:07:55Z",
      "title": "Yoga in a basement helps people in a Ukrainian front-line city cope with Russia's constant shelling",
      "url": "https://apnews.com/97d87e2fd0ed2e882b5db5ded8080fa6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e556bae95ef547329c4aaac7ac0540ff/3000.jpeg"
    },
    {
      "author": "SAM METZ and MOSA'AB EL SHAMY",
      "description": "AMIZMIZ, Morocco (AP) — With their arms around each other, three boys walked through the streets of their town at the foot of Morocco’s Atlas Mountains.It could have been a scene like millions around the world that day.",
      "publishedAt": "2023-09-17T04:05:00Z",
      "title": "AP PHOTOS: Moroccan earthquake shattered thousands of lives",
      "url": "https://apnews.com/920c39947f895cdfc3448e5431df7562",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7477d6096bbb4193b5683ec917bb0b5f/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and THOMAS BEAUMONT",
      "description": "DES MOINES, Iowa (AP) — Hoping to cut into Donald Trump's support at a major Iowa gathering of evangelical Christians, several of his top rivals on Saturday mostly avoided direct criticism of him on abortion and other issues key to social conservatives.",
      "publishedAt": "2023-09-16T16:13:02Z",
      "title": "Donald Trump's GOP rivals try to attract social conservatives in Iowa at an event he skipped",
      "url": "https://apnews.com/4fa52a5cfbb003e29d0c9a57ace0edd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d56f62fd6074f078f113ba8eb8f8bb2/3000.jpeg"
    },
    {
      "author": null,
      "description": "PALMDALE, Calif. (AP) — A Los Angeles County Sheriff's Department deputy died after he was shot in his patrol car Saturday evening by an unknown assailant and an investigation is underway that the sheriff said will press all of the department’s resources into action.",
      "publishedAt": "2023-09-17T05:08:53Z",
      "title": "Los Angeles County sheriff's deputy dies after being shot in his patrol car by an unknown assailant",
      "url": "https://apnews.com/353f2e537c78b62a98136f7bcb1df789",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f32597ed9b6f40c3bc3ad38deb516d73/1080.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — An armed man accused of impersonating a federal officer was taken into custody outside a Robert F. Kennedy Jr. campaign event in Los Angeles.A Los Angeles Police Department statement said police received a call Friday afternoon that a man with a loaded gun and holster and wearing a U.S.",
      "publishedAt": "2023-09-17T00:05:48Z",
      "title": "Armed man accused of impersonating officer detained at Kennedy campaign event in LA",
      "url": "https://apnews.com/dcd6a12a95ea4ba46df649989edecb2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c24204649766469393fb5832d052bd4b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}