{
  "articles": [
    {
      "author": "HOLLY RAMER, PATRICK WHITTLE, MARK SCOLFORO",
      "description": "A traffic stop in Vermont has cracked open a cultlike group called Zizians linked to six deaths in three states. Officials have offered few details about their cross-country investigation, but police and court records, interviews and online postings point to a small group of young computer scientists portrayed as highly intelligent and increasingly violent. Their goals aren’t clear, but online writings span topics from radical veganism and gender identity to artificial intelligence. The dead include Border Patrol Agent David Maland, two members of the group, the parents of another member and a California landlord who tried to evict some of them.",
      "publishedAt": "2025-02-15T05:03:30Z",
      "title": "A Vermont border agent’s death was the latest violence linked to the cultlike Zizian group",
      "url": "https://apnews.com/article/vermont-border-patrol-shooting-youngblut-lasota-zizians-6541ebcefc2806efd105d7db99a24aaf",
      "urlToImage": "https://dims.apnews.com/dims4/default/edfd14f/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2Fc1%2Fa48e011416b25ac3d0b11cf97f5d%2F75895b07e3cd4b8cb837536b5c48a8ac"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Here’s a look at the timeline of events in a series of killings that culminated in a Jan. 20 highways shootout that killed a Border Patrol officer in Vermont. It is based on Associated Press interviews and a review of police reports, court records and online postings.",
      "publishedAt": "2025-02-15T05:07:24Z",
      "title": "A timeline of activities of a cultlike group tied to the killing of a Border Patrol agent",
      "url": "https://apnews.com/article/vermont-border-patrol-shooting-youngblut-lasota-zizians-8d3522fae8338cabf9f890aab054c0b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/2a34ea2/2147483647/strip/true/crop/3416x1922+0+9/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2Ff9%2F30a92587f54611b8f774e72ecc0e%2F27a0457e1e07469ca05e2e473030ca97"
    },
    {
      "author": "MOHAMMAD JAHJOUH, MELANIE LIDMAN, JALAL BWAITEL",
      "description": "Hamas-led militants have released three male Israeli hostages, and Israeli forces began releasing hundreds of prisoners in return, in the latest indication that the fragile ceasefire deal that has paused fighting in the Gaza Strip but that had teetered in recent days, is holding. The three — Iair Horn, Sagui Dekel Chen and Alexander (Sasha) Troufanov — had been abducted from Kibbutz Nir Oz, a hard-hit community in the Oct. 7, 2023, attack that ignited the war. Israel is expected to release 369 Palestinian prisoners and detainees, including 36 serving life sentences over deadly attacks.",
      "publishedAt": "2025-02-15T04:47:59Z",
      "title": "Israel begins releasing Palestinian prisoners after Hamas freed 3 hostages",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-15-2025-22a2d731961eb766e6c7914cb84e3990",
      "urlToImage": "https://dims.apnews.com/dims4/default/49d4412/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F0b%2Fc1f4144e7a052c7b74dee2722cfa%2F3c696641bfe6480a9f3d969c2b2a5160"
    },
    {
      "author": "PHILIPP JENNE, SUSIE BLANN, EMMA BURROWS",
      "description": "Two top European leaders have stiffened their spines over unsettling new policies from President Donald Trump. Ukraine’s president urged creation of an “armed forces of Europe” and the leader of Germany denounced meddling in its election after U.S. Vice President JD Vance met with a German far-right leader. Strident speeches from Ukrainian President Volodymyr Zelenskyy and German Chancellor Olaf Scholz at the Munich Security Conference on Saturday testified to the impact of Trump decisions that have resonated at home and in Europe. Those include Trump's hopes to end the Russia-Ukraine war and nurture political allies.",
      "publishedAt": "2025-02-15T08:06:51Z",
      "title": "Zelenskyy says time has come for creation of 'armed forces of Europe'",
      "url": "https://apnews.com/article/germany-munich-vance-election-zelenskyy-scholz-ukraine-4e48e115b504f9e3609b3457b48f9db0",
      "urlToImage": "https://dims.apnews.com/dims4/default/4323c35/2147483647/strip/true/crop/5685x3198+0+445/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2Fff%2Feef2a55fcf25b45fd0c808315eac%2F495abdcee36b4bf091e13e3613c11e86"
    },
    {
      "author": "CLAIRE SAVAGE, ALEXANDRA OLSON",
      "description": "The federal agency that enforces workplace anti-discrimination laws has moved to dismiss its own lawsuit on behalf of a worker allegedly fired for his sexual orientation and gender identity, arguing that the case now conflicts with President Donald Trump’s recent executive order. The Equal Employment Opportunity Commission on Thursday filed a joint motion to dismiss its case against Harmony Hospitality LLC just eight months after the agency sued the company over its firing of an employee who identifies as nonbinary male and gay. The EEOC’s request marks a major departure from its prior interpretation of civil rights law after the Trump administration declared that the government would recognize only two sexes: male and female.",
      "publishedAt": "2025-02-15T11:00:08Z",
      "title": "EEOC seeks to drop a gender discrimination case, signaling a big shift in civil rights enforcement",
      "url": "https://apnews.com/article/eeoc-trump-gender-identity-discrimination-alabama-73a065c8aa5e0060472e1cac1ecd8212",
      "urlToImage": "https://dims.apnews.com/dims4/default/8074add/2147483647/strip/true/crop/4881x2746+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F3e%2F2c2aae466797134f65b6e76a1b30%2Fd144d74f0dea4e1c94289a54d3ba164d"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "The Vatican says Pope Francis slept well during a quiet first night in the hospital after being admitted with a respiratory tract infection. Francis, 88, ate breakfast Saturday morning and read the newspapers while continuing his drug therapy. Francis was admitted to Rome’s Gemelli hospital on Friday after a weeklong bout of bronchitis worsened. It was his fourth hospitalization since his 2013 election and raised questions about his increasingly precarious health.",
      "publishedAt": "2025-02-15T11:15:02Z",
      "title": "Pope spends quiet first night in hospital, continues drug therapy and reads papers, Vatican says",
      "url": "https://apnews.com/article/vatican-pope-health-bronchitis-104b60f7fc6c9a2c8a8f094d3d63dd18",
      "urlToImage": "https://dims.apnews.com/dims4/default/edb1080/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F2c%2F31672e7dde9f81ab6890fe1650f8%2F691a3fc068a440f592e2106c881e89b5"
    },
    {
      "author": "WILL WEISSERT, JOSH BOAK, LINDSAY WHITEHURST",
      "description": "It's been nearly a month in office for President Donald Trump, and he's acted with dizzying speed to reorder the American economy and global diplomacy. In the early going, he's empowered Elon Musk to help force the firing of thousands of federal employees and potentially shutter entire agencies. The new president has imposed tariffs, wiped out diversity programs and rolled back transgender rights. His administration has begun an immigration crackdown that's been overshadowed by so many other steps. At the same time, the economy is beginning to soften, judges are having their say and even some Republicans in Congress are starting to grumble.",
      "publishedAt": "2025-02-15T14:09:09Z",
      "title": "The warning signs in Trump's first month",
      "url": "https://apnews.com/article/trump-firings-tariffs-lawsuits-economy-ukraine-putin-19b79f62ad7c9d51cfb1f0551953051e",
      "urlToImage": "https://dims.apnews.com/dims4/default/df4944b/2147483647/strip/true/crop/4055x2281+0+216/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F83%2F88411ff1ab76f00bc8258914eb47%2Ff8b2326f236d4c9d862204fe58bdc267"
    },
    {
      "author": "DAVID BAUDER",
      "description": "The Trump administration blocked The Associated Press from traveling with President Trump on Air Force One and also from covering an Oval Office event. It's part of an ongoing terminology dispute over the Gulf of Mexico. The administration criticized AP's “commitment to misinformation” in not adopting Trump's name change to “Gulf of America” in all of its copy. AP says the administration is flouting the First Amendment in punishing the news outlet for not saying what it wants. AP has advised the thousands of news outlets that use its service that it would continue to use Gulf of Mexico as its style but would note Trump's change of name as well.",
      "publishedAt": "2025-02-14T23:44:36Z",
      "title": "AP journalists barred from Air Force One over style dispute",
      "url": "https://apnews.com/article/trump-ap-news-ban-air-force-one-b90b8b842d63aef9960ccffb4a657dc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e5d9d7/2147483647/strip/true/crop/6499x3656+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fb9%2F430ce8a2675d51f92a8cd5077c33%2F1ee1a620aacd4c739d350dc94b0374f0"
    },
    {
      "author": "OLGA R. RODRIGUEZ, EUGENE GARCIA",
      "description": "Much of the Eastern U.S. braced for a renewed round of harsh, soggy weather on Saturday, with thunderstorms and melting snow combining to pound the Ohio and Tennessee valleys. The lower Mississippi valley was facing the threat of strong tornadoes. Kentucky, Tennessee, West Virginia and Arkansas were under flood warnings, and residents were warned by the National Weather Service to stay off roads. Parts of western Kentucky could face up to 8 inches of rain. Heavy snow, meanwhile, was expected to blanket much of New England and then transition to sleet, making travel nearly impossible. And in northern New York, In northern New York, heavy mixed precipitation is expected throughout the weekend. Weather forecasters said residents should expect snow, sleet and ice and strong wind gusts.",
      "publishedAt": "2025-02-14T06:42:35Z",
      "title": "Eastern U.S. braces for flooding while fire-damaged California city now faces mudslides",
      "url": "https://apnews.com/article/southern-california-debris-flow-rain-wildfire-663334ac70b701eb8e761da5269dd02d",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f1216e/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F69%2F7eb684680401fb6a6f627542f195%2F52b2ae6edfb2414ea70fd72455111812"
    },
    {
      "author": "JUSTIN KABUMBA, SAM METZ, RODNEY MUHUMUZA",
      "description": "Panic and looting are sweeping through eastern Congo’s second largest city as residents fled by the thousands to escape the looming advance of Rwanda-backed rebels. It came a day after M23 fighters entered the outskirts of Bukavu. Residents on Saturday flooded the streets attempting to leave as looters filled sacks with what they could find. Reports and social media videos showed the region’s factories pillaged and prisons emptied. M23’s southward expansion encompasses more territory than rebels had previously seized and poses an unprecedented challenge to the central government in Kinshasa.",
      "publishedAt": "2025-02-15T09:55:10Z",
      "title": "Rwanda-backed rebels advance in eastern Congo as residents flee by the thousands",
      "url": "https://apnews.com/article/congo-fighting-bukavu-m23-rwanda-9092314a99030530e43ba73bd332af50",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5cd1a7/2147483647/strip/true/crop/3172x1784+426+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F1a%2F090539d26bb5f6eb00da36477f2a%2F7187e645213042a290a4083338065583"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}