{
  "articles": [
    {
      "author": null,
      "description": "TORONTO (AP) — AP source: Canada expels six Indian diplomats after police link Indian agents to violent crimes.",
      "publishedAt": "2024-10-14T16:40:27Z",
      "title": "AP source: Canada expels six Indian diplomats after police link Indian agents to violent crimes",
      "url": "https://apnews.com/12f9e9d7f15a101fd02577a1e36bdab8",
      "urlToImage": ""
    },
    {
      "author": "KAREEM CHEHAYEB, WAFAA SHURAFA and SAMY MAGDY",
      "description": "BEIRUT (AP) — An Israeli airstrike hit an apartment building in northern Lebanon on Monday, killing at least 21 people, according to the Lebanese Red Cross.There was no immediate comment from the Israeli military and it was not clear what the target was.",
      "publishedAt": "2024-10-14T06:30:26Z",
      "title": "Israeli strike in northern Lebanon kills at least 21 people",
      "url": "https://apnews.com/70c8cf5a93eec9ea643a5fda5670da93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/854203b6e9044962a792ea3925cfaee6/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu is examining a plan to seal off humanitarian aid to northern Gaza in an attempt to starve out Hamas militants, a plan that, if implemented, could trap without food or water hundreds of thousands of Palestinians unwilling or unable to leave their homes.",
      "publishedAt": "2024-10-13T13:46:33Z",
      "title": "Netanyahu mulls plan to empty northern Gaza of civilians and cut off aid to those left inside",
      "url": "https://apnews.com/219d7eb9a3050e281ccc032d5a56263c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb132e8f0d734ca19edafb5396f5ddde/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A NASA spacecraft rocketed away Monday on a quest to explore Jupiter’s tantalizing moon Europa and reveal whether its vast hidden ocean might hold the keys to life.",
      "publishedAt": "2024-10-14T16:07:28Z",
      "title": "NASA spacecraft rockets toward Jupiter's moon Europa in search of the right conditions for life",
      "url": "https://apnews.com/88d680ae8625c239370865b36d5d69a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/757b8320e0b9497e93766ae58922dc62/3000.jpeg"
    },
    {
      "author": "MARK SCOLFORO",
      "description": "HARRISBURG, Pa. (AP) — Vice President Kamala Harris and former President Donald Trump will take their fight for Pennsylvania to opposite ends of the state on Monday, with Harris speaking in the northwest corner of Erie and Trump in the southeastern suburbs of Philadelphia.",
      "publishedAt": "2024-10-14T12:01:17Z",
      "title": "Harris and Trump will both campaign in battleground Pennsylvania on Monday",
      "url": "https://apnews.com/837bf147439eabe552b56334035890bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77d9396905ca47df923fcde646ebc52a/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is announcing a plan to give Black men more economic opportunities and other chances to thrive as she works to energize a key voting bloc that has Democrats concerned about a lack of enthusiasm.",
      "publishedAt": "2024-10-14T09:01:09Z",
      "title": "Harris is laying out a new plan to empower Black men as she tries to energize them to vote for her",
      "url": "https://apnews.com/67ac83899af785cf4d8788b9fcdeb592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a70c2a9abbc547c7b9f0ae6df9ea7775/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The indictment charging Donald Trump with hoarding classified documents leveled one jaw-dropping allegation after another, including that he showed off a secret Pentagon attack plan to guests at his golf club and suggested his lawyer mislead the FBI about the presence of the White House records.",
      "publishedAt": "2024-10-14T04:12:04Z",
      "title": "This could have been a year of a federal court reckoning for Trump. Judges had other ideas",
      "url": "https://apnews.com/302f87960dbd84d7be5daedaf03328d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4f6ba2041d54d82812e8270940f33a2/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM and LAURA BARGFELD",
      "description": "TAMPA, Fla. (AP) — When ankle-deep floodwaters from Hurricane Helene bubbled up through the floors of their home, Kat Robinson-Malone and her husband sent a late-night text message to their neighbors two doors down: “Hey, we're coming.”",
      "publishedAt": "2024-10-13T04:01:54Z",
      "title": "Florida neighbors band together to recover after one-two punch from hurricanes Helene and Milton",
      "url": "https://apnews.com/a39b7a04052e9cd9d0d8598d090ea54b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbbf443d7b0d4110bf93f903717ff8dc/1920.jpeg"
    },
    {
      "author": "JOHNSON LAI and HUIZHONG WU",
      "description": "TAIPEI, Taiwan (AP) — China employed a record 125 aircraft, as well as its Liaoning aircraft carrier and ships, in large-scale military exercises surrounding Taiwan and its outlying islands Monday, simulating the sealing off of key ports in a move that underscores the tense situation in the Taiwan Strait, officials said.",
      "publishedAt": "2024-10-14T01:15:45Z",
      "title": "China deploys record 125 warplanes in large scale military drill in warning to Taiwan",
      "url": "https://apnews.com/053fbadaf1125be4adfee7a7e6d1ce79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc6fa84694a24ed282e340afe5355b00/1920.jpeg"
    },
    {
      "author": "TERRY TANG and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Asian American, Native Hawaiian and Pacific Islander adults are more likely than the overall U.S. population to view legal immigration as an asset to the country's economy and workforce, according to a new poll.",
      "publishedAt": "2024-10-14T04:20:55Z",
      "title": "Most AAPI adults think legal immigrants give the US a major economic boost: AP-NORC/AAPI Data poll",
      "url": "https://apnews.com/3ea9472f4742e15e3979c38c68c1e59c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8406929048a24831abd2e6a7f61b3ac6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}