{
  "articles": [
    {
      "author": null,
      "description": "Iranian state television says the head of Iran’s paramilitary Revolutionary Guard is feared dead after an Israeli attack. The report offered few other details about what happened to Gen. Hossein Salami of the Guard. The report on air added that one other top Guard officials, as well as two nuclear scientists were also feared dead. State television also reported the attack set the headquarters of Iran’s paramilitary Revolutionary Guard ablaze. Multiple sites in the capital had been hit in the attack, which Israeli Prime Minister Benjamin Netanyahu said targeted both nuclear and military sites and officials leading Iran’s nuclear program and its ballistic missile arsenal.",
      "publishedAt": "2025-06-13T00:13:47Z",
      "title": "Explosions heard across Iran’s capital as Israel claims it is attacking",
      "url": "https://apnews.com/article/iran-explosions-israel-tehran-00234a06e5128a8aceb406b140297299",
      "urlToImage": "https://dims.apnews.com/dims4/default/49e05ae/2147483647/strip/true/crop/5915x3327+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F40%2Fef6d174d5e49a3d63c42bbec6d25%2Ff6f2cbef8b32466e9c8eaba4049ea7ae"
    },
    {
      "author": null,
      "description": "A federal judge has issued a temporary restraining order directing President Donald Trump to return control of the National Guard to California. The order takes effect at noon Friday. It says the deployment of the Guard was illegal and both violated the Tenth Amendment and exceeded Trump’s statutory authority. The White House had no immediate comment on the ruling.",
      "publishedAt": "2025-06-12T04:01:30Z",
      "title": "Judge says Trump illegally deployed National Guard to help with LA protests, must return control",
      "url": "https://apnews.com/article/california-immigration-national-guard-newsom-trump-lawsuit-aedf8cdd95ee899c9559d5e54a2e4833",
      "urlToImage": "https://dims.apnews.com/dims4/default/6542c5b/2147483647/strip/true/crop/3976x2237+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2F0a%2Fec90cd01f755298ffff474620e73%2F6abd20de9da449ec94b19b87f35e05c7"
    },
    {
      "author": null,
      "description": "President Donald Trump’s use of troops to help carry out intensified immigration raids faces its biggest challenge yet on Thursday. That’s when a federal judge is set to weigh a request from California Gov. Gavin Newsom to put an emergency stop to the practice. Newsom has warned that the military intervention is part of a broader effort by Trump to overturn norms at the heart of the nation’s democracy. He also said that sending National Guard troops on the raids has further inflamed tensions in Los Angeles, where large and sometimes volatile protests have broken out since the crackdown began nearly a week ago. The Trump administration called the lawsuit a political stunt.",
      "publishedAt": "2025-06-12T04:44:15Z",
      "title": "Trump administration's use of troops to help with immigration raids faces test in court",
      "url": "https://apnews.com/article/los-angeles-protests-ice-national-guard-1009eac191a8f6248463a5028cbe0f68",
      "urlToImage": "https://dims.apnews.com/dims4/default/31fa0a8/2147483647/strip/true/crop/5802x3264+0+317/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F28%2F7c90482fd12aecb2cf1990fb9867%2F914041fc133045e5b16b640c05a1bcb1"
    },
    {
      "author": null,
      "description": "Authorities have begun investigating one of India’s worst aviation disasters after an Air India plane crashed a day earlier, killing all but one of the total 242 passengers and crew onboard. The Indian government has launched an investigation into the fatal crash of the London-bound Air India plane that came down in a in a residential area in the northwestern city of Ahmedabad, minutes after takeoff on Thursday. Civil Aviation Minister Ram Mohan Naidu in a statement said the Aircraft Accident Investigation Bureau has initiated the probe in line with global protocols set by the International Civil Aviation Organization. A team from the U.S. is expected in India to help with the probe.",
      "publishedAt": "2025-06-13T04:55:54Z",
      "title": "Indian authorities begin probe of Air India plane crash as Modi visits the site",
      "url": "https://apnews.com/article/air-india-plane-crash-ahmedabad-survivor-boeing-787-18a1e45cb65bd716d6529b8922cc94b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/4138789/2147483647/strip/true/crop/7048x3965+0+367/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Fa0%2F7541be4f6eb1138c26a91a1daaf8%2F5ba76ed4bea84d86ac28c1db2ed25980"
    },
    {
      "author": null,
      "description": "Texas Gov. Greg Abbott says he has ordered the deployment of more than 5,000 Texas National Guard troops across the state, along with more than 2,000 state police. Abbott said Thursday the troops and state police will help local law enforcement manage protests against President Donald Trump and ongoing federal immigration raids. Abbott's statement does not detail where the Guard troops have been sent. Some were seen at a protest Wednesday night in downtown San Antonio. More protests are planned for Saturday in cities such as Houston, Austin and Dallas as part of the national “No Kings” movement.",
      "publishedAt": "2025-06-12T16:06:07Z",
      "title": "Texas governor deploys National Guard ahead of planned 'No Kings' protests",
      "url": "https://apnews.com/article/immigration-protests-texas-national-guard-4f8ffc07788515c0d0e7ae40c7980565",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c4ede6/2147483647/strip/true/crop/5557x3126+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F6a%2F84a802c16c1ecc5feb1f5fd31439%2F4760f38e41d14294baf19f9254e4b452"
    },
    {
      "author": null,
      "description": "The House has voted to cut about $9.4 billion in spending as President Donald Trump’s administration looks to follow through on work done by the Department of Government Efficiency when it was overseen by Elon Musk. The package narrowly passed Thursday targets foreign aid programs and the Corporation for Public Broadcasting, which provides money for National Public Radio and the Public Broadcasting Service as well as thousands of public radio and television stations around the country. The vote was 214-212. Republicans are characterizing the spending as wasteful and unnecessary, but Democrats say the rescissions are hurting the United States’ standing around the world.",
      "publishedAt": "2025-06-12T10:37:27Z",
      "title": "House approves Trump's request to cut funding for NPR, PBS, foreign aid",
      "url": "https://apnews.com/article/trump-budget-cuts-npr-pbs-global-health-2844a884091dce5255a3f4ad70f3a1c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e86601/2147483647/strip/true/crop/4115x2315+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F35%2Feed60f6aa845bfce05e8478fcea1%2Fa9b8bb2bc40a4b6a91fd0d5f84e803b8"
    },
    {
      "author": null,
      "description": "Harvey Weinstein’s New York sex crimes retrial has come to a disjointed end. The jury foreperson declined to deliberate Thursday, and the judge declared a mistrial on a remaining rape charge. The case has been seen as a bellwether of the #MeToo era. On Wednesday Weinstein was convicted of one of the top charges but acquitted of another. Both concerned accusations of forcing oral sex on women in 2006. Those verdicts still stand. The ex-studio boss faces a third New York trial on the rape count and a new sentencing on his sexual assault conviction. Weinstein denies all the charges.",
      "publishedAt": "2025-06-12T04:09:04Z",
      "title": "Weinstein case judge declares mistrial on remaining rape charge",
      "url": "https://apnews.com/article/harvey-weinstein-sexual-assault-retrial-metoo-c45fa63cb6102766944dca9ee2f93878",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f05973/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2Fb4%2F797ba9ec60eda5f18ce0f1a1bebe%2Ff2f328a9882a4d5bbb7bb36c6cc37a00"
    },
    {
      "author": null,
      "description": "A lawyer for Sean “Diddy” Combs is protesting the rising tide of secrecy at the hip-hop icon's sex trafficking and racketeering conspiracy trial after Combs and the public were excluded from lengthy legal arguments. Attorney Marc Agnifilo complained to Judge Arun Subramanian after Combs was left out of an hour-long robing room meeting Thursday, delaying testimony by a key witness by nearly two hours. Agnifilo said the need for a public trial was “an important issue, a constitutional issue” and objected to so much happening out of the earshot of his client. Combs has pleaded not guilty to sex trafficking charges.",
      "publishedAt": "2025-06-12T20:21:48Z",
      "title": "Sean 'Diddy' Combs' lawyer complains about trial secrecy as a famous rapper's name goes unmentioned",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-6e3fe9e45247979532cc3ebb0805dfcb",
      "urlToImage": "https://dims.apnews.com/dims4/default/201d725/2147483647/strip/true/crop/3000x1688+0+320/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F4d%2F05f043d014ab053a93d70f7b0dd2%2F119115ab5d304c789794a1e8286147e8"
    },
    {
      "author": null,
      "description": "At least four people are dead in San Antonio after heavy rains flooded highways and stranded motorists. Fire officials said they are still searching Thursday for two people who are missing. Crews made dozens of water rescues after heavy rains flooded highways and stranded motorists. San Antonio police say calls for water rescues began shortly before sunrise. A spokesman for the fire department says it has made 65 water rescues since midnight throughout the San Antonio area. A National Weather Service meteorologist says the flooding occurred after a round of slow-moving showers and thunderstorms during the early morning hours Thursday.",
      "publishedAt": "2025-06-12T15:32:53Z",
      "title": "San Antonio floods leave 4 dead, 2 missing after heavy rain",
      "url": "https://apnews.com/article/severe-texas-san-antonio-deaths-rain-ee0e33396168265aaa328e28185fd976",
      "urlToImage": "https://dims.apnews.com/dims4/default/057f283/2147483647/strip/true/crop/3286x1848+0+171/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F2c%2F297454feac7f1589ece443f10da2%2Fdba14e78d26049da8aa30f9d4eda42d9"
    },
    {
      "author": null,
      "description": "President Donald Trump on Thursday pulled the U.S. out of an agreement with Washington, Oregon and four American Indian tribes to work together to restore salmon populations and boost tribal energy development in the Pacific Northwest, deriding the plan as “radical environmentalism” that could have resulted in the breaching of four controversial dams on the Snake River. The deal, known as the Resilient Columbia Basin Agreement, was reached in late 2023 and heralded by the Biden administration, tribes and conservationists as historic. It allowed for a pause in decades of litigation over the harm the federal government’s operation of dams in the Northwest has done to the fish.",
      "publishedAt": "2025-06-13T01:33:22Z",
      "title": "Trump pulls US out of agreement to help restore salmon in the Columbia River",
      "url": "https://apnews.com/article/columbia-river-snake-river-dams-tribes-salmon-745894c815e8951e9897b7a5a3544bfb",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}