{
  "articles": [
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Republican Mike Johnson won reelection to the House speakership on a first ballot Friday, pushing past GOP hard-right holdouts and buoyed with a nod of support from President-elect Donald Trump.",
      "publishedAt": "2025-01-03T12:03:14Z",
      "title": "Republican Mike Johnson reelected House speaker in dramatic floor vote",
      "url": "https://apnews.com/ccbe593940ef488019563e8e4b98061e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bd08c6eb8e243b19a6fe80d13631b03/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — New Senate Majority Leader John Thune is kicking off the new session with a promise to preserve the filibuster, saying in his first floor speech as leader that his priority will be to “ensure the Senate stays the Senate.”",
      "publishedAt": "2025-01-03T19:19:09Z",
      "title": "New Majority Leader Thune kicks off Senate session with pledge to preserve filibuster",
      "url": "https://apnews.com/a520b71c6f071d5aa74d38105d6b7088",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6411bf616a74e29b7d41c3e0fe1e951/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN, JOSH BOAK and MARC LEVY",
      "description": "WASHINGTON (AP) — President Joe Biden has blocked the nearly $15 billion proposed deal for Nippon Steel of Japan to purchase Pittsburgh-based U.S. Steel — affirming his earlier vow on the presidential campaign trail to prevent the acquisition of Steeltown USA’s most storied steel company.",
      "publishedAt": "2025-01-03T13:24:20Z",
      "title": "Biden blocks Nippon Steel's proposed deal to acquire US Steel",
      "url": "https://apnews.com/099564a3cddca587af0d7340e0c15ed6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1eb3e056ad74414cbdf9ad4a846d077e/3000.jpeg"
    },
    {
      "author": "TARA COPP, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "Investigators know that a highly decorated Army soldier shot himself in the head inside a Tesla Cybertruck packed with fireworks just before it exploded outside Trump International Hotel in Las Vegas on New Year's Day, but authorities say there are questions about why he chose that car and location.",
      "publishedAt": "2025-01-03T19:27:19Z",
      "title": "Questions remain about soldier's motive in Cybertruck explosion outside Trump's Las Vegas hotel",
      "url": "https://apnews.com/6c85af85255753db497f2cd344fb2ace",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09b16e6bbc0a44d39f281f1ec114b03b/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER, JIM MUSTIAN, KEVIN McGILL and JACK BROOK",
      "description": "NEW ORLEANS (AP) — Street performers and football fans returned to New Orleans streets as the city inched back toward normalcy while mourning victims of the deadly New Year's rampage in which an Army veteran plowed a pickup truck into revelers.",
      "publishedAt": "2025-01-03T05:04:03Z",
      "title": "New Orleans inches toward normalcy while mourning victims of deadly New Year’s rampage",
      "url": "https://apnews.com/88a300e2f36eaf2920ed634983d72f08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/899a7ebb44894a63a42e99f2d2f96b6f/1920.jpeg"
    },
    {
      "author": "JASON DEAREN, MICHELLE R. SMITH and AARON KESSLER",
      "description": "While much remains unknown about the man who carried out an attack in New Orleans on New Year’s and another who died in an explosion in Las Vegas the same day, the violence highlights the increased role of people with military experience in ideologically driven attacks, especially those that seek mass casualties.",
      "publishedAt": "2025-01-03T18:57:46Z",
      "title": "New Orleans attack and Vegas explosion highlight extremist violence by active military and veterans",
      "url": "https://apnews.com/a7febd9698219e91d3132a1e4bce3eb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed9135e906e142aaad8ed07c69226e8a/3000.jpeg"
    },
    {
      "author": "BY SETH BORENSTEIN",
      "description": "A strong snow and ice storm followed by brutally cold conditions will soon smack the eastern two-thirds of the United States as frigid air escapes the Arctic, plunging as far south as Florida, meteorologists forecast.",
      "publishedAt": "2025-01-03T16:24:39Z",
      "title": "A double dose of nasty winter is about to smack much of the US with snow, ice and biting cold",
      "url": "https://apnews.com/2360ffb749915100598f30f5ebcb6cf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40bcf5388b754a1ab96a60947d46d2bd/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, FATMA KHALED and SAM MEDNICK",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes killed at least 42 people in Gaza, including children, overnight and into Friday, hospital and emergency response workers said, as health workers and Israel's military traded claims over reported evacuation orders for two hospitals in the territory's largely isolated north.",
      "publishedAt": "2025-01-03T09:58:00Z",
      "title": "Israeli strikes kill at least 42 in Gaza as ceasefire talks set to resume in Qatar",
      "url": "https://apnews.com/1eb622d4d4dac17b9f10494107b9e136",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6768c41e77146d4a88e5e2a8a170c0d/1920.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — Alcohol is a leading cause of cancer, a risk that should be clearly labeled on drinks Americans consume, U.S. Surgeon General Vivek Murthy proposed on Friday.",
      "publishedAt": "2025-01-03T15:33:21Z",
      "title": "Surgeon General calls for new label on drinks to warn Americans of alcohol's cancer risk",
      "url": "https://apnews.com/e12d879108d3d6298052df0369f2e4a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0818db1b45848bd8059a6385dafa485/2957.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Apple TV+ is hoping people will make a dent in the Strategic Popcorn Reserve by bingeing its streaming TV and movies for free this weekend in what experts are calling a canny promotion.",
      "publishedAt": "2025-01-03T17:28:18Z",
      "title": "Why Apple TV+ is offering a free weekend of binge-watching",
      "url": "https://apnews.com/c7c0453713aa4a7c314550ccf9281274",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc55217045594642b3e84e8a18a077cd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}