{
  "articles": [
    {
      "author": "CLAUDIA LAUER, RANDALL CHASE, COLLEEN LONG and MICHAEL KUNZELMAN",
      "description": "WILMINGTON, Del. (AP) — Hunter Biden's ex-wife and a former girlfriend testified Wednesday in his gun trial about finding his crack pipes and other drug paraphernalia as prosecutors sought to show he still had a substance abuse problem when he filled out a form to buy a firearm.",
      "publishedAt": "2024-06-05T04:13:19Z",
      "title": "Hunter Biden's exes are called as witnesses in his federal gun trial to detail his drug use",
      "url": "https://apnews.com/17e671d16f7b06b04b4e3b538f911d07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78c4c624181141f79eb0d46705d08f24/1920.jpeg"
    },
    {
      "author": "JAMES JORDAN and HARRIET MORRIS",
      "description": "ST. PETERSBURG, Russia (AP) — Russian President Vladimir Putin said Wednesday that nothing will change in terms of Russia-U.S.",
      "publishedAt": "2024-06-05T17:35:23Z",
      "title": "Relations between Moscow and Washington won't change no matter who wins the US election, Putin says",
      "url": "https://apnews.com/e192904652221b29efdc88d0af23114e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbee9b09e652427c84a6b08138e74d1b/2839.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Ukraine has used U.S weapons to strike inside Russia in recent days, according to a U.S. senator and a Western official familiar with the matter.The weapons were used under recently approved guidance from President Joe Biden allowing American arms to be used to strike inside Russia for the limited purpose of defending Kharkiv, Ukraine's second-largest city.",
      "publishedAt": "2024-06-05T16:06:37Z",
      "title": "Ukraine uses US weapons to strike inside Russia, according to a senator and a Western official",
      "url": "https://apnews.com/c46c3ca0f0f4893c8c3b0ef53e974438",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1986c235f2134e80bf63da99f45667c1/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, STEPHEN GROVES and ADRIANA GOMEZ LICON",
      "description": "WASHINGTON (AP) — President Joe Biden tried to address a major liability for his reelection campaign by taking executive action to significantly restrict asylum at the U.S.-Mexico border.",
      "publishedAt": "2024-06-05T04:18:40Z",
      "title": "Will Biden's new border measures be enough to change voters' minds?",
      "url": "https://apnews.com/a2769fae1fb4e6b7899fd191b5864de3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/912796ce379f49c89d169c1e545c5c57/2815.jpeg"
    },
    {
      "author": "JOCELYN GECKER",
      "description": "WESTPORT, Conn. (AP) — Kate Bulkeley's pledge to stay off social media in high school worked at first. She watched the benefits pile up: She was getting excellent grades. She read lots of books. The family had lively conversations around the dinner table and gathered for movie nights on weekends.",
      "publishedAt": "2024-06-05T04:22:41Z",
      "title": "Life as a teen without social media isn't easy. These families are navigating adolescence offline",
      "url": "https://apnews.com/e32f82d46ea74b807c9099d61aec25d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0ea1775f0eb4c4e9666f41a03fd9743/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and LUJAIN JO",
      "description": "AUKAR, Lebanon (AP) — A gunman who attacked the U.S. embassy near Beirut was shot and captured by Lebanese soldiers after a Wednesday morning shootout that injured an embassy security guard, the military and embassy officials said.",
      "publishedAt": "2024-06-05T06:43:19Z",
      "title": "Gunman captured after shootout outside US Embassy in Lebanon",
      "url": "https://apnews.com/437056f046228d5ef6004ca46adb68c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2992a66ffd0b43fdbfa9c6b0fc4cb0c2/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and MOSHE EDRI",
      "description": "JERUSALEM (AP) — Thousands of mostly ultranationalist Israelis were taking part in an annual march through a sensitive Palestinian area of Jerusalem on Wednesday, with some stoking already surging wartime tensions by chanting “Death to Arabs.\"",
      "publishedAt": "2024-06-05T11:47:07Z",
      "title": "Israeli nationalists march through Palestinian area of Jerusalem, some chanting 'Death to Arabs'",
      "url": "https://apnews.com/1b54d6df460f681a550833888bc55581",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66c7011ff5784e4cb5a21bc9ed6f1e41/3000.jpeg"
    },
    {
      "author": "TERRY CHEA",
      "description": "STANFORD, Calif. (AP) — Stanford University said 13 people were arrested as law enforcement removed pro-Palestinian demonstrators who occupied a campus building early Wednesday that houses the university president and provost offices, with the school saying there was damage inside and outside the building.",
      "publishedAt": "2024-06-05T15:10:28Z",
      "title": "Pro-Palestinian demonstrators arrested after occupying Stanford University president's office",
      "url": "https://apnews.com/f1ec47dcac1b55839e96b5442ebcf00d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/caa520236cec4fdaae538074d7849bdc/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — The arrest of an executive at The Epoch Times in a money-laundering scheme this week has drawn attention to a media outlet that has lived largely in the shadows since its founding in 2000 and a transformation during the Trump administration.",
      "publishedAt": "2024-06-05T17:28:58Z",
      "title": "What will become of The Epoch Times with its chief financial officer accused of money laundering?",
      "url": "https://apnews.com/543d184d378e570683e7d10326973240",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5aa5e34bd41c463ab0be369f8f7f0258/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "CARENTAN-LES-MARAIS, France (AP) — Shortly after D-Day in 1944, the American soldiers heading out to more fighting against Adolf Hitler's forces couldn't help but notice the hungry French boy by the side of the road, hoping for handouts.",
      "publishedAt": "2024-06-05T04:11:08Z",
      "title": "In France, D-Day evokes both the joys of liberation and the pain of Normandy's 20,000 civilian dead",
      "url": "https://apnews.com/72c0afc51a8a76222e510771a2474563",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c08a70a015ba4d5582fc1ce2afc16e7d/2789.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}