{
  "articles": [
    {
      "author": "JOEY CAPPELLETTI, ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Four years ago, candidate Joe Biden stood before supporters at a Detroit high school, flanked by Kamala Harris and other rising Democratic stars, and called himself a bridge to the next generation of leaders.",
      "publishedAt": "2024-07-12T09:01:30Z",
      "title": "Biden pushes his 'blue wall' sprint with a Michigan trip as he makes the case for his candidacy",
      "url": "https://apnews.com/e0f71b95bc8761b1a39083b1b9af6e1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84b49eb118d44feb9fb22a7c190cf0aa/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "For all the usual stagecraft, the Republican National Convention that opens Monday is different from Donald Trump's previous nominating affairs.",
      "publishedAt": "2024-07-12T05:03:32Z",
      "title": "Republicans are gathering in Milwaukee to nominate Donald Trump again. Here's what to expect",
      "url": "https://apnews.com/702139084873df3d633ee19d1b82e5f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c96ea90a852441e5aa250170e36bdc7b/3000.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — Joe Biden's tribulations were previewed in Hollywood days before he got on the debate stage.",
      "publishedAt": "2024-07-12T04:33:19Z",
      "title": "Two weeks that imperiled Biden's presidency left him on probation in the court of Democratic opinion",
      "url": "https://apnews.com/2c426f98063ab30143a7675cba10a5b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bee2913342fc4de7b9fcc99ca1341627/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — Joe Biden faced a test Thursday that he had avoided so far this year — a solo news conference with questions from the White House press corps.",
      "publishedAt": "2024-07-12T00:55:46Z",
      "title": "Key takeaways from Biden's news conference: Insistence on staying in the race and flubbed names",
      "url": "https://apnews.com/0d9f4936484ff71295e2b088e5c525dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcdcf2c1fc7f4092bf12de3ce8f9b62e/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Civil defense workers on Friday dug bodies out of collapsed buildings and pulled them off rubble-covered streets, as they collected dozens of Palestinians killed this week by an Israeli assault in a district of Gaza City.",
      "publishedAt": "2024-07-12T12:24:28Z",
      "title": "Emergency workers uncover dozens of bodies in a Gaza City district after Israeli assault",
      "url": "https://apnews.com/0b0b323dd471bacd18d135cf9e597e0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23f0453f966e4ddcb4327c57583da303/1723.jpeg"
    },
    {
      "author": "BINAJ GURUBCHARYA",
      "description": "KATHMANDU, Nepal (AP) — A landslide swept two passenger buses carrying more than 50 people into a swollen river in central Nepal early Friday, while continuous rain and more landslides were making rescue efforts difficult.",
      "publishedAt": "2024-07-12T03:10:18Z",
      "title": "2 buses carrying more than 50 people were swept into a river by a landslide in Nepal",
      "url": "https://apnews.com/d137967a9a0975f45cf8ff75f812fed4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/817c323780404d57a12184b9b11c98e4/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — Relatively few Americans fully endorse the idea that a fertilized egg should have the same rights as a pregnant woman. But a significant share say it describes their views at least somewhat well, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-07-12T04:12:43Z",
      "title": "More than 6 in 10 U.S. adults support protecting access to IVF, AP-NORC poll finds",
      "url": "https://apnews.com/3adcb634d5d99d9ebfcc7a28530b1487",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7531cb555c964167ae75ffda073f6017/3000.jpeg"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "The data of nearly all customers of the telecommunications giant AT&amp;T was downloaded to a third-party platform in a security breach, the company said Friday, as cyberattacks against businesses, schools and health systems continue to spread globally.",
      "publishedAt": "2024-07-12T11:30:30Z",
      "title": "Data of nearly all AT&T customers downloaded to a third-party platform in security breach",
      "url": "https://apnews.com/b5cdc8d6c9e1b980cb2163f34b297dad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d139915cf04745c98741a8b3d4e3963f/3000.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — Alec Baldwin ’s involuntary manslaughter trial in New Mexico was put on hold Friday while the judge considers a defense motion to dismiss the case over disputed ammunition evidence.",
      "publishedAt": "2024-07-12T04:01:37Z",
      "title": "Alec Baldwin trial on hold as judge considers defense request to dismiss case over disputed ammo",
      "url": "https://apnews.com/eb3059c696a9aee5cb86967e27d8f3bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ea9462e4b55451ca05f1e3579e9f18c/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "LONDON (AP) — Carlos Alcaraz is only a couple of months past his 21th birthday, and yet this whole Grand Slam success thing is already a bit been-there, done-that for him.Moving a step closer to a second consecutive Wimbledon title and fourth major championship overall, Alcaraz overcame a shaky start Friday to beat Daniil Medvedev 6-7 (1), 6-3, 6-4, 6-4 in the semifinals at Centre Court.",
      "publishedAt": "2024-07-12T15:38:38Z",
      "title": "Defending champion Carlos Alcaraz beats Daniil Medvedev to return to the Wimbledon final",
      "url": "https://apnews.com/eb20db1af56ec59250b6fd44f9c60db4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/470e24f8b8944dd68890f6e7ee84ee9a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}