{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump is promising new steps to tackle homelessness and crime in Washington. And that's leading the city’s mayor to voice concerns about the potential use of the National Guard to patrol the streets in the nation’s capital. Trump says in a social media post that he plans a White House news conference at 10 a.m. Monday to discuss his plans to make the District of Columbia, in his words, “safer and more beautiful than it ever was before.” On Thursday, the Republican president directed an increased federal law enforcement presence in the Democratic-run city for seven days, “with the option to extend as needed.” Federal agencies including the FBI assigned more than 120 officers and agents to assist in Washington.",
      "publishedAt": "2025-08-11T04:02:28Z",
      "title": "Trump is promising new steps to tackle crime in Washington",
      "url": "https://apnews.com/article/trump-washington-crime-national-guard-homelessness-655bc22834223c7dc93115bbcb2b215c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1266a77/2147483647/strip/true/crop/5153x2899+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F63%2F8baa7c6be3d31be5eca593125cca%2F6e1d0893946249429e055b72185c5b67"
    },
    {
      "author": null,
      "description": "President Donald Trump extended a trade truce with China for another 90 days Monday, at least delaying once again a dangerous showdown between the world’s two biggest economies. The previous deadline was set to expire at 12:01 a.m. Tuesday. Had that happened the U.S. would have ratcheted up taxes on Chinese imports from an already high 30%, and Beijing would have responded by raising retaliatory levies on U.S. exports to China. The pause buys time for the two countries to work out some of their differences, perhaps clearing the way for a summit later this year between Trump and Chinese President Xi Jinping.",
      "publishedAt": "2025-08-12T00:17:15Z",
      "title": "US and China extend trade truce another 90 days, easing tension between world's largest economies",
      "url": "https://apnews.com/article/trump-trade-tariffs-china-deadline-ad2c003e9a709a1dfdfc9a9fd3798baf",
      "urlToImage": "https://dims.apnews.com/dims4/default/826ad09/2147483647/strip/true/crop/4174x2348+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F40%2F915c31044682195c261846ceed69%2Ffc5c44eabb15459ba6b08009a1414c47"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump says he expects to know quickly if a deal can be made with Russian leader Vladimir Putin to halt the war in Ukraine. Trump plans to meet Putin on Friday in Alaska. He suggested on Monday that he could know how serious Putin is within two minutes. He also refused to say if the meeting should involve Ukrainian President Volodymyr Zelenskyy and appeared dismissive of Zelenskyy's role. European allies want Ukraine involved to prevent a deal favoring Moscow. Germany plans a separate, virtual meeting with Trump, Zelenskyy and other leaders to prepare for peace negotiations.",
      "publishedAt": "2025-08-11T10:17:30Z",
      "title": "Trump says he'll know if Putin wants a Ukraine peace deal within minutes",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-strike-575aa4ce590256d50a9d73911f681269",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ccbdac/2147483647/strip/true/crop/7942x4467+0+413/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F7d%2F8de09add29f63e018b971752139e%2Fe13ad1b77aba4192b8f7bf8003f9cafd"
    },
    {
      "author": null,
      "description": "A federal judge in New York has ruled transcripts of secret grand jury testimony in the sex trafficking case against Jeffrey Epstein's former girlfriend Ghislaine Maxwell won’t be released. Judge Paul A. Engelmayer issued his written ruling on Monday. The judge says releasing the transcripts would risk unraveling the foundations of secrecy upon which the grand jury is premised. Maxwell is serving a 20-year prison term after her conviction on sex trafficking charges for helping procure girls for Jeffrey Epstein to sexually abuse. Maxwell recently was interviewed by the Department of Justice and was moved from a prison in Florida to a prison camp in Texas. Maxwell's attorney says she testified truthfully.",
      "publishedAt": "2025-08-11T13:48:21Z",
      "title": "Judge denies request to unseal transcripts from Maxwell grand jury",
      "url": "https://apnews.com/article/justice-department-epstein-maxwell-f6ddbed5bd3fa026d43a0f510fdee22e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2735e1/2147483647/strip/true/crop/2636x1483+0+137/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2Fd4%2Fceff49ab11941146828e8fe737c3%2Fd11c95bc2dde4d4aac131a2abfc5a6dd"
    },
    {
      "author": null,
      "description": "Prime Minister Benjamin Netanyahu says Israel plans to widen its coming offensive beyond Gaza City to the last areas not yet under Israeli control. Most of Gaza’s 2 million residents have sought shelter in those areas as the territory slides toward famine. The mobilization of forces is expected to take weeks, and Israel may be using the threat of a wider offensive to try to pressure Hamas. Any expansion of Israeli operations is likely to bring even more death and destruction to the war-ravaged territory. The plans have also sparked controversy in Israel, where many fear for the lives of the remaining hostages.",
      "publishedAt": "2025-08-11T18:15:10Z",
      "title": "Israel plans to widen coming offensive beyond Gaza City",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-gaza-offensive-netanyahu-explainer-614c49ba068155488e67731fdabafce4",
      "urlToImage": "https://dims.apnews.com/dims4/default/88645db/2147483647/strip/true/crop/6744x3794+0+351/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F53%2Ffb8f974c549311cf5ef01839cea4%2F6b9657a02ae442db830926f41b8a9284"
    },
    {
      "author": null,
      "description": "An explosion at a U.S. Steel plant near Pittsburgh has left dozens injured or trapped under the rubble, with emergency workers on site trying to rescue them. An Allegheny County spokesperson says there are no confirmed fatalities from Monday morning's explosion at the Clairton Coke Works. The Allegheny County Emergency Services said it has transported five people. The agency did not provide any more details on those people transported and would only say it was an “active scene.” The plant is a massive industrial facility along the Monongahela River south of Pittsburgh, and is considered the largest coking operation in North America.",
      "publishedAt": "2025-08-11T16:03:42Z",
      "title": "Explosion at US Steel plant in Pennsylvania leaves people trapped",
      "url": "https://apnews.com/article/clairton-steel-pittsburgh-explosion-coke-f6f81a1d33f22741668d4d75dbc8eaf7",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f73f6d/2147483647/strip/true/crop/1058x595+0+406/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F27%2F0c78202a7923304268c23172dc8e%2F20c54ea567e14d3b8dcf7c4a9bb1e598"
    },
    {
      "author": null,
      "description": "Police say two people were killed in a shooting at a Target store in Austin, Texas, and a suspect has been detained. Austin police said in a post on the social platform X that the scene Monday is still active, and an investigation is ongoing. The police statement did not say if anyone was injured. Austin-Travis County emergency services posted on X that it assisted four patients but provided no details. Austin police say the suspect is a white male wearing shorts and a Hawaiian-style floral shirt. Police closed several roads in the area and warned the public not to approach him.",
      "publishedAt": "2025-08-11T20:44:15Z",
      "title": "Police say 2 dead in a shooting at a Target in Austin, Texas, and a suspect is detained",
      "url": "https://apnews.com/article/austin-texas-target-shooting-add7dbd3dca58a4a8bfb543b7954e119",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows. According to information circulated internally at the agency, it may take weeks or even months to replace windows and clean up the damage at the Centers for Disease Control and Prevention. U.S. Health Secretary Robert F. Kennedy Jr. traveled to Atlanta and on Monday met with the agency’s director. The shooter died and a police officer trying to stop him was killed in Friday’s attack.",
      "publishedAt": "2025-08-11T20:58:28Z",
      "title": "Man fired 180 shots, breaking 150 windows, at CDC headquarters in Atlanta",
      "url": "https://apnews.com/article/cdc-headquarters-shooting-dbb9e20a688f048f572c33ce2a57cd50",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0a6e95/2147483647/strip/true/crop/5486x3086+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F39%2F130435bbb28de22ee479f627d48e%2Fb3c4abd8ce164caf862b21378a0e20d3"
    },
    {
      "author": null,
      "description": "Paramount will become the new home to Ultimate Fighting Championship events across the U.S. next year, through a seven-year agreement announced with TKO Group on Monday. Under the deal, Paramount will exclusively distribute the UFC’s full lineup of its 13 marquee numbered events and 30 “Fight Nights” on its streaming platform Paramount+ — with select numbered events also set to simulcast on CBS — starting in 2026. It’s a shift away from the UFC’s existing pay-per-view model, which Paramount and TKO say will allow the mixed martial arts programming reach more consumers nationwide. UFC events currently air on ESPN — which has offered tiered pricing for fans to view content across the sports network’s TV offerings and streaming platform ESPN+ since 2019.",
      "publishedAt": "2025-08-11T12:49:39Z",
      "title": "Paramount to become home to UFC fights in US",
      "url": "https://apnews.com/article/ufc-tko-paramount-ultimate-fighting-3804114c82e30e0359605b16105ff6bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d34e27/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F67%2F3d2418e0fc3ce0d7570eb595ea76%2F6f7d8d5015f64d74b447a28e73f938fc"
    },
    {
      "author": null,
      "description": "Texas is No. 1 in the Associated Press preseason Top 25 for the first time. The Longhorns narrowly edged out Penn State in the closest preseason vote since 1998. Texas received 25 first-place votes, while Penn State received 23. The Nittany Lions have their highest preseason ranking since they were No. 1 to open 1997. The Southeastern Conference leads with 10 teams in the Top 25. The Big Ten has two of the top three teams for the third straight year. The Big 12 has four ranked teams and the ACC has three.",
      "publishedAt": "2025-08-11T16:03:23Z",
      "title": "Texas No. 1 in preseason AP Top 25 for first time, edging Penn St, Ohio St",
      "url": "https://apnews.com/article/ap-top-25-college-football-f6a624b7dc17c1896a98951214f52039",
      "urlToImage": "https://dims.apnews.com/dims4/default/b3f7fae/2147483647/strip/true/crop/7189x4044+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F7c%2Ffb36df5b76847a29470bf9079f73%2F70a8938f788a42208d759dbfa4fd1503"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}