{
  "articles": [
    {
      "author": "SAMY MAGDY and BASSEM MROUE",
      "description": "BEIRUT (AP) — Palestinians in northern Gaza described heavy Israeli bombardment Saturday in the hours after airstrikes killed at least 22 people, as Israel warned people there and in southern Lebanon to get out of the way of offensives against the Hamas and Hezbollah militant groups.",
      "publishedAt": "2024-10-12T14:30:25Z",
      "title": "Heavy Israeli bombardment in northern Gaza as UN peacekeepers in Lebanon are hit again",
      "url": "https://apnews.com/681c9c85541c8c96b802a1bad8e45e41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01974d2be1f54d60b11726f9b9ea9074/1920.jpeg"
    },
    {
      "author": "RUSS BYNUM, BRENDAN FARRINGTON and TY O'NEIL",
      "description": "VENICE, Fla. (AP) — No sooner had residents of the Bahia Vista Gulf condominium complex dug out and from Hurricane Helene than they were faced with the same daunting cleanup from new damage inflicted by Hurricane Milton.",
      "publishedAt": "2024-10-13T04:01:54Z",
      "title": "Determination to rebuild follows Florida's hurricanes with acceptance that storms will come again",
      "url": "https://apnews.com/a39b7a04052e9cd9d0d8598d090ea54b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f444061498454e7a81421eec6ac1d414/1920.jpeg"
    },
    {
      "author": "GABRIELA AOUN ANGUEIRA",
      "description": "BAKERSVILLE, N.C. (AP) — Nearly two weeks after Hurricane Helene downed power lines and washed out roads all over North Carolina's mountains, the constant din of a gas-powered generator is getting to be too much for Bobby Renfro.",
      "publishedAt": "2024-10-13T04:03:36Z",
      "title": "Volunteers bring solar power to Hurricane Helene's disaster zone",
      "url": "https://apnews.com/095b6ff5f1290ac7439f12b555f9845d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72c767c354e84fbc84404020faae007b/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "RALEIGH, N.C. (AP) — Vice President Kamala Harris on Saturday helped pack diapers into boxes of personal care products destined for North Carolina hurricane victims, agreeing with one helper who said “it takes a village.”",
      "publishedAt": "2024-10-12T19:35:28Z",
      "title": "Harris helps pack aid boxes for North Carolina hurricane victims ahead of Sunday campaign push",
      "url": "https://apnews.com/8961abd7d02bb95c6c6ba81a59ce9049",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e14ec4cd74f41b9a6b4589b83f001c2/3000.jpeg"
    },
    {
      "author": "MICHAEL R. BLOOD and MEG KINNARD",
      "description": "COACHELLA, Calif. (AP) — With the presidency on the line in battlegrounds like Wisconsin and Pennsylvania, Donald Trump spent Saturday night in solidly liberal California, seeking to link Vice President Kamala Harris to what he described as the failures of her home state.",
      "publishedAt": "2024-10-12T12:10:13Z",
      "title": "Donald Trump holds a rally in California, a state he's almost certain to lose",
      "url": "https://apnews.com/4557c2f98ffc179178fe5b6ec5bcf8aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44f4ae3ff53a4a52a691cee1ba58cb6e/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — Barack Obama had frank words for Black men who may be considering sitting out the election. “Part of it makes me think that, well, you just aren’t feeling the idea of having a woman as president, and you’re coming up with other alternatives and other reasons for that,” he said Thursday to Harris-Walz campaign volunteers and officials at a field office in Pittsburgh.",
      "publishedAt": "2024-10-12T15:07:14Z",
      "title": "Obama’s callout to Black men touches a nerve among Democrats. Is election-year misogyny at play?",
      "url": "https://apnews.com/c468d83d73c52406648c9bd5e7b9a33d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a677f3996894846ae2a74d7aaadf191/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "DAMASAK, Nigeria (AP) — When Boko Haram launched an insurgency in northeastern Nigeria in 2010, Abdulhameed Salisu packed his bag and fled from his hometown of Damasak in the country's battered Borno state.",
      "publishedAt": "2024-10-13T04:04:50Z",
      "title": "They fled their homes to escape Boko Haram. Now Nigeria is resettling them back despite their fears",
      "url": "https://apnews.com/1eb22e035f0d01cdfe7345f93ea122b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2acebf505f547f5b5a8e3437a4b1189/3000.jpeg"
    },
    {
      "author": "LIUDAS DAPKUS",
      "description": "VILNIUS, Lithuania (AP) — Lithuanians voted Sunday in the first round of parliamentary elections that could lead to the center-right governing coalition being replaced by the opposition Social Democrats and smaller center-left parties.",
      "publishedAt": "2024-10-13T04:02:21Z",
      "title": "Lithuanians vote in parliamentary election with many looking for change despite a strong economy",
      "url": "https://apnews.com/3ec44ad544ae11cf05b1b112175ef93b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b429c2e4c2a43299f7204e83300ece8/3000.jpeg"
    },
    {
      "author": "KANIS LEUNG",
      "description": "MACAO (AP) — Macao’s former top judge, Sam Hou Fai, was chosen as the Chinese casino hub’ s next leader in a largely ceremonial election on Sunday, setting him up to become the city’s first chief executive born in mainland China.",
      "publishedAt": "2024-10-13T00:04:40Z",
      "title": "Macao's former top judge is elected as the Chinese casino hub's first leader born in mainland China",
      "url": "https://apnews.com/11578a4d193ab2a440b9b915b7909666",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ce6da54979c40f4baac235f8751b20e/3000.jpeg"
    },
    {
      "author": "ANDREA RODRÍGUEZ",
      "description": "HAVANA (AP) — Balto, Pepa and Mami were among the lucky ones.After being abandoned by their owners who left Cuba — or simply couldn’t care for them anymore — the dogs were rescued by animal rights activists on the island, who fed them, sterilized them and found them a new home.",
      "publishedAt": "2024-10-13T04:01:47Z",
      "title": "Cubans searching for a better future leave their pets behind",
      "url": "https://apnews.com/ccecf0dd3c0d86cd99a22c0205b80498",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c010d724fdf46efa369affea5ba9e98/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}