{
  "articles": [
    {
      "author": "MELANIE LIDMAN, AAMER MADHANI, and BASSEM MROUE",
      "description": "JERUSALEM (AP) — Iran launched at least 180 missiles into Israel on Tuesday, the latest in a series of escalating attacks in a yearslong conflict between Israel and Iran and its Arab allies that threatens to push the Middle East closer toward a regionwide war.",
      "publishedAt": "2024-10-01T09:41:48Z",
      "title": "Iran fires at least 180 missiles into Israel as regionwide conflict grows",
      "url": "https://apnews.com/eb175dff6e46906caea8b9e43dfbd3da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad2b397bf6cb4d1e8e72da04b611bf24/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Iran launched almost 200 missiles at Israel on Tuesday evening, causing scattered damage and fires from falling shrapnel, but Israeli authorities said there were no injuries. An Israeli security official said most of the missiles were intercepted, though some managed to land.",
      "publishedAt": "2024-10-01T12:10:40Z",
      "title": "What to know about Iran's missile barrage and Israel's ground operations in Lebanon",
      "url": "https://apnews.com/c44358cb4c70db69bdab4b254cb2ed76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9038ef9536c6422fab9b37ea08936f4a/3000.jpeg"
    },
    {
      "author": "ERIK VERDUZCO and JEFF AMY",
      "description": "SWANNANOA, N.C. (AP) — Cadaver dogs and search crews trudged through knee-deep muck and debris in the mountains of western North Carolina on Tuesday looking for victims of Hurricane Helene, days after the storm carved a deadly and destructive path through the Southeast.",
      "publishedAt": "2024-10-01T04:10:03Z",
      "title": "Hurricane Helene's death toll passes 150 as crews search for survivors",
      "url": "https://apnews.com/c5ff143de63e31bd345066221f5e4d24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/954d685df6b142b7afe44cc43a45afd6/1920.jpeg"
    },
    {
      "author": "ALI SWENSON, CHRISTINE FERNANDO and JEFFREY COLLINS",
      "description": "ASHEVILLE, N.C. (AP) — North Carolina election officials say they will do everything in their power to ensure that voters in the crucial presidential swing state will be able to cast their ballots despite the devastation of Hurricane Helene and the destruction of basic infrastructure only about a month before the November election.",
      "publishedAt": "2024-10-01T19:35:43Z",
      "title": "Key swing state election faces 'daunting' level of uncertainty after storm ravages multiple counties",
      "url": "https://apnews.com/46a7fbecb44464409d796dd687d3cb9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf84eef65c944883bca23665e9c4a825/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Tim Walz and JD Vance will meet for their first and possibly only vice presidential debate Tuesday, in what could be the last debate for both campaigns to argue their case before the election.",
      "publishedAt": "2024-10-01T04:01:50Z",
      "title": "Walz and Vance will meet in their first and possibly only vice presidential debate",
      "url": "https://apnews.com/66ff2e5e45a8dda55b0a2242fc238fdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f21c833bd6740a7a476a98f97417a4a/3000.jpeg"
    },
    {
      "author": "TOM KRISHER, WYATTE GRANTHAM-PHILIPS and TASSANEE VEJPONGSA",
      "description": "PHILADELPHIA (AP) — The 45,000 dockworkers who went on strike Tuesday for the first time in decades at 36 U.S.",
      "publishedAt": "2024-10-01T10:43:00Z",
      "title": "Dockworkers may have the negotiating advantage in their strike against US ports",
      "url": "https://apnews.com/91703e4798dbc9ee82185e983f31a3f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5432e0816734cf7a8711ab86c1495fb/1920.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ and MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Claudia Sheinbaum was sworn in Tuesday as Mexico’s first female president, riding the enthusiasm over her predecessor’s social programs but also facing challenges that include stubbornly high levels of violence.",
      "publishedAt": "2024-10-01T04:13:54Z",
      "title": "Claudia Sheinbaum sworn in as 1st female president of Mexico",
      "url": "https://apnews.com/7d3599b39a7298df46e7eda34d80afee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4428b7d2e94445a6975da94b3e2967d1/1709.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — John Amos, who starred as the family patriarch on the hit 1970s sitcom “Good Times\" and earned an Emmy nomination for his role in the seminal 1977 miniseries “Roots,” has died.",
      "publishedAt": "2024-10-01T18:15:05Z",
      "title": "John Amos, patriarch on 'Good Times' and an Emmy nominee for the blockbuster 'Roots,' dies at 84",
      "url": "https://apnews.com/65a1d2dc84175bb5d4c579901af7164f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a189ce14c5dc43b7a1268535eb6a52c5/3000.jpeg"
    },
    {
      "author": "CHARLOTTE KRAMON and BILL BARROW",
      "description": "PLAINS, Ga. (AP) — Longtime friends, family and fans of Jimmy Carter milled around his hometown of Plains to celebrate his 100th birthday on Tuesday, the first time an American president has lived a full century and the latest milestone in a life that took the Depression-era farmer's son to the White House and across the world as a Nobel Peace Prize-winning humanitarian and advocate for democracy.",
      "publishedAt": "2024-10-01T04:13:22Z",
      "title": "Jimmy Carter and his hometown of Plains celebrate the 39th president's 100th birthday",
      "url": "https://apnews.com/1e540c277dea07bd84242d290b4ebcdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10f81e6b84714b1eb3c70622b8189209/1920.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "What used to be one of baseball's most magical numbers — 61 home runs — now sits buried, eight lines deep, in the Major League Baseball record book.",
      "publishedAt": "2024-10-01T10:00:22Z",
      "title": "Will anyone hit 74 homers? Even Aaron Judge thinks MLB season record is 'a little untouchable'",
      "url": "https://apnews.com/565ba3012181bd54234c64ea8648e649",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10bbc90ee36549098c114b4369161d1f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}