{
  "articles": [
    {
      "author": "JOSEPH KRAUSS and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Gaza’s interior ministry on Thursday said that an Israeli airstrike on a residential building in the densely populated Jabaliya refugee camp in northern Gaza has killed at least 45 people and wounded dozens more.",
      "publishedAt": "2023-10-12T05:11:00Z",
      "title": "Gaza authorities say at least 45 Palestinians killed in Israeli strike on a refugee camp",
      "url": "https://apnews.com/beb1fa2b9e4ede6cf4568dd6c86ff11a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a98e44694b6481da8be663e8350a834/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Joe Biden had been to Dachau, the infamous concentration camp in Germany, several times before, but he sensed changes when he visited as vice president with a teenaged granddaughter.",
      "publishedAt": "2023-10-12T16:32:05Z",
      "title": "A 'Zionist in my heart': Biden's devotion to Israel faces a new test",
      "url": "https://apnews.com/919058eec36dca4c06cf9fc4355fe302",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd9a8a540da94847896379efff9a8526/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "BRUSSELS (AP) — U.S. Defense Secretary Lloyd Austin plans to visit Israel on Friday, the second high-level U.S. official to visit Tel Aviv in two days, in a deliberate show of support and an effort to determine what additional military aid is needed in the war with Hamas.",
      "publishedAt": "2023-10-12T16:51:35Z",
      "title": "US Defense Secretary Austin to visit Israel on Friday to discuss military aid following Hamas attack",
      "url": "https://apnews.com/f7c0e2f2a091b14a80b6cae078a90a81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17caf1efac1242e8904228d18a4aa128/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Millions of Social Security recipients will get a 3.2% increase in their benefits in 2024, far less than this year's historic boost and reflecting moderating consumer prices.",
      "publishedAt": "2023-10-12T12:44:52Z",
      "title": "Social Security benefits will increase by 3.2% in 2024 as inflation moderates",
      "url": "https://apnews.com/ef9255c0da3c3d2391dadac4515db2e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd6d62cd6b7b437097a67be72db3a44e/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Nominated to be House speaker, Rep. Steve Scalise is heading straight into a familiar Republican problem: Skeptical GOP colleagues are reluctant to give their support, denying him the majority vote needed to win the gavel.",
      "publishedAt": "2023-10-12T04:23:22Z",
      "title": "Speaker nominee Scalise tries to sway skeptical GOP colleagues as his chief rival urges party unity",
      "url": "https://apnews.com/1492ca6b58604c51186015c23f7efccd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d46136f1681b439b8dba9d850b469e73/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — U.S. Sen. Bob Menendez of New Jersey faced a new charge Thursday that he conspired to act as an agent of the Egyptian government, a remarkable accusation against a Democrat who had a powerful role in U.S.",
      "publishedAt": "2023-10-12T16:24:28Z",
      "title": "Sen. Menendez is accused of being an unregistered agent of Egypt's government in updated indictment",
      "url": "https://apnews.com/c1850764b8ce7c613fc50f0e4f495e87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d7ce3cef0c84f48b910a935e9ca6e5c/3000.jpeg"
    },
    {
      "author": "MARK VANCLEAVE and STEVE KARNOWSKI",
      "description": "PRINCETON, Minn. (AP) — Five drug task force officers were shot and wounded Thursday while serving a search warrant near the Minnesota city of Princeton, authorities said. The suspect was arrested after a standoff that lasted several hours.",
      "publishedAt": "2023-10-12T15:30:24Z",
      "title": "Five officers shot and wounded in Minnesota confrontation, authorities say; suspect arrested",
      "url": "https://apnews.com/273658ed362ec52fc39ca82bab85f0bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fddc965cb35d4de987310f803a4d6d91/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Measures of U.S. inflation barely declined in September, evidence that consumer price increases are grinding lower at a gradual pace.",
      "publishedAt": "2023-10-12T04:01:25Z",
      "title": "US inflation eased slightly last month as price increases extend slow descent",
      "url": "https://apnews.com/8ab5c75e191a31942f2fcf1eeb8fa44c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93fef1e347fa440288bdc0a0458da832/3000.jpeg"
    },
    {
      "author": "KEN SWEET and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Sam Bankman-Fried's lawyer struggled through a meandering cross-examination of the FTX founder's former girlfriend Thursday, keeping both the judge and the public guessing as to the defense team's strategy in countering the testimony of the government's key witness.",
      "publishedAt": "2023-10-12T17:49:10Z",
      "title": "Sam Bankman-Fried's lawyer struggles in cross-examination of the government's key witness",
      "url": "https://apnews.com/7d3ce0397ff02ed52f6b4425f781a625",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/998df033c8c04051a592d77e270e9b46/3000.jpeg"
    },
    {
      "author": "MELISSA MURPHY",
      "description": "NEW YORK (AP) — Billie Jean King is still globetrotting in support of more investment and equity in women’s sports.She attended the Women’s World Cup in Australia, kicked off the player draft for the new women’s professional hockey league in Toronto and is opening an office in London for a tennis business venture involving the international Billie Jean King Cup.",
      "publishedAt": "2023-10-12T15:53:29Z",
      "title": "Approaching 80, Billie Jean King is still globetrotting for investment in women’s sports",
      "url": "https://apnews.com/eaabf0d28c811c24e071c34d2ed904ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a22f3e09c32434181bf19c11aa19d16/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}