{
  "articles": [
    {
      "author": "BASSEM MROUE and WAFAA SHURAFA",
      "description": "BEIRUT (AP) — Israeli strikes on residential areas in southern Gaza killed 38 people on Friday, Palestinian health officials said, including 13 children from the same extended family.In northern Gaza, the enclave's health authorities reported that Israeli forces had raided Kamal Adwan Hospital, one of the few medical facilities still functioning in the area.",
      "publishedAt": "2024-10-25T04:31:36Z",
      "title": "Israeli strikes on southern Gaza kill 38, including over a dozen children",
      "url": "https://apnews.com/0920f63542d158ad5999c481e421da00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d06ab51d327c486dae7144af78ab87e3/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — This year's presidential election could come down to microscopic margins, so Kamala Harris is hunting for votes in even the most unlikely of places.",
      "publishedAt": "2024-10-25T14:55:23Z",
      "title": "In a tight election where every vote counts, Harris is trying to squeeze a few out of Trump's base",
      "url": "https://apnews.com/60fe6c335dc6ce8367b7d9ae7be573f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfb69cb5557642b9bc684586de89ba3a/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and ADRIANA GOMEZ LICON",
      "description": "LAS VEGAS (AP) — Former President Donald Trump on Friday is heading to Texas — his first public campaign event in the state since receiving the Republican nomination — to sit down with the most listened-to-podcaster in the country, creating another opportunity for him to highlight the hypermasculine tone that has defined much of his 2024 White House bid.",
      "publishedAt": "2024-10-25T14:26:27Z",
      "title": "Trump visiting Texas to tape Joe Rogan's podcast and to criticize Harris on immigration",
      "url": "https://apnews.com/7ed6b971a86c69ed4344205ab2db668b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/505fcf1c09e6469b802ef30c0e4374a1/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "A deadly outbreak of E. coli poisoning tied to McDonald's Quarter Pounders has expanded, with at least 75 people sick in 13 states, federal health officials said Friday.",
      "publishedAt": "2024-10-25T15:50:07Z",
      "title": "At least 75 sickened as deadly McDonald's E. coli outbreak expands",
      "url": "https://apnews.com/a1ec3dc14636f5e713b15b32aedcd524",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c9711b0b655423c83a5176b71fe7c83/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — A child psychiatrist who altered a first-day-of-school photo he saw on Facebook to make a group of girls appear nude. A U.S. Army soldier accused of creating images depicting children he knew being sexually abused.",
      "publishedAt": "2024-10-25T04:09:26Z",
      "title": "AI-generated child sexual abuse images are spreading. Law enforcement is racing to stop them",
      "url": "https://apnews.com/42186aaf8c9e27c39060f9678ebb6d7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73b49e8bb77c4302ace9d6ba89910041/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and MOLLY QUELL",
      "description": "THE HAGUE, Netherlands (AP) — As the International Criminal Court’s top prosecutor sought war crimes charges this year against Israeli Prime Minister Benjamin Netanyahu over actions in Gaza, he was engulfed in a very different personal crisis playing out behind the scenes.",
      "publishedAt": "2024-10-25T09:36:37Z",
      "title": "International court prosecutor who charged Netanyahu faces sexual misconduct accusation",
      "url": "https://apnews.com/7519d876decb945aafc2215756df19b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6951b42f855429f893d8147c3bbca56/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "PHILADELPHIA (AP) — George Washington. Benjamin Franklin. Betsy Ross. The two Founding Fathers and the seamstress of the American flag all once worshipped on the now centuries-old wooden pews of Christ Church.",
      "publishedAt": "2024-10-25T12:02:26Z",
      "title": "Two historic Philadelphia churches offer lessons for an America divided today and in its infancy",
      "url": "https://apnews.com/730ab0c32150e397bddd8eeca71f01de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94e1cef6454147579fa923ddf77144fc/3000.jpeg"
    },
    {
      "author": "STEFANIE DAZIO, JAIMIE DING and CHRISTOPHER WEBER",
      "description": "LOS ANGELES (AP) — Erik and Lyle Menendez still have a long way to go before they can walk out of prison, even though the Los Angeles County district attorney has recommended their life-without-parole sentences be thrown out and the brothers be resentenced and immediately eligible for parole.",
      "publishedAt": "2024-10-25T05:02:48Z",
      "title": "Erik and Lyle Menendez are a step closer to leaving prison, but freedom won't come quickly",
      "url": "https://apnews.com/bafe4ca46b23751cfa7c4745e88f4edb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c31930bfd82749bfb946b3ed4ec29dab/1920.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — A New Mexico judge has upheld her decision to dismiss an involuntary manslaughter charge against Alec Baldwin in the fatal shooting of a cinematographer on the set of a Western movie.",
      "publishedAt": "2024-10-25T15:42:39Z",
      "title": "Judge upholds dismissal of involuntary manslaughter charge against Alec Baldwin in on-set shooting",
      "url": "https://apnews.com/051dfa2cb09a3cbd355aee9ad6ed19c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cecacd86eb8645168eceb0a2f2a270b4/3000.jpeg"
    },
    {
      "author": "HAL BOCK",
      "description": "In the beginning, the World Series matchup of the Dodgers against the Yankees was a kind of charming intra-city showdown of two New York City boroughs, blue collar Brooklyn, equipped with a neighborhood called Gravesend, against the pretentious Bronx, with the fancy Grand Concourse.",
      "publishedAt": "2024-10-25T15:07:35Z",
      "title": "Yankees vs Dodgers: The World Series' most frequent rivalry through the years",
      "url": "https://apnews.com/bff08bfb932f8e56257f852a488e4a94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f0d126a9c754b498784c0cf63b309cd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}