{
  "articles": [
    {
      "author": "Brian Melley",
      "description": "British Prime Minister Keir Starmer says Britain, France and Ukraine have agreed to work on a ceasefire plan to present to the United States. Starmer says the plan emerged after talks among the four countries’ leaders following Ukrainian President Volodymyr Zelenskyy’s Oval Office blowout with U.S. President Donald Trump. The prime minister told the BBC he believes the U.S. president wants a durable peace in Ukraine. He repeated his assertion that American security guarantees will be needed to make it stick. Starmer is hosting a summit of European leaders in London on Sunday to discuss Ukraine.",
      "publishedAt": "2025-03-02T05:01:32Z",
      "title": "Russia-Ukraine war: UK, France and Ukraine agree to work on ceasefire plan",
      "url": "https://apnews.com/article/ukraine-britain-zelenskyy-europe-starmer-trump-russia-b980170ead74a1a7914c565f14ee6cc9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1ea44d/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2Fb7%2F0f29019031ad0bd0874f8b28f899%2F280eb400a7294951a92c77d7daf3a8b7"
    },
    {
      "author": "Jonathan J. Cooper",
      "description": "President Donald Trump’s senior aides and allies are lashing out at Ukrainian leader Volodymyr Zelenskyy. Their criticism from Washington came as he attended a European summit Sunday in London to rally international support for his military’s fight against the Russian invasion. Following Trump’s lead, White House officials and Republicans in Congress are demanding that Zelenskyy display more gratitude for U.S. support and an openness to potential war-ending concessions to Russia. Some suggested Zelenskyy should consider resigning. But they offered little clarity as to what Zelenskyy and Ukraine could do after Friday’s Oval Office meeting in which Trump and Vice President JD Vance berated him.",
      "publishedAt": "2025-03-02T20:00:50Z",
      "title": "Trump allies lash out at Ukraine's Zelenskyy and suggest he may need to resign",
      "url": "https://apnews.com/article/trump-zelenskyy-resign-ukraine-russia-war-f258a45da0b3d990d3b2f566c2ff8139",
      "urlToImage": "https://dims.apnews.com/dims4/default/8569b92/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fca%2F1d91ab81b92e53bd1b644d5e75c1%2Fdf25e9ad306d4c858891dc3dfb5356c6"
    },
    {
      "author": "Will Weissert",
      "description": "The first time Donald Trump spoke to Volodymyr Zelenskyy, he tried to pressure Ukraine’s new leader to dig up dirt on Joe Biden ahead of the 2020 election. The 2019 phone call eventually led to Trump's impeachment. On Friday, a meeting between Trump and Zelenskyy in the Oval Office turned heated. Vice President JD Vance told Zelenskyy to show more gratitude toward Trump before the president himself began shouting at and berating the Ukrainian leader. The blowup cast fresh doubt on prospects for U.S. support of Kyiv in fending off Russia’s invasion.",
      "publishedAt": "2025-03-01T00:59:09Z",
      "title": "Trump and Zelenskyy through the years: From a 'perfect' call to an Oval Office meltdown",
      "url": "https://apnews.com/article/trump-zelenskyy-past-relationship-shouting-oval-office-88690f790901687fc1587f1bf89f5036",
      "urlToImage": "https://dims.apnews.com/dims4/default/4696e7f/2147483647/strip/true/crop/4744x2669+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F52%2Fcd50d28d05d7bd2376319d3bf61f%2F27ba59202bf74ba4847051f79803abee"
    },
    {
      "author": "The Associated Press",
      "description": "Key Republicans and Democrats have been stalwart supporters of Ukrainian President Volodymyr Zelenskyy. But a blowup between the Ukrainian leader and President Donald Trump is threatening to change that. Zelenskyy had traveled to Washington to sign a deal Friday that would give the U.S. access to its mineral riches as Trump attempts to pressure Ukraine into a deal to end the war with Russia. Instead, the fallout from a heated Oval Office exchange between Trump, Zelenskyy and Vice President JD Vance further splintered American political support for Ukraine. Sen. Lindsey Graham, who has backed Ukraine, called the meeting a “complete, utter disaster.\"",
      "publishedAt": "2025-02-28T20:36:21Z",
      "title": "What US lawmakers are saying about the White House clash between Trump and Zelenskyy",
      "url": "https://apnews.com/article/republicans-trump-zelenskyy-meeting-64ec4a67fce4f04a2d189a1e0204b023",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb2a819/2147483647/strip/true/crop/5486x3086+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F70%2F8d4d345a334f1f6406ca4e6cf9bb%2F48c8bd586cbb436ab7967789d563bb64"
    },
    {
      "author": "Tia Goldenberg, Samy Magdy",
      "description": "Israel says it's stopping the entry of all goods and supplies into the Gaza Strip. It warned of “additional consequences” if Hamas doesn't accept what Israel says is a U.S. proposal for a ceasefire extension. Hamas accused Israel of trying to derail the fragile truce and said its decision to cut off aid was “cheap extortion, a war crime and a blatant attack\" on the existing agreement. The first phase of the Israel-Hamas ceasefire, which included a surge in humanitarian assistance, expired on Saturday. The two sides have yet to negotiate the second phase, when Hamas is to release dozens of remaining hostages in return for Israel's pullout and a lasting ceasefire.",
      "publishedAt": "2025-03-02T06:58:54Z",
      "title": "Gaza ceasefire: Israel stops entry of all aid and supplies into Gaza Strip",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-02-2025-99402570996dcf33239d0492d99909e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/fdabdc0/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F6d%2Fcbf1d770f29b09bc69180fdd9fcb%2F4c0bb2fb3e7f4b48a4508e123b2ced92"
    },
    {
      "author": "Rob Gillies",
      "description": "Canadian Prime Minister Justin Trudeau will meet with King Charles III on Monday where he will discuss U.S. President Donald Trump’s threats to make Canada the 51st state. The king has come under criticism in Canada after Buckingham Palace declined to comment on Trump’s threats to annex Canada. Trudeau says he will discuss matters of importance to Canadians and said “nothing seems more important to Canadians right now than standing up for our sovereignty and our independence as a nation.” Charles is the head of state in Canada, which is a member of the British Commonwealth of former colonies.",
      "publishedAt": "2025-03-02T21:22:54Z",
      "title": "Trudeau to bring up Trump's threat to annex Canada in meeting with King Charles",
      "url": "https://apnews.com/article/trudeau-canada-king-charles-trump-5140e841c40e394bba21c2619534aa7c",
      "urlToImage": "https://dims.apnews.com/dims4/default/b8d4eff/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F2a%2F8584a3335c7d390f7acd70d7ecb2%2F6236c66943d44860879e4b2b41262e79"
    },
    {
      "author": "Sam Mednick",
      "description": "Earth's warming climate is causing problems for big coffee producers everywhere and some are looking to a rarely cultivated species that may stand up better to drought and heat. It's excelsa, which is native to South Sudan and a handful of other African countries. The tree’s deep roots, thick leaves and big trunk help it thrive in extreme conditions where other coffees cannot. It’s also resistant to many common coffee pests and diseases. Excelsa currently has less than 1% of a market dominated by arabica and robusta. In South Sudan, some farmers testing the excelsa trees hope it will help lift them out of poverty.",
      "publishedAt": "2025-03-03T03:00:06Z",
      "title": "What is excelsa coffee? South Sudan’s bean resistant to climate change may be industry’s future",
      "url": "https://apnews.com/article/south-sudan-coffee-robusta-arabica-excelsa-climate-change-b6efff83f2ff89ccc63033dcec071783",
      "urlToImage": "https://dims.apnews.com/dims4/default/f346b4f/2147483647/strip/true/crop/8460x4759+0+441/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2Fcb%2Fa3ef7e2176b95ea5a8fbf652202a%2Fd9c850ca8acc464caa0e060e7dba0bce"
    },
    {
      "author": "Mark Kennedy",
      "description": "After accepting the Oscar for best supporting actress for her work in “Emilia Pérez,” Zoe Saldaña spoke emotionally about her family and her grandmother, tearing up during her speech. It was one highlight during Sunday's almost-four-hour-long telecast. Another was Morgan Freeman understatedly honoring his friend, Gene Hackman, and a cute moment when Kieran Culkin asked for more kids from his wife. Host Conan O’Brien took a back seat at the opening number, ceding the floor to a “Wizard of Oz”-themed musical medley led by Ariana Grande and Cynthia Erivo, and there was a James Bond segment in which singers Lisa, Doja Cat and Raye each tackled a 007 title song.",
      "publishedAt": "2025-03-03T08:30:31Z",
      "title": "Highlights from the 2025 Oscars",
      "url": "https://apnews.com/article/2025-oscars-highlights-0a655880c08035348b028bf0b2651b0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/4df9f25/2147483647/strip/true/crop/4685x2635+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F9f%2Ffc8d478975e33a41f9848bec14e1%2F4cb00fc035f54e85bc01586451c4fb3d"
    },
    {
      "author": "The Associated Press",
      "description": "A 70-year-old was killed and four other people were wounded in a stabbing attack Monday in the northern Israeli city of Haifa. Israeli authorities said the assailant was killed. The attack took place in a bus station, Israeli police said. It was not immediately clear who killed the attacker, whose identity was not immediately known. Earlier, Eli Bin, head of emergency rescue service Magen David Adom, told Israeli media that four people were wounded in the stabbing attack and another was critically wounded by gunfire.",
      "publishedAt": "2025-03-03T08:30:57Z",
      "title": "Middle East latest: 1 killed and 4 wounded in stabbing attack in Haifa, Israeli officials say",
      "url": "https://apnews.com/article/mideast-gaza-israel-hamas-war-latest-03-03-2025-ee7d0cc67149ee6ef79daaa4abd3d98f",
      "urlToImage": "https://dims.apnews.com/dims4/default/ecbb1e1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F5a%2Fd499122e93ad1d21f730f8ccbd6c%2F5ca50dc618f4414b8b432afcb7a0dbab"
    },
    {
      "author": "Cara Anna",
      "description": "Israel has cut off the entry of all food and other goods into Gaza in an echo of the siege it imposed in the earliest days of its war with Hamas. The United Nations and other humanitarian aid providers are sharply criticizing the decision and calling it a violation of international law. Israel is trying to pressure the Hamas militant group to agree to what Prime Minister Benjamin Netanyahu’s government describes as a U.S. proposal to extend the ceasefire’s first phase instead negotiating its second phase. Here’s a look at what Israel’s decision means and the reactions.",
      "publishedAt": "2025-03-02T19:18:57Z",
      "title": "Israel has cut off all supplies to Gaza. Here's what that means",
      "url": "https://apnews.com/article/gaza-israel-hamas-palestinians-aid-explainer-ecc0e70d5ff1120a04bf36626dfd96f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b37ff9/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F2a%2Fe7bf969bcf911ef73fc8802b4d88%2Ffa20088a1a2e490fb1ad0d3c8a512595"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}