{
  "articles": [
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — A passenger plane skidded off a runway at a South Korean airport Sunday, slammed into a concrete fence and burst into flames after its front landing gear apparently failed to deploy.",
      "publishedAt": "2024-12-29T00:56:18Z",
      "title": "A plane crashes and bursts into flames while landing in South Korea, killing 179",
      "url": "https://apnews.com/68da9b0bd5196feed6e7d2db849f461a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2de0877bb52949a183a236022f8ac8fc/1920.jpeg"
    },
    {
      "author": null,
      "description": "HOUSTON (AP) — A strong storm system threatened to whip up tornadoes in parts of the U.S. Southeast on Sunday, a day after severe weather claimed at least two lives as twisters touched down in Texas and Mississippi.",
      "publishedAt": "2024-12-28T19:48:10Z",
      "title": "Tornadoes in Texas and Mississippi kill 2 and injure 6 as severe weather system moves east",
      "url": "https://apnews.com/bd534f48c9ab76380aa09cb86b7ffb25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d75aff1d33ed4883ae751f6f4639cd0b/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and MAJDI MOHAMMED",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A fourth infant has died of hypothermia in the Gaza Strip, where hundreds of thousands of Palestinians displaced by nearly 15 months of war are huddled in tents along the rainy, windswept coast as winter arrives.",
      "publishedAt": "2024-12-29T07:18:30Z",
      "title": "A fourth infant dies of the winter cold in Gaza as families share blankets in seaside tents",
      "url": "https://apnews.com/99ea908015e3faafb3191ff648c9816e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97da0856374b4f3c963ddfa439b0dc35/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu is having his prostate removed on Sunday, his office said, a procedure that comes as he manages multiple crises at once, including the ongoing war in Gaza and his own trial for alleged corruption.",
      "publishedAt": "2024-12-29T10:19:51Z",
      "title": "Netanyahu is getting his prostate removed as he faces crises on multiple fronts",
      "url": "https://apnews.com/ffa0430d621307d34a673a0428ece945",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/136cd6836a7644d5841e5da8afbeb826/3000.jpeg"
    },
    {
      "author": null,
      "description": "BERLIN (AP) — Tech entrepreneur Elon Musk caused uproar after backing Germany’s far-right party in a major newspaper ahead of key parliamentary elections in the Western European country, leading to the resignation of the paper’s opinion editor in protest.",
      "publishedAt": "2024-12-29T13:46:08Z",
      "title": "Musk causes uproar for backing Germany's far-right party ahead of key elections",
      "url": "https://apnews.com/915cc6821cd48c3168a7895b1d1c1a35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/566ebc5639334955884e6a3033644c42/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "In 2024, President Vladimir Putin further cemented his grip on power and sought to counter Russia's isolation from the West over the war in Ukraine.",
      "publishedAt": "2024-12-29T05:07:04Z",
      "title": "2024 was a year of triumphs and setbacks for Russian leader Vladimir Putin. Here's how it unfolded",
      "url": "https://apnews.com/110be178bbeb8ca4c468969c0de935ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f9bfefa0b1c4aacbf671db2fad9e060/2937.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Azerbaijan’s President Ilham Aliyev said Sunday that the Azerbaijani airliner that crashed last week was shot down by Russia, albeit unintentionally, and criticized Moscow for trying to “hush up” the issue for days.",
      "publishedAt": "2024-12-29T12:28:36Z",
      "title": "Azerbaijan's president says crashed jetliner was shot down by Russia unintentionally",
      "url": "https://apnews.com/e6c1002284a900fa635eecf5573214ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2975d878be7144e5947c5d8b75d82436/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A Russian man arrested for allegedly running a travel agency for gay customers was found dead in custody in Moscow, rights group OVD-Info reported Sunday, amid a crackdown on LGBTQ+ rights in Russia.",
      "publishedAt": "2024-12-29T16:35:20Z",
      "title": "Russian man arrested for allegedly running LGBTQ+ travel agency found dead in custody",
      "url": "https://apnews.com/e5fd33b605d23df0878ba904c0f0a1cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f9bfefa0b1c4aacbf671db2fad9e060/2937.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "JOBAR, Syria (AP) — In this Damascus suburb, the handful of remaining Jews in Syria can again make pilgrimages to one of the world’s oldest synagogues where people from throughout the region once came to pray.",
      "publishedAt": "2024-12-29T11:33:32Z",
      "title": "Syria's dwindling Jewish community can visit one of the world's oldest synagogues again",
      "url": "https://apnews.com/5ce2e3900c62792072836274b3aaf75e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84a468d5736b41b8a1b004af65923ded/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "When LeBron James broke another NBA record earlier this month, the one for most regular-season minutes played in a career, his Los Angeles Lakers teammates handled the moment in typical locker room fashion.",
      "publishedAt": "2024-12-29T15:13:33Z",
      "title": "LeBron James at 40: A milestone birthday arrives Monday for the NBA's all-time scoring leader",
      "url": "https://apnews.com/860c75a450f50282330381cc99c0e5c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5191e44a4ff4a20a55dbeabd3e6a715/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}