{
  "articles": [
    {
      "author": "LISA MASCARO, KEVIN FREKING and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — House Speaker Kevin McCarthy's last-ditch plan to keep the federal government temporarily open collapsed in dramatic fashion Friday as a robust faction of hard-right holdouts rejected the package, making a shutdown almost certain.",
      "publishedAt": "2023-09-29T15:15:00Z",
      "title": "McCarthy's last-ditch plan to keep the government open collapses, making a shutdown almost certain",
      "url": "https://apnews.com/4b6644959722dbbbed654768bd9fc653",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20084087cf184675ba9ce8825725a811/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ, BOBBY CAINA CALVAN and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Rain walloped the New York metropolitan area with a startling punch Friday, knocking out several subway and commuter rail lines, stranding drivers on highways, flooding basements and shuttering a terminal at LaGuardia Airport for hours in one of the city's wettest days in decades.",
      "publishedAt": "2023-09-29T14:36:24Z",
      "title": "New York City area gets one of its wettest days in decades, as rain swamps subways and streets",
      "url": "https://apnews.com/a16ad4720eddd6c0f7ea3b761f414e80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54c315651227465d9a2af3904d4177e4/1920.jpeg"
    },
    {
      "author": "TOM KRISHER and DAVID KOENIG",
      "description": "DETROIT (AP) — The United Auto Workers union expanded strikes against Detroit automakers Friday, ordering 7,000 more workers to walk off the job in Illinois and Michigan to put more pressure on the companies to improve their offers.",
      "publishedAt": "2023-09-29T12:30:56Z",
      "title": "United Auto Workers strikes spread as 7,000 more workers at two plants join the picket line",
      "url": "https://apnews.com/e2c78274333bea20856b90126a6b831c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/037ee1d66609401eaf5d3875a780c209/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Navy will begin randomly testing its special operations forces for steroids and other performance-enhancing drugs beginning in November, taking a groundbreaking step that military leaders have long resisted.",
      "publishedAt": "2023-09-29T16:19:01Z",
      "title": "The Navy will start randomly testing SEALs and special warfare troops for steroids",
      "url": "https://apnews.com/883a7262652224ac382d22fd38f90940",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3b7aa86d01a4c559463793a92f59ec1/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — A man who prosecutors say ordered the 1996 killing of rapper Tupac Shakur was arrested and charged with murder Friday in a long-awaited breakthrough in one of hip-hop’s most enduring mysteries.",
      "publishedAt": "2023-09-29T16:32:11Z",
      "title": "Last living suspect in 1996 drive-by shooting of Tupac Shakur indicted in Las Vegas on murder charge",
      "url": "https://apnews.com/3f7050c2a68813d86a96b96fbb3f1d1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9996e8bb87f7476494e447a6b23f0178/3000.jpeg"
    },
    {
      "author": "MICHAEL R. BLOOD and JONATHAN J. COOPER",
      "description": "ANAHEIM, Calif. (AP) — In an occasionally dark and profane speech, Donald Trump on Friday sought to win over Republicans in California by complaining that rich people in Beverly Hills smell bad because they're denied water, reiterating lies about widespread election fraud and calling on police to shoot people robbing stores.",
      "publishedAt": "2023-09-29T13:26:20Z",
      "title": "Trump animates California Republicans with calls to shoot people who rob stores",
      "url": "https://apnews.com/e2f59e579f106c03aaf6189ea1079f11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d12334f43b6488c8806e91ede772ce0/3000.jpeg"
    },
    {
      "author": "ABDUL SATTAR",
      "description": "QUETTA, Pakistan (AP) — A suspected suicide bomber blew himself up among a crowd of people celebrating the Prophet Muhammad’s birthday in southwestern Pakistan on Friday, killing at least 52 people and wounding nearly 70 others, authorities said, in one of the country's deadliest attacks targeting civilians in months.",
      "publishedAt": "2023-09-29T06:58:53Z",
      "title": "Dozens dead after blast in southwestern Pakistan at a rally celebrating birthday of Islam's prophet",
      "url": "https://apnews.com/f9d1fab750bc8fcb03bb11e09e22d9de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/932aa0a0d9754c9096b314f03b5cfd45/2183.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — The Archdiocese of Baltimore on Friday filed for Chapter 11 bankruptcy reorganization days before a new state law goes into effect removing the statute of limitations on child sex abuse claims and allowing victims to sue their abusers decades after the fact.",
      "publishedAt": "2023-09-29T18:31:18Z",
      "title": "Baltimore Archdiocese files for bankruptcy before new law on abuse lawsuits takes effect",
      "url": "https://apnews.com/fd2c76a1764af8c61f17db73c6655510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7beff9f11bdb456aa36048e0a5f2b9bb/3000.jpeg"
    },
    {
      "author": "ADRIAN SAINZ",
      "description": "MEMPHIS, Tenn. (AP) — A Tennessee judge said Friday she is ending a conservatorship agreement between former NFL player Michael Oher and a Memphis couple who took him in when he was in high school, but the highly-publicized dispute over financial issues will continue.",
      "publishedAt": "2023-09-29T15:46:09Z",
      "title": "Judge says she is ending conservatorship between former NFL player Michael Oher and Memphis couple",
      "url": "https://apnews.com/ee1997025e6c9013e4d665ef18d95dc7",
      "urlToImage": ""
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Entrances to national parks will be blocked and thousands of park rangers will be furloughed if Congress doesn’t reach a budget agreement this weekend, the Department of Interior said Friday.",
      "publishedAt": "2023-09-29T10:02:43Z",
      "title": "Gates will be locked and thousands of rangers furloughed at national parks if government shuts down",
      "url": "https://apnews.com/55c06261c51650e34f4591626bd9f236",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e121889efe1439daf8426c13815f543/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}