{
  "articles": [
    {
      "author": "JILL COLVIN, DARLENE SUPERVILLE and BILL BARROW",
      "description": "PHILADELPHIA (AP) — Kamala Harris and Donald Trump closed out this year’s presidential race with a fierce battle for Pennsylvania on Monday, making their final pitch to voters across a state that could prove decisive in the campaign for the White House.",
      "publishedAt": "2024-11-04T05:07:07Z",
      "title": "Harris and Trump set sights on Pennsylvania in final push before Election Day",
      "url": "https://apnews.com/0429c35a84739bd90d9e5bb92fe803de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fcf3a1fcbe54bfbb9208a04939855c8/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and ALI SWENSON",
      "description": "WASHINGTON (AP) — Election Day 2024 arrived Tuesday — with tens of millions of Americans having already cast their ballots. Those include record numbers in Georgia, North Carolina and other battleground states that could decide the winner.",
      "publishedAt": "2024-11-05T05:06:00Z",
      "title": "The final day of voting in the US is here, after tens of millions have already cast their ballots",
      "url": "https://apnews.com/a8ae22f34417dcda060b430dac89bdbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/843b1323f83142f39f3a3860ce2f0f9c/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "Former President Donald Trump is stepping up his demands that the winner of the presidential race be declared shortly after polls close Tuesday, well before all the votes are counted.Trump set the pattern in 2020, when he declared that he had won during the early morning hours after Election Day.",
      "publishedAt": "2024-11-04T20:37:18Z",
      "title": "Trump wants the presidential winner to be declared on election night. Why that's unlikely",
      "url": "https://apnews.com/61d69529c5e135f34fac2bf2d3bbe3e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4beec62fe5f140c783cf97abe2418e75/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — Voters in nine states are deciding whether their state constitutions should guarantee a right to abortion, weighing ballot measures that are expected to spur turnout for a range of crucial races.",
      "publishedAt": "2024-11-05T05:03:56Z",
      "title": "Abortion is on the ballot in nine states and motivating voters across the US",
      "url": "https://apnews.com/49c9073cbb6056b66a8a7d0d099795d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46903365a075482d98a3811db1bbc069/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Control of Congress is at stake Tuesday, with ever-tight races for the House and Senate that will determine which party holds the majority and the power to boost or block a president’s agenda, or if the White House confronts a divided Capitol Hill.",
      "publishedAt": "2024-11-05T05:01:59Z",
      "title": "Control of Congress is at stake and with it a president's agenda",
      "url": "https://apnews.com/94b49277db2a5c21f23236794a36afa6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9313367711d4ce49b516cb4ca0ba59f/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and ALI SWENSON",
      "description": "WASHINGTON (AP) — The nation’s federal law enforcement and election security agencies are debunking two new examples of Russian election disinformation on the eve of Election Day, highlighting attempts by foreign actors to sow doubt in the U.S.",
      "publishedAt": "2024-11-05T02:52:54Z",
      "title": "Federal agencies say Russia and Iran are ramping up influence campaigns targeting US voters",
      "url": "https://apnews.com/ab8ed2baadbb02364a4becff6d38f4f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65f1718ea4654ebab02bd3eadbef1e74/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike in northern Gaza has killed at least 20 people, mostly women and children, Palestinian officials said Tuesday, as Israel wages a nearly monthlong air and ground operation in what was already the most isolated and heavily destroyed part of the territory.",
      "publishedAt": "2024-11-05T08:54:31Z",
      "title": "An Israeli airstrike kills 20 people in northern Gaza, Palestinian officials say",
      "url": "https://apnews.com/c1421d5624f91630523eee007c7a7d17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5324d1a0f32472b8da5da3f9c9ff52d/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG, LINDSEY WASSON and HANNAH SCHOENBAUM",
      "description": "SEATTLE (AP) — Factory workers at Boeing voted to accept a contract offer and end their strike after more than seven weeks, clearing the way for the aerospace giant to resume production of its bestselling airliner and generate much-needed cash.",
      "publishedAt": "2024-11-05T05:09:06Z",
      "title": "Boeing factory strike ends as workers vote to accept contract",
      "url": "https://apnews.com/5237a31660b0a06381457e33f9a72369",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31daf194766c45abb57424c41c932e18/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Puerto Rico is holding elections that will be historic regardless of which of the top two gubernatorial candidates wins.If Jenniffer González of the pro-statehood New Progressive Party wins Tuesday's election, it will mark the first time in the island’s history that the party secures three consecutive terms.",
      "publishedAt": "2024-11-05T05:06:25Z",
      "title": "Puerto Rico holds general election that promises to be historic",
      "url": "https://apnews.com/f32de13cb3d7aad4f4264d1b3d86352f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e43cd9b1088478eb99ed838a06f1689/3000.jpeg"
    },
    {
      "author": null,
      "description": "SAN JUAN, Puerto Rico (AP) — Tropical Storm Rafael chugged toward the Cayman Islands on Tuesday and was forecast to strengthen into a hurricane en route to Cuba.The storm was located 105 miles (170 kilometers) southwest of Kingston, Jamaica, early Tuesday.",
      "publishedAt": "2024-11-05T10:22:03Z",
      "title": "Tropical Storm Rafael spins toward the Cayman Islands as Cuba prepares for hurricane hit",
      "url": "https://apnews.com/a6e887bf385bddae926629ed8aa0ea53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a58348ac878d46728ad0e982e213da28/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}