{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and ISSAM ADWAN",
      "description": "JERUSALEM (AP) — Backed by a barrage of rockets, Hamas militants stormed from the blockaded Gaza Strip into nearby Israeli towns, killing dozens and abducting others in an unprecedented surprise attack during a major Jewish holiday Saturday.",
      "publishedAt": "2023-10-07T03:50:54Z",
      "title": "Hamas surprise attack out of Gaza stuns Israel and leaves hundreds dead in fighting, retaliation",
      "url": "https://apnews.com/11fb98655c256d54ecb5329284fc37d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b11604e54165450e96737764167d9d1f/1920.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — A powerful magnitude-6.3 earthquake followed by strong aftershocks killed dozens of people in western Afghanistan on Saturday, the country's national disaster authority said.The United Nations gave a preliminary figure of 320 dead, but later said the figure was still being verified.",
      "publishedAt": "2023-10-07T10:43:22Z",
      "title": "Powerful earthquake and aftershocks kill dozens and injure many more in western Afghanistan",
      "url": "https://apnews.com/ba6f50c0cd0590f179756077f5f01393",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1cda97b4b2b412f90aff2262face393/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and JILL COLVIN",
      "description": "WASHINGTON (AP) — Donald Trump is again testing the power of his endorsement.With an early morning social media post on Friday, Trump inserted himself into the chaotic race to replace Kevin McCarthy as House speaker by backing Ohio Rep.",
      "publishedAt": "2023-10-07T04:47:17Z",
      "title": "Trump is inserting himself into the messy race to become the next House speaker. Will it matter?",
      "url": "https://apnews.com/77b4f760ff5653344b982fbabeac6ec7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2104e3e52b54577ab6240b928583e1c/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The ad sounds like something out of the GOP 2024 playbook, trumpeting a senator’s work with Republicans to crack down on the flow of fentanyl and other illegal drugs into the U.S., getting tough on Chinese interests helping smugglers, and noting how he \"wrote a bill signed by Donald Trump to increase funding for Border Patrol.”",
      "publishedAt": "2023-10-07T04:59:52Z",
      "title": "Biden faces more criticism about the US-Mexico border, one of his biggest problems heading into 2024",
      "url": "https://apnews.com/646f656dbfecf268f0cb182c74ad47ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54a0bf698d9042b2982932e779f5e0af/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and JOANNA KOZLOWSKA",
      "description": "HROZA, Ukraine (AP) — U.N. and local investigators searched for answers on Saturday at the site of a Russian missile strike on a small Ukrainian village that days earlier turned its sole cafe to rubble and killed nearly 52 people gathered for a dead soldier’s wake, according to President Volodymyr Zelenskyy and other top officials in Kyiv.",
      "publishedAt": "2023-10-07T17:35:57Z",
      "title": "Days after deadly missile strike on Ukrainian cafe, grief and a search for answers",
      "url": "https://apnews.com/85c312c3ec96a07c6b24fe8ad1b284fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3b69c7934da49ca9ae0cf630a4f1dfc/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and SUSAN HAIGH",
      "description": "HARTFORD, Conn. (AP) — A woman approaches a drop box in the dark with what appears to be handfuls of ballots. At a different drop box, someone else is seen making multiple trips to insert ballots. At yet another, the same car stops on at least three separate occasions, with different people stepping out and heading to the box.",
      "publishedAt": "2023-10-07T14:57:05Z",
      "title": "Drop boxes have become key to election conspiracy theories. Two Democrats just fueled those claims",
      "url": "https://apnews.com/af4751d78f87c8f5aeefc5daa2b1f6a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb58f92984404ebaa4eb2a9cd28fd4b5/3000.jpeg"
    },
    {
      "author": "SOPHIE AUSTIN",
      "description": "SACRAMENTO, Calif. (AP) — Large businesses in California will have to disclose a wide range of planet-warming emissions under a new law Gov. Gavin Newsom signed Saturday — the most sweeping mandate of its kind in the nation.",
      "publishedAt": "2023-10-07T19:58:33Z",
      "title": "California Gov. Gavin Newsom signs law requiring big businesses to disclose emissions",
      "url": "https://apnews.com/fcd2408d66c40330345a06676114551d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02193f90d771453db3222a31c21568b3/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — Six Colombians arrested as the alleged assassins of a candidate in Ecuador's August presidential election were slain Friday inside a prison in Guayaquil, officials announced, without providing details on what happened.",
      "publishedAt": "2023-10-07T04:14:21Z",
      "title": "Six Colombians held in assassination of Ecuador presidential candidate reported slain inside prison",
      "url": "https://apnews.com/e6582c0848c4f3f1c96eb9770d5ebbae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7af925344a4144aead76a9c7f3fb5d42/3000.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM",
      "description": "PENFIELD, Pa. (AP) — In the heart of Pennsylvania elk country, Eric McCarthy and his client, Don Reichel, got up before sunrise to scour the forest floor for so-called “brown gold” — a rack of freshly shed antlers to add to Reichel’s collection back home.",
      "publishedAt": "2023-10-07T04:10:01Z",
      "title": "Witnesses to FBI hunt for Civil War gold describe heavily loaded armored truck, signs of a night dig",
      "url": "https://apnews.com/6b5feca00ebf3e04638a8bbce992809d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b69dfedcfc0f418a94b82834573be600/1920.jpeg"
    },
    {
      "author": "STEPHEN HAWKINS",
      "description": "DALLAS (AP) — Dillon Gabriel knew he couldn’t take a sack as the pocket collapsed around him in the closing seconds of his Red River rivalry debut, the kind of big game he went to Oklahoma to play.",
      "publishedAt": "2023-10-07T20:15:52Z",
      "title": "Boomer Sooner: Gabriel late TD pass as No. 12 Oklahoma beats No. 3 Texas in Red River rivalry",
      "url": "https://apnews.com/e4693ccedcb17bca3a62e8d13ea614e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a873293733864262af3742d3e5b0bee6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}