{
  "articles": [
    {
      "author": null,
      "description": "The United States has attacked three sites in Iran, inserting itself into Israel’s war aimed at destroying the country’s nuclear program in a risky gambit to weaken a longtime foe that prompted fears of a wider regional conflict. Addressing the nation from the White House, President Donald Trump asserted that Iran’s key nuclear sites were “completely and fully obliterated.” There was no independent damage assessment. The Atomic Energy Organization of Iran confirmed that attacks took place on its Fordo, Isfahan and Natanz sites, but it insisted that its nuclear program will not be stopped.",
      "publishedAt": "2025-06-22T05:23:42Z",
      "title": "US strikes 3 Iranian nuclear sites, inserting itself into Israel's war with Iran",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-trump-bomber-news-06-22-2025-c2baca52babe915e033ae175ce8b2687",
      "urlToImage": "https://dims.apnews.com/dims4/default/1be7dd2/2147483647/strip/true/crop/4171x2346+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F15%2F314cca71547ad37865b0e9c0659a%2Febf738c18fbd4b3aba7f9757939ebbd5"
    },
    {
      "author": null,
      "description": "The Trump administration is signaling a willingness to renew talks with Iran and avoid a prolonged war. That's in the aftermath of a surprise attack on three of Iran's nuclear sites as U.S. officials assess Tehran’s nuclear ambitions and the threat of retaliation against American interests. President Donald Trump's national security team spoke for him on Sunday. The coordinated messaging suggested a confidence that any fallout from the attack would be manageable and that Iran’s lack of military capabilities would ultimately force it back to the bargaining table.",
      "publishedAt": "2025-06-22T12:50:48Z",
      "title": "US signals a willingness to renew talks with Iran and avoid a prolonged war",
      "url": "https://apnews.com/article/iran-trump-nuclear-sites-strikes-503eb17f991a8509604b4b3aaf93cb5c",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc67e56/2147483647/strip/true/crop/3897x2192+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F5f%2Fbfb10d38c165c64202a8cdc1b0d1%2F5b9f1f128cbd4b4d95058b3847f681f5"
    },
    {
      "author": null,
      "description": "The price of oil rose and U.S. stock futures fell as global markets react to the U.S. strike against nuclear targets in Iran. The price of Brent crude oil, the international standard, rose 3.9% to $80 a barrel. U.S. crude rose 4.3% to $77 a barrel. Futures for the S&P 500 fell 0.5%. Treasury yields fell slightly. On Saturday, U.S. forces attacked three Iranian nuclear and military sites, further increasing the stakes in the war between Israel and Iran.",
      "publishedAt": "2025-06-22T22:09:05Z",
      "title": "Oil rises and US stock futures slide as markets react to US strike on Iran nuclear sites",
      "url": "https://apnews.com/article/stock-market-oil-iran-attack-2d05b0a9e52320e822b649b8e29d28aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c94d39/2147483647/strip/true/crop/7914x4452+0+414/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F90%2F2eecf142336eabf9d44737a36b3e%2F97ee0a90b79b440581a83c1113dd8e1f"
    },
    {
      "author": null,
      "description": "A Michigan police chief says church staff stopped a man armed with a handgun and a long gun, averting a potential mass shooting at a church west of Detroit. Police Chief Ryan Strong said parishioners at CrossPointe Community Church in Wayne spotted the gunman driving recklessly Sunday morning and then saw him exit his vehicle wearing a tactical vest and carrying the weapons. Strong said the man began firing and that a parishioner struck the suspect with his vehicle. The chief said at least two staff members at the church fatally shot the gunman. Strong said the gunman’s motive remains unclear, but it appears he was suffering from a mental health crisis.",
      "publishedAt": "2025-06-22T16:56:17Z",
      "title": "Suspect shot and killed after shooting at church in Michigan, police say",
      "url": "https://apnews.com/article/wayne-michigan-church-shooting-e207650364395f08c1a31937c4240331",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd6602b/2147483647/strip/true/crop/4200x2363+0+333/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F37%2F1b95181addd2b0c5906510819d60%2F873b4c2b9dd3491892ad446fc34fdd3b"
    },
    {
      "author": null,
      "description": "Tens of millions of people across the eastern and central U.S. are bracing for more days of extreme temperatures as an unusual June heat wave continues to grip parts of the country. National Weather Service forecasts for Sunday call for heat indices in the Chicago area of between 100 and 105 degrees. The heat index in Pittsburgh was expected to reach 105 F. The sweltering temperatures are expected to continue through most of the week.",
      "publishedAt": "2025-06-22T13:43:06Z",
      "title": "Eastern half of U.S. braces for more long days of dangerous heat",
      "url": "https://apnews.com/article/heat-wave-eastern-central-united-states-advisories-d7b93e295c42cdb4787cf95c1f09858b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dc0389/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F16%2Fd60b12f8337ed83489f9c31b951a%2F9377e67aec284343b2e02584945b4d75"
    },
    {
      "author": null,
      "description": "State media says a suicide bomber in Syria has detonated himself inside a church filled with people, killing at least 13. The explosion in Dweil’a in the outskirts of Damascus took place Sunday as people were praying inside the Mar Elias Church. Britain-based war monitor the Syrian Observatory for Human Rights says there were 30 people wounded and killed, but the exact numbers are unclear. Some local media reported that children were among the casualties. The attack was the first of its kind in Syria in years, and comes as Damascus under its de facto Islamist rule is trying to win the support of minorities.",
      "publishedAt": "2025-06-22T16:45:02Z",
      "title": "Suicide bomber kills at least 13 in Syrian church near Damascus during Mass",
      "url": "https://apnews.com/article/syria-church-attack-damascus-mass-da2ed505d6625fce1fc9de9e88c200a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/74cdbd7/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2Fe3%2F8384ad3f789a474cdda45d043eb3%2Fd3851078d95042518c04594c307d6dcb"
    },
    {
      "author": null,
      "description": "A Tennessee judge has ordered Kilmar Abrego Garcia’s release from jail while he awaits a federal trial on human smuggling charges, but he is not expected to be allowed to go free. Prosecutors at his June 13 detention hearing had said that U.S. Immigration and Customs Enforcement would take him into custody if he were released on the criminal charges. He could be deported before he has a chance to stand trial. Abrego Garcia is a citizen of El Salvador whose mistaken deportation has become a rallying point for opposition to President Donald Trump’s immigration policies. He has pleaded not guilty to the charges.",
      "publishedAt": "2025-06-22T22:59:29Z",
      "title": "Judge orders Kilmar Abrego Garcia’s release from jail before trial, but ICE plans to detain him",
      "url": "https://apnews.com/article/abrego-garcia-deportation-error-c0a515baffdf54baba412edf4cdbd310",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The International Criminal Court has been asked to review a confidential legal report arguing that the Russia-linked Wagner group has committed war crimes by spreading images of apparent atrocities in West Africa on social media. They include videos alluding to cannibalism. The brief was seen exclusively by The Associated Press. Violence in the Sahel has reached record levels as military governments battle extremist groups linked to al-Qaida and the Islamic State group. Governments have turned from Western allies like the United States and France and instead embraced Russia and its mercenary fighters as partners in offensives.",
      "publishedAt": "2025-06-22T04:47:06Z",
      "title": "Takeaways from AP report Wagner allegedly committing war crimes by promoting atrocities",
      "url": "https://apnews.com/article/wagner-russia-videos-war-crimes-mali-burkina-icc-takeaways-035a63a7e2c82f24c80aa3898388b18a",
      "urlToImage": "https://dims.apnews.com/dims4/default/a980251/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2Fef%2Fbc7fcfdd669e16f0843dc749c2ad%2Fb20423dd927d460c83905f14b044e4b2"
    },
    {
      "author": null,
      "description": "The Houston Rockets are acquiring 15-time All-Star and four-time Olympic gold medalist Kevin Durant from the Phoenix Suns in a blockbuster deal struck Sunday, according to a person with knowledge of the agreement. The Rockets are giving up Dillon Brooks, Jalen Green and six future picks, according to the person who spoke to The Associated Press on condition of anonymity because the deal was still pending NBA approval. It ends weeks of speculation about where Durant would end up. Many teams were involved at various times, including Miami and Minnesota, but in the end Phoenix took the Rockets’ offer.",
      "publishedAt": "2025-06-22T17:14:40Z",
      "title": "Kevin Durant is going from the Suns to the Rockets in a blockbuster trade, AP source says",
      "url": "https://apnews.com/article/kevin-durant-suns-rockets-trade-0f70dd6296c4093cf6b4f27800ba99cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/dda71b0/2147483647/strip/true/crop/5771x3246+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fc8%2Ffc131e015327e3941e795138fcf4%2F0358cd7b582e4d8283f52a9097c2e954"
    },
    {
      "author": null,
      "description": "A landmark U.S. Supreme Court ruling 10 years ago this month, on June 26, 2015, legalized same-sex marriage across the U.S. The Obergefell v. Hodges decision followed years of national wrangling over the issue, during which some states moved to protect domestic partnerships or civil unions for same-sex partners and others declared marriage could exist only between one man and one woman. In plaintiff James Obergefell’s home state of Ohio, voters had overwhelmingly approved such an amendment in 2004 — effectively mirroring the federal Defense of Marriage Act. That laid the political groundwork for the legal challenge that bears his name.",
      "publishedAt": "2025-06-22T12:19:24Z",
      "title": "This week marks 10 years since Supreme Court legalized same-sex marriage nationwide",
      "url": "https://apnews.com/article/samesex-marriage-supreme-court-anniversary-obergefell-hodges-dc87ed0744c292428aaef89f8357b966",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebe8810/2147483647/strip/true/crop/4896x2754+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2F62%2Fd0031ecceaf5ec61b3cba1c0c9af%2Fba604377b78b4a7f97d18ec604ef1273"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}