{
  "articles": [
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is trying to outmaneuver former President Donald Trump and address old vulnerabilities on her policy positions as she starts to fill in how she would govern if elected in November.",
      "publishedAt": "2024-08-13T04:10:04Z",
      "title": "Harris cautiously rolls out policy, aiming to outmaneuver Trump and address 2020 liabilities",
      "url": "https://apnews.com/e606b41cce817e69a38663cc68ce7ad6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1905480e4784449a5079c1e4319ae6d/3000.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "WASHINGTON (AP) — In some corners of the Democratic Party, last week felt like déjà vu.The party's vice-presidential nominee’s military record was under assault from Republicans — attacks reminiscent of those leveled two decades earlier on Sen.",
      "publishedAt": "2024-08-13T11:00:33Z",
      "title": "Will the attacks on Walz's military service stick like they did to Kerry 20 years ago?",
      "url": "https://apnews.com/293e178ca9fe079e879787ee2269899e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e97f3afa6044f03854285556e7e1732/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's threatened retaliatory strike on Israel over the assassination of Hamas official Ismail Haniyeh drew major world powers on Tuesday into a high-wire act of diplomacy.",
      "publishedAt": "2024-08-13T11:37:56Z",
      "title": "Analysis: High-wire diplomacy on possible Iran retaliation in the Israel-Hamas war draws in world",
      "url": "https://apnews.com/0542e5c1367517421f4ef59fb9aed712",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29f21d448ad6490691ea9d51e0e046fb/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring Kursk region, the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.",
      "publishedAt": "2024-08-12T09:24:25Z",
      "title": "Top Ukrainian commander says his forces now control almost 390 square miles of Russia's Kursk region",
      "url": "https://apnews.com/afa42b9613323901bef07800ac2cae9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/511d837f510849558a3f22a73bea2f98/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MEG KINNARD",
      "description": "NEW YORK (AP) — Donald Trump recounted his assassination attempt in vivid detail and promised the largest deportation in U.S. history during a high-profile return to the social media platform formerly known as Twitter — a conversation that was plagued by technical glitches.",
      "publishedAt": "2024-08-12T14:19:34Z",
      "title": "Trump and Musk talk about assassination attempt and deportations during glitchy chat on X",
      "url": "https://apnews.com/83d6d07fc0ffef4151c96fc56aeec9ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/753f2fede2ff4fa781b89575f58b7544/2205.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Former President Donald Trump and Vice President Kamala Harris agree on one thing, at least: Both say they want to eliminate federal taxes on workers’ tips.But experts say there’s a reason Congress hasn’t made such a change already.",
      "publishedAt": "2024-08-13T07:00:24Z",
      "title": "Why Trump's and Harris' proposals to end federal taxes on tips would be difficult to enact",
      "url": "https://apnews.com/9ed6e049a53b1943471ce2b6479b9ffb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4392dea4d3c4543acde0492dc0d3642/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "At least three news outlets were leaked confidential material from inside the Donald Trump campaign, including its report vetting JD Vance as a vice presidential candidate. So far, each has refused to reveal any details about what they received.",
      "publishedAt": "2024-08-13T04:11:48Z",
      "title": "News outlets were leaked insider material from the Trump campaign. They chose not to print it",
      "url": "https://apnews.com/e30bdccbdd4abc9506735408cdc9bf7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24cea06d6f9f4ad1aead3f916e2e4668/3000.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "NORTHFIELD, Ill. (AP) — The students — most with gray hair, some with canes, all at least in their 60s — couldn't believe what they were hearing.“Oh, my God,” whispered a retired college professor.",
      "publishedAt": "2024-08-13T04:21:08Z",
      "title": "Older Americans prepare themselves for a world altered by artificial intelligence",
      "url": "https://apnews.com/bc30958c273af7c79bfe77d321617738",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db111bff9782413192fc04bf67c9635d/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI, AL EMRUN GARJON and SHONAL GANGULY",
      "description": "KHULNA, Bangladesh (AP) — When a mass uprising forced Bangladesh’s longtime prime minister to step down and flee the country last week, a 65-year-old retired auditor who had worked for her political party feared for his life.",
      "publishedAt": "2024-08-13T05:11:06Z",
      "title": "The violence in Bangladesh after Hasina's ouster stirs fear within the country's Hindu minority",
      "url": "https://apnews.com/85fe6619c38e1b07e407441cb054a74e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e33d7c1b6d34356ac4170908f6a495f/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "KOBLENZ, Germany (AP) — Sasha Skochilenko and Sofya Subbotina are planning to get married.",
      "publishedAt": "2024-08-13T04:09:27Z",
      "title": "Russian artist released in swap builds a new life in Germany, now free to marry her partner",
      "url": "https://apnews.com/0bffaa2bfc70db2d63f1ca6bca486d9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec24a74ba117485eb3a3e5d64fa26fad/2860.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}