{
  "articles": [
    {
      "author": "TARA COPP, LOLITA C. BALDOR",
      "description": "President Donald Trump has signed a flurry of executive orders focused on the military. One directs Defense Secretary Pete Hegseth to revise the Pentagon’s policy on transgender troops, likely setting in motion a future ban on their military service. Other orders would roll back diversity programs, create a space-based missile defense system and reinstate troops booted for refusing COVID-19 vaccines. The orders come just after Hegseth began his first day on the job Monday. A transgender ban had been widely expected, and lawyers for transgender troops have already pledged to fight it.",
      "publishedAt": "2025-01-27T15:08:49Z",
      "title": "President Trump directs Pentagon to revise policy on transgender troops",
      "url": "https://apnews.com/article/hegseth-tuskegee-airmen-dei-pentagon-480d932c8bcb4c6056abe78e34010982",
      "urlToImage": "https://dims.apnews.com/dims4/default/11eba85/2147483647/strip/true/crop/6048x3402+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2Fc3%2Fde5078e2789034dc72094982b243%2F12d45a6e7eb24e418686cc51265878da"
    },
    {
      "author": "ELLEN KNICKMEYER, MATTHEW LEE",
      "description": "At least 56 senior officials in the top U.S. aid and development agency have been placed on leave amid an investigation into an alleged effort to thwart President Donald Trump’s orders. U.S. Agency for International Development acting head Jason Gray said Monday in an internal memo obtained by The Associated Press that the move was part of an investigation into possible efforts at the agency to thwart Trump's orders. A current official and a former official at USAID recounted the actions on condition of anonymity for fear of reprisal. The move comes as a sweeping foreign assistance funding freeze by Trump was beginning to shut down U.S.-funded projects around the world.",
      "publishedAt": "2025-01-28T02:19:47Z",
      "title": "Trump administration puts at least 56 senior USAID officials on leave",
      "url": "https://apnews.com/article/trump-usaid-leave-87704eee4897b24a79072e32e3df58a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ab7c96/2147483647/strip/true/crop/3766x2118+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2Fee%2F0997bcaf57345565945c51712359%2Fd3a4fab52dc143bc9473fc6c9b40ff39"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER",
      "description": "The Trump Justice Department says it has fired more than a dozen employees who worked on criminal investigations into President Donald Trump. The abrupt action targeting career prosecutors who worked on special counsel Jack Smith’s team is the latest sign of upheaval inside the Justice Department. It reflects the administration’s determination to purge the government of workers it perceives as disloyal to the president. The move, which follows the reassignment of multiple senior career officials across divisions, was made even though rank-and-file prosecutors by tradition remain in their positions across presidential administrations and are not punished because of their involvement in sensitive investigations.",
      "publishedAt": "2025-01-27T21:53:32Z",
      "title": "Justice Department fires employees involved in Trump prosecutions",
      "url": "https://apnews.com/article/justice-department-special-counsel-trump-046ce32dbad712e72e500c32ecc20f2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b07d255/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F93%2Fd6ffbd1c1cf17c9848a2dcc5265b%2F7e997a51476f4203be3dbd1895cf63fb"
    },
    {
      "author": "ERIC TUCKER, ALI SWENSON, AARON KESSLER",
      "description": "Kash Patel positioned himself as a steadfast Donald Trump loyalist well before the president picked him to run the FBI. An Associated Press review of nearly 100 podcasts that Patel hosted or on which he was interviewed over the last four years reveals how Patel has denigrated the investigations into Trump, sowed doubt in the criminal justice system, criticized the decision-making of the institution he’s been asked to lead and professed sympathy for jailed Jan. 6 rioters. The vast catalog of provocative public statements, sometimes made in the company of like-minded FBI antagonists, provides an unusually extensive record into a nominee’s unvarnished and controversial worldviews.",
      "publishedAt": "2025-01-28T05:03:33Z",
      "title": "Kash Patel’s podcast persona: staunch Trump defender and fierce critic of the FBI he could soon lead",
      "url": "https://apnews.com/article/patel-fbi-trump-maralago-january-6-2db2b3a27adb295df30a9ffa72208688",
      "urlToImage": "https://dims.apnews.com/dims4/default/12d7554/2147483647/strip/true/crop/3596x2023+0+187/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F93%2F26e0a3e2096a3d2580a4bb76095c%2F108189b03e354fcbbf4970978810044a"
    },
    {
      "author": "BILL BARROW",
      "description": "President Donald Trump's second White House is looking a lot like the inside of Mar-a-Lago, with extremely wealthy Americans taking key roles in his administration. The world’s richest man, Elon Musk, is overseeing a new Department of Government Efficiency. Billionaires or mega-millionaires are lined up to run the treasury, commerce, interior and education departments, NASA and the Small Business Administration, and fill key foreign posts. Trump's supporters say it makes sense to hire people who have had great success in the private sector. Others raise concerns about conflicts of interest at odds with Trump’s pledge to fight for “forgotten men and women.”",
      "publishedAt": "2025-01-28T05:11:48Z",
      "title": "A look at billionaires Trump has picked for government posts",
      "url": "https://apnews.com/article/donald-trumps-cabinet-wealth-billionaires-0d5147df74c7f0a851df296aeab2e164",
      "urlToImage": "https://dims.apnews.com/dims4/default/2327c09/2147483647/strip/true/crop/7907x4448+0+412/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2Fa3%2Ff543e3a612282965c87bb3572225%2F148ff18ba9e745e3bc97c2ef0d26cd05"
    },
    {
      "author": "OSAMA SALEH, ABDEL-KAREEM HANA, SAMY MAGDY",
      "description": "Crowds of Palestinians fill Gaza’s main coastal road as they stream north. With their belongings on their backs, they smile, hug and sing, overjoyed at the prospect of returning home after more than a year of war. Ahead of the returning Palestinians lies an uncertain fate. Many of their homes were destroyed as more than 15 months of Israeli bombardment and ground offensive against Hamas have leveled large parts of Gaza City and the surrounding north.",
      "publishedAt": "2025-01-27T15:10:26Z",
      "title": "Northern Gaza is shattered. The spirit of returning Palestinians is not",
      "url": "https://apnews.com/article/israel-palestinians-gaza-war-returning-home-3845051eda5c3f481f5ed8783efc4cbf",
      "urlToImage": "https://dims.apnews.com/dims4/default/a96a8bb/2147483647/strip/true/crop/7333x4125+0+382/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F6b%2F18a76bcb8479abfce30c56f7eed4%2Fa8749b1863bd4f788b508519f6c20b54"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "A week into Donald Trump’s second presidency and his efforts to crack down on illegal immigration, federal officers are operating with a new sense of mission. A dozen officers from Immigration and Customs Enforcement gathered before dawn Monday in a Maryland parking lot, then fanned out to the Washington suburbs to find their targets: someone wanted in El Salvador for homicide, a person convicted of armed robbery in Maryland, a migrant found guilty of possessing child sexual abuse material and another with drug and gun convictions. All were in the country illegally. The Associated Press accompanied the officers, who offered a glimpse of how their work has changed.",
      "publishedAt": "2025-01-28T05:06:53Z",
      "title": "Immigration officers say 'the worst go first,' but now there's no 'free pass'",
      "url": "https://apnews.com/article/immigration-trump-border-security-enforcement-ice-cb40a6a7e2d94582aa0774be47a8ab36",
      "urlToImage": "https://dims.apnews.com/dims4/default/9d8e6fd/2147483647/strip/true/crop/4679x2632+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F89%2F22cf176b3c6d0a0b8bb9eadb9ac2%2Fa880db8272f0445685a25137344fdd3f"
    },
    {
      "author": "JOVANA GEC",
      "description": "Serbia’s populist Prime Minister Milos Vucevic has resigned following weeks of massive anti-corruption protests over the deadly collapse of a concrete canopy in November. The collapse, which killed 15 people, has become a flashpoint for broader dissatisfaction with Serbia’s authoritarian rule, reflecting growing public demands for transparency. Vucevic’s resignation is likely to lead to an early parliamentary election. On Monday, tens of thousands of people joined striking university students in a 24-hour blockade of a key traffic intersection in the Serbian capital.",
      "publishedAt": "2025-01-28T10:30:50Z",
      "title": "Serbia's prime minister resigns and appeals for calm as anti-corruption protests grow",
      "url": "https://apnews.com/article/serbia-protests-vucevic-resigns-b71e3a0aacf5d0368b2bd1f4500170f5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d98351e/2147483647/strip/true/crop/5026x2827+0+262/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2Fe2%2Ffd9e7f1929b7abb84b2530c1e2cc%2F1b3786aeaf1642128107da0498387974"
    },
    {
      "author": "TAMMY WEBBER",
      "description": "As Gaza residents return to what is left of their homes, they're facing new risks on top of monumental health challenges. The 15-month war, which has killed more than 47,000 people and displaced most of the population of 2.3 million, left a health system in shambles and large swaths of the territory reduced to rubble. A shortage of clean water and damaged sewer systems have spurred worries over the spread of infectious disease. Now aid groups are rushing to provide food and supplies amid a fragile ceasefire between Israel and Hamas while planning the best way forward.",
      "publishedAt": "2025-01-27T19:26:01Z",
      "title": "Huge health challenges face Gaza residents returning to their homes",
      "url": "https://apnews.com/article/gaza-health-water-sewer-rubble-hospital-a52e9d55316adb8681b96554835342cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef42c99/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fe9%2Fd8aa6b8943cd2f4fe9ee0e28801e%2F3d9701a6a97a4088b29b070335012166"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, JOSEPH KRAUSS",
      "description": "Israel is allowing Palestinians to return to the heavily destroyed north of the Gaza Strip for the first time since the early weeks of the 15-month war with Hamas, in accordance with a fragile ceasefire. Thousands of Palestinians headed north Monday after waiting for days to cross. Associated Press reporters saw people crossing the so-called Netzarim corridor shortly after 7 a.m. The opening was delayed over a dispute between Hamas and Israel, which said the militant group had changed the order of the hostages it released in exchange for scores of Palestinian prisoners.",
      "publishedAt": "2025-01-27T05:17:24Z",
      "title": "Israel allows Palestinians to return to northern Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-27-2025-48a7eb98d6900cdf24b32ea93b5bc584",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bdabcc/2147483647/strip/true/crop/5600x3150+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2Fa8%2F14b1f8312da084bb77558eb9ce26%2Fd5b82bd14a594a9394636c146d2b81ad"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}