{
  "articles": [
    {
      "author": "Mohammed Jahjouh, Sarah El Deeb",
      "description": "Malnutrition and hunger are prevelant in the Gaza strip as Israel’s blockade enters its third month. Shortage of food and supplies has driven the territory toward starvation. Supplies to treat and pervent malnutrition are depeleted and quickly running out as documented cases of malnutrition rise. Some 3,600 children were admitted and treated for acute malnutrition in the past month_ a figure that is likely rising. Parents are running out of options of what to feed their children and where to take fhem to get help. Images of emaciated children are becoming more frequent and hungry children at community kitchens are fighting for food, alongside adults.",
      "publishedAt": "2025-05-03T17:16:25Z",
      "title": "Mothers struggle to feed their children in Gaza",
      "url": "https://apnews.com/article/gaza-israel-palestinians-malnutrition-children-f94af55885aadaee7e95b2492fc432e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5869b9a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F8b%2Febdbdb6e9fca1cf859b141fe965c%2F7038c0a7e067409cba5735f2a98dca06"
    },
    {
      "author": "Sam Metz, Akram Oubachir",
      "description": "Morocco's ports have emerged as a flashpoint in protests against the country's decision to normalize ties with Israel. A year and a half of protests have emboldened activists and exposed a gulf between the government and those they govern. Demonstrators from across the political spectrum have taken to the streets to target the country's 4-year-old decision to normalize ties with Israel. Activists accuse the government of disregarding public sentiment and are expanding their targets, which now include the country's strategic ports. Protests swelled this month ahead of the docking of vessels suspected of carrying military cargo as part of a program that includes Israel.",
      "publishedAt": "2025-05-04T04:10:06Z",
      "title": "Protesters want Morocco to sever ties with Israel, so they're targeting strategic ports",
      "url": "https://apnews.com/article/morocco-protests-ports-israel-palestinians-0e16988c3d5e30233382f32d6adbbc03",
      "urlToImage": "https://dims.apnews.com/dims4/default/a8973c8/2147483647/strip/true/crop/5293x2977+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F20%2F4e73c8585b2139a458a8f7954b5f%2F5c93e12846044da98bcc61a21f9f073e"
    },
    {
      "author": "Stephen Mcgrath",
      "description": "Romanians are casting ballots in a critical presidential election redo after last year’s annulled vote plunged the European Union and NATO member country into its worst political crisis in decades. Eleven candidates are vying for the presidency and a May 18 runoff is expected. A median of local polls suggests George Simion, a MAGA-style hard-right nationalist, will emerge as the frontrunner, likely pitting him against Bucharest Mayor Nicusor Dan, or the governing coalition’s candidate Crin Antonescu.",
      "publishedAt": "2025-05-04T04:06:10Z",
      "title": "Romanians vote in a presidential redo after voided election sparked deep political crisis",
      "url": "https://apnews.com/article/romania-election-presidential-crisis-e6ce0a674cf88bfc02c505482dc2497b",
      "urlToImage": "https://dims.apnews.com/dims4/default/0fb034b/2147483647/strip/true/crop/8255x4643+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F48%2Fea37723412b67674d2c8afc2a3b7%2Faef99b9566ae4698b14b3434fbe35f2c"
    },
    {
      "author": "Nicole Winfield",
      "description": "While Pope Francis accomplished a lot in his 12-year papacy, he left much unfinished business and many challenges for his successor — from the Vatican’s disastrous finances to the wars raging on multiple continents. When the conclave’s cardinals finish casting their ballots in the Sistine Chapel, the 267th pope will have to decide whether to continue with Francis’ policies, radically change them, or abandon them altogether. He also must choose what new projects will take precedence. Among the pressing issues are the role of women in the church, the division between traditionalists and progressives, what to do about clergy sex abuse and whether to LGBTQ+ Catholics.",
      "publishedAt": "2025-05-04T04:07:31Z",
      "title": "Pope Francis left unfinished business after a 12-year papacy. What challenges await the next pope?",
      "url": "https://apnews.com/article/pope-conclave-challenges-lgbtq-women-sex-abuse-e73199910f1723282b91984f207ad5a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/f48f1ce/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F25%2F5444d9ca67d9af32c8136104ca03%2F02b6f038ebff4275a12503eed7f3bb20"
    },
    {
      "author": "Giada Zampano",
      "description": "It was the mounting rage of citizens in Viterbo, a small town north of Rome, that ended the longest papal election in the Catholic Church’s history, forging for the first time the word “conclave.” The Viterbo election in the 13th century was a pivotal event in papal history, lasting almost three years due to deep divisions among the cardinals over the name of the new pope. Viterbo is also considered the birthplace of the modern conclave, where cardinals are confined to a single place until they elect a new pontiff and often need to negotiate to reach a compromise on the final name.",
      "publishedAt": "2025-05-04T04:08:04Z",
      "title": "A roofless palace in Italy's Viterbo hosted the first and longest conclave",
      "url": "https://apnews.com/article/italy-vatican-conclave-history-viterbo-7cc4bad440f694c7c4f5e5cd0dcf31ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d3d0c2/2147483647/strip/true/crop/3000x1688+0+29/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F98%2F0aa7e7a260e29b88295a6076d3fa%2Fa60e89272e8944a8a0a2cf920556f1a9"
    },
    {
      "author": "Nicole Winfield, Jill Colvin",
      "description": "President Donald Trump has posted an artificial intelligence-generated image of himself dressed as pope. The social media post comes as the mourning of Pope Francis continues and the papal conclave is set to begin in a few days. The image is raising eyebrows on social media, at the Vatican, from a group representing Catholic bishops in New York and from Italians. Catholics are in the period of official mourning after Francis' death. Catholic cardinals are due to open the solemn conclave to elect his successor on Wednesday. The death of a pope and election of another is a matter of utmost solemnity for Catholics",
      "publishedAt": "2025-05-03T17:38:29Z",
      "title": "Trump draws criticism with AI image of himself as the pope",
      "url": "https://apnews.com/article/trump-pope-francis-conclave-ai-image-bishops-9d88286886c350c4465f7c2afb7a5e41",
      "urlToImage": "https://dims.apnews.com/dims4/default/53247ad/2147483647/strip/true/crop/3911x2200+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F33%2Fd3b153cd6acfd8416776c628da4f%2F2476823162114b2ea4d0a9a75056f92b"
    },
    {
      "author": "Rod McGuirk",
      "description": "Australia’s re-elected Prime Minister Anthony Albanese on Sunday was greeted by well-wishers at a Sydney café and said the country had voted for unity over division. Albanese’s center-left Labor Party won an emphatic victory in elections on Saturday. As vote counting continued, the government was on track to win at least 85 seats in the 150-seat House of Representatives, the lower chamber where parties need a majority to form an administration. Labor held 78 seats in the previous Parliament, and gaining seats in a second term is rare in Australian politics. Albanese told reporters on Sunday: “The Australian people voted for unity rather than division.” Opposition leader Peter Dutton lost his parliamentary seat. His coalition was reduced to 37 seats.",
      "publishedAt": "2025-05-04T03:46:39Z",
      "title": "Australia's re-elected prime minister says voters chose unity over division",
      "url": "https://apnews.com/article/australia-prime-minister-albanese-reelected-vote-parliament-2170ea57868334125b5a359e5f557c02",
      "urlToImage": "https://dims.apnews.com/dims4/default/dbc38bb/2147483647/strip/true/crop/7351x4135+0+383/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F56%2F6924ba4459c00c12483424d1d874%2F24cbd8bd728849b79232430eead981bd"
    },
    {
      "author": "Josh Funk",
      "description": "Warren Buffett has shocked an arena full of his shareholders by announcing that he wants to retire at the end of the year. Buffett said he will recommend to Berkshire Hathaway’s board that Greg Abel should become CEO at the end of the year. Previously the 94-year-old investor has always said he had no plans to retire. But Abel has been his designated successor for years, and Abel has already been managing all of Berkshire's non-insurance businesses.",
      "publishedAt": "2025-05-03T12:55:19Z",
      "title": "Warren Buffett says he wants to retire from Berkshire Hathaway at end of year",
      "url": "https://apnews.com/article/warren-buffett-berkshire-hathaway-shareholders-annual-meeting-a421061233f99859673fb131ce020d4d",
      "urlToImage": "https://dims.apnews.com/dims4/default/3915b4e/2147483647/strip/true/crop/2237x1258+0+120/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F18%2F7540d4d8dd95aff54dedf5718b1e%2F9435d146cce44a59ad84beb0a939cf42"
    },
    {
      "author": null,
      "description": "Mexico's president has said that U.S. President Donald Trump proposed sending American troops into Mexico to help her administration fight drug trafficking but that she rejected it. The remarks by Claudia Sheinbaum came in response to a Wall Street Journal article published the day before, describing a tense phone call last month in which Trump reportedly pressured her administration to accept a bigger role for the U.S. military in combating drug cartels in Mexico. Sheinbaum recounted the call to her supporters at an event in eastern Mexico, saying: “You know what I said to him? ‘No, President Trump ... Sovereignty is not for sale.”",
      "publishedAt": "2025-05-03T22:16:13Z",
      "title": "Mexico's president says she rejected Trump's plan to send US troops across the border",
      "url": "https://apnews.com/article/mexico-trump-sheinbaum-us-migration-5223b4afa52a7da1011cff86aaa41e86",
      "urlToImage": "https://dims.apnews.com/dims4/default/cbeed87/2147483647/strip/true/crop/3482x1959+0+181/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2Fdd%2F5c4979c29f5852a033ae7d56086b%2Fd9a9149b4bdd4a1da2e726162bf110ee"
    },
    {
      "author": "Makiya Seminera",
      "description": "International students in the U.S. are reconsidering their travel plans this summer after a wave of student status terminations and visa revocations. Even before students suddenly began losing permission to study in the U.S., some colleges were encouraging international students and faculty to postpone travel, citing government efforts to deport students involved in pro-Palestinian activism and worries of potential travel bans. As the scale of the status terminations emerged in recent weeks, more have cautioned against non-essential travel abroad for international students. University of California, Berkeley has issued an advisory saying upcoming international travel was risky due to “strict vetting and enforcement.”",
      "publishedAt": "2025-05-04T04:06:57Z",
      "title": "International students in the US skip travel amid visa crackdown",
      "url": "https://apnews.com/article/international-students-visa-f1-travel-sevis-trump-3458f226541c08a693182798287bc8d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/a052d0d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2F9d%2Fb7b6f71440a7fe2811c5bf060c88%2Fe690c558e0314229a1ccd17437f3f6b4"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}