{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden will shift this week from focusing on campaigning for reelection to hosting a NATO summit.",
      "publishedAt": "2024-07-08T04:04:34Z",
      "title": "Biden's focus shifts to this week's NATO summit. But questions about his campaign may only intensify",
      "url": "https://apnews.com/a8bc46963b56f13d7cc780d715e1727c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84477606872a4daf85a2c80c56f0c6fe/2628.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Deeply torn over President Joe Biden’s candidacy, Democratic lawmakers return to Washington at a pivotal moment as they decide whether to work to revive his campaign or edge out the party leader, a make-or-break time for his reelection and their own political futures.",
      "publishedAt": "2024-07-08T04:06:38Z",
      "title": "Biden's uncertain political future divides Democrats as they return to Capitol Hill",
      "url": "https://apnews.com/16c222f825558db01609605b3ad9742a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/622abf9cef934d2abaee51078fc957b6/3000.jpeg"
    },
    {
      "author": "MARK VANCLEAVE and VALERIE GONZALEZ",
      "description": "MATAGORDA, Texas (AP) — Power outages are mounting along the Texas coast after Beryl came ashore Monday and lashed Houston with heavy rains and powerful winds as the storm moved inland.Nearly 1 million homes and businesses were without power hours after Beryl made landfall, according to CenterPoint Energy in Houston.",
      "publishedAt": "2024-07-08T04:30:46Z",
      "title": "Beryl makes landfall in Texas as a Category 1 hurricane, knocking out power to more than 750,000",
      "url": "https://apnews.com/7dfd5353671ee30d0c6d11518ea5a370",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fd859c9319541389ea860e7195580c1/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — A major Russian missile attack across Ukraine killed at least 28 people and injured almost 100 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.",
      "publishedAt": "2024-07-08T08:09:28Z",
      "title": "A major Russian missile attack on Ukraine kills at least 28 people and hits a children's hospital",
      "url": "https://apnews.com/33aecd50cf252ff6184c0c14f90588b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/485af56767b346c29e96c190b18c19ac/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Several officials in the Middle East and the U.S. believe the level of devastation in the Gaza Strip caused by a nine-month Israeli offensive likely has helped push Hamas to soften its demands for a cease-fire agreement.",
      "publishedAt": "2024-07-08T06:16:45Z",
      "title": "Gaza destruction likely helped push Hamas to soften cease-fire demands, several officials say",
      "url": "https://apnews.com/a8b9cc1aeebf6471cd8ef9e7198cddf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee39fbf0afc04a7a9a9776f27b6038d6/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET and LORI HINNANT",
      "description": "PARIS (AP) — French President Emmanuel Macron refused the resignation of the country’s prime minister, asking him on Monday to remain temporarily as the head of the government after chaotic election results left the government in limbo.",
      "publishedAt": "2024-07-08T07:33:57Z",
      "title": "France's Macron keeps prime minister in place for \"stability of the country\" after chaotic election",
      "url": "https://apnews.com/32fe723ea2a592e7ce243f68a89729a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58b7661f4240424daba20ee93ef5c9c7/3000.jpeg"
    },
    {
      "author": "RYAN DOAN-NGUYEN",
      "description": "NEW YORK (AP) — Ruben Berrios knows the scorching truth: When it comes to extreme heat, where you live can be a matter of life and death.The 66-year-old lives in Mott Haven, a low-income neighborhood in New York’s South Bronx, where more than 90 percent of residents are Latino or Black.",
      "publishedAt": "2024-07-08T04:06:38Z",
      "title": "Scorched by history: Discriminatory past shapes heat waves in minority and low-income neighborhoods",
      "url": "https://apnews.com/23a2bdc8fdd392c2ecd39a370fb90f9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/214ff704b3c24193b179bf3fbc447f56/3000.jpeg"
    },
    {
      "author": "ALAN SUDERMAN and JULIET LINDERMAN",
      "description": "WASHINGTON (AP) — Kash Patel was recruiting foot soldiers.It was a Friday morning in February at one of America’s biggest conservative conventions, and Donald Trump’s trusted lieutenant was on center stage, pleading with the former president’s supporters to help the now presumptive Republican nominee reclaim the White House.",
      "publishedAt": "2024-07-08T04:02:01Z",
      "title": "Fight with Kash: Trump loyalist mythologizes former president while building his own brand",
      "url": "https://apnews.com/fc624ab286c19a498d85a66e6e7198fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b715aafce4d4f668bd60d36f6349f9c/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and ALANNA DURKIN RICHER",
      "description": "Boeing will plead guilty to a criminal fraud charge stemming from two crashes of 737 Max jetliners that killed 346 people after the government determined the company violated an agreement that had protected it from prosecution for more than three years, the Justice Department said Sunday night.",
      "publishedAt": "2024-07-08T04:00:19Z",
      "title": "Boeing accepts a plea deal to avoid a criminal trial over 737 Max crashes, Justice Department says",
      "url": "https://apnews.com/245a38dc6d3082f4ddff1f6f74f274f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/180158e6d3ad41a68b44fa5aa60b4fa4/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "A New Mexico judge is setting the table for the involuntary manslaughter trial of actor Alec Baldwin in the fatal shooting of a cinematographer on the set of a Western movie.",
      "publishedAt": "2024-07-08T04:00:50Z",
      "title": "Pretrial hearing sets stage for Alec Baldwin's arrival in court in fatal shooting of cinematographer",
      "url": "https://apnews.com/7111ebd9d360a261eade601b5e4ec297",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ee5c8590f40495c9d2b14a6b0fcc681/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}