{
  "articles": [
    {
      "author": "RIAZ KHAN and MUNIR AHMED",
      "description": "PESHAWAR, Pakistan (AP) — Army commandos using helicopters and a makeshift chairlift rescued eight people from a broken cable car as it dangled hundreds of meters (feet) above a canyon Tuesday in a remote, mountainous part of Pakistan, authorities said.",
      "publishedAt": "2023-08-22T08:51:49Z",
      "title": "Rescuers save 8 people trapped in cable car dangling above canyon in Pakistan",
      "url": "https://apnews.com/9028d31f14de15ba3089549f4a971286",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55a701e475054fea8131bf9c5560723f/3000.jpeg"
    },
    {
      "author": "JOHN HANNA and JIM SALTER",
      "description": "MARION, Kan. (AP) — Newly released video shows the 98-year-old mother of a Kansas newspaper publisher confronting police officers as they searched her home in a raid that has drawn national scrutiny, at one point demanding: “Get out of my house!”",
      "publishedAt": "2023-08-22T14:27:35Z",
      "title": "'Get out of my house!' Video shows 98-year-old mother of Kansas newspaper publisher upset amid raid",
      "url": "https://apnews.com/4427af3241da82767deb76028836cffd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02ec40a690e149f38bdbc2932480fe08/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — John Eastman, the conservative attorney who pushed a plan to keep Donald Trump in power, turned himself in to authorities Tuesday on charges in the Georgia case alleging an illegal plot to overturn the former president’s 2020 election loss.",
      "publishedAt": "2023-08-22T14:09:33Z",
      "title": "Attorney John Eastman surrenders on charges in Trump's Georgia 2020 election subversion case",
      "url": "https://apnews.com/7641b5c61dbcc39ee3f0edbe51558925",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d970afd1e64f4ed0aaf6a66b2f617dcc/1920.jpeg"
    },
    {
      "author": "ALI SWENSON and AYANNA ALEXANDER",
      "description": "NEW YORK (AP) — Donald Trump’s aggressive response to his fourth criminal indictment in five months follows a strategy he has long used against legal and political opponents: relentless attacks, often infused with language that is either overtly racist or is coded in ways that appeal to racists.",
      "publishedAt": "2023-08-22T04:05:06Z",
      "title": "How Trump's attacks on prosecutors build on history of using racist language and stereotypes",
      "url": "https://apnews.com/04b69a8f3e4873eadb03c132cdee09c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6787c9a3d4e14b0b93a45214a1bca919/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An ambitious but failed attempt by Russia to return to the moon after nearly half a century has exposed the massive challenges faced by Moscow's once-proud space program.",
      "publishedAt": "2023-08-22T16:08:44Z",
      "title": "A failed lunar mission dents Russian pride and reflects deeper problems with Moscow's space industry",
      "url": "https://apnews.com/33c9884c907998f06bf9562be6d47445",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74d20ee13a4e40c590fdd0447f595a12/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — Donald Trump won't be on the Republican debate stage Wednesday.",
      "publishedAt": "2023-07-30T12:03:16Z",
      "title": "Who's in, who's out, who's boycotting: The 8 candidates expected on-stage for the first GOP debate",
      "url": "https://apnews.com/863ffb85147072c4e9cf021e85d4ba1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68df3bf526114e7f99cf918f9d454d2b/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A nightmarish summer of wildfires for Greece took its deadliest turn yet on Tuesday when firefighters found the burned bodies of 18 people near the city of Alexandroupolis.",
      "publishedAt": "2023-08-22T18:46:28Z",
      "title": "Wildfires torment Greece. California digs out from Hilary. What to know in extreme weather now",
      "url": "https://apnews.com/75bb651a37f24885e74c1f84f7da0b77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a15759f6055546b293a57a7276a3605b/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un severely rebuked his premier and other senior officials over what he called their irresponsible response to recent flooding of farmlands along the country's western coast, state media reported Tuesday.",
      "publishedAt": "2023-08-22T11:12:35Z",
      "title": "North Korea's Kim lambasts premier over flooding, in a possible bid to shift blame for economic woes",
      "url": "https://apnews.com/2cacebe8c7b7c3021a13001ede1c428b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e52437f58b8249c68f36b9386b2ecfe7/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Kerry Washington and Martin Sheen, a pair of fictional former politicos, turned Hollywood's strikes into a rousing campaign rally Tuesday with speeches celebrating unity across the industry and with labor at large.",
      "publishedAt": "2023-08-22T18:57:37Z",
      "title": "Kerry Washington, Martin Sheen shout for solidarity between Hollywood strikers and other workers",
      "url": "https://apnews.com/70f7f974559b7d87a01aa52a1afc1149",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f095a965f67d43a7807048d2c864c3ed/3000.jpeg"
    },
    {
      "author": "DAVID BRUNAT and JOSEPH WILSON",
      "description": "BARCELONA, Spain (AP) — Spain’s acting prime minister said it was “unacceptable” that the Spanish soccer federation president kissed a player on the lips without her consent, as pressure builds on Luis Rubiales to resign for tarnishing the team’s Women’s World Cup championship.",
      "publishedAt": "2023-08-22T10:39:26Z",
      "title": "Spain's acting prime minister criticizes federation head for kissing player from World Cup champs",
      "url": "https://apnews.com/5bdc4482227493f0c8675ff9528262d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6688843f31c4b899763f3bfcf632e6b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}