{
  "articles": [
    {
      "author": "FARNOUSH AMIRI and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The House voted Friday to reauthorize and reform a key U.S. government surveillance tool following a dramatic showdown on the floor over whether the FBI should be restricted from using the program to search for Americans’ data.",
      "publishedAt": "2024-04-12T01:12:26Z",
      "title": "House passes reauthorization of key US surveillance program after days of upheaval over changes",
      "url": "https://apnews.com/6798869fa141a13329c24245c64fd14f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b097ab9a557a46218dadf1fa9db3337a/3000.jpeg"
    },
    {
      "author": "LEKAN OYEKANMI and ACACIA CORONADO",
      "description": "BRENHAM, Texas (AP) — A Texas semitrailer driver rammed a stolen 18-wheeler through the front of a public safety building where his renewal for a commercial driver’s license had been rejected, killing one person and injuring 13 others, authorities said Friday.",
      "publishedAt": "2024-04-12T17:17:07Z",
      "title": "1 dead and 13 injured in semitrailer crash at a Texas public safety office, with the driver jailed",
      "url": "https://apnews.com/01e0ca6e824bdc3fad2402f238d64fed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86fdc55afd2649c2890a1740e742eae7/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — China has surged sales to Russia of machine tools, microelectronics and other technology that Moscow in turn is using to produce missiles, tanks, aircraft and other weaponry for use in its war against Ukraine, according to a U.S.",
      "publishedAt": "2024-04-12T18:32:30Z",
      "title": "US intelligence finding shows China surging equipment sales to Russia to help war effort in Ukraine",
      "url": "https://apnews.com/265df843be030b7183c95b6f3afca8ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15cf0061b3454e76a9eed36041b0f35e/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — The judge in Donald Trump's hush money criminal case on Friday turned down the former president’s request to postpone his trial because of publicity about the case.",
      "publishedAt": "2024-04-12T21:46:16Z",
      "title": "Judge declines to delay Trump’s NY hush money trial over complaints of pretrial publicity",
      "url": "https://apnews.com/4c79619c5e89e13d672e070a4244a302",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acbff92bdd4c43c6b363c942ee38d0a0/3000.jpeg"
    },
    {
      "author": "GRAHAM LEE BREWER and AARON MORRISON",
      "description": "For many people old enough to remember O.J. Simpson’s murder trial, his 1995 exoneration was a defining moment in their understanding of race, policing and justice. Nearly three decades later, it still reflects the different realities of white and Black Americans.",
      "publishedAt": "2024-04-12T14:38:28Z",
      "title": "In death, 3 decades after his trial verdict, O.J. Simpson still reflects America's racial divides",
      "url": "https://apnews.com/ead0b750caabfe86fa0cd047efc313b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a475130043754ed38e6775b8a159047d/1988.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "TUCSON, Ariz. (AP) — Former President Donald Trump urged Arizona lawmakers on Friday to swiftly “remedy” the state Supreme Court ruling allowing prosecutors to enforce a near—total abortion ban that he declared anew “went too far.”",
      "publishedAt": "2024-04-12T19:38:07Z",
      "title": "Trump pushes Arizona lawmakers to 'remedy' state abortion ruling that he says 'went too far'",
      "url": "https://apnews.com/0956297a1209bf81f8cf9337ebda3b3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a798b2263a54f7793fc9bf7399ab904/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN, GISELA SALOMON and CHRISTOPHER RUGABER",
      "description": "MIAMI (AP) — Having fled economic and political chaos in Venezuela, Luisana Silva now loads carpets for a South Carolina rug company. She earns enough to pay rent, buy groceries, gas up her car — and send money home to her parents.",
      "publishedAt": "2024-04-12T10:00:49Z",
      "title": "How immigrant workers in US have helped boost job growth and stave off a recession",
      "url": "https://apnews.com/fbd1f2ec89e84fdfaf81d005054edad0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9f67658639a403eb57958b2a1e9b313/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Drug regulators in Europe have found no evidence that popular diabetes and weight-loss drugs like Ozempic and Wegovy are linked to a higher risk of suicidal thoughts or actions. The European Medicines Agency regulatory committee announced the results of its review on Friday.",
      "publishedAt": "2024-04-12T17:50:25Z",
      "title": "No link between Ozempic, Wegovy and suicide, EU drug regulators say",
      "url": "https://apnews.com/3c117169d4c6c1e978e47ce26f62b92e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d64934e529d42b29039ab3d4bad5c53/3000.jpeg"
    },
    {
      "author": "JAKE COYLE and LINDSEY BAHR",
      "description": "Eleanor Coppola, who documented the making of some of her husband Francis Ford Coppola’s iconic films, including the infamously tortured production of “Apocalypse Now,” and who raised a family of filmmakers, has died.",
      "publishedAt": "2024-04-12T22:26:45Z",
      "title": "Eleanor Coppola, matriarch of a filmmaking family, dies at 87",
      "url": "https://apnews.com/d1174964d8fef8a1b63ced6a9387f62b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/788b00e91a5c4347b13c09332b63ad96/3000.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — Los Angeles Dodgers star Shohei Ohtani's former longtime interpreter agreed Friday to undergo court-ordered gambling addiction treatment after federal prosecutors accused him of stealing $16 million from the Japanese baseball player to pay off debts.",
      "publishedAt": "2024-04-12T21:16:41Z",
      "title": "Shohei Ohtani's ex-interpreter, Ippei Mizuhara, must get gambling addiction treatment, judge says",
      "url": "https://apnews.com/a3ca696cbb43567457027564159f1d87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9d7eeb0ab4941508dadc1335d5bc105/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}