{
  "articles": [
    {
      "author": null,
      "description": "LAS VEGAS (AP) — Former Vice President Mike Pence drops his bid for the Republican presidential nomination.",
      "publishedAt": "2023-10-28T18:25:13Z",
      "title": "Former Vice President Mike Pence drops his bid for the Republican presidential nomination",
      "url": "https://apnews.com/80d2bb985abd1bebb1004df61f235e0f",
      "urlToImage": ""
    },
    {
      "author": "ISABEL DEBRE, JULIA FRANKEL and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu told the nation Saturday night that the military has opened a “second stage” in the war against Hamas by sending ground forces into Gaza and expanding attacks from the ground, air and sea.",
      "publishedAt": "2023-10-28T05:34:13Z",
      "title": "Netanyahu says the Gaza war has entered a new stage and will be 'long and difficult'",
      "url": "https://apnews.com/c9bd7ecc5f4a9fe9d46486f66675244c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e26069a15ab4e9a829962cad893452e/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel launched an expanded ground operation on Saturday after knocking out communications and creating a near-blackout of information in the Gaza Strip with increased bombardment and artillery fire overnight.",
      "publishedAt": "2023-10-28T06:45:04Z",
      "title": "Live updates | Israel pounds Gaza strip, dismissing calls for cease-fire",
      "url": "https://apnews.com/3348f0544aa6d66b280c8cab1637a3db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dec698b953ac4fa4b1d7c72b6b2e804d/1920.jpeg"
    },
    {
      "author": "JAKE BLEIBERG, PATRICK WHITTLE and DAVID SHARP",
      "description": "LEWISTON, Maine (AP) — A U.S. Army reservist who opened fire at a Maine bowling alley and a bar earlier this week and killed 18 people purchased his weapons legally, authorities said Saturday, adding he likely launched his rampage as a result of underlying mental health issues.",
      "publishedAt": "2023-10-28T13:53:07Z",
      "title": "Mass killing suspect had mental health issues, purchased guns legally, authorities say",
      "url": "https://apnews.com/a13d50cfcda2d7ce19e7bfb1b64a5cb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d67d7f41f3624083a1c560d8213d4768/1920.jpeg"
    },
    {
      "author": "HOLLY RAMER and MICHELLE R. SMITH",
      "description": "LEWISTON, Maine (AP) — The first loud noise 10-year-old Toni Asselin heard sounded like the thwack of a ball being hit hard across a pool table. She thought the second might have been someone dropping a bowling ball.",
      "publishedAt": "2023-10-28T04:20:20Z",
      "title": "When a man began shooting in Maine, some froze while others ran. Now they're left with questions",
      "url": "https://apnews.com/ebd05706f059bbe482bff6797604df93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a6ef615763d4387a577451d1f5e4426/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — It was neither the place nor the time for a proper goodbye, said Omar Dirawi. Not here, in this dusty field strewn with dead people wrapped in blankets and zipped up in body bags.",
      "publishedAt": "2023-10-28T13:36:51Z",
      "title": "Mass graves, unclaimed bodies and overcrowded cemeteries. The war robs Gaza of funeral rites",
      "url": "https://apnews.com/9b0349ae914e33492c049430e6649c53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cece573df91b492487b9e05a7f097c38/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Jeep maker Stellantis has reached a tentative contract agreement with the United Auto Workers union that follows a template set earlier this week by Ford, two people with knowledge of the negotiations said Saturday.",
      "publishedAt": "2023-10-28T17:12:26Z",
      "title": "AP Sources: Auto workers and Stellantis reach tentative contract deal that follows model set by Ford",
      "url": "https://apnews.com/d32cb38791730c4c92a8b2112c205e59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce7e38ec0e844d7da93f8a09c84e15dc/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — New House Speaker Mike Johnson inherits many of the same problems that bedeviled Republican leaders with far more experience.",
      "publishedAt": "2023-10-28T12:22:00Z",
      "title": "New Speaker Mike Johnson holds favor with conservatives. Can he unite the GOP where others failed?",
      "url": "https://apnews.com/92b118abced14e4b221f3ab0daf4e757",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/902af16961dc4bb3aca61270f18a697c/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An Iranian teenage girl injured weeks ago in a mysterious incident on Tehran's Metro while not wearing a headscarf has died, state media reported Saturday.",
      "publishedAt": "2023-10-28T06:41:33Z",
      "title": "An Iranian teenager injured on Tehran Metro while not wearing a headscarf has died, state media say",
      "url": "https://apnews.com/16c4f49e15dd774121e7498f34bd6622",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b0764608fb94e1ab8b6cf0f90ad29d6/2920.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "ACAPULCO, Mexico (AP) — Government workers and volunteers cleared streets, gas station lines wrapped around the block for what gas was to be had, and some lucky families found food essentials as a more organized relief operation took shape Saturday in Acapulco, four days after Hurricane Otis.",
      "publishedAt": "2023-10-28T05:04:37Z",
      "title": "Relief work begins to take shape in Acapulco as residents continue search for essentials after Otis",
      "url": "https://apnews.com/398e6957c0ea05e857d377d9f9c0b311",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9006f3593a6b42e9b7a83cbbb032ae50/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}