{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A fragile truce between Israel and Hamas held for a fifth day Tuesday, as the militant group released more hostages to delay the expected resumption of the war. Israel came under pressure from the United States to better protect Palestinian civilians in Gaza if its offensive resumes.",
      "publishedAt": "2023-11-28T07:54:01Z",
      "title": "Israel says 12 more hostages have been freed by Hamas and have arrived in Egypt",
      "url": "https://apnews.com/a909a0a0c9c76ce80d1ff3e94bbe2ec4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f063d138e5af48cb8cc953b1fd05ee35/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A fragile truce between Israel and Hamas held for a fifth day Tuesday, as the militant group released more hostages to delay the expected resumption of the war. Israel came under pressure from the United States to better protect Palestinian civilians in Gaza if its offensive resumes.",
      "publishedAt": "2023-11-28T07:54:01Z",
      "title": "Israel says 12 more hostages have been freed by Hamas and have arrived in Egypt",
      "url": "https://apnews.com/a909a0a0c9c76ce80d1ff3e94bbe2ec4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f063d138e5af48cb8cc953b1fd05ee35/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Rosalynn Carter was being memorialized Tuesday with classical music and beloved hymns, some of her favorite Biblical passages, and a rare gathering of all living U.S.",
      "publishedAt": "2023-11-28T10:18:56Z",
      "title": "Rosalynn Carter honored by family, friends, first ladies and presidents -- including husband Jimmy",
      "url": "https://apnews.com/def25a63701d39a1516da25015e48683",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/859966c2bb4242779cb84aa42886c36d/1920.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — The rescue mission was expected to last only a few days. Instead, it took 17 days to reach 41 construction workers who were trapped when a landslide collapsed a mountain tunnel in northern India earlier this month.",
      "publishedAt": "2023-11-28T18:26:23Z",
      "title": "Why it took 17 days for rescuers in India to get to 41 workers trapped in a mountain tunnel",
      "url": "https://apnews.com/314db578600d3fda09ef798d6ccef2f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3eac479e81144e398d39f13e6ec8b171/2819.jpeg"
    },
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "WASHINGTON (AP) — The Biden administration has told Israel that it must work to avoid “significant further displacement” of Palestinian civilians in southern Gaza if it renews its ground campaign aimed at eradicating the Hamas militant group, senior U.S.",
      "publishedAt": "2023-11-28T10:01:26Z",
      "title": "The US tells Israel any ground campaign in southern Gaza must limit further civilian displacement",
      "url": "https://apnews.com/788b05c51b5582b39aeb2466b7825525",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f59bdf788468499da94a907f0ac9228b/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH, JANIE HAR and MICHAEL CASEY",
      "description": "PORTLAND, Ore. (AP) — Tossing tent poles, blankets and a duffel bag into a shopping cart and three wagons, Will Taylor spent a summer morning helping friends tear down what had been their home and that of about a dozen others.",
      "publishedAt": "2023-11-28T05:09:35Z",
      "title": "Cities crack down on homeless encampments. Advocates say that’s not the answer",
      "url": "https://apnews.com/08ff74489ba00cfa927fe1cf54c0d401",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c9a81228b2d424c8dfe17a6ded14bf7/3000.jpeg"
    },
    {
      "author": "ANITA SNOW and THOMAS MACHOWICZ",
      "description": "WENDEN, Ariz. (AP) — A blanket of bright green alfalfa spreads across western Arizona's McMullen Valley, ringed by rolling mountains and warmed by the hot desert sun. Matthew Hancock's family has used groundwater to grow forage crops here for more than six decades.",
      "publishedAt": "2023-11-28T05:08:55Z",
      "title": "Tensions are bubbling up at thirsty Arizona alfalfa farms as foreign firms exploit unregulated water",
      "url": "https://apnews.com/d911d5219c8f41dc44d65fb2af6b04df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8735d652e5b84cba890206343d160861/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — Americans for Prosperity, the political arm of the powerful Koch network, formally endorsed Nikki Haley's presidential campaign on Tuesday, promising to commit its nationwide army of activists — and virtually unlimited funds — to helping Haley defeat former President Donald Trump in the GOP primary contest.",
      "publishedAt": "2023-11-28T15:57:08Z",
      "title": "Nikki Haley wins backing from powerful Koch network as she aims to take on Trump",
      "url": "https://apnews.com/938d932aaf2b9b299c32b4d736aaade4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ab502f7b2984bb3a98eee88b0574c65/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden offered Tuesday to testify publicly before Congress, striking a defiant note in response to a subpoena from Republicans and setting up a potential high-stakes face-off even as a separate special counsel probe unfolds and his father, President Joe Biden, campaigns for reelection.",
      "publishedAt": "2023-11-28T13:43:42Z",
      "title": "Hunter Biden tells Congress he'll testify publicly, setting up a potential high-stakes face-off",
      "url": "https://apnews.com/55f869ddca927941ee3b1659bed2214c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13d2e323bb59456a90b75aaadf14e1f4/3000.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "FRANKFURT, Germany (AP) — German Chancellor Olaf Scholz vowed Tuesday that his government will work “as fast as possible” to solve a budget crisis, but he offered few details on how he would achieve his goals of promoting clean energy and modernizing the struggling economy after a court decision struck down billions in planned spending.",
      "publishedAt": "2023-11-28T05:08:08Z",
      "title": "The worst-performing major economy also faces a budget crisis. Germany's leader vows fixes, but how?",
      "url": "https://apnews.com/d6015679d5c4604f9a16a118bb445983",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7eea3512d7a4aa9858e39915f9f6fb6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}