{
  "articles": [
    {
      "author": null,
      "description": "SEOUL, South Korea (AP) — Actor Lee Sun-kyun of Oscar-winning film 'Parasite' is dead, South Korean emergency office says.",
      "publishedAt": "2023-12-27T03:29:38Z",
      "title": "Actor Lee Sun-kyun of Oscar-winning film 'Parasite' is dead, South Korean emergency office says",
      "url": "https://apnews.com/96d7637130fa14d521da105fe4bbcef9",
      "urlToImage": ""
    },
    {
      "author": "NAJIB JOBAIN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces on Tuesday expanded their ground offensive into urban refugee camps in central Gaza after bombarding the crowded Palestinian communities and ordering residents to evacuate.",
      "publishedAt": "2023-12-26T10:14:15Z",
      "title": "Israeli military says Gaza ground offensive has expanded into urban refugee camps",
      "url": "https://apnews.com/698c895797ccb057d13fe4f68690c98b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/935e561b17da44df8f4f8d820897ae02/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The doctors gave Shaimaa Nabahin an impossible choice: lose your left leg or risk death. The 22-year-old had been hospitalized in Gaza for around a week, after her ankle was partially severed in an Israeli airstrike, when doctors told her she was suffering from blood poisoning.",
      "publishedAt": "2023-12-26T05:11:24Z",
      "title": "Lose a limb or risk death? Growing numbers among Gaza's thousands of war-wounded face hard decisions",
      "url": "https://apnews.com/b5a452bbf2a27364aaff68cc71b51fc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e87025fcc484e9e955a3b6435c7434f/3000.jpeg"
    },
    {
      "author": "ANNE D’INNOCENZIO and HALELUYA HADERO",
      "description": "NEW YORK (AP) — Holiday sales rose this year and spending remained resilient during the shopping season even with Americans wrestling with higher prices in some areas and other financial worries, according to the latest measure.",
      "publishedAt": "2023-12-26T15:50:32Z",
      "title": "Americans ramped up spending during the holidays despite some financial anxiety and higher costs",
      "url": "https://apnews.com/cc87e571ccffbae39110132a4c39a7c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a278bea911140d7b9bfcdae1838592d/3000.jpeg"
    },
    {
      "author": "ALI SWENSON and CHRISTINE FERNANDO",
      "description": "NEW YORK (AP) — Nearly three years after rioters stormed the U.S. Capitol, the false election conspiracy theories that drove the violent attack remain prevalent on social media and cable news: suitcases filled with ballots, late-night ballot dumps, dead people voting.",
      "publishedAt": "2023-12-26T16:37:16Z",
      "title": "As social media guardrails fade and AI deepfakes go mainstream, experts warn of impact on elections",
      "url": "https://apnews.com/6119ee6f498db10603b3664e9ad3e87e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2f59635ce6d462294fe62ac34c4afdc/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "DENVER (AP) — Police said Tuesday they are investigating incidents directed at Colorado Supreme Court justices and providing extra patrols around their homes in Denver following the court's decision to remove former President Donald Trump from the state's presidential primary ballot.",
      "publishedAt": "2023-12-26T18:34:08Z",
      "title": "Police investigating incidents involving Colorado justices after Trump removed from state's ballot",
      "url": "https://apnews.com/3f05d134f8cfa14368107fa9dff97117",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1d5a7d98c3346338223696165d6f84b/3000.jpeg"
    },
    {
      "author": null,
      "description": "SEOUL, South Korea (AP) — Actor Lee Sun-kyun of the Oscar-winning movie “Parasite\" has died, South Korea’s emergency office said Wednesday.Lee was found dead at a car in a central Seoul park on Wednesday, it said.",
      "publishedAt": "2023-12-27T03:00:35Z",
      "title": "Actor Lee Sun-kyun of Oscar-winning film 'Parasite' dies",
      "url": "https://apnews.com/2faacd7290f5b84b6a996705d8351cdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7367a4d36f8a4d8ba319f2732aa323ea/2624.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "ORLANDO, Fla. (AP) — Disney has filed a lawsuit claiming that the oversight government for Walt Disney World, which was taken over by appointees of Gov.",
      "publishedAt": "2023-12-26T20:42:50Z",
      "title": "Disney says in lawsuit that DeSantis-appointed government is failing to release public records",
      "url": "https://apnews.com/9b647df7816ef039eb1ec0085caa2242",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b56a81f04744bea887296c88dbe6f11/3000.jpeg"
    },
    {
      "author": "EDGAR H. CLEMENTE",
      "description": "HUIXTLA, Mexico (AP) — Under a beating sun, thousands of migrants in a caravan continued to trudge through southern Mexico on Tuesday, with some saying they expect nothing good from an upcoming meeting this week between American and Mexican officials about the migrant surge at the U.S.",
      "publishedAt": "2023-12-26T19:22:33Z",
      "title": "Migrant caravan slogs on through southern Mexico with no expectations from a US-Mexico meeting",
      "url": "https://apnews.com/f1cdcb4edd299ea8f6c5c19b30e0d405",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/504d1fae672f44b1ad917b18932a108c/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — For holding a sign outside a courthouse reminding jurors of their right to acquit defendants, a retiree faces up to two years in prison. For hanging a banner reading “Just Stop Oil” off a bridge, an engineer got a three-year prison sentence.",
      "publishedAt": "2023-12-26T05:20:22Z",
      "title": "The right to protest is under threat in Britain, undermining a pillar of democracy",
      "url": "https://apnews.com/616078b918e27d5098890be6f9967b14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f673b1e064e84b36ab034ed8c3f2b106/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}