{
  "articles": [
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is making her first visit to a battleground state Tuesday after locking up enough support from Democratic delegates to win her party's nomination to challenge Republican former President Donald Trump, two days after President Joe Biden dropped his reelection bid.",
      "publishedAt": "2024-07-23T09:02:08Z",
      "title": "Harris visits battleground Wisconsin in first rally as Democrats coalesce around her for president",
      "url": "https://apnews.com/012c6474b8b23960d2cf616e92989a4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6eb84fb99fa4f51a3c7a8c77985868b/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Kamala Harris was greeted by a massive, cheering crowd during the first rally of her newly announced presidential campaign in 2019.",
      "publishedAt": "2024-07-23T11:03:56Z",
      "title": "Kamala Harris is preparing to lead Democrats in 2024. There are lessons from her 2020 bid",
      "url": "https://apnews.com/a87d01db5a152ac88d0945a30494405d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d4128788b1042e39431f0ee40661366/1920.jpeg"
    },
    {
      "author": "CALVIN WOODWARD, MARY CLARE JALONICK, STEPHEN GROVES and ZEKE MILLER",
      "description": "WASHINGTON (AP) — As the formulaic “pass the torch” drumbeat thumped on from lawmakers wanting him to quit the race, President Joe Biden maintained a brave face.",
      "publishedAt": "2024-07-23T04:04:12Z",
      "title": "Biden passed that torch slowly, hanging on until the wheels finally came off",
      "url": "https://apnews.com/f891f5a42a70cb616289e874d79eb103",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd8bb7ae82314ffe948a2383f1aaf3ab/3000.jpeg"
    },
    {
      "author": "JACK JEFFERY, TIA GOLDENBERG and HUIZHONG WU",
      "description": "RAMALLAH, West Bank (AP) — Palestinian factions Hamas and Fatah signed a declaration in Beijing on ending a yearslong rift, the groups said Tuesday, taking a step toward resolving a deep divide which has lingered for years despite repeated attempts at unifying the sides.",
      "publishedAt": "2024-07-23T06:09:04Z",
      "title": "Hamas and Fatah sign declaration in Beijing on ending yearslong rift as war rages in Gaza",
      "url": "https://apnews.com/4bef2615307b656b99cb0e18f6b6d796",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c3d780bc1ab48e8b28b1bec3e6de814/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — The Israeli government has budgeted millions of dollars to protect small, unauthorized Jewish farms in the Israeli-occupied West Bank, underwriting tiny outposts meant to grow into full-fledged settlements, according to an anti-settlement monitoring group.",
      "publishedAt": "2024-07-23T04:07:18Z",
      "title": "Israeli government quietly sends millions to unauthorized West Bank settler outposts",
      "url": "https://apnews.com/b3ebcceeed4ad7ca12292cd390dfd417",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64d36da0d7104238be8df04ca6764249/3000.jpeg"
    },
    {
      "author": "AMANUEL GEBREMEDHIN BIRHANE",
      "description": "ADDIS ABABA, Ethiopia (AP) — At least 157 people were killed in mudslides in a remote part of Ethiopia that has been hit with heavy rainfall, many of them as they tried to rescue survivors of an earlier mudslide, local authorities said Tuesday.",
      "publishedAt": "2024-07-23T07:02:29Z",
      "title": "Death toll in southern Ethiopia mudslides rises to at least 157 as search operations continue",
      "url": "https://apnews.com/cb727bb89150c9d521ccbe2ef1a63f14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d139355240ca4deb862f46010480dd9f/2048.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, FARNOUSH AMIRI and CLAUDIA LAUER",
      "description": "WASHINGTON (AP) — Secret Service Director Kimberly Cheatle said Monday that her agency failed in its mission to protect former President Donald Trump, as lawmakers of both major political parties demanded during a highly contentious congressional hearing that she resign over security failures that allowed a gunman to scale a roof and open fire at a campaign rally.",
      "publishedAt": "2024-07-22T13:39:17Z",
      "title": "Secret Service director, grilled by lawmakers on the Trump assassination attempt, says 'we failed'",
      "url": "https://apnews.com/fabaf9a0e57d5545e5b60f0b2215778f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a096db704a0442791bdcaffc4a1f3fc/3000.jpeg"
    },
    {
      "author": "JOHN O'CONNOR",
      "description": "SPRINGFIELD, Ill. (AP) — Sonya Massey ducked and apologized to an Illinois sheriff’s deputy seconds before he shot the Black woman three times in her home, with one fatal blow to the head, as seen in body camera video released Monday.",
      "publishedAt": "2024-07-22T16:21:41Z",
      "title": "Bodycam video reveals chaotic scene of deputy fatally shooting Sonya Massey, who called 911 for help",
      "url": "https://apnews.com/7a1b433183933ca94f266c0f90753a33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf81de6d5d8b45379388c27f42f9d43e/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH and EDDIE PELLS",
      "description": "Lydia Jacoby was a breakout star in the pool for the United States at the last Summer Games, earning a gold medal in the 100-meter breaststroke and a relay silver.",
      "publishedAt": "2024-07-23T10:00:24Z",
      "title": "Biles, Osaka and Phelps spoke up about mental health. Has anything changed for the Paris Olympics?",
      "url": "https://apnews.com/891c2dc08b59a3ccb0b15ffeca239089",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/058e6a7631554a4abcd78e331c2423c6/3000.jpeg"
    },
    {
      "author": "CORAL MURPHY MARCOS",
      "description": "SAN JUAN, Puerto Rico (AP) — On a recent morning in an Afro-Caribbean community in northeast Puerto Rico, Dr. Pedro Juan Vázquez went door-to-door as part of his medical rounds. He greeted the elderly residents the town with a cheerful “Good afternoon!” and a smile and casually asked if they’d like their vitals taken.",
      "publishedAt": "2024-07-23T04:20:23Z",
      "title": "As doctors leave Puerto Rico in droves, a rapper tries to fill the gaps",
      "url": "https://apnews.com/4f646de54e9e3b8069c0661f231b397a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04f28c474b3247979f50ffdf5cb13778/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}