{
  "articles": [
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Trump is on his way to Davos, where his quest to own Greenland could overshadow his other goals",
      "url": "https://apnews.com/article/trump-davos-housing-greenland-gaza-a2f3f4c18ba321c8025a3e208fc0ddf6",
      "urlToImage": null
    },
    {
      "author": "Rebecca Santana",
      "description": "An Immigration and Customs Enforcement memo obtained by The Associated Press reveals that the agency allows immigration officers to forcibly enter homes to make arrests without a judicial warrant. This change reverses previous guidance and raises concerns about constitutional protections against illegal searches. The memo, signed by ICE’s acting director, states that administrative warrants are sufficient for forced entry if there’s a final order of removal. This policy could face legal challenges and criticism from advocacy groups. Whistleblower Aid, representing two government officials, describes the directive as seemingly unconstitutional and a significant shift in arrest powers. The Associated Press obtained the memo and whistleblower complaint from an official in Congress.",
      "publishedAt": "2026-01-21T21:26:45Z",
      "title": "ICE officers are being told they can enter homes to make arrests without a judge's warrant",
      "url": "https://apnews.com/article/ice-arrests-warrants-minneapolis-trump-00d0ab0338e82341fd91b160758aeb2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/53e35be/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Fe8%2Fbcd3b6f0df8b64cb7e8391258e4c%2Fecd7e2093e1048f484d277a5a60cf423"
    },
    {
      "author": "Jack Brook, Patrick Whittle",
      "description": "An appeals court has suspended a decision that restricts the aggressive tactics of immigration officers in Minnesota. The government persuaded the appeals court to freeze a judge’s ruling that bars officers from using tear gas and taking other steps against peaceful protesters in Minnesota’s Twin Cities. The stay is in effect while the government appeals. Meanwhile, an official in Maine turned down a request for more undercover license plates for U.S. Customs and Border Protection vehicles. The Maine secretary of state cited “abuses of power” during the Trump administration’s immigration crackdown.",
      "publishedAt": "2026-01-21T06:05:09Z",
      "title": "Court allows immigration officers in Minnesota to use tear gas on protesters",
      "url": "https://apnews.com/article/subpoenas-minnesota-investigation-lawsuit-federal-officers-8693014921e7a240108cb7f58dc56a46",
      "urlToImage": "https://dims.apnews.com/dims4/default/1bce204/2147483647/strip/true/crop/4462x2510+0+233/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F8a%2F7cc4d7d4cedc8f1a5d7f30d50530%2Ff5524375f94840a2973bd3cc37d9ef55"
    },
    {
      "author": "Patrick Whittle, Rodrique Ngowi",
      "description": "Maine is seeing an increase in immigration enforcement activity this week. The state's secretary of state has responded by declining to issue more undercover license plates for federal immigration officers. ICE Deputy Assistant Director Patricia Hyde told FOX News that it had made 50 arrests by Tuesday as part of “Operation Catch of the Day” and has more than 1,000 targets in the state. The actions have centered on Portland and Lewiston, the two largest cities in the state. The cities have thousands of residents of African descent, including many from Somalia.",
      "publishedAt": "2026-01-21T20:28:30Z",
      "title": "ICE activity increases in Maine",
      "url": "https://apnews.com/article/maine-ice-immigration-enforcement-778b02cc97e390edbc598def9e6ff317",
      "urlToImage": "https://dims.apnews.com/dims4/default/72bdb69/2147483647/strip/true/crop/5481x3083+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Fc3%2F7d0603e562b0e3a374c0601db297%2F88661de568b1443da510cc3e72d93a21"
    },
    {
      "author": "Stephen Groves, Matt Brown",
      "description": "A House committee has advanced resolutions to hold former President Bill Clinton and former Secretary of State Hillary Clinton in contempt of Congress over the Jeffrey Epstein investigation. The Republican-controlled House Oversight Committee approved the contempt of Congress charges in bipartisan votes. It sets up a potential vote in the House. Democrats were split on the measures. A number of progressive lawmakers called for full transparency in the Epstein investigation even if it meant threatening a former Democratic president if he refuses to testify.",
      "publishedAt": "2026-01-21T12:10:02Z",
      "title": "House panel action to hold Clintons in contempt of Congress over Epstein",
      "url": "https://apnews.com/article/bill-clinton-hillary-clinton-contempt-congress-epstein-6132b63aeb1deb4513e9fa6807ae223c",
      "urlToImage": "https://dims.apnews.com/dims4/default/f855c95/2147483647/strip/true/crop/2421x1362+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2Fd2%2F52ad63273c14656a9c44398069e2%2F19dcd8af36eb440e826f216b7227dea4"
    },
    {
      "author": "Valerie Gonzalez, Jim Vertuno",
      "description": "A former Uvalde schools police officer who was among the first to respond to the mass shooting at a Texas elementary school has been acquitted of criminal charges that he failed his duty to confront the gunman. Adrian Gonzales had faced 29 charges of child abandonment and endangerment and up to two years in prison. A jury acquitted him Wednesday. Prosecutors had alleged at trial that Gonzales abandoned his training and could have stopped the gunman outside Robb Elementary School on May 24, 2022. Gonzales’ lawyers insisted he never saw the gunman before he entered the school. The trial was a rare prosecution of an officer for allegedly failing to act to stop a crime and protect lives.",
      "publishedAt": "2026-01-21T05:01:50Z",
      "title": "Ex-officer acquitted in trial over police response to 2022 mass shooting at Texas school",
      "url": "https://apnews.com/article/uvalde-school-shooting-officer-trial-63c0598465a28955db41ca7cfbc727ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/9070a4d/2147483647/strip/true/crop/1800x1013+0+94/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F3b%2F39dd13077ba7bb3940ac72517174%2Fd23946d02c834365b3c0d396b94e2745"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court seems inclined to keep Federal Reserve governor Lisa Cook in her job, casting doubt on President Donald Trump’s bid to wrest control of the nation’s central bank. The justices heard arguments Wednesday over Trump’s effort to fire Cook based on allegations she committed mortgage fraud, which she denies. No president has fired a sitting governor in the 112-year history of the Fed, which was structured to be independent of day-to-day politics. The true motivation for trying to fire Cook, Trump’s critics say, is the Republican president’s desire to exert control over U.S. interest rate policy. Conservative and liberal justices voiced skepticism over Cook's firing.",
      "publishedAt": "2026-01-21T17:04:45Z",
      "title": "Supreme Court seems inclined to keep Lisa Cook on Fed board",
      "url": "https://apnews.com/article/supreme-court-cook-federal-reserve-powell-a8572f8a1f62cf653e822a64c714d05a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f627324/2147483647/strip/true/crop/3989x2244+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2Fe1%2Fd55984bd637b4ba83def83ee135f%2F4f6eed5209144f2a8b7e15386c490ed3"
    },
    {
      "author": "Seth Borenstein",
      "description": "Meteorologists warn that a stretched polar vortex could bring severe winter weather to much of the United States. This week, warm Arctic waters and cold continental land are combining to send subzero temperatures, heavy snow, and ice across the eastern two-thirds of the country. The frigid conditions are expected to persist through January and into early February. Experts say the atmospheric pattern is set, with the potential for crippling ice and snow. The National Weather Service cautions about power outages and treacherous travel conditions. The Midwest and North could see temperatures as low as 30 degrees below zero.",
      "publishedAt": "2026-01-21T14:47:41Z",
      "title": "A stretched polar vortex is fueling a winter blast coming to the US",
      "url": "https://apnews.com/article/winter-storm-polar-vortex-snow-ice-freezing-06beb5eef46fba3fc81ac3213e5568e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/32717ff/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F39%2Ff75e24c841e1edff4832369cb500%2Ffbc371d44248446d9b06404bfee0b932"
    },
    {
      "author": null,
      "description": "Prime Minister Benjamin Netanyahu of Israel says he's agreed to join Trump’s Board of Peace. Netanyahu made the announcement Wednesday from his office. The announcement came after Israel said the makeup of the Board’s Gaza executive body did not align with Israel’s interests. A statement from Netanyahu’s office said he had accepted Trump’s invitation. The Board of Peace led by U.S. President Donald Trump was originally envisioned as a small group of world leaders overseeing the Gaza ceasefire plan. The Trump administration’s ambitions have ballooned into a more sprawling concept, with Trump extending invitations to dozens of nations and hinting it will soon broker global conflicts, like a pseudo-U.N. Security Council.",
      "publishedAt": "2026-01-21T06:42:13Z",
      "title": "Israel's Netanyahu agrees to join Trump’s Board of Peace",
      "url": "https://apnews.com/article/mideast-wars-gaza-board-of-peace-trump-1-21-2026-2f0e063d03babbd3276f31289ba5f2a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc02f2a/2147483647/strip/true/crop/5473x3079+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F70%2F7e193a65d42a9f6f203fb9c3cc55%2Ff7129cd5a24e4a3e995c2df284e4f9f1"
    },
    {
      "author": "Kamila Hrabchuk",
      "description": "Ukrainian President Volodymyr Zelenskyy says about 4,000 buildings in Kyiv remain without heating, and nearly 60% of the city is without power following days of Russian attacks on Ukraine’s power grid. With temperatures dropping to minus 20 C, the cold winter has worsened the hardship for Ukrainians. U.S. President Donald Trump said at the World Economic Forum in Davos, Switzerland that he would meet Thursday with Zelenskyy, while U.S. special envoy Steve Witkoff plans to discuss peace proposals with Russian President Vladimir Putin. The Ukrainian air force reports Russia launched 97 drones and a ballistic missile overnight.",
      "publishedAt": "2026-01-21T14:26:49Z",
      "title": "Trump to meet with Zelenskyy as Ukraine endures a bitter winter",
      "url": "https://apnews.com/article/russia-ukraine-war-electricity-winter-peace-davos-89c320c8841486398ebc7fdee373d2d2",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6bab80/2147483647/strip/true/crop/5866x3300+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2Fbe%2F19df7d9687eb8d4288bf190cbd93%2F92832a3c556146c5822ce3d1816880ed"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}