{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel intensified its bombardment in and around Gaza's second-largest city early Tuesday, as ambulances and private cars came racing into a local hospital carrying people wounded in a bloody new phase of the war in Gaza.",
      "publishedAt": "2023-12-05T07:53:17Z",
      "title": "Israel strikes in and around Gaza's second-largest city in an already bloody new phase of the war",
      "url": "https://apnews.com/8f171da297b565e28156b88d1fc250b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/775a30fb863042d69dd452fbca0c7fb4/1920.jpeg"
    },
    {
      "author": "LORI HINNANT and SAM McNEIL",
      "description": "NIR OZ, Israel (AP) — The engineer and his family cowered in the safe room, dark except for a red remote-control light because they feared the gunmen outside his door would notice anything brighter.",
      "publishedAt": "2023-12-05T05:20:55Z",
      "title": "'We are officially hostages.' How the Israeli kibbutz of Nir Oz embodied Hamas hostage strategy",
      "url": "https://apnews.com/0c14750240138853a70e38b0c09ef157",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfac1841f142408e9512b5a2bc83c638/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and SIBI ARASU",
      "description": "DUBAI, United Arab Emirates (AP) — After days of shaving off the edges of key warming issues, climate negotiators Tuesday zeroed in on the tough job of dealing with the main cause of what's overheating the planet: fossil fuels.",
      "publishedAt": "2023-12-05T05:21:58Z",
      "title": "To phase out or phase down fossil fuels? That is the question at COP28 climate talks",
      "url": "https://apnews.com/8032ba91ad550004b8d9d90b193a105a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b553da0e848492dbbb8e6ce30ac6761/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden is making a big push to raise money for his reelection effort before the end of the year, appearing at seven events through next Monday — with more to come.",
      "publishedAt": "2023-12-05T05:05:13Z",
      "title": "Biden is spending most of the week raising money at events with James Taylor and Steven Spielberg",
      "url": "https://apnews.com/82caceab4df5ba3ee3112a8991a24fea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71c0ed97c761484b9979fd6d80d6dfa5/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court is taking up a case Tuesday over a Washington couple's $15,000 tax bill that is widely seen as a test of a never-enacted tax on wealth.",
      "publishedAt": "2023-12-05T05:04:03Z",
      "title": "The Supreme Court is taking up a case that could rule out a tax on wealth favored by some Democrats",
      "url": "https://apnews.com/b3535dcc68299ad38a52ff86433f692d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e682d87d748420c8fcb640901b0182c/3000.jpeg"
    },
    {
      "author": "MATTHEW BARAKAT",
      "description": "ARLINGTON, Va. (AP) — A massive explosion at a duplex where police were investigating reports of shots fired shook a Washington, D.C, suburb Monday and destroyed the home.All officers escaped serious injury but it was unclear what happened to the suspect who was inside the home when it was leveled by the explosion, Arlington County, Virginia, police spokesperson Ashley Savage said.",
      "publishedAt": "2023-12-05T02:20:35Z",
      "title": "An explosion leveled a home in Arlington, Virginia, as officers tried to serve a search warrant",
      "url": "https://apnews.com/9a1495ac0ba9e0cd2b1538c17c55b497",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96150bed16e94d33923e16ab16e1103b/1920.jpeg"
    },
    {
      "author": "GRANT PECK",
      "description": "BANGKOK (AP) — An estimated 400 Rohingya Muslims believed to be aboard two boats adrift in the Andaman Sea without adequate supplies could die if more is not done to rescue them, according to the U.N.",
      "publishedAt": "2023-12-05T08:04:15Z",
      "title": "2 boats adrift in the Andaman Sea with 400 Rohingya aboard desperately need rescue, UN says",
      "url": "https://apnews.com/ea2960d4a94d134d7d1bcf113f4d5c66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aeaeecc2a0b54c168aa7741d8311ee9d/3000.jpeg"
    },
    {
      "author": "FOSTER KLUG",
      "description": "TOKYO (AP) — Individually, the photographs are the product of a moment, capturing glimpses of joy, grief, rage, hope, and resilience. As a whole, the work this year of Associated Press photojournalists in Asia forms a visual patchwork quilt, an extraordinary reflection of the varied panoply of human experience in one of the world’s most fascinating regions.",
      "publishedAt": "2023-12-05T05:08:16Z",
      "title": "AP PHOTOS: Photographers in Asia capture the extraordinary, tragic and wonderful in 2023",
      "url": "https://apnews.com/183f6f3dcf4d9c57820fd44422de1a1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71a3f829107c447baad1d16032b8bafb/3000.jpeg"
    },
    {
      "author": "JOVANA GEC, SABINA NIKSIC and ZANA CIMILI",
      "description": "BELGRADE, Serbia (AP) — A man in Bosnia killed his wife and streamed the murder live on Instagram. In neighboring Serbia, 27 women were killed in gender-based attacks this year, despite efforts to raise awareness and reverse the trend.",
      "publishedAt": "2023-12-05T05:09:37Z",
      "title": "Brutal killings of women in Western Balkan countries trigger alarm and expose faults in the system",
      "url": "https://apnews.com/d1496da277dafde5c43d06ef1c580f63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5d2f096247648498bd2e9464551d0da/3000.jpeg"
    },
    {
      "author": "ANNIE MA of The Associated Press and MEREDITH KOLODNER of The Hechinger Report",
      "description": "SALISBURY, Md. (AP) — Three times a week, on average, a police car pulls up to a school in Wicomico County on Maryland’s Eastern Shore. A student is brought out, handcuffed and placed inside for transport to a hospital emergency room for a psychiatric evaluation.",
      "publishedAt": "2023-12-05T05:07:08Z",
      "title": "Handcuffed and sent to the ER – for misbehavior: Schools are sending more kids to the hospital",
      "url": "https://apnews.com/b2ae828a735c50ba562757dfdc7393ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4cd620a485d47fe81566f6cb0d96d4a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}