{
  "articles": [
    {
      "author": "NANCY BENAC",
      "description": "WASHINGTON (AP) — Former Secretary of State Henry Kissinger, the diplomat with the thick glasses and gravelly voice who dominated foreign policy as the United States extricated itself from Vietnam and broke down barriers with China, died Wednesday, his consulting firm said.",
      "publishedAt": "2023-11-30T02:04:35Z",
      "title": "Henry Kissinger, secretary of state under Presidents Nixon and Ford, dies at 100",
      "url": "https://apnews.com/d7d289c3a0b911ed9b863c219cee77e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fed62a9ed7b4d42a1842cd248b816c8/2232.jpeg"
    },
    {
      "author": "FOSTER KLUG",
      "description": "TOKYO (AP) — World leaders and other people offered a polarized reaction Thursday to the death of the lionized and vilified former diplomat Henry Kissinger, who managed to hold global attention decades after his service as U.S.",
      "publishedAt": "2023-11-30T03:35:01Z",
      "title": "Death of Henry Kissinger met with polarized reaction around the world",
      "url": "https://apnews.com/4e98e88ae257d21603924651c75a383d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a661416637b4436291ad6c03f71ea6d5/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Israel released more Palestinian prisoners early Thursday after Hamas freed 16 hostages in the last such swap under the current Gaza truce as international mediators raced to strike a deal to allow further exchanges and prolong the halt of Israel’s air and ground offensive.",
      "publishedAt": "2023-11-29T07:44:26Z",
      "title": "Israel releases more Palestinian prisoners on sixth day of Gaza truce after Hamas frees 16 hostages",
      "url": "https://apnews.com/57e73a26c647ecd97e77afe19c08e077",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/883f54a8ba814e688af94d2b4678c975/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — It has become an Israeli mantra throughout the latest war in Gaza: Hamas is ISIS.Since the bloody Hamas attack on Oct.",
      "publishedAt": "2023-11-29T13:51:52Z",
      "title": "Israel likens Hamas to the Islamic State group. But the comparison misses the mark in key ways",
      "url": "https://apnews.com/29e59446a42d077323a3a216127c4978",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80c8cc03d27948ce8f0a9df864ef87d0/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI and TARA COPP",
      "description": "TOKYO (AP) — Japan plans to suspend its own Osprey flights after a U.S. Air Force Osprey based in Japan crashed into waters off the southern coast during a training mission, officials said Thursday.",
      "publishedAt": "2023-11-30T02:08:18Z",
      "title": "Japan plans to suspend its own Osprey flights after a fatal US Air Force crash of the aircraft",
      "url": "https://apnews.com/be23b708b16a3d3202a944424b7558c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb6b3b91d92743c79de0a15b6189cc24/3000.jpeg"
    },
    {
      "author": "FOSTER KLUG",
      "description": "CHEORWON, South Korea (AP) — To the steady rat-tat-tat of machine guns and exploding bursts of smoke, amphibious tanks slice across a lake not far from the big green mountains that stand along the world’s most heavily armed border.",
      "publishedAt": "2023-11-30T01:10:45Z",
      "title": "South Koreans want their own nukes. That could roil one of the world’s most dangerous regions",
      "url": "https://apnews.com/543e85e5e6832c50ba9dc26a91ef071b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6c8506cab7d46d8952bb1a56c92bd53/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Speaker Mike Johnson expressed reservations Wednesday about expelling Rep. George Santos from the House this week, but said he and other GOP leaders will not push colleagues to oppose removing the New York Republican from office.",
      "publishedAt": "2023-11-29T19:04:43Z",
      "title": "Lawmakers can 'vote their conscience' on expelling Santos, House speaker says, but he has concerns",
      "url": "https://apnews.com/b84a4f00b92825c671b6a91061442865",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bcf8803f6c64e4cbf3499e402f8b852/3000.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "PHOENIX (AP) — Officials in a rural Arizona county who delayed canvassing the 2022 general election results have been criminally charged, the state's top prosecutor said Wednesday.A grand jury in Maricopa County Superior Court has indicted Cochise County supervisors Peggy Judd and Tom Crosby on one count each of conspiracy and interference of an election officer.",
      "publishedAt": "2023-11-29T19:49:19Z",
      "title": "Arizona officials who refused to canvass election results indicted by grand jury",
      "url": "https://apnews.com/58dc66505de5568291224d30f3653cd0",
      "urlToImage": ""
    },
    {
      "author": "LARRY NEUMEISTER and ASHOK SHARMA",
      "description": "NEW YORK (AP) — An Indian government official directed a plot to assassinate a prominent Sikh separatist leader living in New York City, U.S. prosecutors said Wednesday as they announced charges against a man they said was part of the thwarted murder conspiracy.",
      "publishedAt": "2023-11-29T10:24:51Z",
      "title": "Indian official plotted to assassinate Sikh separatist leader in New York, US prosecutors say",
      "url": "https://apnews.com/69968608495e33e8ed88a86bff71b381",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e532be92af8440d7a2c10897536e4953/2000.jpeg"
    },
    {
      "author": "JONATHAN MATTISE",
      "description": "NASHVILLE, Tenn. (AP) — Daryl Hall has accused his longtime music partner John Oates of committing the “ultimate partnership betrayal” by planning to sell his share of the Hall &amp; Oates duo's joint venture without the other's permission, Hall said in a court declaration supporting his lawsuit to keep the transaction paused.",
      "publishedAt": "2023-11-30T00:16:52Z",
      "title": "Daryl Hall accuses John Oates of 'ultimate partnership betrayal' in plan to sell stake in business",
      "url": "https://apnews.com/ad17e6a0997f01bdf760392d1f5e82e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb0be6c91dd44ceba4d810f9af6ee268/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}