{
  "articles": [
    {
      "author": null,
      "description": "BALTIMORE (AP) — Baltimore Police say multiple people have been shot on campus of Morgan State University.",
      "publishedAt": "2023-10-04T02:25:37Z",
      "title": "Baltimore Police say multiple people have been shot on campus of Morgan State University",
      "url": "https://apnews.com/2144eeed712ae47fc40d2bd7e0f9a7b8",
      "urlToImage": ""
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Speaker Kevin McCarthy was voted out of the job Tuesday in an extraordinary showdown — a first in U.S. history, forced by a contingent of hard-right conservatives and throwing the House and its Republican leadership into chaos.",
      "publishedAt": "2023-10-03T15:31:45Z",
      "title": "Speaker McCarthy ousted in historic House vote, as scramble begins for a Republican leader",
      "url": "https://apnews.com/327e294a39f8de079ef5e4abfb1fa555",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc71640783094a33bf392de6be9d96ae/1920.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — Multiple people were shot at Morgan State University in Baltimore on Tuesday, police said. The Baltimore Police Department said officers were on the scene for an “active shooter situation” on the campus of the historically Black university.",
      "publishedAt": "2023-10-04T02:28:32Z",
      "title": "Multiple people have been shot on campus of Morgan State University in Baltimore, police say",
      "url": "https://apnews.com/d1ddf588bdb6b758ae18783fee6c1323",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce7bc3f86f214e07882f76d8ce28ee00/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, BOBBY CAINA CALVAN and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Rebuking Donald Trump, a state court judge imposed a limited gag order Tuesday in the former president’s civil business fraud trial and ordered him to delete a social media post that publicly maligned a key court staffer.",
      "publishedAt": "2023-10-03T04:03:56Z",
      "title": "New York judge issues limited gag order after Trump sends disparaging post about court clerk",
      "url": "https://apnews.com/371675a2482c1de01f516f29b5a43d33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f28ebbd0f33248a8bee1ed616bb37a8b/1920.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — Residents from fire-stricken Lahaina on Tuesday delivered a petition asking Hawaii Gov. Josh Green to delay plans to reopen a portion of West Maui to tourism starting this weekend, saying the grieving community is not ready to welcome back visitors.",
      "publishedAt": "2023-10-04T02:00:40Z",
      "title": "Lahaina residents deliver petition asking Hawaii governor to delay tourism reopening",
      "url": "https://apnews.com/875e9113c6af7aa8d3d563093e5f920c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf892cc1e38e4ae68e53114043709485/3000.jpeg"
    },
    {
      "author": null,
      "description": "JACKSONVILLE, Fla. (AP) — Attorneys for a drug suspect who was repeatedly punched, elbowed and kneed by officers in northeast Florida during a traffic stop said Tuesday that they are petitioning the U.S.",
      "publishedAt": "2023-10-03T20:33:51Z",
      "title": "Suspect in police beating has ruptured kidney, headaches; his attorneys call for a federal probe",
      "url": "https://apnews.com/cb35d416a7de2890c605341bacf3804b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b905e1727e6f451d843d2c8ced7c22a3/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST, CLAUDIA LAUER and RANDALL CHASE",
      "description": "WILMINGTON, Del. (AP) — Hunter Biden pleaded not guilty on Tuesday to three federal firearms charges filed after his earlier deal imploded, setting the case on a track toward a possible trial in 2024 while his father is campaigning for reelection.",
      "publishedAt": "2023-10-03T04:06:27Z",
      "title": "Hunter Biden pleads not guilty to three federal gun charges filed after his plea deal collapsed",
      "url": "https://apnews.com/68b186294bb36071c02428834ec5f470",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c0afd7b3a07470fa6291f5b62da97f5/1920.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — Wall Street fell sharply Tuesday as it focused on the downside of a surprisingly strong job market. The S&amp;P 500 dropped 1.4% to its lowest point in four months. The Dow Jones Industrial Average tumbled 430 points, or 1.3% and wiped out the last of its gains made for the year so far.",
      "publishedAt": "2023-10-03T05:58:04Z",
      "title": "Stock market today: Wall Street buckles under higher bond yields as Dow wipes out gain for the year",
      "url": "https://apnews.com/c7bda0ee7c1bca979a201c45e3e4f891",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cede6fa52c4413385bcd1ddb8c6c4f4/3000.jpeg"
    },
    {
      "author": "GIADA ZAMPANO",
      "description": "ROME (AP) — At least 21 people were killed and 18 injured in a fiery bus crash in Mestre, Italy, just across the Venetian Lagoon from old Venice, where firefighters and other emergency responders worked into the night trying to extract bodies and squelch the flames.",
      "publishedAt": "2023-10-03T19:58:13Z",
      "title": "Bus crash near Venice, Italy, kills at least 21 people, including Ukrainian tourists",
      "url": "https://apnews.com/b4c4ee8c32b5685e40dda9a06f5119c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77a047f550764e2e906726c85d631eda/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and MICHAEL R. BLOOD",
      "description": "WASHINGTON (AP) — Former union leader and Democratic insider Laphonza Butler was sworn in as the newest member of the Senate on Tuesday, replacing California Sen. Dianne Feinstein after her death and becoming only the third Black female senator in history.",
      "publishedAt": "2023-10-03T19:10:54Z",
      "title": "Butler sworn in as third Black female senator in US history, replaces late California Sen. Feinstein",
      "url": "https://apnews.com/eb9e34308d5c307eb44784d663a06e2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9dfd4f87aeaa46f6a3de744a6a2412aa/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}