{
  "articles": [
    {
      "author": "JOEY CAPPELLETTI",
      "description": "LANSING, Mich. (AP) — Vice President Kamala Harris and Minnesota Gov. Tim Walz will spend their first full day as running mates on Wednesday rallying Democrats across the Midwest, a politically divided region that is crucial to their effort to win the White House in less than three months.",
      "publishedAt": "2024-08-07T04:11:52Z",
      "title": "Harris' pick of Walz amps up excitement in Midwestern states where Democrats look to heal divisions",
      "url": "https://apnews.com/d66fad315f34ec68a50c81b118b18480",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f19daafd337402cab54ceb374bd55c4/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, BILL BARROW and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Kamala Harris’ whirlwind process to select Minnesota Gov. Tim Walz as her running mate can be summed up in a word: weird.",
      "publishedAt": "2024-08-07T04:06:19Z",
      "title": "Picking a running mate: Inside the 16 days between Kamala Harris' launch and her choice of Tim Walz",
      "url": "https://apnews.com/a64a91ae84953e880c8d086316d07c54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2583aac165442a49945e00042255d56/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM, JEFFREY COLLINS and JOHN MINCHILLO",
      "description": "CHARLESTON, S.C. (AP) — Tropical Storm Debby is taking a breather Wednesday over the western Atlantic Ocean but it isn’t done dousing the coastal Carolinas before it slowly marches north.",
      "publishedAt": "2024-08-07T04:14:07Z",
      "title": "Tropical Storm Debby swirls over Atlantic, expected to again douse the Carolinas before moving north",
      "url": "https://apnews.com/3d3e634978b9a03790c4e998b20505c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f8f7a0c76244eceb116c327e1a9977c/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Palestinian militant group Hamas chose Yahya Sinwar, its top official in Gaza who masterminded the Oct.",
      "publishedAt": "2024-08-07T06:53:19Z",
      "title": "Israel-Hamas war latest: Hamas chooses Oct. 7 mastermind Yahya Sinwar as their new leader",
      "url": "https://apnews.com/5acd713cd036bb46cbcd1f62000abd4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d49ea1f674ac449993065037faf6d139/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM and SHEIKH SAALIQ",
      "description": "DHAKA, Bangladesh (AP) — Nobel laureate Muhammad Yunus will head Bangladesh's interim government after longtime Prime Minister Sheikh Hasina fled the country amid a mass uprising that left hundreds of people dead and pushed the South Asian nation to the brink of chaos.",
      "publishedAt": "2024-08-06T04:25:51Z",
      "title": "Nobel laureate Yunus will head Bangladesh's interim government after unrest ousted Hasina",
      "url": "https://apnews.com/bca66e8251f86deb3fe28c913d0a1444",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0412490f1ad44e4bc11b8ecb3dc5aaa/1920.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BANGKOK (AP) — A court in Thailand on Wednesday ordered the dissolution of the progressive Move Forward Party, which finished first in last year's general election, saying it violated the constitution by proposing an amendment of a law against defaming the country’s royal family.",
      "publishedAt": "2024-08-07T09:04:13Z",
      "title": "Thai court dissolves progressive Move Forward Party, which won election but was blocked from power",
      "url": "https://apnews.com/e50be1a85aa69f0e3baf4eb0c1bb2ed2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b5c5c90cf8043ccb40647e4c7ed0e9c/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — British police are gearing up for another night of violence amid concerns that far-right groups plan to target as many as 30 locations around the United Kingdom on Wednesday following a week of rioting and disorder.",
      "publishedAt": "2024-08-07T08:50:00Z",
      "title": "UK police prepare for another night of violence as country reels from disorder",
      "url": "https://apnews.com/ec348340c7d223f0117ae8c62638dd6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47aaa2128e754cfb949bda5775a1c3d8/1920.jpeg"
    },
    {
      "author": "E. EDUARDO CASTILLO and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Since Venezuela’s disputed presidential election nine days ago, officials from Brazil, Colombia and Mexico have been in constant contact with representatives of both Venezuelan President Nicolás Maduro and opposition candidate Edmundo González, seeking a solution to the country’s political crisis.",
      "publishedAt": "2024-08-06T15:56:17Z",
      "title": "Brazil, Colombia and Mexico in talks with Venezuelan government and opposition on election crisis",
      "url": "https://apnews.com/39c4b72fe14c34ee63a5b7adc21a9bf9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c3877e6187d4036897dc9796ecfbcc9/3000.jpeg"
    },
    {
      "author": "ISABELLA O'MALLEY and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — During the summer, Levena Lindahl closes off entire rooms, covers windows with blackout curtains and budgets to manage the monthly cost of electricity for air conditioning. But even then, the heat finds its way in.",
      "publishedAt": "2024-08-07T04:03:10Z",
      "title": "Extreme heat is impacting most Americans' electricity bills, AP-NORC poll finds",
      "url": "https://apnews.com/64f1d13bbb6d3523a6cc31d0b4fb14af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f4042bedd2b4b7690136799bbab722b/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "SAINT-DENIS, France (AP) — The race was billed as a bar brawl between the two baddest 1,500-meter runners in the world.Nobody figured the little-known American guy would sneak up on both of them, steal the show and take the Olympic gold medal with him.",
      "publishedAt": "2024-08-06T19:03:13Z",
      "title": "American Cole Hocker pulls Olympic shocker in men's 1,500, leaving Kerr and Ingebrigtsen behind",
      "url": "https://apnews.com/db9c2c2ce8c15801b29fb7c6e1b13e6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1babbd8c173c4b1d9bc66139a872504e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}