{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Gaza medical officials say an apparent Israeli airstrike killed four international aid workers with the World Central Kitchen charity and their Palestinian driver after they helped deliver food and other supplies to northern Gaza that had arrived hours early by ship.",
      "publishedAt": "2024-04-01T05:55:21Z",
      "title": "Gaza medical officials say Israeli strike kills 4 foreign aid workers, driver after delivering food",
      "url": "https://apnews.com/e75cf75aa88a9133774a883d987115c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc6f81e0c1a74386ba7ddd233f242879/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and ALBERT AJI",
      "description": "DAMASCUS, Syria (AP) — An Israeli airstrike that demolished Iran’s consulate in Syria on Monday killed two Iranian generals and five officers, according to Iranian officials. The strike appeared to signify an escalation of Israel’s targeting of military officials from Iran, which supports militant groups fighting Israel in Gaza, and along its border with Lebanon.",
      "publishedAt": "2024-04-01T16:14:18Z",
      "title": "Israeli strike on Iran's consulate in Syria killed two generals, Iranian officials say",
      "url": "https://apnews.com/edca34c52d38c8bc57281e4ebf33b240",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a177dbf6eb74701b25bf9cc68269bc8/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and JILL COLVIN",
      "description": "WASHINGTON (AP) — The video shared by former President Donald Trump features horror movie music and footage of migrants purportedly entering the U.S.",
      "publishedAt": "2024-04-01T04:04:30Z",
      "title": "Why Trump's alarmist message on immigration may be resonating beyond his base",
      "url": "https://apnews.com/327c08045edcc200f850d893de6a79d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41fcda752b744463aafcaf082f4a81de/1920.jpeg"
    },
    {
      "author": "BRENDAN FARRINGTON",
      "description": "TALLAHASSEE, Fla. (AP) — The Florida Supreme Court on Monday cleared the way for the state to ban abortions after six weeks of pregnancy, before many women know they are pregnant, while also giving voters a chance to remove restrictions in November.",
      "publishedAt": "2024-04-01T20:17:58Z",
      "title": "Florida Supreme Court upholds state’s 15-week abortion ban, but voters will soon have a say",
      "url": "https://apnews.com/6a4949fc7459afe9b5e298086a793126",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64a9803d994e429983c5176f2ed25c15/1302.jpeg"
    },
    {
      "author": "LEA SKENE and TASSANEE VEJPONGSA",
      "description": "BALTIMORE (AP) — The U.S. Coast Guard has opened a temporary, alternate channel for vessels involved in clearing debris from the collapsed Francis Scott Key Bridge in Baltimore, part of a phased approach to opening the main shipping channel leading to the vital port, officials said Monday.",
      "publishedAt": "2024-04-01T12:47:13Z",
      "title": "A channel has opened for vessels clearing wreckage at the Baltimore bridge collapse site",
      "url": "https://apnews.com/74e78dc0fbc42ae2780c58719d024952",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0cfa629c2df84d89a0079ded6415df46/1920.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "PHILADELPHIA (AP) — Jazmin Evans had been waiting for a new kidney for four years when her hospital revealed shocking news: She should have been put on the transplant list in 2015 instead of 2019 — and a racially biased organ test was to blame.",
      "publishedAt": "2024-04-01T06:00:18Z",
      "title": "A biased test kept thousands of Black people from getting a kidney transplant. It's finally changing",
      "url": "https://apnews.com/d4fabf2f3a47aab2fe8e18b2a5432135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2c68ddcc058451786d42b9044abeab0/1619.jpeg"
    },
    {
      "author": null,
      "description": "DES MOINES, Iowa (AP) — A $1 billion Powerball jackpot will tempt lottery players Monday night who think they just might hit it rich after three months without a big winner.",
      "publishedAt": "2024-04-01T13:48:34Z",
      "title": "Powerball jackpot reaches $1 billion as drawing for giant prize nears",
      "url": "https://apnews.com/1a1376cec77b6e3c719f443c209ea1c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9894080e9fd64e799b8637c318ecccc8/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "The NCAA said Monday one of the 3-point lines on the court used for the women's basketball regionals in Portland, Oregon, was about 9 inches short of regulation at its apex, a mistake by the contractor that makes the courts used throughout March Madness.",
      "publishedAt": "2024-04-01T18:49:30Z",
      "title": "NCAA says 3-point line drawn 9 inches short at apex for Portland women's regional by court supplier",
      "url": "https://apnews.com/d78742b29b8a48fa3f6b5de7899c7844",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91a0b7bd93124718aff269b4bc5bb9d0/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "CHARLESTON, S.C. (AP) — For maybe the last time, Alex Murdaugh, in a prison jumpsuit instead of the suit he used to wear, shuffled into a courtroom Monday in South Carolina and was sentenced to 40 years in federal prison.",
      "publishedAt": "2024-04-01T04:08:38Z",
      "title": "Alex Murdaugh gets 40 years in federal prison for stealing from clients and his law firm",
      "url": "https://apnews.com/9e7ea455e0400bab01074adf0a949fd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58e3b1c7132a4c4c8cb2b80d46406b95/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Trillions of evolution’s bizarro wonders, red-eyed periodical cicadas that have pumps in their heads and jet-like muscles in their rears, are about to emerge in numbers not seen in decades and possibly centuries.",
      "publishedAt": "2024-04-01T13:52:34Z",
      "title": "Invaders from underground are coming in cicada-geddon. It's the biggest bug emergence in centuries",
      "url": "https://apnews.com/e57f708cdcf144a20fe8f694e95b5d44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e20a9c7d7ba47e2b0b59055bedf9832/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}