{
  "articles": [
    {
      "author": "FARNOUSH AMIRI and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Attorney General Merrick Garland on Wednesday is set to come face-to-face with his most ardent critics as House Republicans prepare to use a routine oversight hearing to interrogate him about what they claim is the “weaponization” of the Justice Department under President Joe Biden.",
      "publishedAt": "2023-09-20T09:02:56Z",
      "title": "Attorney General Garland set to face his GOP critics as Justice Department is under heavy scrutiny",
      "url": "https://apnews.com/df70e290360cde444032f1b75343d941",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10080a7227ce4feebba3f2a3611ae9fa/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN and AAMER MADHANI",
      "description": "NEW YORK (AP) — Prime Minister Benjamin Netanyahu is set to have his long-coveted meeting with President Joe Biden on Wednesday — bringing together the two leaders for the first time since the Israeli leader took office at the helm of his country’s far-right government late last year.",
      "publishedAt": "2023-09-20T04:07:22Z",
      "title": "Israel’s Netanyahu will meet Biden in New York. The location is seen as a sign of US displeasure",
      "url": "https://apnews.com/c6dab3cc0357f67b2054446f3c6cdc52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab81b625331d42478e6539700e518e59/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "KANSAS CITY NATIONAL SECURITY CAMPUS, Mo. (AP) — In an ultra-sterile room at a secure factory in Kansas City, U.S. government technicians refurbish the nation’s nuclear warheads. The job is exacting: Each warhead has thousands of springs, gears and copper contacts that must work in conjunction to set off a nuclear explosion.",
      "publishedAt": "2023-09-20T04:02:40Z",
      "title": "Inside the delicate art of maintaining America's aging nuclear weapons",
      "url": "https://apnews.com/6b86198def4516cebe496c9f5fbfbb75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78118d2bdef540b8a2e44f3e36bc4867/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — India on Wednesday advised its citizens to be careful when traveling to Canada as a rift between the two nations widens further in the wake of Ottawa’s allegations that India may have been involved in the killing of a Sikh separatist leader in suburban Vancouver.",
      "publishedAt": "2023-09-20T11:03:34Z",
      "title": "India asks citizens to be careful if traveling to Canada as rift widens over Sikh leader’s death",
      "url": "https://apnews.com/734a7b46a5c1e3f32472369bd58c2070",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e010ee35b244e4aa5d72ab468b9abee/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israeli military operations in the occupied West Bank and unrest in the Gaza Strip have killed six Palestinians, Palestinian health officials said Wednesday, the latest spike in a wave of violence that has roiled the region for more than a year.",
      "publishedAt": "2023-09-20T06:02:25Z",
      "title": "Six Palestinians are killed in latest fighting with Israel, at least 3 of them militants",
      "url": "https://apnews.com/0454cf65390d6d8c27ddb55d51a083c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa318bf6e82b4e31b89fbe579b8db58b/1920.jpeg"
    },
    {
      "author": "AVET DEMOURIAN",
      "description": "YEREVAN, Armenia (AP) — Azerbaijan and Armenian forces reached a cease-fire agreement Wednesday to end two days of fighting in the separatist Nagorno-Karabakh region that has been a flashpoint for decades, officials on both sides said.",
      "publishedAt": "2023-09-20T07:50:19Z",
      "title": "Azerbaijan and Armenian forces reach cease-fire deal for breakaway Nagorno-Karabakh, officials say",
      "url": "https://apnews.com/73df9b8b03c3748868e2e358b67bd018",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/757c24c76d724431ba3f6720b09bb6eb/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and YOUSEF MURAD",
      "description": "DERNA, Libya (AP) — Abdel-Hamid al-Hassadi survived the devastating flooding in eastern Libya but he lost some 90 people from his extended family.",
      "publishedAt": "2023-09-20T05:02:48Z",
      "title": "Left behind and grieving, survivors of Libya floods call for accountability",
      "url": "https://apnews.com/1a2e0c06e61360580ab1277fdf3dae76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2d967507d354e6ba5077922a6f9fe1f/3000.jpeg"
    },
    {
      "author": "MARÍA TERESA HERNÁNDEZ",
      "description": "SANTIAGO, Chile (AP) — Soon after she learned what happened, Helmut Kramer’s mother grabbed a pair of scissors and cut the priest out of photographs from her son’s baptism.“She kept the photos after that,” said Kramer, who was sexually abused at age 12 in a Jesuit school in Antofagasta, a city in northern Chile.",
      "publishedAt": "2023-09-20T04:04:38Z",
      "title": "In Chile, justice eludes victims of Catholic clergy sex abuse years after the crisis exploded",
      "url": "https://apnews.com/c11f8200a6b64c1b88e1b492cca6d196",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64230c83caf9454c938fc0566758a0f7/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "ALBANY, N.Y. (AP) — As more than 100,000 migrants arrived in New York City over the past year after crossing the border from Mexico, Mayor Eric Adams and Gov.",
      "publishedAt": "2023-09-20T04:07:20Z",
      "title": "Biden's Democratic allies intensify pressure for asylum-seekers to get work permits",
      "url": "https://apnews.com/c173aa553cd4b14ec05ddb2cb56e9e5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bdb5b5d48674af99bcbf30bde912301/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "ATLANTA (AP) — Marc Tyler Nobleman was supposed to talk to kids about the secret co-creator of Batman, with the aim of inspiring young students in suburban Atlanta's Forsyth County to research and write.",
      "publishedAt": "2023-09-20T05:09:13Z",
      "title": "A Batman researcher said 'gay' in a talk to schoolkids. When asked to censor himself, he quit",
      "url": "https://apnews.com/187446af4b03ac9a4b8fc4757852b446",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4cc8d0b46313425e8ed9fd18426169a9/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}