{
  "articles": [
    {
      "author": "ELLIOT SPAGAT",
      "description": "JACUMBA HOT SPRINGS, Calif. (AP) — A group of migrants from China surrendered to a Border Patrol agent in remote Southern California as gusts of wind drowned the hum of high-voltage power lines, joining others from Ecuador, Brazil, Colombia and elsewhere in a desert campsite with shelters made from tree branches.",
      "publishedAt": "2023-09-21T18:30:43Z",
      "title": "After a lull, asylum-seekers adapt to US immigration changes and again overwhelm border agents",
      "url": "https://apnews.com/48790c1ee9f1928a2f3216558e599df4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83a47a5369ba41b997d628e4c78d630b/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — President Volodymyr Zelenskyy worked to shore up U.S. support for Ukraine on a whirlwind visit to Washington on Thursday, delivering an upbeat message on the war's progress while facing new questions about the flow of American dollars that for 19 months has helped keep his troops in the fight against Russian forces.",
      "publishedAt": "2023-09-21T04:04:07Z",
      "title": "Zelenskyy delivers upbeat message to US lawmakers on war progress as some Republican support softens",
      "url": "https://apnews.com/1d20574fb3ea4fb5efcc7db5458a33a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43b5e94667d549e6ae57b0a5de019c8a/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — House Speaker Kevin McCarthy's latest plan to prevent a looming federal shutdown by appeasing his hard-right flank quickly collapsed Thursday, a crushing defeat that makes a disruption in government services almost certain.",
      "publishedAt": "2023-09-21T16:07:51Z",
      "title": "McCarthy gives in to right flank on spending cuts, but they still deliver a defeat as shutdown looms",
      "url": "https://apnews.com/deff84c0e2ff7d3bd076b8c38e14cca4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b1f165fc6ba4a4abd7a0f85c4862ebc/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI and MICHELLE L. PRICE",
      "description": "LANSING, Mich. (AP) — When former President Donald Trump visits Detroit next week, he’ll be looking to blunt criticisms from a United Auto Workers union leadership that has said a second term for him would be a “disaster\" for workers.",
      "publishedAt": "2023-09-21T17:28:36Z",
      "title": "Trump says he always had autoworkers' backs. Union leaders say his first-term record shows otherwise",
      "url": "https://apnews.com/dfcb805fd4e749b13aaf827e1463da73",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/304a396100d74df4ac4cab55efb66662/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Magnate Rupert Murdoch's surprise announcement Thursday that he's stepping down as leader of his two companies leaves his son Lachlan firmly in line of succession at Fox and the rest of the media empire.",
      "publishedAt": "2023-09-21T13:28:43Z",
      "title": "Rupert Murdoch, whose creation of Fox News made him a force in American politics, is stepping down",
      "url": "https://apnews.com/30286a4a3107b7bde612adbfc7891958",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/086aa32db7a9453c886735c66e333952/3000.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM",
      "description": "CHARLESTON, W.Va. (AP) — A federal appeals court is considering cases out of North Carolina and West Virginia that could have significant implications on whether individual states are required to cover health care for transgender people with government-sponsored insurance.",
      "publishedAt": "2023-09-21T18:20:43Z",
      "title": "Appeals court takes up transgender health coverage case likely headed to Supreme Court",
      "url": "https://apnews.com/e59d4b7dec94542aeff186e8f10d7c54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/234f7bcb7d1f413db2c56249c791801a/2225.jpeg"
    },
    {
      "author": null,
      "description": "WAWAYANDA, N.Y. (AP) — A charter bus carrying high school students to a band camp hurtled off a New York highway and down an embankment Thursday, killing one person and hurting dozens of others, officials said.",
      "publishedAt": "2023-09-21T18:52:16Z",
      "title": "Bus carrying high school students to band camp veers off highway, killing 1 and hurting dozens",
      "url": "https://apnews.com/076b1835bdeac2b6d86ebd40ff065911",
      "urlToImage": ""
    },
    {
      "author": "MSTYSLAV CHERNOV and LORI HINNANT",
      "description": "ANDRIIVKA, Ukraine (AP) — The Russian bullet struck the sergeant just above the left ear. The leader of the Ukrainian platoon was down. Headquarters radioed a battlefield promotion to the private who had called him “brother” — a man known as Courier.",
      "publishedAt": "2023-09-21T04:01:26Z",
      "title": "Fighting ‘through hell.’ To reclaim Bakhmut, a Ukrainian brigade must first survive the forest",
      "url": "https://apnews.com/684873be8aad1b1502ff8d67ea48afac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbc04b834bf6473b9cd10be987989fb8/3000.jpeg"
    },
    {
      "author": "JAMES POLLARD and JEFFREY COLLINS",
      "description": "CHARLESTON, S.C. (AP) — Convicted murderer Alex Murdaugh did something Thursday he hasn’t done in the two years since his life of privilege and power started to unravel — plead guilty to a crime.",
      "publishedAt": "2023-09-21T04:12:11Z",
      "title": "Alex Murdaugh pleads guilty to financial crimes — the first time he’s admitted blame to a judge",
      "url": "https://apnews.com/aa2a5b2d06113a213f0c8cec4475f302",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0de6e0960fff4959a16bdf589d4379c7/2573.jpeg"
    },
    {
      "author": "LEANNE ITALIE",
      "description": "NEW YORK (AP) — Lighting for the entertainment industry is Ryan Meyer's lifeblood.Before the Hollywood strikes, he worked 40 hours a week or more as a gaffer or director of photography.",
      "publishedAt": "2023-09-21T14:51:09Z",
      "title": "Side hustles take center stage in paying bills for Hollywood workers on strike",
      "url": "https://apnews.com/81e4986ccd5b52dcf601969f8493275c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f110de159044bd58e0279970a247d48/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}