{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and ISSAM ADWAN",
      "description": "JERUSALEM (AP) — Israeli warplanes hammered the Gaza Strip neighborhood by neighborhood Tuesday, reducing buildings to rubble and sending people scrambling to find safety in the tiny, sealed-off territory now suffering severe retaliation for the deadly weekend attack by Hamas militants.",
      "publishedAt": "2023-10-10T05:16:03Z",
      "title": "Palestinians scramble for safety as Israel pounds sealed-off Gaza Strip to punish Hamas",
      "url": "https://apnews.com/bf6c42f84526c4d9416978c8effd932a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16d19a6a98f54e75b0498e1c4f5ffa87/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — U.S. Rep. George Santos stole the identities of donors to his campaign and then used their credit cards to ring up tens of thousands of dollars in unauthorized charges, according to a new indictment filed Tuesday.",
      "publishedAt": "2023-10-10T21:49:14Z",
      "title": "Rep. Santos faces new charges he stole donor IDs, made unauthorized charges to their credit cards",
      "url": "https://apnews.com/f723e69a777b02a2e6b87595f45c21ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29bb9eaf8c184a2e80fb8986729650e9/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House Republican majority is stuck, one week after the ouster of Speaker Kevin McCarthy, with lawmakers unable to coalesce around a new leader in a stalemate that threatens to keep Congress partly shuttered indefinitely.",
      "publishedAt": "2023-10-10T17:32:10Z",
      "title": "After one week without a House speaker, Republicans appear no closer to choosing a new leader",
      "url": "https://apnews.com/f4173df8025c692a9bc34eccd822de0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/824016aead0c453989dda1d00dd5dff1/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Hurricane Lidia made landfall as an “extremely dangerous” Category 4 storm Tuesday evening with winds of 140 mph (220 kph) near Mexico’s Pacific coast resort of Puerto Vallarta.The U.S.",
      "publishedAt": "2023-10-10T13:35:17Z",
      "title": "Lidia makes landfall as Category 4 hurricane with 140 mph winds near Mexico's Puerto Vallarta resort",
      "url": "https://apnews.com/f64c841d06bcde04469e3e8e07355cf1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/843a4234ff0747e1a5683246b348aa36/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Olympic gymnastics champion Mary Lou Retton has pneumonia and is in intensive care in a Texas hospital.Retton's daughter, McKenna Kelley, shared Retton's condition in an Instagram post on Tuesday.",
      "publishedAt": "2023-10-11T00:01:57Z",
      "title": "Olympic gymnastics champion Mary Lou Retton is in intensive care with pneumonia",
      "url": "https://apnews.com/bb2220659b047242bb8ff9e5e067106a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dddf3589c7bd43feaf041faad4940c48/2154.jpeg"
    },
    {
      "author": "EBRAHIM NOROOZI and OMID HAQJO",
      "description": "ZINDA JAN, Afghanistan (AP) — Clinging to hope that finding survivors was still possible, Afghan rescuers and villagers kept digging through rubble in western Herat province on Tuesday, three days after one of the deadliest earthquakes in the region left more than 2,000 dead.",
      "publishedAt": "2023-10-10T07:30:28Z",
      "title": "Afghans still hope to find survivors from quake that killed over 2,000 in western Herat province",
      "url": "https://apnews.com/825d607d025bff1575cf8f21ac86c019",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4b74632aec3491992201271c4c64a96/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — Charlie Kirk’s $4.75 million Spanish-style estate is tucked away in a gated Arizona country club that charges nearly a half-million dollars for a golf membership. It boasts a guest casita, a “resort-style” pool and striking views of the Sonoran Desert.",
      "publishedAt": "2023-10-10T04:04:36Z",
      "title": "How Trump's MAGA movement helped a 29-year-old activist become a millionaire",
      "url": "https://apnews.com/d08a98e439fa4e902cb756d7e35153db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e9c27283504429b909712f63ba08651/3000.jpeg"
    },
    {
      "author": "KEN SWEET and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Caroline Ellison, the tech executive who ran Sam Bankman-Fried ’s hedge fund while sometimes dating him, testified Tuesday that he directed her to commit crimes before his cryptocurrency empire collapsed last November.",
      "publishedAt": "2023-10-10T17:47:43Z",
      "title": "Star witness Caroline Ellison says FTX founder Sam Bankman-Fried hoped to be US president someday",
      "url": "https://apnews.com/bdab0230730ec079fad8e2086cf9b3f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed4b99a5b46a4d17be0c959e160192e7/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and MIKE HOUSEHOLDER",
      "description": "WAYNE, Mich. (AP) — On the picket lines at a Ford factory west of Detroit, many striking workers don't think the electric vehicle revolution is coming for their jobs — at least not in the near future.",
      "publishedAt": "2023-10-10T10:00:28Z",
      "title": "The future of electric vehicles looms over negotiations in the US autoworkers strike",
      "url": "https://apnews.com/3e5b9a970cdf9b0de9c79fcebe315694",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d326569b5b74046a26d99eeb9f7d30c/1920.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — Greg Marcus has been in the movie business for years but he never expected to be urging moviegoers to take out their phones during a film — let alone to be crafting friendship bracelets in preparation for an opening weekend.",
      "publishedAt": "2023-10-10T17:19:33Z",
      "title": "'Taylor Swift: The Eras Tour' will be a blockbuster — and might shake up the movie business",
      "url": "https://apnews.com/a284a04596c6b71b3de7a9bcf9c83b7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36c6c9f9741a4af88af51992c2a081c9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}