{
  "articles": [
    {
      "author": null,
      "description": "Israel’s military warned people Thursday to evacuate the area around Iran’s Arak heavy water reactor. The warning came in a social media post on X. It included a satellite image of the plant in a red circle like other warnings that proceeded strikes. The Arak heavy water reactor is 155 miles southwest of Tehran. Heavy water helps cool nuclear reactors, but it produces plutonium as a byproduct that can potentially be used in nuclear weapons. That would provide Iran another path to the bomb beyond enriched uranium, should it choose to pursue the weapon. Iran had agreed under its 2015 nuclear deal with world powers to redesign the facility to relieve proliferation concerns.",
      "publishedAt": "2025-06-19T01:44:51Z",
      "title": "Israel’s military warns people to evacuate the area around Iran reactor",
      "url": "https://apnews.com/article/israel-iran-attacks-nuclear-news-06-19-2025-b508817b78ed8d2f6067c1516215cf94",
      "urlToImage": "https://dims.apnews.com/dims4/default/dfa1d67/2147483647/strip/true/crop/4559x2564+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F48%2F19d6eefc601712d491d66529a1e3%2Ffda40aab354741608927ef55ab17879d"
    },
    {
      "author": null,
      "description": "An Iranian missile hit the main hospital in southern Israel early Thursday, wounding people and causing “extensive damage,” the medical facility said. Separate Iranian strikes hit a high-rise apartment building in Tel Aviv and other sites in central Israel. At least 40 people were wounded, according to Israel’s Magen David Adom rescue service. Israel, meanwhile, carried out strikes on Iran’s Arak heavy water reactor, its latest attack on Iran’s sprawling nuclear program. Iranian state TV said the facility had been evacuated before the attack. The seventh day of conflict came a day after Iran’s supreme leader rejected U.S. calls for surrender and warned that any military involvement by the Americans would cause “irreparable damage to them.”",
      "publishedAt": "2025-06-19T04:44:19Z",
      "title": "The Latest: Dozens wounded in Iranian strikes across Israel, as Israel hits Arak reactor site",
      "url": "https://apnews.com/article/israel-palestinians-iran-war-latest-06-19-2025-14b868f4514a7c337d5b9859de130bf0",
      "urlToImage": "https://dims.apnews.com/dims4/default/778df65/2147483647/strip/true/crop/8153x4586+0+424/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2Fcc%2Fe3ef76ec7bf1543b0f14f8e14474%2Fa325c22a5f65431aa6ecf128c74e9323"
    },
    {
      "author": null,
      "description": "Forecasters say Erick has been upgraded to an \"extremely dangerous” Category 4 hurricane near Southern Mexico’s Pacific coast. The Miami-based U.S. National Hurricane Center reported early Thursday that Erick is about 70 miles west-southwest of Puerto Angel, Mexico, and about 90 miles southeast of Punta Maldonado, Mexico. The storm has maximum sustained winds of 145 mph and is moving northwest at 9 mph. Forecasters say Erick is expected to cause potentially destructive winds and life-threatening flash floods over a wide area.",
      "publishedAt": "2025-06-19T04:24:32Z",
      "title": "Erick upgraded to an 'extremely dangerous' Category 4 hurricane, US forecasters say",
      "url": "https://apnews.com/article/hurricane-erick-mexico-pacific-storm-winds-rain-f2e27fe7d8d30a48de2aa2b4cf952c0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0f0260/2147483647/strip/true/crop/4000x2250+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F4b%2F0ba069e7fdab28d666d31b8c8912%2Fa387450b36f74cca8790c5b56e8c01a2"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy is urging greater international pressure on Moscow following a deadly Russian missile strike that hit a Kyiv apartment building this week, killing 23 people. Visiting the site with top officials on Thursday, Zelenskyy called the attack a sign Russia is rejecting ceasefire efforts. He thanked allies ready to push the Kremlin to “feel the real cost of the war.” The strike was part of Russia’s largest assault on Kyiv this year amid a broader offensive along the front line. While Russian President Vladimir Putin has said he’s open to talks on ending the war, he has effectively rejected a U.S. ceasefire offers.",
      "publishedAt": "2025-06-19T09:52:35Z",
      "title": "Zelenskyy calls for more pressure on Russia after deadly Kyiv missile strike",
      "url": "https://apnews.com/article/ukraine-zelenskyy-war-russia-missile-strike-91245843b6ef6f191313686458676b82",
      "urlToImage": "https://dims.apnews.com/dims4/default/2888319/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F6f%2F89af3f1369e5460c100ebd231510%2F8d8b75d654e44dda9ad22884f5bbbf50"
    },
    {
      "author": null,
      "description": "The Supreme Court has upheld Tennessee’s ban on gender-affirming care for transgender minors, a stunning setback to transgender rights. The justices’ 6-3 decision Wednesday effectively protects from legal challenges many efforts by President Donald Trump’s Republican administration and state governments to roll back protections for transgender people. Another 26 states have laws similar to the one in Tennessee. Chief Justice John Roberts writes for a conservative majority the law does not violate the Constitution’s equal protection clause, which requires the government to treat similarly situated people the same. Justice Sonia Sotomayor writes in a dissent joined by her liberal colleagues that the majority “abandons transgender children and their families to political whims.”",
      "publishedAt": "2025-06-18T14:16:57Z",
      "title": "Supreme Court deals stunning setback to transgender rights in Tennessee case",
      "url": "https://apnews.com/article/supreme-court-transgender-health-care-trump-79fc6f3bbdab2e92d6f0184201a468a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7383f15/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fce%2F4101bc6c62f9af0878b853d89b4a%2F5a0e5010145e46e9a0363399a79c13bf"
    },
    {
      "author": null,
      "description": "Jurors in the murder trial of Karen Read say they’ve reached a verdict in a divisive case about the death of a Boston police officer that lawyers have presented as either a tragic love story or a sinister cover-up. Read is accused of fatally striking her boyfriend, Boston police officer John O’Keefe, with her SUV and leaving him to die in the snow outside a house party where other local police and a federal agent were closing out a night of drinking in 2022. If convicted on the most serious charge, she faces life in prison. Jurors began deliberating on June 13 after weeks of often heated testimony from both sides.",
      "publishedAt": "2025-06-18T18:47:16Z",
      "title": "Jury reaches verdict in Karen Read murder trial over death of Boston police boyfriend",
      "url": "https://apnews.com/article/karen-read-murder-trial-police-massachusetts-e636f03f40f3c03f24338d5ba7d40bd1",
      "urlToImage": "https://dims.apnews.com/dims4/default/bab34da/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F87%2Fe24a3672a39091efe0ac2669f712%2F8890c0660c1249f99bf2ab2348a93248"
    },
    {
      "author": null,
      "description": "The Food and Drug Administration has approved the world’s only twice-a-year shot to prevent HIV. In two groundbreaking studies, Gilead Sciences’ shot nearly eliminated new infections in people at high risk of HIV. Wednesday’s approval marks the first step in an anticipated global rollout that experts say could protect millions — if they can get access. Drastic cuts to public health in the U.S. and abroad cloud the prospects.",
      "publishedAt": "2025-06-18T18:52:48Z",
      "title": "FDA approves lenacapavir as a twice-a-year shot to prevent HIV",
      "url": "https://apnews.com/article/hiv-prevention-shot-lenacapavir-gilead-80fb37e2c5ac9b452488d7b86a10d568",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1cf1cf/2147483647/strip/true/crop/4746x2670+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F5e%2Fa3b7192efff5f2323780db56bbaa%2Ff13ebd873e334bd69b0fc6b0819e035a"
    },
    {
      "author": null,
      "description": "A SpaceX rocket being tested in Texas has exploded, sending a dramatic fireball high into the sky. The company says the Starship “experienced a major anomaly” at about 11 p.m. Wednesday while on the test stand at Starbase, SpaceX’s launch site at the southern tip of Texas. The company says in a statement on X that \"all personnel are safe and accounted for.\" SpaceX says there are no hazards to nearby communities. It has asked people not to try to approach the site.",
      "publishedAt": "2025-06-19T06:05:48Z",
      "title": "SpaceX rocket being tested in Texas explodes, but no injuries reported",
      "url": "https://apnews.com/article/spacex-starship-launch-explosion-88b94b223d06b258d3e5a2308b7db2c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d5f210c/2147483647/strip/true/crop/5388x3031+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2Fac%2Fc7d898c6f618f30a7d8770c40290%2F6fe8677645b245b386a61bf067c2adcb"
    },
    {
      "author": null,
      "description": "Congo and Rwanda have committed to signing a peace agreement in Washington on June 27. The move was announced in a joint press release from the two nations and the U.S. Department of State. Both countries have agreed to the terms of the deal aimed at ending fighting in eastern Congo. Congo has accused Rwanda of backing M23 rebels in the east of the country and U.N. experts say the rebels are supported by about 4,000 troops from the neighboring nation. The decades-long conflict escalated in January, when the M23 rebels advanced and seized the strategic Congolese city of Goma, followed by the town of Bukavu in February.",
      "publishedAt": "2025-06-18T23:55:17Z",
      "title": "Congo and Rwanda will sign peace deal on June 27, a major step in ending fighting in eastern Congo",
      "url": "https://apnews.com/article/congo-peace-talks-us-e6c714e70fcd9b5c792824414d01f820",
      "urlToImage": "https://dims.apnews.com/dims4/default/34cc7e3/2147483647/strip/true/crop/5658x3183+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F8a%2F5f274c64d5af329b2e56b720102e%2F5c7ee634891046cdb2cbee2ca639e2e0"
    },
    {
      "author": null,
      "description": "Hackers with possible links to Israel have drained more than $90 million from Iran’s largest cryptocurrency exchange Nobitex and leaked company data. That's according to blockchain analytics firm Elliptic, which said the attack was likely politically motivated. The hacking group that claimed responsibility for the attack has accused Nobitex of having helped Iran’s government evade sanctions and transfer money to militants. While Israeli media have widely reported that Gonjeshke Darande is linked to Israel the country’s government has never officially acknowledged ties to the group. The hacks appear to be motivated by escalating tensions in the Israel-Iran conflict.",
      "publishedAt": "2025-06-19T10:13:46Z",
      "title": "Hackers say they wiped out $90 million from Iran cryptocurrency exchange",
      "url": "https://apnews.com/article/iran-israel-cryptocurrency-hack-data-leak-8febb3c9c2acf4de2894a7a8a92aa88c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}