{
  "articles": [
    {
      "author": "JILL COLVIN and ROB GILLIES",
      "description": "NEW YORK (AP) — President-elect Donald Trump threatened on Monday to impose sweeping new tariffs on Mexico, Canada and China as soon as he takes office as part of his effort to crack down on illegal immigration and drugs.",
      "publishedAt": "2024-11-26T00:27:17Z",
      "title": "Trump threatens to impose sweeping new tariffs on Mexico, Canada and China on first day in office",
      "url": "https://apnews.com/59239afe12033ca99c65c7a2be0e4f0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1ffe008754447c69e8f20222b5dd89f/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — Millions of Americans with obesity would be eligible to have popular weight-loss drugs like Wegovy or Ozempic covered by Medicare or Medicaid under a new rule the Biden administration proposed Tuesday morning.",
      "publishedAt": "2024-11-26T10:16:27Z",
      "title": "Biden proposes Medicare and Medicaid cover costly weight-loss drugs for millions of obese Americans",
      "url": "https://apnews.com/caaa2f888435af1d32bedb83e9ddbc0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55f3ae2339a341439771c497c5c09e92/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The European Union’s top diplomat said Tuesday there were “no excuses” for Israel to refuse to implement a ceasefire with the Lebanese militant group Hezbollah, saying all its security concerns had been addressed in the U.S.-French-brokered deal.",
      "publishedAt": "2024-11-26T10:23:00Z",
      "title": "Middle East latest: EU urges Israel to accept ceasefire deal with Hezbollah",
      "url": "https://apnews.com/7ba526c166a17b51a99e0141e1264f7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f244fd5617c34effa57f4d26f12633f9/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Diplomats and other officials say there have been several sticking points in ceasefire talks to end the war between Israel and the Lebanese militant group Hezbollah, even as conditions for an agreement appear to be ripe.",
      "publishedAt": "2024-11-25T10:55:15Z",
      "title": "What's blocking a ceasefire between Israel and Hezbollah?",
      "url": "https://apnews.com/ce56620463c579a33a4d8b03de035ae3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d32aba491f3457fb60d5364a181a4aa/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Russia launched 188 drones against most regions of Ukraine in a nighttime blitz, the Ukrainian air force said Tuesday, describing it as a record number of drones deployed in a single attack.",
      "publishedAt": "2024-11-26T10:02:12Z",
      "title": "Ukraine says Russian attack sets a new record for the number of drones used",
      "url": "https://apnews.com/4d388b0a02fc3fc785b1a67a6a22ebae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69831f9be36a4a458eaeee4228f59c99/2555.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Supporters seeking the release of imprisoned Pakistani former Prime Minister Imran Khan on Tuesday broke through a ring of shipping containers locking down the capital, Islamabad, while at least six people have died in protest-related violence.",
      "publishedAt": "2024-11-26T04:40:50Z",
      "title": "Imran Khan supporters breach lockdown in Pakistani capital, at least 6 people killed in violence",
      "url": "https://apnews.com/46ea4720c1f4a28326f73f449f21355e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82e503ad656345d7b55017cbffb3e313/1920.jpeg"
    },
    {
      "author": null,
      "description": "MANILA, Philippines (AP) — Philippine authorities handed a subpoena to Vice President Sara Duterte’s office Tuesday, inviting her to answer investigators' questions after she publicly threatened to have the president, his wife and the House of Representatives speaker assassinated if she were killed in an unspecified plot herself.",
      "publishedAt": "2024-11-26T06:53:05Z",
      "title": "Philippine investigators summon VP Duterte over her public threats against President Marcos",
      "url": "https://apnews.com/d1823282709d0693eb502c8165fbb56f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e466d131de83481e8a7b4a6c6745601f/1920.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI",
      "description": "NASHVILLE, Tenn. (AP) — Married couples across the U.S. have had access to no-fault divorce for more than 50 years, an option many call crucial to supporting domestic abuse victims and key to preventing already crowded family courts from drowning in complicated divorce proceedings.",
      "publishedAt": "2024-11-26T05:05:15Z",
      "title": "Proposals to repeal no-fault divorce cause concern even as efforts stall",
      "url": "https://apnews.com/40d6c51bd26b7d8c6a2d4969b21d4b53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aea52a0cc9834238a771bb2ee96b91e6/2011.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — If President-elect Donald Trump makes good on his threat to kill federal tax credits for electric vehicle purchases, it's likely that fewer buyers will choose EVs.Yet tax credits or not, auto companies show no intention of retreating from a steady transition away from gas-burning cars and trucks, especially given the enormous investment they have already made: Since 2021, the industry has spent at least $160 billion on planning, designing and building electric vehicles, according to the Center for Auto Research.",
      "publishedAt": "2024-11-26T08:00:27Z",
      "title": "Auto industry's shift toward EVs is expected to go on despite Trump threat to kill tax credits",
      "url": "https://apnews.com/4751a8f9c5a410126d503b4af7f54285",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0216ed8b386a43cbb8c77c90f08148a4/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Global shares retreated on Tuesday as worries spread over President-elect Donald Trump's comment that he plans to impose sweeping new tariffs on Mexico, Canada and China as soon as he takes office.",
      "publishedAt": "2024-11-26T03:39:51Z",
      "title": "Stock market today: Global shares mostly fall on worries about Trump's tariffs",
      "url": "https://apnews.com/932f970544b216da249e33d8c0491ac8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5f04cb93b704f4f8da9655a207410f6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}