{
  "articles": [
    {
      "author": "JOSH CORNFIELD",
      "description": "LAS VEGAS (AP) — Phish opened its four-night stay at the Sphere Thursday with a four-hour show that used the advanced technology in the $2.3 billion arena to deliver a show that even the band's most ardent fans have never experienced before.",
      "publishedAt": "2024-04-19T21:46:06Z",
      "title": "Here’s how Phish is using the Sphere's technology to give fans something completely different",
      "url": "https://apnews.com/11f85d75b0c34ae89f25b10941df54eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94f367eac1004aff93619b75e3e27f00/3000.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli strikes on the southern Gaza city of Rafah overnight killed 22 people, including 18 children, health officials said Sunday, as the United States was on track to approve billions of dollars of additional military aid to Israel, its close ally.",
      "publishedAt": "2024-04-21T07:19:40Z",
      "title": "Israeli strikes on southern Gaza city of Rafah kill 22, mostly children, as US advances aid package",
      "url": "https://apnews.com/8c027f2587c2c433d0fde41b63a0e0c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6185532ec5c4c6ca3dacd09f8f4a133/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israeli leaders on Sunday harshly criticized an expected decision by the U.S. to impose sanctions on a unit of ultra-Orthodox soldiers in the Israeli military.The decision, expected as soon as Monday, would mark the first time the U.S.",
      "publishedAt": "2024-04-21T17:42:57Z",
      "title": "Israeli leaders criticize expected US sanctions against military unit that could further strain ties",
      "url": "https://apnews.com/dd18e8ebf07b937bdad09ce9b56bd0cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ece4e4b292004f99a2c4093ba1dd567d/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Ukrainian and Western leaders on Sunday welcomed a desperately needed aid package passed by the U.S.",
      "publishedAt": "2024-04-21T08:57:20Z",
      "title": "Ukrainian and Western leaders laud US aid package while the Kremlin warns of 'further ruin'",
      "url": "https://apnews.com/1138337200942ca738ffc28bfc289570",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f54b372c75684d349d36ba49f1eb5891/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — As President Joe Biden and Donald Trump step up their campaigning in swing states, a quieter battle is taking place in the shadows of their White House rematch.The Republican National Committee, newly reconstituted under Trump, has filed election-related lawsuits in nearly half the states.",
      "publishedAt": "2024-04-21T11:21:15Z",
      "title": "Crush of lawsuits over voting in multiple states creates a shadow war for the 2024 election",
      "url": "https://apnews.com/c7d8943dcac776103d948532f62f2a5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8069dfe750094971b61547771782303b/3000.jpeg"
    },
    {
      "author": "BHARATHA MALLAWARACHI",
      "description": "COLOMBO, Sri Lanka (AP) — A race car veered off the track during a competition in Sri Lanka on Sunday and rammed into a crowd of spectators and race officials, killing seven people and injuring 20 others, officials said.",
      "publishedAt": "2024-04-21T18:30:22Z",
      "title": "Race car in Sri Lanka veers off track killing 7 people and injuring 20, officials say",
      "url": "https://apnews.com/3405f02aa1cf1d1096a6579ed82fe441",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ca0c6ec68bb48fb91fafcac99533fbc/3000.jpeg"
    },
    {
      "author": "ANDREW MELDRUM and CHRISTOPHER WEBER",
      "description": "NEW YORK (AP) — Terry Anderson, the globe-trotting Associated Press correspondent who became one of America’s longest-held hostages after he was snatched from a street in war-torn Lebanon in 1985 and held for nearly seven years, has died at 76.",
      "publishedAt": "2024-04-21T21:15:03Z",
      "title": "Terry Anderson, AP reporter abducted in Lebanon and held captive for years, has died at 76",
      "url": "https://apnews.com/c266353298c04dbf874ab4d94536f2b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae1dcf9b515f4d988394dc411fdffa4f/3000.jpeg"
    },
    {
      "author": null,
      "description": "UNIVERSAL CITY, Calif. (AP) — More than a dozen people suffered mostly minor injuries when a tram used for tours crashed into a railing at Universal Studios Hollywood near Los Angeles, authorities and the company said.",
      "publishedAt": "2024-04-21T06:56:55Z",
      "title": "15 people injured when tram collides with guardrail at Universal Studios theme park near Los Angeles",
      "url": "https://apnews.com/24432916e9a5d2273674540e55064bbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/594d2b16a1a14e068cde44d14cbe21df/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — As the sun sets, a burly man bellows into a megaphone while a curious crowd gathers around him. Next to him is a small cardboard box with several banknotes worth 10 Haitian gourdes — about 7 U.S.",
      "publishedAt": "2024-04-21T06:11:17Z",
      "title": "Haitians scramble to survive, seeking food, water and safety as gang violence chokes the capital",
      "url": "https://apnews.com/418c2a9fa54ea42c4d980917e146be3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ce63f0541204a90918e5ffbbafa78fb/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "ROME, Ga (AP) — Instead of traditional maroon and gold Tibetan Buddhist robes, Lama Rod Owens wore a white animal print cardigan over a bright yellow T-shirt with an image of singer Sade, an Africa-shaped medallion and mala beads — the most recognizable sign of his Buddhism.",
      "publishedAt": "2024-04-21T12:01:57Z",
      "title": "Lama Rod describes himself as a Black Buddhist Southern Queen. He wants to free you from suffering",
      "url": "https://apnews.com/506b1e85687d956eff81f7f4261f5e98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7e7fe392080469c8ff440c4df21e7a1/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}