{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, TIA GOLDENBERG",
      "description": "The deadline for the start of a ceasefire in the Gaza Strip has passed. Israeli Prime Minister Benjamin Netanyahu said Sunday that Hamas had not lived up to its commitment to provide the names of the three hostages it was set to release later on Sunday in exchange for scores of Palestinian prisoners. Rear Adm. Daniel Hagari, the top Israeli military spokesman, said the army “continues to attack” and would until Hamas complies with the agreement. Hamas blamed the delay in handing over the names on “technical field reasons.” An Israeli official said mediators have provided assurances that the list will be delivered and the deal is still expected to go forward, though the timing remains in question.",
      "publishedAt": "2025-01-19T05:44:46Z",
      "title": "Gaza ceasefire delayed until Hamas provides names of first hostages, Israel says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-19-2025-437f7f1bf49c9d2936718cf78bdf272c",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e7a25d/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F9c%2Fccafde69596b4a8791084575fd05%2Ff65c384dd88b4224a130e71d6f4cb61c"
    },
    {
      "author": "The Associated Press",
      "description": "A ceasefire in the Gaza Strip took effect on Sunday following an almost three-hour delay. Hamas released three hostages Sunday and Israel released 90 Palestinian prisoners early Monday.",
      "publishedAt": "2025-01-19T10:30:00Z",
      "title": "Live updates: Israel releases 90 Palestinian prisoners as part of ceasefire deal with Hamas",
      "url": "https://apnews.com/live/mideast-israel-gaza-updates-1-19-25#00000194-8101-d5c2-a7fe-8f4f41340000",
      "urlToImage": "https://dims.apnews.com/dims4/default/0548cbb/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2F69%2Fd80a1acf49ea98f588c64cb6da5e%2Fpalestinianprisonerssite.jpg"
    },
    {
      "author": "SAMY MAGDY, WAFAA SHURAFA",
      "description": "Even before the ceasefire deal between Israel and Hamas was fully in place, Palestinians in the war-battered Gaza Strip began to return to the remains of the homes they had evacuated during the 15-month war. They trekked through the wreckage, some on foot and others hauling their belongings on donkey carts. The return of the families comes amid looming uncertainty about whether the ceasefire deal will bring more than a temporary halt to the fighting, who will govern the enclave and how it will be rebuilt. The United Nations has said that reconstruction could take more than 350 years if Gaza remains under an Israeli blockade.",
      "publishedAt": "2025-01-19T12:32:47Z",
      "title": "Palestinians return to the remains of their homes as Gaza ceasefire takes hold",
      "url": "https://apnews.com/article/mideast-ceasefire-gaza-return-home-3942d995e85f0d33539c6625b2cd1ee5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d469c81/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F96%2Fc1b4624d0ed5f405d0466a72ed9e%2F1fef177a13d547158a4c3b8b2afb76d1"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "Three hostages held by Hamas have been released after 471 days in captivity as part of a ceasefire between Israel and the Palestinian militant group. Their release on Sunday will be followed by that of dozens of other captives over the next several weeks under the ceasefire agreement. The truce has sparked hope and trepidation among Israelis. Many fear that the three-phase deal could collapse before all the hostages return, or that they will arrive in poor health. Others worry that the number of captives who have died is more than predicted.",
      "publishedAt": "2025-01-19T13:44:59Z",
      "title": "Who are the Israelis released on the first day of the ceasefire?",
      "url": "https://apnews.com/article/israel-gaza-hamas-hostages-ceasefire-709efbcf93714a562640133d836bb31c",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f2e8b7/2147483647/strip/true/crop/850x478+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F57%2F6a933259db778bd45d73f50e7bc3%2F12dbc01311e24b81bc12e0635b91ac81"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "Israel’s far-right national security minister resigned from Prime Minister Benjamin Netanyahu’s Cabinet to express his disapproval of the Gaza ceasefire deal. The resignation of Itamar Ben-Gvir does not threaten the ceasefire, but it does weaken Netanyahu’s governing coalition. If other far-right lawmakers leave the government — as Ben-Gvir has encouraged them to do — the prime minister could lose his parliamentary majority, potentially forcing early elections. Ben-Gvir opposed the deal because it requires Israel to free hundreds of Palestinian prisoners and to withdraw troops from Gaza’s southern border with Egypt — and because it leaves open the possibility of Hamas staying in power in Gaza.",
      "publishedAt": "2025-01-19T12:10:17Z",
      "title": "Who is Ben-Gvir? The minister resigned from Netanyahu's Cabinet",
      "url": "https://apnews.com/article/itamar-bengvir-resigns-gaza-ceasefire-netanyahu-d63bc4ac1e4f741cafa6fab4d932f891",
      "urlToImage": "https://dims.apnews.com/dims4/default/e97f570/2147483647/strip/true/crop/5479x3082+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F06%2F599ad13bef32a6ed8ca1a5bf59c1%2Fc1e51ab8e930455dae326cdc8bd54b6d"
    },
    {
      "author": "JILL COLVIN, BARBARA ORTUTAY",
      "description": "During his first term as president, Donald Trump led the effort to ban TikTok, the hugely popular video-sharing site he said posed threats to U.S. national security. But on the eve of his return to the White House, the president-elect is being hailed as the app’s savior. The developments over the weekend served as a reminder of how dramatically debates over technology, social media and national security have changed since Trump was last in the White House. It also signaled how closely Trump is following those shifts after waging a successful campaign in which he made inroads with voters in part by harnessing the appeal of some social media platforms.",
      "publishedAt": "2025-01-20T01:47:37Z",
      "title": "Trump's evolution on TikTok: From backing a ban to being hailed as a savior",
      "url": "https://apnews.com/article/trump-tiktok-ban-da11df6d59c17e2c17eea40c4042386d",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ef3fe3/2147483647/strip/true/crop/5150x2897+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Fc3%2F1eb1175f6616a32f5efa83bfaf85%2F368baa94a8bb4a2a9e87f988641da384"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "Immigrants in Chicago and other U.S. cities have been preparing for immigration arrests since President-elect Donald Trump won the November election. Some have left voluntarily. Others have been designating power of attorney to trusted friends, making plans for childcare in case of separations and installing security cameras in case immigration agents come to their door. Word of largescale immigration arrests starting as soon as this week in Chicago and other U.S. cities have triggered fresh waves of anxiety. One Chicago church held a Sunday service in solidarity with immigrants.",
      "publishedAt": "2025-01-19T20:38:23Z",
      "title": "Immigrants in Chicago and other US cities brace for expected Trump deportation arrests",
      "url": "https://apnews.com/article/immigration-deportation-arrests-chicago-cities-enforcement-ee9bd0542e0641cf606a32cef8676b20",
      "urlToImage": "https://dims.apnews.com/dims4/default/f5e2cdf/2147483647/strip/true/crop/5921x3331+0+309/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2Fcb%2F82039b6707d213ceb3613aa66238%2F47842359c0e94455836c17d7b2a80e9d"
    },
    {
      "author": null,
      "description": "Southern Californians are bracing for gusty winds and a heightened risk of wildfires less than two weeks after deadly blazes that have killed at least 27 people and ravaged thousands of homes. The National Weather Service has issued a warning of a “particularly dangerous situation” for parts of Los Angeles and Ventura counties from Monday afternoon through Tuesday morning because of low humidity and swift Santa Ana winds. Critical fire weather with wind gusts of up to 60 mph is also forecast for other Southern California communities stretching to San Diego. The warnings come as firefighters continue to battle two major blazes in the Los Angeles area.",
      "publishedAt": "2025-01-19T23:18:10Z",
      "title": "Fire-ravaged Southern California braces for gusty winds and heightened wildfire risk",
      "url": "https://apnews.com/article/california-fires-los-angeles-winds-red-flag-warnings-f65206e790a912a0ce7d7b99c52e4ea2",
      "urlToImage": "https://dims.apnews.com/dims4/default/57c4e01/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Fa7%2F02d8ee2aac3967a9e73068396e49%2F3203f687f64e484d9636896781f477fd"
    },
    {
      "author": "WILL WEISSERT, FATIMA HUSSEIN, JOSH BOAK",
      "description": "President-elect Donald Trump used a raucous rally on the eve of his inauguration to promise swift Day 1 action remaking the federal government, shifting federal priorities at breakneck speed and ensuring that “the curtain closes on four long years of American decline.” Supporters filled a 20,000-plus-seat arena in downtown Washington for a “Make America Great” victory celebration. They cheered as Trump said he’d take quick action on everything from cracking down on the U.S.-Mexico border to promoting oil drilling, reining in the federal workforce and eradicating diversity programs. He told the crowd: “We’re going to give them the best first day, the biggest first week and the most extraordinary first 100 days of any presidency in American history.\"",
      "publishedAt": "2025-01-19T12:09:42Z",
      "title": "Trump pledges a series of Day 1 executive actions to end 'four long years of American decline'",
      "url": "https://apnews.com/article/trump-inauguration-rally-republicans-arlington-maga-1fb77ff176d21975620a9d452d943b74",
      "urlToImage": "https://dims.apnews.com/dims4/default/e34078a/2147483647/strip/true/crop/4734x2663+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Fbe%2F782e3ae76c113d8fef30b7c0c822%2F46fb0150268a46f387b6370c70399c68"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Millions of TikTok users in the United States are no longer able to watch videos on the social media platform as a federal ban on the immensely popular app takes effect. The company’s app was removed Saturday evening from prominent app stores, including the ones operated by Apple and Google, while its website told users that the short-form video platform was no longer available. The blackout began just hours before the law took effect.",
      "publishedAt": "2025-01-19T04:00:45Z",
      "title": "TikTok ban takes effect in the US",
      "url": "https://apnews.com/article/tiktok-ban-trump-biden-china-bdc79b7ce741a81761f67ea56d410103",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a10aa3/2147483647/strip/true/crop/7237x4071+0+366/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F3c%2F3cd26eaf3cf0e1ee427e16bb6063%2Ff9683bfdcdd24f338c9fab4ef5a83d6b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}