{
  "articles": [
    {
      "author": null,
      "description": "DETROIT (AP) — Source: Union for 45,000 US dockworkers agree to suspend strike until Jan. 15 to provide time to negotiate new contract.",
      "publishedAt": "2024-10-03T22:26:58Z",
      "title": "Source: Union for 45,000 US dockworkers agree to suspend strike until Jan. 15 to provide time to negotiate new contract",
      "url": "https://apnews.com/d3e1a928fd3adeffd90927b30ea12816",
      "urlToImage": ""
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "Obie Williams could hear babies crying and branches battering the windows when he answered his daughter’s daily phone call last week as Hurricane Helene tore through her rural Georgia town.",
      "publishedAt": "2024-10-03T18:51:22Z",
      "title": "Twin babies who died alongside their mother in Georgia are youngest-known Hurricane Helene victims",
      "url": "https://apnews.com/9a1b3108488a582e1ea6cf44e3242c06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3647fd18c1d48d9a6c5b69c0312c4a4/2000.jpeg"
    },
    {
      "author": "JEFF AMY and JOHN SEEWER",
      "description": "PENSACOLA, N.C. (AP) — Rescue crews and volunteers facing obstacles at every turn in North Carolina’s remote mountains paddled canoes across swollen rivers and steered horses past mudslides in the rush to reach those stranded or missing by Hurricane Helene’s rampage that killed more than 200 throughout the Southeast.",
      "publishedAt": "2024-10-03T04:16:47Z",
      "title": "The search for the missing hits snags at every corner as Helene's death toll tops 200",
      "url": "https://apnews.com/64fe5ca1b80f22fd2fd3b7c50b291d85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/898ad2fe763d489ba229b1a5925c001b/1920.jpeg"
    },
    {
      "author": "FADI TAWIL and JACK JEFFERY",
      "description": "BEIRUT (AP) — The Israeli military on Thursday warned people to evacuate a city and other communities in southern Lebanon that are north of a U.N.-declared buffer zone, signaling that it may widen a ground operation launched earlier this week against the Hezbollah militant group.",
      "publishedAt": "2024-10-03T08:57:22Z",
      "title": "Israel extends evacuation warnings in Lebanon, signaling a wider offensive",
      "url": "https://apnews.com/5fad98f56ebcc7e1751388b608c7c8dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49686bee1dc54266904e832893420ce5/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — The union representing 45,000 striking U.S. dockworkers at East and Gulf coast ports has reached a deal to suspend their strike until Jan. 15 to provide time to negotiate a new contract, a person briefed on the matter says.",
      "publishedAt": "2024-10-03T22:40:53Z",
      "title": "Source: Dockworkers' union to suspend strike until Jan. 15 to allow time to negotiate new contract",
      "url": "https://apnews.com/86fac07d1189e11ca4816b2cbf37affb",
      "urlToImage": ""
    },
    {
      "author": "CHRISTOPHER WEBER and JAIMIE DING",
      "description": "LOS ANGELES (AP) — Prosecutors in Los Angeles are reviewing new evidence in the case of the Menendez brothers, who were convicted of killing their parents in their Beverly Hills mansion more than 35 years ago, the city's district attorney said Thursday.",
      "publishedAt": "2024-10-03T22:15:43Z",
      "title": "Los Angeles prosecutors to review new evidence in Menendez brothers' 1996 murder conviction",
      "url": "https://apnews.com/488b0f0faf3ad86264e0d80036a6d37c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4df8e19cd52f48f58e4b3905fce2d6f9/3000.jpeg"
    },
    {
      "author": "ADRIAN SAINZ, KRISTIN M. HALL and JONATHAN MATTISE",
      "description": "MEMPHIS, Tenn. (AP) — Three former Memphis police officers were convicted Thursday in the 2023 fatal beating of Tyre Nichols, but were acquitted of the harshest charges they faced for a death that sparked national protests and calls for broad changes in policing.",
      "publishedAt": "2024-10-03T15:23:36Z",
      "title": "Mixed verdict for 3 Memphis officers convicted in Tyre Nichols' fatal beating",
      "url": "https://apnews.com/5e19e800cd5017c89cb652cfc8235ea2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0300b7831f0947208f60f3c85f614d60/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and MICHELLE L. PRICE",
      "description": "RIPON, Wisc. (AP) — Liz Cheney, one of Donald Trump’s fiercest Republican antagonists, rallied with Kamala Harris on Thursday at the site in Wisconsin where the modern Republican Party was born, as the Democratic vice president aimed to win over moderate voters and rattle the former president.",
      "publishedAt": "2024-10-03T09:02:03Z",
      "title": "Liz Cheney campaigns with Harris in Wisconsin while Trump holds a rally in Michigan",
      "url": "https://apnews.com/89396853e5521c3870a3c88e04cbfd99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/346e1451486146f287730406b98a4039/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Donald Trump laid the groundwork to try to overturn the 2020 election even before he lost, knowingly pushed false claims of voter fraud and “resorted to crimes” in his failed bid to cling to power, according to a court filing unsealed Wednesday that offers new evidence from the landmark criminal case against the former president.",
      "publishedAt": "2024-10-02T19:53:53Z",
      "title": "Prosecutors lay out new evidence in Trump election case, accuse him of having 'resorted to crimes'",
      "url": "https://apnews.com/0b9969b480036bb1f7c61a73980d406c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aebce365f3764a0eb2a53dca322b8d78/3000.jpeg"
    },
    {
      "author": "RUTH ALONGA, JEAN-YVES KAMALE and MONIKA PRONCZUK",
      "description": "GOMA, Congo (AP) — At least 78 people died when an overcrowded boat capsized on Lake Kivu in eastern Congo on Thursday, a local governor said.",
      "publishedAt": "2024-10-03T12:42:09Z",
      "title": "At least 78 people died when a boat with 278 on board capsized in eastern Congo, official says",
      "url": "https://apnews.com/1a4cb5013e7cfcc0c77de62e9c93936e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fac6c66969a447468b8d6db2cf0ed6ec/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}