{
  "articles": [
    {
      "author": "MATTHEW LEE, KIM TONG-HYUNG and LOLITA C. BALDOR",
      "description": "The American soldier who sprinted into North Korea across the heavily fortified border between the Koreas more than two months ago arrived back in the U.S.",
      "publishedAt": "2023-09-28T08:38:34Z",
      "title": "American soldier who crossed into North Korea arrives back in the US, video appears to show",
      "url": "https://apnews.com/746487710c11a812f33ad25d60861b1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ae60f69be7b41eea5f187830498d21b/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT, STEVE PEOPLES and JONATHAN J. COOPER",
      "description": "SIMI VALLEY, Calif. (AP) — Several of Donald Trump’s rivals stepped up their attacks against him in Wednesday’s second Republican presidential debate, urgently trying to dent the former president's commanding primary lead during an event that often seemed like an undercard without him.",
      "publishedAt": "2023-09-27T04:02:52Z",
      "title": "Donald Trump skipped the GOP debate again. This time, his rivals took him on directly",
      "url": "https://apnews.com/46ce9209b5150d577d5ff361522f6bed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a4ae5a01211467b9403fbc816d80b70/3000.jpeg"
    },
    {
      "author": "AVET DEMOURIAN",
      "description": "YEREVAN, Armenia (AP) — The separatist government of Nagorno-Karabakh said Thursday it will dissolve itself and the unrecognized republic will cease to exist by year's end after a nearly three-decade bid for independence, while Armenian officials said over half of the region's population has already fled.",
      "publishedAt": "2023-09-28T06:40:51Z",
      "title": "Half of Nagorno-Karabakh's population flees as the separatist government says it will dissolve",
      "url": "https://apnews.com/689e9e437f60a92eaca2523d57bc3d42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bc7ba0620ae46f0bc2b7720e4427168/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL, EVELYNE MUSAMBI and JOEAL CALUPITAN",
      "description": "How do you cook a meal when a staple ingredient is unaffordable?This question is playing out in households around the world as they face shortages of essential foods like rice, cooking oil and onions.",
      "publishedAt": "2023-09-28T05:13:55Z",
      "title": "Food prices are rising as countries limit exports. Blame climate change, El Nino and Russia's war",
      "url": "https://apnews.com/aa7135b3a7f5ef9df440e94825880346",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da9c6e8fa208497b83ca0720ef4ad4d4/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The federal government is just days away from a shutdown that will disrupt many services, squeeze workers and roil politics as Republicans in the House, fueled by hard-right demands, force a confrontation over federal spending.",
      "publishedAt": "2023-09-23T04:31:47Z",
      "title": "A government shutdown is nearing this weekend. What does it mean, who's hit and what's next?",
      "url": "https://apnews.com/f1b06964cf549b09977677e5f70bf9ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0839dc336d24572aa2163034039c4a4/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and LISA MASCARO",
      "description": "WASHINGTON (AP) — Republicans have insisted for months that they have the grounds to launch impeachment proceedings against President Joe Biden.",
      "publishedAt": "2023-09-28T04:02:58Z",
      "title": "House Republicans are set to make their case for Biden impeachment inquiry at first hearing",
      "url": "https://apnews.com/51576c5fe4294be2605a14fa81075196",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a83363d7d5d439bb948a0c094c8a47f/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "ALBANY, N.Y. (AP) — Letitia James fixated on Donald Trump as she campaigned for New York attorney general, branding the then-president a “con man” and ″carnival barker” and pledging to shine a “bright light into every dark corner of his real estate dealings.”",
      "publishedAt": "2023-09-28T04:06:57Z",
      "title": "NY Attorney General Letitia James has a long history of fighting Trump, other powerful targets",
      "url": "https://apnews.com/a3a2c2569440c24bd5c5262103cb8390",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21b0e50ad68a4f79b06ce13a25a17e07/3000.jpeg"
    },
    {
      "author": "NICK PERRY",
      "description": "WELLINGTON, New Zealand (AP) — From Sunday, workers at the main United States base in Antarctica will no longer be able to walk into a bar and order a beer, after the federal agency that oversees the research program decided to stop serving alcohol.",
      "publishedAt": "2023-09-28T04:32:54Z",
      "title": "At US Antarctic base hit by harassment claims, workers are banned from buying alcohol at bars",
      "url": "https://apnews.com/9a942ef7c552fa7ad54c872f3138ae4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccf1e76ffd354d7387964dc6ebb589ce/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "Hawaii's top public utility officials and the president of Hawaiian Electric are expected to testify Thursday in a congressional hearing about the role the electrical grid played in last month's deadly Maui wildfire.",
      "publishedAt": "2023-09-28T04:56:03Z",
      "title": "First congressional hearing on Maui wildfire to focus on island's sole electric provider and grid",
      "url": "https://apnews.com/cbd21597b63c74660210c552e833bdab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5626c6745a884ae8b12418aae94e1f93/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — Ring, ring! It's rush hour on Paris' Sébastopol Boulevard, and the congestion is severe — not just gas-guzzling, pollution-spewing, horn-honking snarls but also quieter and greener bottlenecks of cyclists jockeying for space.",
      "publishedAt": "2023-09-28T03:02:03Z",
      "title": "Long a city that embraced cars, Paris is seeing a new kind of road rage: Bike-lane traffic jams",
      "url": "https://apnews.com/6ab7931f04e435eb27dbd7494124b02e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c2566f2e0694cca824a6e83b35bb640/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}