{
  "articles": [
    {
      "author": "CLAIRE RUSH, TY O'NEIL, JENNIFER SINCO KELLEHER and REBECCA BOONE",
      "description": "LAHAINA, Hawaii (AP) — Hawaii emergency management records show no indication that warning sirens sounded before people ran for their lives from wildfires on Maui that killed at least 55 people and wiped out a historic town.",
      "publishedAt": "2023-08-11T05:47:00Z",
      "title": "At least 55 people died on Maui. Residents had little warning before wildfires overtook a town",
      "url": "https://apnews.com/c0f3cc5c7718bd41dd54d38479fb29b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ae6c75beb944b7bbbda880b6376177d/3000.jpeg"
    },
    {
      "author": "MATT SEDENSKY",
      "description": "An immigrant cook building a new life. A widow preparing to say goodbye. And a couple taking their vows.All were caught in the crossfire, forced to flee as flames swallowed parts of Maui, that drop in the Pacific where roads wind past waterfalls, turtles glide through gem-blue waters and a volcano towers overhead.",
      "publishedAt": "2023-08-11T18:53:24Z",
      "title": "As flames swallowed Maui, survivors made harrowing escapes",
      "url": "https://apnews.com/888a08a4968d615c483e5715c8a84d98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ea01f66407941168c31ef8a19b58de5/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Attorney General Merrick Garland announced Friday he has appointed a special counsel in the Hunter Biden probe, deepening the investigation of the president's son ahead of the 2024 election.",
      "publishedAt": "2023-08-11T16:24:47Z",
      "title": "Attorney General Merrick Garland appoints a special counsel in the Hunter Biden probe",
      "url": "https://apnews.com/ad1034e274570d65032f8e4f47c0c8f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbb136ff7afa4f09af5cd21fabed9d54/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST, NOMAAN MERCHANT and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — The federal judge overseeing the election conspiracy case against Donald Trump warned Friday that there are limits on what the former president can publicly say about evidence in the investigation as he campaigns for a second term in the White House.",
      "publishedAt": "2023-08-11T04:17:45Z",
      "title": "Judge warns of restraints to what evidence Trump can talk about, agrees to limited protective order",
      "url": "https://apnews.com/7129afbb11d968b42c9500559109f522",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34e229fbe85247a68a7753ce6c95aafa/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — FTX founder Sam Bankman-Fried was sent to jail Friday to await trial after a bail hearing for the fallen cryptocurrency wiz left a judge convinced that he had repeatedly tried to influence witnesses against him.",
      "publishedAt": "2023-08-11T04:07:59Z",
      "title": "FTX founder Sam Bankman-Fried jailed in New York; judge says crypto mogul tampered with witnesses",
      "url": "https://apnews.com/5d85e43225c4da2b1abdf65b153bb760",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/240e1f241a3549ecbc519b247992feba/2000.jpeg"
    },
    {
      "author": "JON GAMBRELL and MATTHEW LEE",
      "description": "DUBAI, United Arab Emirates (AP) — The United States and Iran reached a tentative agreement this week that will eventually see five detained Americans in Iran and an unknown number of Iranians imprisoned in the U.S.",
      "publishedAt": "2023-08-11T16:51:16Z",
      "title": "What's behind the tentative US-Iran agreement involving prisoners and frozen funds",
      "url": "https://apnews.com/e17dc67521798a2836ab4a3213e9277b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c40e1673d4a94ccc9a8273f24f6c46f6/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Tensions are escalating between Niger's new military regime and the West African regional bloc that has ordered the deployment of troops to restore Niger's flailing democracy.",
      "publishedAt": "2023-08-11T08:09:54Z",
      "title": "Tensions rise as West African nations prepare to send troops to restore democracy in Niger",
      "url": "https://apnews.com/bfd1ddcf075379289475d3f72d85fa16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/719d94e43da842b0bb7f6a3f455a8a1b/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES, THOMAS BEAUMONT and MICHELLE L. PRICE",
      "description": "CORALVILLE, Iowa (AP) — Ron DeSantis largely dismissed his own decision to replace his campaign leadership team as he returned to Iowa in the midst of a weekslong reset.",
      "publishedAt": "2023-08-11T04:22:21Z",
      "title": "DeSantis is resetting his campaign again. Some Republicans worry his message is getting in the way",
      "url": "https://apnews.com/662ac8017fcda6a9e9ede6a6034328ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/220f8c2f4743401cb70d168994799219/3000.jpeg"
    },
    {
      "author": "AMY TAXIN",
      "description": "SANTA ANA, Calif. (AP) — A Southern California judge accused of killing his wife texted his court clerk and bailiff afterward to say he had shot her, prosecutors said Friday as they charged him with murder and sought new bail conditions.",
      "publishedAt": "2023-08-11T16:07:50Z",
      "title": "California judge who's charged with murder texted court staff that he shot his wife, prosecutors say",
      "url": "https://apnews.com/d7d3a5c08eb04bbe7113402d9eab23d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d677e0422db4f239fc8547362235cae/3000.jpeg"
    },
    {
      "author": "BRUCE SCHREINER, DYLAN LOVAN and TRAVIS LOLLER",
      "description": "LOUISVILLE, Ky. (AP) — An overly-ambitious redesign of bus routes for Louisville's school district turned into a logistical meltdown on the first day of classes, forcing schools to close as administrators said Friday that students may have to stay home into part of next week until the mess is untangled.",
      "publishedAt": "2023-08-11T16:39:42Z",
      "title": "Kentucky school district rushes to fix bus route snarl that canceled classes and outraged parents",
      "url": "https://apnews.com/68caa1f37aa0e00fcdee753d00a0e32d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/749f77e587ab408396253ed227b7cec3/2800.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}