{
  "articles": [
    {
      "author": "NAJIB JOBAIN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces carried out strikes across Gaza overnight and into Tuesday as they pressed ahead with an offensive that officials say could go on for weeks or months, even as global calls for a cease-fire left both Israel and its main ally, the United States, increasingly isolated.",
      "publishedAt": "2023-12-12T08:16:19Z",
      "title": "Israel strikes across Gaza as the offensive leaves both it and the US increasingly isolated",
      "url": "https://apnews.com/b52ae70a89443728517f1d3d7508992c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11c69cfeef5e4a94b7ccbdd8a9f68ff6/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy will arrive on Capitol Hill to a darker mood than when he swooped in last winter for a hero's welcome, as the Russian invasion is grinding into a third year and U.S.",
      "publishedAt": "2023-12-12T05:27:18Z",
      "title": "Zelenskyy will arrive on Capitol Hill to grim mood as Biden's aid package for Ukraine risks collapse",
      "url": "https://apnews.com/5796a2429169d01959510f318fbc968a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82dfdcfa61154fd68dd0ae7c7b7d6d53/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — To hear his lawyers tell it, Donald Trump was alarmed by Russia's interference in the 2016 election, motivated as president to focus on cybersecurity and had a good-faith basis four years later to worry that foreign actors had again meddled in the race.",
      "publishedAt": "2023-12-12T05:04:43Z",
      "title": "How the 2016 election could factor into the case accusing Trump of trying to overturn the 2020 race",
      "url": "https://apnews.com/3015ad1eeb2571ba3de432470c24b9f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24c6bbc5796b47c480cd990a3b232bea/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Even before anyone has cast a vote in a 2024 presidential primary, the attention of many political journalists has shifted to Jan. 20, 2025.There has been a flurry of recent stories about the implications of a potential second presidency for Donald Trump, and his team's planning for Inauguration Day and beyond.",
      "publishedAt": "2023-12-12T05:05:38Z",
      "title": "Journalists tackle a political what-if: What might a second Trump presidency look like?",
      "url": "https://apnews.com/79e005396710c9ac85589f855541a38c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6388d16f509b40ad8d4035832961dcf4/3000.jpeg"
    },
    {
      "author": "RIAZ KHAN AND MUNIR AHMED",
      "description": "PESHAWAR, Pakistan (AP) — A suicide bomber detonated his explosive-laden vehicle at a police station's main gate in northwest Pakistan early Tuesday, killing at least 23 troops and wounding 32 others, and causing a part of the building to collapse upon impact, the military and officials said.",
      "publishedAt": "2023-12-12T05:38:48Z",
      "title": "Suicide bomber attacks police station in northwest Pakistan, killing 23 officers and wounding 32",
      "url": "https://apnews.com/466b04b71cb430bcf556f85a26b1febc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e4ac52863ce40ec8b5347a1de97a8b9/2000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A missile fired by Yemen's Houthi rebels slammed into a Norwegian-flagged tanker in the Red Sea off the coast of Yemen near a key maritime chokepoint, the rebels and authorities said Tuesday.",
      "publishedAt": "2023-12-12T01:59:40Z",
      "title": "A missile fired by Yemen’s Houthi rebels strikes a Norwegian-flagged tanker in the Red Sea",
      "url": "https://apnews.com/946b40e6393af6216c0b6ef734311be9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74284f34a1d5464ca1e711c1b6c86727/3000.jpeg"
    },
    {
      "author": "GAURAV SAINI, Press Trust of India and SIBI ARASU, Associated Press",
      "description": "DUBAI, United Arab Emirates (AP) — When United Nations climate talks wrap up at some point this week in Dubai, big promises will likely be made about how the world is going to combat climate change, caused by the burning of fossil fuels like oil, gas and coal.",
      "publishedAt": "2023-12-12T10:08:39Z",
      "title": "5 big promises made at annual UN climate talks and what has happened since",
      "url": "https://apnews.com/219044e56382becb25383c0b3125b5b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cc7b528fad142c88a19e0b815938b14/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — The university presidents called before a congressional hearing on antisemitism last week had more in common than strife on their campuses: The leaders of the University of Pennsylvania, Harvard and MIT were all women who were relatively new in their positions.",
      "publishedAt": "2023-12-12T05:22:29Z",
      "title": "Backlash to House testimony shines spotlight on new generation of Ivy League presidents",
      "url": "https://apnews.com/021ec60af6a5a5279c644376de065738",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16b62a5af27641ceacf6cf1858f7cb23/3000.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS",
      "description": "JACKSON, Miss. (AP) — The constitutional right of equal treatment under the law is at the center of a monthslong legal fight over a state-run court in part of Mississippi's majority-Black capital city of Jackson.",
      "publishedAt": "2023-12-12T05:15:41Z",
      "title": "Battle over creating new court centers on equality in Mississippi's majority-Black capital city",
      "url": "https://apnews.com/05a943de2b6b34d3fc601e3bb4288971",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0030959d43814e83af136d6df2e74ef1/3000.jpeg"
    },
    {
      "author": "SUZAN FRASER",
      "description": "ANKARA, Turkey (AP) — The Turkish Football Federation has suspended all league games in the country after a club president punched the referee in the face at the end of a top-flight match.MKE Ankaragucu president Faruk Koca attacked referee Halil Umut Meler on the pitch late Monday after the final whistle, following a 1-1 draw in a Super Lig game against Caykur Rizespor.",
      "publishedAt": "2023-12-12T07:05:28Z",
      "title": "Turkey suspends all league games after club president punches referee at a top-flight match",
      "url": "https://apnews.com/319b9f696728f3be048f345a39fba24a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1a42149b6a44e61808589104e0a9b7c/2154.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}