{
  "articles": [
    {
      "author": "Rebecca Santana",
      "description": "The Trump administration is creating a registry for all people who are in the U.S. illegally, and those who don’t self-report could face fines or prosecution. Immigration officials announced the registry efforts Tuesday. They said everyone who's in the U.S. illegally must register, give fingerprints and provide an address. Officials cited a section of the Immigration and Nationality Act as justification for registration, which would apply to anyone 14 and older. The announcement comes as the administration seeks to make good on campaign promises to carry out mass deportations and seal the border to future asylum-seekers. On its website, the U.S. Citizenship and Immigration Service said it would soon create a form and process for registration.",
      "publishedAt": "2025-02-26T03:04:55Z",
      "title": "Trump administration creates registry for immigrants who are in the US illegally",
      "url": "https://apnews.com/article/illegal-immigrant-registry-trump-border-enforcement-37ce7a345c1617ce3a9427e0ef755021",
      "urlToImage": "https://dims.apnews.com/dims4/default/4dce7d4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fd4%2F9ef7712cf0936d260abbe9903c81%2Fa82e043bfaa9428b9e26606abbc34f18"
    },
    {
      "author": "María Verza, Megan Janetsky",
      "description": "Venezuelan migrants handed over to Mexico like it’s a U.S. immigration detention facility. Families from Central Asia flown to Panama and Costa Rica to await voluntary repatriation to their countries. Venezuelans from Guantanamo Bay handed off on a Honduran tarmac and returned to Caracas. All of it sends the unmistakable message that trying to get to the U.S. border is no longer worth it. President Donald Trump’s administration has laid the groundwork to reverse the region’s migration flow. And while the numbers remain modest, an outline of how the U.S. hopes to overcome limited detention space as it gears up its deportation machine is emerging.",
      "publishedAt": "2025-02-26T05:00:13Z",
      "title": "Trump's 'shock and awe' deportation strategy sends migrants to third countries in Latin America",
      "url": "https://apnews.com/article/deportees-migrants-trump-latin-america-mexico-panama-27320f15ad6c316f242eae53e45f19c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6ab2a6/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2Ff0%2F0cd53819ade1e985480822ee3775%2Fb809f6a8af9e4c40bb5d071567e74f5c"
    },
    {
      "author": "Gene Johnson",
      "description": "President Donald Trump’s effort to suspend the system for resettling refugees in the U.S. is on hold after a federal judge in Seattle blocked it. U.S. District Judge Jamal Whitehead, a 2023 appointee of former President Joe Biden, found that while the president has broad authority over who comes into the country, he cannot nullify the law passed by Congress establishing the program. The Justice Department indicated it would consider a quick appeal, saying Trump’s actions have been well within his authority. Here’s what to know about the case.",
      "publishedAt": "2025-02-26T05:03:32Z",
      "title": "Things to know about the ruling blocking President Trump's refugee ban",
      "url": "https://apnews.com/article/trump-refugee-seattle-ruling-lawsuit-90d4f5eef5ff751e5b4fd45e5c9d9358",
      "urlToImage": "https://dims.apnews.com/dims4/default/fabd969/2147483647/strip/true/crop/3875x2180+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F40%2F83c3a85709bde284b490bbc5c942%2F7a10fbf29b1548db8bc2601b84fc396a"
    },
    {
      "author": "Elliot Spagat",
      "description": "President Donald Trump says he plans to offer a “gold card” visa with a path to citizenship for $5 million, replacing a 35-year-old visa for investors. Commerce Secretary Howard Lutnick said Tuesday the Trump Gold Card would replace EB-5 visas in two weeks. EB-5s were created by Congress in 1990 to generate foreign investment and are available to people who spend about $1 million on a company that employs at least 10 people. Lutnick says the Republican president's gold card would raise the price of admission for investors and eliminate fraud. The gold card is actually a green card, or permanent legal residency.",
      "publishedAt": "2025-02-26T00:36:53Z",
      "title": "Trump says he will offer 'gold cards' for $5 million path to citizenship, replacing investor visas",
      "url": "https://apnews.com/article/investor-visas-trump-immigration-eb5-gold-cards-cdb943dd1633bc234bb715fa20914e05",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe3d5ef/2147483647/strip/true/crop/5724x3220+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F89%2F02b5ff94141b3e76dee66e94dad8%2F2e6c4e72fe6b485ea0bbcc1324e5d92c"
    },
    {
      "author": null,
      "description": "The Federal Aviation Administration says an American Airlines plane arriving at Ronald Reagan Washington National Airport discontinued its landing, performing a go-around to avoid getting too close to another aircraft departing from the same runway. The maneuver Tuesday involving American Flight 2246 from Boston occurred less than two hours before another plane attempting to land at Chicago’s Midway Airport was forced to climb back into the sky to avoid another aircraft crossing the runway. The past few weeks have seen four major aviation disasters in North America, including the Jan. 26 midair collision between an Army helicopter and an American Airlines flight at National Airport that killed all 67 aboard the two aircraft.",
      "publishedAt": "2025-02-26T12:58:32Z",
      "title": "American Airlines flight discontinues landing to avoid departing plane at Washington National",
      "url": "https://apnews.com/article/reagan-airport-american-flight-chicago-plane-5853f64561eba0d879f9c5a28d9e256a",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea847a9/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2Fa6%2F4dfb1595f214336deaf00da0c8a2%2F000bc224b22c4db6b4cbfb4efd38c304"
    },
    {
      "author": "Byron Tau, Bernard Condon",
      "description": "A satellite company owned by Elon Musk is on a possible fast track to take over a large federal contract to modernize the nation’s air traffic communications system. Equipment from Musk’s Starlink has been installed in Federal Aviation Administration facilities as a prelude to a possible takeover of a $2 billion contract held by Verizon, according to government employees, contractors and people familiar with the work.",
      "publishedAt": "2025-02-25T21:53:57Z",
      "title": "FAA begins testing Musk-owned Starlink, raising conflict of interest concerns",
      "url": "https://apnews.com/article/elon-musk-starlink-spacex-faa-bbe9495978cac61b60c2971168e2921f",
      "urlToImage": "https://dims.apnews.com/dims4/default/43a9e48/2147483647/strip/true/crop/4005x2253+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F9a%2Fdfcdc798157082d115876301e6da%2Fd8fe190633cf41108acbd706e8e25cd7"
    },
    {
      "author": "Hanna Arhirova, Justin Spike",
      "description": "Ukrainian President Volodymyr Zelenskyy says a framework economic deal with the United States is ready. But Zelenskyy says that security guarantees that Kyiv views as vital remain to be decided and a full agreement could hinge on talks in Washington as early as Friday. Zelenskyy said during a news conference in Kyiv on Wednesday that the framework deal is a first step toward a full agreement that will be subject to ratification by Ukraine’s parliament. Zelenskyy said that Ukraine needs to know where the United States stands on its continued military support. He said he expects to have a wide-ranging substantive conversation with U.S. President Donald Trump during a visit to Washington. Zelenskyy said “I want to coordinate with the U.S.”",
      "publishedAt": "2025-02-26T13:08:16Z",
      "title": "Ukraine's Zelenskyy says framework economic deal with US is ready but security guarantees undecided",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-economic-deal-faf1ff881802c923370053e539ec26e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/cdbc598/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F0a%2F0f44206c94aa5353de788dd509c3%2F785552199fd64a30947c16d0ff444b2a"
    },
    {
      "author": "Chris Megerian",
      "description": "President Donald Trump's administration says federal agencies should begin planning to eliminate employee positions. The process is known as a reduction in force. Agency leaders must submit their plans by March 13. Trump is setting the stage for what could become a dramatic realignment of the federal government. He's already downsized the workforce by laying off probationary employees. Now the administration is turning its attention to career officials with civil service protection. Trump foreshadowed this goal in an executive order that he signed with Elon Musk, the billionaire entrepreneur who's advising the Republican president on overhauling the government.",
      "publishedAt": "2025-02-26T16:31:00Z",
      "title": "Trump administration sets stage for large-scale federal worker layoffs in new memo",
      "url": "https://apnews.com/article/trump-elon-musk-federal-workers-layoffs-d295d4bb2cdd5023c27d9cb03754e81b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d981041/2147483647/strip/true/crop/7394x4159+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F41%2Fe107c105defd724c2bdc48419a33%2F57ed9e887bf24efb9d5367711da29934"
    },
    {
      "author": "Susie Blann, Hanna Arhirova, Vasilisa Stepanenko",
      "description": "Three senior Ukrainian officials say that Ukraine and the U.S. have reached an agreement on a framework for a broad economic deal that would include the exploitation of rare earth minerals. The officials, who were familiar with the matter, spoke on condition of anonymity because they were not authorized to speak publicly. One of them said that Kyiv hopes that signing the agreement will ensure the continued flow of U.S. military support that the country urgently needs. There was no immediate response to a request for comment from the administration of U.S. President Donald Trump.",
      "publishedAt": "2025-02-25T21:29:24Z",
      "title": "Ukraine and US have agreed on a framework economic deal, Ukrainian officials say",
      "url": "https://apnews.com/article/russia-ukraine-war-economic-agreement-us-72ee2cfa720f6a42455c5425007060e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c0e807/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F0d%2F6eb6b5f0c5fef96fd09d67dc4c90%2Fe1a99fbe53af49bdae21abd1c3ea9d95"
    },
    {
      "author": "Samy Magdy, Melanie Lidman",
      "description": "Hamas says that it will return the bodies of four dead hostages on Thursday in exchange for Israel’s release of hundreds of Palestinian prisoners, two days before the first phase of the ceasefire between the warring parties is set to expire. Israel had delayed the release of some 600 Palestinian prisoners over what it said was the cruel treatment of hostages during their release by the militant group. The deadlock over the exchange had threatened to collapse the ceasefire when the current six-week first phase of the deal expires this weekend. Hamas' latest announcement on Wednesday would complete both sides’ obligations of the first phase of the ceasefire.",
      "publishedAt": "2025-02-26T07:47:50Z",
      "title": "Hamas to turn over bodies of four Israeli hostages in exchange for release of hundreds of prisoners",
      "url": "https://apnews.com/article/israel-hamas-hostages-ceasefire-witkoff-494b3f97c46f17f42213f3a71375c345",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ee5dbb/2147483647/strip/true/crop/4205x2365+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F1d%2Fd3939cf0fbecc8e6c6753b390801%2F513def2fe46642a1a129ff228b52fbce"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}