{
  "articles": [
    {
      "author": "SEAN MURPHY and JULIO CORTEZ",
      "description": "VALLEY VIEW, Texas (AP) — Powerful storms killed at least 13 people and left a wide trail of destruction Sunday across Texas, Oklahoma and Arkansas after obliterating homes and destroying a truck stop where dozens sought shelter in a restroom during the latest deadly weather to strike the central U.S.",
      "publishedAt": "2024-05-26T14:21:59Z",
      "title": "At least 13 dead in Texas, Oklahoma and Arkansas after severe weather roars across region",
      "url": "https://apnews.com/93001e1d81f120d0d55c8dfa24938250",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4e9b25f4818448e909bbf2ffbdb9f11/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, TIA GOLDENBERG and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Hamas fired a barrage of rockets from Gaza that set off air raid sirens as far away as Tel Aviv for the first time in months on Sunday in a show of resilience more than seven months into Israel's massive air, sea and ground offensive.",
      "publishedAt": "2024-05-26T08:42:49Z",
      "title": "Hamas rocket attack from Gaza sets off air raid sirens in Tel Aviv for the first time in months",
      "url": "https://apnews.com/eb25eb70d2c7b9e6bcd0497060eccbca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16d885080b824760afd43de36d2dc54f/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Donald Trump was booed repeatedly while addressing the Libertarian Party National Convention on Saturday night, with many in the crowd shouting insults and decrying him for things like his COVID-19 policies, running up towering federal deficits and lying about his political record.",
      "publishedAt": "2024-05-25T04:07:07Z",
      "title": "Trump, accustomed to friendly crowds, confronts repeated booing during Libertarian convention speech",
      "url": "https://apnews.com/816e3209fdf993c2ba7f6caed0ebcdb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0bb6106030448a2ad35ee1d4412fdda/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Richard M. Sherman, one half of the prolific, award-winning pair of brothers who helped form millions of childhoods by penning the instantly memorable songs for \"Mary Poppins,\" \"The Jungle Book\" and \"Chitty Chitty Bang Bang\" — as well as the most-played tune on Earth, \"It's a Small World (After All)\" — has died.",
      "publishedAt": "2024-05-25T22:24:31Z",
      "title": "Richard M. Sherman, who fueled Disney charm in 'Mary Poppins' and 'It's a Small World,' dies at 95",
      "url": "https://apnews.com/19bb30ab3af649c480153133c1faa307",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cf3dd6cfb6847db8db6b0ffbad715c4/3000.jpeg"
    },
    {
      "author": "JOHN O'CONNOR",
      "description": "SPRINGFIELD, Ill. (AP) — The Abraham Lincoln Presidential Library and Museum is once again under the spotlight after a manager failed to consult a collections committee before purchasing a 21-star flag whose description as a rare banner marking Illinois' 1818 admission to the Union is disputed.",
      "publishedAt": "2024-05-26T04:46:07Z",
      "title": "A 19th century flag disrupts leadership at an Illinois museum and prompts a state investigation",
      "url": "https://apnews.com/f4297c3b6813b5aacdf642ad3ec7af4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f4370323fd143d1be0031ea412393e1/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — The International Organization for Migration on Sunday increased its estimate of the death toll from a massive landslide in Papua New Guinea to more than 670 as emergency responders and traumatized relatives gave up hope that any survivors will now be found.",
      "publishedAt": "2024-05-26T04:52:37Z",
      "title": "Over 670 people died in a massive Papua New Guinea landslide, UN estimates, as survivors seek safety",
      "url": "https://apnews.com/642d9e8e0c913efa25ed2d67df318393",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e38d4e4330904f8c8bcf8e2f0fd759cf/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — All 18-year-olds in Britain will have to perform a year of mandatory military or civilian national service if the governing Conservative Party wins the July 4 national election, the party said Sunday.",
      "publishedAt": "2024-05-26T09:11:52Z",
      "title": "Sunak’s plan to make 18-year-olds do national service grabs attention on UK election trail",
      "url": "https://apnews.com/fdaf7e38793434e4f060c11735fef71e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9d9b55f65284450959cfa1d18e81949/3000.jpeg"
    },
    {
      "author": "BEN NUCKOLS",
      "description": "When Balu Natarajan became the first Indian American champion of the Scripps National Spelling Bee in 1985, a headline on an Associated Press article read, “Immigrants’ son wins National Spelling Bee,” with the first paragraph noting the champion “speaks his parents’ native Indian language at home.”",
      "publishedAt": "2024-05-26T04:58:26Z",
      "title": "National Spelling Bee reflects the economic success and cultural impact of immigrants from India",
      "url": "https://apnews.com/b14ba87533dfcd8af813de568ee5958f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d47672141b34313bf9643a059fa19c8/2857.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "Two-time PGA Tour winner Grayson Murray died Saturday morning at age 30, one day after he withdrew from the Charles Schwab Cup Challenge at Colonial.",
      "publishedAt": "2024-05-25T19:37:20Z",
      "title": "Grayson Murray dies at age 30 a day after withdrawing from Colonial, PGA Tour says",
      "url": "https://apnews.com/1e7b61efd74e69b99b141b613c5072dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/665e51df3e6c420593cf2f5d0853b07e/3000.jpeg"
    },
    {
      "author": "RODRIGO ABD and FRANKLIN BRICEÑO",
      "description": "BELÉN, Peru (AP) — In the heart of Peru’s Amazon region, a poor Indigenous community put aside the trials and tribulations of everyday life and celebrated an international film festival with works from countries with tropical forests.",
      "publishedAt": "2024-05-26T14:55:45Z",
      "title": "Indigenous community in the heart of Peru's Amazon hosts film festival celebrating tropical forests",
      "url": "https://apnews.com/01a95d55872c106397f2b92ccb03756b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d261ed291d324f0ea058931860e117a8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}