{
  "articles": [
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Matt Gaetz withdrew Thursday as President-elect Donald Trump’s pick for attorney general amid continued fallout over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation's chief federal law enforcement officer.",
      "publishedAt": "2024-11-21T17:33:02Z",
      "title": "Gaetz withdraws as Trump's pick for attorney general, averting confirmation battle in the Senate",
      "url": "https://apnews.com/248b46ba0c882dd46d661568e8bd3bd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4d057e1da04436b9b1de261ad908edc/1920.jpeg"
    },
    {
      "author": "BRIAN MELLEY",
      "description": "The decision by the International Criminal Court to issue arrest warrants for the Israeli prime minister and a top Hamas official puts them in a small group of leaders to be accused of crimes against humanity.",
      "publishedAt": "2024-11-21T21:03:35Z",
      "title": "Warrants put Israeli PM and others in a small group of leaders accused of crimes against humanity",
      "url": "https://apnews.com/8668a2683972297c5a22ea30164a1445",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d950c675b124746a50e02513d9f752b/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — While Matt Gaetzhas withdrawn from the nomination process for attorney general, President-elect Donald Trump has picked several other people for his Cabinet and key staff positions who have been accused of some form of sexual misconduct.",
      "publishedAt": "2024-11-21T19:21:58Z",
      "title": "Several of Trump's Cabinet picks — and Trump himself — have been accused of sexual misconduct",
      "url": "https://apnews.com/2fe42bb7ea72c5212236ae8d8c153901",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fdd13779de3445ba94228cda7e955fb/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — When Elon Musk first suggested a new effort to cut the size of government, Donald Trump didn't seem to take it seriously.",
      "publishedAt": "2024-11-21T16:55:34Z",
      "title": "Elon Musk's budget crusade could cause a constitutional clash in Trump's second term",
      "url": "https://apnews.com/8e2fffc27df6acc1b275b1614e66fd01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7e2b0156e9c44ca9dbce3b4acd322a4/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and FATMA KHALED",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The death toll in the Gaza Strip from the 13-month-old war between Israel and Hamas has surpassed 44,000, local health officials said Thursday.",
      "publishedAt": "2024-11-21T11:39:23Z",
      "title": "Death toll in Gaza from Israel-Hamas war passes 44,000, Palestinian officials say",
      "url": "https://apnews.com/5da3ce43df8662fe9eeab4ad804bdc0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4c86120cb5745f49ad1cae799fc1688/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The new ballistic missile fired by Russia struck a military-industrial facility in the central Ukrainian city of Dnipro, but its real mission was delivering a deadly new message to NATO.",
      "publishedAt": "2024-11-21T20:32:30Z",
      "title": "Putin touts Russia's new missile and delivers a menacing warning to NATO",
      "url": "https://apnews.com/d50183ccfc28b10c71e93f3e68159a61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70e4fb696d6340bcaaaba612b0e860b5/3000.jpeg"
    },
    {
      "author": null,
      "description": "SAN FRANCISCO (AP) — One of the strongest storms on the West Coast in decades knocked out power for thousands of people, unleashed strong winds that toppled trees and left two dead in Washington before making its way through Oregon to Northern California where on Thursday it dropped heavy snow and record amounts of rain.",
      "publishedAt": "2024-11-21T22:33:24Z",
      "title": "What to know about a storm bringing high winds, heavy rain, snow to California and Pacific Northwest",
      "url": "https://apnews.com/7792213c57530aed0b1a9ebc2d4e94d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20a39d15244543029b208b5e5ba72865/3000.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA and MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — Brazil’s federal police said Thursday they indicted former President Jair Bolsonaro and 36 other people for allegedly attempting a coup to keep him in office after his defeat in the 2022 elections.",
      "publishedAt": "2024-11-21T18:39:36Z",
      "title": "Brazilian police indict former President Bolsonaro and aides over alleged 2022 coup attempt",
      "url": "https://apnews.com/0d62fe0a7399483aee48cf3c845560ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/084ac4709d8c4185b17b7651625390e2/2698.jpeg"
    },
    {
      "author": "JOHN O'CONNOR and SOPHIA TAREEN",
      "description": "SPRINGFIELD, Ill. (AP) — The Illinois Supreme Court on Thursday overturned actor Jussie Smollett’s conviction on charges of staging a racist and homophobic attack against himself in 2019 and lying to Chicago police, saying he should not have been charged a second time after reaching a deal with prosecutors.",
      "publishedAt": "2024-11-21T15:53:09Z",
      "title": "Jussie Smollett’s conviction in 2019 attack on himself is overturned",
      "url": "https://apnews.com/91178cf27f6ef0aec8a5eef67a3a6125",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0824d6b5961a4f9e8c1f867dbd165983/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — For about 50 years, adding cavity-preventing fluoride to drinking water was a popular public health measure in Yorktown, a leafy town north of New York City. But in September, the town’s supervisor used his emergency powers to stop the practice.",
      "publishedAt": "2024-11-21T15:02:35Z",
      "title": "US towns plunge into debates about fluoride in water",
      "url": "https://apnews.com/47a0067edb128dbd9b9211a36e674b2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/995f89f0809a4aa0bc158cc29b436ba8/2900.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}