{
  "articles": [
    {
      "author": null,
      "description": "The investigation into the apparent kidnapping of Nancy Guthrie, mother of \"Today\" show host Savannah Guthrie, continues. Authorities believe she was taken last weekend. Savannah Guthrie addressed potential kidnappers in a social media video, stating the family is prepared to pay for her safe return. The FBI is reviewing a message sent to a Tucson TV station. Multiple ransom letters have been received, but their credibility is unclear. Concerns grow for Nancy's health due to her need for daily medication. The case has captured national attention.",
      "publishedAt": "2026-02-08T16:28:35Z",
      "title": "Investigation continues into missing Nancy Guthrie",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-48f7ce9dee7770a2b8751c410400a032",
      "urlToImage": "https://dims.apnews.com/dims4/default/95ef6d9/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F1d%2F8d80289c3928906eb2612009c4a4%2Fbba86996fd22457fb42ee36510a1ff48"
    },
    {
      "author": "Michael R. Sisak, David B. Caruso, Larry Neumeister",
      "description": "The FBI pored over Jeffrey Epstein’s bank records and emails. It searched his homes. It spent years interviewing his victims and examining his connections to some of the world’s most influential people. But while investigators collected ample proof that Epstein sexually abused multiple underage girls, records released by the Justice Department show they found scant evidence he led a sex trafficking ring serving powerful men. Investigators wrote in one memo reviewed by The Associated Press that they were unable to substantiate one victim's highly public claim that he “lent her” to his rich friends, and found no other victims telling a similar story.",
      "publishedAt": "2026-02-08T15:30:20Z",
      "title": "Inside the FBI's investigation of Jeffrey Epstein",
      "url": "https://apnews.com/article/jeffrey-epstein-client-list-sex-trafficking-049c96080a2ca2c12c84ac506437e50b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d9b633/2147483647/strip/true/crop/4790x3192+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2F88%2F13679738e5005c6e0a3c5709eb10%2Fee8342af102640afae1f5bd047f029be"
    },
    {
      "author": "Matt Brown",
      "description": "A leading U.S. health official is urging people to get inoculated against the measles at a time of outbreaks across several states. The appeal is from Dr. Mehmet Oz, the Centers for Medicare and Medicaid Services administrator. And it comes as the United States is at risk of losing its measles elimination status and as Oz's boss, Health Secretary Robert F. Kennedy Jr., has raised suspicion about the safety and importance of vaccines. Oz was interviewed Sunday on CNN and he said, \"Take the vaccine, please. We have a solution for our problem.”",
      "publishedAt": "2026-02-08T20:05:54Z",
      "title": "Top health official urges US public to get the measles vaccine",
      "url": "https://apnews.com/article/measles-vaccine-outbreak-oz-kennedy-trump-971a576fe28cc741a915f3dbf310de02",
      "urlToImage": "https://dims.apnews.com/dims4/default/298a831/2147483647/strip/true/crop/4169x2778+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2F02%2F73241147e979c9c5738ccab7d627%2F72bef977d56d421c92437a2f62e5a4de"
    },
    {
      "author": "Rob Maaddi",
      "description": "It’s almost time to crown an NFL champion. After two weeks of hype and anticipation, the New England Patriots and Seattle Seahawks will face off in Super Bowl 60 at Levi’s Stadium. Will Drake Maye and the Patriots capture their seventh Lombardi Trophy? Or will Sam Darnold and the Seahawks earn their second? The matchup features two stingy defenses, two balanced offenses and two quarterbacks who’ve taken vastly different routes to get here. The Seahawks allowed the fewest points in the NFL and have standout players at every level. The Patriots got here because their defense has been dominant in the playoffs.",
      "publishedAt": "2026-02-08T11:00:06Z",
      "title": "Drake Maye and the Patriots take on Sam Darnold and the Seahawks in Super Bowl 60",
      "url": "https://apnews.com/article/super-bowl-seahawks-patriots-24ad67503a342a7e24348e66986250ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/6e33954/2147483647/strip/true/crop/5672x3779+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F47%2F213226251b0149fe9bc786f276e9%2Fc70381e993624e91a0b58262d665c3a6"
    },
    {
      "author": "Jake Offenhartz",
      "description": "Legal observers and officials say they have received a growing number of reports of federal agents impersonating construction workers, delivery drivers and in some cases anti-ICE activists in Minnesota. Not all of those incidents have been verified during the ongoing immigration crackdown. But they have heightened fears in a state already on edge. They add to legal groups’ concerns about the Trump administration’s dramatic reshaping of immigration enforcement tactics nationwide. Supporters of the immigration crackdown say the sprawling network of anti-ICE activists in Minneapolis has forced federal agents to adopt new methods of avoiding detection.",
      "publishedAt": "2026-02-08T05:08:11Z",
      "title": "Reports of immigration agents in disguise stoke fears in Minnesota",
      "url": "https://apnews.com/article/immigration-ice-agents-minneapolis-ruse-54ca86155182edceeda68e649b5518f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5655c56/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F5a%2F327a3037b9c1ba9c42484ea327af%2F19ce72e1d4ca49c28582368ffd04a8f4"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Iran’s top diplomat strikes a hard line on US talks, saying Tehran’s power comes from saying ‘no’",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-protests-araghchi-389531836ccaa4c126b5ee06c1d5b1f8",
      "urlToImage": null
    },
    {
      "author": "Samy Magdy, Melanie Lidman",
      "description": "The Rafah border crossing between Gaza and Egypt reopened Sunday, allowing limited Palestinian travel after a two-day closure, according to Egyptian state media. The crossing opened last week for the first time since 2024, a key part of a U.S.-backed ceasefire. Egyptian media reported Palestinians began crossing around noon. Israel hasn't confirmed this. Over the first four days, 36 Palestinians needing medical care and 62 companions were allowed to leave for Egypt, according to the United Nations. Nearly 20,000 people in Gaza seek to leave for medical care. The crossing's reopening is part of a fragile ceasefire deal between Israel and Hamas.",
      "publishedAt": "2026-02-08T09:38:10Z",
      "title": "Gaza's Rafah crossing reopens, allowing limited travel as Palestinians claim delays and mistreatment",
      "url": "https://apnews.com/article/mideast-gaza-egypt-rafah-crossing-medical-treatment-397a2323fb7ef85d274d682258b4a0eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae8de98/2147483647/strip/true/crop/7517x5009+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2F82%2F398375c0d76cb9206adec54ab284%2Fe067912d78cb4cb989e61a32cea71b02"
    },
    {
      "author": "Fernanda Figueroa",
      "description": "U.S. Olympians are beginning to face backlash for speaking out about domestic politics at the Milan Cortina Games. On Sunday, freestyle skier Hunter Hess expressed mixed emotions about representing the U.S. because of aggressive immigration enforcement operations begin carried out by the Trump administration. Hess said wearing the American flag doesn’t mean he supports everything happening at home. Hess’ comments invited online criticism from YouTuber Jake Paul and U.S. President Donald Trump, who called Hess a “real loser.” Other U.S. athletes, like Chris Lillis and Amber Glenn, also were criticized after voicing concerns. The U.S. Olympic Committee said it is working to address the abusive messages directed at the athletes..",
      "publishedAt": "2026-02-08T19:58:04Z",
      "title": "President Trump slams Olympic skier Hunter Hess for political remarks",
      "url": "https://apnews.com/article/trump-us-athletes-speaking-out-backlash-6ad0274b0aa2f44795fdf1c44e2eb252",
      "urlToImage": "https://dims.apnews.com/dims4/default/7c606fd/2147483647/strip/true/crop/4000x2665+0+5/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F4c%2Ffe4021118744c73fcb796c9e3072%2F3fdb46495aa84716bce22a4bc4d2147c"
    },
    {
      "author": "Josh Boak",
      "description": "The White House is trying to show it's lowering the cost of living, but President Donald Trump has said he doesn't want to see the price of homes come down. He wants to keep values high. That's something in the interest of existing homeowners and they're a key part of his political base. And older voters tend to show up to vote more than do younger people, so Trump's position on housing could be a factor in the November elections. But Trump's aversion to policies that would expand housing supply and lower prices risks alienating younger voters and could hurt the chances for his Republican Party to expand its voting base.",
      "publishedAt": "2026-02-08T12:31:50Z",
      "title": "Why Trump doesn't want home prices to fall",
      "url": "https://apnews.com/article/trump-housing-mortgage-midterm-elections-prices-affordability-6bda9c1260550990bc819bcb6f1402cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/894976e/2147483647/strip/true/crop/4108x2737+382+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F95%2F57bdf0075349358c2fae028f2fc8%2F486a3ab441864c5688cf716b764fb967"
    },
    {
      "author": "Jake Coyle",
      "description": "Hollywood is largely ceding attention to football this weekend. The survival thriller “Send Help” repeated as the weekend's No. 1 film at the box office and the Melania Trump documentary “Melania” fell sharply in its second weekend. Super Bowl weekend is typically one of the year's lowest for movie attendance. The Sam Raimi-directed survivalist thriller “Send Help” lead the weekend box office with $10 million in ticket sales. Amazon MGM's “Melania” added 300 theaters in its second weekend of release, but dropped 67% to just $2.4 million in sales. The rapid downturn means the Brett Ratner-directed documentary is likely heading toward flop territory given its high price tag.",
      "publishedAt": "2026-02-08T18:00:47Z",
      "title": "'Melania' falls steeply at the box office",
      "url": "https://apnews.com/article/box-office-scream-7-melania-f0d26c19af33c0e5ded9a1c6b8ae79d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/eba959c/2147483647/strip/true/crop/7030x4684+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F98%2F053425b39da50acc61f16ec304a6%2F1d461e211c2f4ddba1013e17dcc3450d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}