{
  "articles": [
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Israeli strikes overnight and into Tuesday have killed at least 60 people across the Gaza Strip. That's according to Palestinian health officials. Israel has launched another major offensive in the territory in recent days, saying it aims to return dozens of hostages held by Hamas and destroy the militant group. The Gaza Health Ministry says two strikes in northern Gaza hit a family home and a school-turned-shelter, killing at least 22 people, more than half of them women and children. There was no immediate comment from the Israeli military,",
      "publishedAt": "2025-05-20T06:14:06Z",
      "title": "Israeli strikes across Gaza have killed at least 60 people",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-05-20-2025-402954f7424825ef73ad57f17a701fac",
      "urlToImage": "https://dims.apnews.com/dims4/default/f816b91/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F5e%2F0a1b0e8efec26cd9e4781ed90595%2F6d8a47706f524cb3928c1f30e36cbe92"
    },
    {
      "author": "Illia Novikov, Yehor Konovalov",
      "description": "U.S. President Donald Trump’s phone calls with the leaders of Russia and Ukraine have deepened expectations that progress might soon be made on ending those countries’ more than three-year war. At the same time, frustration at the slow pace of negotiations and the absence of any significant breakthrough have kept hopes low. Ukrainian President Volodymyr Zelenskyy said Tuesday that “it is obvious that Russia is trying to buy time to continue the war.” Trump said his personal intervention was needed to push peace efforts forward, and on Monday he held separate talks over the phone with Zelenskyy and Russian President Vladimir Putin. Trump announced that Russia and Ukraine will “immediately” begin ceasefire negotiations, though no details were provided.",
      "publishedAt": "2025-05-20T10:18:09Z",
      "title": "Slow progress and no major breakthroughs dampen hopes for Russia-Ukraine peace deal",
      "url": "https://apnews.com/article/russia-ukraine-war-peace-talks-trump-83979d718b73cb9bd655dd9aaa915573",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6a07fe/2147483647/strip/true/crop/6071x3415+0+316/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F22%2F6001ef4b83560b5e95ae7aac2abf%2Ffc31216809c540e785bf75039e303800"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court is allowing the Trump administration to strip legal protections from 350,000 Venezuelans, potentially exposing them to deportation. The court’s order Monday, with only one noted dissent, puts on hold a ruling from a federal judge in San Francisco that kept in place Temporary Protected Status for the Venezuelans that would have otherwise expired last month. The status allows people already in the United States to live and work legally because their native countries are deemed unsafe for return due to natural disaster or civil strife.",
      "publishedAt": "2025-05-19T16:42:50Z",
      "title": "Supreme Court allows Trump to strip protections from some Venezuelans",
      "url": "https://apnews.com/article/supreme-court-venezuelans-deportation-trump-5589f17e0ecd5d33bfb220e15720f88d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b9e9ef/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2Fb4%2F28aba2883a2a7268895fa56644b4%2Fee48c15dd5604f6281a7266388de25da"
    },
    {
      "author": "Alanna Durkin Richer, Eric Tucker, Mike Catalini",
      "description": "New Jersey’s top federal prosecutor says she’s charging Democratic Rep. LaMonica McIver with assault after a skirmish with federal officers who arrested the Newark mayor outside an immigration detention center. Interim U.S. Attorney Alina Habba announced the charge Monday on social media, but court papers providing details were not immediately released or publicly available online. Habba said McIver is charged with assaulting, impeding or interfering with law enforcement. Habba also announced that her office is dismissing a misdemeanor case brought against Newark Mayor Ras Baraka. McIver’s attorney, Paul Fishman, the former U.S. attorney for New Jersey, issued a statement calling the decision to charge McIver “spectacularly inappropriate.”",
      "publishedAt": "2025-05-20T00:30:27Z",
      "title": "Democratic Rep. McIver charged with assault after skirmish at ICE center, New Jersey prosecutor says",
      "url": "https://apnews.com/article/new-jersey-mciver-habba-baraka-ice-facility-272c436f7c8eaf67552ce932750ff3e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/749b3b4/2147483647/strip/true/crop/4000x2250+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F72%2F21e7c130e4f6a7cca971e72a39ab%2F61566b4c3b4144a3b0f3436fab82e05d"
    },
    {
      "author": "Melanie Lidman",
      "description": "The parents of Edan Alexander, an Israeli-American soldier who was held captive in Gaza for 19 months, are overjoyed he is home and slowly absorbing their son's life in captivity. Hamas portrayed the release of Alexander, the last living American hostage in Gaza, as a gesture to President Donald Trump ahead of his Mideast tour last week, which the militants hoped would revive ceasefire talks. Instead, Israel launched a renewed offensive days later that families of the remaining hostages fear could put their loved ones in grave danger.",
      "publishedAt": "2025-05-20T05:01:51Z",
      "title": "Israeli-American hostage's parents says he is making progress after release",
      "url": "https://apnews.com/article/israel-gaza-hamas-israeli-american-freed-hostage-edan-alexander-1f0cc6dde9e1c3fbaef1ca3dea22652f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b1a6c2c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F4c%2Fd07b58148cce6700aee13f571c9b%2F50d00dab85954d94bd8ff267b0af4f45"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking, Leah Askarinam",
      "description": "President Donald Trump is heading to Capitol Hill to seal the deal on his “big, beautiful bill.” Using his power of political persuasion, Trump will try to unify divided House Republicans on the multitrillion-dollar package that is at risk of collapsing ahead of planned votes this week. The president has implored GOP holdouts to “STOP TALKING, AND GET IT DONE.” But negotiations are slogging along. It’s not at all clear the package, with its sweeping tax breaks and cuts to Medicaid, food stamps and green energy programs, has the support needed. With all Democrats opposed, the Republicans can handle only a few defections from their slim House majority.",
      "publishedAt": "2025-05-20T04:08:38Z",
      "title": "Trump heads to Capitol Hill to push 'big, beautiful' bill",
      "url": "https://apnews.com/article/congress-republicans-tax-cuts-trump-johnson-ebc172c76ac51434e9bfa28d867bd9a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/d216e72/2147483647/strip/true/crop/4631x2605+0+240/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fe6%2Fbebe00b9b250652d29ff92b4a229%2F88f087a2871c4a05b6e15bc48b6d5e2f"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "Shares have gained in Asia and Europe after China cut key interest rates to help fend off an economic malaise worsened by trade friction with Washington. The Reserve Bank of Australia lowered its benchmark rate in the second such cut this year. Chinese EV battery maker CATL's shares jumped 16.4% in its Hong Kong trading debut after it raised about $4.6 billion in the world's largest IPO this year. On Monday, the S&P 500 rose 0.1% after Moody’s Ratings became the last of the three major credit-rating agencies to say the U.S. government no longer deserves a top-tier “Aaa” rating. The Dow Jones Industrial Average added 0.3%, and the Nasdaq was little changed.",
      "publishedAt": "2025-05-20T03:44:38Z",
      "title": "World shares advance after China cuts interest rates to boost economy",
      "url": "https://apnews.com/article/stocks-markets-china-tariffs-catl-02ba2e767cdf0306c28ec9210bec90ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/62f4aa9/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F9d%2Fe649bc40acbf227e49a477178d23%2F62cbe3768cb14aa68cf8c7e815348f8f"
    },
    {
      "author": "Mogomotsi Magome",
      "description": "Topping the agenda at President Donald Trump's meeting with South Africa's president at the White House this week is the extraordinary new U.S. refugee policy welcoming white Afrikaner farmers who the Trump administration claims are persecuted. The Associated Press visited a lively agricultural fair in South Africa's heartland days ahead of the U.S. meeting. Both white and Black farmers and even conservative white Afrikaner groups debunked the Trump administration’s “genocide” and land seizure claims that led the U.S. to cut all financial aid to South Africa. Farmers agree that violent crime is a problem, but for everyone.",
      "publishedAt": "2025-05-20T01:05:12Z",
      "title": "Trump alleges 'genocide' in South Africa. Afrikaner farmers and others scoff",
      "url": "https://apnews.com/article/south-africa-afrikaners-trump-refugees-ramaphosa-c87264523d555a64c0588d8734bba83a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d892554/2147483647/strip/true/crop/8223x4625+0+401/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2Fed%2Fddad32506c25d511bade9cf7adf9%2F3adb0ef1abe04cda988045fc684240a8"
    },
    {
      "author": "Dave Campbell",
      "description": "The fate of the tush push is up for discussion again. A vote is expected this week on the proposal by the Green Bay Packers to prohibit the play popularized by the Philadelphia Eagles. To pass the ban, 24 of the 32 teams must approve. Commissioner Roger Goodell said last month he believes owners will reach a consensus on the issue of competitive integrity and player safety. There will be a new topic as well when NFL owners gather in Minnesota. The league has proposed allowing players to participate in flag football when the sport debuts at the 2028 Olympics.",
      "publishedAt": "2025-05-20T10:00:10Z",
      "title": "The NFL tush push ban proposal is back on the table at the spring owners meetings",
      "url": "https://apnews.com/article/nfl-owners-meetings-tush-push-27a59a66a3b707b211b82a34ff24200a",
      "urlToImage": "https://dims.apnews.com/dims4/default/c06fb0a/2147483647/strip/true/crop/3458x1945+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fcc%2Fd7ba19c416392b08559c46401716%2F5c2d943ad7734ba6b2b8cff6ccf0352e"
    },
    {
      "author": "Edith M. Lederer",
      "description": "Greece’s top diplomat says the world is facing the most turbulent time since World War II, pointing to a crossroads in democracy and saying Europe is facing a “political identity crisis.” Foreign Minister Giorgos Gerapetritis told The Associated Press in a wide-ranging interview Monday that the “nightmare” and escalating death toll in Gaza must end and that Greece stands by Ukraine. He also says U.S. tariffs are not “good news.” Gerapetritis, whose country holds the presidency of the U.N. Security Council this month, said inequalities between nations and peoples are challenging “the essence of democracy and the rule of law.”",
      "publishedAt": "2025-05-20T04:15:41Z",
      "title": "Greece's top diplomat calls war in Gaza a 'nightmare'",
      "url": "https://apnews.com/article/greece-europe-ukraine-war-united-nations-trump-875bf985cbc4e2eb54d4b8fe45537301",
      "urlToImage": "https://dims.apnews.com/dims4/default/523acc9/2147483647/strip/true/crop/4410x2481+0+230/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F21%2F04f9b9386ad3d6b49c0afe2e0dbe%2F0cd8ca9a6b3c4eeb8553fe797c8a9a65"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}