{
  "articles": [
    {
      "author": null,
      "description": "U.S. immigration officials say they intend to deport Kilmar Abrego Garcia to Uganda, after he declined an offer to be deported to Costa Rica in exchange for remaining in jail and pleading guilty to human smuggling charges. Abrego Garcia's defense attorneys wrote in a Saturday court filing that the Costa Rica offer came on Thursday when it was clear he would likely be released the following day. After Abrego Garcia left jail on Friday, the Department of Homeland Security notified his attorneys that he would be deported to Uganda and should report to immigration authorities on Monday. Separately, prosecutors then gave him until Monday to accept the plea deal. His attorneys declined to say if he's still considering it.",
      "publishedAt": "2025-08-23T14:47:03Z",
      "title": "US seeks to deport Kilmar Abrego Garcia to Uganda after he refused plea offer, court filing shows",
      "url": "https://apnews.com/article/abrego-garcia-deportation-uganda-el-savador-1a94ad82d88ddda56d669ce86bc77ff4",
      "urlToImage": "https://dims.apnews.com/dims4/default/451c9b5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2Fe2%2Fbbe554091b20aa0d1cd979f22082%2Fd735ec074dc04cf9a6b8e904c244352b"
    },
    {
      "author": null,
      "description": "The Trump administration plans to deport Kilmar Abrego Garcia to Uganda after he declined a plea deal involving deportation to Costa Rica. This development follows his release from a Tennessee jail on Friday. Abrego Garcia's case has drawn attention amid President Trump's immigration crackdown. He was mistakenly deported in March and returned to the U.S. in June, only to face human smuggling charges. Homeland Security Secretary Kristi Noem criticized his release, vowing to ensure he faces justice. Abrego Garcia's attorneys argue the charges are vindictive, and a trial is set for January.",
      "publishedAt": "2025-08-21T22:52:09Z",
      "title": "Kilmar Abrego Garcia has been freed from jail",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-release-deportation-tennessee-maryland-9789a9ff1e8bd2dcf1e7a22d8ce2a7ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/451c9b5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2Fe2%2Fbbe554091b20aa0d1cd979f22082%2Fd735ec074dc04cf9a6b8e904c244352b"
    },
    {
      "author": null,
      "description": "Soon after arriving at a Gaza City hospital, Texas surgeon Mohammed Adeel Khaleel examined a 17-year-old with gunshot wounds sustained when he went to an aid site. The teen whose ribs protruded from his emaciated torso was just one of many patients showing signs of severe malnutrition. When doctors at Al-Ahli Hospital stabilized him, he raised his heavily bandaged hand and pointed to his empty mouth. He and other doctors didn't have to wait until the pronouncement Friday by the world’s leading authority on food crises that Gaza's largest city is gripped by famine. They see evidence of deprivation in the patients right in front of them.",
      "publishedAt": "2025-08-23T14:00:03Z",
      "title": "Doctors in Gaza say evidence of malnutrition is right in front of them",
      "url": "https://apnews.com/article/israel-palestinians-gaza-hospitals-hunger-famine-hamas-war-214626e2038bff28618fd964b2e9c539",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1a951d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F5e%2F60e01ceeab5487b3359b0dc64807%2F58ecc2b68dcc44fd8d4f34689dd485de"
    },
    {
      "author": null,
      "description": "Palestinians reported more deadly incidents near aid sites and in areas Israel plans to invade as it seeks control of Gaza’s largest city. Israeli forces on Sunday killed four aid seekers in a military zone where convoys have been overwhelmed by looters and desperate crowds traveling to an aid distribution point. Hospital officials and eyewitness reported the deaths in the Netzarim corridor as Palestinians in northern Gaza braces for a new Israeli offensive. Gaza City is the largest city in the besieged strip and where hundreds of thousands of displaced people are sheltering. Israel has invaded multiple times and believes a network of tunnels used by militants lie beneath the city.",
      "publishedAt": "2025-08-24T09:51:34Z",
      "title": "Israeli forces kill 4 more aid seekers as northern Gaza braces for looming offensive",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-08-24-2025-616dcac7f06b94119e692094d9515f16",
      "urlToImage": "https://dims.apnews.com/dims4/default/2df5f64/2147483647/strip/true/crop/5189x2919+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2F21%2F939d4603b40d2614570c8c8e855d%2F8e964e52c52442a8bd6791dc3a286e36"
    },
    {
      "author": null,
      "description": "Donald Trump ran on a promise to use the powers of the government for revenge against those he believed wronged him. He now appears to be fulfilling that campaign promise while threatening to expand his powers well beyond Washington. The actions look like the payback Trump said he would pursue after being hit with four separate sets of criminal charges during his four years out of office. Democrats and others fear Trump is wielding the authority of his office to intimidate his political opponents and consolidate power in a way unlike any other in American history. The White House says Trump “is restoring law and order.”",
      "publishedAt": "2025-08-23T16:23:06Z",
      "title": "Trump ran on a promise of revenge. He's making good on it",
      "url": "https://apnews.com/article/trump-justice-department-revenge-bolton-military-deployments-aa2b977621bce563770b60dade581f79",
      "urlToImage": "https://dims.apnews.com/dims4/default/f48d879/2147483647/strip/true/crop/8302x4670+0+432/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fbe%2F58b45dcc8840f1aa48819c1e0ed1%2F69fc7e8fa5ff4833b817097af61a3ef8"
    },
    {
      "author": null,
      "description": "The push to redraw congressional maps in Texas is shifting the dynamics of the state’s 2026 Senate campaign. It is renewing hope for Democrats as they gain attention for pushing back against the GOP redistricting efforts led by President Donald Trump. Republican rivals are using the moment to burnish their leadership credentials. Texas Democrats have ended a two-week walkout aimed at stopping a Republican effort to redraw districts before the 10-year timeline in order to secure Trump more allies in the U.S. House during the 2026 midterms.",
      "publishedAt": "2025-08-23T04:01:36Z",
      "title": "Texas redistricting fight shakes up US Senate race",
      "url": "https://apnews.com/article/texas-redistricting-79633b09731bcb286027e14df97bc73a",
      "urlToImage": "https://dims.apnews.com/dims4/default/da2f794/2147483647/strip/true/crop/5107x2873+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Ff0%2F7db99f37d75b9015ccc9e684b634%2Faf127ba0cfec467fadfd56970fef5dbf"
    },
    {
      "author": null,
      "description": "Now that Federal Reserve Chair Jerome Powell has signaled that the central bank could soon cut its key interest rate, he faces a new challenge: how to do it without seeming to cave to the White House’s demands. For months, Powell has largely ignored President Donald Trump’s relentless hectoring that he reduce borrowing costs. Yet on Friday, in a highly-anticipated speech, Powell suggested that the Fed could take such a step as soon as its next meeting in September. It will be a fraught decision for the Fed, which must weigh it against persistent inflation that remains a problem and an economy that could also improve in the second half of this year. Both trends, if they occur, could make a cut look premature.",
      "publishedAt": "2025-08-23T04:01:06Z",
      "title": "Fed Chair Powell faces fresh challenges to Fed independence amid potential rate cuts",
      "url": "https://apnews.com/article/federal-reserve-inflation-trump-powell-b60a9fce3046bfa5a9cbd7745e002996",
      "urlToImage": "https://dims.apnews.com/dims4/default/708adc4/2147483647/strip/true/crop/3331x1874+0+174/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F50%2F555e8c0922c4aba1da57debb9564%2F1f04b0fbc7f74ab7b81b3da87e68f139"
    },
    {
      "author": null,
      "description": "Pope Leo XIV has strongly affirmed the rights of the weakest against the ambitions of the powerful. He delivered the message during an audience Saturday with refugees from Chagos, a contested Indian Ocean archipelago that is home to a strategic U.S.-U.K. military base. Leo strongly affirmed the right of the Chagossian people to return to their homes and hailed the recent treaty with Mauritius about the island's future as symbolically important on the international stage. Leo met with a delegation of refugees from Chagos, some 2,000 of whom who were evicted from their homes by Britain in the 1960s and 1970s so the U.S. could build a naval and bomber base on the largest of the islands, Diego Garcia.",
      "publishedAt": "2025-08-23T11:25:24Z",
      "title": "Pope meets with Chagos refugees and delivers message about rights of the weak against the powerful",
      "url": "https://apnews.com/article/pope-vatican-chagos-britain-6f800eca49ea1c86df700eac48915337",
      "urlToImage": "https://dims.apnews.com/dims4/default/653914d/2147483647/strip/true/crop/6050x3403+0+315/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2Fe1%2F1d30b51fb3bcd2ea35534ae8d76f%2Fbe8d2ce5dcf944a9be0e5e217bd60f59"
    },
    {
      "author": null,
      "description": "Texas Gov. Greg Abbott has promised to sign a new congressional voting map designed to help Republicans maintain their slim majority in Congress. Texas lawmakers approved the map early Saturday, adding five new districts favoring Republicans. Democrats have vowed to challenge it in court. The move is part of a broader national effort, with governors from both parties redrawing maps to gain advantages in the 2026 midterm elections. In California, Gov. Gavin Newsom has approved a special election for a redrawn map to help Democrats win more seats.",
      "publishedAt": "2025-08-23T14:57:20Z",
      "title": "Texas Gov. Abbott vows to approve GOP-leaning congressional voting map",
      "url": "https://apnews.com/article/california-texas-redistricting-trump-map-congress-b6222dd39c494c9ab48beafabc66dc35",
      "urlToImage": "https://dims.apnews.com/dims4/default/e73b65a/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2F7a%2F1d2d645195bb9bf138111cf3fb2f%2Fc4a13ea09da440ec8e88df97cdf1273f"
    },
    {
      "author": null,
      "description": "The Texas Senate has begun debate on a newly drawn congressional map favoring Republicans. They GOP-controlled chamber could give final passage of the map and send it to Gov. Greg Abbott's desk for final approval. California landed its counterpunch on Thursday by voting along party lines Thursday to approve legislation calling for a special election in November to approve a redrawn congressional map designed to help Democrats win five more U.S. House seats next year. That move came after Texas Republicans advanced their own redrawn map to pad their House majority by the same number of seats at the urging of President Donald Trump.",
      "publishedAt": "2025-08-22T13:19:11Z",
      "title": "Texas set to approve new congressional map after California's countermove",
      "url": "https://apnews.com/article/california-texas-redistricting-f93a49178fd3b9cba00880b9c9231799",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ffa5d9/2147483647/strip/true/crop/3536x1989+0+184/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2Fd1%2Fec0aace0b3302be99940a774b8be%2F3d555153a8c346428fdf950a078c0b80"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}