{
  "articles": [
    {
      "author": "SARAH EL DEEB",
      "description": "DAMASCUS (AP) — At Damascus’ international airport, the new head of security — one of the rebels who marched across Syria to the capital — arrived with his team.",
      "publishedAt": "2024-12-15T05:04:09Z",
      "title": "One week into a new Syria, rebels aim for normalcy and Syrians vow not to be silent again",
      "url": "https://apnews.com/c06673aa3317a194619710948264cdf1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31b428c55aa7422e845cf22d92e028bb/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "DAMASCUS, Syria (AP) — In churches across long-stifled Syria, Christians marked the first Sunday services since the collapse of Bashar Assad 's government in an air of transformation.",
      "publishedAt": "2024-12-15T10:30:14Z",
      "title": "Christians in Syria mark country's transformation with tears as UN envoy urges an end to sanctions",
      "url": "https://apnews.com/3f0031108d7e58c2343bd6a8fd42254c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e03e468c9fd4468585ba343b71d2f57a/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS and DAVE COLLINS",
      "description": "BOSTON (AP) — After weeks of fear and bewilderment about the drones buzzing over parts of New York and New Jersey, elected officials are urging action to identify and stop the mysterious flights.",
      "publishedAt": "2024-12-15T18:33:09Z",
      "title": "US agencies should use advanced technology to identify mysterious drones, Schumer says",
      "url": "https://apnews.com/80de1d64708677cfa7efc60249075d7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f3b17660cbc4330a54628816e1857b3/1920.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "AKRON, Ohio (AP) — Before the November presidential election, Ohio's secretary of state and attorney general announced investigations into potential voter fraud that included people suspected of casting ballots even though they were not U.S.",
      "publishedAt": "2024-12-15T12:50:33Z",
      "title": "The GOP stoked fears of noncitizens voting. Cases in Ohio show how rhetoric and reality diverge",
      "url": "https://apnews.com/ae9dafeeb47ea8941bf82f5988b269ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2df8b20fc1d3451cab522db7bd8dc5d9/3000.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — A tornado near a mall in central California swept up cars, uprooted trees and sent several people to the hospital. In San Francisco, authorities issued the first-ever tornado warning.",
      "publishedAt": "2024-12-15T08:20:40Z",
      "title": "Storms across US bring heavy snow, dangerous ice and a tornado in California",
      "url": "https://apnews.com/46d9848b6908aed8f79d0e1064699ee0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/708e9049eb9f4c8cae537de61f83f1fe/1026.jpeg"
    },
    {
      "author": "RICK CALLAHAN",
      "description": "INDIANAPOLIS (AP) — Indiana officials are preparing to execute the state's first death row inmate in 15 years, who was convicted a quarter-century ago of killing his brother and three other men.Joseph Corcoran, 49, has been on Indiana's death row since 1999.",
      "publishedAt": "2024-12-15T05:12:57Z",
      "title": "After a 15-year pause in executions, Indiana prepares to put to death a man who killed 4",
      "url": "https://apnews.com/aaf0dea682859a61bec88080aeb5171a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/631d8640ea36435ba81af75fd7dbe75f/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and NATALIE MELZER",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel said Sunday it will close its embassy in Ireland as relations deteriorated over the war in Gaza, where Palestinian medical officials said new Israeli airstrikes killed over 46 people including several children.",
      "publishedAt": "2024-12-15T15:57:55Z",
      "title": "Israel will close its Ireland embassy over Gaza tensions as Palestinian death toll nears 45,000",
      "url": "https://apnews.com/b97bfffe851f87328ab24017da8d7a32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63465114c0d44461a250d62e07ed918c/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s opposition leader offered Sunday to work with the government to ease the political tumult as officials sought to reassure allies and markets, a day after the opposition-controlled parliament voted to impeach conservative President Yoon Suk Yeol over a short-lived attempt to impose martial law.",
      "publishedAt": "2024-12-15T02:35:44Z",
      "title": "South Korean leaders seek calm after Yoon is impeached",
      "url": "https://apnews.com/ca583315453be30766372702120f94e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e50da849fcb44ce6b0aae2c91fb06d40/3000.jpeg"
    },
    {
      "author": "MAE ANDERSON",
      "description": "After the busy Black Friday holiday weekend, Kristen Tarnol, owner of Emerald City Gifts in Studio City, California, is already asking her supplier to send more more fuzzy alpaca scarves and warm slippers that were best sellers over the weekend.",
      "publishedAt": "2024-12-15T15:00:27Z",
      "title": "Small businesses say cautious shoppers are seeking 'cozy' and 'festive' this holiday season",
      "url": "https://apnews.com/307a9f2ad66cf05ee1a848530aaab36a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e36e89aa99d408b8f440ed3501854cf/3000.jpeg"
    },
    {
      "author": "PAOLO SANTALUCIA and SILVIA STELLACCI",
      "description": "AJACCIO, Corsica (AP) — Pope Francis on the first papal visit ever to the French island of Corsica on Sunday called for a dynamic form of laicism, promoting the kind of popular piety that distinguishes the Mediterranean island from secular France as a bridge between religious and civic society.",
      "publishedAt": "2024-12-15T06:07:43Z",
      "title": "Pope Francis makes 1st papal visit to France's Corsica awash in expressions of popular piety",
      "url": "https://apnews.com/1422ac7938a526d02a82f739a51bcfcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77fd6cc0718e4dfa8f0ab0555577f23e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}