{
  "articles": [
    {
      "author": "AAMER MADHANI, COLLEEN LONG and DIDI TANG",
      "description": "WOODSIDE, Calif. (AP) — U.S. President Joe Biden and China’s Xi Jinping emerged Wednesday from their first face-to-face meeting in a year vowing to stabilize their fraught relationship and showcasing modest agreements to combat illegal fentanyl and re-establish military communications.",
      "publishedAt": "2023-11-15T08:09:25Z",
      "title": "Biden, Xi met for hours and agreed to 'pick up the phone' for any urgent concerns: 'That's progress'",
      "url": "https://apnews.com/58d11e7e3902955302182c2bc41430e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/577c5f7f0da34e619b68c23ace246dda/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and ZEKE J. MILLER",
      "description": "WASHINGTON (AP) — It was a meeting a year in the making. President Joe Biden and Chinese President Xi Jinping sat down together on Wednesday just outside of San Francisco, where Asian leaders gathered for an annual summit.",
      "publishedAt": "2023-11-16T01:49:41Z",
      "title": "Takeaways from Biden's long-awaited meeting with Xi",
      "url": "https://apnews.com/c8384d40661a32aa276ec8ca97f35003",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fe5b19c935f473db1febf5a39638585/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli troops on Wednesday stormed into Gaza’s largest hospital, searching for traces of Hamas inside and beneath the facility, where newborns and hundreds of other patients have suffered for days without electricity and other basic necessities.",
      "publishedAt": "2023-11-15T06:27:20Z",
      "title": "Israel searches for traces of Hamas in raid of key Gaza hospital packed with patients",
      "url": "https://apnews.com/b85e828db648f5f911278fa217e827e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07a57f13cb954df9ada9894995880c96/1920.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — As concerns grow for patients stranded inside Gaza’s biggest hospital, experts warned that transporting vulnerable people, including babies, is a perilous proposition under even the best circumstances.",
      "publishedAt": "2023-11-15T20:18:23Z",
      "title": "Supplies alone won’t save Gaza hospital patients and evacuation remains perilous, experts say",
      "url": "https://apnews.com/a547cd2ad7e8e361fb48eb611d2c8287",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1769b23d94674a63ae6383ed414060e7/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — After raiding the Gaza Strip’s largest hospital, Israel appears close to completing its takeover of the besieged territory’s northern sector, which it has described as the headquarters of the ruling Hamas militant group.",
      "publishedAt": "2023-11-15T21:27:55Z",
      "title": "The Israeli military has set its sights on southern Gaza. Problems loom in next phase of war",
      "url": "https://apnews.com/29388314e3286b2b0f1152f7d15e2d7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87c3f80d6a3e45d3a26155c381b0df64/3000.jpeg"
    },
    {
      "author": "MIKE PESOLI and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Police in the nation's capital responded Wednesday night to a protest outside the headquarters of the Democratic National Committee calling for a cease-fire in the Israel-Hamas war.",
      "publishedAt": "2023-11-16T02:11:30Z",
      "title": "Police make arrests after protest outside Democratic HQ calling for cease-fire in Israel-Hamas war",
      "url": "https://apnews.com/3040090acfc9df2f061e5079b952cdaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/798cdf41e50d4453b89a4690d771a838/3000.jpeg"
    },
    {
      "author": "RIO YAMAT",
      "description": "LAS VEGAS (AP) — A 17-year-old high school student in Las Vegas was beaten to death in an alleyway around the corner from campus by 10 of his classmates between the ages of 13 and 17, a prearranged fight that authorities said broke out over a pair of headphones and a vape pen.",
      "publishedAt": "2023-11-15T19:54:27Z",
      "title": "Las Vegas high school student beaten to death by 10 classmates between 13 and 17, police say",
      "url": "https://apnews.com/6b76537493522f736bccf40861874af3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24cfcdeebe4d473f8d5e2ef9e2125119/3000.jpeg"
    },
    {
      "author": "SARAH BRUMFIELD, ERIK VERDUZCO and HANNAH SCHOENBAUM",
      "description": "CHARLOTTE, N.C. (AP) — A video circulating on social media shows a North Carolina police officer repeatedly striking a Black woman during an arrest while several other officers hold her down, and although the department contends that the officer was “intentional” about where he hit the woman to get her to comply, the police chief acknowledged Wednesday that he understands \"the outrage.\"",
      "publishedAt": "2023-11-15T15:55:59Z",
      "title": "Video shows North Carolina officer repeatedly striking a pinned woman during her arrest",
      "url": "https://apnews.com/1503f21c5b6ba6058e6dbf5b9cf2616d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d25523f9975f4b01976d8f97b7a10682/3000.jpeg"
    },
    {
      "author": "EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A heavily armed gang surrounded a hospital in Haiti on Wednesday, trapping women, children and newborns inside until police rescued them, according to the director of the medical center, who pleaded for help via social media.",
      "publishedAt": "2023-11-15T20:37:31Z",
      "title": "Heavily armed Haitian gang surrounds hospital in capital and traps people inside",
      "url": "https://apnews.com/770ea717b1400705d064c26ecb45234d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b60580bf47fc4f83b79d659af6781b87/3000.jpeg"
    },
    {
      "author": "MIKE FITZPATRICK",
      "description": "NEW YORK (AP) — After several close calls, Gerrit Cole finally won his first American League Cy Young Award on the strength of consistent excellence all season.Blake Snell joined a short list of pitching royalty by turning around a terrible start.",
      "publishedAt": "2023-11-15T23:34:58Z",
      "title": "Gerrit Cole a unanimous winner of his 1st AL Cy Young Award. Blake Snell takes the NL prize",
      "url": "https://apnews.com/5d26ae2fdccb0d6eb6496068d6161deb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0e40bf7223c4d328e1999f5f28607be/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}