{
  "articles": [
    {
      "author": "SAM METZ",
      "description": "RABAT, Morocco (AP) — A rare, powerful earthquake struck Morocco late Friday night, killing hundreds of people and damaging buildings from villages in the Atlas Mountains to the historic city of Marrakech.",
      "publishedAt": "2023-09-08T23:08:13Z",
      "title": "Powerful earthquake strikes Morocco, killing hundreds and damaging historic buildings in Marrakech",
      "url": "https://apnews.com/7f4a503009dede0dec0208c08d6b100b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b613d31da23641fd9f0918cb3e5b0947/3000.jpeg"
    },
    {
      "author": "ADAM SCHRECK and DAVID RISING",
      "description": "NEW DELHI (AP) — Leaders of many of the world's biggest economies prepared to huddle in the Indian capital for the Group of Twenty summit Saturday, though growing global rifts and the absence of key players meant that reaching consensus on the thorniest issues could prove elusive.",
      "publishedAt": "2023-09-09T03:38:06Z",
      "title": "India hopes for progress on global agenda as G20 leaders meet despite rifts over the war in Ukraine",
      "url": "https://apnews.com/f0054ecaea54f53d4ceb0c64a4457620",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eab845e8ed484c568f72dad8f447bdff/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "NEW DELHI (AP) — President Joe Biden and his allies plan to roll out plans on Saturday for a shipping corridor that would connect India with the Middle East and ultimately Europe — a possible game changer for global trade to be announced at the Group of 20 summit.",
      "publishedAt": "2023-09-09T03:58:54Z",
      "title": "Biden and Modi to announce rail and shipping project to link India to Middle East and Europe",
      "url": "https://apnews.com/eb8988dfbd6c9c6f2c411c893d548333",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d879be10b9c4cf798bd519ddb2e76e7/3000.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "NARVA, Estonia (AP) — At the Ivangorod-Narva border crossing, the last glimpse of Russia is of a sprawling fortress and the first sight of Estonia is another fortress on the other bank of a slender river.",
      "publishedAt": "2023-09-09T04:20:47Z",
      "title": "For nearly a quarter century, an AP correspondent watched the Putin era unfold in Russia",
      "url": "https://apnews.com/9efd1c2bc2d9504f82893aa450c7531e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8c6a63408f047c3b02ba52e3ae7438f/3000.jpeg"
    },
    {
      "author": "EVELYNE MUSAMBI, FARNOUSH AMIRI, CARA ANNA and ELLEN KNICKMEYER",
      "description": "NAIROBI, Kenya (AP) — The graves at the edge of the orphanage tell a story of despair. The rough planks in the cracked earth are painted with the names of children, most of them dead in the 1990s. That was before the HIV drugs arrived.",
      "publishedAt": "2023-09-09T04:34:49Z",
      "title": "Republicans' opposition to abortion threatens a global HIV program that has saved 25 million lives",
      "url": "https://apnews.com/d9ef380acba1a0e96409197b39dea7fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4950d9f6b3b34d759dbdfc434b3e4653/3000.jpeg"
    },
    {
      "author": "JEFF MARTIN",
      "description": "ATLANTA (AP) — Hurricane Lee is rewriting old rules of meteorology, leaving experts astonished at how rapidly it grew into a goliath Category 5 hurricane.Lee could also be a dreadful harbinger of what is to come as ocean temperatures climb, spawning fast-growing major hurricanes that could threaten communities farther north and farther inland, experts say.",
      "publishedAt": "2023-09-09T04:16:05Z",
      "title": "Hurricane Lee is charting a new course in weather and could signal more monster storms",
      "url": "https://apnews.com/36e45b46071f8b68fd7a83a6d4936a51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffbb5b346d66457da8aa847b251ddad8/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — New Mexico Gov. Michelle Lujan Grisham on Friday issued an emergency order suspending the right to carry firearms in public across Albuquerque and the surrounding county for at least 30 days in response to a spate of gun violence.",
      "publishedAt": "2023-09-08T23:41:48Z",
      "title": "New Mexico governor issues order suspending the right to carry firearms in public across Albuquerque",
      "url": "https://apnews.com/fc5b4b79bf411b8022c3ad58975724d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10250869097648b1969425058d4eb873/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER and MORGAN LEE",
      "description": "SANTA FE, N.M (AP) — During the 2020 census, Native American leaders across the U.S. invested time and resources to make sure their members were tallied during the head count, which determines political power and federal funding.",
      "publishedAt": "2023-09-09T04:05:28Z",
      "title": "Tribal nations face less accurate, more limited 2020 census data because of privacy methods",
      "url": "https://apnews.com/f4fc2869a39a57485220cf2a0ebce18d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cae059836bb4f9c8b495aa25bb3da9b/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — Updated COVID-19 vaccines are coming soon, just in time to pair them with flu shots.",
      "publishedAt": "2023-09-09T04:29:29Z",
      "title": "Updated COVID shots are coming. They're part of a trio of vaccines to block fall viruses",
      "url": "https://apnews.com/2a55728638c1c0879ce58deeeb0196bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61d547d06bbb419bb16f1cc8fce3bc18/2945.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korea invited visiting Chinese delegates and Russian artists to a paramilitary parade featuring rocket launchers pulled by trucks and tractors, state media said Saturday, in leader Kim Jong Un's latest effort to display his ties with Moscow and Beijing in the face of deepening confrontations with Washington.",
      "publishedAt": "2023-09-09T03:47:43Z",
      "title": "Kim Jong Un hosts Chinese and Russian guests at a parade celebrating North Korea's 75th anniversary",
      "url": "https://apnews.com/78a201eca07034d6eec131224aab92c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a4c8c0be8a34398930435baada03f2b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}