{
  "articles": [
    {
      "author": "ERIC TUCKER, JIM MUSTIAN, KEVIN McGILL and JACK BROOK",
      "description": "NEW ORLEANS (AP) — The FBI now says that the pickup truck driver responsible for a deadly rampage in New Orleans acted alone.Officials said Wednesday that they were seeking additional potential suspects in an attack being investigated as an act of terrorism.",
      "publishedAt": "2025-01-02T05:21:00Z",
      "title": "FBI now says driver responsible for deadly New Orleans rampage acted alone",
      "url": "https://apnews.com/5bbf5fdc715c4d0d4c8764dd8da22720",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30276dc076b941a1bc8b545207ba2049/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — The FBI now says the New Orleans truck attacker acted alone in an “act of terrorism” when he drove a pickup truck into a crowd of New Year’s revelers early Wednesday, killing 15 people.",
      "publishedAt": "2025-01-02T13:32:37Z",
      "title": "The Latest: The FBI now says the New Orleans truck attacker acted alone in an 'act of terrorism'",
      "url": "https://apnews.com/979e26706ecd35aba6bc60379263c15c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4a394794a97401a89ba0e527e46894b/3000.jpeg"
    },
    {
      "author": "TARA COPP, ALANNA DURKIN RICHER, COLLEEN LONG and TY ONEIL",
      "description": "LAS VEGAS (AP) — The person who died in the explosion of a Tesla Cybertruck packed with explosives outside President-elect Donald Trump’s Las Vegas hotel was an active-duty U.S. Army soldier, officials said Thursday.",
      "publishedAt": "2025-01-02T15:38:48Z",
      "title": "The man who died in a Tesla Cybertruck explosion was an active-duty US Army soldier, officials say",
      "url": "https://apnews.com/5c5a8fd13a50e2bcde46370ae926d427",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d5b0a1cb17947c188eb1e57ebad2300/1920.jpeg"
    },
    {
      "author": null,
      "description": "DETROIT (AP) — Tesla’s global annual sales fell for the first time in at least 9 years, with a 2.3% increase in the final quarter not enough to overcome a sluggish start to 2024 despite offers of 0% financing, free charging and low-priced leases.",
      "publishedAt": "2025-01-02T14:24:21Z",
      "title": "Tesla reports 1.1% sales drop for 2024, first annual decline in at least 9 years",
      "url": "https://apnews.com/69af17c4e606625694af8293db25b2f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54ca5d4eb019472ba63699f6f74dbb84/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY",
      "description": "LONDON (AP) — A worker digging up clay in a southern England limestone quarry noticed unusual bumps that led to the discovery of a “dinosaur highway” and nearly 200 tracks that date back 166 million years, researchers said Thursday.",
      "publishedAt": "2025-01-02T15:17:51Z",
      "title": "'Dinosaur highway' tracks dating back 166 million years are discovered in England",
      "url": "https://apnews.com/9fd0499419db0950099e6413a1936488",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66eda2f228a64f859030264d5e8069da/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Mike Johnson is fighting for his political life, again. The Louisiana Republican's hold on the House speaker's gavel and his position as second in line to the presidency will be tested Friday when a new Congress convenes and House Republicans weigh whether to reelect him to the post.",
      "publishedAt": "2025-01-02T12:43:14Z",
      "title": "Why Mike Johnson's bid to remain House speaker could be a struggle despite Trump's support",
      "url": "https://apnews.com/0e0b5613f1d39f4e1405a475fdfea8ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/014c5738b02a4041adbbcf13f4b252dc/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Impeached South Korean President Yoon Suk Yeol, in a message to conservative supporters rallying outside his Seoul residence, vowed to “fight to the end” against “anti-state forces,” while his legal team warned Thursday that police officers attempting to detain him could face arrest by his presidential security service or even civilians.",
      "publishedAt": "2025-01-02T04:02:34Z",
      "title": "Impeached South Korean president issues defiant message as he faces possible detention",
      "url": "https://apnews.com/1779809dc6b2c7e5a9478bac17ca7585",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10db29dfcdc64032a3d4345cf026bc7c/1920.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD, LAURA UNGAR and MIKE STOBBE",
      "description": "Five years ago, a cluster of people in Wuhan, China, fell sick with a virus never before seen in the world.The germ didn't have a name, nor did the illness it would cause. It wound up setting off a pandemic that exposed deep inequities in the global health system and reshaped public opinion about how to control deadly emerging viruses.",
      "publishedAt": "2025-01-02T15:34:45Z",
      "title": "5 things we know and still don't know about COVID, 5 years after it appeared",
      "url": "https://apnews.com/1ae8a7b3e6e034e03722f17e7aad34cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab578f1bb37340ebbe3d8044a4ccfb55/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Jenniffer González Colón was sworn in Thursday as Puerto Rico’s new governor as the island prepared for a normally ebullient ceremony overshadowed by widespread anger over a blackout that hit the U.S.",
      "publishedAt": "2025-01-02T13:22:27Z",
      "title": "Puerto Rico swears in new governor days after major blackout hit island",
      "url": "https://apnews.com/84afbbfa537b23f35494df0127b20c2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18040691e1ee4b84ac1f670d160aa71a/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Say hello to the latest dog in the American Kennel Club's lineup of recognized breeds.",
      "publishedAt": "2025-01-02T13:03:15Z",
      "title": "Meet the Danish-Swedish farmdog, the newest breed in the American Kennel Club's lineup",
      "url": "https://apnews.com/8e238bb973e47cafd3de303a45a3c2aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb98890ca48f4392972570701d4fbe72/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}