{
  "articles": [
    {
      "author": "CHRIS MEGERIAN, STEPHEN GROVES, JILL COLVIN and JOSH BOAK",
      "description": "WASHINGTON (AP) — After days of threats and demands, Donald Trump had little to show for it once lawmakers passed a budget deal in the early hours of Saturday, narrowly averting a pre-Christmas government shutdown.",
      "publishedAt": "2024-12-21T20:38:59Z",
      "title": "What Trump's decision to wade into spending fight tells us about the next 4 years",
      "url": "https://apnews.com/e0258d31a9018c7af09afc11a8634707",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f57511b8ab4a478ca4171ec71e155388/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Two U.S. Navy pilots were shot down Sunday over the Red Sea in an apparent “friendly fire” incident, the U.S military said, marking the most serious incident to threaten troops in over a year of America targeting Yemen's Houthi rebels.",
      "publishedAt": "2024-12-22T02:57:03Z",
      "title": "Two US Navy pilots shot down over Red Sea in apparent 'friendly fire' incident, US military says",
      "url": "https://apnews.com/95a792daae3b0120186bfc6c66e1b6fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e683e86545a545a4ba0a968a30311969/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and WAAFA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — A rocket fired from Yemen hit an area of Tel Aviv overnight, leaving 16 people injured by shattered glass, the Israeli military said Saturday, days after Israeli airstrikes hit Houthi rebels who have been launching missiles in solidarity with Palestinians in Gaza.",
      "publishedAt": "2024-12-21T07:39:32Z",
      "title": "A rocket from Yemen strikes Tel Aviv, injuring 16, and Palestinians mourn a dozen children in Gaza",
      "url": "https://apnews.com/bffc2f7ae556942e2e6760720d63038c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27ebbf20e5784e2094accca1f247bde7/1920.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER, GEIR MOULSON and VANESSA GERA",
      "description": "MAGDEBURG, Germany (AP) — Germans on Saturday mourned the victims of an apparent attack in which authorities say a doctor drove into a busy outdoor Christmas market, killing five people, injuring 200 others and shaking the public’s sense of security at what would otherwise be a time of joy.",
      "publishedAt": "2024-12-21T07:18:27Z",
      "title": "Germans mourn the 5 killed and 200 injured in the apparent attack on a Christmas market",
      "url": "https://apnews.com/32ec923f21cccb2a34e287da42ced921",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/122139f820174605ac42b65044ab7176/1920.jpeg"
    },
    {
      "author": "JEAN-YVES KAMALE and WILSON McMAKIN",
      "description": "KINSHASA, Congo (AP) — A ferry overloaded with people returning home for Christmas capsized on the Busira River in northeastern Congo, leaving 38 people confirmed dead and over 100 others missing, officials and eyewitnesses said Saturday.",
      "publishedAt": "2024-12-21T20:08:16Z",
      "title": "38 people are dead and over 100 missing in Congo after a ferry capsizes on the Busira River",
      "url": "https://apnews.com/ac222ab809e107b119a8e86f1d5aa3f2",
      "urlToImage": ""
    },
    {
      "author": "GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — A crash between a passenger bus and a truck early Saturday killed 38 people on a highway in Minas Gerais, a state in southeastern Brazil, officials said.",
      "publishedAt": "2024-12-21T13:55:30Z",
      "title": "38 people die in a crash between a passenger bus and a truck in Brazil",
      "url": "https://apnews.com/b521a7fc2626f6b1faaa177d8b8c0fdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e5c1d25d5d04195a55971e59e186d3a/1920.jpeg"
    },
    {
      "author": "JOSH DUBOW",
      "description": "OAKLAND, Calif. (AP) — Hall of Famer Rickey Henderson, the brash speedster who shattered stolen base records and redefined baseball's leadoff position, has died.",
      "publishedAt": "2024-12-21T23:20:24Z",
      "title": "Hall of Famer Rickey Henderson, baseball's stolen base king, has died at 65",
      "url": "https://apnews.com/bdeb785acf343e95fc53d008b2f8803e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3b8bcb7cd6f4e2296495901b47a34d2/3000.jpeg"
    },
    {
      "author": "FLORENCE MIETTAUX",
      "description": "AYOD, South Sudan (AP) — Long-horned cattle wade through flooded lands and climb a slope along a canal that has become a refuge for displaced families in South Sudan.",
      "publishedAt": "2024-12-22T04:08:20Z",
      "title": "As flooding becomes a yearly disaster in South Sudan, thousands survive on the edge of a canal",
      "url": "https://apnews.com/dde718e68427f931d08eb0fb35f3927d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d9089a0ecee46b694c2d91b37e8c13f/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU and JINTAMAS SAKSORNCHAI",
      "description": "SURIN ISLANDS, Thailand (AP) — When Hook was a child, he started his days by jumping off the boat that his family lived on and into the ocean. By age 3, he could already swim and dive in shallow waters.",
      "publishedAt": "2024-12-22T02:41:06Z",
      "title": "The water was their livelihood. Now Thailand's sea nomads work to preserve a vanishing way of life",
      "url": "https://apnews.com/01bbf0c099652e6bd7f67ef191b73e8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe7d1e68e6604feb956e5b5e435b3924/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK, ADRIENNE SURPRENANT and THOMAS ADAMSON",
      "description": "MAMOUDZOU, Mayotte (AP) — One week after its worst cyclone in nearly a century, and a day after a testy presidential visit, France’s impoverished Indian Ocean territory of Mayotte is still grappling with counting the dead, restoring essential services and aiding a beleaguered population.",
      "publishedAt": "2024-12-21T11:25:11Z",
      "title": "France's Mayotte struggles to recover as cyclone overwhelms hospitals",
      "url": "https://apnews.com/284271ed0dcf66626533df49e9dfb23f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb7d2d177f07435ea5719e8fc062f3fc/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}