{
  "articles": [
    {
      "author": "FARNOUSH AMIRI, LISA MASCARO and ERIC TUCKER",
      "description": "WASHINGTON (AP) — House Republicans launched a formal impeachment hearing Thursday against President Joe Biden, saying they intend to “provide accountability” as they make their case to the public, their colleagues and skeptics in the Senate.",
      "publishedAt": "2023-09-28T04:02:58Z",
      "title": "House Republicans make their case for President Biden impeachment inquiry at first hearing",
      "url": "https://apnews.com/51576c5fe4294be2605a14fa81075196",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/209d294f3a8940aa883942a73c2d8a51/1920.jpeg"
    },
    {
      "author": "ERIC GAY, MATTHEW LEE and LOLITA C. BALDOR",
      "description": "SAN ANTONIO (AP) — The American soldier who sprinted into North Korea across the heavily fortified border between the Koreas more than two months ago was whisked to a Texas Army base Thursday for medical checks and interviews after his return to the U.S., according to the Pentagon.",
      "publishedAt": "2023-09-28T08:38:34Z",
      "title": "The American soldier who bolted into North Korea 2 months ago has returned to the US",
      "url": "https://apnews.com/746487710c11a812f33ad25d60861b1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c919a84371224c0994e685ceef219c28/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — With calls for his resignation increasing, New Jersey Sen. Robert Menendez is expected on Thursday to address his Democratic Senate colleagues for the first time since he was indicted on federal bribery charges.",
      "publishedAt": "2023-09-28T17:17:00Z",
      "title": "Menendez will address Senate colleagues about his bribery charges as calls for his resignation grow",
      "url": "https://apnews.com/19e927d60aa5a014889ceb76ef756e56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10a6390963b24d7f907b36d32a6e6db6/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The FBI and other government agencies should be required to get court approval before reviewing the communications of U.S. citizens collected through a secretive foreign surveillance program, a sharply divided privacy oversight board recommended on Thursday.",
      "publishedAt": "2023-09-28T15:17:40Z",
      "title": "A key US government surveillance tool should face new limits, a divided privacy oversight board says",
      "url": "https://apnews.com/e3cc13ea55680ad185c642d7dadbd37c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/404a099a75a84782a6ee07357793d1a5/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "Lawmakers probing the cause of last month’s deadly Maui wildfire did not get many answers during Thursday's congressional hearing on the role the electrical grid played in the disaster.",
      "publishedAt": "2023-09-28T04:56:03Z",
      "title": "Many questions but few answers in congressional hearing on Maui's wildfire and electric provider",
      "url": "https://apnews.com/cbd21597b63c74660210c552e833bdab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97fb1c96a8b944eb9f123e9df371d7c7/3000.jpeg"
    },
    {
      "author": "SYLVIA HUI",
      "description": "LONDON (AP) — Michael Gambon, the Irish-born actor knighted for his illustrious career on the stage and screen and who went on to gain admiration from a new generation of moviegoers with his portrayal of Hogwarts headmaster Albus Dumbledore in six of the eight “Harry Potter” films, has died.",
      "publishedAt": "2023-09-28T11:53:07Z",
      "title": "Michael Gambon, veteran actor who played Dumbledore in 'Harry Potter' films, dies at age 82",
      "url": "https://apnews.com/00aa748c527249a2b5cb906b5ca35965",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddd8b758ef27443c9795fc9bf92b0e09/1920.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and JILL COLVIN",
      "description": "PHOENIX (AP) — Republican Kari Lake, a Donald Trump ally who has refused to acknowledge her loss in last year's race for Arizona governor, will soon launch her campaign for the U.S.",
      "publishedAt": "2023-09-28T14:31:57Z",
      "title": "Kari Lake, prominent Trump supporter and election denier, will launch US Senate campaign in Arizona",
      "url": "https://apnews.com/b5b4432a2df99c605800edad4ab73194",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c536872b0e7446daa3928650443ff1b2/3000.jpeg"
    },
    {
      "author": "ADAM BEAM",
      "description": "SACRAMENTO, Calif. (AP) — California fast food workers will be paid at least $20 per hour next year under a new law signed Thursday by Democratic Gov. Gavin Newsom.When it takes effect on April 1, fast food workers in California will have among the highest minimum wages in the country, according to data compiled by the University of California-Berkeley Center for Labor Research and Education.",
      "publishedAt": "2023-09-28T17:39:46Z",
      "title": "California Gov. Gavin Newsom signs law to raise minimum wage for fast food workers to $20 per hour",
      "url": "https://apnews.com/69c26b7f07f2647149c37677446cea30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7ceb3db1cd84b0ca6c8e06b31b07799/3000.jpeg"
    },
    {
      "author": "ALEX VEIGA",
      "description": "LOS ANGELES (AP) — Home loan borrowing costs climbed again this week, pushing the average long-term U.S. mortgage rate to its highest level in nearly 23 years, another blow to prospective homebuyers facing an increasingly unaffordable housing market.",
      "publishedAt": "2023-09-28T16:08:26Z",
      "title": "The average long-term US mortgage rate reaches highest point in nearly 23 years, hitting 7.31%",
      "url": "https://apnews.com/5df67ae00ba1ec32f8b99762df19d933",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/241a2f455ac24753ba86ea2ab044b612/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — There are rock stars, and then there is Ringo Starr — drummer for the Beatles, award-winning soloist, photographer, narrator, actor, activist.",
      "publishedAt": "2023-09-28T13:37:08Z",
      "title": "Ringo Starr on ‘Rewind Forward,’ writing country music, the AI-assisted final Beatles track and more",
      "url": "https://apnews.com/6fc5236cb2a316775fe0723712fc3e41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3689f85e6184c7694e89de857d9a9d4/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}