{
  "articles": [
    {
      "author": "CHRIS MEGERIAN and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Faced with a sweeping rejection by American voters, Kamala Harris conceded the presidential election to Donald Trump on Wednesday and encouraged supporters to continue fighting for their vision of the country.",
      "publishedAt": "2024-11-06T17:12:57Z",
      "title": "Harris says nation must accept election results while urging supporters to keep fighting",
      "url": "https://apnews.com/ddeae9fb378530159201ef4196cba9b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d042dfd644a7450dade08b7bf72c8575/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "WASHINGTON (AP) — Donald Trump has promised sweeping action in a second administration. The former president and now president-elect often skipped over details but through more than a year of policy pronouncements and written statements outlined a wide-ranging agenda that blends traditional conservative approaches to taxes, regulation and cultural issues with a more populist bent on trade and a shift in America's international role.",
      "publishedAt": "2024-11-06T12:38:40Z",
      "title": "Donald Trump has sweeping plans for a second administration. Here's what he's proposed",
      "url": "https://apnews.com/de3dcf0f173b42602b258042fd7aaafb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51b383850d674fe09001ec97893077db/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE, WILL WEISSERT and JILL COLVIN",
      "description": "WASHINGTON (AP) — Donald Trump was elected the 47th president of the United States on Wednesday, an extraordinary comeback for a former president who refused to accept defeat four years ago, sparked a violent insurrection at the U.S.",
      "publishedAt": "2024-11-05T11:29:35Z",
      "title": "Trump wins the White House in a political comeback rooted in appeals to frustrated voters",
      "url": "https://apnews.com/83c8e246ab97f5b97be45cdc156af4e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4216c98486844f9a8909407a096de464/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Republicans have taken control of the U.S. Senate and are fighting to keep their majority in the U.S.",
      "publishedAt": "2024-11-05T05:01:59Z",
      "title": "Republicans take Senate majority and eye unified power with Trump",
      "url": "https://apnews.com/94b49277db2a5c21f23236794a36afa6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/955359f869a441c290eef1c8eeded22a/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith is evaluating how to wind down the two federal cases against Donald Trump before the president-elect takes office in light of longstanding Justice Department policy that says sitting presidents cannot be prosecuted, a person familiar with the matter said Wednesday.",
      "publishedAt": "2024-11-06T19:28:59Z",
      "title": "Special counsel evaluating how to wind down two federal cases against Trump after presidential win",
      "url": "https://apnews.com/01c2d54177d7c949f62a15604a27b3e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a177592b1c184f9ba9d3444cf8f604e1/3000.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — The U.S. stock market, Elon Musk’s Tesla, banks and bitcoin all stormed higher Wednesday as investors made bets on what Donald Trump’s return to the White House will mean for the economy and the world.",
      "publishedAt": "2024-11-06T01:40:43Z",
      "title": "Stocks and bitcoin jump after Trump's victory. So do worries about inflation as Dow surges 1,500",
      "url": "https://apnews.com/93421462d761eb1402d813cb381fe6e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0316b9d086bb4dce96ee80cd5de3bfe3/1920.jpeg"
    },
    {
      "author": "MARYCLAIRE DALE and JOCELYN NOVECK",
      "description": "Voters had the chance this election to break the highest glass ceiling in American politics by electing Kamala Harris the nation’s first female president.",
      "publishedAt": "2024-11-06T19:33:47Z",
      "title": "With Trump's win, some women wonder: Will the US ever see a female president?",
      "url": "https://apnews.com/ab67e88970af6677c27238a509516981",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f9c0d0f7a274bf1b16d0e4f656f7d60/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "LONDON (AP) — British health officials say they have identified four cases of the new, more infectious version of mpox that first emerged in Congo, marking the first time the variant has caused a cluster of illness outside of Africa.",
      "publishedAt": "2024-11-06T18:21:14Z",
      "title": "UK identifies 4 cases of new mpox variant, the first cluster outside Africa",
      "url": "https://apnews.com/cf54bba3e8731a30feac34f4006e9a15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8eebf12d084948548365ccc29184b1ea/3000.jpeg"
    },
    {
      "author": "ANDREA RODRÍGUEZ",
      "description": "HAVANA (AP) — Hurricane Rafael made landfall in Cuba on Wednesday as a powerful Category 3 hurricane, shortly after powerful winds knocked out the country’s power grid.",
      "publishedAt": "2024-11-06T00:46:12Z",
      "title": "Hurricane Rafael makes landfall in Cuba as a Category 3 storm after knocking out power on the island",
      "url": "https://apnews.com/f96033ae40b18d745f95d9dd17868457",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfb2004980bd4e5dab61353f1c8f7e1d/1920.jpeg"
    },
    {
      "author": "PAOLO SANTALUCIA and JOSEPH WILSON",
      "description": "PAIPORTA, Spain (AP) — The mangled car in which Jorge Tarazona’s 3-year-old niece and sister-in-law perished in last week's catastrophic flooding in Spain now hangs halfway off the ragged edge of road.",
      "publishedAt": "2024-11-06T13:15:51Z",
      "title": "Baby girl and her mother among those lost in Spain's catastrophic flooding",
      "url": "https://apnews.com/1e568750b3fd10424483c0eb1f24c752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4bd5d20470d4d0cb1a2751f3fe8dd2c/1743.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}