{
  "articles": [
    {
      "author": "Rob Maaddi",
      "description": "It’s almost time to crown an NFL champion. After two weeks of hype and anticipation, the New England Patriots and Seattle Seahawks will face off in Super Bowl 60 at Levi’s Stadium. Will Drake Maye and the Patriots capture their seventh Lombardi Trophy? Or will Sam Darnold and the Seahawks earn their second? The matchup features two stingy defenses, two balanced offenses and two quarterbacks who’ve taken vastly different routes to get here. The Seahawks allowed the fewest points in the NFL and have standout players at every level. The Patriots got here because their defense has been dominant in the playoffs.",
      "publishedAt": "2026-02-08T11:00:06Z",
      "title": "Drake Maye and the Patriots take on Sam Darnold and the Seahawks in Super Bowl 60",
      "url": "https://apnews.com/article/super-bowl-seahawks-patriots-24ad67503a342a7e24348e66986250ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/6e33954/2147483647/strip/true/crop/5672x3779+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F47%2F213226251b0149fe9bc786f276e9%2Fc70381e993624e91a0b58262d665c3a6"
    },
    {
      "author": "Jonathan Landrum Jr., Andrew Dalton",
      "description": "Super Bowl 60 was a star-studded event with Chris Pratt and Jon Bon Jovi introducing the teams. Bad Bunny's halftime show celebrated Puerto Rican culture with appearances by Lady Gaga and Ricky Martin. The performance featured Puerto Rican imagery and a real-life wedding. Green Day delivered a tribute to the NFL championship's 60th anniversary with a mix of hits. Brandi Carlile and Charlie Puth performed patriotic songs, while Coco Jones opened with \"Lift Every Voice and Sing.\" Celebrities like Travis Scott, JAY-Z and Brad Pitt were spotted at Levi's Stadium, adding to the excitement of the event.",
      "publishedAt": "2026-02-09T00:09:23Z",
      "title": "Super Bowl 60: Bad Bunny lights up Super Bowl halftime",
      "url": "https://apnews.com/article/super-bowl-60-celebrities-bad-bunny-a577c46590ba5309d94247c9a905174f",
      "urlToImage": "https://dims.apnews.com/dims4/default/5774f22/2147483647/strip/true/crop/5237x3490+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F88%2Fc106601da4742aca8ff52991cf14%2F49025a9861ee4eea9eee24d8b511b31a"
    },
    {
      "author": "Andrew Dampf",
      "description": "Lindsey Vonn knows the Olympic downhill course better than anyone. She’s won a record 12 World Cup races on the Olympia delle Tofane track and has a total of 20 podium results there stretching back to her very first on the entire circuit in 2004. So how did the 41-year-old American standout lose control just 12.5 seconds into her run and crash so spectacularly at the Milan Cortina Winter Games? The answer involved a critical, reverse-banked section of the course and an unfortunate bump. Vonn's mandatory safety air bag inflated under her racing suit during the crash and may have softened her landing.",
      "publishedAt": "2026-02-08T17:26:41Z",
      "title": "Lindsey Vonn's fall explained: A reverse banked section, an unfortunate bump and an inflated air bag",
      "url": "https://apnews.com/article/lindsey-vonn-crash-olympics-cortina-219737db2d60c6c2d917b95048b2c0e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/11b0160/2147483647/strip/true/crop/2409x1605+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2Fe4%2Fec350c5a999408eda089627caa64%2Ff9c9b956e1544b48a6a1243bd506f1e6"
    },
    {
      "author": null,
      "description": "The sentencing of Hong Kong’s onetime media magnate Jimmy Lai is raising concerns from foreign governments and rights groups. In China and Hong Kong, authorities defended the court's decision Monday, saying it reflects the spirit of the rule of law. Lai, a 78-year-old prominent democracy advocate, was sentenced to 20 years in prison. He was convicted of conspiracy to collude with foreign forces and conspiring with others to publish seditious articles. Foreign governments and rights groups are calling for the release of the British citizen. But China's Foreign Ministry says Lai is a Chinese citizen, and is urging other countries to respect China’s sovereignty and the rule of law in Hong Kong.",
      "publishedAt": "2026-02-09T08:58:03Z",
      "title": "Sentence for Hong Kong's ex-publisher Jimmy Lai raises concerns",
      "url": "https://apnews.com/article/hong-kong-jimmy-lai-foreign-reaction-760d56b197a8e985a29c2f7c9ea2c2f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe7c04c/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F9d%2F144dfb7f1177681bdcbcf8932342%2F4cf032c03eb8448196c02a3b98f0d45d"
    },
    {
      "author": null,
      "description": "Israelis forces have seized a local Sunni Islamist politician and an ally of the Palestinian militant Hamas group and took him to Israel for questioning. The Israeli military and Lebanese state media said the operation in southern Lebanon took place early on Monday. Lebanon’s state-run National News Agency also reported that an Israeli drone struck a car in the southern Lebanese village of Yanouh on Monday, killing three people, including a child. The seized official, Atwi Atwi, is a member of the Sunni Islamist group al-Jamaa al-Islamiya, or the Islamic Group in English. The Israeli military said an Islamic Group official was apprehended in a “targeted intelligence-based operation,” without releasing the official’s name.",
      "publishedAt": "2026-02-09T08:18:47Z",
      "title": "Israeli forces seize a local Sunni Islamist official in southern Lebanon",
      "url": "https://apnews.com/article/lebanon-israel-atwi-hezbollah-aljamaa-alislamiya-1d4f58e1f49478ab35c7fa2a08b1c965",
      "urlToImage": "https://dims.apnews.com/dims4/default/799c71b/2147483647/strip/true/crop/8166x5441+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F05%2F0b69e0df795f082f04ddaca4dcdb%2F5166e1a4705240669646bb3f8e063aa8"
    },
    {
      "author": "Jill Lawless",
      "description": "British Prime Minister Keir Starmer faces a political crisis as he tries to persuade Labour Party lawmakers not to oust him. Starmer lost his chief of staff on Sunday and is losing support after revelations about former British ambassador Peter Mandelson's ties to Jeffrey Epstein. Starmer fired Mandelson in September after emails showed he maintained a friendship with Epstein. Critics say Starmer should have known better than to appoint Mandelson. Police are investigating Mandelson for potential misconduct. Starmer's chief of staff, Morgan McSweeney, resigned, taking responsibility for the appointment. Some hope his departure will allow Starmer to rebuild trust.",
      "publishedAt": "2026-02-09T09:36:13Z",
      "title": "UK leader Starmer hangs on to his job in wake of more Epstein revelations",
      "url": "https://apnews.com/article/britain-keir-starmer-crisis-epstein-mandelson-fe972453d392f9a9ca926fc7578c497c",
      "urlToImage": "https://dims.apnews.com/dims4/default/52fd60b/2147483647/strip/true/crop/4660x3105+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2Fec%2F34696177d84aeb7489f41f9d7858%2Fe931c9f052e349bd933e1af73ec060ad"
    },
    {
      "author": null,
      "description": "Prince William and Princess Catherine have expressed concern for Jeffrey Epstein's victims. They released a statement Monday, distancing themselves from former Prince Andrew's ties to the convicted sex offender. The royals are appalled by over 3 million pages of documents released by the U.S. Department of Justice earlier this month. Their statement comes ahead of William's three-day trip to Saudi Arabia. The monarchy is responding to the crisis surrounding Andrew, who lost his royal titles in October. King Charles III recently forced Andrew to leave his home near Windsor Castle. Andrew now resides temporarily on the king’s Sandringham estate.",
      "publishedAt": "2026-02-09T09:16:18Z",
      "title": "Prince William and Princess Catherine express concern for Epstein victims",
      "url": "https://apnews.com/article/britain-epstein-andrew-royals-william-0d3b16798b32ebd1d98b72d209769105",
      "urlToImage": "https://dims.apnews.com/dims4/default/e68d3c8/2147483647/strip/true/crop/5906x3935+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F1a%2F03eada37b49ac59df2e4215114b3%2Fd91d7c36a5d743e895513a65c8f7ee01"
    },
    {
      "author": "Gisela Salomon",
      "description": "Prolonged detention has become more common in President Donald Trump’s second term, at least partly because a new policy generally prohibits immigration judges from releasing detainees while their deportation cases wind through backlogged courts. The number of people in Immigration and Customs Enforcement detention has topped 70,000 for the first time. The agency said there were 7,252 people in custody at least six months in mid-January, including 79 held for more than two years. That’s more than double the 2,849 who were in ICE custody at least six months in December 2024, the last full month of Joe Biden’s presidency.",
      "publishedAt": "2026-02-09T05:06:32Z",
      "title": "Trump's second term sees rise in prolonged ICE detention cases",
      "url": "https://apnews.com/article/immigration-migrants-detention-trump-deportations-c8bfb50adac8fe9554f4d5aeefbe30cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/bcadf5d/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F49%2Fce89c929b7ded1c9f9519cb3770c%2F028c7b6269de406f9fdcbe6fcaed285c"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "Tokyo's Nikkei 225 share index has jumped 4.5% after Japanese Prime Minister Sanae Takaichi’s governing party secured a two-thirds supermajority in a parliamentary election. Takaichi is expected to pursue market-friendly policies. She told public broadcaster NHK later that she is ready to pursue policies to make Japan strong and prosperous. The gains came after the U.S. stock market roared back on Friday as technology stocks recovered much of their losses from earlier in the week and bitcoin halted its plunge. The S&P 500 rallied 2% for its best day since May. The Dow Jones Industrial Average soared 1,206 points, or 2.5%, and topped the 50,000 level for the first time, while the Nasdaq composite leaped 2.2%.",
      "publishedAt": "2026-02-09T02:32:16Z",
      "title": "World markets gain and Japan's Nikkei jumps after landslide victory for Takaichi",
      "url": "https://apnews.com/article/stocks-markets-japan-trump-election-9b8ca5d0b21d8f2c6d0cb6992e05c112",
      "urlToImage": "https://dims.apnews.com/dims4/default/aa2dc46/2147483647/strip/true/crop/6117x4076+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F19%2Fddf684ed649a913f16fe896cedba%2F801fb27f049c42db8efc473ae6db11fb"
    },
    {
      "author": "Ken Maguire",
      "description": "Breezy Johnson and Ilia Malinin delivered for the U.S. at the Milan Cortina Olympics on Sunday. The second day of medal events at the Games will be remembered more, though, for Lindsey Vonn's frightening fall in the women's downhill. Johnson won the race to give the U.S. its first gold medal of these Games. On the ice in Milan, Ilia Malinin beat Japanese rival Shun Sato in a head-to-head showdown, helping the U.S. defend its team figure skating gold medal. Host nation Italy won six medals Sunday — five bronze and one silver — the most it has ever won in a single day at the Winter Olympics.",
      "publishedAt": "2026-02-08T20:11:05Z",
      "title": "Winter Olympics: Vonn crashes, Breezy wins, Malinin seals US team gold",
      "url": "https://apnews.com/article/winter-olympics-lindsey-vonn-breezy-johnson-milan-30a633011325e230ac5a8698b4f84828",
      "urlToImage": "https://dims.apnews.com/dims4/default/5389ec2/2147483647/strip/true/crop/3228x2151+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F96%2Fa34ceb7e4bc5f5bb46d2c1aec52c%2F6ce5d6b1b3694dcdb8651feb8a5fc48d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}