{
  "articles": [
    {
      "author": "WILL WEISSERT, SEUNG MIN KIM and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has secured enough votes from delegates to become her party’s nominee for president, Democratic National Committee Chair Jaime Harrison said Friday.",
      "publishedAt": "2024-08-02T16:39:29Z",
      "title": "Harris has secured enough Democratic delegate votes to become their party's nominee, chair says",
      "url": "https://apnews.com/463d0b8095f2ca3526b3af3a2f44c3ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc4d0357b5574c3399c43515588a8b1a/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin on Friday overrode a plea agreement reached earlier this week for the accused mastermind of the Sept.",
      "publishedAt": "2024-08-03T00:48:05Z",
      "title": "Defense secretary overrides plea agreement for accused 9/11 mastermind and two other defendants",
      "url": "https://apnews.com/bf450589039b761c028492a348da4ea5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1652c7424af47e396a6d2d68b48dc34/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. will move a fighter jet squadron to the Middle East and maintain an aircraft carrier in the region, the Pentagon said Friday, beefing up the American military presence to help defend Israel from possible attacks by Iran and its proxies and safeguard U.S.",
      "publishedAt": "2024-08-02T22:14:58Z",
      "title": "US to boost military presence in Mideast, sending fighter jet squadron and keeping carrier in region",
      "url": "https://apnews.com/418a990ab69cb766e126c60dbaebedb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/578cc78112c84ae3b20d1166602ee2f9/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — When Kremlin critic Vladimir Kara-Murza was suddenly moved to a detention center in Moscow from a Siberian prison, he thought he was being taken there to be shot. Opposition activist Ilya Yashin said he was warned by a security operative that he would die in prison if he returned to Russia.",
      "publishedAt": "2024-08-02T13:20:52Z",
      "title": "Dissidents freed in prisoner swap vow to keep up fight against Putin, recount details of release",
      "url": "https://apnews.com/3c9a8b989eae34fdfe5ffcf62989832e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/226e4329fa4d44618ea6b586675cf512/3000.jpeg"
    },
    {
      "author": "JOANNA KOZLOWSKA",
      "description": "President Vladimir Putin strode along the red carpet between two rows of rifle-toting honor guards and warmly greeted intelligence operatives freed in the biggest prisoner swap with the West since the Cold War.",
      "publishedAt": "2024-08-03T04:04:45Z",
      "title": "In the prisoner swap, Putin signals that Russia won't forget its security operatives abroad",
      "url": "https://apnews.com/d3498148da77947034d7b743377c3913",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c9a053aafaa479b9c11439f5228bab2/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — The statement that upended Venezuela came 24 hours after polls closed in the presidential election.With the reassuring tone of someone who has consistently been considered an underdog, opposition powerhouse Maria Corina Machado announced that her coalition had gathered more than two-thirds of vote tally sheets from polling centers nationwide, and that they show President Nicolás Maduro had lost his reelection bid.",
      "publishedAt": "2024-08-02T19:39:14Z",
      "title": "Venezuela's opposition secured over 80% of crucial vote tally sheets. Here's how they did it.",
      "url": "https://apnews.com/6d9f3999c60c09eb30e69c757ce80b11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1d2399412cc4654b4de0367c6cdfd4e/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO, JOSHUA GOODMAN and ANGELIKI KASTANIS",
      "description": "CARACAS, Venezuela (AP) — An AP analysis of vote tally sheets released Friday by Venezuela’s main opposition indicates that their candidate won significantly more votes in Sunday’s election than the government has claimed, casting serious doubt on the official declaration that President Nicolás Maduro won.",
      "publishedAt": "2024-08-02T13:47:51Z",
      "title": "AP review of Venezuela opposition-provided vote tallies casts doubt on government’s election results",
      "url": "https://apnews.com/a625eb01979bc9cf5570d03242f198b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c7d4035c40944d4b4121a859e96177b/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER and PAUL WISEMAN",
      "description": "WASHINGTON (AP) — A surprising rise in the U.S. unemployment rate last month has rattled financial markets and set off new worries about the threat of a recession — but it could also prove to be a false alarm.",
      "publishedAt": "2024-08-02T19:01:48Z",
      "title": "Unemployment rise spurs fears of slowdown, yet recession signals have been wrong — so far",
      "url": "https://apnews.com/c7f1985b1ab3a7b781920c2693cd0438",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25cf5c4c4c3145cc99779fcb5f1a7415/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and AMELIA THOMSON-DEVEAUX",
      "description": "Most Americans have doubts about the Secret Service's ability to keep presidential candidates safe after last month's attempt on former President Donald Trump’s life, a new poll from the Associated Press-NORC Center for Public Affairs Research finds.",
      "publishedAt": "2024-08-02T04:18:59Z",
      "title": "Few Americans trust the Secret Service after a gunman nearly killed Trump, an AP-NORC poll finds",
      "url": "https://apnews.com/e5ef28f72d61080088a0835a1b9a7d39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32954b9652824e92be3df95815165df8/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Several suspects arrested in violent protests that erupted after the fatal stabbing of three children in northwest England made court appearances Friday as officials braced for more clashes that Prime Minister Keir Starmer condemned and blamed on “far-right hatred.”",
      "publishedAt": "2024-08-02T10:24:00Z",
      "title": "UK police brace for more far-right protests as government warns of tough response",
      "url": "https://apnews.com/5929ca5b0514dee578e29764b8961036",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6828620ebd4346e9bdd5d55484e6d458/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}