{
  "articles": [
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Israel pounded Iran with a series of airstrikes early Saturday, saying it was targeting military sites in retaliation for the barrage of ballistic missiles the Islamic Republic fired upon Israel earlier in the month.",
      "publishedAt": "2024-10-25T04:31:36Z",
      "title": "Israel strikes Iran as payback for missile attack, risking escalation of Mideast wars",
      "url": "https://apnews.com/0920f63542d158ad5999c481e421da00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/873f2c66c3db41f5a6d02c805df1aea1/2946.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, COLLEEN LONG and NADIA LATHAN",
      "description": "HOUSTON (AP) — Kamala Harris and Beyoncé ignited a Houston rally with a double-barreled argument against Donald Trump on Friday, with the superstar telling the Democratic nominee’s biggest crowd ever that it was “time to sing a new song” as Harris warned that her GOP opponent was dead set on further eroding women’s rights.",
      "publishedAt": "2024-10-25T04:06:58Z",
      "title": "Harris and Beyoncé ignite a Houston rally with a double-barreled argument against Trump",
      "url": "https://apnews.com/f228eedd3308dab2e1125fdf6029a4a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae2b8b4d468447f2b4412ca7521f4fb0/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, JONATHAN J. COOPER and WILL WEISSERT",
      "description": "TRAVERSE CITY, Mich. (AP) — Many of Donald Trump’s supporters left a Michigan rally before he arrived Friday night after the former president kept them waiting for three hours to tape a popular podcast interview.",
      "publishedAt": "2024-10-25T14:26:27Z",
      "title": "Trump leaves Michigan rallygoers waiting in the cold for hours to tape Joe Rogan podcast",
      "url": "https://apnews.com/7ed6b971a86c69ed4344205ab2db668b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3695cf6fa2245eb994ae5bad54c4b82/1920.jpeg"
    },
    {
      "author": "MELISSA GOLDIN, MIKE CATALINI and ALI SWENSON",
      "description": "YARDLEY, Pa. (AP) — Russian actors were behind a widely circulated video falsely depicting mail-in ballots for Donald Trump being destroyed in Pennsylvania, U.S.",
      "publishedAt": "2024-10-25T21:57:30Z",
      "title": "Russian actors made fake video depicting mail-in ballots for Trump being destroyed, FBI says",
      "url": "https://apnews.com/d75fdc56c71d77c7a48d8fca96b03288",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e746392a04642a88f6622747bad6298/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "CENTRAL ISLIP, N.Y. (AP) — The former longtime CEO of Abercrombie &amp; Fitch pleaded not guilty Friday to federal sex trafficking and interstate prostitution charges.",
      "publishedAt": "2024-10-25T04:34:00Z",
      "title": "Former Abercrombie & Fitch CEO pleads not guilty to sex trafficking and prostitution charges",
      "url": "https://apnews.com/c23731581f7a836ca02b431b55055ca8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d49accd83793484d95b276ca0f09fd52/1920.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "Less than two weeks before Election Day, The Washington Post said Friday it would not endorse a candidate for president in this year's tightly contested race and would avoid doing so in the future — a decision immediately condemned by a former executive editor but one that the current publisher insisted was “consistent with the values the Post has always stood for.”",
      "publishedAt": "2024-10-25T19:20:25Z",
      "title": "Washington Post becomes second major US newspaper this week to not endorse a presidential candidate",
      "url": "https://apnews.com/51de8348502aa17f432504c4764c63f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/360740f8b78c44eab40546e6b5e3430d/3000.jpeg"
    },
    {
      "author": "JOHN ROGERS",
      "description": "LOS ANGELES (AP) — Phil Lesh, a classically trained violinist and jazz trumpeter who found his true calling reinventing the role of rock bass guitar as a founding member of the Grateful Dead, died Friday at age 84.",
      "publishedAt": "2024-10-25T20:10:37Z",
      "title": "Phil Lesh, founding member of Grateful Dead and influential bassist, dies at 84",
      "url": "https://apnews.com/491f2ca2727f4b16be0cca033a7b1b6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1ab64af42b143e28854401331cf3a38/747.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "A deadly outbreak of E. coli poisoning tied to McDonald's Quarter Pounders has expanded, with at least 75 people sick in 13 states, federal health officials said Friday.",
      "publishedAt": "2024-10-25T15:50:07Z",
      "title": "At least 75 people are sickened as the deadly McDonald's E. coli outbreak expands",
      "url": "https://apnews.com/a1ec3dc14636f5e713b15b32aedcd524",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46e43a2a98734f9dab2a57e13a7b6488/1920.jpeg"
    },
    {
      "author": "HAL BOCK",
      "description": "In the beginning, the World Series matchup of the Dodgers against the Yankees was a kind of charming intra-city showdown of two New York City boroughs, blue collar Brooklyn, equipped with a neighborhood called Gravesend, against the pretentious Bronx, with the fancy Grand Concourse.",
      "publishedAt": "2024-10-25T15:07:35Z",
      "title": "Yankees vs Dodgers: The World Series' most frequent rivalry through the years",
      "url": "https://apnews.com/bff08bfb932f8e56257f852a488e4a94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f0d126a9c754b498784c0cf63b309cd/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A NASA astronaut was taken to the hospital for an undisclosed medical issue after returning from a nearly eight-month space station stay extended by Boeing's capsule trouble and Hurricane Milton, the space agency said Friday.",
      "publishedAt": "2024-10-25T07:31:09Z",
      "title": "NASA astronaut remains in the hospital after returning from an extended stay in space",
      "url": "https://apnews.com/f99e1724b4c131e68e0cf8c30274fc11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f66d7453e6754a3899930198a0512dda/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}