{
  "articles": [
    {
      "author": "KRUTIKA PATHI and SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — India was counting more than 640 million votes cast over the past six weeks in the world’s largest democratic exercise, which was widely expected to give Prime Minister Narendra Modi a third five-year term when the final result is declared later Tuesday.",
      "publishedAt": "2024-06-04T00:43:13Z",
      "title": "India counts votes in its marathon election likely to bring Modi a third term as prime minister",
      "url": "https://apnews.com/7893efecc83fa8225a611f174e6420ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/082249b7fefd4ec6806465e1c45f4ca5/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JACK JEFFERY",
      "description": "JERUSALEM (AP) — At the start of its devastating offensive on the Gaza Strip, Israel set an ambitious goal: destroy Hamas. At the time, the Biden administration committed to the objective, giving Israel considerable stocks of weaponry and voicing its support.",
      "publishedAt": "2024-06-03T18:45:59Z",
      "title": "Biden says Hamas is sufficiently depleted. Israel leaders disagree, casting doubts over cease-fire",
      "url": "https://apnews.com/796948b31c7aa8ed90c51edb41738eef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a65e438c3e9841fd922f7f4ae7aa921a/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, MICHAEL KUNZELMAN, COLLEEN LONG and RANDALL CHASE",
      "description": "WILMINGTON, Del. (AP) — Lawyers will make their opening statements Tuesday in the federal gun case against President Joe Biden’s son Hunter after a jury was seated for the trial while the first lady watched from the courtroom and the president sent a message of support.",
      "publishedAt": "2024-06-04T04:10:54Z",
      "title": "Hunter Biden's federal firearms case is opening after the jury is chosen",
      "url": "https://apnews.com/477c0ca9d07afc1a52bd90ef6d2167cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/456dc39add9b4b4c938642515a3f13a0/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump has had plenty to say since his hush money trial conviction last week.He’s claimed the case was rigged, incorrectly linked President Joe Biden to the state prosecution, called the star witness against him a “sleazebag\" and said the judge was a “devil\" and “highly conflicted.”",
      "publishedAt": "2024-06-03T17:28:01Z",
      "title": "How Trump's deny-everything strategy could hurt him at sentencing",
      "url": "https://apnews.com/66dbfa66613aaae29a3959e619b7593c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a34dc65b0afc40dba20cfef08dfd16b8/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN and WILL WEISSERT",
      "description": "GREENWICH, Conn. (AP) — President Joe Biden laid into his predecessor and likely opponent in November's election, Donald Trump, for being convicted by a Manhattan jury on 34 felony counts related to hush money payments, saying Monday night that “this campaign has entered uncharted territory.”",
      "publishedAt": "2024-06-04T01:21:23Z",
      "title": "Biden lays into Trump over convictions and says he now poses a greater threat than in 2016",
      "url": "https://apnews.com/2aaa3bf13e30c32dffc862724c698d92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b09feca124df4beebcacbb7a2fa857b4/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "MEXICO CITY (AP) — Mexico’s newly elected president, the first woman to win the job, faces a long list of challenges, including persistent cartel violence, a deeply divided country, cash-straitened social programs and the long shadow of her mentor, outgoing President Andrés Manuel López Obrador.",
      "publishedAt": "2024-06-04T04:08:06Z",
      "title": "Mexico’s next president faces 3 pressing challenges: money, dialogue and the US election",
      "url": "https://apnews.com/8516bc1d399096367827c511132fedb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8200569cba634b39ae8d182bff9a847f/3000.jpeg"
    },
    {
      "author": "RAF CASERT",
      "description": "BEERSEL, Belgium (AP) — The far-right Flemish Interest party had set up the demonstration in the picture-pretty rolling fields south of Brussels, ahead of the four-day European Union elections which start Thursday.",
      "publishedAt": "2024-06-04T04:09:12Z",
      "title": "Tractors rumble in streets again ahead of EU polls. Farming is a big issue and the far right pounces",
      "url": "https://apnews.com/08e805b47b8a1f8ba9117cc17ba7b428",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd7c0f2d45e646b89e1c16d4758c9da8/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING, China (AP) — Checkpoints and rows of police vehicles lined a major road leading to Beijing's Tiananmen Square as China heightened security on the 35th anniversary of a bloody crackdown on pro-democracy protests.",
      "publishedAt": "2024-06-04T04:44:54Z",
      "title": "Silence and heavy state security in China on anniversary of Tiananmen crackdown",
      "url": "https://apnews.com/e5dcd3454ecb7e0ce558681da020afe0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81f10256bf8943478ea1ca670466973d/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "DEAUVILLE AIRPORT, France (AP) — ‘’To our forever heroes: Thank you'' — those words inscribed by French schoolchildren on a big poster greeted dozens of U.S. World War II veterans, many in their 100s, as they arrived on Monday in Normandy to commemorate the 80th anniversary of the D-Day landings.",
      "publishedAt": "2024-06-03T16:29:08Z",
      "title": "French children hail D-Day veterans as heroes as they arrive in Normandy for anniversary events",
      "url": "https://apnews.com/5eaddebfe7544c6b094660462308645a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c09187542094bf288bfb50c890efe0c/2048.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER and HALELUYA HADERO",
      "description": "BERLIN (AP) — When Michael Bommer found out that he was terminally ill with colon cancer, he spent a lot of time with his wife, Anett, talking about what would happen after his death.She told him one of the things she'd miss most is being able to ask him questions whenever she wants because he is so well read and always shares his wisdom, Bommer recalled during a recent interview with The Associated Press at his home in a leafy Berlin suburb.",
      "publishedAt": "2024-06-04T04:17:51Z",
      "title": "Mourners can now speak to an AI version of the dead. But will that help with grief?",
      "url": "https://apnews.com/19820aa174147a82ef0b762c69a56307",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d215c25658f84239adb80f43b4ad3bc4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}