{
  "articles": [
    {
      "author": "RUSS BYNUM and AARON MORRISON",
      "description": "JACKSONVILLE, Fla. (AP) — Hundreds of people gathered Sunday at prayer vigils and in church, in frustration and exhaustion, to mourn yet another racist attack in America: this one the killing of three Black people in Florida at the hands of a white, 21-year-old man who authorities say left behind white supremacist ramblings that read like “the diary of a madman.”",
      "publishedAt": "2023-08-27T09:36:03Z",
      "title": "Florida Gov. Ron Desantis booed at vigil as hundreds mourn more racist killings",
      "url": "https://apnews.com/51edd341db7fe2374cb69970840ef76f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ff21411f44549aea435382de6766362/1920.jpeg"
    },
    {
      "author": "CALVIN WOODWARD and EMILY SWANSON",
      "description": "WASHINGTON (AP) — Americans actually agree on something in this time of raw discord: Joe Biden is too old to be an effective president in a second term. Only a few years his junior, Donald Trump raises strikingly less concern about his age.",
      "publishedAt": "2023-08-28T04:02:20Z",
      "title": "Biden is widely seen as too old for office, an AP-NORC poll finds. Trump's got other problems",
      "url": "https://apnews.com/620e0a5cfa0039a6448f607c17c7f23e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/715c4c9d503144638643aad412ce57f3/3000.jpeg"
    },
    {
      "author": null,
      "description": "MIAMI (AP) — Tropical Storm Idalia was near the coast of Cuba Sunday on a potential track to come ashore as a hurricane in the southern U.S., the National Hurricane Center said.At 10 p.m. CDT Sunday, the storm was about 145 miles (235 kilometers) off the western tip of Cuba with maximum sustained winds of 60 mph (95 kmh).",
      "publishedAt": "2023-08-27T15:51:03Z",
      "title": "Tropical Storm Idalia takes aim at Gulf of Mexico on a possible track toward the US, forecasters say",
      "url": "https://apnews.com/13c620a00b54c97f10e97e01ec84ccb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20ba3e84299040db8d6139ca5bd5388d/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "SAN JOSE, Calif. (AP) — Simone Biles is not going to explain herself. Part of this is by design. Part of this is because she simply can't.When the gymnastics star is at her best, as she was on Sunday night while winning her record eighth U.S.",
      "publishedAt": "2023-08-28T01:00:23Z",
      "title": "Simone Biles wins a record 8th US Gymnastics title a full decade after her first",
      "url": "https://apnews.com/e0d8956a5d9365a7f1749ba6de5ad545",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f310613faed14ce9b80e5519071ee4ff/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "CANBERRA, Australia (AP) — A United States Marine Corps aircraft with 23 Marines aboard crashed on a north Australian island Sunday, killing at least three and critically injuring at least five during a multinational training exercise, officials said.",
      "publishedAt": "2023-08-27T06:09:45Z",
      "title": "A US Marine Osprey crashes during drills in Australia, killing 3 and injuring 20, some critically",
      "url": "https://apnews.com/e85fcd46cd3c85933d724a8cf4f253b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54eef8db745f4a02a1bef19e04afc25b/1778.jpeg"
    },
    {
      "author": "TODD RICHMOND",
      "description": "BARABOO, Wis. (AP) — Arianna Barajas never thought of herself as the outdoors type. The daughter of Mexican immigrants who grew up in Chicago's suburbs, her forays into nature usually amounted to a bike ride to a community park.",
      "publishedAt": "2023-08-27T04:39:30Z",
      "title": "Environmental groups recruit people of color into overwhelmingly white conservation world",
      "url": "https://apnews.com/c7b2b268dfcbf5e46c347ab2294bb061",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17aa94b21a904363b71e5acec3efdcb0/3000.jpeg"
    },
    {
      "author": "NICK PERRY",
      "description": "CHRISTCHURCH, New Zealand (AP) — The howling winds and perpetual darkness of the Antarctic winter were easing to a frozen spring when mechanic Liz Monahon at McMurdo Station grabbed a hammer.If those in charge weren’t going to protect her from the man she feared would kill her, she figured, she needed to protect herself.",
      "publishedAt": "2023-08-27T04:04:46Z",
      "title": "Women working in Antarctica say they were left to fend for themselves against sexual harassers",
      "url": "https://apnews.com/ba0e550fddf1ab0afd031ff4d25143cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d62d148ce8284d169f6694480f71a7fd/3000.jpeg"
    },
    {
      "author": "JOE McDONALD",
      "description": "BEIJING (AP) — Commerce Secretary Gina Raimondo and her Chinese counterpart expressed support for improving trade conditions as Raimondo on Monday began a visit to Beijing aimed at improving chilly relations.",
      "publishedAt": "2023-08-28T03:14:46Z",
      "title": "Top US and Chinese commerce officials express support for better trade conditions",
      "url": "https://apnews.com/7ff71dfa3c58105964a4b2e3dd998285",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da5a85646ade449f81593eee2d0547b9/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "OKUMA, Japan (AP) — At a small section of the Fukushima Daiichi nuclear plant’s central control room, the treated water transfer switch is on. A graph on a computer monitor nearby shows a steady decrease of water levels as treated radioactive wastewater is diluted and released into the Pacific Ocean.",
      "publishedAt": "2023-08-27T14:35:01Z",
      "title": "Removing Fukushima's melted nuclear fuel will be harder than the release of plant's wastewater",
      "url": "https://apnews.com/fe953a597cc86004e525e1816d6c9c49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/894336184d5b446d959982782c14dbb4/3000.jpeg"
    },
    {
      "author": "GABE STERN",
      "description": "RENO, Nev. (AP) — Santos Brizuela spent more than two decades laboring outdoors, persisting despite a bout of heatstroke while cutting sugarcane in Mexico and chronic laryngitis from repeated exposure to the hot sun while on various other jobs.",
      "publishedAt": "2023-08-27T04:37:03Z",
      "title": "Workers exposed to extreme heat have no consistent protection in the US",
      "url": "https://apnews.com/1d53c85d0f8dd2cb973f950c54fb17eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2d16352c35e48628daad6c23af5fdf1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}