{
  "articles": [
    {
      "author": "AAMER MADHANI and JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Saudi Arabia will host a Ukrainian-organized peace summit in early August seeking to find a way to start negotiations over Russia's war on the country, an official said Saturday night.",
      "publishedAt": "2023-07-30T03:41:53Z",
      "title": "Official tells AP that Saudi Arabia will host a Ukrainian-organized peace summit in August",
      "url": "https://apnews.com/ee8719ebcd6a0a541ce6a8670ae6bb09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0612921eeb414944bfe013f6381cf9a5/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Three Ukrainian drones attacked Moscow in the early hours on Sunday, Russian authorities said, injuring one person and prompting a temporary closure of traffic in and out of one of four airports around the Russian capital.",
      "publishedAt": "2023-07-30T03:49:03Z",
      "title": "An overnight drone attack on Moscow injures 1 and temporarily closes an airport",
      "url": "https://apnews.com/4801c01e9f07ac882ab28d33666bf8d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f743e754f59481e86a322a347047446/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — At a moment of growing legal peril, Donald Trump ramped up his calls for his GOP rivals to drop out of the 2024 presidential race as he threatened to primary Republican members of Congress who fail to focus on investigating Democratic President Joe Biden and urged them to halt Ukrainian military aid until the White House cooperates with their investigations into Biden and his family.",
      "publishedAt": "2023-07-30T03:13:59Z",
      "title": "Trump, amid legal perils, calls on GOP to rally around him as he threatens primary challenges",
      "url": "https://apnews.com/c22cda6a5f6783b5f6a1123b724ebaff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/818e7c1b8d8540f99d16c7cc8a6d235d/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Thousands of supporters of the junta that took over Niger in a coup earlier this week marched through the streets of the capital, Niamey, on Sunday waving Russian flags, chanting the name of the Russian president and forcefully denouncing former colonial power France.",
      "publishedAt": "2023-07-30T09:18:32Z",
      "title": "Supporters of Niger's coup march through the capital, waving Russian flags and denouncing France",
      "url": "https://apnews.com/88ccaa2f004db44601e59475199c5fbe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e0abb5bafe84c5688ab720c7b7cdc4d/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON",
      "description": "NEW YORK (AP) — Six straight days of 12-hour driving. Single digit paychecks. The complaints come from workers in vastly different industries: UPS delivery drivers and Hollywood actors and writers.",
      "publishedAt": "2023-07-30T04:02:51Z",
      "title": "Consumer demand for speed and convenience drives labor unrest among workers in Hollywood and at UPS",
      "url": "https://apnews.com/c3b94e32c347d5b5f61e695bcf436b46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/578422a221734616b8213a2d5877fb40/3000.jpeg"
    },
    {
      "author": null,
      "description": "LITTLE ROCK, Ark. (AP) — Arkansas is temporarily blocked from enforcing a law that would have allowed criminal charges against librarians and booksellers for providing “harmful” materials to minors, a federal judge ruled Saturday.",
      "publishedAt": "2023-07-29T21:24:10Z",
      "title": "Judge blocks Arkansas law allowing librarians to be criminally charged over ‘harmful’ materials",
      "url": "https://apnews.com/758f28c04c573d03b869ad2738e2b06d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/809cf249e4e44118a0fc71fd073711c5/3000.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS, BEATRICE DUPUY and REBECCA BLACKWELL",
      "description": "KEY BISCAYNE, Fla. (AP) — In the sweltering summer heat, nobody tries to cool off by jumping into a hot tub. In parts of Florida, however, that’s what the ocean has felt like.Earlier this week, sea surface temperatures reached as high as 101.2 degrees Fahrenheit (38.4 degrees Celsius) around the state’s southern tip in Manatee Bay, according to the National Weather Service — although scientists said the context for Monday’s reading is complicated.",
      "publishedAt": "2023-07-29T04:46:25Z",
      "title": "Water is refreshing in the heat, right? In parts of Florida this past week, not so much",
      "url": "https://apnews.com/2f0a1eb529aba9f17ee88a04cda7df42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a8009116fd24ef4b331a8f338e8efd9/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "TAIPEI, Taiwan (AP) — China accused the United States of turning Taiwan into an “ammunition depot” after the White House announced a $345 million military aid package for Taipei, and the self-ruled island said Sunday it tracked six Chinese navy ships in waters off its shores.",
      "publishedAt": "2023-07-30T03:54:24Z",
      "title": "China says US military aid to Taiwan will not deter its will to unify the island",
      "url": "https://apnews.com/e49902a6f73781dfec61347fc1ad232b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6d58b82569d4ccfbc310e7294c7b71c/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "PAVLIVKA, Ukraine (AP) — The summer winds carried the smell of burned grain across the southern Ukrainian steppe and away from the shards of three Russian cruise missiles that struck the unassuming metal hangars.",
      "publishedAt": "2023-07-30T05:05:50Z",
      "title": "Russian missile attacks leave few options for Ukrainian farmers looking to export grain",
      "url": "https://apnews.com/5d226ab3360ccc765bec3482cbcd223d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abaf9aedebda44f8b0015154b64019f4/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "PARRIS ISLAND, S.C. (AP) — Not long ago, Marine Col. Jennifer Nash, a combat engineer with war deployments under her belt, made a vow to fellow officers as they headed to a dinner in Atlanta: She would get two new recruiting contacts by the end of the evening.",
      "publishedAt": "2023-07-29T16:11:58Z",
      "title": "'The Few, the Proud' aren't so few: Marines recruiting surges while other services struggle",
      "url": "https://apnews.com/b3293430025ffad521fa32379a29be74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fc575482fcd448db730a254ac24ff96/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}