{
  "articles": [
    {
      "author": "MATTHEW DALY and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump announced Friday that North Dakota Gov. Doug Burgum, his choice to head the Interior Department, will also lead a newly created National Energy Council that will seek to establish U.S.",
      "publishedAt": "2024-11-15T18:58:52Z",
      "title": "Trump names Interior-designee Doug Burgum to head new White House council on energy",
      "url": "https://apnews.com/f3e02df04ffece1b07a44062ee723d71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/958f7c39526740c090b1c2050b374e6c/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — After a resounding election victory, delivering what President-elect Donald Trump and Republicans said is a mandate to govern, an uneasy political question is emerging: Will there be any room for dissent in the U.S.",
      "publishedAt": "2024-11-15T05:04:01Z",
      "title": "Trump is already testing Congress and daring Republicans to oppose him",
      "url": "https://apnews.com/59a69fe1758f5fb106d574895c70eba5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c44e1877df24828a22b11cc9451aa0d/3000.jpeg"
    },
    {
      "author": "TARA COPP, MICHELLE R. SMITH and JASON DEAREN",
      "description": "WASHINGTON (AP) — Pete Hegseth, the Army National Guard veteran and Fox News host nominated by Donald Trump to lead the Department of Defense, was flagged as a possible “Insider Threat” by a fellow service member due to a tattoo on his bicep that's associated with white supremacist groups.",
      "publishedAt": "2024-11-15T20:50:52Z",
      "title": "Trump Pentagon pick had been flagged by fellow service member as possible 'Insider Threat'",
      "url": "https://apnews.com/8cd9f065e54a7cbbaceeec8bae9261a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82be893a4327442c87e6d1023a780868/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATHENS, Ga. (AP) — A Venezuelan man \"went hunting for females on the University of Georgia’s campus” earlier this year and ended up killing nursing student Laken Riley after a struggle, a prosecutor said Friday.",
      "publishedAt": "2024-11-15T05:08:10Z",
      "title": "Trial begins for the man accused of killing Georgia nursing student Laken Riley",
      "url": "https://apnews.com/ba91b8daea0fc9ba6b3fe84bded230f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d34ee8c722fc4f86902a0d266ebda885/1920.jpeg"
    },
    {
      "author": "NADIA LATHAN",
      "description": "AUSTIN, Texas (AP) — The Texas Supreme Court on Friday ruled that a legislative subpoena cannot stop an execution after Republican and Democratic lawmakers who say Robert Roberson is innocent used the novel maneuver to pause his execution at the last minute.",
      "publishedAt": "2024-11-15T16:02:31Z",
      "title": "Texas high court says execution in 'shaken baby syndrome' case can't be halted by lawmaker subpoena",
      "url": "https://apnews.com/1f9e4d991ca3b1fb6e4becf73e1947f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b128f4bfbcd540dea23daa551a20b1e9/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — Volcanoes were erupting on the mysterious far side of the moon billions of years ago just like on the side that we can see, new research confirms. Researchers analyzed lunar soil brought back by China's Chang'e-6, the first spacecraft to return with a haul of rocks and dirt from the little-explored far side.",
      "publishedAt": "2024-11-15T10:05:36Z",
      "title": "The far side of the moon once had erupting volcanoes too",
      "url": "https://apnews.com/5ac2d80e9f715f728f8c3be2caf56797",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de20e90ebff34063b61da79a44ab7c70/1280.jpeg"
    },
    {
      "author": "BASSEM MROUE and DAVID RISING",
      "description": "BEIRUT (AP) — Lebanon’s caretaker prime minister on Friday asked Iran to help secure a cease-fire in the war between Israel and Hezbollah and appeared to urge it to convince the militant group to agree to a deal that could require it to pull back from the Israel-Lebanon border.",
      "publishedAt": "2024-11-15T10:55:42Z",
      "title": "Lebanon's prime minister asks Iran to help secure a cease-fire in Israel-Hezbollah war",
      "url": "https://apnews.com/4659bd568a65da4511852a34f54fbc17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3efb4ceb21c94a57b8a2f159f166d5fc/3000.jpeg"
    },
    {
      "author": "RIO YAMAT",
      "description": "LAS VEGAS (AP) — Hundreds of hospitality workers at a casino near the Las Vegas Strip walked off the job just before dawn Friday amid a long and highly contentious fight for a new contract.",
      "publishedAt": "2024-11-15T13:09:20Z",
      "title": "Hundreds of hospitality workers are on strike at a casino near the Las Vegas Strip",
      "url": "https://apnews.com/5b31b33e27247f7b9511f71e84d4c940",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8941ac3928634c98aa4ae859c4ed9c12/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Three daughters of Malcolm X have accused the CIA, FBI, the New York Police Department and others in a $100 million lawsuit Friday of playing roles in the 1965 assassination of the civil rights leader.",
      "publishedAt": "2024-11-15T17:56:45Z",
      "title": "The daughters of Malcolm X sue the CIA, FBI and NYPD over the civil rights leader's assassination",
      "url": "https://apnews.com/682c71e26cbeaf293d0ea783999c0c5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc7d3922d42747caa858aa11bcae7b43/2000.jpeg"
    },
    {
      "author": "SCHUYLER DIXON",
      "description": "ARLINGTON, Texas (AP) — Mike Tyson is set for his first sanctioned fight since 2005 as the 58-year-old former heavyweight champion takes on much younger YouTuber-turned-boxer Jake Paul in Texas.",
      "publishedAt": "2024-11-15T16:50:08Z",
      "title": "Jake Paul, Mike Tyson set for fight between influencer-turned-boxer and retired giant of the sport",
      "url": "https://apnews.com/0e1597caaae41254df029eb9fe62cc39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7beb987f40d3411e8b8aca76f3d30685/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}