{
  "articles": [
    {
      "author": "SEUNG MIN KIM and COREY WILLIAMS",
      "description": "DEARBORN, Mich. (AP) — While Joe Biden and Donald Trump are marching steadily toward their respective presidential nominations, Michigan's primary on Tuesday could reveal significant political perils for both of them.",
      "publishedAt": "2024-02-27T05:03:48Z",
      "title": "Biden and Trump are marching toward their nominations, but Michigan could reveal significant perils",
      "url": "https://apnews.com/6e0b9fc18773e975fdfd23f7287ed615",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7537343a9d3b4f9ea7ae69f93ee384f3/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and TIA GOLDENBERG",
      "description": "CAIRO (AP) — Israel and Hamas are inching toward a new deal that would free some of the roughly 130 hostages held in the Gaza Strip in exchange for a weekslong pause in the war, now in its fifth month.",
      "publishedAt": "2024-02-27T17:47:59Z",
      "title": "A deal between Israel and Hamas appears to be taking shape. What would it look like?",
      "url": "https://apnews.com/2ef0d5b960c4f132bfe9d91b19878a12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cfb199c12b2464faf87fe8dc2bd6e80/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, KEVIN FREKING and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Congressional leaders emerged from an “intense” Oval Office meeting with President Joe Biden on Tuesday speaking optimistically about the prospects for avoiding a partial government shutdown, but with new uncertainty about aid for Ukraine and Israel as the president and others urgently warned Speaker Mike Johnson of the grave consequences of delay.",
      "publishedAt": "2024-02-27T05:07:26Z",
      "title": "Biden and party leaders implore Speaker Johnson to help Ukraine in 'intense' Oval Office meeting",
      "url": "https://apnews.com/dc6d39b2a652130c6e3021394c1a3ee3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc83ffb163b6419fa2604011884d622d/1920.jpeg"
    },
    {
      "author": "GARANCE BURKE",
      "description": "NEW YORK (AP) — With presidential primaries underway across the U.S., popular chatbots are generating false and misleading information that threatens to disenfranchise voters, according to a report published Tuesday based on the findings of artificial intelligence experts and a bipartisan group of election officials.",
      "publishedAt": "2024-02-27T20:06:15Z",
      "title": "Chatbots' inaccurate, misleading responses about U.S. elections threaten to keep voters from polls",
      "url": "https://apnews.com/cc50dd0f3f4e7cc322c7235220fc4c69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37746b0915da45caa8c7565481c9e3a6/3000.jpeg"
    },
    {
      "author": "JEFF AMY, ELLIOT SPAGAT and WILL WEISSERT",
      "description": "ATHENS, Ga. (AP) — Laken Riley was a 22-year-old nursing student out on her morning run at the University of Georgia when authorities say a stranger dragged her into a secluded area and killed her, sending shockwaves through campus as police searched for a suspect.",
      "publishedAt": "2024-02-27T19:52:53Z",
      "title": "The killing of a Georgia nursing student is now at the center of the US immigration debate",
      "url": "https://apnews.com/63181cbc7a89fe9fe28b1d0cf84c8b9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/535cca7e52d34a2abe4f945c692e72d1/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — Two men were convicted of murder Tuesday in the death of Run-DMC star Jam Master Jay, a brazen 2002 shooting in the rap legend’s studio.",
      "publishedAt": "2024-02-27T20:44:56Z",
      "title": "2 men convicted of killing Run-DMC’s Jam Master Jay, nearly 22 years after rap star's death",
      "url": "https://apnews.com/4b49f009dc6ac9dc78d99a9dba79fc91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e81986b89b6d4b72a8705ac19bcf0c9a/3000.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — Supervisors in San Francisco formally apologized Tuesday to African Americans and their descendants for the city’s role in perpetuating racism and discrimination. “On behalf of the City and County of San Francisco, the San Francisco Board of Supervisors offers its deepest apologies to all African Americans and their descendants who came to San Francisco and were victims of systemic and structural discrimination, institutional racism, targeted acts of violence, and atrocities,” the resolution reads in part.",
      "publishedAt": "2024-02-27T05:04:26Z",
      "title": "San Francisco apologizes to Black residents for decades of racist policies",
      "url": "https://apnews.com/8967c828a52c8ce6ac08c77027a23187",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae21c6bdcdfc4808b2ade15a27d694af/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "ANCHORAGE, Alaska (AP) — A shooting that killed two adults and severely wounded two others has stunned a tiny Alaska Native whaling village above the Arctic Circle, where parents were told they could keep their children home from school Tuesday to hug them.",
      "publishedAt": "2024-02-27T00:21:39Z",
      "title": "Shooting stuns indigenous whaling village on Alaska's desolate North Slope",
      "url": "https://apnews.com/0c504981a8164fc17855d780b64f3770",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4acb538e5bd542c99df6d43de3277187/3000.jpeg"
    },
    {
      "author": "JOCELYN GECKER",
      "description": "SAN FRANCISCO (AP) — In California, a high school teacher complains that students watch Netflix on their phones during class. In Maryland, a chemistry teacher says students use gambling apps to place bets during the school day.",
      "publishedAt": "2024-02-27T05:25:45Z",
      "title": "Kids are using phones in class, even when it’s against the rules. Should schools ban them all day?",
      "url": "https://apnews.com/01fd6293a84a2e4e401708b15cb71d36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b53913a7f804b73b16006257580f308/3000.jpeg"
    },
    {
      "author": "STEPHEN WHYNO",
      "description": "Minnesota's Marcus Foligno took a hit, delivered one of his own to Chicago's Jarred Tinordi, and the two big guys dropped the gloves. Outdoors in front of 82,000 people in the Meadowlands, it took even less for Matt Rempe and Matt Martin to spice up the Rangers-Islanders showdown with a fight.",
      "publishedAt": "2024-02-27T16:15:23Z",
      "title": "20 years since NHL's record-setting brawl, fighting is down across the league but not going anywhere",
      "url": "https://apnews.com/4bd1f67beda34f72b686448d8a884082",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60dea525456744afa43cbe25b4496b7e/2400.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}