{
  "articles": [
    {
      "author": null,
      "description": "A judge is expected to order Bryan Kohberger to serve four life sentences without parole this week for brutally stabbing four University of Idaho students to death nearly three years ago. Wednesday’s sentencing hearing will be an opportunity for the families of Xana Kernodle, Madison Mogen, Ethan Chapin and Kaylee Goncalves to tell the court and Kohberger about the anguish they’ve felt since he broke into a home and killed their loved ones in the early morning hours of Nov. 13, 2022. Kohberger pleaded guilty to four counts of first-degree murder and one count of burglary in a deal that avoids the death penalty. He waived his right to appeal.",
      "publishedAt": "2025-07-23T04:07:30Z",
      "title": "Bryan Kohberger expected to receive 4 life sentences for killing Idaho university students",
      "url": "https://apnews.com/article/idaho-students-murdered-bryan-kohberger-sentencing-97325ba6addb5e0fe20af6b68f021f93",
      "urlToImage": "https://dims.apnews.com/dims4/default/571583a/2147483647/strip/true/crop/6000x3375+0+107/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Fb3%2F8f6e3eede38612e6fd9becc5b28c%2F6d3955aeb8b74941a66179ff3e5753e2"
    },
    {
      "author": null,
      "description": "President Donald Trump is unveiling an “AI Action Plan,\" shaped by Silicon Valley tech leaders who supported his campaign. The plan being released Wednesday is expected to focus on boosting artificial intelligence technology exports, streamlining permits for energy-intensive data centers, and countering perceived liberal bias in AI systems, dubbed “woke AI.” Opponents of the Trump administration's AI agenda argue it prioritizes the needs of Big Tech over people. Nearly 100 groups have come together to sign a resolution calling for a “People's AI Action Plan” that would preserve safeguards for the American public.",
      "publishedAt": "2025-07-23T04:04:58Z",
      "title": "Trump's new AI plan leans heavily on Silicon Valley industry ideas",
      "url": "https://apnews.com/article/trump-ai-artificial-intelligence-3763ca207561a3fe8b35327f9ce7ca73",
      "urlToImage": "https://dims.apnews.com/dims4/default/763f3f4/2147483647/strip/true/crop/5817x3272+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Fbc%2Fb9dcc3f503d47658a3d1bc132236%2Ff2aaee9d03b940ae8c1d3b2ac7e267ba"
    },
    {
      "author": null,
      "description": "More than 100 charity and human rights groups say that Israel’s blockade and ongoing military offensive are pushing Palestinians in the Gaza Strip toward starvation. Israeli strikes meanwhile killed another 21 people overnight and into Wednesday, according to local health officials. The Trump administration’s Mideast envoy Steve Witkoff was set to meet with a senior Israeli official about ceasefire talks, a sign that lower-level negotiations that have dragged on for weeks could be approaching a breakthrough. Experts say Gaza is at risk of famine because of Israel’s blockade and offensive, launched in response to Hamas’ Oct. 7, 2023, attack.",
      "publishedAt": "2025-07-23T14:23:18Z",
      "title": "Gaza on the brink of famine as Israeli strikes kill 21 overnight",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-aid-ceasefire-hostages-07-23-2025-1d1cfef28bc593adac2c2a0e432cfc97",
      "urlToImage": "https://dims.apnews.com/dims4/default/dc2b381/2147483647/strip/true/crop/4781x2689+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fb2%2F61ed96c997ea27f0c21d38cb6cc0%2Fdff36adf3273496980db39ad8dabe3ab"
    },
    {
      "author": null,
      "description": "Ukrainian activists are calling for more protests against a law they say weakens the country’s anti-corruption bodies. Thousands of people gathered in the capital and other cities across Ukraine on Tuesday to urge President Volodymyr Zelenskyy to veto a controversial bill passed by Ukraine’s Parliament. After Zelenskyy approved it, activists called on social media for another demonstration Wednesday in the center of Kyiv. Critics, including EU officials and rights groups, say the law undermines the agencies' independence and threatens Ukraine's democratic reforms. Zelenskyy defends the law, claiming it removes Russian influence and accelerates stalled corruption cases.",
      "publishedAt": "2025-07-23T10:09:12Z",
      "title": "More protests are expected in Ukraine after Zelenskyy signs controversial anti-corruption bill",
      "url": "https://apnews.com/article/russia-ukraine-war-corruption-protests-zelenskyy-talks-fb2fdeb3fbf36a37b2e1eefb385bac87",
      "urlToImage": "https://dims.apnews.com/dims4/default/270676f/2147483647/strip/true/crop/4240x2385+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fb8%2Fe59cbd54bcd0927387078956d9c4%2F51267112ca184a3b977835bf3d90e21a"
    },
    {
      "author": null,
      "description": "The State Department says it's investigating whether Harvard University will remain part of a government program that allows foreign nationals to take part in cultural and education exchange programs. The move Wednesday is the latest in a series of inquires by the Trump administration targeted the Ivy League school. Harvard already has filed a lawsuit challenging $2.6 billion in federal funding cuts. And the school accuses the administration of waging a retaliation campaign after Harvard rejected demands from a federal antisemitism task force in April. The State Department isn't saying why it's investigating Harvard’s eligibility to take part in the Exchange Visitor Program.",
      "publishedAt": "2025-07-23T16:10:05Z",
      "title": "Trump administration investigates Harvard's participation in visa program",
      "url": "https://apnews.com/article/harvard-state-department-trump-visa-program-862db1aa34fc623671888516362ede56",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ec4656/2147483647/strip/true/crop/5348x3008+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F7a%2F53757e2b590f4abc0ee726a660cb%2Fb9a27248538340f7a0d299735f7856a2"
    },
    {
      "author": null,
      "description": "No one had spotted the world’s smallest known snake for nearly two decades. Some scientists worried that maybe the Barbados threadsnake had become extinct. But Connor Blades lifted a rock in a tiny forest in Barbados and held his breath one sunny morning. The project officer with the eastern Caribbean island's environment ministry had already spent more than a year looking for the snake. The species can fit comfortably on a coin. The specimen in front of him was too tiny to identify with the naked eye. So he analyzed it several hours later in front of a microscope at the University of the West Indies. And it was a Barbados threadsnake.",
      "publishedAt": "2025-07-23T14:00:32Z",
      "title": "World's smallest known snake rediscovered in Barbados after nearly 20 years",
      "url": "https://apnews.com/article/barbados-smallest-snake-rediscovered-threadsnake-9bd072caaa335c7d45b1f0b294bf897f",
      "urlToImage": "https://dims.apnews.com/dims4/default/305ae93/2147483647/strip/true/crop/1139x641+0+534/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2Fa7%2F93be0311c033a8301c5e6f81bf08%2F9f6405ae6023483f947a24014cb46e92"
    },
    {
      "author": null,
      "description": "Heavy metal rocker Ozzy Osbourne died this week at 76, about five years after announcing he had Parkinson’s disease. Parkinson’s is a neurologic disease that robs people of control over their movements. It typically starts with tremors and is characterized by slow movement, a shuffling gait, stiff limbs, balance problems and slurred speech. About 10 million people worldwide are living with the disease, which usually appears after age 60. While Parkinson’s itself isn’t considered fatal, people can die from complications of the disease, including lung problems as muscle weakness impedes the ability to cough and to swallow.",
      "publishedAt": "2025-07-23T14:54:36Z",
      "title": "What to know about Parkinson's disease after Ozzy Osbourne's death",
      "url": "https://apnews.com/article/ozzy-osbourne-parkinsons-disease-black-sabbath-11e6d54599af7cf43b20bf5c29deb594",
      "urlToImage": "https://dims.apnews.com/dims4/default/eae7644/2147483647/strip/true/crop/7404x4165+0+386/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2Fcb%2F97ef2087bceea46980355c97bb62%2F0e4be45fd450458ab8212e721b004ef6"
    },
    {
      "author": null,
      "description": "A doctor has pleaded guilty to illegally supplying ketamine to Matthew Perry before the overdose death of the ‘Friends’ star. On Wednesday, Dr. Salvador Plasencia admitted in federal court to providing Perry with ketamine vials, lozenges, and syringes in the weeks leading up to his death on October 28, 2023. Prosecutors say Plasencia also injected Perry with the drug and taught his assistant how to administer it. Perry had struggled with addiction for years. Plasencia faces up to 40 years in prison but has not yet been sentenced and may get a lighter sentence. Another defendant’s trial is set for next month.",
      "publishedAt": "2025-07-23T04:46:29Z",
      "title": "Doctor pleads guilty to selling Matthew Perry ketamine",
      "url": "https://apnews.com/article/matthew-perry-doctor-guilty-plea-salvador-plasencia-ea9957df817535ab17fac24660c9c431",
      "urlToImage": "https://dims.apnews.com/dims4/default/5948b76/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F97%2Fb5ae85e6af08e83c15579830c6ab%2Ff6aa4409066b49a782e527cb042a4db1"
    },
    {
      "author": null,
      "description": "The United Nations’s top court says that if countries fail to take measures to protect the planet from climate change, they could be in violation of international law. The International Court of Justice is delivering an advisory opinion in a landmark case about nations’ obligations to tackle climate change and consequences they may face if they don’t. The court calls it an “urgent and existential” threat to humanity. The court president says that “failure of a state to take appropriate action to protect the climate system ... may constitute an internationally wrongful act.\"",
      "publishedAt": "2025-07-23T04:07:26Z",
      "title": "UN's top court delivers landmark decision on tackling climate change",
      "url": "https://apnews.com/article/un-court-opinion-climate-change-1ac84a94a5aaffd63518ef1da3502a9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/9195c68/2147483647/strip/true/crop/8173x4597+0+426/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2Ff3%2F5f16148ba1a12e7381a5bd2158e2%2Fe82ec12b7491413f8b5d94af56f17282"
    },
    {
      "author": null,
      "description": "Asian shares have rallied, with Tokyo's benchmark Nikkei 225 index up 3.5% after Japan and the U.S. announced a deal on President Donald Trump's tariffs. The agreement as announced calls for a 15% import duty on goods imported from Japan, apart from certain products such as steel and aluminum that are subject to much higher tariffs. That’s down from the 25% Trump had said would kick in on Aug. 1 if a deal was not reached. On Tuesday, Wall Street inched to another record following some mixed profit reports. The S&P 500 added 0.1% to Monday's all-time high. The Dow Jones Industrial Average rose 0.4%, while the Nasdaq slipped 0.4%.",
      "publishedAt": "2025-07-23T03:51:42Z",
      "title": "Asian markets gain, with Japan's Nikkei up 3.5%, lifted by deal on Trump's tariffs",
      "url": "https://apnews.com/article/stock-markets-tariffs-trump-japan-earnings-d051e9cd9d0e15b912219f604a1e1064",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad582a0/2147483647/strip/true/crop/3968x2232+0+170/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F36%2F482afa53074bd7dee3b1bf26d1f5%2F9784e9bd29b34fddbff31059a3882fbe"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}