{
  "articles": [
    {
      "author": "DIDI TANG",
      "description": "WASHINGTON (AP) — If some U.S. lawmakers have their way, the United States and China could end up with something in common: TikTok might not be available in either country.",
      "publishedAt": "2024-03-14T04:05:14Z",
      "title": "US lawmakers see TikTok as China's tool, even as it distances itself from Beijing",
      "url": "https://apnews.com/2d851c716d6454d7c87762a056604c7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dde72244d91745b7a9a735eda8422d2f/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and TERRY SPENCER",
      "description": "FORT PIERCE, Fla. (AP) — A federal judge will hear arguments Thursday on whether to dismiss the classified documents prosecution of Donald Trump, with his attorneys asserting that the former president was entitled to keep the sensitive records with him when he left the White House and headed to Florida.",
      "publishedAt": "2024-03-14T04:09:00Z",
      "title": "Judge to hear arguments on whether to dismiss Trump's classified documents prosecution",
      "url": "https://apnews.com/200d4c73d7c7dd75d9c9d878b77d05ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/787372846d68443490ccc24f6d615ac5/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The Israeli military said Wednesday it plans to direct a significant portion of the 1.4 million displaced Palestinians living in the Gaza Strip’s southernmost town of Rafah toward “humanitarian islands” in the center of the territory ahead of its planned offensive in the area.",
      "publishedAt": "2024-03-13T18:48:58Z",
      "title": "Israel says it plans to direct Palestinians out of Rafah ahead of anticipated offensive",
      "url": "https://apnews.com/1ecd20b754890b623f523be41591aadf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28682e2ae6cc4ae397895810846b38ea/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "OKLAHOMA CITY (AP) — The death of a nonbinary student the day after a fight inside an Oklahoma high school restroom has been ruled a suicide, the state medical examiner's office said Wednesday.",
      "publishedAt": "2024-03-13T21:38:20Z",
      "title": "Death of nonbinary teen Nex Benedict after school fight is ruled a suicide, medical examiner says",
      "url": "https://apnews.com/88f403bfd5436a53b636dcc2bc59ebf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65905b23760549059d176c1f533a32fc/1600.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "ST. LOUIS (AP) — Volatile weather was honing in on parts of Kansas and Missouri Wednesday night, with some storms bringing massive chunks of hail.The National Weather Service just after 8 p.m.",
      "publishedAt": "2024-03-13T21:30:17Z",
      "title": "Storm carrying massive 'gorilla hail' threatens parts of Kansas and Missouri",
      "url": "https://apnews.com/3d813afdc4b07eef5212695fb459450e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bc51e3818ec450281d4e2c300b6c540/1350.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "PONTIAC, Mich. (AP) — A prosecutor urged jurors to convict the father of a Michigan school shooter on Wednesday, saying he ignored the \"easiest, most glaring opportunities\" to prevent the killing of four students, especially when confronted with his son's violent classroom drawing.",
      "publishedAt": "2024-03-13T14:34:17Z",
      "title": "Prosecutor urges jury to convict Michigan school shooter's dad, says he could have prevented tragedy",
      "url": "https://apnews.com/f4c556e14c958383146677ad3cdfcbaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbc4350ca8924282a96778a762ae8413/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO and EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A proposal to install new leadership in Haiti appeared to be crumbling Wednesday as some political parties rejected the plan to create a presidential council that would manage the transition.",
      "publishedAt": "2024-03-13T17:57:04Z",
      "title": "Plan to install new leaders in Haiti appears to crumble after political parties reject it",
      "url": "https://apnews.com/aa91714a56ade1220a4e5f0d203716d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9477c98825d04bc0b4aa0c9baab525cb/3000.jpeg"
    },
    {
      "author": "ASTRID SUÁREZ",
      "description": "COSCUEZ, Colombia (AP) — Deep inside mountain tunnels where the heat is so intense it causes headaches, women with power tools are chipping away at boulders in search of gems. They have opened a difficult path for themselves in Colombia's emerald industry, a sector long dominated by men.",
      "publishedAt": "2024-03-14T04:09:21Z",
      "title": "Women blast through gender barriers in Colombia's emerald mines, but struggle to emerge from poverty",
      "url": "https://apnews.com/fc7e1503049bad3815d75fdf80099f52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ef01ad66cfc4080b0785b7cf162040a/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS AND AMELIA THOMSON-DeVEAUX",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump have secured their party’s nominations for president, setting up a rematch of the 2020 election.While both men sailed through the primary season, their paths to a win in November will be more difficult.",
      "publishedAt": "2024-03-13T18:00:20Z",
      "title": "Biden's fraying coalition and Trump's struggle with moderates: AP data shows nominees' challenges",
      "url": "https://apnews.com/f80f8d7193e7901768b1bf67378c442a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/603576ecb1f240a4aad85faa4816e5e4/3000.jpeg"
    },
    {
      "author": "JASON DEAREN and MICHAEL REZENDES",
      "description": "A former bishop in The Church of Jesus Christ of Latter-day Saints who was featured in an Associated Press investigation into how the church protects itself from allegations of sexual abuse was arrested by police in Virginia this week after being indicted on charges he sexually abused his daughter while accompanying her on a school trip when she was a child, according to court filings.",
      "publishedAt": "2024-03-13T21:10:47Z",
      "title": "Former Mormon bishop highlighted in AP investigation arrested on felony child sex abuse charges",
      "url": "https://apnews.com/aedc8cfc9175ebadb18420ec25a5f99c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c5fd2c5c5514322b353de4e22729030/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}