{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike on a crowded tent camp housing Palestinians displaced by the war in Gaza killed at least 40 people and wounded 60 others early Tuesday, Palestinian officials said.",
      "publishedAt": "2024-09-10T02:05:52Z",
      "title": "An Israeli strike on a Gaza humanitarian zone tent camp kills at least 40 people, Palestinians say",
      "url": "https://apnews.com/3e1435277993d03de61f4e1c7494deec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05f9eacf16a54f7a82ce5c5bdf2e9052/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Kamala Harris and Donald Trump will meet for the first time face-to-face Tuesday night for perhaps their only debate, a high-pressure opportunity to showcase their starkly different visions for the country after a tumultuous campaign summer.",
      "publishedAt": "2024-09-10T04:05:35Z",
      "title": "The Harris-Trump debate becomes the 2024 election's latest landmark event",
      "url": "https://apnews.com/6ad8c03f6bf1ae88870b7db26276236e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e38fc71173f459a86e49083808d5b3c/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "With early voting fast approaching, the rhetoric by Republican presidential nominee Donald Trump has turned more ominous with a pledge to prosecute anyone who “cheats” in the election in the same way he believes they did in 2020, when he falsely claimed he won and attacked those who stood by their accurate vote tallies.",
      "publishedAt": "2024-09-09T23:14:37Z",
      "title": "Trump's rhetoric on elections turns ominous as voting nears in the presidential race",
      "url": "https://apnews.com/2ed9908e82075705f4b00ecfc93fa3fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8de43b73775846619c8684f2940a7665/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and LINLEY SANDERS",
      "description": "CHICAGO (AP) — For Christopher Pugh, the 2020 election was a turning point.He already distrusted the government. But as he watched Fox News coverage in the immediate aftermath of the election and read posts on Twitter, the social media platform now known as X, that distrust grew.",
      "publishedAt": "2024-09-10T04:09:40Z",
      "title": "AP-NORC/USAFacts poll: Republicans are more likely to trust Trump than official election results",
      "url": "https://apnews.com/451b4f6ebc4c82ac941521b9059500d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc985612b2f3486a98fd91a9b5b6d30f/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "ATLANTA (AP) — Many students in Georgia's Barrow County are headed back to class Tuesday, six days after a shooting killed two teachers and two students at the school district's Apalachee High School northeast of Atlanta.",
      "publishedAt": "2024-09-10T04:04:42Z",
      "title": "Most students in a Georgia school district hit by a shooting will return to class Tuesday",
      "url": "https://apnews.com/2a7406da1fd52c0da0b10eb3b650466b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d176e42e1614a9cb01c23ef80539342/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI and NICOLE WINFIELD",
      "description": "DILI, East Timor (AP) — Tens of thousands of East Timorese streamed Tuesday toward a seaside park for Pope Francis’ big Mass, held on the same field where St.",
      "publishedAt": "2024-09-10T02:37:16Z",
      "title": "East Timorese flock to seaside park for Pope Francis' Mass at site of John Paul II's historic visit",
      "url": "https://apnews.com/8a12d6cfa771b2603d1044afd4ac68a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/346de3ad5a694dc29e84034bc37c6788/1920.jpeg"
    },
    {
      "author": "SARA CLINE and JAMIE STENGLE",
      "description": "BATON ROUGE, La. (AP) — Tropical Storm Francine strengthened Monday in the Gulf of Mexico and was forecast to make landfall as a hurricane this week in Louisiana, where evacuation orders were quickly issued in some coastal communities and residents began filling sandbags in preparation for heavy rains and widespread flooding.",
      "publishedAt": "2024-09-09T15:08:31Z",
      "title": "Louisiana residents brace as Tropical Storm Francine is expected to hit their coast as a hurricane",
      "url": "https://apnews.com/d12cf03820106f9eb7451e00de1015c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/950ef205f6924e68967f6ead99dca65c/1920.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — James Earl Jones, who overcame racial prejudice and a severe stutter to become a celebrated icon of stage and screen — eventually lending his deep, commanding voice to CNN, “The Lion King” and Darth Vader — has died.",
      "publishedAt": "2024-09-09T20:51:43Z",
      "title": "James Earl Jones, acclaimed actor and voice of Darth Vader, dies at 93",
      "url": "https://apnews.com/19ea259ff3f44b91b2ed8730b702c23f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6595334075ea482985e235e60fe79cce/1920.jpeg"
    },
    {
      "author": "AARON MORRISON, ALANIS THAMES and TERRY TANG",
      "description": "MIAMI (AP) — After his traffic stop in Miami on Sunday, Tyreek Hill said he has received “the talk” about what to do when pulled over by police.",
      "publishedAt": "2024-09-10T04:07:11Z",
      "title": "Tyreek Hill's traffic stop shows interactions with police can be about survival for Black men",
      "url": "https://apnews.com/3f1a6585c3ae92c26b596bf1e8ee6e16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e9320f17c834a1ea41aa611d0455cac/2400.jpeg"
    },
    {
      "author": "JOSH DUBOW",
      "description": "SANTA CLARA, Calif. (AP) — Fill-in back Jordan Mason took top billing in a game hyped as Aaron Rodgers' return.",
      "publishedAt": "2024-09-10T03:15:29Z",
      "title": "The 49ers spoil Aaron Rodgers' return with a 32-19 win over the Jets",
      "url": "https://apnews.com/756aa152efe4dd1b84990ea6a57112e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/922d524213194fc38261afc933736690/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}