{
  "articles": [
    {
      "author": "BASSEM MROUE and WAFAA SHURAFA",
      "description": "BEIRUT (AP) — Israeli strikes killed 38 people in Gaza and three journalists in Lebanon on Friday as growing worries about supply shortages in Gaza and international pressure for a cease-fire mounted.",
      "publishedAt": "2024-10-25T04:31:36Z",
      "title": "Israeli strikes kill 38 people in Gaza's Khan Younis and 3 journalists in southern Lebanon",
      "url": "https://apnews.com/0920f63542d158ad5999c481e421da00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4205e4e5ec643efa5e900f05968ad44/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, DARLENE SUPERVILLE and NADIA LATHAN",
      "description": "HOUSTON (AP) — Vice President Kamala Harris will team up with Beyoncé on Friday for a rally in solidly Republican Texas aimed at highlighting the perilous medical fallout from the state's strict abortion ban and putting the blame squarely on Donald Trump.",
      "publishedAt": "2024-10-25T04:06:58Z",
      "title": "Harris, Beyoncé team up for a Texas rally on abortion rights and hope battleground states hear them",
      "url": "https://apnews.com/f228eedd3308dab2e1125fdf6029a4a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3214923f4624cdda4f9b4cdd7f0c5e2/1061.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "WASHINGTON (AP) — Donald Trump said Thursday that China's leader would handle Vice President Kamala Harris “like a baby” if she's elected to the White House, as the former president and his top allies increasingly have moved to infantilize the Democratic nominee.",
      "publishedAt": "2024-10-24T23:03:53Z",
      "title": "Trump says China's leader will bully Harris 'like a baby' as his allies try to infantilize her",
      "url": "https://apnews.com/b2ab4c91580d87d843aa3b19f958a6e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd9f48f69ab24afcb8555043149f4cb0/1920.jpeg"
    },
    {
      "author": "CLAIRE GALOFARO and KIM TONG-HYUNG",
      "description": "HENDERSON, Nev. (AP) — The 50-year-old newspaper was turning yellow and its edges fraying, so she had it laminated, not as a memento but as proof — America made a promise to her, and did not keep it.",
      "publishedAt": "2024-10-25T01:36:41Z",
      "title": "‘US doesn’t see me as an American’: Thousands of adoptees live in limbo without citizenship",
      "url": "https://apnews.com/0c71631786c35f7042ff99726e9dcd23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42a35e0a2ad34e2cbbcaad97fe6a9a1e/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and MOLLY QUELL",
      "description": "THE HAGUE, Netherlands (AP) — As the International Criminal Court’s top prosecutor sought war crimes charges this year against Israeli Prime Minister Benjamin Netanyahu over actions in Gaza, he was engulfed in a very different personal crisis playing out behind the scenes.",
      "publishedAt": "2024-10-25T09:36:37Z",
      "title": "International court prosecutor who charged Netanyahu faces sexual misconduct accusation",
      "url": "https://apnews.com/7519d876decb945aafc2215756df19b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6951b42f855429f893d8147c3bbca56/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — Progressive Democrats warn Kamala Harris risks losing the support of a small but significant portion of her political base unless she changes her campaign's closing message — and its messengers — immediately.",
      "publishedAt": "2024-10-25T04:01:51Z",
      "title": "Progressives warn Harris must change her closing message as the election looms",
      "url": "https://apnews.com/9b37850eec2c8181213fbe4980dcd79e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7060d3888874c49bf0146bc4a51df3b/3000.jpeg"
    },
    {
      "author": "STEFANIE DAZIO, JAIMIE DING and CHRISTOPHER WEBER",
      "description": "LOS ANGELES (AP) — Erik and Lyle Menendez still have a long way to go before they can walk out of prison, even though the Los Angeles County district attorney has recommended their life-without-parole sentences be thrown out and the brothers be resentenced and immediately eligible for parole.",
      "publishedAt": "2024-10-25T05:02:48Z",
      "title": "Erik and Lyle Menendez are a step closer to leaving prison, but freedom won't come quickly",
      "url": "https://apnews.com/bafe4ca46b23751cfa7c4745e88f4edb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c31930bfd82749bfb946b3ed4ec29dab/1920.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — Four astronauts returned to Earth on Friday after a nearly eight-month space station stay extended by Boeing's capsule trouble and Hurricane Milton.",
      "publishedAt": "2024-10-25T07:31:09Z",
      "title": "4 astronauts return to Earth after being delayed by Boeing's capsule trouble and Hurricane Milton",
      "url": "https://apnews.com/f99e1724b4c131e68e0cf8c30274fc11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f66d7453e6754a3899930198a0512dda/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "MIAMI (AP) — The last Kmart on the U.S. mainland sits at the west end of a busy suburban Miami shopping center, quiet and largely ignored.All around it are thriving chain stores attracting steady streams of customers in sectors where the former box-store chain was once a major player: Marshalls, Hobby Lobby, PetSmart and Dollar Tree.",
      "publishedAt": "2024-10-25T04:02:21Z",
      "title": "In a suburban Miami shopping center, Kmart's last 'Blue Light Specials' flicker",
      "url": "https://apnews.com/dea8b27e0df8d16aa570657757283286",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/649746d47b9946ca837eaf54162cebbc/3000.jpeg"
    },
    {
      "author": "R.J. RICO",
      "description": "If Donald Trump wins the presidential election, Republicans hope he will fulfill a longstanding GOP goal of privatizing the mortgage giants Fannie Mae and Freddie Mac, which have been under government control since the Great Recession.",
      "publishedAt": "2024-10-25T04:21:21Z",
      "title": "Allies hope a Trump win changes the system for mortgages. Some warn it will make them pricier",
      "url": "https://apnews.com/686bd902ce630a64c90f9373bee9e2be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4eb803c8309941a19ce441cd91662032/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}