{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — Israel ramped up its airstrikes Monday in Gaza, where the death toll was rising rapidly, and the United States advised Israel to delay an expected ground invasion to allow more time to negotiate the release of hostages taken by Hamas militants.",
      "publishedAt": "2023-10-23T06:39:25Z",
      "title": "Israel ramps up strikes on Gaza as US advises delaying ground war to allow talks on captives",
      "url": "https://apnews.com/c0e7ec55428fedc97f75bdfdc0c0679a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c62dff9548ed479885f9614f52da9c3b/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and SAMYA KULLAB",
      "description": "DEIR AL BALAH, Gaza Strip (AP) — A premature baby squirms inside a glass incubator in the neonatal ward of al-Aqsa Hospital in the central Gaza Strip. He cries out as intravenous lines are connected to his tiny body.",
      "publishedAt": "2023-10-22T21:14:56Z",
      "title": "Dwindling fuel supplies for Gaza's hospital generators put premature babies in incubators at risk",
      "url": "https://apnews.com/9ec2e404e16a132821dac644af110ef6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98bfb8f22f1d4714b940c5eab23f9ffd/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "REHOBOTH BEACH, Del. (AP) — Secretary of State Antony Blinken and Defense Secretary Lloyd Austin said Sunday that the United States expects the Israel-Hamas war to escalate through involvement by proxies of Iran, and they asserted that the Biden administration is prepared to respond if American personnel or armed forces become the target of any such hostilities.",
      "publishedAt": "2023-10-22T17:21:22Z",
      "title": "Blinken, Austin say US is ready to respond if US personnel become targets of Israel-Hamas war",
      "url": "https://apnews.com/1d630d162c413383d91fc535904c854a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14e3e18c00164e70b335b4dafd8ea7e2/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI and DAVID BILLER",
      "description": "BUENOS AIRES, Argentina (AP) — Argentina's economy minister and the anti-establishment upstart he faces in a presidential runoff next month began competing Monday to shore up the moderate voters they need.",
      "publishedAt": "2023-10-23T04:50:02Z",
      "title": "After presidential race surprise, Argentine economy minister and right-wing populist look to runoff",
      "url": "https://apnews.com/a603b4e3edf851cc47d0117738173b35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3bfd512fe3740f596abfa396fa9367f/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "WAYNE, Mich. (AP) — Throughout its 5-week-old strikes against Detroit’s automakers, the United Auto Workers union has cast an emphatically combative stance, reflecting the style of its pugnacious leader, Shawn Fain.",
      "publishedAt": "2023-10-23T10:00:44Z",
      "title": "UAW's confrontational leader makes gains in strike talks, but some wonder: Has he reached too far?",
      "url": "https://apnews.com/0e3e71f44f075fda066f499bb2165b48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f3a94d574814d2bacb5f92ca60435d7/3000.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "FRANKFURT, Germany (AP) — For months after Ukraine's Western allies limited sales of Russian oil to $60 per barrel, the price cap was still largely symbolic.",
      "publishedAt": "2023-10-23T06:28:43Z",
      "title": "A price cap on Russian oil aims to starve Putin of cash. But it's largely been untested. Until now",
      "url": "https://apnews.com/82ecb172697336362bccf71c1506fa5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01b9beb2f9034083bdba01f55dc44a99/3000.jpeg"
    },
    {
      "author": "BROOKE SCHULTZ",
      "description": "Local elections in Democratic strongholds at both ends of Pennsylvania next month could show how voters feel about progressive candidates and issues such as abortion and crime ahead of the 2024 election.",
      "publishedAt": "2023-10-23T14:06:13Z",
      "title": "Outcome of key local races in Pennsylvania could offer lessons for 2024 election",
      "url": "https://apnews.com/fce41331c26253135616cf4c1116afdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d68f26e7b5714afea465e9657729ccf3/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — U.S. Sen. Bob Menendez returns to court Monday to enter an expected not guilty plea to a conspiracy charge alleging he acted as an agent of the Egyptian government when he chaired the Senate Foreign Relations Committee.",
      "publishedAt": "2023-10-23T04:10:24Z",
      "title": "Sen. Menendez returns to New York court to enter plea to new conspiracy charge",
      "url": "https://apnews.com/afcf83d5dd20250b85d12fd8819c9fc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b912e3ee0f1e4e588af9e975cf97782e/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "No matter how much the world cuts back on carbon emissions, a key and sizable chunk of Antarctica is essentially doomed to an “unavoidable” melt, a new study found.",
      "publishedAt": "2023-10-23T15:01:37Z",
      "title": "Even with carbon emissions cuts, a key part of Antarctica is doomed to slow collapse, study says",
      "url": "https://apnews.com/946bb44fbef027186f80f8992ebfc064",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42196a098586414b8ecac8e62c59f193/1920.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Fans decked in red streamed into the Lahainaluna High School football stadium, snacking on nachos and venison chili, bopping to the high school band’s rendition of “Sweet Caroline,” and exchanging long hugs with neighbors and classmates.",
      "publishedAt": "2023-10-23T00:34:39Z",
      "title": "Football provides a homecoming and hope in Lahaina, where thousands of homes are gone after wildfire",
      "url": "https://apnews.com/76ff3ea949edc81e21f3b3fde3f6107d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5893fd9c02894202bd204fef3feb5398/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}