{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, ABBY SEWELL and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — Israel and the Lebanese militant group Hezbollah traded heavy fire early Sunday but backed off from sparking a widely feared all-out war, as both sides signaled their most intense exchange in months was over.",
      "publishedAt": "2024-08-25T02:23:12Z",
      "title": "Israel and Hezbollah trade their most intense fire in months and then pull back",
      "url": "https://apnews.com/52056075daebc9aac6675043f64439ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8799b7b1e4d44e6daea437a7ea9fff15/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel and Lebanon's Hezbollah on Sunday launched their heaviest exchange of fire after months of strikes and counterstrikes that have raised fears of an all-out war.",
      "publishedAt": "2024-08-25T09:44:52Z",
      "title": "What to know about the heavy exchange of fire between Israel and Lebanon's Hezbollah",
      "url": "https://apnews.com/d3aeb1826cca2cbcda019f4778947e5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da1b84d64f9e4edc849581c9d8e0606a/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and DAVID McHUGH",
      "description": "SOLINGEN, Germany (AP) — A Syrian man on Sunday was ordered held on suspicion of murder and membership in a terrorist organization in connection with the Solingen knife attack that left three dead and eight wounded at a festival marking the city’s 650th anniversary.",
      "publishedAt": "2024-08-25T06:33:11Z",
      "title": "The suspect in the Germany attack was motivated by Islamic State group ideology, prosecutors say",
      "url": "https://apnews.com/1095235a9dadf6e1005e8adff52d05b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f32b08d9f4ea451a986820d7f2b1b6a7/1920.jpeg"
    },
    {
      "author": "RICHARD LARDNER, JONATHAN MATTISE, TRENTON DANIEL and STEVE KARNOWSKI",
      "description": "WASHINGTON (AP) — John Kolb, a retired Minnesota National Guard colonel, knew Tim Walz by reputation as an “excellent leader” who adroitly guided the enlisted troops in his field artillery battalion.",
      "publishedAt": "2024-08-25T11:48:41Z",
      "title": "Walz’s exit from Minnesota National Guard left openings for critics to pounce on his military record",
      "url": "https://apnews.com/8a74ff39f0a698247b28bf4266f20773",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c86e3a30e20476499562609396a3897/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "ANCHORAGE, Alaska (AP) — Easter Leafa was sitting under a blanket on her balcony with a knife when Anchorage police arrived, responding to a call for help from her family. Instead of showing her hands as told, they said, the 16-year-old girl stood and approached them with the blade.",
      "publishedAt": "2024-08-25T04:03:24Z",
      "title": "The shooting death of a 16-year-old girl by police is among a spate that's upset Anchorage residents",
      "url": "https://apnews.com/456f54d86ad8e3d60e07ab75eb2fcac6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e3ad5b6251a4d44b913a83e02428111/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "NEW YORK (AP) — Kamala Harris accepted the Democratic nomination “on behalf of everyone whose story could only be written in the greatest nation on Earth.” America, Barack Obama thundered, “is ready for a better story.” JD Vance insisted that the Biden administration “is not the end of our story,” and Donald Trump called on fellow Republicans to “write our own thrilling chapter of the American story.”",
      "publishedAt": "2024-08-25T04:01:31Z",
      "title": "Behind the rhetoric, a presidential campaign is a competition about how to tell the American story",
      "url": "https://apnews.com/68aad96e58a7786c2603544f606cf8ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f08b5e0399c4939969c3ba6af6e2b2c/3000.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON",
      "description": "Isabella Pires first noticed what she calls the “gradual apathy pandemic” in eighth grade. Only a handful of classmates registered for service projects she helped organize at her Massachusetts school.",
      "publishedAt": "2024-08-25T04:17:21Z",
      "title": "Schools are competing with cell phones. Here's how they think they could win",
      "url": "https://apnews.com/4d89f5b7fd7c8f1d5903f8c04f26da54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08aa409189dd4317bf54df0a1f76d18f/1920.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Five people died in Ukrainian shelling in Russia’s border region of Belgorod, officials said Sunday, while Russian forces struck a hotel in eastern Ukraine, leaving one journalist missing and two others injured.",
      "publishedAt": "2024-08-25T10:22:01Z",
      "title": "5 people die in shelling of a Russian border region while Russian fire hits a hotel with reporters",
      "url": "https://apnews.com/f7726e08a3da2eb2ac49b65d0e7d2014",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97e34a1585a64dddaa1a4127f3877580/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "Vice President Kamala Harris' campaign says it has now raised $540 million for its election battle against Republican nominee former President Donald Trump.",
      "publishedAt": "2024-08-25T10:03:40Z",
      "title": "Harris campaign says it's raised $540 million and saw a surge of donations during the convention",
      "url": "https://apnews.com/43b32b26125229db182234f7ec06da14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/112620023abd4eb6a462b4bc79e08a20/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — Tropical Storm Hone increased to a Category 1 hurricane while continuing its steady approach toward Hawaii late Saturday, forecasters said.Hone (pronounced hoe-NEH) had top winds of 75 mph (120 kph), according to an 11 p.m.",
      "publishedAt": "2024-08-24T04:08:51Z",
      "title": "Tropical Storm Hone increases to Category 1 hurricane strength while approaching Hawaii",
      "url": "https://apnews.com/7c086ba23441e6e69177e3da3d703655",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4acb6d8fe0ee4b10a424cf9afa0c4fa2/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}