{
  "articles": [
    {
      "author": null,
      "description": "JERUSALEM (AP) — International Committee of the Red Cross confirms two women held hostage in Gaza have been released by Hamas.",
      "publishedAt": "2023-10-23T19:24:36Z",
      "title": "International Committee of the Red Cross confirms two women held hostage in Gaza have been released by Hamas",
      "url": "https://apnews.com/0ab62b5fb0049e38c5e64c020d5d93b9",
      "urlToImage": ""
    },
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — Hamas released two elderly Israeli women held hostage in Gaza on Monday, as the United States expressed increasing concern that the escalating Israel-Hamas war will spark a wider conflict in the region, including attacks on American troops.",
      "publishedAt": "2023-10-23T06:39:25Z",
      "title": "Hamas frees two Israeli women as US advises delaying ground war to allow talks on captives",
      "url": "https://apnews.com/c0e7ec55428fedc97f75bdfdc0c0679a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c62dff9548ed479885f9614f52da9c3b/1920.jpeg"
    },
    {
      "author": "TARA COPP and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The Pentagon has sent military advisers, including a Marine Corps general versed in urban warfare, to Israel to aid in its war planning and is speeding multiple sophisticated air defense systems to the Middle East days ahead of an anticipated ground assault into Gaza.",
      "publishedAt": "2023-10-23T19:39:02Z",
      "title": "Pentagon rushes defenses, advisers to Middle East as Israel's ground assault in Gaza looms",
      "url": "https://apnews.com/1a906598be5baccc614897768b1824a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/000be4b9b70c402caad490750caa1091/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and NAJIB JOBAIN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Yousra Abu Sharekh’s days begin in the southern Gaza Strip often after sleepless nights amid blaring ambulance sirens and the clamor of neighbors in the brief pause between relentless Israeli airstrikes.",
      "publishedAt": "2023-10-23T17:13:04Z",
      "title": "Two weeks ago she was thriving. Now, a middle-class mom in Gaza struggles to survive",
      "url": "https://apnews.com/24f139484879b0f388e864c6463d7e8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c082d2b1c31a4e3a9cd844b48a97dc24/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Day 20 without a House speaker, and Republicans found themselves starting over on Monday — bumbling ahead with few ideas about who will lead, what they are fighting over and when they will get Congress working again.",
      "publishedAt": "2023-10-23T16:44:07Z",
      "title": "It's Day 20 with no House speaker, and lower-level names are starting to reach for the gavel",
      "url": "https://apnews.com/b4eceb0487c51de6695ecd1e49172f17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/146985d602774d22ab6d1587958922e2/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI and DAVID BILLER",
      "description": "BUENOS AIRES, Argentina (AP) — Argentina's economy minister and the anti-establishment upstart he faces in a presidential runoff next month began competing Monday to shore up the moderate voters they need.",
      "publishedAt": "2023-10-23T04:50:02Z",
      "title": "After presidential race surprise, Argentine economy minister and right-wing populist look to runoff",
      "url": "https://apnews.com/a603b4e3edf851cc47d0117738173b35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3bfd512fe3740f596abfa396fa9367f/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "WAYNE, Mich. (AP) — Throughout its 5-week-old strikes against Detroit’s automakers, the United Auto Workers union has cast an emphatically combative stance, reflecting the style of its pugnacious leader, Shawn Fain.",
      "publishedAt": "2023-10-23T10:00:44Z",
      "title": "UAW's confrontational leader makes gains in strike talks, but some wonder: Has he reached too far?",
      "url": "https://apnews.com/0e3e71f44f075fda066f499bb2165b48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f3a94d574814d2bacb5f92ca60435d7/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — An off-duty pilot riding in the extra seat in the cockpit of a Horizon Air passenger jet tried to shut down the engines in midflight and had to be subdued by the crew, according to a pilot flying the plane.",
      "publishedAt": "2023-10-23T16:30:30Z",
      "title": "An off-duty pilot is accused of trying to shut down the engines of a Horizon Air jet in midflight",
      "url": "https://apnews.com/457e4bc7a1eca47842ce64aebe512c24",
      "urlToImage": ""
    },
    {
      "author": "BROOKE SCHULTZ",
      "description": "Local elections in Democratic strongholds at both ends of Pennsylvania next month could show how voters feel about progressive candidates and issues such as abortion and crime ahead of the 2024 election.",
      "publishedAt": "2023-10-23T14:06:13Z",
      "title": "Outcome of key local races in Pennsylvania could offer lessons for 2024 election",
      "url": "https://apnews.com/fce41331c26253135616cf4c1116afdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d68f26e7b5714afea465e9657729ccf3/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — U.S. Sen. Bob Menendez returned to court Monday and entered a not guilty plea to a charge alleging that he conspired to act as an agent of the Egyptian government when he chaired the Senate Foreign Relations Committee.",
      "publishedAt": "2023-10-23T04:10:24Z",
      "title": "Sen. Menendez enters not guilty plea to a new conspiracy charge",
      "url": "https://apnews.com/afcf83d5dd20250b85d12fd8819c9fc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10a6390963b24d7f907b36d32a6e6db6/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}