{
  "articles": [
    {
      "author": "WILL WEISSERT and LISA MASCARO",
      "description": "WASHINGTON (AP) — President-elect Donald Trump is making a victor's return to Washington. President Joe Biden will welcome him to the White House on Wednesday for an Oval Office visit that is a traditional part of the peaceful handoff of power — a ritual that Trump himself declined to participate in four years ago.",
      "publishedAt": "2024-11-13T05:02:28Z",
      "title": "Trump makes a victor's return to Washington to meet with Biden and GOP lawmakers",
      "url": "https://apnews.com/24753cdd48514c68a832a6a1c255337c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05acc1c1e77c48be8dc19039c95b2dbe/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — President-elect Donald Trump stunned the Pentagon and the broader defense world by nominating Fox News host Pete Hegseth to serve as his defense secretary, tapping someone largely inexperienced and untested on the global stage to take over the world's largest and most powerful military.",
      "publishedAt": "2024-11-13T05:27:18Z",
      "title": "Trump's defense choice stuns the Pentagon, raises questions about the Fox News host's experience",
      "url": "https://apnews.com/2d8030921ecef933778cf92afd40ec72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e583d600fd2d442198a6e7215b295964/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and JILL COLVIN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump on Tuesday said Elon Musk and former GOP presidential candidate Vivek Ramaswamy will lead a new “Department of Government Efficiency\" — which is not, despite the name, a government agency.",
      "publishedAt": "2024-11-13T01:39:40Z",
      "title": "Trump says Musk, Ramaswamy will form outside group to advise White House on government efficiency",
      "url": "https://apnews.com/2f0f76bb6440231f2504b77cb117d988",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/161f5bc8ec22458ba2c2de7257942619/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — When Zarifa Nawfal’s family arrived in Beirut for her wounded daughter’s surgery, one of the first things she wanted to do was go to the sea. The Mediterranean had been a constant companion at their home in Gaza before the war.",
      "publishedAt": "2024-11-13T05:04:33Z",
      "title": "Children brought from Gaza to heal from war wounds become caught in another war, in Lebanon",
      "url": "https://apnews.com/7ef6100b0f6bea94b1a939676ac09d34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7336e2c97bd84179b4cbbe0b834076e0/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli strike on a home in northern Gaza killed three siblings aged 6 and under, among at least six people killed in airstrikes in the war-ravaged territory, Palestinian medics said. In Lebanon, an Israeli airstrike on an apartment building south of Beirut on Wednesday killed at least six people and wounded 15, the Health Ministry said.",
      "publishedAt": "2024-11-13T09:54:03Z",
      "title": "Middle East latest: 3 young siblings killed in Gaza as Israeli strikes leave 6 dead in Lebanon",
      "url": "https://apnews.com/2e7065731020a76e89b42643bdfcb9ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c702eb416add42f7a04d4d7a6939d618/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Russia attacked the Ukrainian capital Kyiv with a sophisticated combination of missiles and drones for the first time in 73 days on Wednesday, authorities reported, as the Pentagon said most of the North Korean troops sent to help Moscow's war effort are fighting to drive Ukraine's army off Russian soil in the Kursk border region.",
      "publishedAt": "2024-11-13T08:16:55Z",
      "title": "Russia launches first missile attack on Kyiv in months as North Korean troops fight Ukraine in Kursk",
      "url": "https://apnews.com/276e38b9e841f92032909f08456743f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de3be59be81e455fa683e8234239ba89/1280.jpeg"
    },
    {
      "author": "EVENS SANON and MEGAN JANETSKY",
      "description": "PORT-AU-PRINCE, Haiti (AP) — The Federal Aviation Administration prohibited U.S. airlines from flying to Haiti for 30 days after gangs shot three planes and the United Nations also Tuesday temporarily suspended flights to Port-au-Prince, limiting humanitarian aid coming into the country.",
      "publishedAt": "2024-11-12T15:26:27Z",
      "title": "US prohibits airlines from flying to Haiti and UN suspends flights after planes were shot by gangs",
      "url": "https://apnews.com/90dc8d26bc58eb9b214385ac10f315a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f97a7927c4e4769baca7beec279b9b0/1920.jpeg"
    },
    {
      "author": "NG HAN GUAN, EMILY WANG FUJIYAMA and HUIZHONG WU",
      "description": "ZHUHAI, China (AP) — People in a southern Chinese city were paying respects Wednesday to 35 of its residents killed by a driver who rammed his vehicle into a sports complex earlier this week, mowing down people as they were exercising.",
      "publishedAt": "2024-11-13T04:32:21Z",
      "title": "Residents in a southern Chinese city mourn 35 people killed in a car-ramming attack at sports center",
      "url": "https://apnews.com/d4ceca9ec301d768257f8e6ef0b9368a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/799b36afc0904b19bacd156431087bc1/1920.jpeg"
    },
    {
      "author": "MELINA WALLING, SIBI ARASU and SETH BORENSTEIN",
      "description": "BAKU, Azerbaijan (AP) — More than two dozen world leaders are delivering remarks at the United Nations' annual climate conference Wednesday, with many hart-hit nations detailing their nations' firsthand experience with the catastrophic weather that has come with climate change.",
      "publishedAt": "2024-11-13T04:58:19Z",
      "title": "At UN climate talks, nations big and small get chance to bear witness to climate change",
      "url": "https://apnews.com/67aa7cd1610c86779c11430afc269b8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d640a6282944fc893cff38fd305f571/3000.jpeg"
    },
    {
      "author": "JOCELYN GECKER and SHARON LURYE",
      "description": "Transgender youth in the United States have been flooding crisis hotlines since the election of Donald Trump, who made anti-transgender themes central to his campaign.",
      "publishedAt": "2024-11-13T05:38:39Z",
      "title": "Trump pledged to roll back protections for transgender students. They're flooding crisis hotlines",
      "url": "https://apnews.com/1b9d3a1d928ea78c21372da63600c6d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e27bc5d00254a49bb9cfd8aef549c01/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}