{
  "articles": [
    {
      "author": "JOSEPH WILSON, MELANIE LIDMAN and JOSEPH KRAUSS",
      "description": "TEL AVIV, Israel (AP) — Norway, Ireland and Spain said Wednesday they would recognize a Palestinian state, a historic but largely symbolic move that further deepens Israel’s isolation more than seven months into its grinding war against Hamas in Gaza.",
      "publishedAt": "2024-05-22T06:42:14Z",
      "title": "Norway, Ireland and Spain say they will recognize a Palestinian state, deepening Israel's isolation",
      "url": "https://apnews.com/ddfd774a23d39f77f5977b9c89c43dbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f561c698ce3a48e389d363c384ac7509/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Chaim Otmazgin had tended to dozens of shot, burned or mutilated bodies before he reached the home that would put him at the center of a global clash.Working in a kibbutz that was ravaged by Hamas’ Oct.",
      "publishedAt": "2024-05-22T04:02:32Z",
      "title": "How 2 debunked accounts of sexual violence on Oct. 7 fueled a global dispute over Israel-Hamas war",
      "url": "https://apnews.com/ca7905bf9520b1e646f86d72cdf03244",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/220ab346edef4b9686324ec0fa93fb6c/3000.jpeg"
    },
    {
      "author": "MARTHA MENDOZA and JULIET LINDERMAN",
      "description": "WASHINGTON (AP) — The direction of the Republican National Committee is clear from the last name of its new second-in-command: Trump.“My No. 1 goal is making sure that Donald Trump is the 47th president,” said RNC co-chair Lara Trump in an interview with The Associated Press.",
      "publishedAt": "2024-05-22T04:02:39Z",
      "title": "What's in a name? A Trump embraces ex-president's approach in helping lead Republican Party",
      "url": "https://apnews.com/a407d7edbfb37739abc590540b2f206d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/172cb927c61140ea8de02d6dda96bc19/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — The Senate on Wednesday confirmed the 200th federal judge of President Joe Biden's tenure, about a month earlier than when Donald Trump hit that mark in his term, though Trump still holds the edge when it comes to the most impactful confirmations — those to the Supreme Court and the country's 13 appellate courts.",
      "publishedAt": "2024-05-22T15:46:56Z",
      "title": "Senate confirms 200th federal judge under Biden as Democrats surpass Trump's pace",
      "url": "https://apnews.com/63b764d071d9c084b6669eabab527240",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6568d98a938d48f68f593d75f8a6a842/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "At 17, Israel McKenzie was so burdened by obesity that he stopped going to high school in person and was embarrassed to speak to people at his restaurant job.“I was in a really dark place,” says McKenzie, whose weight had climbed to 335 pounds on his 6-foot-1 frame, despite repeated efforts to diet and exercise.",
      "publishedAt": "2024-05-22T15:03:31Z",
      "title": "Use of Wegovy and other weight-loss drugs soars among kids and young adults",
      "url": "https://apnews.com/24047516e0c3b4f678c3e91f4ed6face",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6a0e1c987b049cc9b7ffc8ffafe3b12/1920.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and MARGERY A. BECK",
      "description": "GREENFIELD, Iowa (AP) — Authorities in Iowa continued search and rescue efforts Wednesday while surviving residents picked through debris that had been their homes a day after a deadly tornado devastated the town of Greenfield and killed an undisclosed number of people there.",
      "publishedAt": "2024-05-22T04:39:47Z",
      "title": "Authorities still conducting search, rescue after tornado slams Iowa; at least 1 dead",
      "url": "https://apnews.com/26c73e14ab481ef77a1b0606a2b10adc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9061ec9eec674c9da919da62aa44ff6e/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO and BILL BARROW",
      "description": "WASHINGTON (AP) — In his bid to become North Carolina’s first Black governor, Republican Mark Robinson assails government safety net spending as a “plantation of welfare and victimhood\" that has mired generations of Black people in “dependency” and poverty.",
      "publishedAt": "2024-05-22T11:03:27Z",
      "title": "GOP candidate for NC governor blasts public spending as his family nonprofit rakes in taxpayer funds",
      "url": "https://apnews.com/388251303ac98c6edbf52e5b3c43d554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f356b3b2e2349a5ac258267e1d029a0/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "Millions of people in the U.S. report using marijuana daily or nearly every day, according to an analysis of national survey data, and those people now outnumber those who say they are daily or nearly-daily drinkers of alcohol.",
      "publishedAt": "2024-05-22T13:00:28Z",
      "title": "Daily marijuana use outpaces daily drinking in the US, a new study says",
      "url": "https://apnews.com/b91c2c5957fdb2d48e6616c3baa14c13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e24788fba8c94b5d8ca9329e1bea29eb/3000.jpeg"
    },
    {
      "author": "MARK SCOLFORO",
      "description": "HARRISBURG, Pa. (AP) — Dozens of children who were sent to juvenile detention centers and similar facilities in Pennsylvania suffered physical and sexual abuse including violent rapes, according to four related lawsuits filed Wednesday.",
      "publishedAt": "2024-05-22T15:28:27Z",
      "title": "Lawsuits claim 66 people were abused as children in Pennsylvania's juvenile facilities",
      "url": "https://apnews.com/c3b71f64f522b94ff1b542686d2bdbd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/764da78b6d6049c8be0750dc3ce049e2/3000.jpeg"
    },
    {
      "author": "ADRIAN SAINZ",
      "description": "MEMPHIS, Tenn. (AP) — A judge on Wednesday said Elvis Presley's estate could be successful in arguing that a company's attempt to auction Graceland is fraudulent as he halted a foreclosure sale of the beloved Memphis tourist attraction.",
      "publishedAt": "2024-05-22T14:25:11Z",
      "title": "Graceland foreclosure sale halted as Presley estate's lawsuit moves forward",
      "url": "https://apnews.com/bd864f24ff76205ce23885c182a56a66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e4cd43d2aab41b39728a3660ca52a7d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}