{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Police arrested a “strong person of interest” Monday in the brazen Manhattan killing of UnitedHealthcare’s CEO after a quick-thinking McDonald’s employee in Pennsylvania alerted authorities to a customer who was found with a weapon and writings linking him to the ambush.",
      "publishedAt": "2024-12-09T17:19:08Z",
      "title": "The Latest: Police in Pennsylvania question a man over the killing of UnitedHealthcare's CEO",
      "url": "https://apnews.com/b746965dccab4b1a14de9b6fcb47b3cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba28f9a215704d54b74ffadc5da4f420/2516.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — Police arrested a suspect Monday in the brazen Manhattan killing of UnitedHealthcare's CEO after a quick-thinking McDonald’s employee in Pennsylvania alerted authorities to a customer who was found with a weapon, mask and writings linking him to the ambush.",
      "publishedAt": "2024-12-09T16:33:47Z",
      "title": "Man in custody had a gun, mask and writings tying him to killing of UnitedHealthcare CEO, police say",
      "url": "https://apnews.com/eaee0b7d31b319f42e0cf7f2f7badfb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17c8182cf0f64be3b0045871ca96e231/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB, BASSEM MROUE and TIA GOLDENBERG",
      "description": "DAMASCUS, Syria (AP) — Syria's prime minister said Monday that most cabinet ministers were back at work after rebels overthrew President Bashar Assad, but some state workers failed to return to their jobs, and a United Nations official said the country's public sector had come “to a complete and abrupt halt.\"",
      "publishedAt": "2024-12-09T08:06:03Z",
      "title": "Syrian government services come to a 'complete halt' as state workers stay home after rebel takeover",
      "url": "https://apnews.com/a8ecceee72a66f4d7e6168d6a21b8dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcd4c4e6c08041ba82be157bebb149cc/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — The dramatic downfall of Syrian President Bashar Assad presents possible danger, and an opening, for neighboring Israel.",
      "publishedAt": "2024-12-09T17:28:42Z",
      "title": "As Israel advances on a Syrian buffer zone, it sees peril and opportunity",
      "url": "https://apnews.com/6ee75aca7f5d820dd623b2aba4a62407",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a9db065698345f1ba92b706166ba1be/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — President-elect Donald Trump has promised to end birthright citizenship as soon as he gets into office to make good on campaign promises aiming to restrict immigration and redefining what it means to be American.",
      "publishedAt": "2024-12-09T22:08:52Z",
      "title": "Trump promises to end birthright citizenship: What is it and could he do it?",
      "url": "https://apnews.com/20919d26029cf0f98ecb0dc7f90a066b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6578cb85c5df4367b914629f66d81cd2/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A Marine veteran who used a chokehold on an agitated subway rider was acquitted on Monday in a death that became a prism for differing views about public safety, valor and vigilantism.",
      "publishedAt": "2024-12-09T05:02:32Z",
      "title": "Veteran Daniel Penny is acquitted in NYC subway chokehold case over Jordan Neely's death",
      "url": "https://apnews.com/305a4eb324f6466a67bdb6734a7b999a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6780f5f57484cdab7380b12ff322caf/1920.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said Monday that he's open to the potential deployment of Western troops in Ukraine to guarantee the country’s security as part of a broad effort to end the almost three-year war with Russia.",
      "publishedAt": "2024-12-09T13:47:09Z",
      "title": "Zelenskyy open to Western troops providing security for end to war in Ukraine",
      "url": "https://apnews.com/9bf883670879e2a398fe1a7ebfb71ddb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7466f0e5a7e340ffbb83e72d91fdab40/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Jay-Z says a rape allegation made against him is part of an extortion attempt.A woman who previously sued Sean “Diddy” Combs, alleging she was raped at an awards show after-party in 2000 when she was 13, amended the lawsuit Sunday to include a new allegation that Jay-Z was also at the party and participated in the sexual assault.",
      "publishedAt": "2024-12-09T16:44:04Z",
      "title": "Jay-Z says lawsuit accusing him of raping a child at awards after-party is part of an extortion ploy",
      "url": "https://apnews.com/b3d1f6c2e40e151870dc01221ea699a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/635cb39d3aca4b0fadb82374827be432/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu is set to take to the witness stand Tuesday for the first time in his trial on corruption allegations, a pivotal point in the drawn-out proceedings that comes as he wages war in Gaza and faces an international arrest warrant for war crimes charges.",
      "publishedAt": "2024-12-09T06:53:49Z",
      "title": "Netanyahu is set to take the witness stand for the first time in his corruption trial in Israel",
      "url": "https://apnews.com/a84a5a2743d111bb13982be3a4a1ea7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a99377852cf44f3ca90fa3e1b7ce5009/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "Jacques Audiard’s audacious musical “Emilia Pérez,” about a Mexican drug lord who undergoes gender affirming surgery, led nominations to the 82nd Golden Globes on Monday, scoring 10 nods to lead it over other contenders like the musical smash “Wicked,” the papal thriller “Conclave” and the postwar epic “The Brutalist.”",
      "publishedAt": "2024-12-09T05:07:42Z",
      "title": "'Emilia Pérez' leads Golden Globe nominations with 10, followed by 'The Brutalist' and 'Conclave'",
      "url": "https://apnews.com/84e022069bd2083252c08918242cf7f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27153dabec4549e3bb8b2340d1364380/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}