{
  "articles": [
    {
      "author": "COLLIN BINKLEY, BIANCA VÁZQUEZ TONESS",
      "description": "A federal research office that tracks the progress of America’s students is being hit with almost $900 million in cuts after Elon Musk’s Department of Government Efficiency found no need for much of its work. It’s unclear to what degree the Education Department’s Institute of Education Sciences will continue to exist after Musk’s team slashed scores of contracts. Industry groups said at least 169 contracts were suddenly terminated Monday, accounting for much of the institute’s work. The Education Department did not immediately share details on the cuts. Madison Biedermann, an agency spokesperson, said the action will not affect IES’ primary work.",
      "publishedAt": "2025-02-11T16:48:16Z",
      "title": "DOGE cuts $900 million from agency that tracks American academic progress",
      "url": "https://apnews.com/article/ies-musk-doge-education-cuts-4461d7bdbe9d55c5a411d8465999b011",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ccce45/2147483647/strip/true/crop/5652x3179+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F02%2F8e78a371c5bdb82422f03b33a2d2%2F1772269b012c4c23b964bbd2534b9eca"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "The White House blocked an Associated Press reporter from attending an event in the Oval Office after demanding the news agency alter its style on the Gulf of Mexico, which President Trump has ordered renamed to the Gulf of America. It was a highly unusual move that could have constitutional free-speech implications. AP executives said the reporter tried to enter the White House event as usual Tuesday afternoon and was turned away. Julie Pace, senior vice president and executive editor of The Associated Press, called the administration’s move troubling and unacceptable. The Trump administration made no immediate announcements about the move.",
      "publishedAt": "2025-02-11T22:17:16Z",
      "title": "White House bars AP reporter from Oval Office due to AP style policy",
      "url": "https://apnews.com/article/trump-ap-journalism-first-amendment-8a83d8b506053249598e807f8e91e1ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/45494bf/2147483647/strip/true/crop/3656x2057+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2Fd9%2F5c529aa84c08d6cafcb673fb9a91%2F9e68fffc7b08440499f2612fcecf8d39"
    },
    {
      "author": "HUIZHONG WU",
      "description": "President Donald Trump’s freeze on foreign assistance has dealt a blow organizations fighting human trafficking and forced labor in Cambodia, where tens of thousands of people are held captive and forced to work in call centers running telephone scams. A shelter for people who manage to leave these compounds run by the Catholic charity Caritas recently let some victims go and may stop accepting further victims due to the funding squeeze, two sources with direct knowledge of the situation said. The shelter is the only one not operated by the government which takes in victims of scam compounds. The sources declined to be named because they were concerned about retaliation from the Trump administration.",
      "publishedAt": "2025-02-12T03:12:30Z",
      "title": "US aid freeze sets back fight against human trafficking in Cambodia",
      "url": "https://apnews.com/article/cambodia-scam-compound-shelter-us-funding-freeze-6bc436aeffd46c47b049413e73987d14",
      "urlToImage": "https://dims.apnews.com/dims4/default/6966b78/2147483647/strip/true/crop/7829x4404+0+413/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2F61%2F3a6103d8e56a54531f03affbe964%2F56d3de387fae4bfc9807146d56cf9f0d"
    },
    {
      "author": "CHRIS MEGERIAN, MICHELLE L. PRICE",
      "description": "President Donald Trump’s most powerful adviser, Elon Musk, has made a rare public appearance at the White House to defend the swift and extensive cuts he’s pushing across the federal government while acknowledging there may be mistakes. He appeared in the Oval Office with Trump as the president praised Musk’s work slashing spending with his Department of Government Efficiency and signed an an executive order to continue downsizing the federal workforce. Musk, taking questions for the first time from reporters since he joined the Trump administration as a special government employee with sprawling influence over federal agencies, defended DOGE’s work as “common sense” and “not draconian or radical.”",
      "publishedAt": "2025-02-11T19:59:52Z",
      "title": "Musk appears at White House as Trump signs executive order to continue downsizing federal workforce",
      "url": "https://apnews.com/article/trump-downsizing-federal-workers-doge-00683abc4de44a151f26aaa6cb0d0f30",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc4c334/2147483647/strip/true/crop/5716x3215+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F7c%2Fc74b16d9797ab2de49c83372a787%2Fa4c8677ab9994303bd8b315883e0f752"
    },
    {
      "author": "ELSIE CHEN, ERIKA KINETZ, DAKE KANG",
      "description": "Tesla has sued its own customers and journalists in China for defamation – and won just about every time. Elon Musk’s company has pioneered an aggressive legal strategy in China and leveraged the patronage of political leaders to silence critics, reap financial rewards and limit its accountability. That’s led some car owners to take drastic action. As concerns mount about eroding checks and balances in the U.S., Tesla’s record in China shows how Musk has thrived in a system in which regulators, the media and the courts are by design intertwined.",
      "publishedAt": "2025-02-12T01:01:11Z",
      "title": "AP investigates Tesla's aggressive legal strategy in China",
      "url": "https://apnews.com/article/tesla-china-lawsuits-musk-investigation-58b10ccace488784fcc63646ab78b410",
      "urlToImage": "https://dims.apnews.com/dims4/default/1237303/2147483647/strip/true/crop/5702x3207+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F9d%2Fb59f94fc6e1c5d91aa79e6bdab9a%2Fe592207811a74e7b9c01f132703abd61"
    },
    {
      "author": "CHRIS MEGERIAN, ERIC TUCKER",
      "description": "Marc Fogel, an American teacher who was deemed wrongfully detained by Russia, has been released and returned to the U.S. in what the White House described as a diplomatic thaw that could advance negotiations to end the war in Ukraine. Steve Witkoff, a special envoy for President Donald Trump, left Russia with Fogel, a history teacher from Pennsylvania, and brought him to the White House, where Trump greeted him. Trump national security adviser Michael Waltz says the U.S. and Russia “negotiated an exchange” but did not say if the U.S. released anybody in return.",
      "publishedAt": "2025-02-11T18:33:17Z",
      "title": "Russia releases imprisoned American teacher Marc Fogel",
      "url": "https://apnews.com/article/donald-trump-vladimir-putin-20ab40d17f8a9b4abf9b3498da979859",
      "urlToImage": "https://dims.apnews.com/dims4/default/2918da7/2147483647/strip/true/crop/2873x1616+0+152/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2F81%2F239986e3908c890e3747519d7111%2F919e03344b2d4a42a74e50fca44441f5"
    },
    {
      "author": null,
      "description": "Apple has changed the name of the Gulf of Mexico to the Gulf of America on its maps after an order by President Donald Trump was made official by the U.S. Geographic Names Information System. Apple's move came Tuesday. Google announced last month that it would make the change once it was made official. After taking office, Trump ordered that the water bordered by the Southern United States, Mexico and Cuba be renamed. The U.S. Geographic Names Information System made the name official late Sunday. Microsoft has also made the name change on its Bing maps.",
      "publishedAt": "2025-02-12T01:52:11Z",
      "title": "Apple changes Gulf of Mexico to Gulf of America on maps",
      "url": "https://apnews.com/article/apple-maps-gulf-of-mexico-gulf-of-america-ea9f17241ad5c42880708f27ffe18baf",
      "urlToImage": "https://dims.apnews.com/dims4/default/07a5a31/2147483647/strip/true/crop/7515x4227+0+391/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F7b%2F65bcbe1cd1d3e125e7fed5aa9ec9%2F5c66d4df556a47bbbf03b7f53f361a94"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "A new lawsuit accuses the Trump administration of stiffing U.S. businesses of hundreds of millions of dollars in unpaid bills for work that has already been done amid its dismantling of the U.S. Agency for International Development. The lawsuit was filed Tuesday in federal court in D.C. on behalf of an organization representing 173 American small businesses, large U.S.-based suppliers, a Jewish group working for displaced people and others. It says President Donald Trump's foreign aid funding freeze has left hundreds of millions of dollars of owed bills unpaid and goods stuck in the supply chain. The USAID deputy administrator has defended the funding cutoff in an affidavit in another lawsuit.",
      "publishedAt": "2025-02-11T17:57:19Z",
      "title": "US government owes millions in unpaid bills amid USAID shutdown, suit says",
      "url": "https://apnews.com/article/usaid-american-companies-layoffs-lawsuit-8c116d877c179169fbce2d3348fcd997",
      "urlToImage": "https://dims.apnews.com/dims4/default/69c3297/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F47%2Fadf4bdb0392b40316130ee79a96f%2F1030eae021cf44c9b0bd1e8ce7dc7a9c"
    },
    {
      "author": "ZEKE MILLER, CHRIS MEGERIAN",
      "description": "President Donald Trump has hosted Jordan’s King Abdullah II at the White House and renewed his suggestions Gaza could be emptied of residents and redeveloped as a tourist area — a plan that could likely only work if the Arab nation agrees to accept more refugees. The pair met Tuesday in the Oval Office, where Trump suggested he wouldn’t withhold U.S. aid to Jordan or countries like Egypt if they don’t agree to dramatically increase the number of people from Gaza they take in. The Republican president says he doesn't “have to threaten that.” That contradicted Trump previously suggesting that holding back aid was a possibility.",
      "publishedAt": "2025-02-11T05:01:44Z",
      "title": "Trump, hosting Jordan's king, renews his insistence that the US can control and redevelop Gaza",
      "url": "https://apnews.com/article/trump-abdullah-jordan-gaza-hamas-israel-1f3ef249419ce61fc5c0f41412c24cb0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6fc7cd7/2147483647/strip/true/crop/4168x2345+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F34%2F28edd7f46d70de78d4d015583000%2Fe64194f7cee8449887a2d967f1363693"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "Israeli Prime Minister Benjamin Netanyahu has threatened to resume fighting in Gaza unless more hostages are released Saturday. An Israeli official said Tuesday that Netanyahu has ordered the army to add more troops in and around Gaza after Hamas threatened to call off the next scheduled release of hostages on Saturday. The official, who spoke on condition of anonymity to discuss a private meeting, says Netanyahu also ordered officials “to prepare for every scenario if Hamas doesn’t release our hostages this Saturday.” The official was not clear if Netanyahu’s order referred to the release of all remaining hostages in Gaza, or just the three scheduled for release on Saturday. Hamas says Israel has failed to meet the terms of the ceasefire by not allowing enough aid into Gaza.",
      "publishedAt": "2025-02-11T16:25:12Z",
      "title": "Netanyahu threatens to resume fighting in Gaza if hostages aren't released Saturday",
      "url": "https://apnews.com/article/israel-netanyahu-troops-beefed-up-ceasefire-39533292445c3fe25d0d2d460439305d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2cd93a6/2147483647/strip/true/crop/5043x2837+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2F71%2F9e51e44ac617993454b97fab9d89%2Ff85a1da422e0426286f5a0e3024b5a18"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}