{
  "articles": [
    {
      "author": "BASSEM MROUE and KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — The Lebanese civilians most devastated by the Israel- Hezbollah war are Shiite Muslims, and many of them believe they are being unfairly punished because they share a religious identity with Hezbollah militants and often live in the same areas.",
      "publishedAt": "2024-11-25T05:30:07Z",
      "title": "Lebanon's Shiite Muslims pay high price in war between Israel and Hezbollah",
      "url": "https://apnews.com/2d242ffd84ea48d373cf6ef94399fb5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3e897f250714f04989442c37bb7349f/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Diplomats and other officials say there have been several sticking points in ceasefire talks to end the war between Israel and the Lebanese militant group Hezbollah, even as conditions for an agreement appear to be ripe.",
      "publishedAt": "2024-11-25T10:55:15Z",
      "title": "Here’s where ceasefire talks in the war between Israel and Hezbollah have been stuck",
      "url": "https://apnews.com/ce56620463c579a33a4d8b03de035ae3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/332c69d36de84d5198510951cb541c36/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "WASHINGTON (AP) — Donald Trump’s personnel choices for his new Cabinet and White House reflect his signature positions on immigration and trade but also a range of viewpoints and backgrounds that raise questions about what ideological anchors might guide his Oval Office encore.",
      "publishedAt": "2024-11-25T05:05:56Z",
      "title": "Trump 2.0 has a Cabinet and executive branch of different ideas and eclectic personalities",
      "url": "https://apnews.com/986154f35c82452e0e2e642a3e1752a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7e2b0156e9c44ca9dbce3b4acd322a4/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — It's a short phrase in the Constitution, mentioned in passing. But it's already taking on an outsize significance as President-elect Donald Trump charts his return to office.",
      "publishedAt": "2024-11-25T05:07:26Z",
      "title": "Senators took down one Trump Cabinet pick. But the fight over their authority is just beginning",
      "url": "https://apnews.com/cee5cddaa714b8874db05356c6af2a04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27aee690c1584bec846aaf48a9500314/2593.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "DALLAS (AP) — Just as there are good odds the turkey will taste dry, airports and highways are expected to be jam-packed during Thanksgiving week, a holiday period likely to end in another record day for air travel in the United States.",
      "publishedAt": "2024-11-25T05:03:32Z",
      "title": "‘Busiest Thanksgiving ever’: How the TSA plans to handle record air travel",
      "url": "https://apnews.com/38cfcfe5f9d7b19fdc9d843827ed21f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0cb4c706181470793e0f29dcc0749d8/3000.jpeg"
    },
    {
      "author": "SIARHEI SATSIUK, VANESSA GERA and JON GAMBRELL",
      "description": "VILNIUS, Lithuania (AP) — A DHL cargo plane crashed on approach to an airport in Lithuania's capital and skidded into a house Monday morning, killing a Spanish crew member but not harming anyone on the ground.",
      "publishedAt": "2024-11-25T06:12:56Z",
      "title": "DHL cargo plane crashes and skids into a house in Lithuania, killing a Spanish crew member",
      "url": "https://apnews.com/ff6382bb359c64ca2a345d50e523c396",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c155673fd0984a23aaaeca3bbf224561/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russia's military captured a British national fighting with Ukrainian troops who have occupied part of Russia's Kursk region, according to reports Monday, as Moscow began daylight drone attacks on civilian areas of Ukraine and its ground forces accelerated gains along parts of the front line.",
      "publishedAt": "2024-11-25T07:55:23Z",
      "title": "Russia reportedly captures a Briton fighting for Ukraine as Russian troops advance",
      "url": "https://apnews.com/e7fd8790cd151ff3b73a5edcc5e00bf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3808dfe620814457bc9723bc7435cd9f/2532.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — When Donald Trump, House Speaker Mike Johnson, Elon Musk and Robert F. Kennedy Jr. circled up aboard the president-elect’s plane over some McDonalds burgers and fries recently, Donald Trump Jr.",
      "publishedAt": "2024-11-25T16:44:49Z",
      "title": "Donald Trump Jr. emerges as a political force of his own as he helps his father launch a second term",
      "url": "https://apnews.com/e5e7ec407c354964b667c035c890dc0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec8af06516134a5085d81fc8dbb06dea/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Ready or not, the holidays are here. It's a time when many Americans accustomed to preparing simple meals find themselves responsible for safely serving multi-dish feasts.",
      "publishedAt": "2024-11-25T14:19:50Z",
      "title": "Are you in charge of a holiday feast? Follow these tips for food safety",
      "url": "https://apnews.com/3584c4cf4d6a7c8bf9d5d6b55e3af66b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34dc0a3b80c048d4882a6f3f5cc46819/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "One of the striking things about how furiously many people reacted to the news last week that MSNBC “Morning Joe” hosts Joe Scarborough and Mika Brzezinski met with President-Elect Donald Trump was how quaint their defenders sounded.",
      "publishedAt": "2024-11-25T16:33:45Z",
      "title": "At the crossroads of news and opinion, 'Morning Joe' hosts grapple with aftermath of Trump meeting",
      "url": "https://apnews.com/2c6f4bd59af5698bff44e05ab94b7bf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5845ac4fe25949bf9441a8e1835d2caa/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}