{
  "articles": [
    {
      "author": null,
      "description": "LOS ANGELES (AP) — A hospital cardiologist says Bronny James has been discharged from Cedars-Sinai Medical Center and is resting at home.",
      "publishedAt": "2023-07-27T20:24:25Z",
      "title": "A hospital cardiologist says Bronny James has been discharged from Cedars-Sinai Medical Center and is resting at home",
      "url": "https://apnews.com/e5ad0bc1833a29e8d22edaa7c52994f9",
      "urlToImage": ""
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Lawyers for Donald Trump met Thursday with members of special counsel Jack Smith's team ahead of a potential indictment over the former president's efforts to overturn the results of the 2020 election, according to a person familiar with the matter.",
      "publishedAt": "2023-07-27T15:44:01Z",
      "title": "Trump says his lawyers have met with prosecutors ahead of possible 2020 election indictment",
      "url": "https://apnews.com/730455c2b7a684593e41362e4b661cb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8334400f86924d23b6c8a1a330a9521c/2811.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and DASHA LITVINOVA",
      "description": "KYIV, Ukraine (AP) — Fierce fighting raged Thursday in southeastern Ukraine, where a Western official said Kyiv has launched a major push and Russian President Vladimir Putin said “hostilities have intensified significantly.”",
      "publishedAt": "2023-07-27T08:50:54Z",
      "title": "Putin claims fighting intensifies in southeastern Ukraine, with Russia inflicting heavy losses",
      "url": "https://apnews.com/12334bbee83b608221dafced4727369e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31c32b6e65f349ae948234990b191eb2/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The unraveling of Hunter Biden's plea agreement has thrust his criminal case into uncertain waters and given new fodder to Republican critics in Congress as they push ahead with investigations into the president's youngest son.",
      "publishedAt": "2023-07-27T17:58:31Z",
      "title": "What's next for Hunter Biden in court and Congress after his plea deal derails",
      "url": "https://apnews.com/ad80b195c8c0f48241740881cf9b9bce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/191e9d5e1e7c4d33b673520a30b1f28d/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "WASHINGTON (AP) — July has been so hot thus far that scientists calculate that this month will be the hottest globally on record and likely the warmest human civilization has seen, even though there are several days left to sweat through.",
      "publishedAt": "2023-07-27T13:38:57Z",
      "title": "July has been so blistering hot, scientists already calculate that it's the warmest month on record",
      "url": "https://apnews.com/65e13c9c3d88932b50de935c7977ee70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/180309f5954d4218a7416988f0d40355/1920.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — A former Republican candidate for Michigan governor pleaded guilty on Thursday to a misdemeanor charge for his participation in the U.S. Capitol riot on Jan. 6, 2021. Ryan Kelley pleaded guilty more than a year after the ardent supporter of former President Donald Trump was arrested in the case, roiling the already messy gubernatorial Republican primary.",
      "publishedAt": "2023-07-27T19:37:38Z",
      "title": "Ryan Kelley, ex-candidate for Michigan governor, pleads guilty to misdemeanor in Capitol riot case",
      "url": "https://apnews.com/67345188ed9f777c4337b607f444c617",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5f1e058bed143ed8e3b0ae41f2feaac/2758.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "DENVER (AP) — The case involves almost everything a victim of sexual harassment would be desperate to avoid. Dozens of emails and multiple requests for follow-up interviews about a traumatizing episode.",
      "publishedAt": "2023-07-27T14:35:06Z",
      "title": "Formed to combat Olympic sex abuse, SafeSport center is struggling 6 years after opening",
      "url": "https://apnews.com/dff194c817ea985fe7f94055edbeb0b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f72c361c004640c7ac9255f87e844855/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — The U.S. economy surprisingly accelerated to a 2.4% annual growth rate from April through June, showing continued resilience in the face of steadily higher interest rates resulting from the Federal Reserve’s 16-month-long fight to bring down inflation.",
      "publishedAt": "2023-07-27T04:01:24Z",
      "title": "US economy unexpectedly accelerated to a 2.4% growth rate in April-June quarter despite Fed hikes",
      "url": "https://apnews.com/ce011c5f4330bc29d37939730039d1bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ece6b68452b8499198aea408a358d55a/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, BRENDAN FARRINGTON and KAT STAFFORD",
      "description": "TALLAHASSEE, Fla. (AP) — Civil rights activists cheered when Ron DeSantis pardoned four Black men wrongfully convicted of rape as one of his first actions as Florida's governor.",
      "publishedAt": "2023-07-27T14:14:41Z",
      "title": "DeSantis is defending new slavery teachings. Civil rights leaders see a pattern of 'policy violence'",
      "url": "https://apnews.com/1fb51d663e6051051aa23b71421b9479",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd789fb720064504ba21d2aa2fda9c01/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Niger's president defiantly declared Thursday that democracy would prevail, a day after mutinous soldiers detained him and announced they had seized power in a coup because of the West African country’s deteriorating security situation.",
      "publishedAt": "2023-07-27T09:11:05Z",
      "title": "Niger's president vows democracy will prevail after mutinous soldiers detain him and declare a coup",
      "url": "https://apnews.com/2efab1649bea7d89b14dbc9432f5f819",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fdbdf9ea65747009a74466e4de81b09/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}