{
  "articles": [
    {
      "author": "Melanie Lidman",
      "description": "An Israeli probe into the killings of 15 Palestinian medics last month in Gaza by Israeli forces says it has found “professional failures” and a deputy commander will be fired. Israel at first claimed that the medics’ vehicles did not have emergency signals on when troops opened fire but later backtracked. Cellphone video recovered from one of the medics contradicted Israel’s initial account. The military investigation said Sunday that the deputy battalion commander, “due to poor night visibility,” assessed that the ambulances belonged to Hamas militants.",
      "publishedAt": "2025-04-20T13:23:29Z",
      "title": "Israeli probe into killings of Palestinian medics finds 'failures'",
      "url": "https://apnews.com/article/gaza-palestinians-israel-hamas-war-medics-killed-437b6ae1e9cf45b3099134524380f004",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f94562/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2Fea%2F1577b442e4cdc9a5410360d3064a%2F918c3792b58944c28d3b79ef76f98fac"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Vatican is celebrating Easter without Pope Francis presiding. The 88-year-old pontiff continues his recovery from a near-fatal bout of double pneumonia. In his place, Cardinal Angelo Comastri, the retired archpriest of St. Peter’s Basilica, celebrated the open-air Mass before thousands of people in St. Peter’s Square. Francis has only appeared in public a handful of times since returning to the Vatican on March 23 after a 38-day hospital stay. He skipped the solemn services of Good Friday and Holy Saturday leading up to Easter. But he was expected to make an appearance on Sunday, according to the Mass booklet and liturgical plans released by the Vatican.",
      "publishedAt": "2025-04-20T09:03:38Z",
      "title": "Vatican's Easter Mass opens without Pope Francis",
      "url": "https://apnews.com/article/pope-vatican-easter-pneumonia-4b1182146a692479562b635a9723de2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c3bdcd/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F9e%2F4f0916a256f88f2c24dcc3b3dd89%2F5d91b226b67a42ad8249db8fb6cc5aa3"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy accused Russia of trying to create ‘impression of a ceasefire’, saying Russian forces continued attacks despite President Vladimir Putin’s unilateral declaration of an Easter ceasefire. Zelenskyy reported on Sunday 59 shelling incidents, five assaults, and multiple drone strikes. He reiterated Ukraine’s offer to extend the truce for 30 days but stressed his country would respond based on real battlefield conditions. Meanwhile, Russian-installed officials in occupied Kherson say Ukraine has also violated the truce. Putin offered no details on how the ceasefire would be monitored.",
      "publishedAt": "2025-04-20T06:56:19Z",
      "title": "Russia is trying to create 'impression of a ceasefire,' Zelenskyy says",
      "url": "https://apnews.com/article/russia-ukraine-easter-ceasefire-zelenskyy-putin-attacks-934e5c2a493be32b605ddb84d955b34b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4eeb672/2147483647/strip/true/crop/11648x6552+0+1092/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fde%2F02c30476064785dd766f7bae63c7%2F6fe4ea41dbac4216b9bcc8b9744fd905"
    },
    {
      "author": null,
      "description": "Police say a woman and a child in Oklahoma flooding as as parts of the region have been hit by severe storms. Police in Moore say two cars were stranded in flood waters Saturday evening and one was swept away under a bridge. Police say they were able to rescue others but two people were found dead, including a 12-year-old boy. Large swaths of Oklahoma remain under a National Weather Service flood watch through Sunday, along with parts of Texas, Missouri, Arkansas and southern Illinois.",
      "publishedAt": "2025-04-20T12:22:32Z",
      "title": "Police: 2 dead in Oklahoma flooding as region remains under severe weather watch",
      "url": "https://apnews.com/article/oklahoma-flooding-deaths-weather-40b64f26f878c37fb5eccb9ff118c35f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Marcos Aleman, Megan Janetsky",
      "description": "El Salvador President Nayib Bukele proposed carrying out a prisoner swap with Venezuela on Sunday, suggesting he would exchange Venezuelan deportees from the United States his government has kept imprisoned for who he called “political prisoners” in Venezuela. In a post on the social media platform X, Bukele listed off a number of family members of high-level opposition figures in Venezuela, journalists and activists detained during the government’s electoral crackdown last year.",
      "publishedAt": "2025-04-20T22:08:14Z",
      "title": "El Salvador president proposes prisoner swap with Maduro for Venezuelan deportees",
      "url": "https://apnews.com/article/el-salvador-bukele-maduro-venezuela-prisoners-6728d1df2445d85bd16c6ab8a85056a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/9873d5b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F31%2F88861a09ae0c62b77bf74643a109%2Fc5ff3e97bfbc4c86bca73ae00fd948f3"
    },
    {
      "author": "Steve Peoples",
      "description": "Chris Van Hollen has emerged, for now, as a leading figure in the resistance to President Donald Trump. The Democratic senator from Maryland is the latest in a small but growing collection of officials who are testing the strength of their political power in a weakened party with no clear leader. Van Hollen’s rise follows his decision to travel to El Salvador last week to meet with Kilmar Abrego Garcia, who was wrongly deported. Van Hollen's trip has created a new sense of momentum for the anti-Trump resistance as the Democratic Party struggles to find its footing in the early days of Trump’s presidency.",
      "publishedAt": "2025-04-20T18:13:50Z",
      "title": "After Abrego Garcia trip, anti-Trump resistance finds a leader in Van Hollen",
      "url": "https://apnews.com/article/van-hollen-democrats-trump-resistance-abrego-garcia-084ab2c9691accd1e79b3c956f68d058",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed2c288/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2F1f%2F06ffdd646018482d903a3d68e076%2Fe1eec58d0b224d30a0f57834004d2148"
    },
    {
      "author": "Jamie Stengle",
      "description": "Nearly six years after a man fatally shot 23 people in a racist attack targeting Hispanic shoppers at a Walmart in Texas near the U.S.-Mexico border, the gunman's criminal case is set to come to a close. Patrick Crusius is expected to enter a guilty plea Monday in state district court to capital murder in the El Paso massacre, which is one of the deadliest mass shootings in U.S. history. Crusius is now 26 and is expected to receive a life sentence with no possibility of parole. He has already been sentenced to 90 consecutive life sentences by a federal judge.",
      "publishedAt": "2025-04-20T04:03:39Z",
      "title": "Man who fatally shot 23 at El Paso Walmart set to plead guilty to murder nearly 6 years on",
      "url": "https://apnews.com/article/el-paso-texas-walmart-shooting-plea-hearing-479ddea85462483cd23b6217925b11f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/6f096a9/2147483647/strip/true/crop/5198x2924+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2F9f%2F649b9f7aa4169a890a23f6049585%2Fff413e1292314c20837f99c6987ee423"
    },
    {
      "author": "Ryan J. Foley",
      "description": "The Kansas City, Missouri, metropolitan area has long been a regional hub for the federal government, and the pain from the Trump administration's cuts can be seen everywhere. Thousands of federal workers fear they'll lose their jobs. Some have been let go. Many are considering early retirement or buyouts. One researcher expects the region could lose as many as 6,000 good-paying federal jobs, which in turn would eliminate thousands more in other industries. Cuts to food aid programs have affected a farmers market and food pantry in a low-income neighborhood. And the city has paused plan to upgrade its public health laboratory after federal grants were abruptly canceled.",
      "publishedAt": "2025-04-20T12:31:10Z",
      "title": "DOGE's cuts tear through Kansas City, Missouri, a federal worker hub",
      "url": "https://apnews.com/article/doge-federal-cuts-job-musk-trump-kansas-city-06023cbc68c82fdaa021ced1069fd81c",
      "urlToImage": "https://dims.apnews.com/dims4/default/8990602/2147483647/strip/true/crop/5165x2905+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F14%2F410b026a074825b7181e5ec9d2c8%2F22c0fdbf92dc45ecb0cffc25c43a8be9"
    },
    {
      "author": null,
      "description": "Jay Sigel, who was widely viewed as America's best amateur golfer since Bobby Jones, has died of pancreatic cancer. The U.S. Golf Association said Sigel died Saturday at 81 years old. Along with his two U.S. Amateur titles and three U.S. Mid-Amateur victories, Sigel played in nine Walker Cup matches, twice as a playing captain. Sigel was low amateur in the Masters three times, and once each at the U.S. Open and British Open during his sterling career. Sigel joined the PGA Tour Champions when he turned 50 and won eight times.",
      "publishedAt": "2025-04-20T20:51:32Z",
      "title": "Jay Sigel, considered America's best amateur since Bobby Jones, dies of cancer at 81",
      "url": "https://apnews.com/article/jay-sigel-us-amateur-walker-cup-ce7171cc367d8cd23a2926a6babdaca2",
      "urlToImage": "https://dims.apnews.com/dims4/default/eef3c68/2147483647/strip/true/crop/1992x1121+0+96/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2Fe7%2F647a2c14443d2a5501031e5fdd1f%2F75ca28756c8a4be6a3b3342d9452ecf9"
    },
    {
      "author": "Pelumi Salako",
      "description": "Several canoes paddle toward Makoko, a vast floating slum built on stilts in the lagoon at one end of Nigeria’s economic hub of Lagos. Riding on the canoes are giant cardboard puppet animals along with their puppeteers dressed in black. “The Herds” theatrical tour is journeying 20,000 kilometers (12,427 miles) from Africa’s Congo Basin to the Arctic Circle with puppet animals. It’s a journey organizers say is meant to bring attention to the climate crisis and “renew our bond with the natural world.” The tour started last week in Kinshasa, the capital of Congo, and will continue across the world with Dakar, the Senegalese capital, as the next stop.",
      "publishedAt": "2025-04-20T20:29:09Z",
      "title": "In Nigeria’s floating slum, ‘The Herds’ tour spotlights climate change where it's felt the most",
      "url": "https://apnews.com/article/herds-nigeria-lagos-climate-change-animals-19a8ed11f5c805fceadbc60c584423fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/75c5ef4/2147483647/strip/true/crop/8258x4645+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2Fd5%2F04799e1c4e17d6a2cbf585523d74%2F4cee6189e22644068526e34a0c6a283f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}