{
  "articles": [
    {
      "author": "BASSEM MROUE and MELANIE LIDMAN",
      "description": "BEIRUT (AP) — Lebanon’s Hezbollah group confirmed on Saturday that its leader and one of its founding members, Hassan Nasrallah, was killed in an Israeli airstrike in a southern suburb of Beirut.",
      "publishedAt": "2024-09-28T07:17:19Z",
      "title": "Hezbollah confirms its leader Hassan Nasrallah was killed in an Israeli airstrike",
      "url": "https://apnews.com/c4751957433ff944c4eb06027885a973",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37902b96de96444bad8e69037b3ea351/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and MATTHEW LEE",
      "description": "REHOBOTH BEACH, Del. (AP) — The Israeli strike that killed Hezbollah’s Hassan Nasrallah was a “measure of justice\" for victims of a four-decade “reign of terror,” President Joe Biden said Saturday.",
      "publishedAt": "2024-09-28T16:45:48Z",
      "title": "Biden and Harris call the Israeli strike killing Hezbollah’s Nasrallah a 'measure of justice'",
      "url": "https://apnews.com/024756fb7c2b7bdda93454db97659a19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d7e42177e1448cb96fb1dd9f150a704/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Smoke was still rising from Beirut’s southern suburbs Saturday morning, visible to many of the families who had fled their homes there the night before to escape Israel’s massive bombardment.",
      "publishedAt": "2024-09-28T16:07:54Z",
      "title": "Hundreds of fleeing families sleep on beaches and streets after Israel's strikes shake Beirut",
      "url": "https://apnews.com/583bbed45402d6802fa3643247924599",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1a169b9efda4faf8477562e0287ffa3/3000.jpeg"
    },
    {
      "author": "STEPHEN SMITH, KATE PAYNE and HEATHER HOLLINGSWORTH",
      "description": "PERRY, Fla. (AP) — For movement in the new cycleMassive rains from powerful Hurricane Helene left people stranded, without shelter and awaiting rescue, as the cleanup began from a tempest that killed at least 64 people, caused widespread destruction across the U.S.",
      "publishedAt": "2024-09-29T04:04:53Z",
      "title": "At least 64 dead after Helene's deadly march across the Southeast",
      "url": "https://apnews.com/16b41006d3cb6fedad78d19ca3f389a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/361dc18f3549463a95a0c413c96257d9/3000.jpeg"
    },
    {
      "author": "ERIK VERDUZCO, TRAVIS LOLLER and GEORGE WALKER IV",
      "description": "ASHEVILLE, N.C. (AP) — Floodwaters pushed by the remnants of Hurricane Helene left North Carolina’s largest mountain city isolated Saturday by damaged roads and a lack of power and cellphone service, part of a swath of destruction across southern Appalachia that left an unknown number dead and countless worried relatives unable to reach loved ones.",
      "publishedAt": "2024-09-28T18:33:28Z",
      "title": "Asheville has been isolated after Helene wrecked roads and knocked out power and cell service",
      "url": "https://apnews.com/078a298cdcaaf46749f3f6683a4e1057",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbf89ca6b15f408cac017be500410ff6/2048.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "TUSCALOOSA, Ala. (AP) — As Donald Trump railed against immigrants Saturday afternoon in the Rust Belt, his supporters in the Deep South had turned his earlier broadsides into a rallying cry over a college football game as they prepared for the former president’s visit later in the evening.",
      "publishedAt": "2024-09-29T03:02:30Z",
      "title": "In Alabama, Trump goes from the dark rhetoric of his campaign to adulation of college football fans",
      "url": "https://apnews.com/44ae6ebd8a563a1ce1e0732a0a3a73f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7742fccab624c54836a5fa15db5446b/3000.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — Austria’s far-right Freedom Party could win a national election for the first time on Sunday, tapping into voters’ anxieties about immigration, inflation, Ukraine and other concerns following recent gains for the hard right elsewhere in Europe.",
      "publishedAt": "2024-09-29T04:05:58Z",
      "title": "Austrian far-right party hopes for its first national election win in a close race",
      "url": "https://apnews.com/1a22057b230a2576e0ca0ee69607cf6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ec867db95bd45d5a8db56b3ad5775c4/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL WEISSENSTEIN",
      "description": "UNITED NATIONS (AP) — China and Russia got their turns at the U.N. General Assembly podium on Saturday, but — per usual — their top leaders didn't speak. Instead, they turned to their foreign ministers, WANG YI and SERGEY LAVROV.",
      "publishedAt": "2024-09-29T02:39:01Z",
      "title": "What to know from the UN: China, Russia have their say, and a frog metaphor makes a cameo",
      "url": "https://apnews.com/d7c5688de44e59be538dff0b74858644",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be291f0b01134a62876349bd6c6250d3/2216.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and ANTON SHTUKA",
      "description": "KYIV, Ukraine (AP) — Their costumes are put on with surgical precision: Floppy hats, foam noses, bright clothes, and a ukulele with multicolored nylon strings. Moments later, in a beige hospital ward normally filled with the beeping sounds of medical machinery, there are bursts of giggles and silly singing.",
      "publishedAt": "2024-09-29T04:08:48Z",
      "title": "Hospital clowns bring joy to young Ukrainian cancer patients who survived Russian missile attack",
      "url": "https://apnews.com/7a5e88712053f7bb33e0983a7ecc21ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5052d9553d14698bc905c8d35c4d0d4/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — “Saturday Night Live” began its 50th season with a parade of former co-stars, including Maya Rudolph as Vice President Kamala Harris, Andy Samberg as her husband Doug Emhoff and Dana Carvey as President Joe Biden.",
      "publishedAt": "2024-09-28T04:00:32Z",
      "title": "Maya Rudolph as Harris and Dana Carvey as Biden open the 50th season of 'Saturday Night Live'",
      "url": "https://apnews.com/9205f31f0eab80700604f39581b84cf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e88446413984ff5a5bf7d78775fa9d5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}