{
  "articles": [
    {
      "author": "MAKIYA SEMINERA, JOHN MINCHILLO and ALLEN G. BREED",
      "description": "LUCAMA, N.C. (AP) — The remnants of Debby picked up the pace Friday, moving north and northeast from the Carolinas and still packing a punch with heavy rains, flash flooding and the threat of tornadoes.",
      "publishedAt": "2024-08-09T05:04:14Z",
      "title": "Debby bringing heavy rain, flooding and possible tornadoes northeast into the weekend",
      "url": "https://apnews.com/30ce7215d31b651f4fb575e9dde5d63e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f4ae0164c6f423fa0530a517b8f2a73/1920.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "FERGUSON, Mo. (AP) — Michael Brown once told his father the “world is going to know my name,” words Michael Brown Sr. still takes to heart.Friday marks 10 years since the 18-year-old was killed by a police officer in Ferguson, Missouri, turning the St.",
      "publishedAt": "2024-08-09T04:07:56Z",
      "title": "Ferguson marks 10 years since Michael Brown's death. While there's some progress, challenges persist",
      "url": "https://apnews.com/88a3dd50044c89800f5bd0e300c27351",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8d416fe9bff4bf1a458f5100235eccc/3000.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "FERGUSON, Mo. (AP) — On Aug. 9, 2014, Michael Brown and a friend were walking in the middle of Canfield Drive, a two-lane street in the St. Louis suburb of Ferguson, Missouri, when a police officer drove by and told them to use the sidewalk.",
      "publishedAt": "2024-08-09T04:14:06Z",
      "title": "Timeline of events in Ferguson, Missouri, after a police officer fatally shot Michael Brown",
      "url": "https://apnews.com/410824a723f91caeddce01e13860ce30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbcb43871302455dacb1dae389c915a3/3000.jpeg"
    },
    {
      "author": "GABRIEL SANDOVAL and NICHOLAS RICCARDI",
      "description": "PHOENIX (AP) — Vice President Kamala Harris and her new running mate will hold a rally in Arizona on Friday as part of their tour of electoral battlegrounds, visiting a state where Harris passed over a prominent Democrat in favor of Minnesota Gov.",
      "publishedAt": "2024-08-09T04:06:04Z",
      "title": "Harris and Walz head to Arizona, where a VP runner-up could still make a difference",
      "url": "https://apnews.com/44001d0be6b5d4ecc911ad06684421c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43726285bf8540eaa43f9635cf3c8e45/3000.jpeg"
    },
    {
      "author": "GRAHAM LEE BREWER",
      "description": "If Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz, are elected this fall, not only would a woman of color lead the country for the first time, but a Native woman also would govern a state for the first time in U.S.",
      "publishedAt": "2024-08-09T04:09:39Z",
      "title": "A win for the Harris-Walz ticket would also mean the country's first Native American female governor",
      "url": "https://apnews.com/e7cc4d86845e827b6c5c64604b0f319c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be920649d1d441309b3d047ba978892b/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, MICHELLE L. PRICE and ADRIANA GOMEZ LICON",
      "description": "PALM BEACH, Fla. (AP) — Donald Trump recommitted to debating Vice President Kamala Harris after recently backing out, holding a lengthy news conference Thursday in which he taunted his new rival, boasted of his crowd on Jan.",
      "publishedAt": "2024-08-08T12:16:18Z",
      "title": "Trump recommits to a Sept. 10 debate and lashes out at Harris at news conference",
      "url": "https://apnews.com/94b590ddf0434d9ea7b1241396dbbcc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c12dd025cf447d79a978412c3828dc3/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "In his first news conference since Vice President Kamala Harris became the Democratic nominee for president, former President Donald Trump said he would debate her on Sept.",
      "publishedAt": "2024-08-08T23:28:02Z",
      "title": "FACT FOCUS: A look at claims made by Trump at news conference",
      "url": "https://apnews.com/eb899c1fc734f5ecb42b8d0902e5c004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c12dd025cf447d79a978412c3828dc3/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "BERLIN (AP) — A human rights activist since the 1980s, Oleg Orlov thought Russia had turned a corner when the Soviet Union collapsed and a democratically elected president became leader.",
      "publishedAt": "2024-08-09T04:09:17Z",
      "title": "Veteran human rights advocate freed in swap says Russia is sliding back toward Stalinist times",
      "url": "https://apnews.com/d6cb58cb5f29f6a4b3dd77f64b1bb2df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/026d23756662496b9ae34d559ffe73f5/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Leaders of the United States, Egypt and Qatar jointly demanded Israel and Hamas return to stalled talks on the war in Gaza next week, saying Thursday that “only the details” of carrying out a cease-fire and hostage release remain to be negotiated.",
      "publishedAt": "2024-08-09T00:06:40Z",
      "title": "US and other frustrated mediators call on Israel, Hamas to resume Gaza talks, saying, 'no excuses'",
      "url": "https://apnews.com/04f23ac3cc99a8981c42ba31cfd3703e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e5d26613bdc4a40b70d14c9be6d8f5a/3000.jpeg"
    },
    {
      "author": "AUDREY MCAVOY and MENGSHIN LIN",
      "description": "LAHAINA, Hawaii (AP) — Dozens of Maui surfers, canoe paddlers and boat riders made their way into the ocean off Lahaina on Thursday to remember the 102 people killed when the nation’s deadliest wildfire in more than a century destroyed the historic town one year ago.",
      "publishedAt": "2024-08-09T01:29:15Z",
      "title": "Maui remembers the 102 lost in the Lahaina wildfire with a paddle out 1 year after devastating blaze",
      "url": "https://apnews.com/da5862aceca17fc2ca6f63ad26dddc05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e250578a815f46acaddc3a99d84bf1cf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}