{
  "articles": [
    {
      "author": "BASSEM MROUE and ZEINA KARAM",
      "description": "BEIRUT (AP) — Insurgents' stunning march across Syria accelerated Saturday with news that they had reached the gates of the capital and that government forces had abandoned the central city of Homs.",
      "publishedAt": "2024-12-07T11:08:16Z",
      "title": "Insurgents reach gates of Syria’s capital, threatening to upend decades of Assad rule",
      "url": "https://apnews.com/7f65823bbf0a7bd331109e8dff419430",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a24f9f4ef9c497793d0cfd1328b5fd5/3000.jpeg"
    },
    {
      "author": "THOMAS ADAMSON and JOHN LEICESTER",
      "description": "PARIS (AP) — Howling winds couldn’t stop Notre Dame Cathedral ’s heart from beating again.With three resounding knocks on its doors by Paris Archbishop Laurent Ulrich, wielding a specially designed crosier carved from fire-scorched beams, the monument roared back to life Saturday evening.",
      "publishedAt": "2024-12-07T07:02:04Z",
      "title": "An archbishop's knock formally restores Notre Dame to life as winds howl and heads of state look on",
      "url": "https://apnews.com/f2543dc70b4d89b256cde9aa53bbbd44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b6c51e2b12e40d390f038c38d63904c/1920.jpeg"
    },
    {
      "author": "SYLVIE CORBET, ADRIANA GOMEZ LICON and JILL COLVIN",
      "description": "PARIS (AP) — French President Emmanuel Macron welcomed Donald Trump to Paris on Saturday with a full dose of presidential pomp as the two held a hastily arranged meeting with Ukraine’s Volodymyr Zelenskyy before celebrating the grand reopening of the Notre Dame Cathedral.",
      "publishedAt": "2024-12-07T05:04:33Z",
      "title": "Trump is welcomed by Macron to Paris with presidential pomp and joined by Zelenskyy for their talks",
      "url": "https://apnews.com/f97fde62ca2ce68c3874c395b305e26b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ef50bc689ed4563bdec6d152f57a6fc/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — He's making threats, traveling abroad and negotiating with world leaders.Donald Trump has more than a month and a half to go before he's sworn in for a second term.",
      "publishedAt": "2024-12-07T17:12:39Z",
      "title": "Trump isn't back in office but he's already pushing his agenda and negotiating with world leaders",
      "url": "https://apnews.com/c795cbb38b6b943c19a70fe046cad7d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f6908b1517d4a89894cd061f747aa26/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea's embattled President Yoon Suk Yeol avoided an opposition-led attempt to impeach him over his short-lived imposition of martial law, as most ruling party lawmakers boycotted a parliamentary vote Saturday to deny a two-thirds majority needed to suspend his presidential powers.",
      "publishedAt": "2024-12-07T00:39:47Z",
      "title": "South Korea's president avoids an impeachment attempt over short-lived martial law",
      "url": "https://apnews.com/3f2a9190bf5cec83b49e2c6ad5cf5379",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b7d818d97bf46c1b43f6bbf8c8a2b2b/1920.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — The gunman who killed the CEO of the largest U.S. health insurer likely left New York City on a bus soon after the brazen ambush that has shaken corporate America, police officials said.",
      "publishedAt": "2024-12-07T05:29:46Z",
      "title": "Days after gunman killed UnitedHealthcare's CEO, police push to ID him and FBI offers reward",
      "url": "https://apnews.com/dee5ad726a345a8209ecc0df7e44756e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e60efc9a7fce40a9bbd7b7e99a152487/1920.jpeg"
    },
    {
      "author": "TOM MURPHY and DEVI SHASTRI",
      "description": "For years, patients in the U.S. health care system have grown frustrated with a bureaucracy they don’t understand.",
      "publishedAt": "2024-12-07T05:10:36Z",
      "title": "UnitedHealthcare CEO's shooting opens a door for many to vent frustrations over insurance",
      "url": "https://apnews.com/2d9c9a1a2a551876e72a11a93fc7624c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8093521fcf65465c82f2e32294b97300/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "PEARL HARBOR, Hawaii (AP) — Ira “Ike” Schab, a 104-year-old Pearl Harbor attack survivor, spent six weeks in physical therapy to build the strength to stand and salute during a remembrance ceremony honoring those killed in the Japanese bombing that thrust the U.S.",
      "publishedAt": "2024-12-07T05:05:10Z",
      "title": "2 Pearl Harbor survivors, ages 104 and 102, return to Hawaii to honor those killed in 1941 attack",
      "url": "https://apnews.com/97e21f0b36f969bf0c5b3a8bb2641694",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6555415329f8422e91b7f0ac81a13779/1920.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE, Netherlands (AP) — An explosion and fire rocked a neighborhood in the Dutch city of The Hague on Saturday, killing three people and injuring other people and destroying several apartments, according to authorities.",
      "publishedAt": "2024-12-07T09:50:14Z",
      "title": "An explosion destroys an apartment block in a Dutch city, killing at least 3 and injuring others",
      "url": "https://apnews.com/54f06b68677dcfda4ee7af75deed4947",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ab51eec09c64a5fa0c13c608ec3b81d/3000.jpeg"
    },
    {
      "author": "JONATHAN LANDRUM Jr.",
      "description": "SAN DIEGO (AP) — When Aaron Pierre was cast as Mufasa, the weight of following in the late James Earl Jones' legendary footsteps was enough to rattle any actor.",
      "publishedAt": "2024-12-07T17:08:05Z",
      "title": "How 'Mufasa' rose with Aaron Pierre and Blue Ivy's voices along with new Lin-Manuel Miranda music",
      "url": "https://apnews.com/d900717873cb2fe7daa23de278fc3422",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ef505de53494fa9bb7f13f8a8bd83c9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}