{
  "articles": [
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "JERUSALEM (AP) — U.S. President Joe Biden signaled that a cease-fire in Gaza could be at hand, saying that Israel has agreed to pause its offensive during the upcoming Muslim holy month of Ramadan if a deal is reached to release some hostages held by Hamas.",
      "publishedAt": "2024-02-27T05:32:00Z",
      "title": "Biden signals there could be a truce in Gaza soon but Israel and Hamas indicate no deal is imminent",
      "url": "https://apnews.com/e17abedeaf5a005fcd5e7095fecacb7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15aed6d65c554694abe824d22a92a019/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden was meeting Tuesday with the top four leaders of Congress to press them to act quickly to avoid a looming government shutdown early next month and to pass emergency aid for Ukraine and Israel.",
      "publishedAt": "2024-02-27T05:07:26Z",
      "title": "Biden will urge congressional leaders to avoid a government shutdown, send aid to Ukraine and Israel",
      "url": "https://apnews.com/dc6d39b2a652130c6e3021394c1a3ee3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c96e297521764b0398511f7a7091464e/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — As he prepared to take office three years ago, Joe Biden's incoming administration considered a host of possible options to fulfill a campaign pledge to end the federal death penalty.",
      "publishedAt": "2024-02-27T15:17:26Z",
      "title": "Biden backed off a pledge to abolish the federal death penalty. That's left an opening for Trump",
      "url": "https://apnews.com/a76fe555f61c3cf6e09b87433f77966f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e96beb8a49044fba91786c5050bda3c/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Vladimir Kara-Murza could only laugh when officials in Penal Colony No. 6 inexplicably put a small cabinet in his already-cramped concrete cell, next to a fold-up cot, stool, sink and latrine.",
      "publishedAt": "2024-02-27T05:03:19Z",
      "title": "What's life like for Russia's political prisoners? Isolation, poor food and arbitrary punishment",
      "url": "https://apnews.com/3e5b9f5d3cfde3256819fbde5e405067",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee43baa7f31441f5990e748e702ffcde/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — While Joe Biden and Donald Trump are marching steadily toward their respective presidential nominations, Michigan's primary on Tuesday could reveal significant political perils for both of them.",
      "publishedAt": "2024-02-27T05:03:48Z",
      "title": "Biden and Trump are marching toward their nominations, but Michigan could reveal significant perils",
      "url": "https://apnews.com/6e0b9fc18773e975fdfd23f7287ed615",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ba0be9310d04552b0b68bf34f67e1db/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. Army is slashing the size of its force by about 24,000, or almost 5%, and restructuring to be better able to fight the next major war, as the service struggles with recruiting shortfalls that made it impossible to bring in enough soldiers to fill all the jobs.",
      "publishedAt": "2024-02-27T15:30:17Z",
      "title": "US Army is slashing thousands of jobs in major revamp to prepare for future wars",
      "url": "https://apnews.com/9f2f41cbe512f6330ce6008709e3435b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7a0ed67adca4859854864f71ed613ac/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A moon lander that ended up on its side managed to beam back more pictures, with only hours remaining before it dies.",
      "publishedAt": "2024-02-27T16:11:38Z",
      "title": "Toppled moon lander sends back more images, with only hours left until it dies",
      "url": "https://apnews.com/c00b3c7f2f1330b11d71ad6ecbc7833b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77bd4d4fdd8b42da9954156f93466d88/2000.jpeg"
    },
    {
      "author": "JOCELYN GECKER",
      "description": "SAN FRANCISCO (AP) — In California, a high school teacher complains that students watch Netflix on their phones during class. In Maryland, a chemistry teacher says students use gambling apps to place bets during the school day.",
      "publishedAt": "2024-02-27T05:25:45Z",
      "title": "Kids are using phones in class, even when it’s against the rules. Should schools ban them all day?",
      "url": "https://apnews.com/01fd6293a84a2e4e401708b15cb71d36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b53913a7f804b73b16006257580f308/3000.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Kroger and Albertsons — two of the biggest grocery chains in the United States — had hoped to complete the largest supermarket merger in the country's history this year. But their plan to compete with big-box retailers by combining forces faces legal challenges that make it look far less likely, at least any time soon.",
      "publishedAt": "2024-02-27T15:48:49Z",
      "title": "Why does the US government think a Kroger-Albertsons merger would be bad for grocery shoppers?",
      "url": "https://apnews.com/2fda44d9d8b82ef20d6c7e7cffb2ccc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57176b271e5046229b5a642ea9dbf39c/3000.jpeg"
    },
    {
      "author": "STEPHEN WHYNO",
      "description": "Chicago's Marcus Foligno took a hit, delivered one of his own to Minnesota's Jarred Tinordi, and the two big guys dropped the gloves. Outdoors in front of 82,000 people in the Meadowlands, it took even less for Matt Rempe and Matt Martin to spice up the Rangers-Islanders showdown with a fight.",
      "publishedAt": "2024-02-27T16:15:23Z",
      "title": "20 years since NHL's record-setting brawl, fighting is down across the league but not going anywhere",
      "url": "https://apnews.com/4bd1f67beda34f72b686448d8a884082",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60dea525456744afa43cbe25b4496b7e/2400.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}