{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces severed northern Gaza from the rest of the besieged territory ahead of an expected push into the dense confines of Gaza City.",
      "publishedAt": "2023-11-06T07:37:38Z",
      "title": "Israeli forces sever north Gaza from the rest of the territory ahead of expected push into Gaza City",
      "url": "https://apnews.com/51286d15dddd77ae0dd7ea76ee52bc71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d419614d81d748c19de5dcf8b47f2cfd/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli troops divided the northern and southern parts of Gaza, as communications across the besieged territory were temporarily cut Monday for a third time since the war started. The troops are expected to enter Gaza City on Monday or Tuesday, Israeli media reported.",
      "publishedAt": "2023-11-06T05:32:24Z",
      "title": "Live updates | Israeli troops surround Gaza City. Communications being restored to territory",
      "url": "https://apnews.com/c01bc7cf6db1e07ab4d235225cef7320",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da1169c774db42289d09247d89a791b4/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "ANKARA, Turkey (AP) — U.S. Secretary of State Antony Blinken was wrapping up a grueling Middle East diplomatic tour on Monday in Turkey after only limited success in his furious efforts to forge a regional consensus on how best to ease civilian suffering in Gaza as Israel intensifies its war against Hamas.",
      "publishedAt": "2023-11-06T09:50:26Z",
      "title": "Blinken wraps up frantic Mideast tour with tepid, if any, support for pauses in Gaza fighting",
      "url": "https://apnews.com/9ff3aae906aaae71613fb2a9afed2bdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/828906bb9ecf4ff9bc84e2ea238a052f/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and ERIC TUCKER",
      "description": "NEW YORK (AP) — Donald Trump has testified in court as a football owner, casino builder and airline buyer. He bragged in a deposition that he saved “millions of lives” by deterring nuclear war as president.",
      "publishedAt": "2023-11-05T12:24:01Z",
      "title": "Trump's decades of testimony provide some clues about how he'll fight for his real estate empire",
      "url": "https://apnews.com/bd06bf8db3a14a9d2f10eb69b300c1d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84e52fa1739b420ca529b054a09994ec/3000.jpeg"
    },
    {
      "author": "BRENDAN FARRINGTON",
      "description": "TALLAHASSEE, Fla. (AP) — A Florida governor wins reelection by record numbers and later finds himself running as a party conservative in a crowded presidential primary. In New Hampshire, he tip-toes around the explosive abortions rights issue, discusses ongoing Israeli military operations, promises he'll secure the Mexican border and warns that the current administration's fiscal insanity will cause more inflation, not reduce it.",
      "publishedAt": "2023-11-06T05:16:48Z",
      "title": "Can a Floridian win the presidency? It hasn't happened yet as Trump and DeSantis vie to be first",
      "url": "https://apnews.com/84a6a2eb53cfd3d1f46de55704e74160",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3166010a083344e7af3d605ac64dadd1/3000.jpeg"
    },
    {
      "author": "SALLY HO and GARANCE BURKE",
      "description": "Some are orphans, others seized from their parents. Many are older and have overwhelming needs or disabilities. Most bear the scars of trauma from being hauled between foster homes, torn from siblings or sexually and physically abused.",
      "publishedAt": "2023-11-06T05:17:25Z",
      "title": "Inspired by online dating, AI tool for adoption matchmaking falls short for vulnerable foster kids",
      "url": "https://apnews.com/f803bf3faa02bc90d285e68b1d2bc560",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02d9d015c0254d899345907ecfa19e81/3000.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Aid trickled in to villages Monday in Nepal’s northwest mountains flattened by a strong earthquake over the weekend as villagers searched through the rubble of their collapsed homes to salvage what was left of their belongings.",
      "publishedAt": "2023-11-06T08:25:08Z",
      "title": "Aid trickles in to Nepal villages struck by earthquake as survivors salvage belongings from rubble",
      "url": "https://apnews.com/41f843df12711fcd2d7470e32ebc2757",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10d1ffa8362041b8b31db983e4add1a5/1920.jpeg"
    },
    {
      "author": "KEN MORITSUGU and HUIZHONG WU",
      "description": "BEIJING (AP) — Australian Prime Minister Anthony Albanese met Chinese President Xi Jinping on Monday on the first visit by an Australian leader to China in seven years as the two countries try to mend their tattered ties.",
      "publishedAt": "2023-11-06T04:46:17Z",
      "title": "Australian and Chinese leaders meet in Beijing while their countries try to mend ties",
      "url": "https://apnews.com/289db21766626eaa9bd3146681df2493",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a20145b9250a4353b3cc8e8be5c16fcd/3000.jpeg"
    },
    {
      "author": "NICK PERRY",
      "description": "WELLINGTON, New Zealand (AP) — A man accused of physically assaulting a woman at a U.S. research station in Antarctica was then sent to a remote icefield where he was tasked with protecting the safety of a professor and three young graduate students, and he remained there for a full week after a warrant for his arrest was issued, documents obtained by The Associated Press show.",
      "publishedAt": "2023-11-06T05:24:35Z",
      "title": "Man accused of Antarctic assault was then sent to remote icefield with young graduate students",
      "url": "https://apnews.com/c3c1a7264c3e41a9c3842c346fc2dd39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3f1b0d78b7b4607adfb87481a089346/3000.jpeg"
    },
    {
      "author": null,
      "description": "CHICAGO (AP) — A former hockey player in the Chicago Blackhawks organization has alleged in a lawsuit the team's former video coach sexually assaulted him during the 2009-10 season and the Blackhawks responded inadequately to his complaint because it didn't want a disruption during its Stanley Cup run.",
      "publishedAt": "2023-11-06T04:09:47Z",
      "title": "Another ex-player is alleging Blackhawks' former video coach sexually assaulted him in 2009-10",
      "url": "https://apnews.com/220621b6d7a3cb973b4f1e7a777e1291",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fe3edf88b2847aea1b3a38f210cc1cf/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}