{
  "articles": [
    {
      "author": "TOM KRISHER, MIKE HOUSEHOLDER and JOHN SEEWER",
      "description": "DETROIT (AP) — Nearly one in 10 of America’s unionized auto workers went on strike Friday to pressure Detroit’s three automakers into raising wages in an era of big profits and as the industry begins a costly transition from gas guzzlers to electric vehicles.",
      "publishedAt": "2023-09-15T04:05:36Z",
      "title": "Workers strike at all 3 Detroit automakers, a new tactic to squeeze companies for better pay",
      "url": "https://apnews.com/7ce3ca9d94b911250d07556b7af376c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3422fc08c9b46d5bcdaca75a279e71a/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — In the months since a single senator froze military promotions over the Pentagon’s abortion policy, the uniformed officers affected have been largely silent, wary of stepping into a political fray.",
      "publishedAt": "2023-09-16T04:21:14Z",
      "title": "Military officers begin to speak out on the harm done by Sen. Tuberville's holds on promotions",
      "url": "https://apnews.com/664c15d00d330b2b06b75ebeda8e3f01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f77fa65ebfe0497f8f7ad5944b9ac123/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "MANCHESTER, N.H. (AP) — Once upon a time, the moderates, the mavericks and the underdogs in presidential politics had a chance to break through in New Hampshire.",
      "publishedAt": "2023-09-16T04:13:10Z",
      "title": "Republican presidential hopefuls generally overlook New Hampshire in effort to blunt Trump in Iowa",
      "url": "https://apnews.com/89396fa0bae736c98c551ecf2dc93713",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b953230ea0fd4a8199126aa4ca017fa7/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un inspected Russia’s nuclear-capable bombers, hypersonic missiles and an advanced warship from its Pacific fleet on Saturday as he continued a trip in Russia’s Far East that has sparked Western concerns about an arms alliance that could fuel President Vladimir Putin’s war on Ukraine.",
      "publishedAt": "2023-09-16T00:26:01Z",
      "title": "North Korea's Kim Jong Un inspects Russian bombers and a warship on a visit to Russia's Far East",
      "url": "https://apnews.com/0255d844b06e11c39920cc2acdb53406",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4f9a616401643609724eb641b217c00/3000.jpeg"
    },
    {
      "author": "JEFF McMURRAY",
      "description": "When a small city abruptly parked all its buses to launch a publicly subsidized van service offering $1.50 trips anywhere in town, only one of its bus drivers — a big-city transplant — went along for the ride.",
      "publishedAt": "2023-09-16T04:15:41Z",
      "title": "What if public transit was like Uber? A small city ended its bus service to find out",
      "url": "https://apnews.com/675f6f7a6e550a2ec8113bda5b001ffa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95b2fc97813a40fab136349c70173226/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, ROBERT F. BUTAKY and PATRICK WHITTLE",
      "description": "PORTLAND, Maine (AP) — The National Hurricane Center has downgraded Hurricane Lee to a post-tropical cyclone, but millions of people in coastal New England and eastern Canada remained under storm watches and warnings Saturday amid the threat of hurricane-force winds and torrential rain.",
      "publishedAt": "2023-09-16T05:28:52Z",
      "title": "Millions under storm watches as Lee is downgraded but bears down on New England and Canada",
      "url": "https://apnews.com/feed749d5e31b0286d943424e202f007",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/880f6cf6cbc94d409e9876e30754a17c/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and YOUSEF MOURAD",
      "description": "DERNA, Libya (AP) — Libyan authorities have opened an investigation into the collapse of two dams that caused a devastating flood in a coastal city as rescue teams searched for bodies on Saturday, nearly a week after the deluge killed more than 11,000 people.",
      "publishedAt": "2023-09-16T07:54:47Z",
      "title": "Libya investigates dams' collapse after a devastating flood last weekend killed more than 11,000",
      "url": "https://apnews.com/40e48e454b6d903f1a194d95d4758d19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f470bbee62624bdcb64e049cb048fb30/1920.jpeg"
    },
    {
      "author": "TOM MURPHY",
      "description": "When she prescribes the popular weight-loss drug Wegovy, Dr. Angela Fitch sends patients on a quest she likens to “The Hunger Games.\"",
      "publishedAt": "2023-09-16T12:01:35Z",
      "title": "Supply problems and insurance issues make popular weight-loss drugs hard to get",
      "url": "https://apnews.com/64014bc2887a518b33c597b2bf936e37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f03b37bdecb3445e8d935c55be4313ae/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Two of President Joe Biden 's top goals — fighting climate change and expanding the middle class by supporting unions — are colliding in the key battleground state of Michigan as the United Auto Workers go on strike against the country's biggest car companies.",
      "publishedAt": "2023-09-16T04:28:38Z",
      "title": "Auto worker strike creates test of Biden's goals on labor and climate",
      "url": "https://apnews.com/d73f259bf5e9242340e912ad1e9b4aa9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b8fa889a7ea4e2e9efc1c41168b2301/3000.jpeg"
    },
    {
      "author": "TIM BOOTH",
      "description": "SEATTLE (AP) — When the postseason rolls around, the Los Angeles Dodgers know they'll need more than just Mookie Betts and Freddie Freeman carrying the load at the top of the lineup. Which is why a night where the likes of J.D.",
      "publishedAt": "2023-09-16T05:06:02Z",
      "title": "Dodgers on the cusp of NL West title after topping Mariners 6-3",
      "url": "https://apnews.com/af75d5ac8a10890b13d5b47d0c0490ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e835e06136049e9b74728136ef9351f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}