{
  "articles": [
    {
      "author": null,
      "description": "House Speaker Mike Johnson is rebuffing pressure to act on the investigation into Jeffrey Epstein. The speaker is sending members of the House home early for a month-long break from Washington amid calls for a vote on the Epstein matter. Johnson said Tuesday morning that he wants to give the White House “space” to release the Epstein information on its own. The speaker’s stance seemed unlikely to satisfy many Republicans who are threatening to support a bipartisan bill to pry information from the Justice Department. Even before Johnson spoke, a Republican-controlled committee was advancing a resolution to subpoena Epstein’s former girlfriend, Ghislaine Maxwell, for a deposition.",
      "publishedAt": "2025-07-22T16:28:20Z",
      "title": "Speaker Johnson refuses to allow Epstein vote as House set to recess early",
      "url": "https://apnews.com/article/congress-jeffrey-epstein-trump-f2a03eca247268b14a9e38858338eded",
      "urlToImage": "https://dims.apnews.com/dims4/default/af3f55b/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2Fe8%2F150d1b77fc65008393fe9501979e%2F449dc4be1f4747e89457f5fff97552d2"
    },
    {
      "author": null,
      "description": "President Donald Trump is rehashing longstanding grievances over the Russia investigation that shadowed much of his first term. The Republican president lashed out Tuesday following a report from his intelligence director aimed at casting doubt on long-established findings about Moscow’s interference in the 2016 election. Trump was not making his claims for the first time but delivered them when administration officials are harnessing the machinery of the federal government to investigate the targets of Trump’s derision. That includes key officials responsible for scrutinizing Russia’s attempts to intervene on Trump’s behalf in the 2016 contest against Democrat Hillary Clinton. Democrats call the intelligence director's report factually flawed and politically motivated.",
      "publishedAt": "2025-07-22T18:07:25Z",
      "title": "Trump rehashes Russia investigation grievances after intelligence report",
      "url": "https://apnews.com/article/trump-gabbard-russia-2016-election-interference-895e863c27e5853f10c819121d73df8a",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1b79bf/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F5b%2F716344ffc38b212b46201ee47dde%2Fe2d347f1371848f09bd8af30b1e58ac0"
    },
    {
      "author": null,
      "description": "President Donald Trump plans to host Philippine President Ferdinand Marcos Jr. at the White House. The visit Tuesday highlights efforts to strengthen security and economic ties between the two countries as tensions rise in the Indo-Pacific. Their talks are expected to focus on mutual defense as China has become increasingly assertive in the South China Sea, where Manila and Beijing have clashed over hotly contested territory. The leaders also are negotiating a potential tariffs deal. Marcos met with Secretary of State Marco Rubio and Defense Secretary Pete Hegseth on Monday. Both sides emphasized their commitment to regional peace and economic collaboration.",
      "publishedAt": "2025-07-22T04:03:11Z",
      "title": "Trump and Philippine leader plan to talk tariffs and China",
      "url": "https://apnews.com/article/marcos-trump-philippines-china-tariffs-3138d1d7f8368c022ab9242bebb4a2e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb924e5/2147483647/strip/true/crop/8149x4584+0+425/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Fd7%2F50e244c4ee5ef13ad2cf18e01a96%2F373ad20f45084a899ce3a054e493147c"
    },
    {
      "author": null,
      "description": "The gloomy, demon-invoking lead singer of the pioneering band Black Sabbath who became the throaty, growling voice of heavy metal, Ozzy Osbourne has died. A family statement said he died Tuesday, just weeks after his farewell show. He was 76. The statement did not include a cause but in 2020, Osbourne revealed he had Parkinson's disease. Either clad in black or bare-chested, the singer was often the target of parents’ groups for his imagery and once caused an uproar for biting the head off a bat. Later, he would reveal himself to be a doddering and sweet father on the reality TV show “The Osbournes.”",
      "publishedAt": "2025-07-22T18:22:49Z",
      "title": "Ozzy Osbourne dies at 76",
      "url": "https://apnews.com/article/ozzy-osbourne-dies-adff88b55f1d3b0bace5705d58d3cdde",
      "urlToImage": "https://dims.apnews.com/dims4/default/7368ec6/2147483647/strip/true/crop/3480x1957+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2Fd7%2F24336cf903392fbdd410023c8ac1%2F7ab707fd7a504c8da4759b5023fed59b"
    },
    {
      "author": null,
      "description": "The State Department's spokesperson says President Donald Trump’s special envoy, Steve Witkoff, is planning to head to the Middle East as the U.S. tries once again to solidify a ceasefire deal between Israel and Hamas. Department spokesperson Tammy Bruce told reporters Tuesday that Witkoff was going to the region with a “strong hope” that the U.S. can deliver another ceasefire deal as well as a new humanitarian corridor for aid distribution. Three U.S. officials said Witkoff is traveling to Europe this week to discuss Gaza and other issues but had no details about Middle East stops.",
      "publishedAt": "2025-07-22T20:19:33Z",
      "title": "Trump envoy Witkoff to visit the Middle East in push for a ceasefire in Gaza",
      "url": "https://apnews.com/article/gaza-ceasefire-israel-hamas-war-trump-witkoff-cc6b33c243c5d9eb1605ead09e7de925",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ef638f/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F66%2Fb74bb38b98e3ad597721c9a10b20%2Ff68b934decb149e4b96ca007d93afad9"
    },
    {
      "author": null,
      "description": "The U.S. Olympic and Paralympic Committee has barred transgender women from competing in women’s sports. The committee is citing an executive order from President Donald Trump. The order, signed in February, threatens to cut funding for organizations allowing transgender athletes in women’s sports. The policy is listed under the USOPC Athlete Safety Policy and follows a similar move by the NCAA earlier this year. National governing bodies for various sports like swimming and track and field are expected to comply with the directive.",
      "publishedAt": "2025-07-22T22:05:05Z",
      "title": "US Olympic and Paralympic officials bar transgender women from competing in Olympic women’s sports",
      "url": "https://apnews.com/article/team-usa-transgender-athletes-338c43225fdfad936d4b85c1a67ced36",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c3b038/2147483647/strip/true/crop/5169x2908+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2F26%2F524ee458450a75a3e90c87b4826e%2Fa4c3ef6fcefa4ee78c4e91040e48c6e0"
    },
    {
      "author": null,
      "description": "Los Angeles prosecutors have announced felony charges in connection with a car crash outside a nightclub over the weekend that injured 37 people and led to the driver being shot. LA County District Attorney Nathan Hochman on Tuesday charged the driver, who was identified as 29-year-old Fernando Ramirez. Partygoers were leaving the Vermont Hollywood venue at the end of a reggae hip-hop event early Saturday when a vehicle rammed into the crowd. Injuries ranged from minor pain to serious fractures and lacerations, and some people were briefly trapped beneath the vehicle.",
      "publishedAt": "2025-07-22T19:15:28Z",
      "title": "LA prosecutors charge driver in nightclub crash that injured 37",
      "url": "https://apnews.com/article/los-angeles-car-crash-hollywood-nightclub-dd0b2008afe5258cf3125e405ec77418",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d13de6/2147483647/strip/true/crop/3878x2181+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Fbf%2Fd442de675407fd7b4ea532380342%2Fd8560462f1c94096a4e4e9856127b4af"
    },
    {
      "author": null,
      "description": "The Trump administration has announced that it will once again withdraw from the U.N. cultural agency UNESCO. The move Tuesday was expect and has the U.S. further retreating from international organizations. The decision to pull U.S. funding and participation from UNESCO comes two years after the Biden administration rejoined following a controversial, five-year absence that began during President Donald Trump’s first term. The White House cited similar concerns as it did in 2018, saying it believes U.S. involvement is not in its national interest and accusing the agency promoting anti-Israel speech. The UNESCO chief said she “deeply” regrets the U.S. decision but said the agency “has prepared for it.” She denied accusations of anti-Israel bias,",
      "publishedAt": "2025-07-22T11:19:46Z",
      "title": "Trump administration says US will leave UNESCO again",
      "url": "https://apnews.com/article/unesco-trump-withdraw-paris-united-nations-israel-129a4ffbce562e1aa497231e0bdd55a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff7e5ae/2147483647/strip/true/crop/6590x3707+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2Fa8%2F490aa2eda7f1d039666f72fce3e4%2F85513f8c0fe740089d0d1a1c86775bc3"
    },
    {
      "author": null,
      "description": "Massachusetts officials say the cause of a fire at an assisted-living facility that left 10 people dead remains undetermined for now as officials investigate whether smoking materials and an issue with a medical oxygen machine may have been factors. The state fire marshal, Jon Davine, said Tuesday that the presence of medical oxygen contributed to the spread of the July 13 fire at Gabriel House in Fall River, about 50 miles south of Boston. The blaze left some residents hanging out windows of the three-story facility screaming for help.",
      "publishedAt": "2025-07-22T14:25:34Z",
      "title": "Smoking or oxygen machine may have caused deadly fire at Massachusetts assisted-living home",
      "url": "https://apnews.com/article/massachusetts-assisted-living-fire-fall-river-updates-cd33daa722c54ab7a69839d647e90100",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6c73b7/2147483647/strip/true/crop/4595x2585+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2Fa0%2F3bf7f0c231dff686d451d3832fb5%2F340c732a870e4f4eafe3e1636c000909"
    },
    {
      "author": null,
      "description": "President Donald Trump teased the announcement last week, but Coca-Cola finally confirmed it Tuesday: a version of Coke’s trademark cola sweetened with cane sugar will be released in the U.S. this fall. For decades, Coke and other beverage makers have used high fructose corn syrup or artificial sweeteners in their U.S. sodas. But consumers are increasingly looking for products with fewer and more natural ingredients. Nutritionists say high fructose corn syrup and cane sugar are both sugars with around the same amount of calories. They are equally likely to lead to issues like obesity and tooth decay.",
      "publishedAt": "2025-07-22T19:18:42Z",
      "title": "What to know about sugar versus high fructose corn syrup in Coke",
      "url": "https://apnews.com/article/coke-cane-sugar-corn-syrup-better-d7a70ebd4aef1564e409dd087f6a69c3",
      "urlToImage": "https://dims.apnews.com/dims4/default/30afb66/2147483647/strip/true/crop/3319x1867+0+173/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F44%2F419ebceace2523129e772575ab05%2F18d906ef5c1b430d811e7bbf98762f03"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}