{
  "articles": [
    {
      "author": "STEPHANY MATAT, ERIC TUCKER, TERRY SPENCER, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "WEST PALM BEACH, Fla. (AP) — The man suspected in an apparent assassination attempt targeting Donald Trump camped outside a Florida golf course with food and a rifle for nearly 12 hours, lying in wait for the former president before a Secret Service agent thwarted the potential attack and opened fire, according to court documents filed Monday.",
      "publishedAt": "2024-09-16T14:52:04Z",
      "title": "Suspect in apparent assassination attempt on Trump was near golf course for 12 hours, records show",
      "url": "https://apnews.com/fee81d8bcf737bfcde2ee8e5cea88465",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/215b9c19aad44cfbb2de9f8c05f05d8a/1920.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER, AUDREY McAVOY, BERNARD CONDON and MICHAEL R. SISAK",
      "description": "KAAAWA, Hawaii (AP) — Ryan Wesley Routh portrayed himself online as a man who built housing for homeless people in Hawaii, tried to recruit fighters for Ukraine to defend itself against Russia, and described his support and then disdain for Donald Trump — even urging Iran to kill him.",
      "publishedAt": "2024-09-16T13:47:19Z",
      "title": "Man who appeared intent on killing Trump wrote a book urging Iran to assassinate the ex-president",
      "url": "https://apnews.com/f76ed09f256f6bd21727a10901d92af7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/222ce2bd132a47efa33385e80d7c7a1b/3000.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — Sunday was to be a day of relative rest for Donald Trump, a rare breather this deep into a presidential campaign. Aside from sounding off on social media, golf was on the agenda.Then the Secret Service spotted the muzzle of a rifle sticking out of a fence in bushes at Trump's West Palm Beach golf club, and everything changed.",
      "publishedAt": "2024-09-16T05:42:30Z",
      "title": "Trump was on the links taking a breather from the campaign. Then the Secret Service saw a rifle",
      "url": "https://apnews.com/f0ace849dda2b99cb281aed5b9a7ea95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/260a3c78787048efb68affc19398c242/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The FBI said former President Donald Trump was the target of “what appears to be an attempted assassination ” at his golf club in West Palm Beach, Florida, on Sunday, just nine weeks after the Republican presidential nominee survived another attempt on his life.",
      "publishedAt": "2024-09-16T13:30:45Z",
      "title": "The Latest: Suspect in apparent assassination attempt against Trump charged with federal gun crimes",
      "url": "https://apnews.com/3b823cbca83546502fb92d13f5b3950f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0937c64cb85840f9ac676ebce5dc4c98/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "DEER PARK, Texas (AP) — A pipeline explosion near Houston erupted in a towering flame over neighborhoods for hours on Monday, forcing evacuations and shelter orders and melting playground equipment as firefighters struggled to keep nearby homes from burning.",
      "publishedAt": "2024-09-16T16:09:12Z",
      "title": "Pipeline explosion near Houston erupts in a towering flame, forcing evacuations",
      "url": "https://apnews.com/659141b9f88ed2b324c36fce2735746f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e3fd93ad47d4566b5eaa354c7817676/1920.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and LISA J. ADAMS WAGNER",
      "description": "The lead engineer for an experimental submersible that imploded en route to the wreck of the Titanic testified Monday that he felt pressured to get the vessel ready to dive and refused to pilot it for a journey several years earlier.",
      "publishedAt": "2024-09-16T04:03:51Z",
      "title": "The Titan's former lead engineer says he felt pressured to get the submersible ready",
      "url": "https://apnews.com/2ae3c044e50a69647bd42cffe96c7f98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3ee1840f8a147099ea3014afc71e6bb/2000.jpeg"
    },
    {
      "author": "PATRICK AFTOORA ORSAGOS and MICHAEL RUBINKAM",
      "description": "SPRINGFIELD, Ohio (AP) — Ohio state police will help protect schools in a city at the center of a political furor over Haitian migrants, the governor announced Monday, while local officials canceled an annual celebration of cultural diversity in the fallout over former President Donald Trump’s false claims about pet-eating.",
      "publishedAt": "2024-09-16T19:24:19Z",
      "title": "Ohio state police to protect schools after furor over Haitian immigrants in Springfield",
      "url": "https://apnews.com/d74b7ff56f9a45d9389d8ebee4af1652",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7439ef4487264272b7c56bfa3efbd4e3/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Secretary of State Antony Blinken heads to Egypt on Tuesday for his 10th trip to the Middle East since the war in Gaza began nearly a year ago, this one aimed partly at refining a proposal to present to Israel and Hamas for a cease-fire deal and release of hostages.",
      "publishedAt": "2024-09-16T22:50:55Z",
      "title": "Blinken is heading back to the Middle East, this time without fanfare or a visit to Israel",
      "url": "https://apnews.com/a5d09768f969a3ccce210478de82cf47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31107da38c6442279a6ddea66f33667a/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "TikTok faced off with the U.S. government in federal court on Monday, arguing a law that could ban the platform in a few short months is unconstitutional while the Justice Department said it is needed to eliminate a national security risk posed by the popular social media company.",
      "publishedAt": "2024-09-16T04:01:17Z",
      "title": "TikTok and the U.S. face off in court over law that could lead to a ban on the popular platform",
      "url": "https://apnews.com/9bb5407c93b2ab99548db17b95dc2259",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52d68034ee924dfca48124e5c4731cd8/3000.jpeg"
    },
    {
      "author": "THALIA BEATY and JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — Warren Buffett's adult children — Susie, Howard and Peter Buffett — have long track records as philanthropists, giving away more than $15 billion of their dad's money through their foundations since 2006.",
      "publishedAt": "2024-09-16T14:15:12Z",
      "title": "Giving away a fortune: What could Warren Buffett's adult children support?",
      "url": "https://apnews.com/fd195032b2253e2f791fc3e40df5c771",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3006f45b5eaa441cbb4393063330fc67/2993.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}