{
  "articles": [
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces shelled tent camps for displaced Palestinians outside Gaza's southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory's health officials and emergency workers.",
      "publishedAt": "2024-06-21T18:21:32Z",
      "title": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50, Gaza health officials say",
      "url": "https://apnews.com/97701dddad7d558dc2ce92bf43016a95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed6dcdf2855c4343a4cb36dc6f8a634d/1920.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI",
      "description": "A relentless heat wave continued to bake most of the United States on Friday, with numerous areas expected to see record-breaking temperatures and forecasters warning there would likely be little relief through the weekend for most areas.",
      "publishedAt": "2024-06-21T17:35:30Z",
      "title": "Millions baking across the US as heat prolongs misery with little relief expected",
      "url": "https://apnews.com/e93d6f7d22ab0609c14a15fc5f14eef9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5b4a9dc54574fb7bec7fda872cf9d1e/1920.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The head of the Homeland Security Department said Friday that the agency tasked with responding to disasters across the country is prepared as it goes into what is expected to be an intense hurricane and wildfire season but he's concerned about looming budget shortfalls.",
      "publishedAt": "2024-06-21T20:55:53Z",
      "title": "FEMA is ready for an extreme hurricane and wildfire season, but money is a concern, Mayorkas says",
      "url": "https://apnews.com/f6b8c8c9713a4e0ea7a7bf28c7e55aa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22708f1bb8c647809ae106bd5a750f9b/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "Belinda Bukovitz was jolted into action by the sound of police outside her home shouting through a loudspeaker: “Go now, go now, go now!” Realizing this was not like other wildfires that had threatened her mountain village before, she, her husband, son and two cats bundled into three separate cars and fled.",
      "publishedAt": "2024-06-21T23:11:47Z",
      "title": "Escape from killer New Mexico wildfire was 'absolute sheer terror,’ says woman who fled the flames",
      "url": "https://apnews.com/be4907aa9570904e251ee193c05a2059",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ad38d4e65e944369d5b0bc6c7f06b3f/1920.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "CHAPIN, S.C. (AP) — The president of the Teamsters Union is set to speak at next month's Republican National Convention, as Donald Trump angles to chip away at President Joe Biden's support among the blue-collar workers who are expected to play a major role in the general election, particularly in crucial Midwestern swing states like Wisconsin and Michigan.",
      "publishedAt": "2024-06-21T20:49:40Z",
      "title": "Teamsters president will speak at the Republican National Convention",
      "url": "https://apnews.com/4bf539244dccf59ed7def4048c972331",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a18bc98ad8847f9ba6cadc4c0f94da4/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — President Joe Biden begins an intense period of private preparations Friday at Camp David for what may be the most consequential presidential debate in decades.",
      "publishedAt": "2024-06-21T04:12:22Z",
      "title": "How Biden and Trump are taking very different approaches to preparing for next week's debate",
      "url": "https://apnews.com/2f67b119f58136b310b625e42fad3d3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d8956ae2e9d4a5a9704194e7e19df75/3000.jpeg"
    },
    {
      "author": "ANDREW DeMILLO",
      "description": "LITTLE ROCK, Ark. (AP) — A shooter who opened fire Friday at a grocery store in Arkansas left the store and parked cars riddled with bullet holes as bystanders ducked for cover both indoors and in the parking lot, killing 3 people and wounding 10 others, authorities said.",
      "publishedAt": "2024-06-21T19:08:50Z",
      "title": "Shooting at grocery store in Arkansas kills 3 and wounds 10 others, police say",
      "url": "https://apnews.com/a4c8496ca2fc60feb1f52e5298cbecc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c27e9aa45234d8898ea9f4fb262add8/2750.jpeg"
    },
    {
      "author": "MARCOS ALEMÁN",
      "description": "SAN SALVADOR, El Salvador (AP) — The torrential rains hitting El Salvador caused the deaths of another six people on Friday when two girls and four adults were killed after being buried in their homes.",
      "publishedAt": "2024-06-21T16:41:44Z",
      "title": "El Salvador death toll rises to 19 as heavy rains continue",
      "url": "https://apnews.com/8275ca07e9669ad629bd5a933e0a2fa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0f14b555aa647bb91300b172cfe052b/3000.jpeg"
    },
    {
      "author": "SIBI ARASU",
      "description": "BENGALURU, India (AP) — Each year from June to September, a heavy band of rain makes its way from India's southwest coast to its northeastern borders, quenching farmers' thirsty fields.",
      "publishedAt": "2024-06-22T02:20:46Z",
      "title": "Climate change makes India's monsoons erratic. Can farmers still find a way to prosper?",
      "url": "https://apnews.com/d938fa46a04ea9e2b7d01288705f2a31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6be194d02b04835bfaba9194e5082cc/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — About two years after 13 children and teens sued Hawaii over the threat posed by climate change, both sides reached a settlement that includes an ambitious requirement to decarbonize the state's transportation system over the next 21 years.",
      "publishedAt": "2024-06-22T00:52:49Z",
      "title": "Hawaii settles lawsuit from youths over climate change. Here's what to know about the historic deal",
      "url": "https://apnews.com/bcb791b6f23c7dc798bf9e3cd2b67f97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e888e711e4a346b7819ed10ac638b04d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}