{
  "articles": [
    {
      "author": "Ben Finley, Konstantin Toropin",
      "description": "President Donald Trump has taken an unusual step of turning to military leaders for high-level diplomacy. The top U.S. commander in the Middle East is involved in talks over Iran’s nuclear program. Trump's Army secretary is engaged in negotiations on trying to end the Russia-Ukraine war. It's not clear whether the military leaders were brought in because of their expertise, connections or to signal potentially tougher options. But the move reflects how the Trump administration has upended traditional U.S. foreign policy and diplomacy. Envoy Steve Witkoff and Trump's son-in-law Jared Kushner are balancing both sets of difficult negotiations.",
      "publishedAt": "2026-02-07T13:20:58Z",
      "title": "Trump's military leaders help with diplomacy on Iran and Ukraine",
      "url": "https://apnews.com/article/military-diplomacy-trump-iran-ukraine-russia-09decddeb6264a4dd83cc3535553b2f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6c86ac/2147483647/strip/true/crop/7952x5299+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Fc6%2Fa740dc997047583c2f98b8a1e276%2Fb3cc592cabf34096ac059e8e79c22a42"
    },
    {
      "author": "Matt Brown",
      "description": "President Donald Trump is facing rare criticism from his Republican Party over a racist video. Trump's White House removed a video that contained a racist image of former President Barack Obama and former first lady Michelle Obama after a bipartisan blowback from lawmakers on Capitol Hill. The condemnation from congressional Republicans marked a rare moment of pushback from GOP lawmakers, who otherwise rarely criticize Trump in public. Trump said that he did not support the racist parts of the video and declined to apologize. Democrats and supporters of the Obamas rallied to the former first couple's defense",
      "publishedAt": "2026-02-07T19:37:33Z",
      "title": "Trump faces rare GOP blowback over post depicting Obamas as primates",
      "url": "https://apnews.com/article/trump-obama-racist-video-tim-scott-067cf84eea0ec4a03122d6a245ce5714",
      "urlToImage": "https://dims.apnews.com/dims4/default/74d68a0/2147483647/strip/true/crop/5049x3364+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F4d%2Fd0c0f0b83d621bf386fe8080d5ec%2F1875dc3bab41439888293037a92b1579"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy says the U.S. has given Ukraine and Russia a June deadline to reach a peace agreement. Zelenskyy said that if the deadline is not met, the Trump administration will likely apply pressure on both sides. Zelenskyy spoke to reporters on Friday, with his comments embargoed until Saturday morning. He said the Americans want the war to end by the beginning of summer. They plan to do everything possible to achieve this goal and seek a clear schedule of events.",
      "publishedAt": "2026-02-07T09:11:20Z",
      "title": "Zelenskyy says U.S. gave Ukraine and Russia a June deadline to reach agreement to end war",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-june-deadline-98da4e17de8ab377363ae9c3ff308001",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a6e82b/2147483647/strip/true/crop/5584x3721+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2F17%2F890d53bd9225f48539907b6f1e3b%2Fb0c5c959afb44e8f9ca9da6053652836"
    },
    {
      "author": "Jill Lawless",
      "description": "The Jeffrey Epstein files have rocked Europe's elite, revealing ties to a prince, an ambassador, and top politicians. The U.S. Department of Justice released documents that have ended careers and sparked investigations. King Charles III's brother lost his titles and home. Ex-U.K. ambassador Peter Mandelson was fired and may face prison. British Prime Minister Keir Starmer is in crisis for appointing Mandelson. Norway, Sweden and Slovakia have seen senior figures fall. Experts say the files expose Epstein's powerful network in Europe. The fallout contrasts with a more limited impact so far in the U.S. where only a handful of prominent Epstein associates have lost their jobs.",
      "publishedAt": "2026-02-07T10:41:15Z",
      "title": "Jeffrey Epstein files shake political careers in Europe",
      "url": "https://apnews.com/article/jeffrey-epstein-fallout-europe-us-mandelson-409c14e095a2e29bbea6398437411a8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e43f7e/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F4b%2F732ac12280a90280b960f4ba748b%2F0ce4d201467540bf8d42e37878060396"
    },
    {
      "author": "Ali Swenson, Jeff Amy",
      "description": "Democrats are focusing on health care in the November elections and making it a key issue. Republicans have cut Medicaid through new work requirements and they've declined to extend COVID-era subsidies. That's led to increased costs for people covered under Affordable Care Act plans. Democrats are using campaign ads and personal stories to emphasize the impact on Americans. Jon Ossoff is one high-profile Democrat in a tough reelection campaign this year. The Georgia senator plans to address health care at an event Saturday. Republicans have struggled to pass legislation to offset health costs and that's become weak point for them. Democrats see a chance to gain political leverage in the midterms.",
      "publishedAt": "2026-02-07T05:00:18Z",
      "title": "Health costs are a top focus for Democrats in the midterms",
      "url": "https://apnews.com/article/democrats-republicans-election-2026-midterms-health-care-e2ba02302f151a03fae4f1d760cf555f",
      "urlToImage": "https://dims.apnews.com/dims4/default/810d397/2147483647/strip/true/crop/5358x3570+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Ffa%2F6a86d5e29ac821936a3363cd6741%2Fab0bc283fec24799a60e48964a76952e"
    },
    {
      "author": "Jack Brook, Michael Biesecker, Jim Mustian, Cedar Attanasio",
      "description": "A Mexican immigrant whose skull was broken during his arrest by immigration officers last month in Minnesota says the beating was unprovoked. Alberto Castañeda Mondragón says federal agents began hitting him right after they pulled him from a vehicle. He was hospitalized with eight skull fractures and five life-threatening brain hemorrhages. Officers claimed he ran into a wall, but medical staff immediately doubted that account. His case has sparked calls for accountability and transparency. Castañeda Mondragón, who entered the U.S. legally, faces a long recovery and uncertain future. He hopes to stay in the U.S. and support his family despite fears of another encounter with ICE.",
      "publishedAt": "2026-02-07T05:01:10Z",
      "title": "Immigrant whose skull was broken during ICE arrest says beating was unprovoked",
      "url": "https://apnews.com/article/immigration-enforcement-minneapolis-hospital-ice-beating-assault-4e77742e0629fc7f127c0aa38b3d2a70",
      "urlToImage": "https://dims.apnews.com/dims4/default/cff3f9d/2147483647/strip/true/crop/2172x1447+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F98%2Fd3b31ba59f5bba8d4c0fd4bb3d28%2F94351bdc84064a95b5e3cb835e50b6db"
    },
    {
      "author": "Matthew Lee",
      "description": "President Donald Trump plans to convene the first meeting of his Board of Peace this month in Washington to raise money for the reconstruction of Gaza. The meeting is proposed for Feb. 19. It would include both world leaders who accepted Trump’s invitation in January to join the board as well as members of an executive committee for Gaza that will oversee the specifics of the territory’s governance, security and redevelopment. That word comes from two Trump administration officials. They spoke on condition of anonymity because the meeting hasn't yet been formally announced and details of its agenda are still being determined. It's not clear how many leaders will come.",
      "publishedAt": "2026-02-07T17:02:06Z",
      "title": "Trump aims to hold first Board of Peace meeting in DC this month",
      "url": "https://apnews.com/article/board-peace-trump-gaza-united-nations-a7d28cbbd3b163457064d056e65ed9b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4afa45/2147483647/strip/true/crop/7878x5249+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F69%2F86a5b167be541bec53b80af9338e%2Fe348621bc6ec458e92b04de21fdcb4ed"
    },
    {
      "author": "Michael R. Blood",
      "description": "Los Angeles Mayor Karen Bass is heading into a challenging reelection bid as she continues to suffer fallout from last year’s devastating wildfire. She is also fending off criticism of City Hall on issues from street paving to homelessness. Saturday is the deadline for candidates to enter the contest ahead of the June 2 primary. Bass is a first-term Democrat and the first Black woman to hold the post. She faces challenges from tech entrepreneur and nonprofit founder Adam Miller; reality television personality Spencer Pratt, who lost his home in the deadly Palisades Fire; and community organizer Rae Huang.",
      "publishedAt": "2026-02-07T04:58:50Z",
      "title": "Los Angeles Mayor Karen Bass faces reelection challenges amid wildfire fallout",
      "url": "https://apnews.com/article/los-angeles-mayoral-election-karen-bass-2026-ab3d5a5e4393f63007576788bbd6ec0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a85c955/2147483647/strip/true/crop/4101x2733+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F7c%2F5378061777383d2c8c08ce0722de%2F3b6c487e77b449989160c8783bebd66e"
    },
    {
      "author": "Hallie Golden",
      "description": "Moments after the news broke about the apparent abduction of “Today” show host Savannah Guthrie’s mother, the floodgates opened on social media. The desperate search for 84-year-old Nancy Guthrie has become the latest investigation to pique the widespread interest of online armchair detectives. Authorities believe she was taken against her will from her home just outside Tucson, Arizona, a week ago. Posts across Instagram, TikTok, X, Facebook and YouTube have put millions of eyeballs on tips and theories surrounding her disappearance. But they’ve also helped to amplify rumors and forced law enforcement to set the record straight on at least one crucial detail.",
      "publishedAt": "2026-02-07T14:00:16Z",
      "title": "Social media flooded with posts about Savannah Guthrie’s missing mom",
      "url": "https://apnews.com/article/search-nancy-guthrie-social-media-posts-e176abcc670af3844416946fb3bb5619",
      "urlToImage": "https://dims.apnews.com/dims4/default/64ff69e/2147483647/strip/true/crop/1864x1242+0+293/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F21%2F53%2Fe8418ed0fd4094248466788e3acc%2F4d30ec82218f4fecb1bcac22c8467af0"
    },
    {
      "author": "Natalie Melzer",
      "description": "Israeli Prime Minister Benjamin Netanyahu will meet with U.S. President Donald Trump in Washington on Wednesday about the U.S. talks with Iran. Iran’s foreign minister threatened U.S. military bases in the region a day after indirect discussions in Oman. Netanyahu's office on Saturday said the prime minister believes that negotiations must include limiting Iran's ballistic missiles and ending its support for armed proxies. Friday's talks were on how to approach discussions over Tehran’s nuclear program. Trump called the talks “very good” and said more were planned for early next week. Concerns remain high about possible regional conflict.",
      "publishedAt": "2026-02-07T18:19:31Z",
      "title": "Netanyahu-Trump meeting about Iran scheduled for Wednesday",
      "url": "https://apnews.com/article/iran-israel-netanyahu-trump-washington-aad9f0290212fad4e9f81576f99becf2",
      "urlToImage": "https://dims.apnews.com/dims4/default/23c4cb0/2147483647/strip/true/crop/1280x853+0+42/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fbf%2F8922da45f4a10649f3947f0e4ef2%2Fd797c5e9c23d4da3a54dc19d322a097a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}