{
  "articles": [
    {
      "author": "AAMER MADHANI, TIA GOLDENBERG, ZEKE MILLER",
      "description": "President Donald Trump’s Middle East envoy Steve Witkoff says that a three to five year timeline for reconstruction of Gaza, as set out in a temporary truce agreement, is not viable. The U.S. administration reiterated its call on Tuesday for Arab nations to relocate displaced Palestinians in the war-torn territory. Witkoff said “it is unfair to explain to Palestinians that they might be back in five years.” He added that such a timeline is “preposterous.” The administration renewed its call on Arab nations to relocate displaced Palestinians as Trump is set to meet with Israeli Prime Minister Benjamin Netanyahu. Egypt and Jordan, as well other Arab nations, have rejected calls by Trump to relocate the territory’s 2.3 million Palestinians during post-war rebuilding.",
      "publishedAt": "2025-02-04T05:02:26Z",
      "title": "Trump envoy calls Gaza rebuilding timeline in Israel-Hamas truce 'preposterous'",
      "url": "https://apnews.com/article/trump-netanyahu-washington-ceasefire-1c8deec4dd46177e08e07d669d595ed3",
      "urlToImage": "https://dims.apnews.com/dims4/default/10c0012/2147483647/strip/true/crop/3561x2003+0+185/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F73%2F261701097e5bf920278eb42123cf%2F82252b5244164906b2302c8f396c5940"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "President Donald Trump has announced that the United States will withdraw from the U.N.’s top human rights body and will not resume funding for the U.N. agency helping Palestinian refugees. The U.S. left the Geneva-based Human Rights Council last year. And it stopped funding the agency assisting Palestinian refugees, known as UNRWA, after Israel accused it of harboring Hamas militants who participated in the attacks in southern Israel on Oct. 7, 2023, which UNRWA denies. Trump’s announcement Tuesday came on the day he met with visiting Israeli Prime Minister Benjamin Netanyahu, whose country has long accused both the rights body and UNRWA of bias against Israel and antisemitism.",
      "publishedAt": "2025-02-05T00:34:28Z",
      "title": "Trump announces withdrawal from UN human rights body and halt to funding for Palestinian refugees",
      "url": "https://apnews.com/article/trump-un-human-rights-palestinian-refugees-israel-05e1d57bbb41df38771d1ab69adb21a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/16413f1/2147483647/strip/true/crop/4883x2747+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F95%2F62506e1570751c41acdc794a7461%2Fd11d670e495d4205b980380e6607343a"
    },
    {
      "author": "MICHELLE L. PRICE, AAMER MADHANI, ZEKE MILLER",
      "description": "President Donald Trump says he’s given his advisers instructions to obliterate Iran if it assassinates him. Trump adds that \"there won’t be anything left” if Iran kills him. He made the remarks in an exchange with reporters Tuesday while signing an executive order calling for the U.S. government to impose maximum pressure on Tehran. The Justice Department announced in federal charges in November that an Iranian plot to kill Trump before the presidential election had been thwarted. The department alleged Iranian officials had instructed Farhad Shakeri, 51, in September to focus on surveilling and ultimately assassinating Trump. Shakeri is still believed to be at large in Iran.",
      "publishedAt": "2025-02-04T20:21:32Z",
      "title": "Trump says he's given advisers instructions for Iran to be 'obliterated' if it assassinates him",
      "url": "https://apnews.com/article/trump-iran-assassination-88c9b1a0754165125d59d378bf4af477",
      "urlToImage": "https://dims.apnews.com/dims4/default/68c4242/2147483647/strip/true/crop/3658x2058+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F53%2F36a0bf0e4e03d624ce6c4eb946e4%2F97fb492e00534bd084a905d98321f9d1"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "A sweeping new U.S. tariff on products made in China is expected to increase the prices American consumers pay for a wide array of products. An additional 10% tariff on all Chinese goods is likely drive up prices for ultra-cheap apparel sold on online shopping platforms, toys and electronic devices such as computers and cellphones. The tariffs also may affect how much consumers pay for shoes and kitchen items like pots and pans, as well as the big-ticket items, such as appliances, furniture and auto parts. The tariffs on Chinese imports took effect after President Donald Trump agreed to pause his threatened tariffs against Mexico and Canada for 30 days.",
      "publishedAt": "2025-02-04T23:54:48Z",
      "title": "Fast fashion, laptops and toys are likely to cost more due to US tariffs on Chinese imports",
      "url": "https://apnews.com/article/china-tariffs-trump-shein-temu-023aaee8f043605e62a614eaa5134f62",
      "urlToImage": "https://dims.apnews.com/dims4/default/602480e/2147483647/strip/true/crop/3277x1843+0+171/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fbc%2Fa5ac2e65c44685ba32e2176026fa%2F6031654009fc46f6a2671c0fcce614d8"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "At least 10 people including the gunman have been killed at an adult education center in what Sweden’s prime minister called the country’s “worst mass shooting.” But a final death toll, a conclusive number of wounded and a motive hadn’t yet been determined hours later. Prime Minister Ulf Kristersson gave a news conference in Stockholm in the aftermath of Tuesday's tragedy on the outskirts of Orebro. The city is located about 200 kilometers or 125 miles west of Stockholm. The school serves students over age 20. Primary and upper secondary school courses are offered as well as Swedish classes for immigrants, vocational training and programs for people with intellectual disabilities.",
      "publishedAt": "2025-02-04T13:07:58Z",
      "title": "Sweden shooting: About 10 killed at adult education center",
      "url": "https://apnews.com/article/sweden-shooting-adult-education-center-6be99a59fa3404ae296589e60c881f6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2a54371/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F5a%2Fb23a69127d8ac026e6cfed800181%2Fd2c22f4b74f043bba6413572af8b3e72"
    },
    {
      "author": "JUSTIN KABUMBA, JEAN-YVES KAMALE",
      "description": "Congo’s government has described the unilateral ceasefire declared by Rwanda-backed rebels in eastern Congo as “false communication,” while the United Nations on Tuesday noted reports of heavy fighting with Congolese forces in the region. The M23 rebels on Monday announced the ceasefire on humanitarian grounds after pleas for the safe passage of aid and hundreds of thousands of displaced people. But “all we are waiting for is the withdrawal of the M23,” Congo’s government spokesperson told journalists. The M23 last week seized control of Goma, a city of 2 million people at the heart of a region home to trillions of dollars in mineral wealth.",
      "publishedAt": "2025-02-04T20:27:29Z",
      "title": "Congo calls rebels' ceasefire declaration 'false communication' as reports of fighting continue",
      "url": "https://apnews.com/article/congo-rebels-goma-m23-rwanda-ceasefire-24470048e1382a787131ce81d1ee7c5a",
      "urlToImage": "https://dims.apnews.com/dims4/default/305df40/2147483647/strip/true/crop/6814x3833+0+355/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F89%2Fd07504c120e260eb5884af022d81%2Fe54c0666269f4ba08e96659002fc3bcf"
    },
    {
      "author": "ELLEN KNICKMEYER, MATTHEW LEE",
      "description": "The Trump administration is placing U.S. Agency for International Development direct-hire staffers around the world on leave, except those deemed essential. A notice posted online Tuesday gives the workers 30 days to return home, upending the aid agency’s six-decade mission overseas. The move had been rumored for several days and was the most extreme of several proposals considered for consolidating the agency into the State Department. Thousands of USAID employees already have been laid off and programs worldwide shut down after President Donald Trump imposed a sweeping freeze on foreign assistance after taking office.",
      "publishedAt": "2025-02-05T02:33:59Z",
      "title": "USAID direct hires put on leave worldwide",
      "url": "https://apnews.com/article/trump-usaid-layoffs-7e0a159d8a419c4c9388ab02e8259f23",
      "urlToImage": "https://dims.apnews.com/dims4/default/6a6ec37/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2F9d%2F34f9adb0c79bcedd527f30260849%2Fc9c1e4f1efdf4bc1936bc6e4811af535"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "When Donald Trump started the biggest trade war since the 1930s in his first term, his impulsive combination of threats and import taxes on U.S. trading partners created chaos, generated drama -- and drew criticism from mainstream economists who favor free trade. But it didn’t do much damage to the U.S. economy. Or much good. The trade war sequel that Trump has said he’s planned for his second term could likely be costlier. Trump seems to have grander ambitions and is operating in a far more treacherous economic environment, one in which his tariffs risk rekindling inflation.",
      "publishedAt": "2025-02-04T21:06:11Z",
      "title": "Trump’s tariff tactics carry higher economic risks than during his first term",
      "url": "https://apnews.com/article/trump-tariffs-trade-inflation-mexico-china-canada-5e0cad1ba2d9ec086ddf8999b0807dff",
      "urlToImage": "https://dims.apnews.com/dims4/default/939bc37/2147483647/strip/true/crop/5773x3247+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F48%2F7bb0906befc0bd8bcaeea4399183%2F6fe503578d3c40e7bfd8dfc83c2d9eb7"
    },
    {
      "author": "ASHOK SHARMA",
      "description": "Thousands are voting in the Indian capital’s state legislature election, with Prime Minister Narendra Modi’s Hindu nationalist party trying to unseat a powerful regional group that has ruled New Delhi for over a decade. Modi’s Bharatiya Janata Party is pitted against the Aam Aadmi Party, led by Arvind Kejriwal, which runs Delhi and has built a vast support base on its popular welfare policies and an anti-corruption movement. Kejriwal’s party won 62 out of 70 seats in the last election in 2020. leaving BJP with only eight seats. Voting ends on Wednesday, with results due on Saturday.",
      "publishedAt": "2025-02-05T03:10:09Z",
      "title": "Delhi election: Voting begins as BJP seeks to oust AAP out of power",
      "url": "https://apnews.com/article/thousands-voting-indian-capital-state-legislature-5121784eb5ad7b3e110bcd097eeec15d",
      "urlToImage": "https://dims.apnews.com/dims4/default/a29f611/2147483647/strip/true/crop/5712x3213+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2Ff3%2F20a46f8cef86e7d3b78fc2a3945f%2Ff97010146dc4489c9b45d7f098661785"
    },
    {
      "author": "SERKAN GURBUZ, MARYCLAIRE DALE",
      "description": "The remains of all 67 victims of the midair collision near Reagan National Airport have been recovered. Officials say the chief medical examiner is still trying to positively identify one set of remains. Tuesday's update comes as crews continue to remove debris from the Potomac River, where a passenger jet and Army helicopter collided Wednesday. The NTSB says it is examining new data that could put the helicopter above its 200-foot flight ceiling. Investigators say they need to get more information from the still-submerged Black Hawk to verify the data.",
      "publishedAt": "2025-02-04T15:28:03Z",
      "title": "Authorities recover remains of all 67 victims from DC plane crash",
      "url": "https://apnews.com/article/washington-plane-crash-helicopter-recovery-7f492db9e867af2e184d621f56cbc4f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/067420c/2147483647/strip/true/crop/2869x1614+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F41%2F966b5f9b3188c48f10c918743e34%2F793752df6fd24a0dadb846f5c5be4284"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}