{
  "articles": [
    {
      "author": null,
      "description": "Hospital officials and witnesses say Israeli forces have killed at least 23 Palestinians seeking food in the Gaza Strip. The incident happened on Sunday as hungry crowds surged around aid sites. Desperation has gripped the territory, home to over 2 million people, amid warnings of famine due to Israel’s blockade and ongoing offensive. Witnesses described Israeli troops opening fire on crowds near distribution points. The Gaza health ministry also said six more Palestinian adults died of malnutrition-related causes in the Gaza Strip in the past 24 hours. Ninety-three children have also died of causes related to malnutrition since the war in Gaza started last year, it said.",
      "publishedAt": "2025-08-03T10:35:55Z",
      "title": "Israeli forces kill over 20 people seeking food in Gaza, witnesses and health officials say",
      "url": "https://apnews.com/article/mideast-wars-gaza-israel-aid-famine-f1653318afd36b1b11090a4402233705",
      "urlToImage": "https://dims.apnews.com/dims4/default/e85e381/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F8f%2F7623f76169565b7ad76839275c25%2F43ab38e0c2514b15a778e6be82c158c6"
    },
    {
      "author": null,
      "description": "Ukraine’s anti-corruption agencies say they uncovered a major bribery scheme involving inflated military procurement contracts, just two days after lawmakers restored the agencies’ independence following a public outcry. In a statement late on Saturday, they said a lawmaker, local officials, and National Guard members took kickbacks worth up to 30% on overpriced contracts for drones and electronic warfare gear. Four people have been arrested. President Volodymyr Zelenskyy called the scheme “absolutely immoral” and praised investigators. The exposure follows parliament’s reversal of a controversial move by Zelenskyy to curb the agencies’ powers.",
      "publishedAt": "2025-08-03T10:01:39Z",
      "title": "Ukraine anti-corruption agencies uncover drone graft scheme",
      "url": "https://apnews.com/article/russian-ukraine-war-corruption-law-graft-drone-02aaa100244f82f41fea68c6b727e6a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/06ada7c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2F73%2F7a7c446343aa8b06208cda8f10de%2Fb3406653f9ba4762976ddfcbdacf7e3d"
    },
    {
      "author": null,
      "description": "Russian officials say a Ukrainian drone attack on an oil depot near Russia’s Black Sea resort of Sochi has sparked a major fire. On Sunday, more than 120 firefighters worked to extinguish the blaze after debris from a downed drone hit a fuel tank. Russia’s civil aviation authority temporarily stopped flights at Sochi’s airport. Russia’s Defense Ministry said its air defenses shot down 93 Ukrainian drones. Meanwhile, the Ukrainian air force said Russia launched 76 drones and seven missiles against Ukraine. A Russian missile strike hit a residential area in the southern city of Mykolaiv, wounding seven people, according to Ukraine's State Emergency Services.",
      "publishedAt": "2025-08-03T08:01:11Z",
      "title": "Ukrainian drone attack sparks massive fire at Russian oil depot near Sochi",
      "url": "https://apnews.com/article/russia-ukraine-war-depot-drones-missiles-ceasefire-1bf8440535e8fa32bc66310ea37658d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A poll from The Associated Press-NORC Center for Public Affairs Research finds that many Democrats see their political party as “weak” or “ineffective.” The survey also finds deep pessimism within Democratic ranks. Republicans are more complimentary of their party, although a small but significant share describe the GOP as “greedy,” “for the rich” or “generally bad.” The poll asked people to share the first word or phrase that came to mind when they thought of the parties. Answers were sorted into broad categories. Overall, U.S. adults held a dim view of both parties, with about 4 in 10 using negative attributes, including words such as “dishonest” or “stupid.”",
      "publishedAt": "2025-08-03T11:24:56Z",
      "title": "Many Democrats see party as 'weak' or 'ineffective,' poll finds",
      "url": "https://apnews.com/article/ap-poll-democrats-republican-political-parties-d41141f4a0af53c223620af0fc3fc319",
      "urlToImage": "https://dims.apnews.com/dims4/default/e01ef48/2147483647/strip/true/crop/5715x3215+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2F74%2F13ae4c9819f85f0644cf20aa90ad%2F916bd3168ab84f53a4bb87be2608ada7"
    },
    {
      "author": null,
      "description": "Pope Leo XIV has urged over a million Catholic youths to spread their faith and enthusiasm as they return to 150 countries. This call came during a Mass on Sunday, closing a weeklong event for young Catholics. The gathering, part of the Jubilee of Youth, saw participants camping in fields southeast of Rome. The Vatican reported more than a million attendees, including 7,000 priests and 450 bishops. Despite rain, spirits remained high. Sadly, two young pilgrims died, and a third was hospitalized. The event is part of the Holy Year, expected to draw millions to the Vatican.",
      "publishedAt": "2025-08-03T08:18:54Z",
      "title": "Pope Leo XIV urges over 1 million Catholic young people to spread faith and enthusiasm",
      "url": "https://apnews.com/article/vatican-youth-leo-pope-pilgrims-jubilee-a988921aab57f3cfc05d5213d58b358c",
      "urlToImage": "https://dims.apnews.com/dims4/default/ddcfb89/2147483647/strip/true/crop/7436x4183+0+387/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F26%2F9a79409c12c904f3d0674578b9d9%2F1b62e0e0e6bb49c694a0843406f003a6"
    },
    {
      "author": null,
      "description": "An independent watchdog agency responsible for enforcing a law against partisan political activity by federal employees has opened an investigation into Jack Smith, the Justice Department special counsel who brought two criminal cases against then-candidate Donald Trump before his election to the White House last year. The Office of Special Counsel confirmed Saturday that it was investigating Smith on allegations he engaged in political activity through his inquiries into Trump. Smith was named special counsel by then-Attorney General Merrick Garland in November 2022 and his special counsel title is entirely distinct from the agency now investigating him. The office has no criminal enforcement power but does have the authority to impose fines and other sanctions for violations.",
      "publishedAt": "2025-08-02T19:35:58Z",
      "title": "Independent political watchdog investigates ex-Trump prosecutor Jack Smith",
      "url": "https://apnews.com/article/trump-jack-smith-investigate-cotton-special-counsel-f32b39962d7aee1cb87f71ea9fde13f5",
      "urlToImage": "https://dims.apnews.com/dims4/default/f48b5ca/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fb8%2F5b81c9cc95009ba2abfa90cc3f0b%2Facdedf177a93447fa79e987a4dd0171f"
    },
    {
      "author": null,
      "description": "A video showing the violent arrest of a Black college student in Florida has sparked calls for drivers to use cameras that show a view from inside their car. William McNeil Jr.'s dashboard-mounted cellphone captured footage of officers beating him during a February traffic stop. The footage, which went viral when posted online last month, shows officers smashing McNeil's window and hitting him, actions not clearly visible on police bodycams. Experts suggest that car cameras can offer a unique perspective and protect against false claims. The arrest has led to discussions about police accountability and the limitations of bodycams.",
      "publishedAt": "2025-08-03T03:57:22Z",
      "title": "Calls for in-car cameras grow after Florida student's brutal arrest video",
      "url": "https://apnews.com/article/william-mcneil-police-beating-video-jacksonville-driver-4243a4a87a89ae2ef99259144067c2e5",
      "urlToImage": "https://dims.apnews.com/dims4/default/74a4b2b/2147483647/strip/true/crop/5220x2936+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F3a%2F9b224eb89c6341942d82c391780c%2Fe370b3785e1a477ab4ab1cf599bf27f8"
    },
    {
      "author": null,
      "description": "A church in Nigeria's megacity of Lagos has become a community for people who are deaf. The energetic pastor preaches in sign language, and the vibrations of drums signal when to pray or kneel. The church and its handful of affiliates in Africa's most populous country was founded in the colonial era. An estimated 10 million of the population of 220 million are deaf or have difficulty hearing. But advocates struggle to ensure more infrastructure for deaf people and blame a lack of political will. Members call the church a haven, and its sign language lessons open the door to the wider world.",
      "publishedAt": "2025-08-03T05:02:07Z",
      "title": "Inside a Nigerian church where deaf people find faith and community",
      "url": "https://apnews.com/article/nigeria-deaf-church-lagos-religion-d49580a5e6fd011f40ea77cc96ffee1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/24c5392/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fcc%2F7daec33522dabf972bd94f257d12%2F6481f726cf844d7ead84d83d683dad7b"
    },
    {
      "author": null,
      "description": "The Senate is leaving Washington Saturday night for its monthlong August recess without a deal to advance dozens of President Donald Trump’s nominees. The chamber is calling it quits after days of contentious bipartisan negotiations and Trump posting on social media that Senate Democratic Leader Chuck Schumer can “GO TO HELL!” Without a deal in hand, Republicans say they may try to change Senate rules when they return in September to speed up the pace of confirmations. Trump has been pressuring senators to move quickly as Democrats blocked more nominees than usual this year, denying any quick unanimous consent votes and forcing roll calls on each one.",
      "publishedAt": "2025-08-03T01:10:05Z",
      "title": "Senate heads home with no deal to advance President Trump’s nominees",
      "url": "https://apnews.com/article/senate-confirmations-nominations-trump-schumer-thune-905a63d0046319eeb7c266d5e24e70b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ec3dc7/2147483647/strip/true/crop/5591x3145+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fc2%2F114e2e8246f34fa526f714e2e6ff%2F12c589ee81bc4254ba759fa2dd185ed6"
    },
    {
      "author": null,
      "description": "Léon Marchand has broken one world record already in the 200-meter individual medley. He’ll try for a second on Sunday in the 400 IM on the closing day of the swimming world championships. He set that record two years ago in the worlds in Fukuoka, Japan. It would be Marchand's second gold in Singapore where he’s swimming a reduced schedule after winning four individual golds a year ago at the Paris Olympics. The Americans have several gold-medal chances in Sunday’s eight finals. Among them: world-record holder Bobby Finke in the 1,500 free, and the men’s and women’s 4x100 medley relays.",
      "publishedAt": "2025-08-03T05:34:14Z",
      "title": "Léon Marchand tries to break his second world record in Singapore",
      "url": "https://apnews.com/article/worlds-marchand-mcintosh-american-relays-155d536777e4b0bdad902e55f0e3f996",
      "urlToImage": "https://dims.apnews.com/dims4/default/50ec3d0/2147483647/strip/true/crop/5527x3109+0+288/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F82%2F4090ba7f970af96fc23d9cc315c8%2F9efb0ec1a7cf4169a8653205f789042f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}