{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — Rep. Adam Schiff, prominent California Democrat who is running for Senate, calls for Biden to withdraw from election.",
      "publishedAt": "2024-07-17T17:57:57Z",
      "title": "Rep. Adam Schiff, prominent California Democrat who is running for Senate, calls for Biden to withdraw from election",
      "url": "https://apnews.com/0d2872429c8c69bfd0a89ebd50fb421e",
      "urlToImage": ""
    },
    {
      "author": "DARLENE SUPERVILLE, AMELIA THOMSON-DEVEAUX and EMILY SWANSON",
      "description": "WASHINGTON (AP) — Nearly two-thirds of Democrats say President Joe Biden should withdraw from the presidential race and let his party nominate a different candidate, according to a new poll, sharply undercutting his post-debate claim that “average Democrats” are still with him even if some “big names” are turning on him.",
      "publishedAt": "2024-07-17T15:05:52Z",
      "title": "Nearly two-thirds of Democrats want Biden to withdraw, new AP-NORC poll finds",
      "url": "https://apnews.com/59eebaca6989985c2bfbf4f72bdfa112",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dde76108f51741858901c912283b71c0/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Democrats intend to hold a virtual vote to formally make President Joe Biden their nominee in the first week of August, pushing ahead with plans to do so before the party's convention opens in person two weeks later — even amid intensifying calls from some in the party for him to bow out of the race.",
      "publishedAt": "2024-07-17T14:33:53Z",
      "title": "Democrats aim to nominate president in first week of August, as some push Biden to quit the race",
      "url": "https://apnews.com/ac84492b500ab3fd972076b592113e5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5eba643640a4f0d832798cf67fe3342/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The Department of Homeland Security's inspector general said Wednesday it has opened an investigation into the Secret Service’s handling of security for former President Donald Trump on the day a gunman tried to assassinate him at a Pennsylvania rally.",
      "publishedAt": "2024-07-17T12:39:19Z",
      "title": "Homeland Security inspector general investigates Secret Service handling of security at Trump rally",
      "url": "https://apnews.com/045449b3e8f3ab7326cb779f416f83fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f7a9e9e6da54f0c8ac87c4bfbf2f972/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The third day of the Republican National Convention kicks off Wednesday with Republicans — led by the newly nominated Donald Trump and his running mate, U.S.",
      "publishedAt": "2024-07-17T11:36:13Z",
      "title": "2024 Election Latest: Former Trump adviser Peter Navarro to speak at RNC, AP source says",
      "url": "https://apnews.com/97203d4736a4bf3e919442d95a925957",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23145d1f48ef44508a7ed842e5301043/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — “The Bear” went on a tear at Wednesday morning’s Emmy nominations with a comedy-series record 23, and “Shogun” led all nominees with 25 in a dominant year across categories for FX.",
      "publishedAt": "2024-07-17T04:05:35Z",
      "title": "'Shogun' leads all Emmy nominees with 25 and 'The Bear' sets comedy series record with 23",
      "url": "https://apnews.com/9fb103d953536e223a35e5f4bfd0e1db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d0ca92247a24cecb3f2110338e2189a/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. Navy has exonerated 256 Black sailors who were found to be unjustly punished in 1944 following a horrific port explosion that killed hundreds of service members and exposed racist double standards among the then-segregated ranks.",
      "publishedAt": "2024-07-17T16:40:49Z",
      "title": "Navy exonerates 256 Black sailors unjustly punished in 1944 after a deadly California port explosion",
      "url": "https://apnews.com/df009fd75325758b15294e2fdad93729",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8a54f77204a4f07a17a5c9963a35d0c/2849.jpeg"
    },
    {
      "author": "ANDREW DeMILLO and ED WHITE",
      "description": "LITTLE ROCK, Ark. (AP) — Another wave of severe storms pummeled a wide swath of the United States and Canada, leading to flash floods and water rescues Wednesday in the Ozark Mountains, dropping a tornado that ravaged a town in upstate New York and stranding drivers in high water around Toronto.",
      "publishedAt": "2024-07-17T13:38:15Z",
      "title": "Storms flood the Ozarks and strand drivers in Toronto. New York town is devastated by tornado",
      "url": "https://apnews.com/7e42c3a1e418758313ea8e85800661ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b45c527123e481b9d14c8eab6d2d168/3000.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI and NAPAT KONGSAWAD",
      "description": "BANGKOK (AP) — Initial autopsy results showed traces of cyanide in the blood of six Vietnamese and American guests at a luxury hotel in central Bangkok and one of them is believed to have poisoned the others over a bad investment, Thai authorities said Wednesday.",
      "publishedAt": "2024-07-17T05:19:10Z",
      "title": "Traces of cyanide are found in the blood of Vietnamese and Americans found dead in a Bangkok hotel",
      "url": "https://apnews.com/795719445377c5be993a792aeba48586",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/118726de72d241d9a316b6d914fd6d7e/3000.jpeg"
    },
    {
      "author": "KIM COOK",
      "description": "There's a lot to be said for the work/play energy of a nice studio or other small apartment during the day. But how do you bring that energy down to get a good night's sleep?With electronics, cookery, clothes and books all in one space, it can be a challenge to create a restful refuge.",
      "publishedAt": "2024-07-17T12:29:29Z",
      "title": "Don't work in bed, and other tips for creating a peaceful sleep zone in a studio apartment",
      "url": "https://apnews.com/9a40c3ef86802779358a52d2e1e372a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f64e895b9e9849379fa3c610d46f0cac/1769.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}