{
  "articles": [
    {
      "author": null,
      "description": "Israel’s military warned people Thursday to evacuate the area around Iran’s Arak heavy water reactor. The warning came in a social media post on X. It included a satellite image of the plant in a red circle like other warnings that proceeded strikes. The Arak heavy water reactor is 155 miles southwest of Tehran. Heavy water helps cool nuclear reactors, but it produces plutonium as a byproduct that can potentially be used in nuclear weapons. That would provide Iran another path to the bomb beyond enriched uranium, should it choose to pursue the weapon. Iran had agreed under its 2015 nuclear deal with world powers to redesign the facility to relieve proliferation concerns.",
      "publishedAt": "2025-06-19T01:44:51Z",
      "title": "Israel’s military warns people to evacuate the area around Iran reactor",
      "url": "https://apnews.com/article/israel-iran-attacks-nuclear-news-06-19-2025-b508817b78ed8d2f6067c1516215cf94",
      "urlToImage": "https://dims.apnews.com/dims4/default/dfa1d67/2147483647/strip/true/crop/4559x2564+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F48%2F19d6eefc601712d491d66529a1e3%2Ffda40aab354741608927ef55ab17879d"
    },
    {
      "author": null,
      "description": "As Israeli strikes kill top Iranian generals, take out air defenses and damage nuclear sites, many wonder if President Donald Trump will deepen U.S. involvement in the conflict. Trump has long railed against what he refers to as the “stupid, endless wars” waged by his predecessors. That includes conflicts in Afghanistan and Iraq where the U.S. helped overthrow governments. Iran's government is looking increasingly fragile, and if the U.S. does get involved, its strikes could help severely damage the country’s nuclear program or even end its 4-decade-old theocracy. The recent history of U.S. attempts to remake the Middle East by force is one of costly blunders and colossal failures, and there are plenty of hard-earned lessons for anyone who wants to try it again.",
      "publishedAt": "2025-06-18T17:51:39Z",
      "title": "As Israel strikes Iran, many wonder if the US will intervene",
      "url": "https://apnews.com/article/israel-iran-conflict-us-history-military-intervention-397eec21eadeddf578bd1c7f7ddb334a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d28814d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fc3%2F0a37559187a1b3adec7617fd4aba%2F9de9ac237ac84c6eadf64301b36cd96e"
    },
    {
      "author": null,
      "description": "The Supreme Court has upheld Tennessee’s ban on gender-affirming care for transgender minors, a stunning setback to transgender rights. The justices’ 6-3 decision Wednesday effectively protects from legal challenges many efforts by President Donald Trump’s Republican administration and state governments to roll back protections for transgender people. Another 26 states have laws similar to the one in Tennessee. Chief Justice John Roberts writes for a conservative majority the law does not violate the Constitution’s equal protection clause, which requires the government to treat similarly situated people the same. Justice Sonia Sotomayor writes in a dissent joined by her liberal colleagues that the majority “abandons transgender children and their families to political whims.”",
      "publishedAt": "2025-06-18T14:16:57Z",
      "title": "Supreme Court deals stunning setback to transgender rights in Tennessee case",
      "url": "https://apnews.com/article/supreme-court-transgender-health-care-trump-79fc6f3bbdab2e92d6f0184201a468a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7383f15/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fce%2F4101bc6c62f9af0878b853d89b4a%2F5a0e5010145e46e9a0363399a79c13bf"
    },
    {
      "author": null,
      "description": "The U.S. National Hurricane Center says Hurricane Erick has strengthened into a Category 2 hurricane. Erick had maximum sustained winds of 100 mph on Wednesday afternoon as it churns Pacific Ocean near coastal southern Mexico. Erick is located about 105 miles south of Puerto Ángel and about 215 miles southeast of Punta Maldonado.",
      "publishedAt": "2025-06-18T11:58:49Z",
      "title": "Hurricane Erick now a Category 2 off Mexico's Pacific coast, forecasters say",
      "url": "https://apnews.com/article/hurricane-erick-tropical-storm-mexico-fc0cfb28b35b02f69225c89c85ad9c52",
      "urlToImage": "https://dims.apnews.com/dims4/default/ddaea6f/2147483647/strip/true/crop/3377x1900+0+176/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2F34%2Fb2a3149d380c78806fedf4a66111%2Ffdbacf5f0b9444558ea46fb01c2e009b"
    },
    {
      "author": null,
      "description": "Federal Reserve officials expect inflation to worsen in the coming months but they still foresee two interest rate cuts by the end of this year, the same as they projected in March. The Fed kept its key rate unchanged for the fourth straight meeting Wednesday, and said the economy is expanding at “a solid pace.” Fed chair Jerome Powell and other officials have underscored that they are holding off from any changes to their key rate because of the uncertainty surrounding the impact of the tariffs and economic outlook. Many of the Fed’s policymakers have expressed particular concern that the duties could boost prices, creating another surge of inflation just a couple of years after the worst inflation spike in four decades.",
      "publishedAt": "2025-06-18T10:00:39Z",
      "title": "Federal Reserve unlikely to cut interest rates",
      "url": "https://apnews.com/article/inflation-interest-rates-fed-fa91e7b38ca858ff54f57bc642111188",
      "urlToImage": "https://dims.apnews.com/dims4/default/813f3c9/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fed%2Fc793c58e1b6affae452939e359f0%2F914a08e2ab6f4f8a8d3ee76c008c3dbb"
    },
    {
      "author": null,
      "description": "Jurors in the murder trial of Karen Read say they’ve reached a verdict in a divisive case about the death of a Boston police officer that lawyers have presented as either a tragic love story or a sinister cover-up. Read is accused of fatally striking her boyfriend, Boston police officer John O’Keefe, with her SUV and leaving him to die in the snow outside a house party where other local police and a federal agent were closing out a night of drinking in 2022. If convicted on the most serious charge, she faces life in prison. Jurors began deliberating on June 13 after weeks of often heated testimony from both sides.",
      "publishedAt": "2025-06-18T18:47:16Z",
      "title": "Jury reaches verdict in Karen Read murder trial over death of Boston police boyfriend",
      "url": "https://apnews.com/article/karen-read-murder-trial-police-massachusetts-e636f03f40f3c03f24338d5ba7d40bd1",
      "urlToImage": "https://dims.apnews.com/dims4/default/bab34da/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F87%2Fe24a3672a39091efe0ac2669f712%2F8890c0660c1249f99bf2ab2348a93248"
    },
    {
      "author": null,
      "description": "The Food and Drug Administration has approved the world’s only twice-a-year shot to prevent HIV. In two groundbreaking studies, Gilead Sciences’ shot nearly eliminated new infections in people at high risk of HIV. Wednesday’s approval marks the first step in an anticipated global rollout that experts say could protect millions — if they can get access. Drastic cuts to public health in the U.S. and abroad cloud the prospects.",
      "publishedAt": "2025-06-18T18:52:48Z",
      "title": "FDA approves lenacapavir as a twice-a-year shot to prevent HIV",
      "url": "https://apnews.com/article/hiv-prevention-shot-lenacapavir-gilead-80fb37e2c5ac9b452488d7b86a10d568",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1cf1cf/2147483647/strip/true/crop/4746x2670+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F5e%2Fa3b7192efff5f2323780db56bbaa%2Ff13ebd873e334bd69b0fc6b0819e035a"
    },
    {
      "author": null,
      "description": "The U.S. State Department says it’s restarting the suspended process for foreigners applying for student visas but says all applicants will now be required to unlock their social media accounts for review. The department says consular officers will be on the lookout for posts and messages that could be deemed hostile to the U.S., its government, culture, institutions or founding principles. In a notice made public Wednesday, the department said applicants who refuse to set their social media accounts to “public” and allow them to be reviewed may be rejected as the refusal could be a sign they are trying to evade the requirement or hide their online activity.",
      "publishedAt": "2025-06-18T20:25:04Z",
      "title": "US resumes visas for foreign students but demands social media access",
      "url": "https://apnews.com/article/student-visas-trump-social-media-6632a2c585245edcd6a63594345dd8c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/c4db25b/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Fcb%2F370ade1d2a78a955c340e12c247e%2Faba8f400e5564b35a7391e5d1f897ca7"
    },
    {
      "author": null,
      "description": "Emergency workers have pulled more bodies from the rubble of a nine-story Kyiv apartment building demolished by a Russian missile. The finds on Wednesday brought the death toll from the attack on the Ukrainian capital the previous day to 28. Authorities said that 23 of those killed were inside the building in one of Kyiv’s districts that took a direct hit and collapsed. It was the deadliest single attack on Kyiv so far this year. Russia fired more than 440 drones and 32 missiles in what Ukrainian President Volodymyr Zelenskyy said was one of the biggest bombardments of the war, now in its fourth year.",
      "publishedAt": "2025-06-18T12:26:50Z",
      "title": "Kyiv death toll rises to 28 after Russian missile attack",
      "url": "https://apnews.com/article/russia-ukraine-war-missile-apartment-building-3fdde58144b0f9b95e564bab53bead65",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d16abd/2147483647/strip/true/crop/1000x563+0+52/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fdd%2F9a289b4c5e1b19ef0f1326cac3de%2F724c5bb5d8174b789625d7ea44d66144"
    },
    {
      "author": null,
      "description": "The Buss family has agreed to sell the controlling stake of the Los Angeles Lakers to TWG Global CEO Mark Walter, doing so with a franchise valuation of $10 billion — the most ever for a professional sports franchise, a person with knowledge of the agreement said Wednesday. As part of the deal, Jeanie Buss — whose family has had control of the Lakers since her father bought the team in 1979 — intends to remain as governor, said the person, who spoke to The Associated Press on condition of anonymity because neither side immediately announced details.",
      "publishedAt": "2025-06-18T21:45:38Z",
      "title": "Buss family agrees to sell controlling stake of Lakers to Mark Walter for $10B, AP source says",
      "url": "https://apnews.com/article/los-angeles-lakers-sale-buss-walter-76c25e08bfe36d69c8bb8e0621dd1ead",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb20296/2147483647/strip/true/crop/2924x1645+0+153/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2Fc5%2Fe55a15f0d2ee8766cdd960820ca5%2F17fc435624534a129281707e269308e6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}