{
  "articles": [
    {
      "author": "TIA GOLDENBERG and JACK JEFFERY",
      "description": "TEL AVIV, Israel (AP) — Israel’s killing of Yahya Sinwar, Hamas’ top leader and the mastermind of the group’s Oct.",
      "publishedAt": "2024-10-17T20:44:38Z",
      "title": "Sinwar's killing opens up opportunity and much uncertainty for the war in Gaza",
      "url": "https://apnews.com/170b010299a62f679fe5ee7324a69ff5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de417777ff524b519c4d2d4f6a4a1f96/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Lebanon’s Hezbollah militant group said Friday it is entering a new phase in its fight against invading Israeli troops, as the region continued to reckon with Israel's claim that top Hamas leader Yahya Sinwar has been killed in a battle with Israeli forces in Gaza the previous day.",
      "publishedAt": "2024-10-18T06:59:12Z",
      "title": "Middle East latest: Hezbollah says its war with Israel is entering a new phase",
      "url": "https://apnews.com/45c743c656cb85410a2d2b2fc84d6934",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4c3670b73cc45f494718ef1edeb8e3f/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "GRAND RAPIDS, Mich. (AP) — Kamala Harris and Donald Trump will both be scouring for votes in Michigan on Friday as they try to lock down support in this key political battleground.",
      "publishedAt": "2024-10-18T04:16:06Z",
      "title": "Harris and Trump target Michigan as both parties try to shore up 'blue wall' votes",
      "url": "https://apnews.com/6b034753290276bfa96d7caf8f7639bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c40bf3c6b1645f38a5abbb27055186a/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "BERLIN (AP) — Germany honored U.S. President Joe Biden for his contribution to trans-Atlantic relations on Friday, ahead of his meetings with European allies on Russia’s war in Ukraine and the conflict in the Middle East.",
      "publishedAt": "2024-10-18T04:26:45Z",
      "title": "Germany honors Biden for his contribution to trans-Atlantic ties as the US election looms",
      "url": "https://apnews.com/047d46d4ef80804ebee515ee5d2d449c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b2e6dd4c7614473a5b8634bddd518ee/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "This year has seen President Vladimir Putin repeatedly brandish the nuclear sword, reminding everyone that Russia has the world’s largest atomic arsenal to try to deter the West from ramping up support for Ukraine.",
      "publishedAt": "2024-10-18T04:06:04Z",
      "title": "Russia flaunts its many doomsday weapons to keep the West from ramping up support for Ukraine",
      "url": "https://apnews.com/bf50d3155369cc0a5f12ef7805bf2340",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d13176ac35b54fd0993118523ade3c1e/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea's spy agency said Friday that North Korea has dispatched troops to support Russia's war against Ukraine, a development that could bring a third country into the war and intensify a standoff between North Korea and the West.",
      "publishedAt": "2024-10-18T08:59:17Z",
      "title": "South Korean intelligence says North has sent troops to aid Russia's war in Ukraine",
      "url": "https://apnews.com/9cd563c5570f68e9b314976009682810",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53464aa0ef4b44f2b991e5b413bf5faa/3000.jpeg"
    },
    {
      "author": "ALAN SUDERMAN and GARANCE BURKE",
      "description": "WASHINGTON (AP) — The Kremlin could not have asked for better publicity at a better time when Ben Swann, a self-described independent journalist who promotes conspiracy theories, released a 12-part video series he promised would reveal dark truths about Ukrainian President Volodymyr Zelenskyy.",
      "publishedAt": "2024-10-18T04:11:34Z",
      "title": "Right-wing influencers hyped anti-Ukraine videos made by a TV producer also funded by Russian media",
      "url": "https://apnews.com/9d4281756246b94eda05c478f3dac203",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16a84eb3119142a99663f07e3a3c2eef/2351.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and MICHAEL GRACZYK",
      "description": "HUNTSVILLE, Texas (AP) — The Texas Supreme Court halted Thursday night’s scheduled execution of a man who would have become the first person in the U.S. put to death for a murder conviction tied to a diagnosis of shaken baby syndrome.",
      "publishedAt": "2024-10-17T05:03:03Z",
      "title": "Texas Supreme Court halts execution of man in shaken baby case after lawmakers' last-minute appeal",
      "url": "https://apnews.com/1ef99c052cc1630785ac5d6e2edfc9cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4c61085458e4aabb97c97302c14e7e4/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "BUENOS AIRES, Argentina (AP) — The circumstances surrounding the death of ex-One Direction singer Liam Payne were suspicious and possibly involved drugs, though there was no sign of a third party being involved, Argentine prosecutors said Thursday.",
      "publishedAt": "2024-10-17T09:19:02Z",
      "title": "Argentine authorities probe what happened before Liam Payne's fatal fall from his hotel balcony",
      "url": "https://apnews.com/487239e4f0b938a6f350a7d2f14737e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7a47bfb1c0d4f019d644cafd5f82abd/1920.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — King Charles III and Queen Camilla arrived in Sydney on Friday for the first Australian visit by a reigning monarch in more than a decade, a trip that has rekindled debate about the nation’s constitutional links to Britain.",
      "publishedAt": "2024-10-18T00:20:43Z",
      "title": "King Charles III's visit rekindles Australia's debate on ending ties to the British monarchy",
      "url": "https://apnews.com/dcb4baf655f28fc20068c5991f09f28f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aeecc84fc39d47038ded0dc03ebc267f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}