{
  "articles": [
    {
      "author": "DANIEL KOZIN",
      "description": "CEDAR KEY, Fla. (AP) — Florida residents living in vulnerable coastal areas were ordered to pack up and leave as Hurricane Idalia gained steam in the warm waters of the Gulf of Mexico, and authorities warned of a “catastrophic storm surge and destructive winds” when the storm moves ashore Wednesday morning.",
      "publishedAt": "2023-08-30T04:37:06Z",
      "title": "Idalia predicted to hit Florida as Category 4 hurricane with 'catastrophic' storm surge",
      "url": "https://apnews.com/2136985ceea53f5deb600c43aeea1138",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9dc7e9fcd45e469192757bfe5b92a93a/1920.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — A Russian attack on Kyiv killed two people early Wednesday, Ukrainian officials said, while Russia accused Ukraine of launching what appeared to be the biggest drone attack on Russian soil since Moscow sent troops there 18 months ago.",
      "publishedAt": "2023-08-30T01:36:54Z",
      "title": "2 killed in Kyiv as Russia accuses Ukraine of biggest drone attack on its soil since fighting began",
      "url": "https://apnews.com/a9fc4ddad80a906e85aacca7354eb317",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e27f561cf2eb4f73afd2b5e132b4bffb/2000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — Crews in Hawaii have all but finished searching for victims of the deadliest U.S. wildfire in more than a century, authorities said Tuesday, and it is unclear how many people perished.",
      "publishedAt": "2023-08-30T01:09:46Z",
      "title": "Unclear how many in Lahaina lost lives as Hawaii authorities near the end of their search for dead",
      "url": "https://apnews.com/fb8592496f400e995266944ffb16a7e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9d216ecf26448e5922623a931f0cc58/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — Former Proud Boys national leader Enrique Tarrio is set to be sentenced on Wednesday for a failed plot to keep Donald Trump in power after the Republican lost the 2020 presidential election, capping one of the most significant prosecutions in the Jan.",
      "publishedAt": "2023-08-30T04:06:14Z",
      "title": "Ex-Proud Boys leader Enrique Tarrio to be sentenced for seditious conspiracy in Jan. 6 attack",
      "url": "https://apnews.com/1ab0567db6209a5a653beb4292ff6a91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca6410c1afb84c299ddef3c8f4eef105/2360.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "ATLANTA (AP) — Some Republicans in Washington and Georgia began attacking Fulton County District Attorney Fani Willis immediately after she announced the Aug.",
      "publishedAt": "2023-08-30T04:08:14Z",
      "title": "As Trump and Republicans target Georgia's Fani Willis for retribution, the state's governor opts out",
      "url": "https://apnews.com/2d3cc1b7f5a63e2c331daed85ee8b2e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c683b5870734de3996798ec0b48aeda/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — As John Eastman prepared to surrender to Georgia authorities last week for an indictment related to efforts to overturn the 2020 presidential election, he issued a statement denouncing the criminal case as targeting attorneys \"for their zealous advocacy on behalf of their clients.”",
      "publishedAt": "2023-08-29T17:52:42Z",
      "title": "Lawyers indicted with Trump say they were doing their jobs. But that may be a tough argument to make",
      "url": "https://apnews.com/95f5451f6b038c98db7bb14b1e0cd4e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/067e65ba79c640f9bf1dfa271ac32d85/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM and VALERIE GONZALEZ",
      "description": "JACKSONVILLE, Fla. (AP) — A campus security officer tipped off by observant students likely stopped the killer who fatally shot three people at a nearby Dollar General Store from carrying out his racist attack at Edward Waters University, the president of the historically Black institution said Monday.",
      "publishedAt": "2023-08-28T23:23:57Z",
      "title": "HBCU president lauds students, officer for stopping Jacksonville killer before racist store attack",
      "url": "https://apnews.com/4a4050c4f607c204be6fe0973954f0a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f419de6bd8ab46a394d03a31b4a230f1/3000.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM, GARY D. ROBERTSON and SARAH RANKIN",
      "description": "CHAPEL HILL, N.C. (AP) — A University of North Carolina graduate student walked into a classroom building, shot his faculty adviser and quickly left, authorities said a day after the attack paralyzed campus as police searched for the gunman.",
      "publishedAt": "2023-08-29T05:13:59Z",
      "title": "University of North Carolina graduate student left building right after killing adviser, police say",
      "url": "https://apnews.com/a5eb7268934f7f416b7cfa2e2e3e24db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25dac38cd0784a45b0e41377857ef211/1920.jpeg"
    },
    {
      "author": "SONIA PÉREZ D.",
      "description": "GUATEMALA CITY (AP) — Guatemala’s Aug. 20 presidential election has been bogged down in court and legal challenges despite the fact the results were clear: Progressive candidate Bernardo Arévalo won about 61% of the vote to conservative Sandra Torres’ 39%.",
      "publishedAt": "2023-08-29T20:15:48Z",
      "title": "Guatemala's president-elect faces legal challenges that seek to weaken him. Here's what's happening",
      "url": "https://apnews.com/f7e64b92d7cb76490f71211c129b8e9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d85163f5aca34f0bb47d580eec5b2d22/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, TOM MURPHY and AMANDA SEITZ",
      "description": "WASHINGTON (AP) — President Joe Biden touted the potential cost savings of Medicare's first-ever price negotiations for widely used prescription drugs on Tuesday as he struggles to convince Americans that he’s improved their lives as he runs for reelection.",
      "publishedAt": "2023-08-29T04:05:07Z",
      "title": "10 drugs targeted for Medicare price negotiations as Biden pitches cost reductions",
      "url": "https://apnews.com/2bf6775c3431111a2cd03fd033caefa7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b876418f8ff404eaec0ab42a4231c87/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}