{
  "articles": [
    {
      "author": null,
      "description": "Two top Federal Reserve officials could dissent from the central bank’s likely decision Wednesday to hold its key interest rate steady, a sign of division reflecting the economy's muddy outlook as well as the jockeying to replace Chair Jerome Powell when his term ends next year. The division could be a preview of what might happen if President Donald Trump appoints a replacement who pushes for the much lower interest rates the White House desires. Other Fed officials could push back if a future chair sought to cut rates by more than economic conditions support.",
      "publishedAt": "2025-07-29T21:58:25Z",
      "title": "Fed unlikely to cut benchmark interest rates, though economic policy schism emerges",
      "url": "https://apnews.com/article/federal-reserve-powell-trump-rates-99d90bab1ba2faa0fc5d4a6106125da7",
      "urlToImage": "https://dims.apnews.com/dims4/default/9044310/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F1a%2F79ff573681a5ce73c0fa6ff6c5f6%2Fdc00ce3dbbed4b53a574746a6bce3d96"
    },
    {
      "author": null,
      "description": "President Donald Trump says he'll impose a 25% tariff on goods from India, plus an additional import tax because of India’s purchasing of Russian oil. Trump said on Truth Social on Wednesday that India “is our friend” but its “Tariffs are far too high” on U.S. goods. The Republican president added that India buys military equipment and oil from Russia, which Trump said has enabled the war in Ukraine. As a result, he intends to charge an additional “penalty” starting on Friday as part of the launch of the administration’s revised tariffs on multiple countries.",
      "publishedAt": "2025-07-30T12:24:06Z",
      "title": "Trump announces 25% tariff on India starting Aug. 1",
      "url": "https://apnews.com/article/trump-tariffs-russia-india-9e388a55583e7007149819c52f0fd71b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4ed020/2147483647/strip/true/crop/7100x3994+0+370/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F3b%2F521ff22ecfbb86aedf3d246cce05%2F9cea479dd8ba45378e86a4f1a53de9a3"
    },
    {
      "author": null,
      "description": "Japan’s meteorological agency says that a powerful earthquake has hit near Russia’s Kamchatka Peninsula and issued a tsunami advisory for Japan. The agency said the quake registered a preliminary magnitude of 8.0 when it hit early on Wednesday. It issued an advisory for a tsunami of up to 1 meter (yard) along the Pacific coast of Japan. The quake was about 250 kilometers (160 miles) away from Hokkaido and was felt only slightly. That's according to Japan’s NHK television. So far no damage has been reported. A tsunami watch, which is a relatively low-level warning, has been issued for Hawaii.",
      "publishedAt": "2025-07-29T23:59:58Z",
      "title": "Japan says powerful quake has hit near Russia’s Kamchatka Peninsula, issues a tsunami advisory",
      "url": "https://apnews.com/article/japan-russia-kamchatka-earthquake-tsunami-warning-a88cbe8a1e985cff54dc0ad849ea5ddb",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The Trump administration is pushing for Americans to upload personal health data to new apps run by private tech companies. This initiative aims to make accessing health records easier. Leaders from over 60 companies, including Google and Amazon, are meeting at the White House later Wednesday to discuss a \"digital health ecosystem.\" The system will focus on diabetes, weight management, and digital tools for patient check-ins. Officials promise privacy and security, but experts warn of ethical concerns. Patients must opt in to share data, digital privacy advocates are skeptical that patients will be able to count on their data being stored securely.",
      "publishedAt": "2025-07-30T17:01:19Z",
      "title": "US is launching new private health tracking system with Big Tech's help",
      "url": "https://apnews.com/article/trump-ai-rfk-jr-health-tech-fa73703bd1fd557c787ef0b590e151f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/50cffab/2147483647/strip/true/crop/5837x3283+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2Fa8%2F91b7c440a94d37cbb76f740ac80d%2F1deddb91862c48c9a4e585326d96ce5a"
    },
    {
      "author": null,
      "description": "At least 46 Palestinians were killed in Israeli fire in the Gaza Strip since Tuesday evening, according to local hospitals. The dead include more than 30 who were killed while seeking humanitarian aid, hospitals said, who treated dozens of people wounded in the incidents. The Israeli military did not immediately comment on any of the strikes, but says it only targets militants and blames civilian deaths on Hamas because the militants operate in densely populated areas.",
      "publishedAt": "2025-07-30T10:55:47Z",
      "title": "At least 46 Palestinians killed by Israeli fire, Gaza hospitals say, as the war drags on",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-07-30-2025-9b9b516f22e61bd1dde879733fdd97aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/a4b757a/2147483647/strip/true/crop/3240x1823+0+169/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F71%2Feb85f7654c0406a3a2cb0a4190ba%2F70098596cf644c24a7c4c6bcbf7b776a"
    },
    {
      "author": null,
      "description": "The Justice Department says in support of its request to unseal grand jury transcripts of proceedings that led to the sex trafficking indictments of New York financier Jeffrey Epstein and British socialite Ghislaine Maxwell they include the testimony of just two law enforcement witnesses. Officials describe the witnesses in a memorandum filed Tuesday in Manhattan federal court in response to a call from judges for more details about the unsealing request. The request came after the Justice Department enraged some of President Donald Trump’s supporters by announcing it would not be making public any more Epstein files. Epstein died in jail in 2019 before trial. Maxwell is serving a 20-year prison sentence in Florida.",
      "publishedAt": "2025-07-30T10:58:27Z",
      "title": "Epstein and Maxwell grand juries heard from 2 law enforcement witnesses",
      "url": "https://apnews.com/article/epstein-maxwell-grand-jury-transcripts-trump-d7b6be64eb7cf79de765d7870069e780",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "Investigators are piecing together more details about how a former high school football player who blamed the game for his mental health problems carried out a deadly attack on an office building that is home to the NFL. Authorities say Shane Tamura killed four people on Monday before killing himself. Officials say he had a handwritten note claiming he had chronic traumatic encephalopathy, known at CTE, and accused the league of hiding the dangers of brain injuries linked to contact sports. Investigators plan to question a man who supplied gun parts for the AR-15-style rifle used in the attack, including the weapon’s lower receiver.",
      "publishedAt": "2025-07-30T04:01:20Z",
      "title": "Officials work to find background and motive for gunman in NYC shooting",
      "url": "https://apnews.com/article/new-york-city-office-shooting-36fe5e858062f6a6d687c466ce865763",
      "urlToImage": "https://dims.apnews.com/dims4/default/6de3fb7/2147483647/strip/true/crop/4303x2420+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F47%2Fbb21897db1dab3aa6a95b1c286d6%2F2acd855d82ff41b4a0effae02c773b3f"
    },
    {
      "author": null,
      "description": "The National Transportation Safety Board has started investigative hearings on the deadly midair collision over Washington in January. The crash involved a passenger plane and an Army helicopter, killing 67 people. The hearings aim to explore how the actions of the Federal Aviation Administration and the Army may have contributed to the crash. Investigations have already revealed issues like the FAA's failure to recognize near misses and the Army's helicopters flying without key locating equipment. U.S. Sen. Ted Cruz has proposed legislation to require all aircraft operators to use comprehensive location technology to prevent future incidents.",
      "publishedAt": "2025-07-30T04:04:04Z",
      "title": "Victims' families seek answers as NTSB launches Washington DC plane crash hearings",
      "url": "https://apnews.com/article/midair-collision-ntsb-washington-dc-army-helicopter-40f94a495e2e60b9adc5b9a49cce6437",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb355cb/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fbb%2Fa7db90286ec025ce47a9bf2c4887%2Faf36a3a095e84ecea8912f25494ff5af"
    },
    {
      "author": null,
      "description": "Officials say two kids and an adult died when a huge explosion tore through a Nebraska biofuels plant. Fremont Mayor Joey Spellerberg said at a news conference Wednesday, “Right now this has moved to a recovery effort.” Firefighters have battled smoke and flames smoldering in the wreckage for nearly a day. Spellerberg said the two children were waiting for the employee to get off work so they could go to a doctor’s appointment. He wasn’t sure of their exact ages but said both were under age 12. The blast happened at around noon Tuesday. Photos show the plant’s tall tower torn off, exposing mangled metal and ripped siding.",
      "publishedAt": "2025-07-30T14:07:48Z",
      "title": "Explosion at Nebraska biofuel plant killed 3 people, including 2 kids, officials say",
      "url": "https://apnews.com/article/fremont-nebraska-explosion-fire-horizon-biofuels-f6019cc7d3e35d62548dd31529cb010f",
      "urlToImage": "https://dims.apnews.com/dims4/default/99b5f54/2147483647/strip/true/crop/7348x4133+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F61%2F2373b8389f487a653ad0b3ed7276%2F53758b590ce24b9eb45756c5d48eb595"
    },
    {
      "author": null,
      "description": "An underwater voyage has revealed a network of creatures thriving at the bottom of deep-sea ocean trenches. Researchers traveling in a submersible along two trenches in the Pacific Ocean found tubeworms and mollusks flourishing at deep depths. The finding shows just how extensive these communities are in extreme environments. The tubeworms and mollusks get their energy from chemical reactions instead of photosynthesis, eating tiny microbes or snacking on the products of their labor. The new research was published Wednesday in the journal Nature.",
      "publishedAt": "2025-07-30T15:01:01Z",
      "title": "Scientists uncover tubeworms and mollusks in deep-sea trenches",
      "url": "https://apnews.com/article/deep-sea-trench-tubeworm-mollusk-420f54c29b7c8d132b02f22ca6679c4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/fa6a97f/2147483647/strip/true/crop/3584x2016+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2F12%2F4d51e7b6dba45642aa2d20326524%2Fbf92374e0ff5471c8ab7a45e39af45b5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}