{
  "articles": [
    {
      "author": "ELLEN KNICKMEYER",
      "description": "The Trump administration has presented a plan to dramatically cut staffing worldwide for U.S. aid projects as part of its dismantling of the U.S. Agency for International Development. The proposal would leave fewer than 300 workers out of 8,000 direct-hires and contractors. Two current USAID employees and one former senior USAID official told The Associated Press of the administration’s plan. It was presented to remaining senior officials of the agency Thursday. They spoke on condition of anonymity, in the face of a Trump administration order barring USAID staffers from talking to anyone outside their agency.",
      "publishedAt": "2025-02-06T23:36:31Z",
      "title": "Trump administration plans to slash all but a fraction of USAID jobs, officials say",
      "url": "https://apnews.com/article/trump-usaid-musk-doge-7ec0a2b4032d4782d41c00164003b5de",
      "urlToImage": "https://dims.apnews.com/dims4/default/93bc69b/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Ffb%2F66bc6073a232da6f984d266f61b0%2Fe579219cac9845c5a7200512ae172d09"
    },
    {
      "author": "KIMBERLEE KRUESI",
      "description": "The Trump administration’s decision to close the U.S. Agency for International Development has drawn widespread criticism from congressional Democrats. The move also raised questions about the influence billionaire ally Elon Musk wields over the federal government. The United States is the world’s largest source of foreign assistance by far, although several European countries allocate a much bigger share of their budgets. USAID funds projects in some 120 countries aimed at fighting epidemics, educating children, providing clean water and supporting other areas of development. The impact of the U.S. decision is hitting projects around the world, from efforts to preserve the Amazon rainforest to HIV prevention in South Africa and hospitals in war-ravaged Syria.",
      "publishedAt": "2025-02-05T18:27:29Z",
      "title": "A look at USAID's global impact as Trump moves to shut it",
      "url": "https://apnews.com/article/usaid-hiv-humanitarian-assistance-disease-spending-20f9cb969ffb6773e57886e34bf69165",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ad7e4c/2147483647/strip/true/crop/6520x3668+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F78%2F76065dbdd0b9f0c61e54580e7b32%2F09aba7f512d34dcaa5543d6c89750a1b"
    },
    {
      "author": "CHRIS MEGERIAN, COLLIN BINKLEY, BYRON TAU",
      "description": "A federal judge has blocked President Donald Trump’s plan to push out federal employees by offering them financial incentives. The decision Thursday comes hours before the midnight deadline for workers to apply for the program. U.S. District Judge George O’Toole Jr. in Boston sided with several labor unions that had requested a temporary restraining order against the plan orchestrated by Trump adviser Elon Musk. The Republican president is trying to downsize and reshape the federal workforce. The judge didn't express an opinion on the legality of the program. He scheduled a hearing for Monday and directed administration officials to extend the deadline to apply for the program until after the hearing.",
      "publishedAt": "2025-02-06T05:02:40Z",
      "title": "Federal workers debate legitimacy of buyout offer as deadline nears",
      "url": "https://apnews.com/article/buyout-offer-deadline-trump-federal-workers-ce854b19c41b90cd657f75cf09511e96",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad5835d/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F41%2Fcd50c4d3a03a9665ef5c4d941aa3%2Fae847ce1a1704b84b1dfd0696bf28f68"
    },
    {
      "author": "DAVE COLLINS",
      "description": "Democratic attorneys general in several states are vowing to file a lawsuit to stop Elon Musk’s Department of Government Efficiency from accessing federal payment systems containing Americans’ sensitive personal information. Thirteen attorneys general, including New York’s Letitia James, said in a statement issued Thursday that they were taking action in defense of the Constitution, people's right to privacy and essential funding that individuals and communities are counting on. Government officials and labor unions have been among those raising concerns about DOGE’s involvement with the payment system for the federal government. They say it could lead to security risks or missed payments for programs such as Social Security and Medicare.",
      "publishedAt": "2025-02-06T21:48:09Z",
      "title": "13 states to sue over DOGE access to government payment systems containing personal data",
      "url": "https://apnews.com/article/elon-musk-trump-doge-states-47912249bf4b79477cbe211565c9743c",
      "urlToImage": "https://dims.apnews.com/dims4/default/792a1ee/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F4b%2F2a922679318da2b2fe1757712380%2F43fb2bae60ee400097258000820369c5"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "Officials working with Elon Musk’s Department of Government Efficiency sought access to the Treasury Department payment system to stop money from flowing to the U.S. Agency for International Development. That's according to two people familiar with the matter who on Thursday spoke to The Associated Press on condition of anonymity for fear of retaliation. DOGE's efforts to stop USAID payments undermine assurances that Treasury gave to federal lawmakers in a letter Tuesday that it had “read-only access” to the government's payment system as part of an audit process.",
      "publishedAt": "2025-02-06T22:18:57Z",
      "title": "DOGE was tasked with stopping Treasury payments to USAID, sources say",
      "url": "https://apnews.com/article/treasury-doge-musk-read-only-access-489231c6db1a9f07fc68f9f08803f815",
      "urlToImage": "https://dims.apnews.com/dims4/default/894f4a1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F0e%2Fc63b0c1633cc100ea64f13f5bdf3%2F30be5dbe683347f091f020ea66b8212a"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "The Senate has confirmed Russell Vought, President Donald Trump’s nominee for White House budget director. He is planning to use one of the most powerful positions in federal government to zealously expand the president’s power. The Thursday night vote was planned after Democrats had exhausted their only remaining tool to stonewall a nomination — holding the Senate floor throughout the previous night and day with a series of speeches where they warned Vought was Trump’s “most dangerous nominee.” Vought’s return to the White House Office of Management and Budget, which he also helmed during Trump’s first term, would put him in a role that holds key power in implementing the president’s goals.",
      "publishedAt": "2025-02-06T21:08:59Z",
      "title": "Senate confirms Project 2025 architect Russell Vought as White House budget director",
      "url": "https://apnews.com/article/trump-russell-vought-confirmation-budget-project-2025-7d1c476694176876256e95cecbd49231",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c8d733/2147483647/strip/true/crop/5096x2867+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F80%2Ff4643d0064b101fc3949c3e258c9%2F636f8317a9234298a897a64f9900d89a"
    },
    {
      "author": "DAVID BAUDER",
      "description": "Federal government payments for subscriptions to media outlets have become the latest target of President Donald Trump's spending hawks. A day after his press secretary cited some $8 million in spending for Politico subscriptions, Trump dubbed it a “scandal” and online sleuths started looking for evidence of payments to other organizations like the New York Times and Associated Press. Said one Trump aide online: “The U.S. government must stop paying for media subscriptions.” But it's actually a long-running tradition, depended upon by governments around the world to help them keep up with what is going on. And, the AP noted, has been a staple of Democratic and Republican administrations.",
      "publishedAt": "2025-02-07T00:50:57Z",
      "title": "Trump promotes misleading claims about federal government’s media subscriptions",
      "url": "https://apnews.com/article/trump-media-payments-subscriptions-spending-365a0899a84fba1567e85bb83da1e06b",
      "urlToImage": "https://dims.apnews.com/dims4/default/831fe2b/2147483647/strip/true/crop/3473x1954+0+181/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2Fd9%2Fffababbc173cc979f959f2c2c837%2F0a3d4fa13a1f492e94c07d82ad800b3a"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "The Associated Press has obtained audio of what military officials say is a broadcast from a Russian spy ship that suffered a fire and drifted uncontrolled off Syria's coast last month. The NATO-nation military officials spoke to the AP on condition of anonymity to discuss the fire and radio transmission that Russian authorities haven’t publicly reported. The officials said a NATO-nation ship recorded the radio exchanges involving the Russian eavesdropping vessel Kildin. The audio provides an unusual peek inside Russia’s fleet of spy ships that NATO nations are watching closely. A retired French vice admiral said the blaze highlights logistical difficulties for Russia of maintaining naval forces in the Mediterranean.",
      "publishedAt": "2025-02-07T03:08:22Z",
      "title": "A Russian spy ship caught fire off Syria's coast, officials say. Here's audio of its broadcasts",
      "url": "https://apnews.com/article/russia-nato-spy-ship-audio-mediterranean-syria-2e6c4d6fa184d7333a3001344f2ea58c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e045cae/2147483647/strip/true/crop/2000x1125+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F5d%2F6b51f25bb925702ad5bb721df00e%2Ff0dd049708ff4438b4531eb5577a55f7"
    },
    {
      "author": "AIJAZ HUSSAIN, CHONCHUI NGASHANGVA",
      "description": "India’s Parliament was disrupted as opposition lawmakers protested alleged mistreatment of 104 Indian citizens deported by the United States. A U.S. military plane arrived Wednesday in a northern Indian city, the first such flight to the country under the Trump administration. Lawmakers and media reports say arms and legs were shackled on the aircraft, a common practice on U.S. deportation flights. Parliament’s proceedings were adjourned Thursday as lawmakers chanted slogans and sought a discussion about the flights. The Indian government says it is engaging U.S. officials to ensure there is no mistreatment.",
      "publishedAt": "2025-02-06T08:45:35Z",
      "title": "Opposition lawmakers protest alleged mistreatment of Indian deportees by US",
      "url": "https://apnews.com/article/indian-illegal-immigration-protest-parliament-deportation-trump-90ae7999040196e3ce25dd3fa8e29137",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ea1b04/2147483647/strip/true/crop/4482x2521+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F7c%2F620fa842a2acc3ba8280b5492052%2F4134a41d873e43c591e397475ace6837"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "The Trump administration is suing Chicago over what are known as sanctuary laws. The administration claims the nation’s third-largest city “thwarts” federal efforts to enforce immigration laws. The lawsuit filed Thursday is the latest effort to crack down on places that limit cooperation between federal immigration agents and local police. It follows the federal government’s threats of criminal charges and federal funding cuts to sanctuary cities. Illinois Democratic Gov. JB Pritzker says the state follows the law. President Donald Trump has often singled out Chicago and Illinois, which have some of the strongest sanctuary laws in the U.S.",
      "publishedAt": "2025-02-06T17:47:28Z",
      "title": "Trump administration sues Chicago in latest crackdown on 'sanctuary' cities",
      "url": "https://apnews.com/article/trump-immigration-chicago-arrests-sanctuary-immigrants-enforcement-df278eba554406c6703bb362d9b09844",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1ce697/2147483647/strip/true/crop/6363x3579+0+331/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2F44%2Faa595857af197ba9d36e3227ef6c%2Fb818f5c6510c43a6ab5a8d0febc5677b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}