{
  "articles": [
    {
      "author": null,
      "description": "Israeli troops have opened fire on Palestinians near food distribution hubs in southern Gaza, killing at least 32 people. Witnesses say the shootings happened Saturday as crowds approached centers run by the U.S.- and Israeli-backed Gaza Humanitarian Foundation. The foundation, established to replace U.N.-led aid efforts, claims Hamas diverts supplies, a charge the U.N. denies. Local health officials report hundreds have died near these hubs in recent months. Gaza faces a dire humanitarian crisis, with over 2 million residents on the brink of famine. The ongoing conflict has caused massive casualties and displacement, with no progress in ceasefire talks.",
      "publishedAt": "2025-07-19T09:08:38Z",
      "title": "Over 30 Palestinians killed trying to reach US group's food distribution sites, Gaza authorities say",
      "url": "https://apnews.com/article/israel-hamas-gaza-ghf-mideast-war-e3eead77195dc9c4dd07ac5fe640d00e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a09b987/2147483647/strip/true/crop/5108x2873+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Fc5%2Fadfaf9b6d45b1b697522493358d3%2Fd73c9bfec8d54b439ce020ed515a80fe"
    },
    {
      "author": null,
      "description": "Syria’s interim President Ahmad al-Sharaa has urged Sunni Bedouin tribes to honor a ceasefire aimed at ending deadly clashes with Druze-linked militias Sweida. The violence has left hundreds dead and drawn Israeli airstrikes targeting Syrian forces. Al-Sharaa blamed \"armed groups from Sweida” for reigniting the conflict on Thursday and criticized Israeli intervention. A separate U.S.-brokered ceasefire was announced early Saturday between Syria and Israel, but tensions remain high. Al-Sharaa emphasized unity, vowing to protect minorities and thanking the U.S. and Arab mediators for their support during Syria’s ongoing crisis.",
      "publishedAt": "2025-07-19T10:54:57Z",
      "title": "Syria's interim president urges Bedouin tribes to commit to ceasefire ending clashes with the Druze",
      "url": "https://apnews.com/article/syria-ahmad-sharaa-druze-bedouins-clashes-israel-1804408501f1de8e7a6050cafcad799f",
      "urlToImage": "https://dims.apnews.com/dims4/default/80a27ae/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F27%2F5e736cef5a2ec3c1ced34cd4e6cf%2F2d40a944638f44c68e6418f8e268dee0"
    },
    {
      "author": null,
      "description": "Russia has launched a massive overnight drone and missile attack on Ukraine, killing at least one person. Ukrainian President Volodymyr Zelenskyy said over 300 drones and 30 cruise missiles were fired during the attack overnight into Saturday, with Odesa heavily targeted. The city's mayor said one person died, and five were rescued from a fire in a high-rise building. Six others, including a child, were wounded. Critical infrastructure in the Sumy region was also damaged. Analysts note Russia has intensified its drone attacks, with barrages now surpassing previous records in scale and frequency.",
      "publishedAt": "2025-07-19T08:36:08Z",
      "title": "Russia pounds Ukraine with over 300 drones, killing 1 in Odesa",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-odesa-zelenskyy-621c5e482c5f5cb38d56b4be0c59d622",
      "urlToImage": "https://dims.apnews.com/dims4/default/b3b4ed4/2147483647/strip/true/crop/2000x1125+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F9d%2F1d62e85a6984403185e910c8bc4f%2Fbd2bb990ef3a4d1c857a2eefd176a82c"
    },
    {
      "author": null,
      "description": "Venezuela has released 10 jailed Americans in exchange for getting home scores of migrants deported by the United States to El Salvador months ago under the Trump administration’s immigration crackdown. The resolution represents a diplomatic achievement for Venezuelan President Nicolás Maduro and helps President Donald Trump in his goal of bringing home Americans jailed abroad. El Salvador will send back some 300 Venezuelan migrants whom the Trump administration agreed to pay $6 million to house in a notorious Salvadoran prison. The arrangement drew immediate blowback when Trump invoked an 18th century wartime law to quickly remove men his administration had accused of belonging to the violent Tren de Aragua street gang.",
      "publishedAt": "2025-07-18T20:04:43Z",
      "title": "Venezuela releases jailed Americans in swap for deported migrants",
      "url": "https://apnews.com/article/prisoner-swap-venezuela-united-states-el-salvador-a0c3070355fbdc31f028a16096c5655c",
      "urlToImage": "https://dims.apnews.com/dims4/default/678dead/2147483647/strip/true/crop/5190x2919+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F14%2Fe650656efe23b516bb1fc65c968c%2F86d355025ad3404fae12c826802af416"
    },
    {
      "author": null,
      "description": "Under intense pressure from President Donald Trump’s own supporters, his administration now says it will push a court to unseal secret documents related to Jeffrey Epstein’s case. It's an effort to put to rest for good a political crisis largely of the administration's own making. But even if those records eventually become public, it’s far from certain they will appease critics enraged over the administration’s unfulfilled promises of full transparency about the evidence against the wealthy financier. Meanwhile, the administration remains dogged by questions about its refusal to release other records in its possession.",
      "publishedAt": "2025-07-18T17:46:32Z",
      "title": "Trump administration seeks release of more Epstein records",
      "url": "https://apnews.com/article/trump-jeffrey-epstein-justice-department-bondi-91f911d2d7a909f78259cdca7b55d9a6",
      "urlToImage": "https://dims.apnews.com/dims4/default/192af96/2147483647/strip/true/crop/5776x3249+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F1f%2F00dcaaf0fa0f1cd71b471264fa01%2F29ee39764b114d3998767bf2b9741e99"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump’s tariff threat against Brazil has sparked political turmoil. Trump linked a 50% import tax to the trial of his ally, Brazil's former President Jair Bolsonaro, calling it a “witch hunt.” It hasn't helped Bolsonaro. Brazil’s Supreme Court has intensified his legal troubles, ordering house raids, an ankle monitor, and social media bans. Meanwhile, his successor, President Luiz Inácio Lula da Silva, has gained politically, with rising approval ratings and increased congressional support. Trump’s actions have united critics across Brazil, including business leaders and lawmakers, who see the tariffs as an attack on national sovereignty, boosting Lula’s political standing.",
      "publishedAt": "2025-07-19T05:00:47Z",
      "title": "Trump's tariff threat to save Brazil's ex-president Bolsonaro revives Lula's fortunes",
      "url": "https://apnews.com/article/brazil-lula-trump-popularity-16a7cdc30ffd1812c43d9c84d0572520",
      "urlToImage": "https://dims.apnews.com/dims4/default/7aba9f2/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F39%2Fc1a7036e5162cb2bf721bf7da798%2F6b48c38af38a456ca59ddbfe566bfbe2"
    },
    {
      "author": null,
      "description": "Congo and Rwanda-backed rebels have signed a declaration in Qatar to end decades of conflict in eastern Congo. The agreement announced Saturday includes a commitment to a permanent ceasefire and plans for a comprehensive peace deal within a month. It aims for the return of state authority in areas occupied by the rebels and a prisoner exchange program. A final agreement is expected by Aug. 18, aligning with a U.S.-facilitated peace accord between Congo and Rwanda in June. This marks the first direct commitment from both sides since rebels seized key cities in eastern Congo. The M23 rebel group, supported by Rwanda, is one of over 100 armed factions in the region. The U.N. calls this conflict one of the world’s worst humanitarian crises.",
      "publishedAt": "2025-07-19T09:22:25Z",
      "title": "Congo and Rwanda-backed rebels sign declaration of principles to end conflict in eastern Congo",
      "url": "https://apnews.com/article/congo-m23-rebels-peace-qatar-rwanda-f80166117d557991896ef89d4cd3a324",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6e8ae6/2147483647/strip/true/crop/3659x2058+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F43%2F1cabf0b75533f8d90cbe674b5580%2F5d7f27ebd0624194875e377d0f42266e"
    },
    {
      "author": null,
      "description": "The Los Angeles Fire Department reports a vehicle has driven into a crowd in East Hollywood, injuring over 20 people. The incident happened on Santa Monica Boulevard. Authorities said Saturday that up to five people are in critical condition, with 8 to 10 others seriously injured. Another 10 to 15 are reported to be in fair condition. Emergency responders are on the scene, and investigations are ongoing.",
      "publishedAt": "2025-07-19T10:43:14Z",
      "title": "Vehicle drives into crowd in East Hollywood, injuring more than 20",
      "url": "https://apnews.com/article/los-angeles-car-into-crowd-east-hollywood-74109553b3f12ded236dc4e2d72c919b",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Authorities are investigating a Southern California couple after their infant child was taken to a hospital with a traumatic head injury and 21 children were discovered in their custody. Many of the children were born by surrogate, and at least eight women have spoken out on social media about the couple aggressively pursuing them or misleading them in the surrogacy process. Charges have not been filed against Silvia Zhang and Guojun Xuan, but detectives are still investigating the couple for potential child abuse. The couple did not respond to phone calls and emails seeking comment.",
      "publishedAt": "2025-07-19T04:07:06Z",
      "title": "Surrogates speak out about California couple under investigation",
      "url": "https://apnews.com/article/california-couple-investigation-kids-surrogates-360635ce8dba2ff31f09506c15aa539a",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dc64e3/2147483647/strip/true/crop/5280x2970+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Fe0%2Fcc766dfc14b00d5235a08f08902d%2Fc8ee06289d964effbff7776729971bdb"
    },
    {
      "author": null,
      "description": "Artisans in South Sudan are turning discarded tires into affordable footwear as the country faces a severe economic crisis. Shoemaker Emmanuel Achuil, working in Wau, says demand for his durable sandals has surged due to rising living costs. Once serving a few customers every month, he now sells up to 20 pairs, priced around $4. South Sudan’s economy has been in decline for years, worsened by oil revenue disruptions and hyperinflation. Many struggle to afford basic goods, making tire sandals a practical choice. Achuil hopes to expand his business and train others, offering a lifeline in a struggling economy.",
      "publishedAt": "2025-07-19T01:58:57Z",
      "title": "South Sudanese artisans make shoes from discarded tires",
      "url": "https://apnews.com/article/south-sudan-economic-crisis-shoemakers-tires-ff00ee12a54f04aaa077ec01aa07b67f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a085162/2147483647/strip/true/crop/5464x3074+0+335/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2F76%2F84513baa083dc8c7143e64778666%2Fff81826257584eadab3ecf76d9496e65"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}