{
  "articles": [
    {
      "author": null,
      "description": "Israel said Thursday it would establish 22 new Jewish settlements in the occupied West Bank. They would include new settlements and the legalization of outposts already built without government authorization. Israel captured the West Bank in the 1967 Mideast war and the Palestinians want it to be the main part of their future state.",
      "publishedAt": "2025-05-29T05:17:05Z",
      "title": "Israel to establish 22 new Jewish settlements in West Bank",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-05-29-2025-f68c800d2f85933e5cb27e5d8ccd8742",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6f342/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ff1%2F01784acd98fe5fbb6381bbc362f0%2F419377a7ba8643cb87ee439505810f17"
    },
    {
      "author": "Michael Casey, Annie Ma",
      "description": "A federal judge has extended an order blocking the Trump administration’s attempt to bar Harvard University from enrolling foreign students. On Thursday, U.S. District Judge Allison Burroughs granted Harvard’s request for a preliminary injunction, blocking the government’s action until the case is decided. It had already been paused since last week, when Burroughs issued a temporary restraining order. Harvard sued the Department of Homeland Security after Secretary Kristi Noem revoked its ability to host foreign students at its campus in Cambridge, Massachusetts. On Wednesday, the Trump administration announced a new effort to revoke Harvard’s certification to enroll foreign students.",
      "publishedAt": "2025-05-29T15:55:25Z",
      "title": "Judge extends order blocking Trump ban on foreign students at Harvard",
      "url": "https://apnews.com/article/harvard-international-students-judge-70a69446b265877b801e91b250547cb4",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f94951/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F83%2Fde56652d8a8b37e1ab1b7a43aee0%2F180c08de73a147499c9040f6ab86dc6d"
    },
    {
      "author": "Michael Casey, Leah Willingham",
      "description": "Harvard University is holding it commencement Thursday. The nation's oldest and wealthiest school at the forefront of legal efforts to defend higher education in America from what increasingly seem like existential threats by President Donald Trump. Other schools also face the loss of federal funding and their ability to enroll international students if they don’t agree to the Trump administration’s changing demands. But Harvard is taking the lead on defying the White House in federal court. Trump frames his pressure as a defense against antisemitism. Sustained by a $53 billion endowment, Harvard is testing whether it can be a bulwark protecting the freedom to teach and learn nationwide.",
      "publishedAt": "2025-05-29T04:04:52Z",
      "title": "Harvard commencement held as Trump presses against antisemitism",
      "url": "https://apnews.com/article/harvard-graduation-trump-administration-679b6c5c1b9306aeaff4c175fabea76a",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5da8b3/2147483647/strip/true/crop/4116x2315+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F02%2F3cd783233bc8f3ceab3bdb499ecc%2Fe8636cc36f9e4a3db481cc812c7b423f"
    },
    {
      "author": "Stan Choe",
      "description": "Stocks worldwide are rising after a U.S. court blocked many of President Donald Trump’s sweeping tariffs. The S&P 500 rose 0.7% Thursday. The Dow Jones Industrial Average added 60 points, and the Nasdaq composite jumped 1.3% higher. Technology stocks led the way after Nvidia once again topped analysts’ expectations for profit and revenue in the latest quarter. The gains were even bigger in Asia, where markets had the first chance to react to the ruling issued late on Wednesday by the U.S. Court of International Trade in New York. But the gains faded as trading moved westward amid uncertainty about what Trump will do next.",
      "publishedAt": "2025-05-29T01:18:04Z",
      "title": "Markets energized by court ruling against Trump tariffs",
      "url": "https://apnews.com/article/stocks-markets-bonds-tariffs-trump-e9b612f1c8f4f338f24f609373075095",
      "urlToImage": "https://dims.apnews.com/dims4/default/a20ca98/2147483647/strip/true/crop/3611x2031+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2Fc1%2F6170984a9a5f8b1672c66e6a8b94%2F82449b9104ee4421be335aaf29238c32"
    },
    {
      "author": "Patrick Whittle, Michael Casey",
      "description": "The prosecution is resting in the second trial of Karen Read after attorneys for the state of Massachusetts took a more streamlined approach to try to prove Read’s guilt in the killing of her Boston police officer boyfriend. Read is accused of backing her SUV into her boyfriend, Boston Police Officer John O’Keefe and leaving him to die on a snowy night in the front yard of another officer’s home after she dropped him off at a party there in January 2022. Her lawyers say she was framed in a police conspiracy and someone inside the home that night killed him.",
      "publishedAt": "2025-05-29T15:29:11Z",
      "title": "Prosecution rests in Karen Read's trial",
      "url": "https://apnews.com/article/karen-read-trial-prosecution-court-massachusetts-039f241cbfca054a3ea012d16191a813",
      "urlToImage": "https://dims.apnews.com/dims4/default/5bd3a0b/2147483647/strip/true/crop/1280x720+0+86/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F5b%2F8328ca86b4f2c5dd0aed6bc8e711%2Fd83e17598e424355a7be5d6b3f637c10"
    },
    {
      "author": "Andrew DeMillo, Jeff Martin, Safiyah Riddle",
      "description": "Arkansas authorities are looking at whether a prison kitchen job played a role in the escape of a convicted former police chief known as the “Devil in the Ozarks.” A prison system spokesperson said Thursday that Grant Hardin was housed in a maximum-security wing of the Calico Rock prison from which he escaped over the weekend. Hardin escaped after donning an outfit designed to look like a law enforcement uniform. Hardin was serving lengthy sentences for murder and rape. The FBI on Thursday offered a reward of up to $10,000 for information leading to Hardin's arrest.",
      "publishedAt": "2025-05-29T15:12:38Z",
      "title": "Authorities looking at whether kitchen job played role in 'Devil in the Ozarks' prison escape",
      "url": "https://apnews.com/article/devil-ozarks-arkansas-prison-grant-hardin-9f2600255eea6ec5be0aae045de550df",
      "urlToImage": "https://dims.apnews.com/dims4/default/5cccb3c/2147483647/strip/true/crop/2500x1406+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2Fd5%2F686e09a522b6ee2429c18e6b14e7%2Febb58fe4e4744f378938ef70083c9583"
    },
    {
      "author": "Jennifer Peltz",
      "description": "Harvey Weinstein's defense has started presenting its own witnesses in his sex crimes retrial. But it’s unclear whether the ex-studio boss himself will be one of them. He’s due to decide by the end of court Thursday whether to testify. If he does, it would be a remarkable chapter in the yearslong saga of the onetime Hollywood honcho-turned-#MeToo outcast. The 73-year-old is being retried on rape and sexual assault charges because New York’s highest court overturned his 2020 conviction. He denies the allegations. His attorneys maintain that anything that happened between him and his accusers was consensual.",
      "publishedAt": "2025-05-29T15:19:58Z",
      "title": "Will Harvey Weinstein take the stand in his own defense case in sex crimes retrial?",
      "url": "https://apnews.com/article/harvey-weinstein-sex-crimes-retrial-defense-4e8a353e5265ab66a5d934035a764380",
      "urlToImage": "https://dims.apnews.com/dims4/default/2dc9759/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F98%2F9ec25c483d8fd69b03a79baa21aa%2F5f365d1e923f44b6a84f314f00cb73aa"
    },
    {
      "author": "Mae Anderson, Paul Harloff",
      "description": "The typical compensation package for chief executives who run companies in the S&P 500 jumped nearly 10% in 2024 as the stock market enjoyed another banner year and corporate profits rose sharply. The increase for those who occupy the corner office again outpaced the wage gains for the median worker at their company. At half the companies in AP’s annual pay survey, it would take the worker at the middle of the company’s pay scale 192 years to make what the CEO did in one. Rick Smith, the founder and CEO of Axon Enterprises, the maker of Tasers, topped the survey with a pay package valued at $164 million.",
      "publishedAt": "2025-05-29T12:31:01Z",
      "title": "CEO pay rose nearly 10% in 2024 and outpaced workers' wage gains",
      "url": "https://apnews.com/article/ceo-pay-compensation-pay-ratio-perks-1b968327984edfc67486c2e0e3dc2fff",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d399fa/2147483647/strip/true/crop/5576x3137+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2Fd6%2F0cd5e087db44e7ca658539ab6feb%2F776ba7faf22843e08e69618bfbe68526"
    },
    {
      "author": "Holly Meyer",
      "description": "A new edition of “The Sacred Harp,” a Christian hymnal first published in 1844, is being released this year. It helps carry on the more than 180-year-old American folk singing tradition that is as much about the community as it is the music. The shape-note songbook with music notes that look like triangles, ovals, squares and diamonds is core to the a cappella group singing practice. Over time, groups of Sacred Harp singers have periodically worked together to revise the songbook, preserving its history and breathing new life into it. The book is precious to its singers. The nine-member revision committee working on the new book feels a tremendous responsibility to get it right.",
      "publishedAt": "2025-05-29T12:05:02Z",
      "title": "Sacred Harp singers await revision of shape-note Christian hymnal",
      "url": "https://apnews.com/article/sacred-harp-singing-shape-note-hymnal-revision-2d9969df08f9099b3fb7585417ba4335",
      "urlToImage": "https://dims.apnews.com/dims4/default/84cd8a4/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F72%2F5a557d6c93bd72cb7803b8168620%2F076c16877c2249a9864418df7083f298"
    },
    {
      "author": null,
      "description": "An Argentine court has declared a mistrial in the case of seven health professionals accused of negligence in the death of soccer legend Diego Maradona. It was the latest dramatic twist in a trial that has captivated the nation and the soccer world for more than two months. The whiplash decision comes after one of the three judges overseeing the trial stepped down over criticism surrounding her participation in a forthcoming documentary about the case. Her withdrawal compelled the court to either appoint a new judge in her place or to retry the entire case from scratch. On Thursday, the judges decided the latter.",
      "publishedAt": "2025-05-29T16:20:20Z",
      "title": "Argentine court declares a mistrial in the case over the death of soccer star Maradona",
      "url": "https://apnews.com/article/maradona-death-court-mistrial-ad44fc5d1e871224663bd27408be8a04",
      "urlToImage": "https://dims.apnews.com/dims4/default/77d8d7a/2147483647/strip/true/crop/4515x2540+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Ffd%2F3df30992e1745195fc9fa4ff2ad4%2F47b9ac4368cb46689e926fa7c98bd572"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}