{
  "articles": [
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Israel demonstrated its military dominance over adversary Iran in its apparent precision strikes that hit near military and nuclear targets deep in the heart of the country, meeting little significant challenge from Iran's defenses and providing the world with new insights into both militaries' capabilities.",
      "publishedAt": "2024-04-20T04:40:01Z",
      "title": "Israel and Iran's apparent strikes and counterstrikes give new insights into both militaries",
      "url": "https://apnews.com/fdc927f764375fabf88041f5a63f3e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0afb8bf42903465c9eee0cafae235ac4/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House is preparing in a rare Saturday session to approve $95 billion in foreign aid for Ukraine, Israel and other U.S.",
      "publishedAt": "2024-04-20T04:50:16Z",
      "title": "House on the brink of approving Ukraine and Israel aid after months of struggle",
      "url": "https://apnews.com/a8910452e623413bf1da1e491d1d94ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec18f0be2a854f50a4fa92adb8f19ae0/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — After its midnight deadline, the Senate voted early Saturday to reauthorize a key U.S. surveillance law after divisions over whether the FBI should be restricted from using the program to search for Americans’ data nearly forced the statute to lapse.",
      "publishedAt": "2024-04-20T04:47:16Z",
      "title": "Senate passes reauthorization of key US surveillance program after midnight deadline",
      "url": "https://apnews.com/81e991c9f82e77b2fe13f8a3e0e25349",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfe855f61039478c93033cc058878295/3000.jpeg"
    },
    {
      "author": "KRISTIN M. HALL and TOM KRISHER",
      "description": "CHATTANOOGA, Tenn. (AP) — Employees at a Volkswagen factory in Chattanooga, Tennessee, overwhelmingly voted to join the United Auto Workers union Friday in a historic first test of the UAW’s renewed effort to organize nonunion factories.",
      "publishedAt": "2024-04-19T14:03:30Z",
      "title": "Tennessee Volkswagen employees overwhelmingly vote to join United Auto Workers union",
      "url": "https://apnews.com/51544590d8a06efddfa2f6ac7db00fbe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f12ff2331c174ffe917eed91a632557c/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — He seems \"selfish and self-serving,” said one woman.The way he carries himself in public \"leaves something to be desired,\" said another.His “negative rhetoric and bias,\" said another man, is what is “most harmful.\"",
      "publishedAt": "2024-04-20T04:05:26Z",
      "title": "Trump forced to listen silently to people insulting him as he trades a cocoon of adulation for court",
      "url": "https://apnews.com/b4fe05a61ed566a587523d1120b46a76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76a1c4537f9d40eba1af485d15eaca3e/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "CONCORD, Calif. (AP) — A year before I-Ting Quinn's son was old enough for kindergarten, she and her husband had the option to enroll him in “transitional kindergarten,” a program offered for free by California elementary schools for some 4-year-olds.",
      "publishedAt": "2024-04-20T04:39:48Z",
      "title": "California is rolling out free preschool. That hasn't solved challenges around child care",
      "url": "https://apnews.com/b30a4aa930e28228d3046543bdb6e242",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acb6ec7b818a4be48a8ae8cfea63b3a6/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "ARLINGTON, Wash. (AP) — When Washington state opened some of the nation's first legal marijuana stores in 2014, Sam Ward Jr.",
      "publishedAt": "2024-04-20T04:22:57Z",
      "title": "The drug war devastated Black and other minority communities. Is marijuana legalization helping?",
      "url": "https://apnews.com/45efa08a04116a747aba2f1c13187944",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/baca467da4e341739a99b6fd1b3355ff/1920.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Special LP releases, live performances and at least one giant block party are scheduled around the U.S. Saturday as hundreds of shops celebrate Record Store Day during a surge of interest in vinyl and the day after the release of Taylor Swift's latest album.",
      "publishedAt": "2024-04-20T04:20:12Z",
      "title": "Record Store Day celebrates indie retail music sellers as they ride vinyl's popularity wave",
      "url": "https://apnews.com/ecd2a5199233ee24bf2fda6ccc491c0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca6e77d6ac464142a41b82a4ea074fdd/1920.jpeg"
    },
    {
      "author": "BY AYANNA ALEXANDER",
      "description": "FREEPORT, N.Y. (AP) — Weihua Yan had seen dramatic demographic changes since moving to Long Island's Nassau County.Its Asian American population alone had grown by 60% since the 2010 census. Why then, he wondered, did he not see anyone who looked like him on the county's local governing body, the 19-member Nassau County Legislature?",
      "publishedAt": "2024-04-20T04:11:54Z",
      "title": "Lawsuits under New York's new voting rights law reveal racial disenfranchisement even in blue states",
      "url": "https://apnews.com/476e2a64d5f6a9c615a659ede19a5f5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe7afbb110344f2ebe554811c7a4bec8/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "There’s a 64-win team in Boston that ran away with the league’s best record. The defending champions in Denver, a group that won 57 games. A fearless young bunch in Oklahoma City, whose No. 1 seed was no fluke.",
      "publishedAt": "2024-04-19T14:32:14Z",
      "title": "The NBA playoffs are finally here. And as LeBron James says, 'it's a sprint now'",
      "url": "https://apnews.com/b7d75dc92ca84987ba15fe89814e416b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cee3a8cf98942ae8020e694f7fc5c34/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}