{
  "articles": [
    {
      "author": "COSTAS KANTOURIS and ELENA BECATOROS",
      "description": "ALEXANDROUPOLIS, Greece (AP) — Greek firefighters found the bodies of 18 people in an area of northeastern Greece ravaged by a major wildfire burning for days, authorities said Tuesday.Greek police activated the country’s Disaster Victim Identification Team to identify the bodies, which were found near a shack in the Avanta area in the northeastern Alexandroupolis region, Ioannis Artopios, a spokesman for the fire department, said in a televised statement.",
      "publishedAt": "2023-08-22T08:55:19Z",
      "title": "Greek authorities say the bodies of 18 people have been found in area struck by a major wildfire",
      "url": "https://apnews.com/375a33b022ba619d09b15b056ed3f3f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82b42692a3be4d18b46a94a0437eca92/3000.jpeg"
    },
    {
      "author": "ALI SWENSON and AYANNA ALEXANDER",
      "description": "NEW YORK (AP) — Donald Trump’s aggressive response to his fourth criminal indictment in five months follows a strategy he has long used against legal and political opponents: relentless attacks, often infused with language that is either overtly racist or is coded in ways that appeal to racists.",
      "publishedAt": "2023-08-22T04:05:06Z",
      "title": "How Trump's attacks on prosecutors build on history of using racist language and stereotypes",
      "url": "https://apnews.com/04b69a8f3e4873eadb03c132cdee09c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6787c9a3d4e14b0b93a45214a1bca919/3000.jpeg"
    },
    {
      "author": "MARK J. TERRILL, JOHN ANTCZAK and JULIE WATSON",
      "description": "CATHEDRAL CITY, Calif. (AP) — Crews worked to dig roads, buildings and care home residents out of the mud across a wide swath of Southwestern U.S. desert Monday, as the first tropical storm to hit Southern California in 84 years headed north, prompting flood watches and warnings in half a dozen states.",
      "publishedAt": "2023-08-22T05:28:10Z",
      "title": "As Tropical Storm Hilary shrinks, desert and mountain towns dig themselves out of the mud",
      "url": "https://apnews.com/9379b783d599f3a85433de6cffcc4d91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35f013e667d34c79b0a0485d5919c6d3/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "A natural El Nino, human-caused climate change, a stubborn heat dome over the nation’s midsection and other factors cooked up Tropical Storm Hilary’s record-breaking slosh into California and Nevada, scientists figure.",
      "publishedAt": "2023-08-21T23:29:57Z",
      "title": "How a mix of natural and human-caused factors cooked up Tropical Storm Hilary's soggy mess",
      "url": "https://apnews.com/8e9d543e8b96ea6c0f47e2535123d7f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d31687acfa241babb3cbce7450b971e/3000.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BANGKOK (AP) — A populist Thai party linked to former Prime Minister Thaksin Shinawatra won a vote in Parliament on Tuesday to lead the country, hours after the divisive former leader returned from years of self-imposed exile and began an eight-year prison sentence.",
      "publishedAt": "2023-08-22T02:31:23Z",
      "title": "Former Thai leader Thaksin goes to jail as political party linked to him wins vote to take power",
      "url": "https://apnews.com/705f9e9b3c7c26dba2e3322985088d64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3de4e69f4f1840118d2e457275b5e2b6/1920.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — Russian President Vladimir Putin will be notably absent when Chinese President Xi Jinping and other leaders from the BRICS group of emerging economies start a three-day summit in South Africa on Tuesday.",
      "publishedAt": "2023-08-22T08:38:31Z",
      "title": "Russia's Putin stays away over arrest warrant as leaders of emerging economies meet in South Africa",
      "url": "https://apnews.com/da5552203262cb5b71598d3f1de5e55e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e768ce7201b479e954cc4df69f5b462/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY, CLAIRE RUSH and JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Two weeks after the deadliest U.S. wildfire in more than a century swept through the Maui community of Lahaina, authorities say more than 800 people remain unaccounted for — a staggering number that presents huge challenges for officials who are trying to determine how many of those perished and how many may have made it to safety but haven't checked in.",
      "publishedAt": "2023-08-22T04:52:07Z",
      "title": "Maui confronts the challenge of finding more than 800 missing people after the deadly wildfires",
      "url": "https://apnews.com/e6909a2be7860fc7f9062c886a15f979",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fea99b68e9de483b80dd01900e3d6dd3/3000.jpeg"
    },
    {
      "author": "COSTAS KANTOURIS and ELENA BECATOROS",
      "description": "ALEXANDROUPOLIS, Greece (AP) — Greek firefighters found the bodies of 18 people in an area of northeastern Greece ravaged by a major wildfire burning for days, authorities said Tuesday.Greek police activated the country’s Disaster Victim Identification Team to identify the bodies, which were found near a shack in the Avanta area in the northeastern Alexandroupolis region, Ioannis Artopios, a spokesman for the fire department, said in a televised statement.",
      "publishedAt": "2023-08-22T08:55:19Z",
      "title": "Greek authorities say the bodies of 18 people have been found in area struck by a major wildfire",
      "url": "https://apnews.com/375a33b022ba619d09b15b056ed3f3f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82b42692a3be4d18b46a94a0437eca92/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — A federal judge on Tuesday will consider whether Texas can keep a floating barrier on the U.S.-Mexico border as both the Biden administration and Mexico push to remove Republican Gov.",
      "publishedAt": "2023-08-22T05:30:09Z",
      "title": "A judge will consider if Texas can keep its floating barrier to block migrants crossing from Mexico",
      "url": "https://apnews.com/7006ac19f8c11723c9ce20b7f0065628",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e10c5d187759486294039b550e0aa1f4/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Tennessee's Republican-led Legislature is meeting in special session this week to consider a package of public safety proposals, including some stemming from a deadly shooting at a Nashville elementary school earlier this year.",
      "publishedAt": "2023-08-22T04:09:48Z",
      "title": "Mass shootings spur divergent laws as states split between gun rights and control",
      "url": "https://apnews.com/4327496f877716d3cba3b03f149fac6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa3b870e83e7447c82a099a1084b51ff/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}