{
  "articles": [
    {
      "author": "WAFAA SHURAFA, NAJIB JOBAIN and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli warplanes struck a refugee camp in the Gaza Strip early Sunday, killing at least 40 people and wounding dozens, health officials said. The strike came as Israel said it would press on with its offensive to crush the territory's Hamas rulers, despite U.S.",
      "publishedAt": "2023-11-05T05:08:16Z",
      "title": "Warplanes strike Gaza refugee camp as Israel rejects US push for a pause in fighting",
      "url": "https://apnews.com/eb1dfa6afe40ba267024c7d819e17194",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1596894a804346529201d023eca0e73a/1920.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN and OLEG CETINIC",
      "description": "WASHINGTON (AP) — From Washington to Milan to Paris, tens of thousands of pro-Palestinian demonstrators marched Saturday, calling for a halt to Israel’s bombardment of Gaza.",
      "publishedAt": "2023-11-04T19:52:53Z",
      "title": "Protest marches from US to Berlin call for immediate halt to Israeli bombing of Gaza",
      "url": "https://apnews.com/193a9aaca97df2c5c6a515f756a40a34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dfb83fcd7774b9d8ec4964b8dbaaff9/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "RAMALLAH, West Bank (AP) — U.S. Secretary of State Antony Blinken brought his frenetic Mideast diplomatic push on the Israel-Hamas war to the occupied West Bank on Sunday, meeting with Palestinian President Mahmoud Abbas in his latest bid to ease civilian suffering in the Gaza Strip and begin to sketch out a post-conflict scenario for the territory.",
      "publishedAt": "2023-11-05T10:31:10Z",
      "title": "Blinken meets Palestinian leader in West Bank, stepping up Mideast diplomacy as Gaza war escalates",
      "url": "https://apnews.com/1139f6e433fa489fbf3bc4c41bc2d52d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c34838b8ab8444d1b957fd1ddd210e93/2790.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Villagers in the mountains of northwest Nepal cremated the bodies of some who perished in an earthquake that shook the area Friday night. The strong tremblor killed 157 people and left thousands homeless.",
      "publishedAt": "2023-11-04T08:23:19Z",
      "title": "Nepal villagers cremate loved ones who perished in earthquake that shook its northwest, killing 157",
      "url": "https://apnews.com/e3fbed76b72419339d3c0edd9ad44ee2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad9f06c9791e4e8199efe45a4481a147/3000.jpeg"
    },
    {
      "author": null,
      "description": "BERLIN (AP) — German police advised travelers on Sunday not to use Hamburg airport due to a developing hostage situation.The airport in the northern part of the city has been closed to passengers and flights canceled since Saturday night when an armed man broke through an airport gate with his vehicle and fired twice into the air with a weapon, according to German news agency dpa.",
      "publishedAt": "2023-11-05T08:48:01Z",
      "title": "German police advise travelers to avoid Hamburg airport due to an ongoing hostage situation",
      "url": "https://apnews.com/5ca37a0e638f2e9358ce8bebbbb279f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c063aa386d94f4b826a6617b3ea5c9e/3000.jpeg"
    },
    {
      "author": "SIBI ARASU",
      "description": "BENGALURU, India (AP) — Tense negotiations at the final meeting on a climate-related loss and damages fund — an international fund to help poor countries hit hard by a warming planet — ended Saturday in Abu Dhabi, with participants agreeing that the World Bank would temporarily host the fund for the next four years.",
      "publishedAt": "2023-11-05T06:33:06Z",
      "title": "Stage set for conflict at COP28 with mixed response to outcome of key climate talks",
      "url": "https://apnews.com/bd4969f1b23254a7311d1ad4f4289d9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ed306c81482458f8287a092f85a3635/2464.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and VASILISA STEPANENKO",
      "description": "KYIV, Ukraine (AP) — Nervous ahead of their first jiu-jitsu championship, the war veterans gathered in a group to share jokes and help each other tie the belts of their kimonos. Many of them had suffered severe battlefield injuries requiring amputations.",
      "publishedAt": "2023-11-05T06:11:01Z",
      "title": "Ukrainian war veterans with amputated limbs find freedom in the practice of jiu-jitsu",
      "url": "https://apnews.com/3d82c9823f360d4f0f949c377051cb5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/528815a8c98343ab82343e6bbccb8478/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "U.S. regulators say they will review the use of a chemical found in almost every tire after a petition from West Coast Native American tribes that want it banned because it kills salmon as they return from the ocean to their natal streams to spawn.",
      "publishedAt": "2023-11-05T04:09:15Z",
      "title": "U.S. regulators will review car-tire chemical that kills salmon, upon request from West Coast tribes",
      "url": "https://apnews.com/ce4ea04af17e78d84632da5e68ab356c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03e3103f0b244181ab293a71b4c012c0/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "BOZEMAN, Mont. (AP) — Victims of government-backed Native American boarding schools are expected to share their experiences Sunday as U.S.",
      "publishedAt": "2023-11-05T04:32:44Z",
      "title": "Victims of abusive Native American boarding schools to share experiences in Montana",
      "url": "https://apnews.com/3f927e5054b6790cef1c6012d8616ad6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21c7a4c329f34137a43f51d6f3c23c30/2000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Russian military said a Ukrainian missile strike on a shipyard in annexed Crimea had damaged a Russian ship. The Russian Defense Ministry said late Saturday that Ukrainian forces fired 15 cruise missiles at the Zaliv shipyard in Kerch, a city in the east of the Crimean Peninsula.",
      "publishedAt": "2023-11-05T08:45:19Z",
      "title": "A Ukrainian missile strike on a shipyard in Crimea damages a Russian ship",
      "url": "https://apnews.com/d83ad8ea77d6263eca27d93e738bb8e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b2dbc3754b14146845d647172b7a2fb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}