{
  "articles": [
    {
      "author": "EMMA BURROWS, DASHA LITVINOVA and JIM HEINTZ",
      "description": "Russian President Vladimir Putin basked in a victory early Monday that was never in doubt, as partial election results showed him easily securing a fifth term after facing only token challengers and harshly suppressing opposition voices.",
      "publishedAt": "2024-03-17T05:27:51Z",
      "title": "Putin basks in electoral victory that was never in doubt even as Russians quietly protest",
      "url": "https://apnews.com/d4dcaa5c93dc44b745cec7d811831daa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37cac6c58b50492fb97bbbd6a72d3b29/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Russian President Vladimir Putin said early Monday that he supported an idea to release opposition leader Alexei Navalny in a prisoner exchange just days before the man who was his biggest foe died.",
      "publishedAt": "2024-03-17T23:10:01Z",
      "title": "Commenting on Navalny's death for first time, Putin says he supported prisoner swap for his foe",
      "url": "https://apnews.com/d941866bf80241242b5b4c42c912bc06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/284393f7232745e99ed8eb0961a76fa9/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and RAVI NESSMAN",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu railed Sunday against growing criticism from top ally the United States against his leadership amid the devastating war with Hamas, describing calls for a new election as “wholly inappropriate.”",
      "publishedAt": "2024-03-17T13:19:11Z",
      "title": "Netanyahu snaps back against growing US criticism after being accused of losing his way on Gaza",
      "url": "https://apnews.com/ab0b75fdd8f0ab51c5e38b1870afecd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f27e485fe8d495b988882ce4366719d/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "BERLIN (AP) — When Sabine Thonke joined a recent demonstration in Berlin against Germany's far-right party, it was the first time in years she felt hopeful that the growing power of the extremists in her country could be stopped.",
      "publishedAt": "2024-03-18T04:10:11Z",
      "title": "In Germany, the far right is on the rise again. How did it happen?",
      "url": "https://apnews.com/2dce0ea7ed40fccd3f0ec1c46edcfd42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77f630163e99498b97f297091d3d7667/3000.jpeg"
    },
    {
      "author": null,
      "description": "MIAMI (AP) — A charter flight carrying dozens of U.S. citizens fleeing spiraling gang violence in Haiti landed Sunday in Miami, U.S.",
      "publishedAt": "2024-03-18T00:32:55Z",
      "title": "First charter flight with US citizens fleeing Haiti lands in Miami",
      "url": "https://apnews.com/756ac4fdc85d548b302c9c1bacb290bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca4b0e8fa9f641ddaaeb2cf2f812bc4f/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — In a busy term that could set standards for free speech in the digital age, the Supreme Court is taking up a dispute Monday between Republican-led states and the Biden administration over how far the federal government can go to combat controversial social media posts on topics like COVID-19 and election security.",
      "publishedAt": "2024-03-18T04:04:13Z",
      "title": "Supreme Court weighs how far federal officials can go to combat controversial posts on hot topics",
      "url": "https://apnews.com/132df16a8b086cd7ed72954f3b4c2c04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e29b3a8d1e84008bfa65d3784b09ea4/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "BOISE, Idaho (AP) — Idaho lawmakers are expected to vote this week on a bill that would ban the use of any public funds for gender-affirming care, including for state employees using work health insurance and for adults covered by Medicaid.",
      "publishedAt": "2024-03-18T04:03:54Z",
      "title": "Idaho considers a ban on using public funds or facilities for gender-affirming care",
      "url": "https://apnews.com/cbcdc7a5be71373bc5c000f749e4751d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f29f8255b644af6a6009805d4fc24c7/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "BOSTON (AP) — While some American cities celebrated St.",
      "publishedAt": "2024-03-17T20:59:23Z",
      "title": "AP PHOTOS: Boston celebrates St. Patrick's Day; Biden holds White House brunch with Irish leader",
      "url": "https://apnews.com/3f3db00d515d8696c0509f663a9256a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74aa7a6299fe426db987ef66475d2bb6/3000.jpeg"
    },
    {
      "author": "NICK PERRY and LISA RATHKE",
      "description": "ELMORE, Vt. (AP) — Julie wants more donations to the food pantry. Kipp is busy knitting a sweater. Shorty is ready to ask: Why is so much being spent on a truck? The coffee, fresh-baked bread and donuts have been laid out.",
      "publishedAt": "2024-03-18T04:08:12Z",
      "title": "In Vermont, 'Town Meeting' is democracy embodied. What can the rest of the country learn from it?",
      "url": "https://apnews.com/11d7d1b63037d054506e77e261aff87c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e26705a903454a42a4269de1eaffee50/3000.jpeg"
    },
    {
      "author": null,
      "description": "BOGOTA, Colombia (AP) — Colombian President Gustavo Petro on Sunday suspended a ceasefire with one of a handful of armed groups with which he hoped to negotiate peace accords, saying its fighters violated the truce by attacking an Indigenous community.",
      "publishedAt": "2024-03-18T03:12:11Z",
      "title": "Colombia suspends ceasefire with faction of ex-FARC rebels following attack on Indigenous community",
      "url": "https://apnews.com/08eb4467cb2d9af44449ad3e5f99e3b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/910d5a9118064731badad241ddcd012f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}