{
  "articles": [
    {
      "author": "ALEXANDRA OLSON",
      "description": "NEW YORK (AP) — It’s been a central argument for the United Auto Workers union: If Detroit's three automakers raised CEO pay by 40% over the past four years, workers should get similar raises.UAW President Shawn Fain has repeatedly cited the figure, contrasting it with the 6% pay raises autoworkers have received since their last contract in 2019.",
      "publishedAt": "2023-09-17T13:14:01Z",
      "title": "UAW justifies wage demands by pointing to CEO pay raises. So how high were they?",
      "url": "https://apnews.com/dacdfe9ec0736f4fbf3ce7ee38b4bcf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a83c3193cf54db3bf3c98b94a29b5fe/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG, HYUNG-JIN KIM and ELISE MORTON",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un is on his way home Sunday from Russia, ending a six-day trip that triggered global concerns about weapons transfer deals between the two countries locked in separate standoffs with the West.",
      "publishedAt": "2023-09-17T01:26:16Z",
      "title": "North Korean leader Kim Jong Un on his way home after concluding a trip to Russia's Far East",
      "url": "https://apnews.com/7f9fad83f4e56c684c11b9fffbd047e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a039d237e06945beb7690357672a1de2/3000.jpeg"
    },
    {
      "author": "ROBERT F. BUKATY and DAVID SHARP",
      "description": "BAR HARBOR, Maine (AP) — Atlantic storm Lee — which made landfall at near-hurricane strength, bringing destructive winds and torrential rains to New England and Maritime Canada — kept weakening Sunday after officials withdrew warnings and predicted the storm would disappear early this week.",
      "publishedAt": "2023-09-17T05:27:49Z",
      "title": "Atlantic storm Lee delivers high winds and rain before forecasters call off all warnings",
      "url": "https://apnews.com/b40d9806887070c318487ecd1f81ef13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/880f6cf6cbc94d409e9876e30754a17c/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The war in Ukraine and its visiting president take center stage at the United Nations this week, but developing countries will be vying for the spotlight as well as they push for faster action on poverty and inequality at the first full-on meeting of world leaders since the COVID-19 pandemic disrupted travel three years ago.",
      "publishedAt": "2023-09-17T19:06:52Z",
      "title": "Ukraine is the spotlight at UN leaders' gathering, but is there room for other global priorities?",
      "url": "https://apnews.com/27e5e572b91d2598d4249c6cc029bfa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/163cc0f9d61d4b11a93bb20dfbb16719/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH and LAURA UNGAR",
      "description": "Alisha Alderson placed her folded clothes and everything she needed for the last month of her pregnancy in various suitcases. She never imagined she would have to leave the comfort of her home in rural eastern Oregon just weeks before her due date.",
      "publishedAt": "2023-09-17T14:08:43Z",
      "title": "Rural hospitals are closing maternity wards. People are seeking options to give birth closer to home",
      "url": "https://apnews.com/e67a91d927eb545459e83bc7b2b95a0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d1ae76470c04653840647f672e5833b/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Drew Barrymore, who drew criticism for taping new episodes of her daytime talk show despite the ongoing writers and actors strikes, now says she'll wait until the labor issues are resolved.",
      "publishedAt": "2023-09-17T14:43:22Z",
      "title": "Drew Barrymore and 'The Talk' postpone their daytime talk shows until after the Hollywood strikes",
      "url": "https://apnews.com/92e4ded590fb2c75f08d4ea94224bd96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a994ca614864e089e1816d63bd15736/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Former President Donald Trump repeatedly declined in an interview aired Sunday to answer questions about whether he watched the Capitol riot unfold on television, saying he would “tell people later at an appropriate time.”",
      "publishedAt": "2023-09-17T14:22:25Z",
      "title": "Trump refuses to say in a TV interview how he watched the Jan. 6 attack unfold at the US Capitol",
      "url": "https://apnews.com/59460113ce82ce6f6140d47856261a56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/728b67fccc794c769e76b256b44a2f7f/2811.jpeg"
    },
    {
      "author": "HAZEM TURKIA and JACK JEFFERY",
      "description": "TRIPOLI, Libya (AP) — Zahra el-Gerbi wasn't expecting much of a response to her online fundraiser, but she felt she had to do something after four of her relatives died in the flooding that decimated the eastern Libyan city of Derna.",
      "publishedAt": "2023-09-17T05:54:23Z",
      "title": "For a divided Libya, disastrous floods have become a rallying cry for unity",
      "url": "https://apnews.com/6de10ab7bd3b3181b3477ed3fc6a4cd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd2717167f89414ebafd775f71a5a19f/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Two cargo ships arrived in one of Ukraine's ports over the weekend, using a temporary Black Sea corridor established by Kyiv following Russia's withdrawal from a wartime agreement designed to ensure safe grain exports from the invaded country’s ports.",
      "publishedAt": "2023-09-17T12:57:59Z",
      "title": "First two cargo ships arrive in Ukrainian port after Russia's exit from grain deal",
      "url": "https://apnews.com/ace7685703cbc19f00d4107b97f84fef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70f61e99c19b48d5a368889f0ad04d48/3000.jpeg"
    },
    {
      "author": "GARY FIELDS and ADRIANA GOMEZ LICON",
      "description": "WASHINGTON (AP) — The Supreme Court’s decision siding with Black voters in an Alabama redistricting case gave Democrats and voting rights activists a surprising opportunity before the 2024 elections.",
      "publishedAt": "2023-09-17T11:53:18Z",
      "title": "A Supreme Court redistricting ruling gave hope to Black voters. They're still waiting for new maps",
      "url": "https://apnews.com/af60cdd8d71c5b102a950623bd31e555",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5485380f8c164dd09af6d2cf56aafaf7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}