{
  "articles": [
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — Republicans have won enough seats to control the U.S. House, completing the party’s sweep into power and securing their hold on U.S. government alongside President-elect Donald Trump.",
      "publishedAt": "2024-11-14T03:29:43Z",
      "title": "Republicans win 218 US House seats, giving Donald Trump and the party control of government",
      "url": "https://apnews.com/e3754a684a7b96b129841d4b207c15e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c073fb259654a16a0e7db29cd1fe68f/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump has had few defenders in Congress as reliable as Matt Gaetz, who has thundered at one prosecutor after another for perceived bias against the president-elect and emphatically amplified the Republican's rallying cry that the criminal investigations into him are “witch hunts.”",
      "publishedAt": "2024-11-14T05:03:33Z",
      "title": "Gaetz pick shows value Trump places on loyalty — and retribution — as he returns to Washington",
      "url": "https://apnews.com/0aa4f13e1e3186a6c3664a1d3b248eb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30a6440dbb2c4d1d830ba506257e7663/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and DIDI TANG",
      "description": "WASHINGTON (AP) — President-elect Donald Trump is famously unconventional, but he made conventional picks for his two top foreign policy positions. That could be reassuring to American allies, while China and Iran have reasons to be wary.",
      "publishedAt": "2024-11-14T05:08:23Z",
      "title": "Trump's mainstream picks for top foreign policy posts could reassure allies — and worry China",
      "url": "https://apnews.com/6179fa4a34e8c1768c75ad70b55b17cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/544afc254668473d88dbbf639bd5eb71/3000.jpeg"
    },
    {
      "author": "ANITA SNOW and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — Maribel Hidalgo fled her native Venezuela a year ago with a 1-year-old son, trudging for days through Panama's Darien Gap, then riding the rails across Mexico to the United States.",
      "publishedAt": "2024-11-14T05:04:44Z",
      "title": "1 million migrants in the US rely on temporary protections that Trump could target",
      "url": "https://apnews.com/ce97e066f2515d722e2c4bd750589c62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cbd6b95bb5542dbb1a34129bbf5b1a1/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel says 15 trucks carrying aid have been allowed into northern Gaza, where aid groups have warned that a monthlong Israeli offensive could cause a famine.",
      "publishedAt": "2024-11-14T10:00:11Z",
      "title": "Middle East latest: Israel says 15 trucks carrying aid have been allowed into northern Gaza",
      "url": "https://apnews.com/ad692fc0f735157f8ed7997922e0138b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9aab650940de4295be7b97ce0e94a8a2/1920.jpeg"
    },
    {
      "author": "VASILISA STEPANENKO and YEHOR KONOVALOV",
      "description": "KHARKIV REGION, Ukraine (AP) — The four drones were designed to carry bombs, but instead the men of Ukraine's Khartia brigade pack them with food, water and handwarmers and launch them in darkness toward the front line, a 15-minute flight away.",
      "publishedAt": "2024-11-14T05:07:24Z",
      "title": "Ukrainian soldiers focus on keeping Russian advances at bay and brace for storm to come from US",
      "url": "https://apnews.com/b466c861d935c5b41631a6710ce9ea48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb52f9d75f014517bb0ffc4db49a050f/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN, SIBI ARASU and MELINA WALLING",
      "description": "BAKU, Azerbaijan (AP) — For the third straight year, efforts to fight climate change haven't lowered projections for how hot the world is likely to get — even as countries gather for another round of talks to curb warming, according to an analysis Thursday.",
      "publishedAt": "2024-11-14T05:18:27Z",
      "title": "Earth's projected warming hasn't improved for 3 years. UN climate talks are still pushing",
      "url": "https://apnews.com/285ebf7f831f09ac2c913a0e1b59e43a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/897745c955174d32a5cf0818ec0d7ecb/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and FRANKLIN BRICEÑO",
      "description": "CHANCAY, Peru (AP) — On the edge of Peru’s coastal desert, a remote fishing town where a third of all residents have no running water is being transformed into a huge deep-water port to cash in on the inexorable rise of Chinese interest in resource-rich South America.",
      "publishedAt": "2024-11-14T05:02:57Z",
      "title": "China's president will unveil a megaport in Peru, but locals say they're being left out",
      "url": "https://apnews.com/1e06904f76cca1d7aaf19bca8bd24d93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16db316f7972435cacd458d6ce05cc86/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and ASHOK SHARMA",
      "description": "NEW DELHI (AP) — Donald Trump’s return to the White House has made many countries anxious and recalculating where they stand with the U.S., but India appears to be welcoming the change that may embolden nationalist leaders like Prime Minister Narendra Modi.",
      "publishedAt": "2024-11-14T02:14:46Z",
      "title": "India's Modi likely to find comfort in Trump's return and a shared worldview",
      "url": "https://apnews.com/a291df0d68d76d88da353e1e12ad1934",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b612959df12942de905a82c41737e245/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "OME, Japan (AP) — Deep in a dark warehouse the sake sleeps, stored in rows of giant tanks, each holding more than 10,000 liters (2,640 gallons) of the Japanese rice wine that is the product of brewing techniques dating back more than 1,000 years.",
      "publishedAt": "2024-11-14T03:25:17Z",
      "title": "Japan's sake brewers hope UNESCO heritage listing can boost rice wine's appeal",
      "url": "https://apnews.com/0416f613b0b43a34ab109d023a37906a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bfeb9cf22a147bcafe8c866f16baffc/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}