{
  "articles": [
    {
      "author": "Lindsay Whitehurst",
      "description": "The Supreme Court has again cleared the way for the Trump administration to strip temporary legal protections from hundreds of thousands of immigrants, pushing the total number of people who could be newly exposed to deportation to nearly 1 million. The justices on Friday lifted a lower-court order that kept humanitarian parole protections in place for more than 500,000 migrants from four countries: Cuba, Haiti, Nicaragua and Venezuela. The court has also allowed the administration to revoke temporary legal status from about 350,000 Venezuelan migrants in another case.",
      "publishedAt": "2025-05-30T14:34:15Z",
      "title": "Supreme Court lets Trump end humanitarian parole for 500,000 people from 4 countries",
      "url": "https://apnews.com/article/trump-supreme-court-immigration-deportation-8bc46820c6444fbb3540c09764e32905",
      "urlToImage": "https://dims.apnews.com/dims4/default/a519aa0/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F38%2F37255488e051ca68d07e2d0543d4%2F925c93a5304048459f79a7ffbd470f68"
    },
    {
      "author": "Illia Novikov",
      "description": "A Ukraine presidential adviser says Ukraine is ready to resume direct peace talks with Russia in Istanbul on Monday but insists that the Kremlin provide a promised memorandum setting out its position on ending the war. Andrii Yermak said in a statement that it's important for Kyiv to receive Russia’s draft and there was still enough time to send it before the planned talks. The foreign ministers of Ukraine and Turkey meeting in Kyiv also suggested the possibility of a future meeting between Presidents Volodymyr Zelenskyy and Vladimir Putin, possibly also including U.S. President Donald Trump.",
      "publishedAt": "2025-05-30T12:35:41Z",
      "title": "Ukraine says it's ready to resume talks with Russia but needs clarity on Kremlin's terms",
      "url": "https://apnews.com/article/russia-ukraine-war-talks-istanbul-00d31a42a36bd572b6265fa00fc982e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/d227a7f/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2Fbd%2F8348120ddb9d4e64c42f3e12ba2c%2Fe3c2492828a04e21bf534f9e6d6eabc6"
    },
    {
      "author": "Ali Swenson",
      "description": "President Donald Trump has built a coalition by promising to demolish a so-called deep state that he claims is behind dark government conspiracies. But four months into his second term, his administration hasn't arrested hordes of corrupt officials or revealed massive crimes from within its ranks. As a result, some of the president's supporters who took him at his word are getting restless. They are asking why his administration, which now holds the keys to chasing down these alleged government secrets, is denying them the evidence and retribution they expected. One conservative commentator lamented: “People are tired of not knowing.\"",
      "publishedAt": "2025-05-30T11:03:29Z",
      "title": "Trump's base is losing patience over 'deep state' promises",
      "url": "https://apnews.com/article/epstein-files-assassination-trump-fbi-conspiracies-aaeb07814bb8b6b3fe595f5b68e4163a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9850ccf/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Ff1%2F5021263b99049d294ba3815803d9%2F6e1d22fc1f594db3bcafb4cc5a6c2f90"
    },
    {
      "author": "Maria Sherman",
      "description": "Taylor Swift says she’s has regained control over her entire body of work. In a lengthy note posted to her official website on Friday, Swift announced that all the music she’s ever made now belongs to her. According to the note, the pop star has purchased her catalog of recordings — originally released through Big Machine Records — from their most recent owner, the private equity firm Shamrock Capital. She did not disclose the amount. Over the last few years, Swift has been re-recording and releasing her first six albums in an attempt to regain control of her music.",
      "publishedAt": "2025-05-30T16:04:19Z",
      "title": "Taylor Swift buys back first 6 albums, now owns all her music",
      "url": "https://apnews.com/article/taylor-swift-music-rights-masters-scooter-braun-672dc24782f5b0f04c864a6fd86665d8",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba44a98/2147483647/strip/true/crop/3180x1789+0+169/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2Fd5%2Fcdc6f40a3ff8baa46cbb48aea56a%2Fb711ec32e3074e9d86b565b8cfd76cc8"
    },
    {
      "author": null,
      "description": "An official says at least 88 people have been confirmed dead after floods submerged Mokwa, a market town in Nigeria’s Niger State on Thursday. Husseini Isah, head of the operations office in Minna, capital of Niger State, said many more are still at risk, with rescue efforts underway on Friday. Earlier reports said at least 20 died. Isah told The Associated Press that the numbers kept rising but “at the last count, 88 bodies have been recovered.” The floods were triggered by torrential rains that lasted several hours. According to local reports quoting residents and local government officials, a dam collapse in a nearby town worsened the situation.",
      "publishedAt": "2025-05-30T11:55:37Z",
      "title": "At least 88 dead after floods submerge Nigerian town of Mokwa",
      "url": "https://apnews.com/article/nigeria-flood-deaths-mokwa-69dcc0b8c06a052e83643edb20838db6",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "Sean “Diddy” Combs' former personal assistant says she was so terrified when she saw the music mogul calling her in late 2023 that she threw her phone across the room. Testifying for a second day Friday, a woman identified in Manhattan federal court by the pseudonym “Mia” said she remains so traumatized by sexual abuse from Combs that she can't work. The woman who worked for Combs from 2009 to 2017 is the second of three women expected to testify about sexual abuse. The 55-year-old Combs has pleaded not guilty. Prosecutors say he tried to contact potential witnesses to his crimes after his ex-girlfriend sued him in November 2023.",
      "publishedAt": "2025-05-30T17:07:10Z",
      "title": "Sean 'Diddy' Combs' ex-personal assistant says she was too traumatized to answer his 2023 call",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-mia-6c4b88730a4fe33f5309ffb0bd839260",
      "urlToImage": "https://dims.apnews.com/dims4/default/b3b95e6/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F22%2F0cc93ed3e9d7474cc79cc4b30887%2F6e9a0ec8f02b4779a8d4617702ae4ce8"
    },
    {
      "author": "Jill Lawless",
      "description": "Former Sinn Fein leader Gerry Adams has won a libel suit against the BBC over a claim he authorized the killing of an informant. A jury at the High Court in Dublin found in Adams’ favor on Friday and he was awarded 100,000 euros ($113,000) in damages. Adams sued Britain’s public broadcaster over a claim in a documentary and online article that he sanctioned the killing of Denis Donaldson, a long-serving Sinn Fein official who acknowledged in 2005 that he had worked for British intelligence. Adams denies any involvement and called the allegation a “grievous smear.”",
      "publishedAt": "2025-05-30T10:44:53Z",
      "title": "Ex-Sinn Fein leader Gerry Adams wins libel case against BBC",
      "url": "https://apnews.com/article/gerry-adams-bbc-libel-lawsuit-sinn-fein-17fefc57f092629211b43627573c3ef8",
      "urlToImage": "https://dims.apnews.com/dims4/default/572ac0d/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2Fea%2F05abc1dd79793fdba5b602432aa8%2Fe729181269d34ebb91b3d774f15bec14"
    },
    {
      "author": "Jeff Martin, Andrew DeMillo, Safiyah Riddle",
      "description": "Authorities say a bloodhound picked up Grant Hardin’s scent shortly after prison guards learned that he’d slipped past a gate. But the dog lost the scent as heavy rains blew through the area on Sunday. That meant the inmate known as the ‘Devil in the Ozarks’ could have gone in any direction. Despite that early failure, experts say bloodhounds are playing a key role in the search for Hardin, now in its sixth day. They have clothing and other items Hardin left behind, which is used to give the hounds the scent they will search for.",
      "publishedAt": "2025-05-30T14:53:43Z",
      "title": "Release the hounds! Bloodhounds play key role in search for 'Devil in the Ozarks' fugitive",
      "url": "https://apnews.com/article/arkansas-prison-escape-police-chief-grant-hardin-b48323fc891ac94d04209b50caa2a04d",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1c8b56/2147483647/strip/true/crop/2106x1185+0+162/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2Fd8%2F5ed8c715f3976092315385d7c4a8%2Fbcca125b07de4af088ec018abe9df6f3"
    },
    {
      "author": "JoNel Aleccia",
      "description": "Federal health officials say at least 45 people in 18 states have been sickened in an expanding salmonella outbreak tied to recalled cucumbers. The cucumbers were produced by Florida-based Bedner Growers and distributed to restaurants, hospitals, cruise ships and grocery stores. Health authorities said Friday at least 16 people have been hospitalized to date. The outbreak includes reports of illness from people aboard six different cruise ships that departed from Florida ports between late March and mid-April. The outbreak was detected as part of a follow-up inspection to a 2024 outbreak linked to the same company.",
      "publishedAt": "2025-05-30T17:07:26Z",
      "title": "Dozens sickened in expanding salmonella outbreak linked to recalled cucumbers",
      "url": "https://apnews.com/article/salmonella-cucumbers-bedner-growers-c082be1f2f383da5fb037c3fbdd63994",
      "urlToImage": "https://dims.apnews.com/dims4/default/6dc286d/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2F56%2F65c6d87476a2f5c25b5d4ea34541%2F58a8f989a3eb460c8a00ae9e98827ebd"
    },
    {
      "author": "Ben Nuckols",
      "description": "Faizan Zaki has seized the title of best speller in the English language at the Scripps National Spelling Bee. The 13-year-old from Allen, Texas, was runner-up last year after he lost in a lightning-round tiebreaker. He ousted eight other accomplished spellers to win the title on Thursday night, including two that he let back into the competition after his own careless flub. Told to take a deep breath before his final word, “eclaircissement,” he didn’t ask a single question before spelling it correctly. He pumped his fists and collapsed to the stage after saying the final letter.",
      "publishedAt": "2025-05-30T02:23:48Z",
      "title": "Faizan Zaki wins the Scripps National Spelling Bee",
      "url": "https://apnews.com/article/scripps-national-spelling-bee-2025-champion-70f6767e4f30a29b52dfc3dfc77eb553",
      "urlToImage": "https://dims.apnews.com/dims4/default/6de12f2/2147483647/strip/true/crop/3667x2063+0+191/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2Fb6%2F631f492c5cbc7630e9b46ea3f1e8%2F7321222b30f043f69af7f2c443b8380f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}