{
  "articles": [
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Since Israel launched its ground invasion of Lebanon, Israeli forces and Hezbollah militants have clashed along the border while the Lebanese army has largely stood on the sidelines.",
      "publishedAt": "2024-10-12T04:47:46Z",
      "title": "As Hezbollah and Israel battle on the border, Lebanon's army watches from the sidelines",
      "url": "https://apnews.com/78f6ad2da82d64d1ae266aa5394e6d4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cbe84b46473451ba9572ee7c6eb4752/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Israeli military on Saturday renewed its orders for Palestinian in the northern Gaza Strip to leave their homes and shelters as troops press on a weeklong offensive against militants. Most of the fighting in the past week was centered in and around Jabaliya that was pounded by Israeli war jets and artillery.",
      "publishedAt": "2024-10-12T09:30:22Z",
      "title": "Middle East latest: Israeli military renews orders for Palestinians to leave northern Gaza",
      "url": "https://apnews.com/a6cb533eb39d69bd2bea60c46b7dcb0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79e98eddf9d64297850cb2cacef04d3e/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM, BRENDAN FARRINGTON and TY ONEIL",
      "description": "BRANDON, Fla. (AP) — Florida residents who fled hundreds of miles to escape Hurricane Milton made slow trips home on crowded highways, weary from their long journeys and the cleanup work awaiting them but also grateful to be coming back alive.",
      "publishedAt": "2024-10-12T04:03:58Z",
      "title": "Floridians evacuated for Hurricane Milton after wake-up call from devastating Helene",
      "url": "https://apnews.com/d044c0bb6b4ad1f5e2bd61ab44fb1b8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cfa6718bee14b51a3f91e2b894f51b6/1920.jpeg"
    },
    {
      "author": "STEPHANY MATAT and CHRISTOPHER L. KELLER",
      "description": "WELLINGTON, Fla. (AP) — Tony Brazzale, a diving boat captain who has lived for 10 years in his Wellington home in southeastern Florida, wasn't worried about Hurricane Milton.",
      "publishedAt": "2024-10-12T04:07:14Z",
      "title": "Far from where Hurricane Milton hit, tornadoes wrought unexpected damage",
      "url": "https://apnews.com/64caa6609c2a3c6476468ad89b0dee96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97c7c8a711134d33b4ec1c597a0a56e6/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Boeing plans to lay off about 10% of its workers in the coming months, about 17,000 people, as it continues to lose money and tries to deal with a strike that is crippling production of the company’s best-selling airline planes.",
      "publishedAt": "2024-10-11T21:14:50Z",
      "title": "Boeing will lay off 10% of its employees as a strike by factory workers cripples airplane production",
      "url": "https://apnews.com/de637999cf525699577b42b72bff2a70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb208cef4df342c9bb84e8e4b3108e6b/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Republican presidential nominee Donald Trump promises the biggest deportation event the U.S.",
      "publishedAt": "2024-10-12T04:05:04Z",
      "title": "Data shows migrants aren't taking 'Black jobs' or 'Hispanic jobs,' despite what Trump says",
      "url": "https://apnews.com/db0bdbc6a029068389b31d8d148b9d3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/171e23bef8784c82a6fc68749ee58e53/2197.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — Vice President Kamala Harris plans to release a report Saturday on her medical history and health that a senior campaign aide said would show “she possesses the physical and mental resiliency” needed to serve as president.",
      "publishedAt": "2024-10-12T09:01:59Z",
      "title": "Harris is releasing a report on her health and poking Trump for failing to do likewise",
      "url": "https://apnews.com/903d7c1654ca0236a4b08f9b59b4e2b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bcbd02f9c1b47d88e87bb7ed07ae4f5/2949.jpeg"
    },
    {
      "author": "WILL WEISSERT and ZEKE MILLER",
      "description": "WASHINGTON (AP) — The concern has been there all along, but now it's being talked about openly: Are some men reluctant to vote for Democrat Kamala Harris because she’s a woman?",
      "publishedAt": "2024-10-11T21:01:14Z",
      "title": "Are male voters reluctant to vote for a woman? Harris' backers are confronting the question head on",
      "url": "https://apnews.com/bcf8dbcce4700ba24725ca178f7753b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28980b8141c2457993a0d9e07c42f614/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — British Prime Minister Keir Starmer marks 100 days in office Saturday with little cause for celebration.",
      "publishedAt": "2024-10-12T04:03:08Z",
      "title": "UK leader Keir Starmer is marking 100 days in office. It has been a rocky ride",
      "url": "https://apnews.com/c0b8a3439fc67d4392ba43d09e9f1fc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c809d0bb085a4d5bab16968348d323ad/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — The Los Angeles Dodgers shelled out $1 billion for Japanese talent in the offseason and it's paying off in the playoffs.Yoshinobu Yamamoto outdueled Yu Darvish in a historic postseason matchup of Japanese-born starters, and the Dodgers got home runs from Kiké Hernández and Teoscar Hernández to beat the San Diego Padres 2-0 on Friday and advance to the National League Championship Series.",
      "publishedAt": "2024-10-12T02:41:55Z",
      "title": "Yamamoto outduels Darvish in historic matchup as Dodgers beat Padres 2-0 to reach NLCS",
      "url": "https://apnews.com/f0778cdc5ff2250641336fbe6c8d3f0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0d26995c38847a3bb55309f9b4b5ac1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}