{
  "articles": [
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Hurricane Hilary grew rapidly to Category 4 strength off Mexico’s Pacific coast on Friday and could reach Southern California as the first tropical storm there in 84 years, causing “significant and rare impacts” including extensive flooding.",
      "publishedAt": "2023-08-18T07:58:35Z",
      "title": "Hurricane Hilary grows off Mexico and could reach California as a very rare tropical storm",
      "url": "https://apnews.com/406a3f7474eacb6222cedc33993d4657",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4150f9aa5abc462ca620763987a653fc/2148.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — Outdoor alert sirens on Maui stayed silent as a ferocious fire devastated the seaside community of Lahaina last week.",
      "publishedAt": "2023-08-18T05:04:46Z",
      "title": "Emergency services chief on Maui resigns. He faced criticism for not activating sirens during fire",
      "url": "https://apnews.com/5754c205e5deaa8751c573422534ca67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3fae62092aa4680bf18cf2ba4e6595e/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump now says he won't be holding a news conference next week to unveil what he claims is new “evidence” of fraud in Georgia's 2020 presidential election — even though no fraud has ever been substantiated — citing the advice of lawyers as he prepares to face trial in two criminal cases that stem from his election lies.",
      "publishedAt": "2023-08-18T00:43:52Z",
      "title": "Trump cancels press conference on election fraud claims, citing attorneys' advice",
      "url": "https://apnews.com/57c3f560f4e9382df74cdf3422741c7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05bd90dee4a6460ab33506f35c58d6db/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — The United States, Japan and South Korea are set to sign on to a new security pledge, committing the three countries to consult with each other in the event of a security crisis or threat in the Pacific, according to Biden administration officials.",
      "publishedAt": "2023-08-18T09:35:11Z",
      "title": "US, Japan and South Korea boosting mutual security commitments over objections of Beijing",
      "url": "https://apnews.com/0bc36bb3705a3dc1b69dc8cd47b35dd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/465e4fe6056d4d62baaa333d6c0d93d4/3000.jpeg"
    },
    {
      "author": null,
      "description": "YELLOWKNIFE, Northwest Territories (AP) — Residents in the capital of Canada's Northwest Territories rushed to beat a noon Friday deadline to evacuate their homes as one of hundreds of wildfires raging in the territories moved closer to the city of 20,000.",
      "publishedAt": "2023-08-18T04:59:08Z",
      "title": "Wildfire nears capital of Canada's Northwest Territories as fleeing residents fill roads and flights",
      "url": "https://apnews.com/7b8c327876d86a483c8e25df7bc2c566",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ee17f44c0c44df9aea6a69da8e91b9c/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Several Republican White House hopefuls are set to greet a conservative conference with hopes of making up ground against Donald Trump. But his shadow may be especially difficult to escape in the city where he was most recently indicted.",
      "publishedAt": "2023-08-18T04:04:08Z",
      "title": "Trump's 2024 GOP rivals converge on Atlanta just days after his latest indictment",
      "url": "https://apnews.com/1492fcceb44afdf71058d63d9280686c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42cb206dd4a342d7bab4ba88234a9f16/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "This may seem like a sad story because it begins with a boy with few memories of his father, who died when he was 7 years old. It's why Mitch Goldstone cherishes his only picture with his dad — a snapshot at Disneyland taken during the late 1960s, when the concept of people reflexively reaching for smartphone cameras in their pockets could only happen in Tomorrowland.",
      "publishedAt": "2023-08-18T04:04:33Z",
      "title": "Millions of old analog photos are sitting in storage. Digitizing them can unlock countless memories",
      "url": "https://apnews.com/4af56dfd0b0e2ca7c25714903e47d96c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/533ec2c6a7d34e3e99fe479e349e00d0/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Rudy Giuliani glared across a Washington hearing room as a lawyer seeking his disbarment after the Jan. 6 insurrection asked: How did this man, celebrated as “America’s mayor” after 9/11, become a leader of an attempt to overturn a national election?",
      "publishedAt": "2023-08-17T20:14:04Z",
      "title": "The fall of Rudy Giuliani: How ‘America’s mayor’ tied his fate to Donald Trump and got indicted",
      "url": "https://apnews.com/eb2ff2ca7a94f9f80e95e897584c8e7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad52239a603d47eea4007d42aeb12608/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JENIN, West Bank (AP) — Last month, after the biggest Israeli military raid on a Palestinian refugee camp in the occupied West Bank in years, Palestinians turned their wrath on their own security forces.",
      "publishedAt": "2023-08-18T06:09:00Z",
      "title": "After Israeli raids, Palestinian police struggle in militant hotbed, reflecting region on the brink",
      "url": "https://apnews.com/b0f1fd2fe03ae5514097b8dc8777ef4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1688fe1e20fb42dbb8faaf4dd8e9291f/3000.jpeg"
    },
    {
      "author": "ADRIAN SAINZ, JONATHAN MATTISE and BEN FINLEY",
      "description": "MEMPHIS, Tenn. (AP) — In 2004, when Michael Oher was a coveted college football recruit, the 18-year-old high schooler agreed in court to allow the Memphis couple he lived with to make decisions for him about signing contracts and any medical issues.",
      "publishedAt": "2023-08-18T05:10:37Z",
      "title": "Agreement central to a public dispute between Michael Oher and the Tuohys is being questioned",
      "url": "https://apnews.com/5133d38f94d11fcf68b7a86263ec3cbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3082555ec3a4e44b9d9f2dd615ec711/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}