{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "The Wagner Group's presence extends from the ancient battlegrounds of Syria to the deserts of sub-Saharan Africa, projecting the Kremlin's global influence with mercenaries accused of using brutal force and profiting from seized mineral riches.",
      "publishedAt": "2023-08-26T06:06:56Z",
      "title": "Russia's Wagner mercenaries face uncertainty after the presumed death of their leader in plane crash",
      "url": "https://apnews.com/e37f03e7fbb6baf36af0d4fb345deabe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a32bb54d01b84e16a502ff517fb4bf83/3000.jpeg"
    },
    {
      "author": "AARON MORRISON",
      "description": "WASHINGTON (AP) — Martin Luther King III, along with his wife, Arndrea Waters King, and their 15-year-old daughter, Yolanda, have developed a set of traditions for this time of the year. Each August, they rewatch the Rev.",
      "publishedAt": "2023-08-26T04:12:14Z",
      "title": "Tens of thousands expected for March on Washington’s 60th anniversary demonstration",
      "url": "https://apnews.com/7639b60f26948fe614978dc6a763cc84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fea48b041fb4123b3bb059f250d7de0/1920.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "IWAKI, Japan (AP) — Fish auction prices at a port south of the Fukushima Daiichi nuclear power plant were mixed amid uncertainty over how seafood consumers will respond to the release of treated and diluted radioactive wastewater into the ocean.",
      "publishedAt": "2023-08-26T04:56:56Z",
      "title": "Fukushima residents are cautious after the wrecked nuclear plant began releasing treated wastewater",
      "url": "https://apnews.com/bd0f5c5ce4bfc35205be8ef4986cafe2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f179f67523bf4bf2aedfecc50e680e36/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "PELLA, Iowa (AP) — Vivek Ramaswamy has charged back into Iowa, stoking curiosity and skepticism after his attention-grabbing performance in the first Republican presidential debate.",
      "publishedAt": "2023-08-26T04:04:39Z",
      "title": "Ramaswamy faces curiosity and skepticism in Iowa after center-stage performance in GOP debate",
      "url": "https://apnews.com/808cd976e8f437252e5688019d535d93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c400402ec1b44955af6f6dcb4209eb68/3000.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN, JAE C. HONG and MIKE HOUSEHOLDER",
      "description": "LAHAINA, Hawaii (AP) — Families were torn asunder. A community is reeling with grief. More than 100 people have perished and hundreds more remain missing after flames and smoke barreled from the hills and annihilated the historic town of Lahaina.",
      "publishedAt": "2023-08-26T10:00:41Z",
      "title": "Hawaii's cherished notion of family, the 'ohana, endures in tragedy's aftermath",
      "url": "https://apnews.com/60cdeb806464de7258b83e69b6a84692",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a53e17b95b584c8bac2d93d28aa3d8f5/3000.jpeg"
    },
    {
      "author": "GRAHAM DUNBAR",
      "description": "GENEVA (AP) — FIFA suspended Spanish soccer federation president Luis Rubiales from office on Saturday while its disciplinary committee investigates his conduct at the Women’s World Cup final, which included kissing a player without her consent.",
      "publishedAt": "2023-08-26T12:29:17Z",
      "title": "FIFA suspends Spain soccer federation president Luis Rubiales for 90 days after World Cup final kiss",
      "url": "https://apnews.com/1559a704b765b834d94544ee0b119efc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9ef8692b386435ea561e3ab9c1c4f29/2040.jpeg"
    },
    {
      "author": "JACK DURA",
      "description": "BISMARCK, N.D. (AP) — The beloved wild horses that roam freely in North Dakota's Theodore Roosevelt National Park could be removed under a National Park Service proposal that worries advocates who say the horses are a cultural link to the past.",
      "publishedAt": "2023-08-26T04:04:55Z",
      "title": "Beloved wild horses that roam Theodore Roosevelt National Park may be removed. Many oppose the plan",
      "url": "https://apnews.com/dd955ffdf9c3ff9f5370e832e59cc3e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0447bfec7f754f75a5e00712981c4227/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russian forces struck a cafe in a key front-line area in northeastern Ukraine Saturday, killing two civilians and wounding a third, regional officials said. The shelling near the city of Kupiansk came as U.K.",
      "publishedAt": "2023-08-26T09:42:07Z",
      "title": "Shelling kills civilians in Ukraine's northeast as fears grow of a second Russian takeover",
      "url": "https://apnews.com/233e38e70aea6837434c1ee155fb6ed0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1cf69feceb2242b9b6edd81e36d008be/3000.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "Wildfires forced Amanda Dengler to flee her home in Canada’s Northwest Territories three times in the past 18 months, and each time her cats have evaded her attempts to bring them along.",
      "publishedAt": "2023-08-26T06:44:00Z",
      "title": "Beloved pets in Canada rescued from wildfires by volunteers who stayed behind",
      "url": "https://apnews.com/0f39d170c159482515e4dfb44cea6a54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfc3d59d667b480bb6d3ade5c67fdd9f/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — Four astronauts from four countries rocketed toward the International Space Station on Saturday.They should reach the orbiting lab in their SpaceX capsule Sunday, replacing four astronauts living up there since March.",
      "publishedAt": "2023-08-26T07:31:07Z",
      "title": "New crew for the space station launches with 4 astronauts from 4 countries",
      "url": "https://apnews.com/0ec03f6b581b49c083f84bbe1c4371d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/669976850a9544fba730a48abe0456f8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}