{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — U.S. prosecutors charge a brigadier general in Iran's Revolutionary Guard with plotting to kill an activist in New York.",
      "publishedAt": "2024-10-22T16:31:12Z",
      "title": "U.S. prosecutors charge a brigadier general in Iran's Revolutionary Guard with plotting to kill an activist in New York",
      "url": "https://apnews.com/6a608ee512f96121a08c18aec2efc8bd",
      "urlToImage": ""
    },
    {
      "author": "SARAH EL DEEB, FARNOUSH AMIRI, and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — The Israeli military leveled a building in a suburb of Beirut on Tuesday that it said housed Hezbollah “facilities,” sending smoke and debris into the air a few hundred meters (yards) from where a spokesperson for the militant group had just briefed journalists about a weekend drone attack that damaged the Israeli prime minister's house.",
      "publishedAt": "2024-10-22T07:37:31Z",
      "title": "Israeli strike destroys building near Beirut as Blinken presses for Gaza cease-fire",
      "url": "https://apnews.com/5a8d5a051e05267007192ac5c8d80efd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/578018d957fb4a32bb564a7b121fc874/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER and JOEY CAPPELLETTI",
      "description": "WASHINGTON (AP) — Two weeks out from Election Day, the crisis in the Middle East is looming over the race for the White House, with one candidate struggling to find just the right words to navigate its difficult cross-currents and the other making bold pronouncements that the age-old conflict can quickly be set right.",
      "publishedAt": "2024-10-22T04:06:59Z",
      "title": "Mideast conflict looms over US presidential race as Harris and Trump jostle for an edge",
      "url": "https://apnews.com/623945957dac623c238041242e13340a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/073882e9bab94be7acf23e9d72985156/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Both Kamala Harris and Donald Trump see economic policy as their best chance to win Latino voters.",
      "publishedAt": "2024-10-22T09:02:16Z",
      "title": "Harris bets her policies can attract Latino voters while Trump touts his time as president to them",
      "url": "https://apnews.com/18e99a491ba6df73f61a8c6cca004fd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5228d44a693a48a0a82530d55f648957/2899.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "MACON, Ga. (AP) — Sabrina Friday scanned the room at Mother's Nest, an organization in Macon that provides baby supplies, training, food and housing to mothers in need, and she asked how many planned to vote.",
      "publishedAt": "2024-10-22T04:11:35Z",
      "title": "In battleground Georgia, some poor people see no reason to vote. That decision could sway election",
      "url": "https://apnews.com/34209a5bba0b2697eb6fcdd004dca584",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94c9b0e439d24614bd9a54e6071a8c4e/3000.jpeg"
    },
    {
      "author": null,
      "description": "KAZAN, Russia (AP) — China’s Xi Jinping, India’s Narendra Modi and other world leaders arrived Tuesday in the Russian city of Kazan for a summit of the BRICS bloc of developing economies that the Kremlin hopes to turn into a rallying point for defying Western influence in global affairs.",
      "publishedAt": "2024-10-22T09:33:12Z",
      "title": "Putin hosts Global South leaders at BRICS summit meant to counterbalance Western clout",
      "url": "https://apnews.com/39e90fce8443b922f4d224c65c2ec932",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4675acc2cae481e9387ef536dd1bc36/3000.jpeg"
    },
    {
      "author": "ANDREA RODRIGUEZ and MILEXSY DURAN",
      "description": "HAVANA (AP) — A small town in far eastern Cuba was recovering Tuesday from flooding that killed at least six people after Hurricane Oscar crossed the island’s eastern coast as a tropical storm with winds and heavy rain.",
      "publishedAt": "2024-10-21T04:49:59Z",
      "title": "Cuba fights to come back from a nationwide blackout, then a storm that killed six",
      "url": "https://apnews.com/b197e174af2c9f664d4c3aaf0c5a6e75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf90011c95d842c9a266b4e7b2802e1a/1920.jpeg"
    },
    {
      "author": "ANNIE MA",
      "description": "Dissent is thriving this fall at American colleges, and not just among student activists. With student protests limited by new restrictions, faculty have taken up the cause.To faculty, new protest rules threaten freedom of speech — and the freedom to think, both central to university life.",
      "publishedAt": "2024-10-22T04:05:07Z",
      "title": "New campus protest rules spur an outcry from college faculty",
      "url": "https://apnews.com/14da92667846c2b23a36eec64e1d8ff3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2910545fbd8a4dd3b67fe07cd5518ded/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Women living in states with abortion bans obtained the procedure in the second half of 2023 at about the same rate as before the U.S. Supreme Court overturned Roe v.",
      "publishedAt": "2024-10-22T13:00:30Z",
      "title": "Women in states with bans are getting abortions at similar rates as under Roe, report says",
      "url": "https://apnews.com/663be20ac1a40345ec5c8fe23ab43a60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/177a27ef3def4e8ea1dfeb1258d65faf/2470.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — Former Abercrombie &amp; Fitch CEO Mike Jeffries, his romantic partner and a third man were arrested Tuesday on charges of luring men into sex parties held around the world, sometimes by dangling the promise of modeling for the clothing retailer.",
      "publishedAt": "2024-10-22T13:54:23Z",
      "title": "Former Abercrombie & Fitch chief Mike Jeffries arrested on federal sex trafficking charges",
      "url": "https://apnews.com/f95f6b480dcb41e5365fa9b49f6206bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e3af67013154e3d9565fd24dc474ad8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}