{
  "articles": [
    {
      "author": "JILL COLVIN, JULIE CARR SMYTH, STEVE PEOPLES and ZEKE MILLER",
      "description": "MILWAUKEE (AP) — Former President Donald Trump chose Sen. JD Vance of Ohio as his running mate on Monday, picking a onetime critic who became a loyal ally and is now the first millennial to join a major-party ticket at a time of deep concern about the advanced age of America’s political leaders.",
      "publishedAt": "2024-07-15T11:46:56Z",
      "title": "Trump picks Sen. JD Vance of Ohio, a once-fierce critic turned loyal ally, as his GOP running mate",
      "url": "https://apnews.com/6cc438a8370a21b2631f5a53b06b71d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c83de5e1b37049e7bdde550a64c7fbb1/1920.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "COLUMBUS, Ohio (AP) — Former President Donald Trump on Monday chose U.S. Sen. JD Vance of Ohio to be his running mate as he looks to return to the White House.",
      "publishedAt": "2024-07-15T19:24:13Z",
      "title": "Who is JD Vance? Things to know about Donald Trump's pick for vice president",
      "url": "https://apnews.com/6500580aab0b451b0a176b9e9bf9901b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95958dab87f94b109fc83c14cfb90938/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO, STEVE PEOPLES and JILL COLVIN",
      "description": "MILWAUKEE (AP) — Cheering GOP delegates formally nominated Donald Trump for president at Monday’s Republican National Convention kickoff, less than two days after an assassination attempt on the former president and shortly after he announced Ohio Sen.",
      "publishedAt": "2024-07-15T11:11:03Z",
      "title": "Cheering GOP delegates nominate Trump for president as he announces Vance as running mate",
      "url": "https://apnews.com/58c09e396b79751c44baed14a1b432a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d61f1442834a4e7f92e7c53495049e81/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Donald Trump says Ohio Sen. JD Vance will be his vice presidential pick.",
      "publishedAt": "2024-07-15T11:56:56Z",
      "title": "The Latest: Trump picks Sen. JD Vance of Ohio as his Republican running mate",
      "url": "https://apnews.com/d86aeb42e5bc290c521ce94f5d49d899",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc3945bee773456f86bd17065e1d78fe/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "On a sweltering weekend evening, beneath a clear blue sky, Donald Trump supporters in red “Make America Great Again” hats packed the fairgrounds in Butler, Pennsylvania.It was a friendly and festive venue for the once and maybe future president's final rally before the Republican National Convention the following week.",
      "publishedAt": "2024-07-15T16:29:34Z",
      "title": "At the Trump rally, it was evening sun, songs and blue sky. Then came bullets, screams and blood",
      "url": "https://apnews.com/734900d303fcfbf349162047f8059601",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21293c5e596d4f9c8ba1e3a4f1cbead9/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO and NADIA LATHAN",
      "description": "AUSTIN, Texs (AP) — The majority of Houston outages that followed Hurricane Beryl should be fixed within the next two days, the city’s main utility company said Monday as Texas Gov. Greg Abbott threatened to punish CenterPoint Energy even after the lights come back.",
      "publishedAt": "2024-07-15T22:11:16Z",
      "title": "Texas governor criticizes Houston energy as utility says power will be mostly restored by Wednesday",
      "url": "https://apnews.com/23bb8aa69874c8019de237e5299492b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e532545b8cdb46e8916d7b25ad89750b/3000.jpeg"
    },
    {
      "author": "SOPHIE AUSTIN",
      "description": "SACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom signed a first-in-the-nation law Monday barring school districts from passing policies that require schools to notify parents if their child asks to change their gender identification.",
      "publishedAt": "2024-07-15T22:04:33Z",
      "title": "California is 1st state to ban school rules requiring parents get notified of child’s pronoun change",
      "url": "https://apnews.com/af387bef5c25c14f51d1cf05a7e422eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f22d563b484e435091609038fed8e18a/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and MELANIE LIDMAN",
      "description": "MUWASI, Gaza Strip (AP) — Hamas said Sunday that Gaza cease-fire talks were ongoing and the group’s military commander was in good health, a day after the Israeli military targeted Mohammed Deif with a massive airstrike that local health officials said killed at least 90 people, including children.",
      "publishedAt": "2024-07-14T13:45:44Z",
      "title": "Hamas says Gaza cease-fire talks haven't paused and claims military chief survived Israeli strike",
      "url": "https://apnews.com/728bb0842141ba246456422ebf93deb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3244e069d064628ab39974254b69e84/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A federal judge in Florida dismissed the classified documents case against former President Donald Trump on Monday, siding with defense lawyers who said the special counsel who filed the charges was illegally appointed by the Justice Department.",
      "publishedAt": "2024-07-15T14:03:59Z",
      "title": "Federal judge dismisses Trump classified documents case over concerns with prosecutor's appointment",
      "url": "https://apnews.com/c66d5ffb7ba86c1b991f95e89bdeba0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/778cde0a188d4cb78e8d79ac6876921a/3000.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "ARLINGTON, Texas (AP) — Paul Skenes looked like a summer intern reporting for duty in a light gray suit, white shirt and cream-colored tie, teenage acne on his face and wonder in his voice.In a ballpark filled with six dozen All-Stars, the 21-year-old Pittsburgh Pirates pitcher with 11 major league appearances was the center of attention.",
      "publishedAt": "2024-07-15T23:36:19Z",
      "title": "Paul Skenes in spotlight, starting All-Star Game after just 11 major league games",
      "url": "https://apnews.com/f3e94baee0c1004ff839d50c5f38a81e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a5129323f584f8d9d61f049662fa376/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}