{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike hit a school-turned-shelter in Gaza City early Saturday, killing at least 80 people, Palestinian health authorities said, in one of the deadliest strikes in the 10-month-old war between Israel and Hamas.",
      "publishedAt": "2024-08-10T04:26:06Z",
      "title": "An Israeli airstrike on a Gaza school kills at least 80 people, Palestinian health officials say",
      "url": "https://apnews.com/f33867d7596ebb70c1cb3a77fd4437cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34a7e5fd5ad141efb3db32d90cc35e1e/1920.jpeg"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "BOZEMAN, Mont. (AP) — Donald Trump traveled to Montana for a Friday night rally intended to drum up support for ousting the state's Democratic senator, but the former president's plane first had to divert to an airport on the other side of the Rocky Mountains because of a mechanical issue, according to airport staff.",
      "publishedAt": "2024-08-09T04:05:24Z",
      "title": "Donald Trump headlines Montana rally after plane was diverted but landed safely",
      "url": "https://apnews.com/b2030ef3b1249cafaeb21b755721920c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b80df4418494b5b9d0898ba96992755/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — “Mass Deportation Now!” declared the signs at the Republican National Convention, giving a full embrace to Donald Trump’s pledge to expel millions of migrants in the largest deportation program in American history.",
      "publishedAt": "2024-08-10T04:21:20Z",
      "title": "Trump is putting mass deportations at the heart of his campaign. Some Republicans are worried",
      "url": "https://apnews.com/ec64f85e3633c9c7a8a247eaf9feb64f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d63a0b64565045788fa6986ffe892af2/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and JOSH BOAK",
      "description": "LAS VEGAS (AP) — Vice President Kamala Harris is working to make Nevada look like less of a political gamble in November's election.The Democratic presidential nominee visits the state on Saturday with her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-10T04:01:25Z",
      "title": "In Las Vegas, Kamala Harris sees a chance to improve her odds of winning",
      "url": "https://apnews.com/ac21118dbb24290e46d32ad9669507d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d16525e1b20a44dcba0757be98f76a96/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE, GABRIELA SÁ PESSOA and DAVID KOENIG",
      "description": "VINHEDO, Brazil (AP) — Brazilian authorities worked Saturday to piece together what exactly caused the plane crash in Sao Paulo state the prior day that killed all 61 people on board.",
      "publishedAt": "2024-08-10T04:08:29Z",
      "title": "Brazilian authorities are investigating the cause of the fiery plane crash that killed 61",
      "url": "https://apnews.com/5c5a3371b5e899b745c1cb6e46950230",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9e33c442ad9468cbbbc13d66d136c8e/3000.jpeg"
    },
    {
      "author": null,
      "description": "SEOUL, South Korea (AP) — South Korea’s military says North Korea is again flying balloons likely carrying trash toward the South, adding to a bizarre psychological warfare campaign amid growing tensions between the war-divided rivals.",
      "publishedAt": "2024-08-10T11:23:29Z",
      "title": "Seoul says North Korea has flown more trash balloons toward South Korea",
      "url": "https://apnews.com/24d4e857a29f511aa93e6e60dc623650",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7cf3dec399641b9ad0dfdf471291886/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, MICHAEL HILL, MARK SCOLFORO and PATRICK WHITTLE",
      "description": "Debby finally moved out of the U.S. on Saturday after the storm spent the better part of week unleashing tornadoes and flooding, damaging homes and taking lives as it moved up the East Coast after first arriving in Florida as a hurricane.",
      "publishedAt": "2024-08-10T04:10:21Z",
      "title": "Debby finally moves out of the US, though risk from flooded rivers remains",
      "url": "https://apnews.com/a369f782a8e6fa18fdb7f722ade4b3c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f073224caf054c0d8714a2821cb79a49/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A swift Ukrainian incursion into Russia’s Kursk region was the largest such cross-border raid by Kyiv’s forces in the nearly 2½-year war, exposing Russia’s vulnerabilities and dealing a painful blow to the Kremlin.",
      "publishedAt": "2024-08-10T04:00:28Z",
      "title": "Ukraine’s foray into Russia’s border region embarrasses Putin. How will it affect the course of war?",
      "url": "https://apnews.com/11f29ae7a5c4aa7a1cef242418c72c79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a2668882b874832b6900cf8603fd8d7/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — Mars and Jupiter are cozying up in the night sky for their closest rendezvous this decade. They’ll be so close Wednesday, at least from our perspective, that just a sliver of moon could fit between them.",
      "publishedAt": "2024-08-10T11:00:14Z",
      "title": "Mars and Jupiter get chummy in the night sky. The planets won't get this close again until 2033",
      "url": "https://apnews.com/720b7f0cc67d4cb478f142eb846f3702",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/506ebe18260143f3942371608723dcb7/2828.jpeg"
    },
    {
      "author": "TOM NOUVIAN and JOHN LEICESTER",
      "description": "PARIS (AP) — The crowd at Roland Garros, the legendary home of French tennis that's now hosting Olympic boxing, erupted in applause as Nacer Zorgani's deep, resonant voice filled the venue.",
      "publishedAt": "2024-08-10T10:06:53Z",
      "title": "Meet Nacer Zorgani, the vision-impaired Para-judo athlete who doubles as boxing’s Olympic voice",
      "url": "https://apnews.com/606ae43b132d359fe531ed004a62de46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c646b6c28c240a7958b276630187f15/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}