{
  "articles": [
    {
      "author": "ZEKE MILLER, ELLEN KNICKMEYER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — Israel has agreed to put in place four-hour daily humanitarian pauses in its assault on Hamas in northern Gaza, the White House said Thursday, as President Joe Biden pressed Israelis for a multi-day stoppage in the fighting in a bid to negotiate the release of hostages held by the militant group.",
      "publishedAt": "2023-11-09T15:48:45Z",
      "title": "Israel agrees to 4-hour daily pauses in Gaza fighting to allow civilians to flee, White House says",
      "url": "https://apnews.com/b8fc613ffd8b9351c0dc37b90b6e10dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1414b74133994ae49af28a27f296e337/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — Fistfights break out in bread lines. Residents wait hours for a gallon of brackish water that makes them sick. Scabies, diarrhea and respiratory infections rip through overcrowded shelters.",
      "publishedAt": "2023-11-09T17:18:45Z",
      "title": "Fights in bread lines, despair in shelters: War threatens to unravel Gaza's close-knit society",
      "url": "https://apnews.com/f225bf0723bb5b3ae1961ba6cdef1917",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b243a9f66318463ea4c7f7f5d7a08d0f/3000.jpeg"
    },
    {
      "author": "JOHN RABY and LEAH WILLINGHAM",
      "description": "CHARLESTON, W.Va. (AP) — Democratic Sen. Joe Manchin of West Virginia announced Thursday that he won’t seek reelection in 2024, giving Republicans a prime opportunity to pick up a seat in the heavily GOP state.",
      "publishedAt": "2023-11-09T19:44:58Z",
      "title": "Democratic West Virginia Sen. Joe Manchin won't seek reelection, giving GOP a key pickup opportunity",
      "url": "https://apnews.com/35e5285934c5801db37215802ca2cd94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b46a0ae5e2b4b9ea5ee5459527e8945/1920.jpeg"
    },
    {
      "author": "BECKY BOHRER",
      "description": "JUNEAU, Alaska (AP) — A federal judge on Thursday upheld the Biden administration’s approval of the massive Willow oil-drilling project on Alaska’s remote North Slope, a decision that environmental groups swiftly vowed to fight.",
      "publishedAt": "2023-11-09T22:08:11Z",
      "title": "Judge in Alaska upholds Biden administration's approval of the massive Willow oil-drilling project",
      "url": "https://apnews.com/abf128e53eaf053005bffe771b7af574",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/348fe3c9cd2c4dc98f47dccb36a01f1f/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "NEW YORK (AP) — Surgeons have performed the world’s first transplant of an entire human eye, an extraordinary addition to a face transplant — although it’s far too soon to know if the man will ever see through his new left eye.",
      "publishedAt": "2023-11-09T15:30:52Z",
      "title": "Man receives the first eye transplant plus a new face. It's a step toward one day restoring sight",
      "url": "https://apnews.com/0d88cbb9d6190c64b53c01fafb9c2d9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/056903a87ac0452886b59ea037a3bfd4/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY, GENE JOHNSON and ED KOMENDA",
      "description": "WASHINGTON (AP) — Authorities were hunting Thursday for whoever sent suspicious letters — including some containing fentanyl — to elections offices in at least five states this week, delaying the counting of ballots in some local races in the latest instance of threats faced by election workers around the country.",
      "publishedAt": "2023-11-09T15:57:36Z",
      "title": "Election offices are sent envelopes with fentanyl or other substances. Authorities are investigating",
      "url": "https://apnews.com/5d39155be4b2fcd5481b570cc109cb9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2978e2ddca2a40168dfd3423112a9682/1920.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS, MICHAEL GOLDBERG and AYANNA ALEXANDER",
      "description": "JACKSON, Miss. (AP) — People in Mississippi's largest county are demanding answers about why some polling places ran out of ballots and voters had to wait for them to be replenished on the day the state was deciding its most competitive governor's race in a generation.",
      "publishedAt": "2023-11-09T05:06:45Z",
      "title": "Ballot shortages in Mississippi created a problem for democracy on the day of a governor's election",
      "url": "https://apnews.com/0eb722545983da2b8ad979d52c73aa72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/827329eb7d894d388b9db52d9763f769/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "GREENBELT, Md. (AP) — A former top prosecutor for the city of Baltimore was convicted on Thursday of charges that she lied about the finances of a side business to improperly access retirement funds during the COVID-19 pandemic, using the money to buy two Florida homes.",
      "publishedAt": "2023-11-09T21:11:01Z",
      "title": "Former top prosecutor for Baltimore convicted in perjury case tied to purchase of Florida homes",
      "url": "https://apnews.com/9456e8e513baca55b364a3cc9f6cbdbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f68b5a13653a461da9cf83cb1dfbfab5/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER and VALERIE GONZALEZ",
      "description": "AUSTIN, Texas (AP) — The white Honda Civic sped down Highway 57, a rural two-lane corridor that reaches the U.S.-Mexico border, after a Texas sheriff's deputy tried pulling over the car and gave chase when it didn't stop.",
      "publishedAt": "2023-11-09T23:15:13Z",
      "title": "Chase on Texas border that killed 8 puts high-speed pursuits in spotlight again",
      "url": "https://apnews.com/dfa9e4c89631033e27acd0447a32a0af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31abd28bfd5e4f378a18954e6cb2f2fa/2000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — A jury awarded more than $1.2 million to Robert De Niro’s former personal assistant Thursday, finding one of his companies responsible for subjecting her to a toxic work environment.",
      "publishedAt": "2023-11-09T21:58:48Z",
      "title": "Jury awards $1.2 million to Robert De Niro’s former assistant in gender discrimination lawsuit",
      "url": "https://apnews.com/07b4d5c932667ea1867ba9352946148d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e31c2658eac9478c9566ffb5f27f7881/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}