{
  "articles": [
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "SAVANNAH, Ga. (AP) — Vice President Kamala Harris and her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-29T04:18:21Z",
      "title": "Harris, Walz will sit down for first major television interview of their presidential campaign",
      "url": "https://apnews.com/94eff1aa1247e471b48948d03faf0edf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97a39c63dc0d41a69dd4dbde2146f78c/3000.jpeg"
    },
    {
      "author": "TARA COPP, ADRIANA GOMEZ LICON and HANNAH SCHOENBAUM",
      "description": "WASHINGTON (AP) — Donald Trump's campaign was warned about not taking photographs before an altercation at Arlington National Cemetery during a wreath-laying ceremony earlier this week to honor service members killed in the Afghanistan War withdrawal, a defense official told The Associated Press on Wednesday.",
      "publishedAt": "2024-08-28T20:29:46Z",
      "title": "Trump campaign was warned not to take photos at Arlington before altercation, defense official says",
      "url": "https://apnews.com/3f0331e9209336a9b696ec164be7eb1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/663bb0db89764b1ebaf643d498ee1bb5/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI and THOMAS BEAUMONT",
      "description": "LANSING, Mich. (AP) — Donald Trump is scheduled to campaign Thursday in Michigan and Wisconsin as the former president ramps up battleground state travel heading into the traditional Labor Day turn toward the fall election.",
      "publishedAt": "2024-08-29T04:11:58Z",
      "title": "Trump is visiting swing districts in Michigan and Wisconsin as battleground campaigning ramps up",
      "url": "https://apnews.com/0583faabae5e36000baa18c7b2bea752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4cce1679438e4f8d999538919190d469/2692.jpeg"
    },
    {
      "author": "MAJDI MOHAMMED and MELANIE LIDMAN",
      "description": "TULKAREM, West Bank (AP) — The Israeli military said it killed five more militants, including a local commander, early Thursday in the West Bank as it pressed ahead with what appeared to be the deadliest military operation in the occupied territory since the start of the war in Gaza.",
      "publishedAt": "2024-08-29T05:56:13Z",
      "title": "Israel kills prominent militant as it wages its deadliest West Bank raids since the Gaza war began",
      "url": "https://apnews.com/ee53e1dbf7ece94151088308510e8679",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3da02736c29f4fbdbc58aa8b9bb419fc/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "After three weeks of fighting, Russia is still struggling to dislodge Ukrainian forces from the Kursk region, a surprisingly slow and low-key response to the first occupation of its territory since World War II.",
      "publishedAt": "2024-08-29T04:36:28Z",
      "title": "Why Russia has struggled to halt Ukraine's incursion in the Kursk region",
      "url": "https://apnews.com/ca6d18d06606794580bdc779d2c98134",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f50d84e9ef64450da2daeb6aea1b95de/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Life, death, crime and taxes will be on ballots for voters to decide this fall. More than 140 measures are going before voters in 41 states during the general election alongside choices for president and other top offices.",
      "publishedAt": "2024-08-29T04:03:49Z",
      "title": "Ballot measures in 41 states give voters a say on abortion and other tough questions",
      "url": "https://apnews.com/6ef66d1c94fce24e3150d0ff4bf57a1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a9d772cf162401480b6defe7536187e/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — A strong storm lashed southern Japan with torrential rain and strong winds Thursday, causing at least three deaths as it started a crawl up the length of the archipelago and raised concerns of flooding, landslides and extensive damage.",
      "publishedAt": "2024-08-29T00:47:56Z",
      "title": "Strong storm lashes Japan with torrential rains and strong winds on its slow crawl northeast",
      "url": "https://apnews.com/5805bc825ea55e3f3736f1ae3283f154",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7ebf327f3db48c4b2fbc68896b54128/3000.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "BERLIN (AP) — The suspects in the foiled plot to attack Taylor Swift concerts in Vienna earlier this month sought to kill “tens of thousands” of fans before the CIA discovered intelligence that disrupted the planning and led to arrests, the agency's deputy director said.",
      "publishedAt": "2024-08-29T08:56:53Z",
      "title": "CIA official: Suspects in foiled plot to attack Taylor Swift shows aimed to kill 'tens of thousands'",
      "url": "https://apnews.com/7e454af63efcff2a3ab0a20c718aba8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c848134ad604db1933c034659eec0b7/3000.jpeg"
    },
    {
      "author": "BARBARA SURK and ANGELA CHARLTON",
      "description": "PARIS (AP) — French authorities handed preliminary charges to Telegram CEO Pavel Durov on Wednesday for allowing alleged criminal activity on his messaging app and barred him from leaving France pending further investigation.",
      "publishedAt": "2024-08-28T09:29:38Z",
      "title": "Telegram CEO Durov faces preliminary charges in France of allowing crime on messaging app",
      "url": "https://apnews.com/6e213d227458f330ed16e7fe221a696c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae57eb30bd344badaa99bef9baeb1587/1920.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "PORTO, Portugal (AP) — Porto takes pride in its beaches, old churches covered in blue-and-white tiles and its famous port wine named after the city in northern Portugal.It’s also home to a different kind of church — located on its beachfront suburbs along the Atlantic coast near a fishing town known for some of the world’s largest waves.",
      "publishedAt": "2024-08-29T04:19:06Z",
      "title": "Surf before you worship at this church in Portugal. Their motto: 'We love waves, we love Jesus.'",
      "url": "https://apnews.com/430638bf18320dc0068253c9973c42f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80a26a5265eb4e46883b7b3ab0bf19cc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}