{
  "articles": [
    {
      "author": "Lisa Mascaro, Kevin Freking, Leah Askarinam, Joey Cappelletti",
      "description": "House Republicans are preparing to vote on their multi-trillion-dollar package of tax breaks and program cuts as soon as Wednesday. They have been grinding out last-minute deal-making and an all-night committee hearing to shore up support and deliver on President Donald Trump’s top legislative priority. Trump himself had instructed the Republican majority to quit arguing and get it done. But GOP leaders worked late into the night to convince skeptical Republicans who have problems on several fronts, including worries that it will pile onto the nation’s $36 trillion debt. A new analysis from the nonpartisan Congressional Budget Office said the tax provisions would add $3.8 trillion to federal deficits.",
      "publishedAt": "2025-05-21T04:02:19Z",
      "title": "House GOP grinds ahead with Trump's tax cuts bill as report warns about deficit",
      "url": "https://apnews.com/article/congress-republicans-tax-cuts-bill-deficit-trump-2baff1acf9bdf6060fd584c93c97a88b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d259390/2147483647/strip/true/crop/3513x1976+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2F6a%2F01e3d68a399ff2d872cd06d5dabe%2F487b3fa55ba04f0e82e9dd3f1b8bdf16"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy, Melanie Lidman",
      "description": "Hospitals in Gaza say Israeli strikes overnight and into Wednesday have killed at least 45 people, including several women and a week-old infant. Israel began allowing dozens of humanitarian trucks into Gaza on Tuesday, but the aid has not yet reached Palestinians in desperate need, according to aid groups. In the southern city of Khan Younis, where Israel recently ordered new evacuations pending an expected expanded offensive, 24 people were killed, 14 of them from the same family. The week-old infant was killed in central Gaza.",
      "publishedAt": "2025-05-21T08:52:09Z",
      "title": "In Gaza, 45 killed in strikes as desperately needed aid fails to reach Palestinians",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-05-21-2025-11444e8b684b983dbb64daa5854b7b14",
      "urlToImage": "https://dims.apnews.com/dims4/default/050d410/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F33%2Fa07c8a6c9cd80b38b2026d7b24bd%2F3a9d20d3484d41329a3bf4dac9322f78"
    },
    {
      "author": "Sarah El Deeb",
      "description": "Two of northern Gaza’s last functioning hospitals have been encircled by Israeli troops, preventing anyone from leaving or entering the facilities. That's what hospital staff and aid groups said this week as Israel pursued its renewed offensive into the devastated Palestinian territory. The Indonesian hospital and Al-Awda hospital are among the region’s only surviving medical centers. Israeli authorities issued evacuation orders Friday for large parts of northern Gaza ahead of attacks intended to pressure the Hamas militant group to release more hostages. New evacuation orders followed Tuesday. The World Health Organization said hospitals in northern Gaza are at risk of shutting down completely.",
      "publishedAt": "2025-05-21T08:47:07Z",
      "title": "2 hospitals in northern Gaza are surrounded by Israeli troops, staff say",
      "url": "https://apnews.com/article/gaza-israel-palestinians-hamas-hospitals-health-war-c7e55bab701799808f7c881d4f5fcef9",
      "urlToImage": "https://dims.apnews.com/dims4/default/28db1cd/2147483647/strip/true/crop/6886x3873+0+358/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F9d%2F7e2901282351a444195d5008cb28%2Fe174e34502a344e4a5be151e05fe3585"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin has visited the Kursk region for the first time since Russia said it expelled Ukrainian forces from the area in April. The Kremlin said Wednesday that Putin visited Kursk on the border with Ukraine the day before. Ukrainian forces made a surprise incursion into Kursk in August 2024 in the largest cross-border raid by Kyiv’s forces in the nearly 2 ½-year war, before being pushed out my Russian troops nine months later. Ukraine has not confirmed its expulsion from the area. Putin visited Kursk Nuclear Power Plant-2, which is still under construction, and spoke at a closed meeting with selected volunteers.",
      "publishedAt": "2025-05-21T07:13:30Z",
      "title": "Putin visited the Kursk region for the first time since Russia said it expelled Ukrainian forces",
      "url": "https://apnews.com/article/russia-ukraine-war-kursk-drone-deaths-8757dc115948899600d15ac8e32cc4ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/5cab63a/2147483647/strip/true/crop/4199x2362+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F1c%2Fe616e60be231b27becfbbfcc6e8e%2F4cebe6eb5c4f45edb515d98466a7aab0"
    },
    {
      "author": "Abdul Sattar, Munir Ahmed",
      "description": "Officials say a suicide car bomber struck a school bus in southwestern Pakistan, killing five people, including at least three children and wounding 38 others. A local deputy commissioner said the attack occurred in Khuzdar, a district in Balochistan province, as the bus was transporting children to their school in the city. No group immediately claimed responsibility, though suspicion is likely to fall on ethnic Baloch separatists, who frequently target security forces and civilians in the region. Balochistan has been the scene of a long-running insurgency, with an array of separatist groups staging attacks, including the outlawed Balochistan Liberation Army, designated as a terror organization by the United States in 2019.",
      "publishedAt": "2025-05-21T05:22:23Z",
      "title": "Suicide car bombing hits a school bus in Pakistan, killing 5",
      "url": "https://apnews.com/article/pakistan-baluchestan-suicide-bombing-school-bus-2cfd2c0f98752e775ca47a5cb66083ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/26194f8/2147483647/strip/true/crop/2280x1283+0+118/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2Fbb%2F8df49eba4b361f1580a84994fbeb%2F7e12d5a6ef2f4ee29687479057149b9e"
    },
    {
      "author": null,
      "description": "Democratic Rep. LaMonica McIver of New Jersey is set to have her first appearance in federal court on assault charges stemming from immigration officials’ attempt to arrest the Newark mayor outside a detention facility. The hearing is set for Wednesday. The interim U.S. Attorney for New Jersey, Alina Habba, charged McIver, a twice-elected member of Congress, this week with two counts of assaulting, resisting and impeding an officer. McIver has denied the charges, and Democrats have rallied to her defense. The prosecutor’s complaint says McIver attempted to block the arrest of Mayor Ras Baraka and pushed into and grabbed federal agents.",
      "publishedAt": "2025-05-21T10:35:45Z",
      "title": "New Jersey Rep. LaMonica McIver due for court appearance on assault charges",
      "url": "https://apnews.com/article/lamonica-mciver-ice-assault-charge-new-jersey-2e6403ecb933882e641557303cdc6b2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e1c766/2147483647/strip/true/crop/4000x2250+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F59%2F32961225bd7a72d90c481016ea86%2F7c80ba20ab5e47f5bf436d57079f9062"
    },
    {
      "author": null,
      "description": "Immigration authorities appear to have begun deporting migrants from Myanmar and Vietnam to South Sudan, attorneys for the migrants said in court documents filed Tuesday. Those removals would violate a court order against deporting people to countries other than their homelands without an opportunity to file court challenges, they argued. The Department of Homeland Security did not immediately return messages seeking comment.",
      "publishedAt": "2025-05-20T20:58:11Z",
      "title": "US immigration authorities appear to have begun deporting migrants to South Sudan, attorneys say",
      "url": "https://apnews.com/article/deportation-immigration-south-sudan-department-of-homeland-security-300e8c704402e2cb3c920d251b7fa876",
      "urlToImage": "https://dims.apnews.com/dims4/default/462e3fa/2147483647/strip/true/crop/5058x2845+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2Fae%2F7e59172771161dbf8c56cf61ac78%2Fe74eaff103a148b6aad88b672f1d7855"
    },
    {
      "author": "The Associated Press",
      "description": "U.S. President Donald Trump’s plan for a “Golden Dome” to protect the United States from long-range missiles was at least partly inspired by Israel’s multitiered missile defenses. Israel, with U.S. support, has over decades developed a sophisticated system, often collectively referred to as the “Iron Dome.” It is capable of detecting incoming fire and deploying only if the projectile is headed toward a population center or sensitive military or civilian infrastructure. Israeli leaders say the system isn’t 100% guaranteed, but credit it with preventing serious damage and countless casualties during the conflict unleashed by Hamas’ Oct. 7, 2023, attack.",
      "publishedAt": "2025-05-21T06:04:04Z",
      "title": "Trump's 'Golden Dome' missile defense plan was inspired by Israel's multitiered defenses",
      "url": "https://apnews.com/article/trump-golden-dome-israel-missile-defense-iron-da9f728b6849ebba968b4b456adb26ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/1fe7d04/2147483647/strip/true/crop/3478x1956+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fb7%2Fcbeabb235f91b030de1ee9e78ea3%2F3619379c860947d783effe16ff744d88"
    },
    {
      "author": "Jack Brook, Sara Cline",
      "description": "Authorities have arrested an Orleans Parish Sheriff's Office maintenance worker in connection with the escape of 10 jail inmates. The office said in a statement Tuesday that Sterling Williams admitted he turned the water off in a cell before the men slipped away through a hole behind the toilet. Williams told authorities an inmate threatened to stab him if he didn't help. Orleans Parish Sheriff Susan Hutson last week told reporters her agency had suspended three employees pending an investigation into the escape early Friday. Four of the fugitives have been apprehended and six remain at large.",
      "publishedAt": "2025-05-20T14:08:34Z",
      "title": "A New Orleans jail worker is charged after admitting he helped inmates to escape",
      "url": "https://apnews.com/article/new-orleans-jail-escape-inmates-arrest-45f2a4be028254cc2587f50deb9af44d",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c1bd7e/2147483647/strip/true/crop/5000x2813+0+9/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Fb1%2Fbb5dde0dec4f7365b308d01246eb%2F88b2efc7a6a34e2ab75c46792f438fa6"
    },
    {
      "author": "Megan Janetsky, Félix Márquez",
      "description": "A pack of veterinarians clamber over hefty metal crates of animals they load one-by-one onto a fleet of semi-trucks. Tigers, monkeys, jaguars, elephants and lions are the latest to flee a wave of cartel violence eclipsing the northern Mexican city of Culiacan. For years, exotic pets of cartel members and circus animals have been living in a small animal refuge on the outskirts of Sinaloa’s capital. But rival Sinaloa cartel factions started a bloody power struggle last year. The stretching violence has transformed life in the region, leaving the leaders of the Ostok Sanctuary reeling from armed attacks, constant death threats and a cutoff from essential supplies needed to keep their 700 animals alive.",
      "publishedAt": "2025-05-20T18:53:09Z",
      "title": "Tigers, jaguars and elephants are the latest to flee cartel violence in Mexico's Sinaloa",
      "url": "https://apnews.com/article/sinaloa-violence-animals-refuge-cartels-cc41ee64c385537edd5289c24c03979f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7942f3a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F2f%2F2a7249ab88e8dacd7e53ddc83942%2F1614c753f7c745a0a8528bf2353d883c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}