{
  "articles": [
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Palestinian health officials say Israeli strikes overnight and into Sunday killed 10 people in the Gaza Strip, mostly women and children. Two of the strikes hit tents in the southern city of Khan Younis, each killing two children and their parents. Other strikes killed a child and a man riding a bicycle, according to Nasser Hospital, which received bodies from all the strikes. The Israeli military says it only targets militants and tries to avoid harming civilians. It blames Hamas for civilian deaths in the 19-month-old war because the militants are embedded in densely populated areas. There was no immediate Israeli comment on the latest strikes.",
      "publishedAt": "2025-05-11T06:25:10Z",
      "title": "Israeli strikes on Gaza kill 10 people, mostly women and children",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-05-11-2025-6a562aa1c6ce81bcc9ff4649e39ab937",
      "urlToImage": "https://dims.apnews.com/dims4/default/4eace61/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F31%2Fa6fcefccd1c6f2411dee94f7a450%2F035e99094c5d4b53af2f7a197613dea8"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy says he is pleased to see that Russia is finally engaging with finding an end to the war, but there must be a ceasefire before peace talks can start. Calling it a “positive sign,” he said in a post on X Sunday that “the entire world has been waiting for this for a very long time. And the very first step in truly ending any war is a ceasefire.” Russian President Vladimir Putin in remarks to the media overnight effectively rejected the ceasefire proposal and proposed restarting direct talks with Ukraine in Istanbul on May 15 instead.",
      "publishedAt": "2025-05-11T08:32:26Z",
      "title": "Ukrainian president welcomes Russian overtures but insists on ceasefire before peace talk",
      "url": "https://apnews.com/article/russia-ukraine-war-ceasefire-2b3d2fad88436c5406ea63f81ac554ef",
      "urlToImage": "https://dims.apnews.com/dims4/default/09b03ee/2147483647/strip/true/crop/5000x2813+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F15%2F505170ed1ddbc772ba9d2b82f075%2F47a85f1fedd6499fbeaaeef8b44612ff"
    },
    {
      "author": "Jamey Keaten, Christopher Bodeen",
      "description": "The U.S. and China have resumed crucial tariff talks that have put the global economy on edge, but appeared to have diverging views of where the negotiations presently stand. President Donald Trump said on social media that “great progress” was being made and even suggested a “total reset” was a possibility as the sides took their seats for the second and final scheduled day of discussions in Geneva. Beijing has yet to comment directly, but its official news agency took a tough approach Saturday, saying China will “firmly reject any proposal that compromises core principles or undermines the broader cause of global equity.” No breakthroughs were announced after 10 hours of discussions on the opening day.",
      "publishedAt": "2025-05-11T09:30:41Z",
      "title": "US and China begin 2nd day of tariff talks. No breakthroughs but Trump touts 'great progress'",
      "url": "https://apnews.com/article/china-us-switzerland-tariffs-negotiations-20f32dd4f11b66bfd73bd105b7acad5a",
      "urlToImage": "https://dims.apnews.com/dims4/default/afa9af3/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Fc2%2F1ecbfbd169eee806339cb5dc712e%2Fa2616bd0547d44a6b1771c8f3a343f47"
    },
    {
      "author": "Munir Ahmed, Aijaz Hussain, Sheikh Saaliq",
      "description": "India says its strikes into Pakistan-controlled Kashmir and Pakistan on Wednesday killed more than 100 militants. Residents and officials in the disputed Kashmir region say there was overnight fighting between Pakistani and Indian troops, despite a ceasefire, but the clashes subsided by Sunday morning. As part of the ceasefire announced a day earlier, the nuclear-armed neighbors agreed to immediately stop all military action on land, in the air and at sea. They accused each other of repeatedly violating the deal hours later. The recent escalation in violence followed a gun massacre of tourists in Indian-controlled Kashmir and is the most serious military confrontation between them in decades.",
      "publishedAt": "2025-05-11T09:09:08Z",
      "title": "India claims its strikes inside Pakistan territory last week killed over 100 militants",
      "url": "https://apnews.com/article/pakistan-india-ceasefire-kashmir-6fa80010fa8ffee1da1f28e7b593aa2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/e07d7c8/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F03%2F4870fb6627ac6331b80ef3ab95bf%2F6ab3d91577f64ee2b8e614ea4609cb42"
    },
    {
      "author": "Zeke Miller, Will Weissert",
      "description": "President Donald Trump reportedly is ready to accept a luxury Boeing 747-8 jumbo jet as a gift from the ruling family of Qatar during his trip to the Middle East this coming week, and U.S. officials say it could be converted into a potential presidential aircraft. The Qatari government acknowledged discussions between the two countries about “the possible transfer” of a plane to be used temporarily as Trump’s Air Force One, but denied that the jet “is being gifted” or a decision made. ABC News reported that Trump will use the aircraft at his presidential plane until shortly before he leaves office in January 2029, when ownership will be transferred to the foundation overseeing his yet-to-be-built presidential library.",
      "publishedAt": "2025-05-11T15:35:18Z",
      "title": "Trump is reportedly set to accept a jet from Qatar's ruling family",
      "url": "https://apnews.com/article/trump-qatar-gift-jet-air-force-one-7f9afb461c6b3ac16fca3bb0973715ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bb810d/2147483647/strip/true/crop/4505x2534+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F88%2F6eb23c0a9719485ade637f02df3b%2F544e008651bd498b93cba817ea0280ef"
    },
    {
      "author": "Will Weissert, Amanda Seitz",
      "description": "President Donald Trump says he’ll sign an executive order that, if implemented, could bring down the costs of some medications. He's reviving a failed effort from his first term on an issue he’s talked up since even before he became president. The order Trump is promising to sign Monday will direct the Department of Health and Human Services to tie what Medicare pays for medications administrated in a doctor’s office to the lowest price paid by other countries. In his post Sunday on his social media site, Trump said: “I will be instituting a MOST FAVORED NATION’S POLICY whereby the United States will pay the same price as the Nation that pays the lowest price anywhere in the World.\"",
      "publishedAt": "2025-05-11T23:17:19Z",
      "title": "Trump to sign executive order to cut prices of medicines",
      "url": "https://apnews.com/article/trump-prescription-drugs-most-favored-nation-35c281b542f0f3938489ee7e9360322b",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3be99c/2147483647/strip/true/crop/4966x2793+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F2c%2Fa4ec3858b48224502293eddebe15%2Fc07f49e079da4cdb998abe010c115503"
    },
    {
      "author": "JoNel Aleccia",
      "description": "A new study shows that people Zepbound lost about 50% more weight than those using Wegovy. It was the first head-to-head trial of the blockbuster weight-loss medications. Participants who took tirzepatide — which is sold as Zepbound by Eli Lilly — lost an average of 50 pounds over 72 weeks. Those who took semaglutide — known as Novo Nordisk's Wegovy, lost about 33 pounds. The study was published Sunday and presented at an obesity conference in Spain. Zepbound targets two hormones that regulate appetite and feelings of fullness. Wegovy targets one of those hormones.",
      "publishedAt": "2025-05-11T22:01:47Z",
      "title": "Zepbound beats Wegovy for weight loss in first head-to-head trial of blockbuster drugs",
      "url": "https://apnews.com/article/zepbound-wegovy-weight-loss-drugs-2df62bb4f1270bdfbeed61b7661f535e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e14b93f/2147483647/strip/true/crop/2836x1595+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2Fff%2F737ce3caddc6fed77b30378ed705%2F69cbd2500a00497190da6004b7fe3631"
    },
    {
      "author": "Teresa Cerojano",
      "description": "Even though he is detained in The Hague, former Philippine President Rodrigo Duterte is among the candidates vying for some 18,000 national and local seats in Monday’s midterm elections. Analysts say the polls will decide if he and his family continue to hold political power in the Philippines. Duterte is widely expected to win as Davao mayor, a position he held for over two decades before becoming president in 2016. Duterte has been in custody of the International Criminal Court since March, awaiting trial for crimes against humanity over his war on illegal drugs that left thousands of suspects dead. Criminal suspects are not banned from seeking office in the Philippines until their convictions are final.",
      "publishedAt": "2025-05-11T23:07:14Z",
      "title": "Detained ex-President Duterte is among the candidates in Philippines midterms",
      "url": "https://apnews.com/article/philippines-midterm-election-duterte-c0767b6cea1eca5a732e2c5eb5e01d79",
      "urlToImage": "https://dims.apnews.com/dims4/default/dbce583/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2F1f%2F325cb0bf7bc5204e4e963d3b3234%2Fd20dfc3a39dd4ab2b0487daa2de7fa96"
    },
    {
      "author": "Gerald Imray",
      "description": "A group of 49 white South Africans has departed their homeland for the United States on a private charter plane having been offered refugee status by the Trump administration. The group, which included families and small children, left Johannesburg on Sunday and was due to arrive at Dulles International Airport outside Washington on Monday morning local time. That's according to Collen Mbisi, a spokesperson for South Africa’s transport ministry. They are the first Afrikaners — a white minority group in South Africa — to be relocated after the Trump administration accused South Africa’s Black-led government of racial persecution against them. South Africa said those claims are “completely false.”",
      "publishedAt": "2025-05-11T22:09:55Z",
      "title": "First group of 49 white South Africans leaves for the US after Trump offered them refugee status",
      "url": "https://apnews.com/article/south-africa-us-refugees-trump-98a72fdb1f71edc960136b92cbd62db4",
      "urlToImage": "https://dims.apnews.com/dims4/default/053778e/2147483647/strip/true/crop/3968x2232+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2Fd1%2F2056e0443b3ba2556f795dc19e98%2Fb7d9d629bd4a4676aca93875ae6f83cf"
    },
    {
      "author": "The Associated Press",
      "description": "Transportation Secretary Sean Duffy plans to reduce the number of flights in and out of the Newark Liberty International Airport for the “next several weeks.” New Jersey’s largest airport has struggled with radar outages and numerous flight delays and cancellations due to a shortage of air traffic controllers. The latest problem was Sunday when a telecommunications issue briefly slowed traffic. Duffy said on NBC's “Meet the Press” that he will convene a meeting with airlines flying out of Newark to determine the reduction in traffic. He said there will be a larger reduction in the afternoons when international arrivals make the airport busier.",
      "publishedAt": "2025-05-11T13:01:33Z",
      "title": "Another issue disrupts Newark's airport",
      "url": "https://apnews.com/article/newark-airport-flight-reduction-transportation-secretary-sean-duffy-ad7ba9d37c41425c2b7ae23a2772e313",
      "urlToImage": "https://dims.apnews.com/dims4/default/62875b7/2147483647/strip/true/crop/2743x1543+0+143/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F62%2Fb87e408fcae7321b10dc53de46b2%2F01269b52859d48cb9f83dec2a609ec33"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}