{
  "articles": [
    {
      "author": "JONATHAN J. COOPER, MICHELLE L. PRICE and GABRIEL SANDOVAL",
      "description": "PHOENIX (AP) — Robert F. Kennedy Jr. suspended his independent campaign for the White House and endorsed Donald Trump on Friday, a late-stage shakeup of the race that could give the former president a modest boost from Kennedy’s supporters.",
      "publishedAt": "2024-08-23T03:29:03Z",
      "title": "RFK Jr. suspends his presidential bid and backs Donald Trump before appearing with him at his rally",
      "url": "https://apnews.com/a2638f89ddcb5de03edbe4574ca17d45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2342a1f581954110a01b0fe5333430a9/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES and ZEKE MILLER",
      "description": "CHICAGO (AP) — Over and over, from the massive stage in the electric convention hall, the Democrats this week predicted Kamala Harris would defeat Donald Trump.",
      "publishedAt": "2024-08-23T05:05:41Z",
      "title": "The 'joyful' Democratic convention is over. The real test for Kamala Harris' campaign now begins",
      "url": "https://apnews.com/7846ddab4b7bd64d38e255285e6649d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e039ea9e486454ea2fbe7c8125ceb92/2296.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — With anger over the war in Gaza simmering, Vice President Kamala Harris tried to defuse one of the most divisive issues within the Democratic Party on the biggest political stage of her life.",
      "publishedAt": "2024-08-23T14:44:45Z",
      "title": "Harris confronts Democratic divisions over Gaza war in convention speech",
      "url": "https://apnews.com/352811a116d0618acea7ae6bcd10573a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/647dbbb26d3a4d07b094479dc72bbba8/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and GEIR MOULSON",
      "description": "SOLINGEN, Germany (AP) — An attacker with a knife killed three people and seriously wounded at least five late Friday at a festival in the western German city of Solingen, authorities said.",
      "publishedAt": "2024-08-23T21:09:19Z",
      "title": "An attack at a festival in a German city kills 3 people and seriously wounds at least 5",
      "url": "https://apnews.com/a149974357736806f880df798a291552",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59f3007d67004be3ab305d5b9d3c0705/1920.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — Federal Reserve Chair Jerome Powell all but proclaimed victory in the fight against inflation and signaled that interest rate cuts are coming in a much-anticipated speech Friday in Jackson Hole, Wyoming.",
      "publishedAt": "2024-08-23T16:18:05Z",
      "title": "Takeaways from Fed Chair Powell's speech at Jackson Hole",
      "url": "https://apnews.com/7189ad9bf7cb2ad65ca8bad3949ab713",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de82f4c7617e430a9101e2b6ca4f62cf/3000.jpeg"
    },
    {
      "author": "JONATHAN MATTISE and TRAVIS LOLLER",
      "description": "MEMPHIS, Tenn. (AP) — Federal prosecutors agreed to recommend a prison sentence of no more than 40 years for a former Memphis police officer who pleaded guilty Friday to federal civil rights violations in the 2023 fatal beating of Tyre Nichols.",
      "publishedAt": "2024-08-23T05:18:33Z",
      "title": "A 2nd ex-Memphis officer pleads guilty in Tyre Nichols' death. He could serve 40 years in prison",
      "url": "https://apnews.com/40071853f59747c116fb69fd4f3fde70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6bbfbd1efa04a998e0f31c0728dbb08/3000.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO",
      "description": "At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.",
      "publishedAt": "2024-08-23T20:07:12Z",
      "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt",
      "url": "https://apnews.com/f96d0d1dc85ca3d33e74eafc1177ff0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42d90d97a4c640479dd99b91a2abb05c/3000.jpeg"
    },
    {
      "author": "MARGERY A. BECK",
      "description": "LINCOLN, Neb. (AP) — Nebraska voters will choose between two competing abortion measures to either expand abortion rights or limit them to the current 12-week ban — a development likely to drive more voters to the polls in a state that could see one of its five electoral votes up for grabs in the hotly contested presidential race.",
      "publishedAt": "2024-08-23T16:28:59Z",
      "title": "Competing measures to expand or limit abortion rights will appear on Nebraska’s November ballot",
      "url": "https://apnews.com/513d8bde38f15dee16e9cd216070d704",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ae8bd2f6ed74eaca70c3b834dc50dc0/3000.jpeg"
    },
    {
      "author": "ROB GILLIES and JOSH FUNK",
      "description": "TORONTO (AP) — A workers union on Friday threatened a strike at one of Canada’s two major freight railroads, only hours after the company’s trains restarted following a potentially devastating stoppage. A government-ordered arbitration hearing wrapped up without a decision, and Canadian National trains were expected to keep moving at least through Monday morning.",
      "publishedAt": "2024-08-23T11:53:26Z",
      "title": "Arbitration hearing between Canadian railroads and union ends with no decision on back-to-work order",
      "url": "https://apnews.com/6e13bb31a3708d11e961174e6c47a558",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffcac535e09543f089c4d4fb5507a5f3/3000.jpeg"
    },
    {
      "author": "KATE PAYNE, CURT ANDERSON and JEFF MARTIN",
      "description": "FORT WALTON BEACH, Fla. (AP) — A Florida sheriff’s deputy was charged with manslaughter with a firearm, launching a rarely seen criminal case against a Florida law officer after a Black U.S.",
      "publishedAt": "2024-08-23T16:37:33Z",
      "title": "Prosecutor says ex-sheriff's deputy charged with manslaughter in shooting of an airman at his home",
      "url": "https://apnews.com/f6a2d835376040c84298e12ca8b17f69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/167678f9f81d4f9da55d38ce56757d01/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}