{
  "articles": [
    {
      "author": "SETH BORENSTEIN, MARY KATHERINE WILDEMAN and BOBBY CAINA CALVAN",
      "description": "KIHEI, Hawaii (AP) — Hurricane-fueled flash floods and mudslides. Lava that creeps into neighborhoods. Fierce drought that materializes in a flash and lingers. Earthquakes. And now, deadly fires that burn block after historic block.",
      "publishedAt": "2023-08-16T19:07:39Z",
      "title": "Fires and others disasters are increasing in Hawaii, according to this AP data analysis",
      "url": "https://apnews.com/0344e3c954db7e0635cdaa8e87e25c92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/072b3c5618d94c9d9ede8718440ddbdb/3000.jpeg"
    },
    {
      "author": "ANNE M. PETERSON",
      "description": "U.S. women's national team coach Vlatko Andonovski has resigned, a person familiar with the decision told The Associated Press on Wednesday.The move comes less than two weeks after the Americans were knocked out of the Women's World Cup earlier than ever before.",
      "publishedAt": "2023-08-17T00:28:20Z",
      "title": "US women’s national team coach Vlatko Andonovski resigns after early World Cup exit, AP source says",
      "url": "https://apnews.com/f7bee4f5a7e489d54f9c853e01fe8ba6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c38fb5bdf2244bb7b209b2241e6675cd/3000.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "RALEIGH, N.C. (AP) — Transgender youth in North Carolina lost access Wednesday to gender-affirming medical treatments after the Republican-led General Assembly overrode the governor’s vetoes of that legislation and other bills touching on gender in sports and LGBTQ+ instruction in the classroom.",
      "publishedAt": "2023-08-16T05:04:24Z",
      "title": "Veto overridden: Ban on gender-affirming care for minors takes effect in North Carolina",
      "url": "https://apnews.com/536351cc360a92cdd21f298f6212e6d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6492b24ee1b6460ea69bb9dc019c2e67/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — The prosecutor in Atlanta who obtained an indictment this week against former President Donald Trump and 18 others wants to take the case to trial in March.",
      "publishedAt": "2023-08-16T19:27:06Z",
      "title": "Georgia prosecutor seeks March trial date for Trump and 18 others in election case",
      "url": "https://apnews.com/892156d8658d9fe86d47ae3828c54cb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9fdf62f4d104947a2ae83458038b973/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — Americans are deeply divided along party lines in their views of President Donald Trump's actions in the most recent criminal cases brought against him, a new poll shows, with about half saying his alleged attempt to interfere in Georgia's 2020 vote count was illegal.",
      "publishedAt": "2023-08-16T10:20:36Z",
      "title": "Americans are divided along party lines over Trump’s actions in election cases, AP-NORC poll shows",
      "url": "https://apnews.com/b6140eed88b3153e41dbf9e008d5a21b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b9c8dfa78ef4c8e87b685ac122c5d6d/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "DENVER (AP) — Destinee Thompson was supposed to be on her way to lunch with her stepmother in August 2021 when Colorado police, mistaking her for a robbery suspect, fatally shot the pregnant mother as she fled in her minivan.",
      "publishedAt": "2023-08-16T23:41:26Z",
      "title": "Police who fatally shot a pregnant woman are sued by her family in Colorado",
      "url": "https://apnews.com/39bb890fa3522cb0b0f8a910d578cc1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/929360d8ed4744148244231964925afd/2016.jpeg"
    },
    {
      "author": null,
      "description": "YELLOWKNIFE, Northwest Territories (AP) — Residents in the capital of Canada's Northwest Territories were ordered to evacuate Wednesday night as wildfires neared the city of 20,000 people.People in the four areas of Yellowknife at highest risk should leave as soon as possible and residents in other areas have until noon Friday to leave, the Northwest Territories government said.",
      "publishedAt": "2023-08-17T03:51:55Z",
      "title": "Residents in the capital of Canada’s Northwest Territories ordered to evacuate as wildfires near",
      "url": "https://apnews.com/ca509a053f45f3797b93286f94d6b198",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cf8aaabc71e40cc8f18159decf2c076/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Nicaragua’s government has confiscated a prestigious Jesuit-run university alleging it was a “center of terrorism,” the college said Wednesday in announcing the latest in a series of actions by authorities against the Catholic Church and opposition figures.",
      "publishedAt": "2023-08-16T20:29:32Z",
      "title": "Nicaraguan government seizes highly regarded university from Jesuits",
      "url": "https://apnews.com/ad18d55bc08a9ab2b9aaf4de54899c51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92eed71ab420474bb740681e2dc04a4b/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "NEW YORK (AP) — Surgeons transplanted a pig’s kidney into a brain-dead man and for over a month it's worked normally — a critical step toward an operation the New York team hopes to eventually try in living patients.",
      "publishedAt": "2023-08-16T14:04:12Z",
      "title": "Pig kidney works in a donated body for over a month, a step toward animal-human transplants",
      "url": "https://apnews.com/a28c56bb67314d11d9e8e34763f3ad34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/447e9d5ff21045e6b808d74cde042d38/1920.jpeg"
    },
    {
      "author": "KEVIN McGILL",
      "description": "NEW ORLEANS (AP) — Mail-order access to a drug used in the most common form of abortion in the U.S. would end under a federal appeals court ruling issued Wednesday that cannot take effect until the Supreme Court weighs in.",
      "publishedAt": "2023-08-16T18:48:28Z",
      "title": "An appeals court backs some abortion drug limits, pending the Supreme Court's approval",
      "url": "https://apnews.com/402be732d162af449c40ed1315cfb851",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4efed8074db94077864daa9ea06142c7/2470.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}