{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "President Donald Trump's attempt to cut the federal workforce has been blocked by a Boston judge. His comments about permanently resettling Palestinians in Gaza continue to stir anger on all sides.",
      "publishedAt": "2025-02-06T08:52:00Z",
      "title": "Live updates: Judge temporarily blocks Trump plan offering incentives for federal workers to resign",
      "url": "https://apnews.com/live/trump-presidency-updates-2-6-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/831fe2b/2147483647/strip/true/crop/3473x1954+0+181/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2Fd9%2Fffababbc173cc979f959f2c2c837%2F0a3d4fa13a1f492e94c07d82ad800b3a"
    },
    {
      "author": "AAMER MADHANI",
      "description": "President Donald Trump says at a private religious group's Washington prayer breakfast he's forming a commission on religious liberty. Trump also said at the hotel ballroom event Thursday he'll name Attorney General Pam Bondi to lead a task force to “eradicate anti-Christian bias.” Earlier in the day, Trump advocated at the National Prayer Breakfast at the Capitol for Americans to “bring God back” into their lives and said his relationship with religion “changed” after a pair of failed assassination attempts last year. Trump joined a more than 70-year-old Washington tradition that brings together a bipartisan group of lawmakers for fellowship. The nondenominational Christian says he believes “you can’t be happy without religion.”",
      "publishedAt": "2025-02-06T11:34:59Z",
      "title": "Trump tells prayer breakfast he wants to root out 'anti-Christian bias' and urges 'bring God back'",
      "url": "https://apnews.com/article/trump-national-prayer-breakfast-30ff6f55a2e3c7b8643a15e7b158537d",
      "urlToImage": "https://dims.apnews.com/dims4/default/831fe2b/2147483647/strip/true/crop/3473x1954+0+181/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2Fd9%2Fffababbc173cc979f959f2c2c837%2F0a3d4fa13a1f492e94c07d82ad800b3a"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Vice President JD Vance recently cited medieval Catholic theology in justifying the immigration crackdown under President Donald Trump. “Just google ‘ordo amoris,’” he posted Jan. 30 on the social media platform X. The concept has been translated as “order of love” or “order of charity.” The ancient St. Augustine said everyone and everything should be loved in its own proper way. “But since you cannot do good to all, you are to pay special regard to those who ... are brought into closer connection with you,\" Augustine wrote. The medieval St. Thomas Aquinas echoed this theme but added sometimes one must help a stranger in greater need than a family member.",
      "publishedAt": "2025-02-06T13:03:21Z",
      "title": "What is 'ordo amoris?' Vice President JD Vance invokes this medieval Catholic concept",
      "url": "https://apnews.com/article/jd-vance-catholic-theology-migration-e868af574fb2e742c6ed3d756c569769",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6ae01d/2147483647/strip/true/crop/6199x3487+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F71%2Fde645028d4307cc7dbd89ac014c0%2F5e907158d6ad4eb5a74a999b9d3b8a92"
    },
    {
      "author": "MARCIA DUNN",
      "description": "Telescopes around the world have spotted a monster radio jet streaming from a quasar dating back to the first 1 billion years of the universe. At double the width of our Milky Way Galaxy, this jet of radio waves is the biggest ever detected in the early universe. Astronomers announced the discovery Thursday. They say radio jets like this are not uncommon in our cosmic neighborhood, but elusive in the distant early universe. The double-sided radio wave is estimated to be at least 200,000 light-years across. Quasars are among the universe's brightest objects.",
      "publishedAt": "2025-02-06T18:42:03Z",
      "title": "Telescopes spy a monster radio jet streaming from a bright and early object in the universe",
      "url": "https://apnews.com/article/universe-quasar-monster-radio-het-0822cd50b4f39c5902146c1ea893a76f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a0c76c7/2147483647/strip/true/crop/2000x1125+0+141/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2Ff1%2Fa399dcfd5d2e060aa60e08c8e678%2F6bfd5af7051c41ca95dbf43f5a109c78"
    },
    {
      "author": "MATTHEW LEE",
      "description": "U.S. Secretary of State Marco Rubio may have hoped to spend his first trip abroad focused exclusively on issues close to his heart: immigration, counternarcotics and curbing Chinese influence in the Western Hemisphere. Instead, the five-nation tour to Central America was overshadowed by a massive Washington-centered upheaval in U.S. foreign policy. Just two weeks into his job as President Donald Trump’s top diplomat, the Miami-born former Florida senator did stay true to his original intent in meetings with the leaders of Panama, El Salvador, Costa Rica, Guatemala and the Dominican Republic. But the dismantlement of the U.S. Agency for International Development and Trump’s surprise proposal for a U.S. takeover of the Gaza Strip dominated his public engagements.",
      "publishedAt": "2025-02-06T21:33:14Z",
      "title": "How Rubio’s trip abroad was overshadowed by foreign policy at home, from USAID to Trump's Gaza plan",
      "url": "https://apnews.com/article/rubio-panama-canal-gaza-migration-usaid-b148af6bb15da37a8b6e4edf5a873829",
      "urlToImage": "https://dims.apnews.com/dims4/default/4acf54f/2147483647/strip/true/crop/4799x2699+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2Ff0%2F0e8d081d36760b4e25615fd6e275%2F7b22a2790f4d4826849d884a15740eee"
    },
    {
      "author": "CHRIS MEGERIAN, COLLIN BINKLEY, BYRON TAU",
      "description": "A federal judge has blocked President Donald Trump’s plan to push out federal employees by offering them financial incentives. The decision Thursday comes hours before the midnight deadline for workers to apply for the program. U.S. District Judge George O’Toole Jr. in Boston sided with several labor unions that had requested a temporary restraining order against the plan orchestrated by Trump adviser Elon Musk. The Republican president is trying to downsize and reshape the federal workforce. The judge didn't express an opinion on the legality of the program. He scheduled a hearing for Monday and directed administration officials to extend the deadline to apply for the program until after the hearing.",
      "publishedAt": "2025-02-06T05:02:40Z",
      "title": "Federal workers debate legitimacy of buyout offer as deadline nears",
      "url": "https://apnews.com/article/buyout-offer-deadline-trump-federal-workers-ce854b19c41b90cd657f75cf09511e96",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad5835d/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F41%2Fcd50c4d3a03a9665ef5c4d941aa3%2Fae847ce1a1704b84b1dfd0696bf28f68"
    },
    {
      "author": "GENE JOHNSON, MIKE CATALINI",
      "description": "A second federal judge in two days has blocked President Donald Trump’s executive order ending birthright citizenship for the children of parents who are in the U.S. illegally. U.S. District Judge John Coughenour in Seattle on Thursday decried what he described as the administration’s treatment of the Constitution and said Trump was trying to change it with an executive order. The decision came just a day after a Maryland federal judge issued a nationwide pause in a separate but similar case involving immigrants’ rights groups and pregnant women whose soon-to-born children could be affected.",
      "publishedAt": "2025-02-06T05:17:48Z",
      "title": "2nd federal judge in 2 days blocks Trump's birthright citizenship order",
      "url": "https://apnews.com/article/birthright-citizenship-court-case-immigration-49e46d49b9e5d9f7caf14e8c5322c8b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/1fd2635/2147483647/strip/true/crop/4596x2585+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F30%2Fd7d64cdba820038ec16e29f4f894%2F6f9e5ac3313d410f87b55d84f1058fd9"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "Officials working with Elon Musk’s Department of Government Efficiency sought access to the Treasury Department payment system to stop money from flowing to the U.S. Agency for International Development. That's according to two people familiar with the matter who on Thursday spoke to The Associated Press on condition of anonymity for fear of retaliation. DOGE's efforts to stop USAID payments undermine assurances that Treasury gave to federal lawmakers in a letter Tuesday that it had “read-only access” to the government's payment system as part of an audit process.",
      "publishedAt": "2025-02-06T22:18:57Z",
      "title": "DOGE was tasked with stopping Treasury payments to USAID, sources say",
      "url": "https://apnews.com/article/treasury-doge-musk-read-only-access-489231c6db1a9f07fc68f9f08803f815",
      "urlToImage": "https://dims.apnews.com/dims4/default/894f4a1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F0e%2Fc63b0c1633cc100ea64f13f5bdf3%2F30be5dbe683347f091f020ea66b8212a"
    },
    {
      "author": "CHRIS MEGERIAN, LINDSAY WHITEHURST",
      "description": "President Donald Trump has faced several setbacks from federal courts, which have blocked or paused some of his most controversial plans since taking office. It’s happened with his attempts to freeze funding, undermine birthright citizenship and push out government workers. Now the question is whether the court rulings are a mere speed bump or a big roadblock for the Republican president, who is determined to expand the limits of his power — sometimes by simply ignoring the laws. Lawsuits could end up at the U.S. Supreme Court, where a conservative majority has demonstrated its willingness to overturn precedent.",
      "publishedAt": "2025-02-06T21:36:04Z",
      "title": "As Trump pushes the limits of presidential power, the courts push back",
      "url": "https://apnews.com/article/donald-trump-constitution-courts-lawsuits-796543ab4a3d5589f47fd66fd9d6bfef",
      "urlToImage": "https://dims.apnews.com/dims4/default/fdc7817/2147483647/strip/true/crop/3917x2203+0+206/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F33%2F923ffb9b646cafff6182741ef562%2Fd60d069ca9ca490ca8979fd1400b6c74"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "The Trump administration is suing Chicago over what are known as sanctuary laws. The administration claims the nation’s third-largest city “thwarts” federal efforts to enforce immigration laws. The lawsuit filed Thursday is the latest effort to crack down on places that limit cooperation between federal immigration agents and local police. It follows the federal government’s threats of criminal charges and federal funding cuts to sanctuary cities. Illinois Democratic Gov. JB Pritzker says the state follows the law. President Donald Trump has often singled out Chicago and Illinois, which have some of the strongest sanctuary laws in the U.S.",
      "publishedAt": "2025-02-06T17:47:28Z",
      "title": "Trump administration sues Chicago in latest crackdown on 'sanctuary' cities",
      "url": "https://apnews.com/article/trump-immigration-chicago-arrests-sanctuary-immigrants-enforcement-df278eba554406c6703bb362d9b09844",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1ce697/2147483647/strip/true/crop/6363x3579+0+331/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2F44%2Faa595857af197ba9d36e3227ef6c%2Fb818f5c6510c43a6ab5a8d0febc5677b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}