{
  "articles": [
    {
      "author": "NATALIE MELZER and OHAD ZWIGENBERG",
      "description": "JERUSALEM (AP) — A missile fired by Yemen's Iran-backed rebels landed in an open area in central Israel early Sunday and triggered air raid sirens at its international airport, in the latest reverberation from the nearly yearlong war in Gaza.",
      "publishedAt": "2024-09-15T05:27:10Z",
      "title": "A missile fired by Yemen's rebels lands in Israel and triggers sirens at international airport",
      "url": "https://apnews.com/5f26be6628a0e7df38bc933520552f5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26435e0a631346e2879a26d7c722ef7e/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, MAKIYA SEMINERA and MATT BROWN",
      "description": "WASHINGTON (AP) — While President Joe Biden was hosting a celebration of Black excellence at the White House with lawmakers, advocates and celebrities this past week, Kamala Harris was instead headed off to campaign in Pennsylvania.",
      "publishedAt": "2024-09-14T15:44:17Z",
      "title": "Harris is promoting her resume and her goals rather than race as she courts Black voters",
      "url": "https://apnews.com/0544720c6bacaf0484259bdabe83239f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68c10089ca7d40559e63b27e8c5cc6a1/3000.jpeg"
    },
    {
      "author": "BARBARA SURK",
      "description": "NICE, France (AP) — At least eight people died during a failed attempt to cross the English Channel from northern France, French maritime authorities said Sunday.The incident occurred Saturday just before midnight when authorities spotted a boat, carrying dozens, in distress near a beach in the northern town of Ambleteuse.",
      "publishedAt": "2024-09-15T09:17:09Z",
      "title": "A least 8 people have died trying to cross the English Channel, French authorities say",
      "url": "https://apnews.com/5b3b36a0ea06b85d89e8ccd22d1d864f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6b0bf7e6bf84a4a9d0e10c5d59bd542/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "PRAGUE (AP) — The head of NATO's military committee said Saturday that Ukraine has the solid legal and military right to strike deep inside Russia to gain combat advantage — reflecting the beliefs of a number of U.S.",
      "publishedAt": "2024-09-14T18:27:07Z",
      "title": "NATO military committee chair, others back Ukraine's use of long range weapons to hit Russia",
      "url": "https://apnews.com/d020f72aaa3abec8e5fa971f7123ffe1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3accef889ce4b8399c81ef58c2bf73b/3000.jpeg"
    },
    {
      "author": "MANUEL RUEDA",
      "description": "BOGOTA, Colombia (AP) — Three Americans, two Spaniards and a Czech citizen were arrested Saturday after Venezuelan officials accused them of coming to the South American country to assassinate President Nicolas Maduro.",
      "publishedAt": "2024-09-15T00:15:18Z",
      "title": "Venezuela says it arrested 6 foreigners allegedly involved in a plot to kill President Maduro",
      "url": "https://apnews.com/696768e00bf22f5747062a4a8b662fcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ca1d58086074a1181c01315a1b23a9a/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A billionaire spacewalker returned to Earth with his crew on Sunday, ending a five-day trip that lifted them higher than anyone has traveled since NASA’s moonwalkers.",
      "publishedAt": "2024-09-15T07:40:44Z",
      "title": "Tech billionaire returns to Earth after first private spacewalk",
      "url": "https://apnews.com/e5635c75b15b2f298e426b4992bcde86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/261419dac49646e8b74dc268b657ab46/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Storm Ileana has weakened to a tropical depression, the National Hurricane Center said Sunday.The tropical storm formed Thursday off Mexico’s Pacific coast as it moved ashore, making landfall on the coast of the Mexican state of Sinaloa Saturday, a day after it pounded the resort-studded Los Cabos.",
      "publishedAt": "2024-09-14T07:03:32Z",
      "title": "Tropical Storm Ileana weakens to a depression",
      "url": "https://apnews.com/970c4df9c396c98286a5abcb10b87ed4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aadb6d16531f48ffb4d20f817976d3f5/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "DILI, East Timor (AP) — It was the farthest trip of his pontificate and one of the longest papal trips ever in terms of days on the road and distance traveled.",
      "publishedAt": "2024-09-15T05:01:36Z",
      "title": "87 and hobbled, Pope Francis goes off-script in Asia and reminds world he can still draw a crowd",
      "url": "https://apnews.com/9e873fd69bf46a25f16a431a0fca6dcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9de8717c1d7848f9824a22b202baa807/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and JOHN HANNA",
      "description": "PITTSBURG, Kan. (AP) — The Rev. Anthony Navaratnam stood before his congregation and urged them to pray for the women from surrounding states who will flock to the new abortion clinic in town that opened in August.",
      "publishedAt": "2024-09-15T04:04:16Z",
      "title": "How a small town in Kansas found itself at the center of abortion’s national moment",
      "url": "https://apnews.com/d239ee0566d719a44334e58da3b3356e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebd67109e63f4162bdcc26096a781186/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — “Shogun” could be in for an epic night, “The Bear” could clean up for the second time in less than a year, and “Baby Reindeer” has gone from dark horse to contender as the 76th Primetime Emmy Awards arrive on Sunday.",
      "publishedAt": "2024-09-15T04:04:30Z",
      "title": "'Shogun,' 'The Bear' and 'Baby Reindeer' are at the top of the queue as the Emmys arrive",
      "url": "https://apnews.com/8588922c128c775092509b70a599a6d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7a30edfa02048ed8af55e3a7b3a1dc1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}