{
  "articles": [
    {
      "author": null,
      "description": "Thousands of protesters took to the street in Los Angeles on Sunday in response to President Donald Trump's extraordinary deployment of the National Guard against Gov. Gavin Newsom's wishes. The demonstrations centered on a cluster of federal buildings including a detention center where immigrants arrested on Friday were taken. As the protests swelled on Sunday, demonstrators blocked a freeway entrance, set self-driving cars on fire and threw objects including concrete and electric scooters at law enforcement officers and vehicles. Los Angeles Police Chief Jim McDonnell says some of the protesters engaging in the most aggressive behavior are agitators looking to cause trouble.",
      "publishedAt": "2025-06-09T04:25:10Z",
      "title": "Protests intensify in Los Angeles after Trump deploys hundreds of National Guard troops",
      "url": "https://apnews.com/article/los-angeles-protests-national-guard-trump-14c9dda32663d7d2c45f2b1c5a1d219c",
      "urlToImage": "https://dims.apnews.com/dims4/default/3af0f0d/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fca%2F0e3b7a85ec3116cc0548a446acee%2Fb0ec65081ab14f35b8ab14d75cba5f5f"
    },
    {
      "author": null,
      "description": "President Donald Trump’s new ban on travel to the United States by citizens from 12 mainly African and Middle Eastern countries is now in effect. The ban took effect on Monday and comes as tensions escalate over the president’s campaign of immigration enforcement. Trump signed the new proclamation last week. It applies to citizens of Afghanistan, Myanmar, Chad, the Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. It also imposes heightened restrictions on people from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela who are outside the U.S. and don’t hold a valid visa.",
      "publishedAt": "2025-06-08T18:26:49Z",
      "title": "Trump's new travel ban takes effect",
      "url": "https://apnews.com/article/trump-travel-ban-immigration-enforcement-visas-b1eb79c7b5717c96daf51e978db83d1b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a1a146/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F24%2F798081743f495a251f64db83f53f%2F145a13541b364c1b80157b28574a4457"
    },
    {
      "author": null,
      "description": "Israeli forces have stopped a Gaza-bound aid boat and detained Greta Thunberg and other activists on board, enforcing a longstanding blockade of the Palestinian territory that has been tightened during the war with Hamas. The Freedom Flotilla Coalition, which had organized the voyage to deliver humanitarian aid to the Gaza Strip and protest Israel’s blockade and wartime conduct, said the activists had been “kidnapped by Israeli forces.” Israel said the passengers would return to their home countries and the aid would be delivered to Gaza through established channels.",
      "publishedAt": "2025-06-09T01:20:54Z",
      "title": "Israeli forces detain Greta Thunberg after halting Freedom Flotilla aid boat",
      "url": "https://apnews.com/article/mideast-wars-gaza-flotilla-greta-thunberg-b64e897fb37ee374e4494381304ff9be",
      "urlToImage": "https://dims.apnews.com/dims4/default/be50b33/2147483647/strip/true/crop/4928x2772+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Fc7%2Fcd0bf01bc66a2cbb83e57fecc5d8%2Fa38136d8c5344e9badbd78e93dda8702"
    },
    {
      "author": null,
      "description": "Health Secretary Robert F. Kennedy Jr. has removed every member of a scientific committee that advises the Centers for Disease Control and Prevention on how to use vaccines. He is pledging to replace them with his own picks. The 17-member Advisory Committee on Immunization Practices had been in a state of flux since Kennedy took over. He recently took the unusual step of changing COVID-19 recommendations without first consulting the panel. Kennedy says the committee members had too many conflicts of interest.",
      "publishedAt": "2025-06-09T21:12:29Z",
      "title": "RFK Jr. ousts ACIP group that advises CDC on vaccines",
      "url": "https://apnews.com/article/kennedy-cdc-acip-vaccines-3790c89f45b6314c5c7b686db0e3a8f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c043c4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fe2%2F28c228082ac7fec6650f9b798653%2F0e0d4807b56a45ecb350f4a6f2f449be"
    },
    {
      "author": null,
      "description": "Warner Bros. Discovery will calve off cable operations from its streaming service, creating two independent companies as the number of people “cutting the cord” brings with it a sustained upheaval in the entertainment industry. HBO, and HBO Max, as well as Warner Bros. Television, Warner Bros. Motion Picture Group, DC Studios, will become part of the streaming and studios company. The cable company will include CNN, TNT Sports in the U.S., and Discovery, top free-to-air channels across Europe, and digital products such as the Discovery+ streaming service and Bleacher Report. Shares of Warner Bros. Discovery, based in New York City, jumped 11% at the opening bell.",
      "publishedAt": "2025-06-09T11:37:50Z",
      "title": "Warner Bros. Discovery to split into two companies, dividing cable and streaming services",
      "url": "https://apnews.com/article/warner-brothers-discovery-streaming-cable-cnn-tnt-1cdafec11e6cb542ca644e20dd29e826",
      "urlToImage": "https://dims.apnews.com/dims4/default/c76697f/2147483647/strip/true/crop/4422x2487+0+187/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Ff4%2F2f61af945f575f759a4a9cf4e326%2F33b9bc88e87c4cb494bdad7cd54b677a"
    },
    {
      "author": null,
      "description": "After stumbling out of the starting gate in Big Tech’s pivotal race to create artificial intelligence, Apple will try to regain its footing Monday with its annual showcase for the next generation of software powering the iPhone and other popular products. The presummer rite is expected be more subdued than the feverish anticipation that surrounded the event in 2023 when Apple unveiled a mixed-reality headset and last year when the company hyped AI features that didn't pan out as envisioned. Now Apple is facing nagging questions about its ability to innovate and ability to navigate a gauntlet of other challenges as it heads into this year's World Wide Developers Conference.",
      "publishedAt": "2025-06-09T04:01:06Z",
      "title": "Apple heads into annual showcase reeling from AI missteps, tech upheaval and Trump's trade war",
      "url": "https://apnews.com/article/apple-conference-iphone-artificial-intelligence-ba918c2091e0d49a8b3f164e4f980b6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d5b419d/2147483647/strip/true/crop/6769x3808+0+352/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2Fff%2F81ecc765fde16ba08cad2bf9de14%2Fb88223b8094c40b1bf7271fdbb40386c"
    },
    {
      "author": null,
      "description": "The jury in Harvey Weinstein’s New York sex crimes retrial has resumed deliberations after having the weekend off. The panel of seven women and five men returned to court Monday to continue weighing two counts of criminal sex act and one count of rape. The 73-year-old former movie mogul has pleaded not guilty. One juror on Friday asked to be removed from the case, but the judge told him he had to keep deliberating. Weinstein was originally found guilty in 2020 of rape and sexual assault in a verdict considered a landmark in the #MeToo movement. The conviction was overturned, leading to his retrial.",
      "publishedAt": "2025-06-09T04:03:04Z",
      "title": "Jury in Harvey Weinstein’s sex crimes retrial appears far apart on verdict",
      "url": "https://apnews.com/article/harvey-weinstein-trial-d8e6608d7cd57acebb07b7c95bb3cd85",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0914a0/2147483647/strip/true/crop/5776x3249+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2F03%2Fb0fb457398b40b0188bd566ef6cf%2F4e4cc715ff8d44e18e579898adcc17cb"
    },
    {
      "author": null,
      "description": "Sean “Diddy” Combs’ recent ex-girlfriend says she cried for three days after reading a lawsuit filed by R&B artist Casandra “Cassie” Ventura against the music mogul. The 2023 court papers describe hundreds of drug-laced marathon sex sessions with Combs and other men as “horrific encounters.” The woman who testified Monday is known in court by the pseudonym Jane. She testified for a third day in Manhattan federal court at Combs' trial on sex trafficking and racketeering conspiracy charges. The woman says she felt like she was reading about her own sexual trauma as she read Cassie's lawsuit. That case was settled for $20 million. Combs has pleaded not guilty to charges in the current criminal case.",
      "publishedAt": "2025-06-09T17:46:49Z",
      "title": "Sean Diddy Combs' ex-girlfriend testifies",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-9b2d2c73d83c4936bb18264bf9764374",
      "urlToImage": "https://dims.apnews.com/dims4/default/d64d65c/2147483647/strip/true/crop/3500x1969+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F44%2F4892f01350fcda375d34cf73655a%2Fe0ee6ee7b3d446b48cb2b373f33586a8"
    },
    {
      "author": null,
      "description": "Russia launched 479 drones at Ukraine in the war’s biggest overnight drone bombardment, the Ukrainian air force said. As well as the drones, 20 missiles of various types were fired at different parts of Ukraine, the air force said Monday. The attacks usually start late in the evening and end in the morning, because drones are harder to spot in the dark. Russia has targeted civilian areas of Ukraine with Shahed drones since the start of the war. The attacks have killed more that 12,000 Ukrainian civilians, according to the United Nations. A recent escalation in aerial attacks has coincided with a renewed Russian battlefield push on eastern and northeastern parts of the roughly 1,000-kilometer (620-mile) front line.",
      "publishedAt": "2025-06-09T08:22:36Z",
      "title": "Ukraine says Russia launched 479 drones",
      "url": "https://apnews.com/article/ukraine-russia-drones-attack-air-force-a1b092efaaad6886659a9230109a48db",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Sly Stone, an electrifying musician, songwriter and showman whose Sly and the Family Stone transformed popular music in the 1960s and ’70s, has died. He was 82. His time on top was brief, from roughly 1969 to 1971, but his influence on music and culture lasted for decades after. No band better captured the gravity-defying euphoria of the Woodstock era or more bravely addressed the crash. From early hits as rousing as their titles —“I Want To Take You Higher,” “Stand!” — to the sober aftermath of “Family Affair” and “Runnin’ Away,” Sly and the Family Stone spoke for a generation whether or not it wanted to hear the message.",
      "publishedAt": "2025-06-09T19:46:35Z",
      "title": "Sly Stone, revolutionary funk rock musician, dies at 82",
      "url": "https://apnews.com/article/sly-stone-dead-7740dc1015499a4535f44881d8875741",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd8b3fc/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2Fae%2F015244b8f42c646acc932db5c5dc%2Fb2fc2deb6e1c44aeba29be3df265914b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}