{
  "articles": [
    {
      "author": "MELANIE LIDMAN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July. The announcement comes a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.",
      "publishedAt": "2024-08-01T08:40:43Z",
      "title": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strike",
      "url": "https://apnews.com/9524d7d5c8f7321f4d8c931fde664556",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5e9f49c2acc4d33849de5991632cd61/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.",
      "publishedAt": "2024-08-01T05:00:45Z",
      "title": "For Iran and Hezbollah, calibrating response to Israeli strikes leaves no room for error",
      "url": "https://apnews.com/262194a2d70273207ed1d1a5cb9ab09b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd7398c344dc47328ef144d1719d5398/3000.jpeg"
    },
    {
      "author": "RISHI LEKHI and RAFIQ MAQBOOL",
      "description": "WAYANAD, India (AP) — Hopes of finding more than 180 missing people alive waned as rescue workers searched through mud and debris for a third day Thursday after landslides set off by torrential rains killed at least 194 people in southern India.",
      "publishedAt": "2024-08-01T03:41:23Z",
      "title": "Hopes of finding more survivors in the mud and debris wane after landslides in India kill 194",
      "url": "https://apnews.com/5d35cde98d749235c2abcb3479b3f633",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c04e6fbc28d048be999f711f11d2ed68/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS and BRIAN MELLEY",
      "description": "LONDON (AP) — A 17-year-old boy charged with three counts of murder and 10 counts of attempted murder for the stabbings at a dance class in northwest England was named in court on Thursday as Axel Rudakubana, as he made his first court appearance.",
      "publishedAt": "2024-08-01T08:19:13Z",
      "title": "17-year-old suspect in UK dance class stabbings is named in court",
      "url": "https://apnews.com/666c445e26aa0359f26805b4a10c071a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5f583b436f749309c97d53c00e88789/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Senate Majority Leader Chuck Schumer will introduce legislation Thursday reaffirming that presidents do not have immunity for criminal actions, an attempt to reverse the Supreme Court’s landmark decision last month.",
      "publishedAt": "2024-08-01T10:32:22Z",
      "title": "In an attempt to reverse the Supreme Court's immunity decision, Schumer introduces the No Kings Act",
      "url": "https://apnews.com/149763b93d62599eac7d0a7c77ff4d4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/866961a0d0dd45e59918bef6b11acd0f/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS and SEUNG MIN KIM",
      "description": "As Vice President Kamala Harris prepares to announce her running mate, a new poll from The Associated Press-NORC Center for Public Affairs Research finds that several of the top contenders for the role are largely unknown to Americans.",
      "publishedAt": "2024-08-01T04:01:04Z",
      "title": "What polling shows about the top VP contenders for Kamala Harris",
      "url": "https://apnews.com/d01c79817844b66c5bf466a1cd403c50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/308293c739a643738fab333ef4ead50c/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, STEPHEN GROVES and MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — Donald Trump is used to defending himself. But this week, the Republican presidential nominee has been put in the rare position of having to defend someone else — his running mate, Ohio Sen.",
      "publishedAt": "2024-08-01T04:07:01Z",
      "title": "Trump ramps up his defense of Vance after one of the rockiest VP rollouts in recent memory",
      "url": "https://apnews.com/ad67ae38d25c54eab9827b5cdb2fb6bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8e0806690734bc6a1fd84d768589ecd/3000.jpeg"
    },
    {
      "author": "BARRY HATTON and ANDREW MELDRUM",
      "description": "KYIV, Ukraine (AP) — The American-made F-16 is an iconic fighter jet that's been the front-line combat plane of choice for the NATO alliance and numerous air forces around the world for 50 years.Western countries have pledged F-16s to Kyiv, and some have arrived in Ukraine, officials in Washington and Ukraine confirmed to The Associated Press.",
      "publishedAt": "2024-08-01T06:51:44Z",
      "title": "F-16s have arrived to help Ukraine fight Russia. Here’s what to know about their possible impact",
      "url": "https://apnews.com/224d96ff2ad4f416d3969676a55876e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0bfe6f77c8f41c0b3d1cd1c46c057d4/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — In war-torn Ukraine, he is Alya Shabaanovich Gali, a popular doctor with a line of patients waiting to see him. To his family thousands of kilometers away in the besieged Gaza Strip, he is Alaa Shabaan Abu Ghali, the one who left.",
      "publishedAt": "2024-08-01T05:20:18Z",
      "title": "From Gaza to Kyiv, a Palestinian doctor lives between two wars",
      "url": "https://apnews.com/67aeaaff0b5761ae632fe7c5215e2e53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7442e973a140436da6b80e7d247c9160/3000.jpeg"
    },
    {
      "author": "PAUL NEWBERRY",
      "description": "NANTERRE, France (AP) — If there's anyone who can appreciate the magnitude of what Léon Marchand has done at the Paris Olympics, it's Bob Bowman.The longtime coach was on deck for Michael Phelps' entire career, which gave him a front-row seat for improbable feats such as breaking world records in two different events about an hour apart and winning eight gold medals at a single Summer Games.",
      "publishedAt": "2024-08-01T10:54:16Z",
      "title": "Léon The Great: Marchand accomplishes a feat that was downright Phelps-like",
      "url": "https://apnews.com/1fc4297377356b52021dfaf259476209",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f0394a9bd50420a9f771d954d04aeaf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}