{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, ABBY SEWELL, KAREEM CHEHAYEB and AAMER MADHANI",
      "description": "JERUSALEM (AP) — A round of high-level talks in Cairo meant to bring about a cease-fire and hostage deal to at least temporarily end the 10-month Israel-Hamas war in Gaza ended Sunday without a final agreement, a U.S.",
      "publishedAt": "2024-08-25T02:23:12Z",
      "title": "Israel-Hamas war cease-fire, hostage talks will continue after weekend meetings didn't resolve gaps",
      "url": "https://apnews.com/52056075daebc9aac6675043f64439ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8799b7b1e4d44e6daea437a7ea9fff15/1920.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "NEW YORK (AP) — Kamala Harris accepted the Democratic nomination “on behalf of everyone whose story could only be written in the greatest nation on Earth.” America, Barack Obama thundered, “is ready for a better story.” JD Vance insisted that the Biden administration “is not the end of our story,” and Donald Trump called on fellow Republicans to “write our own thrilling chapter of the American story.”",
      "publishedAt": "2024-08-25T04:01:31Z",
      "title": "Behind the rhetoric, a presidential campaign is a competition about how to tell the American story",
      "url": "https://apnews.com/68aad96e58a7786c2603544f606cf8ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f08b5e0399c4939969c3ba6af6e2b2c/3000.jpeg"
    },
    {
      "author": "BARBARA SURK",
      "description": "NICE, France (AP) — The founder and CEO of the messaging service Telegram was detained at a Paris airport on an arrest warrant alleging his platform has been used for money laundering, drug trafficking and other offenses, French media reported Sunday.",
      "publishedAt": "2024-08-25T10:45:46Z",
      "title": "French authorities arrest Telegram CEO Pavel Durov at a Paris airport, French media report",
      "url": "https://apnews.com/63cd8e5663c6b6f3404745866d662954",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecafb659b7f84f0fabd30e82e921dab1/1894.jpeg"
    },
    {
      "author": "RICHARD LARDNER, JONATHAN MATTISE, TRENTON DANIEL and STEVE KARNOWSKI",
      "description": "WASHINGTON (AP) — John Kolb, a retired Minnesota National Guard colonel, knew Tim Walz by reputation as an “excellent leader” who adroitly guided the enlisted troops in his field artillery battalion.",
      "publishedAt": "2024-08-25T11:48:41Z",
      "title": "Walz’s exit from Minnesota National Guard left openings for critics to pounce on his military record",
      "url": "https://apnews.com/8a74ff39f0a698247b28bf4266f20773",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c86e3a30e20476499562609396a3897/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "LOS ALAMOS, N.M. (AP) — It was the summer of 1945 when the United States dropped atomic bombs on Japan, killing thousands of people as waves of destructive energy obliterated two cites. It was a decisive move that helped bring about the end of World War II, but survivors and the generations that followed were left to grapple with sickness from radiation exposure.",
      "publishedAt": "2024-08-25T04:11:37Z",
      "title": "'We were expendable': Downwinders from world's 1st atomic test are on a mission to tell their story",
      "url": "https://apnews.com/fac8d1f584f320be220196191ab8c46b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e145ca9736b4afab4bd40627c912cb4/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and DAVID McHUGH",
      "description": "SOLINGEN, Germany (AP) — A Syrian man on Sunday was ordered held on suspicion of murder and membership in a terrorist organization in connection with the Solingen knife attack that left three dead and eight wounded at a festival marking the city’s 650th anniversary.",
      "publishedAt": "2024-08-25T06:33:11Z",
      "title": "The suspect in the Germany attack was motivated by Islamic State group ideology, prosecutors say",
      "url": "https://apnews.com/1095235a9dadf6e1005e8adff52d05b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1a308cc86b44ae3958acae757b10f20/1920.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — A British safety adviser working with a team of journalists was killed after a Russian missile struck a hotel in the Ukrainian city of Kramatorsk, Reuters news agency confirmed.",
      "publishedAt": "2024-08-25T10:22:01Z",
      "title": "Member of British journalist team dies after Russian missile hits hotel in eastern Ukraine",
      "url": "https://apnews.com/f7726e08a3da2eb2ac49b65d0e7d2014",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f83dde66f494c4bbdc9ff1cbabeb677/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and JULIE WALKER",
      "description": "HONOLULU (AP) — Hurricane Hone passed just south of Hawaii on Sunday, dumping so much rain that the National Weather Service called off its red flag warnings that strong winds could lead to wildfires on the drier sides of the islands.",
      "publishedAt": "2024-08-25T13:38:15Z",
      "title": "Hurricane Hone sweeps past Hawaii, dumping enough rain to ease wildfire fears",
      "url": "https://apnews.com/15b6b817303b4abbf23aeb83b71e1f8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77b0a380c7de4401a26584f0c52d495b/2135.jpeg"
    },
    {
      "author": "STEPHANIE BEASLEY of The Chronicle of Philanthropy",
      "description": "Ahead of Taylor Swift’s July 14, 2023, concert in Denver, Aditi Desai, chief marketing officer at the Food Bank of the Rockies, got an unusual call. The billionaire pop star wanted to donate tens of thousands of meals to the nonprofit — a philanthropic effort she had repeated, much like her favorite songs, as she traverses the country on her 52-city Eras Tour.",
      "publishedAt": "2024-08-25T15:41:46Z",
      "title": "Did Taylor Swift create a new era for food bank donations?",
      "url": "https://apnews.com/79f5aeedc6ce16f91517a3d00af55a7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a81f08f511b4f03a13edf9bc319cb68/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Protestors took to the streets across Mexico on Sunday in the latest opposition to President Andrés Manuel López Obrador's proposed judicial overhaul and other moves by the governing party that critics say will weaken democratic checks and balances.",
      "publishedAt": "2024-08-25T22:51:36Z",
      "title": "Protesters against judiciary overhaul plan urge Mexican president to 'respect democracy'",
      "url": "https://apnews.com/f9dc6251b894619a3834ec290a5439b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3d00461db1d412ab4a74d601a7bcef7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}