{
  "articles": [
    {
      "author": "COLLEEN LONG and SEUNG MIN KIM",
      "description": "MADISON, Wis. (AP) — President Joe Biden, fighting to save his endangered reelection effort Friday, said his disastrous debate performance last week was a “bad episode” and there were “no indications of any serious condition” in a highly anticipated ABC interview that was seen as a significant test of his fitness to run for office.",
      "publishedAt": "2024-07-05T15:42:40Z",
      "title": "Biden says 'no indication of any serious condition' in ABC interview as he fights to stay in race",
      "url": "https://apnews.com/e4657f86f5e82b10a5fefb526bc49b08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cf72a570123431992af72f3bfe704d5/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — The Federal Reserve is highlighting the importance of its political independence at a time when Donald Trump, who frequently attacked the Fed's policymaking in the past, edges closer to formally becoming the Republican nominee for president.",
      "publishedAt": "2024-07-05T16:21:01Z",
      "title": "Federal Reserve highlights its political independence as presidential campaign heats up",
      "url": "https://apnews.com/e87f2a8cff848f994c9446ee569ab44b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/544cc11763314fa0adb91114c7f59c33/3000.jpeg"
    },
    {
      "author": "PAN PYLAS",
      "description": "LONDON (AP) — The U.K. has its first change in government in 14 years after the Labour Party won a landslide victory early Friday in a general election that saw the Conservative Party suffer its biggest defeat ever.",
      "publishedAt": "2024-07-05T11:57:58Z",
      "title": "What we learned from the UK's general election that will shape politics over the coming years",
      "url": "https://apnews.com/56c9a786256f34497fec4b31dffacf93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c71ce6b79c8240b8b191a5928ab61ebd/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. will remove all its forces and equipment from a small base in Niger this weekend and fewer than 500 remaining troops will leave a critical drone base in the West African country in August, ahead of a Sept.",
      "publishedAt": "2024-07-05T15:05:32Z",
      "title": "US says troops are leaving Niger bases this weekend and in August after coup",
      "url": "https://apnews.com/414e315fb0b5e1ee8047c0baf191a6c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/307fd4812a1146b2a4e9391a44e1d62d/3000.jpeg"
    },
    {
      "author": "MARTÍN SILVA and JIM VERTUNO",
      "description": "TULUM, Mexico (AP) — Beryl moved over Mexico’s Yucatan Peninsula on Friday after battering the resort town of Tulum and prepared to reemerge in the Gulf of Mexico, prompting Texas officials to urge coastal residents to prepare as the storm headed their way.",
      "publishedAt": "2024-07-05T04:17:27Z",
      "title": "Beryl moves over Mexico’s Yucatan Peninsula as Texas officials urge coastal residents to prepare",
      "url": "https://apnews.com/4b84e981f62bd53340a385fac42579f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fbace3055d8428b98830ee24d3ea2b4/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — The Vatican on Friday excommunicated its former ambassador to Washington after finding him guilty of schism, an inevitable outcome for Archbishop Carlo Maria Vigano. The conservative had became one of Pope Francis ' most ardent critics and a symbol of the polarized Catholic Church in the United States and beyond.",
      "publishedAt": "2024-07-05T11:36:30Z",
      "title": "Vatican excommunicates a former ambassador to the US and declares him guilty of schism",
      "url": "https://apnews.com/170df099cd1fe2cf556485c8a3acd072",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43265f10cd3740f6a86c664d00780c09/3000.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — Palestinian authorities say seven people were killed Friday during an Israeli military operation in the area of the West Bank city of Jenin, where the Israeli military said it had been carrying out “counterterrorism activity” that included an airstrike.",
      "publishedAt": "2024-07-05T07:57:05Z",
      "title": "7 Palestinians killed in West Bank by an Israeli raid and airstrike in the Jenin area",
      "url": "https://apnews.com/d20ff57c3efe9ba8b783f9c5b5891c96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bec391b197054521aa61e3a7234a1b23/1920.jpeg"
    },
    {
      "author": "TODD RICHMOND",
      "description": "MADISON, Wis. (AP) — The Wisconsin Supreme Court ruled Friday that officials can place ballot drop boxes around their communities in this fall's elections, overturning its own ruling two years ago limiting their use in the presidential swing state.",
      "publishedAt": "2024-07-05T14:44:02Z",
      "title": "Wisconsin Supreme Court changes course, will allow expanded use of ballot drop boxes this fall",
      "url": "https://apnews.com/9d3973ea65b78436df478e7d8ae28cce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e11c5bb1989f4f66874ff7ccbf83ab55/3000.jpeg"
    },
    {
      "author": "JOHN HANNA",
      "description": "TOPEKA, Kan. (AP) — Kansas’ highest court strongly reaffirmed Friday that the state constitution protects abortion access, striking down a ban on a common second-trimester procedure and laws regulating abortion providers more strictly than other health care providers.",
      "publishedAt": "2024-07-05T14:34:32Z",
      "title": "Kansas’ top court bolsters a state right to abortion and strikes down 2 anti-abortion laws",
      "url": "https://apnews.com/07b9d71bca29119ab4acc30c28a67099",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76dc1f5f3ac1425f9d3a3ec70f1a21e2/3000.jpeg"
    },
    {
      "author": "FARAI MUTSAKA",
      "description": "HARARE, Zimbabwe (AP) — After her son, the family’s shining light and only breadwinner, was arrested last year, Tambudzai Tembo went into meltdown. In Zimbabwe, where clinical mental health services are scarce, her chances of getting professional help were next to zero.",
      "publishedAt": "2024-07-05T05:41:14Z",
      "title": "A bench and a grandmother's ear: Zimbabwe’s novel mental health therapy spreads overseas",
      "url": "https://apnews.com/0a3611a7b800aa3628bd3abe53a131cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1576e16827f74ec2a13520d389bcd0f2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}