{
  "articles": [
    {
      "author": "SAMY MAGDY, NAJIB JOBAIN and TIA GOLDENBERG",
      "description": "CAIRO (AP) — Israel and Hamas are making progress toward another cease-fire and hostage-release deal, officials said Tuesday, as negotiations went on and Israel threatened to expand its offensive to Gaza's southern edge, where some 1.4 million Palestinians have sought refuge.",
      "publishedAt": "2024-02-13T11:22:06Z",
      "title": "Israel and Hamas are making progress in cease-fire and hostage-release talks, officials say",
      "url": "https://apnews.com/1a0509346f4725ed40d1422808fed076",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5436a3dd8e94c63972e22f086c67a66/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden on Tuesday said Donald Trump's comments calling into question the U.S. commitment to defend its NATO allies from attack were “dangerous” and “un-American,” seizing on the former president's comments that sowed fresh fears among U.S.",
      "publishedAt": "2024-02-13T19:52:45Z",
      "title": "Biden says Trump sowing doubts about US commitment to NATO is 'un-American'",
      "url": "https://apnews.com/b1ae8f4702e430d1995d40f3bc05ea06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24da98770b5d49e4a9272ac775a117f7/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK, STEPHEN GROVES and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden on Tuesday called for House Republicans to urgently bring a $95.3 billion aid package for Ukraine, Israel and Taiwan to a vote, warning that refusal to take up the bill, passed by the Senate in the morning, would be “playing into Putin’s hands.”",
      "publishedAt": "2024-02-13T11:42:36Z",
      "title": "Biden warns opposing Ukraine funding plays 'into Putin's hands,' but faces resistance in House",
      "url": "https://apnews.com/5fdcf8cb1964681dcce0f4fe7b9a0f86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24da98770b5d49e4a9272ac775a117f7/1920.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "HARTFORD, Conn. (AP) — A quick-moving winter storm that hit the Northeast on Tuesday brought significant snowfall to some areas while others got less than expected.",
      "publishedAt": "2024-02-13T13:46:52Z",
      "title": "Quick-moving winter storm brings snow to Northeast, disrupting travel and schools",
      "url": "https://apnews.com/ea899ba16d4e81279517d633a5600727",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad34a5f938ec48739ee1e981a6d453a7/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump is calling for a shakeup at the highest levels of the Republican National Committee.",
      "publishedAt": "2024-02-13T17:54:28Z",
      "title": "What is happening at the Republican National Committee and could Lara Trump become its co-chair?",
      "url": "https://apnews.com/cb23f0f7f24fa3b3bf83e4bfeb19ae54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d32deba8bba4e65b29993a926cff81e/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — House Republicans having failed to impeach Homeland Security Secretary Alejandro Mayorkas the first time are determined Tuesday to try again with a do-over vote to punish the Biden administration over its handling of the migrant crisis at the U.S-Mexico border.",
      "publishedAt": "2024-02-13T05:02:38Z",
      "title": "House GOP will try again to impeach Mayorkas after failing once. But the vote tally could be tight",
      "url": "https://apnews.com/80cbd5bbb8f512c6814f155f825a1214",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6dc1b218975a4a788d1e09de90aca4a9/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "An unusual special election in New York City’s suburbs on Tuesday could be a bellwether in the fight for control of Congress.Former U.S. Rep. Tom Suozzi, a Democrat, faces off with Republican Mazi Pilip, a county lawmaker, in a race for a House seat that became vacant when George Santos was expelled from Congress.",
      "publishedAt": "2024-02-13T05:16:51Z",
      "title": "Race to succeed George Santos in Congress reaches stormy climax in New York's suburbs",
      "url": "https://apnews.com/be0140979ca3050921579e90507bfe1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/586e561b4cba4c2e998e7f271c5bf216/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "Officials in central Oregon this week reported a case of bubonic plague in a resident who likely got the disease from a sick pet cat.",
      "publishedAt": "2024-02-13T18:37:40Z",
      "title": "An Oregon resident was diagnosed with the plague. Here are a few things to know about the illness",
      "url": "https://apnews.com/6d5a71b8a45e5e38ec321fd48fdb9576",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21e12ac85945495c8486a6d1fa30dcd0/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — No, Jon Stewart really wasn't sitting at his desk at Comedy Central for the last nine years, waiting for someone to turn the lights back on.Yet it almost felt that way during Stewart's return to “The Daily Show” Monday night.",
      "publishedAt": "2024-02-13T18:09:33Z",
      "title": "Jon Stewart's return to 'The Daily Show' felt familiar to those who missed him while he was away",
      "url": "https://apnews.com/839ae0632a3f244d3188cee941bec150",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e4f7de3645f4e1e90a18a7634ec645a/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A typical Carnival day in Brazil starts around 7 a.m., when the first blocos — as the free street parties are known — start their loud and colorful musical journey down the city’s streets.",
      "publishedAt": "2024-02-13T05:28:22Z",
      "title": "AP PHOTOS: A Carnival day in Brazil, from a morning street party to an evening samba parade",
      "url": "https://apnews.com/a41c0c6579632578e8270a00d1508977",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b88dd8b2bf2141cb9b5ca99565299a74/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}