{
  "articles": [
    {
      "author": null,
      "description": "The risk of life-threatening flooding is still high in central Texas with more rain on the way. The urgent search for the missing continues following a holiday weekend deluge that killed at least 82 people including children at summer camps. Officials say the death toll is sure to rise. Gov. Greg Abbott says more than 40 people are unaccounted for. Searchers now have found 68 bodies in Kerr County, where a wall of water came down the Guadalupe River. Sheriff Larry Leitha says the dead include 28 children. Abbott warned Sunday that additional rounds of heavy rains lasting into Tuesday could produce more flash flooding.",
      "publishedAt": "2025-07-07T04:06:20Z",
      "title": "More than 80 dead, dozens missing in Texas flooding as search continues",
      "url": "https://apnews.com/article/texas-flash-flood-severe-weather-camp-mystic-ef8e596833b145fef61451db92f32609",
      "urlToImage": "https://dims.apnews.com/dims4/default/738f522/2147483647/strip/true/crop/3600x2025+0+98/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2Fea%2Fd31d346a5c32b59bb3a8b71af6a5%2F6e234350183a4cee91a68653a78d0693"
    },
    {
      "author": null,
      "description": "Authorities in Texas say more than 70 people have died in devastating flooding in Texas. They include a 68-year-old camp director, an Alabama elementary student away for the summer and a grandparent who had been reported missing while on her way to work. The flooding in central Texas originated from the fast-moving waters on the Guadalupe River on Friday, killing nearly 70 people, including 21 children. Authorities say search and rescue efforts are still underway for children at a summer camp attended by hundreds of girls.",
      "publishedAt": "2025-07-06T15:11:42Z",
      "title": "A young Alabama student, a grandparent and a camp director among those killed in Texas floods",
      "url": "https://apnews.com/article/texas-floods-missing-hill-country-victims-camp-68b25cdb4d72f7eddff576af4ef7d400",
      "urlToImage": "https://dims.apnews.com/dims4/default/14d2c8a/2147483647/strip/true/crop/1334x750+0+625/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2F1d%2F8ebf7828bd2ab6dfea7ccc73cadb%2F05ad7cae0679462a8d90fe834e225f90"
    },
    {
      "author": null,
      "description": "Flash floods in Texas have killed nearly 70 people, many of them children. An unknown number of people are missing. Heavy rains fell quickly in the predawn hours Friday in the Texas Hill Country, causing the Guadalupe River to rise 26 feet in just 45 minutes. Among the missing are 27 girls from Camp Mystic, a Christian summer camp. Officials are resisting estimating the total number of missing. The July Fourth holiday weekend likely brought an influx of visitors to the area outside San Antonio, making it difficult to track all the people who may have been in the area.",
      "publishedAt": "2025-07-06T16:25:30Z",
      "title": "What to know about the Texas flash floods and the rising death toll",
      "url": "https://apnews.com/article/flash-flood-texas-camp-mystic-aec9181a07d3ce8ff85197922e108b13",
      "urlToImage": "https://dims.apnews.com/dims4/default/154f53b/2147483647/strip/true/crop/3600x2025+0+80/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F78%2Fd1cad5f70533b8ed2593e866e61c%2F71337bc08bf34e5ebd8267d8fc6fb9a3"
    },
    {
      "author": null,
      "description": "The United States is stepping up pressure on trading partners to quickly make new deals before a Wednesday deadline when a tariff pause by President Donald Trump expires. There are plans for the U.S. to start sending letters Monday warning countries that higher tariffs could kick in Aug. 1. That furthers the uncertainty for businesses, consumers and America's trading partners. And questions remain about which countries will be notified, whether anything will change in the days ahead and whether Trump will once more push off imposing the rates. Trump could extend the time for dealmaking, as he has done before.",
      "publishedAt": "2025-07-06T18:11:55Z",
      "title": "Pressure from Trump for trade deals before Wednesday deadline",
      "url": "https://apnews.com/article/trump-tariffs-deadline-bessent-negotiations-94f8f81ad7fe60748198c4f115f3671b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b7e666/2147483647/strip/true/crop/4290x2413+0+223/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fd4%2F745bde5de8af81f37e1be93803ec%2F769af5a146ca43839e6f81278cf53ecc"
    },
    {
      "author": null,
      "description": "Israel’s military launched airstrikes early Monday targeting ports and facilities held by Yemen’s Houthi rebels, with the rebels responding with missile fire targeting Israel. The attacks came after a suspected Houthi attack targeting a ship in the Red Sea that caught fire and took on water, later forcing its crew to abandon the vessel. The Israeli military said it struck Houthi-held ports at Hodeida, Ras Isa and Salif. The Houthis then responded with an apparent missile attack on Israel. The Israeli military said it attempted to intercept the missile, but it appeared to make impact, though there were no immediate reports of injuries from the attack.",
      "publishedAt": "2025-07-07T01:30:05Z",
      "title": "Israeli airstrikes hit Yemen's Houthi rebels",
      "url": "https://apnews.com/article/mideast-wars-yemen-houthis-israel-15edf75586540201f63b7c33348fb737",
      "urlToImage": "https://dims.apnews.com/dims4/default/02e17b8/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F88%2F9ebd2b838e8c0c7f4b12e0c0aae4%2F91f88bfc3ab74d939977bae744355640"
    },
    {
      "author": null,
      "description": "New details have emerged of the latest Gaza ceasefire proposal submitted by mediators to Hamas, while Israel has sent a negotiating team to Qatar ahead of Prime Minister Benjamin Netanyahu’s White House visit. U.S. President Donald Trump will meet with Netanyahu on Monday. The document shared with The Associated Press outlines plans for a 60-day ceasefire. During that time, Hamas would hand over 10 living and 18 dead hostages, Israeli forces would withdraw to a buffer zone along Gaza’s borders with Israel and Egypt, and significant amounts of aid would be brought in. Negotiations for a permanent ceasefire would take place.",
      "publishedAt": "2025-07-06T09:17:56Z",
      "title": "New details emerge on Gaza ceasefire proposal as Netanyahu heads to the White House",
      "url": "https://apnews.com/article/gaza-hamas-israel-ceasefire-f98461150ec7572beb8432325cbfd299",
      "urlToImage": "https://dims.apnews.com/dims4/default/3200673/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2Fc4%2Fd88ccf842246aa062d4cef7266a9%2F65e64c91632241b18b7ceabc569f5d4c"
    },
    {
      "author": null,
      "description": "Russia and Ukraine have exchanged drone strikes, disrupting air travel and causing fatalities and damage. Photos on social media showed crowds huddling at Russian airports including key international hubs in Moscow and St. Petersburg as hundreds of flights were delayed or canceled due to Ukrainian drone strikes. The attacks followed Ukrainian President Volodymyr Zelenskyy's announcement of deals with Western partners to boost drone production. Ukraine has increasingly relied on drones to counter Russia's offensives. Zelenskyy said he also discussed joint drone production with U.S. President Donald Trump in a recent phone call.",
      "publishedAt": "2025-07-06T15:26:02Z",
      "title": "Russia and Ukraine trade drone strikes as Kyiv signs deals to boost drone production",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-ad1ab4ca595189e3c367f4fe7a1bfa97",
      "urlToImage": "https://dims.apnews.com/dims4/default/eaf0c1f/2147483647/strip/true/crop/5880x3307+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F7f%2F467f51d40c78dbe223df583fa9e1%2Fd53c09d2960b4dc6ae55dcae50373c49"
    },
    {
      "author": null,
      "description": "Donald Trump has made tax cuts a central part of his political legacy. There were his first-term cuts. And now the Republican has pushed through an extension of those cuts and added new tax breaks. But the bill he signed into law Friday also comes with significant cuts to Medicaid and food assistance, contradicting promises to protect such programs. Democrats plan to make that expected fallout a campaign focus, while Republicans argue the bill will boost the economy. Historically, major legislation that's been backed mostly by just one party has rarely translated into political rewards. So the long-term effects of Trump’s tax policy are unclear.",
      "publishedAt": "2025-07-05T12:43:42Z",
      "title": "Trump's big bill may come at a political cost",
      "url": "https://apnews.com/article/trump-tax-cuts-health-care-medicaid-elections-ec859e18ddc3619f529dcdfd6e087dd8",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a25bbd/2147483647/strip/true/crop/2825x1589+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F5b%2F9fd719f84999ac37bb7aa2147d5d%2Fd5286240b8d34b61b8ad903358af6876"
    },
    {
      "author": null,
      "description": "The lawyer whose defense team won acquittal for Sean “Diddy” Combs on life-sentence-eligible charges says the music mogul was greeted by a standing ovation from fellow prisoners when he returned to jail after the verdict. Attorney Marc Agnifilo says he told Combs before his September arrest that he could beat sex trafficking and conspiracy charges and set an example for other Black men unjustly charged. Agnifilo says he thinks Combs “took that to heart.” The 55-year-old Combs could still face several more years in prison for his conviction on prostitution-related charges. Sentencing, set for Oct. 3, might occur weeks earlier.",
      "publishedAt": "2025-07-06T16:35:19Z",
      "title": "Sean 'Diddy' Combs gets standing ovation from inmates after court victory, his lawyer says",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-defense-91674a2f63ad6ff55d359a78c1a88030",
      "urlToImage": "https://dims.apnews.com/dims4/default/5821822/2147483647/strip/true/crop/4800x2700+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F90%2Fd5a68111dd3c17abcf2e1c17eb68%2F802d0b182e5f40f4949b7c1e9d2d3b9d"
    },
    {
      "author": null,
      "description": "Dodgers pitcher Clayton Kershaw has been selected for his 11th All-Star Game, joining the roster as a Legend Pick by MLB Commissioner Rob Manfred. At 37, Kershaw is the oldest National League All-Star for the July 15 game at Atlanta’s Truist Park while 22-year-old James Wood is the youngest overall. There are 19 first-time All-Stars and five 23 or younger, with Wood joined by Paul Skenes, Elly De La Cruz and elected starters Pete Crow-Armstrong and Jacob Wilson.",
      "publishedAt": "2025-07-06T21:40:37Z",
      "title": "Kershaw makes 11th All-Star team, Wood the youngest All-Star at 22",
      "url": "https://apnews.com/article/kershaw-wood-allstar-175dd964900f2b960c7f3342b679eaa9",
      "urlToImage": "https://dims.apnews.com/dims4/default/0dfea73/2147483647/strip/true/crop/3936x2214+0+177/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fe8%2Fd6ddd1d08c2b0ef7ec94ff120d23%2F46f492eb406340dcb630bf3450d13978"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}