{
  "articles": [
    {
      "author": null,
      "description": "State media says Iran executed three more prisoners Wednesday for alleged spying in the latest hangings connected to its war against Israel. The hangings happened in Urmia Prison in Iran’s West Azerbaijan province, which is the country’s most northwest province. IRNA cited Iran’s judiciary for the news, saying the men had been accused of bringing “assassination equipment” into the country. Iran has carried out several hangings during its war with Israel, sparking fears from activists that it could conduct a wave of executions after the conflict ended.",
      "publishedAt": "2025-06-25T06:07:56Z",
      "title": "Iran executes 3 more prisoners it accused of spying for Israel",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-23-2025-63d873b977642a40986d1f1dee5c4b37",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1997aa/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2Fdd%2F64ed9062095c7afa498afe51dbc6%2F3207f17b859c4469adc5ff66543b4882"
    },
    {
      "author": null,
      "description": "The Gaza Health Ministry says hundreds of premature babies are at risk of death from starvation across the war-battered Gaza Strip. Mothers and others blame Israel’s blockade for the plight of their children. Doctors say that although some formula has been delivered, the situation is dire. Their desperation comes as the war in Gaza has been overshadowed by the Israel-Iran war. Doctors say formula is crucial because many mothers can't breastfeed because they are malnourished. One hospital recently received a supply of formula but more deliveries aren't guaranteed. The director of another hospital says it is out of stock of the fortified formula required for newborns.",
      "publishedAt": "2025-06-25T14:09:10Z",
      "title": "War-battered Gaza is running out of baby formula needed for infants",
      "url": "https://apnews.com/article/gaza-babies-premature-hospitals-formula-israel-war-330ba6611e63940c903cdc19540914c3",
      "urlToImage": "https://dims.apnews.com/dims4/default/bfbfdd7/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F5f%2F17d4606ebee3fc5f104be6396b47%2Fccba219293074951a528fae96ec7fc20"
    },
    {
      "author": null,
      "description": "President Donald Trump is insisting that U.S. strikes delivered a crushing blow to Iran’s nuclear program. That's despite a preliminary American intelligence assessment suggesting that the assault inflicted only a marginal setback. The leaked intelligence assessment said Iran suffered a delay of only a few months. The administration deployed a phalanx of top officials to defend Trump's claims that Iran’s nuclear program was “completely and fully obliterated.” Defense Secretary Pete Hegseth said was assessment was “preliminary” and “low confidence.” Secretary of State Marco Rubio said the officials who disclosed the findings are “professional stabbers.”",
      "publishedAt": "2025-06-25T14:07:13Z",
      "title": "Trump defends US strikes on Iran after intel assessment",
      "url": "https://apnews.com/article/donald-trump-iran-nuclear-strikes-intel-863369a112a14021cb59cbf985a1c74b",
      "urlToImage": "https://dims.apnews.com/dims4/default/c46f5b5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F96%2Fd13c3e11ab1f3208f18cc7e3ef43%2F78a4f84a7e2c452bb595035aaca72088"
    },
    {
      "author": null,
      "description": "NATO Secretary-General Mark Rutte is upbeat that the military organization will agree a massive spending hike at a “transformational summit,” as member state leaders including U.S. President Donald Trump are expected to agree a new defense spending target of 5% of gross domestic product. Russia remains the major threat in Europe, but the United States is shifting its attention to focus on security priorities elsewhere. Ahead of the meeting, Spain officially announced that it would not be able to reach the target by the new 2035 deadline, calling it “unreasonable.” Belgium signaled that it will not get there either, and Slovakia said it reserves the right to decide its own defense spending.",
      "publishedAt": "2025-06-25T06:54:49Z",
      "title": "Back to the future: NATO leaders hark back to the Cold War as they meet to hike defense spending",
      "url": "https://apnews.com/article/nato-defense-spending-trump-spain-db0912cbfdaedc4c6b57809c9e11d6bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/64ddf4d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F5c%2Fb2c0ad18044c1a221901dce6c7e9%2F20cd28f1aff34296ab037eba607c9cb7"
    },
    {
      "author": null,
      "description": "Zohran Mamdani had been a state lawmaker unknown even to most New Yorkers before announcing his run for mayor. But that was before he declared victory in Tuesday's Democratic primary. The 33-year-old former foreclosure prevention counselor has represented a legislative district in Queens since 2020. He’s also a one-time rapper and son of award-winning Hollywood filmmaker Mira Nair, whose credits include “Monsoon Wedding” and “The Namesake.” Mamdani was born in Uganda and became an American citizen shortly after graduating college. He’s seeking to become the city’s first Muslim and Indian American mayor, not to mention its youngest mayor in generations.",
      "publishedAt": "2025-06-25T16:56:09Z",
      "title": "Who is Zohran Mamdani? State lawmaker seeks to become NYC's first Muslim and Indian American mayor",
      "url": "https://apnews.com/article/nyc-mayoral-democratic-primary-zohran-mamdani-f87ea9d5b649cea8335ca7df6399c1f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/484694f/2147483647/strip/true/crop/5031x2830+0+262/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F45%2F10%2Ff3581dfec9a97d568259cc290524%2Fd17e586066934a979525af115ba0dccd"
    },
    {
      "author": null,
      "description": "Weather forecasters are predicting wild temperature swings across the eastern U.S. Wednesday was expected to be another scorcher before temperatures plunge as much as 30 degrees. On Tuesday, at least 50 heat records were broken and 21 places hit triple-digit temperatures. About 127 million Americans are under some kind of National Weather Service heat advisory, down from more than 150 million Tuesday. The sizzling temperatures sent utilities scrambling to keep the air conditioning and lights on because of the massive power demand.",
      "publishedAt": "2025-06-25T17:07:11Z",
      "title": "Extreme heat pushing energy demand will give way to cooler temperatures",
      "url": "https://apnews.com/article/heat-advisory-energy-demand-extreme-weather-264e888992e7d8aa07ca4e20270fa1c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7d61f6/2147483647/strip/true/crop/3900x2194+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2Fdf%2F335c33cea0354b2ed0903c7dfd3a%2Fa128debe01834430a5619141e4143d9e"
    },
    {
      "author": null,
      "description": "Vietnam veteran Richard Gerald Jordan is set to be executed in Mississippi nearly 50 years after being sentenced to death. Jordan is scheduled to be executed Wednesday for murdering a woman in a kidnapping and ransom scheme in 1976. He is the state’s longest-serving death row inmate and is one of several inmates suing the state over its three-drug execution protocol, which they claim is inhumane. Jordan will be the third person Mississippi has executed in the last 10 years. His execution comes a day after a man was executed in Florida in what is shaping up to be a year with the most executions since 2015.",
      "publishedAt": "2025-06-25T04:01:56Z",
      "title": "Mississippi's longest-serving death row inmate is set to be executed",
      "url": "https://apnews.com/article/execution-mississippi-richard-gerald-jordan-lethal-injection-vietnam-d20dea8a614d65dd01a771abd0ae95e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/a780609/2147483647/strip/true/crop/4000x2250+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F77%2F842408c6f1c227d74a6713c82289%2F2f9cb009987445bb982648f278987860"
    },
    {
      "author": null,
      "description": "U.S. Health Secretary Robert F. Kennedy Jr.’s new vaccine advisory panel is meeting for the first time. The group is discussing COVID-19 shots Wednesday, though no vote on recommendations is planned. Kennedy has said those shots will no longer be recommended for healthy children or pregnant women, creating uncertainty about access to that vaccine. The panel has been reshaped by Kennedy: He fired all 17 previous members and his replacements include anti-vaccine voices. In a House hearing Tuesday, Kennedy defended his purge, saying the old panel had been “a template for medical malpractice.”",
      "publishedAt": "2025-06-25T14:10:32Z",
      "title": "New CDC vaccine advisers meet to discuss COVID-19, RSV shots",
      "url": "https://apnews.com/article/cdc-vaccine-advisers-covid19-rsv-a85baa8a9296fd857af5ce33ae3b6cfd",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ee050b/2147483647/strip/true/crop/5943x3343+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F1f%2F88d02e6c4ad67d9e45ad24f68842%2Fd0f314bf4b424098931bc522b938b6bf"
    },
    {
      "author": null,
      "description": "World shares are mixed as a fragile ceasefire between Israel and Iran appears to be holding. Investors have shifted their focus to comments to Congress by Federal Reserve Chair Jerome Powell. On Tuesday, the S&P 500 rallied 1.1% to within 0.8% of its record. The Dow Jones Industrial Average rose 1.2%, and the Nasdaq composite jumped 1.4%. Oil prices gained more than 1% early Wednesday after falling about 6% on Tuesday on hopes that Israel’s war with Iran will not damage the global flow of crude. Lower oil prices could give the Fed leeway to cut interest rates to help the economy, and Powell said it is waiting for the right time to do so.",
      "publishedAt": "2025-06-25T06:00:09Z",
      "title": "World shares are mixed as a fragile Israel-Iran ceasefire holds",
      "url": "https://apnews.com/article/stocks-markets-oil-powell-inflation-tariffs-80068c5388469b83648e478cdccf2f80",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c220ff/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2F4f%2Fc4a3a593b15a47e56358443bc67f%2Fab7714b617bb446ea1e4c48b92523ca9"
    },
    {
      "author": null,
      "description": "Cooper Flagg lived up to every expectation during one season at Duke and has the potential for NBA superstardom. That’s why Mavericks fans can’t wait to get him to Dallas. The Mavericks are expected to take Flagg with the No. 1 pick in the draft on Wednesday night, quickly adding another franchise-altering player after trading one away last season. The Mavericks fell into the lottery after dealing Luka Doncic to the Los Angeles Lakers in February, though they had only a 1.8% chance of winning it. When they did, it gave them the opportunity to add an 18-year-old who was college basketball’s best player in 2024-25.",
      "publishedAt": "2025-06-25T15:09:25Z",
      "title": "Cooper Flagg expected to be No. 1 pick by Mavericks in NBA draft",
      "url": "https://apnews.com/article/nba-draft-2025-picks-cooper-flagg-315cf506494acafe615e1809531b5be4",
      "urlToImage": "https://dims.apnews.com/dims4/default/c456679/2147483647/strip/true/crop/2667x1500+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2Fe0%2F5ec85047c3b25a3a17a23af94b3e%2Fd21ce25f49764c0195ac8668200f0b7c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}