{
  "articles": [
    {
      "author": "PATRICK WHITTLE",
      "description": "LEWISTON, Maine (AP) — Ben Dyer hasn't decided how he'll vote in one of the nation's most closely watched congressional elections this year, but he knows guns will be on his mind when he casts his ballot.",
      "publishedAt": "2024-06-10T04:15:38Z",
      "title": "Lewiston survivors consider looming election as gun control comes to forefront after mass shooting",
      "url": "https://apnews.com/98c5ba5d11ead7cceef57dd44fbea277",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41946fa9630b4703b17d988527650987/1920.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, MICHAEL KUNZELMAN, RANDALL CHASE and ALANNA DURKIN RICHER",
      "description": "WILMINGTON, Del. (AP) — A prosecutor told jurors Monday that “no one is above the law” as he urged them to convict President Joe Biden's son Hunter on charges that he lied about his drug use when he bought a gun in 2018.",
      "publishedAt": "2024-06-10T04:21:11Z",
      "title": "'No one is above the law,' prosecutor says as he urges jurors to convict Hunter Biden on gun charges",
      "url": "https://apnews.com/774dd2f5661b246085c7409139dedaef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c8bb246e90a46cdba9f22da43842680/3000.jpeg"
    },
    {
      "author": "RAF CASERT, LORNE COOK and SAMUEL PETREQUIN",
      "description": "BRUSSELS (AP) — Far-right parties rattled the traditional powers in the European Union with major gains in parliamentary seats, dealing an especially humiliating defeat to French President Emmanuel Macron, who called snap legislative elections.",
      "publishedAt": "2024-06-10T06:35:22Z",
      "title": "The far right's election gains rattle EU's traditional powers, leading Macron to call snap polls",
      "url": "https://apnews.com/acd0ceef91d198cf5e9ee695f394b28c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fff46e02daf34ded9984249269c45964/3000.jpeg"
    },
    {
      "author": "LORNE COOK",
      "description": "BRUSSELS (AP) — A four-day election has shaken the foundations of the European Union, with the far right rocking ruling parties in France and Germany, the bloc’s traditional driving forces.",
      "publishedAt": "2024-06-10T08:10:28Z",
      "title": "The main takeaways after the far right rocks European politics, sparking a snap election in France",
      "url": "https://apnews.com/f3823de802e9a90570abc53e7f6b6931",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e7b8283f40340f7ac6f62eb45cb10b9/3000.jpeg"
    },
    {
      "author": "GREGORY GONDWE and GERALD IMRAY",
      "description": "BLANTYRE, Malawi (AP) — A military plane carrying Malawi's vice president and nine others went missing Monday and a search is underway, the president's office said.The plane carrying 51-year-old Vice President Saulos Chilima left the southern African nation's capital, Lilongwe, at 9.17 a.m.",
      "publishedAt": "2024-06-10T16:19:30Z",
      "title": "A military plane carrying Malawi's vice president is missing and a search is underway",
      "url": "https://apnews.com/2850e56f58e4635b3aeadc205713947f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65c84ddc92b14cbe9b68c76ff7d52ccc/904.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israel's dramatic weekend rescue of four hostages from the Gaza Strip, in an operation that local health officials say killed 274 Palestinians, came at a sensitive time in the 8-month-old war, as Israel and Hamas weigh a U.S.",
      "publishedAt": "2024-06-10T05:17:29Z",
      "title": "What does Israel's rescue of 4 captives, and the killing of 274 Palestinians, mean for truce talks?",
      "url": "https://apnews.com/0faafb8a1b0e4f0050dd20efc81e937d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dac76f3ff11a4561b1b1e1b671dfc5d5/3000.jpeg"
    },
    {
      "author": null,
      "description": "PERTH, Australia (AP) — Mohammed Rashid once worked as a forklift driver in a Chicago warehouse.Fast forward to these grim times and Rashid, along with his Palestine soccer teammates, carry a heavier weight knowing success on the field offers a little respite from the war raging in Gaza.",
      "publishedAt": "2024-06-10T16:12:55Z",
      "title": "Palestine players continue push for World Cup qualification amid war back home",
      "url": "https://apnews.com/e7d57b139dad0752f4e72fa28114ceb6",
      "urlToImage": ""
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "SCHURZ, Nevada (AP) — Members of the Walker River Paiute Tribe have watched the boundaries of their land recede over time along with the waters of the lake that are central to their identity, threatening the cultural symbol that gave the tribe its name — Agai Dicutta, or Trout Eaters.",
      "publishedAt": "2024-06-10T04:24:03Z",
      "title": "Nevada has a plan to expand electronic voting. That concerns election security experts",
      "url": "https://apnews.com/ea74f2fdbf58c84f38fc80603d1db46e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e68cf4d4ee254ae58d9e721fa60db358/1920.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "CUPERTINO, Calif. (AP) — Apple's annual World Wide Developers Conference on Monday is expected to herald the company's move into generative artificial intelligence, marking its late arrival to a technological frontier that's expected to be as revolutionary as the invention of the iPhone.",
      "publishedAt": "2024-06-10T04:08:47Z",
      "title": "Apple expected to enter AI race with ambitions to overtake the early leaders",
      "url": "https://apnews.com/4217d67977f95ead880835a71ecce098",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ae37be708c84218838113206c14af27/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "WASHINGTON (AP) — African elephants call each other and respond to individual names — something that few wild animals do, according to new research published Monday.",
      "publishedAt": "2024-06-10T16:03:28Z",
      "title": "African elephants call each other by unique names, new study shows",
      "url": "https://apnews.com/3dc80b1643c2bbccdeac59515649f86d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c2ae8a9c44043e0a6f2856638e5308f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}