{
  "articles": [
    {
      "author": "Stephanie Liechtenstein",
      "description": "The U.N. nuclear watchdog says Iran has further increased its stockpile of uranium enriched to near weapons-grade levels. That's according to a confidential report by the International Atomic Energy Agency, which called on Tehran to urgently change course and comply with the agency’s probe. Saturday's report comes at a sensitive time as Tehran and Washington have been holding several rounds of talks over a possible nuclear deal that U.S. President Donald Trump is trying to reach.",
      "publishedAt": "2025-05-31T10:49:43Z",
      "title": "Iran has amassed even more near weapons-grade uranium, IAEA says",
      "url": "https://apnews.com/article/iran-nuclear-iaea-uranium-7f6c9962c1e4199e951559096bcf5cc0",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb8fc83/2147483647/strip/true/crop/9504x5346+0+495/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2Ff0%2Fc4488c14c58d2e840ec79a247e5c%2F665e2c52fdac4f62874a07f6bfb4c9fc"
    },
    {
      "author": null,
      "description": "A Ukrainian official says a Russian missile hit a front-line region in Ukraine, killing a child and injuring another. The Ukrainian air force says Russian troops launched some 109 drones and five missiles across Ukraine overnight and into Saturday. Three of the missiles and 42 drones were destroyed by air defenses, while another 30 drones failed to reach their targets without causing damage. The attack came as uncertainty remains as to whether Kyiv diplomats will attend a new round of peace talks proposed by Moscow for early next week in Istanbul.",
      "publishedAt": "2025-05-31T09:04:53Z",
      "title": "Russian missile strike targets Ukrainian front line region, killing a child",
      "url": "https://apnews.com/article/russian-ukraine-missile-strike-peace-talks-48819d7697a7dff76bc6175503a146d8",
      "urlToImage": "https://dims.apnews.com/dims4/default/44b383d/2147483647/strip/true/crop/7739x4353+0+403/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Fab%2F65ef6ac41229b1dc17d671cb934a%2F14b9f6f7a4734cf1a94795f66120446b"
    },
    {
      "author": "Michelle L. Price, Marc Levy, Darlene Superville",
      "description": "President Donald Trump says he’s doubling the tariff rate on steel to 50%, a dramatic increase that could further push up prices for a metal used to make housing, autos and other goods. Trump made the announcement Friday at U.S. Steel’s Mon Valley Works–Irvin Plant in West Mifflin, Pennsylvania, near Pittsburgh, where he announced investments by Japan’s Nippon Steel. The price of steel products has increased roughly 16% since Trump became president in January, according to the government’s producer price index. Trump later added that aluminum tariffs would also be doubled to 50% and said both tariff hikes would go into effect Wednesday.",
      "publishedAt": "2025-05-30T04:01:23Z",
      "title": "Trump to double tariffs on foreign steel from 25% to 50%",
      "url": "https://apnews.com/article/trump-us-steel-nippon-pennsylvania-7d8a252934abef553ca9ea7e9e8febc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c0f8c7/2147483647/strip/true/crop/5467x3075+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb0%2Fea%2F24f3480640713c8ba991934fccc8%2Fc7f62bc371614d7389e96b8d3ade8f61"
    },
    {
      "author": "Tara Copp, David Rising",
      "description": "U.S. Defense Secretary Pete Hegseth reassured allies in the Indo-Pacific that they will not be left alone to face increasing military and economic pressure from China. Hegseth spoke on Saturday at the Asian Defense Summit in Singapore. He said Washington will bolster its defenses overseas to counter what the Pentagon sees as rapidly developing threats by Beijing. Hegseth said China is no longer just building up its military forces to be able to take Taiwan by 2027, it’s “actively training for it, every day.” He said the threat China poses \"is real — and it could be imminent.”",
      "publishedAt": "2025-05-31T01:04:17Z",
      "title": "Hegseth underscores US commitment to Indo-Pacific",
      "url": "https://apnews.com/article/us-hegseth-speech-china-taiwan-7a0ee0860be972f5f9eeca09926ecd85",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e1110d/2147483647/strip/true/crop/8278x4656+0+431/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2F37%2Fdd5e450a293caf6f0ac18d793331%2F7d46d0e72f244917a29dfc1417f13ee9"
    },
    {
      "author": null,
      "description": "Manitoba's premier says the Canadian prairie city of Flin Flon hasbeen virtually deserted and more evacuees were expected as wildfires raged in the province. Premier Wab Kinew told a news conference that the mayor, councilors, health-care staff and other officials have had to depart Flin Flon, a city of 5,000 people. The evacuees are among 17,000 people reported so far to have left their homes due to a number of wildfires burning in remote regions from Manitoba’s northwest to the southeast. Kinew said as the fires grow, thousands more evacuees can be expected and that communities like Winnipeg, Thompson and The Pas have already stepped up to help provide food and shelter.",
      "publishedAt": "2025-05-30T22:32:57Z",
      "title": "A Canadian prairie city virtually deserted as fires rage and thousands more evacuees expected",
      "url": "https://apnews.com/article/canada-wildfires-manitoba-evacuees-57156ab9d3fa1c0e14168905a846391e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7e3bfb/2147483647/strip/true/crop/4994x2809+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fbf%2F1faf4da676c4dbc030838a23d788%2F9830a43ca4fb4aeeb2b3dbf2c0c7266a"
    },
    {
      "author": null,
      "description": "At least 151 people have now been confirmed dead after heavy rainfall unleashed flooding in a market town in north-central Nigeria, the local emergency services told The Associated Press on Saturday. More than 3,000 people were displaced in the flooding in the town of Mokwa in Niger state, more than 180 miles (300 kilometers) west of Abuja, the capital of Africa’s most populous nation, Niger state emergency agency spokesman Ibrahim Audu Husseini said. At least 500 households across three communities were affected in the predawn rain Friday, leaving roofs barely visible and residents waist-deep in water, Husseini added.",
      "publishedAt": "2025-05-31T10:36:35Z",
      "title": "Death toll from reaches 151 in north-central Nigeria town submerged in floods, thousands displaced",
      "url": "https://apnews.com/article/nigeria-floods-mokwa-c29db671f8b92972d8800a82adb2cd97",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e0d270/2147483647/strip/true/crop/4000x2250+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F39%2Ffffdd38411236f9dfa1d68427993%2F27d1fad4ff2e4d6ba929992c79012ab0"
    },
    {
      "author": "Thomas Adamson",
      "description": "After glamorizing tobacco for decades, France is preparing for its most sweeping smoking ban yet. Beginning July 1, smoking will be outlawed in virtually all outdoor public areas where children may gather. That includes beaches, parks, gardens, playgrounds, sports venues, school entrances and bus stops. Health Minister Catherine Vautrin says tobacco must disappear wherever children are present. The law also signals a deeper cultural shift. Smoking has defined French identity, fashion and cinema for so long that the new measure feels like a quiet revolution in a country whose relationship with tobacco is famously complex.",
      "publishedAt": "2025-05-31T04:09:44Z",
      "title": "The country that made smoking sexy breaks up with cigarettes",
      "url": "https://apnews.com/article/smoking-ban-bardot-glamour-niccotine-4890df3bcb06dbb30d2ea0cbe12d51cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/22f4063/2147483647/strip/true/crop/5421x3049+0+384/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2F76%2F0e4188de1860b4d72454df2f75d3%2F074560f0dbc946cd845cc01dbb605618"
    },
    {
      "author": "Vanessa Gera",
      "description": "Poland is set to hold a presidential runoff election on Sunday between two candidates offering starkly different visions for the country’s future. The winner will succeed President Andrzej Duda who is finishing his second and final term. The outcome will determine whether Poland embraces a nationalist populist trajectory or pivots more fully toward liberal and pro-European policies. Final results are expected Monday. Whoever wins will either help or hinder the agenda of the centrist government of Prime Minister Donald Tusk where most of the real power in Poland rests.",
      "publishedAt": "2025-05-31T06:33:34Z",
      "title": "Poland holds a pivotal presidential runoff influenced by Trump, the far right and the war in Ukraine",
      "url": "https://apnews.com/article/poland-presidential-election-trzaskowski-nawrocki-044c5ad6f0e09edcca8e7808e2d55b8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a257a83/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F06%2F5454ed26e49747fe51805c169f64%2Fcc05e81107984604bc15ce90a994cc7e"
    },
    {
      "author": "Jack Brook",
      "description": "The 10 men who escaped from a New Orleans jail more than two weeks ago by cutting out a hole behind a toilet received help from at least 14 people, many of them friends and family who provided food, cash, transport and shelter according to court documents. Some are held on bonds $1 million or higher. Records reviewed by The Associated Press show how some of the fugitives received aid before and after their escape — including from a number of people named in police reports but not facing charges, such as an apparent former jail employee. Authorities upped the reward to $50,000 for each of the two remaining fugitives.",
      "publishedAt": "2025-05-31T04:05:28Z",
      "title": "Authorities investigate friends and family of New Orleans jailbreak fugitives",
      "url": "https://apnews.com/article/new-orleans-jailbreak-aa0b181660d7a5b5284b8bf73a420d28",
      "urlToImage": "https://dims.apnews.com/dims4/default/eff0b70/2147483647/strip/true/crop/5953x3349+0+800/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2Fb3%2Fa4a7b55ee11cf256730c041fc440%2F8e563106f3f244ceb94c5165c3333bab"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "The third week of Sean “Diddy” Combs' sex trafficking and racketeering trial featured testimony from the second of three women expected to testify that the hip-hop mogul sexually abused them. It was also highlighted by additional testimony about a break-in of rapper Kid Cudi's Los Angeles home and the later destruction of his Porsche with a Molotov cocktail. One of the biggest developments of the week came outside of the courtroom when Casandra “Cassie” Ventura delivered her third child on Wednesday. The jury learned of it through a witness. Cassie, a girlfriend of Combs and the star government witness, testified for four days in the trial's first week. Combs has pleaded not guilty.",
      "publishedAt": "2025-05-31T04:06:42Z",
      "title": "Key moments from the third week of Sean 'Diddy' Combs' sex trafficking trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-6f628c208c0dac30c89ef546f0bdcc70",
      "urlToImage": "https://dims.apnews.com/dims4/default/04752ea/2147483647/strip/true/crop/3500x1969+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F1b%2Ff77b29dfd4fb41f15c70e43c726f%2F9947473cea9848a8a5e92a20a4d152e7"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}