{
  "articles": [
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — A 15-year-old student opened fire inside a study hall at a small Christian school in Wisconsin, killing a teacher and a teenager and prompting a swarm of police officers to descend on the school in response to a second grader's 911 call.",
      "publishedAt": "2024-12-17T05:17:11Z",
      "title": "A 15-year-old girl fatally shoots a teacher and a teenager at a Christian school in Wisconsin",
      "url": "https://apnews.com/a8e1ee353d7fdab2b86dfb355938d871",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fae855d2105749f1815fd6552c23c7db/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — At a time of heightened political division, Americans' confidence in their country’s judicial system and courts dropped to a record low of 35% this year, according to a new Gallup poll.",
      "publishedAt": "2024-12-17T05:01:38Z",
      "title": "Americans' trust in nation's court system hits record low, survey finds",
      "url": "https://apnews.com/1d4d2e22e9699cc09b29ec6ac8f374e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/982e848dcad047869c6661f0c5acf1af/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A senior Russian general was killed Tuesday by a bomb hidden in a scooter outside his apartment building in Moscow, a day after Ukraine’s security service leveled criminal charges against him. A Ukrainian official said the service carried out the attack.",
      "publishedAt": "2024-12-17T06:35:48Z",
      "title": "A top Russian general is killed in a Moscow bombing claimed by Ukraine",
      "url": "https://apnews.com/9656bce946a9f552454df9debe5fbd18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b9cab20ec22426cabbd99b118f08939/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli strike in Gaza killed at least eight people from the same family, most of them women and children, Palestinian medics said Tuesday. The strike late Monday hit a house in Gaza City’s central neighborhood of Daraj, according to the Gaza Health Ministry’s ambulance and emergency service.",
      "publishedAt": "2024-12-17T07:37:54Z",
      "title": "Middle East latest: Israeli strike in Gaza kills at least 8 from the same family, Palestinians say",
      "url": "https://apnews.com/3df6c0a90a0d58efc30e4b5f7143c96f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebe5822a350a47eab30b9d9aab48b2a4/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "After months of deadlock, Israel and Hamas appear to be moving closer toward a ceasefire to end their 14-month war.",
      "publishedAt": "2024-12-16T22:13:45Z",
      "title": "Negotiators say Israel and Hamas are inching toward a ceasefire deal. This is what it may look like",
      "url": "https://apnews.com/264087c7a547031a9433ecbbdcd920d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0e10fe5ddd24e558b9fa141f197f322/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A judge Monday refused to throw out President-elect Donald Trump’s hush money conviction because of the U.S.",
      "publishedAt": "2024-12-17T00:16:36Z",
      "title": "Judge rejects Trump’s bid to toss hush money conviction because of Supreme Court immunity ruling",
      "url": "https://apnews.com/908465ed0b7f2005c72226b5b2546260",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38871df356fe4eceba6c2dd3cb88250a/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "RIVERHEAD, N.Y. (AP) — The New York architect facing murder charges in a string of deaths known as the Gilgo Beach killings was charged on Tuesday in the death of a seventh woman.",
      "publishedAt": "2024-12-17T10:50:26Z",
      "title": "Suspect in Gilgo Beach serial killings is charged in the death of a seventh woman",
      "url": "https://apnews.com/9b26b12cc6b75b58ef6e56c4871906f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96e5b07ac8904cc19ce75bd0083db93b/3000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — A powerful magnitude 7.3 earthquake struck just off the coast of Vanuatu on Tuesday, causing widespread destruction in the South Pacific island nation as the injured began arriving at a hospital and unconfirmed reports of casualties emerged.",
      "publishedAt": "2024-12-17T02:42:06Z",
      "title": "Magnitude 7.3 earthquake causes widespread damage in Pacific island nation of Vanuatu",
      "url": "https://apnews.com/3e4cc1e02bc0ec62d5931b00286688ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d13de2887c64a82aee2f58e5932a45a/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "NEW YORK (AP) — An Alabama woman is recovering well after a pig kidney transplant last month that freed her from eight years of dialysis, the latest effort to save human lives with animal organs.",
      "publishedAt": "2024-12-17T13:14:40Z",
      "title": "An Alabama woman is doing well after the latest experimental pig kidney transplant",
      "url": "https://apnews.com/844b33450a9c228d1138827c1de8549d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c85e5243df142998f82022b7f18062a/1920.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — The chairs stay occupied at 12 Pell. Client after client, they come through the tiny barbershop on a narrow side street in Manhattan’s Chinatown. They come for the cuts, sure.",
      "publishedAt": "2024-12-17T05:08:48Z",
      "title": "Younger Asian Americans navigate something new to their generation: Taking up space",
      "url": "https://apnews.com/3e042c230d94f01b5ce67f44eb917555",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a6cdfe5af2e46a7b20955204b895ea1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}