{
  "articles": [
    {
      "author": "Will Weissert, Joey Cappelletti, Seung Min Kim",
      "description": "President Donald Trump has celebrated the 100th day of his second term — yet spent much of his rally marking it in campaign mode, fixated on past grudges and grievances. He repeatedly mocked his Democratic predecessor, Joe Biden, at Tuesday's rally — attacking Biden's mental acuity and even how he appears in a bathing suit. He again uttered the lie that he won the 2020 presidential election. And he attacked polling and news coverage not favorable to him. And the rally just outside Detroit, which marked Trump’s largest political event since returning to the White House, glossed over two forces that had rocked the state: his steep trade tariffs and combative attitude toward Canada.",
      "publishedAt": "2025-04-29T11:01:34Z",
      "title": "Trump marks first 100 days in office with a Michigan rally",
      "url": "https://apnews.com/article/trump-100-days-michigan-whitmer-2e30695aa185a785cc1037ab74c19a55",
      "urlToImage": "https://dims.apnews.com/dims4/default/3116059/2147483647/strip/true/crop/4181x2352+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F45%2F937bead667791b214150d7bf7173%2F9094535d07b243f2adaab240a9d40e59"
    },
    {
      "author": "Paul Wiseman, Anne D'Innocenzio, Christopher Rugaber",
      "description": "American businesses are cancelling orders from China, postponing expansion plans and hunkering down to see what trade policy surprises President Donald Trump plans to spring on them next. The president’s massive and unpredictable taxes on imports seems likely to mean emptier shelves and higher prices for American shoppers, perhaps within weeks. And the higher costs and paralyzing uncertainty are likely to exact an economic toll: U.S. consumers are in the biggest funk since COVID-19 hit five years ago, and economists say recession risks are climbing. An early sign of the damage is expected to emerge on Wednesday when the government is expected to report that the economy expanded at an annual pace of just 0.8% from January through March.",
      "publishedAt": "2025-04-30T04:01:07Z",
      "title": "Trump's tariffs loom over the economy as shipments from China fall",
      "url": "https://apnews.com/article/trump-tariff-economy-recession-china-imports-trade-8d90bb37735e833c43a7b7a9d5a0b9a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/6312dc9/2147483647/strip/true/crop/8064x4536+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F36%2Fdee2f6b45c0180d57e0e1f81fb6e%2F2065660afc6848e789dbbe80dd195778"
    },
    {
      "author": "Prabhjot Gill, Sheikh Saaliq",
      "description": "Pakistan said Wednesday it had “credible intelligence” that India is planning to attack it within days, as Pakistani nationals headed for the border to comply with New Delhi’s orders to almost all Pakistani citizens to leave the country following last week’s deadly attack in Indian-controlled Kashmir. There was no immediate comment from Indian officials. An attack on tourists in Indian-controlled Kashmir and India’s moves to punish Pakistan — which denies any connection to the massacre — have driven tensions between the nuclear-armed rivals to their highest point since 2019. United Nations Secretary-General Antonio Guterres, in separate phone calls with India and Pakistan, stressed the need to “avoid a confrontation that could result in tragic consequences.”",
      "publishedAt": "2025-04-30T08:55:15Z",
      "title": "Pakistan says it has 'credible intelligence' India will attack within days",
      "url": "https://apnews.com/article/india-pakistan-kashmir-pahalgam-attari-wagah-a16c6fc5cf190f0ce0759ad4370a29cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/83e5795/2147483647/strip/true/crop/4391x2470+0+229/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2F45%2F1dd3e419564210b0767e2a6295ac%2Fc0fee57cb3944e6e958fa5aed882bf21"
    },
    {
      "author": "Illia Novikov",
      "description": "A senior Kremlin official says clinching a deal to end the war between Russia and Ukraine “is far too complex to be done quickly.” Kremlin spokesman Dmitry Peskov's comments Wednesday came as the U.S. labors to bring momentum to peace efforts and expresses frustration over the slow progress. Officials, meanwhile, said that a nighttime Russian drone attack on Ukraine’s second-largest city of Kharkiv wounded at least 45 civilians. The United Nations reported that the number of Ukrainian civilian casualties in the more than three-year war has surged in recent weeks. Peskov said Russian President Vladimir Putin backs calls for a ceasefire “but before it’s done, it’s necessary to answer a few questions and sort out a few nuances.”",
      "publishedAt": "2025-04-30T10:30:34Z",
      "title": "Kremlin says a deal to end the war with Ukraine can't be achieved quickly",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-trump-peace-ce025ba11929ceff0c90f94c25a47624",
      "urlToImage": "https://dims.apnews.com/dims4/default/aff8e3f/2147483647/strip/true/crop/2000x1125+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F14%2F45e929300d98393b7d3f97682a3a%2F240d0dc0732f4098adde9846f11fd779"
    },
    {
      "author": "Rob Gillies",
      "description": "Canada’s Liberals are celebrating election victory in a stunning turn of fortune. The country won't know until later Tuesday whether the party of new Prime Minister Mark Carney will have an outright majority or need help in Parliament. And the Canadian Broadcasting Corporation projects that populist Conservative Party leader Pierre Poilievre will lose his Parliament seat. That caps a stunning turnaround in fortunes fueled by U.S. President Donald Trump’s annexation threats and trade war. Poilievre a few months ago appeared to be a shoo-in to become Canada’s next prime minister and shepherd the Conservatives back into power for the first time in a decade.",
      "publishedAt": "2025-04-29T13:26:21Z",
      "title": "Canada's Liberals celebrate a stunning win and the populist challenger loses his seat",
      "url": "https://apnews.com/article/canada-election-carney-trump-poilievre-7d42d2d93b98d471c2afb3cd602d117d",
      "urlToImage": "https://dims.apnews.com/dims4/default/aeaeec5/2147483647/strip/true/crop/2859x1608+0+53/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2Fde%2Fe6ef393fc57c54539be257a9b808%2F2a90955c70e345558ded1ad07c0197d1"
    },
    {
      "author": null,
      "description": "Germany’s center-left Social Democrats have voted to approve a coalition agreement. The vote’s results were announced Wednesday. It paves the way to elect Friedrich Merz as the new German chancellor. Merz’s Union bloc previously approved the agreement. The parliament will meet May 6 to elect Merz who will need a majority of all members of the lower house to be elected as post-World War II Germany’s 10th chancellor and succeed Olaf Scholz. The coalition aims to spur economic growth, ramp up defense spending, take a tougher approach to migration and catch up on long-neglected modernization.",
      "publishedAt": "2025-04-30T08:01:02Z",
      "title": "Center-left party backs German coalition deal, paving the way for Merz to become chancellor",
      "url": "https://apnews.com/article/germany-new-government-merz-social-democrats-coalition-7bd1e750dfb15411e78a3614bd54b87c",
      "urlToImage": "https://dims.apnews.com/dims4/default/77fb2ed/2147483647/strip/true/crop/2957x1663+0+152/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F2b%2F17239ac227d1b7e862fa1ec956e9%2F9e7c18ba563344c4a8a3c6ff55037561"
    },
    {
      "author": null,
      "description": "The Wisconsin Supreme Court has suspended a judge accused of helping a man evade immigration authorities. The FBI took Milwaukee County Circuit Judge Hannah Dugan into custody on Friday morning at the county courthouse. She faces federal charges of concealing an individual to prevent his discovery and arrest and obstructing or impeding a proceeding. The state Supreme Court issued a two-page order Tuesday noting that Dugan faces two federal charges and saying it is in the public interest to temporarily relieve her of her duties. Her attorney had no immediate comment. Democrats have accused the Trump administration of trying to chill the nation’s judiciary.",
      "publishedAt": "2025-04-29T22:10:44Z",
      "title": "Wisconsin high court suspends Milwaukee judge accused of helping man evade immigration authorities",
      "url": "https://apnews.com/article/milwaukee-judge-arrested-supreme-court-suspended-49f25ea7702d3211719f926f8cfc90b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/47ec2ed/2147483647/strip/true/crop/5490x3088+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F4f%2F59c88e690512105c2824d4a23bb2%2Ffa48e62bb0a84d8f8571da31f0552766"
    },
    {
      "author": null,
      "description": "Iran says the next round of negotiations over its rapidly advancing nuclear program it will have with the United States will be in Rome on Saturday. Iranian Foreign Minister Abbas Araghchi made the comment on Wednesday on the sidelines of a Cabinet meeting, adding that Iran also anticipated having a meeting Friday with France, Germany and the United Kingdom to discuss the talks. The talks with the U.S. again will be mediated by Oman. The sultanate has hosted two rounds of talks in Oman’s capital, Muscat, and one round at its embassy in Rome.",
      "publishedAt": "2025-04-30T08:24:01Z",
      "title": "Iran says next talks with US will be held in Rome",
      "url": "https://apnews.com/article/iran-us-nuclear-negotiations-oman-rome-432e2ed27a333b6d3710a3d1df9cfb9a",
      "urlToImage": "https://dims.apnews.com/dims4/default/10e612c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F6c%2F6b0926d74b7f3b46c797a3c00f77%2F2c0db1dcce4d4e049345e370ba1c2e53"
    },
    {
      "author": "Aniruddha Ghosal",
      "description": "Vietnam marked the 50th anniversary of the end of the war with the U.S. and the formation of the modern nation. Thousands gathered in Ho Chi Minh City for a military parade near the historic Independence Palace. Communist Party General Secretary To Lam emphasized national reconciliation, focusing on unity rather than military victory. But while Vietnam’s now mended ties with the U.S. reflect mutual efforts to address war legacies. But Vietnam needs to recalibrate to continue growing in a world economy that is fragile because of tensions between the U.S. and China.",
      "publishedAt": "2025-04-29T23:31:27Z",
      "title": "Vietnam marks 50 years since war’s end and focuses on reconciliation during a period of new tensions",
      "url": "https://apnews.com/article/vietnam-war-50th-anniversary-af6700cc535b24a9779e176570ed484d",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff2fe00/2147483647/strip/true/crop/7325x4120+0+382/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F53%2F4bbc493809ae4b316a4bdd28a698%2F6431b452dd624af8bcb1e7c26b399e34"
    },
    {
      "author": "Rod McGuirk",
      "description": "The Australian host of a weekend family lunch is on trial charged with murdering her estranged husband’s parents and an aunt and attempting to murder an uncle with poisonous mushrooms. Prosecutor Nanette Rogers opened her case on Wednesday against Erin Patterson, 50, in the Victoria state Supreme Court. Patterson has pleaded not guilty to all charges. Rogers says she served meals of beef Wellington, mashed potato and green beans at her home in rural town of Leongartha two years ago. Her guests included her parents-in-law Gail and Don Patterson, Gail Patterson’s sister Heather Wilkinson, and Wilkinson’s husband, Ian Wilkinson. All four guests were hospitalized the next day with poisoning from death cap mushrooms. Only Ian Wilkinson survived after a liver transplant.",
      "publishedAt": "2025-04-30T06:16:36Z",
      "title": "Australian stands trial charged with murdering ex-husband's relatives with poisonous mushrooms",
      "url": "https://apnews.com/article/australia-poisonous-mushrooms-murder-death-cap-erin-patterson-6445e7fbdf25135096703ac3bed4cb3a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8ccdca/2147483647/strip/true/crop/1469x826+0+76/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F7d%2F6ef58a83fc659233f808da9fd517%2F7150639d9e274233b302bfe48543643b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}