{
  "articles": [
    {
      "author": "WILL WEISSERT",
      "description": "LIVE OAK, Fla. (AP) — President Joe Biden on Saturday saw from the sky Hurricane Idalia's impact across a swath of Florida before he set out on a walking tour of a city recovering from the storm.",
      "publishedAt": "2023-09-02T04:03:22Z",
      "title": "Biden tells Idalia's Florida victims 'your nation has your back.' DeSantis rejects meeting with him",
      "url": "https://apnews.com/3ff2f44e6a314dfaf1e329fa10ac1b5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73786c8ad0794ad2a6d54fbe1e635c93/1920.jpeg"
    },
    {
      "author": "CLAUDIA LAUER",
      "description": "Body camera video of the fatal police shooting of Ta'Kiya Young, a 21-year-old pregnant mother in a suburb of Columbus, Ohio, has raised questions about how an allegation of shoplifting led to a bullet being fired through her windshield.",
      "publishedAt": "2023-09-03T04:04:24Z",
      "title": "Fatal police shooting of pregnant Ohio woman raises concerns over firing at moving vehicles",
      "url": "https://apnews.com/8bb256e64494834a84bee8bac3321d97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ffaadc2589b4c0d9533cd7833d45ad6/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "A Florida redistricting plan pushed by Republican Gov. Ron DeSantis violates the state constitution and is prohibited from being used for any future U.S.",
      "publishedAt": "2023-09-02T22:09:35Z",
      "title": "DeSantis' redistricting map in Florida is unconstitutional and must be redrawn, judge says",
      "url": "https://apnews.com/d04d4d69a5c52e2997e94fa842f8757e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed1bc2ab03db495e9f226ced4589ec87/3000.jpeg"
    },
    {
      "author": null,
      "description": "RENO, Nev. (AP) — Thousands of Burning Man attendees trudged in sloppy mud on Saturday — many barefoot or wearing plastic bags on their feet — as flooding from storms swept through the Nevada desert, forcing organizers to close vehicular access to the counterculture festival.",
      "publishedAt": "2023-09-02T20:16:14Z",
      "title": "Thousands told to shelter in place at Burning Man fest in Nevada with access closed due to flooding",
      "url": "https://apnews.com/d6cd88ee009c6e1f6d2d92739ec1ca18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eeca78822834573a1795eb3b7c6dcde/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — Taiwan suspended flights, rail transport and ferry services along with classes, outdoor events, and officials urged workers to stay home as the island prepared for the arrival of Typhoon Haikui later Sunday.",
      "publishedAt": "2023-09-03T03:28:48Z",
      "title": "Taiwan suspends work, transport and classes as island braces for arrival of Typhoon Haikui",
      "url": "https://apnews.com/96100ee731a8175c37488e84812adcdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6ebd6e782b54ee69ac56a0f2543870f/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and SARUUL ENKHBOLD",
      "description": "ULAANBAATAR, Mongolia (AP) — With China's crackdown on religious minorities as a backdrop, Pope Francis joined Mongolian shamans, Buddhist monks and a Russian Orthodox priest Sunday to highlight the role that religions can play in forging world peace, as he presided over an interfaith meeting highlighting Mongolia's tradition of religious tolerance.",
      "publishedAt": "2023-09-03T03:42:09Z",
      "title": "Pope joins shamans, monks and evangelicals to highlight Mongolia's faith diversity, harmony",
      "url": "https://apnews.com/1d7cf3a3987b3565d00d0d8f5b43182c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78af66176b6d451894da7cf081edcc05/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "TIJUANA, Mexico (AP) — As the U.S. government built its latest stretch of border wall, Mexico made a statement of its own by laying remains of the Berlin Wall a few steps away. The 3-ton pockmarked, gray concrete slab sits between a bullring, a lighthouse and the border wall, which extends into the Pacific Ocean.",
      "publishedAt": "2023-09-03T04:05:44Z",
      "title": "Berlin Wall relic gets a 'second life' on US-Mexico border as Biden adds barriers",
      "url": "https://apnews.com/19e6e05608cca24d1c0b00f3ccc5686f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7951f98225f5482187118f996df9fa7f/3000.jpeg"
    },
    {
      "author": "TRISHA AHMED",
      "description": "GRANITE FALLS, Minn. (AP) — Golden prairies and winding rivers of a Minnesota state park also hold the secret burial sites of Dakota people who died as the United States failed to fulfill treaties with Native Americans more than a century ago.",
      "publishedAt": "2023-09-03T04:07:49Z",
      "title": "Tribe getting piece of Minnesota back more than a century after ancestors died there",
      "url": "https://apnews.com/b09c0dc8dd6289a1545684e04599f94f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32c2182ce54f4e1893c9581891b23dcd/3000.jpeg"
    },
    {
      "author": "ALMUDENA CALATRAVA",
      "description": "BUENOS AIRES, Argentina (AP) — If a baby was taken from their parents four decades ago during Argentina's military dictatorship, what would that person look like today?Argentine publicist Santiago Barros has been trying to answer that question using artificial intelligence to create images of what the children of parents who disappeared during the dictatorship might look like as adults.",
      "publishedAt": "2023-09-03T04:09:36Z",
      "title": "AI project imagines adult faces of children who disappeared during Argentina's military dictatorship",
      "url": "https://apnews.com/b847832cbaa940889d2448c0ff6d8a20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5bb92994a70463f82d1ddb9fe13132e/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russia said Saturday its forces destroyed three Ukrainian naval drones being used in an attempt to attack a key bridge linking Russia to the Moscow-annexed Crimean Peninsula, forcing its temporary closure for a third time in less than a year.",
      "publishedAt": "2023-09-02T08:24:16Z",
      "title": "Russia says it thwarted attacks on Crimea bridge. Shelling and strikes leave at least 3 dead",
      "url": "https://apnews.com/be0a8f3cb98c278aa4cbb14f8588cae4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2c839dd2872495ebd5f01996a89d23e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}