{
  "articles": [
    {
      "author": "FATIMA HUSSEIN, AMANDA SEITZ, COLLIN BINKLEY and JOSH BOAK",
      "description": "WASHINGTON (AP) — President-elect Donald Trump on Tuesday tapped billionaire professional wrestling mogul Linda McMahon to be secretary of the Education Department, tasked with overseeing an agency Trump has promised to dismantle.",
      "publishedAt": "2024-11-19T19:31:41Z",
      "title": "Trump picks Dr. Oz to run Medicare and Medicaid, Linda McMahon for Education, Lutnick for Commerce",
      "url": "https://apnews.com/79cdda378e2affb85722323160306b30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6519ccb63fca467e9106a2e4f8e3153a/3000.jpeg"
    },
    {
      "author": "HALLIE GOLDEN and CHRISTOPHER WEBER",
      "description": "SEATTLE (AP) — What was expected to be one of the strongest storms in the northwest U.S. in decades arrived Tuesday evening, knocking out power and downing trees across the region.The Weather Prediction Center issued excessive rainfall risks beginning Tuesday and lasting through Friday as the strongest atmospheric river — a large plume of moisture — that California and the Pacific Northwest has seen this season bears down on the region.",
      "publishedAt": "2024-11-19T05:22:56Z",
      "title": "'Bomb cyclone' brings high winds and soaking rain to Northern California and Pacific Northwest",
      "url": "https://apnews.com/d5006d946cda1fc1f4ecb8fe5b94ba59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d14c5636023f48a18dd19b410c5a8fff/2000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The 4-year-old document has a bland, bureaucratic title — “Basic Principles of State Policy on Nuclear Deterrence” — but its contents are chilling, especially with its newest revisions.Better known as Russia's nuclear doctrine, the revamped version that was signed Tuesday by President Vladimir Putin spells out the circumstances that allow him to use Moscow's atomic arsenal, the world's largest.",
      "publishedAt": "2024-11-19T17:04:10Z",
      "title": "The Kremlin has revised its nuclear policy. Does that make the use of atomic weapons more likely?",
      "url": "https://apnews.com/b5ee115aa2099fa247f630e16da861d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34d5c21edc984be1b426d8885a5f7afc/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukraine fired several American-supplied longer-range missiles into Russia, officials said Tuesday, marking the first time Kyiv used the weapons that way in 1,000 days of war.",
      "publishedAt": "2024-11-19T11:42:44Z",
      "title": "Ukraine fires several US-made longer-range missiles into Russia for the first time",
      "url": "https://apnews.com/06002c8c50bfb2fc622f446a8580bc0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/385b97aaee5a46f4970416c25fc301e6/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB, WAFAA SHURAFA and FATMA KHALED",
      "description": "BEIRUT (AP) — A United States envoy said an agreement to end the Israel-Hezbollah war is “within our grasp” after talks in Lebanon on Tuesday. However, there was no such optimism in the Gaza Strip, where the looting of nearly 100 aid trucks by armed men worsened an already severe food crisis.",
      "publishedAt": "2024-11-19T09:34:36Z",
      "title": "US envoy says Israel-Hezbollah truce is 'within our grasp' as Gaza food crisis worsens after looting",
      "url": "https://apnews.com/a76670f9373598edd964139280eba60c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d71d79a71ada4b1e98b078a285a1bac1/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY, JOHN HANNA and AMY BETH HANSON",
      "description": "HELENA, Mont. (AP) — Terry Thompson had an election to run for voters in Cascade County, Montana. Why then, she thought, was her office in Great Falls being sent mailed ballots completed by voters in places such as Wasilla, Alaska; Vancouver, Washington; and Tampa, Florida?",
      "publishedAt": "2024-11-19T20:44:04Z",
      "title": "Multiple election offices report receiving mailed ballots misdirected from other states",
      "url": "https://apnews.com/7c942c832398d55843fbc20898d85385",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/601379e4f1cb4aee99280980e155ce87/2337.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "SACRAMENTO, Calif. (AP) — Voters in California have rejected a ballot measure that would have raised the state minimum wage to $18 per hour by 2026, the highest in the country.",
      "publishedAt": "2024-11-20T01:09:36Z",
      "title": "California voters reject measure that would have raised minimum wage to nation-high $18 per hour",
      "url": "https://apnews.com/68e5320b2716d2a5844dc51b97a6e235",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6beb32b73f134c268c78b0b0d7ec45c6/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "SpaceX on Tuesday launched another Starship rocket, but passed up catching the booster with giant mechanical arms.",
      "publishedAt": "2024-11-19T22:19:22Z",
      "title": "SpaceX launches giant Starship rocket, but aborts attempt to catch booster with mechanical arms",
      "url": "https://apnews.com/48a2332f16db06941326ffcdcefbcab3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cc2825fe4a6416bba634097474bbbad/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "RIO DE JANEIRO (AP) — President Joe Biden made an urgent appeal to fellow world leaders Tuesday to surge money to developing nations to curb climate change as he wrapped up his final appearance at a major international summit.",
      "publishedAt": "2024-11-19T17:43:10Z",
      "title": "Biden appeals to world leaders to stay in the climate fight as Trump casts shadow",
      "url": "https://apnews.com/f4a3908e829242647bdce4f30186d2fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5aa90eaddf7649099b6700fb4733e594/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — Distant, ancient galaxies are giving scientists more hints that a mysterious force called dark energy may not be what they thought.",
      "publishedAt": "2024-11-20T01:01:13Z",
      "title": "The dark energy pushing our universe apart may not be what it seems, scientists say",
      "url": "https://apnews.com/7856ae96fab5cb42e6b4a6fd7c3555ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7799fbb7eb194b74a17d4d7f484fa936/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}