{
  "articles": [
    {
      "author": "FARNOUSH AMIRI, LISA MASCARO and ERIC TUCKER",
      "description": "WASHINGTON (AP) — House Republicans launched a formal impeachment hearing Thursday against President Joe Biden, promising to “provide accountability” as they probe the family finances and lucrative business dealings of his son Hunter and make their case to the public, colleagues and a skeptical Senate.",
      "publishedAt": "2023-09-28T04:02:58Z",
      "title": "House Republicans make their case for Biden impeachment inquiry at first hearing",
      "url": "https://apnews.com/51576c5fe4294be2605a14fa81075196",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/209d294f3a8940aa883942a73c2d8a51/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — A government shutdown appeared all but inevitable as House Speaker Kevin McCarthy dug in Thursday, vowing he will not take up Senate legislation designed to keep the federal government fully running despite House Republicans' struggle to unite around an alternative.",
      "publishedAt": "2023-09-28T17:35:33Z",
      "title": "McCarthy rejects Senate spending bill while scrambling for a House plan that averts a shutdown",
      "url": "https://apnews.com/54e186535af403826e2010fae23446fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9b67c7796644533a13486fac8c81d1b/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and JEFF AMY",
      "description": "ATLANTA (AP) — Former President Donald Trump will not seek to get his Georgia election interference case transferred to federal court, his attorneys said in a filing Thursday, three weeks after a judge rejected a similar attempt by the former president’s White House chief of staff.",
      "publishedAt": "2023-09-28T22:19:44Z",
      "title": "Trump won't try to move Georgia case to federal court after judge rejected similar bid by Meadows",
      "url": "https://apnews.com/0a16edb3451d1445545dbd3dafd42447",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b56f70f1f8f049989880d99690698a0d/3000.jpeg"
    },
    {
      "author": "JAKE BLEIBERG",
      "description": "DALLAS (AP) — An American soldier who sprinted into North Korea and was held there for two months before being returned to the U.S.",
      "publishedAt": "2023-09-28T23:53:55Z",
      "title": "What to know and what's next for Travis King, the American soldier who ran into North Korea",
      "url": "https://apnews.com/d9afac30fa93096af0fd4c1ffff76c3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ae60f69be7b41eea5f187830498d21b/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — Updated COVID-19 vaccines may be getting a little easier for adults to find but they’re still frustratingly scarce for young children.",
      "publishedAt": "2023-09-28T21:03:04Z",
      "title": "What to know as fall vaccinations against COVID, flu and RSV get underway",
      "url": "https://apnews.com/8ffa6bf0c2c0da1a8842db524aad5006",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d63bb6bd72794a7d8388305410de4916/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — An appeals court Thursday rejected Donald Trump’s bid to delay a civil trial in a lawsuit brought by New York’s attorney general, allowing the case to proceed days after a judge ruled the former president committed years of fraud and stripped him of some companies as punishment.",
      "publishedAt": "2023-09-28T19:19:00Z",
      "title": "Court rejects Donald Trump’s bid to delay trial in wake of fraud ruling that threatens his business",
      "url": "https://apnews.com/d8934da24e78ca0cedab7303efdf48bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1005f42036e54933a9b59501d9758d35/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, JONATHAN J. COOPER and WILL WEISSERT",
      "description": "TEMPE, Arizona (AP) — President Joe Biden issued one of his most dire warnings yet that Donald Trump and his allies are a menace to American democracy, declaring Thursday that the former president is more interested in personal power than upholding the nation's core values and suggesting even mainstream Republicans are complicit.",
      "publishedAt": "2023-09-28T04:05:20Z",
      "title": "Biden offers dire warnings about Trump, accuses mainstream GOP of 'deafening' silence",
      "url": "https://apnews.com/788d5203b3ac970dbf6b71ca74d6b386",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e45968aeea9b4beb8f192cb518d46f3a/1920.jpeg"
    },
    {
      "author": "ADAM BEAM",
      "description": "SACRAMENTO, Calif. (AP) — A new law in California will raise the minimum wage for fast food workers to $20 per hour next year, an acknowledgment from the state's Democratic leaders that most of the often overlooked workforce are the primary earners for their low-income households.",
      "publishedAt": "2023-09-28T17:39:46Z",
      "title": "New California law raises minimum wage for fast food workers to $20 per hour, among nation's highest",
      "url": "https://apnews.com/69c26b7f07f2647149c37677446cea30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a845a229eb2f4951af57a5ea7786617d/1920.jpeg"
    },
    {
      "author": "SYLVIA HUI",
      "description": "LONDON (AP) — Michael Gambon, the Irish-born actor knighted for his illustrious career on the stage and screen and who went on to gain admiration from a new generation of moviegoers with his portrayal of Hogwarts headmaster Albus Dumbledore in six of the eight “Harry Potter” films, has died.",
      "publishedAt": "2023-09-28T11:53:07Z",
      "title": "Michael Gambon, veteran actor who played Dumbledore in 'Harry Potter' films, dies at age 82",
      "url": "https://apnews.com/00aa748c527249a2b5cb906b5ca35965",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddd8b758ef27443c9795fc9bf92b0e09/1920.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — There are rock stars, and then there is Ringo Starr — drummer for the Beatles, award-winning soloist, photographer, narrator, actor, activist.",
      "publishedAt": "2023-09-28T13:37:08Z",
      "title": "Ringo Starr on ‘Rewind Forward,’ writing country music, the AI-assisted final Beatles track and more",
      "url": "https://apnews.com/6fc5236cb2a316775fe0723712fc3e41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3689f85e6184c7694e89de857d9a9d4/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}