{
  "articles": [
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — After one of the most chaotic and least productive sessions in modern history, voters made a surprising choice in elections for the U.S.",
      "publishedAt": "2024-11-16T05:02:37Z",
      "title": "House elections produced a stalemate. Can Republicans figure out how to work with a thin majority?",
      "url": "https://apnews.com/5103c8b5c0ef03a1e61a1c0f9ca3dd4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0757b7a3df044a42af45977a6266807f/3000.jpeg"
    },
    {
      "author": "VANESSA GERA",
      "description": "WARSAW, Poland (AP) — Conservative lawmakers in the Polish parliament exulted at Donald Trump's victory, standing and applauding while they chanted his name.The prospect of a second Trump term has excited people on the populist right across Central Europe who share his anti-immigrant views and contempt for international organizations.",
      "publishedAt": "2024-11-16T10:14:08Z",
      "title": "Some exult, others worry: Reactions to Trump's victory are mixed on NATO's eastern flank",
      "url": "https://apnews.com/b39772e4ca42d84878dbf717b830e11b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d438cbdaf8f4fec829875a79514c82c/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS, HANNA ARHIROVA and LORI HINNANT",
      "description": "KYIV, Ukraine (AP) — At a secretive factory in Russia's central grasslands, engineers are manufacturing hundreds of decoy drones meant to overwhelm Ukrainian defenses as they try to protect against a horrific new weapon, an Associated Press investigation has found.",
      "publishedAt": "2024-11-16T05:06:21Z",
      "title": "Operation False Target: How Russia plotted to mix a deadly new weapon among decoy drones in Ukraine",
      "url": "https://apnews.com/2f904b04fcc5de17549415a974f5a92b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76742f121c4d4081a87b504b1a48afc7/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "LIMA, Peru (AP) — President Joe Biden is expected to use his final meeting with China's leader, Xi Jinping, to urge him to dissuade North Korea from further deepening its support for Russia's war on Ukraine.",
      "publishedAt": "2024-11-16T05:01:52Z",
      "title": "In final talks, Biden to press China's Xi on North Korea's ties with Russia",
      "url": "https://apnews.com/88725252ce926384aaf36004b9f863b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95dca7b2af02468684f23fd59b8ec325/3000.jpeg"
    },
    {
      "author": "MELINA WALLING, SIBI ARASU and SETH BORENSTEIN",
      "description": "BAKU, Azerbaijan (AP) — The United Nations climate talks neared the end of their first week on Saturday with negotiators still at work on how much wealthier nations will pay for developing countries to adapt to planetary warming.",
      "publishedAt": "2024-11-16T06:47:46Z",
      "title": "Protesters' biggest day expected at UN climate talks, where progress is slow",
      "url": "https://apnews.com/11b80aa8b934cc4ccb82aea0b8660e4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af7ebae2cc6e4a8c8cd81780c8885688/3000.jpeg"
    },
    {
      "author": "BISWAJEET BANERJEE",
      "description": "LUCKNOW, India (AP) — A fire tore through a neonatal intensive care unit in a hospital in northern India, killing 10 newborn babies and injuring 16 others, authorities said.The fire occurred late Friday at a hospital in Jhansi city in India's Uttar Pradesh state.",
      "publishedAt": "2024-11-16T04:13:50Z",
      "title": "Fire engulfs hospital ward in northern India, killing 10 newborn babies",
      "url": "https://apnews.com/c2236ba37d12e4f5353df5ebb68171e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e164bddb88454fc481800f3d5f67da53/2016.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — Over the past two weeks, the political landscape around the negotiations for a cease-fire in Gaza have undergone a dramatic transformation.",
      "publishedAt": "2024-11-16T05:45:40Z",
      "title": "The family of Israeli-American hostage pleads with Biden and Trump to bring hostages home",
      "url": "https://apnews.com/7e3cd6a6f0b9cd70cced92225a31e66c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/261f2360482441f08c39757ea7a927a1/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG and RYAN J. FOLEY",
      "description": "MINNEAPOLIS (AP) — On the last night of their lives, Jagdish Patel, his wife and their two young children tried to slip into the U.S. across a near-empty stretch of the Canadian border. Wind chills reached minus 36 Fahrenheit (minus 38 Celsius) that night in January 2022 as the family from India set out on foot to meet a waiting van.",
      "publishedAt": "2024-11-16T05:05:15Z",
      "title": "An Indian family froze to death crossing the Canada-US border, a perilous trip becoming more common",
      "url": "https://apnews.com/16946bb01a1d1ca2978f29e902e550fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d8cbba426a64e06b213a545e7b8861e/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Three daughters of Malcolm X have accused the CIA, FBI, the New York Police Department and others in a $100 million lawsuit Friday of playing roles in the 1965 assassination of the civil rights leader.",
      "publishedAt": "2024-11-15T17:56:45Z",
      "title": "The daughters of Malcolm X sue the CIA, FBI and NYPD over the civil rights leader's assassination",
      "url": "https://apnews.com/682c71e26cbeaf293d0ea783999c0c5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc7d3922d42747caa858aa11bcae7b43/2000.jpeg"
    },
    {
      "author": "SCHUYLER DIXON",
      "description": "ARLINGTON, Texas (AP) — The boos from a crowd wanting more action were growing again when Jake Paul dropped his gloves before the final bell, and bowed toward 58-year-old Mike Tyson.Paying homage to one of the biggest names in boxing history didn't do much for the fans that filled the home of the NFL's Dallas Cowboys on Friday night.",
      "publishedAt": "2024-11-15T16:50:08Z",
      "title": "Jake Paul beats 58-year-old Mike Tyson as the hits don't match the hype",
      "url": "https://apnews.com/0e1597caaae41254df029eb9fe62cc39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8dc040d84b3f41a3a6949fb1692f2a80/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}