{
  "articles": [
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump’s civil fraud trial will roll ahead next week after the former president lost a bid Friday to halt the proceedings while he fights a pretrial ruling that could strip him of Trump Tower and other marquee properties.",
      "publishedAt": "2023-10-06T16:13:24Z",
      "title": "Trump's New York civil fraud trial rolls on after an appeals judge declines to halt it",
      "url": "https://apnews.com/77f3691ad7fa73ea008f058ae6f772d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af5cdfd3abb84c25892d6e5ef84ee255/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — An unforeseen burst of hiring last month has lifted hopes that the economy will prove durable once again, even as an array of threats lie ahead. Businesses across the U.S. economy ramped up their hiring in September, defying surging interest rates, financial market turmoil, the ongoing threat of a government shutdown and an uncertain outlook to add the most jobs in any month since January.",
      "publishedAt": "2023-10-06T04:01:23Z",
      "title": "A surge of hiring in September defies predictions, pointing to US job market's enduring resilience",
      "url": "https://apnews.com/8950494bcfcc717f7e6c18bc19ecaf6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07223722dc5f4ee180bc61cf3c2181bf/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL, JOHN LEICESTER and ELENA BECATOROS",
      "description": "Imprisoned Iranian activist Narges Mohammadi won the Nobel Peace Prize on Friday in recognition of her tireless campaigning for women’s rights and democracy, and against the death penalty.",
      "publishedAt": "2023-10-06T07:49:50Z",
      "title": "Jailed Iranian activist Narges Mohammadi wins the Nobel Peace Prize for fighting women's oppression",
      "url": "https://apnews.com/776ca1bcf0fde827ad90af8a069907eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c172acddc54d48d09aa888538e42dacc/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KHARKIV, Ukraine (AP) — A Russian missile attack killed a 10-year-old boy and his grandmother Friday in the northeastern Ukrainian city of Kharkiv, officials said. Elsewhere in the region, villagers prepared to bury their dead after a strike the previous day killed at least 52 civilians in one of the deadliest attacks in the war in months.",
      "publishedAt": "2023-10-06T08:41:47Z",
      "title": "A Russian missile attack in eastern Ukraine kills a 10-year-old boy and his grandmother",
      "url": "https://apnews.com/b38fd758600a6ef0101516ec6cd6be24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbd1c4aa746146b7acbf5283e3b783ad/2000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — Attorneys who've been defending MyPillow chief executive and election denier Mike Lindell against defamation lawsuits by voting machine companies are seeking court permission to quit, saying he owes them unspecified millions of dollars and can't pay the millions more that he'll owe in legal expenses going forward.",
      "publishedAt": "2023-10-06T18:27:56Z",
      "title": "Election denier and 'MyPillow Guy' Mike Lindell confirms he's out of money, can't pay legal bills",
      "url": "https://apnews.com/047932c7207734c080b07dca8d8868a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e918c4bef2b45728251ee22df7b2cff/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN and COLLEEN SLEVIN",
      "description": "BOULDER, Colo. (AP) — A judge ruled Friday that the man accused of killing 10 people at a Colorado supermarket in a 2021 rampage is mentally competent to stand trial, allowing the stalled prosecution to move forward.",
      "publishedAt": "2023-10-06T23:32:52Z",
      "title": "Man accused of killing 10 at Colorado supermarket in 2021 is ruled mentally competent to stand trial",
      "url": "https://apnews.com/60ec1e2eea0b34a1f649664c6b80a7bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0a1febe5d4f410997c6dd755dab8450/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN",
      "description": "CAÑON CITY, Colo. (AP) — The awful smell seeped from a neglected building in a small Colorado town for days, followed by a report that made police take a closer look at the “green” funeral operator’s storage facility.",
      "publishedAt": "2023-10-06T04:11:26Z",
      "title": "Police found 115 bodies at Colorado 'green' funeral home while investigating putrid smells",
      "url": "https://apnews.com/4c77ec13d8dfb1394e61da8881426deb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8dd2ce5a6e08413dadc495fd87407084/1920.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — At least 16 migrants from Venezuela and Haiti died early Friday in a bus crash in southern Mexico, authorities said.Mexico's National Immigration Institute originally reported 18 dead, but later lowered that figure.",
      "publishedAt": "2023-10-06T16:46:26Z",
      "title": "At least 16 migrants killed, 29 injured in a bus crash in southern Mexico",
      "url": "https://apnews.com/ec24efef78ae7aa1caed3a1b4b53829e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adeab65abce747e6919839bf7fca258d/2976.jpeg"
    },
    {
      "author": "RIO YAMAT and JOHN ANTCZAK",
      "description": "LAS VEGAS (AP) — The man charged with murder in the 1996 killing of Tupac Shakur knew the gravity of his arrest last week near his home on the outskirts of Las Vegas, according to police body camera footage released Friday.",
      "publishedAt": "2023-10-06T16:38:30Z",
      "title": "Las Vegas police video shows first-ever arrest in rapper Tupac Shakur's 1996 killing",
      "url": "https://apnews.com/6e60e79dead009fa0c78f364c9353449",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2993fcd0bb64c49b32eda93e1cf62a5/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "Eager as the National Football League has been to cater to the recent public fixation with Taylor Swift and Travis Kelce, it’s certainly not taking any credit for creating the outsized storyline that has emerged around the pop superstar and the Kansas City Chiefs tight end.",
      "publishedAt": "2023-10-06T11:35:51Z",
      "title": "Why the NFL cares about Taylor Swift and Travis Kelce",
      "url": "https://apnews.com/be42bde423a35c8f4c34bd9a18327b07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f380feae1a5141e79de606082326c082/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}