{
  "articles": [
    {
      "author": "The Associated Ptess",
      "description": "After three weeks of fighting, Russia is still struggling to dislodge Ukrainian forces from the Kursk region, a surprisingly slow and low-key response to the first occupation of its territory since World War II.",
      "publishedAt": "2024-08-29T04:36:28Z",
      "title": "Why Russia has struggled to halt Ukraine's incursion in the Kursk region",
      "url": "https://apnews.com/ca6d18d06606794580bdc779d2c98134",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f50d84e9ef64450da2daeb6aea1b95de/3000.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — The Israeli military says it has killed five more militants in a large-scale operation in the occupied West Bank, including a well-known local commander.There was no immediate Palestinian confirmation of the death of Mohammed Jaber, known as Abu Shujaa, a commander in the Islamic Jihad militant group in the Nur Shams refugee camp.",
      "publishedAt": "2024-08-29T05:56:13Z",
      "title": "Israeli army says it has killed 5 more West Bank militants, including a well-known local commander",
      "url": "https://apnews.com/ee53e1dbf7ece94151088308510e8679",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b91b0b6a427747d0b5857d32a1fa1099/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "SAVANNAH, Ga. (AP) — Vice President Kamala Harris and her running mate, Minnesota Gov.",
      "publishedAt": "2024-08-29T04:18:21Z",
      "title": "Harris, Walz will sit down for first major television interview of their presidential campaign",
      "url": "https://apnews.com/94eff1aa1247e471b48948d03faf0edf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97a39c63dc0d41a69dd4dbde2146f78c/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI and THOMAS BEAUMONT",
      "description": "LANSING, Mich. (AP) — Donald Trump is scheduled to campaign Thursday in Michigan and Wisconsin as the former president ramps up battleground state travel heading into the traditional Labor Day turn toward the fall election.",
      "publishedAt": "2024-08-29T04:11:58Z",
      "title": "Trump to visit swing districts in Michigan and Wisconsin as battleground campaigning increases",
      "url": "https://apnews.com/0583faabae5e36000baa18c7b2bea752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4cce1679438e4f8d999538919190d469/2692.jpeg"
    },
    {
      "author": "TARA COPP, ADRIANA GOMEZ LICON and HANNAH SCHOENBAUM",
      "description": "WASHINGTON (AP) — Donald Trump's campaign was warned about not taking photographs before an altercation at Arlington National Cemetery during a wreath-laying ceremony earlier this week to honor service members killed in the Afghanistan War withdrawal, a defense official told The Associated Press on Wednesday.",
      "publishedAt": "2024-08-28T20:29:46Z",
      "title": "Trump campaign was warned not to take photos at Arlington before altercation, defense official says",
      "url": "https://apnews.com/3f0331e9209336a9b696ec164be7eb1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/663bb0db89764b1ebaf643d498ee1bb5/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — A typhoon lashed southern Japan with torrential rain and strong winds Thursday, causing at least three deaths as it started a crawl up the length of the archipelago and raised concerns of flooding, landslides and extensive damage.",
      "publishedAt": "2024-08-29T00:47:56Z",
      "title": "Typhoon lashes Japan with torrential rain and strong winds on a slow crawl north",
      "url": "https://apnews.com/5805bc825ea55e3f3736f1ae3283f154",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7ebf327f3db48c4b2fbc68896b54128/3000.jpeg"
    },
    {
      "author": "DAVID BILLER",
      "description": "RIO DE JANEIRO (AP) — A Brazilian Supreme Court justice on Wednesday threatened to shut down the local operations of X, formerly Twitter, unless its billionaire owner Elon Musk names a legal representative in Brazil within 24 hours.",
      "publishedAt": "2024-08-29T01:11:55Z",
      "title": "Brazil top court threatens to suspend X operations in latest twist of ongoing feud",
      "url": "https://apnews.com/028f7a9f65e3bf355518bbe9d1fbe564",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6db22f0d96d64deabf15b4712dc984a9/3000.jpeg"
    },
    {
      "author": "BARBARA SURK and ANGELA CHARLTON",
      "description": "PARIS (AP) — French authorities handed preliminary charges to Telegram CEO Pavel Durov on Wednesday for allowing alleged criminal activity on his messaging app and barred him from leaving France pending further investigation.",
      "publishedAt": "2024-08-28T09:29:38Z",
      "title": "Telegram CEO Durov faces preliminary charges in France of allowing crime on messaging app",
      "url": "https://apnews.com/6e213d227458f330ed16e7fe221a696c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae57eb30bd344badaa99bef9baeb1587/1920.jpeg"
    },
    {
      "author": "KEN RITTER",
      "description": "LAS VEGAS (AP) — A Democratic former politician was found guilty of murder on Wednesday by a Nevada jury that decided he'll serve 20 years to life in prison for killing an investigative journalist who wrote articles critical of his conduct in office two years ago.",
      "publishedAt": "2024-08-28T16:12:33Z",
      "title": "Ex-politician convicted in 2022 killing of Vegas reporter, jury sets sentence at 20 years to life",
      "url": "https://apnews.com/393c5588c1babe5b111ca905363f6a45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10f62d783d0349aca401f170f15d5e52/1920.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "PORTO, Portugal (AP) — Porto takes pride in its beaches, old churches covered in blue-and-white tiles and its famous port wine named after the city in northern Portugal.It’s also home to a different kind of church — located on its beachfront suburbs along the Atlantic coast near a fishing town known for some of the world’s largest waves.",
      "publishedAt": "2024-08-29T04:19:06Z",
      "title": "Surf before you worship at this church in Portugal. Their motto: “We love waves, we love Jesus.”",
      "url": "https://apnews.com/430638bf18320dc0068253c9973c42f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b766ac14a39469a95bea6d8aa8fabb3/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}