{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — The latest round of Gaza cease-fire talks ended in Cairo after “in-depth and serious discussions,” the Hamas militant group said Sunday, reiterating key demands that Israel again rejected.",
      "publishedAt": "2024-05-05T12:19:20Z",
      "title": "Hamas says latest cease-fire talks have ended. Israel vows military operation in 'very near future'",
      "url": "https://apnews.com/5fb0455b81674b2bfe38d997c95d6f00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfe437cbca5b4edab33331a05a18025c/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and JON GAMBRELL",
      "description": "TEL AVIV, Israel (AP) — Israel ordered the local offices of Qatar's Al Jazeera satellite news network to close Sunday, escalating a long-running feud between the broadcaster and Prime Minister Benjamin Netanyahu's hard-line government as Doha-mediated cease-fire negotiations with Hamas hang in the balance.",
      "publishedAt": "2024-05-05T10:22:43Z",
      "title": "Israel orders Al Jazeera to close its local operation and seizes some of its equipment",
      "url": "https://apnews.com/eba9416aea82f505ab908ee60d1de5e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99b5de0f23584ffd8cbb4ebb664d55ac/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO and DENISE LAVOIE",
      "description": "Students protesting the ongoing war in Gaza left a pro-Palestinian encampment at the University of Southern California early Sunday after they were surrounded by police and told they could face arrest if they didn’t go.",
      "publishedAt": "2024-05-05T11:45:27Z",
      "title": "Pro-Palestinian protesters at USC comply with school order to leave their encampment",
      "url": "https://apnews.com/3afafc2d56c6dc87635549475d94e1d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc83ed3d636d40418b19ff667cdfdce2/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.So this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.",
      "publishedAt": "2024-05-05T04:45:49Z",
      "title": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7",
      "url": "https://apnews.com/492eab9a3b95de64602ccdec863f1b37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5023657347ff4ad2b8f53c526afac3ae/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES",
      "description": "RIO DE JANEIRO (AP) — Massive floods in Brazil’s southern Rio Grande do Sul state killed at least 60 people and another 101 were reported missing, according to Sunday's toll from local authorities.",
      "publishedAt": "2024-05-05T15:27:50Z",
      "title": "Floods in southern Brazil kill at least 60, with 101 people missing",
      "url": "https://apnews.com/f62a0ace01aad5832a928ec4a918b579",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/179f2d8acbc3499eab9dd160913f906b/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and LEKAN OYEKANMI",
      "description": "HOUSTON (AP) — More storms were moving through the already saturated Houston area on Sunday, where flooding from heavy rains has led to the rescue of hundreds of people from homes, rooftops and roads.",
      "publishedAt": "2024-05-05T04:20:07Z",
      "title": "More storms move through Houston area, where hundreds have been rescued from floodwaters",
      "url": "https://apnews.com/793f0bcb98c9ec87da0727517e7f1787",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcad2a4d52ba49aeb490750da3fa536e/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — A driver died after a vehicle crashed into an outer perimeter gate of the White House complex, and the incident late Saturday was being investigated as a traffic crash, police said.",
      "publishedAt": "2024-05-05T06:35:20Z",
      "title": "A driver dies after crashing into a security barrier around the White House complex, authorities say",
      "url": "https://apnews.com/522a6902b06375e8202ddf0dac9f1d77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7634f2e48e4e43b0a86be23b7b472259/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — As Ukraine marked its third Easter at war, Russia on Sunday launched a barrage of drones concentrated in Ukraine’s east, wounding more than a dozen people, and claimed its troops took control of a village they had been targeting.",
      "publishedAt": "2024-05-05T09:07:12Z",
      "title": "Ukraine marks its third Easter at war as it comes under fire from Russian drones and troops",
      "url": "https://apnews.com/1702fb361c6e72fcf9d93f46ac89625e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0c88b5dcb9947ffa51d6f73ab5299a9/1920.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "Just a few months short of a quarter-century as Russia's leader, Vladimir Putin on Tuesday will put his hand on a copy of the constitution and begin another six-year term as president wielding extraordinary power.",
      "publishedAt": "2024-05-05T04:52:29Z",
      "title": "As Putin begins another 6-year term, he is entering a new era of extraordinary power in Russia",
      "url": "https://apnews.com/cdb0f25dd8a5f2b53b9ea8d106d4b035",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5b9ac1c4d374ab98d2ffec85c5771e7/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "ALBUQUERQUE, N.M. (AP) — It was a frigid winter morning when authorities found a Native American man dead on a remote gravel road in western New Mexico.",
      "publishedAt": "2024-05-05T04:37:24Z",
      "title": "As US spotlights those missing or dead in Native communities, prosecutors work to solve their cases",
      "url": "https://apnews.com/fb7f8145149850aa5ae14c44c9692667",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/203d4b5e94004a79be0eb2ca1f3d6785/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}