{
  "articles": [
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump is seeking to delay his March 25 hush money trial until the Supreme Court rules on the presidential immunity claims he raised in another of his criminal cases.",
      "publishedAt": "2024-03-11T18:03:18Z",
      "title": "Donald Trump wants New York hush money trial delayed until Supreme Court rules on immunity claims",
      "url": "https://apnews.com/7a5030cd4f7b6364cd1a8a599cea025d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c265ec5459e4619b0c4bfe594d3990b/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Palestinians began fasting for the Muslim holy month of Ramadan on Monday with cease-fire talks at a standstill, hunger worsening across the Gaza Strip and no end in sight to the 5-month-old war between Israel and Hamas.",
      "publishedAt": "2024-03-11T08:20:29Z",
      "title": "Ramadan in Gaza begins with hunger worsening and no end to war in sight",
      "url": "https://apnews.com/c6835d50f91dff0443e0f7fdf5e3229f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a6a1d0465f348f48458537e353e2452/1920.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "ORLANDO, Fla. (AP) — Students and teachers can discuss sexual orientation and gender identity in Florida classrooms, provided it’s not part of instruction, under a settlement reached Monday between Florida education officials and civil rights attorneys who had challenged a state law which critics dubbed “Don't Say Gay.”",
      "publishedAt": "2024-03-11T20:46:58Z",
      "title": "Florida teachers can discuss sexual orientation and gender ID under 'Don't Say Gay' bill settlement",
      "url": "https://apnews.com/987904b3e19122d719cf468034746b6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b798489b15da468fb959db1c01b79d89/3000.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI",
      "description": "NASHVILLE, Tenn. (AP) — In Republican-led states across the U.S., conservative legislators are refusing to reevaluate abortion bans — even as doctors and patients insist the laws’ exceptions are dangerously unclear, resulting in denied treatment to some pregnant women in need.",
      "publishedAt": "2024-03-11T04:11:07Z",
      "title": "Asked to clear up abortion bans, GOP leaders blame doctors and misinformation for the confusion",
      "url": "https://apnews.com/7cefca4a248076268c789ea05b367f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6431212ef4a6439a932eebb74d1a0f59/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and FATIMA HUSSEIN",
      "description": "MANCHESTER, N.H. (AP) — President Joe Biden on Monday released a budget proposal aimed at getting voters' attention: It would offer tax breaks for families, lower health care costs, smaller deficits and higher taxes on the wealthy and corporations.",
      "publishedAt": "2024-03-11T09:03:18Z",
      "title": "Biden's budget proposal for a second term offers tax breaks for families and lower health care costs",
      "url": "https://apnews.com/9ac66a99e741dab656c15116408060a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df87d2e5e9184fe79c050984e07d0325/1920.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Kate, Princess of Wales, apologized Monday for “confusion” caused by her altering of a family photo released by the palace — an image of Kate and her children that was intended to calm concern and speculation about the British royal's health, but had the opposite effect.",
      "publishedAt": "2024-03-11T10:54:27Z",
      "title": "Kate, Princess of Wales, apologizes for altering family photo that fueled rumors about her health",
      "url": "https://apnews.com/482fda64281b4a63ccf30364d96b2622",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d87a007b40c43e3ad12673582169d21/3000.jpeg"
    },
    {
      "author": null,
      "description": "KINGSTON, Jamaica (AP) — U.S. Secretary of State Antony Blinken huddled with Caribbean leaders in Jamaica behind closed doors on Monday to urgently help find a way to ease Haiti's growing violent crisis as embattled Prime Minister Ariel Henry faces calls to resign or agree to a transitional council.",
      "publishedAt": "2024-03-11T13:12:24Z",
      "title": "Blinken and Caribbean leaders meet in Jamaica to debate how best to quell Haiti's violent crisis",
      "url": "https://apnews.com/ff6b76b6ba9a9d7b8f95fbf95a1d462c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/585dc1c9200440e88e7e769fe2da4c69/3000.jpeg"
    },
    {
      "author": "TIFFANY STANLEY",
      "description": "On Wednesdays, the support group meets over Zoom. The members talk about their lives, their religious families and their old parochial schools. But mostly, they are there to talk about the sexual abuse they suffered at the hands of Catholic nuns.",
      "publishedAt": "2024-03-11T12:10:01Z",
      "title": "Victims of Catholic nuns rely on each other after being overlooked in the clergy sex abuse crisis",
      "url": "https://apnews.com/a80c46e2f4f4c8e3d1ce30d22628e963",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6dde1847bc04c88b3d3ed51f7e9ae2f/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "LOS ANGELES (AP) — The Academy Awards were full of sure-things, long-awaited anointments and easy predictions. The “Oppenheimer” romp.",
      "publishedAt": "2024-03-11T19:07:33Z",
      "title": "Emma Stone won, but Lily Gladstone didn't lose",
      "url": "https://apnews.com/f78bf50fe545ce2bce3269253c4f36eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f38d230f213645589245796c780be900/3000.jpeg"
    },
    {
      "author": "DAVE CAMPBELL",
      "description": "Kirk Cousins is leaving Minnesota for Atlanta, landing another big contract with a well-timed foray into free agency.",
      "publishedAt": "2024-03-11T18:46:00Z",
      "title": "Cousins leaves Vikings for big new contract with Falcons in QB's latest well-timed trip to market",
      "url": "https://apnews.com/be48f1d3287f851e58cee83e17da154e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91027149ff9c480cb89f1e0d5ba68fb7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}