{
  "articles": [
    {
      "author": null,
      "description": "SAN FRANCISCO (AP) — OpenAI reinstates CEO Sam Altman to its board, says it has \"full confidence\" in him after internal investigation.",
      "publishedAt": "2024-03-08T22:44:53Z",
      "title": "OpenAI reinstates CEO Sam Altman to its board, says it has \"full confidence\" in him after internal investigation",
      "url": "https://apnews.com/b3b1408dc89ed1467682ba36a6d73e57",
      "urlToImage": ""
    },
    {
      "author": "MOHAMED JAHJOUH, JACK JEFFERY and LEE KEATH",
      "description": "RAFAH, Gaza Strip (AP) — It’s not just Israeli bombs that have killed children in war-ravaged Gaza — now some are dying of hunger. Officials have been warning for months that Israel’s siege and offensive were pushing the Palestinian territory into famine.",
      "publishedAt": "2024-03-08T05:04:53Z",
      "title": "It's not just Israeli bombs that have killed children in Gaza. Now some are dying of hunger too",
      "url": "https://apnews.com/2f938b1a82d7822c7da67cc162da1a37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80daf8fa9f0d4f5894044b05ff955dad/3000.jpeg"
    },
    {
      "author": "MENELAOS HADJICOSTIS",
      "description": "LARNACA, Cyprus (AP) — A ship bearing humanitarian aid was making preparations to leave Cyprus and head for Gaza, the European Commission president said Friday as international donors launched a sea corridor to supply the besieged territory that is facing widespread hunger after five months of war.",
      "publishedAt": "2024-03-08T08:01:57Z",
      "title": "A ship with Gaza aid is preparing to inaugurate a sea route from Cyprus to the war-ravaged strip",
      "url": "https://apnews.com/196b1e1bdef8ce28449799759c797d39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7614b35c394040cf9ae2be527abf826d/2000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MICHELLE L. PRICE",
      "description": "HOUSTON (AP) — The Republican National Committee voted Friday to install Donald Trump’s handpicked leadership team, completing his takeover of the national party as the former president closes in on a third straight presidential nomination.",
      "publishedAt": "2024-03-08T05:12:28Z",
      "title": "RNC votes to install Donald Trump's handpicked chair as former president tightens control of party",
      "url": "https://apnews.com/53402f8e8ac845db3cf4ab82c882ea74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9ea710e5e7647eeaeca0113e0416508/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Donald Trump has secured a $91.6 million bond sufficient to cover the money he owes to writer E. Jean Carroll in a defamation lawsuit while he appeals the jury's verdict, the former president’s lawyer told a court on Friday.",
      "publishedAt": "2024-03-08T16:25:29Z",
      "title": "Trump attorneys post $92 million bond to support jury award to E. Jean Carroll in defamation suit",
      "url": "https://apnews.com/298114f9b8c402643ec4747671fc75de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a67912b59f94202aa1f2a029e0fff28/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden is going all-in on calling out “shrinkflation.”The term applies to a seemingly covert way for companies to raise prices by ever so slightly reducing the size of their products.",
      "publishedAt": "2024-03-08T17:32:58Z",
      "title": "Biden calls out 'shrinkflation' as part of a broader strategy to reframe how voters view the economy",
      "url": "https://apnews.com/7bb0d90a7736431fa44505643009b05d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39402b46337e4d0fbc53ff436222ffaf/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden 's growing frustration with Israeli Prime Minister Benjamin Netanyahu continues to mount, with the Democrat captured on a hot mic saying that he and the Israeli leader will need to have a “come to Jesus meeting.”",
      "publishedAt": "2024-03-08T16:45:31Z",
      "title": "Biden in a hot mic moment shows his growing frustration with Netanyahu over Gaza humanitarian crisis",
      "url": "https://apnews.com/885b97a75d15d15ae7f7a47d0125c918",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13df97195d1646828cc418518587f201/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Former Honduran President Juan Orlando Hernandez was convicted Friday in New York of charges that he conspired with drug traffickers and used his military and national police force to enable tons of cocaine to make it unhindered into the United States.",
      "publishedAt": "2024-03-08T18:37:45Z",
      "title": "Former president of Honduras convicted in US of aiding drug traffickers",
      "url": "https://apnews.com/7c43423f12ff71859c370be2fc6ac5b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd1fbaae0eb24eebbb1f1778fc6b2ec3/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The first “NYPD: Most Wanted” video was meant to be intimidating.Over a pounding soundtrack, the montage cuts among stock images and body-camera footage of actual police raids.",
      "publishedAt": "2024-03-08T16:15:47Z",
      "title": "The NYPD is using social media to target critics. That brings its own set of worries",
      "url": "https://apnews.com/1f80e5d3a1b8cac029dbb217c05cb8a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47a53537f23e4e48845b7f2bc7e48db0/2778.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Across much of America and especially in the normally chilly north, the country went through the winter months without, well, winter.In parka strongholds Burlington, Vermont, and Portland, Maine, the thermometer never plunged below zero.",
      "publishedAt": "2024-03-08T18:46:10Z",
      "title": "Much of America asks: Where did winter go? Spring starts early as US winter was warmest on record",
      "url": "https://apnews.com/e5e45c1d5eb9f168030e0fe90ac36ac8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34bfa825376e4cd19327f45e37c2fa73/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}