{
  "articles": [
    {
      "author": "Jamey Keaten, David Mchugh",
      "description": "U.S. and Chinese officials say they have reached a deal to roll back most of their recent tariffs and call a 90 day pause so they can keep talking to resolve their trade disputes. U.S. Trade Representative Jamieson Greer said Monday the U.S. has agreed to drop its 145% tariff rate on Chinese goods by 115 percentage points to 30%, while China has agreed to lower its rate on U.S. goods by the same amount to 10%. Greer and Treasury Secretary Scott Bessent announced the tariff reductions at a news conference in Geneva. They say the two sides have set up consultations to continue discussing their trade issues. The announcement by the U.S. and China sent shares surging.",
      "publishedAt": "2025-05-12T08:10:50Z",
      "title": "US and China reach deal to roll back most tariffs for 90 days",
      "url": "https://apnews.com/article/china-us-switzerland-tariffs-negotiations-b3f5174d086e39b2522ab848ddad9372",
      "urlToImage": "https://dims.apnews.com/dims4/default/e92fc37/2147483647/strip/true/crop/6524x3670+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1c%2F8d%2F4d1ff242558da5101f83aea40341%2F91a6937c3792489ab181893c5f91e436"
    },
    {
      "author": "Jiang Junzhe, Elaine Kurtenbach",
      "description": "World shares and U.S. futures have surged after the U.S. and China announced they were suspending for 90 days most of the sharp tariff hikes each has imposed since U.S. President Donald Trump escalated his trade war. A joint statement said the U.S. would cut tariffs on Chinese goods to 30% from as high as 145%. China said its tariffs on U.S. goods would fall to 10% from 125%. U.S. futures gained more than 2% early Monday and shares in Asia and Europe also jumped. The agreement to talk followed two days of meetings in Geneva, Switzerland. On Friday, the S&P 500 slipped 0.1% and the Dow industrials fell 0.3%. The Nasdaq composite was little changed.",
      "publishedAt": "2025-05-12T03:58:45Z",
      "title": "World shares and US futures advance after China-US trade pact",
      "url": "https://apnews.com/article/stocks-markets-trade-trump-catl-62fbd84396aaea011c68231363b283de",
      "urlToImage": "https://dims.apnews.com/dims4/default/952c5a2/2147483647/strip/true/crop/4260x2396+0+222/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F14%2F9b1c1975bdfed1398d39ae13c0bf%2Fb87abd4f8618423aa05bb33607186420"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy, Tia Goldenberg",
      "description": "The Hamas militant group says it will release an American-Israeli hostage held in Gaza during the day. In a statement, Hamas did not immediately disclose further details about the release expected on Monday. Hamas had announced on Sunday that it would free Edan Alexander as a good will gesture for the Trump administration. Alexander, an Israeli soldier, was taken captive on Oct. 7, 2023. Israeli authorities earlier acknowledged Alexander's planned release, without saying when it would happen. It would be the first hostage release since Israel shattered an 8-week ceasefire with Hamas.",
      "publishedAt": "2025-05-12T07:36:30Z",
      "title": "Hamas says it will release American-Israeli hostage Edan Alexander on Monday",
      "url": "https://apnews.com/article/mideast-wars-gaza-hostages-05-12-2025-72ca1188e3df7677870fb518191c14df",
      "urlToImage": "https://dims.apnews.com/dims4/default/464f1a1/2147483647/strip/true/crop/6510x3662+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2F58%2Ffd77369edf973ca68eb5ad1efba8%2F41e2edda21d14e8abb1f75df74171a78"
    },
    {
      "author": "Julia Frankel, Melanie Lidman",
      "description": "Edan Alexander was 19 when Hamas militants stormed the Israeli military base where the American-Israeli from New Jersey was a soldier and dragged him into the Gaza Strip. Hamas released him on Monday. Alexander had been the last living American hostage in Gaza. His release came ahead of President Donald Trump’s visit to the region this week. The militant group called it a goodwill gesture aimed at reviving mediated efforts to end the 19-month war. Alexander was among 251 people taken hostage in Hamas’ Oct. 7, 2023, attack that ignited the war. Fifty-eight remain in Gaza. Around a third are believed to be alive.",
      "publishedAt": "2025-05-12T16:17:30Z",
      "title": "Who is Edan Alexander, the Israeli-American hostage released by Hamas?",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostage-alexander-trump-d412bcc6e75ada265b5c24bd2af3571b",
      "urlToImage": "https://dims.apnews.com/dims4/default/8e70f69/2147483647/strip/true/crop/1920x1080+0+100/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fc7%2F4b8c124176e8730e8e42f62956a4%2F882aa285f3344a39b057e9f93a5a2665"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A jury has begun hearing opening arguments in Sean “Diddy” Combs’ sex trafficking trial in New York. Prosecutors and the defense started summarizing their cases Monday shortly after the 12 regular jurors and six alternates were picked. Federal prosecutors will try to prove that Combs turned his hip-hop conglomerate into a racketeering enterprise that forced women to satisfy his sexual desires. Combs has pleaded not guilty. His lawyers say prosecutors are wrongly trying to make a crime out of a party-loving lifestyle that may have been indulgent but was not illegal. Combs could get at least 15 years in prison if he is convicted on all charges.",
      "publishedAt": "2025-05-12T10:21:44Z",
      "title": "Opening statements are expected in the Sean 'Diddy' Combs trial",
      "url": "https://apnews.com/article/diddy-trial-sean-combs-cassie-3eed7dca61020818ab4e3cd842f2aab3",
      "urlToImage": "https://dims.apnews.com/dims4/default/38ca5c0/2147483647/strip/true/crop/412x232+0+35/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Fa3%2F6432a5e3a0dceccac997ce679c33%2Feec96856baf34c44aa11b4376e88f2e4"
    },
    {
      "author": "Rajesh Roy",
      "description": "Indian Prime Minister Narendra Modi says India has only “paused its military action” and will “retaliate on its own terms” if there is any future terror attack on the country. “We will be monitoring every step of Pakistan,” Modi said in an address to the nation Monday. His comments were the first since Saturday’s understanding between India and Pakistan to stop all military actions on land, in the air and at the sea in a U.S.-brokered ceasefire. The escalating hostilities between the two nuclear-armed rivals after a deadly attack on tourists in Kashmir had threatened regional peace.",
      "publishedAt": "2025-05-12T05:23:04Z",
      "title": "First night of calm reported along India-Pakistan border, ceasefire holds",
      "url": "https://apnews.com/article/india-pakistan-ceasefire-war-kashmir-214bde245a63339617dd644e061fbbd2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6f1787/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F5d%2F3e70166b40e93a5eda6c4b7ea62a%2F0425c53778a04861bf3d6804036b8e6a"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV has called for the release of imprisoned journalists and affirmed the “precious gift of free speech and the press.” He spoke in an audience with some of the 6,000 journalists who descended on Rome to cover his election as the first American pontiff. Leo received a standing ovation as he entered the Vatican auditorium for his first meeting with representatives of the general public. The 69-year-old Augustinian missionary, elected in a 24-hour conclave last week, called for journalists to use words for peace, to reject war and to give voice to the voiceless.",
      "publishedAt": "2025-05-12T09:19:53Z",
      "title": "Pope Leo XIV urges release of imprisoned journalists, affirms gift of free speech and press",
      "url": "https://apnews.com/article/pope-leo-journalists-free-press-121ae0103b771fb3cda71ae03870853d",
      "urlToImage": "https://dims.apnews.com/dims4/default/691767d/2147483647/strip/true/crop/7105x3997+0+370/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2Fb5%2F7cac2045095718b52cced11ed4ad%2F4d4f6276db544dcfaf48a2d9451f2a4a"
    },
    {
      "author": "Illia Novikov, Dmytro Zhyhinas",
      "description": "Ukraine's air force says Russia launched more than 100 Shahed and decoy drones at Ukraine in nighttime attacks. The Kremlin has effectively rejected an unconditional 30-day ceasefire in the more than three-year war. But Moscow reiterated that it would take part in possible peace talks later this week without preconditions. There was no direct response from the Kremlin on Monday to Ukrainian President Volodymyr Zelenskyy’s challenge for Russian leader Vladimir Putin to meet him for face-to-face peace talks in Turkey on Thursday. Kremlin spokesman Dmitry Peskov on Monday refused to say who might travel to Istanbul from the Russian side. The United States and European governments are making a concerted push to stop the fighting.",
      "publishedAt": "2025-05-12T07:45:08Z",
      "title": "Russian drones attack Ukraine after the Kremlin turns down a ceasefire proposal but promises talks",
      "url": "https://apnews.com/article/russia-ukraine-war-ceasefire-peace-talks-e9f4832b8cbae8c40f4cfed3de3c678f",
      "urlToImage": "https://dims.apnews.com/dims4/default/09b03ee/2147483647/strip/true/crop/5000x2813+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F15%2F505170ed1ddbc772ba9d2b82f075%2F47a85f1fedd6499fbeaaeef8b44612ff"
    },
    {
      "author": "Tim Reynolds",
      "description": "Sometime around 6 p.m. EDT Monday, locked inside a secure room with no way of communicating with the outside world, team executives and others will watch 14 ping-pong balls start to bounce inside a machine. The balls will be numbered, 1 through 14. One will be drawn, then a second, then a third, then a fourth. And with that, the people inside that room will find out, an hour or so before the rest of the world, which team won the No. 1 pick in next month’s NBA draft. The NBA draft lottery is Monday night in Chicago, with the winner getting the chance to pick No. 1 overall.",
      "publishedAt": "2025-05-12T10:00:07Z",
      "title": "The NBA draft lottery: 14 ping-pong balls, and the right to pick No. 1 overall on the line",
      "url": "https://apnews.com/article/nba-draft-lottery-cooper-flagg-9dc3a5cffa5bf4c9b15e3222fb661c88",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d71256/2147483647/strip/true/crop/7522x4231+0+392/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F7f%2F8ba21194d19d9a5a3976f3215bc2%2F8ea548c86a214a389a05cea817d8694d"
    },
    {
      "author": "Amanda Seitz, Will Weissert, Seung Min Kim",
      "description": "President Donald Trump will sign an executive order calling on the nation’s health department to negotiate lower prices for U.S. medications with drugmakers. The order being signed Monday sets a 30-day deadline for the health department to broker new price tags for drugs. That's according to a White House official who briefed the press on the executive order ahead of its signing. If a deal is not reached, a new rule will kick in tying the price of what the U.S. pays for medications to lower prices paid by other countries. The Republican president teased the order in a social media post Sunday. Drugmakers argue threats to their profits could impact research to develop new drugs.",
      "publishedAt": "2025-05-12T11:28:37Z",
      "title": "Trump's order will call on health department to negotiate lower drug prices",
      "url": "https://apnews.com/article/trump-prescription-drugs-prices-most-favored-nation-4c620a32ccd193b793ba1558f3fe93e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3be99c/2147483647/strip/true/crop/4966x2793+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F2c%2Fa4ec3858b48224502293eddebe15%2Fc07f49e079da4cdb998abe010c115503"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}