{
  "articles": [
    {
      "author": "NATALIE MELZER, ABBY SEWELL and BASSEM MROUE",
      "description": "NAHARIYA, Israel (AP) — Over 100 rockets were fired into Israel from Lebanon early Sunday, with some landing near the northern city of Haifa, as Israel and the Hezbollah militant group appeared to be spiraling toward all-out war following months of escalating tensions.",
      "publishedAt": "2024-09-22T04:52:27Z",
      "title": "Over 100 rockets fired from Lebanon into Israel, with some hitting near northern city of Haifa",
      "url": "https://apnews.com/fb1aa8ae061885ba86855f7fe9ec5be7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbc5cc12e3544164b72e0bc2af0f7ff7/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Israeli troops raided the offices of the satellite news network Al Jazeera in the Israeli-occupied West Bank early Sunday, ordering the bureau to shut down amid a widening campaign by Israel targeting the Qatar-funded broadcaster as it covers the Israel-Hamas war in the Gaza Strip.",
      "publishedAt": "2024-09-22T01:58:42Z",
      "title": "Israel raids and shuts down Al Jazeera's bureau in Ramallah in the West Bank",
      "url": "https://apnews.com/4abdb2969e39e7ad99dfbf9caa7bb32c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e4ed1d4fa084cfe9887260936b1ed0f/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike on a school in northern Gaza on Saturday killed at least 22 people, according to the Gaza Health Ministry, while the Israeli army said it targeted a Hamas command center in what used to be a school.",
      "publishedAt": "2024-09-21T12:24:53Z",
      "title": "An Israeli strike on a school kills at least 22 people, Gaza Health Ministry says",
      "url": "https://apnews.com/755733f50ad52c5af05a2ea7ef082e26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bd6f3607a6c48e7926a8bdd05a738c7/1920.jpeg"
    },
    {
      "author": "MEG KINNARD and ERIK VERDUZCO",
      "description": "WILMINGTON, N.C. (AP) — Donald Trump returned to North Carolina on Saturday, stumping in the southern battleground state with direct appeals to women, claiming he would be a better champion for them than Vice President Kamala Harris, who is vying to become the first female president.",
      "publishedAt": "2024-09-21T04:04:07Z",
      "title": "Trump appeals to women in return to North Carolina without Mark Robinson, a top in-state supporter",
      "url": "https://apnews.com/1bc79594567860c9ffe7f44375fac847",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62635f5476cf4236bf5de49a2685cfcb/3000.jpeg"
    },
    {
      "author": "BERNARD CONDON",
      "description": "The more Chelsea Walsh talked to the eccentric fellow American who seemed to pop up in every square and cobblestone street of Ukraine’s capital, the more she got creeped out.Walsh was in Kyiv as a nurse and aid worker in the early days of the war in Ukraine.",
      "publishedAt": "2024-09-21T19:20:33Z",
      "title": "‘Ticking time bomb’: Those who raised suspicions about Trump suspect question if enough was done",
      "url": "https://apnews.com/530098c668f283d8a38eb5dd5570f1b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9489a96ff37444cdb80704501330e506/1500.jpeg"
    },
    {
      "author": "ZEKE MILLER and AAMER MADHANI",
      "description": "CLAYMONT, Del. (AP) — President Joe Biden told Indo-Pacific allies on Saturday that he believes China’s increasing military assertiveness is an effort to test the region at a turbulent moment for Beijing.",
      "publishedAt": "2024-09-21T09:11:50Z",
      "title": "Biden tells Quad leaders that Beijing is testing region at turbulent moment for Chinese economy",
      "url": "https://apnews.com/3ddfcea9b0e0027977f7d861f2d0cf12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df2e299d0ddb470bbf546659c484b5e8/3000.jpeg"
    },
    {
      "author": "KRISHAN FRANCIS and SHIEKH SAALIQ",
      "description": "COLOMBO, Sri Lanka (AP) — Marxist lawmaker Anura Kumara Dissanayake leads early official results in Sri Lanka's presidential election, according to tallies released on Sunday by the Election Commission, but he is still short of the 50% needed for victory.",
      "publishedAt": "2024-09-22T04:11:33Z",
      "title": "Marxist Dissanayake leads early vote count in Sri Lanka's presidential election",
      "url": "https://apnews.com/50a8990acae90fabaddd8d01c0ef5bcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfa04d09be1344728fcf24a692e87369/3000.jpeg"
    },
    {
      "author": null,
      "description": "TEHRAN, Iran (AP) — A methane leak sparked an explosion at a coal mine in eastern Iran, killing at least 19 people and injuring another 17, Iranian state television reported Sunday. Some miners are believed to be trapped inside.",
      "publishedAt": "2024-09-22T04:50:26Z",
      "title": "At least 19 killed as methane leak causes explosion at eastern Iran coal mine, state TV reports",
      "url": "https://apnews.com/f118b458f3350d7d655116c36ec261b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77c2f0e82f8e45999e419375b81f2c89/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and DAVID B. CARUSO",
      "description": "NEW YORK (AP) — New York City's interim police commissioner revealed late Saturday that federal authorities had executed search warrants at his homes the previous day.Thomas Donlon, who became the interim commissioner just one week ago after the resignation of his predecessor, issued a statement on the search through the police department.",
      "publishedAt": "2024-09-22T04:15:35Z",
      "title": "New York City interim police commissioner says federal authorities searched his homes",
      "url": "https://apnews.com/e5aafbff1ab6425788a7539cbc55221e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/272afb9177994816a1c4f04fe1d83958/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — Facing a swirl of conflicts and crises across a fragmented world, leaders attending this week’s annual U.N. gathering are being challenged: Work together — not only on front-burner issues but on modernizing the international institutions born after World War II so they can tackle the threats and problems of the future.",
      "publishedAt": "2024-09-22T04:11:26Z",
      "title": "World leaders are gathering in New York for the U.N. General Assembly. The outlook is gloomy",
      "url": "https://apnews.com/c8dec645b01be23f67c542666c229d9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f1125da528740b78405c4d58224ad07/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}