{
  "articles": [
    {
      "author": null,
      "description": "Japan’s meteorological agency says that a powerful earthquake has hit near Russia’s Kamchatka Peninsula and issued a tsunami advisory for Japan. The agency said the quake registered a preliminary magnitude of 8.0 when it hit early on Wednesday. It issued an advisory for a tsunami of up to 1 meter (yard) along the Pacific coast of Japan. The quake was about 250 kilometers (160 miles) away from Hokkaido and was felt only slightly. That's according to Japan’s NHK television. So far no damage has been reported. A tsunami watch, which is a relatively low-level warning, has been issued for Hawaii.",
      "publishedAt": "2025-07-29T23:59:58Z",
      "title": "Japan says powerful quake has hit near Russia’s Kamchatka Peninsula, issues a tsunami advisory",
      "url": "https://apnews.com/article/japan-russia-kamchatka-earthquake-tsunami-warning-a88cbe8a1e985cff54dc0ad849ea5ddb",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A powerful earthquake that struck off the coast of Russia has generated tsunami warnings and advisories for a broad section of the Pacific, including Alaska, Hawaii and the U.S. West Coast. The U.S. Geological Survey says the quake registered a magnitude of 8.8 and was centered off the coast of Kamchatka peninsula. If you get a tsunami warning, move to higher ground if you are in a tsunami hazard zone. Some communities have buildings designated as meetup points during tsunami warnings, such as a school. Others might simply urge residents to retreat up a hillside.",
      "publishedAt": "2025-07-30T03:40:35Z",
      "title": "What to know about tsunami warnings and advisories",
      "url": "https://apnews.com/article/pacific-tsunami-warning-evacuation-4bf4cda5efc9dcc7bfdff736abf0f3af",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c9e2d2/2147483647/strip/true/crop/2685x1510+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Feb%2Ffa8ebc0a1b6340e947d0414d7a36%2Fcd07a06fb6914e5481e7cf57c9895e05"
    },
    {
      "author": null,
      "description": "At least 46 Palestinians were killed in Israeli fire in the Gaza Strip since Tuesday evening, according to local hospitals. The dead include more than 30 who were killed while seeking humanitarian aid, hospitals said, who treated dozens of people wounded in the incidents. The Israeli military did not immediately comment on any of the strikes, but says it only targets militants and blames civilian deaths on Hamas because the militants operate in densely populated areas.",
      "publishedAt": "2025-07-30T10:55:47Z",
      "title": "At least 46 Palestinians killed by Israeli fire, Gaza hospitals say, as the war drags on",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-07-30-2025-9b9b516f22e61bd1dde879733fdd97aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/a4b757a/2147483647/strip/true/crop/3240x1823+0+169/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F71%2Feb85f7654c0406a3a2cb0a4190ba%2F70098596cf644c24a7c4c6bcbf7b776a"
    },
    {
      "author": null,
      "description": "The clock is ticking closer to U.S. President Donald Trump’s latest tariff deadline of Aug 1. And while several more deals — or at least frameworks for deals — have been reached since his last tariff deadline of July 9 came and went, trade talks with many countries are still in flux. Trump unveiled sweeping import taxes on goods coming into the U.S. from nearly every country back in April. That included heightened so-called reciprocal rates for certain countries, the bulk of which have since been postponed twice. And by early July, Trump began sending warning letters that higher tariff rates would be imposed against dozens of countries on Aug. 1.",
      "publishedAt": "2025-07-07T17:17:33Z",
      "title": "Trump's latest tariff deadline is approaching. Here are the trade deals the US has announced so far",
      "url": "https://apnews.com/article/trump-tariffs-deadline-delay-d8ffef07d944dc1d460b472e4ffd2f57",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b7e666/2147483647/strip/true/crop/4290x2413+0+223/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Fd4%2F745bde5de8af81f37e1be93803ec%2F769af5a146ca43839e6f81278cf53ecc"
    },
    {
      "author": null,
      "description": "Ghislaine Maxwell is open to answering questions from Congress if granted immunity from future prosecution, her lawyers say. Maxwell, serving a 20-year sentence for conspiring with Jeffrey Epstein to abuse underage girls, has requested questions in advance and wants any interview scheduled after her Supreme Court petition is resolved. The House Oversight Committee, however, has stated it will not consider offering her immunity. Maxwell's lawyers have also urged the Supreme Court to review her conviction, claiming she did not receive a fair trial. They suggest she might testify openly if pardoned by former President Trump.",
      "publishedAt": "2025-07-29T18:20:15Z",
      "title": "Ghislaine Maxwell seeks immunity for Congress testimony on Jeffrey Epstein",
      "url": "https://apnews.com/article/jeffrey-epstein-congress-ghislaine-maxwell-justice-department-3ca45e130deb5f2eee8deff36d99734f",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "This summer, President Donald Trump has begun to chisel back Medicaid and food stamps. On a July day in 1965, President Lyndon B. Johnson signed legislation into law that launched Medicaid, creating a health care safety net for millions of low-income Americans in one of the crowning achievements of his legacy. A year earlier, Johnson did the same for food stamps. But the Republican Party's recent tax and spending bill delivered not just $4.5 trillion in tax breaks but some of the most substantial changes to the landmark safety net programs in their history. Democrats say Republicans are ripping “food out of the mouths of children.” Local governments are scrambling to respond.",
      "publishedAt": "2025-07-30T11:24:59Z",
      "title": "Trump's big bill chisels back Medicaid 60 years after its creation",
      "url": "https://apnews.com/article/trump-big-bill-medicaid-cuts-snap-ed0d2c7c20b43c54265dbc9cb215b647",
      "urlToImage": "https://dims.apnews.com/dims4/default/f70c4d7/2147483647/strip/true/crop/8327x4684+0+434/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F1c%2F77312527161858a24a7578b13032%2F7bd1d310563e443682f76fb53f60b0fb"
    },
    {
      "author": null,
      "description": "Sean \"Diddy\" Combs is asking a judge to release him on a $50 million bond while he awaits sentencing in October. Combs was acquitted of the most serious federal charges he faced, but convicted of lesser prostitution-related offenses. His lawyer, Marc Agnifilo, argued on Tuesday that conditions at the Metropolitan Detention Center in Brooklyn are dangerous. Agnifilo noted that others convicted of similar offenses were typically released before sentencing. In July, Combs was denied bail after being acquitted of sex trafficking and racketeering charges. Judge Arun Subramanian said Combs hasn't shown he is not a danger to the community.",
      "publishedAt": "2025-07-29T21:14:45Z",
      "title": "Sean 'Diddy' Combs seeks $50M bond before October sentencing",
      "url": "https://apnews.com/article/sean-diddy-combs-sentencing-bond-603faeb7b26a3290e10b83dd28dadab3",
      "urlToImage": "https://dims.apnews.com/dims4/default/87e076c/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F6a%2F146b14d6374b1e3f8b9f8617798d%2F89b0f0471e064ee081bb254c5a0aa1d2"
    },
    {
      "author": null,
      "description": "An off-duty New York City police officer and an executive at an investment firm were among four people killed by a gunman at a Manhattan office tower. The officer, Didarul Islam, was working a corporate security detail at the midtown skyscraper that is home to the headquarters of both the NFL and Blackstone, one of the world’s largest investment firms. Blackstone has confirmed senior managing director Wesley LePatner was fatally shot. NFL Commissioner Roger Goodell said a worker at the league's office was seriously wounded. A labor union identified a security officer killed in the shooting as Aland Etienne. Authorities haven’t identified the other person killed in the attack.",
      "publishedAt": "2025-07-29T16:16:38Z",
      "title": "A police officer and investment firm executive are among New York City shooting victims",
      "url": "https://apnews.com/article/victims-office-shooting-new-york-nfl-2869b5bb31e6480dc2c20175d270ad88",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a7d2d1/2147483647/strip/true/crop/8439x4747+0+440/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F11%2Fa603361617cafadf8ed20928b33a%2Fabaf280eae9342eba2e2f02a86f82ed4"
    },
    {
      "author": null,
      "description": "Thailand and Cambodia have implemented a ceasefire intended to end five days of armed combat over disputed territory along their border. The truce this week appeared shaky with reports of sporadic clashes continuing. The talks Monday that led to an agreement were hosted by Malaysian Prime Minister Anwar Ibrahim. U.S. President Donald Trump has threatened the warring countries that he would not negotiate on implementing lower tariffs unless they reached an agreement to end the violence. The proximate cause of the fighting was a land mine explosion that injured five Thai soldiers, but the two countries have a history of enmity.",
      "publishedAt": "2025-07-24T07:26:37Z",
      "title": "What to know about a shaky truce between Thailand and Cambodia",
      "url": "https://apnews.com/article/thailand-cambodia-border-conflict-explainer-0eb99510a4ea16ee769a5934e0c07383",
      "urlToImage": "https://dims.apnews.com/dims4/default/59448ff/2147483647/strip/true/crop/7663x4310+0+399/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F88%2Fe8a3c30ef43e0a5f9960074023b7%2Fe0060bf237164849b475ac704cb502f8"
    },
    {
      "author": null,
      "description": "The first Australian-made rocket to attempt to reach orbit from the country's soil has crashed after 14 seconds of flight. The rocket Eris, launched by Gilmour Space, was the first Australian designed and manufactured orbital launch vehicle to lift off from the country. It launched Wednesday morning from a spaceport near the small town of Bowen in the north of Queensland state. In videos published by Australian news outlets the rocket appeared to hover in the air before falling out of sight. No one was reported hurt. CEO Adam Gilmour said he was “happy” the rocket “got off the pad.”",
      "publishedAt": "2025-07-30T06:51:42Z",
      "title": "First Australian-made rocket crashes after 14 seconds of flight in a failed attempt to reach orbit",
      "url": "https://apnews.com/article/rocket-crash-launch-australia-gilmour-space-5df36f956621db85c360157400b88c09",
      "urlToImage": "https://dims.apnews.com/dims4/default/e2a1386/2147483647/strip/true/crop/940x529+0+49/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F4d%2F6f80086ac2abaa9c57a4378ea501%2Fc67166c0c8e647faab3488f1e8eebc29"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}