{
  "articles": [
    {
      "author": "YAHYA HABCHITI, KAREEM CHEHAYEB, and WAFAA SHURAFA",
      "description": "AITO, Lebanon (AP) — An Israeli airstrike hit an apartment building in northern Lebanon on Monday, killing at least 21 people, according to the Lebanese Red Cross.There was no immediate comment from the Israeli military and it was not clear what the target was.",
      "publishedAt": "2024-10-14T06:30:26Z",
      "title": "Israeli strike in northern Lebanon kills at least 21 people",
      "url": "https://apnews.com/70c8cf5a93eec9ea643a5fda5670da93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fc66112a4eb4a11a5196e85e18de4ee/3000.jpeg"
    },
    {
      "author": "GARY D. ROBERTSON and SARAH BRUMFIELD",
      "description": "RALEIGH, N.C. (AP) — Federal disaster workers paused and then changed some of their hurricane-recovery efforts in North Carolina, including abandoning door-to-door visits, after receiving threats that they could be targeted by a militia, officials said, as the government response to Helene is targeted by runaway disinformation.",
      "publishedAt": "2024-10-14T18:15:44Z",
      "title": "FEMA workers change some hurricane-recovery efforts in North Carolina after receiving threats",
      "url": "https://apnews.com/dbb6b5727eaa12e79f307bf38a4b6256",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b10312fe0c7486dad334c885a8d5211/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A NASA spacecraft rocketed away Monday on a quest to explore Jupiter’s tantalizing moon Europa and reveal whether its vast hidden ocean might hold the keys to life.",
      "publishedAt": "2024-10-14T16:07:28Z",
      "title": "NASA spacecraft rockets toward Jupiter's moon Europa in search of the right conditions for life",
      "url": "https://apnews.com/88d680ae8625c239370865b36d5d69a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9df51ac7f2c643799435309f8a5fd012/1920.jpeg"
    },
    {
      "author": "MARK SCOLFORO",
      "description": "HARRISBURG, Pa. (AP) — Vice President Kamala Harris and former President Donald Trump are taking their fight for Pennsylvania to opposite ends of the state on Monday, with Harris speaking in the northwest corner in Erie and Trump in the southeastern suburbs of Philadelphia.",
      "publishedAt": "2024-10-14T12:01:17Z",
      "title": "Harris and Trump campaigning in battleground Pennsylvania on Monday",
      "url": "https://apnews.com/837bf147439eabe552b56334035890bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f9ec17f7a854990b8a2ab28ff3539dd/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "ERIE, Pa. (AP) — Vice President Kamala Harris announced a plan on Monday to give Black men more economic opportunities and other chances to thrive as she works to energize a key voting bloc that has Democrats concerned about a lack of enthusiasm.",
      "publishedAt": "2024-10-14T09:01:09Z",
      "title": "Harris is laying out a new plan to empower Black men as she tries to energize them to vote for her",
      "url": "https://apnews.com/67ac83899af785cf4d8788b9fcdeb592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/465ce08e44bc454c8d3b36dc9835546e/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The indictment charging Donald Trump with hoarding classified documents leveled one jaw-dropping allegation after another, including that he showed off a secret Pentagon attack plan to guests at his golf club and suggested his lawyer mislead the FBI about the presence of the White House records.",
      "publishedAt": "2024-10-14T04:12:04Z",
      "title": "This could have been a year of a federal court reckoning for Trump. Judges had other ideas",
      "url": "https://apnews.com/302f87960dbd84d7be5daedaf03328d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4f6ba2041d54d82812e8270940f33a2/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON",
      "description": "NEW YORK (AP) — Lilly Ledbetter, a former Alabama factory manager whose lawsuit against her employer made her an icon of the equal pay movement and led to landmark wage discrimination legislation, has died at 86.",
      "publishedAt": "2024-10-14T17:57:08Z",
      "title": "Lilly Ledbetter, an icon of the fight for equal pay, has died at 86",
      "url": "https://apnews.com/6044c3fa0c843ad1e294fbf49725da99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c368ee951b42429e80ad77366d90fea4/2000.jpeg"
    },
    {
      "author": "ROB GILLIES, AIJAZ HUSSAIN and SHEIKH SAALIQ",
      "description": "TORONTO (AP) — Canada said it has identified India’s top diplomat in the country as a person of interest in the assassination of a Sikh activist there and expelled him and five other diplomats Monday, in an escalating dispute over the June 2023 killing and allegations of other crimes.",
      "publishedAt": "2024-10-14T14:54:35Z",
      "title": "Canada expels India's top diplomat and alleges wider diplomatic involvement in crimes",
      "url": "https://apnews.com/f099e210d2f9df93fea18a9de04e06f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d01e9c085f1d4897bcb7de647b542ba3/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Sean “Diddy” Combs was hit Monday with a new wave of lawsuits accusing him of raping women, sexually assaulting men and molesting a 16-year-old boy — the first time he’s been sued by a person alleging they were abused as a minor.",
      "publishedAt": "2024-10-14T18:10:31Z",
      "title": "6 people accuse Diddy of sexual assault in new lawsuits, including man who was 16 at the time",
      "url": "https://apnews.com/6349f77fa3a5fb1cc4030d7abd65ccba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0917bc44ad3949758c06d1cb09a4322d/3000.jpeg"
    },
    {
      "author": "JOSH DUBOW",
      "description": "SANTA CLARA, Calif. (AP) — San Francisco 49ers rookie receiver Ricky Pearsall returned to the field for practice on Monday for the first time since he was shot in the chest during an attempted robbery nine days before the season opener.",
      "publishedAt": "2024-10-14T22:54:22Z",
      "title": "Ricky Pearsall returns to the 49ers practice for the first time since shooting",
      "url": "https://apnews.com/80dbf14018fe22b31210c300338d9869",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d01d4b831b3041f58422a65f2d5fd0fb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}