{
  "articles": [
    {
      "author": "ISABEL DeBRE, EDITH M. LEDERER and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Israel’s military told some 1 million Palestinians on Friday to evacuate northern Gaza and head to the southern part of the besieged territory, an unprecedented order applying to almost half the population ahead of an expected ground invasion against the ruling Hamas militant group.",
      "publishedAt": "2023-10-13T04:00:40Z",
      "title": "Israel orders unprecedented evacuation of 1 million in Gaza as possible ground offensive looms",
      "url": "https://apnews.com/c8b4fc20e4fd2ef381d5edb7e9e8308c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0531a9e33be425d9021b89a811a0eb9/3000.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER and SARAH EL DEEB",
      "description": "Less than a month before Hamas fighters blew through Israel’s high-tech “Iron Wall” and launched an attack that would leave more than 1,200 Israelis dead, they practiced in a very public dress rehearsal.",
      "publishedAt": "2023-10-13T01:46:10Z",
      "title": "Hamas practiced in plain sight, posting video of mock attack weeks before border breach",
      "url": "https://apnews.com/aa0b0f5f3613b6c6882cf37168e8e8ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5646c81456d41569fd8a67ba8b4f896/2880.jpeg"
    },
    {
      "author": "ISABEL DEBRE and JON GAMBRELL",
      "description": "JERUSALEM (AP) — Tens of thousands of Muslims demonstrated Friday across the Middle East in support of the Palestinians and against Israeli airstrikes pounding Gaza, underscoring the risk of a wider regional conflict erupting as Israel prepares for a possible ground invasion in the coastal strip.",
      "publishedAt": "2023-10-13T10:16:08Z",
      "title": "Tens of thousands protest after Muslim prayers across Mideast over Israeli airstrikes on Gaza",
      "url": "https://apnews.com/8474ed730294a1c2299bdaef58a17142",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2629748168b8428e8aebbdc22cbf0675/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "TEL AVIV, Israel (AP) — U.S. Defense Secretary Lloyd Austin was in Israel on Friday for meetings with senior government leaders and to see firsthand some of the U.S. weapons and security assistance that Washington rapidly delivered to Israel in the first week of its war with the militant Hamas group.",
      "publishedAt": "2023-10-13T06:54:06Z",
      "title": "US defense secretary is in Israel to meet with its leaders and see America's security assistance",
      "url": "https://apnews.com/c4a39169dc5ee7256f20bc1534c4f0cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a19036c1013d4e82baf63b2e35dcdd65/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI, STEPHEN GROVES and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Republican Steve Scalise ended his bid to become House speaker late Thursday after hardline holdouts refused to back the party’s nominee, throwing the GOP majority into deeper chaos and leaving the chamber still unable to function.",
      "publishedAt": "2023-10-12T04:23:22Z",
      "title": "GOP's Scalise ends his bid to become House speaker as Republican holdouts refuse to back the nominee",
      "url": "https://apnews.com/1492ca6b58604c51186015c23f7efccd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/020ee15fb55d4fb9ae730ae25c9fd74d/1920.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, REBECCA BOONE and AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — Audio of 911 calls from a deadly August wildfire released late Thursday by Maui County authorities reveals a terrifying and chaotic scene as the inferno swept through the historic town of Lahaina and people desperately tried to escape burning homes and flames licking at cars in gridlocked traffic.",
      "publishedAt": "2023-10-13T03:00:56Z",
      "title": "911 calls from deadly Lahaina wildfire show residents' terror and panic in a desperate bid to escape",
      "url": "https://apnews.com/41589535521a3e5f399a5b88db2fac52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a6af86f35724146a4529f88fbc1623c/3000.jpeg"
    },
    {
      "author": "BY AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — On the 60th anniversary of the March on Washington this summer, a few Black queer advocates spoke passionately before the main program about the ongoing struggle for LGBTQ+ rights.",
      "publishedAt": "2023-10-13T04:11:06Z",
      "title": "After years of erasure, Black queer leaders rise to prominence in Congress and activism",
      "url": "https://apnews.com/2a98d325a7b36430c11fc49506a2f591",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/907824df7bb04a1f93bb3cc23a368e1c/3000.jpeg"
    },
    {
      "author": "VANESSA GERA",
      "description": "WARSAW, Poland (AP) — Dariusz Stola began working with Poland’s anti-communist Solidarity movement in 1983. He was just 19 but already appalled by the way the regime imposed its harsh censorship, not just on political thought but culture as well.",
      "publishedAt": "2023-10-13T05:26:41Z",
      "title": "Many who struggled against Poland's communist system feel they are fighting for democracy once again",
      "url": "https://apnews.com/db4962db7ea67775dab561cd60814ff2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94513c01698f4c8fae0f7e38935266e5/3000.jpeg"
    },
    {
      "author": "RODRIGO ABD",
      "description": "DURAN, Ecuador (AP) — Dismembered limbs lie on the street next to playing children. Prisons are arenas of gang warfare. Bloodshed keeps schools shut down. And a presidential candidate is assassinated in broad daylight.",
      "publishedAt": "2023-10-13T04:03:02Z",
      "title": "AP PHOTOS: Surge in gang violence upends life in Ecuador",
      "url": "https://apnews.com/f75d89c67d79f2f564abc883cc09b2cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/721e9774b2974b01b4df746ff4a430e5/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and DAVID KEYTON",
      "description": "ABOARD THE ALLANKAY off Antarctica (AP) — The Antarctic Endeavour glides across the water’s silky surface as dozens of fin whales spray rainbows from their blowholes into a fairy tale icescape of massive glaciers.",
      "publishedAt": "2023-10-13T09:47:45Z",
      "title": "Factory fishing in Antarctica for krill targets the cornerstone of a fragile ecosystem",
      "url": "https://apnews.com/292a6763968d92c28fb664d2eefe554b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cad5e46ec4d45f98e52d13eba5f5c9f/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}