{
  "articles": [
    {
      "author": "MATTHEW LEE",
      "description": "TEL AVIV, Israel (AP) — U.S. Secretary of State Antony Blinken said Monday the time is now to conclude a Gaza cease-fire agreement that would return hostages held by Hamas and bring relief to Palestinian suffering after 10 months of devastating fighting in Gaza.",
      "publishedAt": "2024-08-19T06:38:11Z",
      "title": "Blinken, in Israel, says now is 'maybe the last' chance for a Gaza cease-fire deal",
      "url": "https://apnews.com/34f91f99c9a4f63e98134aaecb7af971",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d03eeebfa084ee69cccfaa66229997a/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "U.S. and Arab mediators say they are closing in on a deal to halt the war in Gaza and free hostages captured by Hamas in its Oct. 7 attack, but the talks have dragged on for months, with several moments of false hope.",
      "publishedAt": "2024-08-19T04:23:46Z",
      "title": "What is the latest on the high-stakes negotiations over a cease-fire in Gaza?",
      "url": "https://apnews.com/acc945acb9160c63a8d957e1addc16e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/500756ed033e472085aa7f37ce1f2a58/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian local authorities on Monday ordered families with children to urgently evacuate the eastern city of Pokrovsk. They say Russian forces are advancing so quickly that it is compulsory for families to leave the city and other nearby towns.",
      "publishedAt": "2024-08-19T10:26:46Z",
      "title": "Ukrainian officials issue an evacuation order for families with children from the city of Pokrovsk",
      "url": "https://apnews.com/b8c4c6cc0dd81658fecdf1c83145908d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf9c3337d8554a8395e7e61cfc437794/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES, ZEKE MILLER and BILL BARROW",
      "description": "CHICAGO (AP) — A refreshed Democratic Party reintroduces itself to a divided nation this week, having been transformed by the money, momentum, relief and even joy that followed Vice President Kamala Harris ' rise to the top of its ticket.",
      "publishedAt": "2024-08-19T04:06:05Z",
      "title": "Democrats open their convention transformed by Harris' ascendance but facing lingering questions",
      "url": "https://apnews.com/0a0e65ab69a1e338d9c1f3f137a45e82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7d9d896057944c0be4b832bfdc07e21/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN",
      "description": "CHICAGO (AP) — Crowds of activists are expected to gather in Chicago for protests outside the Democratic National Convention this week, hoping to call attention to such issues as economic injustice, reproductive rights and the war in Gaza.",
      "publishedAt": "2024-08-19T06:16:05Z",
      "title": "Protesters plan large marches and rallies as Democratic National Convention kicks off in Chicago",
      "url": "https://apnews.com/87d32321eb5714e2005fe8410b928513",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe967ce8a5c44647b260b1d12c99d5cd/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is entering the Democratic National Convention with increased excitement from Democrats and a steady rise in her favorability ratings among Americans as a whole.",
      "publishedAt": "2024-08-19T04:03:04Z",
      "title": "Favorable views of Kamala Harris have risen this summer heading into the DNC, AP-NORC poll shows",
      "url": "https://apnews.com/b2a725729afe91851d89644fd97eb6e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/496c427e161440d8bb3d7a1ff9f94a8a/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "BEDMINSTER, N.J. (AP) — As Democrats kick off their convention in Chicago, Donald Trump 's campaign is trying to regain its footing after weeks of struggling to adjust to Vice President Kamala Harris at the top of the opposing ticket.",
      "publishedAt": "2024-08-19T04:08:53Z",
      "title": "Trump will campaign across the country this week as he struggles to adjust to Harris",
      "url": "https://apnews.com/48f5d991866e33af23e4494467240592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58f5b6f46aa147c4a9922d345f471309/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW DELHI (AP) — Hundreds of doctors protested near India's Health Ministry on Monday to demand stringent laws to protect health care workers from violence and to seek justice for their colleague who was raped and killed at a state-run hospital.",
      "publishedAt": "2024-08-19T07:08:44Z",
      "title": "Indian doctors demand tougher laws after a colleague was raped and killed at a hospital",
      "url": "https://apnews.com/d3f23d145891ec3031617647a8cc0166",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/547ea36a9bea4aeda67b28593a45704f/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "PHOENIX (AP) — As schools reopen for another year, they are focused on improving student attendance. But back-to-school is hitting just as COVID-19 cases are increasing, raising the question: When is a child too sick for school?",
      "publishedAt": "2024-08-19T04:15:48Z",
      "title": "Got cold symptoms? Here's when kids should take a sick day from school",
      "url": "https://apnews.com/c9d75ab8173b210101d6e832f604e8b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e80b54f4efb4cecb15b7de9798abd07/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "SINTRA, Portugal (AP) — The doorbell to Martinho de Almada Pimentel’s house is hard to find, and he likes it that way. It’s a long rope that, when pulled, rings a literal bell on the roof that lets him know someone is outside the mountainside mansion that his great-grandfather built in 1914 as a monument to privacy.",
      "publishedAt": "2024-08-19T04:21:10Z",
      "title": "Too many people, not enough management: A look at the chaos of 'overtourism' in the summer of 2024",
      "url": "https://apnews.com/df764ed1c7009fdbbf5a32eaedc6ffd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14190d8aa1ee43fb81e546ed53588f3f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}