{
  "articles": [
    {
      "author": "NATALIE MELZER and OHAD ZWIGENBERG",
      "description": "JERUSALEM (AP) — A missile fired by Yemen's Iran-backed rebels landed in an open area in central Israel early Sunday and triggered air raid sirens at its international airport, in the latest reverberation from the nearly yearlong war in Gaza.",
      "publishedAt": "2024-09-15T05:27:10Z",
      "title": "A missile fired by Yemen's rebels lands in Israel and triggers sirens at international airport",
      "url": "https://apnews.com/5f26be6628a0e7df38bc933520552f5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26435e0a631346e2879a26d7c722ef7e/3000.jpeg"
    },
    {
      "author": "SARAH PARVINI and MATT O'BRIEN",
      "description": "LOS ANGELES (AP) — Being a venture capitalist carries a lot of prestige in Silicon Valley. Those who choose which startups to fund see themselves as fostering the next big waves of technology.So when some of the industry’s biggest names endorsed former President Donald Trump and the onetime VC he picked for a running mate, JD Vance, people took notice.",
      "publishedAt": "2024-09-15T09:00:39Z",
      "title": "Which candidate is better for tech innovation? Venture capitalists divided on Harris or Trump",
      "url": "https://apnews.com/889ecb15f97d6e2b6c3fa585f133b54d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e2586624cbb4b67a9d92dc6536f9bad/3000.jpeg"
    },
    {
      "author": "DAN MERICA and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Two decades ago, when a Democratic presidential nominee wouldn't dream of endorsing gay marriage, a newly elected district attorney named Kamala Harris was performing one of the first same-sex unions in the United States.",
      "publishedAt": "2024-09-15T11:35:10Z",
      "title": "Long before gay marriage was popular, Kamala Harris was at the forefront of the equal rights battle",
      "url": "https://apnews.com/fddf134333112ed1ae2b87b548b54435",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74acd919be8d43269deb99cae2483e49/2856.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and JOHN HANNA",
      "description": "PITTSBURG, Kan. (AP) — The Rev. Anthony Navaratnam stood before his congregation and urged them to pray for the women from surrounding states who will flock to the new abortion clinic in town that opened in August.",
      "publishedAt": "2024-09-15T04:04:16Z",
      "title": "How a small town in Kansas found itself at the center of abortion’s national moment",
      "url": "https://apnews.com/d239ee0566d719a44334e58da3b3356e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebd67109e63f4162bdcc26096a781186/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "DILI, East Timor (AP) — It was the farthest trip of his pontificate and one of the longest papal trips ever in terms of days on the road and distance traveled.",
      "publishedAt": "2024-09-15T05:01:36Z",
      "title": "87 and hobbled, Pope Francis goes off-script in Asia and reminds world he can still draw a crowd",
      "url": "https://apnews.com/9e873fd69bf46a25f16a431a0fca6dcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9de8717c1d7848f9824a22b202baa807/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "LOUISVILLE, Ky. (AP) — On his first day of school at Newcomer Academy, Maikel Tejeda was whisked to the school library. The 7th grader didn’t know why.He soon got the point: He was being given make-up vaccinations.",
      "publishedAt": "2024-09-15T12:03:31Z",
      "title": "This city is hailed as a vaccination success. Can it be sustained?",
      "url": "https://apnews.com/630b05bcd3b319a1d1028ca34e65b532",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfaa5ca9945e43b99328e3beb3affcd3/3000.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA",
      "description": "Huge celebrations across the U.S. are expected to celebrate National Hispanic Heritage Month, an annual tradition that showcases the awe-inspiring diversity and culture of Hispanic people. Celebrated each year from Sept.",
      "publishedAt": "2024-09-15T04:01:39Z",
      "title": "Hispanic Heritage Month puts diversity and culture at the forefront",
      "url": "https://apnews.com/52892750ddba933402be7b38c1164dc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4c74154c3cf46eca2e526bb7c9cd8b5/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Two people died in a missile attack on the Ukrainian Black Sea port city of Odesa, local officials said, as Moscow and Kyiv exchanged drone and missile attacks.",
      "publishedAt": "2024-09-15T08:24:43Z",
      "title": "2 people die in Ukraine's Odesa after Moscow and Kyiv exchange drone and missile attacks",
      "url": "https://apnews.com/0bbd98f8c894490ccb1f0c486325d209",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/781f860a42dd476887928e6fe6a9142f/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — It was almost time for the presidential debate, but Kamala Harris’ staff thought there was one more thing she needed to know.",
      "publishedAt": "2024-09-15T12:30:22Z",
      "title": "Days of preparation and one final warning. How Kamala Harris got ready for her big debate moment",
      "url": "https://apnews.com/ad7dde130caf787af1c113a0e74e331e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dad53635f3e24de5b82621981e7d3c27/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "SPRINGFIELD, Ohio (AP) — For many Haitian immigrants, Sunday mornings in Springfield, Ohio, are spent joyfully worshipping God as they sing and pray in their native Creole. This Sunday, they needed that uplifting balm more than ever.",
      "publishedAt": "2024-09-15T16:46:36Z",
      "title": "Haitians in Ohio find solidarity at church after chaotic week of false pet-eating claims",
      "url": "https://apnews.com/aa7827f1236f207c9f64ae07096e3977",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31e658fb24bb4ba4b2f09485ea032a4b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}