{
  "articles": [
    {
      "author": "ILLIA NOVIKOV and HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Russia launched 122 missiles and a score of drones against Ukrainian targets, officials said Friday, killing at least 20 civilians across the country in what an air force official said was the biggest aerial barrage of the war.",
      "publishedAt": "2023-12-29T08:42:21Z",
      "title": "Russia fires 122 missiles and 36 drones in what Ukraine calls the biggest aerial barrage of the war",
      "url": "https://apnews.com/fe3fb596cdea0035573a6a677f17070c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d83a2cf239743f0908df55016315bc6/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — First, Colorado's Supreme Court ruled that former President Donald Trump wasn't eligible to run for his old job in that state.",
      "publishedAt": "2023-12-29T03:00:48Z",
      "title": "Trump is blocked from the GOP primary ballot in two states. Can he still run for president?",
      "url": "https://apnews.com/5e211f4078974f8c87dd915893241fb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c3d0fd2adb04aff8560ccc9f011e568/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and DAVID SHARP",
      "description": "PORTLAND, Maine (AP) — Maine’s Democratic secretary of state on Thursday removed former President Donald Trump from the state’s presidential primary ballot under the Constitution’s insurrection clause, becoming the first election official to take action unilaterally as the U.S.",
      "publishedAt": "2023-12-28T23:56:11Z",
      "title": "Maine bars Trump from ballot as US Supreme Court weighs states' authority to block former president",
      "url": "https://apnews.com/081fd38ce1f20be9b8423cb2f8c66dee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5ce5ba4c3e44c47872434560cf1fa8c/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Tens of thousands of Palestinians streamed into an already crowded town at the southernmost end of Gaza in recent days, according to the United Nations, fleeing Israel’s bombardment of the center of the strip, where hospital officials said dozens were killed Friday.",
      "publishedAt": "2023-12-29T08:58:55Z",
      "title": "Palestinians stream into a southern Gaza town as Israel expands its offensive in the center",
      "url": "https://apnews.com/d36675194a22db54970f38c1c2ed3937",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/756405ce71ed448ba7f8d1f29b435791/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and ABBY SEWELL",
      "description": "TEL AVIV, Israel (AP) — Israeli officials are stepping up threats against the Lebanese militant group Hezbollah, warning that Israel is running out of patience as the two sides continue to trade fire along Israel's volatile northern border.",
      "publishedAt": "2023-12-28T19:01:08Z",
      "title": "As Gaza war grinds on, tensions soar along Israel's volatile northern border with Lebanon",
      "url": "https://apnews.com/b7bac0bb9890681b538ca95cd9d792b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c925cdc21d84419297960de8ab1d8f21/3000.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "ALEXANDRIA, La. (AP) — Alfred King was lying in the parking lot of a small apartment building, mortally wounded when police in Alexandria, Louisiana, got to the intersection of 12th and Magnolia streets shortly before 1:30 a.m., Jan.",
      "publishedAt": "2023-12-29T05:25:44Z",
      "title": "Perspective: Children born poor have little margin for mistakes or bad decisions, regardless of race",
      "url": "https://apnews.com/318c9dbd5a01f5d9dd6e57198549dd5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62f26f90122f4b1c95186fad595dbcd9/1920.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "CHAPEL HILL, N.C. (AP) — Four days of waiting under the flickering fluorescent lights of UNC Hospitals' emergency room left Callum Bradford desperate for an answer to one key question.The transgender teen from Chapel Hill needed mental health care after overdosing on prescription drugs.",
      "publishedAt": "2023-12-29T05:25:04Z",
      "title": "For transgender youth in crisis, hospitals sometimes compound the trauma",
      "url": "https://apnews.com/0b1349f338d3110806fcbb2276e2e42b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ebd0455ccc744a8b81bc49bd02a0b0a/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — A large pool of dark liquid festering on the floor. No fresh air. Computer displays that would overheat and ooze out a fishy-smelling gel that nauseated the crew. Asbestos readings 50 times higher than the Environmental Protection Agency’s safety standards.",
      "publishedAt": "2023-12-29T05:44:26Z",
      "title": "The Air Force said its nuclear missile capsules were safe. But toxins lurked, documents show",
      "url": "https://apnews.com/f17d9f56e01e2750990d294d4b51a25c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e44ed19945ba4ded83c992baaa8fa013/1920.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — The restaurant where Katie Austin was a server burned in the wildfire that devastated Hawaii's historic town of Lahaina this summer.",
      "publishedAt": "2023-12-29T05:09:08Z",
      "title": "Maui's economy needs tourists. Can they visit without compounding wildfire trauma?",
      "url": "https://apnews.com/c214dfd2738c389260196fa65828b2bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/298f2207b9c34d21bd86fe49137ba8a7/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — A light-water reactor at North Korea’s main nuclear complex will likely be formally operational by next summer, South Korea’s defense minister said, amid suspicions that the North may use it as a new source of fissile materials for nuclear weapons.",
      "publishedAt": "2023-12-29T09:31:22Z",
      "title": "North Korea's new reactor at nuclear site likely to be formally operational next summer, Seoul says",
      "url": "https://apnews.com/92b49577b1daac9b9585bfb14fcac626",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/986040abf5414fcf912038fc6fb1cb20/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}