{
  "articles": [
    {
      "author": "WILL WEISSERT and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden on Monday announced that he is commuting the sentences of 37 of the 40 people on federal death row, converting their punishments to life imprisonment just weeks before President-elect Donald Trump, an outspoken proponent of expanding capital punishment, takes office.",
      "publishedAt": "2024-12-23T10:00:56Z",
      "title": "Biden gives life in prison to 37 of 40 federal death row inmates before Trump can resume executions",
      "url": "https://apnews.com/f67b5e04453cd1aa6383c516bc14f300",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d267045be5a4afe9b3a92dc073a2fba/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House Ethics Committee on Monday accused Matt Gaetz of “regularly” paying for sex, including once with a 17-year-old girl, and purchasing and using illicit drugs as a member of Congress, as lawmakers released the conclusions of a nearly four-year investigation that helped sink his nomination for attorney general.",
      "publishedAt": "2024-12-23T14:47:41Z",
      "title": "House Ethics Committee accuses Gaetz of paying for sex, including with 17-year-old girl",
      "url": "https://apnews.com/538cb5387bf95925245bf87fa6b1adcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71e1034b31054cc3aea7a9fdfff72c12/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The man accused of fatally shooting the CEO of UnitedHealthcare pleaded not guilty on Monday to state murder and terror charges while his attorney complained that comments coming from New York’s mayor would make it tough to receive a fair trial.",
      "publishedAt": "2024-12-23T05:30:42Z",
      "title": "Luigi Mangione pleads not guilty to murder and weapons charges in UnitedHealthcare CEO's death",
      "url": "https://apnews.com/8079a5bbe5f3e0539d09332a7240168d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/281d69b119b9471893d7b0d89e6d2ea2/1920.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE and SUSAN HAIGH",
      "description": "A man is facing murder and arson charges in New York City for allegedly setting a woman on fire inside a subway train and then watching her die after she was engulfed in flames, police said Monday.",
      "publishedAt": "2024-12-23T16:28:25Z",
      "title": "Man faces murder charges in the death of a woman who was lit on fire in New York City subway",
      "url": "https://apnews.com/c946bb951f67116e1bfb399f99ab5062",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e366d6449274f0eba154745e99270aa/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "JERUSALEM — Israel’s defense minister has confirmed that Israel assassinated Hamas’ top leader last summer and is threatening to take similar action against the leadership of the Houthi rebel group in Yemen.",
      "publishedAt": "2024-12-23T08:35:17Z",
      "title": "Middle East latest: Defense minister acknowledges Israel killed Hamas leader",
      "url": "https://apnews.com/d7d28b67bb47c390a7be0ddd925f1c46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2787976db70d44dbbc6768c41cd07403/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WEST PALM BEACH, Fla. (AP) — First it was Canada, then the Panama Canal.",
      "publishedAt": "2024-12-23T15:23:25Z",
      "title": "Trump again calls to buy Greenland after eyeing Canada and the Panama Canal",
      "url": "https://apnews.com/a52858e3075f9b5ad95e78753293fc1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc620e18fff248c69b7eda92e5d06acf/1920.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI and ELAINE KURTENBACH",
      "description": "TOKYO (AP) — Japanese automakers Honda and Nissan have announced plans to work toward a merger that would form the world’s third-largest automaker by sales, as the industry undergoes dramatic changes in its transition away from fossil fuels.",
      "publishedAt": "2024-12-23T07:32:06Z",
      "title": "Nissan and Honda to attempt a merger that would create the world's No. 3 automaker",
      "url": "https://apnews.com/782913451d6487ed177a3517a9ba5be5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8656f0a1347d42239d4cfadaf4b1ed4e/3000.jpeg"
    },
    {
      "author": null,
      "description": "MAGDEBURG, Germany (AP) — Mourners laid flowers near the scene of the deadly Christmas market attack on Monday as investigators puzzled over the motive of the suspect and his previous encounters with authorities were scrutinized, while fears swirled that the rampage could deepen divisions in German society.",
      "publishedAt": "2024-12-23T10:12:07Z",
      "title": "Magdeburg mourns Christmas market attack victims as fears swirl of deeper German social divisions",
      "url": "https://apnews.com/9ae2b2ca5cea3cef79fe502ab3f27b63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff85d4bb18f845dea855bc8bccad3267/3000.jpeg"
    },
    {
      "author": "MARIAM FAM and LUIS ANDRES HENAO",
      "description": "The Rev. Shannon Blosser sees how his son loves church — the music, the singing, the communion. But the United Methodist pastor said his family hasn’t always felt like 11-year-old Noah, who is autistic, has been welcome.",
      "publishedAt": "2024-12-23T13:02:30Z",
      "title": "How faith communities can be welcoming of believers with disabilities this holiday season and beyond",
      "url": "https://apnews.com/ace956cfe18b3812cafb5d42f4cc82fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73040d17d4324ea3a3ca167b80abd855/3000.jpeg"
    },
    {
      "author": "AARON BEARD",
      "description": "Tennessee and Auburn remained Nos. 1-2 atop The Associated Press men's college basketball poll. It's a fitting spot for a pair of Southeastern Conference teams considering the league put 10 teams into Monday's AP Top 25.",
      "publishedAt": "2024-12-23T18:09:43Z",
      "title": "Tennessee and Auburn remain 1-2 in AP Top 25 poll featuring 10 SEC teams",
      "url": "https://apnews.com/6bdb6dc899fab6a54cb28cabeb15d107",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57dccf8a08de420d90df8c11ced67dc8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}