{
  "articles": [
    {
      "author": "ERIC TUCKER, JIM MUSTIAN, KEVIN McGILL and JACK BROOK",
      "description": "NEW ORLEANS (AP) — A U.S. Army veteran driving a pickup truck that bore the flag of the Islamic State group wrought carnage on New Orleans’ raucous New Year’s celebration, killing 15 people as he steered around a police blockade and slammed into revelers before being shot dead by police.",
      "publishedAt": "2025-01-01T11:42:45Z",
      "title": "Islamic State-inspired driver expressed desire to kill before deadly New Orleans rampage, Biden says",
      "url": "https://apnews.com/63a1b43d615af365cb8ba6f5f0583eca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30276dc076b941a1bc8b545207ba2049/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — A driver behind the wheel of a pickup truck rammed into a crowd of New Orleans revelers on Bourbon Street early on New Year’s Day, killing at least 15 people in what the FBI is investigating as an act of terrorism.",
      "publishedAt": "2025-01-01T18:03:07Z",
      "title": "The Latest: Death toll in New Orleans crash rises to 15, coroner says",
      "url": "https://apnews.com/e1b3b1c13802df69ce0f89e827aadbfc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9dd7ba52323845bc8b6e0a120df19301/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — An 18-year-old girl dreaming of becoming a nurse, a single mother, a father of two and a former Princeton football star suffered fatal injuries when the driver of a white pickup truck sped down Bourbon Street, packed with holiday revelers early Wednesday morning.",
      "publishedAt": "2025-01-01T22:58:04Z",
      "title": "An aspiring nurse, a football star, a single mother and a father of 2 killed in New Orleans attack",
      "url": "https://apnews.com/9f2fbcc3e48d8b391590f60969e80e61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d673e497d33f474898533cbcb489487c/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — Authorities say the driver of a pickup truck sped through a crowd of pedestrians gathered in New Orleans’ bustling French Quarter district early on New Year's Day, killing at least 15 people and injuring about 30 other revelers.",
      "publishedAt": "2025-01-01T14:40:46Z",
      "title": "What we know about a vehicle attack on pedestrians in New Orleans that killed at least 15",
      "url": "https://apnews.com/1685016388d65039ce62e720aab2ba14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27781d03090541dc8c31d68e7a65ac8d/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — The FBI says it recovered the stark black banner of the Islamic State extremist group from the truck that an American man from Texas smashed into New Year's partygoers in New Orleans' French Quarter Wednesday, killing 15 people.",
      "publishedAt": "2025-01-01T23:53:08Z",
      "title": "What is the Islamic State, and what attacks has it inspired by offshoots and lone wolves?",
      "url": "https://apnews.com/4bb6446c484737fbe9dd1b9c26a899a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb4c36bcbadd484f90d122a4c6f36728/2089.jpeg"
    },
    {
      "author": "TY O'NEIL and ANITA SNOW",
      "description": "LAS VEGAS (AP) — Firework mortars and camp fuel canisters were found stuffed into the back of the Tesla Cybertruck that exploded outside President-elect Donald Trump's Las Vegas hotel early Wednesday, killing a suspect inside the vehicle and sparking an intense investigation into possible terrorism.",
      "publishedAt": "2025-01-01T19:32:11Z",
      "title": "Firework mortars, gas cannisters stuffed inside Tesla that exploded outside Trump's Las Vegas hotel",
      "url": "https://apnews.com/ad4c171c7a6af64f08db93d9fdc2d749",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d5b0a1cb17947c188eb1e57ebad2300/1920.jpeg"
    },
    {
      "author": "BRETT MARTEL",
      "description": "NEW ORLEANS (AP) — The College Football Playoff quarterfinal at the Sugar Bowl between Georgia and Notre Dame was postponed a day because of an attack about a mile away from the Superdome early Wednesday, when authorities say a truck driver deliberately plowed into a New Year’s crowd and killed 15 people.",
      "publishedAt": "2025-01-01T17:18:46Z",
      "title": "Sugar Bowl CFP quarterfinal between Georgia and Notre Dame postponed after deadly truck attack",
      "url": "https://apnews.com/650b5773a37f0eaa2b03f4412c835674",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6a918ea979c41dfa1005f882c00adea/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "PASADENA, Calif. (AP) — Second chances don’t come around often in life, Ohio State coach Ryan Day told his players in a team meeting before the Rose Bowl.After a season in which they fell short at too many key moments, the Buckeyes all knew they had one of those second chances when they stepped onto this famous turf for another shot at the top-ranked, unbeaten Oregon Ducks.",
      "publishedAt": "2025-01-02T01:36:51Z",
      "title": "No. 6 Ohio State routs top-ranked Oregon 41-21 in the Rose Bowl, advances to CFP semifinals",
      "url": "https://apnews.com/8030a2a37d45c1a6d7dd15b51ae6c098",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35da7899addb4ff5a0d90666683936bc/3000.jpeg"
    },
    {
      "author": "PAUL NEWBERRY",
      "description": "ATLANTA (AP) — With Arizona State one play away from pulling off a comeback for the ages in the College Football Playoff, Quinn Ewers delivered a throw to Matthew Golden that saved the season for Texas.",
      "publishedAt": "2025-01-01T22:30:34Z",
      "title": "Texas avoids huge upset, beats Arizona State 39-31 in double overtime at Peach Bowl",
      "url": "https://apnews.com/8064c9423b5f5cfe94a4f6d5289d924a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0b6e0ec9bc44bd6bd50d4bb067573ee/2718.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — Before reaching the 1978 peace deal between Egypt’s Anwar Sadat and Israel’s Menachem Begin, Jimmy Carter managed months of intense preparation, high-stakes negotiations at Camp David and a field trip to the Gettysburg battlefield to demonstrate the consequences of war.",
      "publishedAt": "2025-01-01T05:04:25Z",
      "title": "Jimmy the Baptist: Carter redefined ‘evangelical,’ from campaigns to race and women’s rights",
      "url": "https://apnews.com/93343181bb9fac49723470c7e10561d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3257457bc654dfdaef5eb362564a458/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}