{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and MARK SCOLFORO",
      "description": "ALTOONA, Pa. (AP) — The man accused of killing UnitedHealthcare’s CEO struggled with deputies and shouted while being led into court Tuesday as new details emerged about his possible motivation behind the ambush.",
      "publishedAt": "2024-12-10T06:03:24Z",
      "title": "Suspect in the killing of UnitedHealthcare’s CEO struggles, shouts while entering courthouse",
      "url": "https://apnews.com/c68d0328f278d85fcf201ae89f634098",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecadcbe85c8f4808bcc92c46d704a384/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "Luigi Nicholas Mangione, the suspect in the fatal shooting of a healthcare executive in New York City, apparently was living a charmed life: the grandson of a wealthy real estate developer, valedictorian of his elite Baltimore prep school and with degrees from one of the nation's top private universities.",
      "publishedAt": "2024-12-10T20:33:13Z",
      "title": "From wealth and success to murder suspect, the life of Luigi Mangione took a hard turn",
      "url": "https://apnews.com/10ee2f70cd843a27940a9cf1a06edf55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9890bd8c61424415ac24dd8e98a0600f/3000.jpeg"
    },
    {
      "author": "SARAH BRUMFIELD and MARYCLAIRE DALE",
      "description": "The 26-year-old man charged in last week’s killing of UnitedHealthcare’s CEO appeared in a Pennsylvania courtroom Tuesday, where he was denied bail and his lawyer said he'd fight extradition to New York City, where the attack happened.",
      "publishedAt": "2024-12-04T20:03:08Z",
      "title": "Key details about the man accused of killing of UnitedHealthcare's CEO",
      "url": "https://apnews.com/79a9710978fc7adbb23d3fed4ea2f70d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72eefcdb17f548b0b8dc055e5e3fa660/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Eager to preserve President-elect Donald Trump ’s hush money conviction even as he returns to office, prosecutors are suggesting various ways forward — including one based on how some courts handle criminal cases when defendants die.",
      "publishedAt": "2024-12-10T18:33:55Z",
      "title": "DA suggests unusual idea for halting Trump’s hush money case while upholding his conviction",
      "url": "https://apnews.com/f4405fbd1b0c769a7f98c40aa892d94c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16351d6c50564bedbcf9c42dbaba8f4b/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel said Tuesday it had bombed more than 350 military sites in Syria during the previous 48 hours, targeting “most of the strategic weapons stockpiles” in the country. Israeli Prime Minister Benjamin Netanyahu said the wave of airstrikes in neighboring Syria was necessary to keep the weapons from being used against Israel following the Syrian government’s stunning collapse.",
      "publishedAt": "2024-12-10T06:57:57Z",
      "title": "Middle East latest: Israel bombs hundreds of sites across Syria as army pushes into border zone",
      "url": "https://apnews.com/90bc663aea10628735f8c1acd75664d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be1eaa2944684476af2fe62196bbef28/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and ROB GILLIES",
      "description": "NEW YORK (AP) — President-elect Donald Trump’s recent dinner with Canadian Prime Minister Justin Trudeau and his visit to Paris for the reopening of the Notre Dame Cathedral were not just exercises in policy and diplomacy.",
      "publishedAt": "2024-12-10T21:56:15Z",
      "title": "Donald Trump is returning to the world stage. So is his trolling",
      "url": "https://apnews.com/39ecae6554c7b4350e6a106354672eb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9220511589745a58955af716d184bae/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — A congressional task force investigating the attempts to kill Donald Trump during his presidential campaign is recommending changes to the Secret Service, including protecting fewer foreign leaders during the height of election season and considering moving the agency out of the Homeland Security Department.",
      "publishedAt": "2024-12-10T20:18:08Z",
      "title": "Report on attempts to kill Trump urges Secret Service to limit protection of foreign leaders",
      "url": "https://apnews.com/53a502179116240ef44fc9bdd6ead4d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1417478fb2a4b44b010129fd13101bf/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea's previous defense minister was formally arrested Wednesday over his alleged collusion with President Yoon Suk Yeol and others in imposing martial law last week, as authorities investigate whether their acts amount to rebellion.",
      "publishedAt": "2024-12-10T04:40:33Z",
      "title": "South Korea's ex-defense minister is formally arrested over brief imposition of martial law",
      "url": "https://apnews.com/c07fea5a701d5d708bfc236b3b81ee6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29ce27be5a2c4efca57c993a6b599906/1920.jpeg"
    },
    {
      "author": "JAE HONG, ERIC THAYER and CHRISTOPHER WEBER",
      "description": "MALIBU, Calif. (AP) — Thousands of Southern California residents were under evacuation orders and warnings Tuesday as firefighters battled a wind-driven wildfire in Malibu that burned near celebrities' seaside mansions, horse farms and Pepperdine University, where students watched as flames raced down hillsides and the sky turned deep red.",
      "publishedAt": "2024-12-10T09:05:14Z",
      "title": "Homes burn as wind-driven wildfire prompts evacuations in Malibu, California",
      "url": "https://apnews.com/ef9f6ea11815be64feaf2e5e5eb7588c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a91fad55c19846f1b695bfbd4a9cc895/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Americans should eat more beans, peas and lentils and cut back on red and processed meats and starchy vegetables, all while continuing to limit added sugars, sodium and saturated fat.That's the advice released Tuesday by an expert panel of nutritionists charged with counseling the U.S.",
      "publishedAt": "2024-12-10T19:52:22Z",
      "title": "More beans and less red meat: Nutritionists weigh in on US dietary guidelines",
      "url": "https://apnews.com/d6a9c6f0554f279497acb5714b3032b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3df8e7129495499f9caa13da9978ee91/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}