{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump's visit to his Scottish golf resorts has prompted a major police operation. Thousands of officers in reflective yellow vests are patrolling around his Turnberry golf course to provide security and manage planned protests. The operation is expected to cost Scottish taxpayers millions of pounds. The union representing officers is concerned about the strain on already overworked police. Policing for Trump's previous visit to the U.K. in 2018 cost about $19 million. Assistant Chief Constable Emma Bond says the operation involves local, national and specialist resources. Protests are planned in Edinburgh, Aberdeen and Dumfries.",
      "publishedAt": "2025-07-25T12:32:41Z",
      "title": "Scottish police ramp up security for Trump's visit",
      "url": "https://apnews.com/article/scotland-trump-security-golf-protest-police-cd2431a5ef8729be68567243f4435880",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2cb436/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2Fc7%2Fedc8177a58e76fccb4beead9473f%2F9ef84e391dda45f2bfe749cc524505a7"
    },
    {
      "author": null,
      "description": "Ceasefire talks between Hamas and Israel are expected to resume next week as the war in Gaza nears it’s 22nd month and experts warn Palestinians are on the brink of famine. Hamas official, Bassem Naim said on Friday that he was told an Israeli delegation would depart for consultations early next week. His comments come a day after the United States recalled its negotiating team from Qatar and after President Donald Trump’s special envoy, Steve Witkoff said Hamas’ latest response to the negotiations showed a “lack of desire” to reach a truce. The sides have held weeks of talks in Qatar reporting small signs of progress but no major breakthroughs.",
      "publishedAt": "2025-07-25T12:10:44Z",
      "title": "Hamas says ceasefire talks expected to resume next week after U.S. and Israel recall negotiators",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-07-25-2025-86ad3aef03cb43cbc8b05c8037e8c5c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ef638f/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F66%2Fb74bb38b98e3ad597721c9a10b20%2Ff68b934decb149e4b96ca007d93afad9"
    },
    {
      "author": null,
      "description": "The leaders of Britain, France, and Germany have demanded Israel allow unrestricted aid into Gaza to end a “humanitarian catastrophe.\" It comes after President Emmanuel Macron announced that France will recognize a Palestinian state, making it the first major Western power to do so. This decision highlights differences among the European allies on addressing the humanitarian crisis and ending the Israel-Hamas war. Germany and Britain support a Palestinian state in principle but have not followed France's lead. The situation in Gaza has caused alarm among Israel's allies, with calls for urgent action to address the crisis and build lasting peace.",
      "publishedAt": "2025-07-25T13:01:24Z",
      "title": "UK, French and German leaders press Israel over Gaza aid after Macron backs a Palestinian state",
      "url": "https://apnews.com/article/palestinian-state-france-uk-germany-gaza-macron-1f6874adbfe1d5be1fddce5a69c0f6ac",
      "urlToImage": "https://dims.apnews.com/dims4/default/740421f/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fde%2F4bb2d8fe3bdb84770cb682086537%2F6b6bcb0bb6f441dd8bb28ed1df2e0f80"
    },
    {
      "author": null,
      "description": "Florida Gov. Ron DeSantis says deportation flights from the remote Everglades immigration lockup known as ”Alligator Alcatraz″ began in the past few days. DeSantis said Friday that the flights operated by the Department of Homeland Security have transferred about 100 detainees from the immigration detention center to other countries. He expects that number to increase soon. Officials say two or three flights have happened, though they didn't say which countries those flights headed to. Critics have condemned the facility as cruel and inhumane, but DeSantis and other Republicans have defended it as part of the state’s aggressive push to support President Donald Trump’s crackdown on illegal immigration.",
      "publishedAt": "2025-07-25T14:27:41Z",
      "title": "Florida governor says deportation flights from 'Alligator Alcatraz' have started",
      "url": "https://apnews.com/article/alligator-alcatraz-desantis-immigration-264b9d3cf49be876ed6bcb32c07e23bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/936c00b/2147483647/strip/true/crop/5200x2925+0+369/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F24%2F3efc5ed46c9f9e5e55d2e70557e7%2F5240e3e2a6dd4758be381b5259c256cc"
    },
    {
      "author": null,
      "description": "Disgraced former U.S. Rep. George Santos is set to begin serving a seven-year prison sentence for the fraud charges that got him ousted from Congress. The New York Republican is slated to report to federal prison by 2 p.m. on Friday. It’s unclear where he’ll serve his time. Santos and his lawyers have declined to comment, as has the federal Bureau of Prisons. Santos pleaded guilty last summer to federal wire fraud and aggravated identity theft. He admitted that he deceived donors and stole the identities of nearly a dozen people to fund his congressional campaign. He served less than a year in Congress before being expelled in 2023.",
      "publishedAt": "2025-07-25T04:02:46Z",
      "title": "Ex-GOP Rep. George Santos to start 7-year prison term for fraud charges",
      "url": "https://apnews.com/article/george-santos-fraud-prison-29cdb8a9e9dfe7283d53091a6e20b1ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/42ea047/2147483647/strip/true/crop/4300x2419+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F94%2F4281e8d3fa1104babea46f18ca67%2Fbe27fd344308436cab27ce0e430dbd7d"
    },
    {
      "author": null,
      "description": "President Donald Trump has taken steps to keep Alina Habba as the top federal prosecutor in New Jersey. The Republican president withdrew Habba's nomination for the permanent position Thursday, allowing her to transition from interim U.S. attorney to acting U.S. attorney for 210 days. Habba announced her new role on social media, emphasizing her commitment to justice. Earlier in the week, judges had declined to extend Habba's tenure, appointing Desiree Leigh Grace instead. However, Grace was later removed by Attorney General Pam Bondi. Habba's office has been involved in several high-profile cases, including against Democratic Newark Mayor Ras Baraka and U.S. Rep. LaMonica McIver.",
      "publishedAt": "2025-07-25T15:33:59Z",
      "title": "Trump clears way to keep Habba as New Jersey's top federal prosecutor",
      "url": "https://apnews.com/article/new-jersey-us-attorney-prosecutor-habba-trump-93dfa4de0a68b15a659ef5272e6b193d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c43962/2147483647/strip/true/crop/7657x4307+0+399/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F4a%2F25704464fd56097956e96a80201c%2F5d3d33c9e8a74cdd93b60a8cc700796e"
    },
    {
      "author": null,
      "description": "Hulk Hogan's death has sparked mixed reactions, especially among Black wrestling fans and commentators. Many remember Hogan as a wrestling icon who broadened the sport's appeal. However his well-documented racism and controversial behavior have resurfaced. Some fans struggle with his legacy, while others celebrate his achievements. Yet, his past use of racial slurs and political endorsements have left many questioning his sincerity. This reflects broader issues of race in wrestling and American society. Some fans remain devoted to the sport despite the contradictions.",
      "publishedAt": "2025-07-25T16:37:06Z",
      "title": "Black wrestling fans reflect on Hulk Hogan's legacy on issues of race",
      "url": "https://apnews.com/article/hulk-hogan-death-black-americans-wrestling-legacy-bde576793d6de5954d8b903f33de5fb7",
      "urlToImage": "https://dims.apnews.com/dims4/default/cb3ef29/2147483647/strip/true/crop/2998x1686+0+132/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2Ff8%2F310123ee122bc74c6d704944d36a%2Ff2c6a8174bfb4b3b87fbb3ed6bb16b7d"
    },
    {
      "author": null,
      "description": "The U.S. Postal Service is turning 250. Saturday’s anniversary comes as the agency faces financial challenges. The postal service was established in 1775, when the Second Continental Congress appointed Benjamin Franklin as postmaster general. Its service predates the United States, launched nearly a year before the colonies declared their break from British rule. A key link between colonial leaders and the Continental Army, it also helped unify the fragmented colonies by spreading ideas of liberty and independence and would help shape the nation throughout its history. It still reaches nearly every American daily.",
      "publishedAt": "2025-07-25T14:02:16Z",
      "title": "US Postal Service turns 250. Here's how it has evolved over the years",
      "url": "https://apnews.com/article/us-postal-service-250th-anniversary-f3767d7216b8779a95a6b27cd8082737",
      "urlToImage": "https://dims.apnews.com/dims4/default/d6723da/2147483647/strip/true/crop/5062x2847+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F69%2Fc563a9c7b65d445465a6821573c1%2Fff582a3bcf664521a81c7ac4eea977ab"
    },
    {
      "author": null,
      "description": "U.S. stocks are hanging around their records and coasting toward the close of another winning week. The S&P 500 edged up by 0.1% Friday, coming off its latest all-time high. The Dow Jones Industrial Average added 71 points, and the Nasdaq composite was drifting around its record set the day before. Deckers helped lead the market after the company behind Ugg boots and Hoka shoes reported stronger profit and revenue for the spring than analysts expected. It helped offset a sharp drop for Intel, which said it would cut thousands of jobs as it tries to turn around its struggling fortunes.",
      "publishedAt": "2025-07-25T04:55:30Z",
      "title": "US stocks coast toward the finish of a record-setting week",
      "url": "https://apnews.com/article/markets-stocks-earnings-tariffs-trump-2882d3cf706eb9891bdc0600e46e6524",
      "urlToImage": "https://dims.apnews.com/dims4/default/d205e8c/2147483647/strip/true/crop/6920x3893+0+360/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F1a%2F21427f93507ad8515a28c1cfd8fc%2Fa1c191ba53ef4fcb891d09b810091b23"
    },
    {
      "author": null,
      "description": "“South Park” co-creator Trey Parker has briefly responded to anger from the White House over the season premiere of the animated series. The episode showed a naked President Donald Trump in bed with Satan. Parker said, “We're terribly sorry,” followed by a long, deadpan-comic stare. Parker was asked for his reaction to the fracas as he sat on the stage at San Diego’s Comic-Con International on Thursday. Earlier in the day, a White House said in a statement that the show “hasn't been relevant for 20 years” and is “desperate for attention.”",
      "publishedAt": "2025-07-25T02:57:41Z",
      "title": "'South Park' co-creator jokes he's 'terribly sorry' over premiere that drew White House anger",
      "url": "https://apnews.com/article/south-park-trump-492c0bf68acbe3d18682891301242ef6",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea93615/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2Fe6%2F3a4c0415afb010b74fc23348723b%2Fbdb2b3507bb149d2bc096c900ec11379"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}