{
  "articles": [
    {
      "author": "ERIC TUCKER, JIM MUSTIAN, KEVIN McGILL and JACK BROOK",
      "description": "NEW ORLEANS (AP) — The Army veteran who drove a pickup truck into a crowd of New Year’s revelers in New Orleans acted alone, the FBI said Thursday, reversing its position from a day earlier that he likely worked with others in the deadly attack that officials said was inspired by the Islamic State group.",
      "publishedAt": "2025-01-02T05:21:00Z",
      "title": "FBI says driver in New Orleans rampage acted alone and was '100%' inspired by Islamic State group",
      "url": "https://apnews.com/5bbf5fdc715c4d0d4c8764dd8da22720",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/899a7ebb44894a63a42e99f2d2f96b6f/1920.jpeg"
    },
    {
      "author": "MARTHA BELLISLE",
      "description": "An 18-year-old woman dreaming of becoming a nurse, a single mother, a father of two and a former Princeton football star were killed when the driver of a white pickup truck sped down Bourbon Street, packed with holiday revelers.",
      "publishedAt": "2025-01-01T22:58:04Z",
      "title": "An aspiring nurse, a football star, a single mother and a father of 2 killed in New Orleans attack",
      "url": "https://apnews.com/9f2fbcc3e48d8b391590f60969e80e61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6db7a3c9cbcb4773b74890e225574c2f/3000.jpeg"
    },
    {
      "author": "TARA COPP, ALANNA DURKIN RICHER, COLLEEN LONG and TY ONEIL",
      "description": "LAS VEGAS (AP) — The highly decorated Army soldier inside a Tesla Cybertruck packed with fireworks that exploded outside Trump International Hotel in Las Vegas shot himself in the head just before detonation, authorities said Thursday.",
      "publishedAt": "2025-01-02T15:38:48Z",
      "title": "Soldier shot self in head before Cybertruck exploded outside Trump's Las Vegas hotel, officials say",
      "url": "https://apnews.com/5c5a8fd13a50e2bcde46370ae926d427",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09b16e6bbc0a44d39f281f1ec114b03b/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean investigators left the president's official residence after a nearly six-hour standoff during which he defied their attempt detain him in the latest confrontation of a political crisis that has paralyzed South Korean politics and seen two heads of state impeached in under a month.",
      "publishedAt": "2025-01-03T03:51:55Z",
      "title": "South Korea's impeached president defies warrant after hourslong standoff",
      "url": "https://apnews.com/c8dc1758647979455dbf0d56e70369a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1317cc951404473286d81faf5c52d262/1920.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — A harrowing chapter in American history remains shrouded in mystery: Who planted pipe bombs outside offices of the Democratic and Republican national committees in Washington on the eve of the attack on the Capitol?",
      "publishedAt": "2025-01-02T23:05:29Z",
      "title": "FBI releases new video of a suspect planting a pipe bomb near DNC offices on eve of the Capitol riot",
      "url": "https://apnews.com/ea85b6fe5fe9140f1c75b7ee8c0554b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae06fd147b8445739015fdf0fc37a0f5/1920.jpeg"
    },
    {
      "author": "JAIMIE DING and DAMIAN DOVARGANES",
      "description": "FULLERTON, Calif. (AP) — Two people died and 18 were injured Thursday when a small plane crashed through the roof of a sprawling furniture manufacturing building in Southern California where at least 200 people were working, police said.",
      "publishedAt": "2025-01-02T23:16:57Z",
      "title": "2 dead and 18 injured in Southern California plane crash",
      "url": "https://apnews.com/08ec23f1c117be7bc07fc9b8f4064f91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dad700e83563422a9baec3d21ccc188c/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The federal courts will not refer allegations that Supreme Court Justice Clarence Thomas may have violated ethics laws to the Justice Department, the judiciary's policymaking body said Thursday.",
      "publishedAt": "2025-01-03T01:16:07Z",
      "title": "Federal courts won't refer Supreme Court Justice Clarence Thomas to attorney general over ethics",
      "url": "https://apnews.com/f9c9fee5554e5859e7f6185698fb4f76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd09b6cd0ee84c57bfe484c73799a8cb/3000.jpeg"
    },
    {
      "author": "BRETT MARTEL",
      "description": "NEW ORLEANS (AP) — Georgia and Notre Dame fans packed a plaza adjacent to the Superdome and enjoyed music under clear skies — under the watch of snipers on rooftops — before filtering into the stadium for Thursday's College Football Playoff quarterfinal at the Sugar Bowl.",
      "publishedAt": "2025-01-02T17:59:23Z",
      "title": "Postponed Sugar Bowl played with enhanced security about 36 hours after terror attack in New Orleans",
      "url": "https://apnews.com/d6142ce05560f597c65dd99846e8ac4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d673a877b7c44f728c0e32297f269366/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and DARLENE SUPERVILLE",
      "description": "President Joe Biden on Thursday awarded the second highest civilian medal to Liz Cheney and Bennie Thompson, leaders of the congressional investigation into the Capitol riot who Donald Trump has said should be jailed for their roles in the inquiry.",
      "publishedAt": "2025-01-02T05:00:23Z",
      "title": "Biden awards the 2nd highest civilian award to leaders of the Jan. 6 committee and 18 others",
      "url": "https://apnews.com/f725b7003ea11239b90962a8cf0d5305",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/699bc704c7b1468bb6ce8d81b697caf6/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Wayne Osmond, a singer, guitarist and founding member of the million-selling family act The Osmonds, who were known for such 1970s teen hits as “One Bad Apple,\" \"Yo-Yo\" and “Down By the Lazy River,” has died.",
      "publishedAt": "2025-01-02T22:22:22Z",
      "title": "Wayne Osmond, singer and guitarist for The Osmonds, is dead at 73",
      "url": "https://apnews.com/fd72d6fafae7e40a51acd42bcda53c61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12f93074747949b9acbe38f38abd4c9c/1677.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}