{
  "articles": [
    {
      "author": "BELA SZANDELSZKY, PETR DAVID JOSEK and PHILIPP JENNE",
      "description": "BANSKA BYSTRICA, Slovakia (AP) — The Slovak interior minister said Thursday that a “lone wolf” has been charged in the shooting that seriously wounded Prime Minister Robert Fico and prompted soul-searching among leaders in the deeply divided society.",
      "publishedAt": "2024-05-16T07:05:22Z",
      "title": "Slovak interior minister says 'lone wolf' has been charged with shooting prime minister",
      "url": "https://apnews.com/23faba11c0f371ef0f69a34861337ae0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10ee483690c74c00a52f6be1b533c8f0/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. military finished installing a floating pier for the Gaza Strip on Thursday, with officials poised to begin ferrying badly needed humanitarian aid into the enclave besieged over seven months of intense fighting in the Israel-Hamas war.",
      "publishedAt": "2024-05-16T06:03:20Z",
      "title": "US military says Gaza Strip pier project is completed, aid to soon flow as Israel-Hamas war rages on",
      "url": "https://apnews.com/9414c4148285917f1c858b9590117a84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3f3551d7f84487f89642670d377dd8e/3000.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE (AP) — The United Nations’ top court opens two days of hearings on Thursday into a request from South Africa to press Israel to halt its military operation in the southern Gaza city of Rafah, where more than half of Gaza’s population has sought shelter.",
      "publishedAt": "2024-05-16T06:03:14Z",
      "title": "The top UN court is holding hearings on the Israeli military's incursion into Rafah",
      "url": "https://apnews.com/a69d2abf0f4171c100eb86ee05552514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5ba3dcc5006403f97416deafc2122b8/3000.jpeg"
    },
    {
      "author": "BELA SZANDELSZKY, PETR DAVID JOSEK and PHILIPP JENNE",
      "description": "BANSKA BYSTRICA, Slovakia (AP) — The Slovak interior minister said Thursday that a “lone wolf” has been charged in the shooting that seriously wounded Prime Minister Robert Fico and prompted soul-searching among leaders in the deeply divided society.",
      "publishedAt": "2024-05-16T07:05:22Z",
      "title": "Slovak interior minister says 'lone wolf' has been charged with shooting prime minister",
      "url": "https://apnews.com/23faba11c0f371ef0f69a34861337ae0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10ee483690c74c00a52f6be1b533c8f0/1920.jpeg"
    },
    {
      "author": "EMILY WANG FUJIYAMA, CHRISTOPHER BODEEN and HUIZHONG WU",
      "description": "BEIJING (AP) — Russian President Vladimir Putin thanked Chinese leader Xi Jinping for his effort to resolve the Ukraine conflict at a Beijing summit Thursday, where the two leaders reaffirmed a “no-limits” partnership that has grown deeper as both countries face deepening tensions with the west.",
      "publishedAt": "2024-05-15T12:00:15Z",
      "title": "China and Russia reaffirm ties as Moscow presses offensive in Ukraine",
      "url": "https://apnews.com/3212ef85d8318cf853f956173f3a682a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9b2bdd340a645df9c466ada4efc36e9/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, JENNIFER PELTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — With prosecutors' hush money case against Donald Trump barreling toward its end, their star witness will be back in the hot seat Thursday as defense lawyers try to chip away at Michael Cohen's crucial testimony implicating the former president.",
      "publishedAt": "2024-05-16T04:01:37Z",
      "title": "Will jurors believe Michael Cohen? Defense keys on witness' credibility at Trump's hush money trial",
      "url": "https://apnews.com/ec08be1219703deb3cd10604844deacb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b0dc4f1fea84bf183a00d6860c83c58/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — The nonpartisan Commission on Presidential Debates, which has planned presidential faceoffs in every election since 1988, has an uncertain future after President Joe Biden and former President Donald Trump struck an agreement to meet on their own.",
      "publishedAt": "2024-05-16T04:13:53Z",
      "title": "The Commission on Presidential Debates faces an uncertain future after Biden and Trump bypassed it",
      "url": "https://apnews.com/01a7cfe1817dc110d14635536f1f86b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d8c90cc8a94d8db5b715aec54772d4/3000.jpeg"
    },
    {
      "author": "MARGIE MASON and ROBIN McDOWELL",
      "description": "PHOENIX (AP) — Blas Sanchez was nearing the end of a 20-year stretch in an Arizona prison when he was leased out to work at Hickman’s Family Farms, which sells eggs that end up in the supply chains of huge companies like McDonald’s, Target and Albertsons.",
      "publishedAt": "2024-05-16T10:06:09Z",
      "title": "US prisoners are being assigned dangerous jobs. But what happens if they are hurt or killed?",
      "url": "https://apnews.com/0ff52ff1735d7e9f858248177a2a60c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ac66f41f6974c04acfc9061fb2e2ca8/1920.jpeg"
    },
    {
      "author": "TARA COPP and CLAUDIA LAUER",
      "description": "WASHINGTON (AP) — In 2020, the top enlisted leader of the Air Force went public with his fear of waking up to the news that a Black airman had been killed by a white police officer.",
      "publishedAt": "2024-05-16T04:11:33Z",
      "title": "Florida deputy's killing of Black airman renews debate on police killings and race",
      "url": "https://apnews.com/c7ed2a69f5a3c2365486e50750fe6e5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd7e9891eb75468986a1484888181978/3000.jpeg"
    },
    {
      "author": null,
      "description": "Violence raged across New Caledonia for the third consecutive day Thursday hours after France imposed a state of emergency in the French Pacific territory, boosting security forces’ powers to quell deadly unrest in the archipelago where some residents have long sought to break free from France.",
      "publishedAt": "2024-05-16T10:03:47Z",
      "title": "Violence rages in New Caledonia as France rushes emergency reinforcements to its Pacific territory",
      "url": "https://apnews.com/8c05588d36cdafebaa7df9392c20f175",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a7b4a1104014c05b2e26e43e2ff50c9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}