{
  "articles": [
    {
      "author": "RALPH D. RUSSO",
      "description": "After the first shake-up of the college football season, the Southeastern Conference grabbed six of the top seven spots in the AP Top 25 — a first in the 88-year history of the rankings — and Notre Dame tumbled all the way to No.",
      "publishedAt": "2024-09-08T17:59:42Z",
      "title": "AP Top 25: SEC grabs six of the first seven spots in rankings as Notre Dame tumbles to No. 18",
      "url": "https://apnews.com/c6b37bc9a47827093f07e2c68c9d8b0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9877087c57ae4bf9a69282394c4d5600/2643.jpeg"
    },
    {
      "author": "JALAL BWAITEL and JULIA FRANKEL",
      "description": "KHIRBET ZANUTA, West Bank (AP) — An entire Palestinian community fled their tiny West Bank village last fall after repeated threats from Israeli settlers with a history of violence.",
      "publishedAt": "2024-09-08T04:25:26Z",
      "title": "Chased away by Israeli settlers, these Palestinians returned to a village in ruins",
      "url": "https://apnews.com/b426fa223791d88e97bcd48d3e618081",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f2b93ed6ffa4b048e1eed715b21eec4/3000.jpeg"
    },
    {
      "author": "MAHMOUD ILLEAN and NATALIE MELZER",
      "description": "ALLENBY CROSSING, West Bank (AP) — Three Israelis were shot and killed Sunday at the border crossing between the West Bank and Jordan, Israeli officials said, in what appeared to be an attack linked to the 11-month-old war in Gaza.",
      "publishedAt": "2024-09-08T07:27:02Z",
      "title": "Shooting attack at the West Bank-Jordan border crossing kills 3 Israelis",
      "url": "https://apnews.com/5278cf1f7ec254fb6ecca0f2758e7e3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fe728306f8a4278aa726dcd6bfa3d3d/3000.jpeg"
    },
    {
      "author": "ANDREW DeMILLO",
      "description": "Huddling for safety in classrooms as gunfire rang out, students at Apalachee High School texted or called their parents to let them know what was happening and send what they thought could be their final messages.",
      "publishedAt": "2024-09-08T11:31:39Z",
      "title": "Georgia school shooting highlights fears about classroom cellphone bans",
      "url": "https://apnews.com/cb68f601be5193bfeb62e9fd065978a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eddbb56bfb97413e8e811e486e7741eb/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — One of the biggest challenges for Democratic presidential nominee Kamala Harris in the final stretch of the campaign is introducing herself to voters before her Republican rival, Donald Trump, has a chance to define her.",
      "publishedAt": "2024-09-08T12:31:30Z",
      "title": "Harris turns to her favorite foods in effort show a more private side and connect with voters",
      "url": "https://apnews.com/82956ec65fcf24e6c57712716845d2af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62216df09f8043dc9a3ca429d961655e/3000.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS and SUMAN NAISHADHAM",
      "description": "On a scorching day in June 2013, the Grand Canyon discouraged hikers from making a long trek to the bottom because there would be no potable water. A set of historic cabins and bunks also would be closed overnight because of a water pipeline break.",
      "publishedAt": "2024-09-08T11:33:43Z",
      "title": "Grand Canyon's main water line has broken dozens of times. Why is it getting a major fix only now?",
      "url": "https://apnews.com/6cdbf12d42f89fc68bd3bdbe77bfe14c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2219134e09464b569223f3eb92bf753a/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VANIMO, Papua New Guinea (AP) — Pope Francis traveled to the remote jungles of Papua New Guinea on Sunday to celebrate the Catholic Church on the peripheries, bringing with him a ton of medicine, musical instruments and a message of love for the people who live there.",
      "publishedAt": "2024-09-07T23:11:56Z",
      "title": "Pope arrives in the remote jungles of Papua New Guinea with a ton of humanitarian aid and toys",
      "url": "https://apnews.com/33fb0e7ca68a8c9595812271586388d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/415ef4dbc3704b5aa414047867bbab40/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson is heeding the demands of the more conservative wing of his Republican conference and has teed up a vote this week on a bill that would keep the federal government funded for six more months and require states to obtain proof of citizenship, such as a birth certificate or passport, when registering a person to vote.",
      "publishedAt": "2024-09-08T11:32:49Z",
      "title": "House Republicans push to link government funding to a citizenship check for new voters",
      "url": "https://apnews.com/6c97f372a7d27c40deea15a948178794",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cc5d8831bc84a4daddfe3b9166a6239/3000.jpeg"
    },
    {
      "author": "JORGE RUEDA, JOSHUA GOODMAN and JOSEPH WILSON",
      "description": "CARACAS, Venezuela (AP) — Former Venezuelan presidential candidate Edmundo González arrived in Spain on Sunday after fleeing into exile in as part of a negotiated deal with Nicolas Maduro's government that dealt a major blow to millions who placed their hopes in his opposition campaign.",
      "publishedAt": "2024-09-08T03:30:27Z",
      "title": "Opposition presidential candidate González flees Venezuela for asylum in Spain",
      "url": "https://apnews.com/749131a560dd9d762e04e201e43b9495",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e2a6d750a154880b2763dd0d37fa016/3000.jpeg"
    },
    {
      "author": null,
      "description": "ALGIERS, Algeria (AP) — President Abdelmadjid Tebboune has been named the winner of Algeria's presidential election, granting him another term leading the gas-rich North African nation five years after pro-democracy protests led to the ouster of his predecessor.",
      "publishedAt": "2024-09-08T16:47:32Z",
      "title": "President Abdelmadjid Tebboune is re-elected in a landslide in gas-rich Algeria",
      "url": "https://apnews.com/97fac94807a870b6cbd39fc4645b68b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa3de7a5ff184068bd611c686fd964cc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}