{
  "articles": [
    {
      "author": "WILL WEISSERT and COLLEEN LONG",
      "description": "PHOENIX (AP) — Kamala Harris said Thursday that Donald Trump’s comment that he would protect women whether they “like it or not” shows that the Republican presidential nominee does not understand women’s rights “to make decisions about their own lives, including their own bodies.\"",
      "publishedAt": "2024-10-31T15:48:42Z",
      "title": "Kamala Harris says Trump's comment on women 'is offensive to everybody'",
      "url": "https://apnews.com/f5903d49488ebc733d7ba5812b36f935",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0fff418c1014d9e81ee5cb9fb2e2dff/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "GLENDALE, Ariz. (AP) — Former President Donald Trump launched another attack on former Rep. Liz Cheney late Thursday, calling the Republican former Wyoming congresswoman a “war hawk” and suggesting she might not be as willing to send troops to fight if she had guns pointed at her.",
      "publishedAt": "2024-11-01T06:07:10Z",
      "title": "Trump says Liz Cheney might not be such a 'war hawk' if she had guns pointed at her",
      "url": "https://apnews.com/14e2037b4fd8d22acf64c8b888ce296d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e54d4939586f403da12569a671f6988f/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "WASHINGTON (AP) — White House press officials altered the official transcript of a call in which President Joe Biden appeared to take a swipe at supporters of Donald Trump, drawing objections from the federal workers who document such remarks for posterity, according to two U.S.",
      "publishedAt": "2024-11-01T01:33:59Z",
      "title": "AP sources: White House altered record of Biden's 'garbage' remarks despite stenographer concerns",
      "url": "https://apnews.com/326e2f516a94a470a423011a946b6252",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53901cead5554d55a03b426693981c22/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — Americans on Friday will get their last major look at the state of the U.S. economy — the October jobs report — just four days before Election Day. The view, though, is likely to be obscured by the effects of strikes and hurricanes that left many workers temporarily off payrolls.",
      "publishedAt": "2024-11-01T04:01:26Z",
      "title": "Final jobs report before election will likely offer a blurred view of labor market",
      "url": "https://apnews.com/dcf54cd3b40f01ca78bccf86cd8e13d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5359c06dcd94fc6b6deac5f487bb25b/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel’s air force pounded Beirut’s southern suburb of Dahiyeh overnight, destroying dozens of buildings in several neighborhoods, Lebanon’s state-run National News Agency said Friday.",
      "publishedAt": "2024-11-01T06:17:14Z",
      "title": "Middle East latest: Israel pounds Beirut suburb Dahiyeh with airstrikes overnight",
      "url": "https://apnews.com/6ea222bd6dbe87123934833e92626aeb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/902137d26cbf4801908e1ca904e3b1dd/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY, JULIA FRANKEL and JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — More than a year into a war that has ricocheted across the Middle East, Israeli troops are still battling Hamas in the most heavily destroyed and isolated part of the Gaza Strip.",
      "publishedAt": "2024-11-01T05:01:18Z",
      "title": "Israel fights a seemingly endless war in Gaza's most devastated region",
      "url": "https://apnews.com/20628253b26a2bdcf3c844850f20da38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8df2e139e5184c91bdbc6eae5494a2ec/3000.jpeg"
    },
    {
      "author": "MARGIE MASON and ROBIN McDOWELL",
      "description": "HUNTINGTON, W.Va. (AP) — It was after midnight when she crept down the narrow, dimly lit stairs carrying a bag of dirty laundry. She crossed under a patchwork of pipes and ducts to the far back corner of the basement, as she had done many times before.",
      "publishedAt": "2024-11-01T03:05:53Z",
      "title": "Prison work assignments used to lure and rape female inmates. Guards sometimes walk free",
      "url": "https://apnews.com/001a816334d8745fd29557f02b2f0e5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3e43bc70f544a1bb4cf6cbad881f362/3000.jpeg"
    },
    {
      "author": "TERESA MEDRANO",
      "description": "MADRID (AP) — Three days after historic flash floods swept through several towns in southern Valencia, in eastern Spain, the initial shock was giving way to anger, frustration and a wave of solidarity on Friday.",
      "publishedAt": "2024-11-01T09:33:35Z",
      "title": "Spanish residents appeal for help, 3 days after historic floods left at least 158 dead",
      "url": "https://apnews.com/c49df08e233b3f791ed27921acdbb752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6a4a434a1074dd0a1b9ac1fa3f119fc/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russia's top diplomat on Friday hosted his North Korean counterpart for talks amid reports that Pyongyang has sent thousands of troops to Russia to support its military in the war in Ukraine.",
      "publishedAt": "2024-11-01T10:04:39Z",
      "title": "North Korea's top diplomat is in Moscow as Pyongyang sent troops to help the war on Ukraine",
      "url": "https://apnews.com/5cb448f2f7b51a2bf60169f6c6bc3376",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1483dcd4dce846ba9ac7cb7da061369d/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — The nation's deep partisan divisions extend to trust in the vote tallies for this year's election, as a new poll finds that Republicans are much more skeptical than Democrats that ballots will be counted accurately.",
      "publishedAt": "2024-11-01T04:01:44Z",
      "title": "AP-NORC poll finds skepticism of nationwide election tallies, especially among Republicans",
      "url": "https://apnews.com/51d67f8c0ceb3921b6cc9c1a61464f13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9d99bb862e84af2a2efc7f7808d2550/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}