{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JOSEF FEDERMAN and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Internet and phone services collapsed in the Gaza Strip under intensified Israeli bombardment Friday night, largely cutting off its 2.3 million people from the outside world and each other, as Israel’s military said it was “expanding” ground operations in the besieged territory.",
      "publishedAt": "2023-10-27T06:40:44Z",
      "title": "Israeli air and ground strikes intensify in Gaza; internet collapse cuts territory off from outside",
      "url": "https://apnews.com/e41b5b12e8cdf9db62395314d9a782b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d2e3eb5888c48ad9b588b98e9a2f8ae/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Israeli military says its ground forces will expand their activities in Gaza Friday night.",
      "publishedAt": "2023-10-27T07:31:53Z",
      "title": "Live updates | Israeli military says its ground forces are expanding activity in Gaza",
      "url": "https://apnews.com/af48f964636c8a2836e02e78ff01ec4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c14a86a6aee482ead988f4808460f71/1920.jpeg"
    },
    {
      "author": "DAVID SHARP, PATRICK WHITTLE, HOLLY RAMER and MICHELLE R. SMITH",
      "description": "LEWISTON, Maine (AP) — Authorities scoured the woods and hundreds of acres of family-owned property, sent dive teams with sonar to the bottom of a river and scrutinized a possible suicide note Friday in the second day of their intensive search for an Army reservist accused of fatally shooting 18 people and wounding 13 at a bowling alley and a bar in Maine.",
      "publishedAt": "2023-10-27T05:03:11Z",
      "title": "Authorities scour woods, water and homes on Day 2 of search for suspect in Maine mass shooting",
      "url": "https://apnews.com/fed5ab0aaee9d7d4c0f0fccb3d301bb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca53fb90cfba4f35b81099480ac8b5e4/1920.jpeg"
    },
    {
      "author": "HOLLY RAMER, LISA RATHKE and PATRICK WHITTLE",
      "description": "The 18 people killed in two mass shootings in Lewiston, Maine, included a volunteer youth bowling coach known for encouraging children and a bar manager whose father said his son tried to confront the shooter and died “a hero.”",
      "publishedAt": "2023-10-26T22:01:23Z",
      "title": "Volunteer youth bowling coach and 'hero' bar manager are among the Maine shooting victims",
      "url": "https://apnews.com/1be7d14e90ef6c91ca23819163d29f3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e280f098ecc421ca846132fe8e045a4/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Former President Donald Trump is set to take the stand Nov. 6 in the civil business fraud case against him, facing prosecutors following testimony from his three eldest children, New York state lawyers said Friday.",
      "publishedAt": "2023-10-27T04:12:45Z",
      "title": "Donald Trump is set to testify Nov. 6 in civil fraud trial. Daughter Ivanka also will testify",
      "url": "https://apnews.com/c7018a92f3a2cb2496a55ad1cacf2412",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e9b620e984f49e59f57a59d8024cf50/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — U.S. fighter jets launched airstrikes early Friday on two locations in eastern Syria linked to Iran's Revolutionary Guard Corps, the Pentagon said, in retaliation for a slew of drone and missile attacks against U.S.",
      "publishedAt": "2023-10-27T02:08:36Z",
      "title": "US fighter jets strike Iran-linked sites in Syria in retaliation for attacks on US troops",
      "url": "https://apnews.com/af3c7a0f069b8c8b08f6feaa0e165d6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5154afd136a40aea3829dd15ae4df05/2945.jpeg"
    },
    {
      "author": "CORA LEWIS",
      "description": "NEW YORK (AP) — About 2 in 3 Americans say their household expenses have risen over the last year, but only about 1 in 4 say their income has increased in the same period, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-10-27T04:09:00Z",
      "title": "Many Americans say their household expenses are outpacing earnings this year, AP-NORC poll shows",
      "url": "https://apnews.com/dd4c88e2076d1fd3f85c51fb8992583b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a30d1b7f36024bab8c7f17d02458c577/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "ACAPULCO, Mexico (AP) — Officials said Friday that that they are moving supplies into Acapulco and getting people out of the devastated city three days after Hurricane Otis pummeled Mexico's Pacific coast.",
      "publishedAt": "2023-10-27T04:42:33Z",
      "title": "Mexican officials say supplies are getting into Acapulco and people are getting out",
      "url": "https://apnews.com/4c33ae4a3ebcf272eb05b89ae898bb28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9006f3593a6b42e9b7a83cbbb032ae50/1920.jpeg"
    },
    {
      "author": "DIDI TANG and MATTHEW LEE",
      "description": "WASHINGTON (AP) — President Joe Biden met Friday with China’s top diplomat, a conversation that’s viewed as the precursor to a potential sit-down with Chinese President Xi Jinping next month.The encounter with Chinese Foreign Minister Wang Yi was the latest in a series of high-level contacts between the two countries as they explore the possibility of stabilizing an increasingly tense relationship at a time of conflict in Ukraine and Israel.",
      "publishedAt": "2023-10-27T04:09:33Z",
      "title": "Biden talks with Chinese foreign minister as he prepares for potential meeting with Xi",
      "url": "https://apnews.com/fbaef1a1afb599807a8fe47f3600a384",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/020892d9003f40b181c300908afcec80/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis has ordered the Vatican to reopen the case of a well-known priest-artist accused of sexually, psychologically and spiritually abusing adult women, and removed the statute of limitations that had previously prevented a church trial based on their claims.",
      "publishedAt": "2023-10-27T11:27:32Z",
      "title": "Pope orders Vatican to reopen case of priest accused of adult abuse but allowed to keep ministering",
      "url": "https://apnews.com/cb8e67c99fd8ecfb8517f6282765d70e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4dc50ec8cdb84507b83f7c2077fe68f1/2307.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}