{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and MARK SCOLFORO",
      "description": "ALTOONA, Pa. (AP) — After UnitedHealthcare’s CEO was gunned down on a New York sidewalk, police searched for the masked gunman with dogs, drones and scuba divers.",
      "publishedAt": "2024-12-10T06:03:24Z",
      "title": "Suspect in UnitedHealthcare CEO killing charged with murder in New York, court records show",
      "url": "https://apnews.com/c68d0328f278d85fcf201ae89f634098",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/813221512bde449397bbab1345761b33/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB, BASSEM MROUE and TIA GOLDENBERG",
      "description": "DAMASCUS, Syria (AP) — Syria's prime minister said Monday that most cabinet ministers were back at work after rebels overthrew President Bashar Assad, but some state workers failed to return to their jobs, and a United Nations official said the country's public sector had come “to a complete and abrupt halt.\"",
      "publishedAt": "2024-12-09T08:06:03Z",
      "title": "Syrian government services come to a 'complete halt' as state workers stay home after rebel takeover",
      "url": "https://apnews.com/a8ecceee72a66f4d7e6168d6a21b8dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcd4c4e6c08041ba82be157bebb149cc/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "DAMASCUS, Syria (AP) — They came from all over Syria, tens of thousands. The first place they rushed to after the fall of their longtime tormentor, former President Bashar Assad, was here: Saydnaya Prison, a place so notorious for its horrors it was long known as “the slaughterhouse.”",
      "publishedAt": "2024-12-10T05:05:04Z",
      "title": "Thousands scour Syria's most horrific prison but find no sign of their loved ones",
      "url": "https://apnews.com/9f533d54b4df72f97416f90921dd2a9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de554b3c402a49d883782399693bf58a/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Massive U.S. airstrikes on Islamic State militants in Syria were meant in part as a message to the group and a move to ensure that it doesn't try to take advantage of the chaos following the overthrow of President Bashar Assad's government.",
      "publishedAt": "2024-12-10T05:05:26Z",
      "title": "Here's how the US is countering the Islamic State group during Syria's upheaval",
      "url": "https://apnews.com/b4e72b3fd8fff4e9364597a1ca817803",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8d6df0069224e4bb4f43acbfffb3af5/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli warplanes pounded military sites in Syria after Israeli troops seized a border buffer zone following the collapse of President Bashar Assad’s rule.",
      "publishedAt": "2024-12-10T06:57:57Z",
      "title": "Middle East latest: Netanyahu testifies in his corruption trial as warplanes hit sites in Syria",
      "url": "https://apnews.com/90bc663aea10628735f8c1acd75664d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1650cbfb41ee4e2194210bb4e8bf8ba0/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — President-elect Donald Trump's pick for intelligence chief, Tulsi Gabbard, faced fresh scrutiny Monday on Capitol Hill about her proximity to Russian-ally Syria amid the sudden collapse of that country's hardline Assad rule.",
      "publishedAt": "2024-12-09T23:24:45Z",
      "title": "Tulsi Gabbard, Trump's pick for intel chief, faces questions on Capitol Hill amid Syria fallout",
      "url": "https://apnews.com/44d0150e7d251946b60fc7f6799c4a74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6057e099a8241db9ae4ab336a5dc2c2/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT, JULIET LINDERMAN and MARTHA MENDOZA",
      "description": "DES MOINES, Iowa (AP) — A week after President-elect Donald Trump’s victory, Elon Musk said his political action committee would “play a significant role in primaries.”",
      "publishedAt": "2024-12-10T05:02:14Z",
      "title": "Elon Musk warns Republicans against standing in Trump's way — or his",
      "url": "https://apnews.com/7e26c829af224a1f9d67c27cea085e68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7e2b0156e9c44ca9dbce3b4acd322a4/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER, ILLIA NOVIKOV and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The grinding war between Ukraine and its Russian invaders has escalated ahead of Donald Trump's inauguration, with President Joe Biden rushing out billions of dollars more in military aid before U.S.",
      "publishedAt": "2024-12-10T05:07:59Z",
      "title": "Biden is rushing aid to Ukraine. Both sides are digging in. And everyone is bracing for Trump",
      "url": "https://apnews.com/efbcff8ed068e621055e8fa70b5905e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b34a7af614a24239b810eb78f2e478cf/3000.jpeg"
    },
    {
      "author": "EVENS SANON and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A gang leader who controls a key port in Haiti's capital is accused of massacring older people and Vodou religious leaders in his community to avenge his son's death, according to the government and human rights organizations that estimate more than 100 were killed.",
      "publishedAt": "2024-12-09T16:55:33Z",
      "title": "A gang leader in Haiti is accused of massacring older people to avenge his son's death",
      "url": "https://apnews.com/97c1206c79648b61b43fd6be6ee1079a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c88c4f854f044528b6c2d19d84be974/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A Marine veteran who used a chokehold on an agitated subway rider was acquitted on Monday in a death that became a prism for differing views about public safety, valor and vigilantism.",
      "publishedAt": "2024-12-09T05:02:32Z",
      "title": "Veteran Daniel Penny is acquitted in NYC subway chokehold case over Jordan Neely's death",
      "url": "https://apnews.com/305a4eb324f6466a67bdb6734a7b999a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6780f5f57484cdab7380b12ff322caf/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}