{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israel airstrike in Gaza killed at least 18 people, all from the same family, on Saturday, hours after mediators expressed optimism for an imminent cease-fire deal between Israel and Hamas.",
      "publishedAt": "2024-08-17T10:00:23Z",
      "title": "An Israeli airstrike kills 18 members of a family in Gaza as mediators hope for a cease-fire",
      "url": "https://apnews.com/07e5f3d968cb09613609eb1086e26e91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/167c0a0bd6434f17ab6de3b01aa28f6f/1920.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "DEARBORN, Mich. (AP) — Of the thousands of delegates expected to gather Monday at the Democratic National Convention, just 36 will belong to the “uncommitted” movement sparked by dissatisfaction with President Joe Biden's handling of the Israel-Hamas war.",
      "publishedAt": "2024-08-17T04:03:54Z",
      "title": "The pro-Palestinian 'uncommitted' movement is at an impasse with top Democrats as the DNC begins",
      "url": "https://apnews.com/93f9edb25a602c95ee226bd2645e4298",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dee7ddc7fc024de99e9112f121d308fa/1920.jpeg"
    },
    {
      "author": "MARIANA MARTÍNEZ BARBA",
      "description": "MEXICO CITY (AP) — Hurricane Ernesto made landfall on the tiny British Atlantic territory of Bermuda early Saturday as residents continued to hunker down. The hurricane is now exhibiting a large rain-free center region that is just about to move past Bermuda, according to the National Hurricane Center.",
      "publishedAt": "2024-08-17T09:06:25Z",
      "title": "Hurricane Ernesto moves through Bermuda as a category 1 storm",
      "url": "https://apnews.com/c7dea3a54812e4353ee2dc2bd38b7e49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35beb656ee8f406fafb2dd5185315c29/1920.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "Former U.S. Rep. George Santos is expected to plead guilty to multiple counts in his federal fraud case, according to a person familiar with the matter.",
      "publishedAt": "2024-08-17T17:21:49Z",
      "title": "Ex-Rep. George Santos expected to plead guilty to multiple counts in fraud case, AP source says",
      "url": "https://apnews.com/3225ffb42dab57f719cbe066be124210",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80318d01ce0a4e19ae39562f935b8aa1/3000.jpeg"
    },
    {
      "author": "GISELA SALOMON and REBECCA SANTANA",
      "description": "MIAMI (AP) — Roberto Garcia crossed the border from Mexico in 2009 looking for a better life. For the past eight years, he has been married to an American woman, and they have three kids who are all American citizens.",
      "publishedAt": "2024-08-17T13:01:56Z",
      "title": "Immigrants prepare for new Biden protections with excitement and concern",
      "url": "https://apnews.com/ab9b5fe84c2a24d6314512addeb037c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8429312fe684071b6cb992291cf6a52/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and MICHAEL RUBINKAM",
      "description": "WILKES-BARRE, Pa. (AP) — Donald Trump is rallying voters on Saturday in northeastern Pennsylvania, a swath of the pivotal battleground state where he hopes conservative, white working-class voters near President Joe Biden’s hometown will boost the Republican's chances of winning back the White House.",
      "publishedAt": "2024-08-17T16:43:08Z",
      "title": "Trump is on tap to rally Pennsylvania voters near Biden's native Scranton and counter Harris' surge",
      "url": "https://apnews.com/d1e8098a7588bfd1af685327f18ab3a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f9a7e081f254706b4fc73cc4c9fd538/3000.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — Thousands of Nebraskans are expected to turn out on Saturday for native son Tim Walz on his first trip back to his home state since becoming the Democratic vice presidential nominee.",
      "publishedAt": "2024-08-17T15:45:16Z",
      "title": "Tim Walz is returning to his home state where there's a battle over a key Nebraska electoral vote",
      "url": "https://apnews.com/5f11729f4e1c8e784bc8ea96fd2cddf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0501f697489545c094907c89ca70c691/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — India's medical workers began a countrywide strike Saturday to protest the rape and killing of a trainee doctor at a state-run hospital in the eastern West Bengal state.Saturday’s strike was called by the country’s largest group of doctors, the Indian Medical Association, saying all non-essential services at hospitals would be shut down across the country for 24 hours.",
      "publishedAt": "2024-08-17T06:46:13Z",
      "title": "What to know as India's medics and women protest the rape and killing of a doctor",
      "url": "https://apnews.com/80596fc7aa0880133f56ace5d77240b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce8e0af8dcd24f6db148338d45262b38/1920.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "Ron DeSantis' senior political aides were gathered last year at the Florida governor's campaign headquarters, an office across the street from a Red Lobster on Tallahassee's north side, planning the announcement of his candidacy for president.",
      "publishedAt": "2024-08-17T04:05:01Z",
      "title": "Strategist who ran DeSantis' ill-fated bid is working with Musk to help organize voters for Trump",
      "url": "https://apnews.com/93bf546bbf4082ca09dce62d43c4186a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/753f2fede2ff4fa781b89575f58b7544/2205.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Fighters from Sudan's paramilitary group rampaged through a central village, looting and burning and killing at least 85 people, including women and children, authorities and residents said Saturday, the latest atrocity in the country’s 18-month devastating conflict.",
      "publishedAt": "2024-08-17T16:23:01Z",
      "title": "Sudan's paramilitary fighters killed 85 people in an attack on a central village, residents say",
      "url": "https://apnews.com/0e63ef15da694a558934ad2b32d6cc9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/393a11ea63524b66af227899fe0d1c1f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}