{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military said Thursday it was looking into whether Hamas’ top leader Yahya Sinwar was killed in a military operation in Gaza.",
      "publishedAt": "2024-10-17T11:42:28Z",
      "title": "Israel is DNA-testing a body from Gaza to see if it's Hamas' top leader Sinwar, an official says",
      "url": "https://apnews.com/d12ca71945313e601cf10876072f4182",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eebaac748963483a8a7c7fe35e4b473b/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel says it is looking into the possibility that Hamas leader Yahya Sinwar, a mastermind of the Oct.",
      "publishedAt": "2024-10-17T14:30:40Z",
      "title": "Who is Hamas leader Yahya Sinwar?",
      "url": "https://apnews.com/2963dbc6e8ef040a00e588488cba33e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfa00c24a3c64d248633ddec99a6957b/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — An independent panel investigating the attempted assassination of Donald Trump at a Pennsylvania campaign rally says the Secret Services needs fundamental reform\" and that “another Butler can and will happen again” without major changes in how candidates are protected.",
      "publishedAt": "2024-10-17T12:04:22Z",
      "title": "Panel looking into Trump assassination attempt says Secret Service needs ‘fundamental reform’",
      "url": "https://apnews.com/00fce4f3d481d9c3c7964a0215c84678",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/092a1f91a17e481fb5250519dc50c0c1/3000.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON, JEFF AMY and CALVIN WOODWARD",
      "description": "Shortly after taking the stage 91 minutes late for his Atlanta rally this week, Donald Trump did what he can't help doing — go off on a tangent. This was clearly going to be a night at the improv.",
      "publishedAt": "2024-10-17T04:03:28Z",
      "title": "Harris and Trump say America tanks if they lose. So why the exuberance at their rallies?",
      "url": "https://apnews.com/92d8be2d5e5a45a6bec105efed6364cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7966f45f2d4468099da382cbe4d7cc1/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and WILL WEISSERT",
      "description": "MILWAUKEE (AP) — With three weeks left in the presidential campaign, Democrat Kamala Harris is spending most of her days trying to shore up support in the “blue wall” states of Pennsylvania, Michigan and Wisconsin as she tries to avoid a repeat of Hillary Clinton’s collapse there eight years ago.",
      "publishedAt": "2024-10-17T04:10:24Z",
      "title": "In the campaign's final weeks, Harris is keeping a focus on 'blue wall' states",
      "url": "https://apnews.com/479ad508d075b27f141312e21b4fc081",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37249d4d36ff4efebb8802c632ff8ece/3000.jpeg"
    },
    {
      "author": "JASON DEAREN, MICHELLE R. SMITH and AARON KESSLER",
      "description": "MOUNT OLIVE, N.C. (AP) — The U.S. military trained him in explosives and battlefield tactics. Now the Iraq War veteran and enlisted National Guard member was calling for taking up arms against police and government officials in his own country.",
      "publishedAt": "2024-10-17T09:11:51Z",
      "title": "His country trained him to fight. Then he turned against it. More like him are doing the same",
      "url": "https://apnews.com/0c1fdd7b6b761e9c9e8556a9b9e45dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfc246af37274ff1a6eb1188f285b528/2293.jpeg"
    },
    {
      "author": "ISABEL DEBRE and KAITLYN HUAMANI",
      "description": "BUENOS AIRES, Argentina (AP) — The death of Liam Payne, who shot to stardom as a member of the boy band One Direction and grappled with intense global fame while still in his teens, sent shockwaves across the world Thursday as Argentine authorities continued their investigation at the scene.",
      "publishedAt": "2024-10-17T09:19:02Z",
      "title": "Death of ex-One Direction member Liam Payne at 31 shocks fans around the world",
      "url": "https://apnews.com/487239e4f0b938a6f350a7d2f14737e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2be51a7d50dc4d17b760828bcc54c27d/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — Prosecutors have called on the state's highest court to allow them to retry Karen Read for murder in the death of her Boston police officer boyfriend, arguing against defense claims that jurors had reached a verdict against some of her charges before the judge declared a mistrial.",
      "publishedAt": "2024-10-17T14:40:45Z",
      "title": "Prosecutors ask Massachusetts' highest court to allow murder retrial for Karen Read",
      "url": "https://apnews.com/368bac085f682f0dbd2743a9fa3bab16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa3a42b20fab49b0b0ddb4b3f7976828/3000.jpeg"
    },
    {
      "author": "DEVI SHASTRI and LAURA BARGFELD",
      "description": "BERGENFIELD, N.J. (AP) — At Sunshine Adult Day Center, every morning starts with a parade around the room.Today, the theme is multicultural, and the flag bearers have no shortage of countries: Philippines, India, Haiti, Mexico, United States.",
      "publishedAt": "2024-10-17T14:04:28Z",
      "title": "Adult day centers offer multicultural hubs for older people of color",
      "url": "https://apnews.com/98943152ebfc62dd898262d93ca32e6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d2d49fc8fa54feaa218e602c137e4ba/3000.jpeg"
    },
    {
      "author": "KAITLYN HUAMANI and BOB THOMAS",
      "description": "LOS ANGELES (AP) — Mitzi Gaynor, the effervescent dancer and actor who starred as Nellie Forbush in the 1958 film of \"South Pacific\" and appeared in other musicals with Bing Crosby, Frank Sinatra and Gene Kelly, has died.",
      "publishedAt": "2024-10-17T15:53:36Z",
      "title": "Mitzi Gaynor, star of ‘South Pacific,’ dies at 93",
      "url": "https://apnews.com/320eb99fe0824091babafac794dc2320",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96c0480d18814f06abe9931b89ab605c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}