{
  "articles": [
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — It was the middle of the night when a dispatcher’s 12-second warning crackled over the radio: A massive cargo ship had lost its steering capabilities and was heading toward the Francis Scott Key Bridge.",
      "publishedAt": "2024-03-27T04:03:00Z",
      "title": "'Heroes' scrambled to stop traffic before Baltimore bridge collapsed; construction crew feared dead",
      "url": "https://apnews.com/6a95340e5daeff6551fc999d23feb278",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21f44fb65c654185800945f681c7d9d6/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli Prime Minister Benjamin Netanyahu said Tuesday that his government will not accept Hamas’ “delusional” conditions for a cease-fire in Gaza. The militant group rejected the latest truce proposal because it says Israel is ignoring the group's core demands.",
      "publishedAt": "2024-03-26T06:41:38Z",
      "title": "The Latest | Israel won't accept Hamas demands after militant group rejects cease-fire plan",
      "url": "https://apnews.com/592a38465aa6d5942ee94c6c8beef5db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c0ce7bbc2c44e21966afef7658fbd85/3000.jpeg"
    },
    {
      "author": "BILL BARROW and LINLEY SANDERS",
      "description": "ATLANTA (AP) — Many Americans are unenthusiastic about a November rematch of the 2020 presidential election. But presumptive GOP nominee Donald Trump appears to stoke more anger and fear among Americans from his opposing party than President Joe Biden does from his.",
      "publishedAt": "2024-03-27T04:01:40Z",
      "title": "AP-NORC Poll: Trump evokes more anger and fear from Democrats than Biden does from Republicans",
      "url": "https://apnews.com/2d29d5b0be4fe11272ec372542b76b44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13b1cd523fca45f889a5466a3bcad9ff/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The case against Donald Trump seemed relatively straightforward in August 2022 when FBI agents searched his Mar-a-Lago estate, with authorities citing evidence that the former president hoarded enough classified documents to fill dozens of boxes and obstructed the government's efforts to retrieve them.",
      "publishedAt": "2024-03-27T04:06:37Z",
      "title": "Hurry up and wait: Trump's classified documents case is mired in delays that may run past election",
      "url": "https://apnews.com/83be6fb5362e7bb2b7aaf6371a9acabf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/787372846d68443490ccc24f6d615ac5/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE, AMANDA SEITZ and CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — U.S. Supreme Court justices on Tuesday did not appear ready to limit access to the abortion pill mifepristone, in a case that could have far-reaching implications for millions of American women and for scores of drugs regulated by the Food and Drug Administration.",
      "publishedAt": "2024-03-26T20:17:45Z",
      "title": "5 takeaways from the abortion pill case before the U.S. Supreme Court",
      "url": "https://apnews.com/7fe897ec4f5b3121dc73d5b74b5a0d6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f86e76af7b004ff597f5c93aff7ddb89/1920.jpeg"
    },
    {
      "author": "JONATHAN LANDRUM Jr.",
      "description": "LOS ANGELES (AP) — Sean “Diddy\" Combs' lawyer said Tuesday that the searches of the rapper's Los Angeles and Miami properties by federal authorities in a sex trafficking investigation were “a gross use of military-level force” and that Combs is “innocent and will continue to fight\" to clear his name.",
      "publishedAt": "2024-03-26T21:40:59Z",
      "title": "Sean 'Diddy' Combs' lawyer says raids of the rapper's homes were 'excessive' use of military force",
      "url": "https://apnews.com/74a31ab6d1778ef84f1b97e7578dc906",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/445c9fe369154d08bd18511212def496/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — A media frenzy was born on Feb. 27, when the hashtag #WhereIsKate exploded online with speculation about the whereabouts of Britain's Princess of Wales. It opened a rabbit hole of amateur detective work, memes, bizarre theories and jokes — mixed with genuine concern about Kate's health — into which thousands of people descended until her announcement last week that she was recovering from cancer.",
      "publishedAt": "2024-03-27T04:01:33Z",
      "title": "The British royal family learns that if you don't fill an information vacuum, someone else will",
      "url": "https://apnews.com/49d725512152e60d8fbe7bd093b8d5c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d72098d14974ef2b544b1ba37d71276/3000.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "KIBBUTZ NAHAL OZ, Israel (AP) — For a few minutes on a recent afternoon, the sun-bathed silence that fills Nadav Tzabari’s neighborhood could almost be mistaken for peace.Then shelling from Israeli tanks dug in across the fence line in Gaza erupts again, sending shudders through the vacated homes and overgrown gardens of this long-resilient farming community, emptied for months of nearly all its people.",
      "publishedAt": "2024-03-27T04:13:35Z",
      "title": "They fled kibbutzim after Hamas attacked. Now, many Israelis must decide whether to go back.",
      "url": "https://apnews.com/602abc399f73ac97ce19b81ddc13571a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da20eff014dc4442a6c84124998894c2/3000.jpeg"
    },
    {
      "author": "DARKO BANDIC and JOVANA GEC",
      "description": "ZAGREB, Croatia (AP) — With vigils outside clinics, marches drawing thousands and groups of men kneeling to pray in public squares, religious and neo-conservative groups have been ramping up pressure to ban abortions in staunchly Catholic Croatia.",
      "publishedAt": "2024-03-27T04:05:12Z",
      "title": "50 years after the former Yugoslavia protected abortion rights, that legacy is under threat",
      "url": "https://apnews.com/fbb9d3c885742fd17ecf1343c9525fba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ff1e4a6414d43a585f67d5552547f35/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE and SYLVIE CORBET",
      "description": "SAO PAULO (AP) — The Brazilian and the French presidents on Tuesday announced a plan to invest 1 billion euros ($1.1 billion) in the Amazon, including parts of the rainforest in neighboring French Guiana.",
      "publishedAt": "2024-03-27T02:19:15Z",
      "title": "The presidents of France and Brazil meet and announce a $1.1 billion investment plan for the Amazon",
      "url": "https://apnews.com/9c938a9164baa7b01dbd69002bb76798",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6630e7b70c84f7b96595ec4d10ee384/1459.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}