{
  "articles": [
    {
      "author": "Rajesh Roy",
      "description": "India faces a major challenge as a steep U.S. tariff on Indian products takes effect. The import duties coming into force on Wednesday threaten over half of India's exports to its largest overseas market. The situation highlights the fragile trade ties between the two allies. President Donald Trump initially announced a 25% tariff on Indian goods, but then imposed an additional 25% tariff due to India’s purchases of Russian oil. That brings the combined U.S. tariffs on India to 50%. The Indian government estimates that $48.2 billion worth of exports will be affected. Labor-intensive sectors like textiles and leather will likely be hit hardest. Prime Minister Narendra Modi has vowed not to yield to U.S. pressure.",
      "publishedAt": "2025-08-27T04:09:03Z",
      "title": "India braces for export shock as additional US tariffs take effect",
      "url": "https://apnews.com/article/india-us-tariff-exports-trade-tension-48ac6d5e172df04832c75d2a57d0a860",
      "urlToImage": "https://dims.apnews.com/dims4/default/61e64f5/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2F27%2F4a6643bead0e2374093dca124f9c%2F8a3401b44d974d36a619a1a3c244fc29"
    },
    {
      "author": "Christopher Rugaber",
      "description": "President Donald Trump’s attempt to fire one of the seven Federal Reserve governors will likely end up in court and could more clearly define the limits of the president’s legal powers over the traditionally independent institution. Legal experts say Trump’s claim he can fire Lisa Cook is on shaky ground. But it’s an unprecedented move that hasn’t played out in the courts before. The Supreme Court this year has been more willing to let the president remove agency officials than in the past. The Republican president said Monday he was removing Cook because of allegations she committed mortgage fraud. Cook was appointed by Democratic President Joe Biden in 2022 and says she won't step down.",
      "publishedAt": "2025-08-26T15:46:12Z",
      "title": "Trump bid to fire Federal Reserve governor Cook likely land in court",
      "url": "https://apnews.com/article/cook-trump-federal-reserve-d7b3d05bcb5d6a80aacff913bf7bff96",
      "urlToImage": "https://dims.apnews.com/dims4/default/c895c7d/2147483647/strip/true/crop/2344x1319+0+122/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2F84%2Ff4d1a126152d0fecb8fd6d1998ef%2Fef6d627bed27476a93dde087ea7b623f"
    },
    {
      "author": "Lea Skene",
      "description": "A federal judge has dismissed the Trump administration’s lawsuit against all 15 federal judges in Maryland over an order by the chief judge that stopped the immediate deportation of migrants challenging their removals. U.S. District Judge Thomas Cullen on Tuesday granted a request by the judges to toss the case, saying to do otherwise would \"offend the rule of law.” Cullen was nominated by President Donald Trump and serves in Virginia but was tapped to oversee the case because all of Maryland’s federal judges were named as defendants. The unusual circumstance reflects the Republican administration’s harsh response to judges who slow or stop its policies. The White House has no immediate comment.",
      "publishedAt": "2025-08-26T14:41:13Z",
      "title": "Court tosses Trump administration lawsuit against Maryland federal judges",
      "url": "https://apnews.com/article/trump-lawsuit-maryland-judges-dc9c203cfc4ca37814179d2b220e361f",
      "urlToImage": "https://dims.apnews.com/dims4/default/fede681/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F80%2Fa6bb3f085d2665609f45f5af2917%2F7bc6d0ff3c48498db22545635c965957"
    },
    {
      "author": "Joey Cappelletti, Bill Barrow",
      "description": "Illinois Gov. JB Pritzker and other top Democrats are warning President Donald Trump to stay out of the cities they run. Trump has suggested sending federal troops to cities like Chicago and Baltimore, claiming violence is out of control. Democrats, including Pritzker, say this is a political move meant to intimidate opponents and another signal of his authoritarian takeover. They argue crime is falling and accuse Trump of ignoring cities with worse crime rates that have Republican leaders. Democrats plan to fight any intervention and use the issue to show they have real public safety solutions.",
      "publishedAt": "2025-08-26T18:39:27Z",
      "title": "Democrats seek to derail Trump’s plan to send federal troops to cities",
      "url": "https://apnews.com/article/trump-national-guard-troops-democrats-cities-chicago-988a659d9d13deb1e7a8f52cf47efef8",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c60c13/2147483647/strip/true/crop/4845x2725+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F31%2F89b9c35ef7ca8f3539f5d82802c1%2F8dd8f582a53143d2b9fdcf28e7c3e5bd"
    },
    {
      "author": "Christine Fernando, Sophia Tareen, Obed Lamy",
      "description": "President Donald Trump’s threats to deploy National Guard troops to Chicago sent ripples through America’s third-largest city as residents defended their home against Trump’s escalating rhetoric toward violent crime, including claims Chicago is a “killing field.” In a city on edge awaiting news of a potential National Guard deployment, the threat of federal troops stirred a mix of fear, frustration and defiance for residents as they pointed to historic drops in violent crime in the city. Some said it could make things worse with military personnel not being trained in de-escalating violence the way community activists and police are.",
      "publishedAt": "2025-08-26T19:52:31Z",
      "title": "Trump's National Guard threat to Chicago sparks fear and defiance",
      "url": "https://apnews.com/article/chicago-trump-national-guard-crime-illinois-ef8f6e337e0a120634a350db84d60f46",
      "urlToImage": "https://dims.apnews.com/dims4/default/6bc7477/2147483647/strip/true/crop/4519x2542+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F66%2F797553934e0dbfd5b9dca0f65d8b%2Fap25237760743960.jpg"
    },
    {
      "author": "Andrew DeMillo, Heather Hollingsworth",
      "description": "A rash of hoax calls about active shooters on college campuses has spread fear among students around the country as the school year begins at institutions of higher learning. The calls have prompted schools to issue campus-wide texts to “run, hide, fight.” They've also sent students and teachers running for cover, seeking safety in utility closets or huddling in classrooms. Officers swarmed campuses looking for the threat. In every case, the threat didn’t exist. The hoax calls and false alarms have hit at least 11 college campuses from Arkansas to Pennsylvania. Security experts say that risk remains, but campus officials must find the right balance in keeping students and teachers on guard for any real threats in the future.",
      "publishedAt": "2025-08-26T18:59:42Z",
      "title": "Hoax calls about active shooters trigger fear on college campuses",
      "url": "https://apnews.com/article/active-shooter-calls-hoaxes-arkansas-villanova-iowa-7fae16fae9025cf421acb6115c30c3d3",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad4092b/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2Fae%2F8b174329e63435f2777d5ee2ac24%2F877d699fd21a4c37bf11da4421c82c02"
    },
    {
      "author": "Ben Finley, Travis Loller",
      "description": "Kilmar Abrego Garcia is in a Virginia detention center and facing deportation to Uganda. He was detained Monday in Baltimore by immigration authorities after leaving a Tennessee jail on Friday. The Trump administration says he's a danger to the community, a human smuggler and a gang member. His attorneys say he's just a family man and a construction worker from El Salvador. His lawyers are fighting the deportation efforts. They say he has the right to express fear of torture in Uganda and to appeal the decisions of immigration authorities. He told the U.S. government he would prefer Costa Rica if he must be deported.",
      "publishedAt": "2025-08-26T21:42:04Z",
      "title": "Kilmar Abrego Garcia faces deportation again in Trump's immigration crackdown",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-deportation-uganda-37f8c48c2d9f236055eeaa590d88b027",
      "urlToImage": "https://dims.apnews.com/dims4/default/017bfe3/2147483647/strip/true/crop/4115x2315+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2F3e%2F8ac141a6b96bd197fffb29e3d220%2Fe10b6891be864c0aa8d8de21aed68cee"
    },
    {
      "author": "Hannah Schoenbaum",
      "description": "Utah is the latest state at the center of a national redistricting battle ahead of the 2026 midterms. A judge ordered lawmakers this week to quickly redraw the state's congressional map. That could make one of Utah’s four congressional seats competitive for Democrats, who are trying to gain control of the U.S. House. The judge says the current map is unlawful because the Republican-controlled Legislature circumvented an independent redistricting commission. The ruling throws Republicans a curveball in a state where they expected a clean sweep. GOP leaders could cut their losses by creating a single left-leaning block, or gamble on creating competitive districts that Republicans will fight to keep.",
      "publishedAt": "2025-08-26T21:29:37Z",
      "title": "What to know about Utah's congressional map redistricting",
      "url": "https://apnews.com/article/utah-congressional-map-redistricting-trump-midterms-100656aa263866946e0fd83f0319894a",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b1acf1/2147483647/strip/true/crop/6000x3375+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff6%2Ffd%2Fcd0f68c5e3f3c5adb5be13516ad9%2F53a4c778f75c4648933dbf99be15abff"
    },
    {
      "author": "Ohad Zwigenberg, Sam Metz, Samy Magdy",
      "description": "Protesters in Israel have torched tires and blocked highways to demand a ceasefire to free hostages in Gaza. This comes as Israeli leaders push for an offensive against Hamas. The protest Tuesday follows deadly strikes on Gaza's main hospital that killed 20 people, including medics and journalists. Prime Minister Benjamin Netanyahu is expected meet his cabinet later on Tuesday. Relatives of hostages hope steady pressure can push the government to commit to ceasefire talks. But far-right coalition members have threatened to bolt if Israel agrees to a truce. Most hostages taken on October 7, 2023, have been released, but 50 remain in captivity in Gaza.",
      "publishedAt": "2025-08-26T10:33:05Z",
      "title": "Protesters in Israel demand release of hostages as Gaza strikes kill 16, hospitals say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-08-26-2025-0f1be1b4e3231e0cbec54ce837cc6af9",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e2a443/2147483647/strip/true/crop/5428x3053+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F54%2Fd7416eb3ffa0036e77cbff939584%2F1d6e562a18a442f08ba4f144848bb75f"
    },
    {
      "author": null,
      "description": "Heavy rain has caused flooding and landslides in parts of Southeast Asia, where at least eight deaths were reported in the aftermath of a tropical storm. Flooding occurred in northern and central provinces of Vietnam, seven people died, one was missing and 34 were injured, state media reported. Almost 8 inches of rain fell overnight in parts of northeast Vietnam and flood warnings remained for some riverside areas. In Thailand, one person died and another was missing from a landslide Wednesday in part of Chiang Mai. Thai officials said many homes were affected and a few people were injured from flash flooding and landslides in northern provinces. More rain was forecast.",
      "publishedAt": "2025-08-27T04:13:23Z",
      "title": "Heavy rain causes flooding in Vietnam and Thailand",
      "url": "https://apnews.com/article/storm-kajiki-vietnam-laos-thailand-2e6cc358d2b5d5d539097584d9afffea",
      "urlToImage": "https://dims.apnews.com/dims4/default/da64103/2147483647/strip/true/crop/3969x2233+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F0d%2F439fd7149625dcbb37b057ab1367%2F33488f8a20b64b509bb288ba6c47e78c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}