{
  "articles": [
    {
      "author": "WAFAA SHURAFA, ISABEL DEBRE and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Thousands of Palestinians sheltering from the Israel-Hamas war at Gaza City’s main hospital fled south Friday after several reported strikes in and around the compound overnight.",
      "publishedAt": "2023-11-10T08:42:59Z",
      "title": "Thousands sheltering at Gaza City’s hospitals flee as Israel-Hamas war closes in",
      "url": "https://apnews.com/98025565691cc44304074b3e25d11ae5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/340e3f9028fb46079d82cf927353d313/1920.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "The Jordan River is a winding, 200-plus-mile run on the eastern flank of Israel and the occupied West Bank. The sea is the glittering Mediterranean to its west.But a phrase about the space in between, “from the river to the sea,” has become a battle cry with new power to roil Jews and pro-Palestinian activists in the aftermath of Hamas' deadly rampage across southern Israel Oct.",
      "publishedAt": "2023-11-10T15:31:55Z",
      "title": "'From the river to the sea': Why these 6 words spark fury and passion over the Israel-Hamas war",
      "url": "https://apnews.com/d7abbd756f481fe50b6fa5c0b907cd49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fa032c36e7447d59abd0df2f6f5c4f8/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "ATLANTA (AP) — While workers were counting ballots for primary elections in August, the elections office in King County, Washington, received a suspicious envelope that turned out to contain trace amounts of fentanyl.",
      "publishedAt": "2023-11-10T18:44:11Z",
      "title": "Local election workers have been under siege since 2020. Now they face fentanyl-laced letters",
      "url": "https://apnews.com/286f88eadef68d9ef08501809f95f8ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2978e2ddca2a40168dfd3423112a9682/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and KEVIN FREKING",
      "description": "WASHINGTON (AP) — With just a week left to avert a government shutdown, new House Speaker Mike Johnson is facing his first big test as he tries to win House Republican support for a short-term funding plan — a task that looks increasingly difficult amid stubborn divisions in the party over federal spending.",
      "publishedAt": "2023-11-10T18:30:36Z",
      "title": "New Speaker Mike Johnson grasps for a funding plan with a government shutdown rapidly approaching",
      "url": "https://apnews.com/e7d934001b1e00817deb8f33a2b6852f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/667a3cdf33534ce5a6ae8327cb239b73/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and LISA MASCARO",
      "description": "WASHINGTON (AP) — Mitch McConnell often tells the story of a letter that his father, a foot soldier in World War II, wrote to his mother while he was stationed in Eastern Europe in 1945, as the United States was liberating the region from Nazi rule.",
      "publishedAt": "2023-11-10T18:02:24Z",
      "title": "Mitch McConnell, standing apart in a changing GOP, digs in on his decades-long push against Russia",
      "url": "https://apnews.com/bf8dc4899d1e99fd186028a387023b57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52c1cafea77d40eba279aad5e51d17c2/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A federal judge in Florida on Friday declined to delay Donald Trump’s classified documents trial, calling a request by the former president's defense lawyers to postpone the date “premature.” But she pushed back other deadlines in the case and signaled that she would revisit the trial date later.",
      "publishedAt": "2023-11-10T15:10:07Z",
      "title": "Judge declines for now to push back Trump's classified documents trial but postpones other deadlines",
      "url": "https://apnews.com/296f082e6e36c0319d0a58ed563b1f45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84b514a9e26f4a7ca169251e0505166c/1578.jpeg"
    },
    {
      "author": "RICHARD LARDNER",
      "description": "YANKEETOWN, Fla. (AP) — A freshwater spring bubbles amid the mangroves, cabbage palms and red cedars on Sweetheart Island, a two-acre uninhabited patch of paradise about a mile off the coast of this little Gulf Coast town.",
      "publishedAt": "2023-11-10T05:40:30Z",
      "title": "The Great Grift: COVID-19 aid thieves bought fancy cars, a Pokemon card - even a private island",
      "url": "https://apnews.com/a005ecfc3226f4ea501eb952c8ec1a8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a76666b01b114b999592ad51acd1dae7/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI, MARK VANCLEAVE and MELISSA PEREZ WINDER",
      "description": "ST. PETER, Minn. (AP) — Earl Meyer remembers in vivid detail when his platoon came under heavy fire during the Korean War -- he still has shrapnel embedded in his thigh.But over 70 years later, the 96-year-old is still waiting for the U.S.",
      "publishedAt": "2023-11-10T05:16:09Z",
      "title": "96-year-old Korean War veteran still attempting to get Purple Heart medal after 7 decades",
      "url": "https://apnews.com/db2a9388a7df82daf87435e325ba5b75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22d4116afc9f4166ba761a228eb31407/1920.jpeg"
    },
    {
      "author": "KEVIN McGILL, STEPHEN SMITH and COLLIN BINKLEY",
      "description": "NEW ORLEANS (AP) — As a Jewish student, Eden Roth always has felt safe and welcome at Tulane University, where more than 40% of the students are Jewish. That has been tested by the aftermath of last month's Hamas incursion into Israel.",
      "publishedAt": "2023-11-10T05:05:39Z",
      "title": "Clashes over Israel-Hamas war shatter students' sense of safety on US college campuses",
      "url": "https://apnews.com/29dca6e670639b73f5bfe7bfcf6befee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87bbb615666245b4a7a672f6ffc3658b/3000.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "NEW YORK (AP) — He was a giant of 20th-century art, but that doesn’t mean Pablo Picasso needed a big canvas.Matchbook covers, postcards, restaurant napkins — they all served as makeshift sketchpads for the artist at moments of inspiration.",
      "publishedAt": "2023-11-10T17:57:04Z",
      "title": "Even Picasso had to practice, practice. Artist's sketchbooks show whimsy, humor, determination",
      "url": "https://apnews.com/0fb2835db0c79fe8b740e5e913cc3a56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aebfe0a931b943068b19e334c319533d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}