{
  "articles": [
    {
      "author": "TERRY SPENCER and KATE PAYNE",
      "description": "TAMPA, Fla. (AP) — Hurricane Milton plowed into Florida as a Category 3 storm Wednesday, bringing misery to a coast still ravaged by Helene, pounding cities with winds of over 100 mph (160 kph) after producing a barrage of tornadoes, but sparing Tampa a direct hit.",
      "publishedAt": "2024-10-09T04:10:30Z",
      "title": "More than 2 million without power as Hurricane Milton slams Florida, causes deaths and flooding",
      "url": "https://apnews.com/08bde4b9c29460f471d43c6512821c93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71c44f365dfa4c6e8f24685ed6e7cb88/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Hurricane Milton made landfall Wednesday along Florida’s Gulf Coast as a Category 3 storm, bringing powerful winds, deadly storm surge and potential flooding to much of the state.",
      "publishedAt": "2024-10-09T12:53:27Z",
      "title": "The Latest: Hurricane Milton lands near Siesta Key, Florida, as a Category 3 storm",
      "url": "https://apnews.com/1890f1707d34cec716e5e140391bbdd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0533646a528431aaddf74b6bb3aa985/3000.jpeg"
    },
    {
      "author": "SUMAN NAISHADHAM",
      "description": "Multiple powerful tornadoes ripped across Florida hours before Hurricane Milton made landfall Wednesday, tearing off roofs, overturning vehicles and sucking debris into the air as the black V-shaped columns moved through.",
      "publishedAt": "2024-10-10T03:51:52Z",
      "title": "Hurricane Milton spawns destructive, deadly tornadoes before making landfall",
      "url": "https://apnews.com/f197c258022c189c6ce8bc59dc88223e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a05579183834b1cad79bf88b846b11b/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "With its mighty strength and its dangerous path, Hurricane Milton powered into a very rare threat flirting with experts' worst fears.",
      "publishedAt": "2024-10-09T22:59:05Z",
      "title": "Here's what has made Hurricane Milton so fierce and unusual",
      "url": "https://apnews.com/0dd01c0e79d888dbda2a96b68fb62a29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ff5a35887fa45ebbaa3f646ff16943e/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, JILL COLVIN and WILL WEISSERT",
      "description": "SCRANTON, Pa. (AP) — Former President Donald Trump hurled insults at his rival, Vice President Kamala Harris, and other women Wednesday — saying he had no interest in stopping his attacks even if they turn off female voters — as Hurricane Milton made landfall, lashing Florida with rain, tornadoes and tropical-storm-force winds.",
      "publishedAt": "2024-10-09T12:53:46Z",
      "title": "Trump lashes out at Harris and 'The View' co-hosts, as Hurricane Milton makes landfall",
      "url": "https://apnews.com/b1f46744537c483e8643a9564d0ebcdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75c0ceb8151a40f793617f8aeef39d52/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, SAMY MAGDY and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Israel's defense minister warned on Wednesday that his country's retaliation for a recent Iranian missile attack will be “lethal” and “surprising,” while the Israeli military pushed ahead with a large-scale operation in northern Gaza and a ground offensive in Lebanon against Hezbollah militants.",
      "publishedAt": "2024-10-09T09:11:13Z",
      "title": "Israeli defense minister warns an attack on Iran would be 'lethal' and 'surprising'",
      "url": "https://apnews.com/31a2dff9a2bb49bc3b76f32b1ddee128",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d45f4647ebb48cf8416fa3a2673bd7f/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — Israel’s ground invasion in Lebanon stretched into its second week, as the Hezbollah militant group fired hundreds of rockets deep into Israel — with no end in sight to the escalating conflict.",
      "publishedAt": "2024-10-01T12:10:40Z",
      "title": "What to know about Israel's ground invasion in southern Lebanon",
      "url": "https://apnews.com/c44358cb4c70db69bdab4b254cb2ed76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/685969995de14b9ab7b8b2cf52a327de/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS and LORI HINNANT",
      "description": "The social media ads promised the young African women a free plane ticket, money and a faraway adventure in Europe. Just complete a computer game and a 100-word Russian vocabulary test.But instead of a work-study program in fields like hospitality and catering, some of them learned only after arriving on the steppes of Russia’s Tatarstan region that they would be toiling in a factory to make weapons of war, assembling thousands of Iranian-designed attack drones to be launched into Ukraine.",
      "publishedAt": "2024-10-10T04:04:51Z",
      "title": "Africans recruited to work in Russia say they were duped into building drones for use in Ukraine",
      "url": "https://apnews.com/11602ab837f0ff4635926d884b422185",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21dacca8e3c94b8998921cb8e2649366/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A new book's assertion that former President Donald Trump may have had as many as seven private phone calls with Russian President Vladimir Putin since leaving the White House has refocused attention on their politically fraught relationship and on Trump's sustained dialogue with world leaders as he seeks a return to power.",
      "publishedAt": "2024-10-09T21:15:14Z",
      "title": "Trump-Putin ties are back in the spotlight after new book describes calls",
      "url": "https://apnews.com/58fd70da281d47bfa3a3a963e21fc067",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4d17d0c3a8643ec9c74625b027069df/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — U.S. inflation last month likely reached its lowest point since February 2021, clearing the way for another Federal Reserve rate cut and adding to the stream of encouraging economic data that has emerged in the final weeks of the presidential campaign.",
      "publishedAt": "2024-10-10T04:01:28Z",
      "title": "US inflation likely cooled again last month in latest sign of a healthy economy",
      "url": "https://apnews.com/cd6d9712bfd484d6e1bc4ccb958dcf23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db64146ce15a40acb9a36abbc581e3ee/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}