{
  "articles": [
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy dismissed the planned summit between U.S. President Donald Trump and Russian President Vladimir Putin, warning that any peace deal excluding Kyiv would lead to “dead solutions.” The meeting, scheduled for Friday in Alaska, is seen as a potential breakthrough after weeks of expressing frustration that more was not being done to quell the fighting. In a statement posted to Telegram, Zelenskyy said Ukraine’s territorial integrity, enshrined in the constitution, must be non-negotiable and emphasized that lasting peace must include Ukraine’s voice at the table.",
      "publishedAt": "2025-08-09T07:12:14Z",
      "title": "Zelenskyy rejects formally ceding Ukrainian territory, says Kyiv must be part of any negotiations",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-trump-summit-zelenskyy-a01a6dbae85b10cc710c48f1558c1401",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "International condemnation is growing over Israel’s decision for a military takeover of Gaza City. And little appears to be changing immediately on the ground in the Palestinian territory shattered by 22 months of war. Health officials say 11 Palestinians seeking aid were shot dead Saturday while 11 adults died of malnutrition-related causes in the past 24 hours. Ceasefire efforts are reviving with Israel's announcement. Families of hostages rallied again to pressure the government of Israeli Prime Minister Benjamin Netanyahu amid fears that the offensive will put the 50 remaining hostages at risk. Just 20 of them are thought to be alive.",
      "publishedAt": "2025-08-09T15:20:34Z",
      "title": "Israel faces growing global condemnation over military expansion in Gaza",
      "url": "https://apnews.com/article/gaza-israel-palestinians-war-hamas-hostages-ceasefire-85dd158efed9eeab482d434e36bf130a",
      "urlToImage": "https://dims.apnews.com/dims4/default/6bbae5c/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1c%2Fb8%2F35643ea37ae85608a6fbbe672fc7%2Fcad760cc4fc34150b149b30818bfd4a3"
    },
    {
      "author": null,
      "description": "The Georgia Bureau of Investigation has identified the man who opened fire at the U.S. Centers for Disease Control and Prevention as 30-year-old Patrick Joseph White of Kennesaw, Georgia. The GBI statement says White died and Officer David Rose with the DeKalb County Police Department was shot and killed during the shooting Friday.",
      "publishedAt": "2025-08-09T13:32:48Z",
      "title": "Georgia authorities identify suspect in CDC shooting as a 30-year-old man from suburban Atlanta",
      "url": "https://apnews.com/article/cdc-suspect-identified-georgia-officer-dead-2f8eba270597221e23d354164d5dbc0f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "President Donald Trump's promised law enforcement surge in Washington, D.C., did not appear to happen as scheduled on its first night. The streets were bustling with revelers, but there was no visible increase in law enforcement. Trump had announced a security lockdown starting at midnight, following a weekend assault on a government official. He has threatened to take federal control of the city, citing safety concerns. Mayor Muriel Bowser has not publicly responded. Trump's plans could include deploying the National Guard, but further actions may face legal challenges. The situation remains fluid as the city awaits further developments.",
      "publishedAt": "2025-08-09T04:03:37Z",
      "title": "DC awaits federal action after Trump promise to fortify its streets",
      "url": "https://apnews.com/article/washington-district-takeover-trump-crime-d0ebfa76584753635327d792f6c0b8fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1553a6/2147483647/strip/true/crop/5609x3155+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F8b%2Fd09d8fb9a99c71362e7df54e4a93%2F18896ead764745bdbb625ec75dbd4b31"
    },
    {
      "author": null,
      "description": "Oregon Sen. Ron Wyden is in his fifth decade in Congress and the veteran Democrat is showing no inclination to step aside. He says he plans to seek another term in 2028, when he'll be 79, even as pressure builds on aging Democratic officeholders to give way to a new generation. He's traveled to all 36 Oregon counties every year that he’s been in the Senate and intends to keep doing so. After a recent town hall in Wasco in conservative Sherman County, Wyden called questions about age “fair game for debate” but said he’s still up to the job.",
      "publishedAt": "2025-08-09T11:48:47Z",
      "title": "Wyden says he's up for the fight against Trump's policies",
      "url": "https://apnews.com/article/wyden-senate-oregon-trump-democrats-2bacdf8cf27c4f2531d02276e2733ae7",
      "urlToImage": "https://dims.apnews.com/dims4/default/117ea77/2147483647/strip/true/crop/5842x3286+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F58%2Fc5de4ce08d7d74a78cbf4f452c37%2Fc36860334648443881f96c2365f1efb9"
    },
    {
      "author": null,
      "description": "British police said they arrested 365 people in central London as supporters of a recently banned pro-Palestinian group intentionally flouted the law as part of their effort to force the government to reconsider the ban. Parliament in early July passed a law banning Palestine Action and making it a crime to publicly support the organization. That came after activists broke into a Royal Air Force base and vandalized two tanker planes to protest Britain’s support for Israel’s offensive in Gaza. The protest in London took place on Saturday",
      "publishedAt": "2025-08-09T14:17:17Z",
      "title": "London police arrest 365 people as pro-Palestinian protesters defy new law",
      "url": "https://apnews.com/article/britain-protests-palestinian-police-615f3623e0eac9df567c2014a341e412",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec6bf47/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2F0c%2F569ba39e6580c59bf040d8cfaacf%2F51882873449e48818f0ff0be22e5320a"
    },
    {
      "author": null,
      "description": "President Donald Trump’s Justice Department is zeroing in on New York Attorney General Letitia James. A person familiar with the matter told The Associated Press that James has been subpoenaed for records related to the lawsuit she won against Trump for lying about his wealth. Another person said the subpoena is part of an investigation into whether James violated Trump’s civil rights. The people could not publicly discuss details of the investigation and spoke on the condition of anonymity. The Democratic attorney general for New York has denied any wrongdoing. Her lawyer has accused the Trump administration of weaponizing the Justice Department.",
      "publishedAt": "2025-08-09T18:13:40Z",
      "title": "Key facts about the new investigations into a Trump adversary",
      "url": "https://apnews.com/article/trump-investigation-letitia-james-07452728c0bf2677ca095b7cf14db2c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f16c7d/2147483647/strip/true/crop/6400x3600+0+334/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F46%2F6674ea912f103ecfd8b5554e06b8%2F8b6ab665f68243c0b4e43731ed2466e4"
    },
    {
      "author": null,
      "description": "Four astronauts are back on Earth after a five-month stay at the International Space Station. Their SpaceX capsule parachuted into the Pacific off the Southern California coast on Saturday, a day after departing the orbiting lab. Splashing down were two Americans, one Japanese and one Russian. They launched in March as the replacements for NASA’s stuck astronauts. Boeing’s botched Starliner demo kept the two test pilots at the space station for more than nine months instead of a week. This was SpaceX’s third Pacific splashdown with people on board, but the first for a NASA crew in 50 years.",
      "publishedAt": "2025-08-09T15:38:26Z",
      "title": "Astronauts return to Earth with SpaceX after 5 months at the International Space Station",
      "url": "https://apnews.com/article/spacex-returns-astronauts-to-earth-with-pacific-splashdown-faa6d5c867de9d9c91f4ca6727da538c",
      "urlToImage": "https://dims.apnews.com/dims4/default/db85bcd/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Ff8%2Fcf2ea670dfc3109020f8f96eb466%2Fdd96ff5a02734b8d83f63b9822ed6186"
    },
    {
      "author": null,
      "description": "A top official at the Federal Reserve is saying that this month’s stunning, weaker-than-expected report on the U.S. job market is strengthening her belief that interest rates should be lower. Michelle Bowman pointed to July's hiring slowdown, along with her belief that inflation is heading down toward 2% despite President Donald Trump's tariffs. She was one of two Fed officials who voted a week and a half ago in favor of lowering interest rates. They lost out as nine other Fed officials voted to keep rates steady. Lower rates can help the economy but can also fuel inflation.",
      "publishedAt": "2025-08-09T18:30:41Z",
      "title": "The Federal Reserve's Michelle Bowman backs three cuts to interest rates this year",
      "url": "https://apnews.com/article/federal-reserve-michelle-bowman-interest-rates-d24adfa4429586bb95f538c3fe0a2989",
      "urlToImage": "https://dims.apnews.com/dims4/default/533b6d8/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2Ff8%2F2bd2cbe341ca836571eec994bf7b%2F5898bba94c8d4e4986db1b18190fce54"
    },
    {
      "author": null,
      "description": "Jen Pawol has made history as the first female umpire to work a regular-season game in the major leagues. Pawol worked as the first base umpire for Saturday’s first game of a split doubleheader between the Atlanta Braves and Miami Marlins. She enjoyed a quiet first inning. Pawol will work third base in Saturday night’s second game of the doubleheader and will be in the spotlight when she calls pitches behind the plate in Sunday’s final game of the series. Marlins manager Clayton McCullough and Braves bench coach Walt Weiss greeted Pawol when lineups were exchanged at home plate.",
      "publishedAt": "2025-08-09T17:43:48Z",
      "title": "Jen Pawol breaks MLB's gender barrier as first female umpire",
      "url": "https://apnews.com/article/pawol-female-umpire-marlins-braves-0ae34533ea49f1e400a1c39e8be6f30e",
      "urlToImage": "https://dims.apnews.com/dims4/default/684f90f/2147483647/strip/true/crop/4988x2806+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F9e%2Ffc3d8d79ff1ccad03b03b3594d02%2Fbe28243005a04958bb7e966ace272488"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}