{
  "articles": [
    {
      "author": "JALAL BWAITEL",
      "description": "BETHLEHEM, West Bank (AP) — Bethlehem marked another somber Christmas Eve on Tuesday in the traditional birthplace of Jesus under the shadow of war in Gaza.",
      "publishedAt": "2024-12-24T10:33:35Z",
      "title": "Cities worldwide hold subdued Christmas Eve celebrations amid conflicts",
      "url": "https://apnews.com/5b92d528fb97c59992c957f56028aadd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65f870d2b6d447cebfc6ba95f43df366/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — Pope Francis kicked off the 2025 Holy Year on Tuesday, inaugurating a celebration of the Catholic Church that is expected to draw some 32 million pilgrims to Rome in a test of the pope's stamina and the ability of the Eternal City to welcome them.",
      "publishedAt": "2024-12-24T17:08:29Z",
      "title": "Pope Francis kicks off a yearlong Jubilee that will test his stamina and Rome's patience",
      "url": "https://apnews.com/957b791dcb4143c9f33e4cb23ea9cd6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/454fae4fb6b94bee8f2316993a360629/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "FORT LAUDERDALE, Fla. (AP) — President-elect Donald Trump promised on Tuesday to “vigorously pursue” capital punishment after President Joe Biden commuted the sentences of most people on federal death row partly to stop Trump from pushing forward their executions.",
      "publishedAt": "2024-12-24T21:36:10Z",
      "title": "Trump vows to pursue executions after Biden commutes most of federal death row",
      "url": "https://apnews.com/d9d1fbb5d6cb0e7727ce9f4644414a62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42cdddaa9efa4cfaa5ed1b62b10b0a5e/3000.jpeg"
    },
    {
      "author": "EDNA TARIGAN, ACHMAD IBRAHIM, and FADLAN SYAM",
      "description": "LHOKNGA, Indonesia (AP) — Qurrata Ayuni, a 28-year-old survivor of the earthquake and tsunami that devastated her hometown two decades ago, has transformed her resilience into purpose. Defying Aceh's male-dominated coffee culture, she runs a café that serves as a welcoming space for everyone, especially women, by employing and empowering them in the region worst hit by the tragedy.",
      "publishedAt": "2024-12-25T01:59:53Z",
      "title": "After 20 years, the post-tsunami generation stays vigilant for future disasters",
      "url": "https://apnews.com/6b91150437c2820ad59130c060b905ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86f8b5a233cd4c3aa3b65f7d8f0bfd18/3000.jpeg"
    },
    {
      "author": null,
      "description": "MAPUTO, Mozambique (AP) — Violence that engulfed Mozambique after the country's highest court confirmed ruling Frelimo party presidential candidate Daniel Chapo as the winner of disputed Oct.",
      "publishedAt": "2024-12-24T22:30:06Z",
      "title": "21 dead as Mozambique erupts in violence after election court ruling",
      "url": "https://apnews.com/20c3173fe8c3baf89b2f3598c37ef7c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c98eeaf23454fef9eb03d777da0d0d7/3000.jpeg"
    },
    {
      "author": "ALLEN PANCHANA",
      "description": "GUAYAQUIL, Ecuador (AP) — Ecuadorian police on Tuesday found an undisclosed number of bodies in an area close to a military base, officials said, and were investigating whether the bodies could be of some of the four children who were last seen taken by men in military uniform earlier this month.",
      "publishedAt": "2024-12-25T01:30:57Z",
      "title": "Ecuadorian police probe if bodies found are of missing children allegedly taken by soldiers",
      "url": "https://apnews.com/d514808006185a20944a2951e3f02aa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/720780b36cb640ba893c0ac8c7d4349b/3000.jpeg"
    },
    {
      "author": "EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Two reporters were killed and several were wounded Tuesday in a gang attack in Haiti on the reopening of Port-au-Prince’s biggest public hospital, the country's online media association said.",
      "publishedAt": "2024-12-24T20:01:46Z",
      "title": "A Haiti gang attack on the reopening of a main hospital kills 2 reporters and a police officer",
      "url": "https://apnews.com/a7b6c5606f112e8098b390f3b83763ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f89d500884fe42c3b0d26775f7c3244d/1920.jpeg"
    },
    {
      "author": null,
      "description": "HONOLULU (AP) — One of the world's most active volcanoes spewed lava into the air for a second straight day on Tuesday. The eruption of Kilauea volcano on Hawaii's Big Island has stayed within the mountain's summit caldera inside Hawaii Volcanoes National Park.",
      "publishedAt": "2024-12-24T22:24:36Z",
      "title": "Stunning photos show lava erupting from Hawaii's Kilauea volcano",
      "url": "https://apnews.com/2e731c515e01dd283cdfe348f5a6dcb8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/787cf36ee3bc4a45bc87f704f3701c3b/1920.jpeg"
    },
    {
      "author": "DORANY PINEDA and MICHAEL PHILLIS",
      "description": "LOS ANGELES (AP) — Record-setting flooding over three days dumped more than a foot of rain on parts of northern California, a fire left thousands under evacuation orders and warnings in Los Angeles County, forecasters issued the first-ever tornado warning in San Francisco and rough seas tore down part of a wharf in Santa Cruz.",
      "publishedAt": "2024-12-24T20:29:22Z",
      "title": "Hurricane-force winds bear down on California, latest in stretch of extreme weather",
      "url": "https://apnews.com/c375a777c4d358ad386ef98b5071c8bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46f2e331aceb42cbb2b5feac199f0b4f/3000.jpeg"
    },
    {
      "author": "MATT OTT and HALELUYA HADERO",
      "description": "WASHINGTON (AP) — American Airlines briefly grounded flights nationwide Tuesday because of a technical problem just as the Christmas travel season kicked into overdrive and winter weather threatened more potential problems for those planning to fly or drive.",
      "publishedAt": "2024-12-24T13:00:36Z",
      "title": "Heavy travel day starts with brief grounding of all American Airlines flights",
      "url": "https://apnews.com/c666afa120054b032014c6005677aa7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db34a05869624fcf955a6cb032cf1fc9/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}