{
  "articles": [
    {
      "author": "LORI HINNANT and ILLIA NOVIKOV",
      "description": "POLTAVA, Ukraine (AP) — Two ballistic missiles blasted a military academy and nearby hospital Tuesday in Ukraine, killing more than 50 people and wounding more than 200 others, Ukrainian officials said, in one of the deadliest Russian strikes since the war began.",
      "publishedAt": "2024-09-03T11:39:17Z",
      "title": "Russian missiles blast Ukrainian military academy and hospital, killing more than 50, officials say",
      "url": "https://apnews.com/a53f1a4500ef52e4bf8217ee0e8bca84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2a1886069fb4b8da12dea8daf643492/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israelis were plunged into grief and anger this weekend after the military said six hostages were killed by their captors in Gaza just as troops were closing in on their location.",
      "publishedAt": "2024-09-03T04:03:29Z",
      "title": "Could mass protests in Israel over the hostages persuade Netanyahu to agree to a cease-fire deal?",
      "url": "https://apnews.com/d041f4fc2519597a15be95ad837e0df8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5eb0c293e164e73adc4d3f3675139f7/3000.jpeg"
    },
    {
      "author": null,
      "description": "ULAANBAATAR, Mongolia (AP) — Russian President Vladimir Putin received a red-carpet welcome to Mongolia on Tuesday, as the country ignored calls to arrest him on an international warrant for alleged war crimes stemming from Moscow's invasion of Ukraine.",
      "publishedAt": "2024-09-03T05:34:51Z",
      "title": "Mongolia ignores an international warrant for Putin's arrest, giving him a red-carpet welcome",
      "url": "https://apnews.com/4c79850ecf409287924e3d96218abc78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a7bc6e338b642a886a63096d46f378f/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES, THOMAS BEAUMONT and AMELIA THOMSON-DEVEAUX",
      "description": "LA CROSSE, Wis. (AP) — After a summer of historic tumult, the path to the presidency for both Kamala Harris and Donald Trump this fall is becoming much clearer.",
      "publishedAt": "2024-09-03T04:03:35Z",
      "title": "The presidential campaigns brace for an intense sprint to Election Day",
      "url": "https://apnews.com/151f82b59473d29a448ef1cea9afe471",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/040034dc1ab44c97adc76c7d28d7f642/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — When he first emerged on social media, the user known as Harlan claimed to be a New Yorker and an Army veteran who supported Donald Trump for president.",
      "publishedAt": "2024-09-03T10:15:01Z",
      "title": "China-linked 'Spamouflage' network mimics Americans online to sway US political debate",
      "url": "https://apnews.com/a2b396518bafd8e36635a3796c8271d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5db61a0df5674fffb9b091e328fb932a/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Pope Francis arrived in Indonesia on Tuesday at the start of the longest trip of his pontificate, hoping to encourage its Catholic community and celebrate the tradition of interfaith harmony in a country with the world’s largest Muslim population.",
      "publishedAt": "2024-09-03T01:08:07Z",
      "title": "Pope opens Asia odyssey with stop in Indonesia to rally Catholics, hail religious freedom tradition",
      "url": "https://apnews.com/05c710ad993231bd8840c75f959f2b05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01ac745304fb49ba81dcdc32f957abfc/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER and MARK CARLSON",
      "description": "BOULOGNE-SUR-MER, France (AP) — A boat carrying migrants ripped apart in the English Channel as they attempted to reach Britain from northern France on Tuesday, plunging dozens into the treacherous waterway and leaving 12 dead, authorities said.",
      "publishedAt": "2024-09-03T12:20:46Z",
      "title": "A boat with dozens of migrants rips apart in the English Channel off France, killing 12",
      "url": "https://apnews.com/1a08adf9475b48bd5f35baf47dc7ae35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a50dc2fa45d4c39a073833a0f1f2d99/2094.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — As Columbia University resumes classes Tuesday, students and faculty are planning, and bracing, for a resumption of the pro-Palestinian protests that convulsed the Manhattan campus at the tail end of the spring semester and touched off a wave of college demonstrations nationwide.",
      "publishedAt": "2024-09-03T11:12:08Z",
      "title": "As students return to Columbia, the epicenter of a campus protest movement braces for disruption",
      "url": "https://apnews.com/980e22266c6a6d1c86b670a3d6be655a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2315f93eec64d25801702ec3fb4f417/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "DENVER (AP) — A man sitting in his van after fixing a coffee machine inside a supermarket in the college town of Boulder was the first person killed. In just over a minute, nine more people died in a barrage of gunfire inside and outside the store in 2021 as the shooter targeted and pursued people who were moving.",
      "publishedAt": "2024-09-03T04:03:21Z",
      "title": "Trial expected to focus on shooter's competency in 2021 Colorado supermarket massacre",
      "url": "https://apnews.com/80754900be687b1fcf1169675ec56595",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c06b73a770164ea6b3542aae36943207/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "ASUNCIÓN, Paraguay (AP) — Ahead of her 15th birthday, Diana Zalazar's body had gotten so big she could no longer squeeze into the dress she bought for her quinceañera to celebrate her passage into womanhood in Paraguay.",
      "publishedAt": "2024-09-03T05:33:12Z",
      "title": "Condoms can't be trusted and boys don't cry in Catholic Paraguay's first sex ed program",
      "url": "https://apnews.com/ec1ea559417e2cd7b6ee852550ee9efd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed613d62e25641e5a902a85a292420c7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}