{
  "articles": [
    {
      "author": null,
      "description": "Two staff members of the Israeli embassy were shot and killed Wednesday evening while leaving an event at a Jewish museum in the nation’s capital, and the suspect and yelled “free, free Palestine” after he was arrested, police said. The two victims, a man and a woman, were leaving an event at the Capital Jewish Museum when the 30-year-old suspect approached a group of four people and opened fire, Metropolitan Police Chief Pamela Smith said. The suspect was observed pacing outside the museum before the shooting, walked into the museum after the shooting and was detained by event security, Smith said.",
      "publishedAt": "2025-05-22T03:39:04Z",
      "title": "Two staff members of Israeli embassy killed in shooting in Washington DC",
      "url": "https://apnews.com/article/israel-embassy-jewish-museum-shooting-10307b3b1a2a337e76730736b12ebbcb",
      "urlToImage": "https://dims.apnews.com/dims4/default/702896e/2147483647/strip/true/crop/1620x911+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F1c%2F397aa52d82bd737fb422396e806c%2Fb880a32f53804a4d865aeb0120f97f9b"
    },
    {
      "author": "Tia Goldenberg",
      "description": "The two people shot and killed outside a Jewish museum in Washington were young staffers at the Israeli Embassy who were soon to be engaged. The suspect shouted “Free Palestine” as he was being arrested. Israel identified the victims as Sarah Milgrim and Yaron Lischinsky without giving their ages. They were leaving a young diplomats event at the Capital Jewish Museum that was meant to “foster unity and celebrate Jewish heritage” when they were killed on Wednesday. Israel’s ambassador to the U.S said that Lischinsky had bought an engagement ring and was just days away from proposing to Milgrim on a planned trip to Jerusalem.",
      "publishedAt": "2025-05-22T13:05:04Z",
      "title": "Who were the Israeli Embassy staffers shot dead days before getting engaged?",
      "url": "https://apnews.com/article/israeli-embassy-victims-washington-shooting-couple-engagement-efbe6ba65306a314a782d388ce3fba65",
      "urlToImage": "https://dims.apnews.com/dims4/default/da4c0d2/2147483647/strip/true/crop/4978x2800+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fcc%2F5bdaed1d804db5909e96dfc5de40%2Fcd2aae6b61bd47ff9f2fa55fc74d8333"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court has effectively ended a publicly funded Catholic charter school in Oklahoma, dividing 4-4. Thursday's outcome keeps in place an Oklahoma court decision that invalidated a vote by a state charter school board to approve the St. Isidore of Seville Catholic Virtual School. The school would have been the nation’s first religious charter school. The outcome leaves the issue unresolved nationally. Only eight justices participated, with Justice Amy Coney Barrett sitting it out. The court's one-sentence notice didn't provide a vote breakdown. But based on arguments last month, Chief Justice John Roberts seemed to be the key, and the outcome suggests he went with the court's three liberals to make it 4-4.",
      "publishedAt": "2025-05-22T14:13:55Z",
      "title": "Supreme Court dooms taxpayer funded Catholic charter school in Oklahoma",
      "url": "https://apnews.com/article/supreme-court-oklahoma-public-religious-charter-school-170e3701926e29ea5072eb50f0db97b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8f9990/2147483647/strip/true/crop/4938x2778+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2Fea%2F5b72be7ce85d4f45c0f5f973771a%2F6e103ece6aec40e3a9e18801b6509f1a"
    },
    {
      "author": "Mohammed Jahjouh, Wafaa Shurafa, Sarah El Deeb, Sam Mednick",
      "description": "The U.N. children’s agency says more than 9,000 children have been treated for malnutrition in Gaza this year, and food security experts say tens of thousands of cases are expected in the coming year. Experts also warn the territory could plunge into famine if Israel doesn’t stop its military campaign and fully lift its blockade. The blockade was in place for more than two months, preventing all food, medicine and other goods from entering the territory that is home to some 2 million Palestinians. Meanwhile, Israel has carried out waves of airstrikes and ground operations. Palestinians in Gaza rely almost entirely on outside aid to survive because Israel’s offensive has destroyed almost all the territory’s food production capabilities.",
      "publishedAt": "2025-05-22T12:32:35Z",
      "title": "Mothers and their babies face starvation in Gaza",
      "url": "https://apnews.com/article/malnutrition-hunger-starvation-gaza-f33432592d7143767ca3797b15c6777b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fadb3c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F8b%2F50277e13579daaaa2328d8296f8e%2F167058fb8dba429eb9c84648f00615f7"
    },
    {
      "author": "Julie Watson",
      "description": "A small plane crashed into a San Diego neighborhood, setting about 15 homes on fire as well as vehicles, and forcing evacuations along several blocks. Fire Department Assistant Chief Dan Eddy says: “We have jet fuel all over the place\" in the Murphy Canyon neighborhood. It was not known if there were any deaths or injuries. Eddy says it was very foggy at the time the private plane crashed. The Federal Aviation Administration says the Cessna 550 aircraft crashed near the Montgomery-Gibbs Executive Airport. The FAA says the number of people on board is unknown at this time. The plane can carry six to eight people.",
      "publishedAt": "2025-05-22T12:37:03Z",
      "title": "Small plane crashes into San Diego neighborhood",
      "url": "https://apnews.com/article/plane-crash-san-diego-5e465454fc0282a81adafc1bfdc142a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/647bc90/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F0b%2F7bdffc37e014e363f736ece73c65%2F96ebe7f0769b4a258f0820267b51aad8"
    },
    {
      "author": "Collin Binkley",
      "description": "A federal judge has blocked President Donald Trump’s executive order to dismantle the Education Department and ordered the agency to reinstate employees who were fired in mass layoffs. The administration said it would challenge the ruling. U.S. District Judge Myong Joun in Boston granted a preliminary injunction Thursday stopping the Trump administration from carrying out two plans announced in March that sought to work toward Trump’s goal to dismantle the department. It marks a setback to one of the Republican president’s campaign promises. The ruling came in two consolidated lawsuits that said Trump’s plan amounted to an illegal closure of the Education Department.",
      "publishedAt": "2025-05-22T15:03:52Z",
      "title": "Judge blocks Trump administration's mass layoffs at the Education Department",
      "url": "https://apnews.com/article/education-department-shut-down-layoffs-576eef90c30fdaeb660f7f66644bad10",
      "urlToImage": "https://dims.apnews.com/dims4/default/57cbef1/2147483647/strip/true/crop/4403x2477+0+229/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Fb2%2F9b397636410f49a2895e4ec88c57%2F8736b7203abf472da00418c7fa2e9a1c"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "Rapper Kid Cudi is testifying at the New York sex trafficking trial of Sean “Diddy” Combs. The Grammy Award-winning artist took the stand Thursday after one of the music mogul's ex-aides finished testifying about abuse he says he witnessed by Combs. R&B singer Cassie testified last week that Combs threatened to blow up Cudi's car and hurt him after he learned she was dating Cudi. Combs has pleaded not guilty to sex trafficking and racketeering. Combs' former assistant, George Kaplan, testified that he saw Combs become violent with Cassie only once, on a private jet in 2015.",
      "publishedAt": "2025-05-22T04:00:33Z",
      "title": "Rapper Kid Cudi takes the witness stand at the Sean 'Diddy' Combs trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-kid-cuti-66ac16f76115e2c738deb6feae5b53a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb99c69/2147483647/strip/true/crop/4900x2756+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F9b%2Feb469471c77a11f54ad395eb236b%2Fc7c2870728bc4fbdaaee2566d1fbb22d"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking, Leah Askarinam",
      "description": "House Republicans stayed up all night to pass their multitrillion-dollar tax breaks package. Speaker Mike Johnson defied the skeptics within his ranks and muscled President Donald Trump’s priority bill to approval Thursday. Last-minute concessions and a stern warning from Trump appeared to win over the hold outs to salvage what he calls the “big, beautiful bill.” The outcome caps an intense time on Capitol Hill, with days of private negotiations and public committee hearings. Democrats, without the votes to stop Trump’s package, tried to stall it. The Congressional Budget Office says the tax provisions would add $3.8 trillion to federal deficits.",
      "publishedAt": "2025-05-22T04:02:29Z",
      "title": "House Republicans pass Trump's big bill after all-night session",
      "url": "https://apnews.com/article/congress-tax-cuts-trump-f2c60ae5c7c1313de69446f9ac7176e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/97cb024/2147483647/strip/true/crop/4928x2772+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F9f%2F2ccb7214ec15b1e4fd8f46da7c53%2Ff646881b6d944609a00c09accb0a7ef3"
    },
    {
      "author": "Matthew Perrone, Lauran Neergaard",
      "description": "Government vaccine advisers are meeting to decide if the recipe for COVID-19 vaccines needs updating for this fall and winter. The meeting comes even as a new Trump administration policy has thrown into question whether healthy people younger than 65 will still qualify for a shot — or if vaccines will be limited to seniors and people at high risk from infection. Advisers to the Food and Drug Administration will debate if the virus has mutated enough since last winter to require a tweak to the formula. Thursday’s meeting is the group’s first since President Donald Trump took office in January.",
      "publishedAt": "2025-05-22T12:51:57Z",
      "title": "FDA panel debates COVID vaccine recipe as questions swirl about fall shots",
      "url": "https://apnews.com/article/fda-vaccines-covid-boosters-kennedy-244bdc80f825f953782d35f68798d885",
      "urlToImage": "https://dims.apnews.com/dims4/default/f17c939/2147483647/strip/true/crop/5506x3097+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fab%2Fdf8ae654f00ea56d5a970483815a%2F6d2e10993f3a4eeebe24d005d35431d8"
    },
    {
      "author": "Fatima Hussein, Alan Suderman",
      "description": "The U.S. Mint has made its final order of penny blanks and plans to stop producing the coin when those run out. That word comes from a Treasury Department official who wasn't authorized to discuss the matter publicly and spoke on condition of anonymity to preview the news. An immediate annual savings of $56 million in reduced material costs is expected by stopping penny production, according to the official. In February, President Donald Trump announced that he had ordered his administration to cease production of the 1-cent coin.",
      "publishedAt": "2025-05-22T15:33:19Z",
      "title": "US Mint moves forward with plans to kill the penny",
      "url": "https://apnews.com/article/us-mint-treasury-department-penny-end-production-daf6367d7e8d31d6783720d5d4667115",
      "urlToImage": "https://dims.apnews.com/dims4/default/f263f61/2147483647/strip/true/crop/3000x1688+0+153/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2Fbc%2F89c8c7ca3367f0e57d8cc2e4d6b3%2Fde428cab85c04631a2e2067b7ce06271"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}