{
  "articles": [
    {
      "author": "WAFAA SHURAFA and KAREEM CHEHAYEB",
      "description": "RAFAH, Gaza Strip (AP) — At least 70 people were killed in a strike early Thursday on a crowd of Palestinians waiting for humanitarian aid in Gaza City, bringing the total number killed since the start of the Israel-Hamas war to more than 30,000, Gaza's Health Ministry said.",
      "publishedAt": "2024-02-29T08:58:06Z",
      "title": "Strike on Palestinians waiting for aid kills 70, Gaza officials say, taking war's toll past 30,000",
      "url": "https://apnews.com/f9b5a62a80d8b83eac4946d3c85af58b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1489ae468aee49d4a361b9ad06cf751f/1600.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Wednesday agreed to decide whether former President Donald Trump can be prosecuted on charges he interfered with the 2020 election, calling into question whether his case could go to trial before the November election.",
      "publishedAt": "2024-02-28T22:05:15Z",
      "title": "Supreme Court sets April arguments over whether Trump can be prosecuted for election interference",
      "url": "https://apnews.com/ff4b251967b4f1ae85bd01a0db24931f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8843af5d61cb477e8c7fdc3f53288bb5/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY and JIM VERTUNO",
      "description": "CANADIAN, Texas (AP) — The explosive growth of the second-largest wildfire in Texas history slowed as winds and temperatures dipped but the massive blaze was still untamed and threatening more death and destruction.",
      "publishedAt": "2024-02-29T05:26:45Z",
      "title": "Firefighters seek to corral massive Texas wildfires before weekend of higher temperatures and winds",
      "url": "https://apnews.com/cbbb6a279bef1bd020722ed48927114a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11753b3255f34a129b8ffdd9b9c8e3c3/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY and LISA BAUMANN",
      "description": "FRITCH, Texas. (AP) — The small town of Fritch is again picking through the rubble of a Texas wildfire, a decade after another destructive blaze burned hundreds of homes and left deep scars in the Panhandle community.",
      "publishedAt": "2024-02-29T05:03:47Z",
      "title": "Charred homes, blackened earth after Texas town revisited by destructive wildfire 10 years later",
      "url": "https://apnews.com/9a2800423d67bdfb77c0afe9da35b5d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e178d2f28f7c4fc0bacb0cc9a1f6116f/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, SEUNG MIN KIM and JILL COLVIN",
      "description": "WASHINGTON (AP) — President Joe Biden and his likely Republican challenger Donald Trump both head to the U.S.-Mexico border in Texas on Thursday in a sign of how central immigration has become to the 2024 election and how much both candidates want to use it to their advantage.",
      "publishedAt": "2024-02-29T05:10:02Z",
      "title": "Biden, Trump try to work immigration to their political advantage during trips to Texas",
      "url": "https://apnews.com/42c945d02742b169bde40601a27fde02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56d92e303e7846cca8408d2714012916/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — As Russia makes battlefield advances and Ukrainian soldiers run short on ammunition, U.S.",
      "publishedAt": "2024-02-29T05:03:09Z",
      "title": "US adults fracture along party lines in support for Ukraine military funding, AP-NORC poll finds",
      "url": "https://apnews.com/b772c9736b92c0fbba477938b047da2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a867befcf6644db58488e3fa7fe7cbb7/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE and GENE JOHNSON",
      "description": "KUNA, Idaho (AP) — For nearly an hour, Thomas Eugene Creech lay strapped to a table in an Idaho execution chamber as medical team members poked and prodded at his arms and legs, hands and feet, trying to find a vein through which they could end his life.",
      "publishedAt": "2024-02-29T05:07:20Z",
      "title": "Things to know about Idaho's botched execution of serial killer Thomas Eugene Creech",
      "url": "https://apnews.com/905e6f0a096ed826d8273b9a0fa7001c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64611b4ab95e462cab8bb6fe2a7692fb/2550.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and JIWON SONG",
      "description": "SEOUL, South Korea (AP) — As South Korea’s government made a last plea for junior doctors to end a walkout hours before a Thursday deadline, many were expected to defy orders to return to work, risking suspensions of medical licenses and prosecution.",
      "publishedAt": "2024-02-29T05:29:37Z",
      "title": "Young South Korean doctors resist back-to-work orders, risking prosecution",
      "url": "https://apnews.com/fff231bd792d275395cfc6c7f7188226",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62859f1ee1a24c9594ea175669305454/3000.jpeg"
    },
    {
      "author": "SIMINA MISTREANU",
      "description": "CHENGDU, China (AP) — For a few days in October 2023, the capital of the science fiction world was Chengdu, China. Fans traveled from around the world as Worldcon, sci-fi ’s biggest annual event, was held in the country for the first time.",
      "publishedAt": "2024-02-29T02:43:09Z",
      "title": "How Chinese science fiction went from underground magazines to Netflix extravaganza",
      "url": "https://apnews.com/9040ca9084fc8ec07935d461e4e65ac0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c9030d7752d4785870a673aebae866a/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI",
      "description": "TEHRAN, Iran (AP) — With flashy celebrity ads and promises of deep discounts, a shop in Iran's capital had offered consumers in the Islamic Republic one of the hottest products in the country — an iPhone that came out in 2021.",
      "publishedAt": "2024-02-29T05:14:51Z",
      "title": "A brazen iPhone scam in Iran reflects its economic struggles and tensions with the West",
      "url": "https://apnews.com/5602ebcbbae9bbc28bfa4ba4dc514db4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b26173da192b45a193cc53246c148797/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}