{
  "articles": [
    {
      "author": "SAMY MAGDY, NAJIB JOBAIN and MELANIE LIDMAN",
      "description": "CAIRO (AP) — Egypt has put forward an ambitious, initial proposal to end the Israel-Hamas war with a cease-fire, a phased hostage release and the creation of a Palestinian government of experts who would administer the Gaza Strip and occupied West Bank, a senior Egyptian official and a European diplomat said Monday.",
      "publishedAt": "2023-12-25T10:52:17Z",
      "title": "Egypt floats ambitious plan to end Israel-Hamas war and create transitional Palestinian government",
      "url": "https://apnews.com/151faf920facb9910a254c2987e00d5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b446d53e604042cd867ff84d426692f0/2859.jpeg"
    },
    {
      "author": null,
      "description": "ROME (AP) — Pope Francis on Monday blasted the weapons industry and its “instruments of death” that fuel wars as he made a Christmas Day appeal for peace in the world and in particular between Israel and the Palestinians.",
      "publishedAt": "2023-12-25T11:40:50Z",
      "title": "Pope Francis blasts the weapons industry as he makes a Christmas appeal for peace in the world",
      "url": "https://apnews.com/cb9af73aa193d8ffe413aa767be41234",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/396fe4cd8d6c4298850a5f35f8710522/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "BETHLEHEM, West Bank (AP) — The typically bustling biblical birthplace of Jesus resembled a ghost town Sunday after Christmas Eve celebrations in Bethlehem were called off due to the Israel-Hamas war.",
      "publishedAt": "2023-12-24T09:34:45Z",
      "title": "On Christmas Eve, Bethlehem resembles a ghost town. Celebrations are halted due to Israel-Hamas war.",
      "url": "https://apnews.com/e408a3e48d18c69a7a0b018505cdc732",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ca7b9e1dcad49b0800839872241a0ab/3000.jpeg"
    },
    {
      "author": "DAVID McHUGH, ABDUL RAHMAN SHAHEEN and SHAZIA BHATTI",
      "description": "FRANKFURT, Germany (AP) — Christians around the world were striving on Christmas Eve to put aside the worries and fears of an unsettled, war-torn world as they prepared to celebrate the birth of Jesus of Nazareth.",
      "publishedAt": "2023-12-24T12:38:54Z",
      "title": "In a troubled world, Christians strive to put aside earthly worries on Christmas Eve",
      "url": "https://apnews.com/12aac83f3a9d1bb1c05768c02e75771b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62622830dfb04060ad5ad8ac957757cc/1920.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — Some voted for Donald Trump, others for Joe Biden. A few had never wanted anything to do with politics before they heard Robert F.",
      "publishedAt": "2023-12-25T05:01:36Z",
      "title": "In battleground Arizona, Robert F. Kennedy Jr. draws Biden and Trump voters united by distrust",
      "url": "https://apnews.com/ce8ef411c13bb7d5fc4ddff198cbbac9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00d69875cbc545b19397e1c6cbe84cc9/3000.jpeg"
    },
    {
      "author": "MOHAMMAD HABIB RAHMANI",
      "description": "KABUL, Afghanistan (AP) — Bahara Rustam, 13, took her last class at Bibi Razia School in Kabul on Dec. 11 knowing it was the end of her education. Under Taliban rule, she is unlikely to step foot in a classroom again.",
      "publishedAt": "2023-12-25T06:35:37Z",
      "title": "Afghan schoolgirls are finishing sixth grade in tears. Under Taliban rule, their education is over",
      "url": "https://apnews.com/5285d6d302f7c95a584dd8018a8c5a30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17ba74bab6294e73bd6cd9dd3ef31c4e/3000.jpeg"
    },
    {
      "author": "CHRISTOPHE ENA and ANGELA CHARLTON",
      "description": "VATRY, France (AP) — A charter plane grounded in France for a human trafficking investigation is scheduled to leave Monday for India, after an exceptional holiday ordeal that left some 300 Indians en route for Central America blocked inside a rural French airport for four days.",
      "publishedAt": "2023-12-25T09:54:33Z",
      "title": "A plane stuck for days in France for a human trafficking investigation is leaving for India",
      "url": "https://apnews.com/147e6408f2df4ec26a7033cb2c429424",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff4bf411c8794e31944878922f89cfe6/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — The death toll from China’s most powerful earthquake in years has risen to 149, with two people still missing after the tremor hit northwestern parts of the country last week.",
      "publishedAt": "2023-12-25T03:25:34Z",
      "title": "Death toll from China earthquake rises to 149, with 2 still missing",
      "url": "https://apnews.com/220efdf4c3e3ea4f892ea7de910f0174",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f97708419a2d4c48bc1bbd2e112ea0df/3000.jpeg"
    },
    {
      "author": null,
      "description": "LONDON (AP) — King Charles III will give his second Christmas message from Buckingham Palace in front of a live tree decorated with sustainable ornaments.",
      "publishedAt": "2023-12-25T05:05:38Z",
      "title": "King Charles III's annual Christmas message from Buckingham Palace to include sustainable touches",
      "url": "https://apnews.com/659d022ca066c5922fcd1c7b9e970194",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae514437c8b84a588be43bd26e23e365/3000.jpeg"
    },
    {
      "author": null,
      "description": "DUBAI, United Arab Emirates (AP) — Iran’s navy on Sunday added domestically produced sophisticated cruise missiles to its arsenal, state TV reported.The TV said both Talaeieh and Nasir cruise missiles have arrived at a naval base near the Indian Ocean in the southern Iranian port of Konarak, some 1,400 kilometers (850 miles) southeast of the capital, Tehran.",
      "publishedAt": "2023-12-24T10:48:21Z",
      "title": "Iran’s navy adds sophisticated cruise missiles to its armory",
      "url": "https://apnews.com/f9561f9217b27a8718b286628209453f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45d7512cf3b14a808fa10ce0e21005f6/1500.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}