{
  "articles": [
    {
      "author": "SCOTT BAUER",
      "description": "MILWAUKEE (AP) — Vice President Kamala Harris and former President Donald Trump will host dueling rallies within seven miles of one another on Friday night in the Milwaukee area as part of a final push for votes in swing-state Wisconsin's largest county.",
      "publishedAt": "2024-11-01T10:39:09Z",
      "title": "Trump and Harris will both visit the Milwaukee area in a final push to win Wisconsin",
      "url": "https://apnews.com/625bec7c053c449f8ebbd87fc120cf48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47a96d284ff2402aba1915d063628487/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, ADRIANA GOMEZ LICON and MARC LEVY",
      "description": "WASHINGTON (AP) — President Joe Biden tried to explain this week that he doesn’t really think Donald Trump’s supporters are “garbage,” but that doesn't mean that other people don't believe the label occasionally fits.",
      "publishedAt": "2024-11-01T11:00:57Z",
      "title": "Voters view one another across partisan divide with increasing animosity",
      "url": "https://apnews.com/5609afd17f176ed88025c8ae78370218",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4061533e8a143b8818fa5b3982d648c/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO, THOMAS BEAUMONT and TOM KRISHER",
      "description": "WASHINGTON (AP) — Next week’s presidential election isn’t just a referendum on Donald Trump and Kamala Harris.",
      "publishedAt": "2024-11-01T15:21:22Z",
      "title": "Musk tests the role of money in U.S. politics with multimillion-dollar effort to back Trump",
      "url": "https://apnews.com/d6ab6ab796987359ba07da775f4a62e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/246c685920474b2abd93151f8ac944a8/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — America’s employers added just 12,000 jobs in October, a total that economists say was held down by the effects of strikes and hurricanes that left many workers temporarily off payrolls.",
      "publishedAt": "2024-11-01T04:01:26Z",
      "title": "US employers added just 12,000 jobs last month as hurricanes and strikes sharply reduce payrolls",
      "url": "https://apnews.com/dcf54cd3b40f01ca78bccf86cd8e13d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5359c06dcd94fc6b6deac5f487bb25b/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and JULIA FRANKEL",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military launched waves of deadly airstrikes across Lebanon and Gaza, killing at least 24 people in Lebanon's northeast on Friday, the country's state-run National News Agency reported.",
      "publishedAt": "2024-11-01T10:39:22Z",
      "title": "Israel pummels Gaza and Lebanon, killing dozens in latest waves of deadly airstrikes",
      "url": "https://apnews.com/2a01e1da4c4ea1e862a9cc20094e83e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f65cccbe9f74c059340769a626cc733/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY, JULIA FRANKEL and JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — More than a year into a war that has ricocheted across the Middle East, Israeli troops are still battling Hamas in the most heavily destroyed and isolated part of the Gaza Strip.",
      "publishedAt": "2024-11-01T05:01:18Z",
      "title": "Israel fights a seemingly endless war in Gaza's most devastated region",
      "url": "https://apnews.com/20628253b26a2bdcf3c844850f20da38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8df2e139e5184c91bdbc6eae5494a2ec/3000.jpeg"
    },
    {
      "author": "MARGIE MASON and ROBIN McDOWELL",
      "description": "HUNTINGTON, W.Va. (AP) — It was after midnight when she crept down the narrow, dimly lit stairs carrying a bag of dirty laundry. She crossed under a patchwork of pipes and ducts to the far back corner of the basement, as she had done many times before.",
      "publishedAt": "2024-11-01T03:05:53Z",
      "title": "Prison work assignments used to lure and rape female inmates. Guards sometimes walk free",
      "url": "https://apnews.com/001a816334d8745fd29557f02b2f0e5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3e43bc70f544a1bb4cf6cbad881f362/3000.jpeg"
    },
    {
      "author": "JOE WILSON and TERESA MEDRANO",
      "description": "CHIVA, Spain. (AP) — The death toll from historic flash floods in Spain climbed to least 205 people Friday, with many more believed to be missing, as the initial shock gave way to anger, frustration and a wave of solidarity.",
      "publishedAt": "2024-11-01T09:33:35Z",
      "title": "Death toll from Spanish floods climbs to 205 as shock turns to anger and frustration",
      "url": "https://apnews.com/c49df08e233b3f791ed27921acdbb752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6a4a434a1074dd0a1b9ac1fa3f119fc/1920.jpeg"
    },
    {
      "author": "HOLLY RAMER",
      "description": "CONCORD, N.H. (AP) — Whether scenic or slightly sinister — angry werewolf, anyone? — the designs on the front of “I Voted” stickers are attracting a lot of attention this year.",
      "publishedAt": "2024-11-01T06:05:26Z",
      "title": "Creative 'I Voted' stickers branch out beyond the familiar flag design",
      "url": "https://apnews.com/5d3ea40f572a18967273dbf5c9119f81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/891e2fea1e014a66bb1115d349a273d6/1920.jpeg"
    },
    {
      "author": "VANESSA GERA",
      "description": "WARSAW, Poland (AP) — It's the time of year — tradition says — when the veil between the worlds of the living and the dead is lifted.That traditional belief has morphed over the centuries into the spooky and secular celebration of Halloween.",
      "publishedAt": "2024-11-01T09:34:43Z",
      "title": "Spiritual, not spooky. After Halloween, Christians observe All Saints' Day",
      "url": "https://apnews.com/36f7b8599b2336d7c700c532db2e26dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8258ccb877834d5aaf7fee278b3f75cf/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}