{
  "articles": [
    {
      "author": null,
      "description": "The Trump administration is signaling a willingness to renew talks with Iran and avoid a prolonged war. That's in the aftermath of a surprise attack on three of Iran's nuclear sites as U.S. officials assess Tehran’s nuclear ambitions and the threat of retaliation against American interests. President Donald Trump's national security team spoke for him on Sunday. The coordinated messaging suggested a confidence that any fallout from the attack would be manageable and that Iran’s lack of military capabilities would ultimately force it back to the bargaining table.",
      "publishedAt": "2025-06-22T12:50:48Z",
      "title": "US signals a willingness to renew talks with Iran and avoid a prolonged war",
      "url": "https://apnews.com/article/iran-trump-nuclear-sites-strikes-503eb17f991a8509604b4b3aaf93cb5c",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc67e56/2147483647/strip/true/crop/3897x2192+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F5f%2Fbfb10d38c165c64202a8cdc1b0d1%2F5b9f1f128cbd4b4d95058b3847f681f5"
    },
    {
      "author": null,
      "description": "The Iranian state television says that Iran’s underground enrichment site at Fordo has been attacked again. The report, also carried by other Iranian media, offered no word on damage, nor who launched the assault on Monday. However, Israel has been conducted airstrikes throughout the day in Iran. The United States launched a major attack Sunday on three Iranian nuclear sites, including Fordo, which required the use of sophisticated bunker-buster bombs.",
      "publishedAt": "2025-06-23T08:39:17Z",
      "title": "Iran targets Israel with missiles and drones after US strikes",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-trump-bomber-news-06-23-2025-9e78510c88ccc5e262341f41550609c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/77ef267/2147483647/strip/true/crop/6611x3719+0+344/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F82%2F6a4ec8601ce8668bc131d8460f7b%2F2b5d3290d6454d06b22cc7d63d4a4688"
    },
    {
      "author": null,
      "description": "The price of oil rose and U.S. stock futures fell as global markets react to the U.S. strike against nuclear targets in Iran. The price of Brent crude oil, the international standard, rose 3.9% to $80 a barrel. U.S. crude rose 4.3% to $77 a barrel. Futures for the S&P 500 fell 0.5%. Treasury yields fell slightly. On Saturday, U.S. forces attacked three Iranian nuclear and military sites, further increasing the stakes in the war between Israel and Iran.",
      "publishedAt": "2025-06-22T22:09:05Z",
      "title": "Oil rises and US stock futures slide as markets react to US strike on Iran nuclear sites",
      "url": "https://apnews.com/article/stock-market-oil-iran-attack-2d05b0a9e52320e822b649b8e29d28aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c94d39/2147483647/strip/true/crop/7914x4452+0+414/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F90%2F2eecf142336eabf9d44737a36b3e%2F97ee0a90b79b440581a83c1113dd8e1f"
    },
    {
      "author": null,
      "description": "In the days after Hamas attacked Israel on Oct. 7, 2023, Prime Minister Benjamin Netanyahu seemed a shellshocked shadow of himself. The surprise assault caused his public support to plummet. Now, as Israel faces another unprecedented crisis in a war with Iran, Netanyahu appears rejuvenated. With the U.S. lending its support against a threat he has devoted his life to confronting, Netanyahu is demonstrating a resurgent confidence that could signal a new turning point in his lengthy political career. A veteran Israeli journalist said \"Netanyahu has proven that he is a phoenix.”",
      "publishedAt": "2025-06-23T05:03:24Z",
      "title": "Netanyahu's legacy may be reshaped by war with Iran",
      "url": "https://apnews.com/article/iran-us-strikes-israel-netanyahu-ecebee27b2aea360c8fdaf9156ccbf32",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0f9686/2147483647/strip/true/crop/2666x1500+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2Fff%2F647921deda80afc7c086ef2cc2b5%2Ff6189f20543040cfad05588778f9533d"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump and his NATO counterparts are gathering this week for what might be a historic summit. It could also drive a wedge among the 32 member countries. Just a week ago, things had seemed rosy. NATO Secretary-General Mark Rutte was optimistic for an agreement to dedicate 5% of GDP to defense spending. Then Spain rejected the new target, calling it “unreasonable.” The following day, Trump said that America should not have to respect the goal. On Sunday, he ordered the bombing of nuclear installations in Iran, which could dominate the summit. Questions also remain over Ukraine’s place at the meeting.",
      "publishedAt": "2025-06-23T04:31:40Z",
      "title": "NATO summit could be historic or divided",
      "url": "https://apnews.com/article/nato-summit-military-spending-trump-ukraine-iran-17b6d6b193300baa492ef313c9aa629e",
      "urlToImage": "https://dims.apnews.com/dims4/default/0acde0d/2147483647/strip/true/crop/2976x1674+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F4d%2Fb70e4976861dfc8060aaf4047884%2Ff06219d3873343b0a52232207e61e313"
    },
    {
      "author": null,
      "description": "Police say a man who opened fire outside a Michigan church filled with worshippers before he was struck by a vehicle and then fatally shot by security staff had attended services there a couple of times in the last year and his mother was a member. Police identified him as 31-year-old Brian Anthony Browning, who had no prior criminal history. They say people gathered at CrossPointe Community Church in Wayne spotted the man driving recklessly Sunday morning and then saw him exit his vehicle armed and wearing a tactical vest. They say he began firing and a parishioner driving a pickup truck hit him before he was shot.",
      "publishedAt": "2025-06-23T11:35:19Z",
      "title": "Man opened fire outside Michigan church where his mom is member, police say",
      "url": "https://apnews.com/article/wayne-michigan-crosspointe-church-shooting-af786f3f65687f96fc54081e40804f0c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d732805/2147483647/strip/true/crop/4143x2330+0+216/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F21%2F1092a966c9f78d218e6f615d21c7%2F1a29ef344f07409690e2f21c92c9d211"
    },
    {
      "author": null,
      "description": "Tens of millions of people across the eastern and central U.S. are bracing for more days of extreme temperatures as an unusual June heat wave continues to grip parts of the country. National Weather Service forecasts for Sunday call for heat indices in the Chicago area of between 100 and 105 degrees. The heat index in Pittsburgh was expected to reach 105 F. The sweltering temperatures are expected to continue through most of the week.",
      "publishedAt": "2025-06-22T13:43:06Z",
      "title": "Eastern half of U.S. braces for more long days of dangerous heat",
      "url": "https://apnews.com/article/heat-wave-eastern-central-united-states-advisories-d7b93e295c42cdb4787cf95c1f09858b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dc0389/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F16%2Fd60b12f8337ed83489f9c31b951a%2F9377e67aec284343b2e02584945b4d75"
    },
    {
      "author": null,
      "description": "The death toll from an attack on a church in Syria has jumped to 25, state media say. SANA, citing the Health Ministry, said Monday that 63 others were wounded. The attack Sunday on the Mar Elias Greek Orthodox church during a Divine Liturgy in Dweil’a near Damascus was the first of its kind in Syria in years, and comes as Damascus under its de facto Islamist rule is trying to win the support of minorities. Father Fadi Ghattas told The Associated Press after the attack that some 350 people were praying at the church. No group immediately claimed responsibility, but the Syrian Interior Minister has blamed the extremist Islamic State group.",
      "publishedAt": "2025-06-23T11:06:04Z",
      "title": "Mideast governments condemn Syria church bombing as death toll jumps to 25",
      "url": "https://apnews.com/article/syria-church-bombing-damascus-6b50914de4ee3b6944522bf6e3a8dd10",
      "urlToImage": "https://dims.apnews.com/dims4/default/1feb8a0/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F8a%2Fe8cc2e847018315ddab680d68e62%2Fbbe885b981c94136913a097db2d3c77a"
    },
    {
      "author": null,
      "description": "Shai Gilgeous-Alexander finished off his MVP season with 29 points and 12 assists, and the Oklahoma City Thunder pulled away in the second half to beat the Indiana Pacers 103-91 and win the NBA championship. Jalen Williams scored 21 for the Thunder, who were pushed to a Game 7 brink in the NBA Finals — but finished off a season for the ages. Oklahoma City won 84 games between the regular season and the playoffs, tying the 1996-97 Chicago Bulls for third-most in any season. The Pacers lost star Tyrese Haliburton early in Game 7 to a serious lower right leg injury.",
      "publishedAt": "2025-06-22T13:25:01Z",
      "title": "Game 7: Gilgeous-Alexander, Thunder pull away to beat Pacers and win NBA championship",
      "url": "https://apnews.com/article/nba-finals-pacers-thunder-game-7-2489e4d37b7b25dfd3a5f28c9e0fd001",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ed3346/2147483647/strip/true/crop/4866x2737+0+253/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F77%2Fffece60e7db0638151053a806963%2F86a6946de7e14b5c8b7866efcf0952bc"
    },
    {
      "author": null,
      "description": "The Houston Rockets are acquiring 15-time All-Star and four-time Olympic gold medalist Kevin Durant from the Phoenix Suns in a blockbuster deal struck Sunday, according to a person with knowledge of the agreement. The Rockets are giving up Dillon Brooks, Jalen Green and six future picks, according to the person who spoke to The Associated Press on condition of anonymity because the deal was still pending NBA approval. It ends weeks of speculation about where Durant would end up. Many teams were involved at various times, including Miami and Minnesota, but in the end Phoenix took the Rockets’ offer.",
      "publishedAt": "2025-06-22T17:14:40Z",
      "title": "Kevin Durant is going from the Suns to the Rockets in a blockbuster trade, AP source says",
      "url": "https://apnews.com/article/kevin-durant-suns-rockets-trade-0f70dd6296c4093cf6b4f27800ba99cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/dda71b0/2147483647/strip/true/crop/5771x3246+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fc8%2Ffc131e015327e3941e795138fcf4%2F0358cd7b582e4d8283f52a9097c2e954"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}