{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and ABBY SEWELL",
      "description": "JERUSALEM (AP) — Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike on Hezbollah. The militant group responded that it had launched hundreds of rockets and drones to avenge the killing of one of its top commanders last month.",
      "publishedAt": "2024-08-25T02:23:12Z",
      "title": "Israel and Hezbollah trade heavy fire before pulling back, jolting a region braced for war",
      "url": "https://apnews.com/52056075daebc9aac6675043f64439ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8799b7b1e4d44e6daea437a7ea9fff15/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel and Lebanon's Hezbollah on Sunday launched their heaviest exchange of fire after months of strikes and counterstrikes, raising fears of an all-out war that could potentially draw in the United States, Iran and militant groups across the region.",
      "publishedAt": "2024-08-25T09:44:52Z",
      "title": "What to know about the heavy exchange of fire between Israel and Lebanon's Hezbollah",
      "url": "https://apnews.com/d3aeb1826cca2cbcda019f4778947e5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da1b84d64f9e4edc849581c9d8e0606a/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN and DAVID McHUGH",
      "description": "SOLINGEN, Germany (AP) — A 26-year-old man has turned himself into police, saying he was responsible for the Solingen knife attack that left three dead and eight wounded at a festival marking the city’s 650th anniversary, German authorities announced early Sunday.",
      "publishedAt": "2024-08-25T06:33:11Z",
      "title": "German police say a man has turned himself in over Solingen knife attack that killed 3",
      "url": "https://apnews.com/1095235a9dadf6e1005e8adff52d05b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f32b08d9f4ea451a986820d7f2b1b6a7/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "Vice President Kamala Harris' campaign says it has now raised $540 million for its election battle against Republican nominee former President Donald Trump.",
      "publishedAt": "2024-08-25T10:03:40Z",
      "title": "Harris campaign says it has raised $540M, sees surge of donations during DNC",
      "url": "https://apnews.com/43b32b26125229db182234f7ec06da14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/112620023abd4eb6a462b4bc79e08a20/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "NEW YORK (AP) — Kamala Harris accepted the Democratic nomination “on behalf of everyone whose story could only be written in the greatest nation on Earth.” America, Barack Obama thundered, “is ready for a better story.” JD Vance insisted that the Biden administration “is not the end of our story,” and Donald Trump called on fellow Republicans to “write our own thrilling chapter of the American story.”",
      "publishedAt": "2024-08-25T04:01:31Z",
      "title": "Behind the rhetoric, a presidential campaign is a competition about how to tell the American story",
      "url": "https://apnews.com/68aad96e58a7786c2603544f606cf8ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f08b5e0399c4939969c3ba6af6e2b2c/3000.jpeg"
    },
    {
      "author": "MUNIR AHMED",
      "description": "ISLAMABAD (AP) — Two separate bus accidents hours apart in Pakistan on Sunday left at least 35 people dead and dozens more injured, officials said.The first happened when a bus carrying Shiite Muslim pilgrims returning from Iraq through Iran fell from a highway into a ravine in southwest Pakistan, killing at least 12 people and injuring 32 others, police and officials said.",
      "publishedAt": "2024-08-25T07:14:02Z",
      "title": "2 separate bus accidents in Pakistan leave at least 35 people dead, officials say",
      "url": "https://apnews.com/dda87547d3e8a9eac2fe93e9f5bd4533",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1401dfd7233448f1bff11eb0d8c31676/3000.jpeg"
    },
    {
      "author": "SHAFIQUR RAHMAN and JULHAS ALAM",
      "description": "COX'S BAZAR, Bangladesh (AP) — Tens of thousands of Rohingya refugees from Myanmar who live in sprawling camps in Bangladesh on Sunday marked the seventh anniversary of their mass exodus, demanding safe return to Myanmar's Rakhine state.",
      "publishedAt": "2024-08-25T10:27:25Z",
      "title": "Rohingya refugees mark the anniversary of their exodus and demand a safe return to Myanmar",
      "url": "https://apnews.com/ae768a23244e021d07284f8a453434b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42396b490e8e416f9a457f16fe29ab4e/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — Tropical Storm Hone increased to a Category 1 hurricane while continuing its steady approach toward Hawaii late Saturday, forecasters said.Hone (pronounced hoe-NEH) had top winds of 75 mph (120 kph), according to an 11 p.m.",
      "publishedAt": "2024-08-24T04:08:51Z",
      "title": "Tropical Storm Hone increases to Category 1 hurricane strength while approaching Hawaii",
      "url": "https://apnews.com/7c086ba23441e6e69177e3da3d703655",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4acb6d8fe0ee4b10a424cf9afa0c4fa2/2000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "ANCHORAGE, Alaska (AP) — Easter Leafa was sitting under a blanket on her balcony with a knife when Anchorage police arrived, responding to a call for help from her family. Instead of showing her hands as told, they said, the 16-year-old girl stood and approached them with the blade.",
      "publishedAt": "2024-08-25T04:03:24Z",
      "title": "The shooting death of a 16-year-old girl by police is among a spate that's upset Anchorage residents",
      "url": "https://apnews.com/456f54d86ad8e3d60e07ab75eb2fcac6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e3ad5b6251a4d44b913a83e02428111/3000.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON",
      "description": "Isabella Pires first noticed what she calls the “gradual apathy pandemic” in eighth grade. Only a handful of classmates registered for service projects she helped organize at her Massachusetts school.",
      "publishedAt": "2024-08-25T04:17:21Z",
      "title": "Schools are competing with cell phones. Here's how they think they could win",
      "url": "https://apnews.com/4d89f5b7fd7c8f1d5903f8c04f26da54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08aa409189dd4317bf54df0a1f76d18f/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}