{
  "articles": [
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "RAFAH, Gaza Strip (AP) — The head of a Gaza City hospital that treated some of those wounded in the bloodshed surrounding an aid convoy said Friday that more than 80% had been struck by gunfire, suggesting there had been heavy shooting by Israeli troops.",
      "publishedAt": "2024-03-01T14:55:46Z",
      "title": "Gaza doctor says gunfire accounted for 80% of the wounds at his hospital from aid convoy bloodshed",
      "url": "https://apnews.com/86ab114fc0036d0b4fa5a69ed21964c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/585f4bb0a1184755b5eda57f451f18fb/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and KATIE MARIE DAVIES",
      "description": "Under a heavy police presence, thousands of people bade farewell Friday to opposition leader Alexei Navalny at his funeral in Moscow after his still-unexplained death two weeks ago in an Arctic penal colony.",
      "publishedAt": "2024-03-01T05:02:54Z",
      "title": "Putin foe Alexei Navalny is buried in Moscow as thousands attend under heavy police presence",
      "url": "https://apnews.com/9263c4d0688b883fa9f853f5d0310e45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ac2979fd8f2455686d7ade8c354287e/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, JILL COLVIN and COLLEEN LONG",
      "description": "BROWNSVILLE, Texas (AP) — On the banks of the same Rio Grande but 300 miles apart, President Joe Biden and GOP challenger Donald Trump on Thursday surveyed the U.S.-Mexico border and tussled from a distance over who is to blame for the nation's broken immigration system and how to fix it.",
      "publishedAt": "2024-02-29T05:10:02Z",
      "title": "On the Rio Grande, 300 miles apart, Biden and Trump try to use immigration to election advantage",
      "url": "https://apnews.com/42c945d02742b169bde40601a27fde02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bc09a2a04a042b89b9be3fbd87a5683/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY and JIM VERTUNO",
      "description": "STINNETT, Texas (AP) — As the largest wildfire in Texas history engulfed his town, Danny Phillips was left helpless.“We had to watch from a few miles away as our neighborhood burned,” he said, his voice trembling with emotion.",
      "publishedAt": "2024-03-01T05:12:37Z",
      "title": "A Texas town was helpless to watch as the largest wildfire in state history engulfed it",
      "url": "https://apnews.com/fa792a7ad71808c0ca8ec758941e68c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/797924dd553847318891024dce969368/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER, ADRIANA GOMEZ LICON and FREIDA FRISARO",
      "description": "FORT PIERCE, Fla. (AP) — The federal judge overseeing the classified documents prosecution of Donald Trump is expected to set a trial date on Friday, a crucial decision that could affect whether the former president and leading Republican candidate faces a jury this year on charges that he hoarded top secret records and hid them from government investigators.",
      "publishedAt": "2024-03-01T05:05:46Z",
      "title": "Judge in Trump's classified documents case is expected to set a trial date during a crucial hearing",
      "url": "https://apnews.com/37c55a10c4ae304eb673292145cc9cf1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae3f905b5d8d4fcbbeaa06301665c3df/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — After several days of extraordinary testimony, the judge in the Georgia election interference case against former President Donald Trump is set to hear arguments Friday over whether Fulton County District Attorney Fani Willis should be removed from the prosecution over a romantic relationship.",
      "publishedAt": "2024-03-01T05:06:42Z",
      "title": "With salacious testimony finished, legal arguments to begin over Fani Willis' future in Trump case",
      "url": "https://apnews.com/0ede9d18ae072efd6d71f38ea4705beb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e359af32b66e47c19c30b7a19f7caa61/3000.jpeg"
    },
    {
      "author": "MICHAEL HILL",
      "description": "FORT EDWARD, N.Y. (AP) — A man who fatally shot a 20-year-old woman after the SUV she was riding in mistakenly drove into his rural driveway in upstate New York was sentenced Friday to 25 years to life in prison.",
      "publishedAt": "2024-03-01T06:07:00Z",
      "title": "NY man sentenced to 25 years to life for killing woman who wound up in his driveway after wrong turn",
      "url": "https://apnews.com/cdca1723c6ba7afb89102a1e1aaa3fe0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64ce1d5ce5094d8fa8c117b4841686f0/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "A Missouri lawmaker has introduced legislation to clarify that the state’s judges can grant divorces even when one spouse is pregnant.The notion that they can’t already has sparked anger from people who see it as an antiquated policy that controls women unfairly, possibly trapping them in abusive marriages.",
      "publishedAt": "2024-03-01T14:03:40Z",
      "title": "Missouri lawmaker calls to allow divorce during pregnancy. Why can't it happen there already?",
      "url": "https://apnews.com/b623499bf2145f82ff46d91773d45fec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb015484d6774b81852b17ed462c2b87/3000.jpeg"
    },
    {
      "author": "SCOTT SONNER AND OLGA R. RODRIGUEZ",
      "description": "RENO, Nev. (AP) — The most powerful Pacific storm of the season is forecast to bring up to 10 feet (3 meters) of snow into the Sierra Nevada by the weekend, forcing residents to take shelter and prompting Yosemite National Park and at least two Lake Tahoe ski resorts to close.",
      "publishedAt": "2024-03-01T05:57:30Z",
      "title": "Parts of the Sierra Nevada likely to get 10 feet of snow from powerful storm by weekend",
      "url": "https://apnews.com/7f8892b9f253848b47fa15b8a135b569",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/037ff02d5361454ba1c35fdab1ffb44d/2000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Elon Musk is suing OpenAI and its CEO Sam Altman over what he says is a betrayal of the ChatGPT maker's founding aims of benefiting humanity rather than pursuing profits.",
      "publishedAt": "2024-03-01T12:44:06Z",
      "title": "Elon Musk sues OpenAI and CEO Sam Altman, claiming betrayal of its goal to benefit humanity",
      "url": "https://apnews.com/425186c7640aa3d0956e99314a9240e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a29b236243f4f6e85801d6c469da520/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}