{
  "articles": [
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Western leaders descended on Kyiv Saturday to mark the second anniversary of Russia's full-scale invasion of Ukraine.",
      "publishedAt": "2024-02-24T05:59:52Z",
      "title": "European leaders arrive in Kyiv as Ukraine marks 2 years since Russia's full-scale invasion",
      "url": "https://apnews.com/65088ba9eb9bd729cf8c677e2115cb35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3eb0875fc57145bca25b2a6bd9597797/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — The future looks bleak for war-weary Ukraine: It is beset by shortages in soldiers and ammunition, as well as doubts about the supply of Western aid.",
      "publishedAt": "2024-02-24T05:03:56Z",
      "title": "After 2 years of war, questions abound on whether Kyiv can sustain the fight against Russia",
      "url": "https://apnews.com/d0f1c1bd57f7ebbe5f7335738acbc6b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a466c199d0364388bec06310f46a1cf0/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The widow of Russian opposition leader Alexei Navalny accused President Vladimir Putin of mocking Christianity by trying to force his mother to agree to a secret funeral after his death in a penal colony.",
      "publishedAt": "2024-02-24T09:10:53Z",
      "title": "Widow of Navalny accuses Putin of mocking Christianity for refusing to return her husband's body",
      "url": "https://apnews.com/78fa6a0d6792ee868ad41fd672dea510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7602df9b52a048d1b54a4266dd3ca668/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, JAMES POLLARD, MEG KINNARD and BILL BARROW",
      "description": "ROCK HILL, S.C. (AP) — Former President Donald Trump said Friday that he would “strongly support the availability of IVF\" and called on lawmakers in Alabama to preserve access to the treatment that has become a new flashpoint in the 2024 presidential election.",
      "publishedAt": "2024-02-23T19:45:55Z",
      "title": "Ahead of South Carolina primary, Trump says he strongly supports IVF after Alabama court ruling",
      "url": "https://apnews.com/8215336740a5963b57bbd970b47bb3a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72e5c7be2eb74e7eaf6e5a09c79a506a/1920.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Lawmakers began scrambling for ways to protect Alabama in vitro fertilization services after multiple providers paused treatment in the wake of a state Supreme Court ruling that frozen embryos could be considered children under a state law.",
      "publishedAt": "2024-02-23T20:38:41Z",
      "title": "Facing backlash over IVF ruling, Alabama lawmakers look for a fix",
      "url": "https://apnews.com/aec76246aad81bc58cd9e51e422a4521",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a15c2ccc0244d0b9378caa97c513e13/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — An attack by Yemeni Houthi rebels on a Belize-flagged ship earlier this month caused an 18-mile (29-kilometer) oil slick, the U.S. military said Saturday. It also warned of the danger of a spill from the vessel's cargo of fertilizer.",
      "publishedAt": "2024-02-24T09:29:12Z",
      "title": "Oil slick in the Red Sea from a British-owned ship attack by Yemen’s Houthis, US military says",
      "url": "https://apnews.com/89b3f92ae9dd6279b56d945439010a27",
      "urlToImage": ""
    },
    {
      "author": "KEN MILLER, PHILIP MARCELO and JAMIE STENGLE",
      "description": "OKLAHOMA CITY (AP) — A 16-year-old Oklahoma student who died the day after a fight in a high school bathroom was conscious and alert when telling police about the attack by three girls that occurred after the teen squirted them with water, according to police video released Friday.",
      "publishedAt": "2024-02-23T20:39:53Z",
      "title": "Video shows Oklahoma nonbinary teen after attack in school bathroom, the day before their death",
      "url": "https://apnews.com/669bdc63e49929dd40da44416d633fab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d045067de7094d8594948ef028aabf90/2880.jpeg"
    },
    {
      "author": "RUTH BROWN",
      "description": "NEW YORK (AP) — Flaco, the Eurasian eagle-owl who escaped from New York City’s Central Park Zoo and became one of the city’s most beloved celebrities as he flew around Manhattan, has died, zoo officials announced Friday.",
      "publishedAt": "2024-02-24T05:02:46Z",
      "title": "Celebrity owl Flaco dies a year after becoming beloved by New York City for zoo escape",
      "url": "https://apnews.com/e44939489c422379723d9fdec1b8c9db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef3b0eb8ac2147948af99b1323afe249/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The longtime head of the National Rifle Association, Wayne LaPierre, misspent millions of dollars of the organization’s money, using the funds to pay for an extravagant lifestyle that included exotic getaways and trips on private planes and superyachts, a New York jury determined Friday.",
      "publishedAt": "2024-02-23T22:42:12Z",
      "title": "Former NRA chief Wayne LaPierre misspent gun rights group's money, owes more than $4M, jury finds",
      "url": "https://apnews.com/d4d9b950ee2cbd63380826eb2bf210e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/882a5f5d166c47259f94810b49920abc/2798.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A private U.S. lunar lander tipped over at touchdown and ended up on its side near the moon’s south pole, hampering communications, company officials said Friday.",
      "publishedAt": "2024-02-23T16:37:34Z",
      "title": "Private US spacecraft is on its side on the moon with some antennas covered up, the company says",
      "url": "https://apnews.com/14dfdc76176f9f7a6a68a099c98bbbb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52c9dc2f09ee40f1ace106ad2fc4d82c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}