{
  "articles": [
    {
      "author": "RUSS BYNUM, SHARON JOHNSON and BILL BARROW",
      "description": "PLAINS, Ga. (AP) — Johnny Jones found out about Jimmy Carter's death within a matter of minutes. That's how it works in a small town, even for a former U.S.",
      "publishedAt": "2024-12-30T22:03:06Z",
      "title": "Jimmy Carter is being mourned in his tiny hometown and around the world",
      "url": "https://apnews.com/93b2fe6242c20f0d1a78d00fdb13901c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdc3a3bd01aa4d6c883351ec5c4205c9/1920.jpeg"
    },
    {
      "author": "FARAI MUTSAKA and CHRISTINA A. CASSIDY",
      "description": "HARARE, Zimbabwe (AP) — Amid everything else on his desk — the Iran hostage crisis, domestic economic turmoil, the Soviet invasion of Afghanistan and a grueling 1980 reelection fight — President Jimmy Carter elevated the independence of a country in southern Africa as a top agenda item.",
      "publishedAt": "2024-12-31T05:02:27Z",
      "title": "Jimmy Carter sought to expand democracy worldwide long after he left the White House",
      "url": "https://apnews.com/e89d2cf6917bc92cd56b5394580da389",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea376856d266476caff7e20db38332a8/2998.jpeg"
    },
    {
      "author": "BARRY SCHWEID",
      "description": "WASHINGTON (AP) — ___EDITORS: As part of its coverage of the death of former President Jimmy Carter, The Associated Press is looking back at major events in his life.",
      "publishedAt": "2024-12-31T05:04:33Z",
      "title": "AP WAS THERE: Carter announces Middle East peace agreement",
      "url": "https://apnews.com/6cc9a593003f717df4eb8f7576d37398",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ff2ebfb03f246bdbfa5dddafd06be31/3000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — Cities around the world are readying to ring in the New Year with celebrations highlighting local cultures and traditions, after a year roiled by ongoing conflict and political instability.",
      "publishedAt": "2024-12-31T06:04:09Z",
      "title": "Cities across the globe prepare to welcome the New Year in celebrations tinged with local traditions",
      "url": "https://apnews.com/d272e3c02dd0a0c39be1ef06634ff3f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4a897fb9e9a4972a1a31abf2f71ea21/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — A team of U.S. investigators including representatives from Boeing have examined the site of a plane crash that killed 179 people in South Korea while authorities were conducting safety inspections on all Boeing 737-800 aircraft operated by the country’s airlines.",
      "publishedAt": "2024-12-31T10:11:30Z",
      "title": "US and Boeing investigators examine the site of a deadly South Korean plane crash",
      "url": "https://apnews.com/cd5c5dcc45b046dcc94744f2bfd2e3c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/219f96a1a7fa47bcbd4f4317c33bcd17/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel’s military said it intercepted a missile fired toward the country by Yemen’s Houthi rebels, setting off sirens late Monday in central areas including Tel Aviv. The Houthis have been firing drones and missiles at Israel, as well as attacking shipping in the Red Sea corridor — attacks they say won’t stop until Israel agrees to a ceasefire in the Gaza Strip.",
      "publishedAt": "2024-12-30T12:58:38Z",
      "title": "Middle East latest: Israel intercepts Houthi missile fired from Yemen",
      "url": "https://apnews.com/8cc78a0958414b8358a6a28716e16483",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/572051d22723408aa92b8ae6f8861c8f/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — President Joe Biden said Monday that the United States will send nearly $2.5 billion more in weapons to Ukraine as his administration works quickly to spend all the money it has available to help Kyiv fight off Russia before President-elect Donald Trump takes office.",
      "publishedAt": "2024-12-30T15:28:41Z",
      "title": "Biden announces nearly $2.5 billion more in military aid for Ukraine",
      "url": "https://apnews.com/a34bc2204def6c9f5f17cf2ebfcb6bd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40360d70375d4030ac3bf800001fd806/3000.jpeg"
    },
    {
      "author": "STEPHEN McGRATH and AUREL OBREJA",
      "description": "CHISINAU, Moldova (AP) — On a frigid morning in Moldova’s capital, 39-year-old postal worker Petru Murzin braces for a difficult winter as he fears a looming energy shortage could leave many Moldovans with “no heating, no light.”",
      "publishedAt": "2024-12-31T05:03:51Z",
      "title": "'No heating, no light': Moldovans fear looming energy shortage as Russia halts gas supplies",
      "url": "https://apnews.com/3cb90f12ad5274bda67f99a1c4619abf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fde7beb92ed74471a6fedfb2bccdbabb/3000.jpeg"
    },
    {
      "author": "CLAIRE GALOFARO and KIM TONG-HYUNG",
      "description": "Her greatest fear, dormant for decades, came rushing back in an instant: had she adopted and raised a kidnapped child? Peg Reif’s daughter, adopted from South Korea in the 1980s, had sent her a link to a documentary detailing how the system that made their family was rife with fraud: documents falsified, babies switched, children snatched off the street and sent abroad.",
      "publishedAt": "2024-12-31T03:01:09Z",
      "title": "South Korean adoptees and families rocked by fraud allegations",
      "url": "https://apnews.com/fa035f2b7b57358f71e0b7cca4c20f85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57c717fa9e8242958a4cda1dcd14f38d/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Angelina Jolie and Brad Pitt have reached a divorce settlement, apparently ending one of the longest and most contentious divorces in Hollywood history.",
      "publishedAt": "2024-12-31T04:40:40Z",
      "title": "Angelina Jolie and Brad Pitt reach divorce settlement after 8 years",
      "url": "https://apnews.com/61ed3ce6da2258708ee04795a53aeebd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a565be35cd04a849bbfafe1d7ca5e10/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}