{
  "articles": [
    {
      "author": "FATIMA HUSSEIN",
      "description": "The Trump administration is falsely claiming that tens of millions of dead people over 100 years old are receiving improper Social Security payments. Over the past few days, President Donald Trump and billionaire adviser Elon Musk have said on social media and in press briefings that people who are 100, 200 and even 300 years old are improperly getting benefits. Musk called it a “HUGE problem,” as his Department of Government Efficiency digs into federal agencies to root out waste, fraud and abuse. It is true that improper payments have been made, including some to dead people. But the numbers thrown out by Musk and the White House are overstated and misrepresent Social Security data.",
      "publishedAt": "2025-02-19T00:11:18Z",
      "title": "Tens of millions of dead people aren't getting Social Security checks, despite Trump and Musk claims",
      "url": "https://apnews.com/article/social-security-payments-deceased-false-claims-doge-ed2885f5769f368853ac3615b4852cf7",
      "urlToImage": "https://dims.apnews.com/dims4/default/6469ff2/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc4%2F567b096c40357421a58e7ecd5137%2Fddbd03eff35d411db8765dd1e451624b"
    },
    {
      "author": "The Associated Press",
      "description": "President Donald Trump signed an executive order meant to expand access to and reduce costs of IVF. He also issued a presidential memorandum calling for “radical transparency requirements” from the government, which he suggested could reduce wasteful spending.",
      "publishedAt": "2025-02-19T07:36:00Z",
      "title": "Live updates: Trump signs executive order to study how to expand IVF",
      "url": "https://apnews.com/live/trump-presidency-updates-2-19-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/479232b/2147483647/strip/true/crop/6220x3499+0+324/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2Fa5%2F950fb27e8241ea2a8cde2b9f3442%2F5a42854355b449fea974ab4c7779c6b6"
    },
    {
      "author": "Jonel Aleccia",
      "description": "A push to ban sugary drinks, candy and more from the Supplemental Nutrition Assistance Program may soon get a boost from new Trump Administration officials. Robert F. Kennedy Jr., the new health secretary, and Brooke Rollins, the new agriculture secretary, favor stripping such treats from the program previously known as food stamps. The $113 billion SNAP program helps about 42 million low-income Americans pay for nutritious food. Such changes have been proposed many times in past decades, but never approved. But policy experts say this moment could be different. Excluding any foods would require Congress to change the law — or for states to win waivers.",
      "publishedAt": "2025-02-19T14:20:49Z",
      "title": "Trump officials want to ban junk food from SNAP. Past efforts show it's not easy to do",
      "url": "https://apnews.com/article/snap-cuts-candy-soda-food-stamps-b6351b86a17b281b67480fe2d24b54f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/e59cb4f/2147483647/strip/true/crop/7820x4399+0+407/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F68%2Fe1acd6fae504d3d5636466775ffe%2F398676b89247457fa3d983976a10b229"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "President Donald Trump is going further than ever before to enforce his decisions. While orders were sometimes softened or even ignored during his first term, this time he's unwilling to let things slide. The White House summarizes Trump’s approach with the mantra “promises made, promises kept.” Administration officials also say Trump is entitled to impose his vision on the government that he was elected to lead. Others see something darker and more menacing for the country, and they accuse Trump of hollowing out institutions that have defied him in the past.",
      "publishedAt": "2025-02-19T05:01:08Z",
      "title": "Trump imposes his vision on America in departure from first-term stumbles",
      "url": "https://apnews.com/article/donald-trump-white-house-elon-musk-157a40167e63673e2c2f3a15e946a274",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb5cf87/2147483647/strip/true/crop/2613x1470+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fe3%2Fb6f84db18540ad5515dc9530dcef%2F3431098aace84487b3ece39de6d0dfc0"
    },
    {
      "author": "MEG KINNARD",
      "description": "Thousands of federal government employees have been shown the door in the first month of President Donald Trump’s administration. There’s no official figure available of the total firings or layoffs, but The Associated Press has tallied how agencies across the government are being affected, based on AP reporting and statements from lawmakers and employee unions. The job-cutting is affecting more than just the national capital region, which is home to about 20% of the 2.4 million members of the civilian federal workforce. That workforce doesn't include military personnel and postal employees workers. More than 80% of that civilian workforce lives outside the Washington area.",
      "publishedAt": "2025-02-19T14:05:45Z",
      "title": "A comprehensive look at DOGE's firings and layoffs so far",
      "url": "https://apnews.com/article/doge-firings-layoffs-federal-government-workers-musk-d33cdd7872d64d2bdd8fe70c28652654",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc4c334/2147483647/strip/true/crop/5716x3215+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F7c%2Fc74b16d9797ab2de49c83372a787%2Fa4c8677ab9994303bd8b315883e0f752"
    },
    {
      "author": "ANDREW DALTON",
      "description": "Jurors have found rapper A$AP Rocky not guilty of firing a handgun at a former friend on a Hollywood street in 2021. The Los Angeles jury deliberated for about three hours before clearing the hip-hop star on Tuesday of two felony counts of assault with a semiautomatic firearm. The 36-year-old Rocky could’ve legally gotten up to 24 years in prison with guilty verdicts. He took a major gamble when he turned down a plea deal that could have meant just six months in jail. The singing superstar Rihanna is his longtime partner and the mother of his two toddler sons. He dove into her arms when the verdict was read.",
      "publishedAt": "2025-02-18T22:56:27Z",
      "title": "A$AP Rocky dives into Rihanna's arms as not guilty verdict is read at felony assault trial",
      "url": "https://apnews.com/article/asap-rocky-rihanna-shooting-verdict-la-trial-203067f305f85afab734f1975723ff04",
      "urlToImage": "https://dims.apnews.com/dims4/default/7cfac0a/2147483647/strip/true/crop/4308x2423+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2F40%2F67c266e547592d6cafdf96dd7ef8%2F195e902cca52490885cf540c116fcf9d"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "After devastating wildfires tore through Los Angeles, the 97th Academy Awards are going forward. More stars were added to the presenter lineup Wednesday, including Selena Gomez, Oprah Winfrey, Goldie Hawn, Ben Stiller, Ana de Armas, Sterling K. Brown, Willem Dafoe, Lily-Rose Depp and Connie Nielsen. A previous announcement said last year’s acting winners will return to the Oscar stage. Those include Emma Stone, Robert Downey Jr., Cillian Murphy and Da’Vine Joy Randolph Joy. The 97th Academy Awards will be held on Sunday, March 2, at the Dolby Theatre in Los Angeles. Also for the first time, the Oscars will be streamed live on Hulu.",
      "publishedAt": "2025-02-05T18:46:59Z",
      "title": "Everything to know about the 2025 Oscars",
      "url": "https://apnews.com/article/oscars-academy-awards-2025-what-to-know-54e7e352c7e2b81d3468744965fa0299",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f564d6/2147483647/strip/true/crop/3000x1688+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F34%2F05b6a1a221e5ebdf3de8fe53eb6b%2F2d37fda7075a4bd5a0417ba99b27866e"
    },
    {
      "author": "JUSTIN SPIKE, HANNA ARHIROVA",
      "description": "Ukraine President Volodymyr Zelenskyy says U.S. President Donald Trump is living in a Russian-made “disinformation space” as a result of his administration’s discussions with Kremlin officials. Trump suggested Tuesday that Ukraine was to blame for the war on its territory, which enters its fourth year next week. Zelenskyy spoke as Trump's envoy, Keith Kellogg, arrived in Kyiv for talks. Talks between top American and Russian diplomats in Saudi Arabia on Tuesday sidelined Ukraine and its European supporters. Trump’s comments marked a major shift in U.S. policy after years of efforts to isolate Russian President Vladimir Putin and are likely to vex Ukrainian officials.",
      "publishedAt": "2025-02-19T09:26:37Z",
      "title": "Trump is living in a Russian 'disinformation space,' says Zelenskyy",
      "url": "https://apnews.com/article/russia-ukraine-war-kellogg-zelenskyy-437f4c8fa4531059007dd3ab00c23458",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f7a422/2147483647/strip/true/crop/4510x2537+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2Fa5%2F69f5efbd4d1536e1086433991451%2F0a228c468c9d4ffb8a668a67696e9dbb"
    },
    {
      "author": "NICOLE WINFIELD, ANDREA ROSA, PAOLO SANTALUCIA",
      "description": "Italian Premier Giorgia Meloni has visited Pope Francis in the hospital and says he’s “alert and responsive” and full of good humor despite his pneumonia. In a statement issued by her office, Meloni said: ”We joked around as always. He has not lost his proverbial sense of humor.” Her visit marked the first confirmed outside visitor known to have called on the pope, beyond his secretaries and medical team, since his hospitalization Friday. The Vatican has said Francis, who had part of one lung removed as a young man, was up, eating and had gotten out of bed after a tranquil night, a day after tests confirmed he had pneumonia in both lungs on top of asthmatic bronchitis.",
      "publishedAt": "2025-02-19T07:31:47Z",
      "title": "Italian Premier Meloni visits Pope Francis in hospital and says he's in good spirits",
      "url": "https://apnews.com/article/pope-francis-vatican-respiratory-health-gemelli-rome-4afa8ce660cd74b30df15581adcf4239",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fda3be/2147483647/strip/true/crop/7241x4073+0+377/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F1c%2F12fbaf2606fa9beb3e6d5ab43f34%2F71ce521e48904e319880e5f9e910b2c6"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "Tens of thousands of Palestinians have fled home following recent Israeli military operations across the northern West Bank. They have traveled by car and on foot, through muddy olive groves and snipers’ sight lines, in the occupied territory's largest displacement since the 1967 Mideast war. After announcing a widespread crackdown against West Bank militants on Jan. 21, Israeli forces descended on the city of Jenin, as they have dozens of times since Hamas’ Oct. 7, 2023, attack on Israel. Soldiers then pushed deeper and more forcefully into several other nearby towns, scattering families and stirring bitter memories of the 1948 war over Israel’s creation. During that war, 700,000 Palestinians fled or were forced from their homes in what Palestinians call the Nakba, or “catastrophe.”",
      "publishedAt": "2025-02-19T06:40:29Z",
      "title": "Palestinian families flee West Bank homes in droves as Israel confronts militants",
      "url": "https://apnews.com/article/israel-palestinians-west-bank-gaza-militants-displaced-2fb430ce6eeeff40b416df566712eb99",
      "urlToImage": "https://dims.apnews.com/dims4/default/47da77c/2147483647/strip/true/crop/5004x2815+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F06%2Fbdd0e13936dcae6e9b0248c1535e%2F2fab4d7e063144c0ab27e081fe61b9ec"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}