{
  "articles": [
    {
      "author": null,
      "description": "SAO PAULO (AP) — Brazilian airline VoePass says 62 people were aboard plane that crashed in Sao Paulo state.",
      "publishedAt": "2024-08-09T17:44:34Z",
      "title": "Brazilian airline VoePass says 62 people were aboard plane that crashed in Sao Paulo state",
      "url": "https://apnews.com/9c714a868d0691159acd369fbd5bb473",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "SAINT-DENIS, France (AP) — US women win 4x100 Olympic relay giving anchor Sha'carri Richardson her first Olympic gold medal.",
      "publishedAt": "2024-08-09T17:36:08Z",
      "title": "US women win 4x100 Olympic relay giving anchor Sha'carri Richardson her first Olympic gold medal",
      "url": "https://apnews.com/6a7f7bebea4377a39052da29fe9a13a1",
      "urlToImage": ""
    },
    {
      "author": "LISA RATHKE and DAVID SHARP",
      "description": "BARRE, Vt. (AP) — The remnants of Debby raced northward on Friday, picking up speed with lashing rain, flash flooding and the threat of tornadoes, after causing at least eight deaths over a multi-day path up the East Coast.",
      "publishedAt": "2024-08-09T05:04:14Z",
      "title": "Remnants of Debby threaten the Northeast with flooding, possible tornadoes",
      "url": "https://apnews.com/30ce7215d31b651f4fb575e9dde5d63e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0e8f3110c404685b9d275d4eeeac833/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Lebanon’s militant Hezbollah group launched one of its deepest strikes into Israel in mid-May, using an explosive drone that scored a direct hit on one of Israel’s most significant air force surveillance systems.",
      "publishedAt": "2024-08-09T16:08:59Z",
      "title": "The threat Israel didn't foresee: Hezbollah's growing drone power",
      "url": "https://apnews.com/e1c0fdc0c963d57c0580d593d824ed8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7cb88f7c1174550b310811d962e40ff/3000.jpeg"
    },
    {
      "author": null,
      "description": "SAO PAULO (AP) — A plane able to carry dozens of passengers crashed in Brazil's Sao Paulo state on Friday, local media reported, but it was not immediately clear how many people were aboard.The local firefighters corps confirmed that the plane fell in the city of Vinhedo, but did not offer more details.",
      "publishedAt": "2024-08-09T17:15:53Z",
      "title": "Passenger plane crashes in Brazil's Sao Paulo state. It's unclear how many people were aboard",
      "url": "https://apnews.com/394427322513643f4eaf517e4ac4c85e",
      "urlToImage": ""
    },
    {
      "author": "ALANNA DURKIN RICHER and CLAUDIA LAUER",
      "description": "WASHINGTON (AP) — In the chaotic aftermath of the attempted assassination of Donald Trump at a Pennsylvania rally last month, a local police officer told a fellow officer he had warned the Secret Service days earlier that the building where the 20-year-old gunman opened fire needed to be secured.",
      "publishedAt": "2024-08-09T17:19:02Z",
      "title": "Body camera footage shows local police anger at Secret Service after Trump assassination attempt",
      "url": "https://apnews.com/c1c5c68e55ae3cfb69ef886894e508ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1d6cc3a95614b68907bce5ba5dcb8a6/1920.jpeg"
    },
    {
      "author": "GABRIEL SANDOVAL and NICHOLAS RICCARDI",
      "description": "PHOENIX (AP) — Vice President Kamala Harris and her new running mate will hold a rally in Arizona on Friday as part of their tour of electoral battlegrounds, visiting a state where Harris passed over a prominent Democrat in favor of Minnesota Gov.",
      "publishedAt": "2024-08-09T04:06:04Z",
      "title": "The latest battleground stop for Harris and Walz is Arizona, where a VP runner-up could still matter",
      "url": "https://apnews.com/44001d0be6b5d4ecc911ad06684421c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43726285bf8540eaa43f9635cf3c8e45/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "PARIS (AP) — Breanna Stewart scored 16 points and the U.S. women advanced to their eighth consecutive Olympic gold medal game with a 85-64 victory over Australia on Friday.The Americans, who extended their Olympic winning streak to 60 consecutive games, will face either France or Belgium on Sunday.",
      "publishedAt": "2024-08-09T17:08:36Z",
      "title": "Breanna Stewart, US women's basketball team advances to gold medal game at Paris Olympics",
      "url": "https://apnews.com/5d8cf605882a080da9fb0e1615539fd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2a1fc4ca7f94d739fc59f990544acf8/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Russia declared a “federal-level” emergency in the Kursk region following a large-scale incursion from Ukraine and sent reinforcements there on Friday, four days after hundreds of Ukrainian troops poured across the border in what appeared to be Kyiv’s biggest attack on Russian soil since the war began.",
      "publishedAt": "2024-08-09T10:49:48Z",
      "title": "Russia declares an emergency in Kursk, under attack by Ukraine. 14 die in a Russian strike on a mall",
      "url": "https://apnews.com/3eba46949e065fac9d846987a106e17a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c527ce54d43417280a69f4d642900ee/3000.jpeg"
    },
    {
      "author": "GRAHAM LEE BREWER",
      "description": "If Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz, are elected this fall, not only would a woman of color lead the country for the first time, but a Native woman would govern a state for the first time in U.S.",
      "publishedAt": "2024-08-09T04:09:39Z",
      "title": "A win for the Harris-Walz ticket would also mean the country's first Native American female governor",
      "url": "https://apnews.com/e7cc4d86845e827b6c5c64604b0f319c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be920649d1d441309b3d047ba978892b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}