{
  "articles": [
    {
      "author": "JOHNSON LAI and KANIS LEUNG",
      "description": "HUALIEN, Taiwan (AP) — Rescuers searched for dozens of people out of contact Thursday a day after Taiwan's strongest earthquake in a quarter century damaged buildings, caused multiple rockslides and killed nine people.",
      "publishedAt": "2024-04-04T03:17:52Z",
      "title": "Rescuers search for people out of contact in Taiwan after strong earthquake",
      "url": "https://apnews.com/f7e6df36441dc3cde69038e0744aa01d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c1c81fc7d984c1aa90f49830b2b32ce/3000.jpeg"
    },
    {
      "author": "MOHAMMAD JAHJOUH and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — The bodies of six foreign aid workers killed in Israeli airstrikes began the journey back to their home countries Wednesday as more questions swirled over Israel's explanation that a “misidentification” led to the attack on their convoy.",
      "publishedAt": "2024-04-03T12:30:29Z",
      "title": "Bodies of 6 foreign aid workers slain in Israeli strikes are transported out of Gaza",
      "url": "https://apnews.com/3e379f56a6153c347179e3e99823c407",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b61aaf6421004bad91582a68a7f7d7ed/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Shortly after an airstrike widely attributed to Israel destroyed an Iranian consulate building in Syria, the United States had an urgent message for Iran: We had nothing to do with it.",
      "publishedAt": "2024-04-03T20:33:55Z",
      "title": "US braces for retaliation after attack on Iran consulate — even as it says it wasn't involved",
      "url": "https://apnews.com/a083ddef0db28cde2a6fdd84e0a56367",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/240048e8292746e98e0e456fcb13f97f/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A judge on Wednesday rejected Donald Trump's bid to delay his April 15 hush money criminal trial until the Supreme Court rules on presidential immunity claims he raised in another of his criminal cases — spurning another of the former president's ploys to put off the historic trial.",
      "publishedAt": "2024-04-03T20:45:16Z",
      "title": "Judge rejects Donald Trump's request to delay hush-money trial until Supreme Court rules on immunity",
      "url": "https://apnews.com/0703a3406016cf971fb07c0a211fd38e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fefcc41578d4edcb30392d1681387ce/2538.jpeg"
    },
    {
      "author": "JILL COLVIN and WILL WEISSERT",
      "description": "NEW YORK (AP) — When Donald Trump first ran for the White House eight years ago, protesters filled the streets.",
      "publishedAt": "2024-04-03T19:41:33Z",
      "title": "Trump's events aren't drawing big protests this year. Instead, Biden is facing public ire",
      "url": "https://apnews.com/da5fa786c6c3a40c207711d31ee06982",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3df4287ad59b433e88d459c421ca9951/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "JOINT BASE ELMENDORF-RICHARDSON, Alaska (AP) — Treasury Secretary Janet Yellen is headed to a China determined to avoid open conflict with the United States, yet the world's two largest economies still appear to be hashing out the rules on how to compete against each other.",
      "publishedAt": "2024-04-04T04:04:18Z",
      "title": "Treasury secretary heads to China to talk trade, anti-money laundering and Chinese 'overproduction'",
      "url": "https://apnews.com/f68bfec543be2b1e50d72d4dca4fea45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d3ad04fb02745a5bfa386db6dd3bb5f/3000.jpeg"
    },
    {
      "author": "ELAINE KURTENBACH",
      "description": "LUANG PRABANG, Laos (AP) — Senior finance and central bank officials from Southeast Asia and major economies met Thursday in the scenic Laotian city of Luang Prabang to discuss ways to help the region build resilience against shocks like the COVID-19 pandemic and natural disasters brought on by climate change.",
      "publishedAt": "2024-04-04T04:04:41Z",
      "title": "Southeast Asian countries consider ways to boost 'green financing' as region chokes on smog",
      "url": "https://apnews.com/1ace94cd47b8e6bba3d6e79d24e84847",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cfaa5ab607947b899fd72c83f8c008f/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russia's defense minister warned his French counterpart against deploying troops to Ukraine in a rare phone call Wednesday and noted that Moscow is ready to take part in talks to end the conflict.",
      "publishedAt": "2024-04-03T22:20:33Z",
      "title": "In rare call, Russian defense minister warns French counterpart against sending troops to Ukraine",
      "url": "https://apnews.com/d186c35f86b68127d1456459002052e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff1423d55e214a3c9b09fc72a0ce957f/3000.jpeg"
    },
    {
      "author": null,
      "description": "DES MOINES, Iowa (AP) — The Powerball jackpot has increased to an estimated $1.23 billion after another drawing without a big winner Wednesday night.The numbers selected were: 11, 38, 41, 62, 65 and the Powerball 15.",
      "publishedAt": "2024-04-03T05:05:18Z",
      "title": "Powerball jackpot jumps to $1.23 billion after another drawing without a big winner",
      "url": "https://apnews.com/d7c891f53694de644a6f2b1edf5b2875",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4eb12224d2d9427ca4e0b9830d1ebb19/1920.jpeg"
    },
    {
      "author": "JACQUELINE LARMA and ENRIC MARTI",
      "description": "If she had lived, there would have been so many more photos.Anja could have gone to Kabul for the chaotic U.S. withdrawal, and to war-shattered Ukraine after the Russian invasion. She would have been at the Olympics, and at center court at Wimbledon.",
      "publishedAt": "2024-04-03T16:07:08Z",
      "title": "AP PHOTOS: 10 years after her killing, Anja Niedringhaus' images speak for her",
      "url": "https://apnews.com/f8e530c88c72aa173c4f39cbd9697896",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1116927d0d0a415799bf99ed8fba20a1/2385.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}