{
  "articles": [
    {
      "author": null,
      "description": "Up all night, House Republicans voted pre-dawn to advance President Donald Trump’s tax and spending cuts package. The House is now starting a round of debates ahead of a final vote expected later Thursday morning. GOP leaders worked almost around the clock trying to persuade skeptical holdouts. Trump worked the phones as Republicans race to send the bill to his desk by the Fourth of July deadline. Speaker Mike Johnson had recalled lawmakers to Washington, eager to seize on the momentum of the 887-page bill's passage the day before in the Senate. Some GOP lawmakers are criticizing the legislation as straying from the party's fiscal goals. Johnson expects votes later Thursday morning.",
      "publishedAt": "2025-07-03T07:54:06Z",
      "title": "House GOP clears key hurdle on Trump's big bill, pushing it closer to vote",
      "url": "https://apnews.com/article/trump-big-beautiful-gop-taxes-ced365c347de9320eef2ccb8df16dda2",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f62811/2147483647/strip/true/crop/5803x3264+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F17%2F034bb11eaf5781d2c79435146a61%2F2a4fdc853eb544efaf189d0d42a565c6"
    },
    {
      "author": null,
      "description": "Rescuers in Indonesia were searching for 29 people who were missing after a ferry sank and five people died near the resort island of Bali. The National Search and Rescue Agency says the KMP Tunu Pratama Jaya sank late Wednesday after leaving Ketapang port in the East Java town of Banyuwangi. The ferry was on a 5-kilometer trip to Bali’s Gilimanuk port. As of Thursday afternoon, 31 people had been rescued from the ferry’s 53 passengers and 12 crew members. Indonesian authorities are investigating the cause of the accident. Survivors told rescuers there appeared to be a leak in the engine room.",
      "publishedAt": "2025-07-03T00:37:18Z",
      "title": "Rescuers find 31 survivors after ferry sinks near Bali",
      "url": "https://apnews.com/article/ferry-sinking-bali-indonesia-c341cc2834693c90ac1a5af1015ecb3a",
      "urlToImage": "https://dims.apnews.com/dims4/default/4809ef1/2147483647/strip/true/crop/5135x2888+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2Fee%2F5d55be58e44c40d960e13a4a7348%2Fb6b154e73fa442a8862f3e159034d997"
    },
    {
      "author": null,
      "description": "The steady slowdown in U.S. hiring likely continued in June as President Donald Trump’s trade wars, federal hiring freeze and immigration crackdown weighed on the American job market. When the Labor Department on Thursday releases job numbers for last month, they’re expected to show that businesses, government agencies and nonprofits added 115,000 jobs in June, down from 139,000 in May. The unemployment rate is expected to have ticked up to 4.3%, which would be the highest since October 2021. The U.S. job market has cooled considerably from the red-hot days of 2021-2023. So far this year employers have added an average 124,000 jobs a month, down from 168,000 in 2024 and a 2021-2023 average of 400,000.",
      "publishedAt": "2025-07-03T04:01:36Z",
      "title": "Closely watched US jobs report likely to show hiring slowed in June",
      "url": "https://apnews.com/article/jobs-economy-unemployment-trump-tariff-hiring-1d0ff530d9704e1dd5f4c08205dc0d21",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d13de6/2147483647/strip/true/crop/4835x2720+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F32%2Fc69f3c5d0459ccf5105f187974a5%2Fd4b64980be9d40e3bd8ec13f9a4713f4"
    },
    {
      "author": null,
      "description": "Airstrikes and shootings in Gaza have killed 94 Palestinians overnight, according to Gaza’s Health Ministry on Thursday. Among the dead, 45 were attempting to get humanitarian aid. Dozens of people were killed in airstrikes that pounded tents and a school sheltering displaced people in the Strip Wednesday night and Thursday morning. The ministry states over 57,000 Palestinians have died since the war began on October 7, 2023, with more than half being women and children. The deaths come as Israel and Hamas inch closer to a possible ceasefire that would end the 21-month war.",
      "publishedAt": "2025-07-03T07:21:20Z",
      "title": "82 Palestinians killed in Gaza, including 38 waiting for aid, authorities say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-07-03-2025-7bed9df1b8a5278631ae844c18ace2b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/2149152/2147483647/strip/true/crop/6659x3746+0+347/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Fa2%2F9c2dc746eea5f6d3df4211a62da2%2Fca0d521c42e64d86a1a2c52a88c0abde"
    },
    {
      "author": null,
      "description": "American contractors guarding aid distribution sites in Gaza are using live ammunition and stun grenades as hungry Palestinians scramble for food, according to accounts and videos obtained by The Associated Press. Two U.S. contractors, speaking to the AP on condition of anonymity because they were revealing their employers’ internal operations, said they were coming forward because they were disturbed by what they considered dangerous and irresponsible practices. The contractor who provided the videos said the bullets were fired in all directions — in the air, into the ground and at times towards the Palestinians. The testimonies offer a rare glimpse inside an often-chaotic scene at these sites.",
      "publishedAt": "2025-07-02T19:48:54Z",
      "title": "Two US contractors describe chaos and gunfire as Palestinians seek food in Gaza",
      "url": "https://apnews.com/article/palestinians-israel-gaza-contractors-aid-distribution-fe27f3ea83e06a09d66424eed7a5d56f",
      "urlToImage": "https://dims.apnews.com/dims4/default/515095a/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F21%2Fb93af4f74b8f7fdf09773c18aa1d%2F5ba486a526ca4bb494091ae32fe7aec4"
    },
    {
      "author": null,
      "description": "Liverpool player Diogo Jota and his brother have died in a car accident in Spain, police said Thursday. The Spanish civil guard confirmed to The Associated Press that Jota and his brother were found dead after their car went off a road near the western city of Zamora. Police were investigating the causes. They said there were no other vehicles involved. The 28-year-old Jota and his brother, 25-year-old Andre Silva, both Portuguese players, were in the car. Jota also played for Portugal’s national team. Silva played with Portuguese club Penafiel in the lower divisions.",
      "publishedAt": "2025-07-03T08:49:42Z",
      "title": "Liverpool player Diogo Jota and his brother die in car accident",
      "url": "https://apnews.com/article/diogo-jota-liverpool-d7df70a74100e52ee28aa2810d6673d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/3b30c51/2147483647/strip/true/crop/4030x2267+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F85%2Faf9ea30bebd317cf4751c2e5c363%2F8bdb5ba1e70a4b7c8f36aa1a8d73864e"
    },
    {
      "author": null,
      "description": "The jury in Sean “Diddy” Combs’ sex trafficking trial is set to resume deliberations. The jury reached a verdict Tuesday on all but one of the five counts the hip-hop mogul faces. Judge Arun Subramanian ordered the jury to continue deliberating for a third day on Wednesday. The jury said Tuesday it was unable to reach consensus on the top charge of racketeering conspiracy. It indicated it had already decided about other charges, including sex trafficking. Subramanian, prosecutors and Combs’ defense team said less than 13 hours of deliberations was too soon to give up on reaching a verdict on all counts. The jury's partial verdict remains under wraps for now.",
      "publishedAt": "2025-07-02T05:05:27Z",
      "title": "Jury in Diddy's sex trafficking trial to resume deliberations after reaching partial verdict",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-jury-deliberations-a9358ff8917e96874f027872e07cd9a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d03410e/2147483647/strip/true/crop/4905x2759+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F80%2F09a6b0c1f96f0fd7919de74d9b2f%2Feac8d5a12d124ca885a751f871fa203c"
    },
    {
      "author": null,
      "description": "Police say four people have died from gunshot wounds and 14 others have been hospitalized following a drive-by shooting in Chicago. At least three were in critical condition. The shooting happened late Wednesday in Chicago’s River North neighborhood. Several media outlets say it happened outside a restaurant and lounge that had hosted an album release party for a rapper. Police said early Thursday that no one was in custody. Preliminary information from police said 13 women and five men ranging in age from 21 to 32 were shot, and that the dead included two men and two women.",
      "publishedAt": "2025-07-03T05:43:40Z",
      "title": "Chicago shooting leaves 4 dead and 14 wounded, police say",
      "url": "https://apnews.com/article/chicago-shooting-2f47e213cae908d6a52439e5cdae44f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/29ac327/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2Ff3%2F77bb9b48604ffd21227abf10e299%2F39c8dc9d35984841bfb66314aee4a2c4"
    },
    {
      "author": null,
      "description": "A Kurdish militant group has announced plans to start disarming as part of a peace process with Turkey. The Kurdistan Workers’ Party, or PKK, says its fighters in northern Iraq will begin handing over their weapons next week a ceremony in Iraq’s Kurdish region. Around 40 fighters are set to surrender their weapons. This marks the first concrete step toward disarmament after decades of conflict. The PKK announced in May it would disband and renounce armed conflict, ending four decades of hostilities. Group leader Abdullah Ocalan, who has been imprisoned since 1999, called for disarmament earlier this year.",
      "publishedAt": "2025-07-03T11:03:28Z",
      "title": "Kurdish fighters in northern Iraq to hand over weapons in first step toward disarmament",
      "url": "https://apnews.com/article/pkk-iraq-turkey-peace-process-disarmament-8362d25a38455371775ba1e03c4602a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/a7621be/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2Fb3%2F2b0f27bd9104bd83876b62ea8488%2F0b175cb9a81b4599bc8d9501e6a4558d"
    },
    {
      "author": null,
      "description": "Denmark is launching its presidency of the European Union with a ceremony on Thursday in the western city of Aarhus. Its six months at the EU's helm comes against a backdrop of conflict in Ukraine and chaos caused by U.S. President Donald Trump’s global tariff war. Presidencies rotate between the 27 EU member countries every six months. The nation in charge sets policy priorities and organizes the working agenda. It's meant to be an “honest broker” who sets aside national interests for the greater good. Denmark’s holding its term under the motto “A Strong Europe in a Changing World.” It says Europe must take charge of its own security by 2030 and boost economic competitiveness.",
      "publishedAt": "2025-07-03T09:08:29Z",
      "title": "Denmark launches its EU presidency facing war in Ukraine and Trump tariff chaos",
      "url": "https://apnews.com/article/europe-denmark-presidency-priorities-russia-trump-tariffs-c382bfd0b26df65e95073a0278e52463",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e27319/2147483647/strip/true/crop/1936x1089+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F19%2Fc4422fdc3e1f25a1a7fdf340adb8%2F811956dfd82243bb9768fbeefd3eb9fb"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}