{
  "articles": [
    {
      "author": null,
      "description": "LOS ANGELES (AP) — At least 2,000 people have been arrested at pro-Palestinian protests on US campuses since April 18, AP tally shows.",
      "publishedAt": "2024-05-02T18:01:38Z",
      "title": "At least 2,000 people have been arrested at pro-Palestinian protests on US campuses since April 18, AP tally shows",
      "url": "https://apnews.com/af98233faf0f23bfd36fea83ca01645a",
      "urlToImage": ""
    },
    {
      "author": "RYAN PEARSON, ETHAN SWOPE, JAKE OFFENHARTZ and JOSEPH B. FREDERICK",
      "description": "LOS ANGELES (AP) — Police arrested pro-Palestinian protesters on college campuses across the country overnight, notably at the University of California, Los Angeles, where chaotic scenes played out early Thursday as officers in riot gear surged against a crowd of demonstrators.",
      "publishedAt": "2024-05-02T04:03:30Z",
      "title": "Police make dozens of arrests at UCLA in tense clashes with Israel-Hamas war protesters",
      "url": "https://apnews.com/ec3f62c51c08599f8fcecd99f7cf9e33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0366565317a040f5ac3c57d4da004bb6/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden on Thursday rejected calls from student protesters to change his approach to the war in Gaza while insisting that “order must prevail” as college campuses across the country face a wave of violence, outrage and fear.",
      "publishedAt": "2024-05-02T04:19:56Z",
      "title": "Biden says 'order must prevail' during campus protests over the war in Gaza",
      "url": "https://apnews.com/d5f3092671951c3bc2968b8751c93ba6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/792aa2bad138459c8d5dbbc1c89c86c6/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE, LEE KEATH and SAM MEDNICK",
      "description": "BEIRUT (AP) — Hamas said Thursday that it was sending a delegation to Egypt for further cease-fire talks, in a new sign of progress in attempts by international mediators to hammer out an agreement between Israel and the militant group to end the war in Gaza.",
      "publishedAt": "2024-05-02T11:12:13Z",
      "title": "Hamas is sending a delegation to Egypt for further cease-fire talks in the latest sign of progress",
      "url": "https://apnews.com/0699ef663cba7318c375c0ee5bbf20ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e69b2e50760946b7a3d682a9504e6ccc/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, PHILIP MARCELO, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A lawyer who negotiated a pair of hush money deals at the center of Donald Trump's criminal trial recalled Thursday his “gallows humor” reaction to Trump's 2016 election victory and the realization that his hidden-hand efforts might have contributed to the win.",
      "publishedAt": "2024-05-02T04:03:50Z",
      "title": "'What have we done?' Lawyer describes shock at possible role in Trump's 2016 victory",
      "url": "https://apnews.com/fe6995afbc96650b67f46d813ab05f06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f8e13db87b041beb6b8a9ad343505e9/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Two years after a leaked draft of a U.S. Supreme Court opinion signaled that the nation's abortion landscape was about to shift dramatically, the issue is still consuming the nation's courts, legislatures and political campaigns — and changing the course of lives.",
      "publishedAt": "2024-05-02T04:12:21Z",
      "title": "Abortion is still consuming US politics and courts 2 years after a Supreme Court draft was leaked",
      "url": "https://apnews.com/9ee070c3540cb730b251d707e5f98ffc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60986915986f4ad58aba0fab284879ef/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "FORT LIBERTY, N.C. (AP) — The video is unsettling, with haunting images of faceless people, fire and soldiers. The voiceover is a cascade of recognizable historical voices as the screen pulses cryptic messages touting the power of words, ideas and “invisible hands.”",
      "publishedAt": "2024-05-02T04:31:30Z",
      "title": "Faceless people, invisible hands: New Army video aims to lure recruits for psychological operations",
      "url": "https://apnews.com/f216951fdaff4fa0130386a8f85c76e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e335fbbf17534b94a18b1113a36b0aab/2560.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — A bipartisan group of senators is pushing for restrictions on the use of facial recognition technology by the Transportation Security Administration, saying they are concerned about travelers' privacy and civil liberties.",
      "publishedAt": "2024-05-02T13:05:23Z",
      "title": "Senators want limits on the government's use of facial recognition technology for airport screening",
      "url": "https://apnews.com/7b97462591c49184d1cb19cda9c95211",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/440031f6b93e4fc9b8e5a2a6275b83ba/3000.jpeg"
    },
    {
      "author": "BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — Maryland plans to rebuild the Francis Scott Key Bridge in just over four years at an estimated cost between $1.7 billion and $1.9 billion, a state transportation official said Thursday.",
      "publishedAt": "2024-05-02T11:54:49Z",
      "title": "Maryland officials release timeline, cost estimate, for rebuilding bridge",
      "url": "https://apnews.com/cdd8441c5dff48028d1e141b943ca31e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b51c3010090740158c06416286ac9477/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "KYIV, Ukraine (AP) — At a Ukrainian power plant repeatedly hit by Russian aerial attacks, equipment department chief Oleh has a one-word answer when asked what Ukraine’s battered energy industry needs most: “Patriot.”",
      "publishedAt": "2024-05-02T15:01:58Z",
      "title": "Send us Patriots: Ukraine's battered energy plants seek air defenses against Russian attacks",
      "url": "https://apnews.com/d02555dd2e4f3f7c6447f26085ae4eb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e123b08a3524388940167d0b1003285/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}