{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel has essentially endorsed a framework of a proposed Gaza cease-fire and hostage release deal, and it is now up to Hamas to agree to it, a senior U.S.",
      "publishedAt": "2024-03-02T12:12:07Z",
      "title": "US says Israel has agreed to the framework for a Gaza cease-fire. Hamas must now decide",
      "url": "https://apnews.com/531593c27931a2764357b6f7b11ce394",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3add734fc214229b2fadfbe6f35e008/1920.jpeg"
    },
    {
      "author": "TARA COPP and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — U.S. military C-130 cargo planes dropped food in pallets over Gaza on Saturday in the opening stage of an emergency humanitarian assistance authorized by President Joe Biden after more than 100 Palestinians who had surged to pull goods off an aid convoy were killed during a chaotic encounter with Israeli troops.",
      "publishedAt": "2024-03-02T14:43:48Z",
      "title": "US military aircraft airdrop thousands of meals into Gaza in emergency humanitarian aid operation",
      "url": "https://apnews.com/f8bc071193f89906abf21478bc70a084",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/febc9a2dad81454da3d7024f65b737c7/1920.jpeg"
    },
    {
      "author": "BROOKE HESS and KEN RITTER",
      "description": "TRUCKEE, Calif. (AP) — A powerful blizzard that a meteorologist termed “as bad as it gets” howled in the Sierra Nevada mountains, closing a long stretch of Interstate 80 in Northern California, forcing ski resorts to shut down, and leaving thousands of homes without power.",
      "publishedAt": "2024-03-02T08:01:57Z",
      "title": "A massive blizzard howls in the Sierra Nevada. High winds and heavy snow close roads and ski resorts",
      "url": "https://apnews.com/d3da8b2ecfca73e2f885d88a83138ac7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb5489f5a27b422d84725fa2d64fe776/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN",
      "description": "MIAMI (AP) — A vibrant fishing industry, some of the world’s largest coral reefs, desalination plants supplying millions with drinking water. They're all at risk from large amounts of fertilizer and oil spilled into the Red Sea by the sinking of a cargo ship attacked by Yemen’s Houthi rebels.",
      "publishedAt": "2024-03-02T20:04:21Z",
      "title": "Oil spill, fertilizer leak from sinking of cargo ship highlight risks to Red Sea from Houthi attacks",
      "url": "https://apnews.com/1e130e15ca0863ab40966ea9676cf42b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce9abf2ed5bb4976a6e6cd20cc60eeb4/3000.jpeg"
    },
    {
      "author": "EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Police in Haiti urgently appealed for help Saturday night as they struggled to hold back gangs trying to storm the country's main prison in a major escalation of violence sweeping the troubled Caribbean nation.",
      "publishedAt": "2024-03-03T03:05:31Z",
      "title": "Police in Haiti struggle against gangs storming prison in latest surge of violence",
      "url": "https://apnews.com/1033aba8041637f9934f87a3be883df8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42fcab7d18224c7d86ab8f167f338a89/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO, ERIC TUCKER and ANTHONY McCARTNEY",
      "description": "WASHINGTON (AP) — Alexander Smirnov was cast by Republicans as one of the FBI’s most trusted informants, offering a “highly credible” account of brazen public corruption by Joe Biden that formed a pillar of the House impeachment investigation of the Democratic president.",
      "publishedAt": "2024-03-02T13:33:51Z",
      "title": "How clean is the dirt on Hunter Biden? A key Republican source is charged with lying to the FBI",
      "url": "https://apnews.com/113c1104052dbdc9302606f6d42c9939",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03a18021aaf94291b490bd733c0bdaa5/3000.jpeg"
    },
    {
      "author": "BILL BARROW and JILL COLVIN",
      "description": "GREENSBORO, North Carolina (AP) — Former President Donald Trump on Saturday further escalated his immigration rhetoric and baselessly accused President Joe Biden of waging a “conspiracy to overthrow the United States of America\" as he campaigned ahead of Super Tuesday's primaries.",
      "publishedAt": "2024-03-02T22:52:03Z",
      "title": "Trump escalates his immigration rhetoric with baseless claim about Biden trying to overthrow the US",
      "url": "https://apnews.com/1fc6624188f540f495e1087bee64318e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd0f1ebe9ba142c3966f658ec8a99d9a/3000.jpeg"
    },
    {
      "author": "ANDREW DeMILLO",
      "description": "Oregon is poised to step back from its first-in-the-nation drug decriminalization law with a new measure approved by the state Senate that would reinstate criminal penalties for possessing small amounts of some drugs.",
      "publishedAt": "2024-03-02T21:56:07Z",
      "title": "Oregon may revive penalties for drug possession. What will the change do?",
      "url": "https://apnews.com/3810a6c6bcc7a4fc1cb029cad1f58dee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/870f1ca36d3d4f059020f2eddc358561/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY, JIM VERTUNO and KEN MILLER",
      "description": "STINNETT, Texas (AP) — Firefighters in Texas faced rising temperatures, whipped-up winds and dry air Saturday in their battle to keep the largest wildfire in state history from turning more of the Panhandle into a parched wasteland.",
      "publishedAt": "2024-03-02T12:38:35Z",
      "title": "Firefighters face difficult weather conditions as they battle the largest wildfire in Texas history",
      "url": "https://apnews.com/e00e345808351aa015779a28ec494392",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2676d0ba18cc4f9f9744cc7dabd37ffe/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "SELMA, Ala. (AP) — Vice President Kamala Harris is expected to be among those marking the 59th anniversary of Bloody Sunday, the day Alabama law officers attacked Civil Rights demonstrators on the iconic Edmund Pettus Bridge in Selma, Alabama.",
      "publishedAt": "2024-03-03T05:01:51Z",
      "title": "Vice President Kamala Harris to join in marking anniversary of Bloody Sunday on Alabama bridge",
      "url": "https://apnews.com/dd03b6cc8e68e42ac89e1c9d641c12b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44502473dce041aaa5308f3df50c5c77/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}