{
  "articles": [
    {
      "author": null,
      "description": "Hospital officials and witnesses say Israeli forces have killed at least 23 Palestinians seeking food in the Gaza Strip. The incident happened on Sunday as hungry crowds surged around aid sites. Desperation has gripped the territory, home to over 2 million people, amid warnings of famine due to Israel’s blockade and ongoing offensive. Witnesses described Israeli troops opening fire on crowds near distribution points. The Gaza health ministry also said six more Palestinian adults died of malnutrition-related causes in the Gaza Strip in the past 24 hours. Ninety-three children have also died of causes related to malnutrition since the war in Gaza started last year, it said.",
      "publishedAt": "2025-08-03T10:35:55Z",
      "title": "Israeli forces kill over 20 people seeking food in Gaza, witnesses and health officials say",
      "url": "https://apnews.com/article/mideast-wars-gaza-israel-aid-famine-f1653318afd36b1b11090a4402233705",
      "urlToImage": "https://dims.apnews.com/dims4/default/e85e381/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F8f%2F7623f76169565b7ad76839275c25%2F43ab38e0c2514b15a778e6be82c158c6"
    },
    {
      "author": null,
      "description": "Ukraine’s anti-corruption agencies say they uncovered a major bribery scheme involving inflated military procurement contracts, just two days after lawmakers restored the agencies’ independence following a public outcry. In a statement late on Saturday, they said a lawmaker, local officials, and National Guard members took kickbacks worth up to 30% on overpriced contracts for drones and electronic warfare gear. Four people have been arrested. President Volodymyr Zelenskyy called the scheme “absolutely immoral” and praised investigators. The exposure follows parliament’s reversal of a controversial move by Zelenskyy to curb the agencies’ powers.",
      "publishedAt": "2025-08-03T10:01:39Z",
      "title": "Ukraine anti-corruption agencies uncover drone graft scheme",
      "url": "https://apnews.com/article/russian-ukraine-war-corruption-law-graft-drone-02aaa100244f82f41fea68c6b727e6a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/06ada7c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2F73%2F7a7c446343aa8b06208cda8f10de%2Fb3406653f9ba4762976ddfcbdacf7e3d"
    },
    {
      "author": null,
      "description": "Russian officials say a Ukrainian drone attack on an oil depot near Russia’s Black Sea resort of Sochi has sparked a major fire. On Sunday, more than 120 firefighters worked to extinguish the blaze after debris from a downed drone hit a fuel tank. Russia’s civil aviation authority temporarily stopped flights at Sochi’s airport. Russia’s Defense Ministry said its air defenses shot down 93 Ukrainian drones. Meanwhile, the Ukrainian air force said Russia launched 76 drones and seven missiles against Ukraine. A Russian missile strike hit a residential area in the southern city of Mykolaiv, wounding seven people, according to Ukraine's State Emergency Services.",
      "publishedAt": "2025-08-03T08:01:11Z",
      "title": "Ukrainian drone attack sparks massive fire at Russian oil depot near Sochi",
      "url": "https://apnews.com/article/russia-ukraine-war-depot-drones-missiles-ceasefire-1bf8440535e8fa32bc66310ea37658d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A poll from The Associated Press-NORC Center for Public Affairs Research finds that many Democrats see their political party as “weak” or “ineffective.” The survey also finds deep pessimism within Democratic ranks. Republicans are more complimentary of their party, although a small but significant share describe the GOP as “greedy,” “for the rich” or “generally bad.” The poll asked people to share the first word or phrase that came to mind when they thought of the parties. Answers were sorted into broad categories. Overall, U.S. adults held a dim view of both parties, with about 4 in 10 using negative attributes, including words such as “dishonest” or “stupid.”",
      "publishedAt": "2025-08-03T11:24:56Z",
      "title": "Many Democrats see party as 'weak' or 'ineffective,' poll finds",
      "url": "https://apnews.com/article/ap-poll-democrats-republican-political-parties-d41141f4a0af53c223620af0fc3fc319",
      "urlToImage": "https://dims.apnews.com/dims4/default/e01ef48/2147483647/strip/true/crop/5715x3215+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2F74%2F13ae4c9819f85f0644cf20aa90ad%2F916bd3168ab84f53a4bb87be2608ada7"
    },
    {
      "author": null,
      "description": "The Justice Department is ramping up an effort to get election data from the states. According to an Associated Press tally, the department's voting section has requested copies of voter registration lists from state election administrators in at least 15 states. And department lawyers have contacted officials in at least seven states to propose a meeting about forging an information-sharing agreement related to instances of voting or election fraud. The unusually expansive outreach has raised alarm among some election officials. That's because states have the constitutional authority to run elections and because federal law protects the sharing of individual data with the government.",
      "publishedAt": "2025-08-03T11:29:32Z",
      "title": "Justice Department's requests for voter data raise alarm in some states",
      "url": "https://apnews.com/article/justice-department-election-officials-voting-trump-a04b1522bed0cb6bbc286e25b139701f",
      "urlToImage": "https://dims.apnews.com/dims4/default/decec10/2147483647/strip/true/crop/3217x1810+0+167/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2Fd2%2F50c6ab744e9be150c1f4a1bbdb99%2F6dddd4e0dc304f8580a5a41e8efa7557"
    },
    {
      "author": null,
      "description": "Law enforcement officers are scouring a mountainous area of western Montana for a military veteran who authorities say opened fire at a bar, killing four people. Montana Division of Criminal Investigation administrator Lee Johnson says 45-year-old Michael Paul Brown fled The Owl Bar after the Friday shooting in the small town of Anaconda. Authorities urged residents to be on high alert because they consider Brown armed and dangerous. A lockdown was lifted Saturday. Brown previously served in the U.S. Army and Montana National Guard. His niece says Brown has struggled with mental illness for years and that the family repeatedly has sought help.",
      "publishedAt": "2025-08-02T04:01:30Z",
      "title": "Authorities search for former US soldier suspected in Montana shooting",
      "url": "https://apnews.com/article/montana-shooting-suspect-search-439c3b8d78cf385a4ceb11c7bf1c9820",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dc4f99/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F15%2Fed425a0fee36c0eddcf0a77deccc%2F980e0661928e4f969368b6e230687675"
    },
    {
      "author": null,
      "description": "Pope Leo XIV has urged over a million Catholic youths to spread their faith and enthusiasm as they return to 150 countries. This call came during a Mass on Sunday, closing a weeklong event for young Catholics. The gathering, part of the Jubilee of Youth, saw participants camping in fields southeast of Rome. The Vatican reported more than a million attendees, including 7,000 priests and 450 bishops. Despite rain, spirits remained high. Sadly, two young pilgrims died, and a third was hospitalized. The event is part of the Holy Year, expected to draw millions to the Vatican.",
      "publishedAt": "2025-08-03T08:18:54Z",
      "title": "Pope Leo XIV urges over 1 million Catholic young people to spread faith and enthusiasm",
      "url": "https://apnews.com/article/vatican-youth-leo-pope-pilgrims-jubilee-a988921aab57f3cfc05d5213d58b358c",
      "urlToImage": "https://dims.apnews.com/dims4/default/ddcfb89/2147483647/strip/true/crop/7436x4183+0+387/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F26%2F9a79409c12c904f3d0674578b9d9%2F1b62e0e0e6bb49c694a0843406f003a6"
    },
    {
      "author": null,
      "description": "New outbreaks of violence overnight into Sunday have rocked Syria at two distinct flashpoints, straining a fragile ceasefire and calling into question the ability of the transitional government to exert its authority across the whole country. In the north, government-affiliated fighters confronted Kurdish-led forces who control much of the region, while in the southern province of Sweida, they clashed with Druze armed groups. Syria’s interim authorities are trying to maintain a tense ceasefire in Sweida province after clashes with Druze factions last month, and to implement an agreement with the U.S.-backed, Kurdish-led Syrian Democratic Forces that would reintegrate large swaths of northeastern Syria.",
      "publishedAt": "2025-08-03T12:25:34Z",
      "title": "Syria clashes erupt as government seeks to ease tensions",
      "url": "https://apnews.com/article/syria-clashes-druze-kurds-hts-sweida-sharaa-9c2917e8c93c8a248630d9d72ecbf645",
      "urlToImage": "https://dims.apnews.com/dims4/default/2eb614e/2147483647/strip/true/crop/5255x2956+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F2c%2Ffe5f3feecba870e1eb1e6588b864%2Fac0db1e2371c4fcaa4faa9b2d9b74c5a"
    },
    {
      "author": null,
      "description": "The director of Chile’s El Teniente copper mine says the bodies of four out of five miners who had been trapped in a collapsed section of the mine since Thursday have been found. Mine director Andres Music says rescuers are still looking for the fifth miner. The men were located thanks to GPS devices, but rescue workers have had to drill through dozens of meters of rock to reach them.",
      "publishedAt": "2025-08-03T16:57:22Z",
      "title": "Rescue teams find bodies of four miners trapped in Chilean copper mine. One miner still missing.",
      "url": "https://apnews.com/article/chile-copper-mine-collapse-teniente-codelco-ba67897a73be96720278a956f2d0870f",
      "urlToImage": "https://dims.apnews.com/dims4/default/676c986/2147483647/strip/true/crop/3996x2248+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Ffb%2Fea36e60418c7366960e48d68fbe2%2Fbe1f226c89354d7daf8939e1ca590b6c"
    },
    {
      "author": null,
      "description": "A video showing the violent arrest of a Black college student in Florida has sparked calls for drivers to use cameras that show a view from inside their car. William McNeil Jr.'s dashboard-mounted cellphone captured footage of officers beating him during a February traffic stop. The footage, which went viral when posted online last month, shows officers smashing McNeil's window and hitting him, actions not clearly visible on police bodycams. Experts suggest that car cameras can offer a unique perspective and protect against false claims. The arrest has led to discussions about police accountability and the limitations of bodycams.",
      "publishedAt": "2025-08-03T03:57:22Z",
      "title": "Calls for in-car cameras grow after Florida student's brutal arrest video",
      "url": "https://apnews.com/article/william-mcneil-police-beating-video-jacksonville-driver-4243a4a87a89ae2ef99259144067c2e5",
      "urlToImage": "https://dims.apnews.com/dims4/default/74a4b2b/2147483647/strip/true/crop/5220x2936+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F3a%2F9b224eb89c6341942d82c391780c%2Fe370b3785e1a477ab4ab1cf599bf27f8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}