{
  "articles": [
    {
      "author": "LEA SKENE and BRIAN WITTE",
      "description": "BALTIMORE (AP) — The cargo ship that lost power and crashed into a bridge in Baltimore underwent “routine engine maintenance” in the port beforehand, the U.S. Coast Guard said Wednesday, as divers recovered the bodies of two of six workers who plunged into the water.",
      "publishedAt": "2024-03-27T04:03:00Z",
      "title": "Investigation of Baltimore bridge collapse picks up speed as divers recover 2 bodies from water",
      "url": "https://apnews.com/6a95340e5daeff6551fc999d23feb278",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fba513d2dada482a8f283e971d1d66d4/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "Manufacturers and shippers are scrambling to figure out where they can load or unload cargo while the main operations of the Port of Baltimore remain shut down due to Tuesday's deadly collapse of the Francis Scott Key Bridge.",
      "publishedAt": "2024-03-27T20:33:54Z",
      "title": "Baltimore bridge collapse: Ships carrying cars and heavy equipment need to find a new harbor",
      "url": "https://apnews.com/056eb1e7c5424f23ce4c049fe53bb02f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36b155fd7dc34c4fbff187d702d891f3/1920.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "HARTFORD, Conn. (AP) — Former U.S. Sen. Joe Lieberman of Connecticut, who nearly won the vice presidency on the Democratic ticket with Al Gore in the disputed 2000 election and who almost became Republican John McCain's running mate eight years later, has died, according to a statement issued by his family.",
      "publishedAt": "2024-03-27T21:48:36Z",
      "title": "Former Sen. Joe Lieberman, Democrats’ VP pick in 2000, dead at 82",
      "url": "https://apnews.com/c82d9c92c1c4493fa5d708719884b12d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/743d36b7de564a65bbbd930dc217fa9d/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump lashed out Wednesday at the New York judge who put him under a gag order ahead of his April 15 hush-money criminal trial, suggesting without evidence that the veteran jurist was kowtowing to his daughter's interests as a Democratic political consultant.",
      "publishedAt": "2024-03-27T16:31:14Z",
      "title": "Donald Trump assails judge and his daughter after gag order in New York hush-money criminal case",
      "url": "https://apnews.com/578a0c6334b206d81dc2ebf6a410a502",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/457127337a054ef1a34a6bfe22e74381/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — For over a month, House Speaker Mike Johnson has sat on a funding package that would send desperately needed ammunition and weaponry to Ukraine, mulling how best to gain a grasp of what is expected to be a difficult lift in the House.",
      "publishedAt": "2024-03-27T18:13:36Z",
      "title": "House Speaker Mike Johnson is committed to advancing Ukraine aid. But it will be a difficult task",
      "url": "https://apnews.com/6ca638103f0286405144891604f92de3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9e7222fb3d248d0b87ae1d07cd1ed2a/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The death toll from Israeli airstrikes across southern Lebanon has climbed to 16, including several militants and members of paramedic groups, according to Lebanese state media and the militant organizations.",
      "publishedAt": "2024-03-27T09:25:37Z",
      "title": "The Latest | Airstrikes and rocket fire on Lebanon-Israel border as death toll climbs",
      "url": "https://apnews.com/dac468145fa4170a368938e527eec269",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afa2a2e2e1414e909c7370837b332cb8/3000.jpeg"
    },
    {
      "author": "CARLOS MUREITHI",
      "description": "NAIROBI, Kenya (AP) — The world wasted an estimated 19% of the food produced globally in 2022, or about 1.05 billion metric tons, according to a new United Nations report.The U.N. Environment Programme's Food Waste Index Report, published Wednesday, tracks the progress of countries to halve food waste by 2030.",
      "publishedAt": "2024-03-27T12:36:54Z",
      "title": "783 million people face chronic hunger. Yet the world wastes 19% of its food, UN says",
      "url": "https://apnews.com/18018b352ac6bd7be9925e15511254ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1092bf061204babb1ca1f8185b469bc/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY, ANNIE MA and NOREEN NASIR",
      "description": "CHICAGO (AP) — When she started writing her college essay, Hillary Amofa told the story she thought admissions offices wanted to hear. About being the daughter of immigrants from Ghana and growing up in a small apartment in Chicago.",
      "publishedAt": "2024-03-27T04:12:00Z",
      "title": "Should college essays touch on race? Some feel the affirmative action ruling leaves them no choice",
      "url": "https://apnews.com/f0c006a6210ab244c1b6b4c2b1926b6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f32ff3560d694463a25b1d22f28aa4db/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "ORLANDO, Fla. (AP) — Allies of Gov. Ron DeSantis and Disney reached a settlement agreement Wednesday in a state court fight over how Walt Disney World is developed in the future following the takeover of the theme park resort's government by the Florida governor.",
      "publishedAt": "2024-03-27T14:26:06Z",
      "title": "Settlement reached in lawsuit between Disney and Florida Gov. Ron DeSantis' allies",
      "url": "https://apnews.com/91040178ad4708939e621dd57bc5e494",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abd19aad8af64f9da90d3abf01664699/3000.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — U.S. stocks rose to a record Wednesday after breaking out of their three-day lull.The S&amp;P 500 climbed 44.91 points, or 0.9%, to 5,248.49. It was the first gain for the index since setting its last all-time high on Thursday.",
      "publishedAt": "2024-03-27T08:23:29Z",
      "title": "Stock market today: S&P 500 sets a record after Wall Streets breaks out of its lull",
      "url": "https://apnews.com/0ce28d7b2b92a6e7d43d67525d80558a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/231398e1ddc74907b0588ee4527c5881/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}