{
  "articles": [
    {
      "author": null,
      "description": "Israeli warplanes pounded Iran’s capital overnight, hitting a facility used to make uranium centrifuges and another that made missile components, the Israeli military said. It said it had intercepted 10 missiles, as Iran’s retaliatory barrages have diminished since the start of the conflict. Israel has carried out blistering attacks on Iran’s nuclear program and military sites since launching its surprise bombardment on Friday. A Washington-based Iranian human rights group said at least 585 people, including 239 civilians, have been killed and more than 1,300 wounded. Iran has fired some 400 missiles and hundreds of drones in retaliatory strikes that have killed at least 24 people in Israel and wounded hundreds.",
      "publishedAt": "2025-06-18T03:07:27Z",
      "title": "Israeli warplanes hammer Iran's capital as retaliatory missile barrages diminish",
      "url": "https://apnews.com/article/israel-iran-missile-attacks-nuclear-news-tehran-trump-06-18-2025-c6c90028dc340e2716724412fcec2cf0",
      "urlToImage": "https://dims.apnews.com/dims4/default/b880542/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2Fd4%2F87e95b39cb6b4a20f82845b431b7%2Fc7bc4d2fe7da4057b6ebc34eb3be6822"
    },
    {
      "author": null,
      "description": "In Iran’s capital city, the streets are empty, businesses closed, communications patchy at best. Panicked masses spend restless nights on the floors of metro stations as strikes boom overhead. The country is just under a week into a fierce Israeli blitz to destroy the country’s nuclear program and its military capabilities. Thousands have fled Tehran, spending hours in gridlock as they head toward the suburbs, the Caspian Sea, or even Armenia or Turkey. But others are stuck in high-rise apartment buildings. They worry and so do their relatives elsewhere.",
      "publishedAt": "2025-06-18T10:50:02Z",
      "title": "Fear grips Tehran as Israeli bombs fall and communicating grows harder",
      "url": "https://apnews.com/article/iranians-tehran-israel-fear-evacuation-9f65e7cd976ad2feb94e5be2eb973be6",
      "urlToImage": "https://dims.apnews.com/dims4/default/19b77d6/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2F8b%2F6aecd3b8d3401118f70de8595197%2F6623f3255d2e42a9978f699c841a38fd"
    },
    {
      "author": null,
      "description": "Six of the Group of Seven leaders will try to show the wealthy nations’ club still has the clout to shape world events despite the early departure of President Donald Trump. Prime Minister Mark Carney and his counterparts from the U.K., France, Germany, Italy and Japan will be joined Tuesday by Ukrainian President Volodymyr Zelenskyy and NATO chief Mark Rutte to discuss Russia’s relentless war on its neighbor. That's just one of several crises in an increasingly unstable world. Another is a dangerous showdown between Israel and Iran. Trump left the summit in the Canadian Rockies saying it was very important for him to return.",
      "publishedAt": "2025-06-17T04:11:56Z",
      "title": "G7 leaders try to salvage a summit without Trump",
      "url": "https://apnews.com/article/g7-summit-canada-trump-departure-ukraine-6c86a0a8463603c9b1a3e950382af0a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7424e0/2147483647/strip/true/crop/3173x1785+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F97%2Ff2f849068f55b7a9848073d8b0c1%2F891c87358beb40d598fc9e3b0c0f50f9"
    },
    {
      "author": null,
      "description": "Los Angeles Mayor Karen Bass is lifting a curfew in downtown Los Angeles. Her Tuesday announcement comes after she first imposed the curfew June 10 in response to clashes with police and vandalism amid protests against President Donald Trump’s immigration crackdown in the city. Bass, a Democrat, said she’s lifting the curfew following “successful crime prevention and suppression efforts.” On Monday she trimmed back the hours after fewer arrests during evening demonstrations. She says the curfew protected stores, restaurants, businesses and residents from people engaging in vandalism.",
      "publishedAt": "2025-06-17T18:59:01Z",
      "title": "Los Angeles mayor lifts downtown curfew she imposed during protests against immigration raids",
      "url": "https://apnews.com/article/los-angeles-mayor-curfew-immigration-protests-c3e94c9666791d7752f67e7eb5f43913",
      "urlToImage": "https://dims.apnews.com/dims4/default/7b60b6b/2147483647/strip/true/crop/5435x3057+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F74%2Fc4704e3010c73881c0d954f09d86%2F824a98491f714d82b645585593609c9c"
    },
    {
      "author": null,
      "description": "President Donald Trump will sign an executive order this week to extend a deadline for TikTok’s Chinese owner to divest the popular video sharing app. White House press secretary Karoline Leavitt announced Trump's intention after Trump indicated earlier Tuesday he would “probably” make the move. Leavitt said in a statement Tuesday evening that “Trump does not want TikTok to go dark.” The extension will last for 90 days. Trump had signed an order in early April to keep TikTok running for an additional 75 days after a potential deal to sell the app to American owners was put on ice.",
      "publishedAt": "2025-06-17T13:01:31Z",
      "title": "Trump will sign an order extending deadline for TikTok's Chinese owner to sell app",
      "url": "https://apnews.com/article/tiktok-trump-9b41b996c230cbcc0470071165403e2e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e300389/2147483647/strip/true/crop/5135x2888+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F10%2F34cb8e838005fc1e3062e5eac8de%2F39f54b4fcba042c689b17de8fe262234"
    },
    {
      "author": null,
      "description": "Officials say a Russian missile and drone bombardment has killed at least 15 people and injured 156 others in Ukraine overnight, with the main barrage demolishing a nine-story apartment building in Kyiv. It was the deadliest attack on the Ukrainian capital this year and came as two rounds of direct peace talks have failed to make progress on ending the war, now in its fourth year. The city's military administration says 14 people were killed and 138 others were injured in the capital as explosions echoed for hours. Russia has repeatedly hit civilian areas of Ukraine with missiles and drones, and the United Nations says the attacks have killed more than 12,000 Ukrainian civilians.",
      "publishedAt": "2025-06-17T00:08:16Z",
      "title": "Overnight Russian attack on Ukraine kills 15 and injures 156",
      "url": "https://apnews.com/article/russia-drone-attack-kyiv-187fafa3d7324130e5ee7e20e0a3a5dc",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d16abd/2147483647/strip/true/crop/1000x563+0+52/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fdd%2F9a289b4c5e1b19ef0f1326cac3de%2F724c5bb5d8174b789625d7ea44d66144"
    },
    {
      "author": null,
      "description": "In Gaza and Africa, U.S. contracting firms led by former American intelligence and military officers are taking on aid delivery in conflict zones. It's a development roiling the global aid community, which says the contractors are operating with little transparency or humanitarian experience. Crucially, says Jan Egeland, head of the Norwegian Rescue Committee nonprofit, the U.S. aid contractors are working with governments that are combatants in the conflicts, in ways Egeland says risk weaponizing aid. In Gaza, an American-led operation is distributing aid under an Israeli plan to replace the U.N.-led aid system there. In South Sudan, Michael Mulroy, a former U.S. defense and intelligence official, says his team brings experience to aid drops funded by South Sudan.",
      "publishedAt": "2025-06-18T04:43:00Z",
      "title": "Aid deliveries by firms led by US military veterans spark concern from humanitarian groups",
      "url": "https://apnews.com/article/israel-aid-south-sudan-gaza-military-contractors-b03e84e4330b219f1b2ed965ffda4448",
      "urlToImage": "https://dims.apnews.com/dims4/default/4321aea/2147483647/strip/true/crop/5184x2916+0+486/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F65%2F4877606e78951feb5450db5549b7%2Ff3d3ade62b1545089ebf576743c55a61"
    },
    {
      "author": null,
      "description": "New York City comptroller and Democratic mayoral candidate Brad Lander has been arrested at a federal building in Manhattan as he was trying to accompany a person out of an immigration courtroom. A reporter with The Associated Press witnessed Lander’s arrest on Tuesday. The person Lander was walking out of the courtroom was also arrested. Lander had spent the morning observing immigration court hearings and told an AP reporter that he was there to “accompany” some immigrants out of the building. Emailed inquiries to the FBI and U.S. Immigration and Customs Enforcement were not immediately returned.",
      "publishedAt": "2025-06-17T16:36:31Z",
      "title": "Brad Lander, NYC comptroller and mayoral candidate, is arrested outside immigration court",
      "url": "https://apnews.com/article/brad-lander-nyc-immigration-court-arrest-6ed341297efab31a08a14421674d8ed8",
      "urlToImage": "https://dims.apnews.com/dims4/default/af72716/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F54%2Fe9f93513bee4fc0e8ced04775bf7%2F67ee628d735c45debbd7241b96ad2e51"
    },
    {
      "author": null,
      "description": "Cancer patients say they’ve grown sicker since Argentina’s radical libertarian President Javier Milei took his chainsaw to the public health system. Human rights groups have documented the deaths of over 60 people as a result of the dissolution of a federal agency, known as DADSE, that had covered their high-cost medication. That overhaul represents just one facet of how Milei’s cutbacks have torn at an extensive public health system that once set this country apart from the rest of Latin America. According to experts, government workers and advocates, the cutbacks have overwhelmed the nation’s vaunted, if creaking, public hospitals, upended vaccination efforts and taken a brutal toll on the country’s poor and unemployed.",
      "publishedAt": "2025-06-18T04:39:28Z",
      "title": "Argentina's Milei mirrors US health care cuts, eviscerating once-robust system",
      "url": "https://apnews.com/article/argentina-milei-trump-rfk-health-care-cancer-8f5c4101140e1859c11ef4baed214054",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d659ec/2147483647/strip/true/crop/5762x3241+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F30%2F762f9738849098560bdc914b9a35%2F447fa029a9e24bbb82defd4fd99a4c41"
    },
    {
      "author": null,
      "description": "A judge is being asked to clear the way for local governments and individual victims to vote on OxyContin maker Purdue Pharma’s plan to settle thousands of lawsuits over the toll of opioids. The deal would be among the largest in a wave of opioid settlements. It calls for members of the Sackler family who own the company to give up ownership and to contribute up to $7 billion over time. Of that, about $890 million could go to people who were victims of the drug epidemic, or their survivors. Most of the rest is to be used by state and local governments to fight the crisis.",
      "publishedAt": "2025-06-18T04:05:51Z",
      "title": "A judge could advance a $7B settlement for OxyContin maker Purdue Pharma",
      "url": "https://apnews.com/article/purdue-pharma-sackler-settlement-bankrtupcy-court-88080f18790ba45b1bba5a75831bc53e",
      "urlToImage": "https://dims.apnews.com/dims4/default/af932f3/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F68%2F71e039ce6d8afb461b6f1db5bc41%2F01c2941296324b169cefb4c57e6fafc1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}