{
  "articles": [
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — A passenger plane burst into flames Sunday after it skid off a runway at a South Korean airport and slammed into a concrete fence when its front landing gear apparently failed to deploy, killing at least 85 people, officials said, in one of the country's worst aviation disasters.",
      "publishedAt": "2024-12-29T00:56:18Z",
      "title": "Plane burst into flames after skidding off runway at an airport in South Korea, killing at least 85",
      "url": "https://apnews.com/68da9b0bd5196feed6e7d2db849f461a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2de0877bb52949a183a236022f8ac8fc/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump appears to be siding with Elon Musk and his other backers in the tech industry as a dispute over immigration visas has divided his supporters.",
      "publishedAt": "2024-12-28T20:27:24Z",
      "title": "Trump appears to side with Musk, tech allies in debate over foreign workers roiling his supporters",
      "url": "https://apnews.com/91ab17e141cc9764fb18b8bc862c84dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ee306173ed546a1823bb6c202233951/3000.jpeg"
    },
    {
      "author": null,
      "description": "HOUSTON (AP) — At least two people were killed and six more injured as several tornadoes touched down in Texas and Mississippi on Saturday, damaging homes and flipping vehicles.One person died in the Liverpool area, located south of Houston, and four people suffered injuries that weren’t considered critical, said Madison Polston, spokesperson for the Brazoria County Sheriff’s Office.",
      "publishedAt": "2024-12-28T19:48:10Z",
      "title": "Tornadoes touch down in Texas and Mississippi, killing 2 and injuring 6 others",
      "url": "https://apnews.com/bd534f48c9ab76380aa09cb86b7ffb25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d75aff1d33ed4883ae751f6f4639cd0b/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAM MEDNICK",
      "description": "DEIR AL BALAH, Gaza Strip (AP) — Israel's army detained the director of one of northern Gaza 's last functioning hospitals as overnight strikes elsewhere in the territory killed nine people, including children, Palestinian medical officials said Saturday.",
      "publishedAt": "2024-12-28T10:53:05Z",
      "title": "Israel detains the director of one of northern Gaza's last functioning hospitals during a raid",
      "url": "https://apnews.com/57e00c5b1e72503e02a9cfd8d8ab64f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4ea996517144dce8ab89b71183023f8/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Syria’s embassy in Lebanon suspended consular services Saturday, a day after two relatives of deposed Syrian President Bashar Assad were arrested at the Beirut airport with allegedly forged passports.",
      "publishedAt": "2024-12-28T19:24:11Z",
      "title": "Syria's embassy in Lebanon suspends services as Lebanon hands over former Syrian army officers",
      "url": "https://apnews.com/8b7271fb54898a2b0cdc52f9b931f9a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d238be195d65405d934ae23261dc46f4/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin on Saturday apologized to his Azerbaijani counterpart for what he called a “tragic incident” following the crash of an Azerbaijani airliner in Kazakhstan that killed 38 people, but stopped short of acknowledging that Moscow was responsible.",
      "publishedAt": "2024-12-26T11:35:16Z",
      "title": "What is known about a plane crash in Kazakhstan after Putin apologized for a \"tragic incident\"?",
      "url": "https://apnews.com/1e3ca32f895b577755b5776806e1eda7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d051a3d44ec742e1adb4b5ef1324c996/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and KEVIN S. VINEYS",
      "description": "Abortion has become slightly more common despite bans or deep restrictions in most Republican-controlled states, and the legal and political fights over its future are not over yet.It's now been two and a half years since the U.S.",
      "publishedAt": "2024-12-28T13:04:06Z",
      "title": "Abortions are up in the US. It's a complicated picture as women turn to pills, travel",
      "url": "https://apnews.com/5632f60aa1d797bcdec9fbc77a385413",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4954a667963d435aadfda24a5c331525/3000.jpeg"
    },
    {
      "author": "JOSH FUNK and JULIE WALKER",
      "description": "Three firefighters and a dozen passengers were injured in Florida on Saturday when a fire truck with its lights flashing drove around rail crossing arms and into the path of a high-speed passenger train after waiting for another train to pass, according to video of the incident and a person briefed on what happened.",
      "publishedAt": "2024-12-28T19:24:56Z",
      "title": "15 hurt in Florida when train hits fire truck that drove onto tracks after another train passed",
      "url": "https://apnews.com/381e53c970b5970de44ab4d11c4b9276",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f4fed454c44421bb755615690f3f080/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "Cases of a wretched stomach bug are surging in parts of the United States this winter, according to government data.",
      "publishedAt": "2024-12-28T20:18:52Z",
      "title": "Nasty norovirus is back in full force with US cases of the stomach virus surging",
      "url": "https://apnews.com/78e4a5f3c55d0af68f0c9e115c2369e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/548fe728913f48f3b8a7c27ca9bbda2d/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Five months after their shock offensive into Russia, Ukrainian troops are bloodied and demoralized by the rising risk of defeat in Kursk, a region some want to hold at all costs while others question the value of having gone in at all.",
      "publishedAt": "2024-12-28T05:01:07Z",
      "title": "Bloodied Ukrainian troops risk losing more hard-won land in Kursk to Russia",
      "url": "https://apnews.com/d297a59fb9eb7db08bd742e1dd0aa753",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f945dad334dd41e6aa875932bd0605a7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}