{
  "articles": [
    {
      "author": "KEN SWEET",
      "description": "NEW YORK (AP) — Capital One Financial said it will buy Discover Financial Services for $35 billion, in a deal that would bring together two of the nation's credit card companies as well as potentially shake up the payments industry, which is largely dominated by Visa and Mastercard.",
      "publishedAt": "2024-02-20T01:50:26Z",
      "title": "Capital One to buy Discover for $35 billion in deal that combines major US credit card companies",
      "url": "https://apnews.com/3444782717e668b896883f09bda27baa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b44460fe6e694ff4aea5f2b042c33528/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO and EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — A judge in Haiti responsible for investigating the July 2021 assassination of President Jovenel Moïse has indicted his widow, Martine Moïse, ex-prime minister Claude Joseph and the former chief of Haiti’s National Police, Léon Charles, among others, according to a report obtained Monday.",
      "publishedAt": "2024-02-19T23:02:46Z",
      "title": "Widow, ex-prime minister and former police chief indicted in 2021 assassination of Haiti's president",
      "url": "https://apnews.com/9b70e2dd91e7bbb48737df89f76a689d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93d438312c2e490bafd77cc93100aecd/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel’s assault in Gaza has killed more than 29,000 Palestinians since Oct. 7, the territory’s Health Ministry said Monday, marking another grim milestone in one of the deadliest and most destructive military campaigns in recent history.",
      "publishedAt": "2024-02-19T10:23:17Z",
      "title": "More than 29,000 Palestinians have been killed in Israel-Hamas war, Gaza Health Ministry says",
      "url": "https://apnews.com/81c2d362340b611a98e4b929b4b5d0a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6b3200cbe4a408fb1d8db00fbc7dc9a/3000.jpeg"
    },
    {
      "author": "JOHN HANNA",
      "description": "A man who died after fatally shooting two police officers and a firefighter in a wooded Minneapolis-area neighborhood wasn't legally allowed to have guns after a previous assault conviction and was entangled in a yearslong dispute over the custody and financial support of his three oldest children, court records show.",
      "publishedAt": "2024-02-19T23:37:32Z",
      "title": "Minnesota man who shot 2 officers and a firefighter wasn't allowed to have guns",
      "url": "https://apnews.com/c6e27aa84e577c27d5e44f5f2c9c4004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60c4caea33dd434e8a98bf4d9d48a180/3000.jpeg"
    },
    {
      "author": "JENNA FRYER",
      "description": "DAYTONA BEACH, Fla. (AP) — The goal was obvious to William Byron: put the No. 24 Chevrolet in victory lane in the 2024 Daytona 500 to launch Hendrick Motorsports' 40th anniversary season.Mission accomplished, even if Byron had to complete an agonizing final lap under caution around Daytona International Speedway awaiting the winner to be declared.",
      "publishedAt": "2024-02-19T21:55:18Z",
      "title": "William Byron launches Hendrick Motorsports' 40th anniversary season with win in Daytona 500",
      "url": "https://apnews.com/48289da3b426fc3ee6942e198fcca813",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4af91bb2fcb54c15b734551fb94fa355/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The widow of Russian opposition leader Alexei Navalny vowed on Monday to continue his fight against the Kremlin, while authorities denied his mother access to a morgue where his body is believed to be held after his death last week in an Arctic penal colony.",
      "publishedAt": "2024-02-19T09:55:09Z",
      "title": "Navalny's widow vows to continue his fight against the Kremlin and punish Putin for his death",
      "url": "https://apnews.com/56d3cf1d114e6be452465d5e312b4fad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4480cf98d1814f17beeafdb5824794aa/1920.jpeg"
    },
    {
      "author": null,
      "description": "SAN FRANCISCO (AP) — Another wet winter storm swamped California with heavy rainfall on Monday, flooding the runways at a regional airport and leading to several rescues on swollen rivers and creeks.",
      "publishedAt": "2024-02-19T05:09:26Z",
      "title": "Wet winter storm hits California, closing regional airport and trapping people in swollen rivers",
      "url": "https://apnews.com/f359d1eccd44b5a7f3a09f0d436d7689",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e973d3800d544ade894a102eb9077c50/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW DELHI (AP) — Indian farmers who have been protesting for a week to demand guaranteed crop prices have rejected a proposal from the government, and say they will continue their march to the capital New Delhi.",
      "publishedAt": "2024-02-20T03:50:49Z",
      "title": "Indian farmers reject government offer and say they will carry on marching to New Delhi",
      "url": "https://apnews.com/f704cb213ebfc435cbc64c974d1d595d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b75931b9fcc417185c2cf5e336c483e/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY",
      "description": "CAPE TOWN, South Africa (AP) — Aid organizations fear a new humanitarian crisis in the restive eastern Congo region, where the renowned armed rebel group M23 is in the midst of a new advance that threatens to cut off a major city and leave millions of people struggling for food and medical help.",
      "publishedAt": "2024-02-19T16:40:02Z",
      "title": "What's happening in eastern Congo and why aid groups are warning of a new humanitarian crisis",
      "url": "https://apnews.com/2c1c7789e499622e377eefcacc833ec2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/693d01c1bb674f548ab13445057ef1ff/3000.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "NORFOLK, Va. (AP) — Like the other Founding Fathers, George Washington was uneasy about the idea of publicly celebrating his life. He was the first leader of a new republic — not a tyrant. And yet the nation once again commemorated the first U.S.",
      "publishedAt": "2024-02-17T18:58:36Z",
      "title": "Presidents Day: From George Washington's modest birthdays to big sales and 3-day weekends",
      "url": "https://apnews.com/1dfed24d0e7e920f9004727b5218dcdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a828c75d02764919a3ba13a0c6b93908/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}