{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and JON GAMBRELL",
      "description": "JERUSALEM (AP) — Booms and air raid sirens sounded across Israel early Sunday after Iran launched hundreds of drones, ballistic missiles and cruise missiles in an unprecedented revenge mission that pushed the Middle East closer to a regionwide war.",
      "publishedAt": "2024-04-13T08:20:12Z",
      "title": "Israel says Iran launched more than 300 drones and missiles, 99% of which were intercepted",
      "url": "https://apnews.com/33fcffde2d867380e98c89403776a8ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3625e4e074134052834fd49d04e48b33/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — President Joe Biden on Saturday lauded American forces who helped Israel down “nearly all” of the drones and missiles fired by Iran and vowed to coordinate a global response to Tehran's unprecedented attack.",
      "publishedAt": "2024-04-13T17:52:29Z",
      "title": "US helps Israel shoot down 'nearly all' Iran-launched attack drones as Biden vows support",
      "url": "https://apnews.com/c57e89a9cbe178b20b53bac404a86728",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e55f558891654644a814a994e9254e69/1920.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — An incoming attack by more than 300 Iranian drones and ballistic missiles was the latest challenge to Israel’s air defense system, which already has been working overtime to cope with incoming rocket, drone and missile attacks throughout the six-month war against Hamas.",
      "publishedAt": "2024-04-13T23:19:13Z",
      "title": "Israel's multilayered air-defense system protected it from Iran's drone and missile strike",
      "url": "https://apnews.com/bbf6330918da036f2e000360556a81f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68a04247432f4db5858784141ed38125/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel hailed the success of its defenses in the face of an unprecedented attack by Iran involving hundreds of drones, ballistic missiles and cruise missiles.An Israeli military spokesman said Sunday the launches numbered more than 300, but 99% of them were intercepted.",
      "publishedAt": "2024-04-14T05:40:11Z",
      "title": "The Latest | Israel hails interception of drones and missiles in unprecedented attack by Iran",
      "url": "https://apnews.com/42c5166c1df7d871a2302ade55cf7179",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e11bbfa3830348e4817fc7cc3c9218af/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and JONATHAN J. COOPER",
      "description": "SCHNECKSVILLE, Pa. (AP) — Former President Donald Trump on Saturday lit into New York prosecutors and the criminal hush money case they brought against him during his last rally before what he called a “communist show trial” begins Monday.",
      "publishedAt": "2024-04-13T04:03:09Z",
      "title": "Trump goes after the judge and prosecutors in his hush money case in last rally before trial begins",
      "url": "https://apnews.com/bf7963685d1a518af7fcfd92ebacd049",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97ca216ece7a415fb6392716abfb87a3/2455.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — On a clear night a year ago, a dozen heavily armed fighters broke into Omaima Farouq’s house in an upscale neighborhood in the Sudanese capital of Khartoum. At gunpoint, they whipped and slapped the woman, and terrorized her children.",
      "publishedAt": "2024-04-14T05:04:35Z",
      "title": "World paid little attention to Sudan's war for a year. Now aid groups warn of mass death from hunger",
      "url": "https://apnews.com/57b3226207b9c9121a6b3137f6a0ad04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/662fa55009de4edfa2870269d6e7b99a/3000.jpeg"
    },
    {
      "author": null,
      "description": "SYDNEY (AP) — Police have identified the assailant who stabbed six people to death at a busy Sydney shopping center before he was fatally shot by a police officer.",
      "publishedAt": "2024-04-14T00:00:57Z",
      "title": "Police in Australia identify the Sydney stabbing attacker who killed 6 people",
      "url": "https://apnews.com/22068107d1569dbc374f709a74539c30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/215db5de47414e539aaaf86887a8bd55/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Faith Ringgold, an award-winning author and artist who broke down barriers for Black female artists and became famous for her richly colored and detailed quilts combining painting, textiles and storytelling, has died.",
      "publishedAt": "2024-04-13T23:23:50Z",
      "title": "Faith Ringgold, pioneering Black quilt artist and author, dies at 93",
      "url": "https://apnews.com/d246c574578149b49edb5f612fd8310f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c769020cf8b433cb0d763fd513d99e5/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "AUGUSTA, Ga. (AP) — Scottie Scheffler was in the lead and seemingly in control of his game Saturday in the Masters until realizing there was no such thing at Augusta National.He posed over another beautiful shot at the flag on the 10th hole and was stunned to see it take a hard hop over the green and roll down into the bushes.",
      "publishedAt": "2024-04-13T14:35:01Z",
      "title": "Scottie Scheffler leads Masters by 1 shot on a wild day of movement",
      "url": "https://apnews.com/dbafb7b5d205767df5239fc3383a7a55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eea0b36cff2c43e5aaf9f5edf925931f/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "MEXICO CITY (AP) — Giovanny Tovar left Venezuela five years ago in search of a job after his country came undone under the watch of President Nicolás Maduro. He now sells empanadas and tequeños in the streets of Peru’s capital, where he pushes around a small cart outfitted with a deep fryer.",
      "publishedAt": "2024-04-14T05:00:31Z",
      "title": "Venezuelans living abroad want to vote for president this year but can't meet absentee requirements",
      "url": "https://apnews.com/5001f67210a52d20426e4a4937f1c9f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd7119d585b741ee89fb4ddfa0a50bd5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}