{
  "articles": [
    {
      "author": "LISA MASCARO, KEVIN FREKING and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The U.S. is on the brink of a federal government shutdown after hard-right Republicans in Congress rejected a longshot effort to keep offices open as they fight for steep spending cuts and strict border security measures that Democrats and the White House say are too extreme.",
      "publishedAt": "2023-09-30T04:09:40Z",
      "title": "On the brink of a government shutdown, the Senate tries to approve funding but it's almost too late",
      "url": "https://apnews.com/732baaa19c91f981e492fd0e6a76aba8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20084087cf184675ba9ce8825725a811/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Staring down a likely government shutdown, the White House wants to make sure any blame falls at the other end of Pennsylvania Avenue — specifically on House Republicans. After all, it's House Republicans who have been paralyzed by their inability to pass a funding package, and Republicans who don't want to uphold a bipartisan spending agreement from earlier this year.",
      "publishedAt": "2023-09-30T04:03:28Z",
      "title": "Biden says shutdown isn't his fault. Will Americans agree?",
      "url": "https://apnews.com/db00d2e7953e7b22068800792e2d1aa3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4aba6ffb19ef4b19a0bbd69f2068db80/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — The first arrest in the 1996 slaying of Tupac Shakur had its roots in the investigation of the killing of Biggie Smalls.",
      "publishedAt": "2023-09-30T04:09:20Z",
      "title": "Arrest in Tupac Shakur killing stemmed from Biggie Smalls death investigation",
      "url": "https://apnews.com/4a65a9936866f18be6ed7859b67904bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89a69994eba542acb5ee8a3d14d525a1/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — When Washington Sen. Patty Murray received a call early Friday morning that Sen.",
      "publishedAt": "2023-09-30T04:05:27Z",
      "title": "The Feinstein they knew: Women of the Senate remember a fighter and friend",
      "url": "https://apnews.com/37e8ba38f4cac4ebbe25d31a49e29c75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8797703701148dfad6422a2f2f42ecc/1916.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ, BOBBY CAINA CALVAN and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — One of New York's wettest days in decades left the metropolitan area stunned and swamped Friday after heavy rainfall knocked out several subway and commuter rail lines, stranded drivers on highways, flooded basements and shuttered a terminal at LaGuardia Airport for hours.",
      "publishedAt": "2023-09-30T05:05:11Z",
      "title": "New York stunned and swamped by record-breaking rainfall as more downpours are expected",
      "url": "https://apnews.com/22d7572ecaab50953269612b4f807880",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54c315651227465d9a2af3904d4177e4/1920.jpeg"
    },
    {
      "author": "CORA LEWIS",
      "description": "NEW YORK (AP) — Millions of Americans must start repaying their federal student loans again in October, with monthly payments averaging hundreds of dollars a month.",
      "publishedAt": "2023-09-30T10:31:05Z",
      "title": "Borrowers are reassessing their budgets as student loan payments resume after pandemic pause",
      "url": "https://apnews.com/926666f8ee68168f1ba870b5f747885e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/339cce0ea9734b729d39da841fc494aa/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — Pope Francis created 21 new cardinals at a ritual-filled ceremony Saturday, including key figures at the Vatican and in the field who will help enact his reforms and cement his legacy as he enters a crucial new phase in running the Catholic Church.",
      "publishedAt": "2023-09-30T08:15:24Z",
      "title": "Pope Francis creates 21 new cardinals who will help him to reform the church and cement his legacy",
      "url": "https://apnews.com/e82d415c0edf68d4d5e09c1312b6a8e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb16a66318184fdeb7960880e2e4712f/3000.jpeg"
    },
    {
      "author": "MARGERY A. BECK",
      "description": "LINCOLN, Neb. (AP) — As Nebraska's new law restricting gender-affirming care for minors goes into effect this weekend, families with transgender children and the doctors who treat them are steeling themselves for change.",
      "publishedAt": "2023-09-30T04:11:24Z",
      "title": "Transgender minors in Nebraska, their families and doctors brace for a new law limiting treatment",
      "url": "https://apnews.com/58f4f7bc1c2c733ed164f13e6585a7f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7906d57a70994c02b9e5f29ab7894e4f/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russian President Vladimir Putin on Saturday insisted that the residents of four Ukrainian regions that Moscow illegally annexed a year ago “made their choice — to be with their Fatherland.”",
      "publishedAt": "2023-09-30T08:40:51Z",
      "title": "Putin marks anniversary of annexation of Ukrainian regions as drones attack overnight",
      "url": "https://apnews.com/56e42e8488e9812d22d1223e2bd29473",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fd8f80cd30744c28ecd76c45f9422d8/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "DES MOINES, Iowa (AP) — Having stood out in two presidential debates, Nikki Haley has booked her largest venue in Iowa since launching her campaign. She's hoping to fill a 600-person hall in a western Des Moines suburb on Saturday.",
      "publishedAt": "2023-09-30T04:01:56Z",
      "title": "Iowa's two campaigns: Donald Trump's rivals search for paths to stop him as he blazes his own trail",
      "url": "https://apnews.com/248c76ec4b9253495c668bcddf51297b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/584417eafee14ed4bab0112cb8f19ea7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}