{
  "articles": [
    {
      "author": "TERRY TANG",
      "description": "Jimmy O. Yang once played “Chinese Teenager #1.” He's now No. 1 on the call sheet in “Interior Chinatown” — despite playing downtrodden background actor Willis Wu in the new Hulu series.",
      "publishedAt": "2024-11-18T18:12:22Z",
      "title": "'Interior Chinatown': Its cast has faced Hollywood struggles uncannily like its characters",
      "url": "https://apnews.com/945dc249a00d138544acf98d210da5e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/243adef01fe7475b9af637ca4c3ea66d/1920.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "A social-media tribute to Coptic Christians. A billboard in Amish country. A visit to a revered Jewish gravesite. While Donald Trump's lock on the white evangelical vote is legendary, he and his campaign allies also wooed smaller religious groups, far from the mainstream.",
      "publishedAt": "2024-11-22T13:12:18Z",
      "title": "Beyond evangelicals, Trump and his allies courted smaller faith groups, from the Amish to Chabad",
      "url": "https://apnews.com/eee11dc29462ea9051bb4086c571dd1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05f41056e5e448c697cb9e3ec90eb484/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "MARTIN, Tenn. (AP) — Losing a Cabinet nominee to the confirmation process isn't unheard of for incoming presidents — including for Donald Trump when he was elected the first time.Matt Gaetz's decision to pull his name Thursday from consideration for attorney general — amid continued fallout over a federal sex trafficking investigation — represents the first indication of resistance that the president-elect could face from his own party, including picks facing allegations of sexual misconduct or other questions.",
      "publishedAt": "2024-11-22T05:00:57Z",
      "title": "Gaetz's withdrawal highlights how incoming presidents often lose Cabinet nominees",
      "url": "https://apnews.com/1c7daf57241bee1ae49dc817a0afba1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed1a122471b046f6b0f4b09413957416/3000.jpeg"
    },
    {
      "author": "BY WAFAA SHURAFA and FATMA KHALED",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Yasmin Eid coughs and covers her face, cooking a small pot of lentils over a fire fed with twigs and scrap paper in the tent she shares with her husband and four young daughters in the Gaza Strip.",
      "publishedAt": "2024-11-22T05:09:49Z",
      "title": "Many in Gaza are eating just once a day, as hunger spreads amid aid issues",
      "url": "https://apnews.com/9500a5d59f31c7dd4722115fe5dba83e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73383c07a13e45fc99e5b2100398db16/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and VOLODYMYR YURCHUK",
      "description": "KYIV, Ukraine (AP) — NATO and Ukraine will hold emergency talks Tuesday after Russia attacked a central city with an experimental, hypersonic ballistic missile that escalated the nearly 33-month-old war.",
      "publishedAt": "2024-11-22T10:30:56Z",
      "title": "NATO and Ukraine to hold emergency talks after Russia's attack with new hypersonic missile",
      "url": "https://apnews.com/d374dc8ca0fa626e674d29df01ce95cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72b9656c832442b6b351b797b3139928/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — A judge confirmed Friday that President-elect Donald Trump won't be sentenced this month in his hush money case, instead setting a schedule for prosecutors and his lawyers to expand on their ideas about what to do next.",
      "publishedAt": "2024-11-22T16:28:07Z",
      "title": "Judge delays Trump hush money sentencing in order to decide where case should go now",
      "url": "https://apnews.com/7e24ad275c8a9fa759751aa2e0740653",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38871df356fe4eceba6c2dd3cb88250a/3000.jpeg"
    },
    {
      "author": "GODOFREDO A. VÁSQUEZ, JANIE HAR and CHRISTOPHER WEBER",
      "description": "FORESTVILLE, Calif. (AP) — A major storm continued to drop heavy snow and record rain Friday as it moved through Northern California, closing roads and prompting evacuations in some areas, after killing two people and knocking out power to hundreds of thousands in the Pacific Northwest.",
      "publishedAt": "2024-11-22T13:40:32Z",
      "title": "Northern California gets record rain and heavy snow. Many have been in the dark for days in Seattle",
      "url": "https://apnews.com/590bac4e27f5ef91f3580561625d0f24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77bd75bc372048de87339f6d23f31bc7/1920.jpeg"
    },
    {
      "author": "NADIA LATHAN",
      "description": "AUSTIN, Texas (AP) — Texas would allow Bible-infused lessons in elementary schools under changes that were set for a final vote Friday and could test boundaries between religion and public education in the U.S.",
      "publishedAt": "2024-11-22T05:07:37Z",
      "title": "Texas is taking a final vote on allowing Bible-infused lessons in public schools",
      "url": "https://apnews.com/52b74577982b34ce2607b693bd51cae7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0343e8efafa4417ad4cb19b06944e3b/1920.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — Drug reform advocates hailed Oregon as a progressive leader when it became the first in the nation to legalize the therapeutic use of psilocybin, the compound found in psychedelic mushrooms.",
      "publishedAt": "2024-11-22T05:06:16Z",
      "title": "A growing number of Oregon cities vote to ban psychedelic mushroom compound psilocybin",
      "url": "https://apnews.com/9c73a25986171b41bb162100d54d2217",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0210c47e112942e4937586670526ef02/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "DALLAS (AP) — Delta and United have become the most profitable U.S.",
      "publishedAt": "2024-11-22T11:09:02Z",
      "title": "US budget airlines are struggling. Will pursuing premium passengers solve their problems?",
      "url": "https://apnews.com/8030d14c5fd8d3ffc53aacf0e9982cc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f84cc164c384f7389667cc1865ebf00/1951.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}