{
  "articles": [
    {
      "author": null,
      "description": "Israel’s military has targeted an Al Jazeera correspondent with an airstrike, killing him, another of its journalists and at least six other people sheltering outside a Gaza City hospital. Officials at Shifa Hospital confirmed the deaths of correspondents Anas al-Sharif and Mohamed Qureiqa, along with four other journalists and two other people. Israel's military described al-Sharif as a Hamas leader, an allegation dismissed by Al Jazeera. The network called the strike a “targeted assassination.” This incident marks the first time during the conflict that Israel has swiftly claimed responsibility after a journalist's death. The Committee to Protect Journalists reports at least 186 journalists have been killed in Gaza.",
      "publishedAt": "2025-08-11T07:43:46Z",
      "title": "Israeli strike kills Al Jazeera correspondent Anas al-Sharif",
      "url": "https://apnews.com/article/mideast-wars-gaza-journalist-jazeera-c7d73f1d3cfa3d24fb4ce5a294c08d32",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf0ef68/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F19%2Fb491eaa6ced1c74395f75e65dc5b%2F59b9231ded2844c1b7cb6230abc68edb"
    },
    {
      "author": null,
      "description": "Australian Prime Minister Anthony Albanese says Australia will recognize a Palestinian state. His remarks on Monday followed weeks of urging from within his Cabinet and from many in Australia to recognize a Palestinian state and amid growing criticism from officials in his government over suffering in Gaza. Australia’s government has also criticized plans announced in recent days by Israeli leader Benjamin Netanyahu for a sweeping new military offensive in Gaza.",
      "publishedAt": "2025-08-11T03:23:05Z",
      "title": "Australia will recognize a Palestinian state, Prime Minister Albanese says",
      "url": "https://apnews.com/article/australia-palestinian-state-albanese-3d32a2d823a430cb85d3f6a83158dd90",
      "urlToImage": "https://dims.apnews.com/dims4/default/857994f/2147483647/strip/true/crop/5194x2922+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F1d%2Fd669f46bfb3632a8ec39c3e75573%2F7f16b49f69074588afcb25c1fde1e827"
    },
    {
      "author": null,
      "description": "Police in London are bracing for more demonstrations on Sunday as the war in Gaza continues to inflame tensions across the U.K. Demonstrators plan to march to the prime minister’s residence, demanding the release of hostages in Gaza. The march organizers emphasize the humanitarian aspect of their demand for the hostages’ release, saying it’s not a political issue. This follows the arrest of 474 people on Saturday at a protest supporting a banned pro-Palestinian group. The group, Palestine Action, was banned after activists damaged military planes. Supporters are challenging the ban in court.",
      "publishedAt": "2025-08-10T10:20:32Z",
      "title": "Demonstrators seeking release of Gaza hostages to march in London as Middle East tensions grip UK",
      "url": "https://apnews.com/article/palestine-action-protest-israeli-hostages-cad78ce82f9e8e7627f2c842cc5157a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef330b4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F21%2F478b25180b1a9b12abccb5f623ac%2F53d810530e1143e08378c03e3fa2e1bb"
    },
    {
      "author": null,
      "description": "President Donald Trump is promising new steps to tackle homelessness and crime in Washington. And that's leading the city’s mayor to voice concerns about the potential use of the National Guard to patrol the streets in the nation’s capital. Trump says in a social media post that he plans a White House news conference at 10 a.m. Monday to discuss his plans to make the District of Columbia, in his words, “safer and more beautiful than it ever was before.” On Thursday, the Republican president directed an increased federal law enforcement presence in the Democratic-run city for seven days, “with the option to extend as needed.” Federal agencies including the FBI assigned more than 120 officers and agents to assist in Washington.",
      "publishedAt": "2025-08-11T04:02:28Z",
      "title": "Trump is promising new steps to tackle crime in Washington",
      "url": "https://apnews.com/article/trump-washington-crime-national-guard-homelessness-655bc22834223c7dc93115bbcb2b215c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1266a77/2147483647/strip/true/crop/5153x2899+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F63%2F8baa7c6be3d31be5eca593125cca%2F6e1d0893946249429e055b72185c5b67"
    },
    {
      "author": null,
      "description": "A blistering heatwave gripped southwest France on Monday, sending thermometers soaring to 43 degrees Celsius in parts of the Charente and Aude. In Aude, a patchwork of vineyards and Mediterranean scrubland, hundreds of firefighters remained on the hillsides guarding the edges of a massive blaze that scorched 16,000 hectares last week. Officials say the flames are under control, but warn the fire will not be fully extinguished for weeks. The national weather authority, Meteo-France, placed 12 departments on red alert, France’s highest heat warning, anticipating exceptional heat stretching from the Atlantic coast to the Mediterranean plains. Another 41 departments were under lower-level orange alerts, as was the neighboring microstate of Andorra.",
      "publishedAt": "2025-08-11T08:51:11Z",
      "title": "Southwest France swelters as temperatures hit 43 C",
      "url": "https://apnews.com/article/heatwave-france-red-alert-fires-0041a4f17e22eaa205964ed5c01d6c24",
      "urlToImage": "https://dims.apnews.com/dims4/default/20d3e0e/2147483647/strip/true/crop/7556x4250+0+462/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2Fc3%2Fb1639a801b8dcec608a9220438f5%2F034f2448ac4545419b277378ea61d0c9"
    },
    {
      "author": null,
      "description": "Ukrainian soldiers on the front line doubt that peace talks can end the war with Russia. Explosions from Russian weapons keep them underground and nothing on the Eastern Front suggests an end is near. Many soldiers feel diplomatic efforts are far removed from the battlefield, citing broken U.S. promises. Suggestions to exchange territories, such as leaving the Donetsk region, confuse and frustrate them. Some soldiers believe a brief pause in hostilities is more likely than peace. As the war drags on, soldiers train intensively, knowing there's no way back. Commanders say a ceasefire might happen, but true peace seems distant.",
      "publishedAt": "2025-08-11T06:05:18Z",
      "title": "On the front lines in eastern Ukraine, peace feels far away",
      "url": "https://apnews.com/article/russia-ukraine-war-attack-front-lines-52263396fbecbcad8138c6af0ba39cca",
      "urlToImage": "https://dims.apnews.com/dims4/default/1655d37/2147483647/strip/true/crop/6925x3895+0+361/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2Fca%2Fd3ee0f8a78fb26cb1010c1af2553%2Fa6ae50b41a564010b7c4c478b619c732"
    },
    {
      "author": null,
      "description": "A Russian official says a Ukrainian drone attack has killed one person and wounded two more in Russia’s Nizhny Novgorod region. Gov. Gleb Nikitin said in an online statement Monday that drones targeted two “industrial zones” that caused unspecified damage along with the three casualties. Russia’s Defense Ministry said its air defenses intercepted and destroyed a total of 39 Ukrainian drones overnight and Monday morning over several Russian regions as well as over the Crimean peninsula that Russia annexed in 2014. Fighting continued ahead of a planned summit meeting in which Russian President Vladimir Putin hopes to persuade his U.S. counterpart to back a peace deal locking in Moscow’s gains.",
      "publishedAt": "2025-08-11T10:17:30Z",
      "title": "Ukrainian drone strike kills 1 in as fighting rages ahead of a planned Trump-Putin summit",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-strike-575aa4ce590256d50a9d73911f681269",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e0a04e/2147483647/strip/true/crop/7194x4047+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F37%2Fdbbcbf0e27592010dcaa3dda679f%2F6b8ea36faa274882bceb9ba1efc55c48"
    },
    {
      "author": null,
      "description": "Flash flooding canceled the final day of the Wisconsin State Fair on Sunday as continued heavy rainfall in half a dozen Midwest states has led to water rescues, power outages and road closures. The National Weather Service has issued flood watches and warnings for parts of Kansas, Iowa, Nebraska, Missouri, Illinois and Wisconsin. Forecasters predict “repeated rounds of heavy rain,” along with hail, damaging winds and isolated tornadoes. Among the worst hit is the Milwaukee area, where as many as 12 inches of rain had fallen in some areas. USA Triathlon also canceled its Sprint and Paratriathlon National Championships in Milwaukee, where thousands were expected to compete.",
      "publishedAt": "2025-08-10T15:24:52Z",
      "title": "Midwest flooding cancels Wisconsin State Fair and cuts power",
      "url": "https://apnews.com/article/weather-wisconsin-flooding-rain-1557a999c587bc9c6d6fe0bb6363add2",
      "urlToImage": "https://dims.apnews.com/dims4/default/1083d57/2147483647/strip/true/crop/2191x1232+0+191/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F47%2F3b6f366762fc0ac731230720ac4f%2F6bdfd993f83840b0bd313e65ff9e65e6"
    },
    {
      "author": null,
      "description": "Michigan's governor met privately with President Donald Trump to urge him to change course on tariffs that are having a big impact on automakers in her state. Democrat Gretchen Whitmer came for the Oval Office meeting Tuesday with a visual presentation to warn that the tariffs threaten Michigan’s economy and undermine Trump’s promises to revive manufacturing. Trump has stuck with high import taxes despite pushback from auto executives as the tariffs cost the industry billions and trigger layoffs. Whitmer’s rare access to Trump as a leading Democrat underscores the political and economic stakes as the president considers escalating tariffs further.",
      "publishedAt": "2025-08-09T13:01:12Z",
      "title": "Whitmer to Trump: Change course on tariffs to help Michigan's auto jobs",
      "url": "https://apnews.com/article/trump-whitmer-michigan-tariffs-auto-industry-c14e8791aa880643bddcdf9ea5372dca",
      "urlToImage": "https://dims.apnews.com/dims4/default/43413ea/2147483647/strip/true/crop/5353x3011+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F2f%2Fd08a871f855070aec7db972c7f08%2F39402fe149714986b54ae50bdb4adf30"
    },
    {
      "author": null,
      "description": "Philippine President Ferdinand Marcos Jr. says his country will inevitably be drawn “kicking and screaming” in any war over Taiwan due to its proximity and the presence of large numbers of Filipino workers on the self-ruled island, despite China’s strong protest over such remarks. Marcos has also told a news conference Monday that the Philippines' coast guard and navy defending its territorial interests in the South China Sea will never back down after the Chinese coast guard staged dangerous blocking maneuvers and used a powerful water cannon to try to drive away Philippine vessels from the hotly disputed Scarborough Shoal.",
      "publishedAt": "2025-08-11T05:33:04Z",
      "title": "Marcos says the Philippines will be drawn 'kicking and screaming' into any Taiwan war",
      "url": "https://apnews.com/article/philippines-ferdinand-marcos-taiwan-south-china-sea-66d58ca064aea64c937fd5f0d311348b",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3a5897/2147483647/strip/true/crop/2896x1629+0+151/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2Fda%2Fbbbdb2f29dba227088ad43619277%2F7a6a7657a4ed4dba916b3e47b7c46ab1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}