{
  "articles": [
    {
      "author": "VASILISA STEPANENKO and EVGENIY MALOLETKA",
      "description": "VOVCHANSK, Ukraine (AP) — Moscow's forces captured five villages in a renewed ground assault in northeastern Ukraine, the Russian Defense Ministry said Saturday, and Associated Press journalists in the city of Vovchansk described multiple buildings destroyed after Russian airstrikes and barrages of Grad rockets.",
      "publishedAt": "2024-05-11T10:09:43Z",
      "title": "Russia says it has captured 5 villages in northeast Ukraine as more than 1,700 civilians flee",
      "url": "https://apnews.com/26184a3898db0aece9f6e9eb3a700e7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/764711a329c54915bae8aeaee54056e5/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The alleged sexual encounter at the center of Donald Trump's criminal hush money trial got a graphic airing in court this past week as porn actor Stormy Daniels shared her account before a rapt jury.",
      "publishedAt": "2024-05-11T04:06:20Z",
      "title": "Trump trial turns to sex, bank accounts and power: Highlights from the third week of testimony",
      "url": "https://apnews.com/c69d54c51e2fccbbc0b19e2220222b0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f885f342e878451e99a1bc6026de0c5d/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAM MEDNICK and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel ordered new evacuations in Gaza's southern city of Rafah on Saturday, forcing tens of thousands more people to move as it prepares to expand its military operation closer to the heavily populated central area, in defiance of growing pressure amid the war from close ally the United States and others.",
      "publishedAt": "2024-05-11T07:02:12Z",
      "title": "Israel orders new evacuations in Gaza's last refuge of Rafah as it expands military offensive",
      "url": "https://apnews.com/7cc8784d8c6eec017ecaef696f492b25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52e946c2b753405bb75b0140a96c25f4/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MIKE CATALINI",
      "description": "TRENTON, N.J. (AP) — After a long week in court, Donald Trump is heading to the Jersey Shore. And his campaign says he'll be joined by “tens of thousands” of his friends.",
      "publishedAt": "2024-05-11T04:05:20Z",
      "title": "Trump heading to Jersey Shore to rally 'mega crowd' in weekend break from hush money trial",
      "url": "https://apnews.com/59a8073e5a22f7a1e13f1461e9998419",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5455f5804401489a8591f61685a1e4c0/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — Donald Trump is known for leveling constant and often personal attacks on top rivals such as Joe Biden.",
      "publishedAt": "2024-05-11T12:41:48Z",
      "title": "Trump is increasingly directing personal attacks against independent rival Robert F. Kennedy Jr.",
      "url": "https://apnews.com/7512ce6c2537453ea400f6dfaae87282",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c446ce784ff0489a9900a21c6e021d1e/3000.jpeg"
    },
    {
      "author": "TOM KRISHER, JOSH FUNK and MARCIA DUNN",
      "description": "A powerful solar storm put on an amazing skyward light show across the globe overnight but has caused what appeared to be only minor disruptions to the electric power grid, communications and satellite positioning systems.",
      "publishedAt": "2024-05-11T16:56:03Z",
      "title": "Solar storm puts on brilliant light show across the globe, but no serious problems reported",
      "url": "https://apnews.com/eb7fabd1dfbd734a398192bf4c701ca5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc910c6ba1cc4373b70bbf1e1e8239ea/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "FORT LIBERTY, N.C. (AP) — Forced to do more with less and learning from the war in Ukraine, U.S. special operations commanders are juggling how to add more high-tech experts to their teams while still cutting their overall forces by about 5,000 troops over the next five years.",
      "publishedAt": "2024-05-11T11:59:46Z",
      "title": "US special operations leaders are having to do more with less and learning from the war in Ukraine",
      "url": "https://apnews.com/ac7c41d5d9f299fadc96f2c2520c2abf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90f00ebb19ef4765af37ee78fa163534/1453.jpeg"
    },
    {
      "author": "GRAHAM LEE BREWER",
      "description": "Historically, when students at American universities and colleges protest — from the Civil Rights Movement to Black Lives Matter — there's a common refrain that “outside agitators” are to blame. College administrators and elected officials have often pointed to community members joining protests to dismiss the demands of student protesters.",
      "publishedAt": "2024-05-11T11:24:53Z",
      "title": "What's the history of 'outside agitators'? Here's what to know about the label and campus protests",
      "url": "https://apnews.com/116a4d24f006fe5173f265335f37e1d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/567019abe262409ca44193f7d89f0593/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — Brenda Edwards considers the four bedroom ranch-style house where she has lived for 20 years her forever home. It's where the 70-year-old retired nurse and her 79-year-old husband want to stay as their mobility becomes more limited.",
      "publishedAt": "2024-05-11T09:00:41Z",
      "title": "Some older Americans splurge to keep homes accessible while others struggle to make safety upgrades",
      "url": "https://apnews.com/a40df169bc69fe94d163ecc76c0801ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f4261e31a6a4ebd90ddd10baa417c7e/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "MALMO, Sweden (AP) — The Netherlands' contestant in the Eurovision Song Contest was dramatically expelled from competition hours before Saturday's final of the pan-continental pop competition, which has been rattled by protests over the participation of Israel.",
      "publishedAt": "2024-05-11T07:38:40Z",
      "title": "Dutch contestant kicked out of Eurovision hours before tension-plagued song contest final",
      "url": "https://apnews.com/09e31963ed7db607ea137c9333eabf87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6620e9595516436091f2bb34edac9a0e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}