{
  "articles": [
    {
      "author": "Hanna Arhirova",
      "description": "Days before the third anniversary of Russia’s full-scale invasion, Ukrainians are as somber and tense as they were right before Moscow launched the war. Only now, they aren’t just worried about their longtime enemy. Ukraine’s stunning new threat comes from its once staunchest ally, the United States. U.S. support appears to be fading as President Donald Trump parrots the propaganda of Russian President Vladimir Putin as he pledges to stop the fighting between the two countries. After their initial shock at Trump’s false claims this week that Ukraine is led by a “dictator” who started the war with Russia, the Ukrainian people are rallying around a defiant President Volodymyr Zelenskyy, who publicly criticized Trump for promoting Russian “disinformation.”",
      "publishedAt": "2025-02-21T05:06:24Z",
      "title": "Ukrainians rally around their president after Trump seeks to denigrate him",
      "url": "https://apnews.com/article/ukraine-russia-trump-zelenskyy-putin-c0790f9054c6c69d698ed9aa816158ac",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ae3b90/2147483647/strip/true/crop/3371x1896+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F31%2F4665026ba62b31004a1141ee4f2f%2Fd1437193bdcf4480abc28e41e4008e80"
    },
    {
      "author": "Jill Lawless",
      "description": "Political and military leaders in Europe are fleshing out details of a plan for European forces to help ensure Moscow does not attack Ukraine again once the guns fall silent. The proposal backed by Britain and France would see fewer than 30,000 European troops on the ground in in Ukraine, backed by Western air and sea power. The proposal will likely be on the agenda when British Prime Minister Keir Starmer and French President Emmanuel Macron visit Washington next week to meet President Donald Trump. Starmer has stressed that the force won’t work without U.S. military might to back it up. Persuading Trump to provide it could be a tall order.",
      "publishedAt": "2025-02-21T05:09:17Z",
      "title": "European troops, US support are part of an emerging plan for Ukraine. But it faces many hurdles",
      "url": "https://apnews.com/article/ukraine-europe-security-force-us-backstop-nato-b3eed0878e15f4ce5d4388e32f2dd64c",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ceddde/2147483647/strip/true/crop/4098x2305+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F59%2F8983701dd46b6022466548392ffb%2Fa6fadff6446144e996e20aaa1a61da6a"
    },
    {
      "author": "Justin Spike",
      "description": "A news conference that was planned to follow talks between Ukrainian President Volodymyr Zelenskyy and U.S. President Donald Trump’s Ukraine envoy has been canceled. The cancellation happened Thursday as political tensions deepened between the two countries over how to end the almost three-year war with Russia. The event was originally supposed to include comments to the media by Zelenskyy and retired U.S. Lt. Gen. Keith Kellogg. But it was changed at the last minute to a simple photo opportunity where two leaders posed for journalists. They did not deliver statements or field questions. A Ukrainian presidential spokesman said the change was requested by the U.S. side.",
      "publishedAt": "2025-02-20T15:01:08Z",
      "title": "News conference between Zelenskyy, Trump’s Ukraine envoy canceled amid growing tensions",
      "url": "https://apnews.com/article/ukraine-zelenskyy-trump-kellogg-821625d76fd88a139066f4436323700c",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a79fbb/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2Fb8%2Fa819e8d407d772675f2b340f82c9%2Fcf657fd972d64a99856d7fbdfd7c3573"
    },
    {
      "author": "Aamer Madhani",
      "description": "A top White House official says President Donald Trump's increasingly tough criticism of Volodymyr Zelenskyy reflects the administration’s growing frustration with what they see as the Ukrainian leader creating roadblocks to finding an endgame to Russia’s invasion of Ukraine. The comments from White House national security adviser Mike Waltz on Thursday came after Trump described Zelenskyy as a “dictator” and warned that he “better move fast” to negotiate an end the war or risk not having a nation to lead. Waltz said the frustration with Zelenskyy is “multifold\" and said Zelenskyy needs to demonstrate “deep appreciation” for what U.S. taxpayers and Trump have done for Ukraine.",
      "publishedAt": "2025-02-20T20:46:48Z",
      "title": "US official says Trump's frustration with Zelenskyy is 'multifold'",
      "url": "https://apnews.com/article/trump-zelenskyy-frustrations-1cc3076d20c0933b513ced96bd6ddd26",
      "urlToImage": "https://dims.apnews.com/dims4/default/fec10d8/2147483647/strip/true/crop/5908x3323+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Fc1%2Fae85261bf670cc91314f6b0953bb%2F8761e42016cb469dafd5abbac5c8d7fa"
    },
    {
      "author": "Mogomotsi Magome, Michelle Gumede, Gerald Imray",
      "description": "U.K. Foreign Secretary David Lammy says he saw no appetite for peace from Russia in Ukraine after listening to a speech by Russia’s top diplomat at a tense Group of 20 meeting in South Africa. Lammy was speaking after Russian Foreign Minister Sergey Lavrov addressed other senior diplomats in a closed-door session at the G20 foreign ministers meeting in Johannesburg on Thursday. Lammy said Lavrov left his seat in the meeting room when it was Lammy's turn to speak. The G20 gathering comes days after bilateral talks between the United States and Russia over ending the war in Ukraine. Those talks sidelined Washington’s European allies and Ukraine, who weren’t involved.",
      "publishedAt": "2025-02-20T08:39:56Z",
      "title": "UK foreign secretary questions Russia's 'appetite' for peace and challenges Lavrov at tense G20 meet",
      "url": "https://apnews.com/article/south-africa-g20-foreign-ministers-us-e489b7a48ad5fcc7f5a7583a26865600",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ccfaae/2147483647/strip/true/crop/8006x4503+0+416/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F4f%2F6c1eede82a3e20fb4da7b0fd349c%2Faa510614eb2c4f9397cfc6007e3fa4c2"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking",
      "description": "Senators are launching a budget “vote-a-rama” in a crucial, if dreaded, step toward President Donald Trump's agenda. They are staying late Thursday to debate a $340 billion package Trump’s team says it needs for mass deportations and security measures that top the Republican agenda. It's a sight to see: Senators will be voting in rapid-fashion for hours on one amendment after another diving into intricate policy details, largely from Democrats trying to halt the package. Even if the Senate package is approved, it still needs to be merged with one from the House, which is preparing Trump's “big, beautiful bill” that includes some $4.5 trillion in tax cuts and up to $2 trillion less spending.",
      "publishedAt": "2025-02-20T23:27:03Z",
      "title": "Senate ready to stay up all night to pass GOP budget",
      "url": "https://apnews.com/article/senate-budget-trump-tax-cuts-deportations-48f6565ccb0fd6002734dbb5c3c3ffb7",
      "urlToImage": "https://dims.apnews.com/dims4/default/f00250a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F2b%2F9760a09a886139353ec60ab80ebf%2Ffbc94327fe4c40e5b5f54cef989edf41"
    },
    {
      "author": null,
      "description": "Mexico President Claudia Sheinbaum says she will propose reforms to the country’s constitution to protect Mexico’s sovereignty after U.S. President Donald Trump’s administration designated six Mexican drug cartels as foreign terrorist organizations. On Thursday, the designation of eight Latin America-based criminal organizations was published in the U.S. Federal Register, carrying out a Jan. 20 executive order by Trump. The U.S. hopes the designation, something usually reserved for terrorist groups with political rather than economic objectives, will increase pressure on the groups. Sheinbaum said during her daily press briefing Thursday that Mexico wouldn’t allow outside involvement in investigations or prosecutions without authorization and collaboration of the Mexican government.",
      "publishedAt": "2025-02-20T15:39:24Z",
      "title": "Mexico to reform constitution in wake of US terrorism designations",
      "url": "https://apnews.com/article/mexico-us-cartels-terrorism-trump-cc70d0ea7b0332b889da820bec1629bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ffd9a3/2147483647/strip/true/crop/5094x2865+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2Ff3%2F46b2b25fd43bf67dd46736e04faf%2F29e4ffed656b4187805bb326f066c641"
    },
    {
      "author": "Kirsten Grieshaber, Kerstin Sopke",
      "description": "More than half a million newly naturalized citizens will be able to vote in Germany’s national election for the first time this weekend. Almost a third of the new Germans are originally from Syria. In 2015-2016 alone, more than 1 million migrants came to Germany, most from Syria, but also from Afghanistan and Iraq. Since the last national election in 2021, the number of naturalizations in Germany has risen sharply: More than 500,000 people were naturalized between 2021 and 2023, according to government data. While the numbers for 2024 are not yet available, experts estimate more than 250,000 people were naturalized in Germany last year.",
      "publishedAt": "2025-02-21T08:23:45Z",
      "title": "Many who came to Germany as migrants will vote for the first time Sunday. Here's what they hope for",
      "url": "https://apnews.com/article/germany-election-migrants-citizenship-voters-syria-democracy-fd5ae93fa59010685f671109ca4024d3",
      "urlToImage": "https://dims.apnews.com/dims4/default/545d52e/2147483647/strip/true/crop/1200x675+0+65/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2Fe1%2Fe753c318428a9ed0a8f431e76b43%2Fgermany-votes-share.jpg"
    },
    {
      "author": "Areej Hazboun",
      "description": "Israeli Prime Minister Benjamin Netanyahu has vowed revenge for what he described as a “cruel and malicious violation” of the ceasefire agreement after a body that Hamas released as part of the deal was found to not be that of an Israeli mother of two young boys, as the militants had promised. The incident has thrown the future of the fragile ceasefire into question. Six more living hostages are scheduled to be released Saturday as part of the tenuous ceasefire that has paused over 15 months of war.",
      "publishedAt": "2025-02-21T09:40:25Z",
      "title": "Netanyahu slams 'cruel and malicious violation' of Gaza ceasefire deal over release of body",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-21-2025-e8f2f233b4c07a23f06040a808081642",
      "urlToImage": "https://dims.apnews.com/dims4/default/acd3cdf/2147483647/strip/true/crop/5298x2980+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2Fdb%2Fba46c7c1dddc3be2a1b61be7f821%2Fa22913b56c9c4da38fc4168e61edc766"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli Prime Minister Benjamin Netanyahu says a body that Hamas militants released during the handover of remains of Israeli hostages is that of a woman from Gaza instead of that of Shiri Bibas, the mother of two young boys whose bodies were returned on Thursday. In a statement released Friday, Netanyahu criticized the handover of the wrong remains as a “cruel and malicious violation” of the ceasefire agreement, which has halted fighting in the Gaza Strip, and said Hamas would “pay the full price” for the action. Hamas militants turned over four bodies on Thursday under the tenuous ceasefire, which has paused over 15 months of war. Israeli identified the other three as belonging to Oded Lifshitz and Shiri Bibas’ two young sons.",
      "publishedAt": "2025-02-21T07:26:06Z",
      "title": "Middle East latest: Netanyahu says body Hamas released was that of a woman from Gaza, not a hostage",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-ceasefire-news-02-21-2025-f067e34268e5011e5874fa8398b5f0c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5dc5ae6/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F53%2Fafb9494eb589d5248232bb033d7c%2Fe3be91ec2d2b4954ad9160e630fd0582"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}