{
  "articles": [
    {
      "author": "Ellen Knickmeyer, Matthew Lee, Mark Sherman",
      "description": "The Trump administration says it is eliminating more than 90% of the U.S. Agency for International Development’s foreign aid contracts and $60 billion in overall U.S. assistance around the world. That’s according to an internal memo obtained by The Associated Press as well as court filings Wednesday. They detail the outcome of a 90-day review ordered by President Donald Trump of all the money provided by USAID and the State Department for development and aid work overseas. The move leaves few surviving USAID projects for advocates to try to save in what are ongoing court battles. Meanwhile, the Supreme Court late Wednesday temporarily blocked a court order requiring the administration to release billions of dollars in foreign aid.",
      "publishedAt": "2025-02-26T23:27:52Z",
      "title": "Supreme Court blocks order for Trump administration to release billions in US foreign aid",
      "url": "https://apnews.com/article/trump-usaid-foreign-aid-cuts-6292f48f8d4025bed0bf5c3e9d623c16",
      "urlToImage": "https://dims.apnews.com/dims4/default/3576dc3/2147483647/strip/true/crop/5212x2932+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2Fbf%2Fc9d7bef4d9c72024409dc3f16ea9%2F295bbc7950564e698abd859d63bb8717"
    },
    {
      "author": "Chris Megerian",
      "description": "President Donald Trump's administration says federal agencies should begin planning to eliminate employee positions. The process is known as a reduction in force. Agency leaders must submit their plans by March 13. Trump is setting the stage for what could become a dramatic realignment of the federal government. He's already downsized the workforce by laying off probationary employees. Now the administration is turning its attention to career officials with civil service protection. Trump foreshadowed this goal in an executive order that he signed with Elon Musk, the billionaire entrepreneur who's advising the Republican president on overhauling the government.",
      "publishedAt": "2025-02-26T16:31:00Z",
      "title": "Trump administration sets stage for large-scale federal worker layoffs in new memo",
      "url": "https://apnews.com/article/trump-elon-musk-federal-workers-layoffs-d295d4bb2cdd5023c27d9cb03754e81b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d981041/2147483647/strip/true/crop/7394x4159+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F41%2Fe107c105defd724c2bdc48419a33%2F57ed9e887bf24efb9d5367711da29934"
    },
    {
      "author": "Gary Fields",
      "description": "Thousands of U.S. Agency for International Development workers who have been fired or placed on leave as part of the Trump administration’s dismantling of the agency are being given a brief window Thursday and Friday to clear out their workspaces. USAID has been one of the biggest targets so far of a broad campaign by President Donald Trump and the Department of Government Efficiency, a project of Elon Musk, to slash the size of the federal government. Many USAID workers saw the administration’s terms for retrieving their belongings as insulting. In the notice, the employees were instructed not to bring weapons, including firearms, “spear guns” and “hand grenades.” Each worker is being given 15 minutes at their former workstation.",
      "publishedAt": "2025-02-27T05:07:31Z",
      "title": "USAID workers will be given 15 minutes to clear their workspaces as the agency gets dismantled",
      "url": "https://apnews.com/article/trump-musk-doge-usaid-federal-workers-bfb69a0bf38419b7518555de42169ca1",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d93429/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F7f%2F12121486caf950413a59e745966f%2F490b44454b174d3fb2482ceded310cb7"
    },
    {
      "author": "Tara Copp, Carla K. Johnson",
      "description": "The Department of Veterans Affairs has temporarily suspended billions of dollars in contract cuts after an uproar that critical veterans health services were harmed, lawmakers and veterans service organizations said Wednesday. The pause affects hundreds of VA contracts that Secretary Doug Collins a day earlier described as simply consulting deals whose cancellation would save $2 billion. The Associated Press has obtained the full list of 875 of contracts up for cancellation, and it shows the cuts would have affected everything from cancer care to the ability to assess toxic exposure. It underscores how the administration’s approach to broad swath spending cuts have had immediate and potentially unintended consequences.",
      "publishedAt": "2025-02-26T23:44:10Z",
      "title": "Veterans Affairs pauses cuts lauded by Elon Musk as lawmakers, veterans decry loss of critical care",
      "url": "https://apnews.com/article/doge-veterans-affairs-cuts-health-services-contracts-9a726b744e402da01d711023b0fc49a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/880d936/2147483647/strip/true/crop/5100x2869+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F21%2Fb2422e0c15ea0efc2189b5036c5c%2F001c7c8c71a04876882ece68d0d0b273"
    },
    {
      "author": "Lolita C. Baldor, Tara Copp",
      "description": "Building lethality in the military may be the buzzword for the new Trump administration, but busywork and paperwork have become the reality at the Pentagon, as service members and civilian workers are facing a broad mandate to purge all of the department’s social media sites and untangle confusing personnel reduction moves. A new memo requires the military services to spend countless hours poring over years of website postings, photos, news articles and videos to remove any mentions that “promote diversity, equity and inclusion.” If they can’t do that by March 5, they must “temporarily remove from public display\" all content published during the Biden administration’s four years in office.",
      "publishedAt": "2025-02-27T01:02:02Z",
      "title": "Pentagon orders new purge of social media sites to dump diversity, inclusion mentions by March 5",
      "url": "https://apnews.com/article/pentagon-social-media-purge-lethality-cc404f00493578d4210e3efe2440648f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3faf15/2147483647/strip/true/crop/5246x2951+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fa7%2Fbec5a5b099e6c571e1ae440da8fa%2F86901f68313141d0a1fef40c42ae389b"
    },
    {
      "author": "Elliot Spagat, Will Weissert",
      "description": "President Donald Trump says he plans to offer a “gold card” visa with a path to citizenship for $5 million, replacing a 35-year-old visa for investors. Commerce Secretary Howard Lutnick said Tuesday the Trump Gold Card would replace EB-5 visas in two weeks. EB-5s were created by Congress in 1990 to generate foreign investment and are available to people who spend about $1 million on a company that employs at least 10 people. Lutnick says the Republican president's gold card would raise the price of admission for investors and eliminate fraud. The gold card is actually a green card, or permanent legal residency.",
      "publishedAt": "2025-02-26T18:16:51Z",
      "title": "Trump sees 'a thirst' for his 'gold card' immigration visa idea",
      "url": "https://apnews.com/article/trump-gold-card-visa-million-investors-1aa4585dc053e21c7d887f1fdb9eec13",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe3d5ef/2147483647/strip/true/crop/5724x3220+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F89%2F02b5ff94141b3e76dee66e94dad8%2F2e6c4e72fe6b485ea0bbcc1324e5d92c"
    },
    {
      "author": "Mohammad Jahjouh, Wafaa Shurafa",
      "description": "Hamas says it was ready to negotiate the the next phase of the ceasefire in the Gaza Strip after handing over the remains of four hostages in exchange for the release of more than 600 Palestinian prisoners held by Israel. The exchange early Thursday was the last planned handover of the first phase of the truce, which is set to end this weekend. Negotiations over the next phase, in which Hamas would release dozens of remaining hostages in exchange for more prisoners and a lasting ceasefire, have not yet begun.",
      "publishedAt": "2025-02-27T07:02:11Z",
      "title": "Bodies of 4 Israeli hostages identified after Hamas returned them, group says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-02-27-2025-cfcdd8786afe4bc73ae79b3e0e4ccb3b",
      "urlToImage": "https://dims.apnews.com/dims4/default/2af2e38/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F41%2F7182936257d78b536e9d76e8486d%2F120ee35bda8e4b6f84370dd5fda25294"
    },
    {
      "author": null,
      "description": "A Romanian official says influencer brothers Andrew and Tristan Tate, who are charged with human trafficking in Romania, have left for the U.S. after a travel ban imposed on them was lifted The brothers are also charged with forming a criminal gang to sexually exploit women. It is not clear under what conditions the Tates — who are keen supporters of U.S. President Donald Trump and boast millions online followers — were allowed to leave Romania. An official at the Ministry of Internal Affairs, who spoke on condition of anonymity because they were not authorized to discuss the case, said the decision was at the discretion of prosecutors.",
      "publishedAt": "2025-02-27T08:37:46Z",
      "title": "Andrew Tate and Tristan Tate have left Romania for US, Romanian official says",
      "url": "https://apnews.com/article/romania-andrew-tate-us-04749679b90fad821c2b945955f5b145",
      "urlToImage": "https://dims.apnews.com/dims4/default/c78e3d0/2147483647/strip/true/crop/6600x3712+0+344/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2Fb1%2F0425aefad2ca105e6650d8f331c7%2Febc4dc66e5d94b17b6669916e5674af3"
    },
    {
      "author": "Alexa St. John",
      "description": "A deal this week will give the United States access to Ukraine’s mineral wealth. The country has a number of minerals critical to manufacturing including titanium, lithium and uranium. A subset of these, rare earth metals, are also important for a number of economic areas including the clean energy transition. President Donald Trump, who has pushed for the agreement, has long been critical of a transition to green energies, including wind, solar and others, along with electrification of transportation and appliances. But the minerals Ukraine possesses are needed for aerospace, medical devices, specialty glass and hundreds of other uses, making access to them a priority for the first Trump administration as well as this one.",
      "publishedAt": "2025-02-26T20:56:42Z",
      "title": "Why the Trump administration may want Ukraine's minerals",
      "url": "https://apnews.com/article/climate-trump-united-states-ukraine-minerals-57c6c566b330c8941a3ba6a7d5f8dd2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dad798f/2147483647/strip/true/crop/3033x1706+0+158/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2Fc8%2F03b64e1a1e4f892580b3768aaa01%2F6b15448a826944e7b992fc1b88e0375c"
    },
    {
      "author": "Susie Blann, Hanna Arhirova, Vasilisa Stepanenko",
      "description": "Three senior Ukrainian officials say that Ukraine and the U.S. have reached an agreement on a framework for a broad economic deal that would include the exploitation of rare earth minerals. The officials, who were familiar with the matter, spoke on condition of anonymity because they were not authorized to speak publicly. One of them said that Kyiv hopes that signing the agreement will ensure the continued flow of U.S. military support that the country urgently needs. There was no immediate response to a request for comment from the administration of U.S. President Donald Trump.",
      "publishedAt": "2025-02-25T21:29:24Z",
      "title": "Ukraine and US have agreed on a framework economic deal, Ukrainian officials say",
      "url": "https://apnews.com/article/russia-ukraine-war-economic-agreement-us-72ee2cfa720f6a42455c5425007060e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c0e807/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F0d%2F6eb6b5f0c5fef96fd09d67dc4c90%2Fe1a99fbe53af49bdae21abd1c3ea9d95"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}