{
  "articles": [
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said Sunday that 31,000 Ukrainian soldiers have been killed in action in the two years since Russia launched its full-scale invasion.",
      "publishedAt": "2024-02-25T15:56:40Z",
      "title": "31,000 Ukrainian troops killed since the start of Russia's full-scale invasion, Zelenskyy says",
      "url": "https://apnews.com/675f53437aaf56a4d990736e85af57c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34b901b3cb534ce088a3ed2344208d74/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — An Israeli military offensive in the southernmost city of Rafah could be “delayed somewhat” if a deal for a weekslong cease-fire between Israel and Hamas is reached, Prime Minister Benjamin Netanyahu said Sunday, but claimed that total victory in Gaza is “weeks away” once the offensive begins.",
      "publishedAt": "2024-02-25T08:31:20Z",
      "title": "Netanyahu says a cease-fire deal would only delay 'somewhat' an Israeli military offensive in Rafah",
      "url": "https://apnews.com/f3e4ea708548689cf8d9d404c3ee94ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89ba7cc0d2ac4c4f9ec7b93e3d58f384/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "GENEVA (AP) — Since late last century and the early days of the web, providers of digital media like Netflix and Spotify have had a free pass when it comes to international taxes on films, video games and music that are shipped across borders through the internet.",
      "publishedAt": "2024-02-25T06:12:37Z",
      "title": "Tax-free status of movie, music and games traded online is on table as WTO nations meet in Abu Dhabi",
      "url": "https://apnews.com/0ecda9f0c06ec37b961a2b2a77803fbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afd5a9da1004475d84b0e6066425f1c5/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and MEG KINNARD",
      "description": "CHARLESTON, S.C. (AP) — Republican presidential candidate Nikki Haley says it's not “the end of our story” despite Donald Trump's easy primary victory in South Carolina, her home state where the onetime governor had long suggested her competitiveness with the former president would show.",
      "publishedAt": "2024-02-25T16:33:53Z",
      "title": "Off to Michigan, Haley is staying in the race despite Trump's easy primary win in South Carolina",
      "url": "https://apnews.com/ee571b2024cb6bba665507dd63c6a730",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0560cb3200924eef8958a5981eccc747/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "EDMOND, Okla. (AP) — Vigils took place across the nation on Friday and Saturday for an Oklahoma teenager who died the day after a fight in a high school bathroom in which the nonbinary student claimed to be a target of bullying.",
      "publishedAt": "2024-02-25T08:07:37Z",
      "title": "Vigils held nationwide for nonbinary Oklahoma teenager who died following school bathroom fight",
      "url": "https://apnews.com/fd7695afb780d09c00b823fa0618e79f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d93533ec58443f8a478291872d2b29d/3000.jpeg"
    },
    {
      "author": "LEANNE ITALIE",
      "description": "NEW YORK (AP) — Leap year. It's a delight for the calendar and math nerds among us. So how did it all begin and why?Have a look at some of the numbers, history and lore behind the (not quite) every four year phenom that adds a 29th day to February.",
      "publishedAt": "2024-02-25T05:03:13Z",
      "title": "What would happen without a Leap Day? More than you might think",
      "url": "https://apnews.com/c6936d284843ec2722b2eb215159efed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/033b0599fc894d89b912bfa5f3be3181/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — A severe lack of affordable housing has prompted Oregon lawmakers to consider chipping away at a 1970s law that made the state a national leader in leveraging land use policy to prevent suburban sprawl and conserve nature and agriculture.",
      "publishedAt": "2024-02-25T05:01:48Z",
      "title": "A housing shortage is testing Oregon's pioneering land use law. Lawmakers are poised to tweak it",
      "url": "https://apnews.com/d85c2413f169cd02cbf6b15fd9c95329",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a821cb54cb945228cd348dd5b39b0ef/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "BOISE, Idaho (AP) — For nearly 50 years, Idaho's prison staffers have been serving Thomas Eugene Creech three meals a day, checking on him during rounds and taking him to medical appointments. This Wednesday, some of Idaho's prison staffers will be asked to kill him.",
      "publishedAt": "2024-02-25T05:01:38Z",
      "title": "Idaho is set to execute a long-time death row inmate, a serial killer with a penchant for poetry",
      "url": "https://apnews.com/b742b8296d6609956708cb45fb6e5ebb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28ccbca5d60d464b9a0b6bb0c3381269/481.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. and Britain struck 18 Houthi targets in Yemen on Saturday, answering a recent surge in attacks by the Iran-backed militia group on ships in the Red Sea and Gulf of Aden, including a missile strike this past week that set fire to a cargo vessel.",
      "publishedAt": "2024-02-24T09:29:12Z",
      "title": "US and British strikes on Houthi sites in Yemen answer militants’ surge in Red Sea attacks on ships",
      "url": "https://apnews.com/89b3f92ae9dd6279b56d945439010a27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4b2169bb264422b8bb3eaa2c465cb80/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Half of promised Western military support to Ukraine fails to arrive on time, complicating the task of military planners and ultimately costing the lives of soldiers in Russia's war, the Ukrainian defense minister said Sunday.",
      "publishedAt": "2024-02-25T12:42:00Z",
      "title": "Delays in promised Western military aid to Ukraine are costing lives, the defense minister says",
      "url": "https://apnews.com/a8909760655d83d2ffc0d67ad2a491ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac902179c6224b58b59b8dc174bcc2b7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}