{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces severed northern Gaza from the rest of the besieged territory ahead of an expected push into the dense confines of Gaza City.",
      "publishedAt": "2023-11-06T07:37:38Z",
      "title": "Israeli forces sever north Gaza from the rest of the territory ahead of expected push into Gaza City",
      "url": "https://apnews.com/51286d15dddd77ae0dd7ea76ee52bc71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d419614d81d748c19de5dcf8b47f2cfd/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli troops divided the northern and southern parts of Gaza, as communications across the besieged territory were temporarily cut Monday for a third time since the war started. The troops are expected to enter Gaza City on Monday or Tuesday, Israeli media reported.",
      "publishedAt": "2023-11-06T05:32:24Z",
      "title": "Live updates | Israeli troops surround Gaza City. Communications being restored to territory",
      "url": "https://apnews.com/c01bc7cf6db1e07ab4d235225cef7320",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b23d53e93554b2fbec42abe533b4a37/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "ANKARA, Turkey (AP) — U.S. Secretary of State Antony Blinken wrapped up a grueling Middle East diplomatic tour on Monday in Turkey after only limited success in efforts to forge a regional consensus on how best to ease civilian suffering in Gaza as Israel intensifies its war against Hamas.",
      "publishedAt": "2023-11-06T09:50:26Z",
      "title": "Blinken wraps up frantic Mideast tour with tepid, if any, support for pauses in Gaza fighting",
      "url": "https://apnews.com/9ff3aae906aaae71613fb2a9afed2bdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/828906bb9ecf4ff9bc84e2ea238a052f/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — When Donald Trump takes the stand Monday in a Manhattan courtroom to testify in his civil fraud trial, it will be an undeniable spectacle: A former president and the leading Republican presidential candidate defending himself against allegations that he dramatically inflated his net worth.",
      "publishedAt": "2023-11-06T05:30:28Z",
      "title": "Trump's business and political ambitions poised to converge as he testifies in New York civil case",
      "url": "https://apnews.com/dca74420da0f92ee9bc9caff7a92c3b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/300a11c2dbcb467aa2b8f8d8757ea1e9/3000.jpeg"
    },
    {
      "author": "BRENDAN FARRINGTON",
      "description": "TALLAHASSEE, Fla. (AP) — A Florida governor wins reelection by record numbers and later finds himself running as a party conservative in a crowded presidential primary. In New Hampshire, he tip-toes around the explosive abortions rights issue, discusses ongoing Israeli military operations, promises he'll secure the Mexican border and warns that the current administration's fiscal insanity will cause more inflation, not reduce it.",
      "publishedAt": "2023-11-06T05:16:48Z",
      "title": "Can a Floridian win the presidency? It hasn't happened yet as Trump and DeSantis vie to be first",
      "url": "https://apnews.com/84a6a2eb53cfd3d1f46de55704e74160",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3166010a083344e7af3d605ac64dadd1/3000.jpeg"
    },
    {
      "author": "SALLY HO and GARANCE BURKE",
      "description": "Some are orphans, others seized from their parents. Many are older and have overwhelming needs or disabilities. Most bear the scars of trauma from being hauled between foster homes, torn from siblings or sexually and physically abused.",
      "publishedAt": "2023-11-06T05:17:25Z",
      "title": "Inspired by online dating, AI tool for adoption matchmaking falls short for vulnerable foster kids",
      "url": "https://apnews.com/f803bf3faa02bc90d285e68b1d2bc560",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02d9d015c0254d899345907ecfa19e81/3000.jpeg"
    },
    {
      "author": null,
      "description": "LEWISTON, Maine (AP) — Two senators from Maine asked the U.S. Army inspector general on Monday to provide a full accounting of interactions with a reservist before he killed 18 people and injured 13 others in the deadliest shooting in the state's history.",
      "publishedAt": "2023-11-06T11:07:02Z",
      "title": "US senators seek answers from Army after reservist killed 18 in Maine",
      "url": "https://apnews.com/430a610f7f80ab7499edca9d78439432",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab5a874de0454db2adff4aeafd6e7822/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Ruth Glenn knows from harrowing personal experience the danger of putting a gun in the hands of a violent spouse or partner, the issue at the heart of a case before the Supreme Court.",
      "publishedAt": "2023-11-06T05:23:48Z",
      "title": "Why one survivor of domestic violence wants the Supreme Court to uphold a gun control law",
      "url": "https://apnews.com/debeb3aeaabc6c81dcdb369963ea2bec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e551b8b5f3c4f7892d30481f84c02af/3000.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Aid trickled in to villages Monday in Nepal’s northwest mountains flattened by a strong earthquake over the weekend as villagers searched through the rubble of their collapsed homes to salvage what was left of their belongings.",
      "publishedAt": "2023-11-06T08:25:08Z",
      "title": "Aid trickles in to Nepal villages struck by earthquake as survivors salvage belongings from rubble",
      "url": "https://apnews.com/41f843df12711fcd2d7470e32ebc2757",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff6376f9374e45548ffaf45b4b8603a8/3000.jpeg"
    },
    {
      "author": null,
      "description": "CHICAGO (AP) — A former hockey player in the Chicago Blackhawks organization has alleged in a lawsuit the team's former video coach sexually assaulted him during the 2009-10 season and the Blackhawks responded inadequately to his complaint because it didn't want a disruption during its Stanley Cup run.",
      "publishedAt": "2023-11-06T04:09:47Z",
      "title": "Another ex-player is alleging Blackhawks' former video coach sexually assaulted him in 2009-10",
      "url": "https://apnews.com/220621b6d7a3cb973b4f1e7a777e1291",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fe3edf88b2847aea1b3a38f210cc1cf/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}