{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB and RAVI NESSMAN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Medics in Gaza warned Sunday that thousands could die as hospitals packed with wounded people ran desperately low on fuel and basic supplies. Palestinians in the besieged coastal enclave struggled to find food, water and safety ahead of an expected Israeli ground offensive in the war sparked by Hamas' deadly attack.",
      "publishedAt": "2023-10-15T04:52:54Z",
      "title": "Gaza hospitals are overwhelmed with patients and desperately low on supplies as invasion looms",
      "url": "https://apnews.com/6cf0ff04e513ecec12cf9152656ac1b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d9387c2dbe449c99b170d04253e37be/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — Najla Shawa and her family are safe for now after fleeing their home in Gaza City, but she’s worried she may never be able to return.",
      "publishedAt": "2023-10-15T16:09:14Z",
      "title": "Palestinian mother fears for her children as she wonders about the future after evacuating Gaza City",
      "url": "https://apnews.com/eb423ed9cd160ea06af85bfd6c00f9f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbf65e4544ca4edb897a49ab71fe626c/3000.jpeg"
    },
    {
      "author": "PAMELA SAMPSON",
      "description": "When Hamas unleashed its attack on thousands of Jews attending a music festival in southern Israel earlier this month, an Israeli Arab paramedic insisted on staying at the scene to try to save lives.",
      "publishedAt": "2023-10-15T10:44:11Z",
      "title": "An Arab paramedic who treated Israelis injured by Hamas militants is remembered as a hero",
      "url": "https://apnews.com/c16a667db45db2ee62bcd993a24d6ee5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dead531dece1437ca5e5dcf5bf175265/1500.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "CAIRO (AP) — Egypt's president criticized Israel’s military operation in Gaza in a stern pushback Sunday to the United States as America's top diplomat extended his frenetic travels across the Mideast trying to prevent the war with Hamas from igniting a broader regional conflict.",
      "publishedAt": "2023-10-15T12:15:56Z",
      "title": "Egypt's leader criticizes Israel's Gaza operation as the top US diplomat extends his Mideast mission",
      "url": "https://apnews.com/cb925bb41b99b4c190f026e9e9ff8fab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c694e87e8aad457aa36739e476357670/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "SITRIYA, Israel (AP) — Rarely do rabbis spend the Sabbath counting bodies. But on Saturday, a week after Hamas militants blew easily past Israel’s fortified security fence and gunned down hundreds of Israelis — at music festivals, in their homes, in cars while trying to flee — Israel’s military rabbinate made an exception.",
      "publishedAt": "2023-10-15T17:48:41Z",
      "title": "Israeli rabbis work around the clock -- even on the Sabbath -- to count the dead from Hamas attack",
      "url": "https://apnews.com/cc5a54834246ed6699b111ad103f1774",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73cd0952b0404d748624f52754de1258/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Children take their places at folding tables on a church patio several miles from where their school burned down. Plastic tubs hold brand new textbooks quickly shipped from a publisher.",
      "publishedAt": "2023-10-15T04:28:30Z",
      "title": "Schools near a Maui wildfire burn zone are reopening. Parents wrestle with whether to send kids back",
      "url": "https://apnews.com/eb727f3d5e7345d098777708071716bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90f6df1c30b3443395b69a37450fb965/3000.jpeg"
    },
    {
      "author": "MONIKA SCISLOWSKA and VANESSA GERA",
      "description": "WARSAW, Poland (AP) — An exit poll on Sunday projected that Poland’s ruling conservative party, Law and Justice, won more votes than any other single party in the country’s parliamentary election but lost some support compared to the last election in 2019.",
      "publishedAt": "2023-10-15T05:24:43Z",
      "title": "Exit poll in Poland says that governing Law and Justice party wins the most votes in the election",
      "url": "https://apnews.com/720f7b81838c33ccb2865fb3bc6e0414",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80c0b6a8b05846e3856a7c44bf21b0ef/1920.jpeg"
    },
    {
      "author": null,
      "description": "ISLAMABAD (AP) — A powerful 6.3 magnitude earthquake struck western Afghanistan on Sunday, just over a week after strong quakes and aftershocks killed thousands of people and flattened entire villages in the same province.",
      "publishedAt": "2023-10-15T04:38:45Z",
      "title": "Powerful earthquake shakes west Afghanistan a week after devastating quakes hit same region",
      "url": "https://apnews.com/8f6055342900e320ec5a5e4ea898399a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4eb335aa4dc4801a7987d43ed8c5e7c/3000.jpeg"
    },
    {
      "author": "AIDA SULTANOVA",
      "description": "BAKU, Azerbaijan (AP) — As a young man starting out as a dentist, Nazim Valiyev was forced to flee his home as ethnic violence roiled a separatist region inside Azerbaijan. More than three decades later, with his medical career over after a stroke, the 60-year-old hopes he can return there, now that it is back under Azerbaijani control.",
      "publishedAt": "2023-10-15T04:08:30Z",
      "title": "Azerbaijanis who fled a separatist region decades ago ache to return, but it could be a long wait",
      "url": "https://apnews.com/f86ea6a53d24f73351e9ca3f0c9e5b12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25b3cbb3e5ec4914b1f55ce3d0e3a4d9/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russian attacks on Ukraine over a 24-hour period killed six people, local officials reported Sunday.Two people were killed and three more injured in the Kherson area after more than 100 shells bombarded the region over the weekend, local governor Oleksandr Prokudin wrote on social media.",
      "publishedAt": "2023-10-15T10:59:58Z",
      "title": "6 killed in Russian attacks on Ukraine as Kyiv continues drone counterstrikes",
      "url": "https://apnews.com/b5a1d29456f9c2057724ad9ee54c830b",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}