{
  "articles": [
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Wednesday agreed to decide whether former President Donald Trump can be prosecuted on charges he interfered with the 2020 election and set a course for a quick resolution.",
      "publishedAt": "2024-02-28T22:05:15Z",
      "title": "Supreme Court sets April arguments over whether Trump can be prosecuted for election interference",
      "url": "https://apnews.com/ff4b251967b4f1ae85bd01a0db24931f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8843af5d61cb477e8c7fdc3f53288bb5/1920.jpeg"
    },
    {
      "author": "MICHAEL TACKETT",
      "description": "WASHINGTON (AP) — Mitch McConnell, the longest-serving Senate leader in history who maintained his power in the face of dramatic convulsions in the Republican Party for almost two decades, will step down from that position in November.",
      "publishedAt": "2024-02-28T17:21:06Z",
      "title": "McConnell will step down as the Senate Republican leader in November after a record run in the job",
      "url": "https://apnews.com/ba478d570a4561aa7baf91a204d7e366",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e35b012f2fee4ae68fd0dfba96fe938f/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Aid convoys carrying food reached northern Gaza this week, Israeli officials said Wednesday, the first major delivery in a month to the devastated, isolated area, where the U.N.",
      "publishedAt": "2024-02-28T19:02:17Z",
      "title": "Food aid reaches north Gaza for first time in weeks. Israeli hostages' families push for release",
      "url": "https://apnews.com/a8610b08edbf64578abae14426f99ed7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/542df821838f48108374e9264e1b2c5f/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY and JIM VERTUNO",
      "description": "CANADIAN, Texas (AP) — A cluster of wildfires scorched the Texas Panhandle on Wednesday, including a blaze that grew into one of the largest in state history, as flames moved with alarming speed and blackened the landscape across a vast stretch of small towns and cattle ranches.",
      "publishedAt": "2024-02-27T22:18:27Z",
      "title": "Wildfire grows into one of largest in Texas history as flames menace multiple small towns",
      "url": "https://apnews.com/2cad37f14581bac74a3691969aaaf956",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8dfde24278f9404f81d2ef956eb03039/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A New York appellate judge on Wednesday refused to halt collection of Donald Trump’s $454 million civil fraud penalty while he appeals, rejecting the former president’s request that he be allowed to post a bond covering just a fraction of what he owes.",
      "publishedAt": "2024-02-28T16:54:22Z",
      "title": "Appellate judge refuses to halt Trump's $454 million fraud penalty while he appeals",
      "url": "https://apnews.com/3093352e94274f9daba3d84f0c43467e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b853c540ac8b4bfd8e321120de980098/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court appeared torn Wednesday about a challenge to a Trump-era ban on bump stocks, a gun accessory that allows semi-automatic weapons to fire rapidly like machine guns and was used in the deadliest mass shooting in modern U.S.",
      "publishedAt": "2024-02-28T05:05:52Z",
      "title": "The Supreme Court appears torn about a Trump-era ban on a gun accessory known as bump stocks",
      "url": "https://apnews.com/edd86133ac7c20839e4b1712657c2fe1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c5ef15b97354ef589e8d50c213c30f8/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "BETHESDA, Md. (AP) — President Joe Biden “continues to be fit for duty,” his doctor wrote Wednesday after conducting an annual physical that is being closely watched as the 81-year-old seeks reelection in November.",
      "publishedAt": "2024-02-28T14:06:52Z",
      "title": "Biden 'continues to be fit for duty,' his doctor says, after president undergoes annual physical",
      "url": "https://apnews.com/05668d241d1a67b51b2a91c302c38985",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/293d8af2810f47abad3c82020ef20ec1/3000.jpeg"
    },
    {
      "author": "RICK CALLAHAN and BRUCE SHIPKOWSKI",
      "description": "Severe storms that appear to have spawned a rare February tornado outbreak sent sleeping Midwesterners scrambling for safety and left a trail of damage and power outages across four Great Lakes states, including the Chicago suburbs, ending a spell of summerlike, sometimes record temperatures.",
      "publishedAt": "2024-02-28T12:59:53Z",
      "title": "A tornado outbreak in February? In the Great Lakes? Storms leave a trail of destruction",
      "url": "https://apnews.com/300038a81e3d597dc0b92597042626a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f27a28383b2a49fcafc54ccca44c793f/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "TUCSON, Ariz. (AP) — Inside giant white tents that house about 1,000 migrants near Tucson International Airport, Border Patrol agents demonstrate clockwork efficiency to release detainees within two days of arrest with orders to appear in immigration courts at their final destinations.",
      "publishedAt": "2024-02-28T05:19:45Z",
      "title": "US asylum measure aimed at curbing claims has limited impact given strained border budget",
      "url": "https://apnews.com/58e447ee0033a5ef23593ed5c02da02e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ace0bde3bb0448b3959a191272414e91/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Richard Lewis, an acclaimed comedian known for exploring his neuroses in frantic, stream-of-consciousness diatribes while dressed in all-black, leading to his nickname “The Prince of Pain,” has died.",
      "publishedAt": "2024-02-28T21:02:22Z",
      "title": "Humorously morose comedian Richard Lewis, who recently starred on 'Curb Your Enthusiasm,' dies at 76",
      "url": "https://apnews.com/c4f69a5ecc8f03850222f8f2145f55ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60d4619b53b04ff1bb54426fef991288/2400.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}