{
  "articles": [
    {
      "author": "ABDULRAHMAN SHAHEEN, SARAH EL DEEB and ABBY SEWELL",
      "description": "DAMASCUS, Syria (AP) — Ousted Syrian leader Bashar Assad fled to Moscow and received asylum from his longtime ally, Russian media said Sunday, hours after a stunning rebel advance seized control of Damascus and ended his family’s 50 years of iron rule.",
      "publishedAt": "2024-12-08T07:23:26Z",
      "title": "Ousted Syrian leader Assad flees to Moscow after fall of Damascus, Russian state media say",
      "url": "https://apnews.com/816e538565d1ae47e016b5765b044d31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcfcc19627f7447e8791ab87f9ac415a/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "MANAMA, Bahrain (AP) — For Iran’s theocratic government, it keeps getting worse. Its decadeslong strategy of building an “Axis of Resistance” supporting militant groups and proxies around the region is falling apart.",
      "publishedAt": "2024-12-08T16:42:02Z",
      "title": "Analysis: Collapse of Syria's Assad is a blow to Iran's 'Axis of Resistance'",
      "url": "https://apnews.com/c853bf613a6d6af7f6aa99b2e60984f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5e256fc46094b478a9765ca4b936b9e/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Abu Mohammed al-Golani, the militant leader whose stunning insurgency toppled Syria’s President Bashar Assad, has spent years working to remake his public image, renouncing longtime ties to al-Qaida and depicting himself as a champion of pluralism and tolerance.",
      "publishedAt": "2024-12-08T11:46:31Z",
      "title": "Who is Abu Mohammed al-Golani, the leader of the insurgency that toppled Syria's Assad?",
      "url": "https://apnews.com/aab4c8894238904a4e351076726499fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9fe4a2ef31c49848936f34f54f3dbbd/3000.jpeg"
    },
    {
      "author": null,
      "description": "SEOUL, South Korea (AP) — Police are considering placing an overseas travel ban on South Korean President Yoon Suk Yeol as they investigate possible rebellion charges over his brief imposition of martial law last week, reports said Monday.",
      "publishedAt": "2024-12-09T02:07:09Z",
      "title": "South Korean police considering overseas travel ban on President Yoon over martial law",
      "url": "https://apnews.com/a196573506375f39d5645843bcf87828",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29cb84048bd14c4ba53cc97c840791bb/3000.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "DALLAS (AP) — Star outfielder Juan Soto and the New York Mets agreed Sunday to a record $765 million, 15-year contract, a person familiar with the deal told The Associated Press, a deal that could escalate to $805 million and is believed to be the largest pact in team sports history.",
      "publishedAt": "2024-12-09T03:27:37Z",
      "title": "Juan Soto agrees to record $765 million, 15-year contract with Mets, AP source says",
      "url": "https://apnews.com/f9d78b6de83eba8dbbe16d6e208bc884",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8988fb8bf3e741049788f25f6cece7b3/3000.jpeg"
    },
    {
      "author": "TAMMY WEBBER",
      "description": "Earth just experienced its second-warmest November on record — second only to 2023 — making it all but certain that 2024 will end as the hottest year ever measured, according to a report Monday by European climate service Copernicus.",
      "publishedAt": "2024-12-09T03:00:18Z",
      "title": "Second-warmest November on record means that 2024 is likely to be Earth's hottest year, report says",
      "url": "https://apnews.com/d1f41a2c7341c006f051ad321915d89c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad89b32dd88b4dcd8f005b757f1c624e/3000.jpeg"
    },
    {
      "author": "BILL BARROW and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Donald Trump said he can't guarantee that his promised tariffs on key U.S.",
      "publishedAt": "2024-12-08T17:03:32Z",
      "title": "Trump says he can't guarantee tariffs won't raise US prices and won't rule out revenge prosecutions",
      "url": "https://apnews.com/72c08269f0a870d20e29033319201e22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15ab5377a0eb49c3a75ff311e32160ae/3000.jpeg"
    },
    {
      "author": "JULIET LINDERMAN and MARTHA MENDOZA",
      "description": "Lara Trump will step down as co-chair of the Republican National Committee as she considers a number of potential options with her father-in-law, President-elect Donald Trump, set to return to the White House.",
      "publishedAt": "2024-12-09T03:19:10Z",
      "title": "Lara Trump steps down as RNC co-chair and addresses speculation about Florida Senate seat",
      "url": "https://apnews.com/d0b9102b1095c383173bd6e24bbca015",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3626440a47fa4f67ac959f3d8155a250/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "FORT LAUDERDALE, Fla. (AP) — President-elect Donald Trump has announced that he is appointing one of his defense attorneys in the New York hush money case as counselor to the president. Alina Habba, 40, defended Trump earlier this year, also serving as his legal spokesperson.",
      "publishedAt": "2024-12-09T01:21:39Z",
      "title": "Trump taps his attorney Alina Habba to serve as counselor to the president",
      "url": "https://apnews.com/942238382acd7cb36088fe870a47ee59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05d3d680ac0f49bdbd0409984475ba17/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — The search for UnitedHealthcare CEO Brian Thompson ’s killer since Thompson was ambushed Wednesday outside a Midtown Manhattan hotel has stretched beyond New York City.",
      "publishedAt": "2024-12-08T21:40:46Z",
      "title": "A timeline of the fatal shooting of UnitedHealthcare CEO Brian Thompson and search for his killer",
      "url": "https://apnews.com/b5ff640798d799271ddd8db9f3d2a20e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eef9ed0deed34515a23d0a310a4180d4/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}