{
  "articles": [
    {
      "author": "JONATHAN LANDRUM Jr.",
      "description": "PARIS (AP) — Curious about which songs are fueling the Olympians competing in Paris? The Associated Press has an idea. Some of the world's top athletes from the Olympics and Paralympics have shared their favorite warmup tracks, revealing what gets them pumped before a crucial game, meet or match.",
      "publishedAt": "2024-07-24T09:18:23Z",
      "title": "Can you guess Olympians' warmup songs? World's top athletes share their favorite tunes",
      "url": "https://apnews.com/82e3c6b2465738bc685e64059e496570",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d10c11e18bde4eebac2c2eef579a0bf6/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT, SEUNG MIN KIM and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has secured enough votes from delegates to become her party’s nominee for president, Democratic National Committee Chair Jaime Harrison said Friday.",
      "publishedAt": "2024-08-02T16:39:29Z",
      "title": "Harris has secured enough Democratic delegate votes to become their party's nominee, chair says",
      "url": "https://apnews.com/463d0b8095f2ca3526b3af3a2f44c3ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc4d0357b5574c3399c43515588a8b1a/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — When Kremlin critic Vladimir Kara-Murza was suddenly moved to a detention center in Moscow from a Siberian prison, he thought he was being taken there to be shot. Opposition activist Ilya Yashin said he was warned by a security operative that he would die in prison if he returned to Russia.",
      "publishedAt": "2024-08-02T13:20:52Z",
      "title": "Dissidents freed in prisoner swap vow to keep up fight against Putin, recount details of release",
      "url": "https://apnews.com/3c9a8b989eae34fdfe5ffcf62989832e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/226e4329fa4d44618ea6b586675cf512/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ZEKE MILLER AND MATTHEW LEE",
      "description": "WASHINGTON (AP) — It was December 2022 and the U.S. government's chief hostage negotiator had just delivered Brittney Griner back to America after her 10-month imprisonment in Russia.",
      "publishedAt": "2024-08-02T16:42:38Z",
      "title": "An assassin, a Putin foe's death, secret talks: How a sweeping US-Russia prisoner swap came together",
      "url": "https://apnews.com/efae784bb95d3e496bb53b0fbf0b185b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3d245b2688d461ba415f799540d0395/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. will move a fighter jet squadron to the Middle East and maintain an aircraft carrier in the region, the Pentagon said Friday, beefing up the American military presence to help defend Israel from possible attacks by Iran and its proxies and safeguard U.S.",
      "publishedAt": "2024-08-02T22:14:58Z",
      "title": "US to boost military presence in Mideast, sending fighter jet squadron and keeping carrier in region",
      "url": "https://apnews.com/418a990ab69cb766e126c60dbaebedb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/578cc78112c84ae3b20d1166602ee2f9/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — The statement that upended Venezuela came 24 hours after polls closed in the presidential election.With the reassuring tone of someone who has consistently been considered an underdog, opposition powerhouse Maria Corina Machado announced that her coalition had gathered more than two-thirds of vote tally sheets from polling centers nationwide, and that they show President Nicolás Maduro had lost his reelection bid.",
      "publishedAt": "2024-08-02T19:39:14Z",
      "title": "Venezuela's opposition secured over 80% of crucial vote tally sheets. Here's how they did it.",
      "url": "https://apnews.com/6d9f3999c60c09eb30e69c757ce80b11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1d2399412cc4654b4de0367c6cdfd4e/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER and PAUL WISEMAN",
      "description": "WASHINGTON (AP) — A surprising rise in the U.S. unemployment rate last month has rattled financial markets and set off new worries about the threat of a recession — but it could also prove to be a false alarm.",
      "publishedAt": "2024-08-02T19:01:48Z",
      "title": "Unemployment rise spurs fears of slowdown, yet recession signals have been wrong — so far",
      "url": "https://apnews.com/c7f1985b1ab3a7b781920c2693cd0438",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25cf5c4c4c3145cc99779fcb5f1a7415/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and AMELIA THOMSON-DEVEAUX",
      "description": "Most Americans have doubts about the Secret Service's ability to keep presidential candidates safe after last month's attempt on former President Donald Trump’s life, a new poll from the Associated Press-NORC Center for Public Affairs Research finds.",
      "publishedAt": "2024-08-02T04:18:59Z",
      "title": "Few Americans trust the Secret Service after a gunman nearly killed Trump, an AP-NORC poll finds",
      "url": "https://apnews.com/e5ef28f72d61080088a0835a1b9a7d39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55b12245177a404d9c0222435a369da5/1920.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Several suspects arrested in violent protests that erupted after the fatal stabbing of three children in northwest England made court appearances Friday as officials braced for more clashes that Prime Minister Keir Starmer condemned and blamed on “far-right hatred.”",
      "publishedAt": "2024-08-02T10:24:00Z",
      "title": "UK police brace for more far-right protests as government warns of tough response",
      "url": "https://apnews.com/5929ca5b0514dee578e29764b8961036",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6828620ebd4346e9bdd5d55484e6d458/3000.jpeg"
    },
    {
      "author": "NAMU SAMPATH of The Springfield Republican, MONICA OBRADOVIC of The St. Louis Post-Dispatch, HILARY BURNS of The Boston Globe, and CHRISTOPHER L. KELLER of The Associated Press",
      "description": "AMHERST, Mass. (AP) — Since her arrest at a protest at the University of Massachusetts, Annie McGrew has been pivoting between two sets of hearings: one for the misdemeanor charges she faces in court, and another for violations of the college's conduct code.",
      "publishedAt": "2024-08-02T04:04:22Z",
      "title": "For college students arrested protesting the war in Gaza, the fallout was only beginning",
      "url": "https://apnews.com/7cb75debddc2e8bd795d16515d07de09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b7c48b711594cb1b45bd8d83943baa6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}