{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and RAVI NESSMAN",
      "description": "RAFAH, Gaza Strip (AP) — Israel escalated airstrikes across the Gaza Strip on Tuesday, crushing families in the rubble of residential buildings, as health officials said hundreds of Palestinians were killed in the past day and medical facilities were shut down because of bomb damage and lack of power.",
      "publishedAt": "2023-10-24T07:15:30Z",
      "title": "Israeli airstrikes surge in Gaza, killing dozens at a time in destroyed homes, witnesses say",
      "url": "https://apnews.com/c2482817f230580c20b898bd65e5a4c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7cadcc504139499db35d2996e4bf8da1/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, LOLITA C. BALDOR, and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — The White House said Tuesday that “prudent contingency planning” is underway to evacuate Americans from the Middle East in case the Israel-Hamas war spreads into a broad regional conflict.",
      "publishedAt": "2023-10-24T19:49:52Z",
      "title": "US developing contingency plans to evacuate Americans from Mideast in case Israel-Hamas war spreads",
      "url": "https://apnews.com/dbc87b1f67949e0df63b5cc175dce7bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7fb0cb9f6c647e2992bc96e32e7e4f4/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, STEPHEN GROVES, FARNOUSH AMIRI and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Republicans chose Rep. Mike Johnson as their latest nominee for House speaker late Tuesday, hours after an earlier pick, Rep. Tom Emmer, abruptly withdrew in the face of opposition from Donald Trump and hardline GOP lawmakers.",
      "publishedAt": "2023-10-24T04:25:10Z",
      "title": "Republicans nominate Mike Johnson for House speaker after Emmer's withdrawal, desperate to end chaos",
      "url": "https://apnews.com/c7ddb6abf4c7322f9fc44fdaa07791fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c69fbedadce4ade8d214f02893315bd/1920.jpeg"
    },
    {
      "author": "CLAIRE RUSH and GENE JOHNSON",
      "description": "PORTLAND, Ore. (AP) — An off-duty airline pilot riding in an extra cockpit seat on a Horizon Air flight said “I’m not OK” just before trying to cut the engines midflight and later told police he had been struggling with depression, according to charging documents made public Tuesday.",
      "publishedAt": "2023-10-24T17:13:38Z",
      "title": "Off-duty pilot said 'I'm not OK' before trying to cut engines midflight, charging documents say",
      "url": "https://apnews.com/3a86194cccae802341243c77ea0d95ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30339eca8bb1435380333e21930146b0/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and KATE BRUMBACK",
      "description": "ATLANTA (AP) — Attorney and prominent conservative media figure Jenna Ellis pleaded guilty Tuesday to a felony charge over efforts to overturn Donald Trump’s 2020 election loss in Georgia, tearfully telling the judge she looks back on that time with “deep remorse.”",
      "publishedAt": "2023-10-24T13:45:57Z",
      "title": "Jenna Ellis becomes latest Trump lawyer to plead guilty over efforts to overturn Georgia's election",
      "url": "https://apnews.com/c4dbacd3e4bbb5415ebd3d42d8fa3128",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02e6159353f44ca9abf0448f97e8c441/2902.jpeg"
    },
    {
      "author": "JOSÉ ANTONIO RIVERA",
      "description": "ACAPULCO, Mexico (AP) — Hurricane Otis strengthened from a tropical storm to a dangerous Category 4 hurricane in a matter of hours Tuesday as it approached Mexico’s southern Pacific coast, where it was forecast to make landfall near the resort of Acapulco early Wednesday possibly as a catastrophic Category 5 storm.",
      "publishedAt": "2023-10-24T13:22:43Z",
      "title": "Hurricane Otis rapidly grows into Category 4 storm off Mexico's Pacific coast heading for Acapulco",
      "url": "https://apnews.com/993f639be22b1013e3faf0c5828da078",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/363b0d293a6144369fb83689f13b8dc3/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — In a courtroom showdown five years in the making, Donald Trump's fixer-turned-foe Michael Cohen testified Tuesday that he worked to boost the supposed value of the former president's assets to “whatever number Trump told us to.\"",
      "publishedAt": "2023-10-24T04:28:57Z",
      "title": "In court faceoff, Michael Cohen testifies against Trump in fraud trial. Trump shrugs: 'Proven liar'",
      "url": "https://apnews.com/8e49619e3f5ebb6931e6947c4dabda87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f69eb8a02be4d34a06ef28725499bc4/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "Dozens of U.S. states, including California and New York, are suing Meta Platforms Inc. for harming young people and contributing to the youth mental health crisis by knowingly and deliberately designing features on Instagram and Facebook that addict children to its platforms.",
      "publishedAt": "2023-10-24T20:43:07Z",
      "title": "States sue Meta claiming its social platforms are addictive and harm children's mental health",
      "url": "https://apnews.com/17858802d76143d358e38ee15150dc94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ade81844f7a4028b71e50236141187b/1920.jpeg"
    },
    {
      "author": "KEVIN McGILL and SARA CLINE",
      "description": "NEW ORLEANS (AP) — The toll from a series of crashes on a Louisiana interstate rose to eight dead and 63 injured Tuesday evening, a day after a “super fog” of marsh fire smoke and dense fog snared more than 160 vehicles in the fiery pileup, authorities said.",
      "publishedAt": "2023-10-24T12:50:22Z",
      "title": "Toll rises to 8 dead, 63 hurt from Louisiana interstate pileup blamed on dense fog, marsh fire smoke",
      "url": "https://apnews.com/304195491d1bfbc5ac929b1c6acd1d7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf04b78cf45949e29cbc32858add4094/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — First it was Ford, then Stellantis, and now a General Motors factory has been added to the growing list of highly profitable plants where the United Auto Workers union is on strike.On Tuesday, about 5,000 workers walked out at GM's factory in Arlington, Texas, that makes big, high margin SUVs such as the Chevrolet Tahoe and Cadillac Escalade.",
      "publishedAt": "2023-10-24T14:38:19Z",
      "title": "UAW strikes at General Motors plant in Texas as union goes after automakers' cash cows",
      "url": "https://apnews.com/f16005a7b20a6f1772947957854d1017",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8313bdc06fc4cba804b21dfe9489c1d/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}