{
  "articles": [
    {
      "author": "JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The man accused of killing UnitedHealthcare's CEO has been charged with murder as an act of terrorism, prosecutors said Tuesday as they worked to bring him to a New York court from a Pennsylvania jail.",
      "publishedAt": "2024-12-17T20:28:30Z",
      "title": "Suspect charged with killing UnitedHealthcare's CEO as an act of terrorism",
      "url": "https://apnews.com/fccc9e875e976b9901a122bc15669425",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e2ae7a1e94a4927a718cdbadc64ede0/2667.jpeg"
    },
    {
      "author": "DEVI SHASTRI and SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — The motive for a shooting that killed a teacher and a student and wounded others at a Wisconsin school appears to be a “combination of factors,” a police chief said Tuesday as he appealed to the public to share what they might know about the 15-year-old girl who attacked a study hall before shooting herself.",
      "publishedAt": "2024-12-17T05:17:11Z",
      "title": "Police chief says motive for Wisconsin school shooting was a 'combination of factors'",
      "url": "https://apnews.com/a8e1ee353d7fdab2b86dfb355938d871",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fae855d2105749f1815fd6552c23c7db/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — A couple hundred North Korean troops fighting alongside Russian forces against Ukraine have been killed or wounded during battle in the Kursk border region, a senior military official said Tuesday.",
      "publishedAt": "2024-12-17T22:24:11Z",
      "title": "A couple hundred North Korean troops killed, wounded in battles with Ukrainian forces",
      "url": "https://apnews.com/a1207ba61ded5061f721ffa0f0650851",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/461aa1978fe347928fca89bc1ab1641c/2323.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — A San Francisco jury on Tuesday found a tech consultant guilty of second-degree murder in the stabbing death of Cash App founder Bob Lee, which carries a sentence of 16 years to life, rejecting the defendant's claim that he had acted in self defense.",
      "publishedAt": "2024-12-17T18:01:44Z",
      "title": "Tech consultant found guilty of second-degree murder in stabbing death of Cash App founder Bob Lee",
      "url": "https://apnews.com/7ecfa7709902d67f2248489af3c45715",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26ec6cdef30b4d7e8d6d1868aea5437f/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — President-elect Donald Trump’s lawyers are raising a new claim in their fight to overturn his hush money conviction, alleging that the historic verdict was tainted by juror misconduct.",
      "publishedAt": "2024-12-17T18:20:25Z",
      "title": "Trump’s lawyers allege juror misconduct in latest bid to get his hush money conviction dismissed",
      "url": "https://apnews.com/f84c1302389f472cdd846ff261a0ea44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5742c326776249bb80144d750504a757/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "President-elect Donald Trump sued the Des Moines Register and its pollster for “brazen election interference” in publishing a survey the weekend before the election that showed Democrat Kamala Harris with a surprising lead of three percentage points in the state.",
      "publishedAt": "2024-12-17T20:27:46Z",
      "title": "Trump sues Des Moines Register, pollster for 'election interference' after pre-election poll",
      "url": "https://apnews.com/09698af51779943e13ffdc680e4fdbd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f85b067238ac4666887ea812ae146e38/3000.jpeg"
    },
    {
      "author": "JUSTIN KATUMWA, JEAN-YVES KAMALE and WILSON MCMAKIN",
      "description": "KINSHASA, Congo (AP) — An overcrowded boat capsized on a river in central Congo on Tuesday, killing at least 25 people, including children, and leaving dozens missing, officials and local residents said.",
      "publishedAt": "2024-12-17T20:58:51Z",
      "title": "At least 25 are killed and dozens are missing after an overcrowded boat capsizes in Congo",
      "url": "https://apnews.com/389c60b793f0ce05d79fcc7d67273ad2",
      "urlToImage": ""
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Prime Minister Benjamin Netanyahu said Tuesday that Israeli forces will stay in a buffer zone on the Syrian border, seized after the ouster of Syria's President Bashar Assad, until another arrangement is in place “that ensures Israel's security.”",
      "publishedAt": "2024-12-17T16:38:39Z",
      "title": "Netanyahu says Israeli troops will occupy a buffer zone inside Syria for the foreseeable future",
      "url": "https://apnews.com/4d7f0b35e08d5e853c776193272fb2d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c58274b6ad044fb8e333215b7d496cf/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The State Department has carved out exceptions for close ally Israel that block a U.S.",
      "publishedAt": "2024-12-17T17:19:16Z",
      "title": "Lawsuit accuses State Department of creating loopholes for Israel on military aid and human rights",
      "url": "https://apnews.com/3fe632e1ef524656b7a201bc4c1651a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75a9c1e83be34b99a89db33712e6f25e/1920.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — NASA’s two stuck astronauts just got their space mission extended again.",
      "publishedAt": "2024-12-17T21:57:02Z",
      "title": "NASA's 2 stuck astronauts face more time in space with return delayed until at least late March",
      "url": "https://apnews.com/77e8f0b988e483a793732297cd868490",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/104c293428f44879bcee47bee6c1bf13/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}