{
  "articles": [
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK and JILL COLVIN",
      "description": "WASHINGTON (AP) — Republican Donald Trump has launched his general election campaign not merely rewriting the history of the Jan.",
      "publishedAt": "2024-03-19T04:12:04Z",
      "title": "Trump is making the Jan. 6 attack a cornerstone of his bid for the White House",
      "url": "https://apnews.com/2401ead35cb1402a7b289c2c99761373",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6bc9b5226d948e8a204238864556efb/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Qatari officials were “cautiously optimistic” after talks with Israel’s intelligence chief in Doha aimed at trying to reach a cease-fire, Qatari Foreign Ministry spokesperson Majed al-Ansari said Tuesday at a news conference, stressing that an Israeli ground operation in Rafah would set back any talks.",
      "publishedAt": "2024-03-19T10:15:48Z",
      "title": "The Latest | Qatar is 'cautiously optimistic' after cease-fire talks with Israeli intelligence chief",
      "url": "https://apnews.com/3b336d6e6e3bb9a568c34eb49e08a4df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3894c13f103f40b18b7a79e067a016bc/1920.jpeg"
    },
    {
      "author": "TOM KRISHER and MATTHEW DALY",
      "description": "WASHINGTON (AP) — The Biden administration this week is expected to announce new automobile emissions standards that relax proposed limits for three years but eventually reach the same strict standards proposed by the Environmental Protection Agency.",
      "publishedAt": "2024-03-19T16:32:17Z",
      "title": "EPA expected to relax auto emissions standards in the next few years, but reach strict limit by 2032",
      "url": "https://apnews.com/d7ab151323383dfeea0dd5d07e100abc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcceedbe3bef418d8ffe36760b19d7fe/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden embarked Tuesday on a three-day campaign swing in the Sun Belt geared largely toward courting the Latino voters who helped power his coalition in 2020.",
      "publishedAt": "2024-03-19T09:03:35Z",
      "title": "Biden heads West to court Latino voters and secure his standing in Nevada and Arizona",
      "url": "https://apnews.com/0f3a951e1201b35bf4cc7952905725bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65b3131feaec49df9d3ff72c4a64e3cc/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "JACKSON, Miss. (AP) — A former Mississippi sheriff’s deputy was sentenced Tuesday to about 20 years in prison for his part in torturing two Black men last year after a neighbor complained that the men were staying in a home with a white woman.",
      "publishedAt": "2024-03-19T04:38:56Z",
      "title": "Mississippi ex-deputy gets 20-year sentence in racist torture of 2 Black men",
      "url": "https://apnews.com/d2eb6ba7e2f337ac1f17035cc97f2934",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4bff558cad54c71ace7a1aa8b04d0f7/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russia plans to evacuate about 9,000 children from a border region because it is being shelled continuously by Ukraine, an official said Tuesday, reflecting Kyiv's increasing focus on striking targets behind a front line that has barely shifted in recent months.",
      "publishedAt": "2024-03-19T11:04:34Z",
      "title": "Russia says it will evacuate 9,000 children from a border region targeted from the Ukrainian side",
      "url": "https://apnews.com/029e64bdb0d9ba2c8a13dc0854aa7ca4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/103eb221571e4364bec3929590ebc8f7/3000.jpeg"
    },
    {
      "author": "BERT WILKINSON",
      "description": "GEORGETOWN, Guyana (AP) — Caribbean leaders said Tuesday that all groups and political parties except one have submitted nominees for a transitional presidential council charged with selecting an interim prime minister for Haiti, which remains engulfed in gang violence.",
      "publishedAt": "2024-03-19T16:03:42Z",
      "title": "A team to choose Haiti's next leader takes shape as gang violence engulfs the Caribbean nation",
      "url": "https://apnews.com/92db29a0cb92f5b9c443ef23322380a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0733bf0cbfc464e81e0e1de7466679a/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — Former Brazilian President Jair Bolsonaro was formally accused Tuesday of falsifying his COVID-19 vaccination data, marking the first indictment for the embattled far-right leader, with more allegations potentially in store.",
      "publishedAt": "2024-03-19T13:28:42Z",
      "title": "Brazil's Bolsonaro is indicted for first time over alleged falsification of his own vaccination data",
      "url": "https://apnews.com/a0c1f1dba71553096d0de0f4f39d4caa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82110465e2a047c9886b2b12ecbe6a53/3000.jpeg"
    },
    {
      "author": "KANIS LEUNG",
      "description": "HONG KONG (AP) — As Hong Kong passed a new national security law, the city that evolved from a swampy fishing village to a financial center embarked on another transformation, one that may redefine its role on the world stage and the liberties of its citizens.",
      "publishedAt": "2024-03-19T11:21:07Z",
      "title": "How will a new national security law affect different walks of life in Hong Kong?",
      "url": "https://apnews.com/633e91d7d3aef09381b349282a7dec1f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8537584a3da446ca38469f386af8148/1920.jpeg"
    },
    {
      "author": "AARON BEARD",
      "description": "For the second straight year, Purdue's Zach Edey is the unanimous headliner for The Associated Press men's college basketball All-America team.The 7-foot-4, 300-pound senior topped all 62 ballots from AP Top 25 poll voters in results released Tuesday.",
      "publishedAt": "2024-03-19T16:07:13Z",
      "title": "Purdue's Edey, Tennessee's Knecht, UNC's Davis headline the AP men's college All-America teams",
      "url": "https://apnews.com/9af2d4f3d9bbe34ea16a1af882e901c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/876030638b524e3aa99a260188c099a9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}