{
  "articles": [
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Paul Auster, a prolific, prize-winning man of letters and filmmaker known for such inventive narratives and meta-narratives as “The New York Trilogy” and “4 3 2 1,” has died at age 77.",
      "publishedAt": "2024-05-01T11:12:05Z",
      "title": "Paul Auster, prolific and experimental man of letters and filmmaker, dies at 77",
      "url": "https://apnews.com/08814333f6c40a53ea5acd9c0e019c3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e479d8def4b84d47b274b2224143bb04/3000.jpeg"
    },
    {
      "author": "STEFANIE DAZIO, ETHAN SWOPE, JAKE OFFENHARTZ and JOSEPH B. FREDERICK",
      "description": "LOS ANGELES (AP) — Dueling groups of protesters clashed Wednesday at the University of California, Los Angeles, grappling in fistfights and shoving, kicking and using sticks to beat one another. Hours earlier, police burst into a building at Columbia University that pro-Palestinian protesters took over and broke up a demonstration that had paralyzed the school while inspiring others.",
      "publishedAt": "2024-05-01T05:49:21Z",
      "title": "Dueling protesters clash at UCLA hours after police clear pro-Palestinian demonstration at Columbia",
      "url": "https://apnews.com/c6e5549532c85f13493daa22d0d143ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e874327fae541d58bc68073e53934a6/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "New York City Mayor Eric Adams said on MSNBC’s “Morning Joe” on Wednesday that police had to move in to Columbia University’s Hamilton Hall “for the safety of those children.”He blamed outside agitators for the building takeover.",
      "publishedAt": "2024-05-01T11:26:07Z",
      "title": "The Latest | NYC mayor: Police had to move in 'for the safety of those children'",
      "url": "https://apnews.com/359436ff56f9005de94bdae7acb6df2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15e532508805461ab9127ab4c86cc9b8/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and SAM MEDNICK",
      "description": "JERUSALEM (AP) — U.S. Secretary of State Antony Blinken met with Israeli leaders on Wednesday in his push for a cease-fire deal between Israel and Hamas, saying “the time is now” for an agreement that would free hostages and bring a pause in the nearly seven months of war in Gaza.",
      "publishedAt": "2024-05-01T07:17:43Z",
      "title": "Blinken urges Israel and Hamas to move ahead with a cease-fire deal and says 'the time is now'",
      "url": "https://apnews.com/7cbf7c696989cdc3a22383c823fb2e0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06d72f73f2e74acc932224a6ea256156/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, SCOTT BAUER and MICHELLE L. PRICE",
      "description": "WAUKESHA, Wis. (AP) — Donald Trump on Wednesday will use a one-day break from his hush money trial to rally voters in the battleground states of Wisconsin and Michigan, a day after he was held in contempt of court and threatened with jail time for violating a gag order.",
      "publishedAt": "2024-05-01T04:06:27Z",
      "title": "Trump returns to campaign facing a warning of jail time if he violates a trial gag order",
      "url": "https://apnews.com/f3d448782edc81e10274cf99175f3844",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c3338903f2a4d9a81a23e877f5b4c2f/3000.jpeg"
    },
    {
      "author": "DAVID FISCHER and STEPHANY MATAT",
      "description": "BOCA RATON, Fla. (AP) — Florida's ban on most abortions after six weeks of pregnancy, before many women even know they are pregnant, went into effect Wednesday, and some doctors are concerned that women in the state will no longer have access to needed health care.",
      "publishedAt": "2024-05-01T04:21:29Z",
      "title": "Florida's 6-week abortion ban takes effect as doctors worry women will lose access to health care",
      "url": "https://apnews.com/9509a806453e1eab50d118aaecffa2f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/026d643f154f4f8390c1a117d6e6d9aa/3000.jpeg"
    },
    {
      "author": "TIM SULLIVAN",
      "description": "MADISON, Wis. (AP) — It was the music that changed first. Or maybe that’s just when many people at the pale brick Catholic church in the quiet Wisconsin neighborhood finally began to realize what was happening.",
      "publishedAt": "2024-05-01T04:07:32Z",
      "title": "'A step back in time': America's Catholic Church sees an immense shift toward the old ways",
      "url": "https://apnews.com/7638fa2013a593f8cb07483ffc8ed487",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0f38f132b6746df855c4d17c6943793/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Months of relentless Russian artillery pounding have devastated a strategic city in eastern Ukraine, new drone footage obtained by The Associated Press has shown, with barely a building left intact, homes and municipal offices charred, and a town that once had a population of 12,000 now left all but deserted.",
      "publishedAt": "2024-05-01T10:27:24Z",
      "title": "Drone footage shows devastation in Chasiv Yar, an eastern Ukrainian city Russia is assaulting",
      "url": "https://apnews.com/5e4787a1e914d49028a464aa8afb0238",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bfb0c04becf4fa1b41d8c18702d6bab/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — Workers, activists and others across Europe and Asia took to the streets on Wednesday to mark May Day with protests over rising prices and government labor policies and calls for greater labor rights.",
      "publishedAt": "2024-05-01T06:34:36Z",
      "title": "Workers and activists across Europe and Asia hold May Day rallies to call for greater labor rights",
      "url": "https://apnews.com/0c8605802cb451061eeb71f83bdef5fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f502d69487e64e08b8fa5406b9aad2af/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Even as many Americans say they learn about the 2024 election campaign from national news outlets, a disquieting poll reveals some serious trust issues.",
      "publishedAt": "2024-05-01T10:36:32Z",
      "title": "News organizations have trust issues as they gear up to cover another election, a poll finds",
      "url": "https://apnews.com/18235eaef4fdfbdc9c1f7e8693744b21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e67c22f2f2e4fb49e3726dbafdaf8e3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}