{
  "articles": [
    {
      "author": null,
      "description": "Texas Democrats prevented their state’s House of Representatives from moving forward, at least for now, with a redrawn congressional map sought by President Donald Trump. In California, the state's dominant Democrats are maneuvering to counter Trump's Texas play by boosting Democratic House seats in the liberal-leaning state. The rivalry tugging at the nation's political balance is playing out in advance of the 2026 midterm elections, with both parties angling to gain ground in Washington. The Texas map would shore up Republicans’ midterm prospects as the president's political standing slumps. California Democrats are weighing political maps that could slash five Republican-held House seats in the liberal-leaning state.",
      "publishedAt": "2025-08-05T04:04:21Z",
      "title": "California and Texas grapple for political advantage in advance of 2026 midterms",
      "url": "https://apnews.com/article/redistricting-texas-california-house-map-trump-0f5f79185bbeeba8c2ff9999f48e5867",
      "urlToImage": "https://dims.apnews.com/dims4/default/14aba83/2147483647/strip/true/crop/3000x1688+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F62%2F5b13fe5ea92c7a5affec6b1a4c6e%2F3728418f0ff84fa883e4a5d51e3093bd"
    },
    {
      "author": null,
      "description": "Hundreds of remote homes are being threatened by a massive wildfire burning through Los Padres National Forest in central California. Three people have been injured, including a motorist with burn injuries who was overrun by flames. Officials say the Gifford Fire spans more than 100 square miles of Santa Barbara and San Luis Obispo counties. The blaze grew out of several smaller fires that erupted Friday along State Route 166 between Santa Maria and Bakersfield. More than 1,000 firefighters working in hot and dry conditions are scrambling to make progress against the flames.",
      "publishedAt": "2025-08-04T17:13:42Z",
      "title": "Massive wildfire in central California threatens homes and injures 3",
      "url": "https://apnews.com/article/gifford-wildfires-california-santa-barbara-los-padres-f1ecdece016cdc8ece5c5162926964f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/be0a456/2147483647/strip/true/crop/6048x3402+0+315/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Fea%2F8eef8b96d65997f0e2498e15cb08%2Ffbed77ebca7d47e3b35814cbf7977e5a"
    },
    {
      "author": null,
      "description": "Former Israeli army and intelligence chiefs are calling for an end to the war in Gaza as Prime Minister Benjamin Netanyahu hints at further military action and the government plots its next move. The former security officials speaking out include those who led Shin Bet, Mossad and the Israeli military. Netanyahu announced Monday that he would convene his Security Cabinet in the coming days to decide on the next stage of the war. Israeli forces opened fire Tuesday morning toward Palestinians seeking desperately needed aid and in targeted attacks in the central and southern Gaza Strip, killing at least 25 people.",
      "publishedAt": "2025-08-05T11:04:58Z",
      "title": "Former Israeli security officials call to end the war in Gaza as Netanyahu hints at a new stage",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-08-05-2025-a43fc7d54feea4093ad94f7eff610721",
      "urlToImage": "https://dims.apnews.com/dims4/default/dac7ff6/2147483647/strip/true/crop/6003x3377+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F16%2F2692eb7ae871623b560dc01943bc%2F49d94df5845a431ea84fc94c478492ea"
    },
    {
      "author": null,
      "description": "NATO has started coordinating regular deliveries of large weapons packages to Ukraine, most bought from the U.S. This follows the Netherlands' announcement to provide air defense equipment and ammunition worth 500 million euros. Two deliveries are expected this month. “Packages will be prepared rapidly and issued on a regular basis,” NATO said late Monday. The equipment is based on Ukraine’s priority needs on the battlefield. Air defense systems are in greatest need. The United Nations has said Russia’s relentless pounding of urban areas has killed more than 12,000 Ukrainian civilians. European allies and Canada are buying most of the equipment from the United States.",
      "publishedAt": "2025-08-05T09:32:08Z",
      "title": "NATO to coordinate regular and large-scale arm deliveries to Ukraine. Most will be bought from US",
      "url": "https://apnews.com/article/nato-ukraine-weapons-trump-arm-deliveries-f256489ea9e10a81dba83a5c58420668",
      "urlToImage": "https://dims.apnews.com/dims4/default/a113c3b/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Fd6%2Fdb7c05c4206230723b1c2f5271a7%2F2d45f9599c3349f38c49a739b46953dc"
    },
    {
      "author": null,
      "description": "Russia has declared it's no longer considers itself bound by a self-imposed moratorium on deploying nuclear-capable intermediate range missiles, a warning that potentially sets the stage for a new arms race as tensions between Moscow and Washington rise again over Ukraine. The Russian Foreign Ministry on Monday linked the decision to efforts by the U.S. and its allies to develop intermediate range weapons and preparations for their deployment in Europe and elsewhere. The ministry didn’t say what specific moves the Kremlin might take, but President Vladimir Putin has previously announced that Moscow was planning to deploy its new Oreshnik missiles on the territory of its neighbor and ally Belarus this year.",
      "publishedAt": "2025-08-05T09:54:58Z",
      "title": "Russia ends its self-imposed moratorium on intermediate-range missiles",
      "url": "https://apnews.com/article/russia-missile-intermediate-nuclear-putin-moratorium-5697b228999cf78b21784dba989c28c4",
      "urlToImage": "https://dims.apnews.com/dims4/default/740870c/2147483647/strip/true/crop/4203x2364+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F5b%2F4703c2f89503b0829e017e2e6bc9%2F1ca92bc90dd949e385e8273db644f1ee"
    },
    {
      "author": null,
      "description": "Brazil’s Supreme Court has ordered the house arrest for former President Jair Bolsonaro, who is on trial for an alleged coup plot after losing the 2022 election. Prosecutors accuse Bolsonaro of heading a criminal organization that plotted to overturn the election, including plans to kill President Lula and a Supreme Court justice. Monday’s order follows one from the top court, which last month ordered Bolsonaro to wear an electronic ankle monitor and imposed a curfew on his activities while the proceedings are underway.",
      "publishedAt": "2025-08-04T21:30:58Z",
      "title": "Brazil’s Supreme Court orders house arrest for former President Jair Bolsonaro",
      "url": "https://apnews.com/article/brazil-bolsonaro-house-arrest-coup-plot-trial-26e2be9eee08b7e6b9f006f0c5b706e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5445a72/2147483647/strip/true/crop/3744x2106+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F68%2Fdf12178979347f74c7f5623d142a%2F45e93e35abef4edfa7b000086cf12442"
    },
    {
      "author": null,
      "description": "A new poll finds young people in the United States are less engaged in politics than older generations are. Many young adults feel disillusioned with the political system and question the importance of voting. The Associated Press-NORC Center for Public Affairs Research poll shows only about 2 in 10 young adults follow politics closely, compared with higher numbers among older Americans. The poll also shows about one-third of adults under age 30 identify as political independents, rejecting party labels. Despite this, youth voter turnout has been high in recent elections, suggesting potential for greater political engagement in the future.",
      "publishedAt": "2025-08-05T11:06:50Z",
      "title": "Young adults less likely to say voting is important: AP-NORC poll",
      "url": "https://apnews.com/article/voting-elections-economy-young-people-trump-politics-0cfb6066fad5798219f8a6fe6c25b694",
      "urlToImage": "https://dims.apnews.com/dims4/default/b19e29f/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Ff7%2F8c9e9c503030cbc43dcf009e02de%2Fca869ccf2d5545aca16cb60adbdbf99f"
    },
    {
      "author": null,
      "description": "Shares have advanced in Europe and Asia after U.S. stocks bounced back from a sell-off driven by weak U.S. jobs data. U.S. futures climbed early Tuesday while oil prices slipped. This week's highlights include earnings reports from The Walt Disney Co., McDonald’s and Caterpillar and updates on U.S. business activity. On Monday, the S&P 500 jumped 1.5%, following its worst day since May with its best since May. The Dow Jones Industrial Average climbed 1.3% and the Nasdaq composite leaped 2%. Gains for Tyson Foods and other companies following their better-than-expected profit reports helped offset a drop for Berkshire Hathaway.",
      "publishedAt": "2025-08-05T05:42:17Z",
      "title": "World shares advance, tracking rally on Wall Street",
      "url": "https://apnews.com/article/stocks-markets-earnings-trump-rates-aaefba66fe902c6d93f2a75ef25cf45a",
      "urlToImage": "https://dims.apnews.com/dims4/default/87b7810/2147483647/strip/true/crop/1620x911+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2Fd9%2F63fc6484f3be9e00ca84d733e253%2F99e760af70924c61b7a06623d7adb514"
    },
    {
      "author": null,
      "description": "Going online in Russia can be frustrating, complicated and even dangerous. Accessing independent news sites, Facebook, and YouTube is increasingly difficult due to extensive online censorship. The Kremlin has blocked or throttled thousands of websites and apps over the past decade. VPNs, once a workaround, are frequently blocked. This summer, authorities further restricted internet access by shutting down cellphone internet connections and penalizing users for searching illicit content. It's a deliberate, multipronged and long-term effort by authorities to bring the internet under the Kremlin’s full control. Experts warn that Russia is edging closer to making its internet a tightly controlled, isolated space.",
      "publishedAt": "2025-08-05T04:27:20Z",
      "title": "Kremlin censorship means going online in Russia is frustrating, complicated and even dangerous",
      "url": "https://apnews.com/article/russia-internet-censorship-social-media-youtube-web-2b3c7ca90f83573be7af7f3fc20f9ecd",
      "urlToImage": "https://dims.apnews.com/dims4/default/7923cc6/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F5b%2Fa281b958d6d698f783345232c5ee%2F9d1bd824acfe482d8c763b790c533f9c"
    },
    {
      "author": null,
      "description": "The friendliness between Indian Prime Minister Narendra Modi and U.S. President Donald Trump was seen as a relationship like no other. The two men often shared bear hugs, showered flattering praise on each other and made appearances at stadium rallies — a boost in the arm for two populist leaders with ideological similarities. All appeared well until a series of events left the ties between them — and their countries — sour. From Trump’s tariffs and India’s purchase of oil from Russia to a U.S. tilt towards Pakistan, friction between New Delhi and Washington has been noticeable.",
      "publishedAt": "2025-08-04T20:29:18Z",
      "title": "Modi and Trump's relationship is strained after India buys Russian oil",
      "url": "https://apnews.com/article/india-us-modi-trump-tariffs-relationship-575af0f270713fa6b09f4ed4e2848f21",
      "urlToImage": "https://dims.apnews.com/dims4/default/462d2ed/2147483647/strip/true/crop/6564x3692+0+342/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Ff7%2Fd621db0bf8ba49e02a79a31631af%2Ff28cc56e213d44528cee459edd1b81aa"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}