{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump's defense team in his hush money case sought Friday to undermine the testimony of the prosecution's lead witness and his account that a tabloid's practice of helping to bury embarrassing stories about Trump was part of a scheme to aid the Republican's 2016 campaign.",
      "publishedAt": "2024-04-26T04:01:57Z",
      "title": "Trump's lawyers try to discredit testimony of prosecution's lead witness in hush money trial",
      "url": "https://apnews.com/868e6b9d30a039d5009ec6a9d7e96ff7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8b7f2ec32824d7da2527f3b8645a127/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Defense lawyers in Donald Trump’s hush money trial dug Friday into assertions of the former publisher of the National Enquirer and his efforts to protect Trump from negative stories during the 2016 election.",
      "publishedAt": "2024-04-26T10:41:24Z",
      "title": "The Latest | Trump prosecutors claw back at defense's portrait of tabloid deal",
      "url": "https://apnews.com/afc9fb76e5b52db950339ce6c99d5fbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8b7f2ec32824d7da2527f3b8645a127/1920.jpeg"
    },
    {
      "author": "NOREEN NASIR, AARON MORRISON and NICK PERRY",
      "description": "NEW YORK (AP) — Columbia University students who inspired pro-Palestinian demonstrations across the country dug in for their 10th day Friday as the university’s president faced harsh criticism from faculty and campuses from California to Massachusetts wrestled with how to address protests with graduation looming.",
      "publishedAt": "2024-04-26T04:23:05Z",
      "title": "As some universities negotiate with pro-Palestinian protesters, others quickly call the police",
      "url": "https://apnews.com/e8a2e657e2614f94373beae602e9ba9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68cbf35472b2423f8c9e93862f3b001d/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli drone strike on a car in eastern Lebanon killed two people Friday, Lebanon’s state-run National News Agency says. The strike came after Lebanon’s militant Hezbollah group carried out an attack along the border that killed an Israeli civilian.",
      "publishedAt": "2024-04-26T07:59:03Z",
      "title": "The Latest | Israeli drone strike kills 2 in Lebanon after Hezbollah fires at an Israeli convoy",
      "url": "https://apnews.com/b0f509827675bd4e173156ba6eaff9bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75e7803d7b8a478ab37b565dee085c7d/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. will provide Ukraine additional Patriot missiles for its air defense systems as part of a massive $6 billion additional aid package, Defense Secretary Lloyd Austin announced Friday.",
      "publishedAt": "2024-04-25T23:50:44Z",
      "title": "US announces new Patriot missiles for Ukraine as part of new $6 billion aid package",
      "url": "https://apnews.com/026fc8f9ee064ffb49bbee2422e2908b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f99f0daeaf44d7e9cbfffe8667d6086/744.jpeg"
    },
    {
      "author": "RYAN J. FOLEY, CARLA K. JOHNSON and SHELBY LUM",
      "description": "Demetrio Jackson was desperate for medical help when the paramedics arrived.The 43-year-old was surrounded by police who arrested him after responding to a trespassing call in a Wisconsin parking lot.",
      "publishedAt": "2024-04-26T10:16:50Z",
      "title": "Dozens of deaths reveal risks of injecting sedatives into people restrained by police",
      "url": "https://apnews.com/621909ba7491abc2af8ad2e33ba3415b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a749ed6f161747ff994b2295a3c83a5e/3000.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "NEW YORK (AP) — #MeToo founder Tarana Burke has heard it before. Every time there’s a legal setback, the movement is declared dead in the water. A legal success, and presto, it’s alive again.So Burke, who nearly two decades ago coined the phrase “Me too” from her work with sexual assault survivors, found herself again declaring after New York's highest court on Thursday overturned Harvey Weinstein’s 2020 rape conviction: The #MeToo reckoning is greater than any court case.",
      "publishedAt": "2024-04-26T04:43:08Z",
      "title": "‘The movement will persist’: Advocates stress Weinstein reversal doesn’t derail #MeToo reckoning",
      "url": "https://apnews.com/8272c7113b53714c51cb54111cd01bee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7fd6b01f6954942992cf4bb71524fc9/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — It has been only a day since the transitional presidential council was installed in Haiti, and the list of demands on the Caribbean nation's new leaders is rapidly growing.",
      "publishedAt": "2024-04-26T16:43:55Z",
      "title": "New leaders take on Haiti's chaos as those living in fear demand swift solutions to gang violence",
      "url": "https://apnews.com/9291c0702f55b4dac67b6c4448a992f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b39146c79254dba92d53c5bb0f5da74/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Poultry producers will be required to bring salmonella bacteria in certain chicken products to very low levels to help prevent food poisoning under a final rule issued Friday by U.S.",
      "publishedAt": "2024-04-26T09:00:46Z",
      "title": "USDA tells producers to reduce salmonella in certain frozen chicken products",
      "url": "https://apnews.com/38c318363a674a372427a852857ce41b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74660c7855654b51b2d5d17eb00d9648/2523.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — Jerry Seinfeld has been responsible for more movies than you think. Yes, he co-wrote and lent his voice to 2007's “Bee Movie.\" But before that, “Seinfeld” — where going to the movies, with or without the aid of Moviefone, was nearly as regular a destination as the coffee shop — gave birth to dozens of (fake) films.",
      "publishedAt": "2024-04-26T13:44:55Z",
      "title": "Jerry Seinfeld's commitment to the bit",
      "url": "https://apnews.com/1317fc2ade5450a286ec8771e6188aaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d424611ae7d746fcab8b635ecb04df47/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}