{
  "articles": [
    {
      "author": null,
      "description": "U.S. President Donald Trump is meeting with Russian President Vladimir Putin in Alaska at a U.S. military base for a crucial summit. This Friday’s meeting could influence the war in Ukraine and European security. Trump aims to showcase his skills as a dealmaker. For Putin, it's a chance to negotiate terms that favor Russia. The summit excludes Ukrainian President Volodymyr Zelenskyy, which could undermine Ukraine's interests. Trump has expressed hopes for a broader peace deal, but success is uncertain. The meeting's outcome could have significant implications for international relations and U.S. diplomacy.",
      "publishedAt": "2025-08-15T04:10:34Z",
      "title": "Trump and Putin to meet in Alaska for high-stakes summit",
      "url": "https://apnews.com/article/trump-putin-summit-alaska-russia-ukraine-a7b167f17a3e06fbce2f583c93f8bae1",
      "urlToImage": "https://dims.apnews.com/dims4/default/9487f1b/2147483647/strip/true/crop/1945x1094+0+101/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F2a%2F345bf8327df19d8b6ac7aeac691a%2F20b7e141691f4a82ad291ffad074080d"
    },
    {
      "author": null,
      "description": "President Donald Trump’s meeting in Alaska with Vladimir Putin could be a decisive moment in the war in Ukraine and in the U.S. leader’s anomalous relationship with his Russian counterpart. Trump has long boasted that he’s always gotten along well with Putin and spoken admiringly of him, even praising him as “pretty smart” for invading Ukraine. But in recent months, he’s expressed open frustrations with Putin and called him “CRAZY” while threatening to impose sanctions on Russia. Still, Trump’s self-imposed deadline for sanctions came and went without any announced penalties or explanation from the White House and the Republican president, tempering expectations for their Friday summit.",
      "publishedAt": "2025-08-14T04:06:00Z",
      "title": "Trump's relationship with Putin is spotlighted in Alaska amid Ukraine war",
      "url": "https://apnews.com/article/trump-putin-relationship-over-years-d7a6c5400d9ec88127d16278be07a145",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcce3f3/2147483647/strip/true/crop/5121x2881+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F4f%2Fdf82e1cb246260425f733ae75fb3%2Fe3e41cac1bc44ccb9b330b84a665cc11"
    },
    {
      "author": null,
      "description": "Days before the leaders of Russia and the U.S. hold a summit meeting in Alaska, Moscow’s forces breached Ukrainian lines in a series of infiltrations this week in the country’s industrial heartland of Donetsk. The advances amount to only a limited success for Russia, since Moscow still needs to consolidate its gains before achieving a true breakthrough. Still, some observers say it’s a potentially dangerous moment. Analyst Mykola Bieleskov says Russian President Vladimir Putin will likely try to persuade U.S. President Donald Trump to pressure Kyiv by arguing the 3 1/2-year-old war is going badly for Kyiv.",
      "publishedAt": "2025-08-15T05:02:31Z",
      "title": "Ukrainian defenses face a challenge as Russian troops make gains ahead of the Putin-Trump summit",
      "url": "https://apnews.com/article/russia-ukraine-war-front-summit-putin-trump-5a6060386d8c195d5b14a6b820bcc4ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca6c91c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fdb%2Fb00b3291f089e967cdd297b76e22%2F21fa3b40e5954a729b03efac87ec2fbb"
    },
    {
      "author": null,
      "description": "Attorney General Pam Bondi has named the head of the Drug Enforcement Administration as Washington’s “emergency police commissioner,” saying she is granting him the powers of the police chief amid the federal takeover. Bondi said in an directive issued Thursday evening that DEA boss Terry Cole will assume “powers and duties vested in the District of Columbia Chief of Police.” The latest move is part of President Donald Trump's law enforcement takeover of the capital. The increased federal presence in the city has been striking, with troops stationed at Union Station and other high-traffic areas. Meanwhile, volunteers helped homeless residents leave encampments, adding to the city's tense atmosphere.",
      "publishedAt": "2025-08-14T17:31:30Z",
      "title": "Bondi names DEA head as DC's 'emergency police commissioner'",
      "url": "https://apnews.com/article/washington-trump-homeless-national-guard-police-a0d326fcd3731c564c2c566893385674",
      "urlToImage": "https://dims.apnews.com/dims4/default/84dfef3/2147483647/strip/true/crop/5657x3182+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2F6e%2F32d1b0aced7c1c3a4e34452a9c96%2F09a6e6c5b9624ddd9754d57a7e5bff9a"
    },
    {
      "author": null,
      "description": "Israel withdrew from the Gaza Strip 20 years ago, dismantling 21 Jewish settlements and pulling out its forces. The Friday anniversary of the start of the landmark disengagement comes as Israel is mired in a nearly two-year war with Hamas. The conflict has devastated the Palestinian territory and is likely to keep troops there long into the future. Israel’s disengagement included removing four settlements in the Israeli-occupied West Bank and was then-Prime Minister Ariel Sharon’s controversial attempt to jump-start negotiations with the Palestinians. But it bitterly divided Israeli society and led to the empowerment of Hamas, with implications that continue to reverberate today.",
      "publishedAt": "2025-08-15T04:05:16Z",
      "title": "Israel is mired in Gaza 20 years after its landmark withdrawal",
      "url": "https://apnews.com/article/israel-gaza-settlements-disengagement-20th-anniversary-5db86a29bbbe2f41e5bb7059098fd450",
      "urlToImage": "https://dims.apnews.com/dims4/default/72fe9bb/2147483647/strip/true/crop/2000x1125+0+111/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Fd8%2F0d3383b79249f4086a6d891eeadc%2F842e835eef2d49e59ac5ad573f06d642"
    },
    {
      "author": null,
      "description": "A political standoff in Texas over new U.S. House maps aimed at adding five Republican seats is poised to enter a new phase. Meanwhile, heavily Democratic California plans for a November election intended to erase all but a sprinkle of the state’s GOP House districts in the fight over control of Congress. The jockeying in the nation’s two most populous states underscores the stakes for both parties in the narrowly divided House that could determine the fate of President Donald Trump’s agenda in the second half of his term. California Democratic Gov. Gavin Newsom wants other Democratic-led states to get involved.",
      "publishedAt": "2025-08-15T04:09:44Z",
      "title": "Texas and California showdown over US House maps may shift political landscape",
      "url": "https://apnews.com/article/texas-california-redistricting-battle-f0ac783b6a5fd6ecaab0ca419125b72a",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1f2c8d/2147483647/strip/true/crop/2961x1666+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F10%2F4888f26535c1277b35705ca86e75%2F77a35e1fd28b414586d5819020e3b19d"
    },
    {
      "author": null,
      "description": "Authorities are searching for missing people in a remote village in India-controlled Kashmir after flash floods caused by torrential rains. Teams of disaster management officials, police and soldiers helped by local villagers scoured the devastated Himalayan village of Chositi on Friday. Rescuers were searching for at least 80 missing people. Flooding that began a day earlier has killed at least 60 people. The floods on Thursday were triggered by a cloudburst in the Himalayan village. Sudden and intense downpours over small areas known as cloudbursts are increasingly common in India’s Himalayan regions. They are prone to flash floods and landslides.",
      "publishedAt": "2025-08-15T07:48:37Z",
      "title": "Rescuers search for missing flash flood victims in remote Kashmir village",
      "url": "https://apnews.com/article/kashmir-india-cloudburst-flash-floods-rain-rescue-92bd23be264cc145d6cf6c23250bf501",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe6b8d3/2147483647/strip/true/crop/5236x2945+0+273/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Faa%2Fa391f42469d5db0a2055bc8f80c1%2Fa9b65177f8be40498b0f70d8a004748a"
    },
    {
      "author": null,
      "description": "Japan is paying tribute tribute to more than 3 million war dead as the country marks its surrender 80 years ago, ending World War II. But there is growing concern about the fading memories of the tragedy of war and the bitter lessons from the era of Japanese militarism. In a national ceremony Friday at Tokyo’s Budokan hall, about 4,500 officials and bereaved families and their descendants observed a moment of silence at noon. Just a block away at Yasukuni Shrine, seen by Asian neighbors as a symbol of militarism, dozens of rightwing politicians came to pray.",
      "publishedAt": "2025-08-15T03:31:51Z",
      "title": "Japan marks 80th anniversary of WWII surrender",
      "url": "https://apnews.com/article/japan-wwii-anniversary-surrender-yasukuni-emperor-89c7c3685e9a29e719356e31c5cc66e5",
      "urlToImage": "https://dims.apnews.com/dims4/default/ce59f9b/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F08%2Fb6c05012affeed08dce0ff39a526%2F6546e2e3b50640fe9ac856421e0708cb"
    },
    {
      "author": null,
      "description": "Talks on a treaty to address the global crisis of plastic pollution in Geneva ended without an agreement Friday. The session was adjourned and will be resumed at a later date. Nations were meeting for an 11th day at the United Nations office to try to complete a landmark treaty to end the plastic pollution crisis. They remain deadlocked over whether the treaty should reduce exponential growth of plastic production and put global, legally binding controls on toxic chemicals used to make plastics. The negotiations at the U.N. hub were supposed to be the last round and produce the first legally binding treaty on plastic pollution, including in the oceans.",
      "publishedAt": "2025-08-15T01:06:27Z",
      "title": "No agreement in plastic pollution treaty talks in Geneva",
      "url": "https://apnews.com/article/plastic-pollution-treaty-negotiations-united-nations-geneva-e73090282a22be7ff5979ea2d648dc10",
      "urlToImage": "https://dims.apnews.com/dims4/default/b714910/2147483647/strip/true/crop/7282x4096+0+379/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F29%2Fe658819295017051ffb975736baf%2F4a51fc252eca40ba87fade5743ad5459"
    },
    {
      "author": null,
      "description": "Paleontologists have identified a new whale species from a 25-million-year-old fossil found on an Australian beach. Named Janjucetus dullardi, this creature had bulging eyes and fiendish teeth. It was an early ancestor of the baleen whale but only measured 3 meters (10 feet) in length. The fossil was discovered in 2019 on Jan Juc Beach in Victoria state. This species is only the fourth identified from the mammalodontids group, early whales from the Oligocene Epoch. Amateur fossil hunter Ross Dullard, who found the partial skull, says he will celebrate with a whale-themed party, marking the end of a six-year obsession.",
      "publishedAt": "2025-08-15T03:48:44Z",
      "title": "New fossil discovery reveals tiny ancestor of modern whales",
      "url": "https://apnews.com/article/whale-fossil-australia-prehistoric-janjucetus-dullardi-victoria-fa2559969c8609f5e3783054b4558375",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff3df00/2147483647/strip/true/crop/2332x1312+0+122/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2Fcc%2Fa19c95df8f53bdb9a487b99de26d%2F7159e95d781347fa98d936694149669a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}