{
  "articles": [
    {
      "author": "DAVID KOENIG",
      "description": "Boeing plans to lay off about 10% of its workers in the coming months, about 17,000 people, as it continues to lose money and tries to deal with a strike that is crippling production of the company’s best-selling airline planes.",
      "publishedAt": "2024-10-11T21:14:50Z",
      "title": "Boeing will lay off 10% of its employees as a strike by factory workers cripples airplane production",
      "url": "https://apnews.com/de637999cf525699577b42b72bff2a70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb208cef4df342c9bb84e8e4b3108e6b/3000.jpeg"
    },
    {
      "author": "CHRIS O'MEARA, BRENDAN FARRINGTON and TY O'NEIL",
      "description": "LITHIA, Fla. (AP) — Florida residents slogged through flooded streets, gathered up scattered debris and assessed damage to their homes on Friday after Hurricane Milton smashed through coastal communities and spawned a barrage of deadly tornadoes.",
      "publishedAt": "2024-10-11T04:03:43Z",
      "title": "Residents slog through flooded streets, clear debris after Hurricane Milton tore through Florida",
      "url": "https://apnews.com/7f60bbe9c6295f2ebef077eca2c1b4e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cfa6718bee14b51a3f91e2b894f51b6/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and ZEKE MILLER",
      "description": "WASHINGTON (AP) — The concern has been there all along, but now it's being talked about openly: Are some men reluctant to vote for Democrat Kamala Harris because she’s a woman?",
      "publishedAt": "2024-10-11T21:01:14Z",
      "title": "Are male voters reluctant to vote for a woman? Harris' backers are confronting the question head on",
      "url": "https://apnews.com/bcf8dbcce4700ba24725ca178f7753b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28980b8141c2457993a0d9e07c42f614/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN and ADRIANA GOMEZ LICON",
      "description": "AURORA, Colo. (AP) — Donald Trump detoured from the battleground states Friday to visit a Colorado suburb that's been in the news over illegal immigration as he drives a message, often using false or misleading claims and dehumanizing language, that migrants are causing chaos in smaller American cities and towns.",
      "publishedAt": "2024-10-11T14:48:51Z",
      "title": "Trump drives his anti-immigration message in Aurora, Colorado",
      "url": "https://apnews.com/fe8805ec9024cb683a6386bce9f64c70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a179e3b454bd4abb9a9397186a6c47e7/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — An Israeli airstrike killed two Lebanese soldiers and wounded three on Friday, Lebanon's military said, just hours after the Israeli military fired on the headquarters of U.N. peacekeepers in southern Lebanon, injuring two of them for the second day in a row.",
      "publishedAt": "2024-10-11T10:39:43Z",
      "title": "Israeli forces kill 2 Lebanese soldiers and injure 2 UN peacekeepers in separate strikes",
      "url": "https://apnews.com/9dd58a9fea9c2de963edbc31ba90bb1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/654be871e9aa4cdebaafa6188625fe5f/1920.jpeg"
    },
    {
      "author": "MIKE CORDER and ELENA BECATOROS",
      "description": "The Nobel Peace Prize was awarded Friday to Nihon Hidankyo, a Japanese organization of survivors of the U.S. atomic bombings of Hiroshima and Nagasaki, for its activism against nuclear weapons.",
      "publishedAt": "2024-10-11T08:31:45Z",
      "title": "Nobel Peace Prize given to Japanese organization Nihon Hidankyo for its work against nuclear weapons",
      "url": "https://apnews.com/40c351ed629bd515675a8283c811bc38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/019c96d5b672483e9dc50373dc0b85b9/1920.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — A solid majority of Hispanic women have a positive opinion of Vice President Kamala Harris and a negative view of former President Donald Trump, but Hispanic men are more divided on both candidates, according to a recent poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-10-11T04:04:04Z",
      "title": "Harris viewed more positively by Hispanic women than by Hispanic men: AP-NORC poll",
      "url": "https://apnews.com/d42696a973e0988aed41bab2a46bb4cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c448bf6c47d6438d9e5269b12caf8f17/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Two U.S. Navy SEALs drowned as they tried to climb aboard a ship carrying illicit Iranian-made weapons to Yemen because of glaring training failures and a lack of understanding about what to do after falling into deep, turbulent waters, according to a military investigation into the January deaths.",
      "publishedAt": "2024-10-11T04:04:54Z",
      "title": "The drownings of 2 Navy SEALs were preventable, military investigation finds",
      "url": "https://apnews.com/78e138486050c9748fc3724347ed230f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c84dcf9836646f1adb429f93fb32054/1236.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA and MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — Brazil on Friday started blocking over 2,000 gambling websites designated as irregular, part of a push by the government to regulate the sector. The move comes as concerns grow about addiction, especially among tens of millions of vulnerable people.",
      "publishedAt": "2024-10-11T16:36:32Z",
      "title": "Brazil starts blocking irregular online gambling as concern rises over addiction",
      "url": "https://apnews.com/690db8befc532b57349fc07f43c4fabc",
      "urlToImage": ""
    },
    {
      "author": "The Associated Press",
      "description": "Another in a series of unusually strong solar storms hitting Earth produced stunning skies full of pinks, purples, greens and blues farther south than normal, including into parts of Germany, the United Kingdom, New England and New York City.",
      "publishedAt": "2024-10-11T15:54:22Z",
      "title": "What's behind the northern lights that dazzled the sky farther south than normal",
      "url": "https://apnews.com/19418e36587141b83fbba7a4f0d7b474",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a848f969a5c4db39a2098757891f49e/2600.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}