{
  "articles": [
    {
      "author": "Nicole Winfield",
      "description": "Cardinals are returning to the Sistine Chapel to continue voting for a new pope. The first conclave ballot failed to find a winner, sending black smoke through the chapel chimney. Some cardinals expected a short conclave to replace Pope Francis, but it may take a few rounds of voting for one man to secure the two-thirds majority needed. The secretive ritual began Wednesday with Cardinal Pietro Parolin leading the proceedings. Thousands gathered in St. Peter’s Square to watch the event on video screens. The cardinals are sequestered from the outside world until they find a new pope.",
      "publishedAt": "2025-05-08T05:01:25Z",
      "title": "Cardinals return to the Sistine Chapel to elect the new pope",
      "url": "https://apnews.com/article/conclave-pope-francis-cardinals-vatican-d7991a37a679f09792ed220cc1f6bbed",
      "urlToImage": "https://dims.apnews.com/dims4/default/206cb3b/2147483647/strip/true/crop/7870x4427+0+410/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F11%2F92feac4b807bc3558b6ea8cb8300%2F2eb1b8ff8d6847208a39e94a93186d81"
    },
    {
      "author": "Franklin Briceño, Nicole Winfield",
      "description": "Robert Prevost was brought to the Vatican in 2023 by Pope Francis as the powerful head of the office that vets bishop nominations, one of the most important jobs in the Catholic Church. On Thursday, he ascended to become Pope Leo XIV — the first American pontiff. Prevost, 69, had to overcome the taboo against a U.S. pope, given the geopolitical power already wielded by the United States in the secular sphere. The Chicago native is also a Peruvian citizen and lived for years in Peru, first as a missionary and then as an archbishop.",
      "publishedAt": "2025-05-08T17:52:46Z",
      "title": "Robert Prevost, now Pope Leo XIV, is a Chicago native who spent years in Peru",
      "url": "https://apnews.com/article/prevost-american-pope-profile-leo-xiv-f9d14d75ae3bbe50bda121f27ee0e42b",
      "urlToImage": "https://dims.apnews.com/dims4/default/119b539/2147483647/strip/true/crop/2048x1152+0+107/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F94%2F78d30f7da3e1c813ea6c11e5427f%2F5e41efb408de4c2c93ab505c1f6a303f"
    },
    {
      "author": "Christine Fernando, Melina Walling",
      "description": "Catholic Chicagoans gathered in churches, cheered from classrooms and celebrated from their homes as the historic decision was announced that a native son, Cardinal Robert Prevost, had been elected pope. The first American elected pontiff, Pope Leo XIV was born and raised in Chicago before his career ministering in Peru. Many Chicagoans said they hope Pope Leo XIV continues Francis's legacy and carries on their city's tradition of social justice and compassion for immigrants.",
      "publishedAt": "2025-05-08T22:27:28Z",
      "title": "Catholic Chicagoans celebrate as native son Pope Leo XIV becomes first American pope",
      "url": "https://apnews.com/article/chicago-pope-leo-francis-catholic-church-cc058b0fd7cf1701c53f2e84f58abab2",
      "urlToImage": "https://dims.apnews.com/dims4/default/cdcc006/2147483647/strip/true/crop/5579x3138+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F23%2F362beb5c1298343dc542484f2fe6%2F222c94570b784eb69abbe6a59c509a21"
    },
    {
      "author": "Zeke Miller, Jill Lawless",
      "description": "The United States and Britain are expected to announce a trade deal that will lower the burden of President Donald Trump’s sweeping tariffs. A deal would be seem as a political victory for U.K. Prime Minister Keir Starmer. Trump said that a deal is due to be announced at 10 a.m. EDT or 1400 GMT. He said that it will be a “full and comprehensive one that will cement the relationship between the United States and the United Kingdom for many years to come.” Starmer’s office said the prime minister would give an “update” about U.S. trade talks later on Thursday. Trump placed a 10% tax on imports from Britain as well as 25% tariffs on autos, steel and aluminum.",
      "publishedAt": "2025-05-08T09:01:55Z",
      "title": "US and UK expected to announce a trade deal that Trump says will cement their relationship",
      "url": "https://apnews.com/article/us-uk-trump-starmer-trade-deal-79d55b8ade0dd8c9265ada9400d079db",
      "urlToImage": "https://dims.apnews.com/dims4/default/ceb0e23/2147483647/strip/true/crop/8064x4536+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F8e%2F1f2b28af29017dd50f92cc82757e%2F4732a8d9916e4c228176431017d4ebd0"
    },
    {
      "author": "Lolita Baldor",
      "description": "The Pentagon will immediately begin moving as many as 1,000 openly identifying transgender service members out of the military and give others 30 days to self-identify. That's happening under a new directive issued Thursday. Buoyed by Tuesday’s Supreme Court decision allowing the Trump administration to enforce a ban on transgender individuals in the military, the Defense Department will then begin going through medical records to identify others who haven’t come forward. Department officials have said it’s difficult to determine exactly how many transgender service members there are, but medical records will show those who have been diagnosed with gender dysphoria, who show symptoms or are being treated. Those troops would then be involuntarily forced out of the service.",
      "publishedAt": "2025-05-08T21:58:07Z",
      "title": "Transgender troops being moved out of the military under new Pentagon order",
      "url": "https://apnews.com/article/trangender-troops-ban-military-trump-pentagon-1d152b538a37e230fd48f33432dea273",
      "urlToImage": "https://dims.apnews.com/dims4/default/e582b96/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F99%2Fa4e55336a322890271c1b0073537%2Fdf2da26a5ec742cd908ae6dbb1df3aba"
    },
    {
      "author": "Michael Kunzelman",
      "description": "President Donald Trump said he is naming Fox News host Jeanine Pirro, a former county prosecutor and elected judge, to be the top federal prosecutor for the nation’s capital after abandoning his first pick for the job. He made the announcement in a post on Thursday on Truth Social. Pirro co-hosts the show “The Five” on Fox on weekday evenings. She was elected as a judge in New York’s Westchester County Court in 1990 before serving three terms as the county’s elected district attorney. Trump tapped Pirro to lead the nation’s largest U.S. Attorney’s office after pulling his nomination of conservative activist Ed Martin Jr. for the position.",
      "publishedAt": "2025-05-08T22:47:03Z",
      "title": "Trump says he is naming Fox News host Jeanine Pirro as DC federal prosecutor",
      "url": "https://apnews.com/article/jeanine-pirro-washington-dc-fox-news-ed-martin-d654d957a15045a4b904224c2c97c059",
      "urlToImage": "https://dims.apnews.com/dims4/default/1267d51/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2F1c%2F2df81ec03e1e1afb91e5a9b2fedf%2Fbac918afe92c4371b5f6edfb7fe354d8"
    },
    {
      "author": "Josh Funk, John Seewer",
      "description": "The Trump administration has proposed a major overhaul of the U.S. air traffic control system in the wake of recent deadly plane crashes and technical failures that have put a spotlight on the outdated network. Transportation Secretary Sean Duffy says the plan calls for six new air traffic control centers, along with technology and communications upgrades at all of the nation’s air traffic facilities over the next three years. How much it will all cost wasn’t immediately revealed. Officials want to add fiber, wireless and satellite technology at more than 4,600 locations, replace 600 radars and increase the number of airports with systems designed to reduce near misses on runways.",
      "publishedAt": "2025-05-08T17:04:58Z",
      "title": "White House proposes a major overhaul of the outdated US air traffic control system",
      "url": "https://apnews.com/article/air-traffic-control-plane-crashes-trump-duffy-8e334139510f395c8ee093e134aae5fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b77463/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F79%2F1bb56263f0660fc2f53f9392caf5%2F87a6a71b29d7494c8ac44829ec655904"
    },
    {
      "author": "Michael R. Sisak, Jennifer Peltz",
      "description": "A former model has testified that Harvey Weinstein sexually assaulted her when she was 16 years old, calling it the most “horrifying thing I ever experienced” to that point. Kaja (KEYE’-ah) Sokola told jurors at Weinstein’s #MeToo retrial on Thursday that the onetime movie honcho put his hand inside her underwear and made her touch his genitals at a Manhattan apartment in 2002. Weinstein is not charged with any crime in connection with the alleged assault. Sokola is testifying because Weinstein is charged with forcing oral sex on her at a Manhattan hotel four years later. Weinstein has pleaded not guilty to all of the charges and denies sexually assaulting anyone.",
      "publishedAt": "2025-05-08T16:52:40Z",
      "title": "Ex-model tearfully tells jury that Harvey Weinstein sexually assaulted her when she was 16",
      "url": "https://apnews.com/article/harvey-weinstein-metoo-sexual-assault-retrial-619811883bfd0988d85c156231cf0c55",
      "urlToImage": "https://dims.apnews.com/dims4/default/d828551/2147483647/strip/true/crop/7299x4106+0+380/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2Faa%2F94837bdc148e3fdbb01efe264f6c%2F7b02a373d12c4d92ba4ddfaade6f3259"
    },
    {
      "author": "Renata Brito, Fatma Khaled",
      "description": "Experts, human rights workers and lawyers criticized reports of plans to deport migrants from the U.S. to Libya. Migrants in Libya are routinely arbitrarily detained and placed in squalid detention centers where they are subjected to extortion, abuse, rape and killings. The International Organization for Migration estimates that Libya has some 800,000 migrants and refugees seeking work or who have fled war in their home countries. A U.N.-backed independent fact-finding mission found evidence that crimes against humanity had been committed against migrants in Libya. Authorities from rival administrations in Libya have denied signing a deportation deal with the Trump administration.",
      "publishedAt": "2025-05-08T20:49:14Z",
      "title": "Reports of Trump deportation plans highlight abuse of migrants in Libya",
      "url": "https://apnews.com/article/libya-deportations-trump-migrants-d6d059383c05360d9f3c52a5a0bbf572",
      "urlToImage": "https://dims.apnews.com/dims4/default/6d006aa/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F31%2F7a8b51f01dd03fa85e56695e2f70%2F007a15be84344b5fadd049745b20ad80"
    },
    {
      "author": "Maria Sherman",
      "description": "The 2025 Academy of Country Music Awards are taking place at the Ford Center at The Star in Frisco, Texas, just north of Dallas. This year marks the 60th annual edition of the ceremony, and Reba McEntire once again hosts. Performances will feature a few duets, including the Backstreet Boys with Rascal Flatts, Jelly Roll with Shaboozey and Brooks & Dunn with Cody Johnson. The ACM Awards are streaming on Prime Video and the Amazon Music channel on Twitch Live on May 8 at 8 p.m. EDT, 7 p.m. CT and 5 p.m. PT. No Prime membership is required to view the live stream.",
      "publishedAt": "2025-05-08T04:02:32Z",
      "title": "2025 ACM Awards: How to watch the 60th anniversary show",
      "url": "https://apnews.com/article/2025-acm-awards-updates-stream-94e234db412945465fbbd06d19897772",
      "urlToImage": "https://dims.apnews.com/dims4/default/2747582/2147483647/strip/true/crop/4423x2488+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F23%2F9f57de2f5a25bdde6e600e0ee549%2F8d0247f42e18487a91ab5ef87d80b3ff"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}