{
  "articles": [
    {
      "author": "MARYCLAIRE DALE, MARC LEVY and MICHAEL RUBINKAM",
      "description": "POTTSTOWN, Pa. (AP) — A murderer who brazenly escaped from a Pennsylvania jail was captured Wednesday in the woods by a team of tactical officers, bringing an end to an intensive search that terrified residents as the fugitive broke into homes for food, changed his appearance, and stole a van and rifle during two weeks on the run.",
      "publishedAt": "2023-09-13T12:40:32Z",
      "title": "Residents can relax after fugitive Danelo Cavalcante is captured and arraigned in rural Pennsylvania",
      "url": "https://apnews.com/057903609fa9a6815c19d9614988b349",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ca32191ae084beeae1cbb02b7168af8/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, STEPHEN GROVES and KEVIN FREKING",
      "description": "WASHINGTON (AP) — House Speaker Kevin McCarthy's sudden decision to launch an impeachment inquiry into President Joe Biden has won over even the most reluctant Republicans, with some GOP lawmakers pushing for swift action while others expect it to drag into the 2024 election year.",
      "publishedAt": "2023-09-13T16:05:50Z",
      "title": "McCarthy impeachment inquiry into Biden appears to win over even the most reluctant Republicans",
      "url": "https://apnews.com/051edf97ad8938e77f41ab57be631f8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb88ba0540444e33a87cb56dda6291eb/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "Utah Republican Sen. Mitt Romney said Wednesday that he will not run for reelection, opting to exit the political stage after a two-decade career in public service that included the 2012 Republican GOP nomination for president and a term as Massachusetts governor.",
      "publishedAt": "2023-09-13T17:55:45Z",
      "title": "Utah GOP Sen. Mitt Romney won't seek reelection in 2024, marking end to decadeslong political career",
      "url": "https://apnews.com/e80ae66f9572ddcdcc63a666913be886",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca2f12422d95457589d50e7e83bd042a/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and YOUSEF MURAD",
      "description": "DERNA, Libya (AP) — Search teams combed streets, wrecked buildings and even the sea Wednesday to look for bodies in a coastal Libyan city where the collapse of two dams unleashed a massive flash flood that killed at least 5,100 people.",
      "publishedAt": "2023-09-13T07:20:18Z",
      "title": "Searchers race to recover bodies in Libya as death toll from flooding hits 5,100",
      "url": "https://apnews.com/39081eb32e4fd426119f4b486c9c2ade",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f60ebb51e9754b41913006044d9ad99b/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and DASHA LITVINOVA",
      "description": "SEOUL, South Korea (AP) — North Korea’s Kim Jong Un vowed “full and unconditional support” for Russia’s Vladimir Putin on Wednesday as the two leaders isolated by the West held a summit that the U.S.",
      "publishedAt": "2023-09-13T04:03:14Z",
      "title": "North Korea's Kim vows full support for Moscow at a summit with Putin in Russia",
      "url": "https://apnews.com/0d70f5190df1088ebe53e8ca19f8e9c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c6789bd8177427db19560a41ccd854d/1920.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN and CHRISTOPHER L. KELLER",
      "description": "ALBUQUERQUE, N.M. (AP) — A U.S. district judge is considering multiple requests to put on hold an order by New Mexico’s Democratic governor that suspends the right to carry firearms in the state’s largest metropolitan area, as criticism mounts and political divides widen.",
      "publishedAt": "2023-09-13T17:31:01Z",
      "title": "Federal judge considers requests against New Mexico governor's order suspending right to open carry",
      "url": "https://apnews.com/b2f400c1e43ed6e3fcc8f4d6f1403d12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93102dd203dc4eb09110a12baa4bdcdf/3000.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "NEW YORK (AP) — As Americans fend off a late summer COVID-19 spike and prepare for a fresh vaccine rollout, Republicans are raising familiar fears that government-issued lockdowns and mask mandates are next.",
      "publishedAt": "2023-09-13T18:50:30Z",
      "title": "There's no sign of widespread COVID-19 mandates in the US. Republicans are warning of them anyway",
      "url": "https://apnews.com/0a68414277bd37458a7e2360b1bc4f11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3d8018c15284c2e964a866abf5ff136/2223.jpeg"
    },
    {
      "author": "PAUL J. WEBER and JAKE BLEIBERG",
      "description": "AUSTIN, Texas (AP) — A woman with whom Texas Attorney General Ken Paxton is said to have had an extramarital affair was expected to give public testimony Wednesday, setting up a dramatic moment in the Republican's impeachment trial on charges of corruption and bribery.",
      "publishedAt": "2023-09-13T14:33:41Z",
      "title": "Woman with whom Texas AG Ken Paxton is said to have had an affair expected to testify at impeachment",
      "url": "https://apnews.com/5984f12216ca1c0819806be281153c8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0cd365ac72284a7f80a53058dedf75d0/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A New Yorker upset that the city has been housing homeless migrants on his block has set up a loudspeaker to deliver an unwelcoming message to his new neighbors: The community doesn't want them.",
      "publishedAt": "2023-09-13T17:38:52Z",
      "title": "Loudspeaker message outside NYC migrant shelter warns new arrivals they are 'not safe here'",
      "url": "https://apnews.com/d19cbe7cf5cae4cae938fe0e71866d02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d99b9b339224e16aea8a3ccf47d0882/3000.jpeg"
    },
    {
      "author": "TERESA M. WALKER",
      "description": "NASHVILLE, Tenn. (AP) — The NFL Players Association wants the league to switch all its fields to natural grass, calling it “the easiest decision the NFL can make.”",
      "publishedAt": "2023-09-13T14:19:13Z",
      "title": "NFLPA renews call for natural grass to help prevent injuries after Rodgers gets hurt",
      "url": "https://apnews.com/0b6bd58da43d52b0a8578bd7e70228d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7741e4c881a14fda90dcda7b066e1e7f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}