{
  "articles": [
    {
      "author": "SARAH EL DEEB",
      "description": "DAMASCUS (AP) — At Damascus’ international airport, the new head of security — one of the rebels who marched across Syria to the capital — arrived with his team.",
      "publishedAt": "2024-12-15T05:04:09Z",
      "title": "One week into a new Syria, rebels aim for normalcy and Syrians vow not to be silent again",
      "url": "https://apnews.com/c06673aa3317a194619710948264cdf1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82cdb31551f14480bcdbceb056b329a2/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "DAMASCUS, Syria (AP) — The United Nations special envoy for Syria on Sunday called for a quick end to Western sanctions after the ouster of President Bashar Assad.",
      "publishedAt": "2024-12-15T10:30:14Z",
      "title": "UN special envoy for Syria calls for sanctions relief following Assad's fall",
      "url": "https://apnews.com/3f0031108d7e58c2343bd6a8fd42254c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50999d1aae4f42c4824ee384b9e3ad56/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s opposition leader offered Sunday to work with the government to ease the political tumult as officials sought to reassure allies and markets, a day after the opposition-controlled parliament voted to impeach conservative President Yoon Suk Yeol over a short-lived attempt to impose martial law.",
      "publishedAt": "2024-12-15T02:35:44Z",
      "title": "South Korean leaders seek calm after Yoon is impeached",
      "url": "https://apnews.com/ca583315453be30766372702120f94e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e50da849fcb44ce6b0aae2c91fb06d40/3000.jpeg"
    },
    {
      "author": "NOAH TRISTER, TARA COPP and AAMER MADHANI",
      "description": "LANDOVER, Md. (AP) — President-elect Donald Trump huddled with allies and a Republican cause célèbre at Saturday's Army-Navy football game, taking in one of the most storied rivalries in college sports while spotlighting his emerging national security team.",
      "publishedAt": "2024-12-14T14:16:38Z",
      "title": "Trump gets warm welcome as he watches Army-Navy game alongside key allies, nominees and Daniel Penny",
      "url": "https://apnews.com/85da138b3ac130b211afc414bf43514a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4562d4be94e04e2884ae68dfc36bb377/1920.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "WASHINGTON (AP) — Senate Republican leader Mitch McConnell, a childhood polio survivor, said any of President-elect Donald Trump’s nominees seeking confirmation should “steer clear” of efforts to discredit the polio vaccine.",
      "publishedAt": "2024-12-14T21:53:51Z",
      "title": "Trump nominees should ‘steer clear’ of undermining polio vaccine, McConnell says",
      "url": "https://apnews.com/f7b7ffbc4ea2b274df658c85374a7a7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/397cee81268841d4bef8466f7dccd11d/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — ABC News has agreed to pay $15 million toward Donald Trump’s presidential library to settle a defamation lawsuit over anchor George Stephanopoulos' inaccurate on-air assertion that the president-elect had been found civilly liable for raping writer E.",
      "publishedAt": "2024-12-14T20:52:54Z",
      "title": "ABC agrees to give $15 million to Donald Trump's presidential library to settle defamation lawsuit",
      "url": "https://apnews.com/04aea8663310af39ae2a85f4c1a56d68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07511248e1bb437b83cf5bdeea5c0081/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and SYLVIE CORBET",
      "description": "CAPE TOWN, South Africa (AP) — At least 11 people have died after Cyclone Chido caused devastating damage in the French territory of Mayotte in the Indian Ocean, France's Interior Ministry said Sunday.",
      "publishedAt": "2024-12-15T10:24:09Z",
      "title": "At least 11 dead in the French territory of Mayotte as Cyclone Chido causes devastating damage",
      "url": "https://apnews.com/2b49b97217a47e2013dc9021d9324eb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/827aa71405eb4ebf94d241f8e0c06cb6/2102.jpeg"
    },
    {
      "author": "JOSH FUNK",
      "description": "OMAHA, Neb. (AP) — Inclement weather plagued areas of the U.S. in the first half of the weekend, with dangerous conditions including heavy snow in upstate New York, a major ice storm in Midwest states, severe weather warnings around Lake Tahoe and unsual tornado activity in Central California.",
      "publishedAt": "2024-12-15T08:20:40Z",
      "title": "Storms across US bring heavy snow, dangerous ice and a tornado in California",
      "url": "https://apnews.com/46d9848b6908aed8f79d0e1064699ee0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6caad8cc05464a6db088bfcd4263fcef/3000.jpeg"
    },
    {
      "author": "PAOLO SANTALUCIA and SILVIA STELLACCI",
      "description": "AJACCIO, Corsica (AP) — Pope Francis’ one-day visit to the French island of Corsica on Sunday, two days before his 88th birthday, puts a dual focus on the Mediterranean, highlighting local traditions of popular piety on the one hand and migrant deaths and wars on the other.",
      "publishedAt": "2024-12-15T06:07:43Z",
      "title": "Pope Francis arrives on 1st papal visit to Corsica, with focus on regional crisis, popular piety",
      "url": "https://apnews.com/1422ac7938a526d02a82f739a51bcfcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/977d6d5e733b4e16a2eaea9cf9e767af/3000.jpeg"
    },
    {
      "author": "MIKE FITZPATRICK",
      "description": "NEW YORK (AP) — Travis Hunter turned every play into prime time — on both sides of the ball — and ultimately took home the Heisman Trophy.Now he’s got a leg up on his celebrity coach at Colorado.",
      "publishedAt": "2024-12-15T01:57:47Z",
      "title": "Colorado two-way star Travis Hunter wins Heisman Trophy as college football's top player",
      "url": "https://apnews.com/c76c411ca04108018eefb18beaa649fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2cd5029ed2b4af4a9e62409333c876a/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}