{
  "articles": [
    {
      "author": "Mark Sherman",
      "description": "President Donald Trump’s vision of the Supreme Court, in which his three appointees are personally loyal to him, collided with the court’s view of itself when six justices voted to strike down Trump’s signature economic policy, global tariffs imposed under an emergency powers law. The outcome Friday led Trump to launch an unusually personal attack on the justices, with special rancor reserved for the two Trump appointees who defied him. Trump said he was “absolutely ashamed” of some justices \"for not having the courage to do what’s right for the country.” He spoke in the White House briefing room several hours after the court issued its decision, authored by Chief Justice John Roberts.",
      "publishedAt": "2026-02-20T22:53:24Z",
      "title": "Trump attacks court over loss in tariff case",
      "url": "https://apnews.com/article/supreme-court-trump-tariffs-gorsuch-barrett-kavanaugh-0b00e69f6230f4b1c90d49a4fe97c6ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/583d024/2147483647/strip/true/crop/4343x2894+401+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F96%2F54f44a525d3db76401e589081476%2F11e2c3a0db3e46639c73952ea2811a52"
    },
    {
      "author": "Josh Boak, Steve Peoples",
      "description": "President Donald Trump suffered a rare rebuke when the Supreme Court ruled against his tariff agenda. The decision Friday throws U.S. trade policy back into uncertainty. Trump has built his economic message around tariffs and the deals that he says they force. He argues they bring factories and jobs back. He also warns that losing them harms the economy. Trump called the ruling “ridiculous” and said he is looking for other laws to keep tariffs in place. Democrats say the decision proves Trump broke the law. Polling from AP-NORC finds that most adults oppose tariffs and expect higher prices.",
      "publishedAt": "2026-02-20T16:35:18Z",
      "title": "Trump's made tariffs central to his presidency. What's next?",
      "url": "https://apnews.com/article/trump-tariffs-supreme-court-whats-next-b8b6d5d44ebb3640a88f7202754cb361",
      "urlToImage": "https://dims.apnews.com/dims4/default/7675d7b/2147483647/strip/true/crop/2116x1410+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2F3f%2Faccf46e53eacff661869a399613d%2F9a1d1dafaf4543318073b54dbc1f83ef"
    },
    {
      "author": "Lindsay Whitehurst",
      "description": "President Donald Trump says he's imposing a temporary global tariff of 10% after his far-reaching tariff regimen was struck down by the Supreme Court. The court handed him a stinging loss on an issue crucial to his economic agenda. Trump says he’s “absolutely ashamed” of justices who voted to strike down his tariffs, calling the decision “deeply disappointing.” Friday's 6-3 decision centers on tariffs he unilaterally imposed under an emergency powers law, including the sweeping “reciprocal” tariffs levied on nearly every other country. Trump has called the case one of the most important in U.S. history. The new tariffs would come under a law that restricts them to 150 days.",
      "publishedAt": "2026-02-20T15:07:12Z",
      "title": "Supreme Court strikes down Trump's sweeping tariffs",
      "url": "https://apnews.com/article/supreme-court-tariffs-trump-0485fcda30a7310501123e4931dba3f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/18dd304/2147483647/strip/true/crop/3936x2623+0+5/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2Ff3%2F37541535b8388bd47da8ac97b41a%2F1df158c9057c44ab9a1bd76bd90931bf"
    },
    {
      "author": "Stan Choe",
      "description": "Wall Street kept calm after the Supreme Court struck down President Donald Trump’s sweeping tariffs, and stocks ticked higher. The S&P 500 added 0.7% Friday. It had been flipping between small gains and losses before the court’s ruling, following discouraging reports showing slowing growth for the U.S. economy and faster inflation. The Dow Jones Industrial Average added 0.5%, and the Nasdaq composite rose 0.9%. Trading was tentative across markets after the ruling and after Trump pledged to put tariffs on other countries using other avenues. Treasury yields largely held steady in the bond market.",
      "publishedAt": "2026-02-20T05:21:51Z",
      "title": "Wall Street keeps calm after the Supreme Court strikes down Trump's tariffs",
      "url": "https://apnews.com/article/stocks-markets-iran-trump-ai-oil-9e92f1913a1b97aa49f674fda96f0b65",
      "urlToImage": "https://dims.apnews.com/dims4/default/37c6ccc/2147483647/strip/true/crop/6657x4436+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7f%2F5d%2Fcda6975e676bde761abf2bd6ff20%2Fbd169d8c2749449382f0ddb636851e57"
    },
    {
      "author": "Michael Biesecker, Jesse Bedayn",
      "description": "A U.S. citizen was shot and killed by a federal immigration officer during a late-night traffic stop nearly a year ago in a Texas beach town crowded with young people celebrating spring break. The death of 23-year-old Ruben Ray Martinez occurred in March on South Padre Island and was reported by local media outlets at the time. But authorities did not publicly disclose that the shooting involved a team from Homeland Security Investigations conducting an immigration enforcement operation in conjunction with local police. Details of the shooting first emerged this month among heavily redacted internal documents from Immigration and Customs Enforcement obtained as part of a Freedom of Information Act lawsuit.",
      "publishedAt": "2026-02-20T23:23:04Z",
      "title": "Records reveal a federal immigration agent fatally shot a Texas man last year",
      "url": "https://apnews.com/article/texas-ice-shooting-ruben-ray-martinez-death-646df2f1212fa48d14a9b270f04c3f76",
      "urlToImage": "https://dims.apnews.com/dims4/default/2bf6c88/2147483647/strip/true/crop/2000x1333+0+834/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fb9%2Fe8d6dce0394953a147766d7ec6e3%2F8c33facbfaed48d59dc06daf756c091b"
    },
    {
      "author": "Josh Funk",
      "description": "All truckers and bus drivers will have to take their commercial driver’s license tests in English as the Trump administration expands its aggressive campaign to improve safety in the industry and get unqualified drivers off the road. Transportation Secretary Sean Duffy announced the latest effort Friday to ensure that drivers understand English well enough to read road signs and communicate with law enforcement officers. Earlier this week, the Transportation Department said 557 driving schools should close because they failed to meet basic safety standards. The department has been aggressively going after states that handed out commercial driver’s licenses to immigrants who shouldn’t have qualified for them ever since a fatal crash in August.",
      "publishedAt": "2026-02-20T19:23:45Z",
      "title": "US commercial driver's license tests must be taken in English",
      "url": "https://apnews.com/article/cdl-commercial-drivers-licenses-duffy-3a87cd0c83e5e563b1445454418e8f59",
      "urlToImage": "https://dims.apnews.com/dims4/default/161f252/2147483647/strip/true/crop/4375x2915+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F23%2F03da5d19284578f3742d9917d250%2F0d00a3ae0af841bab55fe02d0d65e53c"
    },
    {
      "author": "Russ Bynum",
      "description": "Kindergarten and first grade students at a Georgia school are mourning their teacher days after she was killed by a driver who authorities say was fleeing federal immigration officers. Principal Alonna McMullen says it was heartbreaking telling 5 and 6 year old students in Linda Davis' special needs classes of her death. The crash happened Monday less than a half mile from the school where Davis taught in Savannah's southern suburbs. Authorities say the driver was a Guatemalan man who crashed after running a stoplight to evade immigration officers seeking to detain him on a judge's deportation order. McMullen said Davis had an upbeat personality and a determination to ensure all of her students thrived.",
      "publishedAt": "2026-02-19T21:35:22Z",
      "title": "Students in Savannah grieve teacher killed in crash with driver pursued by ICE",
      "url": "https://apnews.com/article/ice-immigration-crash-savannah-teacher-linda-davis-daed7eaee667a725dc7e3891ab327ca5",
      "urlToImage": "https://dims.apnews.com/dims4/default/07ee779/2147483647/strip/true/crop/4032x2687+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F17%2F685f0c641d6a857b10072aa667eb%2F8e062825a75149fb82e5a25095150306"
    },
    {
      "author": null,
      "description": "Nicole “Snooki” Polizzi says she has stage one cervical cancer, and she is urging fans to get screened. On Friday, Polizzi shares the diagnosis in a TikTok video recorded in her car between medical appointments. She says a biopsy found the cancer. She says it's not the news she was hoping for, but it's also not the worst news. She says doctors caught it early, and she feels grateful for that. Polizzi tells followers to keep up with Pap smears. Polizzi rose to fame on MTV’s reality show “Jersey Shore” and later spinoffs. She is 38 and has three children.",
      "publishedAt": "2026-02-21T00:36:38Z",
      "title": "'Jersey Shore' star Snooki is diagnosed with cervical cancer",
      "url": "https://apnews.com/article/snooki-cancer-cervical-jersey-shore-a302413185d4d1cf5952ca31303fa0f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/157d1da/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2Fbf%2Fc1d6dc3b5fa10f70987990f99e70%2F3ea588fb7ddc4aa184f4de7f9f0e2f74"
    },
    {
      "author": "Hannah Schoenbaum, Rebecca Boone",
      "description": "The 5th Circuit Court of Appeals has cleared the way for a Louisiana law requiring poster-sized displays of the Ten Commandments in public classrooms to take effect. The full court voted 12-6 to lift a block placed on the law that a lower court first issued in 2024. In the opinion released Friday, the court said it was too early to make a judgment call on the constitutionality of the law. But the six judges who voted against the decision wrote a series of dissents, some arguing that the case was ripe for judicial review and others saying that the law exposes children to government-endorsed religion in a place they are required to be, presenting a clear constitutional burden.",
      "publishedAt": "2026-02-21T00:48:01Z",
      "title": "Court clears way for Louisiana law requiring Ten Commandments in classrooms to take effect",
      "url": "https://apnews.com/article/ten-commandments-law-louisiana-court-ruling-b7f8f93c4f05426fe73b29225f0a27cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7d0e8a/2147483647/strip/true/crop/5535x3688+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Ff9%2Fddae5be3cc922c99f4c85f94342e%2Feff48daa64c94a6faf77a95b63a1848d"
    },
    {
      "author": "Rob Gillies",
      "description": "ChatGPT-maker OpenAI says it considered alerting Canadian police last year about the activities of a person who months later committed one of the worst school shootings in the country’s history. OpenAI says last June the company identified the account of Jesse Van Rootselaar via abuse detection efforts for “furtherance of violent activities.” The San Francisco tech company says it considered whether to refer the account to the Royal Canadian Mounted Police but determined at the time that the account activity did not meet a threshold for referral to law enforcement. The 18-year-old killed eight people in a remote part of British Columbia last week and died from a self-inflicted gun shot wound.",
      "publishedAt": "2026-02-21T01:42:40Z",
      "title": "OpenAI considered alerting Canadian police about school shooting suspect",
      "url": "https://apnews.com/article/openai-chatgpt-canada-school-shooting-suspect-d574e2703a6e9472b59aa3a5371c57a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/b700dad/2147483647/strip/true/crop/2863x1908+68+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F17%2F593696b9a447a28567b97c6cfa28%2Fdfef3059a57c4925b8616b6f547a2f4b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}