{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JOSEPH KRAUSS and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — The exodus of Palestinians from Gaza’s last refuge accelerated Sunday as Israeli forces pushed deeper into the southern city of Rafah. Israel also pounded the territory’s devastated north, where some Hamas militants have regrouped in areas the military said it had cleared months ago.",
      "publishedAt": "2024-05-12T07:50:23Z",
      "title": "Israel moves deeper into Rafah and fights Hamas militants regrouping in northern Gaza",
      "url": "https://apnews.com/c61fbe06bc5c1a7c85ac18a542e8776e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c0c0c3599a74351838179611ab6e49c/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "REHOBOTH BEACH, Del. (AP) — Secretary of State Antony Blinken on Sunday delivered some of the Biden administration’s strongest public criticism yet of Israel’s conduct of the war in Gaza, saying Israeli tactics have meant “a horrible loss of life of innocent civilians” but failed to neutralize Hamas leaders and fighters and could drive a lasting insurgency.",
      "publishedAt": "2024-05-12T17:16:48Z",
      "title": "Blinken delivers some of the strongest US public criticism of Israel's conduct of the war in Gaza",
      "url": "https://apnews.com/6e0f887bd307f707a05190b33708fe58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8819ca152ff4e69aab5cf2051619a8b/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The star prosecution witness in Donald Trump's hush money trial is set to take the stand Monday with testimony that could help shape the outcome of the first criminal case against an American president.",
      "publishedAt": "2024-05-13T04:22:31Z",
      "title": "Trump trial arrives at a pivotal moment: Star witness Michael Cohen is poised to take the stand",
      "url": "https://apnews.com/f96dd7289cf952145cdd6737b29add3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d4808a87c68461daa413b0c2104f95c/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian President Vladimir Putin on Sunday replaced Sergei Shoigu as defense minister in a Cabinet shakeup that comes as he begins his fifth term in office. In line with Russian law, the entire Russian Cabinet resigned Tuesday following Putin’s glittering inauguration in the Kremlin, and most members have been widely expected to keep their jobs, while Shoigu's fate had appeared uncertain.",
      "publishedAt": "2024-05-12T11:22:28Z",
      "title": "Putin replaces Shoigu as Russia's defense minister as he starts his 5th term",
      "url": "https://apnews.com/e1f9250d200999ea3e87e9b96b4710d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df97b7f93e2d434bbb2952ae698fda4d/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Students often throw up or wet themselves when gunfire erupts outside their school in northern Port-au-Prince.",
      "publishedAt": "2024-05-13T04:15:23Z",
      "title": "Violence is traumatizing Haitian kids. Now the country's breaking a taboo on mental health services",
      "url": "https://apnews.com/eae1e0bc7c0143a1f58da7d58ff29eed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f03332cf3c444514958bc1930226aca3/3000.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "A tiny contingent of Duke University graduates opposed pro-Israel comedian Jerry Seinfeld speaking at their commencement in North Carolina Sunday, with about 30 of the 7,000 students leaving their seats and chanting “free Palestine” amid a mix of boos and cheers.",
      "publishedAt": "2024-05-13T05:08:47Z",
      "title": "Pro-Palestinian protests dwindle on campuses as some US college graduations marked by defiant acts",
      "url": "https://apnews.com/6326e580e2455444aad32b7ebe599025",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9095db527b147489aa100f041f8820e/3000.jpeg"
    },
    {
      "author": "FU TING, ALI SWENSON and DIDI TANG",
      "description": "NEW YORK (AP) — It was 7 a.m. on a recent Friday when Wang Gang, a 36-year-old Chinese immigrant, jostled for a day job in New York City's Flushing neighborhood.When a potential employer pulled up near the street corner, home to a Chinese bakery and pharmacy, Wang and dozens of other men swarmed around the car.",
      "publishedAt": "2024-05-13T04:14:11Z",
      "title": "Trump suggests Chinese migrants are in the US to build an 'army.' The migrants tell another story",
      "url": "https://apnews.com/05478af9702aa8cc0264bb52c8ba7bd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a9ee68a13fd49b09a533375cf729413/3000.jpeg"
    },
    {
      "author": "BY JIM GOMEZ AND AARON FAVILA",
      "description": "SANTA ANA, Philippines (AP) — The far-flung coastal town of Santa Ana in the northeastern tip of the Philippine mainland has long been known by tourists for its beaches, waterfalls, fireflies and a few casinos.",
      "publishedAt": "2024-05-13T04:21:28Z",
      "title": "Sleepy far-flung towns in the Philippines will host US forces returning to counter China threats",
      "url": "https://apnews.com/f98247675dd8a808a515601a6f0c5240",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/963f6d60ea1748fca180333bcec91b6a/3000.jpeg"
    },
    {
      "author": "FANNY BRODERSEN",
      "description": "EICHSFELD, Germany (AP) — When Erdina Laca goes grocery shopping in Eichsfeld these days, she pulls out a special payment card that’s for asylum-seekers only.She no longer pays in cash for her apples, eggs and fish — like most of the Germans standing in line with her at the register.",
      "publishedAt": "2024-05-13T04:32:03Z",
      "title": "Germany limits cash benefit payments for asylum-seekers. Critics say it's designed to curb migration",
      "url": "https://apnews.com/fab2ea049b7d5244bfb0842e4e6f67c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c4d87532c3e4ebb87ddc026d03f3bbb/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "The Cannes Film Festival rarely passes without cacophony but this year’s edition may be more raucous and uneasy than any edition in recent memory.",
      "publishedAt": "2024-05-12T05:34:11Z",
      "title": "A combustible Cannes is set to unfurl with 'Furiosa,' 'Megalopolis' and a #MeToo reckoning",
      "url": "https://apnews.com/0eee7ebe75363e76fba89ca3bfe010b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b668fbe1d0f1493dbbad55d8a7d480f2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}