{
  "articles": [
    {
      "author": "Paul Wiseman",
      "description": "A federal appeals court is allowing President Donald Trump to continue collecting tariffs under an emergency powers law for now, as his administration appeals an order striking down the bulk of his signature set of economic policies. The Court of Appeals for the Federal Circuit granted an emergency motion Thursday from the Trump administration arguing that a halt is “critical for the country’s national security.” The appeals court temporarily halted the order from a federal trade court issued a day before. Trump is facing several lawsuits arguing Trump’s “Liberation Day” tariffs exceeded his authority and left the country’s trade policy dependent on his whims.",
      "publishedAt": "2025-05-29T02:46:55Z",
      "title": "Appeals court allows Trump to continue collecting tariffs under an emergency powers law for now",
      "url": "https://apnews.com/article/trump-trade-tariffs-lawsuit-court-73cd7e1e8528336989f091b2b782360c",
      "urlToImage": "https://dims.apnews.com/dims4/default/8479eea/2147483647/strip/true/crop/5580x3139+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F86%2Fb0211a584e460f1f5190b06a0376%2Fe91ae566b84d45058123419c38537f35"
    },
    {
      "author": "Michael Casey, Annie Ma",
      "description": "A federal judge has extended an order blocking the Trump administration’s attempt to bar Harvard University from enrolling foreign students. On Thursday, U.S. District Judge Allison Burroughs granted Harvard’s request for a preliminary injunction, blocking the government’s action until the case is decided. It had already been paused since last week, when Burroughs issued a temporary restraining order. Harvard sued the Department of Homeland Security after Secretary Kristi Noem revoked its ability to host foreign students at its campus in Cambridge, Massachusetts. On Wednesday, the Trump administration announced a new effort to revoke Harvard’s certification to enroll foreign students.",
      "publishedAt": "2025-05-29T15:55:25Z",
      "title": "Judge extends order blocking Trump ban on foreign students at Harvard",
      "url": "https://apnews.com/article/harvard-international-students-judge-70a69446b265877b801e91b250547cb4",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f94951/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F83%2Fde56652d8a8b37e1ab1b7a43aee0%2F180c08de73a147499c9040f6ab86dc6d"
    },
    {
      "author": null,
      "description": "A natural stones quarry in Indonesia’s West Java province collapsed on several people who were working inside on Friday, killing at least two people and leaving several workers missing, officials said. At least 10 people were trapped in the rubble when the mine in Cirebon district collapsed, West Java Governor Dedi Mulyadi estimated in a video statement, and rescuers have retrieved at least two bodies. The exact number of casualties was still unclear as local television reported rescuers were able to pull at least a dozen injured people from the debris and recover bodies during a grueling search effort.",
      "publishedAt": "2025-05-30T09:08:59Z",
      "title": "Indonesia officials say at least 2 people are dead and 8 are missing after stone quarry collapse",
      "url": "https://apnews.com/article/indonesia-west-java-quarry-collapse-workers-5c64182baf65be422a962feaf06e57ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Bassem Mroue",
      "description": "The Islamic State group has claimed responsibility for two attacks in southern Syria. One of them was an attack on government forces that an opposition war monitor described as the first on the Syrian army to be adopted by the extremists since the fall of Bashar Assad. IS said in statements issued late Thursday that the attacks occurred over the past days in al-Safa area in southern Syria. IS once controlled large parts of Syria and Iraq. The militant group is opposed to the new authority in Damascus led by President Ahmad al-Sharaa.",
      "publishedAt": "2025-05-30T09:31:21Z",
      "title": "Islamic State group claims first attack on Syrian government forces since Assad's fall",
      "url": "https://apnews.com/article/syria-islamic-state-group-attacks-al-sharaa-ab2c535d52a0ce188b5e0346e572890c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "The Associated Press",
      "description": "Medics in Gaza say Israeli airstrikes have killed at least 14 people while Hamas is reviewing a new Israeli-approved ceasefire proposal after giving it an initial cool response. President Donald Trump’s Mideast envoy had expressed optimism this week about brokering an agreement that could halt the Israel-Hamas war, allow more aid into Gaza, and return more of the 58 hostages still held by Hamas, around a third of whom are alive. Experts say a nearly three-month Israeli blockade of Gaza has pushed the population of roughly 2 million Palestinians to the brink of famine.",
      "publishedAt": "2025-05-30T11:27:55Z",
      "title": "Live updates: Israeli airstrikes in Gaza kill at least 14, medics say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-latest-05-30-2025-491038611a812685f8b98c34603ebc7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/d492f1e/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F4f%2F9ce91b07166ba8e2a80bed676226%2F95e67b0b7f294a869cab60f65b1ca060"
    },
    {
      "author": "Eric Tucker",
      "description": "The latest pardons by President Donald Trump are another example of him flexing his power to bestow clemency on political allies and prominent public officials, including those convicted of defrauding the public. The moves not only take aim at criminal cases once touted as just by the Justice Department but also come amid a continuing Trump administration erosion of public integrity guardrails, including the firing of the department’s pardon attorney and the near-dismantling of a prosecution unit established to hold public officials accountable for abusing the public trust.",
      "publishedAt": "2025-05-29T21:49:17Z",
      "title": "Trump's latest pardons benefit political allies and public figures",
      "url": "https://apnews.com/article/trump-pardon-justice-department-f9c5b82dfea0128a49c218fa7f1cbeac",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6cc3cc/2147483647/strip/true/crop/2631x1480+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2Fc5%2F1fd81574c8ab045ce8ce4fc28605%2F34eedbcc9c4a49c3acd4962ed77f8db2"
    },
    {
      "author": "Ben Nuckols",
      "description": "Faizan Zaki has seized the title of best speller in the English language at the Scripps National Spelling Bee. The 13-year-old from Allen, Texas, was runner-up last year after he lost in a lightning-round tiebreaker. He ousted eight other accomplished spellers to win the title on Thursday night, including two that he let back into the competition after his own careless flub. Told to take a deep breath before his final word, “eclaircissement,” he didn’t ask a single question before spelling it correctly. He pumped his fists and collapsed to the stage after saying the final letter.",
      "publishedAt": "2025-05-30T02:23:48Z",
      "title": "Faizan Zaki wins the Scripps National Spelling Bee",
      "url": "https://apnews.com/article/scripps-national-spelling-bee-2025-champion-70f6767e4f30a29b52dfc3dfc77eb553",
      "urlToImage": "https://dims.apnews.com/dims4/default/6de12f2/2147483647/strip/true/crop/3667x2063+0+191/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2Fb6%2F631f492c5cbc7630e9b46ea3f1e8%2F7321222b30f043f69af7f2c443b8380f"
    },
    {
      "author": "Samy Magdy, Joseph Krauss",
      "description": "The White House says Israel has accepted a new U.S. proposal for a temporary ceasefire. White House press secretary Karoline Leavitt on Thursday confirmed special envoy Steve Witkoff and President Donald Trump submitted a ceasefire proposal that Israel has \"backed and supported.\" But Leavitt, speaking to reporters in Washington, said talks are continuing and Hamas has not yet accepted terms of the proposal.",
      "publishedAt": "2025-05-29T10:41:55Z",
      "title": "White House says Israel has accepted new US proposal for temporary ceasefire; Hamas evaluating",
      "url": "https://apnews.com/article/israel-hamas-war-palestinians-gaza-ceasefire-news-36552d00b533d2bb98ff1f321e0875d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/8975fc0/2147483647/strip/true/crop/5817x3272+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Fac%2Fb21c6c5399787ade2f82c038990c%2F69c7c46b212e429ebff32bbd41540436"
    },
    {
      "author": "Brian Melley",
      "description": "Actor and comedian Russell Brand has pleaded not guilty in a London court to rape and sexual assault charges involving four women dating back more than 25 years. Brand, who turns 50 next week, denied two counts of rape, two counts of sexual assault and one count of indecent assault. His trial was scheduled for June 3, 2026. Prosecutors said the offenses took place between 1999 and 2005 — one in the English seaside town of Bournemouth and the other three in London. Brand did not speak to reporters as he arrived at Southwark Crown Court wearing dark sunglasses.",
      "publishedAt": "2025-05-30T09:38:56Z",
      "title": "Russell Brand pleads not guilty to charges of rape and sexual assault",
      "url": "https://apnews.com/article/russell-brand-court-plead-not-guilty-8927e37dec79856f60f04ce2d914dc01",
      "urlToImage": "https://dims.apnews.com/dims4/default/f1eae3e/2147483647/strip/true/crop/2985x1679+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F07%2F4a888b6bab800f2c09143e947196%2Fb53b8eb074284961a640deb6a538c632"
    },
    {
      "author": "Howard Fendrich",
      "description": "French Open tournament director Amélie Mauresmo has been asked again about a lack of women’s matches during the tournament’s night sessions. And Mauresmo again dismissed the questions on Friday. There was one women's match at night at Roland-Garros in 2022, one in 2023, zero in 2024 and, as of Friday, zero in 2025. The two other Grand Slam tennis tournaments that sell separate tickets for night sessions tend to feature two singles matches for that part of the daily schedule — one involving women and one involving men. Roland-Garros added night sessions starting three years ago.",
      "publishedAt": "2025-05-30T11:18:29Z",
      "title": "French Open: Mauresmo tired of talk about women's scheduling",
      "url": "https://apnews.com/article/french-open-mauresmo-jabeur-women-night-7975615d8751c7b39da46aa37e5bc8f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/f15a9e6/2147483647/strip/true/crop/5118x2879+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2F7b%2F9845824fed4ac209c170bc2596c6%2F94e1af6f88b84dc88324be3deb8b0020"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}