{
  "articles": [
    {
      "author": "CLAUDIA LAUER and JILL COLVIN",
      "description": "PHILADELPHIA (AP) — As he closes in on the Republican presidential nomination, former President Donald Trump made a highly unusual stop Saturday, hawking new Trump-branded sneakers at “Sneaker Con,” a gathering that bills itself as the “The Greatest Sneaker Show on Earth.”",
      "publishedAt": "2024-02-17T21:38:06Z",
      "title": "Trump hawks $399 branded shoes at 'Sneaker Con,' a day after a $355 million ruling against him",
      "url": "https://apnews.com/4de093eda6f8d1c68baf8fe8095f777b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ad99a47d78340c9b8dbcd6fd97aa95f/3000.jpeg"
    },
    {
      "author": "BERNARD CONDON",
      "description": "NEW YORK (AP) — Donald Trump won’t face the corporate death penalty after all.A New York judge on Friday spared the ex-president that worst case punishment as he ruled in a civil case alleging Trump fraudulently misrepresented financial figures to get cheaper loans and other benefits.",
      "publishedAt": "2024-02-17T05:04:35Z",
      "title": "Trump avoids 'corporate death penalty' in civil fraud case, but his business will still get slammed",
      "url": "https://apnews.com/1acac26e66862f497782350f172cf970",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c317a5a94f5e4a4ca46ca1b3c9a9c307/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "Alexei Navalny’s spokesperson confirmed Saturday that the Russian opposition leader had died at a remote Arctic penal colony, saying he was “murdered,\" but it was unclear where his body was as his family and friends searched for answers.",
      "publishedAt": "2024-02-17T07:48:17Z",
      "title": "Kremlin foe Alexei Navalny's team confirms his death and says his mother is searching for his body",
      "url": "https://apnews.com/37da0915157576372d6493be7ad04b5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1323ef706de4158baf7baf7b0144462/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "RAFAH, Gaza Strip (AP) — Talks on a potential cease-fire deal in Gaza “have not been progressing as expected” in the past few days after good progress in recent weeks, key mediator Qatar said Saturday, as Israel's prime minister accused the Hamas militant group of not changing its ”delusional\" demands.",
      "publishedAt": "2024-02-17T11:36:29Z",
      "title": "Mediator says talks on Gaza not 'progressing as expected' after momentum in recent weeks",
      "url": "https://apnews.com/410725a8850f658950726772911f93e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92604523c6f74541b04b5970cb37bda9/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Russia said its forces took complete control Saturday of a city in eastern Ukraine that was the focus of intense combat for months, a development that Moscow could use to boost morale as the second anniversary of its full-scale invasion of Ukraine approaches with the war largely at a stalemate.",
      "publishedAt": "2024-02-16T11:21:37Z",
      "title": "Russia takes control of a city in eastern Ukraine after Ukrainian troops withdraw",
      "url": "https://apnews.com/c31eb7439d1983532a3f940061efe6e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b59d65701f8441da9efb78233ebd332/3000.jpeg"
    },
    {
      "author": "BALINT SZLANKO",
      "description": "LONDON (AP) — As Israel-Hamas cease-fire talks flounder, Israel is vowing to press ahead with its offensive in the southern Gaza Strip despite warnings from the U.S. to work harder to protect civilians.",
      "publishedAt": "2024-02-17T13:03:28Z",
      "title": "What to know about the situation in the Middle East this week",
      "url": "https://apnews.com/b7c29d2d2ed5875d7bb790c2a8f3f27e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28e1c8a9206b40b1a7662a0fe0b6ed6c/3000.jpeg"
    },
    {
      "author": "MATT BROWN and JOCELYN NOVECK",
      "description": "Fulton County District Attorney Fani Willis is used to prosecuting high-profile, challenging cases. But as she parried questions about her own personal conduct from the witness stand against the legal teams for defendants her office has accused of election interference, many Black women recognized a dispiriting scene.",
      "publishedAt": "2024-02-17T05:14:29Z",
      "title": "Fani Willis' testimony evokes long-standing frustrations for Black women leaders",
      "url": "https://apnews.com/7ac852848693c0180cbbfc2af358bb52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e359af32b66e47c19c30b7a19f7caa61/3000.jpeg"
    },
    {
      "author": null,
      "description": "WAYCROSS, Ga. (AP) — Two young citizen-soldiers who became close friends after enlisting in the Army Reserve were remembered at funerals in southeast Georgia on Saturday, nearly three weeks after they died in a drone attack while deployed to the Middle East.",
      "publishedAt": "2024-02-17T21:02:23Z",
      "title": "Army Reserve soldiers, close friends killed in drone attack, mourned at funerals in Georgia",
      "url": "https://apnews.com/424d3449910d94004c8453bd60f70c2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75ca2790f5004b329e707efe306bc930/2000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Some state governments and federal regulators were already moving to keep individuals' reproductive health information private when a U.S. senator’s report last week offered a new jolt, describing how cellphone location data was used to send millions of anti-abortion ads to people who visited Planned Parenthood offices.",
      "publishedAt": "2024-02-17T05:21:11Z",
      "title": "State governments looking to protect health-related data as it's used in abortion battle",
      "url": "https://apnews.com/87b5d36620c85ca9f6da4409755358f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4377e37ed8da48bcb4a1dbab5267a187/3000.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "BETHLEHEM, Pa. (AP) — Just blocks from the shuttered Bethlehem Steel plant, the Hispanic Center Lehigh Valley was bustling on a recent day with scores of older people eating lunch. Downstairs, out of sight, a constant stream of visitors was shopping in its massive food pantry.",
      "publishedAt": "2024-02-17T14:02:54Z",
      "title": "Saving democracy is central to Biden's campaign messaging. Will it resonate with swing state voters?",
      "url": "https://apnews.com/176e42a3877eaf33160c71d1b73c96cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ed4a26bec214cac95820de0a37bb5f2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}