{
  "articles": [
    {
      "author": "DAMIAN DOVARGANES and JORDI LEBRIJA",
      "description": "SAN DIEGO (AP) — Tropical Storm Hilary inundated streets across Mexico’s arid Baja California Peninsula with deadly floodwaters Sunday before moving over Southern California, where it swamped roads and downed trees, as concerns mounted that flash floods could strike in places as far north as Idaho.",
      "publishedAt": "2023-08-20T17:06:19Z",
      "title": "Rain from Tropical Storm Hilary lashes California and Mexico, swamping roads and trapping cars",
      "url": "https://apnews.com/f89aeddeb62d55c935699ac81ca85f1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f786b7ca5bae469f9527fb4382bf33ce/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and DAVID KLEPPER",
      "description": "WASHINGTON (AP) — A federal indictment and one in Georgia charging Donald Trump with lying about the 2020 election to overturn President Joe Biden’s win have done nothing to slow the geyser of election falsehoods flowing from the former president and his supporters.",
      "publishedAt": "2023-08-21T04:08:09Z",
      "title": "Trump and his allies double down on election lies after indictments for trying to undo 2020 results",
      "url": "https://apnews.com/4b2269d68dad3024bd5afa711478505a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26763b2b1eba44a3bde9cbc41cf95524/3000.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN, JULIE WATSON and ANDREW SELSKY",
      "description": "LAHAINA, Hawaii (AP) — Freddy Tomas was working in his yard in Lahaina when the fire advanced with stunning speed right up to his fence. He rushed to save valuables from a safe inside his house but realized he didn't have time and fled, his face blackened with soot.",
      "publishedAt": "2023-08-21T04:08:17Z",
      "title": "Immigrant workers’ lives, livelihoods and documents in limbo after the Hawaii fire",
      "url": "https://apnews.com/ab24400f8e1c89ed099dbd3cd45fb890",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bfce18521074cd6aab7944b7bfa21ea/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL and EVELYNE MUSAMBI",
      "description": "Francis Ndege isn’t sure if his customers in Africa’s largest slum can afford to keep buying rice from him.Prices for rice grown in Kenya soared a while ago because of higher fertilizer prices and a yearslong drought in the Horn of Africa that has reduced production.",
      "publishedAt": "2023-08-21T04:06:55Z",
      "title": "Global food security is at crossroads as rice shortages and surging prices hit the most vulnerable",
      "url": "https://apnews.com/a7364dbdb6fd04934090bd2943e24bbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/804aca9f2d7a4c10912098f4b1d728a7/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and EVELYNE MUSAMBI",
      "description": "DUBAI, United Arab Emirates (AP) — Border guards in Saudi Arabia have fired machine guns and launched mortars at Ethiopians trying to cross into the kingdom from Yemen, likely killing hundreds of the unarmed migrants in recent years, Human Rights Watch said in a report released Monday.",
      "publishedAt": "2023-08-21T04:03:35Z",
      "title": "Rights group says Saudi Arabia border guards fired on and killed hundreds of Ethiopian migrants",
      "url": "https://apnews.com/c6958c2593573c0c8fc64794a60f777c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/727ae7bf863048efae23b6fa748ddab3/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — When Republican candidates for president gather for their first debate Wednesday in Milwaukee, the spotlight will not only be on them, but Wisconsin's role as one of a shrinking handful of genuine battleground states.",
      "publishedAt": "2023-08-21T04:05:12Z",
      "title": "GOP presidential debate puts spotlight on Wisconsin, one of the few remaining swing states",
      "url": "https://apnews.com/8c8194948a51a7424fff1c8dd2b42a83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ed90db948e741e080543d9ec97b5ba8/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — Ecuadorians put aside fears of leaving their homes amid unprecedented violence and voted for a new president Sunday in a special election that was heavily guarded by police and soldiers in part due to the assassination of a presidential candidate this month.",
      "publishedAt": "2023-08-20T04:07:10Z",
      "title": "Vote count in Ecuador points to likely runoff between ally of ex-president and banana tycoon’s son",
      "url": "https://apnews.com/0d1b5a7c56c671217a47c1ecb7e826fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c8efeb8001744339b1a46c5cf1efecd/3000.jpeg"
    },
    {
      "author": "SONIA PÉREZ D. and CHRISTOPHER SHERMAN",
      "description": "GUATEMALA CITY (AP) — Outsider Bernardo Arévalo appeared to be the “virtual winner” of Sunday's election to be Guatemala’s next president after voters angry at widespread corruption and leaders’ failure to tackle it made a decisive choice for change.",
      "publishedAt": "2023-08-20T04:02:22Z",
      "title": "Progressive Arévalo is 'virtual winner' of Guatemala election after corruption angered voters",
      "url": "https://apnews.com/d5bffc895c90570aafa77a0b2056a640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/109c98525ad5403385563df7b4617dd6/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Sweltering temperatures lingered Sunday in a large swath of the central U.S., causing misery from the Gulf of Mexico to the Great Lakes.Record high temperatures were recorded in Texas and other states.",
      "publishedAt": "2023-08-20T16:28:01Z",
      "title": "Sweltering temperatures bring misery to large portion of central US, setting heat records",
      "url": "https://apnews.com/c55d9f858297c9941560c3e38b3dc77b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e22d9504b3943c68b9d4a985a5f7b8e/3000.jpeg"
    },
    {
      "author": "SUSAN HAIGH and JIM MORRIS",
      "description": "VANCOUVER, British Columbia (AP) — As tens of thousands of people were under evacuation orders across British Columbia and firefighters battled raging wildfires throughout Canada on Sunday, fire chiefs in a region known as a summer destination for families said they’ve made some progress in the struggle.",
      "publishedAt": "2023-08-20T05:33:36Z",
      "title": "As thousands flee homes across British Columbia from wildfires, chiefs in one region report progress",
      "url": "https://apnews.com/2450568b1db8152ad8f39b8197df321b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9aa2e97352c4b06a803a7b4be1925d4/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}