{
  "articles": [
    {
      "author": null,
      "description": "Heavy rains have caused devastating flash floods in Texas Hill Country, killing at least 24 people and leaving many others missing. At a news conference late Friday Kerr County Sheriff Larry Leitha said two dozen people were dead after least 10 inches (25 centimeters) of rain poured down overnight, causing flash flooding of the Guadalupe River. Authorities said 237 people had been recued so far, including 167 by helicopter. Among the missing are more than 20 girls from a summer camp. Officials say the death toll may rise as rescue operations continue.",
      "publishedAt": "2025-07-05T04:08:26Z",
      "title": "Kerr County floods: 24 dead and more than 20 children missing in Texas",
      "url": "https://apnews.com/article/texas-floods-missing-hill-country-5044c169b59921b2b4f65a2568c354c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/375a433/2147483647/strip/true/crop/4361x2453+0+227/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fa3%2Ffc6b7a9fc7547a6d689507f8b20c%2Fe7833bbcb3af4dbea191a3b540400b66"
    },
    {
      "author": null,
      "description": "Flooding has caused an average of more than 125 deaths per year in the U.S. over the past few decades, according to the National Weather Service, and flash floods are the nation’s top storm-related killer. The deadliest flood event in the past 25 years was Hurricane Katrina, which hit the Gulf Coast in 2005 and caused caused nearly 1,400 deaths. Most recently, flash flooding along a Texas river led to the deaths of at least 27 people and left many others missing, including girls attending a summer camp near the Guadalupe River.",
      "publishedAt": "2025-07-05T16:58:26Z",
      "title": "Some of the deadliest U.S. floods",
      "url": "https://apnews.com/article/flood-deaths-flash-flooding-weather-408b11abe0389f38c93d8722b9d15dd0",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Hospital officials say Israeli airstrikes have killed 14 Palestinians in Gaza and another 10 were killed as they sought food aid. U.S.-led ceasefire efforts appear to be gaining momentum after nearly 21 months of war as Israel's prime minister visits the White House on Monday. Weary Palestinians expressed cautious hope Saturday after Hamas gave a “positive” response to the latest U.S. proposal for a 60-day truce. But the militant group said further talks are needed on implementation. Two American aid workers with the Israel-backed Gaza Humanitarian Foundation were injured in southern Gaza in an attack at a food distribution site.",
      "publishedAt": "2025-07-05T13:02:05Z",
      "title": "Israeli airstrikes kill 14 Palestinians in Gaza and another 10 die seeking food",
      "url": "https://apnews.com/article/israel-gaza-hamas-palestinians-war-news-07-05-2025-72448fcc49b5bb026a32163740eaa97c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6ccf82/2147483647/strip/true/crop/8519x4792+0+444/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2Ff6%2F18f205cf66d2f23f509d23cb6b80%2Faa30a4a0872049b1ba4b07ce46b61147"
    },
    {
      "author": null,
      "description": "Russia launched 550 drones and missiles across Ukraine overnight in the largest aerial assaults since the war began. The capital Kyiv was the primary target. At least 23 people were injured, and multiple residential buildings in the capital were damaged. Ukrainian air defenses shot down 270 targets and another 208 targets were lost from radar and presumed jammed, but dozens still struck or caused damage across the city. Fires and destruction were reported in at least five of Kyiv's 10 districts, and railway infrastructure was also hit. The attack came hours after President Donald Trump held a call with Russian President Vladimir Putin and made his first public comments on the U.S. decision to pause some shipments of weapons to Ukraine.",
      "publishedAt": "2025-07-04T06:33:48Z",
      "title": "Russia hits Ukraine with its largest aerial attack of the war",
      "url": "https://apnews.com/article/ukraine-russia-war-attack-missile-drone-58bc08ddcf1038fb409999c56b11e9fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a5c55e/2147483647/strip/true/crop/8056x4532+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F6e%2Fbf17c5f6f4da18799ea393da9514%2Fae1cabfc6cd8457fb86f8e98f8737c84"
    },
    {
      "author": null,
      "description": "Donald Trump has made tax cuts a central part of his political legacy. There were his first-term cuts. And now the Republican has pushed through an extension of those cuts and added new tax breaks. But the bill he signed into law Friday also comes with significant cuts to Medicaid and food assistance, contradicting promises to protect such programs. Democrats plan to make that expected fallout a campaign focus, while Republicans argue the bill will boost the economy. Historically, major legislation that's been backed mostly by just one party has rarely translated into political rewards. So the long-term effects of Trump’s tax policy are unclear.",
      "publishedAt": "2025-07-05T12:43:42Z",
      "title": "Trump's big bill may come at a political cost",
      "url": "https://apnews.com/article/trump-tax-cuts-health-care-medicaid-elections-ec859e18ddc3619f529dcdfd6e087dd8",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a25bbd/2147483647/strip/true/crop/2825x1589+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F5b%2F9fd719f84999ac37bb7aa2147d5d%2Fd5286240b8d34b61b8ad903358af6876"
    },
    {
      "author": null,
      "description": "A federal judge in Washington is briefly blocking the deportation of eight immigrants to war-torn South Sudan the day after the Supreme Court permitted it to go forward. District Judge Randolph Moss decided Friday to send the case to a judge in Boston whose rulings led to the initial halt of the Trump administration’s effort to begin deportations to South Sudan. The immigrants and their federal guards have been waiting in Djibouti, Africa, for weeks after a judge ordered the administration not to deport anyone to “third countries” where they did not originate. The Supreme Court overturned that ruling. Thursday night.",
      "publishedAt": "2025-07-04T19:04:21Z",
      "title": "Judge blocks immigrants' deportation to South Sudan after Supreme Court cleared the way",
      "url": "https://apnews.com/article/south-sudan-deportation-supreme-court-5055bb1560545e3bc0c6592868b07867",
      "urlToImage": "https://dims.apnews.com/dims4/default/7745e73/2147483647/strip/true/crop/4249x2390+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2Fb6%2Fd21764683b4fbb350f71071d98c4%2F1fbb1529662b425fa3a0eb616d36d9e2"
    },
    {
      "author": null,
      "description": "The arrest of Julio César Chávez Jr., son of Mexican boxing legend Julio César Chávez, for overstaying his visa in the U.S. and lying on a green card application shook Sinaloa state's capital. But it was the way that the U.S. Department of Homeland Security also revealed an active Mexican warrant for his arrest and alleged ties to arms and drug trafficking and the Sinaloa Cartel that made him an uncomfortable subject. In Culiacan, Chávez’s hometown, the news has sparked quiet concern. Locals revere his father, Julio César Chávez, as a national hero but discussions about his son’s alleged cartel links remain muted.",
      "publishedAt": "2025-07-05T16:18:50Z",
      "title": "In Sinaloa's capital, news of a boxing scion's arrest and allegations of cartel ties cause unease",
      "url": "https://apnews.com/article/chavez-mexico-sinaloa-boxing-cartel-8bdce54ccc92631262250465fdf1ea67",
      "urlToImage": "https://dims.apnews.com/dims4/default/3464599/2147483647/strip/true/crop/6000x3375+0+318/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2F18%2Ff9ca8dce9b3125b29da05fe1a434%2F9509201e230e47cd8ea773e8c299a115"
    },
    {
      "author": null,
      "description": "Players from Liverpool and Portugal’s national team joined family and friends for the funeral of their teammate Diogo Jota and his brother. The service was held in the Portuguese town of Gondomar two days after they died in a car crash in Spain. Liverpool captain Virgil Van Dijk and several teammates attended. As did Portugal coach Roberto Martínez and Manchester City players Bernardo Silva and Rúben Dias. Jota and brother André Silva were found dead near Zamora in northwestern Spain early Thursday after the Lamborghini they were driving crashed on an isolated stretch of highway just after midnight.",
      "publishedAt": "2025-07-05T08:51:02Z",
      "title": "Diogo Jota and brother's funeral attended by Liverpool players",
      "url": "https://apnews.com/article/diogo-jota-funeral-portugal-liverpool-7867d71255943696db9aa2d9ffdee9f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/94d7b30/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F38%2Faaa2bd766ce25ad18e3d4b39555a%2F3d784c1a9a0e4edfa91f4f33901997d9"
    },
    {
      "author": null,
      "description": "Police are investigating multiple July Fourth shootings across the U.S. They include one in Indianapolis that left at least two dead and a police chief voicing public frustration over the latest acts of violence in his city. Indianapolis Metropolitan Police Chief Chris Bailey told reporters early Saturday morning that the mayhem was completely unacceptable and unnecessary and that parents and guardians needed to better control their children. Shootings were reported in other cities, including Philadelphia, Chicago and Brockton, Mass., where six people were hospitalized following an early morning fight on Saturday. Meanwhile, a 70-year-old Massachusetts man is dead following a firework incident.",
      "publishedAt": "2025-07-05T16:20:28Z",
      "title": "July Fourth holiday marked by shootings in several cities and a fireworks-related death",
      "url": "https://apnews.com/article/mass-shootings-indianapolis-chicago-july-fourth-c54878b13083d2cf6853fbae96652f0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A swift-moving flood that swept through the Hill Country of Texas on Friday, killing at least 27 people and leaving many more missing, was a flash flood. Flash floods are the nation’s top storm-related killer. According to the National Weather Service, a flash flood is flooding that begins within six hours, and often in as little as three hours, of heavy rainfall. The fast-rising floods kill an average of 127 people annually in the U.S. Nearly half of all deaths involve vehicles. People don't realize that it doesn't take much water to strand or even sweep away a car. They can happen in rural areas and large cities.",
      "publishedAt": "2025-07-04T23:15:38Z",
      "title": "Flash floods like the one that swept through Texas are the nation's top storm-related killer",
      "url": "https://apnews.com/article/flash-flood-warning-watch-texas-986af31b0402a7a721fd9cc275622457",
      "urlToImage": "https://dims.apnews.com/dims4/default/6484811/2147483647/strip/true/crop/4809x2705+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2Fe1%2F8afd62e043635e4ffe608affca83%2F4341040b26754683bee384ebe2bab114"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}