{
  "articles": [
    {
      "author": "NICK PERRY and HOLLY RAMER",
      "description": "SQUAM LAKE, N.H. (AP) — As New England baked in a heat wave Thursday, guests at one campground were keeping their food and beer cold with blocks of ice harvested months earlier from a frozen lake.",
      "publishedAt": "2024-06-20T15:50:17Z",
      "title": "As millions sweat out the heat wave, blocks of lake ice keep these campers cool",
      "url": "https://apnews.com/fd0a476d9baea83a0a470189879547c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b75a77f5c31e43438b9b1e23e2b70a87/3000.jpeg"
    },
    {
      "author": "KEVIN McGILL and SARA CLINE",
      "description": "NEW ORLEANS (AP) — A bill signed into law this week makes Louisiana the only state to require that the Ten Commandments be displayed in every classroom in public schools and colleges — and stirs the long-running debate over the role of religion in government institutions.",
      "publishedAt": "2024-06-20T18:17:18Z",
      "title": "New Louisiana law requiring classrooms to display Ten Commandments churns old political conflicts",
      "url": "https://apnews.com/99b86fff51932374993c45ab3f0555c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b71f1c84fa6428c8f8116abd13f7084/1920.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "The imagery from Pyongyang emerged quickly, notable in its variety — glimpses into North Korea in near-real time that showed its leader, Kim Jong Un, grinning and glad-handing with Russian President Vladimir Putin and showing him around the capital of one of the world's least accessible nations.",
      "publishedAt": "2024-06-20T20:06:31Z",
      "title": "The Putin-Kim summit produced an unusual — and speedy — flurry of glimpses into North Korea",
      "url": "https://apnews.com/7ff8b8b5f8b327a58d54ad6f2e2f4794",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1054a87322fd426d95db9af530efb818/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — The White House announced Thursday that it will rush delivery of air defense interceptor missiles to Ukraine by redirecting planned shipments to other allied nations, as Washington scrambles to counter increased Russian attacks on Ukrainian energy infrastructure.",
      "publishedAt": "2024-06-20T17:31:40Z",
      "title": "US will redirect air defense inceptor missiles to Ukraine that other allies had on order",
      "url": "https://apnews.com/ecd0b8fc6ab8a416a792dc90d36d11bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/144270be3a324408a3471a2406aab4a3/3000.jpeg"
    },
    {
      "author": "MORGAN LEE and SUSAN MONTOYA BRYAN",
      "description": "SANTA FE, N.M. (AP) — President Joe Biden on Thursday issued a disaster declaration for parts of southern New Mexico, freeing up funding and more resources as crews worked, under the threat of flooding and lightning, to battle a pair of deadly wildfires that have destroyed hundreds of homes and forced thousands of people to flee.",
      "publishedAt": "2024-06-20T17:45:04Z",
      "title": "Biden approves disaster declaration, freeing up resources in battle against deadly New Mexico fires",
      "url": "https://apnews.com/940f8193f1fc0c6c68a5276927aa5122",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee231f3eae7a4da78de2fdc4ceb3100f/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Thursday upheld a tax on foreign income over a challenge backed by business and anti-regulatory interests, declining their invitation to weigh in on a broader, never-enacted tax on wealth.",
      "publishedAt": "2024-06-20T14:04:57Z",
      "title": "The Supreme Court upholds a tax on foreign income over a challenge backed by business interests",
      "url": "https://apnews.com/5a13417bd5ae41f7d150ac596f7c51d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28d0afc27c724da88d6067228861a533/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — Donald Sutherland, the Canadian actor whose wry, arrestingly off-kilter screen presence spanned more than half a century of films from “M.A.S.H.” to “The Hunger Games,” has died.",
      "publishedAt": "2024-06-20T17:32:37Z",
      "title": "Donald Sutherland, the towering actor whose career spanned 'M.A.S.H.' to 'Hunger Games,' dies at 88",
      "url": "https://apnews.com/68b0713a89774964b88ce0a1cc55cc18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b8cde7a3b79405db71b38cb0ed0892a/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — The number of arrests by Border Patrol agents of people illegally crossing into the United States fell in May to the third lowest of any month during the Biden presidency, while preliminary figures released Thursday show encounters with migrants falling even more in the roughly two weeks since the president announced new rules restricting asylum.",
      "publishedAt": "2024-06-20T22:37:43Z",
      "title": "Border Patrol reports arrests are down 25% since Biden announced new asylum restrictions",
      "url": "https://apnews.com/30daf9158f91eade039edd061a99a73b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91128406e1424aac981e2e2cb198858a/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — Independent presidential candidate Robert F. Kennedy Jr. has failed to qualify for next week's debate in Atlanta, according to host network CNN, falling shy of benchmarks both for state ballot qualification and necessary polling.",
      "publishedAt": "2024-06-20T14:51:36Z",
      "title": "Robert F. Kennedy Jr. fails to qualify for CNN's debate. It'll be a showdown between Biden and Trump",
      "url": "https://apnews.com/de23c5bf08e33e0df8639ff11d1ff424",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b068bfcd21014df4b47beb8ecd6bb53e/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "LOS ANGELES (AP) — JJ Redick is being hired as the head coach of the Los Angeles Lakers, a person with knowledge of the decision tells The Associated Press.The person spoke on condition of anonymity Thursday because the Lakers hadn't yet publicly announced the decision to hire the former guard for his first coaching job.",
      "publishedAt": "2024-06-20T19:23:55Z",
      "title": "The Lakers are hiring JJ Redick as their new head coach, an AP source says",
      "url": "https://apnews.com/e2f1e90ef9681f77e8b19e112a77c9a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/504ca63b890d467898acff340ce18f27/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}