{
  "articles": [
    {
      "author": "Zeke Miller",
      "description": "President Donald Trump’s Oval Office thrashing of Ukraine’s Volodymyr Zelenskyy has laid bare the limits of a full-court press by America’s allies aimed at reshaping Trump’s determination to end Russia’s invasion even if the terms are not to Ukraine’s liking. It also shows the profound ways Trump feels emboldened to redirect U.S. foreign policy priorities toward his “America First” agenda in ways that extend well beyond those of his tumultuous first term. The episode has left in doubt the future of the U.S.-Ukraine relationship, and Kyiv’s ability to defend itself in the brutal conflict with Russia.",
      "publishedAt": "2025-03-01T05:02:31Z",
      "title": "Trump's Oval Office thrashing of Zelenskyy shows limits of Western allies' ability to sway US leader",
      "url": "https://apnews.com/article/trump-zelenskyy-oval-office-ukraine-russia-blowup-8aa63e55c859e8fea963911478c376ee",
      "urlToImage": "https://dims.apnews.com/dims4/default/da358e0/2147483647/strip/true/crop/3889x2188+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F78%2Fa90e4688c7e28534410a87cf704b%2Fff78f74835e4497ebd26f9ffc7d865c9"
    },
    {
      "author": "The Associated Press",
      "description": "Key Republicans and Democrats have been stalwart supporters of Ukrainian President Volodymyr Zelenskyy. But a blowup between the Ukrainian leader and President Donald Trump is threatening to change that. Zelenskyy had traveled to Washington to sign a deal Friday that would give the U.S. access to its mineral riches as Trump attempts to pressure Ukraine into a deal to end the war with Russia. Instead, the fallout from a heated Oval Office exchange between Trump, Zelenskyy and Vice President JD Vance further splintered American political support for Ukraine. Sen. Lindsey Graham, who has backed Ukraine, called the meeting a “complete, utter disaster.\"",
      "publishedAt": "2025-02-28T20:36:21Z",
      "title": "What US lawmakers are saying about the White House clash between Trump and Zelenskyy",
      "url": "https://apnews.com/article/republicans-trump-zelenskyy-meeting-64ec4a67fce4f04a2d189a1e0204b023",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb2a819/2147483647/strip/true/crop/5486x3086+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F70%2F8d4d345a334f1f6406ca4e6cf9bb%2F48c8bd586cbb436ab7967789d563bb64"
    },
    {
      "author": "Adriana Gomez Licon",
      "description": "President Donald Trump and Vice President JD Vance had a heated exchange with Ukrainian President Volodymyr Zelenskyy in the Oval Office over the war in Ukraine, accusing him of not showing gratitude after he challenged Vance on the question of diplomacy with Russia’s Vladimir Putin. The argument, broadcast globally on Friday, was perhaps unique in American history. It led to the rest of Zelenskyy’s White House visit being canceled and called into question how much the U.S. will still support Ukraine in its defense against Russia’s 2022 invasion.",
      "publishedAt": "2025-02-28T20:58:30Z",
      "title": "A transcript of Trump and Zelenskyy's Oval Office argument",
      "url": "https://apnews.com/article/trump-zelenskyy-vance-transcript-oval-office-80685f5727628c64065da81525f8f0cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/5c9e3b4/2147483647/strip/true/crop/3000x1688+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F49%2Fd2ae134e0b373d79553f54764f30%2F8fd972c8997a4122bb7524d4a3c3b60e"
    },
    {
      "author": "Stefanie Dazio, Susie Blann",
      "description": "European leaders have pledged to stand by Ukraine in the wake of the contentious Oval Office meeting between U.S. President Donald Trump, Vice President JD Vance and Ukrainian President Volodymyr Zelenskyy. The leaders' statements late Friday in support of their neighbor on the continent are ensuring a deepening transatlantic rift. European leaders already were shaken by Vance’s speech to the Munich Security Conference two weeks ago in which he lectured them about the state of their democracy. As prime ministers and presidents across the continent scrambled to respond, they have held a series of emergency summits to discuss security. Another security summit is scheduled for Sunday in London.",
      "publishedAt": "2025-02-28T22:36:48Z",
      "title": "European leaders pledge to stand by Ukraine after confrontational Oval Office meeting with Trump",
      "url": "https://apnews.com/article/zelenskyy-europe-trump-meeting-washington-oval-office-f7a38b4f7d4d5557575e6788e27687eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/457d275/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F7e%2Fde648523fa127a4d8b3e323d92b6%2F4b7222b1fa504a4e8654ce1d1b9934b1"
    },
    {
      "author": "Susan Montoya Bryan",
      "description": "Actor Gene Hackman and his wife made Santa Fe their home decades ago. The northern New Mexico city has a reputation of being a refuge for actors and authors seeking to escape the spotlight. Nestled among piñon- and juniper-scented foothills, it's far from the glitz of Los Angeles or New York City. The normally laid back city was in collective shock this week as news spread that Hackman and his wife, Betsy Arakawa, had been found dead inside their home. Other acclaimed artists who live in Santa Fe include the actors Shirley MacLaine and Ali MacGraw, and “Game of Thrones” author George R. R. Martin.",
      "publishedAt": "2025-03-01T05:02:51Z",
      "title": "For Gene Hackman, Santa Fe was a refuge from limelight",
      "url": "https://apnews.com/article/gene-hackman-santa-fe-new-mexico-1ad28385c861861f289516767410267f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c68ebe4/2147483647/strip/true/crop/1926x1083+0+89/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F20%2F4432d950148d788a070c06b48b14%2F0c2e703cb29240a0b3411c9ebc46d3d8"
    },
    {
      "author": "Will Weissert",
      "description": "The designated survivor for a president's address to Congress starts the day as a Cabinet secretary and ends it that way, too, God willing. But for a brief period, while the rest of the government is gathered together for a big event, like President Donald Trump’s joint congressional address Tuesday, a designated survivor is kept away to ensure someone in the line of succession stays alive. The designated survivor is a failsafe in case a cataclysmic event wipes out everyone else. Alberto Gonzales took on the role in 2007 and called the responsibility “sobering.”",
      "publishedAt": "2025-03-01T05:01:32Z",
      "title": "What it's like to be the designated survivor for a presidential speech",
      "url": "https://apnews.com/article/designated-survivor-trump-address-to-congress-362c6f5ee48f22bbabcb0fecf7c9a094",
      "urlToImage": "https://dims.apnews.com/dims4/default/1391166/2147483647/strip/true/crop/4856x2732+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F2a%2F44afb755d72080b0d59d5174f4bd%2F8649c058778e4005b8847de16e777e07"
    },
    {
      "author": "Andrew Wilks",
      "description": "Kurdish militants who have waged a 40-year insurgency in Turkey have declared a ceasefire, just two days after their imprisoned leader called for the group to disarm. The statement from the Kurdistan Workers’ Party, or PKK, was published on Saturday by the Firat News Agency, a media outlet close to the group. In its statement, the group said the call by its leader indicated that a “new historical process has begun.\" The conflict between Turkey and the PKK, which has been declared a terrorist organization by Ankara and its Western allies, has led to tens of thousands of deaths since it began in 1984.",
      "publishedAt": "2025-03-01T07:01:25Z",
      "title": "Kurdish militants declare ceasefire in 40-year insurgency in Turkey",
      "url": "https://apnews.com/article/pkk-turkey-kurdish-militants-ceasefire-66bae6dd7d08c8144b683f92042fbfc9",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc42221/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2Fc3%2Ff7cc7d1a2ce1402b8d2aaf5d4da4%2F0f3d2ee1e7984193b4d1a9fffb82f118"
    },
    {
      "author": "Will Weissert, Zeke Miller, Aamer Madhani",
      "description": "President Donald Trump berated Ukraine President Volodymyr Zelenskyy for being “disrespectful” in an extraordinary Oval Office meeting, then abruptly called off the signing of a minerals deal that Trump said would have moved that country closer to ending its war with Russia. The astonishing turn of events on Friday has the potential to scramble affairs in Europe and around the globe. During his visit with Trump, Zelenskyy had planned to sign a deal allowing the U.S. greater access to Ukraine’s rare earth minerals, then hold a joint news conference. Instead, Ukraine’s leader left the White House shortly after Trump shouted at him, showing open disdain.",
      "publishedAt": "2025-02-28T05:01:36Z",
      "title": "Zelenskyy leaves White House without signing minerals deal",
      "url": "https://apnews.com/article/zelenskyy-security-guarantees-trump-meeting-washington-eebdf97b663c2cdc9e51fa346b09591d",
      "urlToImage": "https://dims.apnews.com/dims4/default/da358e0/2147483647/strip/true/crop/3889x2188+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F78%2Fa90e4688c7e28534410a87cf704b%2Fff78f74835e4497ebd26f9ffc7d865c9"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Francis is resting after an alarming setback in his two-week recovery from double pneumonia. The Vatican said doctors had to put him on noninvasive mechanical ventilation following a coughing fit in which he inhaled vomit that needed to then be extracted. Doctors said it would take a day or two to evaluate how and if the episode impacted Francis’ overall clinical condition. His prognosis remains guarded, meaning he isn’t out of danger.",
      "publishedAt": "2025-03-01T07:42:46Z",
      "title": "Pope rests after setback in recovery",
      "url": "https://apnews.com/article/pope-vatican-pneumonia-e9c1fda0c5db42ac6e4eda47e9bb2fc3",
      "urlToImage": "https://dims.apnews.com/dims4/default/5243a84/2147483647/strip/true/crop/4144x2331+0+216/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fa5%2F75f4b9fc7507087d76fb0fc86934%2F45af75968cfb449ba6a488aa53fba60a"
    },
    {
      "author": "Christopher Rugaber, Anne D'innocenzio",
      "description": "Ongoing tariff threats from Washington and potentially sweeping government job cuts have darkened consumers’ mood and may be weighing on an otherwise mostly healthy economy. Data released Friday showed that consumers slashed their spending by the most since February 2021, even as their incomes rose. On a positive note, inflation cooled, but President Donald Trump’s threats to impose large import taxes on Canada, Mexico, and China -- the United States’ top trading partners -- will likely push prices higher, economists say. Some companies are already planning to raise prices in response.",
      "publishedAt": "2025-02-28T13:42:26Z",
      "title": "Tariff threats and uncertainty could weigh on consumers, drag down US economy, gov't report suggests",
      "url": "https://apnews.com/article/economy-consumer-trump-tariffs-inflation-b8eacbe9b948af91a4efc97dd3f85cfa",
      "urlToImage": "https://dims.apnews.com/dims4/default/2920b12/2147483647/strip/true/crop/6724x3782+0+346/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2Fa4%2F44e286c8508bfb8b18e11f6cc7d1%2Fac39f430e89b4770a0b3a6a6895b06a2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}