{
  "articles": [
    {
      "author": "JOSHUA GOODMAN and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — As thousands of people demonstrated across Venezuela, opposition candidate Edmundo González announced Monday that his campaign has the proof it needs to show he won the country's disputed election in which electoral authorities named President Nicolás Maduro the victor.",
      "publishedAt": "2024-07-29T06:40:46Z",
      "title": "Venezuelan opposition says it has proof its candidate defeated President Maduro in disputed election",
      "url": "https://apnews.com/acee6c8cd3a8fc88086c2dd71963b759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9de085dc4a3b459891ecfd3fd008556a/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and NATALIE MELZER",
      "description": "JERUSALEM (AP) — Nine Israeli soldiers were due to appear before a military court for an initial hearing Tuesday over what a defense lawyer said were allegations of sexual abuse of a Palestinian at a shadowy facility where Israel has held prisoners from Gaza during the war.",
      "publishedAt": "2024-07-30T11:14:13Z",
      "title": "Probe of soldiers over alleged sexual abuse fuels tension between Israeli military and hard-liners",
      "url": "https://apnews.com/87f1c99b0bb6a0eff86e659f4dc4c524",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44d64f45b60c4bb1b7f791e49ab6d6a4/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and MOHAMMED JAHJOUH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — A steady stream of miserable children and worried parents flowed into the dermatology office at Nasser Hospital in central Gaza.A toddler with a blue hair bow sobbed as her mother showed how the red and white spots covering her face have spread to her neck and chest.",
      "publishedAt": "2024-07-30T06:13:40Z",
      "title": "Lice, scabies, rashes plague Palestinian children as skin disease runs rampant in Gaza's tent camps",
      "url": "https://apnews.com/c30b26d4c4cad0e3f0069efc05d433ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/242a03004f5349939cb68543272eeede/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — Multiple landslides triggered by torrential rains in southern India have killed 70 people, and many others are feared trapped under the debris, officials said Tuesday, with rescue operations being hampered by bad weather.",
      "publishedAt": "2024-07-30T03:45:47Z",
      "title": "Landslides caused by heavy rains kill 70 and bury many others in southern India",
      "url": "https://apnews.com/5eddd0911ec0a98bb65c01a3b6c3b679",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f420b0b0e06646adbd773314d1a94763/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — A 9-year old girl wounded in a stabbing attack at a Taylor Swift-themed dance and yoga class in northwestern England died Tuesday, bringing the death toll to three, as police questioned a 17-year-old suspect arrested minutes after the rampage.",
      "publishedAt": "2024-07-30T08:44:04Z",
      "title": "Taylor Swift says she is 'in shock' after 3 children died in an attack on a UK dance class",
      "url": "https://apnews.com/8a9c7d7ed01441ce96332cd3d1250e43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6a349466291423da6cb2fa98aa0c3a3/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and BILL BARROW",
      "description": "ATLANTA (AP) — Little more than a week ago, Georgia appeared to be slipping out of the Democrats' reach: President Joe Biden's campaign pledged to concentrate more on holding the Midwestern \"blue wall\" states and indicated they might be willing to forsake “Sun Belt” battlegrounds.",
      "publishedAt": "2024-07-30T04:08:32Z",
      "title": "Democrats had feared Georgia was a lost cause with Biden running. Harris will campaign there Tuesday",
      "url": "https://apnews.com/4454ff5825d8f6cf90929147f5b84a71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7143c7b8cea42cb9193cc75f5b455c0/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump on Monday seemed to back away from his earlier commitment to debate Vice President Kamala Harris, questioning the value of a meetup and saying he “probably” will debate but he “can also make a case for not doing it.”",
      "publishedAt": "2024-07-30T01:16:49Z",
      "title": "Donald Trump says he 'probably' will debate Kamala Harris but 'can also make a case for not'",
      "url": "https://apnews.com/cc1dc5d8d0bf85877764b23ccfb54107",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f5eddf5c44c497989b7396c6d310c26/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Since Russia invaded Ukraine in 2022, President Vladimir Putin and other Kremlin voices have frequently threatened the West with its nuclear arsenal.",
      "publishedAt": "2024-07-30T04:30:44Z",
      "title": "Putin often cites Russia’s 'nuclear doctrine' governing the use of atomic weapons. But what is it?",
      "url": "https://apnews.com/51a3a173b81168a811336e0d1fd3538c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/703a845f7e124973810869ad2573e661/3000.jpeg"
    },
    {
      "author": "PAT GRAHAM and KATE BRUMBACK",
      "description": "PARIS (AP) — Concerns about water quality in the Seine River led Paris Olympics organizers to postpone the men’s triathlon Tuesday, with officials hoping the swimming portion of the race will be able to go forward in the long-polluted waterway in the coming days following an expensive cleanup effort.",
      "publishedAt": "2024-07-30T04:07:40Z",
      "title": "Men’s Olympic triathlon postponed in Paris over Seine water quality concerns",
      "url": "https://apnews.com/24c7def74701d50e8c6cd5fad096721c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92e4806831264992ae4f177ea17a76c7/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "PARIS (AP) — The 2024 Olympics famously launched with a rain-soaked opening ceremony that drenched athletes and spectators alike.",
      "publishedAt": "2024-07-30T09:12:10Z",
      "title": "Paris Olympics is bracing for a heat wave following a soggy start",
      "url": "https://apnews.com/4ca791e7219d3efb5ba4e84c6d7f8999",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d58493e0863403f8d7792cfe1ae34b4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}