{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, ERIC TUCKER, MICHELLE L. PRICE and COLLEEN LONG",
      "description": "NEW YORK (AP) — Donald Trump's fixer-turned-foe Michael Cohen returned to the witness stand Tuesday, testifying in detail about how the former president was linked to all aspects of the hush money scheme that prosecutors say was an illegal effort to purchase and then bury stories that threatened his 2016 campaign.",
      "publishedAt": "2024-05-14T04:03:46Z",
      "title": "As House Speaker heads to court with Trump, hush money witness Cohen gives more testimony",
      "url": "https://apnews.com/735aadfd1ce015e05ba955c203a96f1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bebad140eeb84b5985124341d0531a3b/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — Palestinians on Wednesday will mark the 76th year of their mass expulsion from what is now Israel, an event that is at the core of their national struggle. But in many ways, that experience pales in comparison to the calamity now unfolding in Gaza.",
      "publishedAt": "2024-05-14T04:57:07Z",
      "title": "Palestinians mark 76 years of dispossession as a potentially even larger catastrophe unfolds in Gaza",
      "url": "https://apnews.com/b5cea9556e516655c25598d5dbe54192",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c28d7cc667e94e94ac97a7a460a90985/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "More than half a million Palestinians have been displaced in recent days by escalating Israeli military operations in Rafah and northern Gaza, the United Nations says.Israelis celebrated their Independence Day on Tuesday with barbecues in parks across the country, although the normally raucous parties were smaller and quieter this year because of the war in Gaza.",
      "publishedAt": "2024-05-14T06:54:14Z",
      "title": "The Latest | UN says over half a million people flee fighting in Gaza; Israel marks Independence Day",
      "url": "https://apnews.com/322dd129c72e2be9347560d7ea7674dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15d8ea72bcce4c51b82239482806438f/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "KYIV, Ukraine (AP) — U.S. Secretary of State Antony Blinken sought Tuesday to rally the spirits of glum Ukrainians facing a fierce new Russian offensive, assuring them that they are not alone and that billions of dollars in American military aid on its way to the country would make a “real difference” on the battlefield.",
      "publishedAt": "2024-05-14T02:30:53Z",
      "title": "Blinken in Kyiv says US arms will make a difference as Ukraine reels from a new Russian offensive",
      "url": "https://apnews.com/41df75260903f6b9527fbf3a1a44c815",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fb7e178ff1f42b6a8da13dc9d4fde3a/1920.jpeg"
    },
    {
      "author": null,
      "description": "OCALA, Fla. (AP) — A bus carrying farmworkers in central Florida overturned on Tuesday after colliding with a pickup truck on a rural road, killing eight people and injuring about 40 other passengers, authorities said.",
      "publishedAt": "2024-05-14T15:21:33Z",
      "title": "8 dead, at least 40 injured as farmworkers' bus overturns in central Florida",
      "url": "https://apnews.com/e9693eb05f1f920cb20b166413d91d79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab752b981a0743e6ae815c30edf8d563/1920.jpeg"
    },
    {
      "author": "MARYCLAIRE DALE and NICOLAS VAUX-MONTAGNY",
      "description": "LYON, France (AP) — An American accused of sexually assaulting a Pennsylvania college student in 2013 and later sending her a Facebook message that said, “So I raped you,” has been detained in France after a three-year search.",
      "publishedAt": "2024-05-14T17:38:41Z",
      "title": "American sought after ‘So I raped you’ Facebook message detained in France on 2021 warrant",
      "url": "https://apnews.com/2c5ba8a2d51110a5cde300ccdf60e376",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f86804c9ba046b4934ed131abe4b429/1618.jpeg"
    },
    {
      "author": "MARTHA BELLISLE",
      "description": "For decades, police across the United States have been warned that the common tactic of handcuffing someone facedown could turn deadly if officers pin them on the ground with too much pressure or for too long.",
      "publishedAt": "2024-05-14T10:19:07Z",
      "title": "Risks of handcuffing someone facedown long known; people die when police training fails to keep up",
      "url": "https://apnews.com/963e94a574ef8d34d03e7ab27ee61835",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b602849f02704b9cbc7e3c44c85588ef/1920.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "Nobel laureate Alice Munro, the Canadian literary giant who became one of the world’s most esteemed contemporary authors and one of history's most honored short story writers, has died at age 92.",
      "publishedAt": "2024-05-14T16:18:26Z",
      "title": "Alice Munro, Nobel literature winner revered as short story master, dead at 92",
      "url": "https://apnews.com/f2311484b33c450ab16331aef6548631",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/038f7e681c7c47b786dd47b06b5299d8/2000.jpeg"
    },
    {
      "author": "VICTORIA MILKO",
      "description": "JAKARTA, Indonesia (AP) — Fans of Korean pop bands around the world are increasingly channeling their millions-strong online community into climate and environmental activism, protesting business deals linked to coal power, urging K-pop entertainers to cut waste and raising awareness about climate-related issues.",
      "publishedAt": "2024-05-14T03:52:42Z",
      "title": "K-pop fans around globe rally for climate and environment goals",
      "url": "https://apnews.com/0e7ec393f20ca0194d7291e70f49b084",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32b297de663c4013be9a8c79df2a5a01/2000.jpeg"
    },
    {
      "author": "LAURA UNGAR and GEOFF MULVIHILL",
      "description": "Thousands of women in states with abortion bans and restrictions are receiving abortion pills in the mail from states that have laws protecting prescribers, a new report shows.Tuesday’s release of the #WeCount survey shows about 8,000 women a month in states that severely restrict abortion or place limits on having one through telehealth were getting the pills by mail by the end of 2023, the first time a number has been put on how often the medical system workaround is being used.",
      "publishedAt": "2024-05-14T13:01:25Z",
      "title": "Survey finds 8,000 women a month got abortion pills despite their states' bans or restrictions",
      "url": "https://apnews.com/7cfe1b8e69c5de936360f2687cb410c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6dbe94975b684497acdcafdfa6a337c3/2924.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}