{
  "articles": [
    {
      "author": "GERALD IMRAY",
      "description": "CAPE TOWN, South Africa (AP) — South Africans began voting Wednesday in an election seen as their country’s most important in 30 years, and one that could put their young democracy in unknown territory.",
      "publishedAt": "2024-05-29T00:09:23Z",
      "title": "South Africans begins voting in an election seen as their country's most important in 30 years",
      "url": "https://apnews.com/db201bc1aa21a1d986d50af1674a8e78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc727a52c5a240578ac5d3ce2f171296/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — After the International Criminal Court’s top prosecutor sought arrest warrants for Israeli Prime Minister Benjamin Netanyahu, his defense minister and top Hamas officials, the Israeli leader accused him of being one of “the great antisemites in modern times.”",
      "publishedAt": "2024-05-29T04:02:18Z",
      "title": "Netanyahu frequently makes claims of antisemitism. Critics say he's deflecting from his own problems",
      "url": "https://apnews.com/05ebd71bec931a62f58e7d5f9e93fa19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfd8320921274bcabf944abde78436d1/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli shelling and airstrikes killed at least 37 people, most of them sheltering in tents, outside the southern Gaza city of Rafah overnight and on Tuesday — pummeling the same area where strikes triggered a deadly fire days earlier in a camp for displaced Palestinians — according to witnesses, emergency workers and hospital officials.",
      "publishedAt": "2024-05-28T10:18:38Z",
      "title": "Israeli strikes kill at least 37 Palestinians, most in tents, near Gaza's Rafah as offensive expands",
      "url": "https://apnews.com/21ea44e3b514d3f3f2bd26a33f157e48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/001d68103c0e4cbdb5417815269376ac/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JILL COLVIN",
      "description": "NEW YORK (AP) — Jurors in Donald Trump's hush money trial are expected to begin deliberations Wednesday after receiving instructions from the judge on the law and the factors they may consider as they strive to reach a verdict in the first criminal case against a former American president.",
      "publishedAt": "2024-05-29T04:04:18Z",
      "title": "Jury in Trump's hush money case to begin deliberations after hearing instructions from judge",
      "url": "https://apnews.com/390f045e9e8a37f069e82576edd7a842",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bd65d95871a452ea7d6b95a29ed8d82/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "NEW YORK (AP) — Presumptive Republican nominee Donald Trump has been sitting for hours a day in a Manhattan courtroom, where his hush-money trial is nearing its end.",
      "publishedAt": "2024-05-29T04:07:56Z",
      "title": "Rallies and debates used to define campaigns. Now they're about juries and trials",
      "url": "https://apnews.com/f7982bf9c92129e4027db07e2f061371",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce77f163ac6c4b6b8ceaf5dd65823f29/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "PLAN DE AYALA, Mexico (AP) — At 4:30 a.m., the girls and women begin to appear in the dark streets of this rural village of Tojolabal people in southern Mexico. They walk in silence. Some are headed to grind corn to make their family’s tortillas.",
      "publishedAt": "2024-05-29T04:03:32Z",
      "title": "Mexico's next president is likely a woman. But in some Indigenous villages, men have all the power",
      "url": "https://apnews.com/8112a9da0bf2ddb564f20bd478da4d62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc031dd258f34331a835b9aaae4fd169/1920.jpeg"
    },
    {
      "author": "KANIS LEUNG",
      "description": "HONG KONG (AP) — Activist Chan Po-ying is permitted only 15-minute daily visits to see her husband, Leung Kwok-hung, separated by a plexiglass barrier in a highly guarded Hong Kong jail.",
      "publishedAt": "2024-05-29T02:04:56Z",
      "title": "The toll of Beijing's security law on Hong Kong's activists",
      "url": "https://apnews.com/fe313c1a245f6b95b9fbb99a83b3ec36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b7d44d17fdd47cf85edf5ef698a3960/1500.jpeg"
    },
    {
      "author": "LEKAN OYEKANMI and JOHN SEEWER",
      "description": "HOUSTON (AP) — Power outages remained widespread in storm-weary Texas after another burst of severe weather flooded streets, uprooted trees and ripped off roofs. Authorities said a teenager was killed at a construction site while working on a home that collapsed.",
      "publishedAt": "2024-05-29T04:11:19Z",
      "title": "Storm-weary Texas battered again as powerful storm, strong winds kill 1, cause widespread damage",
      "url": "https://apnews.com/d23a5f8b3fef229b6ab619bef29721d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec216bce7d5744218b921950c66d6236/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — U.N. development specialist Garry Conille was named Haiti’s new prime minister Tuesday evening, nearly a month after a coalition within a fractured transitional council sought to choose someone else for the position.",
      "publishedAt": "2024-05-28T22:42:15Z",
      "title": "Transitional council in Haiti selects new prime minister for a country under siege by gangs",
      "url": "https://apnews.com/c6f9e0785271f6ed96785e7ed7ffcfdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40e7699da4f5456d9c1a9120bb922090/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — Pope Francis apologized Tuesday after he was quoted using a vulgar and derogatory term about gay men to reaffirm the Catholic Church’s ban on gay priests.",
      "publishedAt": "2024-05-28T13:16:17Z",
      "title": "Pope apologizes after being quoted using vulgar term about gay men in talk about ban on gay priests",
      "url": "https://apnews.com/92ee291bbeef00a898a10a8a45afd32c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/340c4aba8be04b46b1ac593494256ed3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}