{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "JERUSALEM (AP) — The Israeli military on Wednesday said it had uncovered a major Hamas command center in the heart of Gaza City, inflicting what it described as a serious blow to the Islamic militant group as pressure grows on Israel to scale back its devastating military offensive in the coastal enclave.",
      "publishedAt": "2023-12-20T08:47:04Z",
      "title": "Israel uncovers major Hamas command center in Gaza City as cease-fire talks gain momentum",
      "url": "https://apnews.com/81b80e4716b53756c8fab96c183089ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ae540c0f7ee4382b89ab7e0211aab34/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — Former President Donald Trump's bid to win back the White House is now threatened by two sentences added to the U.S. Constitution 155 years ago.The Colorado Supreme Court on Tuesday barred Trump from the state's ballot under Section 3 of the 14th Amendment, which prohibits anyone who swore an oath to support the Constitution and then “engaged in insurrection” against it from holding office.",
      "publishedAt": "2023-12-20T17:34:38Z",
      "title": "The Constitution's insurrection clause threatens Trump's campaign. Here is how that is playing out",
      "url": "https://apnews.com/79373b5043976588b599fc00ede049e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f4b4678271b49c79cf1b618f68af89b/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN, ERIC TUCKER and REGINA GARCIA CANO",
      "description": "MIAMI (AP) — The United States freed a close ally of Venezuelan President Nicolás Maduro in exchange for the release of 10 Americans imprisoned in the South American country and the return of a fugitive defense contractor known as “Fat Leonard” who is at the center of a massive Pentagon bribery scandal, the Biden administration announced Wednesday.",
      "publishedAt": "2023-12-20T14:04:10Z",
      "title": "US, Venezuela swap prisoners: Maduro ally for 10 Americans, plus fugitive contractor 'Fat Leonard'",
      "url": "https://apnews.com/d7148a34dd009d5bab3d5f50c28ed93e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1387369961734f9a95d235bb0bca66d7/1920.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — China’s prospects for 2024 look uncertain, as a year that opened free of COVID-19 lockdowns winds down without the dreamed of robust recovery for the world’s No. 2 economy.The wars in Gaza and Ukraine are straining China’s ties with the West.",
      "publishedAt": "2023-12-21T01:17:55Z",
      "title": "China emerged from 'zero-COVID' in 2023 to confront new challenges in a changed world",
      "url": "https://apnews.com/f6edc288b95099a415705a9203ea5ab5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc23002cbaaf43118f64ea7de994a63f/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and DAVID A. LIEB",
      "description": "When the coronavirus pandemic took hold in an unprepared U.S., many states like Ohio scrambled for masks and other protective gear. Supplies were so limited in 2020 that the state bought millions of medical gowns from a marketing and printing company and spent about $20 million to try to get personal protective equipment made in-state.",
      "publishedAt": "2023-12-20T05:11:10Z",
      "title": "States are trashing troves of masks and pandemic gear as huge, costly stockpiles linger and expire",
      "url": "https://apnews.com/50bf7739fc9d69f4b991a14daadecaba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f7406dda4584e7183f574d953bded0f/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN and HALELUYA HADERO",
      "description": "Hidden inside the foundation of popular artificial intelligence image-generators are thousands of images of child sexual abuse, according to a new report that urges companies to take action to address a harmful flaw in the technology they built.",
      "publishedAt": "2023-12-20T12:01:47Z",
      "title": "Study shows AI image-generators being trained on explicit photos of children",
      "url": "https://apnews.com/3081a81fa79e2a39b67c11201cfd085f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2498cd654384e82b58d50644d8660d0/3000.jpeg"
    },
    {
      "author": null,
      "description": "SACRAMENTO, Calif. (AP) — A federal judge on Wednesday temporarily blocked a California law that would have banned carrying firearms in most public places, ruling that it violates the Second Amendment of the U.S.",
      "publishedAt": "2023-12-21T01:38:19Z",
      "title": "Federal judge blocks California law that would have banned carrying firearms in most public places",
      "url": "https://apnews.com/c7ebb8506ed99f41b59455350647c0b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ea3131427dd4d6faf899ddb46d7a2b4/3000.jpeg"
    },
    {
      "author": "DÉBORA REY and ALMUDENA CALATRAVA",
      "description": "BUENOS AIRES, Argentina (AP) — President Javier Milei announced sweeping initiatives Wednesday to transform Argentina’s struggling economy, including easing government regulation and allowing privatization of state-run industries as a way to boost exports and investment.",
      "publishedAt": "2023-12-20T05:05:28Z",
      "title": "Argentina’s president announces economy deregulation as thousands protest against austerity",
      "url": "https://apnews.com/c1b7d6506769f1331c37db6e16fe29a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/825cd99836bd4320833cc4448c025895/3000.jpeg"
    },
    {
      "author": "DEVI SHASTRI",
      "description": "When Idaho had a rare measles outbreak a few months ago, health officials scrambled to keep it from spreading.",
      "publishedAt": "2023-12-20T15:50:28Z",
      "title": "Health officials push to get schoolchildren vaccinated as more US parents opt out",
      "url": "https://apnews.com/e7015d8fd38ec80802eeae350755a402",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ee8b912371f469f9616dc961e94896f/3000.jpeg"
    },
    {
      "author": "DAVID CRARY",
      "description": "Repeatedly in recent years, the U.S. Conference of Catholic Bishops has stipulated that “the threat of abortion remains our preeminent priority.” In the face of recent election setbacks for abortion opponents, leading bishops and their lay allies are reassessing how to move forward with that stance.",
      "publishedAt": "2023-12-20T13:03:54Z",
      "title": "US Catholic leadership foresees challenges after repeated election defeats for abortion opponents",
      "url": "https://apnews.com/25da70c3dc0912df649744e2482414fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a20e5f1f92f49c4a097d42a0c83f771/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}