{
  "articles": [
    {
      "author": "BOBBY CAINA CALVAN, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — Hawaii's governor vowed to protect local landowners from being “victimized” by opportunistic buyers when Maui rebuilds from deadly wildfires that incinerated a historic island community and killed more than 100 people.",
      "publishedAt": "2023-08-17T04:47:10Z",
      "title": "Hawaii is vowing to protect landowners on Maui from being pressured to sell after wildfires",
      "url": "https://apnews.com/c8cfcacd2e63bdcd66ec13f2963cea8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7445dccef52243a6b1d44e6cb702e4a0/1920.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ and HAVEN DALEY",
      "description": "PARADISE, Calif. (AP) — California residents driven from their homes by one of the deadliest wildfires in recent history had one request before they would rebuild in the small mountain town of Paradise: warning sirens to bolster town emergency systems that failed some people before the fast-moving inferno that killed 85.",
      "publishedAt": "2023-08-17T05:05:37Z",
      "title": "California town of Paradise deploys warning sirens as 5-year anniversary of deadly fire approaches",
      "url": "https://apnews.com/b4f6a50f7dc5bf1ab4b6f517df2662df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de895c6d8f2f41c9b45aecdd7e64c3e9/3000.jpeg"
    },
    {
      "author": "CHONCHUI NGASHANGVA and SIBI ARASU",
      "description": "NEW DELHI (AP) — Days of relentless rain in India’s Himalayan region have killed at least 72 people this week, a government official said Thursday, as a heavy monsoon triggered landslides and flash floods that have submerged roads, washed away buildings and left residents scrambling for safety.",
      "publishedAt": "2023-08-17T06:24:44Z",
      "title": "Heavy rain and landslides have killed at least 72 people this week in an Indian Himalayan state",
      "url": "https://apnews.com/a6a8d28242ac0c3902b07277680a757a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea07ae4358204b5dafd10af3edcb45b9/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and EMILY SWANSON",
      "description": "WASHINGTON (AP) — President Joe Biden has devoted the past several weeks to promoting the positive impacts of his policies — but his efforts have yet to meaningfully register with the public.Only 36% of U.S.",
      "publishedAt": "2023-08-17T04:07:01Z",
      "title": "Biden's approval rating on the economy stagnates despite slowing inflation, AP-NORC poll shows",
      "url": "https://apnews.com/c3fc17ffe3e1a9c865e2f9627ef4bea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d57dfb6eb30740b4864667330831d14c/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — The prosecutor in Atlanta who obtained an indictment this week against former President Donald Trump and 18 others wants to take the case to trial in March.",
      "publishedAt": "2023-08-16T19:27:06Z",
      "title": "Georgia prosecutor seeks March trial date for Trump and 18 others in election case",
      "url": "https://apnews.com/892156d8658d9fe86d47ae3828c54cb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9fdf62f4d104947a2ae83458038b973/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. military academies must improve their leadership, stop toxic practices such as hazing and shift behavior training into the classrooms, according to a Pentagon study aimed at addressing an alarming spike in sexual assaults and misconduct.",
      "publishedAt": "2023-08-17T12:01:12Z",
      "title": "Pentagon review calls for reforms to reverse spike in sexual misconduct at military academies",
      "url": "https://apnews.com/8753bdc6ba693836e787ee4dca5194d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3044a49559c2425c928c5e52364356c2/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Camp David, the rustic presidential retreat in the mountains of Maryland, has been a backdrop for signal moments in U.S. foreign policy, perhaps none more notable than the peace accord President Jimmy Carter brokered between Egypt and Israel in 1978.",
      "publishedAt": "2023-08-17T04:16:14Z",
      "title": "Biden will use Camp David backdrop hoping to broker a breakthrough in Japan-South Korea relations",
      "url": "https://apnews.com/709aeee4b1cf278a6b16ed85aafbe22b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/552d87cd663a4fbdad4ebc987e4c0ecd/3000.jpeg"
    },
    {
      "author": "ZANE IRWIN",
      "description": "DAKAR, Senegal (AP) — More than 60 migrants are feared dead after a Spanish fishing vessel rescued a boat off the Atlantic archipelago of Cape Verde that originally had more than 100 people aboard, authorities and migrant advocates said Thursday.",
      "publishedAt": "2023-08-17T09:56:07Z",
      "title": "More than 60 Senegalese migrants feared dead on monthlong voyage to Spain",
      "url": "https://apnews.com/a8ce8dc86d81f3fc355e443a9eab9229",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9a3f7aef9f54470845e67dc841b4b95/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JIFTLIK, West Bank (AP) — Across the dusty villages of the occupied West Bank, where Israeli water pipes don’t reach, date palms have been left to die. Greenhouses are empty and deserted. Palestinians say they can barely get enough water to bathe their children and wash their clothes — let alone sustain livestock and grow fruit trees.",
      "publishedAt": "2023-08-17T06:16:30Z",
      "title": "As Israeli settlements thrive, Palestinian taps run dry. The water crisis reflects a broader battle",
      "url": "https://apnews.com/30cb8949bdb45cf90ed14b6b992b5b42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf6e0ceba4f84360b1a603395dc9a332/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "RIVNE, Ukraine (AP) — Along a bustling street in a western Ukrainian city, Denys Abdulin takes his first independent strides since he was severely wounded and blinded while fighting invading Russian troops more than a year ago.",
      "publishedAt": "2023-08-17T06:04:44Z",
      "title": "Ukrainian soldiers who were blinded in combat face the new battle of navigating the world again",
      "url": "https://apnews.com/39e4da45a4954b02ebc4b45cbfbaa8d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8db0feba5abc4ea0834cf7f8137be98b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}