{
  "articles": [
    {
      "author": "KAREL JANICEK",
      "description": "PRAGUE (AP) — Slovakia's populist prime minister, Robert Fico, was shot multiple times and gravely wounded Wednesday after a political event in an attempted assassination that shocked the small country and reverberated across Europe.",
      "publishedAt": "2024-05-15T13:08:10Z",
      "title": "Slovakia's populist prime minister shot multiple times in attempted assassination",
      "url": "https://apnews.com/bdaaf0bba01035a700145a67d871a482",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bec8ee4c4ce64ae9a855537474e90a4d/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, JILL COLVIN and JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump on Wednesday agreed to hold two campaign debates — the first on June 27 hosted by CNN and the second on Sept. 10 hosted by ABC — setting the stage for the first presidential face-off in just weeks.",
      "publishedAt": "2024-05-15T12:19:25Z",
      "title": "Biden and Trump agree to 2 presidential debates, in June and in September",
      "url": "https://apnews.com/6b1d1dbb2ed61c7637041b23662d7da8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fad05abb6274c609dc7f58274029c9c/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and ABBY SEWELL",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu on Wednesday fended off criticism that he is not planning for a postwar reality in the Gaza Strip, saying it was impossible to prepare for any scenario in the embattled Palestinian enclave until Hamas is defeated.",
      "publishedAt": "2024-05-15T08:01:54Z",
      "title": "Netanyahu fends off criticism at home and abroad over his lack of a postwar plan for Gaza",
      "url": "https://apnews.com/e9696aa2da25e447219f2be0c1926b11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c28d7cc667e94e94ac97a7a460a90985/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, ERIC TUCKER, MICHELLE L. PRICE and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump's attorneys started grilling prosecutors' star witness in his hush money trial Tuesday, portraying former attorney Michael Cohen as a media-obsessed liar who's determined to see the former president behind bars.",
      "publishedAt": "2024-05-14T22:28:01Z",
      "title": "Lies, loyalty and a gag order upheld: Tuesday's Trump hush money trial takeaways",
      "url": "https://apnews.com/2d18a4b018208cf2285a4ccd23846709",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2ca75baf08a4ada870d5121971ab86b/1920.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — Russian President Vladimir Putin says the Kremlin is prepared to negotiate over the conflict in Ukraine in an interview with Chinese media on the eve of visit to partner Beijing that has backed Moscow in its full-scale invasion of its neighbor.",
      "publishedAt": "2024-05-15T12:00:15Z",
      "title": "On the eve of his visit to China, Putin says Russia is prepared to negotiate over Ukraine",
      "url": "https://apnews.com/3212ef85d8318cf853f956173f3a682a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27fefddaa26b44eea24ef15ffeb5da55/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — Some social media users are calling out celebrities for what they say is inaction in the face of a humanitarian crisis in Gaza — and they've taken to a “blockout” to pressure the stars to take a stand.",
      "publishedAt": "2024-05-15T05:06:44Z",
      "title": "What is the celebrity 'blockout' over the war in Gaza?",
      "url": "https://apnews.com/2a5258f1f64976c41cd570358923dee7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38db640b615c45abb63689b434b7bcb4/2469.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — The number of U.S. fatal overdoses fell last year, according to Centers for Disease Control and Prevention data posted Wednesday.",
      "publishedAt": "2024-05-15T14:01:26Z",
      "title": "Fewer US overdose deaths were reported last year, but experts are still cautious",
      "url": "https://apnews.com/12e961d78cc0458e84a07e0b3f7d1bbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bcfd17422394417a2cdb24025ef86c0/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER and TERRY SPENCER",
      "description": "OCALA, Fla. (AP) — A man with a long record of dangerous driving pleaded not guilty on Wednesday to driving under the influence-manslaughter in the deaths of eight Mexican farmworkers whose bus was sideswiped by his pickup truck in central Florida.",
      "publishedAt": "2024-05-15T04:20:07Z",
      "title": "Pickup driver with lengthy record held in Florida bus crash that killed 8 Mexican farmworkers",
      "url": "https://apnews.com/e0832b36b75d5cd9beb8080d12edae51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e423bb354aa47cbb46eb25986eb9475/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian forces withdrew from some parts of the country's northeast and battled Russian troops in other areas Wednesday, as President Volodymyr Zelenskyy's decision to postpone all his upcoming foreign trips underscored the seriousness of the threat his soldiers face.",
      "publishedAt": "2024-05-15T07:50:37Z",
      "title": "Ukrainian troops pull out of some areas and Zelenskyy postpones foreign trips amid Russian offensive",
      "url": "https://apnews.com/30c152149f68bbe03c485ce91df6e7ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8157918eb0e4bfe924499c1ee1b050d/3000.jpeg"
    },
    {
      "author": "DAVID CRARY, HOLLY MEYER and PETER SMITH",
      "description": "Twenty years ago, Beth Stroud was defrocked from her beloved job as a United Methodist pastor in Philadelphia.",
      "publishedAt": "2024-05-15T12:10:17Z",
      "title": "United Methodists scrap their anti-gay bans. A woman who defied them seeks reinstatement as pastor",
      "url": "https://apnews.com/9af681195e6621079422265f403b6453",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4510cd906aa4962958ed2a641743052/2703.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}