{
  "articles": [
    {
      "author": "COREY WILLIAMS, GIOVANNA DELL'ORTO, MARIAM FAM and DARREN SANDS",
      "description": "DEARBORN, Mich. (AP) — While Muslim students remain a rarity in many U.S. school districts, they are a major presence in some communities, prompting public schools to be more attentive to their needs during the holy month of Ramadan when dawn-to-sundown fasting is a duty of Islam.",
      "publishedAt": "2024-03-16T12:03:25Z",
      "title": "Fasting at school? More Muslim students in the US are getting support during Ramadan",
      "url": "https://apnews.com/8504b32049791fbc85eec9a8f68c700f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8843e8bd02b47a98dc58bc6f87478da/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Stalled talks aimed at securing a cease-fire in the Israel-Hamas war are expected to resume in earnest in Qatar as soon as Sunday, according to Egyptian officials.",
      "publishedAt": "2024-03-16T10:21:21Z",
      "title": "Cease-fire talks with Israel and Hamas are expected to resume on Sunday in Qatar",
      "url": "https://apnews.com/53a0fff49d9196fc38f75ad1b37a64bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb2ec632801e4d6c96ab3a6b796f8e00/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Hamas’ unprecedented raid on southern Israel has prompted a legal predicament: How does a country scarred by the deadliest attack in its history bring the perpetrators to justice?",
      "publishedAt": "2024-03-17T04:19:33Z",
      "title": "How should Israel bring to justice the perpetrators behind the worst attack in its history?",
      "url": "https://apnews.com/2af944dfd5a55dff0876fd3a9743afb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2dc88efc70ac4845a30a86dfead636f4/3000.jpeg"
    },
    {
      "author": "MIKE CATALINI and RON TODT",
      "description": "TRENTON, N.J. (AP) — A man suspected of fatally shooting three family members in their Philadelphia-area homes Saturday was arrested in New Jersey after evading law enforcement for hours as police mobilized across two states, shutting down a parade and an amusement park and ordering some residents to stay in their homes.",
      "publishedAt": "2024-03-16T15:07:50Z",
      "title": "Man suspected of killing 3 people in Philadelphia area arrested in New Jersey, police say",
      "url": "https://apnews.com/fb5a52ecf043dc82556ae0d0286007b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38773a44193e40c780bb2d6657f4e62d/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "Voters across Russia cast ballots Saturday on the second day of an election set to formalize six more years of power for President Vladimir Putin, who faces no serious challengers after crushing political dissent over his nearly quarter-century of rule.",
      "publishedAt": "2024-03-16T05:45:24Z",
      "title": "Russians cast ballots in an election preordained to extend President Vladimir Putin's rule",
      "url": "https://apnews.com/55fc9746c240cfd7f267b007f83a1147",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f66f5aab1fef44d8b79b12e2222ab1ed/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — The big news this week, President Joe Biden said at a weekend Washington roast, was that two candidates had clinched their party's nomination for president.",
      "publishedAt": "2024-03-17T04:03:06Z",
      "title": "Biden says at DC roast that of 2 presidential candidates, 1 was mentally unfit. 'The other's me'",
      "url": "https://apnews.com/247fef0a2b13eac1e51eb1e4f93e7a8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10473c3c1e93420493a1188c12b78f3d/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and JILL COLVIN",
      "description": "VANDALIA, Ohio (AP) — Former President Donald Trump claimed that he — not President Joe Biden — will protect Social Security and warned of a “bloodbath” if he loses in November as he campaigned for Senate candidate Bernie Moreno in Ohio.",
      "publishedAt": "2024-03-16T22:52:17Z",
      "title": "Trump campaigns for GOP Senate candidate Bernie Moreno in Ohio",
      "url": "https://apnews.com/3b450dcfc24a02c8cac3a3feb657ddc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ba397c940fa45bd8e561a812792b01a/3000.jpeg"
    },
    {
      "author": "SIBI ARASU",
      "description": "BENGALURU, India (AP) — Bhavani Mani Muthuvel and her family of nine have around five 20-liter (5-gallon) buckets worth of water for the week for cooking, cleaning and household chores. “From taking showers to using toilets and washing clothes, we are taking turns to do everything,” she said.",
      "publishedAt": "2024-03-17T02:11:03Z",
      "title": "India's Bengaluru is fast running out of water, and a long, scorching summer still looms",
      "url": "https://apnews.com/17554235dba0741a266f2251b91aec8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f181998565754fc5bd241f742879bcf1/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A suspected attack by Yemen's Houthi rebels saw an explosive detonate near a ship early Sunday in the Gulf of Aden, potentially marking their latest assault on shipping through the crucial waterway leading to the Red Sea.",
      "publishedAt": "2024-03-17T02:15:14Z",
      "title": "A suspected attack by Yemen's Houthi rebels has targeted a ship in the Gulf of Aden",
      "url": "https://apnews.com/bf077f026a9f177ec87f4131d695cafc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e5366c4e28b4193a4297c308887667f/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — As Salvatore LoGrande fought cancer and all the pain that came with it, his daughters promised to keep him in the white, pitched roof house he worked so hard to buy all those decades ago.",
      "publishedAt": "2024-03-16T20:18:25Z",
      "title": "State Medicaid offices target dead people’s homes to recoup their health care costs",
      "url": "https://apnews.com/65d5e637e19dc27bd1bd3b097d239b53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62ef4123d71841e685cbc856e462f3e0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}