{
  "articles": [
    {
      "author": null,
      "description": "Hospitals and medics in the Gaza Strip say Israeli strikes across the Palestinian enclave killed at least 66 people overnight and into Sunday. The hospitals and medics said women and children were among the dead. The bloodshed came as Israel launches an escalation of its war in Gaza, which it says is meant to ramp up pressure on Hamas to agree to a temporary ceasefire. The Israeli military had no immediate comment.",
      "publishedAt": "2025-05-18T06:47:32Z",
      "title": "Israeli strikes across Gaza kill at least 66 people",
      "url": "https://apnews.com/article/mideast-wars-israel-gaza-hamas-hostages-18-05-2025-f325044576f1ac31e6083622242c9990",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Russia overnight into Sunday launched its most intense drone attack on Ukraine since the beginning of its full-scale invasion in 2022. Russia fired a total of 273 exploding drones and decoys overnight, Ukraine’s air force said. Of those, 88 were intercepted and a further 128 lost, likely having been electronically jammed. According to Kyiv regional Gov. Mykola Kalashnyk, one woman was killed in a drone attack on the region and three other people were wounded. The barrage came after the first direct talks between Moscow and Kyiv in years on Friday failed to yield a ceasefire.",
      "publishedAt": "2025-05-18T06:41:05Z",
      "title": "Russia launches one of biggest drone attacks on Ukraine since start of war, killing at least 1",
      "url": "https://apnews.com/article/russia-ukraine-drone-attack-deadly-ceasefire-talks-b18d7ad72951680f24dbf289976c6251",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Nicole Winfield",
      "description": "About 150 official delegations are expected at the formal installation Mass for Pope Leo XIV. Sunday's ceremony in St. Peter's Square blends ancient ritual, evocative symbols and a nod to modern-day celebrity. Leo will start the day by taking his first tour through the piazza in the popemobile. The open-topped vehicle has become synonymous with the papacy’s global reach and mediatic draw. Leo will receive the two potent symbols of the papacy during the Mass. They are the lambswool stole known as a pallium. And the fisherman’s ring.",
      "publishedAt": "2025-05-18T03:02:27Z",
      "title": "Ritual, symbol and a popemobile tour mark Pope Leo XIV's installation Mass",
      "url": "https://apnews.com/article/vatican-pope-leo-xiv-installation-mass-b210865c4f0ed422ae74702c6eea1a93",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a082c7/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F4a%2F9cd8a5a5ed1ffd556a1aa74d7ccf%2F787f3ef2e4ef43e0a90c43429cd39e41"
    },
    {
      "author": "Dylan Lovan",
      "description": "Severe storms across parts of the U.S. Midwest and South have left at least 27 people dead. Kentucky Gov. Andy Beshear said Saturday that there were 18 weather-related deaths in his state. Ten others in the state were hospitalized in critical condition. A devastating tornado in Kentucky damaged homes, tossed vehicles and left many people homeless. Seventeen of the deaths were in Laurel County, located in the state’s southeast. The other was in Pulaski County: Fire Department Maj. Roger Leslie Leatherman, a 39-year veteran who was fatally injured while responding to the deadly weather. Beshear said parts of two dozen state roads were closed, and some could take days to reopen.",
      "publishedAt": "2025-05-18T03:22:38Z",
      "title": "Severe weather leaves at least 27 dead, including 18 in Kentucky",
      "url": "https://apnews.com/article/severe-weather-midwest-south-kentucky-a6b8932577b800f996d6963290d3f3d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/959e386/2147483647/strip/true/crop/4786x2692+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F7d%2F4e94a9bade4ab612da1756d58803%2Fa55cc5f5df5f4b188ce5a963d83d9bb0"
    },
    {
      "author": "The Associated Press",
      "description": "Officials say police and firefighters are responding to an explosion that rocked the city of Palm Springs. The city of Palm Springs says the explosion happened at 11 a.m. local time and that residents were being asked to avoid the area around North Indian Canyon Drive near East Tachevah Drive. Palm Springs is a tony community in the desert about a two-hour drive west of Los Angeles, known for upscale resorts and a history of celebrity residents.",
      "publishedAt": "2025-05-17T19:32:07Z",
      "title": "Police and firefighters respond to an explosion rocking the California city of Palm Springs",
      "url": "https://apnews.com/article/california-explosion-palm-springs-eb8887fbe5877a20a40916aba86554ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A Mexican navy sailing ship has hit the Brooklyn Bridge during a promotional tour in New York City, the top of its mast brushing the iconic span as it sailed through the East River. Fire officials say there have been some injuries. The Mexican navy said in a post on the social platform X that Saturday's incident involved the Cuauhtemoc, an academy training vessel. It said the Cuauhtemoc was damaged and prevented from continuing its voyage. The navy added that the status of personnel and material was under review by naval and local authorities, which were providing assistance.",
      "publishedAt": "2025-05-18T01:42:03Z",
      "title": "Mexican navy training vessel hits New York's Brooklyn Bridge. Some injuries reported",
      "url": "https://apnews.com/article/brooklyn-bridge-collision-mexican-navy-ship-ca335dc85ebfbf981bc38516985461c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/6103def/2147483647/strip/true/crop/3000x1688+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F6e%2F8ae11d03f4c52487eb42dc575d3c%2Fc1c415612cbf4fd3b980adc8ded92933"
    },
    {
      "author": "Vanessa Gera",
      "description": "Poles are voting in a presidential election held at a time of heightened security concerns stemming from the ongoing war in neighboring Ukraine. There are also growing fears that the U.S. commitment to European defense may be weakening under former President Donald Trump. The two front-runners in a field of 13 candidates are Warsaw Mayor Rafał Trzaskowski, a liberal allied with Prime Minister Donald Tusk, and Karol Nawrocki, a conservative historian supported by the national conservative Law and Justice party. Recent opinion polls show Trzaskowski with around 30% support and Nawrocki in the mid-20s. A second round between the top will take take place June 1 if no candidate reaches at least 50% of the vote Sunday.",
      "publishedAt": "2025-05-18T05:05:43Z",
      "title": "Poles vote for a new president as security concerns loom large",
      "url": "https://apnews.com/article/poland-presidential-election-e62ccf197a759b0fd44b49b94b06eefa",
      "urlToImage": "https://dims.apnews.com/dims4/default/9758e35/2147483647/strip/true/crop/5061x2847+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2Fca%2F9af9da1ba78df607e0afe05d5e4b%2Fb9861a73963f4ca09164c0e089c4ed0b"
    },
    {
      "author": "Stephen Mcgrath, Justin Spike",
      "description": "Romanians are casting their ballots in a tense presidential runoff between a hard-right nationalist and a pro-Western centrist. It's a high-stakes election rerun that could determine the geopolitical direction of the European Union and NATO member country. Sunday’s race pits front-runner George Simion, the 38-year-old leader of the hard-right Alliance for the Unity of Romanians, and incumbent Bucharest Mayor Nicusor Dan. It comes months after the previous election was annulled and plunged Romania into its worst political crisis in decades. Polls opened at 7 a.m. local time and will close at 9 p.m.",
      "publishedAt": "2025-05-18T04:01:06Z",
      "title": "Romanians vote in a tense presidential runoff that pits nationalist against pro-EU centrist",
      "url": "https://apnews.com/article/romania-election-presidential-europe-runoff-democracy-6408339a1a9d310bcc540c75b1d110f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/b8b0954/2147483647/strip/true/crop/7587x4268+0+395/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2F43%2F3dc705d39baf8a9576ee34eb843f%2Ff387df59da8346aa80592a097525d76b"
    },
    {
      "author": "Barry Hatton",
      "description": "Voters in Portugal are returning to the polls for a third general election in three years, as the country’s increasingly fragmented political landscape defies efforts to unite behind policies on pressing national issues such as immigration, housing and the cost of living. Hopes that Sunday's ballot might end the worst spell of political instability in decades for the European Union country of 10.6 million people could be dashed, however. The election is poised to deliver yet another minority government, polls suggest, leaving the Portuguese back where they started. For the past 50 years the center-right Social Democrats and the center-left Socialist Party have alternated in power. They are likely to come out on top in this ballot, too.",
      "publishedAt": "2025-05-18T05:00:06Z",
      "title": "Portugal holds its 3rd general election in 3 years but the vote might not restore stability",
      "url": "https://apnews.com/article/portugal-election-politics-a7ad09455b14af8eb7722ac0008d96ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c13fd6/2147483647/strip/true/crop/7008x3942+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F26%2Fecd28d811955c42c1fb1797f2673%2Fc2b721c5ad364d52b8630b597814dd25"
    },
    {
      "author": "David Yusufu Kibingila, Monika Pronczuk",
      "description": "Nestled in the green hills of Masisi territory in Congo, the artisanal Rubaya mining site hums with the sound of generators, as hundreds of men labor by hand to extract coltan, a key mineral crucial for producing modern electronics and defense technology. Rubaya lies in the heart of eastern Congo, a mineral-rich part of the Central African nation which for decades has been ripped apart by violence from government forces and various armed groups. As the U.S. spearheads peace talks between Congo and Rwanda, Congo’s President Felix Tshisekedi has sought out a deal with the Trump administration, offering mineral access in return for American support in quelling the insurgency and boosting security.",
      "publishedAt": "2025-05-18T06:04:09Z",
      "title": "Congo's coltan miners dig for world's tech — and struggle regardless of who is in charge",
      "url": "https://apnews.com/article/rubaya-congo-mining-coltan-trump-deal-8bc0b36cc1def4be7e583e658b0bb444",
      "urlToImage": "https://dims.apnews.com/dims4/default/2fca7c6/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F36%2F0a6991ba460a8c41ab287ec0ff5b%2Faa41520048ff455db7ed3a9e4edde04c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}