{
  "articles": [
    {
      "author": "STEPHANY MATAT, ERIC TUCKER, TERRY SPENCER, ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "WEST PALM BEACH, Fla. (AP) — The man suspected in an apparent assassination attempt targeting Donald Trump camped outside a Florida golf course with food and a rifle for nearly 12 hours, lying in wait for the former president before a Secret Service agent thwarted the potential attack and opened fire, according to court documents filed Monday.",
      "publishedAt": "2024-09-16T14:52:04Z",
      "title": "Suspect in apparent assassination attempt on Trump was near golf course for 12 hours, records show",
      "url": "https://apnews.com/fee81d8bcf737bfcde2ee8e5cea88465",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66c61c9cca7c4c29bb713eae3d89bf53/1920.jpeg"
    },
    {
      "author": "MICHAEL BIESECKER, AUDREY McAVOY, BERNARD CONDON and MICHAEL R. SISAK",
      "description": "KAAAWA, Hawaii (AP) — Ryan Wesley Routh portrayed himself online as a man who built housing for homeless people in Hawaii, tried to recruit fighters for Ukraine to defend itself against Russia, and described his support and then disdain for Donald Trump — even urging Iran to kill him.",
      "publishedAt": "2024-09-16T13:47:19Z",
      "title": "Man who appeared intent on killing Trump wrote a book urging Iran to assassinate the ex-president",
      "url": "https://apnews.com/f76ed09f256f6bd21727a10901d92af7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a7e29ac38c344589ba6d0bf450c316e/2187.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN and JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israel said Tuesday that halting Hezbollah's attacks in the country's north to allow residents to return to their homes is now an official war goal, as it considers a wider military operation in Lebanon that could ignite an all-out conflict.",
      "publishedAt": "2024-09-17T08:31:10Z",
      "title": "Israel says halting Hezbollah attacks is now a war goal as officials warn of a wider operation",
      "url": "https://apnews.com/39f6bdbacb2d4d0743f78a85bd138708",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/818bf1d2e10f463d940cf144d226ad04/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Sean “Diddy\" Combs was expected to appear before a federal judge in New York on Tuesday after his indictment on undisclosed criminal charges.",
      "publishedAt": "2024-09-17T11:01:56Z",
      "title": "Sean 'Diddy' Combs is expected in court after New York indictment",
      "url": "https://apnews.com/5d570cab4625ca5f9dd16dfd7df4437c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/314bffdcfb894d1f81953e4f898ac492/3000.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "NEW YORK (AP) — Hours after an apparent attempt on Donald Trump's life over the weekend, Elon Musk took to his social platform X to post a thinking emoji and a comment that “no one is even trying to assassinate” the Democratic president and vice president.",
      "publishedAt": "2024-09-17T04:02:03Z",
      "title": "Elon Musk has often inflamed politically tense moments, raising worries for the US election",
      "url": "https://apnews.com/3479f2348f6ec47ce641ddf20fd6ce4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f57655d7624c4b6e81858ec67bedeb50/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — Meta said it's banning Russia state media organization from its social media platforms, alleging that the outlets used deceptive tactics to amplify Moscow's propaganda. The announcement drew a rebuke from the Kremlin on Tuesday.",
      "publishedAt": "2024-09-17T10:33:44Z",
      "title": "Facebook owner Meta bans Russia state media outlets over \"foreign interference\"",
      "url": "https://apnews.com/92a22a9681119d7d8ce217f8429e3c3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae450213081e444dba8a70d789c52ff8/3000.jpeg"
    },
    {
      "author": null,
      "description": "BANGKOK (AP) — Floods and landslides in Myanmar triggered by last week’s Typhoon Yagi and seasonal monsoon rains have claimed at least 226 lives, with 77 people missing, state-run media reported Tuesday.",
      "publishedAt": "2024-09-17T09:06:11Z",
      "title": "Casualties in Myanmar push Southeast Asia's death toll from Typhoon Yagi past 500",
      "url": "https://apnews.com/251c12ebeec148daefe3bcc2f6235f34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ffa0463c6ba4df48234f1fd8af3993a/3000.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "AVIGNON, France (AP) — A 71-year-old French man acknowledged in court Tuesday that he drugged his then-wife and invited dozens of men to rape her over nearly a decade, as well as raping her himself.",
      "publishedAt": "2024-09-17T08:09:28Z",
      "title": "A French man admits in court to drugging his wife so that he and dozens of men could rape her",
      "url": "https://apnews.com/943400b83a8b111bcd42a0fb23a1cfda",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df712611345d4437bf7940e6778f18b2/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "DEER PARK, Texas (AP) — A towering flame gradually subsided Tuesday morning in the aftermath of a massive pipeline explosion after a vehicle drove through a fence and struck an above-ground valve, officials said.",
      "publishedAt": "2024-09-16T16:09:12Z",
      "title": "Massive pipeline fire burning near Houston began after a vehicle struck a valve, officials say",
      "url": "https://apnews.com/659141b9f88ed2b324c36fce2735746f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9aaa86d1a39d49e7b8d6999f0e65d805/1920.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "A key employee who labeled an experimental submersible unsafe prior to its last, fatal voyage was set to testify Tuesday before U.S.",
      "publishedAt": "2024-09-17T05:02:12Z",
      "title": "A key employee who called the Titan unsafe will testify before the Coast Guard",
      "url": "https://apnews.com/3e698a31c32d753b2d34e28900f65bdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90640a96ac354b3abf56a8467c50a02e/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}