{
  "articles": [
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE and JILL COLVIN",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump moved to build out his national security team Tuesday, announcing he is nominating Fox News host and Army veteran Pete Hegseth to serve as his defense secretary and former Director of National Intelligence John Ratcliffe to lead the Central Intelligence Agency.",
      "publishedAt": "2024-11-12T18:51:45Z",
      "title": "Trump builds out national security team with picks of Hegseth for Pentagon, Noem for DHS",
      "url": "https://apnews.com/f51121db5b18814bbab014e872c2a736",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbecbbcc4c35437f8e1432e255795aa9/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG and JILL COLVIN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump on Tuesday said Elon Musk and former GOP presidential candidate Vivek Ramaswamy will lead a new “Department of Government Efficiency\" — which is not, despite the name, a government agency.",
      "publishedAt": "2024-11-13T01:39:40Z",
      "title": "Trump says Musk, Ramaswamy will form outside group to advise White House on government efficiency",
      "url": "https://apnews.com/2f0f76bb6440231f2504b77cb117d988",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/161f5bc8ec22458ba2c2de7257942619/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and ALI SWENSON",
      "description": "ATLANTA (AP) — Local officials are beginning to certify the results of this year’s presidential election in a process that, so far, has been playing out quietly, in stark contrast to the tumultuous certification period four years ago that followed then-President Donald Trump’s loss.",
      "publishedAt": "2024-11-12T20:39:37Z",
      "title": "Certifying this year's presidential results begins quietly, in contrast to the 2020 election",
      "url": "https://apnews.com/c075cdd0128bdc1e420fbfca4e38386e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/658c2631251246db8ae4cd7da720b0b9/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JACK JEFFERY",
      "description": "JERUSALEM (AP) — The United States said Tuesday it would not punish Israel over the dire humanitarian situation in the Gaza Strip.",
      "publishedAt": "2024-11-12T19:25:00Z",
      "title": "Why is only limited aid getting to Palestinians inside Gaza?",
      "url": "https://apnews.com/bcf8489c338a2f33cb4d6f0a4f7138b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e659adf4c55448c9c858feac78ce254/1920.jpeg"
    },
    {
      "author": "DYLAN LOVAN and REBECCA REYNOLDS",
      "description": "LOUISVILLE, Ky. (AP) — At least 11 employees were taken to hospitals after an explosion on Tuesday at a Louisville, Kentucky, business that produces natural color for foods and drinks.The explosion, which happened around 3 p.m.",
      "publishedAt": "2024-11-12T21:17:17Z",
      "title": "Explosion at Kentucky business injures 11 workers, shatters windows in surrounding neighborhood",
      "url": "https://apnews.com/770141a93fc06e1a99028f5a9889d51d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/108f3b67bb564d50ae25bdf28054845c/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "BOISE, Idaho (AP) — Four women suing over Idaho's strict abortion bans told a judge Tuesday how excitement over their pregnancies turned to grief and fear after they learned their fetuses were not likely to survive to birth — and how they had to leave the state to get abortions amid fears that pregnancy complications would put their own health in danger.",
      "publishedAt": "2024-11-12T23:58:57Z",
      "title": "Women suing over Idaho's abortion ban describe dangerous pregnancies, becoming 'medical refugees'",
      "url": "https://apnews.com/162d5d1926d60d9521461ba9a4bc5c28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3521103f7b844f03b8e42d5aad138504/2948.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "BAKU, Azerbaijan (AP) — Even as Earth sets new heat records, humanity this year is pumping 330 million tons (300 million metric tons) more carbon dioxide into the air by burning fossil fuels than it did last year.",
      "publishedAt": "2024-11-13T00:03:40Z",
      "title": "Amid Earth's heat records, scientists report another bump upward in annual carbon emissions",
      "url": "https://apnews.com/df9814ea7e39dd214fd3042f299af914",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6a9f98c978346b188773fc0b963b009/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and DAVID BILLER",
      "description": "LIMA, Peru (AP) — If things had gone differently last week, U.S. President Joe Biden could have arrived at the Asia-Pacific Economic Cooperation forum in Peru on Thursday projecting confidence and pledging his successor’s cooperation with eager Latin American partners.",
      "publishedAt": "2024-11-13T04:20:48Z",
      "title": "A diminished Biden heads to APEC summit in Peru, overshadowed by China's Xi",
      "url": "https://apnews.com/504111bb2837ceae5fba1543a70d48c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/039e247bb86740748ddd8ce6012250d7/1920.jpeg"
    },
    {
      "author": "EVENS SANON and MEGAN JANETSKY",
      "description": "PORT-AU-PRINCE, Haiti (AP) — The Federal Aviation Administration prohibited U.S. airlines from flying to Haiti for 30 days after gangs shot three planes and the United Nations also Tuesday temporarily suspended flights to Port-au-Prince, limiting humanitarian aid coming into the country.",
      "publishedAt": "2024-11-12T15:26:27Z",
      "title": "US prohibits airlines from flying to Haiti and UN suspends flights after planes were shot by gangs",
      "url": "https://apnews.com/90dc8d26bc58eb9b214385ac10f315a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f97a7927c4e4769baca7beec279b9b0/1920.jpeg"
    },
    {
      "author": "ELSIE CHEN and DAKE KANG",
      "description": "CHANGCHUN, China (AP) — Crouch through the small metal door and walk down the dark tunnel, and even before you step into the abandoned air raid shelter, the air reverberates with pounding techno beats.",
      "publishedAt": "2024-11-13T02:15:14Z",
      "title": "Welcome to China’s underground raves, from street techno to quotes from Chairman Mao",
      "url": "https://apnews.com/2edde8f402a604e3671900c5109b6fcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cdf83c14a8a488b87b9775ea024746b/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}