{
  "articles": [
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "RAFAH, Gaza Strip (AP) — The head of a Gaza City hospital that treated some of the Palestinians wounded in the bloodshed surrounding an aid convoy said Friday that more than 80% had been struck by gunfire, suggesting there was heavy shooting by Israeli troops.",
      "publishedAt": "2024-03-01T14:55:46Z",
      "title": "Gaza doctor says gunfire accounted for 80% of the wounds at his hospital from aid convoy bloodshed",
      "url": "https://apnews.com/86ab114fc0036d0b4fa5a69ed21964c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3add734fc214229b2fadfbe6f35e008/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden on Friday announced that the U.S. will begin airdropping sorely needed humanitarian assistance into Gaza amid the ongoing Israel-Hamas war.",
      "publishedAt": "2024-03-01T21:19:49Z",
      "title": "US to airdrop humanitarian aid into Gaza — how it can help and why it's so complicated",
      "url": "https://apnews.com/9e6cfb3a2c7d909ca2a8a2abd25793ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc184b3dca124710ac180945681f585e/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and KATIE MARIE DAVIES",
      "description": "Under a heavy police presence, thousands of people bade farewell Friday to opposition leader Alexei Navalny at his funeral in Moscow after his still-unexplained death two weeks ago in an Arctic penal colony.",
      "publishedAt": "2024-03-01T05:02:54Z",
      "title": "Putin foe Alexei Navalny is buried in Moscow as thousands attend under a heavy police presence",
      "url": "https://apnews.com/9263c4d0688b883fa9f853f5d0310e45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6e50624b52844b39f848b857634752a/1920.jpeg"
    },
    {
      "author": "SEAN MURPHY and JIM VERTUNO",
      "description": "STINNETT, Texas (AP) — Wildfires may have destroyed as many as 500 structures in the Texas Panhandle, Republican Gov. Greg Abbott said Friday, describing how the largest blaze in state history scorched everything in its path, leaving ashes in its wake.",
      "publishedAt": "2024-03-01T05:12:37Z",
      "title": "Gov. Abbott says Texas wildfires may have destroyed up to 500 structures",
      "url": "https://apnews.com/fa792a7ad71808c0ca8ec758941e68c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2facf96e51644588f7d5b696503424c/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — The recent ruling in Alabama that frozen embryos are legally considered children created a political firestorm after the decision halted treatment for many couples seeking to have families through fertility treatments.",
      "publishedAt": "2024-03-01T15:36:22Z",
      "title": "Alabama IVF ruling highlights importance of state supreme court races in this year's US elections",
      "url": "https://apnews.com/ea94bdadb79806885ec34d538b008655",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/deaa3df221cc4364a767a82bde00e7cd/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "A federal appeals court in Washington has ordered a new sentence for a retired Air Force officer who stormed the U.S.",
      "publishedAt": "2024-03-01T18:31:09Z",
      "title": "Appeals court ruling that vacates Capitol rioter's sentence could impact dozens of Jan. 6 cases",
      "url": "https://apnews.com/e08abd6d451d954ec3573c9ff515a30e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af2d0079f90449e1bfb1a6c44f54c68a/3000.jpeg"
    },
    {
      "author": "BETH J. HARPAZ",
      "description": "NEW YORK (AP) — Iris Apfel, a textile expert, interior designer and fashion celebrity known for her eccentric style, has died. She was 102. Her death was confirmed by her commercial agent, Lori Sale, who called Apfel “extraordinary.” No cause of death was given.",
      "publishedAt": "2024-03-02T01:53:25Z",
      "title": "Iris Apfel, fashion icon known for her eye-catching style, dies at 102",
      "url": "https://apnews.com/d215e0f7fdc44a05848dbd7aa93fe05c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2937c83c84ec49e18b22d5899974ad05/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN and MATTHEW BROWN",
      "description": "BRIGHTON, Colo. (AP) — A Colorado paramedic was sentenced Friday to five years in prison in a rare prosecution of medical responders following the death of Elijah McClain, a Black man whose name became part of the rallying cries for social justice that swept the U.S.",
      "publishedAt": "2024-03-01T05:31:56Z",
      "title": "Paramedic gets 5 years in prison for Elijah McClain’s death in rare case against medical responders",
      "url": "https://apnews.com/2583a1039ed5a6c3cd5adc986efbe1d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4547d359906348a49e6cee3a68a5b3b0/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and ALANNA DURKIN RICHER",
      "description": "ATLANTA (AP) — The judge overseeing the Georgia election interference case against Donald Trump indicated Friday that he would rule within the next two weeks on whether to remove Fulton County District Attorney Fani Willis from the case over a romantic relationship with a top prosecutor.",
      "publishedAt": "2024-03-01T05:06:42Z",
      "title": "Judge indicates he will rule within next 2 weeks on bid to remove Fani Willis from Trump case",
      "url": "https://apnews.com/0ede9d18ae072efd6d71f38ea4705beb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a34f136093a490b956696221490f302/3000.jpeg"
    },
    {
      "author": "MICHAEL HILL",
      "description": "FORT EDWARD, N.Y. (AP) — A man who fatally shot a 20-year-old woman after the SUV she was riding in mistakenly drove into his rural driveway in upstate New York was sentenced Friday to more than 25 years to life in prison.",
      "publishedAt": "2024-03-01T06:07:00Z",
      "title": "New York man who killed a woman after a wrong turn in his driveway gets 25 years to life",
      "url": "https://apnews.com/cdca1723c6ba7afb89102a1e1aaa3fe0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/830578fee015410e8855d4d7fa0324bd/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}