{
  "articles": [
    {
      "author": "BASSEM MROUE, JOHNSON LAI, and JUSTIN SPIKE",
      "description": "BEIRUT (AP) — Walkie-talkies and solar equipment exploded in Beirut and multiple parts of Lebanon on Wednesday in an apparent second wave of attacks targeting electronic devices a day after hundreds of pagers used by Hezbollah blew up, state media and Hezbollah officials said.",
      "publishedAt": "2024-09-18T06:12:52Z",
      "title": "Lebanon is rocked by a second wave of exploding devices as Israel declares a 'new phase' of war",
      "url": "https://apnews.com/ce6af3c2e6de0a0dddfae48634278288",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20c75a480c0e4e7ca396583f6940474d/1920.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — In a duplex in a quiet neighborhood of the Hungarian capital is the headquarters of a company that is linked to the manufacture of the pagers that exploded in Lebanon and Syria as part of an apparent Israeli operation against the Hezbollah militant group.",
      "publishedAt": "2024-09-18T17:12:45Z",
      "title": "A Hungarian company is linked to the pagers that exploded in Lebanon and Syria",
      "url": "https://apnews.com/9ebcca9cc9e5a7d7bc9bc74ddcf23fb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96ad23969eca4930bdf0ed12c8613c17/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "Presidential candidates typically focus much of their travel on battleground states, but Donald Trump on Wednesday is taking his message to a somewhat unlikely place: suburban New York.",
      "publishedAt": "2024-09-18T11:09:21Z",
      "title": "Trump and Harris are taking a brief break from campaigning in battleground states",
      "url": "https://apnews.com/367611170a28f470afc537dcefe158ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba6e936e019a446cbac738cba54c59a6/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Having all but tamed inflation, the Federal Reserve is poised to do something Wednesday it hasn’t done in more than four years: Cut its benchmark interest rate, a step that should lead to lower borrowing costs for consumers and businesses just weeks before the presidential election.",
      "publishedAt": "2024-09-18T04:01:28Z",
      "title": "Federal Reserve is set to cut interest rates for the first time in 4 years",
      "url": "https://apnews.com/0283bc6f92e9f9920094b78d821df227",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/884e8e87120444f586ee0b31c339c5d6/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, LARRY NEUMEISTER and ANDREW DALTON",
      "description": "NEW YORK (AP) — Lawyers for Sean “Diddy Combs asked a judge Wednesday to let him await his sex trafficking trial at his luxury home on an island near Miami Beach, rather than a grim federal jail in Brooklyn.",
      "publishedAt": "2024-09-18T04:04:57Z",
      "title": "Sean 'Diddy' Combs makes a fresh bid for bail in his sex trafficking and conspiracy case",
      "url": "https://apnews.com/b60db3252403f2bfbe24c54b34f0cfdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92945613fb964d8b9982347efb97704f/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Navy is taking lessons from its combat in the Red Sea over the past year and what Ukraine has done to hold off the Russians in the Black Sea to help U.S.",
      "publishedAt": "2024-09-18T14:24:42Z",
      "title": "Lessons from Red Sea and Ukraine's Black Sea fight help prep Navy for possible conflict with China",
      "url": "https://apnews.com/327713f10c4556467c14c0989f2a4e97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f024beaa381a4061b9aca396e9c8248a/3000.jpeg"
    },
    {
      "author": "LEA SKENE and ALANNA DURKIN RICHER",
      "description": "BALTIMORE (AP) — The owner and manager of the cargo ship that caused the Baltimore bridge collapse recklessly cut corners and ignored known electrical problems on the vessel, the Justice Department alleged Wednesday in a lawsuit seeking to recover more than $100 million that the government spent to clear the underwater debris and reopen the city’s port.",
      "publishedAt": "2024-09-18T14:31:40Z",
      "title": "Ship owner cut corners on repairs before deadly Baltimore bridge collapse, US says in $100M lawsuit",
      "url": "https://apnews.com/5a7b3d6a3f7ea04828bf7801df07a34e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f00d441639e44b52939a6634cac21183/1920.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — Scientists have discovered the longest pair of jets streaming from a black hole in a distant galaxy.",
      "publishedAt": "2024-09-18T15:04:00Z",
      "title": "Scientists detect longest pair of jets streaming from a supermassive black hole",
      "url": "https://apnews.com/66f40762fa2bb367aa7c91f1dbc24ee5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09364b87db0c437dbb4f0a3e86d20c1e/2088.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Tupperware Brands, the company that revolutionized food storage decades ago, has filed for Chapter 11 bankruptcy protection.Orlando, Florida-based Tupperware plans to continue operating during the bankruptcy proceedings and will seek court approval for a sale, “in order to protect its iconic brand,” the company said just before midnight on Tuesday.",
      "publishedAt": "2024-09-18T11:09:05Z",
      "title": "Iconic Tupperware Brands seeks Chapter 11 bankruptcy",
      "url": "https://apnews.com/0482859639d2f2260fbd6325529034e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddfae181fd814d3692a4f49bfdc26ebe/2000.jpeg"
    },
    {
      "author": "JOSH DUBOW",
      "description": "Inside the Numbers dives into NFL statistics, streaks and trends each week. For more Inside the Numbers, head here.___The worst start to a season for passing offenses in years hasn't hit the New Orleans Saints.",
      "publishedAt": "2024-09-18T10:00:20Z",
      "title": "Derek Carr and the Saints buck the NFL trend of early season offensive struggles",
      "url": "https://apnews.com/1b83c91eeea0880a98a95c0fed3599a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aee6787c270140d5951ee01c3a959a0a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}