{
  "articles": [
    {
      "author": "HEATHER HOLLINGSWORTH and NICK INGRAM",
      "description": "KANSAS CITY, Mo. (AP) — One person was killed and up to 15 were injured in a shooting at the end of the parade to celebrate the Super Bowl win by the Kansas City Chiefs, sending terrified fans running for cover and marring yet another high-profile public event with gun violence.",
      "publishedAt": "2024-02-14T11:00:41Z",
      "title": "1 dead and up to 15 injured after shooting near Kansas City Chiefs parade, police chief says",
      "url": "https://apnews.com/c373ac902961ded32bccc11c67afbd37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef7dffd5f6e24a939382bb5acc7e1473/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, SAMY MAGDY and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — International efforts to broker a cease-fire between Israel and Hamas suffered a setback on Wednesday as Israel reportedly recalled its negotiating team and Prime Minister Benjamin Netanyahu accused Hamas of hobbling the high-stakes negotiations by sticking to “delusional” demands.",
      "publishedAt": "2024-02-14T10:42:02Z",
      "title": "Gaza cease-fire and hostage release talks appear to stall as Netanyahu and Hamas trade blame",
      "url": "https://apnews.com/15eb8cbd5f15d52928711193081fe9c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5c59515c7e94a4293c4d812da929659/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG, ZEKE MILLER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — President Joe Biden avoided criminal charges around his handling of classified documents in part because of his answers during a lengthy interview with the special counsel investigating him.",
      "publishedAt": "2024-02-14T22:26:21Z",
      "title": "Biden allies, rivals both want transcript of his special counsel interview released. It could happen",
      "url": "https://apnews.com/ab454b5ce925b782202fe30875a2b5b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b31694770534f0eb3b74327ef2c9ae7/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Republican Speaker Mike Johnson said Wednesday the U.S. House will not feel “rushed” to pass the $95.3 billion foreign aid package for Ukraine, Israel and other allies, signaling a further stall over sending military hardware and munitions Kyiv badly needs to fight Russia.",
      "publishedAt": "2024-02-14T16:33:27Z",
      "title": "GOP Speaker Johnson says House won't be 'rushed' to approve aid for Ukraine as $95B package stalls",
      "url": "https://apnews.com/06889e166a5417d5b4bc7795813e37ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25acfb42e5dd4bcab45d08a47d66e30e/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukraine's military said Wednesday it used high-tech naval drones to sink a Russian landing ship in the Black Sea, a report that has not been confirmed by Russian authorities.The Caesar Kunikov amphibious ship sank 4 kilometers (2.5 miles) off Alupka, a city on the southern edge of the Crimean Peninsula that Moscow annexed in 2014, Ukraine’s General Staff said.",
      "publishedAt": "2024-02-14T08:30:04Z",
      "title": "Ukrainian military says it sank a Russian landing ship in the Black Sea",
      "url": "https://apnews.com/8d2a78ab1f1b2a9b04ec8c421782417d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/153bb25192784af3a8bf44bb6d626026/2400.jpeg"
    },
    {
      "author": "MATTHEW LEE, KEVIN FREKING and ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The Republican head of the House Intelligence Committee urged the Biden administration on Wednesday to declassify information about what he called a serious national security threat.",
      "publishedAt": "2024-02-14T17:56:48Z",
      "title": "House Intelligence Committee chair warns of a serious national security threat",
      "url": "https://apnews.com/6a4497fc2d74ebbe2ab3483ba43e09b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0cd5bcf521b496b9b91ddb60ea17591/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A Georgia judge who is deciding whether to toss Fulton County District Attorney Fani Willis off of the state's election interference case against former President Donald Trump has set a hearing for Thursday that is expected to focus on details of Willis' personal relationship with a special prosecutor she hired.",
      "publishedAt": "2024-02-14T05:05:10Z",
      "title": "Judge to consider whether to remove District Attorney Fani Willis from Georgia election case",
      "url": "https://apnews.com/33644e0501987d5a98938377f209cb47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a640ea6f351b4e10b3df7cbfd17c46d1/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — Black History Month, often a time to recognize the contributions of African Americans in U.S. history, was marked in the nation’s capital this week with a focus on present divides and the November election when Black turnout will be integral to the outcome.",
      "publishedAt": "2024-02-14T17:36:37Z",
      "title": "Democrats and Republicans hold Black History Month celebrations with an eye on November's election",
      "url": "https://apnews.com/962d8e230f9a75c98c58c9161c5614df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bac31c942e60446db1588cbdadcc115e/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — Cybersecurity experts are warning that hospitals around the country are at risk for attacks like the one that is crippling operations at a premier Midwestern children's hospital, and that the U.S.",
      "publishedAt": "2024-02-14T16:45:23Z",
      "title": "Cyberattacks on hospitals are likely to increase, putting lives at risk, experts warn",
      "url": "https://apnews.com/eb6f9528198b4e3c2a5e82f74c4cb7e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c698ef6f7254445c962c72e8ce3031bf/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "NEW YORK (AP) — A few months ago, Derek Carrier started seeing someone and became infatuated.He experienced a “ton” of romantic feelings but he also knew it was an illusion.That's because his girlfriend was generated by artificial intelligence.",
      "publishedAt": "2024-02-14T05:11:57Z",
      "title": "Artificial intelligence, real emotion. People are seeking a romantic connection with the perfect bot",
      "url": "https://apnews.com/113df1b9ed069ed56162793b50f3a9fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/089914121c3045ecaeb300c2e9d2eac7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}