{
  "articles": [
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "President Donald Trump has his first piece of immigration legislation to sign: the Laken Riley Act, which requires unauthorized immigrants accused of theft and violent crimes to be detained.",
      "publishedAt": "2025-01-23T07:35:00Z",
      "title": "Live updates: House passes the Laken Riley Act, sending the bill to Trump's desk",
      "url": "https://apnews.com/live/trump-presidency-day-4-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/05b7237/2147483647/strip/true/crop/1024x576+0+54/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2F94%2F4a5dfd3643eb8eb956f4cf43dc97%2Fap25022004628818.jpg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "The Senate has confirmed Donald Trump's pick to lead the CIA. John Ratcliffe was director of national intelligence during Trump's first term and is the first person to have held that position and the top post at the CIA, the nation's premier spy agency. The Senate's confirmation Thursday gives Trump the second member of his new Cabinet. Ratcliffe told senators at a hearing last week that the CIA must do better when it comes to using technology like artificial intelligence to confront adversaries including Russia and China.",
      "publishedAt": "2025-01-23T19:26:35Z",
      "title": "Senate confirms John Ratcliffe to lead the CIA",
      "url": "https://apnews.com/article/cia-director-ratcliffe-trump-cabinet-national-intelligence-a73ceaef42086d46a728979189a9826b",
      "urlToImage": "https://dims.apnews.com/dims4/default/c9a02a5/2147483647/strip/true/crop/4985x2804+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F0e%2F2cf9f50b0afeb75a76fe8fb11c62%2F9c524dbd9bd842a688cc208c9cbe0d97"
    },
    {
      "author": "JENNIFER McDERMOTT",
      "description": "As promised, President Donald Trump began reversing the country’s energy policies on his first day in office with a spate of orders largely favoring oil, gas and coal. But there is one renewable energy that gets a boost: geothermal. Energy experts say that makes sense — the heat of the Earth can make electricity 24/7. Many people working in geothermal come from oil and gas and the industries use a lot of the same technology for drilling wells. Trump strongly supports and gets support from the oil and gas industries. And there’s bipartisan support in Congress for geothermal.",
      "publishedAt": "2025-01-23T14:31:43Z",
      "title": "With Trump pivot back to pro-oil and gas policies, one renewable energy finds favor",
      "url": "https://apnews.com/article/trump-renewable-wind-solar-geothermal-434334a2e312583ddd20a201afc8150c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2b89b3e/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F5d%2F3d1bc3a480136a20d405d7e62425%2Fbe5a1807f27444deaac31152b64ee878"
    },
    {
      "author": "GEOFF MULVIHILL, CARLA K. JOHNSON",
      "description": "One of President Donald Trump's executive orders offers a new federal government definition of the sexes that could have a major impact on transgender people. It calls for the government to define sex as only male or female. It rejects that people can transition between genders, or that they can be nonbinary or intersex. It declares that sexes are defined at conception based on reproductive cells — large ones in females or small ones in males. That's a problem scientifically, because such cells don't exist at conception. Egg cells don't develop until many weeks later, and sperm cells aren't produced until puberty. Courts could have the final word.",
      "publishedAt": "2025-01-23T16:30:47Z",
      "title": "What to know about Trump's order to define sexes as only male and female",
      "url": "https://apnews.com/article/trump-transgender-passports-prisons-eggs-sperm-da1d1d280658a8c85c57cfec2f30cefb",
      "urlToImage": "https://dims.apnews.com/dims4/default/df623f6/2147483647/strip/true/crop/4084x2297+0+215/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F8a%2F5eae78428b0a2d8009e70addbe6d%2F9543b89ed7344ffbbe7688c823ac2f84"
    },
    {
      "author": "MIKE CATALINI",
      "description": "A federal judge is set to hear the first arguments in a multi-state lawsuit seeking to block President Donald Trump’s executive order ending the constitutional guarantee of birthright citizenship regardless of the parents' immigration status. U.S. District Judge John C. Coughenour scheduled a hearing Thursday to consider the request from Arizona, Illinois, Oregon and Washington. The lawsuit filed in Seattle is one of at least five brought by a total of 22 states and a number of immigrant rights groups across the country.",
      "publishedAt": "2025-01-23T05:06:51Z",
      "title": "A bid to block Trump's cancellation of birthright citizenship is in federal court",
      "url": "https://apnews.com/article/birthright-citizenship-donald-trump-lawsuit-immigration-9ac27b234c854a68a9b9f8c0d6cd8a1c",
      "urlToImage": "https://dims.apnews.com/dims4/default/959bdb0/2147483647/strip/true/crop/5533x3112+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2Fbb%2Fb3cdd69d538b479f719f6a448a0e%2F7d3bfb7c093148b0be7a5ce7384409d9"
    },
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK",
      "description": "Sen. Lisa Murkowski announced that she will vote against confirming Pete Hegseth to lead Pentagon, becoming the first Republican to oppose one of President Donald Trump’s Cabinet picks. The Alaska Republican’s decision Thursday comes ahead of a crucial test vote to advance Hegseth’s nomination toward confirmation.",
      "publishedAt": "2025-01-23T18:36:00Z",
      "title": "Sen. Lisa Murkowski to vote against Hegseth, first Republican to oppose a Trump Cabinet pick",
      "url": "https://apnews.com/article/pete-hegseth-defense-secretary-pentagon-trump-confirmation-79d38a3d821eda7e03789e857b417a7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/36d9ef7/2147483647/strip/true/crop/5418x3048+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fc1%2F96b7ac942c8974577067e341e987%2F97199dc932dc4c6da854a53458ac9e32"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "President Donald Trump is pardoning anti-abortion activists who were convicted in the October 2020 invasion and blockade of a Washington clinic. Lauren Handy was sentenced to nearly five years in prison for leading the blockade by directing activists to link themselves together with locks and chains to block the clinic’s doors. Trump pardoned Handy and her nine co-defendants. The news of the pardons comes ahead of Friday’s annual anti-abortion protest March for Life in Washington, D.C., where the president is expected to address the crowd in a video.",
      "publishedAt": "2025-01-23T21:36:18Z",
      "title": "Trump pardons anti-abortion activists who blockaded clinic entrances",
      "url": "https://apnews.com/article/abortion-trump-executive-order-pardon-817774b21d32a4edf6d39ee43cbc18f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/43fe36e/2147483647/strip/true/crop/7342x4130+0+381/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F1b%2Fcfa1dedf8061f4b076ed84befd39%2F39466c4ccc2a43bc829adeac4b746b77"
    },
    {
      "author": "ZEKE MILLER, JOSH BOAK, JAMEY KEATON",
      "description": "President Donald Trump promised global elites lower taxes if they bring manufacturing to the U.S. and threatened to impose tariffs if they don’t. The president made the remarks Thursday in an address to the World Economic Forum. Trump spoke by video from the White House to the annual summit in Davos, Switzerland, on his third full day in office. He ran through his flurry of executive actions since his swearing-in and claimed that he had a “massive mandate” from the American people to bring change. He laid out a carrot-and-stick approach for private investment in the U.S.",
      "publishedAt": "2025-01-23T16:40:09Z",
      "title": "Trump tells Davos elite to invest in US or face tariffs",
      "url": "https://apnews.com/article/trump-davos-tariffs-taxes-world-economic-forum-85aa42fb7751bedc1643c5a0e465a053",
      "urlToImage": "https://dims.apnews.com/dims4/default/830d42f/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2F83%2F9eeb03f5a099a117f0743780ee57%2F5f2ae90b5a1d4f90ab219609d18a7c4c"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Members of the Sackler family who own OxyContin maker Purdue Pharma, and the company itself, agreed to pay up to $7.4 billion to settle lawsuits over the toll of the powerful prescription painkiller. The deal announced Thursday represents an increase over a previous settlement deal. The earlier one was rejected last year by the U.S. Supreme Court. The court ruled the earlier version improper because it protected members of the wealthy family from civil lawsuits over OxyContin — even though the family members themselves were not in bankruptcy. Besides this deal, there have been about $50 billion in opioid settlements announced in recent years.",
      "publishedAt": "2025-01-23T17:05:49Z",
      "title": "Purdue Pharma, Sackler family members reach new opioid settlement",
      "url": "https://apnews.com/article/purdue-pharma-sackler-settlement-opioid-lawsuits-ea6c89aa9cafc8fdd18fabfad503eeea",
      "urlToImage": "https://dims.apnews.com/dims4/default/41c0b23/2147483647/strip/true/crop/3072x1728+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F8b%2F3160d66a8a4c834866bfe766e3e2%2Fb357a5d072d843c48c3ff00d55bcb2b7"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "The film academy had plenty of surprise nominations Thursday for the 97th Oscars. It's to be expected in one of the more wide-open fields in recent history. Not too long ago, it seemed that people like Angelina Jolie and Nicole Kidman were destined for best actress nominations, while general audience disinterest in the young Donald Trump movie “The Apprentice” might have indicated its awards chances were dead on arrival. But the members of the academy had other things to say. Some snubs include Marianne Jean-Baptiste, Daniel Craig, Jolie, Kidman and Selena Gomez. Those that surprised include Felicity Jones, James Mangold and Monica Barbaro.",
      "publishedAt": "2025-01-23T15:33:51Z",
      "title": "Snubs and surprises from the 2025 Oscar nominations",
      "url": "https://apnews.com/article/oscars-snubs-surprises-2025-c668844cf49576a830fec47baee0be11",
      "urlToImage": "https://dims.apnews.com/dims4/default/e86580d/2147483647/strip/true/crop/3000x1688+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F1f%2Ffe13a6688e279a4764ce2ff0cde1%2F69f0f6d7e09b483c899a2b61082402f5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}