{
  "articles": [
    {
      "author": "MELANIE LIDMAN, SAMY MAGDY",
      "description": "Hamas says it will delay the further release of hostages in the Gaza Strip after accusing Israel of violating a fragile ceasefire that now faces its most serious crisis since it began three weeks ago. Israel and Hamas are in the midst of a six-week ceasefire during which Hamas has committed to freeing dozens of the hostages captured in its Oct. 7, 2023, attack in exchange for nearly 2,000 Palestinian prisoners. Three more Israeli hostages had been scheduled for release on Saturday, in exchange for hundreds of Palestinian prisoners. In a bid to improve relations with the U.S., the Palestinian president has ended a controversial system that paid stipends to the families of Palestinian prisoners, including those convicted of deadly attacks against Israel.",
      "publishedAt": "2025-02-10T16:21:12Z",
      "title": "Hamas says it will delay the release of more hostages, putting Gaza ceasefire at risk",
      "url": "https://apnews.com/article/hamas-hostage-release-delay-ceasefire-violations-76d6fd9162160f9554fec37041342714",
      "urlToImage": "https://dims.apnews.com/dims4/default/41cf47a/2147483647/strip/true/crop/8103x4558+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2Fc0%2F87084198f5c1eefa141aba0503c6%2F29c9558c54b641cea0bae3ce651d1498"
    },
    {
      "author": null,
      "description": "The Hamas announcement that it will delay the next planned release of Israeli hostages from Gaza has threatened a fragile truce that’s seen as having the potential to wind down 16 months of war. It has brought new dismay for Israelis who watched the latest Hamas handover of hostages in growing horror over the weekend as the three emaciated men came into sight. The next handover of hostages had been scheduled for Saturday, and families say time is running out for those still alive. Israel now awaits what comes from a security Cabinet meeting Tuesday morning, moved up after the Hamas announcement.",
      "publishedAt": "2025-02-11T05:16:46Z",
      "title": "A Hamas delay in Gaza's next hostage release brings fear on all sides for ceasefire",
      "url": "https://apnews.com/article/gaza-israel-hamas-palestinians-ceasefire-explainer-war-404137d6c335f3227e0b0d8e94d773bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/e9f008e/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F70%2F10fcd6fabf1b4eec191515df7750%2Ff4412eb1419546d497fbef398b575984"
    },
    {
      "author": null,
      "description": "President Donald Trump says a precarious ceasefire agreement between Israel and Hamas should be canceled if Hamas doesn’t release all the remaining hostages it is holding in Gaza by midday on Saturday, warning if it doesn't happen, \"let hell break out.\"",
      "publishedAt": "2025-02-11T00:46:30Z",
      "title": "Trump warns 'all hell is going to break out' if Gaza hostages are not returned by Hamas",
      "url": "https://apnews.com/video/trump-warns-all-hell-is-going-to-break-out-if-gaza-hostages-are-not-returned-by-hamas-606656865a0349e8bfb6ccb0cccd505e",
      "urlToImage": "https://dims.apnews.com/dims4/default/54fc843/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2Fad%2F0eda2a7e4cdc8cb81256244c3de0%2Ftrumphamas.jpg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "An Israeli army reservist’s dream vacation in Brazil ended abruptly last month over an accusation that he committed war crimes in the Gaza Strip. A pro-Palestinian legal group had convinced a federal judge in Brazil to open a war crimes investigation for his alleged participation in the demolition of civilian homes in Gaza. The group, the Hind Rajab Foundation, has brought dozens of complaints in more than 10 countries, using a legal concept called “universal jurisdiction,” which allows governments to prosecute people for the most serious crimes regardless of where they are allegedly committed. Its campaign has yet to yield any arrests. The Israeli army reservist accused by Hind Rajab fled Brazil and is back in Israel.",
      "publishedAt": "2025-02-11T05:16:05Z",
      "title": "Some Israeli soldiers traveling abroad are targeted for alleged war crimes in Gaza",
      "url": "https://apnews.com/article/gaza-war-israel-palestinians-universal-jurisdiction-f1309c6b407fe157edd6cbd2bad3a8ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/68e9090/2147483647/strip/true/crop/5386x3030+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2Fc1%2Fc637d5f9b9357f77c80f384741ad%2F5a5977f130cc4dc8ae516d7cb629d448"
    },
    {
      "author": "ZEKE MILLER",
      "description": "President Donald Trump will host Jordan’s King Abdullah II at the White House as he escalates pressure on the Arab nation to take in refugees from Gaza as part of his audacious plan to remake the Middle East. Tuesday's visit comes at a perilous moment for the ongoing ceasefire in Gaza, as Hamas has said it is pausing future releases of hostages and as Trump calls for Israel to resume fighting if all those remaining in captivity are not freed by this weekend. Just last week, Trump proposed the U.S. take control of Gaza and turn it into “the Riviera of the Middle East.”",
      "publishedAt": "2025-02-11T05:01:44Z",
      "title": "Trump will host Jordan's King Abdullah II as he escalates pressure on his Gaza resettlement plan",
      "url": "https://apnews.com/article/trump-abdullah-jordan-gaza-hamas-israel-1f3ef249419ce61fc5c0f41412c24cb0",
      "urlToImage": "https://dims.apnews.com/dims4/default/a206cc2/2147483647/strip/true/crop/4805x2703+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F7f%2Fb0bae52840a62f74ea67fcf69e4b%2Ffd1667cc764d47e5a8182c784853386f"
    },
    {
      "author": "KHALIL HAMRA",
      "description": "The long anticipated return home for residents of the Syrian town of Tel Rifaat, displaced since 2014, has collided with a painful reality — scars of war, streets lined with rubble and ruins standing in place of their homes.",
      "publishedAt": "2025-02-10T05:04:06Z",
      "title": "Syrians returning to the town of Tel Rifaat find homes in ruins and underground tunnels",
      "url": "https://apnews.com/article/syria-tel-rifaat-kurds-photos-e2d62f4876886f3e5ea71e985f009db7",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ca139a/2147483647/strip/true/crop/8387x4718+0+437/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F22%2F58a51d0925a3578c09bab5aa83d3%2F73cfaa188d474c5a9f247d41a6aa175e"
    },
    {
      "author": "SEJAL GOVINDARAO, HALLIE GOLDEN",
      "description": "Authorities say one person has been killed and others were injured when a private jet owned by Mötley Crüe singer Vince Neil collided with another jet at the Scottsdale Airport in Arizona. A representative for Neil says the singer was not on the plane. The Federal Aviation Administration says the private jet veered off the runway and crashed into another private jet. Fire officials say of those injured, two were taken to trauma centers and one was in stable condition at a hospital. The collision Monday afternoon comes after three major U.S. aviation disasters in the past two weeks.",
      "publishedAt": "2025-02-10T23:36:31Z",
      "title": "Plane crash at Scottsdale Airport in Arizona kills 1 person, authorities say",
      "url": "https://apnews.com/article/arizona-private-jet-crash-scottsdale-airport-b3d54b61cda17a21c76a994a1b4eaf1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/3569bde/2147483647/strip/true/crop/4200x2363+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2Fed%2F756ad953f015b0b97468bfdf1d89%2F822a77d5926147df83a7a5c22c13cea9"
    },
    {
      "author": "MEG KINNARD",
      "description": "Rep. Nancy Mace of South Carolina is raising allegations against a former fiancé and his business associates. In a nearly hour-long speech on the House floor, Mace accused her ex-fiancé of physically abusing her and recording sex acts with her and others without their consent. She said she also has evidence of him conspiring with business associates in acts of rape and sexual misconduct. The former fiancé, Patrick Bryant, categorically denied all the allegations. Mace said she was speaking out because South Carolina's top prosecutor didn’t take action. South Carolina Attorney General Alan Wilson's office called Mace's comments about the prosecutor’s conduct “categorically false.”",
      "publishedAt": "2025-02-11T02:24:41Z",
      "title": "Rep. Nancy Mace accuses ex-fiancé and associates of misconduct in speech on House floor",
      "url": "https://apnews.com/article/nancy-mace-south-carolina-7d831f415ae00d703e30fa6c701f18de",
      "urlToImage": "https://dims.apnews.com/dims4/default/20b4ee1/2147483647/strip/true/crop/4896x2754+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fc4%2F902606cfbebbb3c1d4790f6d3710%2F4825183fe3a44b7b8422b671de35d5d7"
    },
    {
      "author": "DÁNICA COTO",
      "description": "Dominican officials have been deporting at least 10,000 Haitian immigrants a week under a harsh new policy widely criticized by civil organizations. And the number of alleged human rights violations ranging from unauthorized home raids to racial profiling to deporting breastfeeding mothers and unaccompanied minors is surging, activists say. An AP team traveled recently to the shared border between Haiti and Dominican Republic where migrants recounted what they said are mounting abuses.",
      "publishedAt": "2025-02-11T05:14:30Z",
      "title": "Haitian migrants share harrowing stories of abuse as Dominican Republic ramps up deportations",
      "url": "https://apnews.com/article/deportations-dominican-republic-haiti-abuses-dde6322cd255d9b41a11028863ed900e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a89d3d7/2147483647/strip/true/crop/4368x2457+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2Fc8%2F5953b27df96c8dab511877ce0758%2Fcc541194117b42a1a327a2467e6fdf3e"
    },
    {
      "author": null,
      "description": "European Union chief Ursula von der Leyen vowed that U.S. tariffs on steel and aluminum “will not go unanswered” and will trigger tough countermeasures from the 27-nation bloc. “The EU will act to safeguard its economic interests. We will protect our workers, businesses and consumers,” von der Leyen said Tuesday in reaction to U.S. President Donald Trump’s imposition of tariffs on steel and aluminum the previous day.",
      "publishedAt": "2025-02-11T08:33:15Z",
      "title": "EU vows to retaliate against Trump's tariffs on steel and aluminum",
      "url": "https://apnews.com/article/eu-us-tariffs-trump-trade-war-leyen-0b23d25d30428eb288b79bfda4fa25e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/a31f2af/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F32%2F17af4b714144b954f4b21b7bb076%2Ftrumptariff.jpg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}