{
  "articles": [
    {
      "author": "Rob Gillies",
      "description": "Canadians are set to decide whether to extend the Liberal Party’s decade in power or instead hand control to the Conservatives. They’ll pick either Prime Minister Mark Carney or opposition leader Pierre Poilievre to lead the way forward, but Monday's election is also a referendum of sorts on a non-Canadian: Donald Trump. Until the American president won a second term and began threatening Canada’s economy and sovereignty, even suggesting the country should become the 51st state, the Liberals looked headed for defeat. But Trump’s truculence has infuriated many Canadians and led to a tightening of the race. Whichever candidate becomes prime minister will face big challenges, including a trade war and resetting of Canada's relationship with the United States.",
      "publishedAt": "2025-04-28T04:19:36Z",
      "title": "Canadians are set to vote in an election dominated by Trump's trade war and bluster",
      "url": "https://apnews.com/article/canada-election-trump-carney-poilievre-861f5b00794355b231ee3f218568949b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d78b11/2147483647/strip/true/crop/6385x3592+0+333/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F00%2F485e78f2fab8ccbabe93a7fc54f5%2F8c154e3f704e4f94aefd20066808e277"
    },
    {
      "author": "Suman Naishadham, Joseph Wilson",
      "description": "Power had almost fully returned to Spain early Tuesday morning as many questions remained about what caused one of Europe’s most severe blackouts across Spain and Portugal. By 7:00a.m., Spanish electricity operator Red Eléctrica said that more than 99% of energy demand had been restored. Power had returned to several regions across Spain and Portugal as the nations reeled from the still-unexplained widespread blackout that had turned airports and train stations into campgrounds for stranded travelers. Monday night, many city residents, including in Spain’s capital of Madrid, went to sleep in total darkness.",
      "publishedAt": "2025-04-29T04:12:50Z",
      "title": "Spain’s power supply is almost fully restored after one of Europe’s most severe blackouts",
      "url": "https://apnews.com/article/spain-portugal-power-outage-electicity-533832bb4ceae92eaa68c23dc0b5db18",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2b69e4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F0d%2F7c6318b404bf5694efd7dab4eaa7%2F4cf834a4e743410388b1673caf2db93a"
    },
    {
      "author": null,
      "description": "The Liberal Party has won Canada's federal election, capping a stunning turn in fortunes fed by U.S. President Donald Trump's threats of trade war and to make the country the 51st American state. With this result, the Liberal Party’s leader and current prime minister, Mark Carney, will remain in the job, but he will have to form a new government with a new cabinet.",
      "publishedAt": "2025-04-29T06:56:06Z",
      "title": "What to know about the Canadian election",
      "url": "https://apnews.com/article/canada-election-things-to-know-05feec017e71410250224fc5c4f0a6b6",
      "urlToImage": "https://dims.apnews.com/dims4/default/7487eb0/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2Fbf%2Ff0fc2acf6914a019f628da0d9c25%2F5050c8a1e7c04302b7423d4e9dbd77f8"
    },
    {
      "author": null,
      "description": "A war monitor and an activist group say clashes broke out in the Syrian capital between local gunmen belonging to the minority Druze sect and pro-government fighters. The fighting early Tuesday left at least four people dead. The clashes in the southern suburb of Jaramana broke out after audio circulated on social media of a man attacking Islam’s Prophet Muhammad. The audio was attributed to a Druze cleric, who later denied being involved. The Britain-based Syrian Observatory for Human Rights said at least four people were killed in the clashes while the activist media collective Suwayda 24 said five people were killed and 12 were wounded.",
      "publishedAt": "2025-04-29T08:29:14Z",
      "title": "Clashes between Druze gunmen and pro-government fighters in Syrian capital kill at least 4",
      "url": "https://apnews.com/article/syria-jaramana-druze-islam-prophet-muhammad-23c39cfd03cd78fcf6111313d725217f",
      "urlToImage": "https://dims.apnews.com/dims4/default/198a29e/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F42%2Fd7debad9eb475819c6453fc71e41%2F95ffd6a0ff9f43f484d66d5a59fe8b1d"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Italian cardinal at the heart of the Vatican’s “trial of the century” announced Tuesday he was withdrawing from participating in the upcoming conclave to elect a new pope. Cardinal Angelo Becciu’s status has dominated discussions in the days after Pope Francis’ death amid questions about whether he would participate in the conclave to elect his successor. After his 2020 downfall, Becciu had said he would not participate in any future conclave. But in recent days he had asserted he had a right to enter the Sistine Chapel with other cardinals on May 7. On Tuesday, the 76-year-old Italian issued a statement through his lawyers that said he had “decided to obey” the will of Pope Francis.",
      "publishedAt": "2025-04-29T08:01:27Z",
      "title": "Disgraced Cardinal Becciu formally withdraws from participation in conclave to elect pope",
      "url": "https://apnews.com/article/becciu-cardinal-conclave-withdraws-e2df8c80fcc993ae1e529f2f12000324",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d8ebfc/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F8e%2F64a70310240569ad31aafd0bb0de%2F6dd630a90edc40d6b8c8bf7833fc5086"
    },
    {
      "author": "Will Weissert, Joey Cappelletti",
      "description": "President Donald Trump is holding a rally in Michigan to mark the first 100 days of his second term. The Republican president on Tuesday will be staging his largest public event since returning to the White House in a state that has been especially rocked by his steep trade tariffs and combative attitude toward Canada. Trump is making an afternoon visit to Selfridge Air National Guard Base for an announcement alongside Democratic Michigan Gov. Gretchen Whitmer. Trump is expected to speak at a rally north of Detroit.",
      "publishedAt": "2025-04-29T11:01:34Z",
      "title": "Trump marks first 100 days in office with a Michigan rally",
      "url": "https://apnews.com/article/trump-100-days-michigan-whitmer-2e30695aa185a785cc1037ab74c19a55",
      "urlToImage": "https://dims.apnews.com/dims4/default/c82da01/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F9e%2Fdd314457d13928da3fcb472f5239%2Fda95f8c3c38a4c068973984fcb09793f"
    },
    {
      "author": null,
      "description": "Chinese authorities say 22 people have been killed and 3 injured in a fire at restaurant in the northern city of Liaoyang. The fire broke out at around noon Tuesday, they said. No word was given on the cause of the fire, but images from the scene showed huge flames spurting from the windows and doors of the two- or three-story building. Industrial accidents occur frequently in China, usually due to staff ignoring safety features due to a lack of training or pressure from their superiors. If the fire began in the kitchen, it may be related to the traditional use of large open fires over which iron woks are used to braise dishes.",
      "publishedAt": "2025-04-29T09:30:46Z",
      "title": "Chinese authorities say 22 people killed, 3 injured in restaurant fire in northern city of Liaoyang",
      "url": "https://apnews.com/article/china-liaoning-restaurant-fire-841dbf1043b477a6b86ada2708b2d310",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "John O'connor",
      "description": "Authorities say they believe a crash through an Illinois after-school building that killed three kids and one teenager wasn’t targeted. Police say the car smashed through a building Monday afternoon, injuring several others in the small city outside of Springfield, Illinois. They issued an update Tuesday about the investigation. Chatham Police Department Deputy Chief Scott Tarter says officers responded at about 3:20 p.m. to calls about a vehicle ramming through the building, fatally hitting four people before exiting the other side.",
      "publishedAt": "2025-04-29T11:32:27Z",
      "title": "Authorities believe crash through Illinois after-school building that killed 4 wasn’t targeted",
      "url": "https://apnews.com/article/chatham-illinois-after-school-building-crash-bba11439918ba4324eaf35231e0778c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/9d772fe/2147483647/strip/true/crop/2948x1658+27+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2Ff4%2Fc9de606da94305293dee3290d795%2Fe2c740a1631245eb994139b3aed4a77f"
    },
    {
      "author": "David Rising, Valerie Komor",
      "description": "They’d watched overnight as the bombardments grew closer, and observed through binoculars as the final U.S. Marines piled into a helicopter from the roof of the embassy to be whisked away. So when they heard the telltale squeak of the rubber sandals worn by North Vietnamese and Viet Cong troops from the stairway outside The Associated Press office, the reporters who had stayed behind were not surprised, and braced themselves for possible detention or arrest. But the journalists just kept reporting, and the improbable meeting became part of their iconic reporting on the fall of Saigon, 50 years ago.",
      "publishedAt": "2025-04-29T01:04:09Z",
      "title": "As communist troops streamed into Saigon, a few remaining reporters kept photos and stories flowing",
      "url": "https://apnews.com/article/vietnam-war-anniversary-saigon-final-day-1996f738e1e4f8186897df54cb918491",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf8ff48/2147483647/strip/true/crop/2922x1644+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F67%2F61b2fe9f70d9fc672cfc5c2f0a32%2Ff5b0cf0ec9ef4485876aa66fc09e4117"
    },
    {
      "author": "Aijaz Hussain, Sheikh Saaliq",
      "description": "Authorities in Indian-controlled Kashmir have temporarily shut more than half of tourist resorts in the scenic Himalayan region following a deadly attack on tourists. Officials say the decision to shut 48 of the 87 government authorized resorts was a precautionary safety measure. The decision comes a week after gunmen killed 26 people, most of them Indian tourists, near the resort town of Pahalgam. India has described the massacre as a “terror attack” and accused Pakistan of backing it. Pakistan has denied any connection to the attack. Both sides have since escalated the tensions by exchanging diplomatic and trade sanctions against each other and raising fears of a military conflict.",
      "publishedAt": "2025-04-29T07:48:41Z",
      "title": "Authorities shut dozens of tourist resorts in Indian-controlled Kashmir following a deadly attack",
      "url": "https://apnews.com/article/kashmir-india-pakistan-pahalgam-tourism-3e90fd13c173505f4d75a2027f157925",
      "urlToImage": "https://dims.apnews.com/dims4/default/3db1113/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F04%2F5a593b8072d220f4e0f23d813647%2F5a1a7efea2064a9890e7490a9cc2149d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}