{
  "articles": [
    {
      "author": "SAMYA KULLAB and MSTYSLAV CHERNOV",
      "description": "KOSTIANTYNIVKA, Ukraine (AP) — Victims of a deadly Russian missile attack that struck a busy market in eastern Ukraine were buried Thursday, as Moscow kept up its assault on Ukraine’s grain export infrastructure, hitting a Ukrainian port for the fourth time in five days.",
      "publishedAt": "2023-09-07T08:44:07Z",
      "title": "Funeral held for victims of Russian market attack amid more strikes, as Blinken visits Ukraine",
      "url": "https://apnews.com/bc641d733140585d0e080a09a6e80a1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/074f2f1a7ef04bb887e1958d240cd30a/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden is looking to demonstrate to the world at the Group of 20 summit in India and during a stop in Vietnam that the United States and its like-minded allies are better economic and security partners than China.",
      "publishedAt": "2023-09-07T14:08:45Z",
      "title": "Biden aims to use G20 summit and Vietnam visit to highlight US as trustworthy alternative to China",
      "url": "https://apnews.com/ed35f86a9a15f6fad311755ce3de1fb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48ac7e3662f54fee8b8f17eb0b01d1ce/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING and TARA COPP",
      "description": "WASHINGTON (AP) — Top defense officials are accusing Republican Alabama Sen. Tommy Tuberville of jeopardizing America's national security with his hold on roughly 300 military promotions, raising the stakes in a clash over abortion policy that shows no signs of easing.",
      "publishedAt": "2023-09-07T04:02:08Z",
      "title": "Hundreds of military promotions are on hold as a Republican senator demands end to abortion policy",
      "url": "https://apnews.com/e38d853526de044ac59338d32d7a0e10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a2e4dc50cea4462b5115ee134f0f6d7/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — A judge sentenced “That ’70s Show” star Danny Masterson to 30 years to life in prison Thursday for the rapes of two women two decades ago.",
      "publishedAt": "2023-09-07T04:29:10Z",
      "title": "‘That ’70s Show' actor Danny Masterson gets 30 years to life in prison for rapes of 2 women",
      "url": "https://apnews.com/fd7a10eda44d0e3ddde582d4c7053eb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd170f2b03214c189db28bdaa1d594a9/1220.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "WASHINGTON (AP) — Concern for U.S. democracy amid deep national polarization has prompted the entities supporting 13 presidential libraries dating back to Herbert Hoover to call for a recommitment to the country's bedrock principles, including the rule of law and respecting a diversity of beliefs.",
      "publishedAt": "2023-09-07T10:30:56Z",
      "title": "Presidential centers from Hoover to Bush and Obama unite to warn of fragile state of US democracy",
      "url": "https://apnews.com/5530a89df2c41d58a22961f63fb0e6ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e63a655697a4786b2734c5e699d96d6/3000.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN, ROBERT BUMSTED and ELLIOT SPAGAT",
      "description": "NEW YORK (AP) — Damien, age 5, was giddy with excitement as he left a Manhattan homeless shelter, sometimes running and skipping along the sidewalk accompanied by his wistful mother, a migrant from Ecuador.",
      "publishedAt": "2023-09-07T15:15:39Z",
      "title": "An influx of migrant children tests the preparedness of NYC schools",
      "url": "https://apnews.com/89ca1291432e940e4885befca105f2a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa40fb06e271421e8ac5d0f481ca765b/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "CLEVELAND (AP) — Supreme Court Justice Brett Kavanaugh told a judicial conference on Thursday he hopes there will be “concrete steps soon” to address recent ethics concerns surrounding the court, but he stopped short of addressing calls for justices to institute an official code of conduct.",
      "publishedAt": "2023-09-07T18:45:46Z",
      "title": "Supreme Court Justice Kavanaugh predicts 'concrete steps soon' to address ethics concerns",
      "url": "https://apnews.com/76c1e5474093d17127707535ccdea852",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a74c0ee36b924cafad9e4a1cf93c3ac4/2000.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM",
      "description": "COLUMBUS, Ohio (AP) — Ta’Kiya Young treated her two little boys like kings, dressing them sharply, letting them have too many sweets, cooking them big gourmet meals of T-bone steak with broccoli, cheese and rice.",
      "publishedAt": "2023-09-07T13:37:30Z",
      "title": "Ta’Kiya Young, killed by police in an Ohio parking lot, is mourned along with her unborn child",
      "url": "https://apnews.com/950a81a401d3d4de1221c7455bfdacc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/078329f52da346bfa1bfe0bbf69623d5/1920.jpeg"
    },
    {
      "author": "AUDREY McAVOY and JENNIFER SINCO KELLEHER",
      "description": "KAHULUI, Hawaii (AP) — Richie Olsten has been in Maui's helicopter tour business for a half century, so long he's developed a barometer for the tourism-dependent economy: rental cars parked at the island's airport.",
      "publishedAt": "2023-09-07T17:28:05Z",
      "title": "Maui beckons tourists, and their dollars, to stave off economic disaster after wildfires",
      "url": "https://apnews.com/e6a1032e1faede119a6b6607e41e6364",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b6cece9779049509f0d9beff44c1766/3000.jpeg"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "Google will soon require that political ads using artificial intelligence be accompanied by a prominent disclosure if imagery or sounds have been synthetically altered.AI-generated election ads on YouTube and other Google platforms that alter people or events must include a clear disclaimer located somewhere that users are likely to notice, the company said in an update to its political content policy.",
      "publishedAt": "2023-09-07T12:07:28Z",
      "title": "AI that alters voice and imagery in political ads will require disclosure on Google and YouTube",
      "url": "https://apnews.com/792cbae3e651d31028ae2c64f65f112c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34c2589ef9c3425483477048a969a4b3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}