{
  "articles": [
    {
      "author": "Aamer Madhani",
      "description": "President Donald Trump has offered rare criticism of Vladimir Putin, urging the Russian president to “STOP!” after a deadly barrage of attacks on Kyiv, Ukraine's capital. Trump said in a social media post on Thursday that “I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing. Vladimir, STOP! 5000 soldiers a week are dying.\" Trump also said, “Lets get the Peace Deal DONE!” Russia attacked the city with an hourslong barrage of missiles and drones, killing at least nine people and injuring more than 70. It's deadliest assault there since last July and comes just as peace efforts are coming to a head.",
      "publishedAt": "2025-04-24T12:47:48Z",
      "title": "Trump urges Putin to 'STOP!' after deadly attack on Kyiv",
      "url": "https://apnews.com/article/trump-putin-russia-ukraine-war-kyiv-fb61625d2dee8b1917bb3522e73c2166",
      "urlToImage": "https://dims.apnews.com/dims4/default/d712ec9/2147483647/strip/true/crop/5515x3102+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F70%2F975a7bc27e81de22cc642599de39%2F1c7a6a974865490f9a78641e50ef46a4"
    },
    {
      "author": "Vasilisa Stepanenko, Samya Kullab",
      "description": "Ukraine President Volodymyr Zelenskyy says he is cutting short his official trip to South Africa and returning home after a Russian strike on Kyiv killed at least nine people and injured more than 70. The Russian attack on Kyiv came hours after weeks of peace negotiations appeared to be coming to a head without an agreement in sight. President Donald Trump lashed out at Zelenskyy on Wednesday, accusing him of prolonging the “killing field” by refusing to surrender the Russia-occupied Crimea Peninsula as part of a possible peace deal. Zelenskyy has repeated many times during the more than three-year war that recognizing occupied territory as Russian is a red line for his country.",
      "publishedAt": "2025-04-24T04:29:41Z",
      "title": "Zelenskyy cuts short South African trip after massive Russian strike on Kyiv kills 9",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-strike-913ca4a6b4e624ed50e6c1018576a8ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/af3632e/2147483647/strip/true/crop/7789x4381+0+406/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2Fcb%2Fb8760f75a4790e2e08c15f2334c8%2F8bac50404e304f4188b831bcb2eb4ea0"
    },
    {
      "author": "Ali Swenson",
      "description": "A federal judge has blocked the Trump administration from immediately enacting certain changes to how federal election are run, including adding a proof-of-citizenship requirement to the federal voter registration form. President Donald Trump had called for that and other sweeping changes to U.S. elections in an executive order signed in March. The Republican president argued the U.S. “fails to enforce basic and necessary election protections” that exist in other countries. On Thursday, U.S. District Judge Colleen Kollar-Kotelly sided with voting rights groups and Democrats to grant a preliminary injunction to stop the citizenship requirement from moving forward while the lawsuit plays out. The parties in the case didn't immediately comment on the judge's order.",
      "publishedAt": "2025-04-24T17:42:17Z",
      "title": "Judge blocks parts of Trump’s overhaul of US elections",
      "url": "https://apnews.com/article/trump-elections-executive-order-citizenship-lawsuit-4b683fe2e1106316fdb05621be9b7d0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d712ec9/2147483647/strip/true/crop/5515x3102+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F70%2F975a7bc27e81de22cc642599de39%2F1c7a6a974865490f9a78641e50ef46a4"
    },
    {
      "author": "Mark Sherman",
      "description": "President Donald Trump's administration is asking the Supreme Court to allow enforcement of a ban on transgender people in the military, while legal challenges proceed. The high court filing Thursday follows a brief order from a federal appeals court that kept in place a court order blocking the policy nationwide. Defense Secretary Pete Hegseth issued a policy that presumptively disqualifies transgender people from military service, after the Republican president signed an executive order claiming the sexual identity of transgender service members is harmful to military readiness. A federal judge in Tacoma, Washington, ruled for several transgender military members who challenged the ban, saying their firing would cause lasting damage to their careers and reputations.",
      "publishedAt": "2025-04-24T15:10:52Z",
      "title": "Trump asks Supreme Court to let ban on transgender members of military take effect",
      "url": "https://apnews.com/article/trump-transgender-military-ban-lawsuits-880be4a245f214006cacb294f6c72536",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8ec8d1/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2F79%2F5bf6b2192813ed8b3cb5d90d212f%2F3d9d0d587d6343848e759ae90b09b2d3"
    },
    {
      "author": "Aijaz Hussain, Sheikh Saaliq",
      "description": "Tensions between arch rivals India and Pakistan were high on Thursday as New Delhi mounted a diplomatic offensive against Islamabad, blaming it for a deadly attack that killed 26 people, mostly tourists, in disputed Kashmir. India accused Islamabad of supporting “cross-border terrorism” Wednesday night and imposed diplomatic measures, including downgrading diplomatic ties, suspending of a key water-sharing treaty and closing the main land border crossing with Pakistan. Pakistan has denied the accusation and a previously unknown militant group calling itself Kashmir Resistance has claimed responsibility for the attack. Islamabad said it would respond to India’s actions on Thursday and convene its National Security Committee, which is composed of senior civil and military officials.",
      "publishedAt": "2025-04-24T06:05:46Z",
      "title": "India mounts diplomatic offensive against Pakistan after attack in disputed Kashmir",
      "url": "https://apnews.com/article/kashmir-india-pakistan-pahalgam-tourist-attack-tensions-242c7a600a51793f5484e4f620402fdd",
      "urlToImage": "https://dims.apnews.com/dims4/default/2834f42/2147483647/strip/true/crop/8131x4574+0+424/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2F1e%2F36ea903410639f17e9954cef70a7%2F353d5b1a37d244639789fac38bd81634"
    },
    {
      "author": "Colleen Barry",
      "description": "The public viewing of Pope Francis' casket is scheduled to resume Thursday, a day after it began with numbers that were so strong that the Vatican said it would consider longer hours to meet the demand. On Wednesday, more than 19,000 people paid their respects in the first 8 1/2 hours of the viewing at St. Peter's Basilica. Mourners from across the globe made a slow, shuffling procession up the main aisle of the basilica to pay their last respects to Francis, the Argentine pontiff remembered for creating a climate of inclusion.",
      "publishedAt": "2025-04-24T04:06:43Z",
      "title": "Thousands pay final respects to Pope Francis as Vatican considers extending public viewing",
      "url": "https://apnews.com/article/pope-lying-state-last-respects-st-peters-ce6e39bd0976a91512af4988546dd80b",
      "urlToImage": "https://dims.apnews.com/dims4/default/130512c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2F82%2Fce6570bb4634e8ec71ae5e475cb4%2F2f7a200fc5e84bf08def80d5c4e47603"
    },
    {
      "author": "Josh Boak, Amelia Thomson-DeVeaux",
      "description": "A new AP-NORC poll suggests Americans’ trust in President Donald Trump to bolster the U.S. economy appears to be faltering. The survey finds many people fear the country is being steered into a recession and Trump’s broad and haphazardly enforced tariffs will cause prices to rise. Roughly half of U.S. adults say the Republican president’s trade policies will increase prices “a lot” and another 3 in 10 think prices could rise “somewhat.” About half of Americans are “extremely” or “very” concerned about the possibility of the U.S. economy going into a recession in the next few months. While skepticism about tariffs is increasing modestly, that doesn’t mean the public is automatically rejecting Trump’s approach to trade.",
      "publishedAt": "2025-04-24T11:02:49Z",
      "title": "Most Americans expect higher prices as a result of Trump's tariffs",
      "url": "https://apnews.com/article/trump-economy-poll-tariffs-inflation-prices-recession-1d320115e8801e4970bd5cccf2742fc4",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fdab10/2147483647/strip/true/crop/6995x3935+0+364/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F1d%2Fbb2417330e49534ec1208f783806%2F3ae782e22ba8450fa67fbdff77bd331c"
    },
    {
      "author": "Sophia Tareen",
      "description": "The suburban Chicago man who admitted to a 2022 mass shooting at an Independence Day parade that left seven people dead has been sentenced to life in prison without the possibility of parole. He was sentenced Thursday after relatives of those killed in the shooting and other survivors gave emotional testimony. Robert E. Crimo III pleaded guilty to the shooting last month just moments before his trial was to begin. Authorities say the 24-year-old fired into crowds at the parade from a rooftop. Dozens were wounded in the shooting in a suburb north of Chicago.",
      "publishedAt": "2025-04-24T04:01:29Z",
      "title": "Illinois man gets life sentence after admitting to deadly shooting at 2022 July Fourth parade",
      "url": "https://apnews.com/article/shooting-illinois-court-sentence-crime-july-4th-99b795a6fc7442dd3b28fa744dd8491b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dce224/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F3c%2F0b884c62f1f53b124e2577d8e601%2Faf66861a194e44a6a9de6257a64f2755"
    },
    {
      "author": "Adithi Ramakrishnan",
      "description": "A new carnivorous caterpillar that wears the remains of its prey has been dubbed the bone collector. The odd insect is only found on the Hawaiian island of Oahu. It creeps along spiderwebs, feeding on trapped insects and decorating its silk case with body parts. The caterpillar's origins go back at least 6 million years — more ancient than the Hawaiian islands themselves. A host of caterpillars native to Hawaii use silk glands to spin protective cases, but the bone collector is the first to use ant heads and fly wings. The new research was published Thursday in the journal Science.",
      "publishedAt": "2025-04-24T18:01:02Z",
      "title": "A carnivorous 'bone collector' caterpillar dresses in the remains of its prey",
      "url": "https://apnews.com/article/carnivorous-caterpillar-hawaii-bone-collector-624af97c9a1c65fc3a2eac85cf19b4f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e411ef/2147483647/strip/true/crop/4108x2311+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F9e%2F6dc86bdd81162154528e56ef3530%2Fb26692f4ebd241a88285048fd1ee7a40"
    },
    {
      "author": "Rob Maaddi",
      "description": "Cam Ward, Travis Hunter, Abdul Carter and 12 other prospects will walk the red carpet at Lambeau Field before going backstage at the NFL draft theater to wait for their name to be called Thursday night. All their hard work paid off. It’s time to enjoy the moment before joining their new teams to work even harder. Ward shouldn’t wait long. The Tennessee Titans are poised to select the Miami quarterback with the No. 1 overall pick. Hunter, the two-way star and Heisman Trophy winner from Colorado, is likely heading to the Cleveland Browns with the second pick. Carter, a premier edge rusher out of Penn State, is a favorite to go third to the New York Giants.",
      "publishedAt": "2025-04-24T10:00:06Z",
      "title": "Long wait is over for Cam Ward, Travis Hunter and other draft prospects about to join the NFL",
      "url": "https://apnews.com/article/nfl-draft-ward-hunter-sanders-carter-2e75c01a7e24a6467041e393bc72bde6",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b9b6a6/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F76%2F523b561516bfe0a6510d4e3ca3c3%2Ff7906f6e1d0f49078f4c1ede072af496"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}