{
  "articles": [
    {
      "author": "Samya Kullab, Hanna Arhirova",
      "description": "A senior Ukrainian officials says an exchange of prisoners between Russia and Ukraine from their more than three-year war is underway. The official said the swap was ongoing Friday morning and had not yet finished. He who spoke on condition of anonymity because he was not authorized to speak publicly. Moscow did not immediately confirm the exchange was underway. Ukraine and Russia agreed to the exchange of 1,000 prisoners from each side a week ago in Turkey in their first direct peace talks since the early weeks of Moscow’s 2022 invasion of its neighbor. That meeting lasted only two hours and brought no breakthrough in international diplomatic efforts to stop the fighting.",
      "publishedAt": "2025-05-23T10:32:46Z",
      "title": "Ukrainian official says major prisoner swap with Russia is underway",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-prisoner-swap-8b745966e2f9a484d80ed89fb70d5648",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e8698a/2147483647/strip/true/crop/3811x2144+0+119/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F9c%2Ffbd6560b58bb196ad2d4291a20e0%2F5f8a75af4c0541488debe56ffb388b6d"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump on Friday threatened to put a 25% tariff on Apple products unless iPhones are manufactured in the United States. The threat delivered over social media could dramatically increase the price of iPhones, potentially hurting sales and the profits of one of America’s leading technology companies. The company now joins Amazon, Walmart and other major companies as being in the White House’s crosshairs as they try to respond to the uncertainty and inflationary pressures unleashed by the import taxes being imposed by Trump.",
      "publishedAt": "2025-05-23T11:39:48Z",
      "title": "Trump threatens 25% import tax on Apple unless iPhones are made in the US",
      "url": "https://apnews.com/article/trump-tariff-apple-iphone-tax-170021e8fad22878d0183b5d48971087",
      "urlToImage": "https://dims.apnews.com/dims4/default/060d102/2147483647/strip/true/crop/5383x3028+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2F4a%2F263e817a39437ebb480885f4b629%2F2b51e19e1e9649db8f993672e49ba853"
    },
    {
      "author": "Will Weissert, Alan Suderman",
      "description": "President Donald Trump has hosted top investors for one of his cryptocurrency projects at his luxury golf course in Northern Virginia. By one measure, the dinner marked the ascendance of an industry that has been eager to establish its influence. Once a crypto skeptic, Trump has become a big fan and a powerful player. However, even some pro-Trump crypto enthusiasts fear that the president’s involvement is undermining their credibility. Trump’s family business is profiting from the sale of the $TRUMP meme coin, raising concerns about how investors can buy access to the president.",
      "publishedAt": "2025-05-22T05:11:27Z",
      "title": "Trump hosts dinner for $TRUMP meme coin investors, raising ethical concerns",
      "url": "https://apnews.com/article/trump-crypto-projects-industry-scam-memecoin-0e2d7ca5170bf594d44a391884ec52b3",
      "urlToImage": "https://dims.apnews.com/dims4/default/cd04744/2147483647/strip/true/crop/4791x2695+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2Fea%2Fd6681bf9319ff1379673c80a4796%2F6d5780fbf38347448e9b7114b230d36a"
    },
    {
      "author": "Huizhong Wu",
      "description": "The Chinese government says the Trump administration’s move to ban international students from Harvard will harm America’s international standing. Foreign Ministry spokesperson Mao Ning said Friday that China opposes the politicization of educational cooperation. Chinese students accounted for 1,203 of Harvard's 6,703 international students in 2024. In Hong Kong, a top university looked to capitalize on the uncertainty by promising to take affected students in. The Hong Kong University of Science and Technology said it would provide unconditional offers to international students already at Harvard and those who have been admitted.",
      "publishedAt": "2025-05-23T09:43:50Z",
      "title": "China criticizes US ban on Harvard's international students",
      "url": "https://apnews.com/article/china-harvard-trump-international-students-dc443b16ebbd4cd099dec1f974c57691",
      "urlToImage": "https://dims.apnews.com/dims4/default/2b6bca0/2147483647/strip/true/crop/2523x1419+0+131/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2F27%2F1fccf4fe98fbb173125e26d52b49%2F240058cfe6634c5b9dc3ac923eb09621"
    },
    {
      "author": "Jon Gambrell, Giada Zampano",
      "description": "Iran and the United States are preparing for a fifth round of negotiations over Tehran’s rapidly advancing nuclear program, with enrichment emerging as the key issue. U.S. officials up to President Donald Trump insist Iran cannot continue to enrich uranium at all in any deal that could see sanctions lifted on Tehran’s struggling economy. Iran’s Foreign Minister Abbas Araghchi early Friday insisted that no enrichment would mean “we do NOT have a deal.” While authorities haven't said where in Rome the talks Friday are taking place, an earlier round was held at the Omani Embassy in Italy's capital. Oman is mediating the negotiations.",
      "publishedAt": "2025-05-23T05:10:57Z",
      "title": "Iran and US resuming nuclear talks with uranium enrichment a key issue",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-rome-witkoff-araghchi-799a6604cdb2ddfe59c36acbbe69619f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a7f7e47/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Fa4%2Ff1707f8a7e3d223b76cfacd73381%2Fedcf1e7846e147f79a993e8cc0dfb103"
    },
    {
      "author": "Tia Goldenberg",
      "description": "The two people shot and killed outside a Jewish museum in Washington were young staffers at the Israeli Embassy who were soon to be engaged. The suspect shouted “Free Palestine” as he was being arrested. Israel identified the victims as Sarah Milgrim and Yaron Lischinsky without giving their ages. They were leaving a young diplomats event at the Capital Jewish Museum that was meant to “foster unity and celebrate Jewish heritage” when they were killed on Wednesday. Israel’s ambassador to the U.S said that Lischinsky had bought an engagement ring and was just days away from proposing to Milgrim on a planned trip to Jerusalem.",
      "publishedAt": "2025-05-22T13:05:04Z",
      "title": "Who were the Israeli Embassy staffers shot dead days before getting engaged?",
      "url": "https://apnews.com/article/israeli-embassy-victims-washington-shooting-couple-engagement-efbe6ba65306a314a782d388ce3fba65",
      "urlToImage": "https://dims.apnews.com/dims4/default/da4c0d2/2147483647/strip/true/crop/4978x2800+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fcc%2F5bdaed1d804db5909e96dfc5de40%2Fcd2aae6b61bd47ff9f2fa55fc74d8333"
    },
    {
      "author": "Thomas Adamson",
      "description": "A decade after robbers stormed Kim Kardashian’s luxury residence and tied her up at gunpoint, a Paris court will decide on Friday the verdict in one of the most audacious celebrity heists in modern French history. Nine men and a woman stand accused of carrying out — or aiding — the crime during the 2016 Paris Fashion Week, when masked men dressed as police entered Kardashian’s Paris home, bound her with zip-ties and vanished with $6 million in jewels. At the heart of the trial is Aomar Aït Khedache, a veteran of Paris’ criminal underworld. Prosecutors have asked for a 10-year sentence. The loot was never found.",
      "publishedAt": "2025-05-23T05:13:18Z",
      "title": "A Paris court will deliver the verdict in Kim Kardashian jewelry heist trial",
      "url": "https://apnews.com/article/kim-kardashian-heist-verdict-ff574b4b9427f7908ab32e3ee0008fef",
      "urlToImage": "https://dims.apnews.com/dims4/default/26f4165/2147483647/strip/true/crop/2459x1383+0+128/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Fb1%2F10de45c3306bdf907f9376fd0731%2F853d254a40444d6b8125068877046e1c"
    },
    {
      "author": "Wafaa Shurafa",
      "description": "At least 23 people were killed by Israeli strikes across Gaza overnight as Israel pressed ahead with its military offensive and let in minimal aid to the strip. Ten people were killed by strikes in the southern city of Khan Younis, four in the central town of Deir al-Balah and nine in the Jabaliya refugee camp in the north. Israel is facing mounting international criticism for its latest offensive and pressure to let aid into Gaza amid a catastrophic humanitarian crisis. The strip has been under an Israeli blockade for nearly three months, according to the United Nations. Experts have warned that many of Gaza’s 2 million residents are at high risk of famine.",
      "publishedAt": "2025-05-23T10:15:20Z",
      "title": "At least 23 people killed by Israeli strikes in Gaza as Israel lets minimal aid in",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-23-2025-ca90ad92d081bb639d75e02625d975c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/64e9426/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F00%2F85f0462e1835cf137db3ff641e0b%2F31e676c9c721483e946920dba2fdd33a"
    },
    {
      "author": "Hyung-Jin Kim, Kim Tong-hyung",
      "description": "North Korea has begun steps to arrest and investigate those responsible for a failed launch of its second naval destroyer this week. The North Korean statement Friday came after leader Kim Jong Un expressed fury over the incident that he said was caused by “criminal” negligence. North Korea earlier said the 5,000-ton-class warship was damaged during a launching event on Wednesday. Satellite imagery on the site show the vessel lying on its side, with most of its hull submerged and draped in covers. North Korea said Friday that investigations have found the severity of damage to the warship is “not serious.”",
      "publishedAt": "2025-05-23T01:57:46Z",
      "title": "North Korean leader furious over failed destroyer launch, vows to arrest those responsible",
      "url": "https://apnews.com/article/north-korea-destroyer-launch-kim-b9ffd2578a8751096cc861069af7decb",
      "urlToImage": "https://dims.apnews.com/dims4/default/7b164b2/2147483647/strip/true/crop/1984x1116+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F5b%2F514704c541a894a8c11dd86ef40d%2F14d7f92e34de4100bb3732522c986ecc"
    },
    {
      "author": "Julie Watson",
      "description": "A small plane crashed into a San Diego neighborhood, setting about 15 homes on fire as well as vehicles, and forcing evacuations along several blocks. Fire Department Assistant Chief Dan Eddy says: “We have jet fuel all over the place\" in the Murphy Canyon neighborhood. It was not known if there were any deaths or injuries. Eddy says it was very foggy at the time the private plane crashed. The Federal Aviation Administration says the Cessna 550 aircraft crashed near the Montgomery-Gibbs Executive Airport. The FAA says the number of people on board is unknown at this time. The plane can carry six to eight people.",
      "publishedAt": "2025-05-22T12:37:03Z",
      "title": "Small plane crashes into San Diego neighborhood",
      "url": "https://apnews.com/article/plane-crash-san-diego-5e465454fc0282a81adafc1bfdc142a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/647bc90/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F0b%2F7bdffc37e014e363f736ece73c65%2F96ebe7f0769b4a258f0820267b51aad8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}