{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "RAFAH, Gaza Strip (AP) — Israeli strikes across Gaza killed at least 18 people overnight into Sunday, according to medics and witnesses, as the United States said it would veto another draft U.N. cease-fire resolution.",
      "publishedAt": "2024-02-18T08:19:52Z",
      "title": "Israel strikes across Gaza as US says it will block another cease-fire resolution at the UN",
      "url": "https://apnews.com/380f901e8c2f52d537d0aa9f9bf0a6bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/095dfc525c00407abae1cade85c60615/3000.jpeg"
    },
    {
      "author": "MIKE CORDER and JULIA FRANKEL",
      "description": "THE HAGUE, Netherlands (AP) — The United Nations' highest court opens historic hearings Monday into the legality of Israel's 57-year occupation of lands sought for a Palestinian state, plunging the 15 international judges back into the heart of the decades-long Israeli-Palestinian conflict.",
      "publishedAt": "2024-02-18T05:07:41Z",
      "title": "Top UN court to hold hearings on legality of the Israeli occupation of Palestinian-claimed lands",
      "url": "https://apnews.com/8e194a5d96bc6a2264a0bb3de8576210",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32db803a35dc495eab7ca900eb84d369/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Over 400 people were detained in Russia while paying tribute to opposition leader Alexei Navalny, who died at a remote Arctic penal colony, a prominent rights group reported Sunday.",
      "publishedAt": "2024-02-18T09:30:59Z",
      "title": "Over 400 detained in Russia as country mourns the death of Alexei Navalny, Putin's fiercest foe",
      "url": "https://apnews.com/d0121f49840ee1cd6fbf94f6d7249e1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40f196b03454466cb66133db0e898415/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and JILL COLVIN",
      "description": "WATERFORD TOWNSHIP, Mich. (AP) — Former President Donald Trump railed against the judge who slapped him with a $355 million fine in his New York civil fraud trial and went after the long list of prosecutors with cases against him as he campaigned in Michigan Saturday night while facing penalties that, with interest, could exceed half-a-billion dollars.",
      "publishedAt": "2024-02-18T02:18:21Z",
      "title": "Trump rails against New York fraud ruling as he faces fines that could exceed half-a-billion dollars",
      "url": "https://apnews.com/f264eac7cbba97c4e83919642d42bc97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5cd5a1988234f14ac97add8342c54f4/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — A Houston megachurch was set to have a special service on Sunday, a week after a woman opened fire in one of its hallways before being gunned down by security officers.",
      "publishedAt": "2024-02-18T05:04:42Z",
      "title": "Houston megachurch to have service of 'healing and restoration' a week after deadly shooting",
      "url": "https://apnews.com/23fcb12563d39f9b9d421ef9677a8f81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/537675e1c830497a9fabd73510ed8a53/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — A bipartisan delegation of U.S. senators made an official visit to Hungary's capital Sunday and called on the nationalist government to immediately approve Sweden's request to join NATO.",
      "publishedAt": "2024-02-18T07:45:35Z",
      "title": "Hungary's government declines offer to meet US senators seeking approval for Sweden's NATO bid",
      "url": "https://apnews.com/f4972b78c0f1f8d6a905058c8bc250ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec8fe613b0814cc1a37d84ebd6d31dbd/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Since Jimmy Carter entered hospice care at his home in south Georgia one year ago, the former U.S.",
      "publishedAt": "2024-02-18T05:08:37Z",
      "title": "A year after Jimmy Carter entered hospice care, advocates hope his endurance drives awareness",
      "url": "https://apnews.com/c93498575e806f1a1d83714cf8e5c0b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc1bd05406684f55ba738b5d61213dce/3000.jpeg"
    },
    {
      "author": null,
      "description": "MUNICH (AP) — A Republican opponent of new U.S. funding for Ukraine argued at an international security conference Sunday that the package stuck in Congress wouldn't “fundamentally change the reality” on the ground and that Russia has an incentive to negotiate peace.",
      "publishedAt": "2024-02-18T11:48:55Z",
      "title": "Republican opponent of US aid to Ukraine brings his case to an international conference",
      "url": "https://apnews.com/25545e9b3cd51066eaa904af1927b9de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97060bbccdca46b3983dc824f9314d4e/3000.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "People had been coming to Ziggy Marley and his family for years with ideas about how to turn reggae icon Bob Marley’s life into a movie. But it never felt quite right, until a few years ago when they decided to be the instigators.",
      "publishedAt": "2024-02-18T16:02:21Z",
      "title": "How Ziggy Marley helped bring the authenticity to ‘Bob Marley: One Love’",
      "url": "https://apnews.com/c9b393c5d480a5c5f84e4ffd7f07b5a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/948d3c5bfcee478db8db679ff630802b/3000.jpeg"
    },
    {
      "author": "JENNA FRYER",
      "description": "DAYTONA BEACH, Fla. (AP) — NASCAR has postponed the season-opening Daytona 500 until Monday because of two days of rain at Daytona International Speedway.The race had been scheduled for Sunday afternoon, although the weather forecast put that in doubt all week.",
      "publishedAt": "2024-02-18T14:48:07Z",
      "title": "Rain pushes Daytona 500 to Monday in first outright postponement since 2012",
      "url": "https://apnews.com/c6b85bbe1d8fb1efd09f22703ae89ca1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36293e8a770a4347b800efb3824f741c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}