{
  "articles": [
    {
      "author": null,
      "description": "Hope of finding survivors of the catastrophic flooding in Texas is dimming a day after the death toll surpassed 100. But crews have kept up the search for people missing in the aftermath. The search efforts benefited Tuesday from improving weather. The storms that battered the Hill Country for the past four days began to lighten up, although isolated pockets of heavy rain were still possible. Texas Gov. Greg Abbott planned to make another visit Tuesday to Camp Mystic, the century-old all-girls Christian summer camp where at least 27 campers and counselors died during the flash floods. Officials said Monday that 10 campers and one counselor have still not been found.",
      "publishedAt": "2025-07-08T13:47:10Z",
      "title": "Hope of finding Texas flood survivors dims",
      "url": "https://apnews.com/article/texas-floods-victims-camp-mystic-death-toll-ea38edadc7e965fb2c76c0ec46245a82",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d5e2e5/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F78%2Fab3d1af58f2972024068586a9c36%2F61c12c6423834405bb5b62d7ae742361"
    },
    {
      "author": null,
      "description": "Texas inspectors approved Camp Mystic’s emergency plan just two days before devastating floods killed over 27 people, mostly children, at the Texas summer camp. Records released Tuesday show the camp met state regulations for disaster procedures, but details of the plan remain unclear. On July 4, torrential rain caused the Guadalupe River to rise rapidly, overwhelming the camp. Survivors clung to trees as cabins and tents were swept away. Despite warnings and nearby camps evacuating, Camp Mystic did not relocate its 557 campers and 100 staff. Questions remain about the camp’s preparedness and response during the disaster.",
      "publishedAt": "2025-07-08T23:50:51Z",
      "title": "Texas inspectors approved Camp Mystic’s disaster plan 2 days before deadly flood, records show",
      "url": "https://apnews.com/article/camp-mystic-floods-state-inspection-ef17d51dc7868fa9cc5c3076c31ed98a",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a5200f/2147483647/strip/true/crop/8231x4630+0+429/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2F55%2F4005d539e9b05d1eccfeddbe7c96%2F78581767e77d454fbcb729d43cffd7e4"
    },
    {
      "author": null,
      "description": "The last time President Donald Trump rolled out tariffs this high, financial markets quaked, consumer confidence crashed and his popularity plunged. Only three months later, he’s betting this time is different. In his new round of tariffs being announced this week, Trump is essentially tethering the entire world economy to his instinctual belief that import taxes will deliver factory jobs and stronger growth in the U.S., rather than the inflation and slowdown predicted by many economists. There are three possible outcomes. Trump could prove most economic experts wrong and the tariffs could deliver growth as promised. Or he could retreat again on tariffs before their Aug. 1 start. Or he could damage the economy.",
      "publishedAt": "2025-07-08T20:07:47Z",
      "title": "Trump bets on a different reaction to new tariffs",
      "url": "https://apnews.com/article/trump-tariffs-economy-trade-tax-404840988e58dbfd491afe00f2e605f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/d64f996/2147483647/strip/true/crop/3571x2009+0+190/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F95%2Fc494ddcdf648fa26b6f20973f54e%2Fe67f12e507384f2dbc954919f0c2d7b1"
    },
    {
      "author": null,
      "description": "President Donald Trump’s decision to send more defensive weapons to Ukraine came after he privately expressed frustration with Pentagon officials for announcing a pause last week in the delivery of some critical weapons to Ukraine. It was a move that Trump felt wasn’t properly coordinated with the White House. That's according to three people familiar with the matter who requested anonymity to discuss the private deliberations. The Pentagon announced that it would hold back delivering to Ukraine some weapons because of what U.S. officials said were concerns that stockpiles were in short supply. Trump later effectively reversed the move. One of the people described Trump as being caught “flat footed” by the announcement.",
      "publishedAt": "2025-07-08T18:51:22Z",
      "title": "Trump caught off guard by Pentagon move to pause Ukraine weapons deliveries",
      "url": "https://apnews.com/article/trump-ukraine-weapons-pentagon-15694071ddb6f7040273e9ef090e84c4",
      "urlToImage": "https://dims.apnews.com/dims4/default/e996eca/2147483647/strip/true/crop/5297x2980+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F90%2F410b1709e7520f1420901364abaa%2F6f2161743bcc4b8bac8c393c836c81bd"
    },
    {
      "author": null,
      "description": "The Israeli military says five soldiers were killed in an attack in northern Gaza, while health officials in the Palestinian territory say 18 people were killed in Israeli strikes. The bloodshed came as Israeli Prime Minister Benjamin Netanyahu was visiting the White House for talks with President Donald Trump about a ceasefire plan to pause the Gaza fighting. While there was no announcement of a breakthrough from that meeting, there were signs of progress toward a deal. The killings of the soldiers could add to the pressure on Netanyahu to strike a deal in Israel, where polls have shown widespread support for ending the war.",
      "publishedAt": "2025-07-08T05:15:21Z",
      "title": "5 Israeli soldiers killed in northern Gaza and 18 Palestinians dead in Israeli strikes",
      "url": "https://apnews.com/article/israel-gaza-hamas-palestinians-war-news-07-08-2025-ec0e95f8988e8624d1d4e051116709f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/bac925d/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F18%2Fc8a8d1291de0c139da2e4eff2e34%2F59bc416ceeac4ebba142c159761692a8"
    },
    {
      "author": null,
      "description": "A day after federal officers and National Guard troops descended on MacArthur Park in Los Angeles, immigrant residents of the surrounding neighborhood were coming to grips with the operation that local officials said seemed designed to sow fear. The Department of Homeland Security wouldn’t say what the purpose of the operation was, why it ended abruptly, or whether anyone had been arrested on Monday. Fernando Rodriguez closed down his variety store near the park after seeing flyers warning of immigration enforcement. “You look Latino, they take you. Even if you show papers, they say they’re fake,” he said. “What they’re doing is evil.”",
      "publishedAt": "2025-07-08T21:28:38Z",
      "title": "Residents still shaken a day after federal authorities march through Los Angeles park",
      "url": "https://apnews.com/article/immigration-raid-los-angeles-california-macarthur-park-0a9cd22fdf287ea3433eb60e85a17817",
      "urlToImage": "https://dims.apnews.com/dims4/default/c98da65/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F72%2Ff542628a98372c286eb0827abab7%2F9c878bc1bf214459a05e13a03adf4706"
    },
    {
      "author": null,
      "description": "Ten inmates escaped from a New Orleans jail almost two months ago, and authorities have captured all but the man with the most violent rap sheet. Derrick Groves crawled through a hole behind a toilet along with nine other inmates in May. Once captured, Groves faces life in prison following convictions last year for second-degree murder. Experts say more than 90% of escapees are recaptured within a year. However, law enforcement believes family or friends have likely helped Groves in a city that has a history of widespread distrust of law enforcement and the criminal justice system.",
      "publishedAt": "2025-07-09T04:06:04Z",
      "title": "Just 1 of 10 inmates who escaped New Orleans jail is still on the run",
      "url": "https://apnews.com/article/new-orleans-jailbreak-derrick-groves-fugitive-escape-0a5e5e2ed88977287ad09252d6463925",
      "urlToImage": "https://dims.apnews.com/dims4/default/6f64583/2147483647/strip/true/crop/7302x4107+0+509/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2Fc6%2F02cf65a07b290e98587dbc2c4c3e%2F7ca18e8656114226b378f26c202d7046"
    },
    {
      "author": null,
      "description": "The State Department is warning U.S. diplomats of attempts to impersonate Secretary of State Marco Rubio and possibly other officials using AI-driven technology. That's according to two senior officials and a cable sent last week to all embassies and consulates. The warning came after the department discovered that an impostor posing as Rubio had tried to reach out to at least three foreign ministers, a U.S. senator and a governor, according to the July 3 cable, which was first reported by The Washington Post. The recipients of the scam messages, which were sent by text, Signal and voice mail, were not identified in the cable. A copy was shared with The Associated Press.",
      "publishedAt": "2025-07-08T15:28:14Z",
      "title": "Impostor uses AI to impersonate Rubio and contact foreign and US officials",
      "url": "https://apnews.com/article/rubio-artificial-intelligence-impersonation-1b3cc78464404b54e63f4eba9dd4f5a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7776359/2147483647/strip/true/crop/5226x2940+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F66%2F860c246a84a239cc0628c7e05223%2Fe9126ff6997c425f962352dfe74ce0a7"
    },
    {
      "author": null,
      "description": "For the first time in almost 20 years, travelers may no longer have to take off their shoes during security screenings at certain U.S. airports. The Transportation Security Administration is looking to abandon the requirement, according to media reports. If implemented, it would put an end to a security screening mandate put in place almost 20 years ago, several years after “shoe bomber” Richard Reid’s attempt to take down a flight from Paris to Miami in late 2001. Travel newsletter Gate Access was first to report that the security screening change is coming, with ABC News citing an internal memo sent to TSA officers last week that states the new policy lets travelers keep their shoes on during screenings at many U.S. airports beginning on Sunday.",
      "publishedAt": "2025-07-08T13:53:49Z",
      "title": "Removing shoes to board a plane make be a thing of the past",
      "url": "https://apnews.com/article/tsa-shoes-security-precheck-bush-real-id-1b9fda716f7a24eddf2e706857f2b788",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3e36e7/2147483647/strip/true/crop/2910x1637+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F37%2F20b58fafee8e898adce49637f02e%2Fb7811b9a845d44959d2fe38d3e29ca42"
    },
    {
      "author": null,
      "description": "Top-seeded Aryna Sabalenka will face Amanda Anisimova in the women's semifinals, and Carlos Alcaraz will take on Taylor Fritz in the men's semifinals. Sabalenka grabbed the last three games Tuesday to overcome 104th-ranked Laura Siegemund 4-6, 6-2, 6-4 at Centre Court. Sabalenka twice trailed by a break in the third set. The 27-year-old Belarusian lost in the semifinals at Wimbledon in 2021 and 2023. The 13th-seeded Anisimova advanced to her first Grand Slam semifinal in six years by beating Anastasia Pavlyuchenkova 6-1, 7-6 (9). Alcaraz easily beat Cam Norrie in straight sets, while Fritz needed four to get past Karen Khachanov.",
      "publishedAt": "2025-07-08T14:58:32Z",
      "title": "Sabalenka vs. Anisimova, Alcaraz vs. Fritz at Wimbledon",
      "url": "https://apnews.com/article/wimbledon-results-7-8-2025-684592c397f91f97ed920d0161463007",
      "urlToImage": "https://dims.apnews.com/dims4/default/e212006/2147483647/strip/true/crop/7981x4489+0+416/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F40%2Fcd48f2e75f664392348b928ef2ef%2Feef835385ced41b8804f9970255a4ae1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}