{
  "articles": [
    {
      "author": "SAMY MAGDY and LEE KEATH",
      "description": "CAIRO (AP) — The United States stepped up pressure Monday for a cease-fire deal in Gaza as the secretary of state said a new proposal had been put to Hamas, whose officials were in Cairo talking to Egyptian mediators.",
      "publishedAt": "2024-04-29T09:10:57Z",
      "title": "Ahead of visit to Israel, US's Blinken presses Hamas to accept new proposal for Gaza cease-fire",
      "url": "https://apnews.com/d9b215f4aa1a745cdada48112d0fe4b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5a68bea213e44bda090e3f3a873b260/1920.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — Israeli officials sound increasingly concerned that the International Criminal Court could issue arrest warrants for the country’s leaders more than six months into the Israel-Hamas war.",
      "publishedAt": "2024-04-29T18:48:50Z",
      "title": "What is the International Criminal Court and why it has Israeli officials worried",
      "url": "https://apnews.com/1f683a6e2e150d91c415eb1d0a19a44d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fba81926024d4df8b3006ea35afa4766/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO, CEDAR ATTANASIO, JAKE OFFENHARTZ and JONATHAN MATTISE",
      "description": "NEW YORK (AP) — As upcoming commencement ceremonies grew closer Tuesday, universities across the U.S. grappled with how to clear out encampments of pro-Palestinian demonstrators, with some continuing negotiations and others turning to force and ultimatums that have resulted in arrests and clashes with police.",
      "publishedAt": "2024-04-30T04:13:28Z",
      "title": "Colleges across US seek to clear protest encampments by force or ultimatum as commencements approach",
      "url": "https://apnews.com/8b0d3a0cedb17f5e892c6ca43bbdf628",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdae8d45be12489dbb488e0709b72a1d/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and COLLEEN LONG",
      "description": "NEW YORK (AP) — The first week of testimony at Donald Trump's hush money trial was the scene-setter for jurors: Manhattan prosecutors portrayed what they say was an illegal scheme to influence the 2016 presidential campaign by burying negative stories.",
      "publishedAt": "2024-04-30T04:02:59Z",
      "title": "Prosecutors at Donald Trump's hush money trial zero in on the details",
      "url": "https://apnews.com/d2f9badee0b28a60d32bc98c0d4e783f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a4e4de5bcea4f2d8b826565090cf0ff/2618.jpeg"
    },
    {
      "author": "ERIK VERDUZCO and PETER SMITH",
      "description": "CHARLOTTE, N.C. (AP) — Four law officers serving a warrant for a felon wanted for possessing a firearm were killed and four other officers were wounded in a shootout Monday at a North Carolina home, police said.",
      "publishedAt": "2024-04-29T18:40:33Z",
      "title": "4 law officers serving warrant are killed, 4 wounded in shootout at North Carolina home, police say",
      "url": "https://apnews.com/42d3e25ec6ec990634c9ac209e0f779a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97b9c21c4c5f4fc784fbd1950eef10bc/1920.jpeg"
    },
    {
      "author": "STEPHANY MATAT",
      "description": "WEST PALM BEACH, Fla. (AP) — Jordan Vassallo is lukewarm about casting her first presidential ballot for President Joe Biden in November. But when the 18-year-old senior at Jupiter High School in Florida thinks about the things she cares about, she says her vote for the Democratic incumbent is an “obvious choice.”",
      "publishedAt": "2024-04-30T04:09:17Z",
      "title": "Florida Democrats hope abortion, marijuana questions will draw young voters despite low enthusiasm",
      "url": "https://apnews.com/cf3a3166a0d9d6c620cf9efea4f30f51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3ce6a937b8440d4a28244354075e13d/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "MEXICO CITY (AP) — A retired Roman Catholic bishop who was famous for trying to mediate between drug cartels in Mexico was located and taken to a hospital after apparently being briefly kidnapped, the Mexican Council of Bishops said Monday.",
      "publishedAt": "2024-04-29T23:35:56Z",
      "title": "Abducted retired Catholic bishop who mediated between cartels in Mexico is located, hospitalized",
      "url": "https://apnews.com/cce5f11c068ee5e5fea9ea63fbcbf2b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9e5bb05e869468e8c29814cf62ef848/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KABUL, Afghanistan (AP) — Around 30 men are crammed into a Kabul classroom, part of the debut student cohort at a Taliban-run institute training tourism and hospitality professionals. It’s a motley crew.",
      "publishedAt": "2024-04-30T04:25:17Z",
      "title": "The Taliban are working to woo tourists to Afghanistan",
      "url": "https://apnews.com/7acb04bb78dd779e763a337790113cec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5938c8bc64974252bf0ce2bc1462787f/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH and GENE JOHNSON",
      "description": "SALEM, Ore. (AP) — Cheng “Charlie” Saephan wore a broad smile and a bright blue sash emblazoned with the words “Iu-Mien USA” as he hoisted an oversized check for $1.3 billion above his head.",
      "publishedAt": "2024-04-30T04:13:43Z",
      "title": "A massive Powerball win draws attention to a little-known immigrant culture in the US",
      "url": "https://apnews.com/92a549defa843f2ed1ef1d4eecff8ed4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7606f66c5b424e1fbe4f0386a465a0f9/3000.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — The U.S. Soccer Federation and its Mexican counterpart dropped their joint bid to host the 2027 Women's World Cup on Monday and said they instead will focus on trying to host the 2031 tournament.",
      "publishedAt": "2024-04-29T22:36:35Z",
      "title": "U.S. and Mexico drop bid to host 2027 World Cup, Brazil and joint German-Dutch-Belgian bids remain",
      "url": "https://apnews.com/e8c58c023c35bc676f37557864a00213",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/198fe95368824075bb588bffcaf2fdbb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}