{
  "articles": [
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said Sunday that 31,000 Ukrainian soldiers have been killed in action in the two years since Russia launched its full-scale invasion.",
      "publishedAt": "2024-02-25T15:56:40Z",
      "title": "31,000 Ukrainian troops killed since the start of Russia's full-scale invasion, Zelenskyy says",
      "url": "https://apnews.com/675f53437aaf56a4d990736e85af57c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34b901b3cb534ce088a3ed2344208d74/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and ABBY SEWELL",
      "description": "TEL AVIV, ISRAEL (AP) — Israel’s defense minister vowed Sunday to step up attacks on Lebanon’s Hezbollah militant group even if a cease-fire is reached with Hamas in the Gaza Strip.Hezbollah, which has been exchanging fire with Israel throughout the war in Gaza, has said it will halt its nearly daily attacks on Israel if a cease-fire is reached in Gaza.",
      "publishedAt": "2024-02-25T22:14:25Z",
      "title": "Israel vows to target Lebanon's Hezbollah even if temporary pause reached with Hamas in Gaza",
      "url": "https://apnews.com/54b7e874169478b6f0a2b821ec07489a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e05b3399707400faa112c521bfed118/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — An Israeli military offensive in Gaza's southernmost city of Rafah could be “delayed somewhat” if a deal is reached for a weekslong cease-fire between Israel and Hamas, Prime Minister Benjamin Netanyahu said Sunday, and claimed that total victory in the territory would come within weeks once the offensive begins.",
      "publishedAt": "2024-02-25T08:31:20Z",
      "title": "Netanyahu says a cease-fire deal would only delay 'somewhat' an Israeli military offensive in Rafah",
      "url": "https://apnews.com/f3e4ea708548689cf8d9d404c3ee94ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96efaaa434c14a8280ed08ea7a1817c7/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Half of all Western military support promised to Ukraine fails to arrive on time, complicating the task of military planners and ultimately costing the lives of soldiers in Russia's war, Ukraine's defense minister said Sunday.",
      "publishedAt": "2024-02-25T12:42:00Z",
      "title": "Delays in promised Western military aid to Ukraine are costing lives, the defense minister says",
      "url": "https://apnews.com/a8909760655d83d2ffc0d67ad2a491ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac902179c6224b58b59b8dc174bcc2b7/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. and Britain struck 18 Houthi targets in Yemen, answering a recent surge in attacks by the Iran-backed militia group on ships in the Red Sea and Gulf of Aden, including a missile strike this past week that set fire to a cargo vessel.",
      "publishedAt": "2024-02-24T09:29:12Z",
      "title": "US and British strikes on Houthi sites in Yemen answer militants’ surge in Red Sea attacks on ships",
      "url": "https://apnews.com/89b3f92ae9dd6279b56d945439010a27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4b2169bb264422b8bb3eaa2c465cb80/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and MEG KINNARD",
      "description": "TROY, Michigan (AP) — Republican presidential candidate Nikki Haley says it's not “the end of our story” despite Donald Trump's easy primary victory in South Carolina, her home state where the onetime governor had long suggested her competitiveness with the former president would show.",
      "publishedAt": "2024-02-25T16:33:53Z",
      "title": "Off to Michigan, Haley is staying in the race despite Trump's easy primary win in South Carolina",
      "url": "https://apnews.com/ee571b2024cb6bba665507dd63c6a730",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3580aad651c4c8b9ebe8c7fcd1d65ae/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Inflation has changed the way many Americans shop. Now, those changes in consumer habits are helping bring down inflation. Fed up with prices that remain about 19%, on average, above where they were before the pandemic, consumers are fighting back.",
      "publishedAt": "2024-02-25T11:00:24Z",
      "title": "Consumers are increasingly pushing back against price increases — and winning",
      "url": "https://apnews.com/999e81e2f869a0151e2ee6bbb63370af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d67f6ce6d7f4e96abe2456c447628cf/3000.jpeg"
    },
    {
      "author": "LEANNE ITALIE",
      "description": "NEW YORK (AP) — Leap year. It's a delight for the calendar and math nerds among us. So how did it all begin and why?Have a look at some of the numbers, history and lore behind the (not quite) every four year phenom that adds a 29th day to February.",
      "publishedAt": "2024-02-25T05:03:13Z",
      "title": "What would happen without a Leap Day? More than you might think",
      "url": "https://apnews.com/c6936d284843ec2722b2eb215159efed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7c5e5ee51eb4bffbf2ef57badc3f179/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — A severe lack of affordable housing has prompted Oregon lawmakers to consider chipping away at a 1970s law that made the state a national leader in leveraging land use policy to prevent suburban sprawl and conserve nature and agriculture.",
      "publishedAt": "2024-02-25T05:01:48Z",
      "title": "A housing shortage is testing Oregon's pioneering land use law. Lawmakers are poised to tweak it",
      "url": "https://apnews.com/d85c2413f169cd02cbf6b15fd9c95329",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a821cb54cb945228cd348dd5b39b0ef/3000.jpeg"
    },
    {
      "author": "CEDAR ATTANASIO",
      "description": "NEW YORK (AP) — New York City’s celebrity owl Flaco died from a traumatic impact, zoologists confirmed a day after he reportedly flew into a building, with further testing planned to determine if the Eurasian eagle-owl may have been sick.",
      "publishedAt": "2024-02-25T17:39:17Z",
      "title": "What killed Flaco the owl? New York zoologists testing for toxins, disease as contributing factors",
      "url": "https://apnews.com/351537e05584f684bcfc101e3af617a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef3b0eb8ac2147948af99b1323afe249/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}