{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JOSEF FEDERMAN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces rescued two hostages early Monday, storming a heavily guarded apartment in a densely packed town in the Gaza Strip as airstrikes carried out to cover the raid killed more than 60 Palestinians, including women and children.",
      "publishedAt": "2024-02-12T02:48:20Z",
      "title": "Israeli forces rescue 2 hostages in dramatic Gaza raid that killed at least 67 Palestinians",
      "url": "https://apnews.com/4ade5edf47711c6b0c13d1380980de2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0dd8df4bec4482996c90e1e609a24d1/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — It was a warm handshake between the unlikeliest of statesmen, conducted under the beaming gaze of U.S. President Jimmy Carter. Sunlight streamed through the trees at Camp David, Maryland, as Egyptian President Anwar Sadat and Israeli Prime Minister Menachem Begin solidified a landmark agreement that has allowed over 40 years of peace between Israel and Egypt.",
      "publishedAt": "2024-02-12T05:52:40Z",
      "title": "Egypt is threatening to void its decades-old peace treaty with Israel. What does that mean?",
      "url": "https://apnews.com/46df917a975ed4c4f88d5de01a8508e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8df9d105a164e8a8d1e1d4991e8d933/2994.jpeg"
    },
    {
      "author": "JUAN LOZANO, ACACIA CORONADO AND JIM VERTUNO",
      "description": "HOUSTON (AP) — The shooter who opened fire at a Texas megachurch on Sunday before being killed by security officers had a history of mental illness and used an AR-style rifle in the attack that also critically injured their 7-year-old son, authorities said Monday.",
      "publishedAt": "2024-02-12T17:34:58Z",
      "title": "Shooter entered Texas megachurch with young son and used AR-style rifle in the attack, police say",
      "url": "https://apnews.com/d3c7011f83c57206dc2348cc33035c97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecd2c0da2e7a495dbdcad06865395dd4/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and ERIC TUCKER",
      "description": "FORT PIERCE, Fla. (AP) — Seeking to turn legal problems into political gain, former President Donald Trump arrived Monday to a crowd of supporters at a federal courthouse in Florida for a closed hearing in the criminal case charging him with mishandling classified documents.",
      "publishedAt": "2024-02-12T14:27:27Z",
      "title": "Trump appears at federal court in Florida for closed hearing in his classified documents case",
      "url": "https://apnews.com/cd3b59e50d33eea942772186111c240e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28c84d158e304bc89fc9fe907110d66f/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Former President Donald Trump is asking the Supreme Court to extend the delay in his election interference trial, saying he is immune from prosecution on charges he plotted to overturn his 2020 election loss.",
      "publishedAt": "2024-02-12T13:21:06Z",
      "title": "Trump asks Supreme Court to put off his election interference trial, claiming immunity",
      "url": "https://apnews.com/60bd61263299a88e48d4005d70b6094f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d072711d824b08b562f6bfcbc4c7fb/3000.jpeg"
    },
    {
      "author": "VANESSA GERA",
      "description": "WARSAW, Poland (AP) — Donald Trump, the front-runner in the U.S. for the Republican Party's nomination this year, says he once warned that he would allow Russia to do whatever it wants to NATO member nations that are “delinquent” in devoting 2% of their gross domestic product to defense.",
      "publishedAt": "2024-02-12T16:16:42Z",
      "title": "How Trump urging Russia to invade 'delinquent' NATO members distorts how the alliance works",
      "url": "https://apnews.com/c1f7de696ff6ca06e4088f49b93122e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62436147b61246d798c6984dc17ff6ff/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Declaring that \"every innocent life lost in Gaza is a tragedy,” President Joe Biden welcomed Jordan’s King Abdullah II to the White House Monday for talks on how to end the months-long war and plan for what comes afterward.",
      "publishedAt": "2024-02-12T05:10:57Z",
      "title": "Biden says \"key elements\" of a Gaza deal are on the table as he meets with Jordan's King Abdullah",
      "url": "https://apnews.com/993c8109fca1c77383e7c27a8136927f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/690e61500bc540d29ab38ad4f4ecae0d/3000.jpeg"
    },
    {
      "author": "TIFFANY STANLEY",
      "description": "For the second year in a row, a religious Super Bowl ad campaign promised viewers that Jesus “gets us.”",
      "publishedAt": "2024-02-12T19:07:50Z",
      "title": "On Super Bowl broadcast, 'He Gets Us' ads featuring Jesus stand out for change-of-pace message",
      "url": "https://apnews.com/4e5fa8372701eae1a95d716a77172280",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b2fe5deae1c490289fca07e75638d9b/3000.jpeg"
    },
    {
      "author": "LAURA UNGAR and AMANDA SEITZ",
      "description": "WASHINGTON (AP) — In Utah, more of Dr. Cara Heuser’s maternal-fetal medicine patients are requesting early ultrasounds, hoping to detect serious problems in time to choose whether to continue the pregnancy or have an abortion.",
      "publishedAt": "2024-02-12T15:57:33Z",
      "title": "Post-Roe v. Wade, more patients rely on early prenatal testing as states toughen abortion laws",
      "url": "https://apnews.com/01e4c591617773efb91d9583be6244c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bdc0b43a85b4462ad2478b4e6537124/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — The casts of “Barbie” and \"Oppenheimer gathered Monday for the annual Academy Award nominees luncheon along with other Oscar hopefuls coming together for photos, hugs and congratulations.",
      "publishedAt": "2024-02-12T17:54:49Z",
      "title": "Oscar nominees for films from 'Oppenheimer' and 'Barbie' to documentary shorts gather for luncheon",
      "url": "https://apnews.com/705f8cf920714c7bc1a15354fd766a23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52c9c61ffd8545538924d9dcc2445fef/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}