{
  "articles": [
    {
      "author": "WILL WEISSERT, LISA MASCARO and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Donald Trump made a victor’s return to Washington on Wednesday, visiting the White House for an Oval Office meeting with President Joe Biden and committing to a smooth transition of power as the president-elect moves quickly to build out his new administration.",
      "publishedAt": "2024-11-13T05:02:28Z",
      "title": "Trump makes a victor's return to Washington and pledges a smooth transition of power",
      "url": "https://apnews.com/24753cdd48514c68a832a6a1c255337c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b35a5cf8e1a4fe49a19d8e27103ae50/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Republican senators are gathering behind closed doors Wednesday to decide who will replace longtime Senate leader Mitch McConnell and lead their new majority next year — a decision that could shape the future of the Senate, and the party, as Donald Trump reclaims the presidency.",
      "publishedAt": "2024-11-13T05:08:41Z",
      "title": "Senate Republicans are gathering behind closed doors to pick a new majority leader",
      "url": "https://apnews.com/c3c1c451a420729136ae641a14d9d5d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0202f384bd334f138154c1ae51bd389b/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump is bringing four advisers from his presidential campaign into his new White House as deputy chiefs of staff, including two longtime aides and the political director who played a key role in his victory.",
      "publishedAt": "2024-11-13T16:50:04Z",
      "title": "Trump names four advisers from campaign to new White House administration",
      "url": "https://apnews.com/0c65537ce9cd79194f1bcf60aad88f92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d23a4791c95491d8c0969bb93d32f3e/2979.jpeg"
    },
    {
      "author": "COLLEEN LONG and JILL COLVIN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump on Tuesday said Elon Musk and former GOP presidential candidate Vivek Ramaswamy will lead a new “Department of Government Efficiency\" — which is not, despite the name, a government agency.",
      "publishedAt": "2024-11-13T01:39:40Z",
      "title": "Trump says Musk, Ramaswamy will form outside group to advise White House on government efficiency",
      "url": "https://apnews.com/2f0f76bb6440231f2504b77cb117d988",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/161f5bc8ec22458ba2c2de7257942619/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Inflation in the United States ticked up in October, driven by costlier rents, used cars and air fares, a sign that price increases might be leveling off after having slowed in September to their lowest pace since 2021.",
      "publishedAt": "2024-11-13T05:01:23Z",
      "title": "US inflation rose slightly last month after 2 years of steady cooling but remained low",
      "url": "https://apnews.com/8ee9d1e7979319fe9ae121c7c8d6d68b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/363ba371e5eb474db3315b8ffc173ebe/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "BEIT EL, West Bank (AP) — As Donald Trump’s victory became apparent in last week's U.S. elections, Jewish West Bank settlement advocates popped bottles of champagne and danced to the Bee Gees at a winery in the heart of the occupied territory, according to a post on Instagram.",
      "publishedAt": "2024-11-13T12:12:36Z",
      "title": "Israel's West Bank settlers hope Trump's return will pave the way for major settlement expansion",
      "url": "https://apnews.com/e1813d86ac1d930c2354db0937abf5f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86461fbb34be4d3e8616ac36bf35dcdf/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — When Zarifa Nawfal’s family arrived in Beirut for her wounded daughter’s surgery, one of the first things she wanted to do was go to the sea. The Mediterranean had been a constant companion at their home in Gaza before the war.",
      "publishedAt": "2024-11-13T05:04:33Z",
      "title": "Children brought from Gaza to heal from war wounds become caught in another war, in Lebanon",
      "url": "https://apnews.com/7ef6100b0f6bea94b1a939676ac09d34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7336e2c97bd84179b4cbbe0b834076e0/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "BERLIN (AP) — German Chancellor Olaf Scholz said Wednesday that he will ask for a vote of confidence on Dec. 16, paving the way for early parliamentary elections in February.",
      "publishedAt": "2024-11-13T12:41:43Z",
      "title": "German Chancellor Olaf Scholz says he'll ask for a vote of confidence in December",
      "url": "https://apnews.com/f3bf4635504f8df49b18f633da5d3d16",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0a4155960734492bc8a7a764dbe12bf/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A man who worked for the U.S. government has been charged with leaking classified information assessing Israel's earlier plans to attack Iran, according to court papers filed Wednesday.",
      "publishedAt": "2024-11-13T13:28:29Z",
      "title": "US government worker charged with leaking classified documents on Israel's plans to strike Iran",
      "url": "https://apnews.com/af303d8e786839e7431b203b3cf40be7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15d0a89efdf9474ea37d6715e6be847a/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — The decline in U.S. drug overdose deaths appears to have continued this year, giving experts hope the nation is seeing sustained improvement in the persistent epidemic. There were about 97,000 overdose deaths in the 12-month period that ended June 30, according to provisional Centers for Disease Control and Prevention data released Wednesday.",
      "publishedAt": "2024-11-13T16:20:49Z",
      "title": "US overdose deaths are down, giving experts hope for an enduring decline",
      "url": "https://apnews.com/5308d7ebba3aaa9abb183e70efa5a196",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/117aa47ac470439c8397b3901377905d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}