{
  "articles": [
    {
      "author": "CHRIS MEGERIAN, JOEY CAPPELLETTI and MICHELLE L. PRICE",
      "description": "GRAND RAPIDS, Mich. (AP) — Kamala Harris insisted it was time to “end the suffering” in the Middle East while Donald Trump visited one of the nation's only Muslim-majority cities on Friday as the dueling presidential contenders fought for a small but pivotal bloc of Arab American voters in swing-state Michigan.",
      "publishedAt": "2024-10-18T04:16:06Z",
      "title": "Harris and Trump seek Arab American votes in Michigan in effort to shore up battleground states",
      "url": "https://apnews.com/6b034753290276bfa96d7caf8f7639bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a154125751304c38a12f3559b0d9eafe/1920.jpeg"
    },
    {
      "author": "GARY D. ROBERTSON",
      "description": "RALEIGH, N.C. (AP) — More North Carolina residents turned out to cast ballots on the first day of early voting this year than in 2020, even as residents from the mountainous western portion of the state continued to recover from the devastating effects of Hurricane Helene.",
      "publishedAt": "2024-10-18T17:06:31Z",
      "title": "North Carolina early voters, still recovering from Helene, exceed 2020 voter turnout",
      "url": "https://apnews.com/77a962259851fd753a9637a96830c2a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6eec4cda22b14116a1f33a0a6c9852c1/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and ABBY SEWELL",
      "description": "JERUSALEM (AP) — Hamas confirmed Friday that its leader, Yahya Sinwar, was killed by Israeli forces in Gaza and reiterated its stance that hostages the militant group took from Israel a year ago will not be released until there is a cease-fire in Gaza and a withdrawal of Israeli troops.",
      "publishedAt": "2024-10-18T11:07:03Z",
      "title": "Israel and Hamas signal resistance to ending Gaza war after Sinwar's death",
      "url": "https://apnews.com/39dde452082d4130556f13f87e700125",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a24f1f88c8a64a02943e10e3f93a93be/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — The killing of Hamas leader Yahya Sinwar by Israeli forces in Gaza this week leaves the Palestinian militant group considering new leadership for the second time in less than three months.",
      "publishedAt": "2024-10-18T19:30:26Z",
      "title": "What's next for Hamas after its leader Yahya Sinwar's death?",
      "url": "https://apnews.com/a1c44df5cdabf0cf6459db9ea6eaa9b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96110c48c640495a861a779ebc2e7c20/3000.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — U.S. stocks closed their latest winning week with more records on Friday.The S&amp;P 500 rose 0.4% to squeak past the all-time high it had set early this week.",
      "publishedAt": "2024-10-18T06:00:45Z",
      "title": "Stock market today: Wall Street sets more records and closes a 6th straight winning week",
      "url": "https://apnews.com/cbcdd41e7ecc8cee33e9cd0e7ad0a612",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15799755c3b84865af77cf17480a0167/2615.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ and STEFANIE DAZIO",
      "description": "SAN FRANCISCO (AP) — A fast-moving fire fed by strong winds burned two homes Friday and damaged several others in a hillside neighborhood in the city of Oakland, where hundreds of people were ordered to evacuate before more than 100 firefighters stopped the progress of the flames, authorities said.",
      "publishedAt": "2024-10-18T15:16:31Z",
      "title": "Crews halt fast-moving brush fire that burned 2 Oakland homes, forced 500 evacuations",
      "url": "https://apnews.com/0bb99ee4a062730bdbf9d50170a30053",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62aed6ce963647edb3451c1548f5a625/1920.jpeg"
    },
    {
      "author": "ANDREA RODRÍGUEZ",
      "description": "HAVANA (AP) — Cuba’s electrical grid went down Friday after one of the island’s major power plants failed, a day after a massive blackout swept across the Caribbean island and with no official estimate for when service will be restored.",
      "publishedAt": "2024-10-18T18:52:25Z",
      "title": "Cuba’s grid goes offline with massive blackout after a major power plant fails",
      "url": "https://apnews.com/4ae305120a99fec17c79e7621e8dac4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbacfef5a24d40b8abfed787fb514b39/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "This year has seen President Vladimir Putin repeatedly brandish the nuclear sword, reminding everyone that Russia has the world’s largest atomic arsenal to try to deter the West from ramping up support for Ukraine.",
      "publishedAt": "2024-10-18T04:06:04Z",
      "title": "Russia flaunts its many doomsday weapons to keep the West from ramping up support for Ukraine",
      "url": "https://apnews.com/bf50d3155369cc0a5f12ef7805bf2340",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d13176ac35b54fd0993118523ade3c1e/3000.jpeg"
    },
    {
      "author": "ISABELLA VOLMERT and MICHELLE R. SMITH",
      "description": "Christian nationalist leaders are telling followers that Vice President Kamala Harris is under the influence of a “Jezebel spirit,” using a term with deeply racist and misogynistic roots that is setting off alarm bells for religious and political scholars.",
      "publishedAt": "2024-10-18T12:04:57Z",
      "title": "What's a 'Jezebel spirit'? Some Christians use the term to paint Kamala Harris with a demonic brush",
      "url": "https://apnews.com/0a513c9e549a57a33f864341556d1b7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0a10fefa6b04a58a22f4b4028644070/3000.jpeg"
    },
    {
      "author": "RICK CALLAHAN",
      "description": "DELPHI, Ind. (AP) — A man charged with killing two teenage girls in a small Indiana community forced them off a hiking trail before cutting their throats, a prosecutor said Friday, telling jurors that the evidence includes an unused bullet and video recorded on the eldest girl’s phone.",
      "publishedAt": "2024-10-18T03:34:38Z",
      "title": "Video and an unused bullet prove man's guilt in Indiana girls' killings, prosecutor says",
      "url": "https://apnews.com/9d9756a1e076edaa2f0694a2b54ab3da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a6eb77835634814a4bfcb55f3f9fe94/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}