{
  "articles": [
    {
      "author": "JULIE WATSON, CHRISTOPHER L. KELLER, CAROLYN THOMPSON and STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — Police have arrested nearly 2,200 people during pro-Palestinian protests at college campuses across the United States in recent weeks, sometimes using riot gear, tactical vehicles and flash-bang devices to clear tent encampments and occupied buildings.",
      "publishedAt": "2024-05-03T04:17:15Z",
      "title": "Nearly 2,200 people have been arrested during pro-Palestinian protests on US college campuses",
      "url": "https://apnews.com/df5f7cf1547a3ca8fb959b992d6ebe1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0366565317a040f5ac3c57d4da004bb6/1920.jpeg"
    },
    {
      "author": "ALLEN G. BREED and JOCELYN GECKER",
      "description": "In a way, the black-and-white Palestinian scarf draped over Hannah Sattler’s shoulders this week and the tie-dyed T-shirts of 1968 are woven from a common thread.Like so many college students across the country protesting the Israel-Hamas war, Sattler feels the historic weight of the anti-Vietnam war demonstrations of the 1960s and 70s.",
      "publishedAt": "2024-05-02T19:26:41Z",
      "title": "Today's campus protests aren't nearly as big or violent as those last century — at least, not yet",
      "url": "https://apnews.com/ff421ce1bee8d85b0a11aa55fb088d6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/029c2924286e4048b16142b05457e0c6/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, PHILIP MARCELO and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — The prosecution's star witness has yet to take the stand in Donald Trump's hush money trial.",
      "publishedAt": "2024-05-03T04:05:51Z",
      "title": "Michael Cohen hasn't taken the stand in Trump's hush money trial. But jurors are hearing his words",
      "url": "https://apnews.com/f4f26333698f3a5ed73943ff805734b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94c12adf3d434188b59835344a3aeb55/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and DREW CALLISTER",
      "description": "CAIRO (AP) — Israel and Hamas appear to be seriously negotiating an end to the war in Gaza and the return of Israeli hostages.",
      "publishedAt": "2024-05-02T20:11:08Z",
      "title": "Here's what's on the table for Israel and Hamas in the latest cease-fire talks",
      "url": "https://apnews.com/7cec005ccd59dbd817ef9614a8611ca4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0770da056ea3427ca48ae1c973e2667a/3000.jpeg"
    },
    {
      "author": "ASTRID SUÁREZ",
      "description": "BOGOTA, Colombia (AP) — Colombia has become the latest Latin American country to announce it will break diplomatic relations with Israel over its military campaign in Gaza, but the repercussions for the South American nation could be broader than for other countries due to longstanding bilateral agreements over security matters.",
      "publishedAt": "2024-05-03T04:08:55Z",
      "title": "Colombia breaks diplomatic ties with Israel but its military relies on key Israeli-built equipment",
      "url": "https://apnews.com/0c04009ccfc6110e20ee358403509500",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/376a6ea9d0054e9b920013dbff7b56cb/2683.jpeg"
    },
    {
      "author": "ANITA SNOW and MORGAN LEE",
      "description": "PHOENIX (AP) — Arizona Gov. Katie Hobbs' signing of the repeal of a Civil War-era ban on nearly all abortions was a stirring occasion for the women working to ensure that the 19th century law remains in the past.",
      "publishedAt": "2024-05-03T05:20:16Z",
      "title": "Arizona governor's signing of abortion law repeal follows political fight by women lawmakers",
      "url": "https://apnews.com/d617843b7616c5c7f8a55424fd52dfa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6be89a129b684b4d8e19c5cd4aeb1092/1920.jpeg"
    },
    {
      "author": "ED WHITE and ISABELLA VOLMERT",
      "description": "ANN ARBOR, Mich. (AP) — With student protests over the Israel-Hamas war disrupting campuses nationwide, several major universities are intent on ensuring that commencement ceremonies — joyous milestones for graduates, their families and friends — go off without a hitch this weekend.",
      "publishedAt": "2024-05-03T04:08:46Z",
      "title": "Universities take steps to prevent pro-Palestinian protest disruptions of graduation ceremonies",
      "url": "https://apnews.com/5934cf1eb3554fe9847246649fb25216",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3ad61043a4a4439988daad802a088b7/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "From its earliest days, the Soviet Union's intelligence services — whether known as the Cheka or by the names of any of its successor agencies like the KGB — kept the government in power by pursuing its opponents no matter where they lived.",
      "publishedAt": "2024-05-03T04:17:31Z",
      "title": "For decades, Moscow has sought to silence its critics abroad",
      "url": "https://apnews.com/87ca5d9c1ebfbdcf517f4b4da2270794",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/639256c9ee8045acacfc74680ec2e1d1/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Ukraine, trade and investment are expected to dominate Chinese leader Xi Jinping’s first trip to Europe in five years, as the Asian giant rebuilds its foreign relations after a prolonged absence during the Covid-19 pandemic.",
      "publishedAt": "2024-05-03T04:02:53Z",
      "title": "As China's Xi Jinping visits Europe, Ukraine, trade and investment are likely to top the agenda",
      "url": "https://apnews.com/470fc6954586e250261781ed76165cf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffa7f30506ac4de6b1133204cde6aa1a/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "CHENGDU, China (AP) — In 2018, the censors who oversee Chinese media issued a directive to the nation's entertainment industry: Don't feature artists with tattoos and those who represent hip-hop or any other subculture.",
      "publishedAt": "2024-05-03T04:40:06Z",
      "title": "As hip-hop grows in China, its performers seek a voice that reflects their lived experiences",
      "url": "https://apnews.com/9b8290afb920328c13a7c09147bca796",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe7132e394984c21acf886d7f521981e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}