{
  "articles": [
    {
      "author": null,
      "description": "LOUISVILLE, Ky. (AP) — Luck struck twice for a Kentucky couple who thought they lost a winning Powerball ticket.The Bowling Green couple found out in November that they had won $50,000 but couldn't find the ticket they had purchased about a week before, the Kentucky Lottery said in a news release.",
      "publishedAt": "2024-03-06T21:33:10Z",
      "title": "Luck strikes twice for Kentucky couple who lost, then found, winning lottery ticket",
      "url": "https://apnews.com/5c09b1c62533aa29354aa64c14c190ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20dfd05c173a43fea17c0f9966fa614d/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "WASHINGTON (AP) — A woman ascends toward the heights of American politics, with the nation's top elected office — the presidency — looming far out of reach. A man at the bottom predicts, unhelpfully: “You'll never make it, sister!”",
      "publishedAt": "2024-03-06T16:30:55Z",
      "title": "Haley's exit from the GOP race pushes off — again — the day Americans could elect a woman president",
      "url": "https://apnews.com/36f6361c31a8216a0aaa4815f57dd51d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71062144ba5f41a99e2d7a54670ea7b3/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MEG KINNARD",
      "description": "NEW YORK (AP) — Nikki Haley suspended her presidential campaign on Wednesday after being soundly defeated across the country on Super Tuesday, leaving Donald Trump as the last remaining major candidate for the 2024 Republican nomination.",
      "publishedAt": "2024-03-06T04:05:41Z",
      "title": "Nikki Haley suspends her campaign and leaves Donald Trump as the last major Republican candidate",
      "url": "https://apnews.com/95ab56b68a8eefbbf04ef90f2f00ef29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2dd1bfff0684a3298c208b645fc3704/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "COLUMBIA, S.C. (AP) — Eight years after Donald Trump outlasted a crowded field of Republican presidential candidates with his pugilistic and sometimes vulgar style, the former reality show star has done it again.",
      "publishedAt": "2024-03-06T17:33:42Z",
      "title": "Trump has become the last Republican standing in the 2024 primary. Here's how he bulldozed the field",
      "url": "https://apnews.com/9736f3b504eef4da5a8ef7f8bbae9dfc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec097d8999424d39906d393f121a6d5f/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and TARA COPP",
      "description": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen's Houthi rebels on a commercial ship in the Gulf of Aden on Wednesday killed three of its crew members and forced survivors to abandon the vessel, the U.S.",
      "publishedAt": "2024-03-06T01:23:36Z",
      "title": "Houthi missile attack kills three crew members in Yemen rebels' first fatal assault on shipping",
      "url": "https://apnews.com/89c5440d9943216a787b39912bd969e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bae43b7b63754676a8668091e6b59462/1280.jpeg"
    },
    {
      "author": "EVENS SANON and BERT WILKINSON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haitian politicians started pursuing new alliances Wednesday, seeking a coalition that could lead the country out of the gang violence that has fueled lawlessness, closed the main airport and prevented embattled Prime Minister Ariel Henry from returning home.",
      "publishedAt": "2024-03-06T15:17:47Z",
      "title": "Politicians seek new alliances to lead Haiti as gangs take over and premier tries to return home",
      "url": "https://apnews.com/da9914daa7530f7fd46684378dceb1c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa345191699c41a2a4a8c91c670bedda/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House passed a $460 billion package of spending bills Wednesday that would keep money flowing to key federal agencies through the remainder of the budget year. The Senate is expected to take up the legislation before a midnight Friday shutdown deadline.",
      "publishedAt": "2024-03-06T17:51:05Z",
      "title": "House passes $460 billion package of spending bills. Senate expected to act before shutdown deadline",
      "url": "https://apnews.com/2533c1a6b6eb25cc63e78f089e27d3a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a64186758ae409f8b0c9fafceed6fff/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A former software engineer at Google has been charged with stealing artificial intelligence trade secrets from the company while secretly working with two companies based in China, the Justice Department said Wednesday.",
      "publishedAt": "2024-03-06T20:56:21Z",
      "title": "Ex-Google engineer charged with stealing AI trade secrets while working with Chinese companies",
      "url": "https://apnews.com/63156ade1e564d15d92adbef91e9c5da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5733e3c8b61f4e8a8e441299d616f81b/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and WAFAA SHURAFA",
      "description": "RAFAH, Gaza Strip (AP) — Efforts to get desperately needed humanitarian aid to war-wracked northern Gaza gained momentum Wednesday with the European Union increasing pressure for the creation of a sea route from Cyprus to Gaza and British Foreign Minister David Cameron saying that Israel’s allies were losing patience.",
      "publishedAt": "2024-03-06T18:31:08Z",
      "title": "Pressure grows on Israel to open more aid routes into Gaza by land and sea as hunger spreads",
      "url": "https://apnews.com/3e4bc85bc4e184312763fc331fbffedb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3524d975bc65473184fa1f8f7c897d76/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — As the U.S. navigates involvement in the wars in Ukraine and Gaza, few Americans want the country to take a more active role in solving the world's problems, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2024-03-06T19:03:55Z",
      "title": "Few Americans want US more involved in current wars in Ukraine and Gaza, AP-NORC poll finds",
      "url": "https://apnews.com/94404b3269a1effc8d94482a36387657",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d2aaebea71b461a89782db6dbac9b5a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}