{
  "articles": [
    {
      "author": "NAJIB JOBAIN and KAREEM CHEHAYEB",
      "description": "RAFAH, Gaza Strip (AP) — Israel has vowed to keep fighting in Gaza until it crushes Hamas after one of the deadliest single battles of the war for its soldiers, even as it faces mounting international calls for a cease-fire and unease on the part of its closest ally, the United States.",
      "publishedAt": "2023-12-14T08:19:51Z",
      "title": "Israel vows to fight on in Gaza despite deadly ambush and rising international pressure",
      "url": "https://apnews.com/a9d904ed51ea5cfa98966c8f203cbc45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d65050aa482f445891c254cdc38ffe54/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The House on Wednesday authorized the impeachment inquiry into President Joe Biden, with every Republican rallying behind the politically charged process despite lingering concerns among some in the party that the investigation has yet to produce evidence of misconduct by the president.",
      "publishedAt": "2023-12-13T05:11:58Z",
      "title": "House approves impeachment inquiry into President Biden as Republicans rally behind investigation",
      "url": "https://apnews.com/94884b322da40ca9315ac5f4e73a3e86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e18396b449b495db58a449f9b3808ca/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Donald Trump’s election interference case in Washington will be put on hold while the former president further pursues his claims that he is immune from prosecution, a judge ruled Wednesday.",
      "publishedAt": "2023-12-13T14:13:06Z",
      "title": "Judge pauses Trump’s 2020 election interference case while he appeals his immunity claim",
      "url": "https://apnews.com/20726ba42ac87cd2f3a3ffc6a2145490",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbcaaedb478f4fc6a21e136f3c14127b/3000.jpeg"
    },
    {
      "author": "HARRIET MORRIS",
      "description": "MOSCOW (AP) — Russian President Vladimir Putin vowed that there would be no peace in Ukraine until his goals are achieved and said those objectives remain unchanged at a year-end news conference.Offering rare detail on Moscow’s operation, Putin dismissed the need for a second wave of mobilization of reservists, saying there are some 617,000 Russian soldiers currently in Ukraine, including around 244,000 troops who were called up to fight alongside professional Russian military forces.",
      "publishedAt": "2023-12-14T07:13:37Z",
      "title": "Putin says there will be no peace in Ukraine until goals are achieved, while offering rare details",
      "url": "https://apnews.com/ef4e88fda50e6ad75b8a1979b95d9fcc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b4c13bfb3d645f7914e97b5160fa22e/3000.jpeg"
    },
    {
      "author": "COURTNEY BONNELL and DAVID McHUGH",
      "description": "LONDON (AP) — Yemen's Houthi rebels have escalated attacks on ships passing through the Red Sea during the Israel-Hamas war, raising concerns about the impact on the flow of oil, grain and consumer goods through a major global trade artery.",
      "publishedAt": "2023-12-14T09:38:18Z",
      "title": "How are Houthi attacks on ships in the Red Sea affecting global trade?",
      "url": "https://apnews.com/f67d941c260528ac40315ecab4c34ca3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a321eb5b6e44476e833231412302b189/2553.jpeg"
    },
    {
      "author": "MEAD GRUVER",
      "description": "CHEYENNE, Wyo. (AP) — A judge in Wyoming will decide as soon as Thursday whether to strike down, affirm or hold a trial over the state's abortion bans, including its first-in-the-nation explicit prohibition on the use of medication to end pregnancy.",
      "publishedAt": "2023-12-14T05:03:38Z",
      "title": "A judge may rule on Wyoming's abortion laws, including the first explicit US ban on abortion pills",
      "url": "https://apnews.com/5077b37523d50ad7d0f6169baefba2af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a9ba32eb0ab4e7cbed22d191d142f8c/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — It's the presidential election no one is really jazzed about. Relatively few Americans are excited about a potential rematch of the 2020 election between President Joe Biden and Donald Trump, although more Republicans would be satisfied to have Trump as their nominee than Democrats would be with Biden as their standard-bearer, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-12-14T05:04:06Z",
      "title": "Few US adults would be satisfied with a possible Biden-Trump rematch in 2024, AP-NORC poll shows",
      "url": "https://apnews.com/440088966619e68dbf89f745788bb372",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d99a9cb587844211a894d6b15a12fb2f/3000.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "RIO DE JANEIRO (AP) — It was considered to be among the world’s most productive partnerships between an Indigenous chief and a Westerner.For five decades, the Amazonian tribal leader and Belgian film director enlisted presidents and royals, even Pope Francis, to improve the lives of Brazil’s Indigenous peoples and protect their lands.",
      "publishedAt": "2023-12-14T05:02:28Z",
      "title": "How the deep friendship between an Amazon chief and Belgian filmmaker devolved into accusations",
      "url": "https://apnews.com/fdb772c66dd2ba335c6effd0f40b15de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a23ce44f7e140079acc5efc41ac86a9/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — Throngs of people in down parkas and boots climbed a hill that overlooks the Forbidden City this week to jostle with others trying to get a shot of the snow-covered roofs of the former imperial palace.",
      "publishedAt": "2023-12-14T09:32:48Z",
      "title": "AP PHOTOS: Crowds bundle up to take snowy photos of Beijing's imperial-era architecture",
      "url": "https://apnews.com/8ef986c4a85826c8a95a89ed8ad0bf27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c4b909afcb04197a687ea338de6cf74/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — M-I-C-K-E-Y will soon belong to you and me.With several asterisks, qualification and caveats, Mickey Mouse in his earliest form will be the leader of the band of characters, films and books that will become public domain as the year turns to 2024.",
      "publishedAt": "2023-12-14T05:02:48Z",
      "title": "Earliest version of Mickey Mouse set to become public domain in 2024, along with Minnie, Tigger",
      "url": "https://apnews.com/1dbfa3982a172334503bc8cf87302b6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88b8c28441194bd1a4ab505a5738af91/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}