{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump's order imposing new tariffs on 68 countries and the European Union starting in seven days has injected a new dose of uncertainty in an already uncertain process. Trump has promised these tariffs will boost the U.S. economy and create jobs, but critics warn they could harm America's global standing and increase inflation. The legality of the tariffs is being questioned in court, with judges expressing skepticism. Major companies have warned of financial impacts, and there are concerns about rising inflation and job losses in manufacturing.",
      "publishedAt": "2025-08-01T01:49:56Z",
      "title": "Trump injects new dose of uncertainty in tariffs as he pushes start date back to Aug. 7",
      "url": "https://apnews.com/article/trump-tariffs-effect-05bc12428163b9f28ef80f952cf9dafd",
      "urlToImage": "https://dims.apnews.com/dims4/default/32c5dc2/2147483647/strip/true/crop/1516x853+0+79/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F97%2F555a6fbb3113ead7aaefd4f423cf%2F0c74853e2f824205b5f9a528fac63f48"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump's new tariff rates of up to 41% on U.S. imports from dozens of countries have drawn expressions of relief from some countries that negotiated a deal or managed to whittle them down from rates announced in April. Others have expressed frustration over running out of time for talks. The new rates are due to take effect on Aug. 7. Trump announced them after hitting his Aug. 1 deadline for striking deals with America's trading partners. Financial markets fell Friday, with South Korea's Kospi dropping 3.4% after the tariff rate for the U.S. ally was set at 15%. The U.S. dollar weakened against the Japanese yen.",
      "publishedAt": "2025-08-01T08:07:05Z",
      "title": "Trump's new tariffs prompt mixed reactions from global trading partners",
      "url": "https://apnews.com/article/trump-tariffs-trade-exports-deadline-reaction-3cdc3ca7c0ef3c45c401df5c6f7d778c",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb03815/2147483647/strip/true/crop/4050x2278+0+211/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Fdd%2F23d787b68f980dab7840a50b7169%2F23f9167f11714ae69baa2dcf2f71d612"
    },
    {
      "author": null,
      "description": "World shares have retreated after President Donald Trump issued a new set of import duties that will apply to dozens of countries as of Aug. 7. U.S. futures fell 0.9% after Trump announced tariff rates of up to 41% for imports from 68 countries and the European Union and a separate increase to 35% for Canada, effective Friday. European shares were down more than 1.5% and the Kospi in South Korea sank nearly 4%. Oil prices also fell. On Thursday, the S&P 500 fell 0.4% while the Dow lost 0.7%. The Nasdaq composite index closed less than 0.1% lower.",
      "publishedAt": "2025-08-01T05:31:50Z",
      "title": "World shares fall after Trump's order imposing new tariffs",
      "url": "https://apnews.com/article/trump-tariffs-asia-wall-street-5bf5640b85f63cf7db292d0aaf26e97a",
      "urlToImage": "https://dims.apnews.com/dims4/default/38c8961/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F96%2Ff7%2F9c4efc260269e89c30fb4ce3bafd%2F444eba4af8134cf384bb1ed640627575"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump’s special envoy Steve Witkoff has visited southern Gaza on Friday during international outrage over starvation, shortages and deadly chaos near aid distribution sites. An official involved with the visit says Witkoff and U.S. Ambassador to Israel Mike Huckabee toured one of Gaza Humanitarian Foundation’s distribution sites in Rafah, Gaza’s southernmost city. All four of the group’s distribution sites are in zones controlled by the Israeli military and have become flashpoints of desperation. Hundreds have been killed by gunfire or trampling. The Israeli military says it has only fired warning shots at people who approach its forces. GHF says its armed contractors have only used pepper spray or fired warning shots.",
      "publishedAt": "2025-08-01T10:52:58Z",
      "title": "US envoy visits distribution site in Gaza as humanitarian crisis worsens",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-08-1-2025-038b7191ca02608f9b7d8236292096f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ef638f/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F66%2Fb74bb38b98e3ad597721c9a10b20%2Ff68b934decb149e4b96ca007d93afad9"
    },
    {
      "author": null,
      "description": "Kyiv is observing a day of mourning after a Russian drone and missile attack killed 31 people, including five children, and injured over 150. The attack on Thursday marked the highest number of child casualties in a single strike on the city since October 2022. The Russian assault destroyed a large part of a nine-story residential building and damaged over 100 other structures. Ukrainian President Volodymyr Zelenskyy has called for stronger sanctions against Russia. Meanwhile, Ukrainian forces are under pressure in the eastern city of Chasiv Yar as Russia pushes to break through defenses.",
      "publishedAt": "2025-08-01T09:13:36Z",
      "title": "Kyiv mourns after a Russian attack that killed 31 people",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-attack-trump-putin-42474bc80c492190ec88861322ff0f84",
      "urlToImage": "https://dims.apnews.com/dims4/default/2867149/2147483647/strip/true/crop/3349x1884+0+175/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2e%2F0d%2F1a0f2c6008c8c4b51e01d996411e%2F136fab7ccc7c4b7e887323065769ace8"
    },
    {
      "author": null,
      "description": "A California judge is extending migrant status protections ended by the Trump administration for more than 60,000 people from Central America and Nepal. The order Thursday by U.S. District Judge Trina Thompson in San Francisco affects 7,000 Nepalese whose Temporary Protected Status designations were scheduled to expire Tuesday. About 51,000 people from Honduras and nearly 3,000 from Nicaragua were scheduled to have their status terminated in September. Homeland Security Secretary Kristi Noem ended the program after determining that conditions in their home countries no longer warranted protections. The National TPS Alliance is challenging the terminations as arbitrary and racist.",
      "publishedAt": "2025-08-01T00:20:05Z",
      "title": "Judge extends TPS for 60,000 from Central America and Nepal",
      "url": "https://apnews.com/article/trump-tps-nepal-honduras-nicaragua-noem-3a9de82ede381c6d969fd5aac13635f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f7b1d4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2F88%2Fb57bad21c9b54b0c266b8287d725%2Fac3a87103ef3441dbda6363bc23c6d4b"
    },
    {
      "author": null,
      "description": "The party of El Salvador President Nayib Bukele has approved constitutional changes to allow indefinite presidential reelection and extend terms to six years. Lawmaker Ana Figueroa from the New Ideas party had made the proposal Thursday night in the Legislative Assembly. The changes also eliminate the second round of presidential voting. Bukele won reelection last year despite a constitutional ban, after a 2021 Supreme Court ruling allowed a second five-year term. Figueroa argued that other officials can seek unlimited reelection. Bukele is popular for his tough stance on street gangs, despite controversies over his administration's methods.",
      "publishedAt": "2025-08-01T02:11:36Z",
      "title": "Bukele's party changes El Salvador constitution in expansion of presidential power",
      "url": "https://apnews.com/article/el-salvador-nayib-bukele-reelection-f9efd1a08d3c9de2f886f7b911b9417d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5eebbde/2147483647/strip/true/crop/5848x3290+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F16%2F2deac9b468b6506043ba3399458f%2Ffad7265ae6854321a8e3ad595c17cc94"
    },
    {
      "author": null,
      "description": "The National Transportation Safety Board will wrap up its public testimony on Friday about the fatal midair crash between an Army helicopter and a commercial jet earlier this year. The crash killed all 67 people on board both aircraft. Board Chairwoman Jennifer Homendy has urged the Federal Aviation Administration to improve safety measures, pointing to ignored warnings. Testimony detailed issues like the Black Hawk helicopter flying above prescribed levels and the challenges of visual separation in complex airspace. The final report on the crash is expected next year. The January collision is part of a concerning trend of crashes and near misses this year.",
      "publishedAt": "2025-08-01T04:05:49Z",
      "title": "NTSB to finish public investigative hearings on fatal midair crash between Army helicopter and plane",
      "url": "https://apnews.com/article/ntsb-hearings-army-helicopter-airplane-crash-potomac-984dc835b1cc63274768192a404bfa2c",
      "urlToImage": "https://dims.apnews.com/dims4/default/606f944/2147483647/strip/true/crop/6577x3700+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2Fe3%2F57e0d55f5b94790d034a5cdccd6d%2F70e88dd0d8fd4bb088694daa3d05c0e6"
    },
    {
      "author": null,
      "description": "A teacher who authorities say admitted to fatally stabbing a couple he didn’t know who were hiking with two of their children in an Arkansas state park is expected to have his first court appearance. Andrew James McGann has been charged with two counts of capital murder in the killing Saturday of 43-year-old Clinton David Brink and his 41-year-old wife Cristen Amanda Brink. He is being held without bond and is expected to appear Friday morning at the Washington County Detention Center. The Associated Press has left messages at numbers listed for McGann. It is unclear if he has a lawyer.",
      "publishedAt": "2025-08-01T04:38:36Z",
      "title": "Arkansas trail killing suspect to appear in court",
      "url": "https://apnews.com/article/arkansas-trail-killing-suspect-court-appearance-376a70c6340aef654ddd34fda11b42cb",
      "urlToImage": "https://dims.apnews.com/dims4/default/41eb7fd/2147483647/strip/true/crop/7262x4085+0+379/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fad%2F3da910017abe93f0b79cad3f7162%2F16fa0b2df7da4276b000ed5e34f9d921"
    },
    {
      "author": null,
      "description": "Elon Musk is a kingmaker on X. He has used his dominance of the platform he owns to boost the influence of hard-right politicians and activists across Europe, an Associated Press analysis of tens of thousands of posts has found. As Musk seeks to build his own political party, data compiled by AP shows the scope of his political ambition. Musk’s interactions can attract millions of views and help up-and-coming influencers gain tens of thousands of followers. His promotion of an international alliance of hard-right parties and individuals has helped rattle the foundation of a trans-Atlantic bond that has guided U.S. and European relations for over eight decades.",
      "publishedAt": "2025-08-01T04:08:05Z",
      "title": "Key things to know about Elon Musk boosting hard-right Europeans on X",
      "url": "https://apnews.com/article/musk-europe-politics-influencers-x-twitter-f11463f853af6e152e1972c90131e43d",
      "urlToImage": "https://dims.apnews.com/dims4/default/d892eee/2147483647/strip/true/crop/8070x4539+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F69%2F50055c8045fbbfdb281b4274b40d%2Fap23344379834439.jpg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}