{
  "articles": [
    {
      "author": "JON GAMBRELL and MIKE CORDER",
      "description": "Imprisoned Iranian activist Narges Mohammadi won the Nobel Peace Prize on Friday in recognition of her tireless campaigning for women’s rights and democracy and against the death penalty.",
      "publishedAt": "2023-10-06T07:49:50Z",
      "title": "Jailed Iranian activist Narges Mohammadi wins the Nobel Peace Prize for fighting women's oppression",
      "url": "https://apnews.com/776ca1bcf0fde827ad90af8a069907eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6664675422544710a69153ca02c74066/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON, MICHAEL BALSAMO and COLLEEN LONG",
      "description": "MEXICO CITY (AP) — The Biden administration will resume deporting Venezuelan migrants, the largest single group encountered at the U.S.-Mexico border last month, back to their economically troubled country as their arrivals continue to grow.",
      "publishedAt": "2023-10-04T18:03:05Z",
      "title": "Biden administration is resuming deportation flights for Venezuelan migrants as arrivals grow",
      "url": "https://apnews.com/3ea8f589019506d271906d83be432cdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/975e450c8e4c46048abcf0044f560530/1920.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL and CAMILLE FASSETT",
      "description": "Storms, floods, fires and other extreme weather events led to more than 43 million displacements involving children between 2016 and 2021, according to a United Nations report. More than 113 million displacements of children will occur in the next three decades, estimated the UNICEF report released Friday, which took into account risks from flooding rivers, cyclonic winds and floods that follow a storm.",
      "publishedAt": "2023-10-06T00:07:17Z",
      "title": "Millions of children are displaced due to extreme weather events. Climate change will make it worse",
      "url": "https://apnews.com/87e933b1ee0d81f9345daa801f311ea6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0b81025b4254d94bf4a47db2228350c/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVE, FARNOUSH AMIRI and LISA MASCARO",
      "description": "WASHINGTON (AP) — For Republicans, it's a question with no clear answer: Who becomes House speaker after Kevin McCarthy?",
      "publishedAt": "2023-10-05T19:03:37Z",
      "title": "Who might replace McCarthy as House speaker? What are Republicans already demanding for their vote?",
      "url": "https://apnews.com/64fa61123be7a7af585233903256c0f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc8b522be3b14de38c09a71e4b61560a/1920.jpeg"
    },
    {
      "author": "ALBERT AJI",
      "description": "HOMS, Syria (AP) — Family members of some of the victims of a deadly drone attack on a crowded military graduation ceremony that killed scores gathered outside a military hospital in the central city of Homs on Friday to collect the bodies of their loved ones, who died in one of Syria’s deadliest single attacks in years.",
      "publishedAt": "2023-10-06T07:48:08Z",
      "title": "Funerals held in Syria for dozens of victims killed in deadliest attack in years",
      "url": "https://apnews.com/535afd2b12c0fd15de4005546bbd6d83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a7fcdf04b024bbcaa706f9c2e9be4fb/2422.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KHARKIV, Ukraine (AP) — A Russian missile attack killed a 10-year-old boy and his grandmother Friday in the northeastern Ukrainian city of Kharkiv, officials said, a day after a strike in the same region killed at least 51 civilians in one of the deadliest attacks in the war in months.",
      "publishedAt": "2023-10-06T08:41:47Z",
      "title": "A Russian missile attack in eastern Ukraine kills a 10-year-old boy and his grandmother",
      "url": "https://apnews.com/b38fd758600a6ef0101516ec6cd6be24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbd1c4aa746146b7acbf5283e3b783ad/2000.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — A massive health care strike over wages and staffing shortages headed into its final day on Friday without a deal between industry giant Kaiser Permanente and the unions representing the 75,000 workers who picketed this week.",
      "publishedAt": "2023-10-06T10:02:42Z",
      "title": "Health care strike over pay and staff shortages heads into final day with no deal in sight",
      "url": "https://apnews.com/287d929d686d3e6ce2a22b1c8d5d87fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae2481083a534314a6f85f3bcdd4ea8d/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Job growth in the United States has remained resilient for the past 2 1/2 years even after high inflation flared and the Federal Reserve jacked up interest rates at the fastest pace in four decades.",
      "publishedAt": "2023-10-06T04:01:23Z",
      "title": "Economic spotlight turns to US jobs data as markets are roiled by high rates and uncertainties",
      "url": "https://apnews.com/8950494bcfcc717f7e6c18bc19ecaf6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07223722dc5f4ee180bc61cf3c2181bf/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA and SIBI ARASU",
      "description": "NEW DELHI (AP) — Hundreds of rescuers dug through slushy debris and fast-flowing, icy water Friday in a search for survivors after a glacial lake overflowed and burst through a dam in India's Himalayan north, a disaster that many had warned was possible for years.",
      "publishedAt": "2023-10-06T06:17:23Z",
      "title": "Icy flood that killed at least 41 in India's northeast was feared for years",
      "url": "https://apnews.com/88d50fe08e8d8926a229c5fbedad9d95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/483df98f3aad47fbbcd1ff391e22fc65/1920.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "PORTLAND, Maine (AP) — Whales, dolphins and seals living in U.S. waters face major threats from warming ocean temperatures, rising sea levels and decreasing sea ice volumes associated with climate change, according to a first-of-its-kind assessment.",
      "publishedAt": "2023-10-06T05:06:49Z",
      "title": "Whales and dolphins in American waters are losing food and habitat to climate change, US study says",
      "url": "https://apnews.com/9129d7b70389a36d3265d08838e68266",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/088da63a67bb424fbf69ca0d9819c0fa/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}