{
  "articles": [
    {
      "author": "JOSEPH KRAUSS and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Palestinians lined up outside bakeries and grocery stores in Gaza on Thursday after spending the night surrounded by the ruins of pulverized neighborhoods darkened by a near-total power outage.",
      "publishedAt": "2023-10-12T05:11:00Z",
      "title": "Palestinians rush to buy food and struggle under strikes as Israel readies possible ground operation",
      "url": "https://apnews.com/beb1fa2b9e4ede6cf4568dd6c86ff11a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18d824942df7491682f07e73d369cfbb/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden on Wednesday condemned the weekend attack by Hamas militants on Israel as the deadliest day for Jews since the Holocaust as the number of U.S.",
      "publishedAt": "2023-10-11T16:47:19Z",
      "title": "Biden calls Hamas attacks the deadliest day for Jews since the Holocaust as US death toll ticks up",
      "url": "https://apnews.com/99eb4063edabc80fa1fa198fb0bb020e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d31f822db5354a79a98769fb1617a1f6/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — Within hours of the horrific attack by Hamas, the U.S. began moving warships and aircraft to the region to be ready to provide Israel with whatever it needs to respond.",
      "publishedAt": "2023-10-12T04:09:21Z",
      "title": "The US is moving quickly to boost Israel's military. A look at what assistance it's providing",
      "url": "https://apnews.com/e648c53dc53a46e2e12950784ea5e8d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8838fd40d1c742a3a2f47a1e4d403515/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — While revealing new details about one of the most famed CIA operations of all times — the spiriting out of six American diplomats who escaped the 1979 U.S.",
      "publishedAt": "2023-10-12T04:29:04Z",
      "title": "CIA publicly acknowledges 1953 coup it backed in Iran was undemocratic as it revisits 'Argo' rescue",
      "url": "https://apnews.com/218323db3cc1aca6bde1e54827527e8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f53898ffc0d4c4e88bed4cee60bdd24/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — With his walker positioned on the mound, Rep. Steve Scalise threw out the ceremonial first pitch at Washington Nationals ballpark, a breathtaking comeback for the Republican congressman who just months earlier was fighting for his life after a gunman had opened fire on lawmakers at their own charity baseball game practice.",
      "publishedAt": "2023-10-12T04:06:20Z",
      "title": "Republican Steve Scalise is seen as a fighter, but becoming House speaker might require a brawl",
      "url": "https://apnews.com/c9625356230fb3d0c71bd021875aaeb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a8412f37610492cbac5d37672d942f9/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "A majority of Americans support higher pay for auto workers who are on strike against Detroit's Big Three carmakers, although approval of the workers' other demands is more mixed, according to a poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-10-12T04:03:25Z",
      "title": "More Americans support striking auto workers than car companies, an AP-NORC poll shows",
      "url": "https://apnews.com/b6f0efba4892d1f5d2a829effd514f7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f02066b3ccbc43eebf823449adfd407f/3000.jpeg"
    },
    {
      "author": "TAIWO ADEBAYO",
      "description": "ABUJA, Nigeria (AP) — Many poor countries in Africa face the harshest effects of climate change: severe droughts, vicious heat and dry land, but also unpredictable rain and devastating flooding. The shocks worsen conflict and upend livelihoods because many people are farmers — work that is increasingly vulnerable in a warming world.",
      "publishedAt": "2023-10-12T05:07:15Z",
      "title": "IMF and World Bank are urged to boost funding for African nations facing conflict and climate change",
      "url": "https://apnews.com/453b6fc341d8a80c15f4824468e61179",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8dafea3d5b6b4e1888b9e1ea9ec4351b/3000.jpeg"
    },
    {
      "author": "RIO YAMAT",
      "description": "LAS VEGAS (AP) — Duane “Keffe D” Davis is the last living suspect in one of hip-hop's most enduring mysteries — the 1996 killing of rap icon Tupac Shakur in Las Vegas.",
      "publishedAt": "2023-10-12T04:18:13Z",
      "title": "Who witnessed Tupac Shakur's 1996 killing in Las Vegas? Here's what we know",
      "url": "https://apnews.com/547617626a0051421b59ae4bde9c5953",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12ed384b7ef146749e9bd30e90657fed/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY",
      "description": "GREENWOOD, Ark. (AP) — Ricky Dority spends most of his days playing with his grandchildren, feeding chickens and working in the yard where he lives with his son's family.It's a jarring change from where he was just several months ago, locked in a cell serving a life prison sentence at Oklahoma's Joseph Harp Correctional Center in a killing he said he didn't commit.",
      "publishedAt": "2023-10-12T04:27:56Z",
      "title": "An Oklahoma man used pandemic relief funds to have his name cleared of murder",
      "url": "https://apnews.com/fbb59bbfb46d44a375704f172b6fc786",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad6d7d3f23404edfa9d37fe001f39454/2893.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "ST. LOUIS (AP) — A player in California won a $1.765 billion Powerball jackpot Wednesday night, ending a long stretch without a winner of the top prize.The winning numbers were: 22, 24, 40, 52, 64 and the Powerball 10.",
      "publishedAt": "2023-10-11T04:16:01Z",
      "title": "$1.765 billion Powerball jackpot goes to lucky lottery player in California",
      "url": "https://apnews.com/5ee02e8c6f366b8b5a48806ab0d04e35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1c278ed5d764cbaa0ef40bfdb3e92a3/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}