{
  "articles": [
    {
      "author": "Samy Magdy, Josef Federman",
      "description": "Egyptian and Israeli security officials say Gaza’s Rafah border crossing with Egypt has reopened for limited traffic, a key step as the ceasefire moves ahead. The Egyptian official said 50 Palestinians would cross in each direction in the first day of the crossing’s operation. The official, involved in talks related the implementation of ceasefire deal, spoke to the AP anonymously to discuss confidential information. State-run Egyptian media and an Israeli security official also confirmed the opening. The current ceasefire has halted more than two years of war between Israel and Hamas that began with the Hamas-led attack on southern Israel on Oct. 7, 2023.",
      "publishedAt": "2026-02-02T07:36:14Z",
      "title": "Gaza’s Rafah border crossing with Egypt reopens for limited traffic",
      "url": "https://apnews.com/article/rafah-gaza-israel-palestinians-egypt-crossing-b78d6a15790148a697634cd303c3b5a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/fbe0e13/2147483647/strip/true/crop/5192x3460+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F52%2F47f28a20f5942727fd10d3fdec3b%2F2d3c2f9aa7a240299889cbcd556261f2"
    },
    {
      "author": "Lisa Mascaro",
      "description": "House Speaker Mike Johnson faces tough days ahead trying to pass a federal funding package and prevent a prolonged partial government shutdown. Democrats are demanding changes to rein in the Trump administration’s immigration enforcement operations after the deaths in Minneapolis. But Republicans are making their own demands in support of President Donald Trump's crackdown on illegal immigration. A partial shutdown started over the weekend when funding lapsed for several agencies. Trump struck a deal with senators, who approved new funding, but only temporarily for Homeland Security until Feb. 13. That would give Congress time to consider new restrictions on Immigration and Customs Enforcement. Johnson now needs Trump to help push that deal through the House.",
      "publishedAt": "2026-02-02T05:01:58Z",
      "title": "Speaker Johnson faces tough choices as partial government shutdown drags on",
      "url": "https://apnews.com/article/government-shutdown-house-johnson-trump-ice-democrats-bb4cfeaab5f3a17e2fde5c23bb27677f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c9d3aaf/2147483647/strip/true/crop/7416x4941+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2Fa9%2F9e9fd5c19883ae4dd12092ce30c2%2F3c49ad578b8a4e4191e0a102c15d13e2"
    },
    {
      "author": null,
      "description": "President Donald Trump says he will move to close Washington’s Kennedy Center performing arts venue for two years starting in July for construction. Trump’s announcement on social media Sunday night follows a wave of cancellations since Trump ousted the previous leadership and added his name to the building. Trump announced his plan days after the premier of “Melania” a documentary of the first lady was shown at the storied venue. He says the proposal is subject to approval by the board of the Kennedy Center, which has been stocked with his hand-picked allies.",
      "publishedAt": "2026-02-01T23:47:50Z",
      "title": "Kennedy Center will close for 2 years for renovations in July, Trump says",
      "url": "https://apnews.com/article/trump-kennedy-center-closing-renovations-c6dba4a46e71b0d0e48d46501195366c",
      "urlToImage": "https://dims.apnews.com/dims4/default/fa0f2c5/2147483647/strip/true/crop/5028x3350+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2F9b%2F544d232b5dbdcb42079068a3f65f%2Fb1164659ec4b4b49872d9b7f86cfdf16"
    },
    {
      "author": "The Associated Press",
      "description": "Five-year-old Liam Conejo Ramos and his dad have returned to Minnesota after being released by ICE, Texas lawmaker says. The two were detained in a Minneapolis suburb on Jan. 20. Images of the young boy wearing a bunny hat and Spider-Man backpack surrounded by immigration officers caused outrage over the Trump administration immigration crackdown in Minneapolis. A judge on Saturday ordered the father and son's release.",
      "publishedAt": "2026-02-01T16:20:55Z",
      "title": "5-year-old and dad return to Minnesota from Texas detention facility",
      "url": "https://apnews.com/article/minnesota-boy-liam-conejo-ramos-fc958185cd2b4e946b82081be11bc0f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/16e04de/2147483647/strip/true/crop/6958x4636+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F6e%2Fd62e02e653ab799cbafbce21fcda%2Ffd19893dec9f4a9498c83e2e4e229092"
    },
    {
      "author": "Eric Tucker",
      "description": "A top Justice Department official is playing down the possibility of additional criminal charges arising from the Jeffrey Epstein files. Deputy Attorney General Todd Blanche said on CNN on Sunday that the existence of “horrible photographs” and troubling email correspondence does not “allow us necessarily to prosecute somebody.” Department officials said over the summer that a review of records from Epstein investigations did not establish a basis for new criminal investigations, a position that Blanche said remains unchanged even as a massive document dump since Friday has focused fresh attention on his links to powerful individuals around the world and revived questions about what, if any, knowledge the wealthy financier’s contacts had about his crimes.",
      "publishedAt": "2026-02-01T20:30:10Z",
      "title": "DOJ official plays down chance for charges arising from Epstein files release",
      "url": "https://apnews.com/article/trump-justice-department-epstein-files-28e917b173e0c371cff08946a24d2cd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/9417c5b/2147483647/strip/true/crop/5077x3383+36+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F30%2F92f20b6456d7e3a808dc8155e5e4%2F24f33199772148b7b6138e9c55305da9"
    },
    {
      "author": null,
      "description": "The eldest son of Norway’s Crown Princess Mette-Marit will go on trial this week on multiple charges including rape, a high-profile case that has been an embarrassment to the royal family. The trial is opening just as Mette-Marit herself faces new scrutiny over her past contacts with Jeffrey Epstein. Marius Borg Høiby will face the Oslo district court on Tuesday after being indicted in August following a lengthy investigation. The indictment includes 38 counts, among them rape, abuse in a close relationship against one former partner and acts of violence against another. Other charges include making death threats and traffic violations. The trial is expected to last until mid-March.",
      "publishedAt": "2026-02-02T06:02:54Z",
      "title": "Rape trial of Marius Borg Høiby, son of Norway's crown princess, to begin",
      "url": "https://apnews.com/article/norway-royals-marius-borg-hoiby-trial-cff32cdfd942028d45f7a7ba2db52752",
      "urlToImage": "https://dims.apnews.com/dims4/default/e114002/2147483647/strip/true/crop/4041x2693+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F84%2F7d7a80c64f7c8d59734f125993a1%2F3f8105e9ebf84000bfa5020cef494892"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "U.S. futures and world shares have skidded as worries over President Donald Trump's nominee to be the next Federal Reserve chair amplify jitters over a possible bubble in the artificial intelligence boom. South Korea's exchange, which is heavily influenced by tech-related developments, briefly suspended trading as its benchmark Kospi bounced below 5%. Oil prices fell more than $3 a barrel and gold and silver also extended losses after plunging on Friday. The S&P 500 dropped 0.4% Friday after Trump named Kevin Warsh as his nominee to replace Fed chair Jerome Powell. The Dow industrials lost 0.4%. The Nasdaq composite lost 0.9%.",
      "publishedAt": "2026-02-02T03:46:02Z",
      "title": "World shares and US futures skid on worries over Trump's pick for Fed chief",
      "url": "https://apnews.com/article/stocks-markets-gold-oil-trump-fed-585ed1a8046d34fa3dedbb4854451681",
      "urlToImage": "https://dims.apnews.com/dims4/default/23d5505/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F65%2F30c591f265eb7de2ac14dbde56d7%2F9577ee34fe7245418a416333fcc5eb95"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran says it has had summoned all of the European Union ambassadors in the Islamic Republic to protest the bloc’s listing of the paramilitary Revolutionary Guard as a terror group. Iranian Foreign Ministry spokesman Esmail Baghaei told journalists on Monday that the ambassadors had been summoned the previous day. The EU listed the Guard as a terror group last week over its part in the bloody crackdown on nationwide protests in January. While the move is largely symbolic, it does add to the economic pressure squeezing Iran, particularly has the Guard has a major influence on the country’s economy.",
      "publishedAt": "2026-02-02T07:42:43Z",
      "title": "Iran summons EU ambassadors to protest Revolutionary Guard being listed as terror group",
      "url": "https://apnews.com/article/iran-eu-protests-revolutionary-guard-d38bc397f1bb54d7352879401449b50b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a86f059/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F77%2Fdf7eea9a4578933bd693207b7f07%2Fea5a975fd6894af482d240d95cdebc47"
    },
    {
      "author": "John Hanna, Julie Carr Smyth",
      "description": "Democrat Taylor Rehmet won a special election for the Texas state Senate and flipped a reliably Republican district that President Donald Trump won by 17 points in 2024. Rehmet, a labor union leader and veteran, easily defeated Republican and conservative activist Leigh Wambsganss in the Fort Worth-area district. His victory added to Democrats’ record of overperforming in special elections so far this cycle. Trump used his social media platform to urge voters to support Wambsganss, but Rehmet had support from national organizations. The victory allows Rehmet to serve only until early January, and he must win the November general election to keep the seat after that.",
      "publishedAt": "2026-02-01T05:09:12Z",
      "title": "Democrat Taylor Rehmet flips Texas state Senate seat",
      "url": "https://apnews.com/article/texas-state-senate-democrat-taylor-rehmet-c8cb6685c49696b8a607a8f93111ae2e",
      "urlToImage": "https://dims.apnews.com/dims4/default/7696c9a/2147483647/strip/true/crop/4982x3320+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F94%2F203bfa6076705442512a03d99986%2F142cc2b757f74eb9a710c05e45933d42"
    },
    {
      "author": "Matt O'Brien",
      "description": "When Amazon announced it was cutting 16,000 corporate jobs, many assumed it was the latest phase of CEO Andy Jassy’s push to reduce the corporate workforce as AI brings more efficiency gains. But like other companies that have tied layoffs to AI — including Pinterest and Dow — it can be hard for economists, or individual employees, to know if AI is the real reason or the message a company wants to tell Wall Street.",
      "publishedAt": "2026-02-02T06:00:06Z",
      "title": "Did artificial intelligence really drive layoffs at Amazon and other firms? It can be hard to tell",
      "url": "https://apnews.com/article/ai-job-impacts-layoffs-amazon-pinterest-dow-7736d042172743301dd7e494813a885d",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2c2449/2147483647/strip/true/crop/5616x3742+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Fc6%2Fe20d47003bbdbb2da89dfb35d044%2F27b2884367ae4456af4e5ce22c304e8d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}