{
  "articles": [
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — IRS Commissioner Danny Werfel has a message for high-wealth tax cheats who are wrongly deducting private jet travel and otherwise shorting the government on their taxes: Pay your fair share so “others aren’t shouldering the burden of funding our government.\"",
      "publishedAt": "2024-03-20T10:23:48Z",
      "title": "IRS chief zeroes in on wealthy tax cheats in AP interview",
      "url": "https://apnews.com/8387205aac2c916fd62cc7b40a439cdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e16660bff1c4ab3929fb315cbe7c7d4/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and SUDHIN THANAWALA",
      "description": "ATLANTA (AP) — The judge overseeing the Georgia 2020 election interference case cleared the way Wednesday for Donald Trump and other defendants to appeal a ruling allowing Fulton County District Attorney Fani Willis to remain on the prosecution.",
      "publishedAt": "2024-03-20T15:06:29Z",
      "title": "Judge clears way for Trump to appeal ruling keeping Fani Willis on Georgia 2020 election case",
      "url": "https://apnews.com/d6df1ed788efac8bc37c3ce392cdc050",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/516232a901bf4dcca0e14d6a660cd580/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — Plans by Texas to arrest migrants suspected of entering the U.S. illegally were again on hold Wednesday after setting off uncertainty along the border and anger from Mexico flared during a brief few hours that the law was allowed to take effect.",
      "publishedAt": "2024-03-20T06:19:56Z",
      "title": "Court puts Texas law allowing police to arrest migrants who cross illegally back on hold",
      "url": "https://apnews.com/8e232b8a0c2979943c87c7309652ed34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d47ba06403c4c2e9de92309d61dcf5d/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, JONATHAN J. COOPER and PATRICK ORSAGOS",
      "description": "TEMPE, Arizona (AP) — As Joe Biden and Donald Trump moved closer to a November rematch, primary voters around the country on Tuesday urged their favored candidate to keep up the fight and worried about what might happen if their side loses this fall.",
      "publishedAt": "2024-03-19T04:04:29Z",
      "title": "Biden and Trump notch more wins Tuesday as primary voters urge them to keep up the fight",
      "url": "https://apnews.com/8b2414273d7e4d46f5696268ae89a7f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10c38cef1ba54a8bb37d40c41eccb0d2/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump suggested Tuesday that he’d support a national ban on abortions around 15 weeks of pregnancy, voicing for the first time support for a specific limit on the procedure.",
      "publishedAt": "2024-03-20T02:39:02Z",
      "title": "Trump suggests he'd support a national ban on abortions around 15 weeks of pregnancy",
      "url": "https://apnews.com/91a9e0ce87d11dff0fa761f327bd0566",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/690f648384ff4b33b8d790b305af6fe8/2872.jpeg"
    },
    {
      "author": "MARTHA MENDOZA, MAHESH KUMAR and PIYUSH NAGPAL",
      "description": "SAN FRANCISCO (AP) — Noriko Kuwabara was excited to try a new recipe she’d seen on social media for crispy shrimp spring rolls, so she and her husband headed to Costco’s frozen foods aisle. But when she grabbed a bag of farm-raised shrimp from the freezer and saw “Product of India,” she wrinkled her nose.",
      "publishedAt": "2024-03-20T15:13:37Z",
      "title": "AP documents grueling conditions in Indian shrimp industry that report calls 'dangerous and abusive'",
      "url": "https://apnews.com/e5b51878eafbb6e28977710b191eb7de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b3cb841d04447f79377f506181b8dbc/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Mourners held funeral prayers Wednesday morning outside a hospital in central Gaza for 28 people killed in three separate Israeli airstrikes on urban refugee camps the previous night. Associated Press footage showed mourners praying over the bodies, which were wrapped in funeral shrouds, before the bodies were taken away in donkey carts for burial.",
      "publishedAt": "2024-03-20T06:44:19Z",
      "title": "The Latest | Palestinians mourn 28 killed in Israeli airstrikes on urban refugee camps in Gaza",
      "url": "https://apnews.com/e80b024bd930b3f3deed7d483d5f131b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6968805294984072b261a45a3d649d45/1920.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG and EMILY WAGSTER PETTUS",
      "description": "JACKSON, Miss. (AP) — A third former Mississippi sheriff’s deputy has been sentenced for his part in the racist torture of two Black men by a group of white officers who called themselves \"the Goon Squad.” Daniel Opdyke was sentenced Wednesday to 17.5 years in federal prison.",
      "publishedAt": "2024-03-20T05:10:58Z",
      "title": "3rd of 6 former officers in Mississippi gets 17.5 years for racist torture of 2 Black men",
      "url": "https://apnews.com/94d9dcfa00e582b9d50a6eb7288b058b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58d746d62c6c4f3880e1596524bcae9f/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Two weeks ago, Chair Jerome Powell suggested that the Federal Reserve was “not far” from gaining the confidence it needed that inflation was headed sustainably toward its 2% target level, which would allow it to start cutting its benchmark interest rate.",
      "publishedAt": "2024-03-20T04:01:40Z",
      "title": "Powell may provide hints of whether Federal Reserve is edging close to rate cuts",
      "url": "https://apnews.com/502ced8f228ee469f84fc6f2eeea6e3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7980728bd3684776b55c6482ad95ee7b/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — French bulldogs. U.S. dog owners. C'est l'amour. Frenchies remained the United States' most commonly registered purebred dogs last year, according to American Kennel Club rankings released Wednesday.",
      "publishedAt": "2024-03-20T12:41:05Z",
      "title": "French bulldogs remain the most popular US breed in new rankings. Many fans aren't happy",
      "url": "https://apnews.com/b8faa0214c160d00117ef1ef15d21f43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b26ee92952b49ec91bb646726df2787/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}