{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces battled Palestinian militants in Gaza's two largest cities on Monday, with civilians still trapped in the fighting even after hundreds of thousands have fled to other parts of the besieged territory.",
      "publishedAt": "2023-12-11T08:04:02Z",
      "title": "Israel battles militants in Gaza's main cities, with civilians still trapped in the crossfire",
      "url": "https://apnews.com/2beb52343a9b25050d8df801ad977bbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b59f0dbc8a44c5f9ada8e0b45f48170/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "SUMY, Ukraine (AP) — Whenever 52-year-old Anna is agitated, she senses the chilling touch of a gun barrel between her brows — a haunting reminder of an encounter with a group of Russian soldiers on her street about a year ago.",
      "publishedAt": "2023-12-11T05:02:07Z",
      "title": "Life in Russian-controlled areas of Ukraine is grim. People are fleeing through a dangerous corridor",
      "url": "https://apnews.com/57549469b780f53ef226c909d25a08d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c638f5162f314ca697a0a3367574efea/3000.jpeg"
    },
    {
      "author": "KRISTIN M. HALL, PATRICK WHITTLE and GARY D. ROBERTSON",
      "description": "NASHVILLE, Tenn. (AP) — Residents of central Tennessee communities slammed by deadly tornadoes this weekend described tragic and terrifying scenes in which one mobile home landed on top of another, roofs were ripped from houses and an entire church collapsed during a string of powerful storms that killed six people.",
      "publishedAt": "2023-12-10T14:14:43Z",
      "title": "Tennessee residents clean up after severe weekend storms killed 6 people and damaged neighborhoods",
      "url": "https://apnews.com/ecc0436ec7480d18dd4972bd07c22e6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/753b729da62c406f96b255ad1e8b6689/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump said Sunday he has decided against testifying for a second time at his New York civil fraud trial, posting on social media a day before his scheduled appearance that he “very successfully &amp; conclusively” testified last month and saw no need to do so again.",
      "publishedAt": "2023-12-10T20:40:33Z",
      "title": "Trump says he won't testify again at his New York fraud trial. He says he has nothing more to say",
      "url": "https://apnews.com/5710001a228dc333a88e61b18abcfd44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6340655470054c9d8c6ecad191762d79/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden goes into next year's election with a vexing challenge: Just as the U.S. economy is getting stronger, people are still feeling horrible about it.",
      "publishedAt": "2023-12-11T05:02:33Z",
      "title": "Biden goes into 2024 with the economy getting stronger, but voters feel horrible about it",
      "url": "https://apnews.com/53db7f95d14db2557b00424254208272",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32ddc8f1feb8491495aa46c85a4434c1/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "LUKEVILLE, Ariz. (AP) — Gerston Miranda and his wife were among thousands of migrants recently arriving at this remote area on Arizona's southern border with Mexico, squeezing into the United States through a gap in the wall and walking overnight about 14 miles (23 kilometers) with two school-aged daughters to surrender to Border Patrol agents.",
      "publishedAt": "2023-12-10T05:20:47Z",
      "title": "Smugglers are bringing migrants to a remote Arizona border crossing, overwhelming US agents",
      "url": "https://apnews.com/ae04e8c861a95e98dbfc8d49244cf092",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfd5727b07e044459011a5e288042560/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — British Prime Minister Rishi Sunak faces one of the toughest weeks of his 13 months in office as he’s grilled by lawyers about his decisions during the COVID-19 pandemic while fending off a rebellion from lawmakers over his signature immigration policy.",
      "publishedAt": "2023-12-11T10:06:06Z",
      "title": "It's a tough week for Rishi Sunak. He faces grilling on COVID decisions and revolt over Rwanda plan",
      "url": "https://apnews.com/db042ca498b1018c30b9bff672dfde64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f2760065acb487990961c6809bc0004/2000.jpeg"
    },
    {
      "author": "AIJAZ HUSSAIN",
      "description": "SRINAGAR, India (AP) — India’s top court on Monday upheld a 2019 decision by Prime Minister Narendra Modi’s government to strip disputed Jammu and Kashmir’s special status as a semi-autonomous region with a separate constitution and inherited protections on land and jobs.",
      "publishedAt": "2023-12-11T08:15:50Z",
      "title": "India's Supreme Court upholds government's decision to remove disputed Kashmir’s special status",
      "url": "https://apnews.com/d7e9b2c0cb0222e18de08d75c6b0ebc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fbde9e0eda740c68343b8a4b4e40728/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL, JAMEY KEATEN and SETH BORENSTEIN",
      "description": "DUBAI, United Arab Emirates (AP) — Visibly tired and frustrated top United Nations officials urged climate talks to push harder for an end to fossil fuels. Time seems to be running out both in the talks in Dubai and for action that could keep warming at or below the internationally agreed-upon threshold.",
      "publishedAt": "2023-12-11T05:27:18Z",
      "title": "UN officials and activists ramp up the urgency as climate talks enter final days",
      "url": "https://apnews.com/47dfd6dbf32d987e885acd6dbffc7954",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8234f81d9a30437a95600cc782415ce1/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "At a small rural Missouri high school, two English teachers shared a secret: Both were posting adult content on OnlyFans, the subscription-based website known for sexually explicit content.The site and others like it provide an opportunity for those willing to dabble in pornography to earn extra money — sometimes lots of it.",
      "publishedAt": "2023-12-11T05:14:33Z",
      "title": "Teachers have been outed for moonlighting in adult content. Do they have legal recourse?",
      "url": "https://apnews.com/51967bfa6387f934dfc5561c6aea802d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7ce483a7e5641cf863fc7fb4df04eaf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}