{
  "articles": [
    {
      "author": "WAFAA SHURAFA, TIA GOLDENBERG KAREEM CHEHAYEB and ZEKE MILLER",
      "description": "NEW YORK (AP) — President Joe Biden said Monday that he hopes a cease-fire between Israel and Hamas that would pause hostilities and allow for remaining hostages to be released can take effect by early next week.",
      "publishedAt": "2024-02-26T08:53:03Z",
      "title": "Biden hopes cease-fire, hostage deal to pause Israel-Hamas war can take effect by next Monday",
      "url": "https://apnews.com/8682b5446e285a7fc641c9f869df9348",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1807658248e649b39ffbefe09ff71ebd/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — February's end is bringing wild weather to much of the United States, with record heat allowing for golf in Wisconsin and outdoor food trucks in Minnesota, along with an increased fire risk across much of the Great Plains.",
      "publishedAt": "2024-02-26T16:11:54Z",
      "title": "Wild weather hits Northwest with snow even as Midwest gets a taste of summer",
      "url": "https://apnews.com/dbbb5939c655a9a6e28ade6401b7ec88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71d391d493384768b6a99adb4e612768/3000.jpeg"
    },
    {
      "author": "ISABELLA O'MALLEY",
      "description": "A powerful winter storm was dumping deep snow in parts of the West on Monday and much of the central U.S. was unseasonably warm: People played golf in Wisconsin and comfortably walked their dogs in Iowa, where some bulbs were starting to flower.",
      "publishedAt": "2024-02-26T20:10:53Z",
      "title": "Why so much of the US is unseasonably hot",
      "url": "https://apnews.com/59aa15e41f20a474566e00857df441eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9417568282c450bbc6b848adbe33e65/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump has appealed his $454 million New York civil fraud judgment, challenging a judge’s finding that he lied about his wealth as he grew the real estate empire that launched him to stardom and the presidency.",
      "publishedAt": "2024-02-26T15:00:51Z",
      "title": "Donald Trump appeals $454 million judgment in New York civil fraud case",
      "url": "https://apnews.com/2f8cc521e00e4a34a1342b961c1416ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53b730f026b64a2a8e4e2a636f3ed065/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — French President Emmanuel Macron said Monday that sending Western troops on the ground in Ukraine is not “ruled out” in the future after the issue was debated at a gathering of European leaders in Paris, as Russia’s full-scale invasion grinds into a third year.",
      "publishedAt": "2024-02-26T08:47:00Z",
      "title": "Putting Western troops on the ground in Ukraine is not 'ruled out' in the future, French leader says",
      "url": "https://apnews.com/c458a1df3f9a7626128cdeb84050d469",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/607468707c2c4786afc669fb280c3eeb/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "The Palestinian Authority's prime minister announced his government's resignation on Monday, seen as the first step in a reform process urged by the United States as part of its latest ambitious plans to resolve the Israeli-Palestinian conflict.",
      "publishedAt": "2024-02-26T19:20:05Z",
      "title": "What would a new Palestinian government in the West Bank mean for the war in Gaza?",
      "url": "https://apnews.com/aefe041e045f2c60918b42f42185f41e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/045acc5ad3564c25a098ea38b83855a5/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, COLLEEN LONG, ZEKE MILLER and JILL COLVIN",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump will make dueling trips to the U.S-Mexico border on Thursday, as both candidates try to turn the nation’s broken immigration system to their political advantage in an expected campaign rematch this year.",
      "publishedAt": "2024-02-26T15:31:29Z",
      "title": "Biden and Trump both plan trips to the Mexico border Thursday, dueling for advantage on immigration",
      "url": "https://apnews.com/734b45dd77b70a41471c9c843c36cc49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56d92e303e7846cca8408d2714012916/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — The gunfire that shattered the calm at pastor Joel Osteen’s megachurch in Houston only lasted about four minutes.",
      "publishedAt": "2024-02-26T22:41:25Z",
      "title": "Barrage of gunfire as officers stop shooter at Joel Osteen's megachurch, newly released video shows",
      "url": "https://apnews.com/946045e19ef9b57895e72bb39ef5a340",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/160399a67b5b4a378369eb04564462a9/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court cast doubt Monday on state laws that could affect how Facebook, TikTok, X, YouTube and other social media platforms regulate content posted by their users.",
      "publishedAt": "2024-02-26T13:53:17Z",
      "title": "Supreme Court casts doubt on GOP-led states' efforts to regulate social media platforms",
      "url": "https://apnews.com/19180ad0a9bdf48ddb77f14a5e335545",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/418b0bb0d1f248fcac0d9761c3c7df5f/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Don Henley never gave away handwritten pages of draft lyrics to “Hotel California” and other Eagles hits, he said Monday, calling them “very personal\" in testimony that also delved into an unrelated piece of his past: his 1980 arrest.",
      "publishedAt": "2024-02-26T14:56:49Z",
      "title": "Don Henley tells court he never gave away drafts of 'Hotel California' lyrics",
      "url": "https://apnews.com/aa5300708de790099f9f7d0ba3b8afcf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db7e37402919477abfe23115d5d62a8a/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}