{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel's ground incursion into Lebanon to battle Hezbollah militants left eight Israeli soldiers dead Wednesday, while the region braced for further escalation as Israel vowed to retaliate for Iran’s ballistic missile attack a day earlier.",
      "publishedAt": "2024-10-02T05:50:18Z",
      "title": "Israel reports 8 combat deaths as troops battle Hezbollah in Lebanon and fears of a wider war mount",
      "url": "https://apnews.com/7d93f71b7894177b4f9c303671ee55de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f13d66f69bb47bf9e89f57e07ac6af9/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — When Israel bombed buildings outside the southern Lebanese city of Sidon, Mohamed Arkadan and his team rushed to an emergency unlike anything they had ever seen.About a dozen apartments had collapsed onto the hillside they once overlooked, burying more than 100 people.",
      "publishedAt": "2024-10-02T07:05:19Z",
      "title": "Lebanon’s rescuers struggle to respond to Israeli offensive while under fire and using old equipment",
      "url": "https://apnews.com/cc0e211c73d8f033387574a69e14a32f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b916c598f8e4532ad249f6e1d3fa2a5/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Biden administration says there is a significant difference between Israeli actions that have expanded its war against the Iranian-backed militant groups Hamas and Hezbollah and Iran’s retaliatory missile attack against Israel, which it condemned as escalatory.",
      "publishedAt": "2024-10-02T04:10:56Z",
      "title": "After pressing an Israel-Hezbollah cease-fire, the Biden administration shifts its message",
      "url": "https://apnews.com/8bed0f7a37b5059ba4c94552ff750f34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/758fc626097345018dde0993039bf8d1/3000.jpeg"
    },
    {
      "author": "JONATHAN MATTISE and CEDAR ATTANASIO",
      "description": "NASHVILLE, Tenn. (AP) — Tennessee state authorities said Wednesday they are investigating the company behind a plastics factory where 11 workers were swept away by flooding from the remnants of Hurricane Helene.",
      "publishedAt": "2024-10-02T05:11:55Z",
      "title": "Helene's flooding swept away 11 workers at a Tennessee factory. Now the state is investigating",
      "url": "https://apnews.com/f7c4a460de588df7a4d5bc9efa756ecb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad330792a1ef4c5eb6290266f0ca5a27/2000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Hurricanes in the United States end up hundreds of times deadlier than the government calculates, contributing to more American deaths than car accidents or all the nation's wars, a new study said.",
      "publishedAt": "2024-10-02T15:07:56Z",
      "title": "Hurricanes like Helene are deadly when they strike and keep killing for years to come",
      "url": "https://apnews.com/6c9585e4c695dbc00fa313577f9f328f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca3c616c23f8440b83bb82883c2823fa/3000.jpeg"
    },
    {
      "author": "DEVNA BOSE",
      "description": "OXFORD, Miss. (AP) — It’s hard to miss the overflowing bowl of condoms at the entrance of the gym.Some University of Mississippi students walking past after their workout snicker and point, and the few who step forward to consider grabbing a condom rethink it when their friends catch up, laughter trailing behind them.",
      "publishedAt": "2024-10-02T13:36:33Z",
      "title": "Condoms aren’t a fact of life for young Americans. They’re an afterthought",
      "url": "https://apnews.com/c70f2002a4b70a2b13d4abc9fb76c4b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5f7b321c23e4eac99f061d6c4dee26b/2550.jpeg"
    },
    {
      "author": "SAMYA KULLAB and VOLODYMYR YURCHUK",
      "description": "KYIV, Ukraine (AP) — The fall of a front-line town nestled atop a tactically significant hill is unlikely to change the course of Ukraine’s war against Russia.",
      "publishedAt": "2024-10-02T11:22:40Z",
      "title": "The fall of Vuhledar is a microcosm of Ukraine's wartime predicament",
      "url": "https://apnews.com/2403780647659883a203feda35dd8ccc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ac823fd98c94264b3515a66203befde/3000.jpeg"
    },
    {
      "author": "TOM KRISHER, WYATTE GRANTHAM-PHILIPS and TASSANEE VEJPONGSA",
      "description": "PHILADELPHIA (AP) — The 45,000 dockworkers who went on strike Tuesday for the first time in decades at 36 U.S.",
      "publishedAt": "2024-10-01T10:43:00Z",
      "title": "Dockworkers may have the negotiating advantage in their strike against US ports",
      "url": "https://apnews.com/91703e4798dbc9ee82185e983f31a3f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5432e0816734cf7a8711ab86c1495fb/1920.jpeg"
    },
    {
      "author": "AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — After a year of war between Israel and Hamas, U.S. public opinion on the conflict remains polarized, a new survey by the Pearson Institute and The Associated Press-NORC Center for Public Affairs Research finds, with Democrats more likely to be critical of Israel, while Republicans remain more supportive.",
      "publishedAt": "2024-10-02T04:05:17Z",
      "title": "Republicans are more likely than Democrats to see Israel as a US ally: AP-NORC poll",
      "url": "https://apnews.com/20b070612a8a76ee1d4d6c47864a2355",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be71bebcd5df4d58afd3e5a5640f74fc/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "NEW YORK (AP) — To save power, NASA has switched off another scientific instrument on its long-running Voyager 2 spacecraft.",
      "publishedAt": "2024-10-02T15:19:08Z",
      "title": "NASA switches off instrument on Voyager 2 spacecraft to save power",
      "url": "https://apnews.com/05b554f333b24f2a39f77415d8fa2b2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ee8a03be55440d2a1b06f30bf18a41a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}