{
  "articles": [
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — The Israeli military said Friday it struck the central headquarters of Hezbollah in Beirut, where a series of massive explosions leveled multiple buildings, sending clouds of orange and black smoke billowing in the skies.",
      "publishedAt": "2024-09-27T15:34:31Z",
      "title": "Israel says it struck Hezbollah's headquarters in huge explosion that shakes Lebanese capital",
      "url": "https://apnews.com/617575d9c5d7c711bc02e7b81d2ba4ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2d8012d3a424b359473080e6664a0d9/2000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "UNITED NATIONS (AP) — His leadership strained by conflicts on two fronts, Israeli Prime Minister Benjamin Netanyahu told world leaders at the United Nations on Friday that his nation will “continue degrading Hezbollah\" until achieving its goals along the Lebanon border, further dimming hopes for an internationally backed cease-fire to halt the spiral into an all-out regional war.",
      "publishedAt": "2024-09-27T13:58:12Z",
      "title": "Netanyahu, at UN, vows that Israel will keep 'degrading Hezbollah' until its objectives are met",
      "url": "https://apnews.com/12e02fd82f35a8438aa907ca6762bac0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e0933ea56a84a2a96614c8ce8ed5108/1920.jpeg"
    },
    {
      "author": "STEPHEN SMITH, KATE PAYNE and HEATHER HOLLINGSWORTH",
      "description": "CRAWFORDVILLE, Fla. (AP) — Emergency crews rushed Friday to rescue people trapped in flooded homes after Helene roared ashore as a powerful Category 4 hurricane in Florida, generating a massive storm surge and knocking out power to millions of customers in several states.",
      "publishedAt": "2024-09-27T05:27:23Z",
      "title": "Georgia governor says at least 11 people are dead in his state after Hurricane Helene",
      "url": "https://apnews.com/e5769b56dea81e40fae2161ad1b4e75d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8903bc091be343f39d386a6d2c9d8b2e/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — New York City Mayor Eric Adams pleaded not guilty Friday to federal bribery charges and other counts that have roiled the nation’s biggest city after months of investigations, searches and subpoenas.",
      "publishedAt": "2024-09-27T04:04:16Z",
      "title": "New York City Mayor Eric Adams pleads not guilty to taking bribes and illegal campaign contributions",
      "url": "https://apnews.com/f384ecdbf6a7b6664bd898e7ebce6e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f3779378c3d4ad1b8b2cec01ab02b97/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The Justice Department unsealed criminal charges Friday against three Iranian operatives suspected of hacking Donald Trump's presidential campaign and disseminating stolen information to media organizations.",
      "publishedAt": "2024-09-27T16:24:43Z",
      "title": "Iranian operatives charged in the US with hacking Donald Trump's presidential campaign",
      "url": "https://apnews.com/1d7d83ccdc6c879be2802142f1c47191",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80f7df61defc407aaa35f09fe29ecf6c/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, ADRIANA GOMEZ LICON and LISA MASCARO",
      "description": "NEW YORK (AP) — Ukrainian President Volodymyr Zelenskyy met face-to-face with Donald Trump on Friday with public tensions rising between the two over Ukraine's defense against Russia's invasion and in the midst of the U.S.",
      "publishedAt": "2024-09-27T04:05:15Z",
      "title": "Trump and Zelenskyy meet in New York amid rising questions about US support for Ukraine",
      "url": "https://apnews.com/7c163eb5068c5003b219b6d524436517",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23214c89981d4677a583c1288ed30a39/2989.jpeg"
    },
    {
      "author": "WILL WEISSERT and JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — Vice President Kamala Harris on Friday will make her first visit to the U.S.-Mexico border since becoming the Democratic presidential nominee to confront head-on one of her biggest vulnerabilities ahead of the November election.",
      "publishedAt": "2024-09-27T09:05:03Z",
      "title": "Harris heads to the US-Mexico border to try to show that her record is more than Trump criticisms",
      "url": "https://apnews.com/4a87c6f3b2df1736aa226bc620f51b89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01812b5b07894b728837f57cfd96879d/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "Capt. Jamie Frederick, commander of Coast Guard district based in Boston, testified Friday that he was surprised to learn at the hearing that the crew of the Polar Prince support vessel, in hindsight, felt a slight shudder around the time the Titan sub imploded on its way to the Titanic.",
      "publishedAt": "2024-09-27T04:02:20Z",
      "title": "Titan implosion hearing paints a picture of reckless greed and explorer passion",
      "url": "https://apnews.com/f991bd49eb1f49b303477bfcab8923f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c40f3eeaef742c5a92b04b1002f0a24/1920.jpeg"
    },
    {
      "author": "TODD RICHMOND",
      "description": "MADISON, Wis. (AP) — The Universities of Wisconsin Board of Regents voted unanimously Friday to fire a communications professor who was seeking to retain tenure after his dismissal as chancellor of one of the system's campuses for making pornographic films.",
      "publishedAt": "2024-09-27T13:47:53Z",
      "title": "University of Wisconsin fires former porn-making chancellor who wanted to stay on as a professor",
      "url": "https://apnews.com/34ae309c9815ebd4fdfcc13c2707a7fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71e66b063e0b4f38878d568d84612b08/2871.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Maggie Smith, the masterful, scene-stealing actor who won an Oscar for 1969 film “The Prime of Miss Jean Brodie” and gained new fans in the 21st century as the dowager Countess of Grantham in “ Downton Abbey” and Professor Minerva McGonagall in the Harry Potter films, died Friday.",
      "publishedAt": "2024-09-27T13:16:20Z",
      "title": "Maggie Smith, scene-stealing actor famed for Harry Potter and 'Downton Abbey,' dies at 89",
      "url": "https://apnews.com/03a7b4143cc54b14bc7d9bca24ed1f9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1345c4cde3f48a78b8b213c2c76e0ee/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}