{
  "articles": [
    {
      "author": "KRUTIKA PATHI and SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — Prime Minister Narendra Modi's coalition led in a majority of seats Tuesday in India's general election, according to early figures, but faced a stronger challenge from the opposition than expected after it pushed back against the leader's mixed economic record and polarizing politics.",
      "publishedAt": "2024-06-04T00:43:13Z",
      "title": "Modi expected to retain power but early India count suggests it won't be the landslide he hoped for",
      "url": "https://apnews.com/7893efecc83fa8225a611f174e6420ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0c933bc413b42b787dedbd0680fa30c/1920.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, MICHAEL KUNZELMAN, COLLEEN LONG and RANDALL CHASE",
      "description": "WILMINGTON, Del. (AP) — Lawyers will make their opening statements Tuesday in the federal gun case against President Joe Biden’s son Hunter after a jury was seated for the trial while the first lady watched from the courtroom and the president sent a message of support.",
      "publishedAt": "2024-06-04T04:10:54Z",
      "title": "Hunter Biden's federal firearms case is opening after the jury is chosen",
      "url": "https://apnews.com/477c0ca9d07afc1a52bd90ef6d2167cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d774a925c7894215abc75ce249b3c624/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump has had plenty to say since his hush money trial conviction last week.He’s claimed the case was rigged, incorrectly linked President Joe Biden to the state prosecution, called the star witness against him a “sleazebag\" and said the judge was a “devil\" and “highly conflicted.”",
      "publishedAt": "2024-06-03T17:28:01Z",
      "title": "How Trump's deny-everything strategy could hurt him at sentencing",
      "url": "https://apnews.com/66dbfa66613aaae29a3959e619b7593c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a34dc65b0afc40dba20cfef08dfd16b8/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Palestinian health officials in the Gaza Strip said Israeli strikes killed at least 11 people overnight into Tuesday, including a family of three in the built-up Bureij refugee camp and eight police officers.",
      "publishedAt": "2024-06-04T08:20:50Z",
      "title": "The Latest | Israeli strikes kill 11 overnight in Gaza, including a family of 3 at a refugee camp",
      "url": "https://apnews.com/e7d4ee5898fe223e224a9e0fc059a452",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68ce17487e8f44179a2e11830fdd5b58/3000.jpeg"
    },
    {
      "author": "RAF CASERT",
      "description": "BEERSEL, Belgium (AP) — The far-right Flemish Interest party had set up the demonstration in the picture-pretty rolling fields south of Brussels, ahead of the four-day European Union election starting Thursday.",
      "publishedAt": "2024-06-04T04:09:12Z",
      "title": "Tractors rumble in streets again ahead of EU polls. Farming is a big issue and the far right pounces",
      "url": "https://apnews.com/08e805b47b8a1f8ba9117cc17ba7b428",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79ccb167b5034a1cb23fb5e7d76e971d/1920.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "MEXICO CITY (AP) — Mexico’s newly elected president, the first woman to win the job, faces a long list of challenges, including persistent cartel violence, a deeply divided country, cash-straitened social programs and the long shadow of her mentor, outgoing President Andrés Manuel López Obrador.",
      "publishedAt": "2024-06-04T04:08:06Z",
      "title": "Mexico’s next president faces 3 pressing challenges: money, dialogue and the US election",
      "url": "https://apnews.com/8516bc1d399096367827c511132fedb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8200569cba634b39ae8d182bff9a847f/3000.jpeg"
    },
    {
      "author": "KEN MORITSUGU and KANIS LEUNG",
      "description": "BEIJING (AP) — Checkpoints and rows of police vehicles lined a major road leading to Beijing's Tiananmen Square on Tuesday as China heightened security on the 35th anniversary of a bloody crackdown on pro-democracy protests.",
      "publishedAt": "2024-06-04T04:44:54Z",
      "title": "Silence and heavy security in China and Hong Kong mark 35th anniversary of Tiananmen crackdown",
      "url": "https://apnews.com/e5dcd3454ecb7e0ce558681da020afe0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d62171e4d4de43179a732ea5a38ecbf4/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET and DANICA KIRKA",
      "description": "COLLEVILLE-SUR-MER, France (AP) — World War II veterans from the United States, Britain and Canada are in Normandy this week to mark 80 years since the D-Day landings that helped lead to Hitler’s defeat.",
      "publishedAt": "2024-06-04T08:20:24Z",
      "title": "Centenarian veterans are sharing their memories of D-Day, 80 years later",
      "url": "https://apnews.com/796b6ca453660a32e7925c1191205b81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58e792a387b14621b4fb9009c5f86700/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER and HALELUYA HADERO",
      "description": "BERLIN (AP) — When Michael Bommer found out that he was terminally ill with colon cancer, he spent a lot of time with his wife, Anett, talking about what would happen after his death.She told him one of the things she'd miss most is being able to ask him questions whenever she wants because he is so well read and always shares his wisdom, Bommer recalled during a recent interview with The Associated Press at his home in a leafy Berlin suburb.",
      "publishedAt": "2024-06-04T04:17:51Z",
      "title": "Mourners can now speak to an AI version of the dead. But will that help with grief?",
      "url": "https://apnews.com/19820aa174147a82ef0b762c69a56307",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccb72a0430d943b099356368dbe798f4/1920.jpeg"
    },
    {
      "author": "DAVID BILLER",
      "description": "UBERABA, Brazil (AP) — Brazil has hundreds of millions of cows, but one in particular is extraordinary. Her massive, snow-white body is watched over by security cameras, a veterinarian and an armed guard.",
      "publishedAt": "2024-06-04T04:02:17Z",
      "title": "She's the world's most expensive cow, and part of Brazil's plan to put beef on everyone's plate",
      "url": "https://apnews.com/9d58844f3e695ce878da838c10280f0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f063140ef39c4fc1942624366b315eeb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}