{
  "articles": [
    {
      "author": "CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — Reproductive freedom took center stage during Biden’s State of the Union address, but abortion rights advocates had mixed reactions, raising concerns about the president trying to capitalize on what will be a central campaign issue while avoiding using the word “abortion.”",
      "publishedAt": "2024-03-10T14:29:19Z",
      "title": "Biden's big speech showed his uneasy approach to abortion, an issue bound to be key in the campaign",
      "url": "https://apnews.com/494af752992ba88fa6e3d53fbd54f716",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52f9a5f6b67a42be9db6a15c11210d8b/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A U.S. Army vessel carrying equipment to build a temporary pier in Gaza was heading to the Mediterranean on Sunday, after U.S. President Joe Biden announced plans to increase aid deliveries by sea to the besieged enclave where hundreds of thousands of Palestinians are going hungry.",
      "publishedAt": "2024-03-10T08:14:04Z",
      "title": "An effort to get aid to Gaza by sea is moving ahead. But the first ship is still waiting in Cyprus",
      "url": "https://apnews.com/cf0b639c9996715a1dc611c3d74b6a12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f83e5cb3b08a489a8f2c974d44e32bab/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, TIA GOLDENBERG and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden has stepped up public pressure on Israeli Prime Minister Benjamin Netanyahu’s government, warning he's “hurting Israel” and speaking candidly about “come to Jesus” conversations with the leader over the growing humanitarian crisis in Gaza.",
      "publishedAt": "2024-03-10T19:46:22Z",
      "title": "Biden cajoles Netanyahu with tough talk, humanitarian concerns but Israeli PM remains dug in",
      "url": "https://apnews.com/0f23fa8d02288c1b9d862ddc4035872e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/894c8922b7a3421197ad6ba28a2361ba/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Officials saw the crescent moon Sunday night in Saudi Arabia, home to the holiest sites in Islam, marking the start of the holy fasting month of Ramadan for many of the world's 1.8 billion Muslims.",
      "publishedAt": "2024-03-10T15:22:16Z",
      "title": "Muslims spot Ramadan crescent moon in Saudi Arabia, meaning month of fasting starts Monday for many",
      "url": "https://apnews.com/5fd52c4a981e3d61bd86432ae734aeb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d917e1452cb453981a19afb0a5565f9/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Ukrainian and allied officials Sunday criticized Pope Francis for saying that Kyiv should have the “courage” to negotiate an end to the war with Russia, a statement many interpreted as a call for Ukraine to surrender.",
      "publishedAt": "2024-03-10T13:05:12Z",
      "title": "Pope Francis' 'white flag' comment is met by criticism from Ukraine and its allies",
      "url": "https://apnews.com/488ac1d4c5ae86cb34dcae2ab2dade12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c666b78d9dcb45b2853c5b29c33ae925/3000.jpeg"
    },
    {
      "author": "EVENS SANON",
      "description": "PORT-AU-PRINCE, Haiti (AP) — The U.S. military said Sunday that it had flown in forces to beef up security at the U.S. Embassy in Haiti and allow nonessential personnel to leave.The aircraft flew to the embassy compound, the U.S.",
      "publishedAt": "2024-03-10T15:40:24Z",
      "title": "US forces fly in to beef up security at embassy in Haiti and evacuate nonessential personnel",
      "url": "https://apnews.com/1b720280fa85c87ccf0768d3156dbd23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/257cfee6ce0844a0abc792cf5418b712/3000.jpeg"
    },
    {
      "author": "BARRY HATTON",
      "description": "LISBON, Portugal (AP) — An exit poll in Portugal’s general election Sunday suggested that the race was too close to call, with two moderate mainstream parties apparently poised to gather the most votes amid a predicted surge in support for a radical right populist party that could place third.",
      "publishedAt": "2024-03-10T05:06:02Z",
      "title": "An exit poll in Portugal’s election suggests the result is too close to call as populists surge",
      "url": "https://apnews.com/2507301c18e4bbe3c8a84152bef07fc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/574ba86b40c148c190aa49ffa59c5e51/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "LOS ANGELES (AP) — Protests over over Israel’s war in Gaza snarled traffic around the Academy Awards on Sunday, slowing stars' arrival at the red carpet and turning the Oscar spotlight toward the ongoing conflict.",
      "publishedAt": "2024-03-10T05:00:57Z",
      "title": "Protests over Israel's war in Gaza snarl traffic outside Oscars",
      "url": "https://apnews.com/e72ce0ad9d9fbb77cb43770766b2042d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e89564e2fc5c40d6adc9a6ea116e9180/1920.jpeg"
    },
    {
      "author": "JOSH KELETY/AP, ERIC SCICCHITANO/CNHI NEWS and CARSON GERBER/CNHI NEWS",
      "description": "HUNTSVILLE, Ala. (AP) — Dana Holladay-Hollifield has worked as a nurse in Alabama for years, but never was her pay as low as it was at Huntsville Hospital.She wondered what executives at the not-for-profit facility were making, so she filed a public records request to find out.",
      "publishedAt": "2024-03-10T05:05:24Z",
      "title": "Nationwide review finds patchwork, ‘broken’ systems for resolving open records disputes",
      "url": "https://apnews.com/58becea049a4eb5fac688e8aee1aac0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67122db6212441448451a996504d2be2/2000.jpeg"
    },
    {
      "author": "PETE IACOBELLI",
      "description": "GREENVILLE, S.C. (AP) — MiLaysia Fulwiley scored a career-high 24 points including four 3-pointers as No. 1 South Carolina held off No. 8 LSU 79-72 to win the Southeastern Conference Tournament title Sunday, a victory marred by a fourth-quarter fight that led to Gamecocks leading scorer and rebounder Kamilla Cardoso being ejected.",
      "publishedAt": "2024-03-10T21:47:18Z",
      "title": "No. 1 South Carolina wins SEC Tournament over No. 8 LSU 79-72 in game marred by skirmish, ejections",
      "url": "https://apnews.com/2219ca43c3abec34b94dcd1b179029b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1dd67b45b89b4b7d88e5edf7e6f3b917/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}