{
  "articles": [
    {
      "author": "JACQUES BILLEAUD and ANITA SNOW",
      "description": "PHOENIX (AP) — Arizona will soon join 14 other states that have banned abortion at all stages of pregnancy, a change triggered by a state Supreme Court ruling Tuesday that found officials may enforce an 1864 law criminalizing all abortions except when a woman's life is at stake.",
      "publishedAt": "2024-04-09T17:19:09Z",
      "title": "Arizona can enforce an 1864 law criminalizing nearly all abortions, court says",
      "url": "https://apnews.com/9c68866d69dca38c728dd27b80592e8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ea8c470a1e447a9af34acd4c5af7727/3000.jpeg"
    },
    {
      "author": "ED WHITE",
      "description": "PONTIAC, Mich. (AP) — The first parents convicted in a U.S. mass school shooting were sentenced to at least 10 years in prison Tuesday as a Michigan judge lamented missed opportunities that could have prevented their teenage son from possessing a gun and killing four students in 2021.",
      "publishedAt": "2024-04-09T04:11:10Z",
      "title": "Michigan school shooter's parents sentenced to 10 years in prison for not stopping a 'runaway train'",
      "url": "https://apnews.com/e5888f615c76c3b26153c34dc36d5436",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de31ca0473244f0bb6d939528903710b/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A New York appeals court judge Tuesday rejected Donald Trump’s latest attempt to delay his hush money criminal trial, taking just 12 minutes to swat aside an argument that it should be postponed while the former president fights a gag order.",
      "publishedAt": "2024-04-09T15:50:50Z",
      "title": "Appeals court rejects Donald Trump's latest attempt to delay April 15 hush money criminal trial",
      "url": "https://apnews.com/0a10c7ee0236f760ce50c05cafb163ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e030e27159c4500b11350220cd1e025/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — Speaker Mike Johnson will delay sending the House's articles of impeachment against Homeland Security Secretary Alejandro Mayorkas to the Senate this week as previously planned after Republican senators requested more time Tuesday to build support for holding a full trial.",
      "publishedAt": "2024-04-09T20:28:16Z",
      "title": "House to delay sending Mayorkas impeachment articles to Senate",
      "url": "https://apnews.com/534cbf59e92c9cf141bba1ff38dc01cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83ea0cbf3ebd4ce0a5c8cacdc4ee4ac0/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — Japanese Prime Minister Fumio Kishida began a much-anticipated visit to Washington on Tuesday that spotlights shared concerns about provocative Chinese military action in the Pacific and at a rare moment of public difference between the two nations over a Japanese company's plan to buy an iconic U.S.",
      "publishedAt": "2024-04-09T04:05:08Z",
      "title": "Biden meets Japan's PM Kishida over shared concerns about China and differences on US Steel deal",
      "url": "https://apnews.com/f72d7162f0bd20c42e096c25e4b845c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c74e5c285784677ac4062147d008c2a/1920.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "The women's NCAA championship game drew a bigger television audience than the men's title game for the first time, with an average of 18.9 million viewers watching undefeated South Carolina beat Iowa and superstar Caitlin Clark, according to ratings released Tuesday.",
      "publishedAt": "2024-04-09T20:42:03Z",
      "title": "Women's NCAA title game outdraws the men's championship with an average of 18.9 million viewers",
      "url": "https://apnews.com/b592435cc286c75a7ac9278c97326ad8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d4e606220a1451ca19751862e35101f/3000.jpeg"
    },
    {
      "author": "BEN FINLEY and DENISE LAVOIE",
      "description": "NEWPORT NEWS, Va. (AP) — A former assistant principal at a Virginia elementary school has been charged with felony child neglect more than a year after a 6-year-old boy brought a gun to class and shot his first-grade teacher.",
      "publishedAt": "2024-04-09T19:49:22Z",
      "title": "Former assistant principal charged with child neglect in case of 6-year-old boy who shot teacher",
      "url": "https://apnews.com/4207c41d7cadc7ae242531017832221e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/835941a071554ed08afca61fab7d304b/2626.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "ALBANY, N.Y. (AP) — New York City will end its relationship with a medical services company tasked with housing and caring for a recent influx of international migrants, following scrutiny over the company's lucrative deal with the city and the quality of its humanitarian services.",
      "publishedAt": "2024-04-09T22:31:21Z",
      "title": "New York City to end its relationship with embattled migrant services contractor",
      "url": "https://apnews.com/048c1cb735d881ef9fecb0c2ed1aad77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81af9b7fc78e4832af413c81eb72dffc/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "U.S. Secretary of State Antony Blinken on Tuesday said Israel has not apprised the U.S. of any specific date for the start of a major offensive into the southern Gaza city of Rafah, but added that American and Israeli officials remained in contact to try to ensure that “any kind of major military operation doesn’t do real harm to civilians.”",
      "publishedAt": "2024-04-09T07:02:01Z",
      "title": "The Latest | Blinken says Israel hasn't told US of any specific date for Rafah ground invasion",
      "url": "https://apnews.com/69ef99967e002cdb3c23924916561e52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4d6e21a60104798980431df09f60d53/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Vatican has issued a new document rejecting the concept of changing one’s biological sex – a setback for transgender people who had hoped Pope Francis might be setting the stage for a more welcoming approach from the Catholic Church.",
      "publishedAt": "2024-04-09T18:31:14Z",
      "title": "Transgender inclusion? World's major religions take varying stances on policies toward trans people",
      "url": "https://apnews.com/804a93f0db2a6eeff84159665078e494",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b967492b10b4bb9b5062b5efde2212a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}