{
  "articles": [
    {
      "author": "COLLEEN LONG, ZEKE MILLER and LISA MASCARO",
      "description": "WILMINGTON, Del. (AP) — To a defiant President Joe Biden, the 2024 election is up to the public — not the Democrats on Capitol Hill.",
      "publishedAt": "2024-07-06T15:45:18Z",
      "title": "To a defiant Biden, the 2024 race is up to the voters, not to Democrats on Capitol Hill",
      "url": "https://apnews.com/25a863ba1ca3d6d01d8cc69a61274321",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b91e3c88b23a4de590066fc9d67480c9/3000.jpeg"
    },
    {
      "author": "BARBARA SURK and HELENA ALVES",
      "description": "PARIS (AP) — Voting is underway in mainland France on Sunday in pivotal runoff elections that could hand a historic victory to Marine Le Pen’s far-right National Rally and its inward-looking, anti-immigrant vision — or produce a hung parliament and political deadlock.",
      "publishedAt": "2024-07-07T04:00:38Z",
      "title": "France is voting in a key election that could force Macron to share power with the far right",
      "url": "https://apnews.com/08f10a7416a2494c85dcd562f33401d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b26178815bad4f8596888b8758d80653/1920.jpeg"
    },
    {
      "author": "CLAIRE RUSH, REBECCA BOONE and SCOTT SONNER",
      "description": "LAS VEGAS (AP) — Roughly 130 million people were under threat over the weekend and into next week from a long-running heat wave that broke or tied records with dangerously high temperatures and is expected to shatter more from East Coast to West Coast, forecasters said.",
      "publishedAt": "2024-07-07T04:24:47Z",
      "title": "Torrid heat bakes millions of people in large swaths of US, setting records and fanning wildfires",
      "url": "https://apnews.com/f64b0459aaf83e0a4a12ab6d5e626bb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f4647201c0b42ed8051c90405555a39/1920.jpeg"
    },
    {
      "author": "JUAN LOZANO and JIM VERTUNO",
      "description": "HOUSTON (AP) — Beryl was hurtling across the warm waters of the Gulf of Mexico on a collision course with Texas, forecast to pick up strength and regain hurricane status before nearing the coast Sunday and making landfall the following day with heavy rains, howling winds and dangerous storm surge.",
      "publishedAt": "2024-07-07T04:06:37Z",
      "title": "Beryl bears down on Texas, where it is expected to hit after regaining hurricane strength",
      "url": "https://apnews.com/a01a44797f9de77a54b3a8be454ea37f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb87a92c0ab04c6a86584fec77eefc08/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza (AP) — Hamas has given its initial approval of a U.S.-backed proposal for a phased cease-fire deal in Gaza, dropping a key demand that Israel commit up front to a complete end to the war, a Hamas official and an Egyptian official said Saturday.",
      "publishedAt": "2024-07-06T11:11:26Z",
      "title": "Hamas clears the way for a possible cease-fire in Gaza after dropping key demand, officials say",
      "url": "https://apnews.com/77910b6fae70ac1ff4eb3ac278852b44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54ef47a093204a00b2f26544e416c232/1920.jpeg"
    },
    {
      "author": "OHAD ZWIGENBERG",
      "description": "RAFAH, Gaza Strip (AP) — Two months ago, before Israeli troops invaded Rafah, the city sheltered most of Gaza's more than 2 million people.",
      "publishedAt": "2024-07-07T09:46:16Z",
      "title": "Rafah is a dusty, rubble-strewn ghost town 2 months after Israel invaded to root out Hamas",
      "url": "https://apnews.com/a30f9f2fbad8439be94e1b9f12ae9609",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2717f24da80e4fcd985087a998cac638/3000.jpeg"
    },
    {
      "author": "DESMOND TIRO",
      "description": "MACHAKOS, Kenya (AP) — With dismay, Martha Waema and her husband surveyed their farm that was submerged by weeks of relentless rainfall across Kenya.",
      "publishedAt": "2024-07-07T06:21:34Z",
      "title": "Kenya's dramatic flooding sweeps away a central part of the economy: Its farms",
      "url": "https://apnews.com/5f553ebd351965d60714946b4ebe1e80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25364aa7b74d49d2865443dda1d4bdaf/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "JOANETES, Spain (AP) — Xavier Pallàs plants his feet on the belfry floor, grips the rope, and with one tug fills the lush Spanish valley below with the reverberating peal of a church bell.Clang-clong!",
      "publishedAt": "2024-07-07T04:56:25Z",
      "title": "Church bells speak again in Spain thanks to effort to recover the lost 'language' of ringing by hand",
      "url": "https://apnews.com/316a9fcb69b01f239e915983c6c361d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb3da0e2b99f44c99d2fd3fe46f49aa3/3000.jpeg"
    },
    {
      "author": "ANTHONY McCARTNEY",
      "description": "LOS ANGELES (AP) — Jon Landau, an Oscar-winning producer who worked closely with director James Cameron on three of the biggest blockbusters of all time, “Titanic” and two “Avatar” films, has died.",
      "publishedAt": "2024-07-06T21:13:15Z",
      "title": "Jon Landau, Oscar-winning 'Titanic' and 'Avatar' producer, dies at 63",
      "url": "https://apnews.com/6596f4f361f26d2b6c222840e7f07b32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3532be28cc0401c91d7f2736011cfad/3000.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM",
      "description": "The scammers are winning.Sophisticated overseas criminals are stealing tens of billions of dollars from Americans every year, a crime wave projected to get worse as the U.S. population ages and technology like AI makes it easier than ever to perpetrate fraud and get away with it.",
      "publishedAt": "2024-07-07T04:04:12Z",
      "title": "Scammers are swiping billions from Americans every year. Worse, most crooks are getting away with it",
      "url": "https://apnews.com/f9530303e10b998720414e88430bcf6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bea0d025939249608c7f1aae7c1cc8ee/2713.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}