{
  "articles": [
    {
      "author": null,
      "description": "LONDON (AP) — World Health Organization says mpox is now a global emergency, with cases in 13 African countries and new form spreading.",
      "publishedAt": "2024-08-14T17:26:57Z",
      "title": "World Health Organization says mpox is now a global emergency, with cases in 13 African countries and new form spreading",
      "url": "https://apnews.com/3323555d1f1c38cae1fdf7a4a200d1ed",
      "urlToImage": ""
    },
    {
      "author": "BILL BARROW",
      "description": "ASHEVILLE, N.C. (AP) — Donald Trump will have another opportunity Wednesday to recalibrate his presidential comeback bid, this time with a rally and speech in North Carolina that his campaign is billing as a significant economic address.",
      "publishedAt": "2024-08-14T04:08:31Z",
      "title": "Donald Trump is going to North Carolina for an economic speech. Can he stick to a clear message?",
      "url": "https://apnews.com/bc81b98a425e46c32065c02650b2b44c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55ae1678a4a94b9ba8d6d97037aee21e/3000.jpeg"
    },
    {
      "author": "DAN MERICA, NICHOLAS RICCARDI and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden, watching tens of thousands of migrants from Central America reach the U.S.-Mexico border just a few months into his administration, tapped his second-in-command to help address the influx — a decision that has exposed Vice President Kamala Harris to one of her biggest political liabilities.",
      "publishedAt": "2024-08-14T04:13:32Z",
      "title": "Presented with rise in border crossings, Kamala Harris chose a long-term approach to the problem",
      "url": "https://apnews.com/46d23ad3b0e8a1780ac0a6a306120b3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/911e244df70841ba9ea2bc91b36677f2/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "DOHA, Qatar (AP) — A top Hamas official said the Palestinian militant group is losing faith in the United States’ ability to mediate a cease-fire in Gaza ahead of a new round of talks scheduled for this week amid mounting pressure to bring an end to the 10-month-old war with Israel.",
      "publishedAt": "2024-08-14T15:44:47Z",
      "title": "Top Hamas official says group is losing faith in US as mediator in Gaza cease-fire talks",
      "url": "https://apnews.com/8509c5e68d57c96af99653c8292180b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c00623e5d9a84e6f9bee532e23c220fb/2340.jpeg"
    },
    {
      "author": "MICHAEL HILL and SEAN MURPHY",
      "description": "ALBANY, N.Y. (AP) — Robert F. Kennedy Jr.’s independent presidential campaign suffered a blow this week when a judge in New York invalidated his petition to put his name on the state ballot, a ruling that could potentially create problems for the candidate as he faces challenges elsewhere.",
      "publishedAt": "2024-08-14T17:11:31Z",
      "title": "Ruling that bounced Kennedy from New York ballot could challenge him in other states",
      "url": "https://apnews.com/f96d46318524fad967271fed292aa212",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af51d1297fa84f7db125b6ba3b3c6471/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Year-over-year inflation reached its lowest level in more than three years in July, the latest sign that the worst price spike in four decades is fading and setting up the Federal Reserve for an interest rate cut in September.",
      "publishedAt": "2024-08-14T04:01:20Z",
      "title": "Annual US inflation falls to 3-year low, clearing the way for the Fed to begin cutting rates",
      "url": "https://apnews.com/f8de2672173407d3a126cc13493fed85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f7bffd6f1be4f55b8b54a1d223b3405/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and EMMA BURROWS",
      "description": "KYIV, Ukraine (AP) — Ukrainian forces pushed on with their major cross-border advance into Russia’s Kursk region for a second week Wednesday, claiming that they took more ground, captured more Russian prisoners and destroyed a bomber in attacks on military airfields.",
      "publishedAt": "2024-08-14T10:14:28Z",
      "title": "Ukraine says it has taken more ground and prisoners during its advance into Russia border region",
      "url": "https://apnews.com/6f65e2d6b295e898f4a59118a2c0c735",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0ad8e72c5c41a3b5324453821e6f80/1920.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "WASHINGTON (AP) — The ancient ritual meaning of Stonehenge is still a mystery, but researchers are one step closer to understanding how the famous stone circle was created.",
      "publishedAt": "2024-08-14T15:01:54Z",
      "title": "Stonehenge's 'altar stone' originally came from Scotland and not Wales, new research shows",
      "url": "https://apnews.com/7f0896476ac8e2b955224377ff9f661e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dfadee7045e473aa0300491a22cb95e/1920.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "COLUMBIA, S.C. (AP) — The appeals are just beginning for disgraced former South Carolina attorney Alex Murdaugh, who is almost three years into a life sentence without parole for killing his wife and son.",
      "publishedAt": "2024-08-14T17:06:52Z",
      "title": "3 years into a life sentence, Alex Murdaugh to get his day before the South Carolina Supreme Court",
      "url": "https://apnews.com/27c287f28219a565a47fb3b6bbf47f5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97edaf8d009146c0a30148f7b17eb995/3000.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — The World Health Organization has declared the mpox outbreaks in Congo and elsewhere in Africa a global emergency, with cases confirmed among children and adults in more than a dozen countries and a new form of the virus spreading.",
      "publishedAt": "2024-08-14T17:30:34Z",
      "title": "WHO declares mpox outbreaks in Africa a global health emergency as a new form of the virus spreads",
      "url": "https://apnews.com/cc9bdf31b49d06bec5efd44fb55d5e42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eee214ff801a4897a20efc56e7b362b9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}