{
  "articles": [
    {
      "author": null,
      "description": "Several people have been killed at a school in the Austrian city of Graz on Tuesday, authorities said. Police said they deployed to the school after shots were heard there. The Interior Ministry said there were several fatalities but did not specify how many. There was also no immediate information on any injuries or on the status of the perpetrator. Special forces were among those sent to the high school after a call at 10 a.m. Graz, Austria’s second-biggest city, is located in the southeast of the country and has about 300,000 inhabitants.",
      "publishedAt": "2025-06-10T08:54:11Z",
      "title": "Several people dead in a shooting at a school in the Austrian city of Graz",
      "url": "https://apnews.com/article/austria-graz-school-police-deployment-43bc60f2016faa40f8a73dfa372b8a1a",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "President Donald Trump has authorized the deployment of an additional 2,000 National Guard members to help respond to protests in Los Angeles over immigration raids. The authorization followed mostly peaceful protests Monday. The 2,000 Guard members are an addition to the 2,100 Guard troops the president previously mobilized for the protests Sunday morning. Trump also deployed 700 Marines to help them Monday. Gov. Gavin Newsom called the deployments reckless and “disrespectful to our troops.\" Trump said Monday that the city would have been “completely obliterated” if he had not deployed the Guard.",
      "publishedAt": "2025-06-10T05:34:56Z",
      "title": "Marines deployed to LA to respond to immigration protests",
      "url": "https://apnews.com/article/los-angeles-protests-ice-national-guard-9dfd2d025070bb6060d908dd3cf9b1f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e867fc/2147483647/strip/true/crop/8172x4597+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F2c%2F240e2cf4aad83dc1c20040efda7d%2Fcf8990a828ee4430972f17bf4e2786f0"
    },
    {
      "author": null,
      "description": "President Donald Trump is moving swiftly to act on his immigration promises with little internal restraint, determined to test the bounds of his executive authority in order to fulfill the promises of his reelection campaign. He's gone as far as ordering the California National Guard over the objections of the state's governor, the first time in 60 years that has happened. But the president is betting that Americans are on his side. He told reporters his administration had “no choice” because if they hadn't acted, “that place would be burning down.”",
      "publishedAt": "2025-06-09T22:48:35Z",
      "title": "Trump pushes ahead with deportations in face of LA protests",
      "url": "https://apnews.com/article/donald-trump-california-immigration-customs-enforcement-newsom-0482a8935419d88986b890b18db5cc03",
      "urlToImage": "https://dims.apnews.com/dims4/default/cfc888d/2147483647/strip/true/crop/3780x2126+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2Fa0%2F740405e869388beacbc592191eca%2F38eebcfae27d417f82766e3a87903d97"
    },
    {
      "author": null,
      "description": "Ukrainian officials say two people were killed and thirteen wounded when Russia attacked the country with waves of drones and missiles. The attack early Tuesday struck the capital, Kyiv, and the southern port city of Odesa. President Volodymyr Zelenskyy called it “one of the biggest” in the more than three-year-old war. Explosions and the buzzing of drones were heard for hours in Kyiv. The fresh Russian attacks followed Russia's biggest overnight drone bombardment of Ukraine in the three-year war. Russia has been launching a record-breaking number of drones and missiles targeting Ukraine while the two countries continue to swap prisoners of war, the only tangible outcome of direct peace talks. A ceasefire, long sought by Kyiv, remains elusive.",
      "publishedAt": "2025-06-10T05:37:45Z",
      "title": "Russia attacks Ukraine with drones and missiles, killing 2",
      "url": "https://apnews.com/article/ukraine-russia-drones-attack-kyiv-odesa-a885df12bc7040cbbc4897b7bddf165f",
      "urlToImage": "https://dims.apnews.com/dims4/default/5686e92/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2Fdc%2F7522eba2ac3afc670b1688abdd89%2F9b2fca79e7334a4f804a2e35ee970c61"
    },
    {
      "author": null,
      "description": "Activist Greta Thunberg is being deported from Israel, Israel’s Foreign Ministry said Tuesday, after the Gaza-bound ship she was on was seized by the Israeli military. In a post on X, the Foreign Ministry shared a photo of Thunberg on a plane, saying that she was headed for France. Thunberg was one of 12 passengers on board the Madleen, a boat carrying aid destined for people in war-torn Gaza. The activists said they were protesting the ongoing war and the humanitarian crisis in Gaza. Israel says such ships violate its naval blockade of Gaza.",
      "publishedAt": "2025-06-10T07:12:28Z",
      "title": "Israel deports Greta Thunberg after seizing the Gaza-bound ship she was on",
      "url": "https://apnews.com/article/thunberg-deported-mideast-gaza-israel-7d6868f213dfcf78969f8e3d982788c6",
      "urlToImage": "https://dims.apnews.com/dims4/default/7dc5f28/2147483647/strip/true/crop/4201x2363+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2Fbe%2Fcdf95d1118e2e5b03413f490bb76%2Ff3acc905ea994a0c9fcc01045e7512d9"
    },
    {
      "author": null,
      "description": "The Pentagon is scrambling to establish rules to guide U.S. Marines who could be faced with the rare and difficult prospect of using force against citizens on American soil, now that the Trump administration is deploying active duty troops to the immigration raid protests in Los Angeles. U.S. Northern Command said Monday that it's sending 700 Marines into the Los Angeles area to protect federal property and personnel. A U.S. official says troops will be armed with their normal service weapons but will not be carrying tear gas. They also will have protective equipment such as helmets, shields and gas masks.",
      "publishedAt": "2025-06-09T22:46:13Z",
      "title": "Pentagon draws up rules for Marines deployed to LA protests",
      "url": "https://apnews.com/article/marines-protests-california-deployed-trump-503e1de25b45c760218d8ae879c8d2d3",
      "urlToImage": "https://dims.apnews.com/dims4/default/a347351/2147483647/strip/true/crop/3254x1830+0+170/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F48%2Fdfe1397b3726a8a29a13e4695258%2F1b47784e144645c7a4d2ddcf736f086e"
    },
    {
      "author": null,
      "description": "President Donald Trump’s new ban on travel to the United States by citizens from 12 mainly African and Middle Eastern countries is now in effect. The ban took effect on Monday and comes as tensions escalate over the president’s campaign of immigration enforcement. Trump signed the new proclamation last week. It applies to citizens of Afghanistan, Myanmar, Chad, the Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. It also imposes heightened restrictions on people from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela who are outside the U.S. and don’t hold a valid visa.",
      "publishedAt": "2025-06-08T18:26:49Z",
      "title": "Trump's new travel ban takes effect",
      "url": "https://apnews.com/article/trump-travel-ban-immigration-enforcement-visas-b1eb79c7b5717c96daf51e978db83d1b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a1a146/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F24%2F798081743f495a251f64db83f53f%2F145a13541b364c1b80157b28574a4457"
    },
    {
      "author": null,
      "description": "Health Secretary Robert F. Kennedy Jr. has removed every member of a scientific committee that advises the Centers for Disease Control and Prevention on how to use vaccines. He is pledging to replace them with his own picks. The 17-member Advisory Committee on Immunization Practices had been in a state of flux since Kennedy took over. He recently took the unusual step of changing COVID-19 recommendations without first consulting the panel. Kennedy says the committee members had too many conflicts of interest.",
      "publishedAt": "2025-06-09T21:12:29Z",
      "title": "RFK Jr. ousts ACIP group that advises CDC on vaccines",
      "url": "https://apnews.com/article/kennedy-cdc-acip-vaccines-3790c89f45b6314c5c7b686db0e3a8f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c043c4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fe2%2F28c228082ac7fec6650f9b798653%2F0e0d4807b56a45ecb350f4a6f2f449be"
    },
    {
      "author": null,
      "description": "Defense Secretary Pete Hegseth is expected to field sharp questions from members of Congress about his tumultuous start as Pentagon chief in a series of hearings beginning Tuesday. He's likely to be asked about his sharing of sensitive military details over a Signal chat. Lawmakers have made it clear they are unhappy that Hegseth has not provided details on the administration’s first proposed defense budget, which President Donald Trump has said would total $1 trillion. It will be members’ first chance to ask about a myriad of other controversial spending by the Pentagon and the deployment of troops to quell protests in Los Angeles.",
      "publishedAt": "2025-06-10T04:07:42Z",
      "title": "Hegseth faces Congress for first time since Signal leaks",
      "url": "https://apnews.com/article/pentagon-congress-hegseth-signal-hearings-c53cd37c2eae4327dd74e4c717057469",
      "urlToImage": "https://dims.apnews.com/dims4/default/c17bcef/2147483647/strip/true/crop/4004x2252+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F08%2Fabddb42d7a5bb289b5a6c59ec028%2F709d6e04dd1d48e0ba9128f7a3bf936b"
    },
    {
      "author": null,
      "description": "After stumbling out of the starting gate in Big Tech’s pivotal race to capitalize on artificial intelligence, Apple tried to regain its footing Monday during a developers conference that focused mostly on incremental advances and cosmetic changes in its technology. The presummer rite was more subdued than the feverish anticipation that surrounded the event in 2023 when Apple unveiled a mixed-reality headset and last year when the company hyped AI features that didn't pan out as envisioned. Although Apple announced helpful AI tools and the biggest redesign of its iPhone software in a decade, it's still facing questions about its ability to innovate and navigate a gauntlet of other challenges.",
      "publishedAt": "2025-06-09T04:01:06Z",
      "title": "Apple unveils 'liquid glass,' iOS 26 and more at WWDC",
      "url": "https://apnews.com/article/apple-conference-iphone-artificial-intelligence-ba918c2091e0d49a8b3f164e4f980b6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/07a632d/2147483647/strip/true/crop/7159x4027+0+373/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2Fb7%2F1df632affa2dbd88e7f0563f72fd%2Ff58d5174742a4609998994101e12439d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}