{
  "articles": [
    {
      "author": "EMILY TATE SULLIVAN of EdSurge",
      "description": "PUEBLO, Colo. (AP) — Standing in her living room, Isabel Valencia sets up her makeshift tennis serve with the materials on hand: a green balloon for a ball and a ruler affixed to a paper plate for a racket.",
      "publishedAt": "2024-05-29T07:00:28Z",
      "title": "Quality early education can be expensive or hard to find. Home visits bring it to more families",
      "url": "https://apnews.com/2d928d971e4a0bb6e2feb89bb619e8f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9f207070dee4f72810e90e16796253d/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump sought to move past his historic criminal conviction on Friday and build momentum for his bid to return to the White House with fierce attacks on the judge who oversaw the case, the prosecution’s star witness and the criminal justice system as a whole.",
      "publishedAt": "2024-05-31T04:07:16Z",
      "title": "Trump tries to move past his guilty verdict by attacking the criminal justice system",
      "url": "https://apnews.com/4629840240cb308c5eae335532ad17ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daa301150efc4ddaba50cb84c77c946d/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Will Donald Trump go to prison? Could he pardon himself? What about the election? The first criminal conviction of a former American president raises a host of legal and political questions.",
      "publishedAt": "2024-05-31T19:08:19Z",
      "title": "Answers to your questions about Donald Trump's historic hush money trial conviction",
      "url": "https://apnews.com/d4ed0607e8642e7e1aa598e52cc6d94b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f80d48041ce0442dba6975632bd8286a/3000.jpeg"
    },
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — The bravado behind Donald Trump' s boastful hypothesis in 2016 — “I could stand in the middle of Fifth Avenue and shoot somebody and I wouldn’t lose any voters\" — is headed for a real-world reckoning.",
      "publishedAt": "2024-05-31T17:20:27Z",
      "title": "Trump carries the stain of conviction like a crown. Will the verdict matter to voters?",
      "url": "https://apnews.com/99e6c20007751075a81e87a616861ed4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daa301150efc4ddaba50cb84c77c946d/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, CHRIS MEGERIAN and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden on Friday detailed a three-phase deal proposed by Israel to Hamas militants that he says would lead to the release of the remaining hostages in Gaza and could end the grinding, nearly 8-month-old Mideast war.",
      "publishedAt": "2024-05-31T17:52:42Z",
      "title": "Biden details a 3-phase hostage deal aimed at winding down the Israel-Hamas war",
      "url": "https://apnews.com/58169a607d4a7c4d7fc34f43160076b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f949669885e44ddc9ac22eda6c95abf7/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The Israeli military confirmed Friday that its forces are operating in central parts of Rafah in its expanding offensive in the southern Gaza city.Israel launched its ground assault into the city on May 6, triggering an exodus of around 1 million Palestinians out of the city and throwing U.N.",
      "publishedAt": "2024-05-31T13:29:03Z",
      "title": "Israel confirms its forces are in central Rafah in expanding offensive in the southern Gaza city",
      "url": "https://apnews.com/2f603675195f80c73c593020398ed72a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a89ee1c63a643e8ac5aa8c2543255c5/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "A Florida sheriff on Friday fired a deputy who fatally shot a Black airman at his home while holding a handgun pointed to the ground, saying the deputy's life was never in danger and he should not have fired his weapon.",
      "publishedAt": "2024-05-31T21:32:44Z",
      "title": "Florida sheriff's office fires deputy who fatally shot Black airman at home",
      "url": "https://apnews.com/c616444086b39d20a80f35ba86ec531b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cebf789beb6b48be99a3f778fe9e7fe6/1920.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ and ARMANDO SOLÍS",
      "description": "COTIJA, Mexico (AP) — Mexico’s drug cartels and gangs appear to be playing a wider role in Sunday’s elections that will determine the presidency, nine governorships and about 19,000 mayorships and other local posts.",
      "publishedAt": "2024-05-31T21:28:20Z",
      "title": "Mexico's drug cartels and gangs appear to be playing a wider role in Sunday's elections than before",
      "url": "https://apnews.com/43b1689bff1b38c68e8428a74c2e9a83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fa21250ddc7461b8bb2fd058e34a1f4/2889.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV, MATTHEW LEE and KAREL JANICEK",
      "description": "KYIV, Ukraine (AP) — Germany joined the United States on Friday in authorizing Ukraine to hit some targets on Russian soil with the long-range weapons they are supplying — a significant policy change that comes as depleted Ukrainian troops are losing ground in the war.",
      "publishedAt": "2024-05-31T08:18:04Z",
      "title": "Berlin lets Ukraine use German weapons against targets in Russia after the US also eases its stance",
      "url": "https://apnews.com/9da696ff36130fe8c7033f3960eff382",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0a7188f5af946569d49044bca22dd5d/1920.jpeg"
    },
    {
      "author": "PAOLO SANTALUCIA, GIADA ZAMPANO, ANNIE RISEMBERG and BOUBACAR DIALLO",
      "description": "ROME (AP) — It was still dark and quiet outside when Ousmane Sylla performed his last prayer in the courtyard of an Italian migrant jail.“I miss my Africa very much and my mother too,” read a scribble in French on the wall nearby.",
      "publishedAt": "2024-05-31T06:24:57Z",
      "title": "Italy's migrant jails are squalid and chaotic. A young man from Guinea was desperate to escape",
      "url": "https://apnews.com/fb0892f51b4df5dd9164cea763fc74e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbadcb3d2c544a7f871dc2f40bb7b2ce/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}