{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — The Israeli military raided Gaza's largest hospital early Wednesday, conducting what it called a “precise and targeted” operation against Hamas as Israel seized broader control of northern Gaza, including capturing the territory's legislature building and its police headquarters.",
      "publishedAt": "2023-11-14T07:55:45Z",
      "title": "Israeli military forces raid Gaza's largest hospital in operation against Hamas",
      "url": "https://apnews.com/42d3e99d81672d166e720e7520796c41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b148a66f02424b35887df8ff75cb39a6/1920.jpeg"
    },
    {
      "author": "REBECCA SANTANA and MICHAEL BALSAMO",
      "description": "WASHINGTON (AP) — Supporters of Israel rallied by the tens of thousands on the National Mall under heavy security Tuesday, voicing solidarity in the fight against Hamas and crying “never again.\"The “March for Israel” offered a resounding and bipartisan endorsement of one of America's closest allies as criticism has intensified over Israel's offensive in Gaza, set off by the bloody Hamas incursion on Oct.",
      "publishedAt": "2023-11-14T19:24:21Z",
      "title": "Tens of thousands of supporters of Israel rally in Washington, crying 'never again'",
      "url": "https://apnews.com/830cb77476af80ffde431165ee01533d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14a5501091da464ba15034fb28004c12/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House voted overwhelmingly Tuesday to prevent a government shutdown after new Republican Speaker Mike Johnson was forced to reach across the aisle to Democrats when hard-right conservatives revolted against his plan.",
      "publishedAt": "2023-11-14T05:05:47Z",
      "title": "House votes to prevent a government shutdown as GOP Speaker Johnson relies on Democrats for help",
      "url": "https://apnews.com/9cb26b703804a9e82e776e44caedcaa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee34c6177b1e43819bb6a4e37ff1f922/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, COLLEEN LONG and DIDI TANG",
      "description": "SAN FRANCISCO (AP) — President Joe Biden and China's Xi Jinping swept into San Francisco on Tuesday as the two leaders made their final preparations for their first engagement in a year at a historic estate outside of the city.",
      "publishedAt": "2023-11-14T05:09:31Z",
      "title": "Biden says his goal for Xi meeting is to get US-China communications back to 'normal'",
      "url": "https://apnews.com/3da195342650591f6bb436c864e19328",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32c5dfbd8ae1445b8a8cad8b07f3d307/1920.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ",
      "description": "SAN FRANCISCO (AP) — The man accused of attacking former U.S. House Speaker Nancy Pelosi’s husband with a hammer apologized Tuesday, echoing right-wing conspiracy theories to explain to jurors that he went to the Pelosis’ home as part a bigger plot to end what he viewed as government corruption.",
      "publishedAt": "2023-11-14T05:33:15Z",
      "title": "The man accused of attacking Pelosi's husband apologizes for hammer assault",
      "url": "https://apnews.com/aeab3fb8f30fbc6a40f334033f5becf0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49c30906500f49eea5c24c4f9fbd8196/1168.jpeg"
    },
    {
      "author": "AMANDA SEITZ and KENYA HUNTER",
      "description": "WASHINGTON (AP) — Up to 30 million of the poorest Americans could be purged from the Medicaid program, many the result of error-ridden state reviews that poverty experts say the Biden administration is not doing enough to stop.",
      "publishedAt": "2023-11-14T05:24:01Z",
      "title": "The Biden administration is slow to act as millions are booted off Medicaid, advocates say",
      "url": "https://apnews.com/fe7c10276e86ab909060dd6fbea60328",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9e8075fff4649f6a21019b9a333e3b3/3000.jpeg"
    },
    {
      "author": "COREY WILLIAMS and NICHOLAS RICCARDI",
      "description": "DETROIT (AP) — A Michigan judge ruled Tuesday that former President Donald Trump will remain on the state’s primary ballot, dealing a blow to the effort to stop Trump’s candidacy with a Civil War-era Constitutional clause.",
      "publishedAt": "2023-11-14T20:59:43Z",
      "title": "Michigan judge says Trump can stay on primary ballot, rejecting challenge under insurrection clause",
      "url": "https://apnews.com/b2a870f98a60dffbe4c9566cfe97457c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be91cba939d341ff8f971aa5b3e1ea59/3000.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "LONDON (AP) — Earlier this year, the doctor who leads the World Health Organization’s efforts to prevent sexual abuse travelled to Congo to address the biggest known sex scandal in the U.N. health agency’s history, the abuse of well over 100 local women by staffers and others during a deadly Ebola outbreak.",
      "publishedAt": "2023-11-14T06:14:14Z",
      "title": "Internal documents show the World Health Organization paid sexual abuse victims in Congo $250 each",
      "url": "https://apnews.com/f0720f9c241102a220a8d5b4a7fe52cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d14aab63f74044d8ae64bf25e4d5dde8/2000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and TAMMY WEBBER",
      "description": "Revved-up climate change now permeates Americans’ daily lives with harm that is “already far-reaching and worsening across every region of the United States,\" a massive new government report says.",
      "publishedAt": "2023-11-14T10:05:37Z",
      "title": "Worsening warming is hurting people in all regions, US climate assessment shows",
      "url": "https://apnews.com/a419265bb733adcb7c62b4111028aa0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3e83e9e525842d38c1fdc4728dc0835/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "ACAPULCO, Mexico (AP) — During the first minutes of Oct. 25 when Hurricane Otis roared into Acapulco Bay with 165 mph winds, sailor Ruben Torres recorded a 10-second audio message from a yacht called the Sereno.",
      "publishedAt": "2023-11-14T05:27:12Z",
      "title": "A missing sailor's last message from Hurricane Otis was to ask his family to pray for him",
      "url": "https://apnews.com/9d804784735d916e5926271c9cde9565",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8626a334a5a24d43ac79c6c8536521e9/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}