{
  "articles": [
    {
      "author": "SAM MEDNICK",
      "description": "TEL AVIV, Israel (AP) — The bodies of three more hostages killed on Oct 7. were recovered overnight from Gaza, Israel's army said Friday, as the top United Nations court prepares to rule on whether Israel must halt its military operations and withdraw from the enclave.",
      "publishedAt": "2024-05-24T07:58:40Z",
      "title": "The bodies of 3 more hostages are recovered from Gaza by the Israeli army",
      "url": "https://apnews.com/16eb31044551df186a934dc66e3948aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/431dc1e801ed4b47aaaa68d9f0719629/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump isn’t known for letting slights pass.Yet for weeks, the famously combative presumptive Republican nominee has sat silently — to the point of sometimes seeming asleep — in a sterile Manhattan courtroom amid a barrage of accusations and insults.",
      "publishedAt": "2024-05-24T04:07:17Z",
      "title": "Trump swaps bluster for silence, and possibly sleep, in his hush money trial",
      "url": "https://apnews.com/25ebe6e0d4c3a0aac938ef55ffd681a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/224129f3612d4d6e9e363ec801508238/2000.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — The top United Nations court is ruling Friday on an urgent plea by South Africa to order Israel to halt its military operations in Gaza and withdraw from the enclave.Israel is unlikely to comply with any such order.",
      "publishedAt": "2024-05-24T07:46:21Z",
      "title": "The top UN court is set to rule on a request for it to order Israel to halt its offensive in Gaza",
      "url": "https://apnews.com/01d093d21a1eadaa31af5708cf1cbf38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83caf93cde234d58a766b7bdf97aaa93/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — As he tries to secure his legacy, President Joe Biden has unleashed a flurry of election-year rules on the environment and other topics, including a landmark regulation that would force coal-fired power plants to capture smokestack emissions or shut down.",
      "publishedAt": "2024-05-24T04:04:24Z",
      "title": "'Green blitz': As election nears, Biden pushes slew of rules on environment, other priorities",
      "url": "https://apnews.com/fec31a2f2198b776c5f24d2d9f66684b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99175255d60d440e9c6d89d5c565d852/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER and LINDSAY WHITEHURST",
      "description": "WILMINGTON, Del. (AP) — Attorneys for Hunter Biden are due in court Friday for the final hearing before the president's son is expected to stand trial on federal firearms charges in Delaware as his father's reelection campaign unfolds.",
      "publishedAt": "2024-05-24T04:03:21Z",
      "title": "Hunter Biden's lawyers are expected in court for a final hearing before his June 3 gun trial",
      "url": "https://apnews.com/61ae47f6c9296f02d1462d82b1a47897",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c59b8090f09466694c03c76df1e5998/1549.jpeg"
    },
    {
      "author": "HAU DINH",
      "description": "HANOI, Vietnam (AP) — An overnight fire in an apartment building on a narrow alley in Vietnam's capital killed 14 people and injured six others, state media said Friday.The apartment building in central Hanoi could only be accessed through an alley just 2 meters (6.5 feet) wide, preventing firetrucks from reaching it, and firefighters eventually contained the fire by using hoses, state media said.",
      "publishedAt": "2024-05-24T03:27:20Z",
      "title": "A fire in an apartment building in Hanoi, Vietnam, kills 14 people and injures 6",
      "url": "https://apnews.com/5d750cb5107ee621d1ed3ccab89f699a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fa12a05b7454f36847323e3bce43dd7/3000.jpeg"
    },
    {
      "author": null,
      "description": "THANE, India (AP) — Rescuers combed through piles of debris and wreckage Friday searching for bodies after an explosion and fire at a chemical factory in western India killed at least nine people and injured 64 others, officials said.",
      "publishedAt": "2024-05-24T04:36:01Z",
      "title": "Fire at chemical factory in India kills at least 9, with searchers looking for more victims",
      "url": "https://apnews.com/4a6047ccce9dab5e71a9a1600d77cae8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17ee5024c34245b7a48176b8d3d29271/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — More than 100 people are believed to have been killed Friday in a landslide that buried a village in a remote, mountainous part of Papua New Guinea, and an emergency response is underway, the South Pacific island nation's leader and news media said.",
      "publishedAt": "2024-05-24T04:08:19Z",
      "title": "More than 100 people believed killed by a landslide in Papua New Guinea, Australian media report",
      "url": "https://apnews.com/86fcf41e600122fd54ddcfb56bcab403",
      "urlToImage": ""
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — King Charles III won’t be out and about much over the next six weeks — and it’s not because of his ongoing cancer treatments.",
      "publishedAt": "2024-05-24T10:02:05Z",
      "title": "King Charles III won’t be out and about much over the next six weeks amid election campaign",
      "url": "https://apnews.com/207a129b3d4b62f5f364b78576267a03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/184a2c7d122f406c9928c078268f5e02/3000.jpeg"
    },
    {
      "author": "ERIC OLSON",
      "description": "The looming athlete pay system that will upend the traditional college sports model and still-to-be-determined details about how millions of dollars will be distributed are certain to bring questions about gender equity.",
      "publishedAt": "2024-05-24T10:10:40Z",
      "title": "With college athletes on cusp of revenue-sharing, there are Title IX questions that must be answered",
      "url": "https://apnews.com/6133381ab633182dd155a6338c781665",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70bdcaeedec14518a254542f860017b7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}