{
  "articles": [
    {
      "author": "MICHELLE L. PRICE and COLLEEN LONG",
      "description": "RANCHO PALOS VERDES, Calif. (AP) — Former President Donald Trump will campaign Friday in Western states as his opponent, Vice President Kamala Harris keeps her focus on one of the biggest battleground prizes in the East, Pennsylvania.",
      "publishedAt": "2024-09-13T04:06:06Z",
      "title": "Trump campaigns in Western states as Harris focuses on critical Pennsylvania",
      "url": "https://apnews.com/4d01558e10a3cbf9bd8b921971e03de2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39db3d88f80142f6a464acc46ff306ba/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — Even as she promoted her efforts to boost clean energy, Vice President Kamala Harris said in Tuesday's debate that the Biden-Harris administration has overseen “the largest increase in domestic oil production in history because of an approach that recognizes that we cannot over rely on foreign oil.″",
      "publishedAt": "2024-09-13T04:02:25Z",
      "title": "Harris supported the Green New Deal. Now, she's promoting domestic oil drilling",
      "url": "https://apnews.com/1b86dfb4297facd0b89c487724a9e5b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da8ea37e7ffe43e6a7c03a5872d81558/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG, MANUEL VALDES and LINDSEY WASSON",
      "description": "SEATTLE (AP) — Aircraft assembly workers went on strike Friday at Boeing factories in Washington, Oregon and California after union members overwhelmingly rejected a tentative contract that would have increased wages by 25% over four years.",
      "publishedAt": "2024-09-13T07:59:55Z",
      "title": "Boeing factory workers go on strike after rejecting contract offer",
      "url": "https://apnews.com/9f61a7d48675d1c3517233d40d4ec2b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f49f7b94ac314e4c8eb3ed28f90fbe35/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and JILL LAWLESS",
      "description": "Russia on Friday accused six British diplomats of spying and said it decided to expel them. The U.K. said the “completely baseless” move came weeks ago and was linked to its action in May to revoke the credentials of an attaché at the Russian Embassy and limit Moscow’s diplomatic activities in London.",
      "publishedAt": "2024-09-13T06:49:11Z",
      "title": "Russia expels 6 British diplomats it accuses of spying. The UK calls it 'completely baseless'",
      "url": "https://apnews.com/7845e3554c753388e8c952733589fb7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf9dac46a8b440ed935f0faa46d45c16/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and DIDI TANG",
      "description": "WASHINGTON (AP) — The Biden administration is cracking down on cheap products sold out of China, expanding a push to reduce U.S. dependence on Beijing and bolster homegrown industry, but that could trigger higher prices for U.S.",
      "publishedAt": "2024-09-13T13:34:04Z",
      "title": "Biden is taking on cheap products from China. It could mean higher prices",
      "url": "https://apnews.com/8dc53cf600ce03e54dcdb0877fded11e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17cdf2b631414c92851b5d9d7acaebef/3000.jpeg"
    },
    {
      "author": "JEAN-YVES KAMALE",
      "description": "KINSHASA, Congo (AP) — A military court in Congo handed down death sentences Friday to 37 people, including three Americans, after convicting them on charges of taking part in a coup attempt. The defendants, who also included a Briton, Belgian, Canadian and several Congolese, can appeal the verdict on charges that included terrorism, murder and criminal association.",
      "publishedAt": "2024-09-13T16:35:01Z",
      "title": "Congo court sentences 3 Americans and 34 others to death on coup charges",
      "url": "https://apnews.com/93ca1f26b27b0a45f239db12a3b1e1d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36b027f9459646389b6507bc5c4526ab/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "As the pregnant woman's contractions rolled in every two minutes, staff at Our Lady of the Lake Regional Medical Center in Baton Rouge, Louisiana, dispatched an ambulance to send her elsewhere.Just two minutes later, she gave birth to a 6-pound baby girl in the cab of the ambulance down the road from the 900-bed hospital.",
      "publishedAt": "2024-09-13T14:02:02Z",
      "title": "Feds rarely punish hospitals for turning away pregnant patients",
      "url": "https://apnews.com/6a0fa0a16a42e4ceb4c8c14c5cd2c0f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1f28378b6924ab49a9d0bc6216751f0/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Ismael “El Mayo” Zambada, a powerful leader of Mexico’s Sinaloa cartel, pleaded not guilty Friday in a U.S.",
      "publishedAt": "2024-09-13T04:14:14Z",
      "title": "Mexican cartel leader 'El Mayo' Zambada pleads not guilty to US charges",
      "url": "https://apnews.com/56aceeac6b7e71fca2b0c17bb320ed18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be6f02384dcb4549b3022d41986bc9fd/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "SAG HARBOR, N.Y. (AP) — Justin Timberlake pleaded guilty to impaired driving Friday, resolving the criminal case stemming from his June arrest in New York’s Hamptons.",
      "publishedAt": "2024-09-13T04:03:19Z",
      "title": "Justin Timberlake pleads guilty to impaired driving in New York",
      "url": "https://apnews.com/cef669c8c25fad277f47bd17536a2940",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b2e2fe7371043a9808c0b5a951ced0f/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "MIAMI GARDENS, Fla. (AP) — Tua Tagovailoa is now dealing with the third diagnosed concussion of his NFL career, all of them coming in the last 24 months.",
      "publishedAt": "2024-09-13T13:59:48Z",
      "title": "Tua Tagovailoa is dealing with another concussion. What we know and what happens next",
      "url": "https://apnews.com/a77486f5090c59ae5db82d9eb0356748",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57fff361a99e4d0c89b5a741fe5da950/2400.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}