{
  "articles": [
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Democrats on Capitol Hill met privately Tuesday at a crucial moment for President Joe Biden and their party, with tensions running high over the extraordinary question of whether to keep up support or urge him to step aside in light of health concerns.",
      "publishedAt": "2024-07-09T17:40:44Z",
      "title": "Biden's support on Capitol Hill hangs in the balance as Democrats meet in private",
      "url": "https://apnews.com/a8926189431d70686f2f1abdc5540fa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b08330822434e8e83a0d44402aed2cd/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — NATO leaders gathering in Washington starting Tuesday plan to shore up transatlantic support for Ukraine in its battle against Russia.",
      "publishedAt": "2024-07-09T04:06:08Z",
      "title": "Biden looks to make the case at the NATO summit that he is still up to the job of president",
      "url": "https://apnews.com/a6521773d23bd79637590fdb6526b57c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b768933509bb42e787d95ad9962594a7/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Heavy Israeli bombardment shook Gaza City on Tuesday as thousands of fleeing Palestinians searched for shelter and medical facilities were forced to shut down in the latest offensive in the territory's north.",
      "publishedAt": "2024-07-09T13:17:41Z",
      "title": "Heavy Israeli bombardment in Gaza City forces medical facilities to close as thousands flee",
      "url": "https://apnews.com/5c8eb2a36e22fb0ea7666b73e5c0b54c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0826f6f00b430f97be168369d9b108/1920.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — Former President Donald Trump is getting back on the campaign trail Tuesday, rallying voters in his home state at his flagship golf resort in a celebratory mood as Democrats face tough calls over President Joe Biden's reelection chances.",
      "publishedAt": "2024-07-09T04:12:44Z",
      "title": "Trump returns to campaign trail with VP deadline nearing amid calls for Biden to withdraw",
      "url": "https://apnews.com/6893fb5c5aac589ad83f151e49729bb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a27396a7a244c5892240598bedc8f15/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Manhattan prosecutors said Tuesday that they intend to bring new sexual assault charges against Harvey Weinstein as they anticipate a November retrial for the disgraced media mogul.",
      "publishedAt": "2024-07-09T14:33:50Z",
      "title": "NYC prosecutors intend to bring new sexual assault charges against Harvey Weinstein ahead of retrial",
      "url": "https://apnews.com/3d7151343d25ee65c3cb7849100e4fa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c48a45c988c4e3298c65f72dab18440/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Many of the millions left without power after Hurricane Beryl crashed into Texas, killing several people and unleashing flooding, sweltered and fretted Tuesday as the storm deprived them of air conditioning, food and water in dangerous heat.",
      "publishedAt": "2024-07-09T04:04:36Z",
      "title": "Beryl leaves hot misery in the Houston area. It still threatens flooding on its path northward",
      "url": "https://apnews.com/8bfeeed79444eed0bf116d09f1ea7e6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4d45f88deea425dbb9391c111998744/1920.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "OKLAHOMA CITY (AP) — Former Sen. Jim Inhofe, a conservative known for his strong support of defense spending and his denial that human activity is responsible for the bulk of climate change, has died.",
      "publishedAt": "2024-07-09T15:43:41Z",
      "title": "Former US Sen. Jim Inhofe, defense hawk who called human-caused climate change a 'hoax,' dies at 89",
      "url": "https://apnews.com/2a3ac758737845c0aa2e05ae2036005b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43bdc982fb7349658ef0c76704624a14/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "KANSAS CITY, Mo. (AP) — An appellate court has ordered the release of a Missouri woman whose murder conviction was overturned after she served 43 years in prison, but the state attorney general is still trying to keep her behind bars as the case is reviewed.",
      "publishedAt": "2024-07-09T17:43:51Z",
      "title": "Appeals court orders release of woman whose murder conviction was reversed after 43 years in prison",
      "url": "https://apnews.com/0aa17f2a099f5e6a37dcbd0f543558f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b15ca1e5ca64c418ed7928f8224266f/2000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — A Massachusetts man has regained his voice after surgeons removed his cancerous larynx and, in a pioneering move, replaced it with a donated one.Transplants of the so-called voice box are extremely rare, and normally aren't an option for people with active cancer.",
      "publishedAt": "2024-07-09T11:00:49Z",
      "title": "A rare voice box transplant helped a cancer patient speak again, part of a pioneering study",
      "url": "https://apnews.com/4feb9cb71dcb9c38837169344730832e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/480d4d11950d49c49e09b2935aa21f25/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "LONDON (AP) — Top-seeded Jannik Sinner was treated by a trainer and left the court during the third set, seemingly surged in the fourth and then faltered again in the fifth, eventually losing to Daniil Medvedev 6-7 (7), 6-4, 7-6 (4), 2-6, 6-3 in the Wimbledon quarterfinals on Tuesday.",
      "publishedAt": "2024-07-09T14:41:44Z",
      "title": "Jannik Sinner loses to Daniil Medvedev at Wimbledon after getting treatment from a trainer",
      "url": "https://apnews.com/a3ab9616ece42655a9b147bf49ca6b43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7360672d19f94769a41fcb1f1e89b163/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}