{
  "articles": [
    {
      "author": null,
      "description": "China’s Ministry of Commerce announced Tuesday it was implementing counter tariffs against the U.S. on multiple products. The government said that it would implement 15% tariff on coal and liquified natural gas products, as well as a 10% tariff on crude oil, agricultural machinery and certain vehicles. “The US’s unilateral tariff increase seriously violates the rules of the World Trade Organization,” the statement said. “It is not only unhelpful in solving its own problems, but also damages normal economic and trade cooperation between China and the US.” China’s State Administration for Market Regulation also Tuesday said it is investigating Google on suspicion of violating antitrust laws.",
      "publishedAt": "2025-02-04T05:31:25Z",
      "title": "China imposes 15% tariffs on coal, LNG in response to Trump's tariffs",
      "url": "https://apnews.com/article/china-tariffs-us-trump-150fab3a44ec055845e47c82bde544c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/62d23e0/2147483647/strip/true/crop/4347x2445+0+226/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F5c%2Fc5bc5798c932c5100d5e027ad324%2Fca44d9f84e964d7694f49ad395e64fdd"
    },
    {
      "author": "JOSH BOAK, FABIOLA SÁNCHEZ, ROB GILLIES",
      "description": "President Donald Trump is holding off on his tariff threats against Mexico and Canada for 30 days after the two U.S. neighbors agreed to boost border security efforts. Trump on Saturday had directed that 25% tariffs on most imports from the two American partners — and 10% on Canadian energy products — go into effect at midnight Tuesday. The two nations threatened retaliation of their own, raising the prospects of a broader regional trade war. In a statement on X, Canadian Prime Minister Justin Trudeau said that on a call with Trump he pledged additional cooperation on border security. It follows similar moves by Mexico earlier Monday. “Proposed tariffs will be paused for at least 30 days while we work together,” Trudeau said.",
      "publishedAt": "2025-02-03T14:58:16Z",
      "title": "Trump agrees to pause tariffs on Mexico",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-sheinbaum-trudeau-017efa8c3343b8d2a9444f7e65356ae9",
      "urlToImage": "https://dims.apnews.com/dims4/default/b61f0ae/2147483647/strip/true/crop/8120x4568+0+423/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2F40%2Fdad4bf09b0b442f32dbe02ecd246%2Fe1ac38b1defa415f8802efff4111fc08"
    },
    {
      "author": "ROB GILLIES",
      "description": "One of the world’s most durable and amicable alliances is broken. Canadians are absorbing U.S. President Donald Trump’s trade war and his threats to make Canada the 51st state. Canadians are feeling a sense of betrayal after Trump declared a trade war against America’s northern neighbor and longtime ally. Trump keeps threatening Canada’s sovereignty and vowing to put sweeping 25% tariffs on Canadian products. The ties between the two countries are without parallel. Nearly $3.6 billion Canadian, or US$2.5 billion, worth of goods and services cross the border each day. Canada is the top export destination for 36 U.S. states and 77% of Canada’s exports go to the United States.",
      "publishedAt": "2025-02-03T20:57:16Z",
      "title": "After Trump declares a trade war, Canadians grapple with a sense of betrayal",
      "url": "https://apnews.com/article/canada-trump-tariffs-e0af3e973a2d7848c2baaa6fb8021c27",
      "urlToImage": "https://dims.apnews.com/dims4/default/e20870e/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2Fd0%2F11c21eeb747e36c227032e0d8c7f%2F8a8309097fe24c8fb4516d2c1b89c572"
    },
    {
      "author": "LORNE COOK, RAF CASERT",
      "description": "European Union leaders are grappling with how to respond to the United States as it appears determined to start a trade war or even seize part of their territory. The leaders met on Monday for a defense summit. Poland's prime minister, whose country currently holds the EU’s rotating presidency, said it would “be a cruel paradox\" if amid threats from Russia and China, the EU and U.S. find themselves in conflict. President Donald Trump has threatened to impose tariffs on EU imports and refused to rule out military force to take control of Greenland. The European Commission president warns that the EU \"will respond firmly.”",
      "publishedAt": "2025-02-03T08:10:24Z",
      "title": "EU leaders scramble to avoid friction with the US under Trump and avoid a 'stupid tariff war'",
      "url": "https://apnews.com/article/eu-us-ukraine-defense-trump-greenland-tariffs-c3e454c8f0959d273c2b6dd5941395e3",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e35a1c/2147483647/strip/true/crop/5634x3169+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2Faa%2F9e208dfdbd60e7e8bc0fcfef2ee8%2Fc70e1301b2ca46368bcb0f7ec88d0cf4"
    },
    {
      "author": "BILL BARROW",
      "description": "President Donald Trump has taken executive action to impose or threaten new tariffs on imports from Canada, Mexico and China. The moves fulfill certain campaign promises but also have roiled stock markets and supply chains, while testing relations with the country’s North American neighbors and, in China’s case, the world’s second-largest economy. But Trump is also declaring initial victories as Mexican and Canadian leaders agreed to more cooperation on border control. Unlike during the 2024 campaign, when Trump billed his economic agenda as guaranteed to reduce the cost of living for Americans, the Republican president now is acknowledging what many economists have long forecasted: that his approach could yield higher prices and lower supplies across a roiled U.S. market.",
      "publishedAt": "2025-02-02T19:20:39Z",
      "title": "What to know about Trump's tariffs targeting Mexico and others",
      "url": "https://apnews.com/article/trumps-tariffs-canada-mexico-china-taxes-910cf9a18fce654597a30dbaaa8d1576",
      "urlToImage": "https://dims.apnews.com/dims4/default/25d1b64/2147483647/strip/true/crop/3000x1688+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F6e%2F8edc95838ac17634cbd62e9139ad%2F1c83fbaab2e84da4998433ecac6f262e"
    },
    {
      "author": "AAMER MADHANI, TIA GOLDENBERG",
      "description": "Donald Trump and Benjamin Netanyahu are set to meet for talks in Washington. Tuesday's White House meeting comes as the Israeli prime minister faces competing pressure from his right-wing coalition to end a temporary truce and resume the war against Hamas militants in Gaza and from war-weary Israelis who want to see remaining hostages come home and the 15-month war brought to an end. Trump is guarded about the long-term prospects for the truce, even as he takes credit for pressuring Hamas and Israel into the hostage and ceasefire agreement that went into effect on the day before he returned to power last month.",
      "publishedAt": "2025-02-04T05:02:26Z",
      "title": "Trump and Netanyahu hold talks as US president warns 'no guarantees' fragile peace in Gaza will hold",
      "url": "https://apnews.com/article/trump-netanyahu-washington-ceasefire-1c8deec4dd46177e08e07d669d595ed3",
      "urlToImage": "https://dims.apnews.com/dims4/default/10c0012/2147483647/strip/true/crop/3561x2003+0+185/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F73%2F261701097e5bf920278eb42123cf%2F82252b5244164906b2302c8f396c5940"
    },
    {
      "author": "EVENS SANON",
      "description": "Heavily armed gangs in Haiti have attacked a neighborhood that’s home to most of the country’s elite and had been largely untouched by criminals. Police have demanded help repelling the assault on Kenscoff that has killed at least 40 people. The mayor blamed the attack on the Viv Ansanm gang coalition and described gunmen going home to home and indiscriminately opening fire. Gangs already control 85% of Port-au-Prince, and the United Nations secretary-general warned last month they could overrun the capital. Gang violence has left more than 1 million people homeless across Haiti in recent years.",
      "publishedAt": "2025-02-03T20:33:48Z",
      "title": "Gangs attack a neighborhood in Haiti that's home to the country's elite",
      "url": "https://apnews.com/article/haiti-gang-violence-kenscoff-capital-97e5fd96b963670a4faf8675d1ea7310",
      "urlToImage": "https://dims.apnews.com/dims4/default/dfd9000/2147483647/strip/true/crop/5725x3220+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2Fe4%2F82facdc0fcb4bd229d89bd1e9739%2Fcc8cd8b15ebc4e4a988d072e749912d5"
    },
    {
      "author": "TODD RICHMOND",
      "description": "A woman from New Zealand says in lawsuits that British author Neil Gaiman sexually assaulted her repeatedly when she worked as a babysitter and nanny for him and his wife. Scarlett Pavlovich filed the lawsuits in federal court in Wisconsin, Massachusetts and New York. The lawsuits accuse Gaiman’s wife, Amanda Palmer, of introducing Pavlovich to Gaiman as the couple's babysitter in 2022 even though she knew he would sexually assault her. Online court records don't list an attorney for Gaiman but earlier this year he denied ever engaging in non-consensual sex. The Associated Press does not identify people who say they have been sexually assaulted unless they come forward publicly as Pavlovich has done.",
      "publishedAt": "2025-02-03T23:34:47Z",
      "title": "Woman's lawsuits say sci-fi author Neil Gaiman repeatedly sexually assaulted her",
      "url": "https://apnews.com/article/neil-gaiman-federal-lawsuits-sexual-assault-59c66061118e47af9ee8a6b94900ef46",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf62c1b/2147483647/strip/true/crop/3936x2214+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2Fd5%2F1370f580d53325cc7008e9032568%2F52fb25fa33ff4f16a2a5f46247d15ed5"
    },
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump says Americans could feel “some pain” from the emerging trade war triggered by his tariffs against Canada, Mexico and China. He's also claiming that Canada would “cease to exist” without its trade surplus with the United States. The trade penalties that Trump signed Saturday at his Florida resort are causing a mix of panic, anger and uncertainty. And they're threatening to rupture a decades-old partnership on trade in North America while further straining relations with China. But by following through on a campaign pledge, Trump may have simultaneously broken his promise to voters in last year’s election that his administration could quickly reduce inflation. The tariffs are set to launch on Tuesday.",
      "publishedAt": "2025-02-02T15:59:51Z",
      "title": "Trump says Americans could feel 'some pain' from his new tariffs",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-trade-surplus-3010e6368545e2976feb5ac6b41e528e",
      "urlToImage": "https://dims.apnews.com/dims4/default/cae9348/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2Fda%2F725a80e73ebfe411d5ef8d4f098c%2Fb7a0362c4822401e89edc6f790ef7897"
    },
    {
      "author": "MATTHEW LEE, JUAN ZAMORANO",
      "description": "U.S. Secretary of State Marco Rubio says El Salvador’s president has offered to accept deportees from the U.S. of any nationality, including violent American criminals now imprisoned in the United States. Rubio says President Nayib Bukele “has agreed to the most unprecedented, extraordinary, extraordinary migratory agreement anywhere in the world.\" Rubio adds, “He’s also offered to do the same for dangerous criminals currently in custody and serving their sentence in the United States even though they’re U.S. citizens or legal residents.” A U.S. official said after Rubio spoke that the Trump administration had no plans to try to deport American citizens but that the offer was significant. The U.S. government cannot deport American citizens.",
      "publishedAt": "2025-02-03T14:00:45Z",
      "title": "Rubio says El Salvador offers to accept deportees from US of any nationality, including Americans",
      "url": "https://apnews.com/article/migration-rubio-panama-colombia-venezuela-237f06b7d4bdd9ff1396baf9c45a2c0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d6ecf03/2147483647/strip/true/crop/7013x3945+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2F3d%2F7a52114ef930134f0f812b14f520%2Faf4512a52b9348038c007b834e0381fa"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}