{
  "articles": [
    {
      "author": "WAFAA SHURAFA, NAJIB JOBAIN and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A four-day cease-fire in Gaza between Israel and Hamas was set to begin Friday morning, Qatar said, a day later than originally announced, as negotiators worked out final details of the deal, which is to bring the release of dozens of hostages held by militants and Palestinians imprisoned by Israel.",
      "publishedAt": "2023-11-23T06:50:08Z",
      "title": "Qatar says Gaza cease-fire will begin Friday morning, with aid to follow 'as soon as possible'",
      "url": "https://apnews.com/fae556c7bdcc5d120b7617d72238b26e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7857b842e3bf429aa167cbeff35f968d/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — Israel's military offensive has turned much of northern Gaza into an uninhabitable moonscape. Whole neighborhoods have been erased.",
      "publishedAt": "2023-11-23T13:55:13Z",
      "title": "Gaza has become a moonscape in war. When the battles stop, many fear it will remain uninhabitable",
      "url": "https://apnews.com/f299a28410b70ee05dd764df97d8d3a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5eb01e60d1e44183a9ff5302b8f0d3b5/3000.jpeg"
    },
    {
      "author": "RAF CASERT",
      "description": "BRUSSELS (AP) — If ever the hard right in Europe needed a set of jumper cables to rev up their electoral engine again in the wake of last month's major setback in Poland, Geert Wilders in the Netherlands provided it.",
      "publishedAt": "2023-11-23T14:33:39Z",
      "title": "Europe's far-right populists buoyed by Wilders' win in Netherlands, hoping the best is yet to come",
      "url": "https://apnews.com/c8617a97a03011f98ed898ce863b579f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0576ecc7f5a3402ca6af40e8a6970e73/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI",
      "description": "BUENOS AIRES, Argentina (AP) — Former President Donald Trump has told Argentina’s President-elect Javier Milei that he plans to travel to the South American country so the two can meet, Milei's office said Thursday.",
      "publishedAt": "2023-11-23T16:15:33Z",
      "title": "Trump tells Argentina's President-elect Javier Milei he plans to visit Buenos Aires",
      "url": "https://apnews.com/5d75b7d86ae1e5948c46b5f40c5264d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1334079e19234bc1973b144ea2997279/3000.jpeg"
    },
    {
      "author": "LISET CRUZ",
      "description": "NEW YORK (AP) — Beloved characters like Snoopy and SpongeBob SquarePants soared through the skies above New York City on Thursday and bands marched along the streets below as the annual Macy’s Thanksgiving Day Parade ushered in the holiday season.",
      "publishedAt": "2023-11-23T05:08:06Z",
      "title": "Balloons, bands and Santa: Macy’s Thanksgiving Day Parade ushers in holiday season in New York",
      "url": "https://apnews.com/7387ef24a7f51b1f1ed902997fd49a4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa7d2b5a98124c929e938a2c86986e90/3000.jpeg"
    },
    {
      "author": null,
      "description": "NIAGARA FALLS, N.Y. (AP) — The FBI has ended its investigation of a fiery car wreck that killed two people at a border checkpoint in Niagara Falls after finding no evidence that it was a terror attack, easing a period of high tensions as Americans headed into the Thanksgiving holiday.",
      "publishedAt": "2023-11-23T17:49:40Z",
      "title": "FBI ends investigation of car wreck at Niagara Falls bridge, no indication of terrorism",
      "url": "https://apnews.com/e524c19ba2a1c5c6bb866ae981858f4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91185cc4c6614251bc8d0a318c6b78df/1920.jpeg"
    },
    {
      "author": null,
      "description": "LIVINGSTON, Ky. (AP) — Rail operator CSX said Thursday that a chemical fire at a Kentucky train derailment that caused evacuations has been completely extinguished.CSX spokesperson Bryan Tucker said in a brief email that “the fire is completely out.” He said that authorities and CSX officials are evaluating when to encourage displaced residents to return home, and they will release more information later Thursday.",
      "publishedAt": "2023-11-23T14:43:46Z",
      "title": "Crews extinguish Kentucky derailment fire that prompted town to evacuate, rail operator says",
      "url": "https://apnews.com/100c6581176e7e47ff13d8a664e03471",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64ea8d4369b5413ba801d9ace76c50b7/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — New York City Mayor Eric Adams has been accused of sexually assaulting a woman in 1993, according to a legal summons filed Wednesday.The three-page filing does not contain details of the alleged assault but names Adams, the transit bureau of the New York Police Department and the New York Police Department Guardians Association as defendants.",
      "publishedAt": "2023-11-23T15:28:21Z",
      "title": "New York City Mayor Eric Adams accused of 1993 sexual assault in legal filing",
      "url": "https://apnews.com/0b939f75cb34848cc7f6b0ffdae1c7e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daa79e6c58094868996f428bc50dc403/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — Daniel Noboa, an inexperienced politician and heir to a fortune built on the banana trade, was sworn in Thursday as Ecuador’s president, a role that citizens are demanding he uses to restore the public safety that drug cartels and other criminal organizations robbed them of at the decade’s start.",
      "publishedAt": "2023-11-23T17:25:09Z",
      "title": "Daniel Noboa is sworn in as Ecuador's president, inheriting the leadership of a country on edge",
      "url": "https://apnews.com/3a75d25860961bc690f8a52536dcf19a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/713de13ad9814d3091d7144c596b3a7e/2153.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — Retailers are kicking off the unofficial start of the holiday shopping season on Friday with a bevy of discounts and other enticements. But executives are growing concerned with a spending slowdown that could temper sales on the day after Thanksgiving as well as throughout the holidays.",
      "publishedAt": "2023-11-23T11:01:05Z",
      "title": "Retailers are ready to kick off Black Friday just as shoppers pull back on spending",
      "url": "https://apnews.com/e0a7e0cf276aa9af50599e60c7a942ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0b547467adc4c12be42b892f15bb6a5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}