{
  "articles": [
    {
      "author": "BY KEVIN FREKING",
      "description": "WASHINGTON (AP) — Rep. Matt Gaetz said Sunday he will try to remove House Speaker Kevin McCarthy, a fellow Republican, from his leadership position this week after McCarthy relied on Democratic support to pass legislation that avoided a government shutdown.",
      "publishedAt": "2023-10-01T14:19:43Z",
      "title": "Gaetz says he will seek to oust McCarthy as speaker this week. 'Bring it on,' McCarthy says",
      "url": "https://apnews.com/aa4efca3c68895283b4219ed3e8064ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7629024fb6ce47e3b0713a54e60a1181/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden said Sunday that American aid to Ukraine will keep flowing for now as he sought to reassure allies of continued U.S. financial support for the war effort. But time is running out, the president said in a warning to Congress.",
      "publishedAt": "2023-10-01T04:01:31Z",
      "title": "Biden says there's 'not much time' to keep aid flowing to Ukraine and Congress must 'stop the games'",
      "url": "https://apnews.com/799067491a1bba9671b4dfdf491d0a8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3d9f750473a4a9fbf476e8277f7db0c/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, KEVIN FREKING and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The threat of a federal government shutdown suddenly lifted late Saturday as President Joe Biden signed a temporary funding bill to keep agencies open with little time to spare after Congress rushed to approve the bipartisan deal.",
      "publishedAt": "2023-09-30T04:09:40Z",
      "title": "Government shutdown averted with little time to spare as Biden signs funding before midnight",
      "url": "https://apnews.com/732baaa19c91f981e492fd0e6a76aba8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78169ce4053f48af8afb1d17378cdb0e/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — He’s driven a taxi cab, played in a band and protested the Vietnam War. As a New York City judge, Arthur Engoron has resolved hundreds of disputes, deciding everything from zoning and free speech issues to a custody fight over a dog named “Stevie.”",
      "publishedAt": "2023-10-01T04:02:53Z",
      "title": "Who is Arthur Engoron? Judge weighing future of Donald Trump empire is Ivy League-educated ex-cabbie",
      "url": "https://apnews.com/9bd42690d327f6f63c9eb31c046f8426",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0d4b4ee5c70498aa537498c17ad48cb/3000.jpeg"
    },
    {
      "author": "SUZAN FRASER",
      "description": "ANKARA, Turkey (AP) — A suicide bomber detonated an explosive device in the heart of the Turkish capital, Ankara, while a second assailant was killed in a shootout with police Sunday, the interior minister said.",
      "publishedAt": "2023-10-01T07:10:34Z",
      "title": "Suicide bomber detonates a device in Turkey's capital hours before president's speech to lawmakers",
      "url": "https://apnews.com/dfdbae1c7cd90f7e0a48b029c866b561",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f93d9f5d2f4c4833ad06d9f1c0ac4a60/3000.jpeg"
    },
    {
      "author": "AMY TAXIN",
      "description": "NEW CUYAMA, Calif. (AP) — In the hills of a dry, remote patch of California farm country, Lee Harrington carefully monitors the drips moistening his pistachio trees to ensure they’re not wasting any of the groundwater at the heart of a vicious fight.",
      "publishedAt": "2023-10-01T04:02:38Z",
      "title": "A fight over precious groundwater in a rural California town is rooted in carrots",
      "url": "https://apnews.com/c2f4353f4c1b86eaa9f6e6e1168176c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9580b3e3c5440248348ba672e51c5a0/1920.jpeg"
    },
    {
      "author": "MARTHA BELLISLE",
      "description": "TACOMA, Wash. (AP) — Police wrestle the unarmed Black man to the sidewalk. One officer pushes his face into the pavement as he pleads in vain: “Can’t breathe.”Witnesses capture the scene at a dark intersection on their cellphones — one yells, “Hey!",
      "publishedAt": "2023-10-01T05:03:53Z",
      "title": "Washington officers on trial in deadly arrest of Manny Ellis, a case reminiscent of George Floyd",
      "url": "https://apnews.com/4e164d9d8f7107ac390b46e100d83ec8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf2184330ccd47e8a9267a9bbd9ac5e1/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "GUIDONIA MONTECELIO, Italy (AP) — The best collection of players at Marco Simone had flags from their eight countries draped around their shoulders as they took turns clutching and thrusting the gold Ryder Cup, the very trophy that turns them into one nation, one team, with one purpose.",
      "publishedAt": "2023-10-01T15:18:44Z",
      "title": "Ryder Cup in Rome stays right at home for the Europeans. The US loses its seventh straight in Europe",
      "url": "https://apnews.com/4ba506769714aff78488651db46c1dfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45774e66144043e89c79ae7a935d9027/3000.jpeg"
    },
    {
      "author": "SIBI ARASU",
      "description": "BENGALURU, India (AP) — Sanjay Chauhan witnessed monsoon rains lash down over his home and farm in the Indian Himalayas this year with a magnitude and intensity he's never experienced before.“Buildings have collapsed, roads are broken, there were so many landslides including one that has destroyed a large part of my orchard,\" said the 56-year-old farmer, who lives in the town of Shimla in Himachal Pradesh.",
      "publishedAt": "2023-10-01T06:11:39Z",
      "title": "India's devastating monsoon season is a sign of things to come, as climate and poor planning combine",
      "url": "https://apnews.com/b1d095811f252ab82268dbefbeef5b3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e5996638586485b8f7694ef4efa8895/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Georgia's hold on No. 1 in The Associated Press college football poll loosened Sunday as the Bulldogs received a season-low 35 first-place votes out of possible 62 while extending their streak atop the rankings to 16 straight weeks.",
      "publishedAt": "2023-10-01T18:02:01Z",
      "title": "AP Top 25: Georgia's hold on No. 1 loosens, but top seven unchanged. Kentucky, Louisville enter poll",
      "url": "https://apnews.com/242833ae2b9917e60e2ba7c3635cecbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/181ad6e3eafe42eab357d32908597654/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}