{
  "articles": [
    {
      "author": "Nicole Winfield",
      "description": "Pope Francis has died. He was history’s first Latin American pontiff who charmed the world with his humble style and concern for the poor but alienated conservatives with critiques of capitalism and climate change. He was 88. The Vatican camerlengo made the announcement Monday. Francis suffered from chronic lung disease and had part of one lung removed as a young man. He was admitted to Gemelli hospital on Feb. 14, 2025, for a respiratory crisis that developed into double pneumonia. He spent 38 days there. From his first greeting as pope of a simple “Good evening” to his embrace of refugees and the downtrodden, Francis signaled a very different tone for the papacy, stressing humility over hubris for a Catholic Church beset by scandal and accusations of indifference.",
      "publishedAt": "2025-04-21T07:57:28Z",
      "title": "Pope Francis, first Latin American pontiff, dies at 88",
      "url": "https://apnews.com/article/vatican-pope-francis-dead-01ca7d73c3c48d25fd1504ba076e2e2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3b5904/2147483647/strip/true/crop/6000x3375+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F54%2F19a37d6f3bdd9709f683e4aad98a%2Ffffe3c39b04f4699abe4376bdc4e04d0"
    },
    {
      "author": null,
      "description": "Pope Francis was the first pope from the Americas, the first Jesuit pontiff and the first to take the name of Francis, after St. Francis of Assisi. Jorge Mario Bergoglio was born Dec. 17, 1936, in Buenos Aires, Argentina, to Italian immigrants. He was the eldest of five children. He was ordained a Jesuit priest in 1969 and led the order in Argentina during the country’s murderous dictatorship that began in the 1970s. After being named archbishop of Buenos Aires, he was elevated to cardinal in 2001 by St. John Paul II. He was elected the 266th pope on March 13, 2013, on the fifth ballot.",
      "publishedAt": "2025-04-21T09:02:47Z",
      "title": "A look at Pope Francis' life in brief",
      "url": "https://apnews.com/article/pope-francis-dead-brief-041c348c9882f079f5be2e93a8d38d0a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d042adb/2147483647/strip/true/crop/3800x2138+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F0e%2Fda894dee3c9c1ea8db3531f0bb99%2F85034775e27641d5811fe9870b059a6d"
    },
    {
      "author": "Vanessa Gera, Nicole Winfield",
      "description": "Pope Francis died on Easter Monday at the age of 88. Francis' death was announced by Cardinal Kevin Farrell. The Irish-born Vatican camerlengo's position will be important in the election of the next pope. Francis made his final public appearance a day earlier on Easter Sunday. Francis’ death now sets off the process of allowing the faithful to pay their final respects. That will be followed by a funeral to be celebrated by the dean of the College of Cardinals and a conclave to elect a new pope.",
      "publishedAt": "2025-04-21T11:05:09Z",
      "title": "What to know about the death of Pope Francis",
      "url": "https://apnews.com/article/pope-francis-what-to-know-7c2aa927cf142926f05654984aaa0d90",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3b5904/2147483647/strip/true/crop/6000x3375+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F54%2F19a37d6f3bdd9709f683e4aad98a%2Ffffe3c39b04f4699abe4376bdc4e04d0"
    },
    {
      "author": null,
      "description": "The first pope from the Americas was born Jorge Mario Bergoglio in Buenos Aires, Argentina, on Dec. 17, 1936. He was chosen to lead the church on March 13, 2013. He picked the name Francis, after St. Francis of Assisi. He was the eldest of five children. His father was Mario Jose Bergoglio, an accountant who had moved from Italy. His mother was Regina María Sívori, the daughter of Italian immigrants. He was ordained a priest with the Jesuit religious order in 1969 and elevated to cardinal in 2001 by St. John Paul II.",
      "publishedAt": "2025-04-21T08:21:35Z",
      "title": "Key dates in the life of Pope Francis",
      "url": "https://apnews.com/article/pope-francis-key-dates-0d33f7c8adca4c22a8e9bebeb5d3cdcc",
      "urlToImage": "https://dims.apnews.com/dims4/default/61c8cb5/2147483647/strip/true/crop/512x288+0+27/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2Fb7%2F12b293605fecae18160000691ff3%2F8ee5c69759194224b538d9658115fb78"
    },
    {
      "author": "Stan Choe",
      "description": "U.S. stocks are sinking as investors pull away from the United States because of the uncertainty caused by President Donald Trump’s trade war and his criticism of the Federal Reserve. The S&P 500 fell 1.2% Monday and was 15% below its record set two months ago. The Dow Jones Industrial Average dropped 430 points, and the Nasdaq composite sank 1.5%. Big Tech stocks led the way lower ahead of earnings reports coming this week from Tesla and others. Perhaps more worryingly, U.S. Treasury bonds and the value of the U.S. dollar also sank as a retreat continues from U.S. markets.",
      "publishedAt": "2025-04-21T02:56:03Z",
      "title": "US stocks sink with the US dollar's value as investors retreat further from the United States",
      "url": "https://apnews.com/article/stocks-markets-rates-inflation-trump-68a6a7f7765d78d46329abbecfbe0797",
      "urlToImage": "https://dims.apnews.com/dims4/default/758fc38/2147483647/strip/true/crop/5847x3289+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fd3%2F52a51305218185a32f23962452f6%2F6b9137a7f9844248867afa7d22b75b52"
    },
    {
      "author": "Michael Liedtke",
      "description": "Google on Monday will confront an existential threat as the U.S. government tries to break up the company as punishment for turning its revolutionary search engine into a ruthless monopoly. The drama will unfold in a Washington D.C. courtroom during the next three weeks during hearings that will determine how the company should be penalized for operating an illegal monopoly in search. The proceedings, known in legal parlance as a “remedy hearing,” feature a parade of witnesses that includes Google CEO Sundar Pichai. The moment of reckoning comes four-and-half-years after the U.S. Justice Department filed a landmark lawsuit alleging Google’s search engine had been abusing its power as the internet's main gateway.",
      "publishedAt": "2025-04-21T07:00:06Z",
      "title": "Google to face off with US government in attempt to break up company in search monopoly case",
      "url": "https://apnews.com/article/google-search-monopoly-breakup-chrome-09b695c8de6c91b3d1e1b5305393f235",
      "urlToImage": "https://dims.apnews.com/dims4/default/25bb59d/2147483647/strip/true/crop/3342x1880+0+174/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2Fa3%2Facba1a437107c95c936881920f9d%2Fff4515ba4ad84e96b3c2696410962428"
    },
    {
      "author": "Tara Copp",
      "description": "Defense Secretary Pete Hegseth created another Signal messaging chat that included his wife and brother where he shared similar details of a March military airstrike against Yemen’s Houthi militants that were sent in another chain with top Trump administration leaders. The New York Times on Sunday reported the second chat, and a person familiar with the contents and those who received the messages confirmed it to The Associated Press. That person, who spoke on condition of anonymity to discuss sensitive matters, said the unclassified chat included 13 people. The White House late Sunday dismissed the report as a “non-story,” insisting that no classified information was shared.",
      "publishedAt": "2025-04-20T23:20:11Z",
      "title": "Hegseth had a second Signal chat where he shared details of Yemen strike, New York Times reports",
      "url": "https://apnews.com/article/hegseth-signal-chat-houthis-attack-8dbf9dd6c711796438a5c1c84831c40b",
      "urlToImage": "https://dims.apnews.com/dims4/default/9335f23/2147483647/strip/true/crop/5096x2867+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2Fab%2F008b3a8acd8abb1be8984e5d19a8%2F56e2016498f3408db0fa2a0ea546de1f"
    },
    {
      "author": "Associated Press",
      "description": "A group of Massachusetts National Guard members early Monday crossed the Boston Marathon start line, launching the 129th edition of the world’s oldest and most prestigious annual marathon. Race Director Dave McGillivray sent the group of about 40 people in uniform off at 6 a.m. He thanked them for their service and said it’s a highlight of the day to see them out on the course each year. The race is held annually on Patriots’ Day, the state holiday that commemorates the start of the Revolutionary War. The town of Hopkinton, located about 26.2 miles west of Boston, is the gathering place for a field of about 30,000 runners preparing for the trek to Copley Square.",
      "publishedAt": "2025-04-21T11:09:01Z",
      "title": "Military marchers set out from Hopkinton to start the 129th Boston Marathon",
      "url": "https://apnews.com/article/boston-marathon-db1ce40174aebd7f2a307e6c499f1f52",
      "urlToImage": "https://dims.apnews.com/dims4/default/34b9dc5/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F03%2Fbc36161481e71206e32c95f8a10e%2Fb421142ec4a34560958664f77445ff4e"
    },
    {
      "author": null,
      "description": "Pope Francis had an informal, lighthearted speaking style. When Francis met Emeritus Pope Benedict XVI for the first time after being elected in 2013, he said, “We are brothers!” He used the same greeting for Patriarch Kirill in 2016 at the first meeting between a pope and the head of the Russian Orthodox Church. When asked about a purportedly gay priest, Francis made headlines by saying, “Who am I to judge?” The comment sent a message of welcome to the LGBTQ+ community and those who felt shunned by a church that had stressed conditions, rules and sexual propriety over unconditional love in previous papacies.",
      "publishedAt": "2025-04-21T09:06:11Z",
      "title": "Some of Pope Francis’ most memorable quotes",
      "url": "https://apnews.com/article/pope-francis-quotes-f202f17ec8db46e2b0222ce8c07b1abf",
      "urlToImage": "https://dims.apnews.com/dims4/default/82acdc9/2147483647/strip/true/crop/512x288+0+27/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F66%2F22d7f7a8683bb82e6048a03cea86%2F56b1e34ed7ef4a0b8eb66537ca963896"
    },
    {
      "author": "The Associated Press",
      "description": "A woman in the southern African country of Namibia runs a program that harnesses the power but also the gentleness of horses to help children with learning disabilities and conditions like attention-deficit/hyperactivity disorder and autism. Each weekday morning, Susan de Meyer’s dusty paddock is enlivened by a group of eight to 10 children from one of the special schools she helps who come to ride the horses. The program received an award last year from the International Equestrian Federation. De Meyer says it helps kids with their confidence, balance and coordination and makes “the world different” for them.",
      "publishedAt": "2025-04-21T04:15:57Z",
      "title": "A horse therapy program in Namibia brings joy to children with learning disabilities",
      "url": "https://apnews.com/article/horse-therapy-autism-children-kids-namibia-e5b482af0ce9365d18104fe725ac1aa3",
      "urlToImage": "https://dims.apnews.com/dims4/default/1bf011f/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fd0%2F183af6c3c69f02e059687e81cd05%2Fb46dd41e7445424e8d1e9d9f758251f6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}