{
  "articles": [
    {
      "author": "SILVIA STELLACCI and COLLEEN BARRY",
      "description": "VATICAN CITY (AP) — Pope Francis in his traditional Christmas message on Wednesday urged “all people of all nations” to find courage during this Holy Year “to silence the sounds of arms and overcome divisions” plaguing the world, from the Middle East to Ukraine, Africa to Asia.",
      "publishedAt": "2024-12-25T09:17:25Z",
      "title": "Pope urges 'all people of all nations' to silence arms and overcome divisions in Christmas address",
      "url": "https://apnews.com/189cce9b0fb73af2a02d117bcad8d4da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84b5195a482f44a89b4d51f3a9b045d1/1920.jpeg"
    },
    {
      "author": "KATIE MARIE DAVIES and DASHA LITVINOVA",
      "description": "An Azerbaijani airliner with 67 people onboard crashed Wednesday near the Kazakhstani city of Aktau, killing 38 people and leaving 29 survivors, a Kazakh official said. Deputy Prime Minister Kanat Bozumbaev disclosed the figures while meeting with Azerbaijani officials, the Russian news agency Interfax reported.",
      "publishedAt": "2024-12-25T07:53:38Z",
      "title": "Azerbaijani airliner crashes in Kazakhstan, killing 38 with 29 survivors, officials say",
      "url": "https://apnews.com/a655474030a347a5a7ddda3a77bbeddc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/048ce34517774d2eaa8b1218105135de/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK, TIA GOLDENBERG and FATMA KHALED",
      "description": "JERUSALEM (AP) — Israel and Hamas accused each other of complicating ceasefire efforts on Wednesday, as the two sides inch closer to a deal that could wind down the 14-month war in Gaza.The two sides appear closer than they have been in months to reaching an agreement that would bring home dozens of hostages being held in Gaza.",
      "publishedAt": "2024-12-25T14:47:32Z",
      "title": "Israel and Hamas accuse each other of complicating ceasefire efforts as they inch closer to a deal",
      "url": "https://apnews.com/be8508e8a1a89343b94e963137e42d5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5834e40f0e1445578178d3290157a266/1920.jpeg"
    },
    {
      "author": "SAM MCNEIL",
      "description": "MODIIN, Israel (AP) — For more than 400 days after being critically wounded during Hamas’ Oct. 7, 2023, attack on southern Israel, Yona Brief tried to recover. But after losing both legs and enduring medically induced comas, the combat medic died in late November.",
      "publishedAt": "2024-12-25T08:49:24Z",
      "title": "An Israeli soldier who died 417 days after his Oct. 7 wounds has become a symbol of sacrifice",
      "url": "https://apnews.com/11f076ba459453f4ee9e4f046537873f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90f61a9ce7994d87a0abe7ba20f8caaf/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russia launched a massive missile and drone barrage targeting Ukraine's energy infrastructure on Wednesday, striking a thermal power plant and prompting Ukrainians to take shelter in metro stations on Christmas morning.",
      "publishedAt": "2024-12-25T08:27:44Z",
      "title": "Russia targets Ukrainian energy infrastructure on Christmas Day",
      "url": "https://apnews.com/906dafcdbc66bc4976b0428a5cc0d263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15ef40930dfe4735ab7e82455559c52c/2000.jpeg"
    },
    {
      "author": "RIAZ KHAN and MUNIR AHMED",
      "description": "PESHAWAR, Pakistan (AP) — Pakistan’s airstrikes on eastern Afghanistan killed 46 people, mostly women and children, a Taliban government official said Wednesday, raising fears of further straining relations between the two neighbors.",
      "publishedAt": "2024-12-25T09:36:47Z",
      "title": "Taliban say Pakistani airstrikes killed 46 people in eastern Afghanistan, mostly women and children",
      "url": "https://apnews.com/1eb6ebd92403795d03856b1b97cac0da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/383628517cab4c84ae828b41d352d5c0/3000.jpeg"
    },
    {
      "author": "MAJDI MOHAMMED and TIA GOLDENBERG",
      "description": "JENIN REFUGEE CAMP, West Bank (AP) — Gunfire has rung out for days from the West Bank's Jenin refugee camp. But this time, it’s not Israeli forces that are facing off against armed groups.",
      "publishedAt": "2024-12-25T07:09:06Z",
      "title": "Why Palestinian forces are cracking down on Palestinian militants in the occupied West Bank",
      "url": "https://apnews.com/d698557816e2b9b674c6221511a80ef6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7be5feaff928431a8f02f8fb6a0432f4/3000.jpeg"
    },
    {
      "author": "KEN MORITSUGU and MARI YAMAGUCHI",
      "description": "BEIJING (AP) — China and Japan agreed Wednesday to set up talks on often contentious security issues as they seek to improve a relationship riven in recent years by a range of issues, from territorial disputes to the discharge of water from Japan's tsunami-wrecked nuclear power plant.",
      "publishedAt": "2024-12-25T08:30:27Z",
      "title": "China and Japan agree to talks on security issues as they seek to mend ties",
      "url": "https://apnews.com/4aabd3472505cdbccc93706184436fdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/762a1cec8fcb41d29f03a8585bcf1215/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARAMARIBO, Suriname (AP) — Desi Bouterse, a military strongman who led a 1980 coup in the former Dutch colony of Suriname then returned to power by election three decades later despite charges of drug smuggling and murder, has died.",
      "publishedAt": "2024-12-25T12:41:58Z",
      "title": "Desi Bouterse, a dictator convicted of murder who twice ruled Suriname, has died at 79",
      "url": "https://apnews.com/fe5300461c2239c7bbdb6b5272660ed0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44cc1a21967c4447b186fa5d5261b1f7/1969.jpeg"
    },
    {
      "author": "PAN PYLAS and DANICA KIRKA",
      "description": "LONDON (AP) — King Charles III used his annual Christmas message Wednesday to hail the selflessness of those who have cared for him and the Princess of Wales this year, after both were diagnosed with cancer.",
      "publishedAt": "2024-12-25T00:08:37Z",
      "title": "King Charles III focuses Christmas message on healthcare workers in year marked by royal illnesses",
      "url": "https://apnews.com/1bd3c401838815e439864d8fdb84ded5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/843ac5073abb44c2a4b39ce41acb4f30/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}