{
  "articles": [
    {
      "author": "FELIPE DANA and JIM HEINTZ",
      "description": "KYIV, Ukraine (AP) — Russian forces on Friday struck the central Ukrainian city of Dnipro and pounded a key village in the southeast that Ukraine claimed to have recaptured in its grinding counteroffensive, while Moscow accused Kyiv of firing two missiles at southern Russia and wounding 20 people.",
      "publishedAt": "2023-07-28T07:21:03Z",
      "title": "Moscow blames Kyiv for attacks in south Russia as Kremlin forces hit Ukrainian buildings",
      "url": "https://apnews.com/f4d8d1256ebba65b929ff4626e3ca2e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fd678ad186b4a50850bd45e79b976b1/2265.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and HANNAH FINGERHUT",
      "description": "OSKALOOSA Iowa (AP) — Donald Trump and rival Ron DeSantis will appear for the first time at the same campaign event in early voting Iowa on Friday at a pivotal moment for the Republican presidential candidates.",
      "publishedAt": "2023-07-28T04:08:32Z",
      "title": "Trump, DeSantis and other 2024 GOP candidates set to address Iowa Republicans at Lincoln Day Dinner",
      "url": "https://apnews.com/5ac4475b203c6d833729b15c31482273",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a77d3e4832c24fe9b53cfaafea3d66bd/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Senate Republican Leader Mitch McConnell has repeatedly said he is “fine” since he froze up midsentence during a press conference on Wednesday.",
      "publishedAt": "2023-07-28T17:30:19Z",
      "title": "Sen. McConnell says he plans to serve his full term as leader despite questions about his health",
      "url": "https://apnews.com/07bdd2f78545b92bb8d2dd32395ff956",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88bc55ae88fe4538a7cfb5fb6387dcfb/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "Former President Donald Trump has been indicted on three additional charges in a case that accuses him of illegally possessing classified documents at his Mar-a-Lago estate, allegations that add fresh detail to the criminal case initially issued last month.",
      "publishedAt": "2023-07-28T15:34:29Z",
      "title": "With Trump newly indicted, here's what to know about the documents case and what’s next",
      "url": "https://apnews.com/81b982b8195dcfb85b7ae8789f108b0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/202f5335493a45bdb3be08d4946c0c51/1920.jpeg"
    },
    {
      "author": "BY SETH BORENSTEIN, CAMILLE FASSETT and MICHAEL GOLDBERG",
      "description": "ROLLING FORK, Miss. (AP) — Many were not just killed at home. They were killed by their homes.Angela Eason had visited Brenda Odoms’ tidy mobile home before. It was a place where Odoms, who had many tragedies in her life, felt safe.",
      "publishedAt": "2023-07-28T14:30:26Z",
      "title": "How living in a mobile home makes you more likely to die in a tornado",
      "url": "https://apnews.com/b3a0e41ffd83a2681a92b8e4dad0ef06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f2f03e615874d19ba02d2c24449cbef/1920.jpeg"
    },
    {
      "author": "BY DREW COSTLEY",
      "description": "Nearly 200 million people in the United States, or 60% of the U.S. population, are under a heat advisory or flood warning or watch and have been since Thursday, according to the National Weather Service.",
      "publishedAt": "2023-07-28T04:08:38Z",
      "title": "Extreme heat moves east where many will see their hottest days of the year",
      "url": "https://apnews.com/31d075a9357730ea3358d825b0d33c01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75d68e95af7c4c4da9b7e3700e4b030f/3000.jpeg"
    },
    {
      "author": "THOMAS MACHOWICZ and ANITA SNOW",
      "description": "PHOENIX (AP) — Homeless in America's hottest big metro, Stefon James Dewitt Livengood was laid out for days inside his makeshift dwelling, struggling to breath, nauseous and vomiting.Every day this month, temperatures have soared past 110 degrees Fahrenheit (43.3 degrees Celsius).",
      "publishedAt": "2023-07-28T04:00:51Z",
      "title": "Homeless struggle to stay safe from record high temperatures in blistering Phoenix",
      "url": "https://apnews.com/a47f04ee21b96651585f3684ac35cb6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf3e7389befb48659767222480432da4/1920.jpeg"
    },
    {
      "author": "SUDHIN THANAWALA",
      "description": "ATLANTA (AP) — Authorities in Alabama said Friday they filed criminal charges against a woman who confessed to fabricating a story that she was kidnapped after stopping to check on a toddler she saw walking on the side of the interstate.",
      "publishedAt": "2023-07-28T18:10:42Z",
      "title": "Authorities charge Alabama woman who acknowledged fabricating story about kidnapping, toddler",
      "url": "https://apnews.com/49a21032a9a514da6a77eca29838a6d1",
      "urlToImage": ""
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Mutinous soldiers who staged a coup in Niger declared their leader the new head of state on Friday, hours after the general asked for national and international support despite rising concerns that the political crisis could hinder the nation’s fight against jihadists and boost Russia’s influence in West Africa.",
      "publishedAt": "2023-07-28T07:38:46Z",
      "title": "Soldiers declare Niger general as head of state after he led a coup and detained the president",
      "url": "https://apnews.com/c233b0d2becf61ebb00c5705941fc168",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50d8f78b45064eb183d81709df52ce91/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "FULTON, Mo. (AP) — At the entrance to Missouri prisons, large signs plead for help: “NOW HIRING” ... “GREAT PAY &amp; BENEFITS.\"No experience is necessary. Anyone 18 and older can apply. Long hours are guaranteed.",
      "publishedAt": "2023-07-28T04:20:32Z",
      "title": "Mounting job vacancies push state and local governments into a wage war for workers",
      "url": "https://apnews.com/74d1689d573e298be32f3848fcc88f46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eead6ef67e584eae9507d88ae206e6c5/2016.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}