{
  "articles": [
    {
      "author": null,
      "description": "Police in Canada say the driver of a car struck revelers at a street festival, killing and injuring an unknown number of people. The Vancouver Police Department says the vehicle drove into a crowd at a Filipino community festival at 8:14 p.m. Saturday. The exact number of dead or injured was not immediately available. Police say the driver was taken into custody. The Lapu Lapu Day festival was being held in a South Vancouver neighbourhood. Video posted on social media showed victims and debris strewn across a long stretch of road, with at least seven people lying immobile on the ground. A black SUV with a crumpled front section could be seen in still photos.",
      "publishedAt": "2025-04-27T05:41:10Z",
      "title": "Lapu Lapu Day: Car kills and injures people attending street festival in Vancouver",
      "url": "https://apnews.com/article/canada-vancouver-filipino-festival-deaths-car-6635b400430a7015341d3ca0c4c1e7fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/115816b/2147483647/strip/true/crop/3600x2025+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fe6%2F5b097ab3916a6fb1867990f1ce81%2Fc0812d82118c45daa131b00d0c4efb7c"
    },
    {
      "author": "John Raby",
      "description": "Authorities say more than 100 immigrants suspected of being in the United States illegally were taken into custody during a raid at an illegal after-hours nightclub in Colorado Springs, Colorado. Video posted online by the Drug Enforcement Administration showed agents announcing their presence outside the building early Sunday. DEA special agent in charge John Pullen says the club has been under investigation for several months for alleged activities including drug trafficking, prostitution and “crimes of violence.” Pullen says U.S. Immigration and Customs Enforcement took the immigrants into custody. Also among those detained were a dozen active-duty military service members who either were patrons or were working as armed security.",
      "publishedAt": "2025-04-27T18:30:56Z",
      "title": "More than 100 immigrants detained at an illegal after-hours nightclub in Colorado",
      "url": "https://apnews.com/article/colorado-nightclub-raid-immigration-c0e46855c2a8b18d532560f12158e394",
      "urlToImage": "https://dims.apnews.com/dims4/default/10ccbed/2147483647/strip/true/crop/4868x2738+14+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F74%2Fe74d33ddd1ed94bc8964cb18f88b%2Fda72bde3fbb74076a2fdbaffd4738ac5"
    },
    {
      "author": null,
      "description": "North Korea has confirmed for the first time that it has dispatched troops to Russia to support its war against Ukraine. U.S., South Korean and Ukraine intelligence officials have said North Korea last fall sent about 10,000-12,000 troops to Russia. But North Korea hadn’t until Monday confirmed its troops’ movements. North Korea’s state-run Korean Central News Agency said leader Kim Jong Un decided to send combat troops to Russia under a mutual defense treaty. It cited Kim as saying that the troops’ deployment was meant to “annihilate and wipe out the Ukrainian neo-Nazi occupiers and liberate the Kursk area in cooperation with the Russian armed forces.”",
      "publishedAt": "2025-04-27T23:42:38Z",
      "title": "North Korea confirms dispatch of troops to Russia to support its war against Ukraine",
      "url": "https://apnews.com/article/north-korea-south-korea-russia-ukraine-war-34716db67af6176d0d5e0ebf1b887881",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Chris Megerian, Amelia Thomson-DeVeaux",
      "description": "An AP-NORC poll finds that only about one-third of U.S. adults have a favorable opinion of Elon Musk after his brief foray into the federal government. And about two-thirds of U.S. adults think he has too much influence in Washington. Musk has spent years building his reputation as a business titan and tech visionary, but the billionaire entrepreneur is expected to leave his administration job in the coming weeks. Musk is noticeably less popular than is the effort to pare back the government workforce. Although about half of U.S. adults believe President Donald Trump has gone too far, 31% say he’s on target and 15% want him to go even further.",
      "publishedAt": "2025-04-27T11:26:54Z",
      "title": "Musk is unpopular and most think he has too much influence in Washington",
      "url": "https://apnews.com/article/musk-trump-doge-tesla-d1206a96983b30b9cef7b18eaa8c48a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/212e5f7/2147483647/strip/true/crop/4356x2450+0+226/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2Ff7%2F749e50ba24d86d5823b976cbd42a%2Fd78b4a40bb764e2690ff84d02097d686"
    },
    {
      "author": null,
      "description": "Officials say a suspect has been arrested in connection with last week's theft of Homeland Security Secretary Kristi Noem’s purse as she ate at a Washington, D.C., restaurant. Noem’s purse was nabbed on Easter Sunday and reportedly contained about $3,000 in cash, her keys, driver’s license, passport and Homeland Security badge. The department said Noem had cash in her purse to pay for gifts, dinner and other activities for her family on Easter. The Secret Service says the suspect was taken into custody without incident in Washington, D.C. It calls the suspect a “serial offender.”",
      "publishedAt": "2025-04-27T19:36:08Z",
      "title": "Suspect arrested in Homeland Security Secretary Noem’s purse theft",
      "url": "https://apnews.com/article/kristi-noem-homeland-security-robbed-suspect-arrest-874c3933f1d59873c0225d737d3dae5a",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ec06c4/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F14%2Fd7e4139c0d832c0e5851b9363a3d%2F25559804eb364809901c8f4e57f07448"
    },
    {
      "author": "Sudhin Thanawala, Lindsay Whitehurst",
      "description": "The U.S. Supreme Court is scheduled to hear arguments in a yearslong legal battle over an FBI raid on the wrong Atlanta house. FBI agents stormed Trina Martin's home in 2017 looking for a suspected gang member. She and her then-boyfriend were held at gunpoint while her 7-year-old son screamed in another room. But the agents had come to the wrong home. Martin sued the government in 2019, but lower courts dismissed the case. The Supreme Court agreed in January to take up the matter and will hear arguments Tuesday. The key issue before the justices is under what circumstances people can sue the federal government in an effort to hold its law enforcement agencies accountable.",
      "publishedAt": "2025-04-27T04:12:35Z",
      "title": "The FBI mistakenly raided their home. Now the Supreme Court will hear their lawsuit",
      "url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
      "urlToImage": "https://dims.apnews.com/dims4/default/2129a4b/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F02%2F17a8a808d8bdfd02c72212527684%2F9bc7a20e2e85494ea22b4843e6fb3c9e"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Hospitals in the Gaza Strip have received the remains of 51 Palestinians killed in Israeli strikes in the last 24 hours. Gaza's Health Ministry said Sunday that the overall Palestinian death toll from the 18-month-old Israel-Hamas war has reached 52,243. Israel ended its ceasefire with Hamas by launching a surprise bombardment on March 18. It has been carrying out daily waves of strikes. Israel has also sealed off the territory’s 2 million Palestinians from all imports, including food and medicine, for nearly 60 days. Aid groups say supplies will soon run out and that thousands of children are malnourished.",
      "publishedAt": "2025-04-27T16:09:03Z",
      "title": "Israeli strikes kill 51 in Gaza, health ministry says, bringing overall toll to over 52,000",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-27-2025-484d00da53700e6d08e0e9f360be976f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2b6a36/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F71%2F7a86cba494e83419a4eaf483731b%2Fdca42cd49c3641cba78ad931fc9473d4"
    },
    {
      "author": "Vanessa Gera, Silvia Stellacci",
      "description": "Roman Catholic faithful have begun visiting the tomb of Pope Francis. Starting early Sunday they began filing past the simple white tomb in St. Mary Major Basilica. The visits came a day after Pope Francis was bade farewell by the powerful of the world and a crowd of hundreds of thousands. A single white rose was placed on the tomb that said “Franciscus” — the pope’s name in Latin. A light cast its warm glow over the tomb and a reproduction of the late pontiff’s pectoral cross on the wall above it. The tomb was opened on the second of nine days of official mourning for Francis, after which a conclave will be held to elect the next pope.",
      "publishedAt": "2025-04-27T08:01:57Z",
      "title": "Catholic faithful pay respects to Pope Francis as his tomb opens to the public",
      "url": "https://apnews.com/article/pope-francis-tomb-st-mary-major-ea3fe0b086ac64e72374f9bc43603b84",
      "urlToImage": "https://dims.apnews.com/dims4/default/cdca86a/2147483647/strip/true/crop/7000x3937+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F99%2Fa8de12467f289417de375422da60%2F97c24cd711994863a97501f79e9951a1"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran’s president has visited those injured in a huge explosion that rocked one of the Islamic Republic’s main ports. The facility purportedly linked to an earlier delivery of a chemical ingredient used to make missile propellant. The visit Sunday by President Masoud Pezeshkian came as the toll from Saturday’s blast at the Shahid Rajaei port outside of Bandar Abbas in southern Iran’s Hormozgan province rose to 40 with some 1,000 others injured. While Iran’s military sought to deny the delivery of ammonium perchlorate from China, new videos emerged showing an apocalyptic scene at the still-smoldering port.",
      "publishedAt": "2025-04-27T13:12:24Z",
      "title": "Iran's president visits injured from port blast that killed 40",
      "url": "https://apnews.com/article/iran-explosion-bandar-abbas-port-shahid-rajaei-53387f4f71dba2788569655297c57cff",
      "urlToImage": "https://dims.apnews.com/dims4/default/00a2234/2147483647/strip/true/crop/7008x3942+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Fee%2F7b64644b0022f0b1773da6d81599%2Fef82a9809aed45fa96155f1f847305d4"
    },
    {
      "author": "Steve Peoples, Thomas Beaumont",
      "description": "Republican members of Congress have gone to great lengths to avoid public meetings with their constituents over their two-week Easter recess. Nationwide, Republicans hosted only a handful of in-person town halls during the congressional break. The most vulnerable House Republicans were especially shielded from public view. Some didn't answer their office phones for days. None of them, a collection of swing-district conservatives from across states like Colorado, California, Iowa and Pennsylvania, hosted in-person events that were open to the public. Just one planned a telephone town hall. Others favored smaller invitation-only gatherings with local officials promoted only after they were over.",
      "publishedAt": "2025-04-27T12:54:25Z",
      "title": "Swing-district Republican lawmakers aren't holding town halls",
      "url": "https://apnews.com/article/republicans-recess-congress-no-town-halls-de45284c77fbc54a13c7090f75994674",
      "urlToImage": "https://dims.apnews.com/dims4/default/be367f1/2147483647/strip/true/crop/5568x3132+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2F04%2Fcbb0d15e92562c3a8da9ea436eaa%2F474b6fddafe646458d32045675c0aa2f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}