{
  "articles": [
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — The chief prosecutor of the world's top war crimes court sought arrest warrants Monday for leaders of Israel and Hamas, including Israeli Prime Minister Benjamin Netanyahu, over actions taken during their seven-month war.",
      "publishedAt": "2024-05-20T11:16:12Z",
      "title": "War crimes prosecutor seeks arrest of Israeli and Hamas leaders, including Netanyahu",
      "url": "https://apnews.com/070941d21ccd1f2b9611032b88527575",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79716dd641134f2f9b461dc51a3fdebd/3000.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — The International Criminal Court could soon issue arrest warrants for Israeli and Hamas leaders, including Israeli Prime Minister Benjamin Netanyahu, more than seven months into the war between the two sides, based on a request by the court’s chief prosecutor.",
      "publishedAt": "2024-04-29T18:48:50Z",
      "title": "What is the ICC and why it is considering arrest warrants for Israeli and Hamas leaders",
      "url": "https://apnews.com/1f683a6e2e150d91c415eb1d0a19a44d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fba81926024d4df8b3006ea35afa4766/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — The death of Iran's president is unlikely to lead to any immediate changes in Iran's ruling system or to its overarching policies, which are decided by Supreme Leader Ayatollah Ali Khamenei.",
      "publishedAt": "2024-05-20T17:29:30Z",
      "title": "What's next for Iran's government after death of its president in helicopter crash?",
      "url": "https://apnews.com/6d3b970bce0c6d436b25b550d887ceaf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1ceb8d66cf145a08257591756f41a0e/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Michael Cohen testified Monday that he stole tens of thousands of dollars from his ex-boss Donald Trump’s company, an admission defense lawyers hope to use to undermine Cohen’s credibility as a key prosecution witness in the former president’s hush money trial.",
      "publishedAt": "2024-05-20T04:02:40Z",
      "title": "Michael Cohen says he stole from Trump's company as defense presses key hush money trial witness",
      "url": "https://apnews.com/363a86879b97d2367831b1392f42689d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19224c03e06b4159bcde756eb9a93983/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — WikiLeaks founder Julian Assange can appeal an extradition order to the United States on espionage charges, a London court ruled Monday — a decision likely to further drag out an already long legal saga.",
      "publishedAt": "2024-05-20T06:02:22Z",
      "title": "WikiLeaks founder Assange wins right to appeal against an extradition order to the US",
      "url": "https://apnews.com/28ebf4301cdd25efd5b087ab67d46c25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da19423e2a76493c952c375c92749322/1920.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — The recovery from the deadly Baltimore bridge collapse reached a significant milestone Monday as the ill-fated container ship Dali was slowly escorted back to port, its damaged bow still covered with smashed shipping containers, fallen steel trusses and mangled concrete.",
      "publishedAt": "2024-05-20T04:02:16Z",
      "title": "Tugboats escort ship that caused deadly Baltimore bridge collapse back to port",
      "url": "https://apnews.com/83dde05d3ad999c88dd5270bb0cea1c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc179c348dca45a2bf1928aff5c7a922/1920.jpeg"
    },
    {
      "author": "SIMINA MISTREANU and CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Taiwan’s new president, Lai Ching-te, said in his inauguration speech Monday that he wants peace with China and urged it to stop its military threats and intimidation of the self-governed island that Beijing claims as its own territory.",
      "publishedAt": "2024-05-20T01:18:20Z",
      "title": "Taiwan's new President Lai in his inauguration speech urges China to stop its military intimidation",
      "url": "https://apnews.com/af4ff1f254e11c24f751cea000fb42d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29ab99355f4949bf988c349f7c843a9d/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iranian President Ebrahim Raisi and the country’s foreign minister were found dead Monday hours after their helicopter crashed in fog, leaving the Islamic Republic without two key leaders as extraordinary tensions grip the wider Middle East.",
      "publishedAt": "2024-05-20T02:32:11Z",
      "title": "Iran's president and foreign minister die in helicopter crash at moment of high tensions in Mideast",
      "url": "https://apnews.com/426c6f4ae2dd1f0801c73875bb696f48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ede5cc32e5148a99404dd50cfb56092/1920.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — Former South African President Jacob Zuma was barred Monday from running for Parliament in next week's national election over a previous criminal conviction, the latest twist in his return to politics.",
      "publishedAt": "2024-05-20T11:57:25Z",
      "title": "Who is Jacob Zuma, the former South African president disqualified from next week's election?",
      "url": "https://apnews.com/44bd1c2ad25b168c20bc0a4a5e14ffa5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/997cbe8a4c794f9ba80bdc8e2e07df84/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "People with HIV can breastfeed their babies, as long as they are taking medications that effectively suppress the virus that causes AIDS, a top U.S. pediatricians’ group said Monday in a sharp policy change.",
      "publishedAt": "2024-05-20T04:03:17Z",
      "title": "US pediatricians reverse decades-old advice against HIV-positive mothers breastfeeding",
      "url": "https://apnews.com/8e931d56f656e8c00f51bc3cd99c814e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44c093c7c0984531bfbf5484f03ad58c/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}