{
  "articles": [
    {
      "author": null,
      "description": "The Kremlin said Thursday that a meeting in the coming days between Russian President Vladimir Putin and U.S. President Donald Trump has been agreed on. Putin’s foreign affairs adviser Yuri Ushakov said the two sides are working on setting it up, and that a venue for the meeting has been agreed on and will be announced later. A meeting between Putin and Trump would be their first since Trump returned to office this year. It would be a significant milestone in the more than 3-year-old war, though there’s no promise such a meeting would lead to the end of the fighting, since Russia and Ukraine remain far apart on their demands.",
      "publishedAt": "2025-08-07T06:10:18Z",
      "title": "Trump to meet Putin in coming days, Kremlin says",
      "url": "https://apnews.com/article/russia-ukraine-war-poll-trump-sanctions-deadline-7cefb2df66f494f58a16b684a2c76687",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a361c5/2147483647/strip/true/crop/4855x2731+0+253/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Fd5%2F260b87d9e56efa7800fe7a2ce542%2Fc28e4655812a47e688e3620581ea22a4"
    },
    {
      "author": null,
      "description": "The Israeli security cabinet is meeting Thursday evening to discuss expanding military operations in Gaza. An Israeli official says the cabinet is expected to approve a plan to gradually increase pressure on Hamas. Israel’s Chief of Staff warns this could endanger hostages and exhaust troops. Demonstrations are planned across Israel to protest the expansion. Meanwhile, Israeli authorities have returned the body of a Palestinian activist allegedly killed by an Israeli settler last week, following a hunger strike by his relatives, and aid organizations denounce Israeli policies in Gaza.",
      "publishedAt": "2025-08-07T12:06:22Z",
      "title": "Israeli security cabinet to discuss expanding military operations in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostages-gaza-08-07-2025-b92e0e4947061ed89bfc6782c4067896",
      "urlToImage": "https://dims.apnews.com/dims4/default/35e62b3/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2F83%2Feeb8d13a471c8572af0014b3fb99%2Ff5d67a81a139475aa5dff24df7f6bdce"
    },
    {
      "author": null,
      "description": "President Donald Trump has started imposing higher import taxes on goods from over 60 countries, including the European Union, Japan and South Korea. These tariffs, which began Thursday, are part of Trump's strategy to reduce the trade deficit and encourage foreign investment in the U.S. However, the economic impact is already visible, with signs of stalled hiring, rising inflation and declining home values. Despite the uncertainty, Trump remains optimistic about economic growth, while many experts warn of potential long-term damage.",
      "publishedAt": "2025-08-07T04:02:21Z",
      "title": "Trump's broad tariffs go into effect, just as economic pain is surfacing",
      "url": "https://apnews.com/article/trump-tariffs-into-effect-economy-warning-signs-eafe20de9abad312573b320fd4b5fb33",
      "urlToImage": "https://dims.apnews.com/dims4/default/76528ac/2147483647/strip/true/crop/5491x3089+0+286/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fec%2Fac%2F0a927050c5e8025388db521beb7e%2Fd73c8af454fd41b49a98072c44f6691a"
    },
    {
      "author": null,
      "description": "President Donald Trump has instructed the Commerce Department to change how the Census Bureau collects data, seeking to exclude immigrants in the United States illegally. The Republican president said Thursday the census' data collections will be based on “modern day facts and figures and, importantly, using the results and information gained from the Presidential Election of 2024.” It's an indication Trump might try to inject his politics into survey work measuring everything from child poverty to business operations. Trump stresses that as part of the changes people in the U.S. illegally will be excluded from census counts. Census changes could play into Trump's efforts to urge several Republican-led states to redraw congressional maps.",
      "publishedAt": "2025-08-07T12:02:16Z",
      "title": "Trump seeks census change excluding immigrants in US illegally",
      "url": "https://apnews.com/article/trump-census-immigration-illegal-165fe1c52cfc930521bc7e65d4b1ff41",
      "urlToImage": "https://dims.apnews.com/dims4/default/bce8239/2147483647/strip/true/crop/4216x2372+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2Fd1%2F1ecfec98efdb97c8854245f48f95%2F3daec11100c14bc3859656ea4154011d"
    },
    {
      "author": null,
      "description": "A federal judge has ordered a temporary halt to construction of an immigration detention center — built in the middle of the Florida Everglades and dubbed “Alligator Alcatraz” — as attorneys argue whether it violates environmental laws. Under Thursday's order, the facility can continue to operate and hold detainees for U.S. Immigration and Customs Enforcement. Environmental groups and the Miccosukee Tribe have asked U.S. District Judge Kathleen Williams to issue a preliminary injunction to halt operations and further construction.",
      "publishedAt": "2025-08-07T18:56:02Z",
      "title": "Judge orders temporary halt to construction at Florida's 'Alligator Alcatraz' detention center",
      "url": "https://apnews.com/article/florida-detention-alligator-alcatraz-08aac166ad5fa5dfbd33a00f6be2b979",
      "urlToImage": "https://dims.apnews.com/dims4/default/674f768/2147483647/strip/true/crop/4982x2802+0+433/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Fc2%2Fde0d2a15befd48ace3ebad4dc8f7%2Ff4bdeecaada84c1d92fcfd995546d007"
    },
    {
      "author": null,
      "description": "A senior FBI official who served as acting director in the first weeks of the Trump administration and resisted demands to turn over the names of agents who participated in the Jan. 6, 2021, investigations is being forced out of the bureau. That's according to two people familiar with the matter who spoke to The Associated Press on Thursday. The circumstances of Brian Driscoll’s ouster are unclear, but his final day is Friday. The people were not authorized to discuss the personnel move by name and spoke on the condition of anonymity. Additional ousters are possible. Spokespeople for the FBI have declined to comment. Driscoll worked international counterterrorism investigations in New York.",
      "publishedAt": "2025-08-07T16:02:48Z",
      "title": "Senior FBI official who resisted Trump demands is ousted",
      "url": "https://apnews.com/article/fbi-jan-6-patel-driscoll-f4bd75766307f558dfdbdea736e026e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/df0528e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F1f%2F2c25785ceedb65ba89224d8ac9cf%2Fd305e4133ed943bba80c76c360e9ab1c"
    },
    {
      "author": null,
      "description": "The U.S. Air Force has decided to deny early retirement options for transgender service members with 15 to 18 years of service. Instead, they are being separated without retirement benefits. This decision means transgender service members must choose between a lump-sum separation payment or leaving the service without benefits. An Air Force spokesperson confirmed that no exceptions to this policy were approved, despite previous notifications to some members. All transgender members are being separated under the Trump administration's policies.",
      "publishedAt": "2025-08-07T19:31:10Z",
      "title": "Trump's Air Force denies retirement pay to ex-trans service members",
      "url": "https://apnews.com/article/air-force-transgender-no-early-retirement-e6a4da806f2cc2bdc05f49438cbd26fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/e70e95d/2147483647/strip/true/crop/3300x1856+0+152/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F6c%2F79a9ed92b4b4dcd00c9cba51cc49%2Ff5a629b7d7b24e3eb3e320259ddacdec"
    },
    {
      "author": null,
      "description": "President Donald Trump is increasing pressure on Republican-led states to redraw congressional boundaries. Vice President JD Vance went to Indiana on Thursday as the president called for a new federal census. A top Florida Republican says his state will start the redistricting process soon. All of this aims to boost the GOP’s advantages in upcoming elections. Meanwhile, U.S. Sen. John Cornyn of Texas said that FBI Director Kash Patel has agreed to get involved in corralling Texas Democratic lawmakers who left their state to deny the Republican majority a quorum necessary to vote on a U.S. House redistricting plan. The developments reflect rising tensions in a bitter partisan fight that seems to be mushrooming nationally.",
      "publishedAt": "2025-08-07T07:33:35Z",
      "title": "JD Vance visits Indiana as Trump pushes for GOP-led redistricting",
      "url": "https://apnews.com/article/jd-vance-indiana-redistricting-donald-trump-fafc5bd34f741b3886913e792ab33048",
      "urlToImage": "https://dims.apnews.com/dims4/default/53afa93/2147483647/strip/true/crop/5681x3196+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2F94%2F1a42b6a893e9d4032eb3b6b19833%2F7d120da5dc4b4bea9f97820c4af4ea96"
    },
    {
      "author": null,
      "description": "A new federal report finds that most Americans get more than half their calories from ultra-processed foods. Overall, about 55% of calories consumed by Americans older than age 1 came from ultra-processed foods during August 2021 to August 2023. The top sources include burgers and sandwiches, sweet baked goods, savory snacks, pizza and sweetened drinks. Ultra-processed foods have been linked to chronic health problems. One surprising finding: Consumption of ultra-processed foods appeared to dip slightly over the past decade. One nutritionist says there may be greater awareness of the foods' potential harms.",
      "publishedAt": "2025-08-07T04:01:39Z",
      "title": "Ultra-processed foods make up a big portion of Americans' diet, CDC finds",
      "url": "https://apnews.com/article/ultraprocessed-foods-diet-cdc-9d025cd075a3b7bda2d3710da6d3f541",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e57791/2147483647/strip/true/crop/5784x3254+0+173/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F27%2F4cee0887e6e6edff280865eeca61%2Ffdcb36b1881947379a3700a6d9dc6275"
    },
    {
      "author": null,
      "description": "The WNBA is still struggling with a string of sex toy disturbances. In the past week and a half, sex toys have been thrown on court during games in Atlanta on July 29, Chicago on Aug. 1 and Los Angeles on Aug. 5, with the most recent object nearly hitting Indiana Fever guard Sophie Cunningham during Indiana’s game against the Sparks. Sex toys were also thrown at games in New York and Phoenix last Tuesday and at a second game in Atlanta last Friday, but didn’t reach the court. The distractions have created unexpected challenges for the league, the teams and the players, but also for arena security. Here’s what to know.",
      "publishedAt": "2025-08-07T20:10:04Z",
      "title": "How does the WNBA solve its sex toy problem?",
      "url": "https://apnews.com/article/sex-toy-wnba-71479d687f0850e4c503525c80dfec50",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8ef54a/2147483647/strip/true/crop/2734x1538+0+143/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F9d%2F4ff63065acd13bbc008adb9c6a39%2F7327b6467f1f4d339413307d7b49943a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}