{
  "articles": [
    {
      "author": "Steve Karnowski, Mark Vancleave",
      "description": "Authorities and a hospital say at least five children have been injured in a shooting during the first week of classes at a Minneapolis Catholic school. Minnesota Gov. Tim Walz called the violence “horrific.” The Minneapolis city government said the shooter had been “contained” after the gunfire Wednesday at Annunciation Catholic School. The city says there is no “active threat” to residents. Children’s Minnesota says five children have been admitted for care. Hennepin Healthcare says it also is caring for patients from the shooting. The pre-kindergarten through eighth grade school had an all-school Mass scheduled at 8:15 a.m. Wednesday morning. Monday was the first day of school.",
      "publishedAt": "2025-08-27T14:24:30Z",
      "title": "At least five children injured in Minneapolis Catholic school shooting; governor calls it horrific",
      "url": "https://apnews.com/article/minneapolis-school-shooting-annunciation-0fb27d2c911fe63a9f04791b444f298f",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe38071/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2Fcb%2F956576d79670042cf6756cf641e4%2F5b91b300cbc94d1188c93418672bb1c0"
    },
    {
      "author": "Michael Kunzelman, Ben Finley",
      "description": "Lawyers for Kilmar Abrego Garcia, who has become the face of President Donald Trump’s hardline immigration agenda, say he wants to seek asylum in the United States. His lawyers told that to a federal judge Wednesday. The 30-year-old Salvadoran national was detained Monday in Baltimore by U.S. Customs and Immigration Enforcement after leaving a Tennessee jail on Friday. Administration officials have said he’s part of the dangerous MS-13 gang, an allegation Abrego Garcia denies. His lawyers are fighting the deportation efforts in court, arguing he has the right to express fear of persecution and torture in Uganda.",
      "publishedAt": "2025-08-27T13:29:19Z",
      "title": "Kilmar Abrego Garcia seeks asylum in the US after arrested again by ICE",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-deportation-asylum-62f3d781878a3787ae27d6ea42662dc0",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1ffb9e/2147483647/strip/true/crop/4115x2315+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F41%2F248ee4bdea87b88cfcbed99aefb1%2F4733266c8d394280885a7a74daca1eef"
    },
    {
      "author": "Wafaa Shurafa, Sam Metz, Sally Abou Aljoud",
      "description": "Israeli and American officials are preparing to meet in Washington to discuss postwar Gaza. Their meeting on Wednesday comes as ceasefire talks show little apparent movement and outrage mounts over a deadly Israeli strikes on a southern Gaza hospital that killed 20, including journalists and emergency responders. Despite the postwar talk, there are few signs that it's nearing an end. Israel’s military said Wednesday it was continuing to prepare Gaza City residents, many already displaced, for an impending evacuation. Talks about the strip's future are unfolding as aid groups warn an expanded Israeli offensive could worsen the territory's humanitarian crisis.",
      "publishedAt": "2025-08-27T10:46:15Z",
      "title": "Israel's military calls Gaza City evacuation ‘inevitable’ as Washington hosts talks on post-war Gaza",
      "url": "https://apnews.com/article/gaza-mideast-war-israel-trump-bbf916e1576b93d964c8d94fb7c46512",
      "urlToImage": "https://dims.apnews.com/dims4/default/33689f2/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fbd%2F950c411554713ee3ab5585a789f3%2F57a78b0d5a7b460383ebabb01477140a"
    },
    {
      "author": "Munir Ahmed, Sheikh Saaliq",
      "description": "Indian media reports say intense rains have lashed parts of Pakistan and India and triggered flash floods in Indian-controlled Kashmir’s Jammu region, leaving at least 32 people dead and many missing following a landslide on a Hindu pilgrimage route. Authorities in Pakistan’s eastern Punjab province on Wednesday called for army assistance in rescue and relief efforts after torrential rains caused major rivers to swell, inundating villages and displacing more than 150,000 people. Officials say rescuers evacuated more than 20,000 people overnight from the outskirts of Lahore, Pakistan’s second-largest city, which also faced the risk of flood. Those evacuated from areas near Lahore were living along the bed of the Ravi River.",
      "publishedAt": "2025-08-27T08:12:55Z",
      "title": "Flash floods leave 32 dead in Indian-controlled Kashmir as over 150,000 are displaced in Pakistan",
      "url": "https://apnews.com/article/pakistan-india-floods-punjab-seeks-army-help-7764601f6012c24c72f36d4088b56b39",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6ee954/2147483647/strip/true/crop/8057x4532+0+419/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F04%2F052189d2226d1a842508663c6c71%2F850c94417d9d4beaa9acb689392305f2"
    },
    {
      "author": null,
      "description": "Denmark's foreign minister has summoned the top U.S. diplomat in the country after reports of covert influence operations in Greenland linked to people connected to Donald Trump. Both Denmark and Greenland, a semi-autonomous Danish territory, says the territory is not for sale, despite Trump's interest. Danish broadcaster DR reported Wednesday that at least three Americans have been involved in these operations. They allegedly compiled lists of U.S.-friendly Greenlanders and tried to influence local politics. The Danish Security and Intelligence Service believes Greenland is a target for influence campaigns. It said it is strengthening its efforts and presence in Greenland in cooperation with authorities there.",
      "publishedAt": "2025-08-27T08:05:10Z",
      "title": "Denmark summons US envoy after report of Americans carrying out influence operations in Greenland",
      "url": "https://apnews.com/article/denmark-greenland-us-trump-6c9544314792cf1e287e21af06111c1e",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f64d87/2147483647/strip/true/crop/5279x2969+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2Fb8%2Fdfe1f79998e8e30147ad27aa86e9%2Ff844712edff546bdaa22716cce654f08"
    },
    {
      "author": "Darlene Superville",
      "description": "President Donald Trump’s administration is taking control of Washington's Union Station from Amtrak, marking another federal intervention in the nation's capital. Transportation Secretary Sean Duffy announced the move Wednesday during the launch of the NextGen Acela high-speed train. Duffy says Union Station has \"fallen into disrepair\" when it should be a \"point of pride\" for the city, where Trump's Republican administration has increased federal law enforcement and immigration agents. Duffy echoes Trump's call for $2 billion from Congress to beautify Washington as part of his crackdown on the city. National Guard troops have been patrolling Union Station, which is walking distance from the U.S. Capitol. Duffy says Trump wants Union Station to be beautiful again.",
      "publishedAt": "2025-08-27T13:12:56Z",
      "title": "Trump takes management of Washington's Union Station away from Amtrak",
      "url": "https://apnews.com/article/trump-duffy-union-station-amtrak-management-8c1f5d00ab7591f3f021cf4a9ee8d8e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba785a0/2147483647/strip/true/crop/5486x3086+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F6f%2F044c53734a3b877e25265e2c17eb%2Fa0c7ebe2ad0d4f7db9f7ae463bcbfb9d"
    },
    {
      "author": "Matthew Perrone",
      "description": "The Food and Drug Administration has approved updated COVID-19 vaccines for the upcoming fall and winter season. But it could be weeks before many Americans know whether they’ll be able to get one, under new restrictions from the Trump administration. The new shots from Pfizer, Moderna and Novavax target newer version of the coronavirus. They are approved for all seniors but only for younger adults and children with at least one underlying health problem, like obesity. Additionally, officials revoked use of Pfizer's vaccine in young children.",
      "publishedAt": "2025-08-27T16:56:54Z",
      "title": "FDA approves updated COVID-19 shots but with some limits",
      "url": "https://apnews.com/article/vaccines-covid-shots-fda-kennedy-pfizer-children-9ce19908ae7afb354732aa162fd28532",
      "urlToImage": "https://dims.apnews.com/dims4/default/470e794/2147483647/strip/true/crop/1195x672+0+62/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F1f%2Fb60848ba77c8db4c9f1b4e16645a%2F02b5707d00454085b435f30afc9c48b1"
    },
    {
      "author": "Illia Novikov",
      "description": "A Ukrainian military official says Russia’s invading forces have broken into an eighth region of Ukraine, seeking to capture more ground in their three-year war of attrition as U.S.-led peace efforts struggle to gain traction. Victor Trehubov, spokesman for local ground forces, told The Associated Press that some Russian troops have entered two villages in the eastern Dnipropetrovsk region, a major Ukrainian industrial center next to the Donetsk region where fierce fighting has been taking place. Ukrainian troops are under severe strain as they try to hold back Russia’s bigger army.",
      "publishedAt": "2025-08-27T12:34:41Z",
      "title": "Russian forces break into another region of Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-38c342ceabdefb399171d587e4cba194",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6e91e3/2147483647/strip/true/crop/2936x1652+0+153/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2Ff7%2Fc152f24abdd107dca85fc1d8b270%2F5d4fa04fcdca4ef99ed0c22ddb8a1cca"
    },
    {
      "author": "Alex Veiga",
      "description": "Stocks are edging higher on Wall Street ahead of a highly anticipated earnings update from Nvidia. The S&P 500 rose 0.2% in midday trading Wednesday, while the Nasdaq composite rose 0.2%. The Dow Jones Industrial Average gained 104 points, or 0.2%. Investors see Nvidia’s quarterly report, coming after the bell, as a barometer for the strength of the boom in artificial intelligence because the company makes most of the chips that power the technology. Cracker Barrel climbed 8.3% after scrapping plans to change its logo following an uproar on social media that even drew a comment from President Trump. Global markets were mixed.",
      "publishedAt": "2025-08-27T05:25:49Z",
      "title": "Wall Street edges higher as the market waits for Nvidia",
      "url": "https://apnews.com/article/stocks-markets-rates-powell-india-439aecc08fd134cca14c66eabaa01e93",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f55cba/2147483647/strip/true/crop/4557x2563+0+237/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2Ffa%2Fff03edc8d071a1a945b73e5d80bc%2Fe46b4d9e162c4cd7aabcada155bff0e0"
    },
    {
      "author": "Kate Payne, Mike Schneider",
      "description": "A top Florida official says the controversial state-run immigration detention facility in the Everglades will likely be empty in a matter of days, even as Republican Gov. Ron DeSantis’ administration fights a federal judge’s order to shutter the facility dubbed “Alligator Alcatraz” by a late October deadline. That’s according to an email exchange shared with The Associated Press. In a message sent to a South Florida rabbi on Aug. 22 in regard to providing chaplaincy services at the facility, Florida Division of Emergency Management Executive Director Kevin Guthrie said “we are probably going to be down to 0 individuals within a few days.”",
      "publishedAt": "2025-08-27T16:43:01Z",
      "title": "Top Florida official: Florida's 'Alligator Alcatraz' Detention Center to be empty within days",
      "url": "https://apnews.com/article/florida-immigration-detention-center-desantis-alligator-alcatraz-f36fd04c18635eb7938a9ec26a31e92e",
      "urlToImage": "https://dims.apnews.com/dims4/default/57794da/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2F5f%2F42cc623733dc8ee6aceca81bb33f%2F6d1fbf88ef484a8397b38eaa8bd005de"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}