{
  "articles": [
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and MATT BROWN",
      "description": "WASHINGTON (AP) — Hours before the start of a federal government shutdown, President-elect Donald Trump doubled-down Friday on his insistence that a debt ceiling increase be included in any deal — and if not, let the closures “start now.”",
      "publishedAt": "2024-12-20T15:21:15Z",
      "title": "Trump wants debt ceiling in the budget deal. If not, he says let the government shutdown start now",
      "url": "https://apnews.com/da117337aa0c0adab34a5626bb5816af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/653c9a6a0d0b44b4b10a13fffdc59a72/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WEST PALM BEACH, Fla. (AP) — The smooth economy that Donald Trump was poised to inherit suddenly looks a bit rockier — with critics saying the president-elect is contributing to the uncertainty.The Dow Jones stock index essentially ended Thursday flat after having posted 10 days of losses.",
      "publishedAt": "2024-12-20T12:00:54Z",
      "title": "Trump was poised to inherit a strong economy. Then things got rocky and he added to the uncertainty",
      "url": "https://apnews.com/73d12a23ca26bb02883e6194a957affe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5422a809f4134241a5d8a1003fde56a7/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — The first U.S. diplomats to visit Syria since President Bashar Assad’s ouster earlier this month are now in Damascus to hold talks with the country’s new leaders and seek information on the whereabouts of missing American journalist Austin Tice.",
      "publishedAt": "2024-12-20T05:33:13Z",
      "title": "US diplomats and hostage envoy in Syria on first visit since Assad ouster",
      "url": "https://apnews.com/de71dc4920d4677fcfb2d31a2b6e6e54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d69b4a2f6f144205aa40951287e5d1a2/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "LONDON (AP) — Leaving Israel is easier, Shira Z. Carmel thinks, by saying it's just for now. But she knows better.For the Israeli-born singer and an increasing number of relatively well-off Israelis, the Oct.",
      "publishedAt": "2024-12-20T06:49:43Z",
      "title": "For thousands of Jews, Israel still doesn't feel safe after the Oct. 7 attacks. So they're leaving",
      "url": "https://apnews.com/4ec554e530c5dd821eed34deb9b579a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c389cdea9efe4282bf53460bb44981d7/2560.jpeg"
    },
    {
      "author": "HOLLY RAMER",
      "description": "CONCORD, N.H. (AP) — A growing number of U.S. colleges and universities are advising international students to return to campus before President-elect Donald Trump is inaugurated, over concerns that he might impose travel bans like he did during his first administration.",
      "publishedAt": "2024-12-20T05:09:35Z",
      "title": "International students urged to return to US campuses before Trump inauguration",
      "url": "https://apnews.com/bc0fedb4be66ef509629d4dbfedd904d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d7f96feb85442da86adc0415f0bbef6/3000.jpeg"
    },
    {
      "author": "ROBIN McDOWELL and MARGIE MASON",
      "description": "DADEVILLE, Ala. (AP) — A storm was looming when the inmate serving 20 years for armed robbery was assigned to transport fellow prisoners to their jobs at private manufacturers supplying goods to companies like Home Depot and Wayfair.",
      "publishedAt": "2024-12-20T16:26:01Z",
      "title": "Alabama profits off prisoners safe enough to work at McDonald’s, deems them too dangerous for parole",
      "url": "https://apnews.com/3b2c7e414c681ba545dc1d0ad30bfaf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a80df610c526494d8802859ab7061b6e/3000.jpeg"
    },
    {
      "author": null,
      "description": "DELPHI, Ind. (AP) — An Indiana man convicted in the 2017 killings of two teenage girls who vanished during a winter hike was sentenced to a maximum of 130 years in prison Friday in the case that’s long cast a shadow over the teens’ small hometown of Delphi.",
      "publishedAt": "2024-12-20T05:14:51Z",
      "title": "Indiana man sentenced to the maximum of 130 years in prison for 2017 killings of 2 teenage girls",
      "url": "https://apnews.com/61a65b189c9a8ccd0cb5358893fd501d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09eb117a7afc4c21b129ff943ec45e28/2000.jpeg"
    },
    {
      "author": "JESSIE WARDARSKI",
      "description": "PALMYRA, Pa. (AP) — It was a radical idea, and for many years she had been resistant.But as Zoey Stapleton, 24, walked down a darkened hiking trail, steps behind her parents, she counted back from three and “took a leap of faith,” revealing to them that she wanted to become a nun.",
      "publishedAt": "2024-12-20T13:00:49Z",
      "title": "Leap of faith: A few young women in US buck the trends by joining the ranks of Catholic nuns",
      "url": "https://apnews.com/4d61e7ed31df84f3879b119022cc170f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d30bb39b55484ad398798813418679b5/2961.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "SAO PAULO (AP) — Sloths weren’t always slow-moving, furry tree-dwellers. Their prehistoric ancestors were huge — up to 4 tons (3.6 metric tons) — and when startled, they brandished immense claws.",
      "publishedAt": "2024-12-20T08:00:19Z",
      "title": "Giant sloths and mastodons lived with humans for millennia in the Americas, new discoveries suggest",
      "url": "https://apnews.com/3c21c77cd108c5bfcdd8d8c87195c4c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/699f906e81b64d9a84a8bb11792c5d3d/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Drivers and airline passengers without reindeer and sleighs better make a dash for it: it's beginning to look like another record for holiday travel in the U.S.",
      "publishedAt": "2024-12-20T05:10:27Z",
      "title": "It's beginning to look like another record for holiday travel",
      "url": "https://apnews.com/02023bc4a9975d5bb0ac0aedbbaedeb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/031c841181e64db58ca3682e8f3d8a44/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}