{
  "articles": [
    {
      "author": "WAFAA SHURAFA, NAJIB JOBAIN and KAREEM CHEHAYEB",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Gaza came under its third total communications outage since the start of the war late Sunday, while Israel's military announced it had encircled Gaza City and divided the besieged coastal strip into two.",
      "publishedAt": "2023-11-05T05:08:16Z",
      "title": "Gaza has lost telecom contact again, while Israel's military announces it has surrounded Gaza City",
      "url": "https://apnews.com/eb1dfa6afe40ba267024c7d819e17194",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d419614d81d748c19de5dcf8b47f2cfd/1920.jpeg"
    },
    {
      "author": "LORI HINNANT and LAURIE KELLMAN",
      "description": "PARIS (AP) — The photo of the white-haired woman in a golf cart, wrapped in a purple blanket and flanked by a gunman, was among the first to emerge of the hostages seized during the Oct.",
      "publishedAt": "2023-11-05T14:00:54Z",
      "title": "Families of Israel hostages fear the world will forget. So they're traveling to be living reminders",
      "url": "https://apnews.com/ca1466cc052b08a642fff88280eb0b22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c01fb759be74a949aebab949c77b8bb/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "RAMALLAH, West Bank (AP) — U.S. Secretary of State Antony Blinken brought his diplomatic push on the Israel-Hamas war to the occupied West Bank on Sunday, meeting with Palestinian President Mahmoud Abbas as part of an intensifying Biden administration drive to reduce the suffering of Gaza's civilians under Israeli bombardment and to start to sketch out a post-conflict scenario for the territory.",
      "publishedAt": "2023-11-05T10:31:10Z",
      "title": "Blinken tries to assure Abbas in a West Bank stop aimed at containing fallout from the war",
      "url": "https://apnews.com/1139f6e433fa489fbf3bc4c41bc2d52d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4688d57fc76e4a758c348a2c62c26817/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "NEW YORK (AP) — Tamirat Tola wasn't thinking about breaking the New York City Marathon course record as he was running by himself in Central Park for the last few miles of the race. He just was focused on trying to win.",
      "publishedAt": "2023-11-05T16:23:43Z",
      "title": "Tamirat Tola sets NYC Marathon course record to win men's race; Hellen Obiri takes women's title",
      "url": "https://apnews.com/4ae6d5207f650cafd5e72e5286dd7d72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c35d2d837dd4316a8cd0383884174ab/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "DES MOINES, Iowa (AP) — Iowa Gov. Kim Reynolds plans to endorse Ron DeSantis for president, giving the Florida governor's 2024 campaign a boost as he struggles to show progress against Donald Trump in the Republican primary, two people familiar with the matter said Sunday.",
      "publishedAt": "2023-11-05T16:56:29Z",
      "title": "Iowa Gov. Kim Reynolds will endorse Florida Gov. Ron DeSantis for president, AP sources say",
      "url": "https://apnews.com/7759b16b3c8e2a8a19fa13fa1b2f976f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e651ce926b54540a7138113fbf9a093/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and ERIC TUCKER",
      "description": "NEW YORK (AP) — Donald Trump has testified in court as a football owner, casino builder and airline buyer. He bragged in a deposition that he saved “millions of lives” by deterring nuclear war as president.",
      "publishedAt": "2023-11-05T12:24:01Z",
      "title": "Trump's decades of testimony provide some clues about how he'll fight for his real estate empire",
      "url": "https://apnews.com/bd06bf8db3a14a9d2f10eb69b300c1d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84e52fa1739b420ca529b054a09994ec/3000.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Villagers in the mountains of northwest Nepal cremated the bodies of some who perished in an earthquake that shook the area Friday night. The strong temblor killed 157 people and left thousands homeless.",
      "publishedAt": "2023-11-04T08:23:19Z",
      "title": "Nepal villagers cremate loved ones who perished in earthquake that shook its northwest, killing 157",
      "url": "https://apnews.com/e3fbed76b72419339d3c0edd9ad44ee2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10d1ffa8362041b8b31db983e4add1a5/1920.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "BERLIN (AP) — The hostage situation at Hamburg Airport ended Sunday afternoon, around 18 hours after a man drove his vehicle through the gates of the airport with his 4-year-old daughter inside, authorities said.",
      "publishedAt": "2023-11-05T08:48:01Z",
      "title": "The hostage situation at Hamburg Airport ends with a man in custody and 4-year-old daughter safe",
      "url": "https://apnews.com/5ca37a0e638f2e9358ce8bebbbb279f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5a6658dc4ad4c08878c72f6a585c9de/3000.jpeg"
    },
    {
      "author": "AYANNA ALEXANDER",
      "description": "JACKSON, Miss. (AP) — A few years ago, Tiffany Wilburn just didn’t see the point in voting any longer.Her children didn’t have proper school books, health insurance was expensive and hard to get, police abuse continued against Black residents, and her city’s struggle to get clean drinking water seemed emblematic of her community always coming out on the short end of state decision-making.",
      "publishedAt": "2023-11-05T13:03:09Z",
      "title": "Mississippi has a history of voter suppression. Many see signs of change as Black voters reengage",
      "url": "https://apnews.com/90e2b6df8e3f0f2ed4141830fa1ee8f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f29bbac25cdd4e67ab65fe48054ade02/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Southern California dropped out of The Associated Press college football poll Sunday for the first time under coach Lincoln Riley and No.",
      "publishedAt": "2023-11-05T19:02:37Z",
      "title": "AP Top 25: USC drops out for first time under Lincoln Riley; Oklahoma State vaults in to No. 15",
      "url": "https://apnews.com/640b8a15447dd61949d8104056aef33f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61ebd40be3d84973a2db2ac6d1e4315d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}