{
  "articles": [
    {
      "author": null,
      "description": "WINDER, Ga. (AP) — Georgia school shooting suspect's father arrested on charges including second-degree murder and involuntary manslaughter.",
      "publishedAt": "2024-09-05T23:40:14Z",
      "title": "Georgia school shooting suspect's father arrested on charges including second-degree murder and involuntary manslaughter",
      "url": "https://apnews.com/0b207715431421bdb58132f880c86c52",
      "urlToImage": ""
    },
    {
      "author": "JEFF AMY and JEFF MARTIN",
      "description": "WINDER, Ga. (AP) — The father of the teenager accused of opening fire at a Georgia high school, killing four people and wounding nine, has been arrested on various charges including second-degree murder, authorities said Thursday.",
      "publishedAt": "2024-09-05T05:55:59Z",
      "title": "Father of Georgia school shooting suspect arrested on charges including second-degree murder",
      "url": "https://apnews.com/c3c97267a4dfff64a59e1605e515c2f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2d14367901746f68ca909a349a40931/1920.jpeg"
    },
    {
      "author": "AMY TAXIN, DEEPA BHARATH, ALEX VEIGA, CLAUDIA LAUER and ALANNA DURKIN RICHER",
      "description": "LOS ANGELES (AP) — President Joe Biden's son, Hunter, pleaded guilty Thursday to federal tax charges, a surprise move he said was meant to spare his family another painful and embarrassing criminal trial after his gun case conviction just months ago.",
      "publishedAt": "2024-09-05T04:06:43Z",
      "title": "Hunter Biden enters surprise guilty plea to avoid tax trial months after his gun conviction",
      "url": "https://apnews.com/6873692c030244b450e27826e7097946",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6437709d8aa64ae2b52443a0141899b8/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — The federal election interference case against Donald Trump inched forward Thursday, with a judge permitting prosecutors to file court documents later this month that could detail unflattering allegations about the former president as the Republican nominee enters the final weeks of his White House run.",
      "publishedAt": "2024-09-05T04:16:43Z",
      "title": "Prosecutors in Trump election case get judge's OK to lay out fresh evidence in court filing",
      "url": "https://apnews.com/f29a81ddd995b15afe95fcc00e928465",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/650ae7c16f7d4697971019656b3449a3/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, ADRIANA GOMEZ LICON and JOSH BOAK",
      "description": "NEW YORK (AP) — Former President Donald Trump suggested to business leaders Thursday that his plans to increase tariffs on foreign imports would solve seemingly unrelated challenges such as the rising cost of child care in the U.S.",
      "publishedAt": "2024-09-05T15:28:26Z",
      "title": "Trump suggests tariffs can help solve rising child care costs in a major economic speech",
      "url": "https://apnews.com/15ba5ecfdf5e907bd9b2c349b07222b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b794395849c64b0a81b9019c2e1881a4/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The Biden administration and Israeli Prime Minister Benjamin Netanyahu were sharply at odds Thursday over prospects of reaching a deal for a Gaza cease-fire and hostage release, with Netanyahu saying it was “exactly inaccurate” that a breakthrough was close.",
      "publishedAt": "2024-09-05T20:39:15Z",
      "title": "Netanyahu gives a starkly different take on Biden administration's hopes for a Gaza deal",
      "url": "https://apnews.com/f10fe52d2e0bf31bf9f9578ca0a6374a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b083ddee1fc47ecb69f754bcce9ffae/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Pope Francis wrapped up his visit to Indonesia on Friday after celebrating Mass before an overflow crowd of 100,000, a final celebration before heading to Papua New Guinea for the second leg of his 11-day journey through Southeast Asia and Oceania.",
      "publishedAt": "2024-09-05T23:45:16Z",
      "title": "Pope heads to Papua New Guinea after final Mass in Indonesia before an overflow crowd of 100,000",
      "url": "https://apnews.com/30c460c3ccea902cbcd8e5330d49ea1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f7f4e39a6a0416489753a556b4885ff/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and DAVID KLEPPER",
      "description": "WASHINGTON (AP) — The Justice Department has charged a Russian-born U.S. citizen and former adviser to Donald Trump's 2016 presidential campaign with working for a sanctioned Russian state television network and laundering the proceeds.",
      "publishedAt": "2024-09-05T16:42:37Z",
      "title": "Former 2016 Trump campaign adviser is charged over his work for sanctioned Russian TV",
      "url": "https://apnews.com/f0b0fe681c821f735c4e951736f041c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3f3e2520b0b4341a81d4beb596b3949/3000.jpeg"
    },
    {
      "author": "CATERINA MORBIATO",
      "description": "MEXICO CITY (AP) — Despite her well-paying tech job, Li Daijing didn’t hesitate when her cousin asked for help running a restaurant in Mexico City. She packed up and left China for the Mexican capital last year, with dreams of a new adventure.",
      "publishedAt": "2024-09-05T00:31:05Z",
      "title": "Chinese migrants flock to Mexico in search of jobs, a future and, for some, a taste of freedom",
      "url": "https://apnews.com/a69db5fc43fb380a4472b03b469fdcea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/31a85db473484daba487a9fbb7fe327a/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE and NICKY FORSTER",
      "description": "WASHINGTON (AP) — Federal regulators responsible for the safety of the U.S. drug supply are still struggling to get back to where they were in 2019, before the COVID-19 pandemic upended factory inspections in the U.S. and across the world, The Associated Press has found.",
      "publishedAt": "2024-09-05T13:15:03Z",
      "title": "Nearly 2,000 drug plants are overdue for FDA checks after COVID delays, AP finds",
      "url": "https://apnews.com/7b3a7e9b45bcc3aea86ce5bf781271f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5aad755249524296ba855241f85946c5/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}