{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel's military withdrew from Gaza’s largest hospital early Monday after a two-week raid, in which it said it killed some 200 militants and detained hundreds more.",
      "publishedAt": "2024-04-01T05:55:21Z",
      "title": "Israeli troops withdraw from Shifa Hospital, Gaza's largest, after 2-week raid",
      "url": "https://apnews.com/e75cf75aa88a9133774a883d987115c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7014449d9984edeb168b248b1e0d4eb/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL and QASSIM ABDUL-ZAHRA",
      "description": "BAGHDAD (AP) — A pro basketball team in Iraq is owned by a paramilitary group, and some of its forces recently attacked U.S.",
      "publishedAt": "2024-04-01T04:04:09Z",
      "title": "Americans star on an Iraqi basketball team. Its owners include forces that attacked US troops",
      "url": "https://apnews.com/f60be49545f919ab9145613e010f0e6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2bd6324b912462eabca539299e60b76/3000.jpeg"
    },
    {
      "author": "MIKE PESOLI and JEFFREY COLLINS",
      "description": "BALTIMORE (AP) — As divers assisted crews with the complicated and meticulous operation of removing the steel and concrete from the fallen Francis Scott Key Bridge in Baltimore, some near the site took time on Easter Sunday to reflect on the six workers presumed to have plunged to their deaths.",
      "publishedAt": "2024-03-31T17:00:51Z",
      "title": "Crews at Baltimore bridge collapse continue meticulous work of removing twisted steel and concrete",
      "url": "https://apnews.com/e656b7f2efcc7770de9c2d922faa7b20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69677de0298041dba5d99b0044de9347/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and JILL COLVIN",
      "description": "WASHINGTON (AP) — The video shared by former President Donald Trump features horror movie music and footage of migrants purportedly entering the U.S.",
      "publishedAt": "2024-04-01T04:04:30Z",
      "title": "Trump’s immigration rhetoric makes inroads with some Democrats. That could be a concern for Biden",
      "url": "https://apnews.com/327c08045edcc200f850d893de6a79d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa48b52b5d93495db28859fed3e86f27/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — Gunmen attacked a group of people in Ecuador ’s coastal city of Guayaquil killing nine and injuring 10 others, police said Sunday, the latest in a string of violent incidents in the South American country.",
      "publishedAt": "2024-03-31T17:42:15Z",
      "title": "Gunmen in Ecuador kill 9, injure 10 others in attack in coastal city of Guayaquil as violence surges",
      "url": "https://apnews.com/82895468cbeafd6246a59840a35741cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/959dadd55e154201b1f4c7ced91749b5/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "PHILADELPHIA (AP) — Jazmin Evans had been waiting for a new kidney for four years when her hospital revealed shocking news: She should have been put on the transplant list in 2015 instead of 2019 — and a racially biased organ test was to blame.",
      "publishedAt": "2024-04-01T06:00:18Z",
      "title": "A biased test kept thousands of Black people from getting a kidney transplant. It's finally changing",
      "url": "https://apnews.com/d4fabf2f3a47aab2fe8e18b2a5432135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2c68ddcc058451786d42b9044abeab0/1619.jpeg"
    },
    {
      "author": "HUIZHONG WU",
      "description": "TAIPEI, Taiwan (AP) — Their days often began at the crack of dawn.They’d head out to a church, a temple, a park and set up a stall. They’d seek out seniors in particular, those who are perhaps the most vulnerable citizens of the information-saturated society that has enveloped them.",
      "publishedAt": "2024-04-01T05:08:48Z",
      "title": "In Taiwan, a group is battling fake news one conversation at a time — with a focus on seniors",
      "url": "https://apnews.com/19773910ede8cdc39ae0ebc236cd652e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e92e59a45f64873b0502af8db8ab62d/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — The world’s largest democratic election could also be one of its most consequential.",
      "publishedAt": "2024-04-01T09:13:00Z",
      "title": "Here's what you need to know about the world's largest democratic election kicking off in India",
      "url": "https://apnews.com/8998fe6aba5fa26debc0f82c4e2ccf69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92291ed54d5545719a3ad66f05f09ac8/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Through his office window at what was then one of Africa's few modern clinics dealing with HIV and AIDS, the man who now oversees the United States' threatened global AIDS effort used to hear the sound of taxis pulling up throughout the day.",
      "publishedAt": "2024-04-01T04:30:19Z",
      "title": "The pioneer of America's embattled global HIV program recalls the hope after years of despair",
      "url": "https://apnews.com/43b09c9ad24530d24161a95b2fb80eaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e51f6c76b9c4f758124e76e037ab242/3000.jpeg"
    },
    {
      "author": "TIM BOOTH",
      "description": "PORTLAND, Ore. (AP) — The 3-point line for the women's NCAA Tournament at Moda Center had a discrepancy in distance at each end of the court that went unnoticed through four games over two days before Texas and North Carolina State were informed of the problem ahead of their Elite Eight matchup on Sunday.",
      "publishedAt": "2024-03-31T20:40:13Z",
      "title": "Women's NCAA Tournament games in Portland played on court with mismatched 3-point lines",
      "url": "https://apnews.com/6e86e15df4b82a77e8e7a94e0d163faf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72d035694972424695b7db1aef9888cf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}