{
  "articles": [
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE and WILL WEISSERT",
      "description": "WASHINGTON (AP) — A divided America weighed a stark choice for the nation’s future Tuesday as a presidential campaign marked by upheaval and rancor approached its finale.",
      "publishedAt": "2024-11-05T11:29:35Z",
      "title": "A sharply divided America decides between Trump and Harris",
      "url": "https://apnews.com/83c8e246ab97f5b97be45cdc156af4e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9af9542d62b6406fba8da181ece89d80/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Election Day is here. Voters are gearing up to head to the polls to cast their ballots for either Donald Trump or Kamala Harris in one of the nation’s most historic presidential races.",
      "publishedAt": "2024-11-05T11:18:20Z",
      "title": "The Latest: Trump and Harris cede stage to voters who'll also decide control of House and Senate",
      "url": "https://apnews.com/a2352c1cc3289d206d21260c5dc34da8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e98fd9af34c94cc9ae11b37c8d1cf447/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Voters said the economy and immigration are the top issues facing the country, but the future of democracy was also a leading motivator for many Americans casting a ballot in Tuesday’s presidential election.",
      "publishedAt": "2024-11-05T22:01:14Z",
      "title": "AP VoteCast: Economy ranked as a top issue, but concerns over democracy drove many voters to polls",
      "url": "https://apnews.com/d5cf4e3611f50ec4349d93ddc7f037cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a75337901bf4423b62f6104f2083949/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and ALI SWENSON",
      "description": "WASHINGTON (AP) — After an election season marked by concerns over disinformation, foreign influence and worrisome threats to election workers and voting systems, Election Day unfolded relatively smoothly nationwide with only scattered disruptions and delays.",
      "publishedAt": "2024-11-05T05:06:00Z",
      "title": "Voting period marked by massive early turnout ends with few problems, generally smooth Election Day",
      "url": "https://apnews.com/a8ae22f34417dcda060b430dac89bdbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9af9542d62b6406fba8da181ece89d80/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "While electing officials to make and enforce laws, voters in dozens of states are also deciding on more than 140 ballot proposals affecting the way people legally live, work and die. As 10 states consider measures related to abortion or reproductive rights on Tuesday's ballots, about a half-dozen states are weighing the legalization of marijuana for either recreational or medical use.",
      "publishedAt": "2024-11-05T05:02:42Z",
      "title": "Voters deciding dozens of ballot measures affecting life, death, taxes and more",
      "url": "https://apnews.com/64bada2b555df6c817151796fa81ae7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/665e604bee2d47fd8e2f4ed705dcfed2/2340.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Control of Congress is at stake Tuesday, with ever-tight races for the House and Senate that will determine which party holds the majority and the power to boost or block a president’s agenda, or if the White House confronts a divided Capitol Hill.",
      "publishedAt": "2024-11-05T05:01:59Z",
      "title": "Control of Congress is at stake and with it a president's agenda",
      "url": "https://apnews.com/94b49277db2a5c21f23236794a36afa6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8eabc4a73534679854e090bf604222e/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "WASHINGTON (AP) — The results on Election Day will come down to seven states: Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin.",
      "publishedAt": "2024-11-03T12:45:07Z",
      "title": "When polls close in battleground states on Election Day",
      "url": "https://apnews.com/964d07d7d6a9d6d034850497821f9cd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6353fe95810345bdab828eaa4785f723/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu on Tuesday dismissed his popular defense minister, Yoav Gallant, in a surprise announcement that came as the country is embroiled in wars on multiple fronts across the region.",
      "publishedAt": "2024-11-05T18:08:53Z",
      "title": "Israel's Netanyahu dismisses his defense minister as wars rage. Protests erupt across country",
      "url": "https://apnews.com/3810d3adb1603e8485b4be46a5b79f8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee8f759d691f4bfeb0b3784ce4b8cc22/1920.jpeg"
    },
    {
      "author": null,
      "description": "SAN DIEGO (AP) — Former military defense contractor Leonard “Fat Leonard” Francis was sentenced Tuesday to 15 years in prison for masterminding a decade-long bribery scheme that swept up dozens of U.S.",
      "publishedAt": "2024-11-05T21:48:24Z",
      "title": "'Fat Leonard,' Navy contractor behind one of the military's biggest scandals, sentenced to 15 years",
      "url": "https://apnews.com/d1a0531c783172e2196612d8702bf454",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1863f09ef6a4d3db5a43934f58522fd/3000.jpeg"
    },
    {
      "author": "HERNÁN MUÑOZ and JOSEPH WILSON",
      "description": "SEDAVI, Spain (AP) — Francisco Murgui went out to try to salvage his motorbike when the water started to rise.He never came back.One week after catastrophic flooding devastated eastern Spain, María Murgui still holds out hope that her missing father is alive.",
      "publishedAt": "2024-11-05T12:12:07Z",
      "title": "A week after Spain's floods, families hope that the missing are alive with 89 unaccounted for",
      "url": "https://apnews.com/d032b706a16c1051ee2d741af10afa7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f27a65ad36649f98f6e0352d86cc0e6/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}