{
  "articles": [
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau announced his resignation Monday after nearly a decade in power, bowing to rising discontent over his leadership and growing turmoil within his government signaled by the abrupt departure of his finance minister.",
      "publishedAt": "2025-01-06T14:14:44Z",
      "title": "Canada's Trudeau announces resignation after nearly a decade as prime minister",
      "url": "https://apnews.com/03b27b55590bda7fb341065dd51fb873",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d84191096ca4f888f401f2257d655b6/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK, FARNOUSH AMIRI and MATT BROWN",
      "description": "WASHINGTON (AP) — Congress certified President-elect Donald Trump as the winner of the 2024 election in proceedings Monday that unfolded without challenge, in stark contrast to the Jan.",
      "publishedAt": "2025-01-06T05:03:45Z",
      "title": "Congress certifies Trump's 2024 win, without the Jan. 6 mob violence of four years ago",
      "url": "https://apnews.com/b8284b9b6b22f78ab7f23f8c8b3c3da3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1749928959c44dd390f467789b9708ed/1920.jpeg"
    },
    {
      "author": "DEE-ANN DURBIN",
      "description": "Four years after launching a push for more diversity in its ranks, McDonald’s is ending some of its diversity practices, citing a U.S. Supreme Court’s decision that outlawed affirmative action in college admissions.",
      "publishedAt": "2025-01-06T20:37:54Z",
      "title": "McDonald's is the latest company to roll back diversity goals",
      "url": "https://apnews.com/845d94cd46511341a43e98e057b0fa8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8e28726a5694c34a9a506e178f3d2a4/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — A huge swath of the U.S. was blasted with ice, snow and wind on Monday as the polar vortex that dipped south over the weekend kept much of the country east of the Rockies in its frigid grip, making many roads treacherous, forcing school closures, and causing widespread power outages and flight cancellations.",
      "publishedAt": "2025-01-06T05:02:53Z",
      "title": "Polar vortex keeps much of the US in its icy grip",
      "url": "https://apnews.com/8b96d7f30cd068a56f7d0401ab51cebe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d68cfc4c655447e8a2342581c67cfa03/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — The first U.S. bird flu death has been reported — a person in Louisiana who had been hospitalized with severe respiratory symptoms.State health officials announced the death on Monday, and the Centers for Disease Control and Prevention confirmed it was the nation's first due to bird flu.",
      "publishedAt": "2025-01-06T21:27:37Z",
      "title": "First US bird flu death is announced in Louisiana",
      "url": "https://apnews.com/82e4d00876e62cb2b13bb621826c84f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1468de5f8a574a0fa62c3579cbac06d4/2579.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — The Minneapolis City Council on Monday approved an agreement with the federal government in response to the murder of George Floyd that would require reforms within the city’s police department under long-term court supervision.",
      "publishedAt": "2025-01-06T16:52:39Z",
      "title": "Minneapolis OKs police reform deal with the US government in the wake of George Floyd's murder",
      "url": "https://apnews.com/c37b90d4217b549e52fc176e08dec29f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b7e795343884f83ab69ea58b7820a35/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "NEW ORLEANS (AP) — President Joe Biden on Monday visited a makeshift memorial at the site of the deadly New Year’s attack in New Orleans, holding a moment of silence before meeting with grieving families and attending a prayer service.",
      "publishedAt": "2025-01-06T12:04:36Z",
      "title": "Biden visits makeshift memorial in New Orleans where attack began that killed 14 and injured 30",
      "url": "https://apnews.com/5c92619c079e2f104e42e1d7b8bea424",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6be9cffec75744bcaa94308b656abdf3/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel and Hamas once again appear to be inching toward a ceasefire that could wind down the 15-month war in Gaza and bring home dozens of Israelis held hostage there.",
      "publishedAt": "2025-01-06T19:22:23Z",
      "title": "Hurdles remain as Israel and Hamas once again inch toward a ceasefire deal",
      "url": "https://apnews.com/409a3c76c83e75abb7ff2b1d8a5abd38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7c0af8e47f84033a4c597e729dc6465/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — President-elect Donald Trump was thwarted Monday in his bid to indefinitely postpone this week’s sentencing in his hush money case while he appeals a ruling that upheld the verdict and put him on course to be the first president to take office convicted of crimes.",
      "publishedAt": "2025-01-06T14:34:59Z",
      "title": "Judge denies Trump's bid to halt Friday's hush money case sentencing while they appeal to block it",
      "url": "https://apnews.com/e20933f9418bd378925e5f9e75f28485",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14711bc550b143bb82f4e1c515dc4ad0/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Rudy Giuliani was found in contempt of court Monday for failing to properly respond to requests for information as he turned over assets to satisfy a $148 million defamation judgment granted to two Georgia election workers.",
      "publishedAt": "2025-01-06T20:22:29Z",
      "title": "Rudy Giuliani is in contempt of court in $148 million defamation case",
      "url": "https://apnews.com/5fe7787f42b4b89ef9d6df50bcde2efb",
      "urlToImage": ""
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}