{
  "articles": [
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Hamas' top political leader was killed Wednesday by a predawn airstrike in the Iranian capital, Iran and the militant group said, blaming Israel for a shock assassination that risked escalating into an all-out regional war.",
      "publishedAt": "2024-07-31T03:09:49Z",
      "title": "Hamas' top political leader is killed in Iran in strike that risks triggering all-out regional war",
      "url": "https://apnews.com/30968a7acb31cd8b259de9650014b779",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91d0faa7eb1c47e28f81237e682f9991/1920.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "GENEVA (AP) — The U.N. human rights office issued a report Wednesday saying Palestinians detained by Israeli authorities since the Oct.",
      "publishedAt": "2024-07-31T06:11:35Z",
      "title": "UN report says Palestinians detained by Israeli authorities since Oct. 7 faced torture, mistreatment",
      "url": "https://apnews.com/db4555b8ba44e23d445550b10f4c35ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a90ad0be6377466fa0b0e61038906332/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB and BASSEM MROUE",
      "description": "BEIRUT (AP) — The militant Palestinian group Hamas has a history of swift and smooth replacement of fallen leaders killed in Israeli airstrikes.",
      "publishedAt": "2024-07-31T12:40:06Z",
      "title": "The war in Gaza might complicate Haniyeh's replacement. Here are the possible contenders",
      "url": "https://apnews.com/16859ac53059cd395cf1cd785bbde939",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6822b4ea2d2342918cd306ebe253430c/3000.jpeg"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "Delta Air Lines CEO Ed Bastian says the airline is facing $500 million in costs related to a global tech outage this month that disrupted emergency services, communications and thousands of businesses.",
      "publishedAt": "2024-07-31T13:33:20Z",
      "title": "Delta CEO says airline is facing $500 million in costs from global tech outage",
      "url": "https://apnews.com/5902eb14e0ec23697d8ffd9c0e63f23e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b88a9f7321ae46cb88c9d8018f4e3368/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and PAT GRAHAM",
      "description": "PARIS (AP) — Olympic triathletes dove into the Seine River on Wednesday after organizers declared the water in Paris safe for swimming following days of concerns about elevated bacteria levels caused by heavy rains last week.",
      "publishedAt": "2024-07-31T02:08:53Z",
      "title": "Olympic triathletes swim in Seine River after days of concerns about water quality",
      "url": "https://apnews.com/358b29063ac00253c072290281043eaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9eb891efd7a64e9ab95f359c5f91d0fe/3000.jpeg"
    },
    {
      "author": null,
      "description": "CHATEAUROUX, France (AP) — A spinal injury ended Adriana Ruano's chances of competing at the Olympics as a gymnast. She came back as a shooter and won Guatemala's first gold medal on Wednesday.Ruano was training for the 2011 world championships in gymnastics, a qualifier for the London Olympics the following year, when she felt pain in her back.",
      "publishedAt": "2024-07-31T14:45:06Z",
      "title": "Gymnast-turned-shooter Adriana Ruano wins Guatemala's first Olympic gold",
      "url": "https://apnews.com/72bb447ac25c35e5de27b4b1e0d7f7d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a35a33c3a264044ab18eb399d1d56ad/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Pressure kept building against Venezuelan President Nicolás Maduro on Wednesday, when his close ally Colombian President Gustavo Petro, joined other foreign leaders in urging him to release detailed vote counts from the recent presidential election after electoral authorities declared him the winner.",
      "publishedAt": "2024-07-31T13:48:56Z",
      "title": "Colombian president urges ally, Venezuela's Maduro, to release detailed vote counts from election",
      "url": "https://apnews.com/00d399b74300b6d1ed010bed9539a166",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6baf9ade5361404ab7e9541dc8db22c4/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris appears to have energized Democrats in the early days of her candidacy, with the surge in warm feelings extending across multiple groups, including some key Democratic constituencies that had been especially tepid about President Joe Biden, a new poll shows.",
      "publishedAt": "2024-07-31T04:02:02Z",
      "title": "About 8 in 10 Democrats are satisfied with Harris in stark shift after Biden drops out: AP-NORC poll",
      "url": "https://apnews.com/1feb5ed3c2e29623ce3cec3565b487cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f361775658f4c0aae0e0642a4289bc7/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — Donald Trump's invitation to address the National Association of Black Journalists has sparked an intense debate within the organization and a flurry of arguments online.",
      "publishedAt": "2024-07-30T21:09:59Z",
      "title": "A speaking invitation to Donald Trump splits the most prominent American group for Black journalists",
      "url": "https://apnews.com/c84311a4e3bec3fe3052236151597d81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34fce797702d4e54959a991a5da9e464/3000.jpeg"
    },
    {
      "author": "LISA RATHKE, NICK PERRY and KATHY McCORMACK",
      "description": "LYNDON, Vt. (AP) — Vermont’s governor said Wednesday that the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he called on residents to “stick together” amid fears that more bad weather was on its way.",
      "publishedAt": "2024-07-31T04:01:23Z",
      "title": "Governor calls on flood-weary Vermonters to 'stick together' with more thunderstorms on the horizon",
      "url": "https://apnews.com/7872348db84f506598624e9fb9c2ae40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56f3685db0174014a9e4a0ab5ded48d1/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}