{
  "articles": [
    {
      "author": "STEVE PEOPLES and ZEKE MILLER",
      "description": "CHICAGO (AP) — Over and over, from the massive stage in the electric convention hall, the Democrats this week predicted Kamala Harris would defeat Donald Trump.",
      "publishedAt": "2024-08-23T05:05:41Z",
      "title": "The 'joyful' Democratic convention is over. The real test for Kamala Harris' campaign now begins",
      "url": "https://apnews.com/7846ddab4b7bd64d38e255285e6649d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e039ea9e486454ea2fbe7c8125ceb92/2296.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — With anger over the war in Gaza simmering, Vice President Kamala Harris tried to defuse one of the most divisive issues within the Democratic Party on the biggest political stage of her life.",
      "publishedAt": "2024-08-23T14:44:45Z",
      "title": "Harris confronts Democratic divisions over Gaza war in convention speech",
      "url": "https://apnews.com/352811a116d0618acea7ae6bcd10573a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/647dbbb26d3a4d07b094479dc72bbba8/3000.jpeg"
    },
    {
      "author": "FATMA KHALED",
      "description": "CAIRO (AP) — When Mostafa Qadoura was a week old, an Israeli strike on his home in the Gaza Strip last October launched him and his crib into the air, sent shrapnel into his right eye that damaged it beyond repair and killed one of his brothers.",
      "publishedAt": "2024-08-23T06:03:44Z",
      "title": "A baby evacuated from Gaza lost an eye and most of his family in the war",
      "url": "https://apnews.com/93f4b92c2117b2761126d0a3e62ab797",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee2740a656a3410da7fc53ead525c951/1920.jpeg"
    },
    {
      "author": "REBECCA SANTANA and VALERIE GONZALEZ",
      "description": "Sixteen Republican-led states are suing to end a federal program that could potentially give nearly half a million immigrants without legal status who are married to U.S. citizens a path to citizenship.",
      "publishedAt": "2024-08-23T15:52:04Z",
      "title": "Texas, other GOP-led states sue over program to give immigrant spouses of US citizens legal status",
      "url": "https://apnews.com/d02243b21b8490c912008b896a83bcd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/737738bed71d42fab29787cd87049b92/3000.jpeg"
    },
    {
      "author": "MARGERY A. BECK",
      "description": "LINCOLN, Neb. (AP) — Nebraska voters will choose between two competing abortion measures to either expand abortion rights or limit them to the current 12-week ban — a development likely to drive more voters to the polls in a state that could see one of its five electoral votes up for grabs in the hotly contested presidential race.",
      "publishedAt": "2024-08-23T16:28:59Z",
      "title": "Competing measures to expand or limit abortion rights will appear on Nebraska’s November ballot",
      "url": "https://apnews.com/513d8bde38f15dee16e9cd216070d704",
      "urlToImage": ""
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "JACKSON, Wyoming (AP) — With inflation nearly defeated and the job market cooling, the Federal Reserve is prepared to start cutting its key interest rate from its current 23-year high, Chair Jerome Powell said Friday.",
      "publishedAt": "2024-08-23T07:00:26Z",
      "title": "Powell at Jackson Hole: 'The time has come' for the Fed to soon begin reducing interest rates",
      "url": "https://apnews.com/2cd182eb34a7d6772ff573bec0bcf64d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5c788e304574dc089c43da808ebc429/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and ALI SWENSON",
      "description": "PHOENIX (AP) — Robert F. Kennedy Jr. and Donald Trump are set to appear miles apart in Arizona on Friday as speculation grows that Kennedy could drop his independent presidential bid and endorse the Republican nominee.",
      "publishedAt": "2024-08-23T03:29:03Z",
      "title": "RFK Jr. is set to speak in Arizona hours before Trump as questions swirl around a possible alliance",
      "url": "https://apnews.com/a2638f89ddcb5de03edbe4574ca17d45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7e68e67cbe94e5fa0076a420a45466b/1920.jpeg"
    },
    {
      "author": "KATE PAYNE",
      "description": "FORT WALTON BEACH, Fla. (AP) — A Florida Panhandle sheriff’s deputy was charged with manslaughter with a firearm in connection with the fatal shooting an airman who opened his apartment door while holding a gun, prosecutors said Friday.",
      "publishedAt": "2024-08-23T16:37:33Z",
      "title": "Prosecutor says ex-sheriff's deputy charged with manslaughter in shooting of an airman at his home",
      "url": "https://apnews.com/f6a2d835376040c84298e12ca8b17f69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/167678f9f81d4f9da55d38ce56757d01/3000.jpeg"
    },
    {
      "author": "ROB GILLIES and JOSH FUNK",
      "description": "TORONTO (AP) — A Canadian workers union issued a 72-hour strike notice to one of Canada’s two major freight railroads Friday, only hours after the company's trains had begun rolling again following a potentially devastating stoppage. Trains were expected to keep moving at least through Monday morning.",
      "publishedAt": "2024-08-23T11:53:26Z",
      "title": "Canadian union issues 72-hour strike warning to freight railroad hours after it resumes service",
      "url": "https://apnews.com/6e13bb31a3708d11e961174e6c47a558",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffcac535e09543f089c4d4fb5507a5f3/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and R.J. RICO",
      "description": "WASHINGTON (AP) — The Justice Department filed an antitrust lawsuit Friday against real estate software company RealPage Inc., accusing it of an illegal scheme that allows landlords to coordinate to hike rental prices.",
      "publishedAt": "2024-08-23T15:02:28Z",
      "title": "Justice Department accuses RealPage of a scheme to help landlords hike rents in antitrust lawsuit",
      "url": "https://apnews.com/e9d0a2fcab6a7f2200847b36c4fc1aca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6b045c60ffa40149505cbe14c1d9d2c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}