{
  "articles": [
    {
      "author": "PHILIPP JENNE, SUSIE BLANN, EMMA BURROWS",
      "description": "Two top European leaders have stiffened their spines over unsettling new policies from President Donald Trump. Ukraine’s president urged creation of an “armed forces of Europe” and the leader of Germany denounced meddling in its election after U.S. Vice President JD Vance met with a German far-right leader. Strident speeches from Ukrainian President Volodymyr Zelenskyy and German Chancellor Olaf Scholz at the Munich Security Conference on Saturday testified to the impact of Trump decisions that have resonated at home and in Europe. Those include Trump's hopes to end the Russia-Ukraine war and nurture political allies.",
      "publishedAt": "2025-02-15T08:06:51Z",
      "title": "Zelenskyy says time has come for creation of 'armed forces of Europe'",
      "url": "https://apnews.com/article/germany-munich-vance-election-zelenskyy-scholz-ukraine-4e48e115b504f9e3609b3457b48f9db0",
      "urlToImage": "https://dims.apnews.com/dims4/default/4323c35/2147483647/strip/true/crop/5685x3198+0+445/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2Fff%2Feef2a55fcf25b45fd0c808315eac%2F495abdcee36b4bf091e13e3613c11e86"
    },
    {
      "author": "PAUL WISEMAN, CHRISTOPHER RUGABER",
      "description": "President Donald Trump is taking a blowtorch to the rules that have governed world trade for decades. The “reciprocal’’ tariffs that he announced Thursday are likely to create chaos for global businesses and conflict with America’s allies and adversaries alike. Pointing to America’s massive trade deficits, Trump charges that the playing field is tilted against U.S. companies. A big reason for that, he and his advisers say, is because other countries usually tax American exports at a higher rate than America taxes theirs. Trump has a fix: He’s raising U.S. tariffs to match what other countries charge. Economists don’t share Trump’s enthusiasm for tariffs. They’re a tax on importers that usually get passed on to consumers.",
      "publishedAt": "2025-02-14T23:00:59Z",
      "title": "Trump's reciprocal tariffs will overturn decades of trade policy",
      "url": "https://apnews.com/article/trump-reciprocal-tariff-trade-deficit-4329a37b5a41ac944dcc74093410a126",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1d9751/2147483647/strip/true/crop/5413x3045+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F94%2F1cfaf0caeb1828754c187b774a26%2F47e86d977fd54f85a71aaa048060a794"
    },
    {
      "author": "ALFONSO NQUNJANA, GERALD IMRAY",
      "description": "Some white South Africans have showed support for President Donald Trump and gathered at the U.S. Embassy in Pretoria to claim they are victims of racism by their own government. Hundreds of protesters held placards Saturday that read “Thank God for President Trump” and displayed other messages criticizing what they see as racist laws instituted by the South African government that discriminate against the white minority. Many were from the white Afrikaner community that Trump focused on in an executive order a week ago that cut aid and assistance to the South African government.",
      "publishedAt": "2025-02-15T10:39:12Z",
      "title": "White South Africans gather in support of Trump",
      "url": "https://apnews.com/article/trump-south-africa-white-afrikaners-b41aa729360af4d1d090ea1ac1e22cce",
      "urlToImage": "https://dims.apnews.com/dims4/default/c28ed8a/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F55%2Fb6e677ce615b63042c08113ed1af%2Fb6b1f74e5e1044bdb1ecbe472bb22cb1"
    },
    {
      "author": "JUSTIN SPIKE, NICHOLAS RICCARDI",
      "description": "U.S. conservatives have looked to Hungary's Viktor Orbán as an inspiration for a right-wing America, and the prime minister has become a close ally of President Donald Trump. During Orbán's 15 years in power, he's transformed Hungary from a young democracy into what the European Parliament calls an “electoral autocracy.” The Orbán-Trump relationship is drawing renewed interest as Trump pushes to expand his presidential power in his second term. While the countries’ systems of government are different, there are striking parallels between Trump’s actions and agenda, and what Orbán has achieved in Hungary.",
      "publishedAt": "2025-02-15T12:42:43Z",
      "title": "How Hungary's 'electoral autocracy' parallels Trump's return",
      "url": "https://apnews.com/article/trump-orban-hungary-autocracy-authoritarian-republicans-dfdf6299a614ec4e364be37c1132e446",
      "urlToImage": "https://dims.apnews.com/dims4/default/faf6722/2147483647/strip/true/crop/5045x2838+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F4d%2F6d52e83e30c2f522d591e369959a%2F9defd5d3439b4edd9c0fb29cee689b9d"
    },
    {
      "author": "HOLLY RAMER, PATRICK WHITTLE, MARK SCOLFORO",
      "description": "A traffic stop in Vermont has cracked open a cultlike group called Zizians linked to six deaths in three states. Officials have offered few details about their cross-country investigation, but police and court records, interviews and online postings point to a small group of young computer scientists portrayed as highly intelligent and increasingly violent. Their goals aren’t clear, but online writings span topics from radical veganism and gender identity to artificial intelligence. The dead include Border Patrol Agent David Maland, two members of the group, the parents of another member and a California landlord who tried to evict some of them.",
      "publishedAt": "2025-02-15T05:03:30Z",
      "title": "A Vermont border agent’s death was the latest violence linked to the cultlike Zizian group",
      "url": "https://apnews.com/article/vermont-border-patrol-shooting-youngblut-lasota-zizians-6541ebcefc2806efd105d7db99a24aaf",
      "urlToImage": "https://dims.apnews.com/dims4/default/edfd14f/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2Fc1%2Fa48e011416b25ac3d0b11cf97f5d%2F75895b07e3cd4b8cb837536b5c48a8ac"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "President Donald Trump has toured a Boeing airplane to check out new hardware and technology features and highlight the aircraft maker's delay in delivering updated versions of the Air Force One presidential aircraft. The private plane was parked at Palm Beach International Airport on Saturday. The current Air Force One planes are more than 30 years old. Boeing has had to push delivery of the new versions from 2024 to 2027 and 2028. Trump has railed against the project's cost and the delivery delays. Boeing's CEO recently said Trump adviser Elon Musk is working with the company to help speed delivery.",
      "publishedAt": "2025-02-15T19:47:01Z",
      "title": "Trump tours Boeing plane to highlight aircraft maker's delay in delivering a new Air Force One",
      "url": "https://apnews.com/article/trump-boeing-air-force-one-presidential-plane-61aec3dbc8ee10d840e160911c9f7cc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d89624/2147483647/strip/true/crop/6719x3779+0+349/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2Fa1%2Fee2b95d8afc05721e2e6ad09c317%2F2e1192ced45b4e5db5b4755daffa0945"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "Israel has released 369 Palestinian prisoners and detainees in the latest exchange for Israeli hostages captured by Hamas as the fragile ceasefire hold. Israel views the prisoners as terrorists while Palestinians see them as freedom fighters resisting a decades-long military occupation. Nearly every Palestinian has a friend or family member who has been jailed by Israel at some point. Some are held for months or years without trial.",
      "publishedAt": "2025-02-15T13:14:51Z",
      "title": "Who are the Palestinian prisoners released in exchange for Israeli hostages?",
      "url": "https://apnews.com/article/israel-palestinian-prisoner-release-hamas-ceasefire-hostage-3a20774bb4b519e852273ec559687b3b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8eaa1a/2147483647/strip/true/crop/3686x2073+0+192/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fa9%2F60c7a9ccdbe756384ff15fd043fe%2Fb781492e4d314010bf005485b89ce217"
    },
    {
      "author": "MOHAMMAD JAHJOUH, MELANIE LIDMAN, JALAL BWAITEL",
      "description": "Hamas-led militants have released three male Israeli hostages, and Israeli forces began releasing hundreds of prisoners in return, in the latest indication that the fragile ceasefire deal that has paused fighting in the Gaza Strip but that had teetered in recent days, is holding. The three — Iair Horn, Sagui Dekel Chen and Alexander (Sasha) Troufanov — had been abducted from Kibbutz Nir Oz, a hard-hit community in the Oct. 7, 2023, attack that ignited the war. Israel is expected to release 369 Palestinian prisoners and detainees, including 36 serving life sentences over deadly attacks.",
      "publishedAt": "2025-02-15T04:47:59Z",
      "title": "Israel begins releasing Palestinian prisoners after Hamas freed 3 hostages",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-15-2025-22a2d731961eb766e6c7914cb84e3990",
      "urlToImage": "https://dims.apnews.com/dims4/default/49d4412/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F0b%2Fc1f4144e7a052c7b74dee2722cfa%2F3c696641bfe6480a9f3d969c2b2a5160"
    },
    {
      "author": "DYLAN LOVAN",
      "description": "Much of the U.S. East is enduring a renewed round of harsh, soggy weather. Flooding has submerged cars and buildings in Kentucky, and mudslides blocked roads in Virginia. Forecasters predicted snowstorms in the Northeast and the threat of tornadoes for the Mississippi Valley. Kentucky, Tennessee, West Virginia and Arkansas were under flood warnings. Meanwhile heavy snow is expected to blanket much of New England. Meteorologists are also warning that the U.S. is about to get its 10th and coldest polar vortex stretching event this season. The chilly air is predicted to first hit the northern Rockies and northern Plains on Saturday.",
      "publishedAt": "2025-02-15T16:37:32Z",
      "title": "Eastern US endures a renewed round of harsh, soggy weather",
      "url": "https://apnews.com/article/rain-snow-flooding-0c4ddcf08eba65e62f9c070f59947457",
      "urlToImage": "https://dims.apnews.com/dims4/default/01d3f94/2147483647/strip/true/crop/1668x938+0+87/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F01%2Fc1cc669c381e471bb4f255092eda%2F2a1286cdd1884ca182833dddaa1f3073"
    },
    {
      "author": "STEPHANIE LICHTENSTEIN",
      "description": "A 23-year-old man has stabbed six passersby in southern Austria in what police said was a random attack that left a 14-year-old dead and five others injured.. The suspect was detained Saturday by police. He is a Syrian national with legal residence in Austria. A 42-year-old man who works for a food delivery company witnessed the incident from his car. He drove toward the suspect and helped to prevent things from getting worse, a police spokesperson told Austria’s public broadcaster ORF.",
      "publishedAt": "2025-02-15T18:41:16Z",
      "title": "A 23-year-old man stabbed 6 people in Austria killing 1 in what police describe as a random attack",
      "url": "https://apnews.com/article/austria-stabbings-4913f6921c6f27e6d7fd8590da85cc9f",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e79fcd/2147483647/strip/true/crop/7751x4360+0+404/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2F23%2Fb01a314ce32ddc3c81b2796482f8%2F66b250fb8def4b23b2b3c3811eee3a58"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}