{
  "articles": [
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Donald Trump is returning to the stock market, and the former president stands to reap a sizeable payout in the process.Shareholders of Digital World Acquisition Corp., a publicly traded shell company, approved a deal to merge with the Trump’s media business in a Friday vote.",
      "publishedAt": "2024-03-22T04:01:23Z",
      "title": "Trump's social media company approved to go public, potentially netting former president billions",
      "url": "https://apnews.com/841820869418c37ad7eed04f2af42854",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b815da18305c4c83904f8ecebacd7550/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — Russia and China on Friday vetoed a U.S.-sponsored U.N. resolution supporting “an immediate and sustained cease-fire” in the Israel-Hamas war in Gaza, calling the measure ambiguous and saying it was not the direct demand to end the fighting that much of the world seeks.",
      "publishedAt": "2024-03-22T04:54:48Z",
      "title": "Russia and China veto US resolution calling for immediate cease-fire in Gaza",
      "url": "https://apnews.com/f6453803b3eacc9fbaa2ce5a025e2a94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ece5c4ab63643d4b5c34914fb25046f/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and JIM HEINTZ",
      "description": "KYIV, Ukraine (AP) — Russia unleashed one of its most devastating attacks against Ukraine's electric sector on Friday, an aerial assault it said was retaliation for recent strikes inside Russia and which could signal an escalation of the war just days after President Vladimir Putin cemented his grip on power in a preordained election.",
      "publishedAt": "2024-03-22T08:11:57Z",
      "title": "Russia launches sweeping attack on Ukraine's power sector, a sign of possible escalation",
      "url": "https://apnews.com/90218fcbed4fbf196aa8148a4aae6239",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1f3c1148f8b4c4e99c07fe81a5df81d/1990.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Lawmakers introduced a $1.2 trillion spending package Thursday that sets the stage for avoiding a partial government shutdown for several key federal agencies this weekend and allows Congress, nearly six months into the budget year, to complete its work funding the government through September.",
      "publishedAt": "2024-03-21T14:10:33Z",
      "title": "Congress unveils $1.2 trillion plan to avert federal shutdown and bring budget fight to a close",
      "url": "https://apnews.com/3b4e61cf5eaaf0f7fbeeddbacdf57212",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04c6b20b275c46e38dc0531d3378ded7/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Speaker Mike Johnson is at risk of being ousted after hard-right Rep. Marjorie Taylor Greene filed a “motion to vacate” on Friday in the middle of a House vote on a $1.2 trillion package to keep the government open.",
      "publishedAt": "2024-03-22T16:21:04Z",
      "title": "Republican Rep. Marjorie Taylor Greene files motion to oust Speaker Mike Johnson",
      "url": "https://apnews.com/3461bd8b95e718e178132ac16f36562a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea9f7053438b4f8e8b398bdea5e16ef2/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK and MICHAEL BIESECKER",
      "description": "DAKAR, Senegal (AP) — Women slain with babies wrapped against their bodies, lifeless children intertwined together, a 2-month-old face-up on the ground with puppies crawling on his tiny frame. The scenes were horrifying, but the 32-year-old farmer felt he had to document them, as proof of the carnage in his central Burkina Faso village.",
      "publishedAt": "2024-03-22T04:31:52Z",
      "title": "Burkina Faso's security forces are killing more civilians. Survivors detailed 1 village's massacre",
      "url": "https://apnews.com/e775658011de4c0b4352f53326f16da3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e196aa17c2a491180fa1685894f0531/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — April’s total solar eclipse promises to be a scientific bonanza, thanks to new spacecraft and telescopes — and cosmic chance.",
      "publishedAt": "2024-03-22T13:31:34Z",
      "title": "April's total solar eclipse promises to be the best yet for experiments",
      "url": "https://apnews.com/eed670fe3a91576c8397725ccecd522c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62ada0f404b94cd49890fd9820e6110e/3000.jpeg"
    },
    {
      "author": "DEVI SHASTRI",
      "description": "Allergy season is here — and it's earlier and stronger than expected. More than 80 million Americans deal with itchy eyes, runny nose and other symptoms of seasonal allergies, according to the Asthma and Allergy Foundation of America.",
      "publishedAt": "2024-03-22T07:00:39Z",
      "title": "Allergy season arrived early in US. Here's how to keep pollen from ruining your spring",
      "url": "https://apnews.com/4ebaa3a0885988f76ed3d02112eb108e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee197af3880b405fb46f6469f5290802/1920.jpeg"
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — The sun is setting on Stumpy, the gnarled old cherry tree that has become a social media phenom. This year's cherry blossom festivities in Washington will be the last for Stumpy and more than 100 other cherry trees that will be cut down as part of a multiyear restoration of their Tidal Basin home.",
      "publishedAt": "2024-03-22T04:02:32Z",
      "title": "More than 100 iconic cherry trees in Washington are being cut down. So long, Stumpy",
      "url": "https://apnews.com/3de67f20140dafd20dfefcee6e20ba92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55f2e5ece1ae42ba9a339b8fe71dbf54/1920.jpeg"
    },
    {
      "author": "KRYSTA FAURIA",
      "description": "LOS ANGELES (AP) — The bones that embody an album can take many shapes. They may tell a story, follow a genre or soundtrack a film.",
      "publishedAt": "2024-03-22T13:32:34Z",
      "title": "Reverend Kristin Michael Hayter blurs lines between reality, performance and research with 'Saved!'",
      "url": "https://apnews.com/23e2c730bb533b60d9b6534127af2eaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3fb7452680f43f4b2508b3becb76e3a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}