{
  "articles": [
    {
      "author": "RUSS BYNUM, SHARON JOHNSON and BILL BARROW",
      "description": "PLAINS, Ga. (AP) — Johnny Jones found out about Jimmy Carter's death within a matter of minutes. That's how it works in a small town, even for a former U.S.",
      "publishedAt": "2024-12-30T22:03:06Z",
      "title": "Jimmy Carter is being mourned in his tiny hometown and around the world",
      "url": "https://apnews.com/93b2fe6242c20f0d1a78d00fdb13901c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdc3a3bd01aa4d6c883351ec5c4205c9/1920.jpeg"
    },
    {
      "author": "RUSS BYNUM and SAM MEDNICK",
      "description": "JARWENG, South Sudan (AP) — Nobel Prize-winning peacemaker Jimmy Carter spent nearly four decades waging war to eliminate an ancient parasite plaguing the world’s poorest people.",
      "publishedAt": "2024-12-30T17:40:14Z",
      "title": "Jimmy Carter made eradicating Guinea worm disease a top mission",
      "url": "https://apnews.com/16fcaed9fa09b7fbdccfeeba765ed20f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/952a7a98867a489cb628a83e7d9207ec/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Jimmy Carter's memorial journey will end at his house in the tiny town of Plains, Georgia, where he grew up on a peanut farm. That is where his wife, Rosalynn, was laid to rest last year in a burial plot that they chose years ago.",
      "publishedAt": "2024-12-30T12:06:58Z",
      "title": "How American presidents have planned their own funerals",
      "url": "https://apnews.com/6553d955f4ed2495f8c2e92f3777acc0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d85a07d58294d38a17de485abedd1d1/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel’s military said it intercepted a missile fired toward the country by Yemen’s Houthi rebels, setting off sirens late Monday in central areas including Tel Aviv. The Houthis have been firing drones and missiles at Israel, as well as attacking shipping in the Red Sea corridor — attacks they say won’t stop until Israel agrees to a ceasefire in the Gaza Strip.",
      "publishedAt": "2024-12-30T12:58:38Z",
      "title": "Middle East latest: Israel intercepts Houthi missile fired from Yemen",
      "url": "https://apnews.com/8cc78a0958414b8358a6a28716e16483",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73e8bff591f148768815ce945c85523f/3000.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — President Joe Biden said Monday that the United States will send nearly $2.5 billion more in weapons to Ukraine as his administration works quickly to spend all the money it has available to help Kyiv fight off Russia before President-elect Donald Trump takes office.",
      "publishedAt": "2024-12-30T15:28:41Z",
      "title": "Biden announces nearly $2.5 billion more in military aid for Ukraine",
      "url": "https://apnews.com/a34bc2204def6c9f5f17cf2ebfcb6bd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40360d70375d4030ac3bf800001fd806/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean officials said Monday they will conduct safety inspections of all Boeing 737-800 aircraft operated by the country's airlines, as they struggle to determine what caused a plane crash that killed 179 people a day earlier.",
      "publishedAt": "2024-12-30T05:45:14Z",
      "title": "South Korea to inspect Boeing aircraft as it struggles to find cause of plane crash that killed 179",
      "url": "https://apnews.com/37561308a8157f6afe2eb507ac5131d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43d863495779470bb12a2f07f4f54835/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A federal appeals court on Monday upheld a jury’s finding in a civil case that Donald Trump sexually abused a columnist in an upscale department store dressing room in the mid-1990s.",
      "publishedAt": "2024-12-30T15:27:47Z",
      "title": "An appeals court upholds a $5 million award in a sexual abuse verdict against President-elect Trump",
      "url": "https://apnews.com/78e4196024539653a6de492312770ff2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b684314ab364497d8325b9089a5cdfa1/3000.jpeg"
    },
    {
      "author": "CLAIRE GALOFARO and KIM TONG-HYUNG",
      "description": "Her greatest fear, dormant for decades, came rushing back in an instant: had she adopted and raised a kidnapped child? Peg Reif’s daughter, adopted from South Korea in the 1980s, had sent her a link to a documentary detailing how the system that made their family was rife with fraud: documents falsified, babies switched, children snatched off the street and sent abroad.",
      "publishedAt": "2024-12-31T03:01:09Z",
      "title": "South Korean adoptees and families rocked by fraud allegations",
      "url": "https://apnews.com/fa035f2b7b57358f71e0b7cca4c20f85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57c717fa9e8242958a4cda1dcd14f38d/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Angelina Jolie and Brad Pitt have reached a divorce settlement, her lawyer said Monday, bringing an apparent end to one of the longest and most contentious divorces in Hollywood history.",
      "publishedAt": "2024-12-31T04:40:40Z",
      "title": "Angelina Jolie and Brad Pitt reach divorce settlement after 8 years",
      "url": "https://apnews.com/61ed3ce6da2258708ee04795a53aeebd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7b362995e7f4a9f98337904470ef40e/3000.jpeg"
    },
    {
      "author": "MELISSA GOLDIN",
      "description": "NEW YORK (AP) — The crystal-covered ball that descends down a pole in Times Square to ring in the new year was taken for a test run Monday, as New York City officials laid out their plans for the iconic New Year's Eve event.",
      "publishedAt": "2024-12-30T22:31:39Z",
      "title": "Times Square ball takes final test for New Year's Eve",
      "url": "https://apnews.com/ffc39fae74a728a384fdafc4cb3bf0db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59ea7cfe58f74f92937788863fc93dd1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}