{
  "articles": [
    {
      "author": "Aamer Madhani, Steve Karnowski",
      "description": "President Donald Trump is taking a more conciliatory approach with Democratic leaders in Minnesota. This change follows the second fatal shooting there by federal agents this month. The incident has raised doubts about the administration's aggressive deportation tactics — including from some Republicans. On Monday, Trump spoke with Minnesota Gov. Tim Walz, saying they were now on a “similar wavelength.” This marks a sharp U-turn from Trump's previous personal attacks on Walz. It’s not the first time Trump has initially taken a maximalist position only to later retreat. This month, he has backtracked on threats over tariffs and on military action against Iran.",
      "publishedAt": "2026-01-27T01:05:41Z",
      "title": "How Trump changed tack in Minnesota after Pretti's death",
      "url": "https://apnews.com/article/trump-pretti-minnesota-immigration-enforcement-eb9e63a625b624d2ba4ed467cb0f956c",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6c1cb8/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fdc%2Fd45a3a9673b2ef6b136e98ba8aba%2F4578be493a0a4fe3a7ff61341e970dcc"
    },
    {
      "author": "Claudia Lauer",
      "description": "A new Minnesota website lays out evidence to counter what state officials have called federal misinformation after immigration officials fatally shot two residents during the Trump administration's immigration crackdown. Experts say Monday that Minnesota is taking unprecedented steps and that the deepening divide between the state and the U.S. government departs from years of cooperation. The state launched the website Saturday after Alex Pretti was fatally shot. Minnesota went to court to preserve evidence after federal authorities blocked state investigators from the area where Pretti was killed. Immigration authorities also killed a 37-year-old woman earlier this year.",
      "publishedAt": "2026-01-27T01:33:57Z",
      "title": "Minnesota's misinformation website and lawsuit deepens divide with federal officials",
      "url": "https://apnews.com/article/misinformation-immigration-dhs-minnesota-lawsuit-8a7feeca54864980bf936e888e0ca506",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a244ea/2147483647/strip/true/crop/5235x3488+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2Fce%2F086d9971817817446001489bf5b6%2Feac954b1b6fc44efa907e63321ac2e13"
    },
    {
      "author": "Charlotte Kramon, Russ Bynum",
      "description": "A new influx of arctic air is expected to spur freezing temperatures in parts of the South already covered in snow and ice. Many people have fled to warming shelters, and crews worked Tuesday to restore power knocked out by a massive weekend winter storm. At least 30 deaths have been reported in states afflicted with severe cold. The storm dropped over a foot of snow from Arkansas to New England, halting traffic, canceling thousands of flights and triggering wide school closures Monday. The National Weather Service says more widespread record cold temperatures are forecast for Tuesday, with eastern Texas through western Pennsylvania under extreme cold warnings.",
      "publishedAt": "2026-01-27T05:59:57Z",
      "title": "Crews work to restore power as more icy temperatures descend on South",
      "url": "https://apnews.com/article/frigid-temperatures-arctic-air-us-south-tennessee-9d4beb4d548e29d5ce737fd001d67a64",
      "urlToImage": "https://dims.apnews.com/dims4/default/457244d/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2Fd1%2F84e7c01f875e6a46326f9012bff4%2F6e937e40391f47dd83697f4f0c820a8b"
    },
    {
      "author": null,
      "description": "U.S. Immigration and Customs Enforcement agents will have a security role during the upcoming Milan Cortina Winter Games, according to sources at the U.S. embassy in Rome. The sources who confirmed ICE participation on Tuesday said that federal ICE agents would support diplomatic security details and not run any immigration enforcement operations.",
      "publishedAt": "2026-01-27T10:13:08Z",
      "title": "ICE agents will have a security role at Milan-Cortina Olympics, US sources say",
      "url": "https://apnews.com/article/ice-milan-cortina-olympics-immigration-enforcement-us-110fa4b2066e1fb920dba2a71c3a89e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/79d76db/2147483647/strip/true/crop/5536x3689+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F80%2Fd932c05b7cd43b3062167679ced5%2F1c64d602a5a646e4a6e11c0addb3fa4d"
    },
    {
      "author": "Dasha Litvinova",
      "description": "Russian authorities use various strategies to recruit new troops to replenish its supply of soldiers for its nearly 4-year-old full-scale invasion of Ukraine. They are offering financial incentives, freedom for convicts and simplified paths to citizenship paths for foreigners who are willing to sign military contracts to go into battle. This effort aims to avoid a nationwide mobilization of men, which could be unpopular. When a limited mobilization of 300,000 men was tried in 2022, tens of thousands of Russians fled abroad. Recruiting foreigners, including migrants in Russia and those from other countries, appears to be a part of that strategy.",
      "publishedAt": "2026-01-27T05:18:58Z",
      "title": "Russia offers incentives for fighting in Ukraine, but some recruits complain of coercion",
      "url": "https://apnews.com/article/russia-ukraine-war-recruits-foreigners-78285219e6e10be694e8e1e007c5b6e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe8bd08/2147483647/strip/true/crop/5472x3646+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F1e%2Ff481c65ed68676e6a54c23de5b59%2Fa3fdb7a89dd54a43959940abb4562d75"
    },
    {
      "author": "Samya Kullab",
      "description": "An Associated Press investigation found that Bangladeshi workers were lured to Russia by the false promise of civilian jobs and thrust onto the battlefield in the Ukraine war. Many were threatened with violence, imprisonment and death. AP spoke with three Bangladeshi men who escaped from the Russian military and the families of three others who are still missing. They shared harrowing accounts of being coerced into front-line tasks against their will. Those duties included advancing ahead of Russian forces, transporting supplies, evacuating wounded soldiers and recovering the dead. Neither the Russian Defense Ministry nor the Bangladeshi government responded to questions from AP.",
      "publishedAt": "2026-01-27T05:15:59Z",
      "title": "Bangladeshi workers were tricked into fighting in Ukraine war",
      "url": "https://apnews.com/article/russia-ukraine-war-bangladesh-migrant-workers-d7df6a8b2ff60b46ce8e3fa3aafaf60e",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff6ff2d/2147483647/strip/true/crop/8064x5373+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2Fae%2F7bc028217dfaedd946fe547568f7%2F95d63357f7ae41298aaa53fad611ff7e"
    },
    {
      "author": "Seung Min Kim, Hannah Fingerhut",
      "description": "President Donald Trump is heading to Iowa as the White House tries to focus on affordability ahead of the midterm elections despite fallout over the administration's immigration crackdown. While there, Trump will visit a local business and deliver a speech at the Horizon Events Center in Clive. Tuesday's trip also highlights energy policy as part of a plan to have Trump travel weekly before the elections. This visit comes amid the Trump administration's handling of the shooting death of ICU nurse Alex Pretti in Minnesota. Republicans hope Trump's visit will refocus attention on the tax bill, a key part of their campaign strategy.",
      "publishedAt": "2026-01-27T05:24:49Z",
      "title": "Trump to visit Iowa in an effort to focus on affordability",
      "url": "https://apnews.com/article/donald-trump-iowa-affordability-e6dc4aee8ede8e8e906f81f35a10a25b",
      "urlToImage": "https://dims.apnews.com/dims4/default/43dda5a/2147483647/strip/true/crop/4999x3331+0+2085/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F7b%2Ff715a7bfc62e701ef71b33cdde18%2F7ac5b59871944eeda6f637d70a84f730"
    },
    {
      "author": "Bill Barrow, Nicholas Riccardi",
      "description": "Prominent Republicans and gun rights advocates helped elicit a White House turnabout this week after bristling over the administration’s characterization of Alex Pretti as responsible for his own death because he lawfully possessed a weapon. Pretti was the second U.S. citizen and protester killed this month by a federal officer in Minneapolis. His death produced no clear shifts in U.S. gun politics or policies, even as President Donald Trump shuffles the lieutenants in charge of his militarized immigration crackdown. But important voices in Trump’s coalition have been criticizing inconsistencies in some Republicans’ Second Amendment stances since the killing.",
      "publishedAt": "2026-01-27T05:14:45Z",
      "title": "Minnesota killing draws swift rebuke from gun rights advocates",
      "url": "https://apnews.com/article/trump-pretti-minnesota-second-amendment-ice-ffef56cab9930e52273f8227251452f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/81af96e/2147483647/strip/true/crop/5546x3695+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2Fa3%2F2bdfbacf9b3046d8c09ffa5b08d4%2Fbafc7379a56c4bae8a9ad06317defc57"
    },
    {
      "author": "Jon Gambrell",
      "description": "Activists say that at least 6,126 people were killed in Iran’s crackdown on nationwide protests and many more are still feared dead. The new figures Tuesday came from the U.S.-based Human Rights Activists News Agency, which has been accurate in multiple rounds of unrest in Iran. The group verifies each death with a network of activists on the ground in Iran. The Associated Press has been unable to independently assess the death toll given authorities cutting off the internet and disrupting calls into the Islamic Republic. Iran’s government has put the death toll at a far lower 3,117, saying 2,427 were civilians and security forces, and labeled the rest “terrorists.”",
      "publishedAt": "2026-01-27T01:49:11Z",
      "title": "Activists say at least 6,126 people killed in Iran’s crackdown on nationwide protests",
      "url": "https://apnews.com/article/iran-protests-deaths-crackdown-aeaeb26493d25d86d5169f8ae455e405",
      "urlToImage": "https://dims.apnews.com/dims4/default/b992c35/2147483647/strip/true/crop/5807x3869+0+65/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F0b%2F7d934333fbf221fdd59a7deb8834%2F51b4c540c7a24bcf81fddf81199cb1f7"
    },
    {
      "author": "Rajesh Roy",
      "description": "Prime Minister Narendra Modi says India and the European Union have reached a free trade agreement to deepen their economic and strategic ties. The accord was concluded after nearly two decades of negotiations. It was dubbed the “mother of all deals” by both sides. It touches a whopping 2 billion people and is one of the biggest bilateral engagements on commerce. The timing comes as Washington targets both India and the EU with steep import tariffs. Modi says the agreement will bring major opportunities for the people of India and Europe. It represents 25% of global GDP and one-third of global trade.",
      "publishedAt": "2026-01-27T06:00:05Z",
      "title": "India and EU reach a free trade agreement",
      "url": "https://apnews.com/article/india-eu-modi-trade-wine-auto-74b8744b2ef562d2e820b238e6ce8d38",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea71e68/2147483647/strip/true/crop/4257x2837+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2Fdf%2Ff8c193652f93a7e3921d0f266f35%2Fae8ee50bbc354661a06d5d14979cfafa"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}