{
  "articles": [
    {
      "author": null,
      "description": "House Republicans are sprinting toward a vote on President Donald Trump’s tax and spending cuts package. The Republicans are looking to seize momentum from a hard-fought vote in the Senate, essentially daring members with concerns to defy Trump and vote against it. The bill will extend and make permanent various individual and business tax breaks Republicans passed in Trump’s first term, plus temporarily add new tax breaks, such as no income taxes on tips and overtime. The House already passed one version of the bill in May with just one vote to spare. It's unclear if House Republicans will be able to do the same with the Senate-amended version Wednesday.",
      "publishedAt": "2025-07-02T04:02:41Z",
      "title": "House Republicans are racing toward a final vote on Trump's tax bill",
      "url": "https://apnews.com/article/big-beautiful-bill-trump-tax-cuts-3b525482be43fdf956366cebd84dcaac",
      "urlToImage": "https://dims.apnews.com/dims4/default/95cafe8/2147483647/strip/true/crop/4970x2796+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F9f%2Ff66227677ca9ea1cd4c75f05c760%2F5651e88edafe4454b7baa1204d0d9034"
    },
    {
      "author": null,
      "description": "President Donald Trump keeps saying that Republicans’ mega tax and spending cut legislation will eliminate taxes on federal Social Security benefits. It does not. Instead of eliminating the tax, the Senate and House have each passed their own versions of a temporary tax deduction for seniors aged 65 and over, which applies to all income — not just Social Security. And it turns out not all Social Security beneficiaries will be able to claim the deduction. Those who won’t be able to do so include the lowest-income seniors who already don’t pay taxes on Social Security, those who choose to claim their benefits before they reach age 65 and those above a defined income threshold.",
      "publishedAt": "2025-07-02T04:05:31Z",
      "title": "How Trump's big bill would affect Social Security taxes",
      "url": "https://apnews.com/article/trump-congress-big-bill-tax-social-security-adea287e00c7c553f69f3667d3ef78cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/61fb073/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2Ff3%2F49d0fa15dbadb51c2353c5207f4d%2Fa28235468e2041a5b5bd9bf8df5f87d1"
    },
    {
      "author": null,
      "description": "Hamas has signaled openness to a ceasefire with Israel but insists any deal must end the war in Gaza. U.S. President Donald Trump on Tuesday announced Israel's agreement to a 60-day ceasefire plan. Trump urged Hamas to accept it before conditions worsen. A Hamas official on Wednesday stopped short of accepting the proposal announced by Trump. Israel hasn't publicly commented but maintains it will only end the war if Hamas surrenders and disarms. But Hamas refuses to do so. Israeli Prime Minister Benjamin Netanyahu is set to travel to the White House next week to discuss Gaza and other matters.",
      "publishedAt": "2025-07-02T08:02:57Z",
      "title": "Hamas signals its open to a ceasefire deal with Israel",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-07-02-2025-111a1cf968318cb0fb6d9865a3ac84dc",
      "urlToImage": "https://dims.apnews.com/dims4/default/f2beeeb/2147483647/strip/true/crop/7695x4328+0+401/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F01%2F7fa5cae03fa89f83e65bab7a1a1f%2Fa9b921e1edf4446eb0bcd86debd6034a"
    },
    {
      "author": null,
      "description": "More than two years after the stabbing deaths of four University of Idaho students shocked the rural community of Moscow, Idaho, the former criminal justice doctoral student charged in the murders is expected in court Wednesday to plead guilty in a deal to avoid the death penalty. Brian Kohberger agreed to the plea deal in the past few days, just weeks before his trial was to begin, after his attorneys tried but failed to have execution stricken as a possible punishment. The deal drew mixed reactions from the victims' families, ranging from support to outrage that Kohberger would live.",
      "publishedAt": "2025-07-02T04:05:59Z",
      "title": "Bryan Kohberger is due to appear in court to plead guilty in University of Idaho stabbings",
      "url": "https://apnews.com/article/kohberger-idaho-students-slain-6626d7c53a08563cfa9df5123f41bd87",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7feec4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F24%2Fbc0f88655b584fce0e2b246f8080%2F242b342dd39d4aca86f39763dca3c3cd"
    },
    {
      "author": null,
      "description": "Paramount says it has agreed to pay $16 million to settle a lawsuit filed by President Donald Trump over the editing of CBS’ “60 Minutes” interview with then-Vice President Kamala Harris in October. The parent company of CBS told media outlets that the money will go to Trump's future presidential library, not to the president himself. It said the settlement did not involve an apology. Trump's lawyer said the president had suffered “mental anguish” over the editing of the interview by CBS News. Paramount and CBS have rejected Trump's contention that the interview was edited to enhance how Harris sounded. A press advocacy group has threatened to sue if Paramount settled the case.",
      "publishedAt": "2025-07-02T07:38:53Z",
      "title": "Paramount settles with Trump for $16 million over ‘60 Minutes’ interview",
      "url": "https://apnews.com/article/trump-media-harris-minutes-paramount-6415042fe910ae60b432dd8c73ef61b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c55c90/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2Fd5%2Fc4c7e26373e8c4ac9e14e3f34fa8%2F8aaa4bcab7394249af6df681ad86857d"
    },
    {
      "author": null,
      "description": "Tibetan spiritual leader the Dalai Lama has said the centuries-old Tibetan Buddhist institution will continue after his death, ending speculation ignited by his remark that he might be the last person to hold the role. Speaking at prayer celebrations ahead of his 90th birthday on Sunday, the spiritual head of Tibetan Buddhism said in a recorded statement the next Dalai Lama should be found and recognized following Buddhist traditions. Tibetan Buddhists believe the Dalai Lama can choose the body into which he is reincarnated. His succession plan is politically consequential for Tibetans who oppose China's tight control of the territory. China has repeatedly said that it alone has the authority to approve the next spiritual leader of Tibetan Buddhism.",
      "publishedAt": "2025-07-02T04:38:12Z",
      "title": "Dalai Lama says Tibetan Buddhist institution will continue after his death",
      "url": "https://apnews.com/article/india-dalai-lama-reincarnate-tibetan-buddhism-734d8d5d62f9cd29a35fc358abee0aa3",
      "urlToImage": "https://dims.apnews.com/dims4/default/4500fb0/2147483647/strip/true/crop/5950x3347+0+310/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F56%2F5a909813b5ee54e747937627688c%2Ff393956b86664748bc54e0c2bb33e245"
    },
    {
      "author": null,
      "description": "Spanish authorities say two people have died in northeastern Spain in a wildfire that spread quickly before firefighters brought it under control. Catalan regional president Salvador Illa announced the deaths in a social media post around midnight on Tuesday. The fire came amid a European heat wave that's sending thermometers soaring again on Wednesday. A total of 6,500 hectares or 16,000 acres was burned before firefighters established a perimeter and declared the blaze under control. About 14,000 people were ordered to stay indoors. That order was lifted late Tuesday.",
      "publishedAt": "2025-07-02T08:15:22Z",
      "title": "2 killed in Spain wildfire as Europe bakes in heat wave",
      "url": "https://apnews.com/article/wildfire-heat-wave-spain-europe-bee31bb95122fdf09dbea73d882a0330",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "An emboldened Russia has ramped up military offensives on two fronts in Ukraine. That is scattering Kyiv’s precious reserve troops and threatening to expand the fighting to a new Ukrainian region as each side seeks an advantage before the fighting season wanes in the autumn. Analysts and military commanders say Moscow aims to maximize its territorial gains before seriously considering a full ceasefire. Ukraine wants to slow the Russian advance for as long as possible and extract heavy losses. Kremlin forces are steadily gaining ground in the eastern logistics hub of Pokrovsk. Its capture would hand them a major battlefield victory. The fighting there has also brought combat to the border of the neighboring Dnipropetrovsk region.",
      "publishedAt": "2025-07-02T06:13:13Z",
      "title": "Russia ramps up offensives on 2 fronts in Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-offensives-ceasefire-c03921de21027d13117cb668c9a1a959",
      "urlToImage": "https://dims.apnews.com/dims4/default/0bb2620/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F92%2F09e815b4643e6e0f49ecc9886981%2F9b664a74aa154cdca4a5dabcdec33f1f"
    },
    {
      "author": null,
      "description": "An analysis finds a critical group of U.S. employers would face a direct cost of $82.3 billion from President Donald Trump’s current tariff plans. That could be managed through price hikes, layoffs, hiring freezes or lower profit margins. The JPMorganChase Institute analysis is among the first to measure the direct costs created by the import taxes on businesses with $10 million to $1 billion in annual revenue. This category includes a third of private-sector U.S. workers. These companies are more dependent than other businesses on imports from China, India and Thailand. The retail and wholesale sectors would be especially vulnerable to the Republican president's import taxes. Trump claims foreign manufacturers will absorb the costs.",
      "publishedAt": "2025-07-02T10:26:21Z",
      "title": "Analysis shows Trump's tariffs would cost US employers $82.3B",
      "url": "https://apnews.com/article/trump-tariffs-analysis-employers-consumers-prices-6fef729ff39ce24fcd46bbb60134b032",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a0d813/2147483647/strip/true/crop/5787x3255+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F12%2Fd7b1e7772bcde37723578f167dce%2Ffa675f6690ac443cbf0f5a8a18806b84"
    },
    {
      "author": null,
      "description": "The jury in Sean “Diddy” Combs’ sex trafficking trial is set to resume deliberations. The jury reached a verdict Tuesday on all but one of the five counts the hip-hop mogul faces. Judge Arun Subramanian ordered the jury to continue deliberating for a third day on Wednesday. The jury said Tuesday it was unable to reach consensus on the top charge of racketeering conspiracy. It indicated it had already decided about other charges, including sex trafficking. Subramanian, prosecutors and Combs’ defense team said less than 13 hours of deliberations was too soon to give up on reaching a verdict on all counts. The jury's partial verdict remains under wraps for now.",
      "publishedAt": "2025-07-02T05:05:27Z",
      "title": "Jury in Diddy's sex trafficking trial to resume deliberations after reaching partial verdict",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-jury-deliberations-a9358ff8917e96874f027872e07cd9a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d03410e/2147483647/strip/true/crop/4905x2759+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F80%2F09a6b0c1f96f0fd7919de74d9b2f%2Feac8d5a12d124ca885a751f871fa203c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}