{
  "articles": [
    {
      "author": "CHARLOTTE GRAHAM-McLAY and ELAINE KURTENBACH",
      "description": "WELLINGTON, New Zealand (AP) — A global technology outage grounded flights, knocked banks and hospital systems offline and media outlets off air on Friday in a massive disruption that affected companies and services around the world and highlighted dependence on software from a handful of providers.",
      "publishedAt": "2024-07-19T07:34:44Z",
      "title": "Widespread technology outage disrupts flights, banks, media outlets and companies around the world",
      "url": "https://apnews.com/0a5f792b6571b37a35181d64028fefc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/571181923c514488ba8137e4e1c9dce7/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A major internet outage affecting Microsoft is disrupting flights, banks, media outlets and companies across the world, with problems continuing hours after the technology company said it was gradually fixing an issue affecting access to Microsoft 365 apps and services.",
      "publishedAt": "2024-07-19T09:57:15Z",
      "title": "Internet outage latest | Airlines, businesses hit by global technology disruption",
      "url": "https://apnews.com/f9002b97124a718a392997987d34c51d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b953006b354403bb8cec94860bec446/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON, JAKE OFFENHARTZ and RIO YAMAT",
      "description": "MILWAUKEE (AP) — For those conservative voters long turned off by former President Donald Trump's rhetoric, his somewhat softened tone in accepting the Republican nomination Thursday night was a welcome relief.",
      "publishedAt": "2024-07-19T04:53:19Z",
      "title": "Some GOP voters welcome Trump's somewhat softened tone at Republican National Convention",
      "url": "https://apnews.com/96d45401f46c61c7b33904dcd306a8d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/060c93efc08a42a9bd229b6fbcb409e2/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, ZEKE MILLER, MICHAEL BALSAMO and AAMER MADHANI",
      "description": "WASHINGTON (AP) — Critical days ahead, President Joe Biden is facing the stark reality that many Democrats at the highest levels want him to consider how stepping aside from the 2024 election to make way for a new nominee atop the ticket could be the party's best chance of preventing widespread losses in November.",
      "publishedAt": "2024-07-19T05:43:43Z",
      "title": "Biden's campaign faces critical moment, as Democrats encourage him to consider exiting 2024 race",
      "url": "https://apnews.com/329071c25dfaaae583b5f06184586267",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c880b739b9d48b69c81cfebc5a2c3ed/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES, JONATHAN J. COOPER and JILL COLVIN",
      "description": "MILWAUKEE (AP) — Donald Trump, somber and bandaged, accepted the GOP presidential nomination on Thursday at the Republican National Convention in a speech that described in detail the assassination attempt that could have ended his life just five days earlier before laying out a sweeping populist agenda, particularly on immigration.",
      "publishedAt": "2024-07-18T11:03:25Z",
      "title": "Trump urges unity after assassination attempt while proposing sweeping populist agenda in RNC finale",
      "url": "https://apnews.com/5f1f337ac39477e9d1c53d3e027edda3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50babdb13434450884d1e7dd47444251/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAM METZ",
      "description": "TEL AVIV, Israel (AP) — An Iranian-made drone sent by Yemen's Houthi rebels struck Tel Aviv on Friday, leaving one person dead and at least 10 wounded in the group's first lethal strike into Israel.",
      "publishedAt": "2024-07-19T03:59:40Z",
      "title": "Drone strike by Yemen's Houthi rebels kills 1 person and wounds at least 10 in Tel Aviv",
      "url": "https://apnews.com/daa70aa0f6a3248a00997a281c3731ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80fdbe20442a47c892042ce727a9a486/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, WILL WEISSERT and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Former President Barack Obama has a delicate balance to strike: how to weigh the mounting opposition to President Joe Biden continuing his campaign with his loyalty to his former running mate.",
      "publishedAt": "2024-07-19T04:28:12Z",
      "title": "Obama's dilemma: Balancing Democrats' worry about Biden and maintaining influence with president",
      "url": "https://apnews.com/b117058c1950bba9a7cc51317d055959",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb94ca3d9d054d6ba77669c3a8c0a550/3000.jpeg"
    },
    {
      "author": "KIRILL ZARUBIN",
      "description": "YEKATERINBURG, Russia (AP) — Russian prosecutors on Friday sought a prison sentence of 18 years for Wall Street Journal reporter Evan Gershkovich as his espionage trial came to an unusually swift conclusion, perhaps clearing the way for a swap between Moscow and Washington.",
      "publishedAt": "2024-07-19T05:58:11Z",
      "title": "Russia seeks an 18-year sentence for US reporter as his espionage trial concludes",
      "url": "https://apnews.com/ef2e9fffc44570cf797e97aa6afa50a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22b3434a32ad4e5d97a4dfb0fa02d96f/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — As President Joe Biden faces a growing drumbeat of pressure to drop his reelection bid, a majority of Democrats think his vice president would make a good president herself.",
      "publishedAt": "2024-07-19T04:25:09Z",
      "title": "Majority of Democrats think Kamala Harris would make a good president, AP-NORC poll shows",
      "url": "https://apnews.com/7ef83e5c8e510e39d7c54f7e28310064",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0311ac37d1d34b768280133596a4b6f5/3000.jpeg"
    },
    {
      "author": null,
      "description": "HANOI, Vietnam (AP) — Nguyen Phu Trong, general secretary of Vietnam’s ruling Communist Party and the country’s most powerful politician, has died following months of ill health, official media said Friday.",
      "publishedAt": "2024-07-19T11:18:00Z",
      "title": "Vietnam Communist Party chief Nguyen Phu Trong, the country's most powerful leader, dies at age 80",
      "url": "https://apnews.com/d0d858c015dd23af615cdfedc78b9a8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00b697bf861149ea99e35719bf3deffc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}