{
  "articles": [
    {
      "author": "JULIA FRANKEL, PAUL HAVEN and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — Israel's defense minister said it will take months to destroy Hamas, predicting a drawn-out war even as his country and its top ally, the United States, face increasing international isolation and alarm over the devastation from the campaign in Gaza.",
      "publishedAt": "2023-12-14T08:19:51Z",
      "title": "Israeli defense minister says war on Hamas will last months as US envoy discusses timetable",
      "url": "https://apnews.com/a9d904ed51ea5cfa98966c8f203cbc45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec2b45055f4941e9b6e0b12d77b33c83/1920.jpeg"
    },
    {
      "author": "RAF CASERT and SAMUEL PETREQUIN",
      "description": "BRUSSELS (AP) — The European Union failed to agree on a 50 billion-euro ($54 billion) package in financial aid that Ukraine desperately needs to stay afloat, even as the bloc decided Thursday to open accession negotiations with the war-torn country.",
      "publishedAt": "2023-12-14T08:00:37Z",
      "title": "Ukraine gets EU membership boost, but no new European aid, after setback in US",
      "url": "https://apnews.com/6a3a5828483121f19193f76b373ca692",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e38357f945d7438c9257a202eaf10988/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Donald Trump's 2020 election interference case in Washington once appeared likely to be the first of the former president's criminal trials to begin, with the judge having scheduled a March 4 start date.",
      "publishedAt": "2023-12-14T16:30:59Z",
      "title": "Trump's first criminal trial is scheduled to begin in March but legal appeals threaten that date",
      "url": "https://apnews.com/83981412e8dc844e58390155aadc5cc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ebb0d04064e43649fe9fe273f8b6d50/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House passed a defense policy bill Thursday that authorizes the biggest pay raise for troops in more than two decades, overcoming objections from some conservatives concerned the measure did not do enough to restrict the Pentagon's diversity initiatives, abortion travel policy and gender-affirming health care for transgender service members.",
      "publishedAt": "2023-12-14T18:21:11Z",
      "title": "Big pay raise for troops in defense bill sent to Biden. Conservatives stymied on cultural issues",
      "url": "https://apnews.com/7e91060fff447f2a79b602e312f1c2cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89abdf499e6a40d684e994feb8a522bf/3000.jpeg"
    },
    {
      "author": "ANGELA CHARLTON",
      "description": "BRUSSELS (AP) — Ukraine got a green light Thursday to start sped-up talks on joining the European Union.",
      "publishedAt": "2023-12-14T21:01:23Z",
      "title": "Ukraine’s a step closer to joining the EU. Here’s what it means, and why it matters",
      "url": "https://apnews.com/45b7f723761f5e5fa7a49d7302033469",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4126d7b4092e403986261fedb05469e0/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Jurors began deliberating Thursday to decide how much Rudy Giuliani must pay two former Georgia election workers for spreading lies about them that led to a barrage of racist threats and upended their lives.",
      "publishedAt": "2023-12-14T17:17:13Z",
      "title": "Jurors deciding how much Giuliani must pay for lies in a Georgia election workers' case",
      "url": "https://apnews.com/069f1b5ce3c743ef8c0891dde0b660b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc74fe339b994fc7b286ae0d9a6883d1/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — Hundreds of thousands of older Americans could pay less for some of their outpatient drug treatments beginning early next year, the Biden administration announced Thursday.",
      "publishedAt": "2023-12-14T17:30:48Z",
      "title": "Older Americans to pay less for some drug treatments as drugmakers penalized for big price jumps",
      "url": "https://apnews.com/efc99d020d53c48449c4725ae943c4df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffe40a7c8e5d440590ef48d800778c1b/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military has rounded up hundreds of Palestinians across the northern Gaza Strip, separating families and forcing men to strip to their underwear before trucking some to a detention camp on the beach, where they spent hours, in some cases days, subjected to hunger and cold, according to human rights activists, distraught relatives and released detainees themselves.",
      "publishedAt": "2023-12-14T18:14:48Z",
      "title": "Hungry, thirsty and humiliated: Israel's mass arrest campaign sows fear in northern Gaza",
      "url": "https://apnews.com/0ecbc338e4024add059b87b38022086d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/465198a973014859b6afee8ace2c01ff/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "ALBANY, N.Y. (AP) — Republicans have picked a little-known county lawmaker who once served in the Israeli military as their candidate in a special election to replace ousted New York congressman George Santos, party officials said Thursday.",
      "publishedAt": "2023-12-14T19:18:02Z",
      "title": "Israeli military veteran tapped as GOP candidate in special election to replace George Santos",
      "url": "https://apnews.com/5552a4542b5a460a5105e7e2a3a629ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f0753627e2c49ffba913bab349ff7e2/3000.jpeg"
    },
    {
      "author": "BETH HARRIS",
      "description": "LOS ANGELES (AP) — Shohei Ohtani opened his first news conference with the Los Angeles Dodgers by dodging questions about whether he had a second Tommy John surgery.“At the time of the announcement, we didn't know which way we were going to go.",
      "publishedAt": "2023-12-14T14:41:08Z",
      "title": "In first news conference with Dodgers, Shohei Ohtani dodges questions on Tommy John surgery",
      "url": "https://apnews.com/6cc91eb10170fcda38b4db7da0bee4fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5a28d18ff7b46928e2bece48fa976cb/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}