{
  "articles": [
    {
      "author": "RUSS BYNUM and VALERIE GONZALEZ",
      "description": "JACKSONVILLE, Fla. (AP) — A campus security officer tipped off by observant students likely stopped the killer who fatally shot three people at a nearby Dollar General Store from carrying out his racist attack at Edward Waters University, the president of the historically Black institution said Monday.",
      "publishedAt": "2023-08-28T23:23:57Z",
      "title": "HBCU president lauds students, officer for stopping Jacksonville killer before racist store attack",
      "url": "https://apnews.com/4a4050c4f607c204be6fe0973954f0a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f51f585a379f42bd84b8628e5befb4b5/3000.jpeg"
    },
    {
      "author": "LAURA BARGFELD",
      "description": "TAMPA, Fla. (AP) — Florida residents loaded up on sandbags and evacuated from homes in low-lying areas along the Gulf Coast as Tropical Storm Idalia intensified Monday and forecasters predicted it would hit in days as a major hurricane with potentially life-threatening storm surges.",
      "publishedAt": "2023-08-29T04:04:24Z",
      "title": "As Idalia churns toward Florida, residents urged to wrap up storm preparations",
      "url": "https://apnews.com/c5da324eb214b779e51b145cd2c96837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/796680a31a974a398586d62466655230/3000.jpeg"
    },
    {
      "author": "JEFF MARTIN",
      "description": "Floridians pray that when Idalia hits the Gulf Coast it won't join the long list of destructive Atlantic Ocean storms whose names started with “I.”",
      "publishedAt": "2023-08-28T19:58:02Z",
      "title": "Florida prays Idalia won't join long list of destructive storms with names starting with 'I'",
      "url": "https://apnews.com/4576d3b4b479df90a1ae3cbf37c7f728",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51f28067bc144de3ab56a6233cdab93b/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — With more than a year to go before the 2024 election, a constellation of conservative organizations is preparing for a possible second White House term for Donald Trump, recruiting thousands of Americans to come to Washington on a mission to dismantle the federal government and replace it with a vision closer to his own.",
      "publishedAt": "2023-08-29T04:03:17Z",
      "title": "Recruiting is underway for Trump-like 'wrecking ball' to shrink government and fire federal workers",
      "url": "https://apnews.com/857eb794e505f1c6710eb03fd5b58981",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5baff1262abe411ab6dad279c2d8f8ec/3000.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM, GARY D. ROBERTSON and SARAH RANKIN",
      "description": "CHAPEL HILL, N.C. (AP) — A shooter killed a faculty member in a science building at the University of North Carolina at Chapel Hill on Monday, police said after a lockdown that paralyzed the campus community as authorities searched for the suspect.",
      "publishedAt": "2023-08-28T17:56:03Z",
      "title": "Faculty member fatally shot in University of North Carolina building",
      "url": "https://apnews.com/9a264145d183eeb7c28bb7d6a467ab39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32c2611dbf1947a8b5efe98b4ac0669a/3000.jpeg"
    },
    {
      "author": "SONIA PÉREZ D. and MEGAN JANETSKY",
      "description": "GUATEMALA CITY (AP) — Guatemala’s Supreme Electoral Tribunal on Monday declared progressive Bernardo Arévalo the winner of the country’s presidential election, shortly after another government body suspended his Seed Movement party.",
      "publishedAt": "2023-08-28T23:43:49Z",
      "title": "Guatemala progressive's presidential victory certified, but his party is suspended from operating",
      "url": "https://apnews.com/0b8d5eb5dbc81fcb6a413f8212739b68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6811bf73653e4a00adecbab5277c7b79/3000.jpeg"
    },
    {
      "author": "GRAHAM DUNBAR",
      "description": "GENEVA (AP) — Leading officials within the Spanish Football Federation asked suspended president Luis Rubiales to resign on Monday because of his behavior at the Women's World Cup, including kissing a player on the lips after Spain won the championship match.",
      "publishedAt": "2023-08-28T16:13:27Z",
      "title": "Spanish soccer federation leaders ask president Rubiales to resign over his kiss of player",
      "url": "https://apnews.com/6f49d224638baac4c37c0e4cddf36ae6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bca965bdaa94b90b5f30d09c7b6c5df/3000.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI and JONATHAN MATTISE",
      "description": "NASHVILLE, Tenn. (AP) — Republican lawmakers voted Monday to temporarily silence a Democratic member of the so-called Tennessee Three during an already tense House floor session after determining the young Black member violated newly enacted rules designed to punish disruptive members.",
      "publishedAt": "2023-08-28T22:58:31Z",
      "title": "GOP silences 'Tennessee Three' Democrat on House floor for day on 'out of order' rule; crowd erupts",
      "url": "https://apnews.com/f0af470eb6f377633735c5a1dcefa66f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25eac41a4b9e4f5f8be0ec9ae7842859/3000.jpeg"
    },
    {
      "author": "JENNIFER McDERMOTT and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — Hawaii’s electric utility acknowledged its power lines started a wildfire on Maui but faulted county firefighters for declaring the blaze contained and leaving the scene, only to have a second wildfire break out nearby and become the deadliest in the U.S.",
      "publishedAt": "2023-08-28T16:17:55Z",
      "title": "Hawaii power utility takes responsibility for first fire on Maui, but faults county firefighters",
      "url": "https://apnews.com/1741e22bbf955b62103db6b60f5c4853",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73c3e56e1ab549d3a3f34c666769eb67/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — All 28 vehicle assembly lines at Toyota’s 14 auto plants in Japan shut down Tuesday over a problem in its computer system that deals with incoming auto parts.The automaker doesn’t believe the problem was caused by a cyberattack but the cause is still under investigation, said spokeswoman Sawako Takeda.",
      "publishedAt": "2023-08-29T03:06:10Z",
      "title": "All assembly lines at Toyota's auto plants in Japan have been shut down by computer problems",
      "url": "https://apnews.com/530a3230d358a39c75218801a602d8db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbb84ec76f38418887f5390fc1a0a57f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}