{
  "articles": [
    {
      "author": "Illia Novikov",
      "description": "Officials say a Russian drone has struck an apartment building in a southeastern Ukraine city, killing three people and injuring 10 others. The attack early Friday came a day after U.S. President Donald Trump rebuked Russia’s leader for a deadly missile and drone attack on Kyiv while Washington endeavors to stop the more than three-year war. Russia pounded Kyiv in an hourslong barrage Thursday, killing at least 12 people and injuring 87 in its deadliest assault on the Ukrainian capital since July. Trump envoy Steve Witkoff is expected to meet with President Vladimir Putin in Moscow on Friday for the second time this month.",
      "publishedAt": "2025-04-25T08:23:52Z",
      "title": "Ukraine says Russia kills 3 in another drone attack after Trump rebukes Putin",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-putin-33015fe967ab7cd09fee165fed59953e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e3ece30/2147483647/strip/true/crop/7377x4150+0+384/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F64%2Fa0fd2b356466dafc87092d1f5c11%2F2d3514f6bd7b4439a769dba42f82e7c9"
    },
    {
      "author": "Colleen Barry",
      "description": "Heads of state and royalty will begin converging on Rome for Pope Francis’ funeral in the Vatican’s St. Peter’s Square, but the group of poor people who will meet his casket in a small crosstown basilica are more in keeping with Francis’ humble persona and disdain for pomp. U.S. President Donald Trump and Argentine President Javier Milei are among the leaders arriving Friday. That is the last day Argentine pope will lie in state in St. Peter’s Basilica before his coffin is sealed in preparation for his funeral Saturday. More than 90,000 mourners have waited hours in line to bid farewell to Francis, who died Monday.",
      "publishedAt": "2025-04-25T04:07:48Z",
      "title": "Trump and Zelenskyy among dignitaries converging on Rome for funeral of Pope Francis",
      "url": "https://apnews.com/article/italy-vatican-pope-funeral-dignitaries-b8c206d03e3535b8ee3b18d42667b803",
      "urlToImage": "https://dims.apnews.com/dims4/default/2fba9c1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F91%2F18f17c1a0ac4cf08c7b08cca5c7d%2F12068fd3696c4425b9410471616641b3"
    },
    {
      "author": "Philip Marcelo",
      "description": "Disgraced former U.S. Rep. George Santos is facing sentencing in federal court this week. The New York Republican pleaded guilty last summer to federal wire fraud and aggravated identity theft. Santos admitted he deceived donors and stole the identities of nearly a dozen people to fund his congressional campaign. He served less than a year in Congress before being expelled in 2023 after his lies and fraud were uncovered. Prosecutors are seeking seven years in federal prison, but Santos has argued the proposed sentence is overly harsh. His lawyers have called for two years behind bars.",
      "publishedAt": "2025-04-25T04:01:47Z",
      "title": "George Santos faces sentencing for fraud and identity theft",
      "url": "https://apnews.com/article/george-santos-fraud-sentencing-prison-0961831af8870686853acb22d049c85e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2ca62ba/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2F9d%2F191ccdab54d99549fa906fe5392b%2F9a3e8c7af08445af91642194256a3d74"
    },
    {
      "author": "Aijaz Hussain, Rajesh Roy",
      "description": "Indian officials said the army had a brief exchange of fire with Pakistani soldiers along their highly militarized frontier in the Himalayan region of Kashmir, as the nuclear-armed rivals ramped up tit-for-tat diplomatic offensive following a deadly attack on tourists in the disputed area. The report of a gunfight comes amid soaring tensions between New Delhi and Islamabad after gunmen killed 26 people near the resort town of Pahalgam in Kashmir on Tuesday. India immediately described the massacre a “terror attack” and said it had “cross border” links, blaming Pakistan for backing it. Pakistan denied any connection to the attack, which was claimed by a previously unknown militant group calling itself the Kashmir Resistance.",
      "publishedAt": "2025-04-25T06:21:50Z",
      "title": "Indian troops exchanged fire with Pakistani soldiers in disputed Kashmir, officials say",
      "url": "https://apnews.com/article/kashmir-india-pakistan-pahalgam-tourist-attack-tensions-94de38a3c24137dcc25e77dffc4cc5f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6a6ab6/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F78%2F55fbd2dc70d370e6f5f9eff1bfc9%2Fdbb83cc5180c43c6ad61eb92ea0b4391"
    },
    {
      "author": null,
      "description": "FBI Director Kash Patel says a Wisconsin county judge accused of helping a man avoid immigration enforcement has been arrested. Patel made the announcement Friday in a post on X and says his office believes Judge Hannah Dugan “intentionally misdirected federal agents away from the subject to be arrested in her courthouse.” Patel identified the subject as Eduardo Flores Ruiz and said Dugan’s actions allowed Ruiz to evade arrest.",
      "publishedAt": "2025-04-25T14:52:41Z",
      "title": "FBI director says judge accused of helping someone evade immigration agents has been arrested",
      "url": "https://apnews.com/article/immigration-judge-arrested-7997186bbca5730e70a25f2347e631f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c07484/2147483647/strip/true/crop/7200x4050+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F51%2Ff3c3199c773a19a48e393ff194ce%2Fb22018a336ec425e886a1e8bc16df6ca"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump can’t stop contradicting himself on his own tariff plans. Trump says he’s on a path to cut several new trade deals in a few weeks — but also suggests it’s “physically impossible” to hold all the needed meetings. The Republican president has said he'll simply set new tariff rates negotiated internally within the U.S. government over the next few weeks — although he already did that April 2, causing the world economy to shudder. The sure bet is uncertainty will persist in ways that employers and consumers alike expect to damage the economy and that leave foreign leaders scratching their heads in bewilderment.",
      "publishedAt": "2025-04-25T17:47:09Z",
      "title": "Trump keeps contradicting himself on tariffs, unnerving world economy",
      "url": "https://apnews.com/article/trump-tariffs-time-china-switzerland-660aa519e9059de7d81368ec4eef4b38",
      "urlToImage": "https://dims.apnews.com/dims4/default/d64f0b0/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F06%2F49%2F050cd37d85631f478960b5600316%2F09a4dc1c6dcc47f5ba01d843182369e1"
    },
    {
      "author": "Jill Colvin",
      "description": "Since returning to the White House, President Donald Trump has launched an unprecedented campaign of immigration enforcement that has pushed the limits of executive power and clashed with federal judges trying to restrain him. But unlike in his first term, Trump’s efforts have not sparked the kind of widespread condemnation that forced him to retreat from some unpopular positions. Immigration has emerged as one of the Republican president's strongest issues in public polling. The White House has seized on this shift, mocking critics and egging on Democrats to engage on an issue Trump’s team sees as a win.",
      "publishedAt": "2025-04-25T11:13:57Z",
      "title": "How public's shift on immigration paved way for Trump's crackdown",
      "url": "https://apnews.com/article/trump-immigration-enforcement-deportation-public-polling-df7d0d35dfa031e1444bfa9e9e0b13bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/d64d6b1/2147483647/strip/true/crop/5452x3067+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F43%2F040818f2d502efb25285634e89a4%2F72589501ea084bcead751729055f9421"
    },
    {
      "author": "Janie Har, Kate Brumback",
      "description": "A government lawyer said the federal government is reversing the termination of legal status for international students after many filed court challenges around the U.S. Judges around the country had already issued temporary orders restoring the students’ records in a federal database of international students maintained by Immigration and Customs Enforcement, or ICE. The records had been suddenly terminated in recent weeks, often without the students or their schools being notified. A lawyer for the government read a statement in federal court in Oakland that said ICE was manually restoring the student status for people whose records were terminated in recent weeks.",
      "publishedAt": "2025-04-25T16:44:14Z",
      "title": "Government lawyer: ICE is reversing termination of legal status for international students around US",
      "url": "https://apnews.com/article/international-student-status-restored-9e8a7cb90f4193ec52bf06edc5094cd9",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The World Food Program says its food stocks in Gaza have run out under Israel’s nearly 8-week-old blockade, ending a main source of sustenance for hundreds of thousands of Palestinians in the territory. The WFP said in a statement that it delivered the last of its stocks to charity kitchens that it supports around Gaza. It said those kitchens are expected to run out of food in the coming days. Some 80% of Gaza’s population of more than 2 million relies primarily on charity kitchens for food, because other sources have shut down under Israel’s blockade, according to the U.N.",
      "publishedAt": "2025-04-25T14:13:35Z",
      "title": "UN food agency says its foods stocks in Gaza have run out under Israel's blockade",
      "url": "https://apnews.com/article/israel-palestinians-gaza-blockade-food-e492a5ba3197b15b1599747e3cde12b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7a0d11/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7f%2F20%2F4b378eacba2c59b2ec66bf6824cc%2F85db4a9caeed4097973ea1d087b9bded"
    },
    {
      "author": "Michael R. Sisak",
      "description": "Luigi Mangione has pleaded not guilty to a federal murder charge in the killing of UnitedHealthcare CEO Brian Thompson, as prosecutors formally declared their intent to seek the death penalty against him. Mangione, 26, stood with his lawyers as he entered the plea Friday, leaning forward toward a microphone as he addressed U.S. District Judge Margaret Garnett. Asked how he wished to plead, Mangione said simply, “not guilty.” Mangione’s arraignment attracted several dozen people to the federal courthouse in Manhattan, including former Army intelligence analyst Chelsea Manning, who served about seven years in prison for stealing classified diplomatic cables.",
      "publishedAt": "2025-04-25T17:29:36Z",
      "title": "Luigi Mangione pleads not guilty to federal murder charge in killing of UnitedHealthcare’s CEO",
      "url": "https://apnews.com/article/unitedhealthcare-ceo-killing-luigi-mangione-nyc-bc926d92af482822c3186d55b87c5115",
      "urlToImage": "https://dims.apnews.com/dims4/default/85bbf66/2147483647/strip/true/crop/4228x2378+0+206/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2Fdc%2Fec8375224d69a2872043fbc1ccd4%2F5509f13b3aed4eea9e8a2cc178ba0203"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}