{
  "articles": [
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu says Israel “has no choice but to finish the job and complete the defeat of Hamas.” He is speaking to foreign media in Jerusalem on Sunday and defending a planned military offensive. He asserts that “our goal is not to occupy Gaza, our goal is to free Gaza.” He is also pushing back against what he calls a “global campaign of lies” as condemnation of the plan grows both inside and outside Israel. Meanwhile, at least 26 Palestinians were killed on Sunday as they sought aid in the territory.",
      "publishedAt": "2025-08-10T13:29:14Z",
      "title": "Netanyahu defends his planned military offensive in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostages-gaza-08-10-2025-e25dba4aa05fc69cda8949391ca7e5c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/250a013/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F93%2F8d503364badde2817733fffde712%2F7ed704a5170c4b0b9a66b964b974b5d7"
    },
    {
      "author": null,
      "description": "Police in London are bracing for more demonstrations on Sunday as the war in Gaza continues to inflame tensions across the U.K. Demonstrators plan to march to the prime minister’s residence, demanding the release of hostages in Gaza. The march organizers emphasize the humanitarian aspect of their demand for the hostages’ release, saying it’s not a political issue. This follows the arrest of 474 people on Saturday at a protest supporting a banned pro-Palestinian group. The group, Palestine Action, was banned after activists damaged military planes. Supporters are challenging the ban in court.",
      "publishedAt": "2025-08-10T10:20:32Z",
      "title": "Demonstrators seeking release of Gaza hostages to march in London as Middle East tensions grip UK",
      "url": "https://apnews.com/article/palestine-action-protest-israeli-hostages-cad78ce82f9e8e7627f2c842cc5157a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef330b4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F21%2F478b25180b1a9b12abccb5f623ac%2F53d810530e1143e08378c03e3fa2e1bb"
    },
    {
      "author": null,
      "description": "The threats, pressure and ultimatums have come and gone, but Russian President Vladimir Putin has maintained Moscow’s uncompromising demands in Ukraine, raising fears he could use a planned summit with U.S. President Donald Trump to coerce Kyiv into accepting an unfavorable deal. The maximalist demands reflect Putin’s determination to reach the goals he set when he launched the full-scale invasion of Ukraine on Feb. 24, 2022. Putin sees a meeting with Trump as a chance to negotiate a broad deal that would not only cement Russia’s territorial gains but also keep Ukraine from joining NATO and hosting any Western troops, allowing Moscow to gradually pull the country back into its orbit.",
      "publishedAt": "2025-08-10T04:09:51Z",
      "title": "Russia sticks to its tough stance ahead of a planned Putin-Trump summit",
      "url": "https://apnews.com/article/russia-trump-summit-ukraine-war-2afea5988bdaca94cae39b7f86fa59ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/0e6f3e1/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F93%2F8b9e101c4cfcd14acc73c72513c7%2F640268006a9042dfae5b4d100a22ae41"
    },
    {
      "author": null,
      "description": "European nations have rallied behind Ukraine, emphasizing that peace cannot be achieved without Kyiv's involvement. This comes before a planned meeting between U.S. President Donald Trump and Russia's Vladimir Putin. Trump has said the meeting in Alaska is to discuss ending the war, which has lasted over three years. European leaders have expressed concerns that Kyiv might be pressured into giving up land. A statement from European leaders stresses the need for a \"just and lasting peace\" for Ukraine. Trump has also moved up an ultimatum to impose additional sanctions on Russia if no settlement is reached.",
      "publishedAt": "2025-08-10T10:43:46Z",
      "title": "European leaders rally behind Ukraine ahead of Trump-Putin meeting",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-putin-european-statement-084569cce3a6b383325b0a8efa37bc6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A U.N. report says dozens of its female Afghan staff have received death threats related to their work. The U.N. report published on Sunday is the latest update on the human rights situation in Afghanistan. The U.N. mission to the country said that female national staff were subjected to explicit death threats in May from unidentified individuals. The Taliban told the U.N. mission that their personnel weren't responsible for the threats. The report said that an Interior Ministry investigation is underway. Afghan authorities didn’t immediately respond to requests for comment on the report or the investigation.",
      "publishedAt": "2025-08-10T10:46:17Z",
      "title": "Taliban investigating death threats against United Nations' Afghan female staff, report says",
      "url": "https://apnews.com/article/afghanistan-taliban-death-threats-women-united-nations-453f62985e78fadc855a6878d8126c3c",
      "urlToImage": "https://dims.apnews.com/dims4/default/38891db/2147483647/strip/true/crop/3960x2228+0+206/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2F48%2F42a138aaf6541145a2e261ea2a0f%2F8625d0751e4a48a2b6498916abc456b7"
    },
    {
      "author": null,
      "description": "Many of President Donald Trump's picks to be federal judges have revealed anti-abortion views, been associated with anti-abortion groups or defended abortion restrictions. With Senate confirmation, they'd have lifetime appointments and be in position to roll back abortion access long after the Republican president leaves the White House. Of the 17 judicial nominees so far in Trump’s second term, an Associated Press review finds at least eight have argued in favor of abortion restrictions or against expanded abortion access. No such records could be found for the other nine, nor did the AP review find evidence that any nominees support increased access to abortion.",
      "publishedAt": "2025-08-10T11:21:14Z",
      "title": "Many of Trump's court nominees have been active in anti-abortion movement",
      "url": "https://apnews.com/article/abortion-trump-federal-courts-judges-senate-68d903a0269da41c432647c8c554ca80",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e536fc/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2Fe5%2Fd0c9c18092bb43f592a99b24e362%2F819c721f926347799bd41ee5374a09bb"
    },
    {
      "author": null,
      "description": "A Georgia man who had blamed the COVID-19 vaccine for making him depressed and suicidal has been identified as the shooter who opened fire late Friday on the U.S. Centers for Disease Control and Prevention headquarters, killing a police officer. The 30-year-old suspect, who died during the incident, had also tried to get into the CDC’s headquarters in Atlanta but was stopped by guards before driving to a pharmacy across the street and opening fire, a law enforcement official told The Associated Press on Saturday. The American Federation of Government Employees, Local 2883, is calling for heightened security and a strong statement condemning vaccine misinformation from federal officials.",
      "publishedAt": "2025-08-10T14:32:01Z",
      "title": "Union wants statement against COVID vaccine misinformation after CDC shooting",
      "url": "https://apnews.com/article/cdc-suspect-covid-vaccine-georgia-officer-dead-0c6018d2f7caf7a2702bc09f9f3568ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/c678177/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2Ff4%2F1390cccb0f09773dbb05e202a964%2Fc9827b3ab38a4f75ab63a5d80c07e659"
    },
    {
      "author": null,
      "description": "A Congolese refugee who had been separated from her family for eight years was on the verge of joining them in the United States when President Donald Trump halted the refugee program in January. She was one of at least 12,000 refugees who had imminent travel plans canceled. Many of them had already sold belongings in anticipation of resettlement. A lawsuit brought by refugee aid groups and a handful of individuals, including the Congolese woman, is still playing out in the courts. The Congolese woman made it to the U.S. earlier this year thanks to a narrow window created by a court ruling that was later overturned. But thousands of refugees remain in limbo.",
      "publishedAt": "2025-08-10T13:01:24Z",
      "title": "Refugee's journey: A Congolese woman's quest to reunite with family",
      "url": "https://apnews.com/article/refugee-us-africa-trump-congolese-lawsuit-4a62d921a8cd14955ae177ac27298862",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ac3357/2147483647/strip/true/crop/6661x3747+0+347/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F01%2F078d9825f87b26f78e802d812901%2F2ddc0650c60944549cb82719a247ddc1"
    },
    {
      "author": null,
      "description": "More than 70 million Americans have experienced the muggiest start to summer on record, with climate change increasing humidity in the Eastern U.S. An Associated Press analysis shows that parts of 20 states and Washington, D.C., have had record days with uncomfortable dew points in June and July. Philadelphia, Washington, and Baltimore have seen oppressive humidity levels. The summer of 2025 has dew points averaging 6 degrees higher than late 20th-century norms in several cities. Experts say climate change and recent rain events are contributing to these extreme humidity levels, affecting areas not accustomed to such conditions.",
      "publishedAt": "2025-08-10T12:31:01Z",
      "title": "More than 70 million Americans have sweated through muggiest summer start on record",
      "url": "https://apnews.com/article/humid-muggy-sticky-climate-oppressive-summer-df1b506a3036a6ea0c4c8ad5bbd87429",
      "urlToImage": "https://dims.apnews.com/dims4/default/53d7783/2147483647/strip/true/crop/3617x2035+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2F08%2F075e0bf72cc022d2fb3d90996e4c%2Fe35cf04932a3497cbc371d25ba68c6a8"
    },
    {
      "author": null,
      "description": "Frederick Richard is challenging men’s gymnastics norms with his wardrobe. The 21-year-old Olympic bronze medalist swapped traditional stirrup pants for shorts over compression leggings at the U.S. Championships. He accepts a three-tenths deduction each day for breaking uniform rules, believing it’s worth it to make the sport more appealing. Richard’s goal is to inspire young boys by making gymnastics more accessible. He debuted his new look at Winter Cup in February and refined it for nationals. While the clothing violates the rules, Richard is determined to push boundaries and hopes for more flexibility in uniform rules.",
      "publishedAt": "2025-08-10T14:40:44Z",
      "title": "Frederick Richard challenges men's gymnastics norms with bold wardrobe choice",
      "url": "https://apnews.com/article/gymnastics-olympic-frederick-richard-d74242666a57de649c7e79ae43070186",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f54563/2147483647/strip/true/crop/7257x4082+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F5f%2F423ce24b0f4c08505ad4ce71ccc0%2F56a9ddb125314a3b92a4c55f10c7da99"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}