{
  "articles": [
    {
      "author": "Kamila Hrabchuk",
      "description": "Ukrainian President Volodymyr Zelenskyy says that Russia has launched a major attack on Ukraine with around 450 drones and 70 missiles. The strikes reported Tuesday came a day before U.S.-brokered talks between Russia and Ukraine in Abu Dhabi. Zelenskyy said that Russia targeted the power grid again in five regions of Ukraine in a bid to deny civilians light, heating and water during a harsh winter. At least 10 people were wounded. Zelenskyy urged allies to send more air defense supplies and increase pressure on Russia. Talks between Moscow and Kyiv have been described as constructive. But a comprehensive settlement remains distant.",
      "publishedAt": "2026-02-03T09:09:54Z",
      "title": "Russia fires 450 drones and 70 missiles at Ukraine, a day before US-brokered talks",
      "url": "https://apnews.com/article/russia-ukraine-war-missile-drone-attack-electricity-c10dbc6b621e196606fc79caab0eaad5",
      "urlToImage": "https://dims.apnews.com/dims4/default/37cb75d/2147483647/strip/true/crop/3831x2553+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F3e%2Fe42e5d1f5916eb47fb99617be147%2F49052046c40a4dfc8c366b51149d5d4d"
    },
    {
      "author": "David A. Lieb, Heather Hollingsworth, Morgan Lee",
      "description": "State and local officials are pushing back against federal plans to expand immigrant detention facilities. President Donald Trump's administration is scouting locations across the U.S. for new sites, sparking protests and legal challenges. In Minnesota, fatal shootings during immigration enforcement have intensified scrutiny on ICE. In Virginia, a proposed detention center drew hundreds of people to a tense public hearing. Kansas City officials have passed a moratorium attempt to block a new ICE detention site. Meanwhile, New Mexico's legislature is advancing a bill to ban state and local contracts for ICE facilities. A law Trump signed last year includes $45 billion to expand ice detention facilities.",
      "publishedAt": "2026-02-03T04:58:10Z",
      "title": "Trump's ICE detention plans face local resistance",
      "url": "https://apnews.com/article/immigrant-detention-warehouses-ice-trump-51ad28e6b1e1c3fa60a38029d932aeeb",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1a754d/2147483647/strip/true/crop/5706x3802+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2Fcc%2F452590d71d9b348098c5aac7d1e4%2F56d53ce93be24a369eb2c4e0b9ae183e"
    },
    {
      "author": "Rebecca Santana",
      "description": "The secretary of Homeland Security is requiring that all the department's officers on the ground in Minneapolis wear body cameras. Secretary Kristi Noem made the announcement Monday on the social media platform X. Minneapolis has been the site of intense scrutiny over the conduct of immigration enforcement agents. There have been increased calls by critics of Homeland Security to require all of the department’s officers who are responsible for immigration enforcement to wear body cameras. President Donald Trump said the decision was up to Noem but added that he thought it was generally good for law enforcement to wear cameras.",
      "publishedAt": "2026-02-02T21:52:27Z",
      "title": "Noem says immigration officers in Minneapolis will wear body cameras",
      "url": "https://apnews.com/article/immigration-enforcement-minneapolis-secretary-noem-homeland-security-37af4947057e64efee5e43a8f2e018bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5a7f64/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2F63%2F4e9efaabb95ad3bbc8aa2787c932%2F6ce1f6ff63714c388365c1fd578ec465"
    },
    {
      "author": "Eric Tucker",
      "description": "Director of National Intelligence Tulsi Gabbard has told lawmakers that she attended an FBI search of the election center in Fulton County, Georgia, last week because President Donald Trump asked her to be there. She also acknowledged in a letter Monday that she “facilitated” what she described as a brief phone call between Trump and FBI agents who carried out the search but insisted that neither she nor the president issued any directives. The letter marked Gabbard’s first explanation for her unusual presence at an FBI search during which agents seized hundreds of boxes containing ballots and other documents related to the 2020 election.",
      "publishedAt": "2026-02-03T02:52:21Z",
      "title": "Gabbard says Trump wanted her at FBI search of election center",
      "url": "https://apnews.com/article/fbi-georgia-gabbard-elections-2a04ffe6aa317ed5be98c1cd60388992",
      "urlToImage": "https://dims.apnews.com/dims4/default/a17bd3a/2147483647/strip/true/crop/2064x1375+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2F25%2Ff5a246ca529e5e995a6dbc4c7953%2F1fe1adaf576c495b866ca24b20819f28"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister, Philip Marcelo",
      "description": "The Justice Department says it has taken down several thousand documents and “media” that may have inadvertently included victim-identifying information after lawyers for disgraced financier Jeffrey Epstein's victims complained of insufficient redactions. The government said in a letter to a judge Monday that “technical or human error” caused the errors. Lawyers for victims said in a letter to the judge Sunday that botched redactions had damaged the lives of nearly 100 victims. The judge who oversaw the sex trafficking case against Epstein in Manhattan federal court scheduled a hearing for Wednesday and invited lawyers to bring their clients, although he said he was not certain how helpful he could be.",
      "publishedAt": "2026-02-02T18:25:19Z",
      "title": "Epstein-related files that may have had victim information taken down, DOJ says",
      "url": "https://apnews.com/article/justice-department-epstein-files-trump-036f169b672bcbe0a9b5516e109b6af0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6ffcc92/2147483647/strip/true/crop/4878x3250+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2Ff9%2Fa5a43bcbe83dbf6409a8144d5563%2F3a07f3f6500a43faab3af6269f8ebdeb"
    },
    {
      "author": "Yuri Kageyama",
      "description": "Asian shares have surged, led by a nearly 7% jump in South Korea's benchmark to a record close. Shares in Tokyo gained nearly 4%, also setting a record, as investors bought tech-related shares. Traders are awaiting various earnings reports from major companies to gauge the impact of various trends including U.S. President Donald Trump’s tariffs and possible curbs on rare earths exports from China. Oil prices declined. On Wall Street, the S&P 500 added 0.5% to snap a three-day losing streak and finish just shy of its record set last week. The Dow Jones Industrial Average climbed 1.1%, and the Nasdaq composite gained 0.6%.",
      "publishedAt": "2026-02-03T04:01:03Z",
      "title": "Asian shares surge, with Japan and South Korea hitting records, as markets regain calm",
      "url": "https://apnews.com/article/stock-markets-gold-trump-earnings-604eb66eac5e7aab8a02790491ffa459",
      "urlToImage": "https://dims.apnews.com/dims4/default/c793634/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fb4%2F455f863822d5721c7ad3c824d863%2F0e1e4a5c44cd4e82a5f01b7ddc02947d"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran’s president says he has instructed the country’s foreign minister to “pursue fair and equitable negotiations” with the United States. The comments on Tuesday from reformist President Masoud Pezeshkian represent the first clear signal from Iran that it may take part in negotiations being organized by Turkey. Pezeshkian made the comments on X. He said: “I have instructed my Minister of Foreign Affairs, provided that a suitable environment exists — one free from threats and unreasonable expectations — to pursue fair and equitable negotiations, guided by the principles of dignity, prudence, and expediency.”The U.S. has yet to acknowledge the talks will take place.",
      "publishedAt": "2026-02-03T05:20:10Z",
      "title": "Iran’s president seeks negotiations with the United States",
      "url": "https://apnews.com/article/iran-trump-protests-negotiations-nuclear-deal-9758adb33c0d01c70a07ad7de0f5221b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a86f059/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F77%2Fdf7eea9a4578933bd693207b7f07%2Fea5a975fd6894af482d240d95cdebc47"
    },
    {
      "author": "Stephen Groves",
      "description": "Former President Bill Clinton and former Secretary of State Hillary Clinton are agreeing to testify in a House investigation into convicted sex offender Jeffrey Epstein. But the Republican leading the probe says an agreement had not yet been finalized. Rep. James Comer, the chair of the House Oversight Committee, was advancing criminal contempt of Congress charges against both Clintons Monday evening for defying a congressional subpoena. Attorneys for the Clintons emailed staff for the Oversight panel, saying the pair would accept Comer’s demands and “will appear for depositions on mutually agreeable dates.” But Comer says an agreement had not been reached to avoid a contempt vote.",
      "publishedAt": "2026-02-02T18:27:29Z",
      "title": "Clintons agree to testify in House Epstein investigation",
      "url": "https://apnews.com/article/bill-clinton-jeffrey-epstein-house-574c68c0d02c6d6a7d58cd04933996b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d8e20a/2147483647/strip/true/crop/2858x1904+0+56/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F84%2Facbd6f614b2cc86e808cf0104cb6%2F9f458d327dc045faa1fc0ed7e3ef29f6"
    },
    {
      "author": "Kostya Manenkov, Mark Lewis",
      "description": "The son of Norway’s crown princess has pleaded not guilty to rape charges as he goes on trial for multiple alleged offenses, opening weeks of proceedings in a case that has cast a shadow on the royal family’s image. Marius Borg Høiby, 29, is the eldest son of Crown Princess Mette-Marit from a previous relationship and the stepson of the heir to the throne, Crown Prince Haakon. He has no royal title or official duties. Høiby stood for 24 minutes on Tuesday as the prosecutor read out the 38 counts against him at the Oslo district court, asking him if he pleaded guilty. He replied “no” to each of the most serious charges, including the four counts of rape.",
      "publishedAt": "2026-02-03T06:07:37Z",
      "title": "Son of Norway's crown princess pleads not guilty to rape charges",
      "url": "https://apnews.com/article/norway-royals-hoiby-rape-trial-fd0b2d641e84e1ec7577a82f7e857b65",
      "urlToImage": "https://dims.apnews.com/dims4/default/e114002/2147483647/strip/true/crop/4041x2693+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F84%2F7d7a80c64f7c8d59734f125993a1%2F3f8105e9ebf84000bfa5020cef494892"
    },
    {
      "author": "Kevin Freking",
      "description": "Speaker Mike Johnson’s ability to carry out President Donald Trump's “play call” for funding the government is being put to the test. The House is holding a procedural vote Tuesday on a bill that would end the partial government shutdown. Johnson will need near-unanimous support from his Republican conference to proceed. The legislation funds most of the federal government through Sept. 30 and the Department of Homeland Security for two weeks as lawmakers negotiate potential changes for the agency that enforces the nation’s immigration laws, often referred to as ICE. Trump urged lawmakers to back the bill in a social media post.",
      "publishedAt": "2026-02-03T05:12:18Z",
      "title": "GOP leaders labor for support ahead of key test vote on ending shutdown",
      "url": "https://apnews.com/article/government-shutdown-ice-funding-471e55ba4c3247051739ee1b50b2857a",
      "urlToImage": "https://dims.apnews.com/dims4/default/0762e30/2147483647/strip/true/crop/5328x3550+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2Fea%2Fc3e194ba4b9704510345ac5dd390%2Febb4e2568cef4b5f9bf132ffd6282021"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}