{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Results released showed Merz's Christian Democrats and the center-left Social Democrats winning a combined majority of seats after small parties failed to make the threshold.",
      "publishedAt": "2025-02-23T01:00:00Z",
      "title": "Live updates: Merz's conservatives win Germany election as far-right AfD makes historic gains",
      "url": "https://apnews.com/live/germany-election-updates-parliament",
      "urlToImage": "https://dims.apnews.com/dims4/default/61f4124/2147483647/strip/true/crop/7216x4059+0+376/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F77%2Fea01acc1469daba1eece9ab37f19%2Fap25054772724906.jpg"
    },
    {
      "author": "Vanessa Gera",
      "description": "Provisional results confirm that mainstream conservatives led by Friedrich Merz won Germany's national election, while a far-right party surged to become the nation’s second-largest. The campaign was dominated by worries about the yearslong stagnation of Europe’s biggest economy and pressure to curb migration, and took place against a background of growing uncertainty over the future of Ukraine and Europe’s alliance with the United States. The results released by the electoral authority showed the conservative Christian Democrats and the center-left Social Democrats winning a combined majority of seats in the national legislature after small parties failed to make the electoral threshold.",
      "publishedAt": "2025-02-24T05:08:54Z",
      "title": "Conservatives win German election while far-right party surges to second place",
      "url": "https://apnews.com/article/germany-politics-election-results-afd-merz-4b862dcd150423028cc1ac1e6663cb82",
      "urlToImage": "https://dims.apnews.com/dims4/default/202312a/2147483647/strip/true/crop/4793x2696+0+189/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2F9e%2F920561de8a7d9564aacf8ad73436%2F4d07139566214c8380c389570a9795bf"
    },
    {
      "author": "Kirsten Grieshaber",
      "description": "Friedrich Merz is on course to become post-World War II Germany’s 10th chancellor, the culmination of a yearslong political career that was once sidelined by his party’s iconic leader. The 69-year-old opposition leader of the center-right Union bloc has by far the best chance of forming a new government after the country's election on Sunday. It’s been a late rise to the top for Merz, who has been in politics for decades but saw his ascent to the top derailed by former Chancellor Angela Merkel in the early 2000s and even turned his back on active politics for several years. Despite his political experience, he is heading to the chancellery without previously having served in government.",
      "publishedAt": "2025-02-24T06:53:54Z",
      "title": "Conservative leader Friedrich Merz headed for Germany's top job after a career of ups and downs",
      "url": "https://apnews.com/article/germany-election-merz-candidate-chancellor-christian-democrats-bb9dff6bda93dab02c4ee3029920d44d",
      "urlToImage": "https://dims.apnews.com/dims4/default/59b8336/2147483647/strip/true/crop/5082x2859+0+123/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F0e%2F6526f75a79876ddbd50dff1c38e0%2Fa063e43f6c4d4b0cb42a2a8f38e7e03d"
    },
    {
      "author": "The Associated Press",
      "description": "BERLIN (AP) — German opposition leader Friedrich Merz’s conservatives have won a lackluster victory in a national election Sunday, projections show.",
      "publishedAt": "2025-02-23T20:46:52Z",
      "title": "Conservatives celebrate German election win as the far right sees historic success",
      "url": "https://apnews.com/article/germany-election-merz-scholz-afd-union-weidel-2544cf8296a8e9b28dc684ccd062cc8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/019a6af/2147483647/strip/true/crop/7956x4475+0+528/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F2c%2F101360fb15566384a44dc8f07cd1%2F4d917a6fcb964cf58b54fb5cdb945774"
    },
    {
      "author": "The Associated Press",
      "description": "Results released showed Merz's Christian Democrats and the center-left Social Democrats winning a combined majority of seats after small parties failed to make the threshold.",
      "publishedAt": "2025-02-23T01:00:00Z",
      "title": "Live updates: Merz's conservatives win Germany election as far-right AfD makes historic gains",
      "url": "https://apnews.com/live/germany-election-updates-parliament#00000195-3679-db27-a5d7-7ffdc2c10000",
      "urlToImage": "https://dims.apnews.com/dims4/default/61f4124/2147483647/strip/true/crop/7216x4059+0+376/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F77%2Fea01acc1469daba1eece9ab37f19%2Fap25054772724906.jpg"
    },
    {
      "author": "Steve Peoples, Eric Tucker, Amanda Seitz",
      "description": "Confusion and chaos loom as hundreds of thousands of federal employees begin their workweek on Monday. They’re facing an 11:59 p.m. EST deadline from President Donald Trump’s cost-cutting chief, Elon Musk, to explain their recent accomplishments or risk losing their jobs. Musk’s unusual weekend demand faced resistance from key U.S. agencies led by the president’s loyalists that instructed their employees not to comply. Lawmakers in both parties said that Musk’s mandate may be illegal, while unions are threatening to sue. Trump over the weekend called for Musk to be more aggressive in his cost-cutting crusade through the so-called Department of Government Efficiency, or DOGE, and posted a meme on social media mocking federal employees.",
      "publishedAt": "2025-02-24T05:13:23Z",
      "title": "Federal workers confront mass confusion as Musk's deadline to list accomplishments looms",
      "url": "https://apnews.com/article/musk-trump-federal-workers-firings-email-9785e7f74eb2a8b8fde5e01ff0c7717f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d42628/2147483647/strip/true/crop/5596x3148+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F2c%2Fffa647c4ee6f99be0f67986359eb%2Fb7390a153f264c67954cb0fc36549e12"
    },
    {
      "author": "Tia Goldenberg, Majdi Mohammed",
      "description": "Israeli tanks have moved into the occupied West Bank for the first time since 2002, shortly after the defense minister said troops will remain “for the coming year” in parts of the Palestinian territory. Associated Press journalists saw a handful of tanks move Sunday into Jenin, long a bastion of armed struggle against Israel. Israel is deepening its crackdown on the Palestinian territory and has said it is determined to stamp out militancy amid a rise in attacks. Israel launched the broad offensive in the West Bank on Jan. 21 — two days after the current ceasefire in Gaza took hold.",
      "publishedAt": "2025-02-23T09:21:59Z",
      "title": "Israel expands into West Bank and says troops to remain for a year",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-02-23-2025-1c2dc86afd2e05888d5d588f462e898b",
      "urlToImage": "https://dims.apnews.com/dims4/default/71dc539/2147483647/strip/true/crop/5363x3017+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F96%2F5ae87cce7489a7e4639afafa8f19%2F415a1f18aaa84a9dbd1ba9549a9e8ae4"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Vatican says Pope Francis is resting after a quiet night. Monday is the 10th day of his hospitalization for a complex lung infection that has provoked the early stages of kidney failure. The one-line statement didn’t say if Francis, 88, had woken up. “The night passed well, the pope slept and is resting,” it said. Late Sunday, doctors reported that blood tests showed early kidney failure that was nevertheless under control. They said Francis remained in critical condition but that he hadn’t experienced any further respiratory crises since Saturday.",
      "publishedAt": "2025-02-24T07:33:28Z",
      "title": "Pope is resting on 10th day of hospitalization after early stages of kidney failure detected",
      "url": "https://apnews.com/article/pope-vatican-hospital-pneumonia-sepsis-ec28babfc64d4f7086a2ba5db52fd69f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b60c627/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2Fe1%2F07aa308a7781ec0d13c93bd0fb6c%2F7e065c89e15a4a1db693371690916f55"
    },
    {
      "author": null,
      "description": "A dozen leaders from Europe and Canada arrived in Ukraine’s capital by train Monday morning to mark the third anniversary of Russia’s invasion. The visitors were greeted at the station by Ukrainian Foreign Minister Andrii Sybiha and the president’s chief of staff Andrii Yermak. Among them were European Commission President Ursula von der Leyen and Canadian Prime Minister Justin Trudeau. Von der Leyen wrote on social media that Europe's destiny was at stake. The guests were set to attend events dedicated to the anniversary and discuss supporting Ukraine amid a recent U.S. policy shift under President Donald Trump.",
      "publishedAt": "2025-02-24T06:32:17Z",
      "title": "Foreign leaders visit Ukraine's capital to mark third war anniversary",
      "url": "https://apnews.com/article/russia-ukraine-war-anniversary-84e4c62519fc15b34e17f661cf3dd20e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d41efa0/2147483647/strip/true/crop/6889x3875+0+359/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2Fad%2F065b365e7b2ab1dbefa1d23dc59c%2F72d93c5e7f7a4a31a2243ec36b3a9567"
    },
    {
      "author": "Nicolas Vaux-montagny, Jade Le Deley",
      "description": "A former surgeon is set to stand trial in France for the alleged rape or sexual abuse of 299 victims. Most of them were children who were his patients. Investigators and his notebooks describe a pattern of violence spanning over three decades. Joël Le Scouarnec will face hundreds of victims during a four-month trial in Brittany and could be sentences up to 20 years in prison if convicted. He does not deny the facts though claims he does not remember everything. Some survivors have no memory of the assaults, having been unconscious at the time.",
      "publishedAt": "2025-02-24T05:13:34Z",
      "title": "A French surgeon is on trial accused of raping or abusing 299 people, mostly child patients",
      "url": "https://apnews.com/article/france-child-rape-trial-surgeon-scouarnec-46127e441d5ed0ebd69f9320ec7e5b2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/6066443/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2F69%2Ffbc1770d5d8878233bd1a6894111%2Fade026a5a02d4a2981987320cb1e801f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}