{
  "articles": [
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Speaker Kevin McCarthy was voted out of the job Tuesday in an extraordinary showdown — a first in U.S. history, forced by a contingent of hard-right conservatives and throwing the House and its Republican leadership into chaos.",
      "publishedAt": "2023-10-03T15:31:45Z",
      "title": "Speaker McCarthy ousted in historic House vote, as scramble begins for a Republican leader",
      "url": "https://apnews.com/327e294a39f8de079ef5e4abfb1fa555",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d955ef4e04994a1c80f00bd1c33db90f/1920.jpeg"
    },
    {
      "author": "COLLEEN BARRY",
      "description": "VENICE (AP) — A bus carrying dozens of people plummeted 15 meters (50 feet) from an elevated road in Venice, causing a fiery crash that killed 21 people and injured at least 15, mostly foreign tourists returning to a nearby campsite.",
      "publishedAt": "2023-10-04T08:01:13Z",
      "title": "A bus plummeted 50 feet from an elevated road in Venice, killing 21 people in a fiery crash",
      "url": "https://apnews.com/dcde9f5c2b39f19dace8317caa9ebbba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9672c4d4e3394136a21208542d1a92f6/2000.jpeg"
    },
    {
      "author": "LEA SKENE and DENISE LAVOIE",
      "description": "BALTIMORE (AP) — A shooting interrupted a homecoming week celebration at Baltimore's Morgan State University on Tuesday, wounding five people and prompting an hourslong lockdown of the historically Black college.",
      "publishedAt": "2023-10-04T02:28:32Z",
      "title": "5 people were wounded in a shooting after a homecoming event at Morgan State University in Baltimore",
      "url": "https://apnews.com/d1ddf588bdb6b758ae18783fee6c1323",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/893c0c276141402f81e47cf65eac0ee8/3000.jpeg"
    },
    {
      "author": "DAVID KEYTON and MIKE CORDER",
      "description": "STOCKHOLM (AP) — Three scientists based in the U.S. won the Nobel Prize in chemistry Wednesday for their work on quantum dots — tiny particles just a few atoms in diameter that can release very bright colored light and whose applications in every day life include electronics and medical imaging.",
      "publishedAt": "2023-10-04T07:34:14Z",
      "title": "Trio wins Nobel Prize in chemistry for work on quantum dots, used in electronics and medical imaging",
      "url": "https://apnews.com/cabca0d16dc33427799886a1f012effe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7665f5c49b424ec4a1c5bc7789a29d12/1817.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and SETH BORENSTEIN",
      "description": "VATICAN CITY (AP) — Pope Francis shamed and challenged world leaders on Wednesday to commit to binding targets to slow climate change before it’s too late, warning that God’s increasingly warming creation is fast reaching a “point of no return.”",
      "publishedAt": "2023-10-04T10:01:46Z",
      "title": "Point of no return: Pope challenges leaders at UN talks to slow global warming before it's too late",
      "url": "https://apnews.com/c5cb4096202a117b34ca3d2d4a1b9e72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dbcce98cff8405b8231c37178fc74a0/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, BOBBY CAINA CALVAN and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Rebuking Donald Trump, a state court judge imposed a limited gag order Tuesday in the former president’s civil business fraud trial and ordered him to delete a social media post that publicly maligned a key court staffer.",
      "publishedAt": "2023-10-03T04:03:56Z",
      "title": "New York judge issues limited gag order after Trump sends disparaging post about court clerk",
      "url": "https://apnews.com/371675a2482c1de01f516f29b5a43d33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f28ebbd0f33248a8bee1ed616bb37a8b/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "Russian air defenses shot down 31 Ukrainian drones during a concerted nighttime attack by Kyiv's forces on border regions, the Russian Defense Ministry said Wednesday, even as uncertainty grew over Ukraine's future access to weapons and ammunition from its Western allies.",
      "publishedAt": "2023-10-04T08:30:02Z",
      "title": "Russia says it has foiled a major Ukrainian drone attack as concerns grow about weapons supplies",
      "url": "https://apnews.com/3fc11edb987f3c8137951ec19d03288d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de776d8c40c545449006241153655587/2000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "Cleanup of areas destroyed in the Maui wildfires could end up being one of the most complex to date, federal officials said, given the island's significant cultural sites, its rich history including a royal residence and possibly remains of people who died in the disaster.",
      "publishedAt": "2023-10-04T05:02:32Z",
      "title": "Cleanup from Maui fires complicated by island's logistical challenges, cultural significance",
      "url": "https://apnews.com/a6e5d44293af87e957893dc42cb86621",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6aa1070d197a4e3bb00d0173fdcc3e57/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — A self-described gangster who police and prosecutors say masterminded the shooting death of Tupac Shakur in Las Vegas in 1996 is due to make his first appearance Wednesday before a Nevada judge.",
      "publishedAt": "2023-10-04T04:04:54Z",
      "title": "Suspect charged in rapper Tupac Shakur's fatal shooting will appear in a court in Las Vegas",
      "url": "https://apnews.com/8568b1a49ee46aae0a737f8a30376004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f7b566ad93c485facd06266db9cceb5/3000.jpeg"
    },
    {
      "author": "EVENS SANON and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Woodberson Seïde held his stepsister's hand as they walked through Haiti 's capital on their way to an afterschool music program.",
      "publishedAt": "2023-10-04T04:11:24Z",
      "title": "Haitian students play drums and strum guitars to escape hunger and gang violence",
      "url": "https://apnews.com/d647c292209e854b1438901cc5c71822",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4a1218a58d8494684a5f4bc08b01291/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}