{
  "articles": [
    {
      "author": "JOSEPH KRAUSS and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Palestinians in the sealed-off Gaza Strip struggled to find any safe area Wednesday, as Israeli strikes demolished entire neighborhoods, hospitals ran low on supplies and a power blackout was expected within hours, deepening the misery of a war sparked by a stunning and deadly assault by Hamas militants.",
      "publishedAt": "2023-10-11T04:25:48Z",
      "title": "Israeli strikes demolish entire Gaza neighborhoods as sealed-off territory faces imminent blackout",
      "url": "https://apnews.com/e4ae51a640a3fc04b23ea9561703f874",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d037e5c39a7488088e35ac0bd667a2a/1600.jpeg"
    },
    {
      "author": "AAMER MADHANI, TARA COPP and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden on Tuesday confirmed that U.S. citizens are among the hostages captured by Hamas as he condemned the militant group for the “sheer evil” of its shocking weekend assault on Israel.",
      "publishedAt": "2023-10-10T17:20:41Z",
      "title": "Biden confirms Americans among hostages captured in Israel, condemns 'sheer evil' of Hamas militants",
      "url": "https://apnews.com/ae0217d2317002ddca003017df85e04f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9b5f5e5c5514ebeaa6a44e18315cd6a/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Stalemated over a new House speaker, the Republican majority is scheduled to convene behind closed doors to launch internal party voting but lawmakers warn it could take hours, if not days, to unite behind a nominee after Kevin McCarthy's ouster.",
      "publishedAt": "2023-10-11T04:07:09Z",
      "title": "Having ousted Kevin McCarthy, House Republicans are hitting trouble trying to nominate a new speaker",
      "url": "https://apnews.com/b90b887d079a4b58e35da7b213916457",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef188c879fde420982da08eebe153db1/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and NICHOLAS RICCARDI",
      "description": "COLUMBUS, Ohio (AP) — After Ohio Republicans bolstered their statehouse majority last year due to their dominating showing in the midterm elections, they split into rival camps over who should lead the lower chamber.",
      "publishedAt": "2023-10-11T04:16:43Z",
      "title": "Internal conflicts and power struggles have become hallmarks of the modern GOP",
      "url": "https://apnews.com/bb5d9287214cd5aa0a1fdf03b56bebcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85817c6e2e964a7797333d8ff3f642bd/3000.jpeg"
    },
    {
      "author": "EBRAHIM NOROOZI",
      "description": "ZINDA JAN, Afghanistan (AP) — Nurullah crossed the border into Iran to earn money for his family, like so many men from his village in western Afghanistan.On Sunday, he stood on the side of the road crying.",
      "publishedAt": "2023-10-11T04:00:47Z",
      "title": "Quake in Afghanistan leaves rubble, funerals and survivors struggling with loss",
      "url": "https://apnews.com/07d767e0b1caf270485fb79deeaf324e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9ef86b9784d40d8940ce9cbd69730e1/3000.jpeg"
    },
    {
      "author": "LORNE COOK and LOLITA BALDOR",
      "description": "BRUSSELS (AP) — For the first time, Ukraine President Volodymyr Zelenskyy joined a meeting of more than 50 defense leaders from around the world Wednesday to make a personal pitch for military aid, in the face of lagging political support in the U.S.",
      "publishedAt": "2023-10-11T07:00:56Z",
      "title": "Ukraine President Zelenskyy at NATO defense ministers meeting seeking more support to fight Russia",
      "url": "https://apnews.com/1d22ae0a2315c2377af0a241e7950f1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3c0f1052d294e5aa1bcb56da71b42c6/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Hurricane Lidia made landfall as an “extremely dangerous” Category 4 storm Tuesday evening with winds of 140 mph (220 kph) near Mexico’s Pacific coast resort of Puerto Vallarta, and then moved inland, still as a powerful hurricane.",
      "publishedAt": "2023-10-10T13:35:17Z",
      "title": "Lidia makes landfall as Category 4 hurricane with 140 mph winds near Mexico's Puerto Vallarta resort",
      "url": "https://apnews.com/f64c841d06bcde04469e3e8e07355cf1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/843a4234ff0747e1a5683246b348aa36/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "High school students' scores on the ACT college admissions test have dropped to their lowest in more than three decades, showing a lack of student preparedness for college-level coursework, according to the nonprofit organization that administers the test.",
      "publishedAt": "2023-10-11T04:06:30Z",
      "title": "ACT test scores for US students drop to new 30-year low",
      "url": "https://apnews.com/99f80b26696a92c78e2680873a3df68c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3875ec76204349968aba01350500684d/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "CANBERRA, Australia (AP) — A Chinese Australian journalist who was convicted on murky espionage charges and detained in China for three years has returned to Australia, Prime Minister Anthony Albanese said Wednesday.",
      "publishedAt": "2023-10-11T06:07:58Z",
      "title": "A Chinese Australian journalist detained for 3 years in China returns to Australia",
      "url": "https://apnews.com/77a5cbd984fcc38749af62d72b245840",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/559536e227d94bc084ce0c4f1727d186/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Olympic gymnastics champion Mary Lou Retton has pneumonia and is in intensive care in a Texas hospital.Retton's daughter, McKenna Kelley, shared Retton's condition in an Instagram post on Tuesday.",
      "publishedAt": "2023-10-11T00:01:57Z",
      "title": "Olympic gymnastics champion Mary Lou Retton is in intensive care with pneumonia",
      "url": "https://apnews.com/bb2220659b047242bb8ff9e5e067106a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dddf3589c7bd43feaf041faad4940c48/2154.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}