{
  "articles": [
    {
      "author": "CAROLYN THOMPSON, JEFF AMY and CALVIN WOODWARD",
      "description": "Shortly after taking the stage 91 minutes late for his Atlanta rally this week, Donald Trump did what he can't help doing — go off on a tangent. This was clearly going to be a night at the improv.",
      "publishedAt": "2024-10-17T04:03:28Z",
      "title": "Harris and Trump say America tanks if they lose. So why the exuberance at their rallies?",
      "url": "https://apnews.com/92d8be2d5e5a45a6bec105efed6364cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8adbb406e414457d81b25752481c9ff9/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and WILL WEISSERT",
      "description": "MILWAUKEE (AP) — With three weeks left in the presidential campaign, Democrat Kamala Harris is spending most of her days trying to shore up support in the “blue wall” states of Pennsylvania, Michigan and Wisconsin as she tries to avoid a repeat of Hillary Clinton’s collapse there eight years ago.",
      "publishedAt": "2024-10-17T04:10:24Z",
      "title": "With time running out, Harris keeps focus on 'blue wall' states",
      "url": "https://apnews.com/479ad508d075b27f141312e21b4fc081",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37249d4d36ff4efebb8802c632ff8ece/3000.jpeg"
    },
    {
      "author": "MOHAMMAD ZAATARI, KAREEM CHEHAYEB, and SALLY ABOU ALJOUD",
      "description": "QANA, Lebanon (AP) — Israeli airstrikes pounded areas across Lebanon, killing at least 27 people over the past 24 hours, officials said Wednesday, including more than a dozen in a southern town where Israeli bombardments in previous conflicts are seared into local memory.",
      "publishedAt": "2024-10-16T06:10:50Z",
      "title": "Israeli strikes kill 27 in Lebanon, including in a town with a dark history of civilian deaths",
      "url": "https://apnews.com/f18b2e0f5e05eb11a3c2ee29c16ed867",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee4182eb775347f485ea43c401c91d6b/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The top U.N. humanitarian official accused Israel on Wednesday of blocking the delivery of desperately needed aid to Gaza, and the U.S. ambassador demanded that its government step up efforts to tackle the Palestinian territory’s ”intolerable and catastrophic humanitarian crisis.”",
      "publishedAt": "2024-10-16T22:40:37Z",
      "title": "Israel pressured by UN and US to step up action to tackle Gaza's escalating humanitarian crisis",
      "url": "https://apnews.com/c4c862ad3cc12df57935153f3244208c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0d9cfdbc3b24467ad75fc5d4dfbfb86/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — U.S. long-range B-2 stealth bombers launched airstrikes early Thursday morning targeting underground bunkers used by Yemen's Houthi rebels, officials said.",
      "publishedAt": "2024-10-17T03:18:47Z",
      "title": "US long-range B-2 stealth bombers target underground bunkers of Yemen's Houthi rebels",
      "url": "https://apnews.com/99721f7f952d66d6da27e24dc3c189c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c56bcecb080e4c939da04536ccfe4402/2700.jpeg"
    },
    {
      "author": "ISABEL DEBRE and KAITLYN HUAMANI",
      "description": "BUENOS AIRES, Argentina (AP) — Former One Direction singer Liam Payne, 31, whose chart-topping British boy band generated a global following of swooning fans, was found dead Wednesday after falling from a hotel balcony in Buenos Aires, local officials said.",
      "publishedAt": "2024-10-16T21:58:04Z",
      "title": "Liam Payne, former One Direction member, dies at 31 in Argentina hotel fall",
      "url": "https://apnews.com/6b7893a56e0d8701096775f611399dd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d54cf35978c47e0a1a452b163558c3c/1920.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — The Archdiocese of Los Angeles has agreed to pay $880 million to victims of clergy sexual abuse dating back decades, in what an attorney said was the largest single child sex abuse settlement with a Catholic archdiocese, it was announced Wednesday.",
      "publishedAt": "2024-10-17T02:30:11Z",
      "title": "Archdiocese of Los Angeles agrees to pay $880 million to victims of clergy sexual abuse",
      "url": "https://apnews.com/bf23e8967410017c036f765bb83910f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9dc95c728656412b93b9b3d641e4041c/1784.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A Georgia judge has declared that seven new election rules recently passed by the State Election Board are “illegal, unconstitutional and void.”Fulton County Superior Court Judge Thomas Cox issued the order Wednesday after holding a hearing on challenges to the rules.",
      "publishedAt": "2024-10-16T19:03:06Z",
      "title": "Judge invalidates election rules passed by Trump-backed board in Georgia",
      "url": "https://apnews.com/e24b1e6ecbdb44d97f81c91a4238d579",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/091cf2bccadd4bb1a2f2b71ad877fcaf/3000.jpeg"
    },
    {
      "author": "AYAKA MCGILL",
      "description": "KAMIMOMI, Japan (AP) — In the remote village of Kamimomi in Japan’s western Okayama prefecture, a small group of rice farmers began their most recent harvest in sweltering heat, two weeks sooner than usual.",
      "publishedAt": "2024-10-17T03:09:13Z",
      "title": "Aging farmers face extreme temperatures as they struggle to maintain Japan's rice crop",
      "url": "https://apnews.com/a569237462e65426587d48876145e825",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d0a4912cc2041d0add590be39781b13/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Prime Minister Justin Trudeau said Wednesday that Canada's national police force went public with its allegations against Indian diplomats this week because it had to disrupt violent acts in Canada including drive-by-shootings, extortions and even murder.",
      "publishedAt": "2024-10-16T19:35:35Z",
      "title": "Trudeau says Canadian police went public with Indian diplomat allegations to prevent more violence",
      "url": "https://apnews.com/80e9a0d43faa7db99781563434d0f1e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdb1cb4306fa45448cde7e92615e2d06/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}