{
  "articles": [
    {
      "author": null,
      "description": "The Senate is slogging through an overnight session as Republican leaders search for ways to secure support for President Donald Trump’s big bill of tax breaks and spending cuts. For almost 18 hours the Senate has been in what's called vote-a-rama, fending off proposed amendments mostly from Democrats trying to defeat the package. Senate Majority Leader John Thune of South Dakota is working to strike a last-minute agreement between Republicans worried the bill’s reductions to Medicaid will leave millions without care and his conservative flank seeking steeper cuts to hold down deficits ballooning with the tax cuts. Trump urged them on in a midnight social media post.",
      "publishedAt": "2025-07-01T06:50:57Z",
      "title": "Senate Republicans seek support for Trump’s big bill in overnight session",
      "url": "https://apnews.com/article/congress-tax-cuts-trump-big-bill-bf3f94471b13db3e5d50f0cd1f8fe793",
      "urlToImage": "https://dims.apnews.com/dims4/default/aec4038/2147483647/strip/true/crop/4721x2656+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F53%2Fa7888428f4914c2efaa988a84b6d%2F9cd159c826b24f5f8d70765ee4132785"
    },
    {
      "author": null,
      "description": "Elon Musk’s feud with President Donald Trump has reignited, with the tech billionaire threatening to launch a new political party and Trump suggesting Musk could be punished for his opposition. The dispute has laid bare not only the differences between the Republican president and one of his most vociferous one-time advocates, but also has reignited the possibility that the world’s richest man will — along with his billions — reenter the political spending arena. Musk, Trump's former Department Of Government Efficiency chief, lashed out multiple times at Republicans for backing Trump’s tax cuts bill, calling the GOP “the PORKY PIG PARTY!!” for including a provision that would raise the nation’s debt limit by $5 trillion and calling the bill “political suicide” for Republicans.",
      "publishedAt": "2025-07-01T14:06:02Z",
      "title": "Musk and Trump feud reignites over tax cuts and spending bill",
      "url": "https://apnews.com/article/elon-musk-donald-trump-election-massie-a690566ca5140ca47cb7a993d41774e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/beca9f1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fb2%2F74eb68dceeafcfd879901e7b7fde%2F345e79d84d2c442aa0422ac3f15ad382"
    },
    {
      "author": null,
      "description": "Iran is assessing the damage and lashing out over the American and Israeli airstrikes that damaged its nuclear sites. But the Iranian government kept open the possibility Tuesday of resuming talks with the Washington over its atomic program. The comments by government spokesperson Fatemeh Mohajerani also included another acknowledgment that the American strikes at key sites within Iran’s program had been “seriously damaged” by the bombing. Iran’s state-run IRNA news agency quoted Mohajerani as making the remarks at a briefing for journalists.",
      "publishedAt": "2025-07-01T12:26:08Z",
      "title": "Iran assesses damage after Israel and US strikes",
      "url": "https://apnews.com/article/mideast-wars-iran-satellite-photos-nuclear-sites-us-da82442dd4d526e69a4f1e77a72f3dfd",
      "urlToImage": "https://dims.apnews.com/dims4/default/94980e3/2147483647/strip/true/crop/5000x2813+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fb2%2Fb76d6aeb3b1415792ad560a90057%2F8002dafbac91484a8c0c9b5a4b29ffe7"
    },
    {
      "author": null,
      "description": "Jimmy Swaggart, the televangelist whose multimillion-dollar ministry was crippled by his encounters with prostitutes, has died. He was 90. His death was announced Tuesday. The Louisiana native was best known for being a captivating Pentecostal preacher with a massive following before being caught on camera with a prostitute in New Orleans in 1988, one of several TV preachers brought down in the 1980s and ’90s by sex scandals. He continued preaching for decades, but with a reduced audience. In a tearful 1988 sermon, he wept and apologized, telling parishioners across the nation, “I have sinned against you.”",
      "publishedAt": "2025-07-01T15:24:44Z",
      "title": "Televangelist Jimmy Swaggart dies at 90",
      "url": "https://apnews.com/article/jimmy-swaggart-dies-obituary-ae4b9f551dc141cc820437ab7c194766",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c3c602/2147483647/strip/true/crop/2998x1686+0+148/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F8d%2Fa4623702bc8b1dc7379da893ae95%2F4e60d7338d7241368d7224663ece667d"
    },
    {
      "author": null,
      "description": "Attorney General Pam Bondi’s comments about evidence the Justice Department is reviewing from its Jeffrey Epstein sex trafficking investigation have fueled anticipation about the expected release of more files related to the New York financier. But weeks after Bondi’s claim about “tens of thousands” of Epstein videos, it's unclear what she was referring to. The Associated Press spoke with lawyers and law enforcement officials in criminal cases of Epstein and ex-girlfriend Ghislaine Maxwell who said they hadn’t seen and didn’t know of recordings like what Bondi described. One of Maxwell's lawyers says salacious videos of Epstein with children never surfaced. The department has declined AP requests to speak with officials overseeing the Epstein review.",
      "publishedAt": "2025-07-01T11:21:32Z",
      "title": "Mystery about Epstein files after Bondi cites 'tens of thousands' of videos",
      "url": "https://apnews.com/article/justice-department-jeffrey-epstein-pam-bondi-trump-fa39193d5b5ff91970428bf077a5ce44",
      "urlToImage": "https://dims.apnews.com/dims4/default/623f1d3/2147483647/strip/true/crop/5076x2855+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F30%2Fdb31f06393be93deaa40f7467193%2F4b8e111561104bbd85cd54aa9f410507"
    },
    {
      "author": null,
      "description": "Officials say a Ukrainian drone has struck an industrial plant deep inside Russia, injuring several people and causing a fire. Ukrainian officials say the plant produces drones and air defense systems. The attack Tuesday came as Ukraine prioritizes drone development to counter Russia's expanded drone attacks. Both nations are ramping up drone capabilities, turning the war into a testing ground for advanced unmanned weaponry. In June, Russia launched a record 5,438 drones at Ukraine, according to data collated by The Associated Press. Ukraine has been using long-range drones to target Russian facilities deep inside its territory. Meanwhile, Russian drones struck a large southern Ukrainian city, leaving many without power.",
      "publishedAt": "2025-07-01T10:05:20Z",
      "title": "Ukrainian drone strikes a Russian plant",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-c1aa7c5ce5deb89a4654cd41af6a5ec9",
      "urlToImage": "https://dims.apnews.com/dims4/default/c45bc03/2147483647/strip/true/crop/6250x3516+0+326/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F66%2Fe2c6b29b056e3a1063f24c950356%2Fcbf4124f0e5349ea85b0d47216e0e58b"
    },
    {
      "author": null,
      "description": "President Donald Trump says migrants would need to know “how to run away from an alligator” to flee the new detention center he’s visiting in a remote area of the Florida Everglades. Trump is heading there on Tuesday for a firsthand look at a facility the White House suggests will be especially secure given its dangerous natural surroundings. The detention center has been assembled on an isolated airstrip. It has drawn protests over the potential impact on a delicate ecosystem and for a potentially cruel message the Republican president is trying to send to immigrants. A key selling point for the White House is the site’s remoteness.",
      "publishedAt": "2025-07-01T04:02:41Z",
      "title": "Trump will visit immigration detention site in the Florida Everglades",
      "url": "https://apnews.com/article/trump-everglades-immigrant-detention-facility-visit-5dc5568ec15534947c29c9149b773d1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5dd2f0c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F9a%2Fca00cc65c22b50557ebc40a006d6%2Ff53e6a8a1368429ba86b76a1565624de"
    },
    {
      "author": null,
      "description": "The jury deliberating at Sean “Diddy” Combs’ sex trafficking trial has asked to review critical testimony from one of the prosecution’s most important witnesses: the hip-hop mogul’s former longtime girlfriend Cassie. Jurors requested the testimony on Tuesday about 75 minutes into their second day of weighing charges that Combs used his fame, wealth and violence to force two girlfriends into drug-fueled sex marathons with male sex workers known as “freak-offs” or “hotel nights.” Among the requests: the panel of eight men and four women asked for Cassie’s account of Combs beating, kicking and dragging her at a Los Angeles hotel in 2016 — an assault captured on now-infamous security camera footage.",
      "publishedAt": "2025-07-01T04:05:34Z",
      "title": "Jury at Sean 'Diddy' Combs' sex trafficking trial asks for review of Cassie's testimony",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-jury-deliberations-25c62300cae33ca9f18aee28788449b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d03410e/2147483647/strip/true/crop/4905x2759+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F80%2F09a6b0c1f96f0fd7919de74d9b2f%2Feac8d5a12d124ca885a751f871fa203c"
    },
    {
      "author": null,
      "description": "Hurricane Flossie has strengthened to a Category 2 storm off Mexico's Pacific coast. The National Hurricane Center reports the storm has maximum sustained winds of 100 mph. It was located Tuesday morning 150 miles southwest of Manzanillo, Mexico. Rain is currently affecting parts of the coastal region. Flossie is moving northwest at 10 mph and is expected to continue in that direction. Forecasters say the hurricane should move away from southwestern Mexico by Tuesday night. Flossie is expected to continue strengthening and become a major hurricane as soon as Tuesday night.",
      "publishedAt": "2025-07-01T14:55:39Z",
      "title": "Hurricane Flossie is now a Category 2 off the Pacific coast of Mexico",
      "url": "https://apnews.com/article/flossie-hurricane-mexico-pacific-coast-e823678edfb77c9301f1cea36637538d",
      "urlToImage": "https://dims.apnews.com/dims4/default/a704541/2147483647/strip/true/crop/2995x1685+0+670/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fe5%2F8964bd6b1db4327fd1e7013d2aee%2Fa0c712bf932c4181b8b7ea563433b694"
    },
    {
      "author": null,
      "description": "Federal Reserve Chair Jerome Powell is sticking to his position that the central bank will keep its key rate on hold while it waits to see how President Donald Trump’s tariffs effect the economy, defying the steady stream of criticism from the White House, which wants lower borrowing costs. Powell repeated his view Tuesday that U.S. inflation is likely to pick up later this summer, though he acknowledged that the timing and magnitude of any price increase from the duties is uncertain. But he said the Fed will stay on hold while it evaluates how the economy evolves.",
      "publishedAt": "2025-07-01T14:15:38Z",
      "title": "Powell stands by 'wait and see' stance with Trump ramping up attacks on the Federal Reserve",
      "url": "https://apnews.com/article/inflation-economy-federal-reserve-4821bb5d0baa9980c4c69ab26fab3ab4",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef55a31/2147483647/strip/true/crop/5831x3280+0+192/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2Fba%2F254afb41584502e6460a601ee3dc%2F23c668a38c3746a78676f67b8c706210"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}