{
  "articles": [
    {
      "author": "FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The stunning removal of Kevin McCarthy as speaker has left the House adrift as Republicans struggle to bring order to their fractured majority and begin the difficult and potentially prolonged process of uniting around a new leader.",
      "publishedAt": "2023-10-04T17:59:06Z",
      "title": "McCarthy's ouster leaves the House adrift as divided Republicans seek to unite behind a new leader",
      "url": "https://apnews.com/9b244d42f60eaccc94befcc1ba9d2985",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98373609cf564041a4d98032bcc3d846/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, BOBBY CAINA CALVAN and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The fraud trial that could block former President Donald Trump from doing business in New York drilled down Wednesday into the question of who — his company or hired accountants — bore responsibility for financial statements that the state calls fraudulent.",
      "publishedAt": "2023-10-04T14:29:55Z",
      "title": "Trump back in court as fraud trial probes who was responsible for his financial statements",
      "url": "https://apnews.com/9ee06080d60671e09269ccd724c420e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9159e72e3b9b4dbba2395d331bd12753/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "After a summer of record-smashing heat, warming somehow got even worse in September as Earth set a new mark for how far above normal temperatures were, the European climate agency reported Thursday.",
      "publishedAt": "2023-10-05T02:28:50Z",
      "title": "September sizzled to records and was so much warmer than average scientists call it 'mind-blowing'",
      "url": "https://apnews.com/1d80d23b98efd62d20b79f83619dfb82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e1de26dd3d3430d953ef1751ad25e5f/3000.jpeg"
    },
    {
      "author": null,
      "description": "HOLYOKE, Mass. (AP) — A shooting claimed the life of a baby that was delivered after its mother was one of several people hit by gunfire during a fight Wednesday on a downtown street in the western Massachusetts city of Holyoke, authorities said.",
      "publishedAt": "2023-10-04T19:15:10Z",
      "title": "Massachusetts shooting claims life of baby delivered after mother was one of several hit by gunfire",
      "url": "https://apnews.com/33202c5752f8df81552488da94f87386",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02d3b99ab8074d6ebf3a2ce54373a5f5/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — The Biden administration announced they waived 26 federal laws in South Texas to allow border wall construction on Wednesday, marking the administration’s first use of a sweeping executive power employed often during the Trump presidency.",
      "publishedAt": "2023-10-04T22:48:03Z",
      "title": "Biden administration waives 26 federal laws to allow border wall construction in South Texas",
      "url": "https://apnews.com/147d7ab497e6991e9ea929242f21ceb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/821f8882404b458ea625caab543da615/3000.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — Mourners streamed into San Francisco City Hall on Wednesday to pay their respects to the late U.S. Sen. Dianne Feinstein, honoring her as fearless, smart and the glue who kept the city together after two political assassinations that catapulted her into the mayor’s office and the national spotlight.",
      "publishedAt": "2023-10-04T04:06:58Z",
      "title": "Tearful mourners line up at San Francisco City Hall to thank, pay last respects to Dianne Feinstein",
      "url": "https://apnews.com/b96c95c0255d703ac20217f6f063cb04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5e22562c5b14fb287c2c41ce0e0ef7d/3000.jpeg"
    },
    {
      "author": "RIO YAMAT and KEN RITTER",
      "description": "LAS VEGAS (AP) — A self-described gangster who police and prosecutors say masterminded the 1996 shooting death of Tupac Shakur in Las Vegas made his first court appearance Wednesday on a murder charge.",
      "publishedAt": "2023-10-04T04:04:54Z",
      "title": "Suspect charged in rapper Tupac Shakur's fatal shooting makes first court appearance in Las Vegas",
      "url": "https://apnews.com/8568b1a49ee46aae0a737f8a30376004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/854b6f69efc943f9ae9e85de5dc756f9/1920.jpeg"
    },
    {
      "author": "DEVI SHASTRI",
      "description": "It's the end of an era for a once-critical pandemic document: The ubiquitous white COVID-19 vaccination cards are being phased out. Now that COVID-19 vaccines are not being distributed by the federal government, the U.S.",
      "publishedAt": "2023-10-04T18:21:05Z",
      "title": "Say goodbye to the COVID-19 vaccination card. The CDC has stopped printing them",
      "url": "https://apnews.com/a70eb7f3f32b961eae1a7bf69175ad11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f76211e4c5d4a1d89f23feaf8dc697c/3000.jpeg"
    },
    {
      "author": "KEN SWEET and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Splashy advertisements featuring football star Tom Brady and comedian Larry David were among the first evidence seen by jurors Wednesday as prosecutors launched a historic fraud case against cryptocurrency maven Sam Bankman-Fried, depicting him as a villain who portrayed himself as the Robin Hood of the crypto world.",
      "publishedAt": "2023-10-04T14:41:46Z",
      "title": "Jury sees FTX ads with Tom Brady, Larry David, as fraud case is rolled out against Sam Bankman-Fried",
      "url": "https://apnews.com/73fcde97d56f33f4bd4b3ba7f9c3c9bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e15bdd40cc7d4e339c06b3c7e185e9ff/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "PHILADELPHIA (AP) — Bryson Stott hit a grand slam, Aaron Nola pitched seven scoreless innings and the Philadelphia Phillies beat the Miami Marlins 7-1 on Wednesday night for a two-game sweep of their NL Wild Card Series.",
      "publishedAt": "2023-10-04T22:34:05Z",
      "title": "Bryson Stott's grand slam helps Phillies beat Marlins 7-1 for postseason sweep",
      "url": "https://apnews.com/7711a8ff8f3f9a59e31de4de05051700",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99e6f3700b1448af8434dde73fdaf048/2375.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}