{
  "articles": [
    {
      "author": "Ty ONeil",
      "description": "Authorities investigating the apparent kidnapping of the mother of “Today” show host Savannah Guthrie have returned to the 84-year-old's Arizona neighborhood several times over the weekend. There’s still no word on whether Nancy Guthrie is alive, and authorities say they have no suspects connected to the case. Her purported abductors sent ransom notes with a Monday deadline demanding money for her return. Savannah Guthrie says the family is prepared to pay. Investigators say they believe Nancy Guthrie was taken from her home against her will on Jan. 31, and there are growing concerns about her health because she needs daily medication.",
      "publishedAt": "2026-02-09T15:50:14Z",
      "title": "Nancy Guthrie search moves into a second week as ransom deadline nears",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-ransom-deadline-arizona-3977f842fd3d1fd66952d1d763944b9d",
      "urlToImage": "https://dims.apnews.com/dims4/default/95ef6d9/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F1d%2F8d80289c3928906eb2612009c4a4%2Fbba86996fd22457fb42ee36510a1ff48"
    },
    {
      "author": "Stephen Groves",
      "description": "House lawmakers tried to interview Ghislaine Maxwell, but the former girlfriend and confidant of Jeffrey Epstein invoked her Fifth Amendment rights to avoid answering questions that would be incriminating. An attorney for Maxwell also told lawmakers that if President Donald Trump ended her prison sentence, she would be willing to testify that neither Trump nor former President Bill Clinton were culpable for wrongdoing in their relationships with Epstein, according to both Democratic and Republican lawmakers who exited the closed-door meeting. The House Oversight Committee had wanted Maxwell to answer questions during a video call to the federal prison camp in Texas where she’s serving a 20-year sentence for sex trafficking",
      "publishedAt": "2026-02-09T15:35:15Z",
      "title": "Ghislaine Maxwell declined to answer questions from a House committee, citing 5th Amendment rights",
      "url": "https://apnews.com/article/jeffrey-epstein-ghislaine-maxwell-congress-f1e947bb9128aaa626390f0987f322e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8bf41f/2147483647/strip/true/crop/5555x3701+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2Faf%2F9d8726535640c60f9918853c353d%2Fa14ef01638b84fe785135393a3017663"
    },
    {
      "author": "Danica Kirka",
      "description": "Buckingham Palace says King Charles III will “support’’ UK police assessing reports that the former Prince Andrew gave confidential information to convicted sex offender Jeffrey Epstein. The statement came after police said they were examining reports that the former prince, now known as Andrew Mountbatten-Windsor, sent trade reports to Epstein in 2010. Thames Valley Police, which serves areas west of London, including the ex-royal’s former home in Windsor, launched the inquiry after news organizations reported on emails that suggest the then-prince sent Epstein reports from a 2010 tour of Southeast Asia he took as Britain’s envoy for international trade.",
      "publishedAt": "2026-02-09T09:16:18Z",
      "title": "Palace says King Charles III will 'support' police looking into former Prince Andrew",
      "url": "https://apnews.com/article/britain-epstein-andrew-royals-william-0d3b16798b32ebd1d98b72d209769105",
      "urlToImage": "https://dims.apnews.com/dims4/default/e68d3c8/2147483647/strip/true/crop/5906x3935+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F1a%2F03eada37b49ac59df2e4215114b3%2Fd91d7c36a5d743e895513a65c8f7ee01"
    },
    {
      "author": "Mary Clare Jalonick, Kevin Freking, Seung Min Kim",
      "description": "Democrats have begun tentative talks with the White House on their demands for “dramatic” new restrictions on President Donald Trump’s immigration crackdown. The talks come just days before funding for the Department of Homeland Security is set to expire. Senate Democratic Leader Chuck Schumer said Monday that Democrats have sent Republicans their list of demands for Immigration and Customs Enforcement and other federal law enforcement agencies. Among the demands are a requirement for judicial warrants, better identification of DHS officers, new use-of-force standards and a stop to racial profiling. Homeland Security funding expires Saturday.",
      "publishedAt": "2026-02-09T23:42:47Z",
      "title": "Democrats and White House discuss Homeland Security funding",
      "url": "https://apnews.com/article/government-shutdown-homeland-security-ice-funding-0a22618791cb6d0aac4d763a87fc1d4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7be6cd0/2147483647/strip/true/crop/3212x2140+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2Fc7%2Ffc09ae73a40795864afc9e5627b6%2Fdb72da265c09489893106e222fddc4b8"
    },
    {
      "author": "Kaitlyn Huamani, Barbara Ortutay",
      "description": "The world’s biggest social media companies face several landmark trials this year that seek to hold them responsible for harms to children who use their platforms. Opening arguments for the first, in Los Angeles County Superior Court, begin this week. Instagram parent company Meta and Google’s YouTube will face claims that their platforms deliberately addict and harm children. TikTok and Snap, which were originally named in the lawsuit, settled for undisclosed sums. This case marks the first time the companies will argue their case before a jury, and the outcome could have profound effects on their businesses and how they will handle children using their platforms.",
      "publishedAt": "2026-02-09T06:00:08Z",
      "title": "Arguments to begin in landmark social media addiction trial set in Los Angeles",
      "url": "https://apnews.com/article/meta-instagram-youtube-social-media-addiction-los-angeles-1b409b31438e5ba46e2e8c064229b51a",
      "urlToImage": "https://dims.apnews.com/dims4/default/359b785/2147483647/strip/true/crop/6362x4239+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F3f%2F426dc48e71339c47d349ebbf7db8%2F0756b1832a88491585f86e6574ec8f6c"
    },
    {
      "author": "Konstantin Toropin",
      "description": "The U.S. Navy’s top uniformed officer has introduced his vision for the Navy's future, focusing on using smaller and newer assets instead of consistently turning to huge aircraft carriers. Adm. Daryl Caudle’s strategy aims to create more flexible and tailored groups of ships and equipment. It comes as the Trump administration has moved aircraft carriers to crisis regions, often disrupting deployment plans and putting increasing strain on vessels and equipment that are already facing mounting maintenance issues. Caudle tells The Associated Press that the Navy's presence in regions like the Caribbean can be leaner and better tailored to actual threats, using smaller combat ships, helicopters and drones instead of destroyers and aircraft carriers.",
      "publishedAt": "2026-02-09T23:32:05Z",
      "title": "Navy leader touts new strategy that moves away from aircraft carriers",
      "url": "https://apnews.com/article/navy-aircraft-carriers-military-strategy-eda233a4dd0055695fa6d92ccc7c0d05",
      "urlToImage": "https://dims.apnews.com/dims4/default/31062fb/2147483647/strip/true/crop/5057x3370+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F6e%2Fd050b9fee1227aa00d0d7357eddd%2Fea52993f17f54dc8898b4d25dbe8d6ce"
    },
    {
      "author": null,
      "description": "Federal authorities have denied attempting to expedite an end to asylum claims for the family of a 5-year-old boy who was detained with his father during the immigration crackdown that has shaken the Minneapolis area. Images of Liam Conejo Ramos wearing a bunny hat and Spider-Man backpack surrounded by immigration officers stirred outrage over the crackdown. Danielle Molliver, a lawyer for the boy and his father, told the New York Times that the government’s attempts to expedite the deportation proceedings “extraordinary” and possibly “retaliatory.\" The government denied targeting the family, with Homeland Security official Tricia McLaughlin saying “these are regular removal proceedings.”",
      "publishedAt": "2026-02-09T15:55:06Z",
      "title": "Officials deny seeking end to asylum claims for family of 5-year-old Liam Conejo Ramos",
      "url": "https://apnews.com/article/minnesota-immigration-liam-conejo-ramos-bc2bfa67e73dc73ba3f391d109e7597c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e96805/2147483647/strip/true/crop/1536x1023+0+41/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F6c%2F193a4103f7ee7d6419da6c99b451%2F8639462d3c80406883929c3a8c3628b1"
    },
    {
      "author": "Philip Marcelo, Jennifer Peltz",
      "description": "Nurses and two major hospital systems in New York City have reached a deal to end a nearly monthlong strike over staffing levels, workplace safety and other issues. The tentative agreement announced Monday involves Montefiore and Mount Sinai hospital systems. Nurses remain on strike at NewYork Presbyterian. The walkout began Jan. 12. The hospitals scrambled to hire legions of temporary nurses to fill in during a demanding flu season. Mount Sinai alone hired 1,400 temporary nurses. The three-year deal, which still needs to be approved by union members, affects roughly 10,500 of the some 15,000 nurses on strike at some of the city’s biggest private, nonprofit hospitals.",
      "publishedAt": "2026-02-09T16:04:36Z",
      "title": "NYC nurses reach deal to end strike at Montefiore and Mount Sinai",
      "url": "https://apnews.com/article/nursing-strike-nyc-hospitals-agreement-0d837a65f5f3d74ea73eceeea89c2e74",
      "urlToImage": "https://dims.apnews.com/dims4/default/1129d74/2147483647/strip/true/crop/5445x3628+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Faa%2Ffa2d58622d8283ab9e6406082738%2F9172d48c735840268cc2afcaaa64ad21"
    },
    {
      "author": "Kanis Leung",
      "description": "A massive fire in Hong Kong last November killed 168 people, devastating a tight-knit community. Residents displaced by the blaze remain uncertain whether they can visit their burnt apartments or when they can secure permanent housing. Authorities blamed substandard materials for the rapid spread of the fire and are still investigating. Many victims are in temporary housing and long for answers. Others mourn lost loved ones and seek transparency from officials. As the Lunar New Year approaches, families face difficult decisions about resettlement and the loss of cherished memories.",
      "publishedAt": "2026-02-09T23:00:35Z",
      "title": "Hong Kong survivors of fire at Wang Fuk Court await resettlement plans",
      "url": "https://apnews.com/article/hong-kong-resettlement-fire-tai-po-2caedfdaee6f9460351e257cdcaeef1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/303de7a/2147483647/strip/true/crop/4500x2998+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2Feb%2Fe1b420880cd4606ad01f8177fc5f%2F7cba83e00a1a4eb49c26ee146aec9e21"
    },
    {
      "author": "Andrew Dampf",
      "description": "Lindsey Vonn's father says she will no longer race if he has any say. The American skiing superstar broke her leg in the Olympics downhill over the weekend. Alan Kildow, Vonn's father, spoke to The Associated Press on Monday. He said Vonn, who is 41, will not return to the Olympics. Vonn is recovering in a Treviso hospital after her fall and helicopter evacuation on Sunday. Kildow declined to discuss her injuries but praised her strength. The hospital stated Vonn had surgery on her left leg and is in stable condition. Her family remains by her side.",
      "publishedAt": "2026-02-09T18:47:24Z",
      "title": "Lindsey Vonn's father says her Olympic crash marks 'the end of her career'",
      "url": "https://apnews.com/article/lindsey-vonns-father-olympics-crash-e8d93eccc6858f62d4da8993505da018",
      "urlToImage": "https://dims.apnews.com/dims4/default/58f8f3d/2147483647/strip/true/crop/5901x3932+0+303/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F2c%2F7a27c34e1103a973284d60fc7adb%2F9dc98915a45b4f36b841487205a0aa0d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}