{
  "articles": [
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — Donald Trump's first picks for immigration policy jobs spent the last four years angling for this moment.Stephen Miller and Thomas Homan had critical roles in the first Trump administration and are unapologetic defenders of its policies, which included separating thousands of parents from their children at the border to deter illegal crossings.",
      "publishedAt": "2024-11-12T05:06:55Z",
      "title": "A pair of Trump officials have defended family separation and ramped-up deportations",
      "url": "https://apnews.com/abb1a75497d11c978c369cb20016eecb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/516759f4b2af40e0aefc305c1d9937b3/1642.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A judge is due to decide Tuesday whether to undo President-elect Donald Trump’s conviction in his hush money case because of a U.S.",
      "publishedAt": "2024-11-12T05:22:48Z",
      "title": "Judge set to rule on whether to scrap Trump's conviction in hush money case",
      "url": "https://apnews.com/1b555b96443f38d35e995b8b4853a32c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7a71f3a14da4c19bd8c6ae0a10814b2/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel has failed to meet U.S. demands to allow greater humanitarian access to the Gaza Strip, where conditions are worse than at any point in the 13-month-old war, international aid organizations said Tuesday.",
      "publishedAt": "2024-11-12T07:24:40Z",
      "title": "Aid groups say Israel misses US deadline to boost humanitarian help for Gaza",
      "url": "https://apnews.com/48cd09c1c007cacd6d7a309589490320",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f33c02463424cdd9621ecd75888569e/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes hit a cafeteria and a home in Gaza, killing at least 14 people, medical officials said. In Lebanon, warplanes struck the capital Beirut’s southern suburbs on Tuesday after the military ordered a number of houses there to evacuate.",
      "publishedAt": "2024-11-12T06:46:27Z",
      "title": "Israeli strikes set off explosions in Beirut suburbs and kill 14 Palestinians in Gaza, medics say",
      "url": "https://apnews.com/095148946dcc1d0dcb75cbd423b1be3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ca5e09b38ef4f5f86c25f97139297fa/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korea ratified a major defense treaty with Russia stipulating mutual military aid, the North’s state media reported Tuesday, as the U.S., South Korea and Ukraine say North Korea has sent thousands of troops to Russia to support its war against Ukraine.",
      "publishedAt": "2024-11-12T03:06:11Z",
      "title": "North Korea ratifies major defense treaty with Russia",
      "url": "https://apnews.com/059d73e4c3492c19b555476b2fb45ca9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11113c76bd0940ba81413e53b206df44/3000.jpeg"
    },
    {
      "author": "EVENS SANON and MEGAN JANETSKY",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haiti’s international airport shut down on Monday after gangs opened fire at a commercial flight landing in Port-Au-Prince, prompting some airlines to temporarily suspend operations as the country swore in a new interim prime minister who promised to restore peace.",
      "publishedAt": "2024-11-11T19:30:56Z",
      "title": "Haiti’s main airport shuts down as gang violence surges and a new prime minister is sworn in",
      "url": "https://apnews.com/5a8a96a179f26fb6cde1265483e5f4b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aabf148000e64819a87209887149f25c/1920.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Congress returns to a changed Washington as President-elect Donald Trump’s hard-right agenda is quickly taking shape, buoyed by eager Republican allies eyeing a full sweep of power on Capitol Hill while Democrats are sorting out what went wrong.",
      "publishedAt": "2024-11-12T05:10:44Z",
      "title": "Congress returns to unfinished business and a new Trump era",
      "url": "https://apnews.com/82730f474a365a0d6e6af78a84bceda7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45829a687efe49cc8c2411534a71681f/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — Democrat Ruben Gallego has been elected Arizona’s first Latino U.S. senator, defeating Republican Kari Lake and preventing Republicans from further padding their Senate majority.",
      "publishedAt": "2024-11-12T04:54:01Z",
      "title": "Democrat Ruben Gallego wins Arizona US Senate race against Republican Kari Lake",
      "url": "https://apnews.com/ea364326c93f9a8a32b7b9ca7ca696d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bb75dbc074c45c6bdefff60da0434f9/3000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — Hundreds of survivors of abuse in state, foster and faith-based care arrived at New Zealand's Parliament in Wellington on Tuesday, each representing thousands more.",
      "publishedAt": "2024-11-12T07:49:37Z",
      "title": "'A hollow and limited apology.' New Zealand survivors of abuse in care speak in their own words",
      "url": "https://apnews.com/730c80e263d01fbdebd730b6833a8ba3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5edd51c67c249c999f3f151fc8b4a5d/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "As representatives from nearly 200 countries, along with hundreds of journalists, arrived in Azerbaijan in November for the U.N. climate conference known this year as COP29, they bring with them a level of scrutiny the hosts aren't accustomed to — and don't often tolerate.",
      "publishedAt": "2024-11-12T05:24:17Z",
      "title": "Azerbaijan accused of ramping up repression of critics ahead of hosting UN climate summit",
      "url": "https://apnews.com/796f5e8c62e361e5be892c7e17959d28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55a40647478f4fe68c053a3c3ecfd2e5/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}