{
  "articles": [
    {
      "author": "ALI SWENSON and AYANNA ALEXANDER",
      "description": "NEW YORK (AP) — Donald Trump’s aggressive response to his fourth criminal indictment in five months follows a strategy he has long used against legal and political opponents: relentless attacks, often infused with language that is either overtly racist or is coded in ways that appeal to racists.",
      "publishedAt": "2023-08-22T04:05:06Z",
      "title": "How Trump's attacks on prosecutors build on history of using racist language and stereotypes",
      "url": "https://apnews.com/04b69a8f3e4873eadb03c132cdee09c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6787c9a3d4e14b0b93a45214a1bca919/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "A natural El Nino, human-caused climate change, a stubborn heat dome over the nation’s midsection and other factors cooked up Tropical Storm Hilary’s record-breaking slosh into California and Nevada, scientists figure.",
      "publishedAt": "2023-08-21T23:29:57Z",
      "title": "How a mix of natural and human-caused factors cooked up Tropical Storm Hilary's soggy mess",
      "url": "https://apnews.com/8e9d543e8b96ea6c0f47e2535123d7f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d31687acfa241babb3cbce7450b971e/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "LAHAINA, Hawaii (AP) — President Joe Biden on Monday told survivors of Hawaii’s wildfires that the nation “grieves with you” and promised that the federal government will help “for as long as it takes” Maui to recover from damage caused by the deadliest U.S.",
      "publishedAt": "2023-08-21T11:07:39Z",
      "title": "Biden says federal government will help Maui 'for as long as it takes' to recover from wildfire",
      "url": "https://apnews.com/7f3cd7b227ae397f164f0f6f9e26c9e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/783673b712e74701b2cefd6490bd0a8b/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Tennessee's Republican-led Legislature is meeting in special session this week to consider a package of public safety proposals, including some stemming from a deadly shooting at a Nashville elementary school earlier this year.",
      "publishedAt": "2023-08-22T04:09:48Z",
      "title": "Mass shootings spur divergent laws as states split between gun rights and control",
      "url": "https://apnews.com/4327496f877716d3cba3b03f149fac6b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa3b870e83e7447c82a099a1084b51ff/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — A federal appeals court ruled Monday that Alabama can enforce a ban outlawing the use of puberty blockers and hormones to treat transgender children, the second such appellate victory for gender-affirming care restrictions that have been adopted by a growing number of Republican-led states.",
      "publishedAt": "2023-08-21T21:30:39Z",
      "title": "Alabama can enforce ban on puberty blockers and hormones for transgender children, court says",
      "url": "https://apnews.com/cccb5ec40b65c3c179600d291e707afd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/087c4903d72548b59ebb22b4838e3568/3000.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BANGKOK (AP) — Divisive ex-Prime Minister Thaksin Shinawatra returned to Thailand on Tuesday after years of self-imposed exile to face possible criminal penalties on the same day that a party affiliated with him plans to start forming a new government.",
      "publishedAt": "2023-08-22T02:31:23Z",
      "title": "Divisive Thai ex-Prime Minister Thaksin returns from exile as party seeks to form new government",
      "url": "https://apnews.com/705f9e9b3c7c26dba2e3322985088d64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd49e2b8adfd4467b02228af544f335e/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Female soldiers face rampant sexism, harassment and other gender-related challenges in male dominated Army special operations units, according to a report Monday, eight years after the Pentagon opened all combat jobs to women.",
      "publishedAt": "2023-08-21T17:19:20Z",
      "title": "Female soldiers in Army special operations face rampant sexism and harassment, military report says",
      "url": "https://apnews.com/1c904cba739b8ba3720827bd9e77f5f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2dc6f5adbc7c4c56877de92f90878c5e/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — U.S. regulators on Monday approved the first RSV vaccine for pregnant women so their babies will be born with protection against the scary respiratory infection.RSV is notorious for filling hospitals with wheezing babies every fall and winter.",
      "publishedAt": "2023-08-21T21:57:00Z",
      "title": "FDA approves RSV vaccine for moms-to-be to guard their newborns",
      "url": "https://apnews.com/a0f9dfec9930b55a134fe493c73fc389",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d802bc85bdb14644a6209c35b7db61b9/3000.jpeg"
    },
    {
      "author": "DAVID RISING and SOPHENG CHEANG",
      "description": "PHNOM PENH, Cambodia (AP) — The son of longtime autocratic Cambodian leader Hun Sen was approved by Parliament on Tuesday as the country's new prime minister, part of a generational change in top positions in the Southeast Asian nation.",
      "publishedAt": "2023-08-22T01:57:48Z",
      "title": "Cambodian Parliament approves longtime leader's son as prime minister as part of generational change",
      "url": "https://apnews.com/c3ba3c6dcb065a7d17868027ab00b490",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b37d343f8aa342b48d143d60c5dfec92/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japan will start releasing treated and diluted radioactive wastewater from the Fukushima Daiichi nuclear plant into the Pacific Ocean as early as Thursday — a controversial but essential early step in the decades of work to shut down the facility 12 years after its meltdown disaster.",
      "publishedAt": "2023-08-22T01:48:45Z",
      "title": "Japan to start releasing Fukushima plant's treated radioactive water to sea as early as Thursday",
      "url": "https://apnews.com/9ba86b5761170efc762d45e901903ded",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/392eaeda76cc46bcb349acc4087b68b8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}