{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Internet and telephone services collapsed across the Gaza Strip on Thursday for lack of fuel, the main Palestinian provider said, bringing a potentially long-term blackout of communications as Israel signaled its offensive against Hamas could next target the south, where most of the population has taken refuge.",
      "publishedAt": "2023-11-16T07:42:34Z",
      "title": "Internet, phone networks collapse in Gaza, threatening to worsen humanitarian crisis",
      "url": "https://apnews.com/6c7daa3b8c3a6b8dddf186ce631dfaad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f2745933f1a4b1998593291cd181bf6/1920.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and DAVID CRARY",
      "description": "As the Israel-Hamas war rages in Gaza, there’s a bitter battle for public opinion flaring in the United States, with angry rallies on many college campuses and disruptive protests at prominent venues in several major cities.",
      "publishedAt": "2023-11-16T16:09:02Z",
      "title": "Longtime Israeli policy foes are leading US protests against Israel's action in Gaza. Who are they?",
      "url": "https://apnews.com/c94bb0cd246bcc692de86b76b9b2a8cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fbba5a27e194932a0ab92fcb991ec80/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House Ethics Committee in a scathing report Thursday said it has amassed “overwhelming evidence” of lawbreaking by Republican Rep. George Santos of New York that has been sent to the Justice Department, concluding flatly that he “cannot be trusted” after a monthslong investigation into his conduct.",
      "publishedAt": "2023-11-16T15:10:49Z",
      "title": "Rep. George Santos won't seek reelection after scathing ethics report cites evidence of lawbreaking",
      "url": "https://apnews.com/5ebffe514d8779fbc16a77fa1ab5e0df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8a37d5a4e0145fd84135ad27f260221/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — A gag order that barred Donald Trump from commenting about court personnel after he disparaged a law clerk in his New York civil fraud trial was temporarily lifted Thursday by an appellate judge who raised free speech concerns.",
      "publishedAt": "2023-11-16T20:15:17Z",
      "title": "New York judge lifts gag order that barred Donald Trump from maligning court staff in fraud trial",
      "url": "https://apnews.com/c25e51a094dbcdeffbf67589b1c07f37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e648123a7de74b1eab5ad0454e7406e9/3000.jpeg"
    },
    {
      "author": "JOHN ANTCZAK and JULIE WATSON",
      "description": "LOS ANGELES (AP) — A Southern California college professor was charged Thursday with involuntary manslaughter and battery in the death of a Jewish protester during demonstrations over the Israel-Hamas war.",
      "publishedAt": "2023-11-16T16:00:33Z",
      "title": "California professor charged with involuntary manslaughter in the death of Jewish demonstrator",
      "url": "https://apnews.com/13eb9cd0305dc0d0d822c355db7b1de6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb297f73d7bd4625aa3ff3293348c35f/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and AAMER MADHANI",
      "description": "SAN FRANCISCO (AP) — President Joe Biden on Thursday made America's case to national leaders and CEOs attending the Asia-Pacific summit that the United States is committed to high standards in trade and to partnerships that will benefit economies across the Pacific.",
      "publishedAt": "2023-11-16T05:03:01Z",
      "title": "Biden tells Asia-Pacific leaders US 'not going anywhere' as he looks to build economic ties",
      "url": "https://apnews.com/76fdd3babf4a1d6e0e27efde3969e6a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18233f9fbe474047aaa02ddc0d782ae9/1920.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ",
      "description": "SAN FRANCISCO (AP) — A jury on Thursday convicted the man who broke into former U.S. House Speaker Nancy Pelosi’s San Francisco home last year of federal charges for seeking to hold her hostage and attacking her husband with a hammer.",
      "publishedAt": "2023-11-16T19:22:59Z",
      "title": "Man who attacked Pelosi’s husband convicted of federal assault and attempted kidnapping charges",
      "url": "https://apnews.com/3e9cba213130b6db90197d17b09640fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7175bcf599614cc08ee7bb1620e49d4b/1168.jpeg"
    },
    {
      "author": "DYLAN LOVAN",
      "description": "LOUISVILLE, Ky. (AP) — Jurors failed to reach a unanimous verdict on federal civil rights charges Thursday in the trial of a former Louisville police officer charged in the police raid that killed Breonna Taylor, prompting the judge to declare a mistrial.",
      "publishedAt": "2023-11-16T22:01:20Z",
      "title": "Mistrial declared after federal jury deadlocks in trial of ex-officer in deadly Breonna Taylor raid",
      "url": "https://apnews.com/6346bbfdc0d6a522e3088dfa80d61cc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59ffa80af8b8482b8a599417dc689db9/3000.jpeg"
    },
    {
      "author": "SCOTT McFETRIDGE",
      "description": "ROSSTON, Texas (AP) — The cattle part as Meredith Ellis edges her small four-wheeler through the herd, silently counting the cows and their calves. It’s the way she starts most days on her 3,000-acre Texas ranch: ensuring all the cattle are safe, deciding when they should move to another pasture, and checking that the grass is as healthy as her animals.",
      "publishedAt": "2023-11-16T15:50:16Z",
      "title": "Beef is a way of life in Texas, but it's hard on the planet. This rancher thinks she can change that",
      "url": "https://apnews.com/9acdd8428029a83dc3c5bf71e817d425",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f8c6e5bc9024e409ac2ac0bbeff4e83/3000.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — Shohei Ohtani's injury remains mysterious. His dominance is clear.After captivating baseball with his unprecedented combination of high-level hitting and premium pitching, the two-way star became the first two-time unanimous Most Valuable Player when he won the American League honor on Thursday.",
      "publishedAt": "2023-11-16T23:34:13Z",
      "title": "Shohei Ohtani, baseball's 2-way star, becomes first 2-time unanimous MVP",
      "url": "https://apnews.com/2638ecdcef8ce75c9e72127d99cb9fd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf09816fb8994f53b2da1be2d3051ea6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}