{
  "articles": [
    {
      "author": "NATALIE MELZER and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Israeli strikes early Sunday killed 18 people in Gaza, including four who were sheltering in a tent camp for displaced Palestinians inside a hospital complex, while a stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb.",
      "publishedAt": "2024-08-04T05:44:53Z",
      "title": "Strikes on Gaza kill 18 and stabbing in Israel kills 2 as fears of wider war spike",
      "url": "https://apnews.com/5b480a3b22538edec9fa05908f28303f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f39f65da0934f65a460b31e042362a2/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and MELANIE LIDMAN",
      "description": "FARDIS, Lebanon (AP) — Alma Ayman Fakhr al-Din, a lively 11-year-old who loved basketball and learning languages, was playing on a soccer field a week ago in Majdal Shams, a Druze town in the Israeli-occupied Golan Heights, when the rocket hit.",
      "publishedAt": "2024-08-03T16:22:27Z",
      "title": "Horror at deaths of 12 children unites Druze across borders. But Mideast's wars tear at their bonds",
      "url": "https://apnews.com/cd1005be55b3893f0852e431643899bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2825540bfc640e8a81b838f830cf6d4/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — A new round of violence in Bangladesh has left more than 20 people dead and hundreds injured as student protesters clashed with police and ruling party activists on Sunday, officials and media reports said.",
      "publishedAt": "2024-08-04T09:48:56Z",
      "title": "Violence in Bangladesh leaves many people dead, hundreds injured as protests continue",
      "url": "https://apnews.com/1496d6471792cbc11f39c3bacee813f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/651da1123085400091b2852bfa04305e/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — The crowds are psyched. The campaign donations are flooding in.",
      "publishedAt": "2024-08-04T02:02:09Z",
      "title": "After smooth campaign start, Kamala Harris faces a crucial week ahead",
      "url": "https://apnews.com/65477e459afb6290467aeb57cac3b622",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4e7412c7d2f4ae2a6e1e14fdc4f02ff/3000.jpeg"
    },
    {
      "author": "BILL BARROW and MEG KINNARD",
      "description": "ATLANTA (AP) — Donald Trump picked a new fight Saturday with Georgia's Republican governor as he campaigned in the key swing state where he's looking to avenge his narrow 2020 loss — a defeat he continues to blame on GOP officials for not giving into his false theories of election fraud.",
      "publishedAt": "2024-08-03T04:06:03Z",
      "title": "Trump again tears into Georgia's Republican governor on the same day he campaigns in the state",
      "url": "https://apnews.com/b21c25bbbfafdd0343c8812f6c3d7c9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dd2bf54fd9c4b06acf334b3142dab1d/3000.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ",
      "description": "CARACAS, Venezuela (AP) — Thousands of people rallied in the streets of Venezuela's capital Saturday, waving the national flag and singing the national anthem in support of an opposition candidate they believe won the presidential election by a landslide.",
      "publishedAt": "2024-08-03T18:08:52Z",
      "title": "Opposition leader joins rally calling for Venezuela presidential election results to be overturned",
      "url": "https://apnews.com/d6e70bd88ee9511298a4850c224a12e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66f26ed4e3ca4ee09cae4e58bc5791ee/3000.jpeg"
    },
    {
      "author": null,
      "description": "MIAMI (AP) — A tropical depression strengthened into Tropical Storm Debby north of Cuba on Saturday and was predicted to become a hurricane as it moves through the Gulf of Mexico on a collision course with the Florida coast.",
      "publishedAt": "2024-08-03T14:07:45Z",
      "title": "Tropical Storm Debby moving through Gulf toward Florida with hurricane warnings",
      "url": "https://apnews.com/dce34e4d691b2c12a386964f86215220",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb13807cfec3455d8839a845ac8b88a3/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — They have combed the ashes for mementos, worried about where they would sleep, questioned their faith and tried to find a way to grieve amid the great, unsettling devastation.",
      "publishedAt": "2024-08-04T04:05:57Z",
      "title": "'We're going to survive and it's going to come back': A year after Maui wildfire, survivors press on",
      "url": "https://apnews.com/6170a7a96e0944dbe7444c0783912656",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbe6134b08b34dba808b8b111864f91f/3000.jpeg"
    },
    {
      "author": "ALANIS THAMES",
      "description": "VILLEPINTE, France (AP) — Boxer Lin Yu-ting of Taiwan clinched her first Olympic medal Sunday in front of a crowd that chanted her name, one day after fellow boxer Imane Khelif of Algeria secured one as well following days of online abuse and intense scrutiny about their participation at the Paris Games.",
      "publishedAt": "2024-08-04T09:28:46Z",
      "title": "Lin Yu-ting of Taiwan clinches first Olympic medal amid outcry tied to gender misconceptions",
      "url": "https://apnews.com/daffab2911d6451bcef347af085e2174",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0c631834f124f57b6931a5a99baee89/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "PARIS (AP) — Unbeaten at last year’s World Cup on the way to the gold medal. Unbeaten so far at the Paris Olympics. No team in this tournament has better defensive numbers, either.",
      "publishedAt": "2024-08-04T09:40:00Z",
      "title": "World Cup champion Germany unbeaten and rolling into basketball quarterfinals at Paris Olympics",
      "url": "https://apnews.com/36ba8fd3f20ba5a44f19ad51aa8790f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/349e73d0bb904cc19656d533a5cdb99c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}