{
  "articles": [
    {
      "author": "BILL BARROW",
      "description": "PHOENIX (AP) — President-elect Donald Trump came to Arizona on Sunday for his first rally speech since winning the November election.He was greeted by thousands of adoring supporters who confirmed his popularity across the conservative base.",
      "publishedAt": "2024-12-23T00:51:13Z",
      "title": "Takeaways from Trump's 1st rally speech as president-elect",
      "url": "https://apnews.com/933065fd25f1847b0dc3210f8b2195f5",
      "urlToImage": ""
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Two recently retired senior Israeli intelligence agents shared new details about a deadly clandestine operation years in the making that targeted Hezbollah militants in Lebanon and Syria using exploding pagers and walkie talkies three months ago.",
      "publishedAt": "2024-12-23T03:48:34Z",
      "title": "Former Israeli spies describe attack using exploding electronic devices against Hezbollah",
      "url": "https://apnews.com/b008d92e6c9f0747f23def9bf3a5e3df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4578cf516cc485d8b38cb51acfb8a6e/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and TIA GOLDENBERG",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across the Gaza Strip overnight and into Sunday killed at least 22 people, including five children, Palestinian medical officials said, while Gaza's small Christian community celebrated a pre-Christmas Mass.",
      "publishedAt": "2024-12-22T08:38:02Z",
      "title": "Israeli strikes in Gaza kill at least 22 as Vatican envoy visits Christians for pre-Christmas Mass",
      "url": "https://apnews.com/6638c448bcc5780d98c3e8284ce58fe1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5834e40f0e1445578178d3290157a266/1920.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BAN NAM KHEM, Thailand (AP) — The 20-year-old freshman student was still asleep that Sunday morning at the family's house on the Andaman Sea coast of southern Thailand when her mom, sensing something wasn't right, woke her up saying they needed to leave right away.",
      "publishedAt": "2024-12-23T02:09:15Z",
      "title": "Trauma lingers on for survivors of the deadly tsunami that hit Thailand 20 years ago",
      "url": "https://apnews.com/d65d7ad67550a623524fc037a7628452",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92e9d56c106b45b8ba265f49a83756b2/1920.jpeg"
    },
    {
      "author": null,
      "description": "MAGDEBURG, Germany (AP) — Four women and a 9-year-old boy were killed and 200 people were injured when a man drove into a Christmas market teeming with holiday shoppers in the German city of Magdeburg — an attack that has left Germans mourning the victims and with a shaken sense of security.",
      "publishedAt": "2024-12-21T18:00:47Z",
      "title": "What we know about the deadly Christmas market attack in Germany",
      "url": "https://apnews.com/c28c6ed42c7d1692798a28d2aba47514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fbf0323d10349cbb7454ff6e9ee8de7/3000.jpeg"
    },
    {
      "author": null,
      "description": "KILLEEN, Texas (AP) — A pickup truck driver fleeing police careened through the doors of a JCPenney store at a busy Texas mall, injuring five people before he was fatally shot by officers, authorities said.",
      "publishedAt": "2024-12-22T02:31:14Z",
      "title": "Pickup truck driver killed by police after driving through busy mall store is identified",
      "url": "https://apnews.com/c0675243b3d3d6125881bb2131534b31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2289da52a6943f0b6bcc7222d00c6bc/1576.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "New York City police announced Sunday they have in custody a “person of interest” in the early morning death of a woman who they believe may have fallen asleep on a stationary subway train before being intentionally lit on fire by a man she didn't know.",
      "publishedAt": "2024-12-22T19:08:51Z",
      "title": "New York City police apprehend suspect in the death of a woman found on fire in a subway car",
      "url": "https://apnews.com/520f705006b3e1760311916a70a0f67f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e366d6449274f0eba154745e99270aa/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — Pope Francis on Tuesday formally inaugurates the 2025 Holy Year, reviving an ancient church tradition encouraging the faithful to make pilgrimages to Rome, amid new security fears following a Christmas market attack in Germany.",
      "publishedAt": "2024-12-23T03:15:04Z",
      "title": "A Holy Year is about to start in Rome. Here's what you need to know",
      "url": "https://apnews.com/c8ee2a3d8008107fa7277bb84e2f87ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/454fae4fb6b94bee8f2316993a360629/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Two U.S. Navy pilots were shot down Sunday over the Red Sea in an apparent “friendly fire” incident, the U.S military said, marking the most serious incident to threaten troops in over a year of America targeting Yemen's Houthi rebels.",
      "publishedAt": "2024-12-22T02:57:03Z",
      "title": "2 US Navy pilots shot down over Red Sea in apparent 'friendly fire' incident, US military says",
      "url": "https://apnews.com/95a792daae3b0120186bfc6c66e1b6fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e683e86545a545a4ba0a968a30311969/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK and THOMAS ADAMSON",
      "description": "MAMOUDZOU, Mayotte (AP) — When Cyclone Chido ravaged Mayotte’s fragile infrastructure, it also exposed deep-seated tensions between the island’s residents and its large migrant population.",
      "publishedAt": "2024-12-22T12:48:46Z",
      "title": "Destructive Cyclone Chido unearths a rift between locals and migrants in France's Mayotte",
      "url": "https://apnews.com/c30253c3672e8719a1ba9135485b2495",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e63101512f534b9eb6ba85290724e562/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}