{
  "articles": [
    {
      "author": "TY O'NEIL, CLAIRE RUSH, JENNIFER SINCO KELLEHER and REBECCA BOONE",
      "description": "LAHAINA, Hawaii (AP) — Maui residents who made desperate escapes from oncoming flames, some on foot, asked why Hawaii’s famous emergency warning system didn’t alert them as wildfires raced toward their homes.",
      "publishedAt": "2023-08-11T05:47:00Z",
      "title": "At least 55 people died on Maui. Residents had little warning before wildfires overtook a town",
      "url": "https://apnews.com/c0f3cc5c7718bd41dd54d38479fb29b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bc5c6124bb84ffaa9054b60fab26319/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST, MICHAEL KUNZELMAN and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The federal judge overseeing the 2020 election conspiracy case against Donald Trump will hear arguments Friday over a request by prosecutors for a protective order seeking to bar the former president from publicly disclosing evidence shared by the government.",
      "publishedAt": "2023-08-11T04:17:45Z",
      "title": "Judge Chutkan will hear arguments in protective order fight in Trump's 2020 election conspiracy case",
      "url": "https://apnews.com/7129afbb11d968b42c9500559109f522",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34e229fbe85247a68a7753ce6c95aafa/3000.jpeg"
    },
    {
      "author": "ELENA BECATOROS and ABBY SEWELL",
      "description": "ATHENS, Greece (AP) — Nearly two months after a dilapidated fishing trawler crammed with people heading from Libya to Italy sank in the central Mediterranean, killing hundreds, relatives are still frantically searching for their loved ones among the missing and the dead.",
      "publishedAt": "2023-08-11T07:09:34Z",
      "title": "With hundreds lost in the migrant shipwreck near Greece, identifying the dead is painfully slow",
      "url": "https://apnews.com/22abc35905ca6530f4741b28a148bf59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/addcd9a2f91d44ad8eaba12b1d706d44/3000.jpeg"
    },
    {
      "author": "RAHIM FAIEZ and REBECCA SANTANA",
      "description": "ISLAMABAD (AP) — When the Taliban took control of Afghanistan, Shukria Sediqi knew her days in safety were numbered.",
      "publishedAt": "2023-08-11T05:03:52Z",
      "title": "Two years after fall of Kabul, tens of thousands of Afghans languish in limbo waiting for US visas",
      "url": "https://apnews.com/a89918dfda998dce8d8d26568f4feca1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21b6e36176714328bb7959460c85878f/3000.jpeg"
    },
    {
      "author": "GONZALO SOLANO and REGINA GARCIA CANO",
      "description": "QUITO, Ecuador (AP) — Ecuador’s transformation into a major drug trafficking hub and the ensuing three-year surge of violence is weighing on the nation following the killing of a presidential candidate whose life’s work was to fight crime and corruption.",
      "publishedAt": "2023-08-11T04:04:34Z",
      "title": "Ecuador arrests 6 Colombians in slaying of presidential candidate as violence weighs on nation",
      "url": "https://apnews.com/4ffb2030f439a6f1e6039326e1ee64b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fa9f507bebe4240bc196c5fc00cda4b/1920.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "SAN FRANCISCO (AP) — California regulators on Thursday approved an expansion that will allow two rival robotaxi services to operate throughout San Francisco at all hours, despite safety worries spurred by recurring problems with unexpected stops and other erratic behavior that resulted in unmanned vehicles blocking traffic, including emergency vehicles.",
      "publishedAt": "2023-08-10T04:02:08Z",
      "title": "Two rival robotaxi services win approval to operate throughout San Francisco despite safety concerns",
      "url": "https://apnews.com/98f0dab03984bd71685b92c2ac7aad0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fc0d96465c94ba9a30f7bab96d0dbe6/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "SPRINGFIELD, Mass. (AP) — When in-person school resumed after pandemic closures, Rousmery Negrón and her 11-year-old son both noticed a change: School seemed less welcoming.",
      "publishedAt": "2023-08-11T04:03:10Z",
      "title": "Millions of kids are missing weeks of school as attendance tanks across the US",
      "url": "https://apnews.com/90c05e3013b72802439565250d1adc33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a51f546facb54f9db62acd973fbf5ac3/3000.jpeg"
    },
    {
      "author": "JAN M. OLSEN",
      "description": "COPENHAGEN, Denmark (AP) — Authorities were on standby to evacuate more people in southeastern Norway Friday, where huge amounts of water, littered with broken trees, debris and trash, were thundering down the usually serene rivers after days of torrential rain.",
      "publishedAt": "2023-08-11T08:38:04Z",
      "title": "More evacuations considered in Norway where the level in swollen rivers continues to rise",
      "url": "https://apnews.com/592547493d53bf3ab8d2190be1ddf843",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/105a1c35714845e8bb10e93a8bdab11e/1920.jpeg"
    },
    {
      "author": "JIM HEINTZ and EMMA BURROWS",
      "description": "TALLINN, Estonia (AP) — A rocket carrying a lunar landing craft blasted off Friday on Russia’s first moon mission in nearly 50 years, racing to land on Earth’s satellite ahead of an Indian spacecraft.",
      "publishedAt": "2023-08-10T15:40:56Z",
      "title": "A rocket with a lunar landing craft blasts off on Russia’s first moon mission in nearly 50 years",
      "url": "https://apnews.com/286bf3d8d3b30790591efc113438e216",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f941646099e41c5b5382d264bd34060/1920.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — The Biden administration says it could soon launch a formal evaluation of risks posed by vinyl chloride, the cancer-causing chemical that burned in a towering plume of toxic black smoke following the fiery train derailment in East Palestine, Ohio.",
      "publishedAt": "2023-08-11T04:13:56Z",
      "title": "EPA weighs formal review of vinyl chloride, the toxic chemical that burned in Ohio train derailment",
      "url": "https://apnews.com/54bb0a943f4f4af0e4f68cc60ce4edb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/297d280f5d8f478a95aa8d23587d2f0a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}