{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump plans to host Philippine President Ferdinand Marcos Jr. at the White House. The visit Tuesday highlights efforts to strengthen security and economic ties between the two countries as tensions rise in the Indo-Pacific. Their talks are expected to focus on mutual defense as China has become increasingly assertive in the South China Sea, where Manila and Beijing have clashed over hotly contested territory. The leaders also are negotiating a potential tariffs deal. Marcos met with Secretary of State Marco Rubio and Defense Secretary Pete Hegseth on Monday. Both sides emphasized their commitment to regional peace and economic collaboration.",
      "publishedAt": "2025-07-22T04:03:11Z",
      "title": "Trump and Philippine leader plan to talk tariffs and China",
      "url": "https://apnews.com/article/marcos-trump-philippines-china-tariffs-3138d1d7f8368c022ab9242bebb4a2e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb924e5/2147483647/strip/true/crop/8149x4584+0+425/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2Fd7%2F50e244c4ee5ef13ad2cf18e01a96%2F373ad20f45084a899ce3a054e493147c"
    },
    {
      "author": null,
      "description": "House Speaker Mike Johnson is rebuffing pressure to act on the investigation into Jeffrey Epstein. The speaker is sending members of the House home early for a month-long break from Washington amid calls for a vote on the Epstein matter. Johnson said Tuesday morning that he wants to give the White House “space” to release the Epstein information on its own. The speaker’s stance seemed unlikely to satisfy many Republicans who are threatening to support a bipartisan bill to pry information from the Justice Department. Even before Johnson spoke, a Republican-controlled committee was advancing a resolution to subpoena Epstein’s former girlfriend, Ghislaine Maxwell, for a deposition.",
      "publishedAt": "2025-07-22T16:28:20Z",
      "title": "Speaker Johnson refuses to allow Epstein vote as House set to recess early",
      "url": "https://apnews.com/article/congress-jeffrey-epstein-trump-f2a03eca247268b14a9e38858338eded",
      "urlToImage": "https://dims.apnews.com/dims4/default/af3f55b/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2Fe8%2F150d1b77fc65008393fe9501979e%2F449dc4be1f4747e89457f5fff97552d2"
    },
    {
      "author": null,
      "description": "Israeli airstrikes have killed at least 20 people in Gaza. Palestinian health officials reported the strikes hit Gaza City and a nearby refugee camp early Tuesday, with reports of heavy bombing in areas previously spared major fighting. One strike on a refugee camp killed 12 people, including women and children while another hit crowds waiting for aid, killing eight. Israel manwhile pushed on with a new incursion in an area that had largely been spared heavy fighting during the 21-month war. Also, church leaders visiting Gaza described the territory as “almost totally destroyed” and called for urgent humanitarian aid.",
      "publishedAt": "2025-07-22T11:34:08Z",
      "title": "Israeli strikes kill at least 20 in Gaza, health officials say",
      "url": "https://apnews.com/article/israel-hamas-gaza-war-palestinians-07-22-2025-8eb90d73c1b7499d3dbc8b8d95da65cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/d04167c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2F71%2F9393498d3349b6fee4b5a16075c0%2Fa94a55104e6e4e2699875e0facc9daff"
    },
    {
      "author": null,
      "description": "Russian forces have attacked three Ukrainian cities overnight, killing a child and wounding at least 24 people. Ukrainian officials reported strikes in Sumy, Odesa and Kramatorsk from Monday evening into Tuesday. In Kramatorsk, a glide bomb hit an apartment building, killing a young boy and injuring five others. The attacks come ahead of planned peace talks Wednesday between Russia and Ukraine, which have shown little progress in ending the war. Meanwhile, Russia said it downed 35 Ukrainian drones overnight.",
      "publishedAt": "2025-07-22T08:25:23Z",
      "title": "Russian attacks in Ukraine kill a child and wound 24 before planned direct peace talks",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-peace-talks-a430896831b7bf527d36bf036c02c460",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ef61df/2147483647/strip/true/crop/6048x3402+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F2b%2F9724eab72bbe35a5bab5347cc3c5%2F3680a53fede049c99bc65a8bfd0388b4"
    },
    {
      "author": null,
      "description": "The long-range Russian drones come in swarms each night, buzzing over Ukraine by the hundreds, terrorizing the population and attacking targets from the industrial east to areas near its western border with Poland. Russia now batters Ukraine with more drones in a single night than it did during some entire months in 2024. Analysts say the barrages are likely to escalate. On July 8, Russia unleashed more than 700 drones — a record. Some experts say that could soon reach 1,000 a day. This comes amid a U.S. ultimatum for Russia to reach a ceasefire by Sept. 2 or face tough sanctions -– a timeframe Moscow is likely to use to inflict as much damage as possible.",
      "publishedAt": "2025-07-22T04:09:03Z",
      "title": "Russia ramps up aerial attacks on Ukraine after boosting its drone production",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-putin-attacks-0a06736dea37114aa0f351d21746912b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1af3169/2147483647/strip/true/crop/6250x3516+0+326/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Ffa%2F7256e899626e77e3b71384f8f49c%2F8ee975ab475a40e595962e08d4cb19ec"
    },
    {
      "author": null,
      "description": "The Trump administration has announced that it will once again withdraw from the U.N. cultural agency UNESCO. The move Tuesday was expect and has the U.S. further retreating from international organizations. The decision to pull U.S. funding and participation from UNESCO comes two years after the Biden administration rejoined following a controversial, five-year absence that began during President Donald Trump’s first term. The White House cited similar concerns as it did in 2018, saying it believes U.S. involvement is not in its national interest and accusing the agency promoting anti-Israel speech. The UNESCO chief said she “deeply” regrets the U.S. decision but said the agency “has prepared for it.” She denied accusations of anti-Israel bias,",
      "publishedAt": "2025-07-22T11:19:46Z",
      "title": "Trump administration says US will leave UNESCO again",
      "url": "https://apnews.com/article/unesco-trump-withdraw-paris-united-nations-israel-129a4ffbce562e1aa497231e0bdd55a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff7e5ae/2147483647/strip/true/crop/6590x3707+0+343/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2Fa8%2F490aa2eda7f1d039666f72fce3e4%2F85513f8c0fe740089d0d1a1c86775bc3"
    },
    {
      "author": null,
      "description": "Former President Joe Biden's son Hunter isn't hiding his feelings about George Clooney's role in the 2024 presidential election. In a rare online interview, Hunter Biden unleashes a string of expletives when discussing Clooney with Andrew Gallagher of Channel 5. Clooney supported Democrat Joe Biden's reelection bid and headlined a record-setting fundraiser for him. But Clooney changed his stance after Biden's disastrous debate performance against Republican Donald Trump and added his voice to calls for Biden to leave the race in an opinion piece published by The New York Times. Hunter Biden questions what right Clooney had to “undermine” his father. Los Angeles-based representatives for Clooney haven't responded to an emailed request for comment Tuesday.",
      "publishedAt": "2025-07-22T14:09:32Z",
      "title": "Hunter Biden accuses George Clooney of undermining his father in 2024",
      "url": "https://apnews.com/article/hunter-joe-biden-clooney-election-interview-fde14797b7808053d2e5fa9c3ad5d71b",
      "urlToImage": "https://dims.apnews.com/dims4/default/6af38a3/2147483647/strip/true/crop/4434x2494+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2Ff8%2F9e222f4153362955118a5e60bcb3%2F6bd7bc9074a3414f857a313f237053d3"
    },
    {
      "author": null,
      "description": "The U.S. Air Force says air traffic controllers at Minot International Airport in North Dakota failed to warn a military B-52 bomber crew about a nearby commercial plane. A SkyWest pilot performed a sharp turn, startling passengers, to avoid colliding with the B-52 bomber that he said was in his flight path as he prepared to land Friday at Minot International Airport. The bomber was conducting a pre-approved flyover for the North Dakota State Fair. The Air Force says the Minot tower directed the bomber crew but didn't inform them of the inbound SkyWest flight. The FAA, Air Force, and SkyWest are investigating. The FAA says the Minot tower is staffed by private contractors, not FAA employees.",
      "publishedAt": "2025-07-22T15:07:24Z",
      "title": "US Air Force blames private air traffic controllers for B-52 bomber scare",
      "url": "https://apnews.com/article/airliner-b52-bomber-north-dakota-399a13e49fd996e2eca449e5966ad0cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/02abd38/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F6b%2Fbe0de3335c40fae57da86c33aa3f%2F94416feea370488291df85ef6900fab0"
    },
    {
      "author": null,
      "description": "Interpol says it has removed anti-whaling campaigner Paul Watson from its most-wanted list. Watson, 74, is a former head of the Sea Shepherd Conservation Society, whose high seas confrontations with whaling vessels have drawn support from celebrities and featured in the reality television series “Whale Wars.\" Japan has sought his extradition over an encounter with a Japanese whaling research ship in 2001, when he was accused of obstructing the crew’s official duties by ordering the captain of his ship to throw explosives at the whaling ship.",
      "publishedAt": "2025-07-22T14:55:05Z",
      "title": "Interpol takes anti-whaling campaigner Paul Watson off its most-wanted list",
      "url": "https://apnews.com/article/interpol-paul-watson-antiwhaling-wanted-list-24ab66c84398a62b64109d429f84915f",
      "urlToImage": "https://dims.apnews.com/dims4/default/589f2c0/2147483647/strip/true/crop/3381x1902+0+227/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2F06%2F3066de8ba562958acac7b3433f7e%2F89e7640845e14cd7a690b966ecc371c7"
    },
    {
      "author": null,
      "description": "World markets are mixed after U.S. stock indexes hit new records. Oil prices fell and U.S. futures were little changed. Japan's Nikkei 225 dipped slightly after an initial surge, following the ruling coalition's loss of its upper house majority in Sunday's election. Analysts say political uncertainty is growing despite Prime Minister Shigeru Ishiba's vow to remain in office. Higher tariffs on exports to the United States are looming with the approach of an Aug. 1 deadline for reaching deals with Washington. On Monday, U.S. stocks saw modest gains, with the S&P 500 and Nasdaq reaching record highs. Verizon and Cleveland-Cliffs posted strong performances, while Sarepta Therapeutics faced setbacks.",
      "publishedAt": "2025-07-22T04:50:10Z",
      "title": "World markets are mixed and Japan's shares dip after election leaves Ishiba's future in doubt",
      "url": "https://apnews.com/article/stocks-markets-japan-trump-earnings-41443e3b17bb389ecac11508640084ab",
      "urlToImage": "https://dims.apnews.com/dims4/default/401dba5/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F07%2F775f788b5d660f85815179d287e4%2F488308926ca446c7a2714e386e503db6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}