{
  "articles": [
    {
      "author": "JULIA FRANKEL and JACK JEFFERY",
      "description": "JERUSALEM (AP) — Throughout its grinding seven-month war against Hamas, Israel has pledged to investigate a series of deadly events in which its military forces are suspected of wrongdoing. The commitment comes in the face of mounting claims — from human rights groups and the International Criminal Court 's chief prosecutor — that the country's leaders are committing war crimes in Hamas-ruled Gaza.",
      "publishedAt": "2024-06-02T05:50:33Z",
      "title": "The Israeli army says it investigates itself. Where do those investigations stand?",
      "url": "https://apnews.com/b0b6107d449ca4e6d6a1b59749f15814",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9757cde9fc714c96b5b54600136d2e67/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "After his historic guilty verdict in his hush money case, Donald Trump attacked the U.S.",
      "publishedAt": "2024-06-02T05:17:04Z",
      "title": "Trump's attacks on US justice system after guilty verdict could be useful to autocrats like Putin",
      "url": "https://apnews.com/2828902db670e00af3b1ac871938b96e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75b5703413964819baa15164c09ae3e9/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's hard-line former President Mahmoud Ahmadinejad registered Sunday as a possible candidate for the presidential election, seeking to regain the country's top political position after a helicopter crash killed the nation's president.",
      "publishedAt": "2024-06-02T06:46:52Z",
      "title": "Iran's hard-line former President Mahmoud Ahmadinejad registers for June 28 presidential election",
      "url": "https://apnews.com/3820e4b824a09c2922feccbb0b064d66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb1c0d71a3bb46a7a2930445cfb779de/3000.jpeg"
    },
    {
      "author": "DAVID RISING and KEN MORITSUGU",
      "description": "SINGAPORE (AP) — Ukrainian President Volodymyr Zelenskyy accused China on Sunday of helping Russia to disrupt an upcoming Swiss-organized peace conference on the war in Ukraine.",
      "publishedAt": "2024-06-02T04:55:07Z",
      "title": "Zelenskyy accuses China of pressuring other countries not to attend upcoming Ukraine peace talks",
      "url": "https://apnews.com/94ebb72539182a0215c85895725cdd48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3a607e9230245afa33790c442eb8b11/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY and MARK STEVENSON",
      "description": "MEXICO CITY (AP) — Mexicans will likely choose the first female president in the country’s history Sunday between a former academic who promises to further the current leader’s populist policies and an ex-senator and tech entrepreneur who pledges to up the fight against deadly drug cartels.",
      "publishedAt": "2024-06-02T04:05:32Z",
      "title": "Mexico votes in an election likely to choose the country’s first female president",
      "url": "https://apnews.com/d7fef5c7ac964072401ba6d9809dd7d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76babb4936e64842ad28ff9365361b60/1920.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "ALEXANDRIA, Va. (AP) — On one side of the classroom, students circled teacher Maria Fletcher and practiced vowel sounds. In another corner, children read together from a book. Scattered elsewhere, students sat at laptop computers and got reading help from online tutors.",
      "publishedAt": "2024-06-02T04:48:57Z",
      "title": "Most US students are recovering from pandemic-era setbacks, but millions are making up little ground",
      "url": "https://apnews.com/c828144e18a02a1e45841c4dd07f05cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fed6976002044f73aff8f7c71adfc504/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Ukraine imposed emergency power shutdowns in most of the country on Sunday, a day after Russia unleashed large-scale attacks on energy infrastructure and claimed it made gains in the eastern Donetsk province.",
      "publishedAt": "2024-06-02T10:10:29Z",
      "title": "Energy shutdowns hit Ukraine after Russian attacks target infrastructure",
      "url": "https://apnews.com/fc9f910c255ef5bd36e7f1782f073949",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55a234985ab148b7a93a50964e3f3a36/3000.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME and GERALD IMRAY",
      "description": "JOHANNESBURG (AP) — South Africa announced its final election results Sunday that confirmed no party won a majority, and unprecedented coalitions talks were starting to find a way forward for Africa’s most advanced economy.",
      "publishedAt": "2024-06-02T10:16:42Z",
      "title": "Official results confirm no party won a majority in South Africa's election as coalition talks start",
      "url": "https://apnews.com/68a64d6bb5f0655233c7d6d4aa7bb0e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7ed3ef1f7674986a21b6843c22b6e65/3000.jpeg"
    },
    {
      "author": "RODNEY MUHUMUZA",
      "description": "KAMPALA, Uganda (AP) — Early last year, Caroline Ikendi was in distress after undergoing an emergency Caesarean section to remove a stillborn baby and save two others. Doctors said one of the preterm babies had a 2% chance of living.",
      "publishedAt": "2024-06-02T05:04:35Z",
      "title": "A growing community of breast milk donors in Uganda gives mothers hope",
      "url": "https://apnews.com/94f8c81bbd664b9681db55465cd4185d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf669c491ba14dcfad883dc35096e451/1920.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "WASHINGTON (AP) — The Democratic National Committee was watching earlier this year as campaigns nationwide were experimenting with artificial intelligence. So the organization approached a handful of influential party campaign committees with a request: Sign onto guidelines that would commit them to use the technology in a “responsible” way.",
      "publishedAt": "2024-06-02T07:26:40Z",
      "title": "Democrats wanted an agreement on using artificial intelligence. It went nowhere",
      "url": "https://apnews.com/7c6b78b6a8ded9ad253be9ef491e0284",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/955a01594e5c493f8e673c22a10d5fdb/2639.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}