{
  "articles": [
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Monday unanimously restored Donald Trump to 2024 presidential primary ballots, rejecting state attempts to ban the Republican former president over the Capitol riot.",
      "publishedAt": "2024-03-04T05:04:32Z",
      "title": "Supreme Court restores Trump to ballot, rejecting state attempts to ban him over Capitol attack",
      "url": "https://apnews.com/51e79c0f03013034c8a042cb278b6446",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d86f97b40fdc4d09ba8a4815b47d50f7/3000.jpeg"
    },
    {
      "author": "JACK DURA",
      "description": "BISMARCK, N.D. (AP) — Donald Trump won the North Dakota Republican presidential caucuses on Monday, adding to his string of victories heading into Super Tuesday.",
      "publishedAt": "2024-03-04T05:29:06Z",
      "title": "Donald Trump wins North Dakota Republican caucuses, adding to victories going into Super Tuesday",
      "url": "https://apnews.com/3bbaac8dc91109eada2c7febbb088964",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79f36041c70d43eabbf967ec9078653f/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO and LINDSAY WHITEHURST",
      "description": "AUSTIN, Texas (AP) — Texas’ plans to arrest migrants who enter the U.S. illegally and order them to leave the country is headed to the Supreme Court in a legal showdown over the federal government’s authority over immigration.",
      "publishedAt": "2024-03-04T21:51:18Z",
      "title": "Supreme Court temporarily blocks Texas law that allows police to arrest migrants",
      "url": "https://apnews.com/fd9e25f3a49a67eb735a12fa7938fdfa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30710ba13544459797f4a8d4b41fe93c/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.N. envoy focusing on sexual violence in conflict said in a new report Monday that there are “reasonable grounds” to believe Hamas committed rape, “sexualized torture,” and other cruel and inhumane treatment of women during its surprise attack in southern Israel on Oct.",
      "publishedAt": "2024-03-04T19:20:41Z",
      "title": "UN envoy says 'reasonable grounds' to believe Hamas committed sexual violence on Oct. 7",
      "url": "https://apnews.com/fe1a35767a63666fe4dc1c97e397177e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/338295857d3c4a05864a0ed94953c01a/3000.jpeg"
    },
    {
      "author": null,
      "description": "NASHVILLE, Tenn. (AP) — Police in Nashville say that multiple people have died after a small plane crashed Monday night near an interstate highway, shutting down multiple lanes. The single-engine plane crashed in a grassy median just off Interstate 40 near a Costco store in the western part of the city, the Metro Nashville Police Department said.",
      "publishedAt": "2024-03-05T04:03:53Z",
      "title": "Single-engine plane crashes along Tennessee highway, killing those aboard and closing lanes",
      "url": "https://apnews.com/08899b682acde5713ee72920405a2457",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15e37880fcc7470780d932a5a0c17c47/3000.jpeg"
    },
    {
      "author": "EVENS SANON and PIERRE-RICHARD LUXAMA",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Heavily armed gangs tried to seize control of Haiti’s main international airport on Monday, exchanging gunfire with police and soldiers in the latest attack on key government sites in an explosion of violence that includes a mass escape from the country’s two biggest prisons.",
      "publishedAt": "2024-03-04T05:06:37Z",
      "title": "Gangs in Haiti try to seize control of main airport in newest attack on key government sites",
      "url": "https://apnews.com/105ca137aa337b9e6681cf87add9a5c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4454225a32e74d11bdda57b467680fc6/1920.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — A 53-year-old union of immigration judges has been ordered to get supervisor approval to speak publicly to anyone outside the Justice Department, potentially quieting a frequent critic of heavily backlogged immigration courts in an election year.",
      "publishedAt": "2024-03-05T02:01:01Z",
      "title": "Immigration judges union, a frequent critic, is told to get approval before speaking publicly",
      "url": "https://apnews.com/751f55a0ae60af5c04d6c0ca420d36ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e596bafc1bc24967949f000dd2f0aa16/3000.jpeg"
    },
    {
      "author": "BARBARA SURK and NICOLAS GARRIGA",
      "description": "PARIS (AP) — French lawmakers on Monday overwhelmingly approved a bill to enshrine abortion rights in France's constitution, making it the only country to explicitly guarantee a woman’s right to voluntarily terminate a pregnancy",
      "publishedAt": "2024-03-04T11:11:27Z",
      "title": "France becomes the only country to explicitly guarantee abortion as a constitutional right",
      "url": "https://apnews.com/d6ce4fb3a6a7288033f58235b65f570e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e32d5c933dc14563b0df8313e751868b/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "BOSTON (AP) — Massachusetts Air National Guard member Jack Teixeira pleaded guilty on Monday to leaking highly classified military documents about the war in Ukraine and other national security secrets under a deal with prosecutors that calls for him to serve at least 11 years in prison.",
      "publishedAt": "2024-03-04T05:21:50Z",
      "title": "Pentagon leaker Jack Teixeira pleads guilty under a deal that calls for at least 11 years in prison",
      "url": "https://apnews.com/7fc285d8386447f995a1c0edd3d1d024",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebfb9b652ec040a4b2490a5791f35d14/2556.jpeg"
    },
    {
      "author": "KEN MORITSUGU and ELAINE KURTENBACH",
      "description": "BEIJING (AP) — China's official growth target for this year is around 5%, Premier Li Qiang said Tuesday in an annual report on the government's plans and performance that prioritized both security and the economy.",
      "publishedAt": "2024-03-05T01:19:01Z",
      "title": "China sets an economic growth target of 5% and pledges help for consumers and property developers",
      "url": "https://apnews.com/1fc37c644ca06a4ab1133b26c5a7b146",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35cd885ae86e4e0499b235af665eb712/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}