{
  "articles": [
    {
      "author": "Scott Bauer",
      "description": "Investigators working on the disappearance of “Today” show host Savannah Guthrie’s mother are consulting with Walmart management to develop leads. That's because a backpack the suspect was wearing is sold exclusively at Walmart stores. Chris Nanos, the sheriff of Pima County, Arizona, told The Associated Press in a text message on Monday that the suspect's “Ozark Trail Hiker Pack” is the only clothing item that has been “definitively identified.” Nancy Guthrie was last seen at her Arizona home on Jan. 31 and was reported missing the following day. The Federal Bureau of Investigation released surveillance videos of a masked person wearing a handgun holster outside Guthrie’s front door the night she vanished.",
      "publishedAt": "2026-02-16T19:17:37Z",
      "title": "Nancy Guthrie kidnapping investigators working with Walmart to develop leads",
      "url": "https://apnews.com/article/savannah-guthrie-mom-mother-missing-walmart-9b90363ef0e59fe69a7bd65e1445aa03",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca9514c/2147483647/strip/true/crop/1500x999+0+500/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F7a%2F82c5a50e812aaa943cd6b51eda7d%2F89acada3beab481eb36bb8ac79798f8a"
    },
    {
      "author": null,
      "description": "Police are responding to reports of multiple people hurt in a shooting at a Rhode Island ice rink where a youth hockey game was scheduled. Little detail was immediately available about the shooting Monday afternoon at Dennis M. Lynch Arena in Pawtucket, a few miles outside Providence. Messages seeking comment were left for Pawtucket police and a spokesperson for the city’s mayor. An email message left for a spokesperson with a local hospital also was not immediately returned.",
      "publishedAt": "2026-02-16T21:00:49Z",
      "title": "Police respond to reports of a shooting at a Rhode Island hockey rink",
      "url": "https://apnews.com/article/pawtucket-hockey-rink-shooting-rhode-island-c8ac3e8067ce2f2ce07e4d98009ecdaa",
      "urlToImage": "https://dims.apnews.com/dims4/default/d68fa2e/2147483647/strip/true/crop/4200x2799+0+306/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2Fbc%2Facba8caad274aad0fe4b3af27d4c%2Fd954ebd6a2234f6eae572e248906c4d3"
    },
    {
      "author": "Bob Thomas",
      "description": "Robert Duvall, the Oscar-winning actor whose classic roles included the wily confidant of the first two “Godfather” movies, had died at age 95. He first gained notice for a small part as the reclusive neighbor in “To Kill a Mockingbird.” He won an Academy Award as best actor for portraying the over-the-hill country music singer in the 1983 film “Tender Mercies.” He also won four Golden Globes, including one for playing the philosophical cattle-drive boss in the 1989 miniseries “Lonesome Dove,” a role he often cited as his favorite.",
      "publishedAt": "2026-02-16T18:50:27Z",
      "title": "Oscar-winning actor Robert Duvall dies at 95",
      "url": "https://apnews.com/article/robert-duvall-dead-6ddb67ba5e2242ba9dd96f29b4ce242a",
      "urlToImage": "https://dims.apnews.com/dims4/default/2813519/2147483647/strip/true/crop/2652x1767+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2Fcb%2Fc5408ad8e1c39127c3cf0bac0f66%2Fe714e2f7ff9e45c594f3ce1949b0af1e"
    },
    {
      "author": "Jamey Keaten, Stephanie Liechtenstein",
      "description": "Iran's top diplomat has held talks with the U.N. nuclear watchdog in Geneva a day before a second round of negotiations between the U.S. and Iran. Iran’s Foreign Minister Abbas Araghchi met with IAEA chief Rafael Grossi and later planned to hold talks with Oman’s foreign minister. Oman is hosting the U.S.-Iran talks in Geneva on Tuesday. U.S. President Donald Trump initially threatened to take military action over Iran’s bloody crackdown on nationwide protests last month, but then shifted to a pressure campaign to try to get Tehran to make a deal over its nuclear program.",
      "publishedAt": "2026-02-16T10:09:38Z",
      "title": "Iran's top diplomat meets UN nuclear watchdog ahead of US talks",
      "url": "https://apnews.com/article/iran-nuclear-talks-us-geneva-8628f2dbd4c911cb4cda5fb92c1aadef",
      "urlToImage": "https://dims.apnews.com/dims4/default/73c0551/2147483647/strip/true/crop/3200x2132+0+85/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F9a%2F6f1c6cd261a46c891761bca3a91d%2F8710b09f9aa5488eab6317f99f7511da"
    },
    {
      "author": "Dyepkazah Shibayan",
      "description": "The Nigerian military says about 100 U.S. troops plus equipment have arrived in Nigeria to help train soldiers in the West African country. The arrival followed a request by the Nigerian government to the U.S government to for training, technical support intelligence-sharing, the military said in a statement Monday. The deployment follows an easing of tensions that had flared between the U.S. and Nigeria when U.S. President Donald Trump had issued threats against Nigeria over allegations that the government was not protecting its Christian citizens.",
      "publishedAt": "2026-02-16T17:41:46Z",
      "title": "US troops arrive in Nigeria to help train its military",
      "url": "https://apnews.com/article/us-troops-nigeria-training-29eed3ae3dfe7c5dede9d06074a8afc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Sam Metz",
      "description": "Israeli prosecutors say they plan to charge a settler in the killing of a Palestinian activist during a confrontation that was caught on video. That would open a rare prosecution of violence by Jewish settlers in the occupied West Bank. Attacks from settlers and home demolitions by authorities have spiked dramatically over the past two years. But the death in July of Awdah Hathaleen has drawn particular attention due to his involvement in the 2025 Oscar-winning film “No Other Land.” The case also stands out because the confrontation was captured on video from multiple vantage points.",
      "publishedAt": "2026-02-16T17:20:07Z",
      "title": "Israel plans to charge a man filmed firing a gun during an attack on a Palestinian activist",
      "url": "https://apnews.com/article/israel-palestinians-west-bank-settlers-86621a794e0d3828b946c753bf08a4ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/6fa0a15/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fbf%2F84108fabcc12f0b2239cdfd53473%2Fb86e91e454a942898f3c15ff1fc69d6e"
    },
    {
      "author": "Kate Brumback",
      "description": "The NAACP and allied groups are asking a judge to limit how the federal government uses voter data seized in an FBI raid near Atlanta. In a motion filed late Sunday, they asked the judge to bar any use beyond the stated criminal investigation. They also asked for a full inventory of what agents took during the Jan. 28 seizure at the Fulton County elections hub and who has accessed it. FBI agents arrived at the elections warehouse with a warrant seeking 2020 Fulton County election records. The Justice Department did not immediately respond to a request for comment Monday.",
      "publishedAt": "2026-02-16T14:04:52Z",
      "title": "NAACP urges judge to protect voter information seized by FBI in Georgia",
      "url": "https://apnews.com/article/fbi-georgia-elections-fulton-county-2020-ballots-e0eb5970169ade6f775e317f7fa12d5e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e18d52c/2147483647/strip/true/crop/3500x2332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F97%2F18097cee2507df0cb522540af74a%2Fe6f2db0f84d24f84a941123ce9b6d9f3"
    },
    {
      "author": "Kimberlee Kruesi",
      "description": "California is bracing for a powerful winter storm anticipated to bring thunderstorms, strong winds, and heavy mountain snow. National Weather Service meteorologist Jacob Spender in Sacramento urged people to take precautions in the coming days. He says that if people are traveling, then they should be packing winter safety kits. Winter storm warnings were in place from southwest Oregon to the Southern California border. PG&E says it is using AI and machine-learning weather models to position crews and equipment before the storm hits. Meanwhile, state emergency officials are deploying rescue resources for flooding and debris flows. Forecasters expect extreme Sierra snow through late Wednesday.",
      "publishedAt": "2026-02-16T15:53:46Z",
      "title": "California braces for winter storm with high winds and heavy snow",
      "url": "https://apnews.com/article/california-storm-forecast-snow-wind-rain-3624c992a6fac8d3735b61beffa509e8",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ccadd7/2147483647/strip/true/crop/7261x4838+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F19%2F062f9ef03ae6f198ce8190fc1a4b%2Fcc89e6b1a3cc4a09a6a239de9c62e970"
    },
    {
      "author": "The Associated Press",
      "description": "Government offices, the stock market and schools are closed Monday in observance of Presidents Day, but most big retailers are open. When in doubt, call ahead or look up more specific schedules online for stores in your neighborhood. U.S. stock markets and banks are closed Monday but will reopen on Tuesday. National parks are open and free to U.S. residents on Presidents Day. The official designation for the holiday is Washington’s Birthday after first President George Washington, although it has come to be known informally as Presidents Day.",
      "publishedAt": "2026-02-16T12:40:54Z",
      "title": "What's open and closed on Presidents Day",
      "url": "https://apnews.com/article/presidents-day-holiday-stores-open-closed-4f4955a83d4b04a3e49078ebc0b95b50",
      "urlToImage": "https://dims.apnews.com/dims4/default/d771a95/2147483647/strip/true/crop/5716x3809+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Fd9%2F4cd2f2cfae485b516fb9a911b2de%2F1aa54d162fba4c0ab42435399ac6ba24"
    },
    {
      "author": "James Ellingworth",
      "description": "Eileen Gu is readying to defend her big air ski freestyle title and a Norwegian contender’s emotional reaction overshadowed the last men’s Alpine ski event of the Milan Cortina Olympics. Also on Day 10 of the Winter Games, the United States won its women’s hockey semifinal game. Canada plays next, which could set up yet another gold-medal decider between the old rivals.",
      "publishedAt": "2026-02-16T16:24:50Z",
      "title": "Winter Olympics recap: Heartbreak in slalom and Eileen Gu tries to defend big air gold",
      "url": "https://apnews.com/article/milan-cortina-winter-olympics-a8a22f9aefa87a01682ddb5042fc2d79",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c09b47/2147483647/strip/true/crop/4009x2671+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Fb5%2Ffde502dc5112e15ddd61954a5a84%2Ffaf74b2f6e944d5ebca1beb71af478b7"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}