{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump says he will move to close Washington’s Kennedy Center performing arts venue for two years starting in July for construction. Trump’s announcement on social media Sunday night follows a wave of cancellations since Trump ousted the previous leadership and added his name to the building. Trump announced his plan days after the premier of “Melania” a documentary of the first lady was shown at the storied venue. He says the proposal is subject to approval by the board of the Kennedy Center, which has been stocked with his hand-picked allies.",
      "publishedAt": "2026-02-01T23:47:50Z",
      "title": "Kennedy Center will close for 2 years for renovations in July, Trump says",
      "url": "https://apnews.com/article/trump-kennedy-center-closing-renovations-c6dba4a46e71b0d0e48d46501195366c",
      "urlToImage": "https://dims.apnews.com/dims4/default/fa0f2c5/2147483647/strip/true/crop/5028x3350+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2F9b%2F544d232b5dbdcb42079068a3f65f%2Fb1164659ec4b4b49872d9b7f86cfdf16"
    },
    {
      "author": "The Associated Press",
      "description": "Five-year-old Liam Conejo Ramos and his dad have returned to Minnesota after being released by ICE, Texas lawmaker says. The two were detained in a Minneapolis suburb on Jan. 20. Images of the young boy wearing a bunny hat and Spider-Man backpack surrounded by immigration officers caused outrage over the Trump administration immigration crackdown in Minneapolis. A judge on Saturday ordered the father and son's release.",
      "publishedAt": "2026-02-01T16:20:55Z",
      "title": "5-year-old and dad return to Minnesota from Texas detention facility",
      "url": "https://apnews.com/article/minnesota-boy-liam-conejo-ramos-fc958185cd2b4e946b82081be11bc0f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/16e04de/2147483647/strip/true/crop/6958x4636+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F6e%2Fd62e02e653ab799cbafbce21fcda%2Ffd19893dec9f4a9498c83e2e4e229092"
    },
    {
      "author": "Eric Tucker",
      "description": "A top Justice Department official is playing down the possibility of additional criminal charges arising from the Jeffrey Epstein files. Deputy Attorney General Todd Blanche said on CNN on Sunday that the existence of “horrible photographs” and troubling email correspondence does not “allow us necessarily to prosecute somebody.” Department officials said over the summer that a review of records from Epstein investigations did not establish a basis for new criminal investigations, a position that Blanche said remains unchanged even as a massive document dump since Friday has focused fresh attention on his links to powerful individuals around the world and revived questions about what, if any, knowledge the wealthy financier’s contacts had about his crimes.",
      "publishedAt": "2026-02-01T20:30:10Z",
      "title": "DOJ official plays down chance for charges arising from Epstein files release",
      "url": "https://apnews.com/article/trump-justice-department-epstein-files-28e917b173e0c371cff08946a24d2cd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/9417c5b/2147483647/strip/true/crop/5077x3383+36+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F30%2F92f20b6456d7e3a808dc8155e5e4%2F24f33199772148b7b6138e9c55305da9"
    },
    {
      "author": "Lisa Mascaro",
      "description": "House Speaker Mike Johnson says it'll be a few days before a government funding package comes up for a vote in the House. That all but ensures the partial federal shutdown will drag into the week. Democrats are demanding changes to rein in the Trump administration’s immigration enforcement operations. Johnson tells “Fox News Sunday” that he's relying on help from President Donald Trump to ensure passage, possibly Tuesday. Trump struck a deal with senators to separate out the homeland security funding from a broader package. That gives two weeks for Congress to debate and vote on new restrictions on Immigration and Customs Enforcement operations.",
      "publishedAt": "2026-02-01T17:24:30Z",
      "title": "Johnson says no quick House vote to end partial government shutdown",
      "url": "https://apnews.com/article/shutdown-ice-trump-democrats-demands-johnson-funding-d90a24827e48c18fc1c14c76adfecda6",
      "urlToImage": "https://dims.apnews.com/dims4/default/c000aad/2147483647/strip/true/crop/3086x2056+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2Ff3%2Fba81d73f8f9b363e8fb484225e6c%2Fc48f9eeda8804b6aacfc0299aef3e29a"
    },
    {
      "author": "John Hanna, Julie Carr Smyth",
      "description": "Democrat Taylor Rehmet won a special election for the Texas state Senate and flipped a reliably Republican district that President Donald Trump won by 17 points in 2024. Rehmet, a labor union leader and veteran, easily defeated Republican and conservative activist Leigh Wambsganss in the Fort Worth-area district. His victory added to Democrats’ record of overperforming in special elections so far this cycle. Trump used his social media platform to urge voters to support Wambsganss, but Rehmet had support from national organizations. The victory allows Rehmet to serve only until early January, and he must win the November general election to keep the seat after that.",
      "publishedAt": "2026-02-01T05:09:12Z",
      "title": "Democrat Taylor Rehmet flips Texas state Senate seat",
      "url": "https://apnews.com/article/texas-state-senate-democrat-taylor-rehmet-c8cb6685c49696b8a607a8f93111ae2e",
      "urlToImage": "https://dims.apnews.com/dims4/default/7696c9a/2147483647/strip/true/crop/4982x3320+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F94%2F203bfa6076705442512a03d99986%2F142cc2b757f74eb9a710c05e45933d42"
    },
    {
      "author": "Adrian Sainz",
      "description": "A huge swath of the U.S. from the Gulf Coast into New England is mired in extra-cold temperatures after a bomb cyclone brought heavy snow. There were hundreds of flight cancellations to North Carolina, snow flurries and falling iguanas in Florida, and more misery for thousands who are still without power from last weekend’s ice storm in the South. About 150 million people are under cold weather advisories and extreme cold warnings in the eastern portion of the U.S. Wind chills have been near zero to single digits in the South, with Florida experiencing its coldest air mass since December 1989.",
      "publishedAt": "2026-02-01T16:58:19Z",
      "title": "150 million people in US under cold weather advisories as wind chills drop",
      "url": "https://apnews.com/article/winter-weather-ice-snow-cold-4b1aad9d5c8b380ae18e6e6c2e650dee",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7f6470/2147483647/strip/true/crop/4200x2799+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2Fb1%2Fa462e5cce2727ac16b7f5d420869%2F216e5edfb33a46a09fe6606744d9d6f8"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran’s supreme leader has warned that any U.S. attack would trigger a “regional war” in the Mideast. This comes as U.S. President Donald Trump threatens military action against Iran. The USS Abraham Lincoln and American warships are in the Arabian Sea following Tehran’s crackdown on protests. Iran plans a military drill in the Strait of Hormuz, a critical oil passage. Meanwhile, Iran’s parliament has labeled European Union militaries as terrorist groups after the bloc declared Iran’s Revolutionary Guard a terror group. Trump says Iran is “seriously talking” to the U.S. but hasn’t decided on military action.",
      "publishedAt": "2026-02-01T06:11:47Z",
      "title": "Iran's leader warns US if it starts a war, it will be regional war",
      "url": "https://apnews.com/article/iran-eu-terrorist-groups-protests-c0023d9ff1e7c4e6fa92077d640e244c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e69d35e/2147483647/strip/true/crop/8284x5520+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2Fba%2Fa8e9aae7d3bdbdc7af2f31ee9880%2F1c7805688fb24e199a04e87c79b4ef61"
    },
    {
      "author": "Samy Magdy",
      "description": "Palestinians in Gaza are watching with hope and impatience as workers lay the groundwork to reopen the territory’s Rafah border crossing with Egypt, its lifeline to the world. Israel says the crossing is scheduled to resume Monday as its ceasefire with Hamas moves ahead. Almost all travel in and out of Gaza has been blocked since the start of the war. Thousands of Palestinians await medical evacuations, and thousands of others want to return home. Also on Sunday, Israel said Doctors Without Borders must end its work in Gaza because it refused to comply with new requirements to submit lists of local employees. The charity has said the regulations could endanger Palestinian staff.",
      "publishedAt": "2026-02-01T08:05:21Z",
      "title": "Gaza's crucial Rafah crossing prepares for limited travel to resume Monday",
      "url": "https://apnews.com/article/gaza-rafah-hamas-israel-war-2-1-2026-4fdd33cfb3af77e9ecef1f3c9ebd947e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b9729ba/2147483647/strip/true/crop/3340x2226+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2F24%2F10471d8397ea20b92c726ab82d61%2F48f35a70eff54d96b24a083e802229ab"
    },
    {
      "author": "Terry Tang",
      "description": "Despite proclaiming last February as National Black History Month, President Donald Trump's second term has been marked by what critics say are attacks on Black history in the United States. The administration has dismantled Black history at national parks, most recently a slavery exhibit in Philadelphia. In the 100th year since the nation's earliest celebrations of Black history, the current political climate has energized civil rights organizations, artists and academics to engage young people on a full telling of America's story. Hundreds of lectures, teach-ins and new books are planned to mark Black History Month, which originated as historian Carter G. Woodson's idea for a Negro History Week in 1926.",
      "publishedAt": "2026-02-01T05:10:47Z",
      "title": "Concerns rise over Black history education under Trump's policies",
      "url": "https://apnews.com/article/black-history-month-carter-woodson-juneteenth-ac6c93af68ff95738e2a8caa5de19906",
      "urlToImage": "https://dims.apnews.com/dims4/default/e636aaa/2147483647/strip/true/crop/3936x2623+0+5/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F6f%2Ffa28cb6798fe68b94e21db9c1d77%2F379f25affad147c5ab95405bf5534b9d"
    },
    {
      "author": "Maria Sherman",
      "description": "The 68th annual Grammy Awards will take place Sunday with a dramatically different tone than last year. The 2025 award show was completely reimagined and refocused to relief efforts following the devastating Los Angeles-area wildfires. In 2026, focus has been placed once again on the music, where Kendrick Lamar, Lady Gaga, Bad Bunny and more will go head-to-head. Comedian Trevor Noah will host for a sixth and final year. History could be made when some of the biggest names in music gather. The main show will air live on CBS beginning at 8 p.m. Eastern on Feb. 1.",
      "publishedAt": "2026-02-01T05:00:36Z",
      "title": "The 2026 Grammy Awards are here: What to expect and how to watch",
      "url": "https://apnews.com/article/2026-grammy-awards-4d631de5d968b51276a8f06b76580e20",
      "urlToImage": "https://dims.apnews.com/dims4/default/cdc569e/2147483647/strip/true/crop/4000x2665+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2Fab%2Fa3c403252ef6c9e9f7edcb1a20cb%2F3e5d4436f8c642bdb8ec323925886c29"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}