{
  "articles": [
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Benny Gantz, a centrist member of Israel’s three-man war Cabinet, announced his resignation on Sunday.The move does not immediately pose a threat to Prime Minister Benjamin Netanyahu, who still controls a majority coalition in parliament.",
      "publishedAt": "2024-06-09T17:48:53Z",
      "title": "Centrist Benny Gantz, a member of Israel's war Cabinet, resigns over lack of plans for postwar Gaza",
      "url": "https://apnews.com/48a4a60ccccdb7f74b4bf7816f9a7c67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4520e8b5a4f745c7adca7df1000e8138/3000.jpeg"
    },
    {
      "author": "LORNE COOK, RAF CASERT and SAMUEL PETREQUIN",
      "description": "BRUSSELS (AP) — The first major estimates coming out of the European Union parliamentary elections Sunday suggest that the hard right will rise in the legislature while the center might hold up better than expected, leaving the Greens to take the hardest hit.",
      "publishedAt": "2024-06-09T04:02:15Z",
      "title": "German and Dutch exit polls suggest a shift to the hard right as voting in EU elections nears an end",
      "url": "https://apnews.com/0fbfcb7bd987008e802d70f759fa870b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c5df287a3a847539507aad852bb6c04/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Voters across the European Union have been voting on the final day of European parliamentary elections to choose their representatives for the next five-year term.Polls opened in 20 EU countries early Sunday for the June 6-9 elections for a new European Parliament, the legislative branch of the 27-member bloc.",
      "publishedAt": "2024-06-09T07:35:41Z",
      "title": "The Latest | Voting almost over on final day of EU elections",
      "url": "https://apnews.com/d66061efe90a5b3d1762d3ddfade0491",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f3c3ab845fc4123b5a09dda7a473b4d/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — At least 274 Palestinians, including dozens of children, were killed, and hundreds more were wounded, in the Israeli raid that rescued four hostages held by Hamas, Gaza's Health Ministry said Sunday.",
      "publishedAt": "2024-06-09T10:07:06Z",
      "title": "Gaza's Health Ministry says 274 Palestinians were killed in Israeli raid that rescued 4 hostages",
      "url": "https://apnews.com/61eb1be9a9d0cf2dbf250cd4a8ed4dbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71e6650ae74e47a181c355e3a675ce39/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — Benny Gantz, a centrist member of Israel’s three-man war Cabinet, announced his resignation on Sunday.The move does not immediately pose a threat to Prime Minister Benjamin Netanyahu, who still controls a majority coalition in parliament.",
      "publishedAt": "2024-06-09T17:48:53Z",
      "title": "Centrist Benny Gantz, a member of Israel's war Cabinet, resigns over lack of plans for postwar Gaza",
      "url": "https://apnews.com/48a4a60ccccdb7f74b4bf7816f9a7c67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4520e8b5a4f745c7adca7df1000e8138/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and ZEKE MILLER",
      "description": "BELLEAU, France (AP) — President Joe Biden closed out his trip to France by paying his respects at an American military cemetery that Donald Trump notably skipped when he was president, hoping his final stop Sunday helped draw the stakes of the November election in stark relief.",
      "publishedAt": "2024-06-09T04:01:48Z",
      "title": "Biden honors US war dead with a cemetery visit ending a French trip that served as a rebuke to Trump",
      "url": "https://apnews.com/451275981e578163c51b5a2562ae6694",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83fe3d019d0d46118b5de35baea5b958/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG, DARLENE SUPERVILLE and CLAUDIA LAUER",
      "description": "WILMINGTON, Del. (AP) — In a span of less than 48 hours this past week, first lady Jill Biden shuttled from a Normandy ceremony marking the 80th anniversary of the D-Day invasion in France to the front row of a Delaware courtroom, where Hunter Biden is on trial in a gun case, and then back to Paris for an elaborate state visit at Élysée Palace.",
      "publishedAt": "2024-06-09T11:50:21Z",
      "title": "Hunter Biden's family weathers a public and expansive airing in federal court of his drug addiction",
      "url": "https://apnews.com/cbaa8bad6c41e2ed0cc3aa61ae7de407",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fefaf667ae34d558a8dfe948859f2d7/3000.jpeg"
    },
    {
      "author": "ISABELLA VOLMERT",
      "description": "INDIANAPOLIS (AP) — An Ohio nonprofit that provides off-site Bible instruction to public school students during classroom hours says it will triple its programs in Indiana this fall after new legislation forced school districts to comply.",
      "publishedAt": "2024-06-09T04:01:46Z",
      "title": "A Christian group teaches public school students during the school day. Their footprint is growing",
      "url": "https://apnews.com/d7cf2b67b2ae3b7919e0a21f89ce80c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd7e2785afbc4d03be1041ab0df017cc/3000.jpeg"
    },
    {
      "author": "SAM METZ",
      "description": "EL AMRA, Tunisia (AP) — For many migrants who’ve long dreamed of Europe, one of the last stops is an expanse of olive trees on North Africa's Mediterranean coastline.But in Tunisia, less than 100 miles (161 kilometers) from the Italian islands that form the European Union’s outermost borders, for many that dream has become a nightmare.",
      "publishedAt": "2024-06-09T08:11:48Z",
      "title": "Stranded migrants confront violence and despair as Tunisia partners to keep them from Europe",
      "url": "https://apnews.com/e6162d4221062bf09dd13de690da9f91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/750916ef1bd942709a55bdbea8c6b0af/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Independent presidential candidate Robert F. Kennedy Jr. has reached 15% or more in three approved national polls. One more, and he will have met one of CNN's benchmarks to qualify for the debate June 27 with Democratic President Joe Biden and presumptive Republican nominee Donald Trump.",
      "publishedAt": "2024-06-09T11:59:09Z",
      "title": "Why Robert F. Kennedy's Jr.'s current presidential polling numbers might not hold up into November",
      "url": "https://apnews.com/71ffff6d34b0bad8b92cb8e82369d2e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddd729352226435c80e91876fb017524/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}