{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — More potential jurors were dismissed Tuesday from Donald’s Trump’s hush money case as lawyers worked for a second day to find a panel of New Yorkers to decide whether the Republican will become the first former president convicted of a crime.",
      "publishedAt": "2024-04-16T04:06:06Z",
      "title": "More potential jurors dismissed as Trump's hush money trial enters second day",
      "url": "https://apnews.com/dd1a8dcc063b7ad0fbe14af6e8724c2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adeef1acc8264ca3987358a807524840/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "NEW YORK (AP) — Donald Trump returned Tuesday to a New York courtroom as the jury selection process in his historic hush money trial enters a second day.",
      "publishedAt": "2024-04-16T14:01:38Z",
      "title": "The Latest | First wave of jury selection in Trump’s hush money trial enters questioning phase",
      "url": "https://apnews.com/8159b0f92877286be51c4c8a68b75bcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adeef1acc8264ca3987358a807524840/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israel’s military chief said Monday that his country will respond to Iran’s weekend attack, but he did not elaborate on when and how as world leaders urged against retaliation, trying to avoid a spiral of violence in the Middle East.",
      "publishedAt": "2024-04-15T17:38:44Z",
      "title": "Israel’s military chief says that Israel will respond to Iran’s weekend missile attack",
      "url": "https://apnews.com/aec3627b0b19b42dcafc89a7408dc296",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b3f1987e72e4e38b2294a003158f0df/1920.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — President Joe Biden’s latest plan for student loan cancellation is moving forward as a proposed regulation, offering him a fresh chance to deliver on a campaign promise and energize young voters ahead of the November election.",
      "publishedAt": "2024-04-16T12:47:02Z",
      "title": "Biden's latest plan for student loan cancellation moves forward as a proposed regulation",
      "url": "https://apnews.com/f469500465aefa66aca67e3b31b27430",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30082e7ce8da4fd68081f6f465c220f6/2459.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Defiant and determined, House Speaker Mike Johnson pushed back Tuesday against mounting Republican anger over his proposed U.S. aid package for Ukraine, Israel and other allies, and rejected a call to step aside or risk a vote to oust him from office.",
      "publishedAt": "2024-04-16T16:04:50Z",
      "title": "Facing a Republican revolt, House Speaker Johnson pushes ahead on US aid for Ukraine, allies",
      "url": "https://apnews.com/3f6f6af81c860eb8ce4104e61728a0fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdd9e5212c6d4c7393dab951eeef48ac/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden returns to his childhood hometown of Scranton on Tuesday to open three straight days of campaigning in Pennsylvania, capitalizing on the opportunity to work the battleground state while Donald Trump spends the week in a New York City courtroom for his first criminal trial.",
      "publishedAt": "2024-04-16T09:05:13Z",
      "title": "Biden returns to his Scranton, Pennsylvania, roots to pitch his plan for higher taxes on the rich",
      "url": "https://apnews.com/6b3de3a4807cbccdb5732442071f4f6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3888d5d37b3b4434a08431a9b527ab9a/2670.jpeg"
    },
    {
      "author": "MARK BAKER and ROD McGUIRK",
      "description": "SYDNEY (AP) — A teenager has been accused of wounding a Christian bishop and a priest during a church service in the second high-profile knife attack to rock Sydney in recent days, leaving communities on edge, leaders calling for calm and a besieged church urging against retaliation.",
      "publishedAt": "2024-04-16T06:49:31Z",
      "title": "Tensions rise in Australia after a bishop and priest are wounded in a knife attack in a church",
      "url": "https://apnews.com/126a140f1a38aeb9d63b2c7b744f588f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c63be21cf304bf68b2864befa33440a/1920.jpeg"
    },
    {
      "author": "SYLVIA HUI",
      "description": "LONDON (AP) — The British government's plan for a landmark smoking ban that aims to stop young people from ever smoking was expected to clear its first hurdle Tuesday despite vocal opposition from within Prime Minister Rishi Sunak’s Conservative Party.",
      "publishedAt": "2024-04-16T11:43:50Z",
      "title": "UK lawmakers will vote on a landmark bill to gradually phase out smoking",
      "url": "https://apnews.com/0780fd4fc9afcdc002a0544252ef907a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69e36ecab84345baac2b13be8fc18f12/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Treasury Secretary Janet Yellen warned Tuesday of potential global economic damage from rising tensions in the Middle East and pledged that the U.S.",
      "publishedAt": "2024-04-16T15:17:15Z",
      "title": "Yellen says Iran's actions could cause global 'economic spillovers' and warns of more sanctions",
      "url": "https://apnews.com/7643ff47d58f2a1d6314dae0f0a455bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/676fbb70f302426abf9ba233f8b16a6a/3000.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Whitey Herzog, the gruff and ingenious Hall of Fame manager who guided the St. Louis Cardinals to three pennants and a World Series title in the 1980s and perfected an intricate, nail-biting strategy known as \"Whiteyball,\" has died.",
      "publishedAt": "2024-04-16T15:45:58Z",
      "title": "Whitey Herzog, Hall of Fame manager who led St. Louis Cardinals to 3 pennants, dies at 92",
      "url": "https://apnews.com/1b7902014f0b4859af363f39dfb8206f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/508bcf21fe0c49fb96136c58d7d16cdf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}