{
  "articles": [
    {
      "author": "JONATHAN J. COOPER",
      "description": "A camera clicks. In a fraction of a second, the shutter opens and then closes, freezing forever the image in front of it.When the camera shutter blinked inside a jail in downtown Atlanta on Thursday, it both created and documented a tiny inflection point in American life.",
      "publishedAt": "2023-08-25T01:25:19Z",
      "title": "One image, one face, one American moment: The Donald Trump mug shot",
      "url": "https://apnews.com/839920116a244df3e55bdedf33820a80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a78038c24a84b58846d4024c2e25136/2700.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Kremlin on Friday rejected allegations it was behind a plane crash that is presumed to have killed mercenary leader Yevgeny Prigozhin, whose brutal fighters were feared in Ukraine, Africa and Syria and conducted a brief but shocking mutiny in Russia two months ago.",
      "publishedAt": "2023-08-25T09:28:55Z",
      "title": "Kremlin denies role in plane crash believed to have killed Russian mercenary leader Prigozhin",
      "url": "https://apnews.com/1237eb57870538e52938839bcaa6675f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41793bad9a7045c2990a8383fcee382e/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — The attacks range from the exotic — poisoned by drinking polonium-laced tea or touching a deadly nerve agent — to the more mundane of getting shot at close range. Some take a fatal plunge from an open window.",
      "publishedAt": "2023-08-25T07:51:33Z",
      "title": "Nerve agents, poison and window falls. Over the years, Kremlin foes have been attacked or killed",
      "url": "https://apnews.com/5d4f8506b89bfa8848fd88529701db7c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/127334838e6844988f81fb78277550b1/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "BARCELONA, Spain (AP) — Facing his possible removal from office, the president of the Spanish soccer federation refused to resign Friday despite an uproar for kissing a player on the lips without her consent after the Women’s World Cup final.",
      "publishedAt": "2023-08-25T05:42:41Z",
      "title": "Spanish soccer president refuses to resign despite kissing a player on the lips at Women's World Cup",
      "url": "https://apnews.com/3be367f0de6fbf1984e4885df0dcb00c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e402beb0f7c49d794c96662111f48f7/3000.jpeg"
    },
    {
      "author": "NATHAN ELLGREN and GARY FIELDS",
      "description": "WASHINGTON (AP) — Fencing and construction workers greet visitors to the Lincoln Memorial, signaling that — for the moment — the monument to the nation’s 16th president is a work in progress. And so is the nation Abraham Lincoln saved and the dream that Martin Luther King Jr.",
      "publishedAt": "2023-08-25T04:25:42Z",
      "title": "Visitors to Lincoln Memorial say America has its flaws but see gains made since March on Washington",
      "url": "https://apnews.com/3d293b2027b56094a906a6fac426d77f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/345269e4beae47c59a88b929b61e73dc/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI and JON GAMBRELL",
      "description": "TEHRAN, Iran (AP) — Seventy years after a CIA-orchestrated coup toppled Iran's prime minister, its legacy remains both contentious and complicated for the Islamic Republic as tensions stay high with the United States.",
      "publishedAt": "2023-08-25T05:11:13Z",
      "title": "A CIA-backed 1953 coup in Iran haunts the country with people still trying to make sense of it",
      "url": "https://apnews.com/3d391c0255308a7c13d32d3c88e5f54f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54f4985235b641a3a79064a13e503ea9/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and GENE JOHNSON",
      "description": "HONOLULU (AP) — Maui County sued Hawaiian Electric Company on Thursday over the fires that devastated Lahaina, saying the utility negligently failed to shut off power despite exceptionally high winds and dry conditions.",
      "publishedAt": "2023-08-24T20:57:28Z",
      "title": "Maui County sues power company, saying utility did not turn off electricity during deadly wildfires",
      "url": "https://apnews.com/c3513c2f8e451df6dab2e59a6c2f670d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75bd7f9f52284b30b474919d219cb504/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Republican support for gun restrictions is slipping a year after Congress passed the most comprehensive firearms control legislation in decades with bipartisan support, according to a poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-08-25T04:31:13Z",
      "title": "GOP support for gun restrictions slips a year after Congress passed firearms law",
      "url": "https://apnews.com/83c7ece4a3ffb6ff033a07737303d772",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a04779b8bc394556b55669cf077c98c2/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — Starting Friday, Europeans will see their online life change.People in the 27-nation European Union can alter some of what shows up when they search, scroll and share on the biggest social media platforms like TikTok, Instagram and Facebook and other tech giants like Google and Amazon.",
      "publishedAt": "2023-08-25T04:57:33Z",
      "title": "Europe is cracking down on Big Tech. This is what will change when you sign on",
      "url": "https://apnews.com/0fa3146efd38b88383899f9560c0ee5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f89c3a053f5a41c6abef83bff3086b34/3000.jpeg"
    },
    {
      "author": "KARL RITTER and JAN M. OLSEN",
      "description": "STOCKHOLM (AP) — It's a common term these days, deployed to describe the bond that victims of kidnappings or hostage situations sometimes develop with their captors: “Stockholm syndrome.” And it got its name 50 years ago this week, during a failed bank robbery in Sweden's capital.",
      "publishedAt": "2023-08-25T04:49:21Z",
      "title": "What is Stockholm syndrome? It all started with a bank robbery 50 years ago",
      "url": "https://apnews.com/023ddcd3a14ac00a0ba88feb838574b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc71c86f29f0428e84e9e6e60e51f1c3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}