{
  "articles": [
    {
      "author": null,
      "description": "Ex-federal prosecutors say a Justice Department request to unseal grand jury transcripts in the prosecution of chronic sexual abuser Jeffrey Epstein and his former girlfriend is unlikely to produce much, if anything, to satisfy the public's appetite for new revelations about the financier's crimes. Attorney Sarah Krissoff, who was an assistant U.S. attorney in Manhattan from from 2008 to 2021, calls a Justice Department request to unseal grand jury transcripts in the prosecutions of Epstein and imprisoned British socialite Ghislaine Maxwell a distraction. The request came as some supporters of President Donald Trump blasted his administration for reneging on a vow to make public key evidence.",
      "publishedAt": "2025-07-20T17:30:43Z",
      "title": "Request to unseal Epstein grand jury transcripts likely to disappoint",
      "url": "https://apnews.com/article/trump-jeffrey-epstein-grand-jury-justice-department-4634e5afceb8b1bb43f23558dfbb1d6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/244216f/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F97%2F54af201d3b5191270cbd5671941f%2Ff30ecc07726441eabdd5f84799c8349e"
    },
    {
      "author": null,
      "description": "The Israeli military has issued new evacuation warnings for central Gaza, an area where ground operations have been rare. This move cuts access between Deir al-Balah and southern cities. The announcement comes amid stalled ceasefire talks between Israel and Hamas in Qatar. Prime Minister Benjamin Netanyahu says military pressure aims to push Hamas into negotiations. The evacuation zone includes areas where aid organizations operate, though they have not commented. Gaza faces a severe humanitarian crisis, with over 58,000 Palestinians killed since the conflict began. Protests in Israel demand an end to the war and the return of hostages.",
      "publishedAt": "2025-07-20T08:07:31Z",
      "title": "Israel orders evacuations in central Gaza as ceasefire talks stall and military offensive widens",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-07-20-2025-2b494af89d710793bc6933f5ae437566",
      "urlToImage": "https://dims.apnews.com/dims4/default/148cf0b/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F93%2F941f8c4989836aace65c060aa519%2Fc4cf70f5ca6a483fac3126c67c96eafe"
    },
    {
      "author": null,
      "description": "Russia has launched one of its largest aerial assaults on Ukraine in months, targeting Kyiv overnight into Monday. Ukrainian officials report two deaths and 15 injuries, including a child. This escalation comes as the U.K. and Germany prepare to lead a NATO meeting on military support for Ukraine, including advanced air defense systems like Patriots. The British defense chief is expected to urge Ukraine’s Western partners at the meeting to launch a “50-day drive” to get Kyiv the weapons it needs to fight Russia’s bigger army and force Russian President Vladimir Putin to the negotiating table, according to a statement by the U.K. government.",
      "publishedAt": "2025-07-21T05:01:54Z",
      "title": "UK and Germany to chair NATO meeting on Trump's Ukraine arms plan",
      "url": "https://apnews.com/article/russia-ukraine-nato-trump-weapons-1284699f9fbcf5157c43dc88ad6994f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/afef7dc/2147483647/strip/true/crop/5070x2852+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Fe4%2F041e62d2f572d1922c6e92ccad32%2F7823a3b86dd64b8ea2b936562c75a2ca"
    },
    {
      "author": null,
      "description": "Japanese voters are casting ballots in a key parliamentary election. Prime Minister Shigeru Ishiba’s ruling coalition faces potential losses that could deepen political instability. Voters are deciding half the seats in the upper house, where Ishiba’s coalition needs 50 wins to maintain a simple majority. Media surveys predict setbacks for the coalition, which has already lost its lower house majority in October. Rising prices, stagnant wages, and stricter policies on foreigners dominate voter concerns. Populist parties, like Sanseito, are gaining traction with anti-foreigner and nationalist platforms. A poor result may pressure Ishiba to step down or seek new alliances.",
      "publishedAt": "2025-07-20T02:44:50Z",
      "title": "Japan's Ishiba faces a possible loss in upper house election",
      "url": "https://apnews.com/article/japan-politics-election-ishiba-parliament-vote-fcc2fb4cce609240d1c2369bf4090e26",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0c0a6b/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F6f%2F90372100064f33423c354c6a68c6%2F3739701872be4c98be5c4d6895e80d1c"
    },
    {
      "author": null,
      "description": "Texas Republicans are poised to redraw the state’s congressional map during a special session that starts Monday. It's a move urged by President Donald Trump as a way to help the GOP retain control of the U.S. House in next year’s midterm elections. The midcycle redrawing of political lines complicates Democrats’ plans to begin regaining power in Washington, and they have few avenues to push back. But the move also has risks for Republicans. Some Texas districts considered safe for conservatives will have to add more Democratic voters.",
      "publishedAt": "2025-07-20T11:32:53Z",
      "title": "Texas GOP will redraw House districts at Trump's urging, but there's a risk",
      "url": "https://apnews.com/article/trump-republicans-congress-redistricting-gerrymandering-texas-cb63c6b0102bc45a11515c6b33efc697",
      "urlToImage": "https://dims.apnews.com/dims4/default/a863539/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F6d%2F2dc539f32cd0648d90f79b7cc442%2Fa51ef60835fb43be9c6ad7f106b609bb"
    },
    {
      "author": null,
      "description": "A diverse group of volunteers from faith leaders to grandmothers to retired lawyers have been escorting people to immigration courts across the country. They provide moral support and bear witness if people are taken away by masked ICE officers. The Northwest Immigrant Rights Project in Seattle had so many wanting to volunteer that they created an online signup sheet, a training video and multilingual “Know Your Rights” sheets to hand out. As President Donald Trump's mass deportation campaign unleashes fear among asylum-seekers, immigrants and their families, these volunteers are helping families as people disappear into detention.",
      "publishedAt": "2025-07-20T12:38:51Z",
      "title": "Volunteers help migrants at hearings where ICE agents detain them",
      "url": "https://apnews.com/article/immigration-court-arrests-ice-bd145fae56c0d493ba52418cc66ef3b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/0835c79/2147483647/strip/true/crop/3902x2195+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2Fb2%2F3687c19d65009eaee23ce1d102be%2F887cded39d704f10a4e9df5f687a1947"
    },
    {
      "author": null,
      "description": "Families of missing loved ones face a unique and agonizing grief called ambiguous loss. Experts explain this as the pain of uncertainty when a loved one's fate is unknown, leaving families in emotional limbo. Rachel Ganz, whose husband vanished in Missouri during April floods, describes waking daily to unbearable questions about his fate. Similar anguish affects families worldwide, from Ukraine to Israel and Gaza, as they navigate loss without closure. Experts say the lack of rituals intensifies the pain. Support can come from acknowledging their struggle and offering silent presence, as words often fail to comfort in such profound uncertainty.",
      "publishedAt": "2025-07-21T04:06:02Z",
      "title": "It's called 'ambiguous loss,' and it plagues families of missing people",
      "url": "https://apnews.com/article/texas-flood-missing-ukraine-israel-gaza-help-12b6b59b169a2fac9146ede7caf906b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6674c4e/2147483647/strip/true/crop/4160x2340+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F2a%2Fa6c0f7a2fcfd225b829581a2c529%2Ff53c35690ac54beea0b1d6528e47d095"
    },
    {
      "author": null,
      "description": "Republicans are encountering some early headaches in Senate races viewed as pivotal to maintaining the party’s majority next year. Democrats still face the uphill battle in the midterms. Democrats need to net four seats to regain control, and most of the 2026 contests are in states that President Donald Trump easily won in November. But Democrats see reasons for hope in the Republicans’ challenges. They include a nasty primary in Texas that could jeopardize a seat Republicans have held for decades. And in states like North Carolina and Georgia, the GOP still lacks a clear field of candidates.",
      "publishedAt": "2025-07-20T11:49:21Z",
      "title": "What to watch as 2026 Republican Senate races take shape",
      "url": "https://apnews.com/article/trump-senate-2026-republican-democrats-control-candidates-f2a6eefe33c485e0ff184feecaa4c1de",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5db6ae/2147483647/strip/true/crop/4492x2527+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2Ffd%2F34c27108d72d1367f65d56d52f96%2Fccfbfdfdf078433296140c6bc5f33227"
    },
    {
      "author": null,
      "description": "Midway through summer, U.S. retailers are sweating a different season. It’s less than 22 weeks before Christmas, and American businesses that make and sell consumer goods usually nail down their holiday orders and prices at this time of year. But President Donald Trump's vacillating tariffs on imported goods have complicated the process. The consequences for consumers? Stores may not have the specific gift items customers want come November and December. Some retail suppliers and buyers scaled back their holiday lines. Businesses still are finalizing their prices but say shoppers can expect many popular products to cost more, though by how much depends partly on whether Trump’s latest round of “reciprocal” tariffs kicks in Aug. 1.",
      "publishedAt": "2025-07-20T09:10:06Z",
      "title": "How tariffs are shaping the holiday shopping season",
      "url": "https://apnews.com/article/holiday-shopping-2025-tariffs-prices-ad783aec433e8e4e03480afc338eae39",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec2176b/2147483647/strip/true/crop/5294x2978+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2Fb8%2Fc2bb03b3c1bfe239676ab221dae4%2F3b82841de37240d194a434ff199ed5cc"
    },
    {
      "author": null,
      "description": "Scottie Scheffler has begun the final round of what he hopes will be the third leg of the career Grand Slam. He took a four-shot lead into the final round of the British Open at Royal Portrush. Scheffler couldn't have asked for a better start. He hit his approach to 10 inches from the cup for a birdie. Rory McIlroy is in the group ahead of him. He was six shots behind and needs a career closing round to catch Scheffler. But he has all of Northern Ireland on his side, a massive crowd hoping for a dream ending.",
      "publishedAt": "2025-07-20T14:23:31Z",
      "title": "Scottie Scheffler rounding his way toward third leg of slam at British Open",
      "url": "https://apnews.com/article/british-open-scheffler-royal-portrush-mcilroy-3b81c067f945c4a1512bed5ef971419e",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb0fd3d/2147483647/strip/true/crop/6364x3580+0+332/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F78%2Fde45dc3b223697eadbf495bd904d%2F221821df88264363b0954622d049ee90"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}