{
  "articles": [
    {
      "author": "CEDAR ATTANASIO, JAKE OFFENHARTZ and JONATHAN MATTISE",
      "description": "NEW YORK (AP) — Colleges around the U.S. implored pro-Palestinian student protesters to clear out tent encampments with rising levels of urgency Monday as police arrested more demonstrators at the University of Texas and Columbia University said it was beginning to suspend students who defied an ultimatum to disband the encampment there.",
      "publishedAt": "2024-04-29T04:57:22Z",
      "title": "Columbia University begins suspending Israel-Hamas war protesters after ultimatum to disband camp",
      "url": "https://apnews.com/19ed919ff6ff9573a8add4ec67e26181",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6eaa436fd7fa4b84b60cc70b59c4096c/1920.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — Israeli officials sound increasingly concerned that the International Criminal Court could issue arrest warrants for the country’s leaders more than six months into the Israel-Hamas war.",
      "publishedAt": "2024-04-29T18:48:50Z",
      "title": "What is the International Criminal Court and why it has Israeli officials worried",
      "url": "https://apnews.com/1f683a6e2e150d91c415eb1d0a19a44d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fba81926024d4df8b3006ea35afa4766/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and LEE KEATH",
      "description": "CAIRO (AP) — The United States stepped up pressure for a cease-fire deal in Gaza on Monday as the secretary of state said a new proposal had been put to Hamas, whose officials were in Cairo talking to Egyptian mediators.",
      "publishedAt": "2024-04-29T09:10:57Z",
      "title": "Ahead of visit to Israel, US's Blinken presses Hamas to accept new proposal for Gaza cease-fire",
      "url": "https://apnews.com/d9b215f4aa1a745cdada48112d0fe4b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c7bef31fb074a5a9f9cce69635faae9/1920.jpeg"
    },
    {
      "author": "ERIK VERDUZCO and PETER SMITH",
      "description": "CHARLOTTE, N.C. (AP) — Three officers on a U.S. Marshals Task Force serving a warrant for a felon wanted for possessing a firearm were killed and five other officers were wounded in a shootout Monday at a North Carolina home, police said.",
      "publishedAt": "2024-04-29T18:40:33Z",
      "title": "3 law officers serving warrant are killed, 5 wounded in shootout at North Carolina home, police say",
      "url": "https://apnews.com/42d3e25ec6ec990634c9ac209e0f779a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/864dd10a384842f78779b16f384f1db9/1920.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM",
      "description": "CHARLESTON, W.Va. (AP) — West Virginia's and North Carolina's refusal to cover certain health care for transgender people with government-sponsored insurance is discriminatory, a federal appeals court ruled Monday in a case likely headed to the U.S.",
      "publishedAt": "2024-04-29T17:15:09Z",
      "title": "West Virginia's and North Carolina's transgender care coverage policies discriminate, judges rule",
      "url": "https://apnews.com/dbe97d7b305ec6c6d07f7c1e33beef00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4babb99a4ce44c21aa19696885eff5ae/2225.jpeg"
    },
    {
      "author": "CLAIRE RUSH and GENE JOHNSON",
      "description": "SALEM, Ore. (AP) — One of the winners of a $1.3 billion Powerball jackpot this month is an immigrant from Laos who has had cancer for eight years and had his latest chemotherapy treatment last week.",
      "publishedAt": "2024-04-29T17:15:55Z",
      "title": "Winner of $1.3 billion Powerball jackpot is an immigrant from Laos who has cancer",
      "url": "https://apnews.com/8200b538497c972624ace5e2fddf56e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a590072dc66045f6a88f933d1030de5a/1920.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT",
      "description": "The family of a Black teenager who was shot by a white homeowner when he mistakenly went to the wrong Kansas City, Missouri, address filed a lawsuit Monday, described by the family's attorney as an attempt to put pressure on the criminal trial later this year.",
      "publishedAt": "2024-04-29T20:16:16Z",
      "title": "Family of a Black teen who was shot after ringing the wrong doorbell files lawsuit against homeowner",
      "url": "https://apnews.com/d97c54d302212b002351bb72bd7e2562",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b97b0d5be17347769b8c1bd752d49ed9/3000.jpeg"
    },
    {
      "author": "BRITTANY PETERSON and SETH BORENSTEIN",
      "description": "DENVER (AP) — Last year’s snow deluge in California, which quickly erased a two decade long megadrought, was essentially a once-in-a-lifetime rescue from above, a new study found.Don’t get used to it because with climate change the 2023 California snow bonanza —a record for snow on the ground on April 1 — will be less likely in the future, said the study in Monday's journal Proceedings of the National Academy of Sciences.",
      "publishedAt": "2024-04-29T19:18:27Z",
      "title": "Study says California's 2023 snowy rescue from megadrought was a freak event. Don't get used to it",
      "url": "https://apnews.com/ef2e86e45c84b16b4ae63766f6372850",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2a51e2f35064eb38867023ec08befeb/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Since retiring two years ago, Joan Harris has upped her travel game.Once or twice a year, she visits her two adult children in different states. She's planning multiple other trips, including to a science fiction convention in Scotland and a Disney cruise soon after that, along with a trip next year to neolithic sites in Great Britain.",
      "publishedAt": "2024-04-29T10:00:31Z",
      "title": "Affluent Americans are driving US economy and likely delaying need for Fed rate cuts",
      "url": "https://apnews.com/9290216e89cbd7a3a0d2be66041aeaf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b38282ff4084fd081d32e08c228b4ec/3000.jpeg"
    },
    {
      "author": "OLEG CETINIC and BARBARA SURK",
      "description": "PARIS (AP) — French actor Gérard Depardieu will face a criminal trial in October over the alleged sexual assaults in 2021 of two women on the set of a film, prosecutors announced Monday.",
      "publishedAt": "2024-04-29T09:46:23Z",
      "title": "Actor Gérard Depardieu will be tried for alleged sexual assaults on a film set, prosecutors say",
      "url": "https://apnews.com/1a4970f3b7e177a6682314f87579a5dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/521dac1bad9a4fd39d0a64a0832a9e9d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}