{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, KAREEM CHEHAYEB and BASSEM MROUE",
      "description": "JERUSALEM (AP) — Israel approved a United States-brokered ceasefire agreement with Lebanon's Hezbollah on Tuesday that would end nearly 14 months of fighting linked to the war in the Gaza Strip.",
      "publishedAt": "2024-11-26T12:36:43Z",
      "title": "Israel and Lebanon's Hezbollah agree to a ceasefire to end nearly 14 months of fighting",
      "url": "https://apnews.com/aa165645d900a3d681ad127e05b0c561",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f15591b4dada4e1cbf276d7b76a67e55/1920.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "A ceasefire deal that could end more than a year of cross-border fighting between Israel and Lebanon's Hezbollah militant group won backing from Israeli leaders Tuesday, raising hopes and renewing difficult questions in a region gripped by conflict.",
      "publishedAt": "2024-11-26T22:01:56Z",
      "title": "What both sides are saying about the ceasefire deal between Israel and Lebanon's Hezbollah",
      "url": "https://apnews.com/3ed296f8317ecaa89c4e3548c75c9602",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25e424f411f84186ad1ecc8de50a6b8a/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — In an evening announcement, President-elect Donald Trump railed against Mexico and Canada, accusing them of allowing thousands of people to enter the U.S.Hitting a familiar theme from the campaign trail and his first term in office, Trump portrayed the country's borders as insecure and immigrants as contributing to crime and the fentanyl crisis.",
      "publishedAt": "2024-11-26T22:20:11Z",
      "title": "Trump vows tariffs over immigration. What the numbers say about border crossings, drugs and crime.",
      "url": "https://apnews.com/1528ef9c04f786478184a279ad26abb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2696e379122d4b2a890ac639d3180ac6/1920.jpeg"
    },
    {
      "author": "MICHELLE R. SMITH and JASON DEAREN",
      "description": "Pete Hegseth, Donald Trump's pick to lead the Department of Defense, sat in front of a screen with the headline: “Study Disproves Military Extremism Problem.”",
      "publishedAt": "2024-11-26T19:14:11Z",
      "title": "AP finds that a Pentagon-funded study on extremism in the military relied on old data",
      "url": "https://apnews.com/ea43535cd37abded5a0ed6aaba514115",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/881702db09044545b8360f6ca287995c/2720.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — One year after the Jan. 6, 2021, U.S. Capitol attack, Attorney General Merrick Garland said the Justice Department was committed to holding accountable all perpetrators “at any level” for “the assault on our democracy.” That bold declaration won't apply to at least one person: Donald Trump.",
      "publishedAt": "2024-11-26T21:04:58Z",
      "title": "How Trump's bet on voters electing him managed to silence some of his legal woes",
      "url": "https://apnews.com/32b894148b1fd7c4ad13f9dbf1ea9372",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1ffe008754447c69e8f20222b5dd89f/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON and CATHY BUSSEWITZ",
      "description": "NEW YORK (AP) — Walmart's sweeping rollback of its diversity policies is the strongest indication yet of a profound shift taking hold at U.S. companies that are re-evaluating the legal and political risks associated with bold programs to bolster historically underrepresented groups.",
      "publishedAt": "2024-11-26T22:17:53Z",
      "title": "Walmart's DEI rollback signals a profound shift in the wake of Trump's election victory",
      "url": "https://apnews.com/f2fc1ab086186ec6600c38950d8d2c74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b456149ddd94e8bb1b7d5069238412d/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE and ELÉONORE HUGHES",
      "description": "SAO PAULO (AP) — Brazil’s former far-right President Jair Bolsonaro was fully aware of and actively participated in a coup plot to remain in office after his defeat in the 2022 election, according to a Federal Police report unsealed Tuesday.",
      "publishedAt": "2024-11-26T20:14:03Z",
      "title": "Brazil’s Bolsonaro planned and participated in a 2022 coup plot, unsealed police report alleges",
      "url": "https://apnews.com/8281b3df34426a0b589ad869c2abd696",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d0e51629e044527a43ff9af76589116/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — Millions of Americans with obesity would be eligible to have popular weight-loss drugs like Wegovy or Zepbound covered by Medicare or Medicaid under a new rule the Biden administration proposed Tuesday morning.",
      "publishedAt": "2024-11-26T10:16:27Z",
      "title": "Biden proposes Medicare and Medicaid cover costly weight-loss drugs for millions of obese Americans",
      "url": "https://apnews.com/caaa2f888435af1d32bedb83e9ddbc0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55f3ae2339a341439771c497c5c09e92/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "People with HIV who need a kidney or liver transplant will be able to receive an organ from a donor with HIV under a new rule announced Tuesday by U.S.",
      "publishedAt": "2024-11-26T14:38:20Z",
      "title": "New rule allows HIV-positive organ transplants",
      "url": "https://apnews.com/5392b80df9c54b3799605483ce00d2dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec04afa4e37e49feb4b0a3218379ea91/3000.jpeg"
    },
    {
      "author": "SARAH PARVINI, GARANCE BURKE and JESSE BEDAYN",
      "description": "President-elect Donald Trump will return to power next year with a raft of technological tools at his disposal that would help deliver his campaign promise of cracking down on immigration — among them, surveillance and artificial intelligence technology that the Biden administration already uses to help make crucial decisions in tracking, detaining and ultimately deporting immigrants lacking permanent legal status.",
      "publishedAt": "2024-11-26T18:45:10Z",
      "title": "Surveillance tech advances by Biden could aid in Trump's promised crackdown on immigration",
      "url": "https://apnews.com/0a0c2387762a7342af5668660f0391b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af11cf21baf849ca8395e6f8882f6b84/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}