{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel faced pressure from some of its closest allies Wednesday over the plight of civilians in Gaza, where thousands streamed on foot out of the enclave’s north because of dwindling food and water and increased fighting in urban areas.",
      "publishedAt": "2023-11-08T06:39:16Z",
      "title": "Israel pressured by allies over plight of civilians in Gaza as thousands flee enclave's north",
      "url": "https://apnews.com/1d414b19e39fc46a5541d0541a880350",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6b1794d1c1a4409986591c6d608e39e/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Republicans will issue subpoenas on Wednesday to members of President Joe Biden's family, taking their most aggressive step yet in an impeachment inquiry bitterly opposed by Democrats that is testing the reach of congressional oversight powers.",
      "publishedAt": "2023-11-08T19:00:58Z",
      "title": "House Republicans will subpoena Hunter and James Biden as their impeachment inquiry ramps back up",
      "url": "https://apnews.com/37fe9652539c2c501d8b8bd8c3cc8901",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/caaabc54a8c04c1fa4741b31efa986b0/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Ivanka Trump testified Wednesday that she had no role in her father's personal financial statements, echoing her adult brothers about documents central to the civil fraud trial that could reshape Donald Trump's family business.",
      "publishedAt": "2023-11-08T05:28:04Z",
      "title": "Ivanka Trump testifies she wasn't involved in documents central to her father's civil fraud trial",
      "url": "https://apnews.com/1795382ea1d2c33faefbb40a0907feca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec5982115c614452958b5cb114c98868/2396.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — Voters threw their support behind abortion rights in Ohio, Virginia and elsewhere as Democrats look to springboard off those wins by using the issue to drive turnout and shape next year’s races for the White House, Congress and other elections.",
      "publishedAt": "2023-11-08T18:43:56Z",
      "title": "Democrats see abortion wins as a springboard for 2024 as GOP struggles to find a winning message",
      "url": "https://apnews.com/90255a62d83ad9f1d86b407c9455bb0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83680fe1d1834be8a42e8d4c877b78ef/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and JILL COLVIN",
      "description": "HIALEAH, Fla. (AP) — A City Council candidate in the Miami suburb of Hialeah used Donald Trump's image on campaign signs. At one polling station this week, many people wore red “Make America Great Again” hats or drove pickup trucks with flags bearing the former president's name.",
      "publishedAt": "2023-11-08T13:50:49Z",
      "title": "Trump will try to upstage the GOP debate with a rally targeting South Florida's Cuban community",
      "url": "https://apnews.com/4bf3422ae0803cbe13f97238270cb510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bb5afecc6ec4dc3a20fedc211174f84/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "MIAMI (AP) — Foreign policy and the Israel-Hamas war are expected to be prominent in Wednesday's third Republican primary debate, as a narrowing field of candidates seeks to cut into Donald Trump's lead without being able to challenge the former president in person.",
      "publishedAt": "2023-11-08T05:07:27Z",
      "title": "The third GOP debate will focus on Israel and foreign policy but also on who could beat Donald Trump",
      "url": "https://apnews.com/7c6ec4e9257fe3c166185eff94482686",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45b57e5eab1449b482716842a65fe024/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "A new version of the popular diabetes treatment Mounjaro can be sold as a weight-loss drug, U.S. regulators announced Wednesday.The U.S. Food and Drug Administration approved Eli Lilly's Zepbound, or tirzepatide.",
      "publishedAt": "2023-11-08T17:54:37Z",
      "title": "FDA approves new version of diabetes drug Mounjaro for weight loss",
      "url": "https://apnews.com/9718480e110eace3e91e0a2bcdc5e536",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0c14a8991f14c91b0e28c240a13dc3d/3000.jpeg"
    },
    {
      "author": null,
      "description": "RICHMOND, Va. (AP) — Republican David Owen defeated Democrat Susanna Gibson in a Virginia House of Delegates race that drew attention after revelations that Gibson engaged in sex acts with her husband on a pornographic website.",
      "publishedAt": "2023-11-08T18:44:44Z",
      "title": "GOP’s David Owen wins Virginia legislative race over Democratic opponent who livestreamed sex videos",
      "url": "https://apnews.com/63b4bb5357e94b538e7193b59ecec451",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec44bab011d148989b2f8bad47593862/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN and MEAD GRUVER",
      "description": "DENVER (AP) — The owner of a Colorado funeral home and his wife were arrested Wednesday after the decaying remains of at least 189 people were recently found at his facility.",
      "publishedAt": "2023-11-08T15:53:35Z",
      "title": "Colorado funeral home owner, wife, arrested on charges linked to the handling of at least 189 bodies",
      "url": "https://apnews.com/5748f57f94c8ae5365f2e950f56f5061",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1efb77c75e445e48df6925960e02e5b/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and MARY KATHERINE WILDEMAN",
      "description": "The badges said they were there to participate in negotiations to curb climate change. They stated affiliations like the government of Brazil, Indigenous organizations of the Amazon, the Climate Registry.",
      "publishedAt": "2023-11-08T14:31:40Z",
      "title": "Fossil fuel interests have large, yet often murky, presence at climate talks, AP analysis finds",
      "url": "https://apnews.com/d5e677b1c4e515f8944393907ac99457",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60c952be72724ef3996fbce93e9e0dfc/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}