{
  "articles": [
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — As law enforcement officers hung back outside Khloie Torres' fourth-grade classroom in Uvalde, Texas, she begged for help in a series of 911 calls, whispering into the phone that there were “a lot” of bodies and telling the operator: “Please, I don’t want to die.",
      "publishedAt": "2024-08-10T17:08:06Z",
      "title": "‘I don’t want to die,’ Uvalde student told 911 dispatcher during mass shooting",
      "url": "https://apnews.com/2eaabf46b09866b037b3a9dee81b9cd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f501da363fc94a4e97ac935002f27f2b/1920.jpeg"
    },
    {
      "author": "RIO YAMAT, DARLENE SUPERVILLE, WILL WEISSERT and JOSH BOAK",
      "description": "LAS VEGAS (AP) — Vice President Kamala Harris promised Saturday to work to eliminate taxes on tips paid to restaurant and other service industry employees, echoing a pledge that her opponent, Republican Donald Trump, has made, and marking a rare instance of political overlap from both sides.",
      "publishedAt": "2024-08-10T04:01:25Z",
      "title": "Harris pledges to work to end taxes on tips for service industry employees, echoing Trump vow",
      "url": "https://apnews.com/ac21118dbb24290e46d32ad9669507d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb6d76069a704e1faea2054b6129822d/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military ordered more evacuations in southern Gaza early Sunday after a deadly airstrike on a school-turned-shelter in the north killed at least 80 Palestinians, according to local health authorities.",
      "publishedAt": "2024-08-11T07:15:02Z",
      "title": "Israel broadens its evacuation orders after deadly strike on Gaza school-turned-shelter",
      "url": "https://apnews.com/18b0a73f930e3cc472a4207168b09ac1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34a7e5fd5ad141efb3db32d90cc35e1e/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "Former President Donald Trump’s presidential campaign said Saturday that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents.",
      "publishedAt": "2024-08-10T21:13:41Z",
      "title": "Donald Trump's campaign says its emails were hacked",
      "url": "https://apnews.com/036ffd3ed07cf3fe9fb74d4958808b65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe198d963fee4c0e8cfd490a8929d082/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — American gymnast Jordan Chiles must return the bronze medal she won in the Paris Olympics floor exercise after sport's highest court voided an on-floor appeal by Chiles' coach that vaulted Chiles to third, the International Olympic Committee confirmed Sunday.",
      "publishedAt": "2024-08-11T08:55:00Z",
      "title": "American gymnast Jordan Chiles must return bronze medal after court mandates score change, IOC says",
      "url": "https://apnews.com/d246c9d544faf9dfb44185ae3661e869",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34de8522f41647a69a90928edaf24621/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE and TATIANA POLLASTRI",
      "description": "SAO PAULO (AP) — Families of victims of an airliner crash in Brazil are gathering Sunday at a morgue and hotels in Sao Paulo as forensics experts work to identify the remains of the 62 people killed in the accident.",
      "publishedAt": "2024-08-11T05:17:03Z",
      "title": "Families of Brazilian plane crash victims gather in Sao Paulo as experts work to identify the dead",
      "url": "https://apnews.com/c92b1f4cb8fd27feaa073fd2553fcbcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8961f2053f5845948a958dddaf5f1a5e/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Days after Ukraine began a surprise military incursion into Russia’s Kursk border region, Zelenskyy broke the government’s silence on it late Saturday by indirectly acknowledging ongoing military actions to “push the war out into the aggressor’s territory” in his nightly address.",
      "publishedAt": "2024-08-11T07:00:19Z",
      "title": "Ukraine's president indirectly confirms daring military incursion onto Russian soil",
      "url": "https://apnews.com/256adcd7e5ad8beef792a08fc0f0fe8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a54c306508a4b8790b0bbcf5a9d026b/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, MICHAEL HILL, MARK SCOLFORO and PATRICK WHITTLE",
      "description": "The sun came out but the power stayed off in more than 100,000 homes and businesses across four states Saturday as Debby finally moved out of the U.S.After first arriving in Florida as a hurricane, the storm spent the better part of a week unleashing tornadoes and flooding, damaging homes and taking lives as it moved up the East Coast.",
      "publishedAt": "2024-08-10T04:10:21Z",
      "title": "Debby finally moves out of the US, though some flooding risk and power outages remain",
      "url": "https://apnews.com/a369f782a8e6fa18fdb7f722ade4b3c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f073224caf054c0d8714a2821cb79a49/1920.jpeg"
    },
    {
      "author": "JEROME PUGMIRE",
      "description": "PARIS (AP) — Sifan Hassan traded elbows with Tigst Assefa with 150 meters left in the women’s marathon, then passed her along the railing to win the race for her third distance medal of the Paris Games on Sunday.",
      "publishedAt": "2024-08-11T08:41:53Z",
      "title": "Sifan Hassan wins women's marathon at Paris Olympics, edging ahead of Tigst Assefa",
      "url": "https://apnews.com/1111dfc094501fec1d1bbbedce196e46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6ffb0de47014e85811b32702fb1b7bf/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — In French, there are no goodbyes. Instead, Olympic crowds from Paris to the surfing venue in Tahiti were saying “au revoir” — see you again — as the 2024 Games drew to a close Sunday.",
      "publishedAt": "2024-08-11T08:56:36Z",
      "title": "Paris and the Olympics have changed each other during their summer fling",
      "url": "https://apnews.com/1da49a20c1af4c83f58b370736c0e59b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54fc0489ce4649aa99ab9dcfa0f08302/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}