{
  "articles": [
    {
      "author": "WAFAA SHURAFA and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — Heavy fighting between Israeli troops and Palestinian militants on the outskirts of the southern Gaza city of Rafah has left crucial nearby aid crossings inaccessible and caused over 100,000 people to flee north, a United Nations official said Friday.",
      "publishedAt": "2024-05-10T10:46:06Z",
      "title": "Heavy fighting in Gaza's Rafah keeps aid crossings closed, sends 100,000 civilians fleeing",
      "url": "https://apnews.com/936d54a23f7db2e6e6f910216a703ab7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25498f226069455b85c7e169074b5a6d/3000.jpeg"
    },
    {
      "author": "JACK JEFFERY",
      "description": "DUMA, West Bank (AP) — Charred homes and cars dotting this hilltop village surrounded by olive groves are a searing reminder of Palestinians' vulnerability to rising violence from Israeli settlers.",
      "publishedAt": "2024-05-10T04:21:48Z",
      "title": "A West Bank village feels helpless after Israeli settlers attack with fire and bullets",
      "url": "https://apnews.com/71180e5579e4dde464672568e9669fe2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18912ae836464159a1a873edeab80060/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ, JENNIFER PELTZ, MICHAEL R. SISAK and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — The third week of testimony in Donald Trump’s hush money trial draws to a close Friday after jurors heard the dramatic, if not downright seamy, account of porn actor Stormy Daniels, while prosecutors gear up for their most crucial witness: Michael Cohen, Trump's former attorney.",
      "publishedAt": "2024-05-10T04:09:22Z",
      "title": "Third week of testimony in Trump's hush money trial draws to a close, with Michael Cohen yet to come",
      "url": "https://apnews.com/ddef05884265e4d6217b55a89304b878",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b6ee762256644f49573e52afc8de6da/1920.jpeg"
    },
    {
      "author": "JOHN RABY",
      "description": "CHARLESTON, W.Va. (AP) — For Derrick Evans, being part of the mob that stormed the U.S. Capitol wasn’t enough. The former West Virginia lawmaker wants to make his path to the halls of Congress permanent.",
      "publishedAt": "2024-05-10T04:15:11Z",
      "title": "One man was a Capitol Police officer. The other rioted on Jan. 6. They're both running for Congress",
      "url": "https://apnews.com/7659d9493956919c83adf474259ab303",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a446ae8783e440f081b2f4358388d5bc/3000.jpeg"
    },
    {
      "author": "STEPHEN SMITH and SUDHIN THANAWALA",
      "description": "FORT WALTON BEACH, Fla. (AP) — Just two days before a sheriff's deputy in Florida shot him dead, U.S. Air Force airman Roger Fortson called home to find out what his 10-year-old sister wanted for her birthday.",
      "publishedAt": "2024-05-09T23:01:41Z",
      "title": "Airman shot by deputy doted on little sister and aimed to buy mom a house, family says",
      "url": "https://apnews.com/834fce6cf0e02f3e2d6b169f628a4c0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76a37779987c4144a8715515b5caae99/3000.jpeg"
    },
    {
      "author": "JIM MUSTIAN",
      "description": "SHREVEPORT, La. (AP) — Mona Hardin has been waiting five long years for any resolution to the federal investigation into her son’s deadly arrest by Louisiana State Police troopers, an anguish only compounded by the fact that nearly every other major civil rights case during that time has passed her by.",
      "publishedAt": "2024-05-10T05:05:52Z",
      "title": "'Where's Ronald Greene's justice?': 5 years on, feds still silent on Black motorist's deadly arrest",
      "url": "https://apnews.com/4446d9b069803545247c610882951763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5499f813f2b94993b53ace406685eb28/2493.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "Police dismantled a pro-Palestinian tent encampment at the Massachusetts Institute of Technology early Friday and moved to clear protesters from University of Pennsylvania’s campus in Philadelphia, hours after police tear-gassed protesters and took down an encampment at the University of Arizona.",
      "publishedAt": "2024-05-10T10:02:57Z",
      "title": "Police dismantle pro-Palestinian encampment at MIT and move to clear Penn and Arizona protests",
      "url": "https://apnews.com/7d9cd0a1f4ac7eaca41b38de798a2217",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1256585300d447649cbce54fffeea307/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — The Vodou faithful sing, their voices rising above the gunfire erupting miles away as frantic drumbeats drown out their troubles.They pause to swig rum out of small brown bottles, twirling in unison as they sing in Haitian Creole: “We don’t care if they hate us, because they can’t bury us.”",
      "publishedAt": "2024-05-10T04:11:03Z",
      "title": "Shunned for centuries, Vodou grows powerful as Haitians seek solace from unrelenting gang violence",
      "url": "https://apnews.com/2ddd4922f6fdd071525e92879ede2f33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43725f4075694f17ab83256ae1f84881/1920.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE",
      "description": "CANOAS, Brazil (AP) — Hundreds of volunteers have set up a makeshift dog shelter in an abandoned, roofless warehouse in the Brazilian city of Canoas, one of the hardest hit by floods since last week.",
      "publishedAt": "2024-05-10T11:29:58Z",
      "title": "Makeshift shelter saves hundreds of dogs amid floods in southern Brazil",
      "url": "https://apnews.com/0b7726e09346b224acffa9584d18e5c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1a28886a30b4731986f0455e5aff86c/3000.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "ABUJA, Nigeria (AP) — Prince Harry and his wife, Meghan, arrived in Nigeria on Friday to champion mental health for young people affected by conflicts and to promote the Invictus Games, which the prince founded to aid the rehabilitation of wounded and sick servicemembers and veterans.",
      "publishedAt": "2024-05-10T08:16:14Z",
      "title": "Prince Harry and Meghan are in Nigeria to champion the Invictus Games and highlight mental health",
      "url": "https://apnews.com/18390f03771a78b39a8d9a6aa96bae4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f1ac9526ebc46f9920b174924efa46b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}