{
  "articles": [
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy accused Russia of trying to create ‘impression of a ceasefire’, saying Russian forces continued attacks despite President Vladimir Putin’s unilateral declaration of an Easter ceasefire. Zelenskyy reported on Sunday 59 shelling incidents, five assaults, and multiple drone strikes. He reiterated Ukraine’s offer to extend the truce for 30 days but stressed his country would respond based on real battlefield conditions. Meanwhile, Russian-installed officials in occupied Kherson say Ukraine has also violated the truce. Putin offered no details on how the ceasefire would be monitored.",
      "publishedAt": "2025-04-20T06:56:19Z",
      "title": "Russia is trying to create 'impression of a ceasefire,' Zelenskyy says",
      "url": "https://apnews.com/article/russia-ukraine-easter-ceasefire-zelenskyy-putin-attacks-934e5c2a493be32b605ddb84d955b34b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4eeb672/2147483647/strip/true/crop/11648x6552+0+1092/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fde%2F02c30476064785dd766f7bae63c7%2F6fe4ea41dbac4216b9bcc8b9744fd905"
    },
    {
      "author": "Hanna Arhirova",
      "description": "Dozens of Ukrainians have gathered at a bombed-out church in the country’s north to celebrate Easter Sunday, doubting a ceasefire with Russia is possible. Russian President Vladimir Putin unilaterally announced a temporary Easter truce from Saturday evening to midnight following Easter Sunday, citing humanitarian reasons. However, Ukrainian President Volodymyr Zelenskyy said Saturday night that Russian strikes continued. In the village of Lukashivka, the faithful marked the day in the courtyard of a destroyed church, symbolizing resilience. Priests and parishioners voiced doubt that a truce can be reached as efforts by the United States and others to broker a broader ceasefire have yet to yield results.",
      "publishedAt": "2025-04-20T09:29:29Z",
      "title": "Ukrainians mark Easter with little faith in Russia ceasefire",
      "url": "https://apnews.com/article/easter-ukraine-russia-war-ceasefire-zelenskyy-putin-741a336b842e12057a2ae3aa8f0ef4b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/a721591/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F0a%2Fe33b4576bbd7bcf44bb415c55da7%2F701d90300f3b4f44becab95b6a4a1092"
    },
    {
      "author": "Nicole Winfield",
      "description": "The Vatican is celebrating Easter without Pope Francis presiding. The 88-year-old pontiff continues his recovery from a near-fatal bout of double pneumonia. In his place, Cardinal Angelo Comastri, the retired archpriest of St. Peter’s Basilica, celebrated the open-air Mass before thousands of people in St. Peter’s Square. Francis has only appeared in public a handful of times since returning to the Vatican on March 23 after a 38-day hospital stay. He skipped the solemn services of Good Friday and Holy Saturday leading up to Easter. But he was expected to make an appearance on Sunday, according to the Mass booklet and liturgical plans released by the Vatican.",
      "publishedAt": "2025-04-20T09:03:38Z",
      "title": "Vatican's Easter Mass opens without Pope Francis",
      "url": "https://apnews.com/article/pope-vatican-easter-pneumonia-4b1182146a692479562b635a9723de2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/8c3bdcd/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F9e%2F4f0916a256f88f2c24dcc3b3dd89%2F5d91b226b67a42ad8249db8fb6cc5aa3"
    },
    {
      "author": "Nicole Winfield",
      "description": "U.S. Vice President JD Vance has met briefly with Pope Francis on Easter Sunday as the pontiff recovers from pneumonia. Vance’s motorcade entered Vatican City through a side gate and parked near Francis’ hotel residence while Easter Mass was being celebrated in St. Peter’s Square. Francis, who has greatly cut back his workload to recover, delegated the celebration of the Mass to another cardinal. Vance and the pope have tangled sharply over migration and the Trump administration’s plans to deport migrants en masse. Francis has made caring for migrants a hallmark of his papacy. Vance, who converted to Catholicism in 2019, met with the Vatican secretary of state and foreign minister on Saturday.",
      "publishedAt": "2025-04-20T09:53:41Z",
      "title": "JD Vance meets Pope Francis on Easter Sunday after flap over migration",
      "url": "https://apnews.com/article/pope-vance-us-migration-c9fc577cabff138de7bd8026133994fc",
      "urlToImage": "https://dims.apnews.com/dims4/default/b665a9e/2147483647/strip/true/crop/3840x2160+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F27%2F98992e4dfc6c55982bddf7376aec%2Fed36550dee764feba3d70b9a1f301212"
    },
    {
      "author": "Dee-Ann Durbin",
      "description": "Raising a child in America has never been cheap. In the first year alone, it costs an average of $20,384, according to parenting website Baby Center. But President Donald Trump's new tariffs will make it many times more expensive. The Juvenile Products Manufacturers Association estimates that 90% of the core products used to care for babies are made in Asia. That includes strollers, bottles, diaper pails and car seats The association has asked the Trump administration to exempt baby products from import taxes. Trump gave car seats and high chairs an exemption during his first administration, but it's unclear if he will do that again.",
      "publishedAt": "2025-04-20T10:40:01Z",
      "title": "Tariffs are likely to make having a baby cost more",
      "url": "https://apnews.com/article/baby-products-tariffs-strollers-car-seats-96496556c8913f521021d0c165eca977",
      "urlToImage": "https://dims.apnews.com/dims4/default/c740730/2147483647/strip/true/crop/5784x3254+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2Fc4%2Fe4f8841758bdd92f092136e438b9%2Fb2839855718e4d7eb3545c5589f54145"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Gaza’s Health Ministry says more than 90 people have been killed by Israeli strikes in the last 48 hours. The ministry does not differentiate between civilians and combatants. The dead include at least 15 people killed overnight, among them women and children, some of who were sheltering in a designated humanitarian zone, according to hospital staff. Israel is ramping up attacks across Gaza as it tries to pressure Hamas to release its hostages and disarm. Israel has said it plans to occupy large “security zones” inside Gaza.",
      "publishedAt": "2025-04-19T10:16:12Z",
      "title": "Israeli strikes on Gaza kill more than 90 Palestinians",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-19-2025-5e80a0efc0b267515ec88aec4c3672d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8f748b/2147483647/strip/true/crop/7633x4294+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2Fe9%2Fa9f3c44cebe120926face5ecd6ea%2F814c264b0c844b1c8305ecfea0730486"
    },
    {
      "author": "Ghaith Alsayed, Sally Abou Aljoud",
      "description": "Land mines and other unexploded remnants of war continue to pose a deadly threat across Syria, causing widespread casualties and long-term harm. Since the fall of Bashar Assad’s government in December 2024, the number of land mine-related incidents has surged, particularly as displaced people return to former frontline areas. Contamination from land mines and explosive devices has killed at least 249 people, including 60 children, and injured over 370 since Dec. 8, according to an international organization dedicated to enhancing the safety of aid workers.",
      "publishedAt": "2025-04-20T05:02:02Z",
      "title": "'I thought I'd died.' How landmines are continuing to claim lives in post-Assad Syria",
      "url": "https://apnews.com/article/syria-landmines-assad-amputations-03f8c5672c9dd943622cd622c8d80b6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/f6d6af3/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F37%2F2880e03580f6880d75d0d7703bf7%2F1836d6c0bcd14c50a8288f578a6a1a3a"
    },
    {
      "author": "Jack Brook",
      "description": "Fifteen years after the Deepwater Horizon disaster off the Gulf Coast, the effects of the largest oil spill in U.S. history are still being felt. Oil company BP has paid billions of dollars in damages, propelling ambitious coastal restoration projects. Yet cleanup workers and local residents who suffered health impacts they attribute to the spill have struggled to have their cases heard in court. Few have received significant compensation. Conservation groups say the spill catalyzed successful restoration work across the Gulf Coast, but are alarmed at the recent halt of a flagship land-creation project in southeast Louisiana.",
      "publishedAt": "2025-04-20T05:17:42Z",
      "title": "Deepwater Horizon oil spill anniversary: Status of BP lawsuits and coastal restoration in 2025",
      "url": "https://apnews.com/article/deepwater-horizon-oil-spill-bp-offshore-01247f5b76c028b09c4ef80d9f982a50",
      "urlToImage": "https://dims.apnews.com/dims4/default/69b2148/2147483647/strip/true/crop/4304x2421+0+324/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2Fe3%2Fc54070cdd527ad34be95447c2e10%2Ff0a9b7cbea924a628d1f42d85ae010da"
    },
    {
      "author": "Yuras Karmanau",
      "description": "Dozens of journalists in Belarus have been imprisoned in recent years under a crackdown by authoritarian President Alexander Lukashenko. According to Reporters without Borders, the country of 9.5 million remains Europe’s leading jailer of journalists. The crackdown intensified in 2020 when mass protests broke out after an election — widely denounced as fraudulent — kept Lukashenko in power. One count says 40 media workers are serving long sentences in harsh penal colonies that some compare to Soviet-era prisons. Many are deprived of medical care and isolated from their lawyers and relatives. Some have fled abroad. But after U.S. President Donald Trump returned to office, his administration halted foreign aid that provides vital funding for many independent Belarusian news outlets.",
      "publishedAt": "2025-04-20T04:05:34Z",
      "title": "An incessant crackdown in Belarus hurls dozens of independent journalists into harsh prisons",
      "url": "https://apnews.com/article/belarus-lukashenko-crackdown-journalists-1f4d123b2944d68d5b33d2baf29091f5",
      "urlToImage": "https://dims.apnews.com/dims4/default/c03fa7e/2147483647/strip/true/crop/6630x3729+0+345/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F31%2Fa149508e9eef894ce045a415c1e6%2Fe3d7e3bc59ae4a34946cd6aa65ebcade"
    },
    {
      "author": "Gene Johnson",
      "description": "Marijuana culture’s high holiday known as 4/20 falls this year on Easter, as well as the last day of Passover. That means cannabis fans can celebrate in some unusual ways, including an Easter nug hunt in Los Angeles, kosher-style THC gummies in New York and a blaze and praise drag brunch in Portland, Oregon. Some 300 people are expected to partake in the Easter nug scavenger hunt this weekend, aided by a mobile app leading them through participating dispensaries, trivia challenges and so-called stoner activities. The origin of the term 4/20 dates to the 1970s and a group of bell-bottomed buddies at a high school north of San Francisco who called themselves the Waldos.",
      "publishedAt": "2025-04-20T04:42:07Z",
      "title": "Marijuana holiday 4/20 coincides with Easter and Passover this year. Here's what to know",
      "url": "https://apnews.com/article/marijuana-cannabis-holiday-420-easter-sunday-cb03d644627c9fdde04ca9e3a3a619f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/f69c369/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F30%2F20461ba50ff12fad8e11b3dbe328%2F67034ecb5768403f973731ed776fac11"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}