{
  "articles": [
    {
      "author": "JACK JEFFERY, JULIA FRANKEL and WAFAA SHURAFA",
      "description": "DEIR AL BALAH, Gaza Strip (AP) — It was hours after sundown when the eight aid trucks drove from the makeshift jetty, cobbled together from tons of wreckage left across Gaza by months of war. The trucks were escorted by three vehicles carrying aid workers from the World Central Kitchen, the relief organization that had arranged the massive food shipment.",
      "publishedAt": "2024-04-11T04:05:13Z",
      "title": "A mission of mercy, then a fatal mistake: How an aid convoy in Gaza became Israel's target",
      "url": "https://apnews.com/2d08786a9839dfc402632c7ca745acca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08f5e2e3e8dd4a38971a170a1320fcb6/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, KAREEM CHEHAYEB and WAFAA SHURAFA",
      "description": "TEL AVIV, Israel (AP) — Israeli aircraft killed three sons of Hamas’ top political leader in the Gaza Strip on Wednesday, striking high-stakes targets at a time when Israel is holding delicate cease-fire negotiations with the militant group.",
      "publishedAt": "2024-04-10T07:24:52Z",
      "title": "An Israeli airstrike in Gaza kills 3 sons and 4 grandchildren of Hamas' top leader",
      "url": "https://apnews.com/fad770cbe77a7ae7d1de8568dbabd460",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8686cd149984727bdf6366a491307b2/1920.jpeg"
    },
    {
      "author": "ANITA SNOW and MORGAN LEE",
      "description": "PHOENIX (AP) — The Arizona Legislature devolved into shouts of “Shame! Shame!” on Wednesday as Republican lawmakers quickly shut down discussion on a proposed repeal of the state's newly revived 1864 law that criminalizes abortion throughout pregnancy unless a woman’s life is at risk.",
      "publishedAt": "2024-04-10T21:44:16Z",
      "title": "Shouts of ‘Shame! Shame!’ erupt in Arizona House as fight over abortion ban engulfs lawmakers",
      "url": "https://apnews.com/b43757f9a53848138c4d13e4315527ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6177fe5640e94ee49a180de541b5b798/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s prime minister and senior presidential officials offered to resign en masse Thursday after their ruling party suffered a crushing defeat in parliamentary elections in a huge blow to conservative President Yoon Suk Yeol.",
      "publishedAt": "2024-04-11T02:03:34Z",
      "title": "South Korea's prime minister and top presidential officials offer to resign after election defeat",
      "url": "https://apnews.com/8a538a2c99146aa6e2279d13b6a6ea3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48c52694824d4a168ac552cd999c0fb1/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Japanese Prime Minister Fumio Kishida will head to Capitol Hill on Thursday for an address to U.S. lawmakers meant to underscore the importance of keeping a strong partnership between the two countries at a time of tension in the Asia-Pacific and skepticism in Congress about U.S.",
      "publishedAt": "2024-04-11T04:04:16Z",
      "title": "Japanese Prime Minister Fumio Kishida to address Congress amid skepticism about US role abroad",
      "url": "https://apnews.com/3c22f1b1e8d0003f27ade8789a8c4a43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe7beac0b6864023a38267bae244a3f4/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — When he was elected two years ago as Manhattan’s first Black district attorney, Alvin Bragg spoke candidly about his unease with the job’s political demands. A former law professor, he’s more comfortable untangling complex legal questions than swaggering up to a podium.",
      "publishedAt": "2024-04-11T04:12:45Z",
      "title": "Manhattan DA Alvin Bragg says Trump prosecution isn't about politics",
      "url": "https://apnews.com/a164881f43b1d5064a528b36eada937e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd91801594e248118094eb89ea2a2f41/3000.jpeg"
    },
    {
      "author": "BRITTANY PETERSON and HANNAH SCHOENBAUM",
      "description": "SALT LAKE CITY (AP) — Workers hurriedly tried to shore up a rural Utah dam after a 60-foot (18-meter) crack sent water pouring into a creek and endangering the 1,800 residents of a downstream town.",
      "publishedAt": "2024-04-11T00:35:06Z",
      "title": "Water pouring out of rural Utah dam through 60-foot crack, putting nearby town at risk",
      "url": "https://apnews.com/230d25194b967f3b2bcd1e1c050517b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05015be87327491f9e5a08875706a59d/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "SMITHVILLE, Mo. (AP) — Before his transgender daughter was suspended after using the girls' bathroom at her Missouri high school. Before the bullying and the suicide attempts.",
      "publishedAt": "2024-04-11T04:07:24Z",
      "title": "As his trans daughter struggles, a father pushes past his prejudice. ‘It was like a wake-up’",
      "url": "https://apnews.com/f40d2799609d6f95565e7bf90daf18de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aebf2857fa2a435b9c4294d1bcfc931e/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "RUN TA EK, Cambodia (AP) — It's been more than a year since Yem Srey Pin moved with her family from the village where she was born on Cambodia's Angkor UNESCO World Heritage site to Run Ta Ek, a dusty new settlement about 25 kilometers (15 miles) away.",
      "publishedAt": "2024-04-11T04:03:16Z",
      "title": "Forced evictions or free choice? Cambodia's relocation of people from UNESCO site raises concerns",
      "url": "https://apnews.com/b13f9cb63d2a08bc6e9ad2afe8748ffe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cda225097524741879d136242799199/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "AUGUSTA, Ga. (AP) — More than golf's first major championship of the year, the Masters represents unification. This is the first time since July at the British Open the best players regardless of their tours compete against each other — same course, same tournament, same television network.",
      "publishedAt": "2024-04-10T19:41:34Z",
      "title": "Masters a reunion of the world's best players. But the numbers are shrinking",
      "url": "https://apnews.com/b227efc1bbb4ba14e098fe9a01c4fe54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5c26280c7b54cdfa1d9df041518cc6a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}