{
  "articles": [
    {
      "author": "COLLEEN LONG and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden dropped out of the 2024 race for the White House on Sunday, ending his bid for reelection following a disastrous debate with Donald Trump that raised doubts about his fitness for office just four months before the election.",
      "publishedAt": "2024-07-21T18:01:25Z",
      "title": "President Joe Biden drops out of the 2024 race after disastrous debate inflamed age concerns",
      "url": "https://apnews.com/ddffde72838370032bdcff946cfc2ce6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8e0d7c4f7c94755b33316b69b0b534d/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — When Kimberly Cheatle led the Secret Service's operations to safeguard the American president and other dignitaries, she said she would talk to agents in training about the “awesome responsibility” of their job.",
      "publishedAt": "2024-07-21T12:01:11Z",
      "title": "Secret Service chief noted a 'zero fail mission.' After Trump rally, she's facing calls to resign",
      "url": "https://apnews.com/48d384057a894b71859f945034092902",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7af54e705d5c4774a41392753d1da8a3/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "REHOBOTH BEACH, Del. (AP) — The Secret Service has acknowledged it denied some requests by Republican presidential nominee Donald Trump's campaign for increased security at his events in the years before the assassination attempt on him at a recent rally.",
      "publishedAt": "2024-07-21T12:59:48Z",
      "title": "The Secret Service acknowledges denying some past requests by Trump's campaign for tighter security",
      "url": "https://apnews.com/731d3b76c9900e167523ecfb2ec9a904",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fafdbe880d864a328888dcc49e2bdf32/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "BUTLER, Pa. (AP) — When gunshots echoed at the Trump rally where she was working, Butler Eagle reporter Irina Bucur dropped to the ground just like everyone else.",
      "publishedAt": "2024-07-21T06:07:12Z",
      "title": "The biggest of stories came to the small city of Butler. Here's how its newspaper met the moment",
      "url": "https://apnews.com/87c73207c4d4470e4d9deb13b2852572",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/804364d9db69483a85b6d4eb73d1ca38/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN and MICHAEL WAKIN",
      "description": "JERUSALEM (AP) — The Israeli military said it intercepted a missile fired from Yemen early Sunday, hours after Israeli warplanes struck several Houthi targets in the Arabian Peninsula country.The Israeli airstrikes — in response to a deadly Houthi drone strike on Tel Aviv — were the first time Israel is known to have responded to repeated Houthi attacks throughout its nine-month war against Hamas.",
      "publishedAt": "2024-07-21T08:47:03Z",
      "title": "Israel shoots down a missile fired from Yemen hours after a deadly Israeli strike on Houthi rebels",
      "url": "https://apnews.com/ddd11628677424d5fc21985c4764e22b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8fadef0b67a45a3893dc5ac6501a392/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Russia and Ukraine exchanged drone, missile and shelling attacks on Sunday. At least two people were killed in Ukrainian strikes on the partly Russian-occupied Donetsk region, Russian state media said, while Ukrainian officials said Russian strikes wounded at least five people.",
      "publishedAt": "2024-07-21T11:28:19Z",
      "title": "Civilians killed and wounded as Russia and Ukraine trade attacks. Russia claims gains in the east",
      "url": "https://apnews.com/07d84a704cc893481ea9275eeb60e7d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20b95db6230b4f179bb12b38936f0b21/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO and HALELUYA HADERO",
      "description": "NEW YORK (AP) — An owner of a consumer insights research firm couldn't pay her employees, make Friday's deadline to sign a contract for a new business or send key research to a key client. A psychiatrist, who runs a virtual mental health practice in Maryland, saw his business hobbled as some of his virtual assistants and therapists couldn't either make phone calls or log on to their computers.",
      "publishedAt": "2024-07-21T16:16:21Z",
      "title": "Small businesses grapple with global tech outages created by CrowdStrike",
      "url": "https://apnews.com/ad1e4f964d1560d50d08564cce9513d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fc8333b59c148e6a02b0f724603dde2/3000.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "The last time Congress passed a law to protect children on the internet was in 1998 — before Facebook, before the iPhone and long before today's oldest teenagers were born. Now, a bill aiming to protect kids from the harms of social media, gaming sites and other online platforms appears to have enough bipartisan support to pass, though whether it actually will remains uncertain.",
      "publishedAt": "2024-07-21T11:10:33Z",
      "title": "What to know about the Kids Online Safety Act and its chances of passing",
      "url": "https://apnews.com/ead646422cf84cef0d0573c3c841eb6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e16b3119f2104ba49bd39c1ac1dc13aa/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "BLACKSBURG, Va. (AP) — Wide-eyed piglets rushing to check out the visitors to their unusual barn just might represent the future of organ transplantation – and there’s no rolling around in the mud here.",
      "publishedAt": "2024-07-21T13:01:27Z",
      "title": "Meet some of the world's cleanest pigs, raised to grow kidneys and hearts for humans",
      "url": "https://apnews.com/ad400e7f1d30c2722456eb92e641449f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a240d15215ca44efa3f6c97440ad8f91/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — A year ago, the head of the Paris Olympics boldly declared that France's capital would be “ the safest place in the world \" when the Games open this Friday.",
      "publishedAt": "2024-07-21T06:06:23Z",
      "title": "With AI, jets and police squadrons, Paris is securing the Olympics — and worrying critics",
      "url": "https://apnews.com/34b168e7a511e22ce7119a91932d2759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bab5e4f907f4f9bad4510545eca526c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}