{
  "articles": [
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court seemed likely Monday to side with the Biden administration in a dispute with Republican-led states over how far the federal government can go to combat controversial social media posts on topics including COVID-19 and election security in a case that could set standards for free speech in the digital age.",
      "publishedAt": "2024-03-18T04:04:13Z",
      "title": "Supreme Court seems favorable to Biden administration over efforts to combat social media posts",
      "url": "https://apnews.com/132df16a8b086cd7ed72954f3b4c2c04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e29b3a8d1e84008bfa65d3784b09ea4/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — To no one's surprise, President Vladimir Putin secured another six years in power in a preordained election landslide that comes amid the harshest crackdown on the opposition and free speech since Soviet times.",
      "publishedAt": "2024-03-18T18:10:56Z",
      "title": "Takeaways from the predictable Russian election that gave Putin another 6 years in power",
      "url": "https://apnews.com/05fda6611fd31d424d4e347551d28af3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c2becca9fba4169a53707b93ae3058c/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "RAFAH, Gaza Strip (AP) — Famine is \"imminent” in northern Gaza, where 70% of people are experiencing catastrophic hunger, according to a report issued Monday that warned escalation of the war could push half of Gaza's total population to the brink of starvation.",
      "publishedAt": "2024-03-18T07:54:23Z",
      "title": "Report says famine is 'imminent' in northern Gaza as Israel launches another raid on main hospital",
      "url": "https://apnews.com/eefc526aec97821fe5f1e845801a6640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/400662388ac24158b7707081425edcc8/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, ZEKE MILLER and JULIA FRANKEL",
      "description": "WASHINGTON (AP) — Israeli Prime Minister Benjamin Netanyahu on Monday agreed to send a team of Israeli officials to Washington to discuss with Biden administration officials a prospective Rafah operation as each side is looking to make “clear to the other its perspective,” White House national security adviser Jake Sullivan said.",
      "publishedAt": "2024-03-18T15:58:45Z",
      "title": "Netanyahu agrees to send Israeli officials to Washington to discuss prospective Rafah operation",
      "url": "https://apnews.com/24b8ff4a6ce61ed410fe5a1beb640b4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e055863a3e5439696531a8f35068c36/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court on Monday continued to block, for now, a Texas law that would give police broad powers to arrest migrants suspected of illegally entering the U.S.",
      "publishedAt": "2024-03-18T21:16:54Z",
      "title": "Supreme Court extends block on Texas law that would allow police to arrest migrants",
      "url": "https://apnews.com/7de1b444bede16e5c502c3215087cfae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f04d6887f8145ccb26da2e6743f9b50/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump’s lawyers told a New York appellate court Monday that it's impossible for him to post a bond covering the full amount of a $454 million civil fraud judgment while he appeals, suggesting the former president's legal losses have put him in a serious cash crunch.",
      "publishedAt": "2024-03-18T15:17:47Z",
      "title": "Trump's lawyers say it is impossible for him to post bond covering $454 million civil fraud judgment",
      "url": "https://apnews.com/75ef3efb5b70d6ea43bea85b65ff7810",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9150914901174c4fb9d7ff3a47eb096b/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK and SUDHIN THANAWALA",
      "description": "ATLANTA (AP) — Former President Donald Trump and other defendants in Georgia's election interference case filed court papers Monday seeking to appeal a judge's ruling not to disqualify Fulton County District Attorney Fani Willis from their prosecution or dismiss the charges.",
      "publishedAt": "2024-03-18T21:04:17Z",
      "title": "Trump seeks to appeal decision not to disqualify district attorney from Georgia election case",
      "url": "https://apnews.com/ead99863d106387cc3113b44390d53ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/516232a901bf4dcca0e14d6a660cd580/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — The Environmental Protection Agency on Monday announced a comprehensive ban on asbestos, a carcinogen that kills tens of thousands of Americans every year but is still used in some chlorine bleach, brake pads and other products.",
      "publishedAt": "2024-03-18T15:31:39Z",
      "title": "EPA bans asbestos, a deadly carcinogen still in use decades after a partial ban was enacted",
      "url": "https://apnews.com/72b0fa8b36adedaff6000034d35c2acd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69a15ca42432463583b4935101124496/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "SAN FRANCISCO (AP) — Federal prosecutors on Monday painted one-time British tech star Mike Lynch as the ruthless mastermind of an $11 billion deal that defrauded Silicon Valley pioneer Hewlett Packard.",
      "publishedAt": "2024-03-18T04:01:24Z",
      "title": "Former British tech star depicted as scam artist, visionary in trial about HP's disastrous 2011 deal",
      "url": "https://apnews.com/29389e0ebe0c345c8160484ec4ca043c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53c05d3228684bb9bf67d1ce4bbfd5b2/3000.jpeg"
    },
    {
      "author": "NOAH TRISTER",
      "description": "March Madness this year comes at a time of great uncertainty in college sports. In addition to eyeing potential 5-12 upsets and trying to figure out which sleeper to put in the Elite Eight, fans also have to consider more existential questions about college basketball's future.",
      "publishedAt": "2024-03-18T01:17:51Z",
      "title": "March Madness brackets are here. Here's how to pick your teams",
      "url": "https://apnews.com/a434b9217393bb638db7e4338cbe3245",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4f2d1959b224665ac11f3ed64f1524b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}