{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Thousands of people have fled Gaza’s largest hospital as Israeli forces and Palestinian militants battle outside its gates, but hundreds of patients, including dozens of babies at risk of dying because of a power blackout, remained inside, health officials said Monday.",
      "publishedAt": "2023-11-13T07:30:24Z",
      "title": "Thousands flee Gaza hospital, health officials say, but many, including babies, still trapped",
      "url": "https://apnews.com/c98faefe9d5bb213d3e44cf9defd5990",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90dec0ba851443b097af7d32f11aadbe/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — In the early days and hours after the horrific Hamas attack on Israeli civilians on Oct.",
      "publishedAt": "2023-11-13T05:06:13Z",
      "title": "Biden's early certitude on Israel gives way to the complexities and casualties of a brutal war",
      "url": "https://apnews.com/218beac2a51cc55e5ba439fc986a31e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4a0843928e34970b0241bcf671236cc/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "A FRENCH ARMY BASE, France (AP) — Battle cries pierce the smoke and rat-a-tat-tat of gunfire as Ukrainian soldiers fight through and take enemy trenches and dugouts that hide gruesome, bloody remains.",
      "publishedAt": "2023-11-13T01:02:15Z",
      "title": "Military training efforts for Ukraine hit major milestones even as attention shifts to Gaza",
      "url": "https://apnews.com/f70fb490a8e4fd5ea472e3d81de7a176",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1aa8c1a00eee458486e9115b2ec43405/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Former British Prime Minister David Cameron made a shock return to high office on Monday, becoming foreign secretary in a major shakeup of the Conservative government that also saw the firing of divisive Home Secretary Suella Braverman.",
      "publishedAt": "2023-11-13T08:54:46Z",
      "title": "Ex-Prime Minister David Cameron makes shock return to UK government as foreign secretary",
      "url": "https://apnews.com/7ea6c89306a427cc70fba75bc386be79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f19cf8b4f28a47009a136b916df1eefe/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — A camera livestreaming the skyline of Gaza City captures streaks of light. Dash-cam video from a car in Israel spots a killer coming into view. A satellite identifies tank tracks in the dirt, and a mall security camera catches the moment a bomb in Gaza detonates.",
      "publishedAt": "2023-11-13T05:03:18Z",
      "title": "For news organizations, the flood of Gaza war video is proving both illuminating and troubling",
      "url": "https://apnews.com/c5e23399d190b3b1161eee90ee055ceb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43d0474d5b5540cfb4ab4ce08bb64e8d/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The United States is hosting the annual APEC summit of world leaders this week for the first time since 2011. Leaders from the 21-member Asia-Pacific Economic Cooperation group will gather in San Francisco to talk about how to better spur trade and economic growth across the Pacific region.",
      "publishedAt": "2023-11-13T05:08:19Z",
      "title": "The APEC summit is happening this week in San Francisco. What is APEC, anyway?",
      "url": "https://apnews.com/931284ccc2bf1b1dd9a1e437c5fc508f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21f62aed45ed4e47bc58c0f2619cc15f/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and STEVE PEOPLES",
      "description": "WASHINGTON (AP) — Surrounded by dozens of Democratic donors at a glass art gallery space in Chicago last week, President Joe Biden urged them to look beyond negative poll numbers and feel assured their donations were not being wasted.",
      "publishedAt": "2023-11-13T05:12:52Z",
      "title": "Biden sees hopeful signs for his reelection in Democrats' 2023 wins. Others in his party are worried",
      "url": "https://apnews.com/1d7d39dc723817125d7e65a5e1e1b1a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32cbd2b06b99476b8e612b86ffc8deca/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — Republican presidential candidate Tim Scott abruptly announced late Sunday that he was dropping out of the 2024 race, a development that surprised his donors and stunned his campaign staff just two months before the start of voting in Iowa's leadoff GOP caucuses.",
      "publishedAt": "2023-11-13T02:47:06Z",
      "title": "South Carolina Sen. Tim Scott abruptly ends 2024 presidential bid, shocking even his campaign staff",
      "url": "https://apnews.com/b9cc8fbeba57a123789d8d0484164e38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6b16c2fd88f41e59813a1f4d3a34b18/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Foiled in their longshot bid for an early verdict, Donald Trump’s lawyers will start calling witnesses of their own Monday in the New York civil fraud trial that threatens the former president’s real estate empire.",
      "publishedAt": "2023-11-13T05:31:28Z",
      "title": "Donald Trump Jr. returning to stand as defense looks to undercut New York civil fraud claims",
      "url": "https://apnews.com/4727a8f5345c1ab794d33d0c9bcc990f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9148dfe99d6b4aba8a4402a7d7e4b6a9/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Long-haul carrier Emirates opened the Dubai Air Show with a $52 billion purchase of Boeing Co. aircraft, showing how aviation has bounced back after the groundings of the coronavirus pandemic, even as Israel's war with Hamas clouds regional security.",
      "publishedAt": "2023-11-13T04:19:04Z",
      "title": "Long-haul carrier Emirates opens Dubai Air Show with $52 billion aircraft purchase from Boeing",
      "url": "https://apnews.com/d2ca068f0c88592c60eb9f11737baa46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24fb0b86a5844a1ca0ba4d8ae316f01c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}