{
  "articles": [
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — The recent ruling in Alabama that frozen embryos are legally considered children created a political firestorm after the decision halted treatment for many couples seeking to have families through fertility treatments.",
      "publishedAt": "2024-03-01T15:36:22Z",
      "title": "Alabama IVF ruling highlights importance of state supreme court races in this year's US elections",
      "url": "https://apnews.com/ea94bdadb79806885ec34d538b008655",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/deaa3df221cc4364a767a82bde00e7cd/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Prime Minister Benjamin Netanyahu rebuked a top Cabinet minister heading to Washington on Sunday for talks with U.S. officials, according to an Israeli official, signaling widening cracks within the country’s leadership nearly five months into its war with Hamas.",
      "publishedAt": "2024-03-03T11:50:29Z",
      "title": "Netanyahu rival’s visit to U.S. highlights cracks within Israel’s wartime leadership",
      "url": "https://apnews.com/3193becf71b8e5a533d38be7973795e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18114cbb290b469bb0ab294ffc2a69a0/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — It took 10 years and three rounds of in vitro fertilization for Rania Abu Anza to become pregnant, and only seconds for her to lose her five-month-old twins, a boy and a girl.",
      "publishedAt": "2024-03-03T14:27:25Z",
      "title": "After 10 years of trying, a Palestinian woman had twins. An Israeli strike killed them both",
      "url": "https://apnews.com/25282b273b92aec7fc75c3212f8d8e3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/614fb6ea950846228fd8badf8a685a30/3000.jpeg"
    },
    {
      "author": "BROOKE HESS and KEN RITTER",
      "description": "TRUCKEE, Calif. (AP) — A powerful blizzard that a meteorologist termed “as bad as it gets” howled in the Sierra Nevada mountains, closing a long stretch of Interstate 80 in Northern California, forcing ski resorts to shut down, and leaving thousands of homes without power.",
      "publishedAt": "2024-03-02T08:01:57Z",
      "title": "A massive blizzard howls in the Sierra Nevada. High winds and heavy snow close roads and ski resorts",
      "url": "https://apnews.com/d3da8b2ecfca73e2f885d88a83138ac7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb5489f5a27b422d84725fa2d64fe776/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO, ERIC TUCKER and ANTHONY McCARTNEY",
      "description": "WASHINGTON (AP) — Alexander Smirnov was cast by Republicans as one of the FBI’s most trusted informants, offering a “highly credible” account of brazen public corruption by Joe Biden that formed a pillar of the House impeachment investigation of the Democratic president.",
      "publishedAt": "2024-03-02T13:33:51Z",
      "title": "How clean is the dirt on Hunter Biden? A key Republican source is charged with lying to the FBI",
      "url": "https://apnews.com/113c1104052dbdc9302606f6d42c9939",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03a18021aaf94291b490bd733c0bdaa5/3000.jpeg"
    },
    {
      "author": "MUNIR AHMED",
      "description": "ISLAMABAD (AP) — Lawmakers in Pakistan’s National Assembly on Sunday elected Shehbaz Sharif as the country’s new prime minister for the second time as allies of imprisoned former premier Imran Khan in parliament shouted in protest, alleging rigging in last month’s election.",
      "publishedAt": "2024-03-03T08:47:27Z",
      "title": "Shehbaz Sharif becomes Pakistan's new premier as Imran Khan’s allies in parliament allege rigging",
      "url": "https://apnews.com/a6c17eacd7fc17026c41bc2d6bab97c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dae130da785403a9a0850c8869a812b/2420.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "Abraham “Snake” Ah Hee rides waves when the surf’s up and dives for octopus and shells when the water is calm. The lifelong Lahaina, Hawaii, resident spends so much time in the ocean that his wife jokes he needs to wet his gills.",
      "publishedAt": "2024-03-03T06:00:41Z",
      "title": "In Hawaii, coral is the foundation of life. What happened to it after the Lahaina wildfire?",
      "url": "https://apnews.com/4956ad8da00f70af3423f268fb6d7ca4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a56b512a52a406993f635da05ded430/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER",
      "description": "ALBION, Pa. (AP) — “You are the Lighthouse in someone’s storm,” reads the message above a mural of a sailboat bobbing on ocean waves under a cloud-studded azure sky. It's an unexpected slogan for a prison wall.",
      "publishedAt": "2024-03-03T10:53:07Z",
      "title": "Prisoners with developmental disabilities face unique challenges. One facility is offering solutions",
      "url": "https://apnews.com/0bc1a20446eb7eb63d1282a0d428829d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5d10ea74fe040639e49c3bdd17ab1a6/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN and JOANNA KOZLOWSKA",
      "description": "KYIV, Ukraine (AP) — The death toll rose to 10 on Sunday from a Russian drone strike that destroyed an apartment block in Ukraine’s southern port city of Odesa the previous day when a local official reported the body of a third child was pulled from the rubble, along with that of the child's mother.",
      "publishedAt": "2024-03-03T10:54:51Z",
      "title": "Death toll rises from Russian drone strike on Ukrainian port city, as China's envoy tours Moscow",
      "url": "https://apnews.com/8b487e61199be901156e3845d1a79398",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c00e5bc4262945269285776c749d75c8/1280.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — Thousands of senior doctors rallied in the South Korean capital, Seoul, on Sunday to express their support for junior doctors who have been on strike for nearly two weeks over a government plan to sharply increase the number of medical school admissions.",
      "publishedAt": "2024-03-03T07:26:19Z",
      "title": "South Korean doctors hold massive anti-government rally over medical school recruitment plan",
      "url": "https://apnews.com/9cd476721b94afd762a186f45329d7bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a7db3197ded4e48a8dd1d8b5faa0be2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}