{
  "articles": [
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — It was a routine part of a federal court hearing: The defendant was told not to discuss the case with any witnesses without lawyers present.But there's nothing routine about this case.",
      "publishedAt": "2023-08-04T04:24:40Z",
      "title": "Trump was told not to talk to witnesses in 2020 election conspiracy case. That could be a challenge",
      "url": "https://apnews.com/3bb89a1e458ffa92baeb24ad69a93925",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d4a6487bc1f49c0a9829a65ba5c2bc1/1920.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, ERIC TUCKER, NOMAAN MERCHANT and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Donald Trump pleaded not guilty Thursday to trying to overturn the results of his 2020 election loss, answering for the first time to federal charges that accuse him of orchestrating a brazen and ultimately unsuccessful attempt to block the peaceful transfer of presidential power.",
      "publishedAt": "2023-08-03T04:04:52Z",
      "title": "Trump pleads not guilty to federal charges that he tried to overturn the 2020 election",
      "url": "https://apnews.com/a79f2d3683c7591058635c9b3d870070",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff6c6714c30941f6a40eb0119f354ba8/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and EMMA BURROWS",
      "description": "KYIV, Ukraine (AP) — Ukrainian sea drones attacked a major Russian port on the Black Sea on Friday, damaging a naval ship, according to a Ukrainian official, the latest in a series of strikes inside Russia as Kyiv vowed to bring the fight home to them.",
      "publishedAt": "2023-08-04T07:18:42Z",
      "title": "Ukrainian official says drones hit naval ship in Russian port. It's the latest attack inside Russia",
      "url": "https://apnews.com/407a02ccfb2b1951c5afe9ec2269eed8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5840b1c965047bb8e40f529f0c4835f/2000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — U.S. employers added 187,000 last month, fewer than expected, as the higher interest rates continued to weigh on the economy. But the unemployment rate dipped to 3.5% in a sign that the job market remains resilient.",
      "publishedAt": "2023-08-04T04:03:01Z",
      "title": "US employers add a still-solid 187,000 jobs in June; unemployment dips to 3.5%",
      "url": "https://apnews.com/def1e5500e2852bf8ec3621b7270cd61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d128f821e0fd48f385e4ce3337d0c613/1920.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "PARKLAND, Fla. (AP) — Nine members of Congress began a tour of the blood-stained and bullet-pocked halls at Marjory Stoneman Douglas High School on Friday, shortly before ballistics technicians reenact the massacre that left 14 students and three staff members dead.",
      "publishedAt": "2023-08-04T04:30:46Z",
      "title": "Congressional delegation to tour blood-stained halls where Parkland school massacre happened",
      "url": "https://apnews.com/7fe723cdffec5a3d746843da940cf20f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10dd4518f7cc499998707b941a5182b6/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden has his zingers (“This is not your father’s Republican Party”). He’s got patriotism (“This is the United States of America, dammit”).",
      "publishedAt": "2023-08-04T04:04:49Z",
      "title": "Play it again, Joe. Biden bets that repeating himself is smart politics",
      "url": "https://apnews.com/b3540eef6f6c6bfa52d9fa3a95f6aff9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91bfdfa4a6524d1198266e15dbdbd3b8/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Niger’s military junta says it is severing military agreements with France, its former colonial ruler, firing some of the previous government’s key ambassadors and warning citizens of the West African nation to watch for foreign armies and spies.",
      "publishedAt": "2023-08-04T06:50:17Z",
      "title": "Mutinous soldiers in Niger sever French military ties while 'hostage' president pleads for US help",
      "url": "https://apnews.com/c4ff0bc653c8b73366705b19b8c74c3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85b6f035455e4f81b019a985c45a268b/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "PARIS (AP) — When Clarisse Agbégnénou won her sixth world judo title, confirming the reigning Olympic champion as one of the athletes to watch at next year's Paris Games, the French star's smallest but greatest fan was less wild about her mother's newest gold medal than she was about her breast milk.",
      "publishedAt": "2023-08-04T08:05:13Z",
      "title": "Breastfeeding Olympians want it all: Top careers and motherhood",
      "url": "https://apnews.com/3f07541f46f1842e2454c48cd45e0f0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da6b76c5ddfe463aa83c7ae85868d599/3000.jpeg"
    },
    {
      "author": "FARAI MUTSAKA",
      "description": "HARARE, Zimbabwe (AP) — Zimbabwe's main opposition leader accused President Emmerson Mnangagwa of violating the law and tearing apart independent institutions to cling to power.",
      "publishedAt": "2023-08-04T06:16:24Z",
      "title": "Zimbabwe's opposition leader tells AP intimidation is forcing voters to choose ruling party or death",
      "url": "https://apnews.com/b8525d9245df493e03bb4a4d3ec4c4f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3410ebfe30cc40e99cd86baf7e293ed9/1920.jpeg"
    },
    {
      "author": "TOM WITHERS",
      "description": "CANTON, Ohio (AP) — Aaron Rodgers has yet to throw a pass in a game for the New York Jets. He's already responsible for a long completion.Zach Wilson showed he can move New York's offense as a backup quarterback, but the Jets kicked off the Rodgers Era with a 21-16 loss to the Cleveland Browns on Thursday night in the Hall of Fame game.",
      "publishedAt": "2023-08-04T03:27:06Z",
      "title": "Wilson solid as a backup as Jets begin Rodgers Era with 21-16 loss to Browns in Hall of Fame game",
      "url": "https://apnews.com/bcda78cee0d336205c93e9fe32eaac02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8ddbcce5a0544a5850bbf315ce3d1ca/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}