{
  "articles": [
    {
      "author": "THOMAS BEAUMONT and JILL COLVIN",
      "description": "WATERFORD TOWNSHIP, Mich. (AP) — Former President Donald Trump railed against the judge who slapped him with a $355 million fine in his New York civil fraud trial and went after the long list of prosecutors with cases against him as he campaigned in Michigan Saturday night while facing penalties that, with interest, could exceed half-a-billion dollars.",
      "publishedAt": "2024-02-18T02:18:21Z",
      "title": "Trump rails against New York fraud ruling as he faces fines that could exceed half-a-billion dollars",
      "url": "https://apnews.com/f264eac7cbba97c4e83919642d42bc97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5cd5a1988234f14ac97add8342c54f4/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — On the witness stand last year, Donald Trump proclaimed: “I have a lot of cash.”",
      "publishedAt": "2024-02-17T23:11:19Z",
      "title": "Here's a look inside Donald Trump's $355 million civil fraud verdict as an appeals fight looms",
      "url": "https://apnews.com/38bc3a7f2ccb22555c026e9bf70fd5bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b88ac8bfa4af433580f8dacdecaae86b/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "Alexei Navalny’s spokesperson confirmed Saturday that the Russian opposition leader had died at a remote Arctic penal colony, saying he was “murdered,\" but it was unclear where his body was as his family and friends searched for answers.",
      "publishedAt": "2024-02-17T07:48:17Z",
      "title": "Kremlin foe Alexei Navalny's team confirms his death and says his mother is searching for his body",
      "url": "https://apnews.com/37da0915157576372d6493be7ad04b5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1323ef706de4158baf7baf7b0144462/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "RAFAH, Gaza Strip (AP) — Talks on a potential cease-fire deal in Gaza “have not been progressing as expected” in the past few days after good progress in recent weeks, key mediator Qatar said Saturday, as Israel's prime minister accused the Hamas militant group of not changing its ”delusional\" demands.",
      "publishedAt": "2024-02-17T11:36:29Z",
      "title": "Mediator says talks on Gaza not 'progressing as expected' after momentum in recent weeks",
      "url": "https://apnews.com/410725a8850f658950726772911f93e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92604523c6f74541b04b5970cb37bda9/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and BARRY HATTON",
      "description": "KYIV, Ukraine (AP) — Russia said its forces took complete control Saturday of a city in eastern Ukraine that was the focus of intense combat for months, a development that Moscow could use to boost morale as the second anniversary of its full-scale invasion of Ukraine approaches with the war largely at a stalemate.",
      "publishedAt": "2024-02-16T11:21:37Z",
      "title": "Russia takes control of a city in eastern Ukraine after Ukrainian troops withdraw",
      "url": "https://apnews.com/c31eb7439d1983532a3f940061efe6e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b59d65701f8441da9efb78233ebd332/3000.jpeg"
    },
    {
      "author": "MATT BROWN and JOCELYN NOVECK",
      "description": "Fulton County District Attorney Fani Willis is used to prosecuting high-profile, challenging cases. But as she parried questions about her own personal conduct from the witness stand against the legal teams for defendants her office has accused of election interference, many Black women recognized a dispiriting scene.",
      "publishedAt": "2024-02-17T05:14:29Z",
      "title": "Fani Willis' testimony evokes long-standing frustrations for Black women leaders",
      "url": "https://apnews.com/7ac852848693c0180cbbfc2af358bb52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e359af32b66e47c19c30b7a19f7caa61/3000.jpeg"
    },
    {
      "author": null,
      "description": "WAYCROSS, Ga. (AP) — Two young citizen-soldiers who became close friends after enlisting in the Army Reserve were remembered at funerals in southeast Georgia on Saturday, nearly three weeks after they died in a drone attack while deployed to the Middle East.",
      "publishedAt": "2024-02-17T21:02:23Z",
      "title": "Army Reserve soldiers, close friends killed in drone attack, mourned at funerals in Georgia",
      "url": "https://apnews.com/424d3449910d94004c8453bd60f70c2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/75ca2790f5004b329e707efe306bc930/2000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Some state governments and federal regulators were already moving to keep individuals' reproductive health information private when a U.S. senator’s report last week offered a new jolt, describing how cellphone location data was used to send millions of anti-abortion ads to people who visited Planned Parenthood offices.",
      "publishedAt": "2024-02-17T05:21:11Z",
      "title": "State governments looking to protect health-related data as it's used in abortion battle",
      "url": "https://apnews.com/87b5d36620c85ca9f6da4409755358f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4377e37ed8da48bcb4a1dbab5267a187/3000.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BANGKOK (AP) — Former Thai Prime Minister Thaksin Shinawatra was released on parole early Sunday from a Bangkok hospital where he spent six months serving time for corruption-related offenses.",
      "publishedAt": "2024-02-17T23:23:15Z",
      "title": "Former Thai Prime Minister Thaksin is released on parole after serving 6 months in a hospital",
      "url": "https://apnews.com/5a70a3401fcb17a7fe8dd2f5378c3e61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77d1e550a39e490c8037130ff85cfc1d/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "Many Americans believe the United States was founded as a Christian nation, and the idea is energizing some conservative and Republican activists. But the concept means different things to different people, and historians say that while the issue is complex, the founding documents prioritize religious freedom and do not create a Christian nation.",
      "publishedAt": "2024-02-17T13:04:04Z",
      "title": "What does it mean to claim the US is a Christian nation, and what does the Constitution say?",
      "url": "https://apnews.com/9286431a0ddde91c928e5d411795c1fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b25ba9652ac144e68fd14793a5e312e0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}