{
  "articles": [
    {
      "author": "TOM KRISHER, MIKE HOUSEHOLDER and JOHN SEEWER",
      "description": "DETROIT (AP) — Nearly one in 10 of America’s unionized auto workers went on strike Friday to pressure Detroit’s three automakers into raising wages in an era of big profits and as the industry begins a costly transition from gas guzzlers to electric vehicles.",
      "publishedAt": "2023-09-15T04:05:36Z",
      "title": "Workers strike at all 3 Detroit automakers, a new tactic to squeeze companies for better pay",
      "url": "https://apnews.com/7ce3ca9d94b911250d07556b7af376c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3422fc08c9b46d5bcdaca75a279e71a/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Pentagon's Central Command has ordered interviews of roughly two dozen more service members who were at the Kabul airport when suicide bombers attacked during U.S. forces' chaotic Afghanistan withdrawal, as criticism persists that the deadly assault could have been stopped.",
      "publishedAt": "2023-09-15T18:02:07Z",
      "title": "US military orders new interviews on the deadly 2021 Afghan airport attack as criticism persists",
      "url": "https://apnews.com/fb5725ccf8ba641f79dc7976e7b9db79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d821e77f791a44b5948b95d39a82f06b/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, ROBERT F. BUTAKY and PATRICK WHITTLE",
      "description": "BAR HARBOR, Maine (AP) — Fishermen removed lobster traps from the water and residents hauled hundreds of boats ashore — leaving some harbors looking like ghost towns — while utility workers from as far away as Tennessee began taking up positions Friday ahead of Hurricane Lee’s heavy winds, high seas and rain that's expected to span hundreds of miles (kilometers) of land and sea.",
      "publishedAt": "2023-09-15T04:04:56Z",
      "title": "Hurricane Lee targets New England and eastern Canada with wind, roiling seas and rain",
      "url": "https://apnews.com/870a13cf6f43a09086b1219cbabd3257",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/880f6cf6cbc94d409e9876e30754a17c/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — In the months since a single senator froze military promotions over the Pentagon’s abortion policy, the uniformed officers affected have been largely silent, wary of stepping into a political fray.",
      "publishedAt": "2023-09-16T04:21:14Z",
      "title": "Military officers begin to speak out on the harm done by Sen. Tuberville's holds on promotions",
      "url": "https://apnews.com/664c15d00d330b2b06b75ebeda8e3f01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f77fa65ebfe0497f8f7ad5944b9ac123/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER SHERMAN",
      "description": "MEXICO CITY (AP) — Mexico extradited Ovidio Guzmán López, a son of former Sinaloa cartel leader Joaquin “El Chapo” Guzmán, to the United States on Friday to face drug trafficking, money laundering and other charges, U.S.",
      "publishedAt": "2023-09-16T00:44:35Z",
      "title": "US: Mexico extradites Ovidio Guzmán López, son of Sinaloa cartel leader 'El Chapo,' to United States",
      "url": "https://apnews.com/9239796fda8db9cfa09fd65b139032cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5de1afb30e441da936aa0567d127c74/1941.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "MANCHESTER, N.H. (AP) — Once upon a time, the moderates, the mavericks and the underdogs in presidential politics had a chance to break through in New Hampshire.",
      "publishedAt": "2023-09-16T04:13:10Z",
      "title": "Republican presidential hopefuls generally overlook New Hampshire in effort to blunt Trump in Iowa",
      "url": "https://apnews.com/89396fa0bae736c98c551ecf2dc93713",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b953230ea0fd4a8199126aa4ca017fa7/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Federal prosecutors are seeking an order that would prevent Donald Trump from making “inflammatory” and “intimidating” comments about witnesses, lawyers and other people involved in the criminal case charging the former president with scheming to overturn the 2020 presidential election.",
      "publishedAt": "2023-09-15T20:00:43Z",
      "title": "Prosecutors seek narrow gag order on Trump in federal election case after ‘inflammatory’ comments",
      "url": "https://apnews.com/67ca118260af4761f41bcffd18d09855",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a536626fcfca4336addaf74f217ebfd0/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Two of President Joe Biden 's top goals — fighting climate change and expanding the middle class by supporting unions — are colliding in the key battleground state of Michigan as the United Auto Workers go on strike against the country's biggest car companies.",
      "publishedAt": "2023-09-16T04:28:38Z",
      "title": "Auto worker strike creates test of Biden's goals on labor and climate",
      "url": "https://apnews.com/d73f259bf5e9242340e912ad1e9b4aa9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b8fa889a7ea4e2e9efc1c41168b2301/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and REBECCA BOONE",
      "description": "WAILUKU, Hawaii (AP) — Authorities in Hawaii have adjusted the number of deaths from the deadly Maui wildfire down to at least 97 people.",
      "publishedAt": "2023-09-15T23:27:46Z",
      "title": "Hawaii officials say DNA tests drop Maui fire death count to 97",
      "url": "https://apnews.com/3dc505d4d83b6af5ee01fdaf173c4f01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cca7db807c34fc4a451dec35c2c66ec/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — New Mexico Gov. Michelle Lujan Grisham on Friday narrowed an order that broadly suspended the right to carry firearms in and around Albuquerque to apply only to public parks and playgrounds where children and their families gather.",
      "publishedAt": "2023-09-15T18:46:36Z",
      "title": "New Mexico governor amends order suspending right to carry firearms to focus on parks, playgrounds",
      "url": "https://apnews.com/cfc792724df5c6e653eefbce318c8d31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10250869097648b1969425058d4eb873/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}