{
  "articles": [
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith urged a federal appeals court Monday to reinstate the classified documents case against former President Donald Trump, saying a judge's decision that dismissed the prosecution was at odds with longstanding Justice Department practice and must be reversed.",
      "publishedAt": "2024-08-26T19:35:10Z",
      "title": "Special counsel urges appeals court to reinstate classified documents case against Trump",
      "url": "https://apnews.com/411e8e3b4d31923560effdd0d2082af4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af3fd819badb41e8937bb20ca3f9b984/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Fans of politics have another way to keep track of what's happening in the most competitive states in the country through a new service that collects and streams local newscasts.Swing State Election News, which began operation Monday, lets streamers choose from among 37 local television stations in Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin.",
      "publishedAt": "2024-08-26T20:21:44Z",
      "title": "Going local: A new streaming service peeks into news in 2024 election swing states",
      "url": "https://apnews.com/09fc97f64ad284f29134371a923a4d74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f31fcdc525d42b984b11e8eff20da1c/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — One of Gaza's last functioning hospitals has been emptying out in recent days as Israel has ordered the evacuation of nearby areas and signaled a possible ground operation in a town that has been largely spared throughout the war, officials said Monday.",
      "publishedAt": "2024-08-26T10:53:31Z",
      "title": "Hospital in central Gaza empties out as Israeli forces draw near",
      "url": "https://apnews.com/6d0101cf3dd45dcc7ecee35e0d716ac3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/970381b482f9416186953803d5393f8e/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "The campaigns of Vice President Kamala Harris and former President Donald Trump are arguing in advance of their high-stakes Sept.",
      "publishedAt": "2024-08-26T15:10:08Z",
      "title": "Harris and Trump squabble over muted mics at upcoming debate",
      "url": "https://apnews.com/83db9853877c5d00e46415ed98f46f25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/915507ec4a4846ab9c91cb601ec9a3b5/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel and Lebanon’s Hezbollah pulled back after an exchange of heavy fire over the weekend that briefly raised fears of an all-out war.",
      "publishedAt": "2024-08-25T09:44:52Z",
      "title": "It looked like Israel and Hezbollah had gone to war, but then they pulled back. Here's what to know",
      "url": "https://apnews.com/d3aeb1826cca2cbcda019f4778947e5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/970b1775b2bc47409a1e6f21837d1f93/1920.jpeg"
    },
    {
      "author": "CURT ANDERSON and JEFF MARTIN",
      "description": "A former Florida sheriff’s deputy charged with killing a Black U.S. Air Force senior airman who answered his apartment door while holding a gun pointed toward the ground was arrested Monday, officials said.",
      "publishedAt": "2024-08-26T21:19:17Z",
      "title": "Authorities arrest ex-sheriff’s deputy who fatally shot a Black airman at his home",
      "url": "https://apnews.com/850414e0baea006d36f2ed9b2f4a385d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cff7424e864468b94171f3365557192/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — French President Emmanuel Macron said Monday that the arrest in France of the CEO of the popular messaging app Telegram, Pavel Durov, wasn’t a political move but part of an independent investigation.",
      "publishedAt": "2024-08-26T14:45:18Z",
      "title": "France's Macron says arrest of the head of the Telegram messaging app wasn’t political",
      "url": "https://apnews.com/ae82ffd2197cf5684eb710e1b23650e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c1135b9f351437dba25a7196b3cd209/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Ukraine says it has a new long-range weapon to strike deep into Russia without asking permission from allies — a homegrown combination of missile and drone that the defense minister vowed Monday would provide “answers” to a wave of Russian bombings.",
      "publishedAt": "2024-08-26T09:22:41Z",
      "title": "Ukraine counts on new long-range weapon to bypass Western restrictions and hit deep into Russia",
      "url": "https://apnews.com/1f0a1eaf560bb2c1fd70ddd56a39968d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/491c5a25f2514692bfe44f9babe62ecc/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russia battered much of Ukraine on Monday, firing scores of missiles and drones that killed four people, injured more than a dozen and damaged energy facilities in attacks that President Volodymyr Zelenskyy described as “vile.”",
      "publishedAt": "2024-08-26T06:55:24Z",
      "title": "Russia's deadly overnight barrage of missiles and drones hits over half of Ukraine, officials say",
      "url": "https://apnews.com/25296eee7c9c394d07d806f44a2ec09e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/671344a434d94436a66a3552a797556a/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and MARK VANCLEAVE",
      "description": "FALCON HEIGHTS, Minn. (AP) — Visitors to the Minnesota State Fair sought relief from soaring temperatures under misters Monday while some Midwestern schools dismissed classes early or called off sports practices.",
      "publishedAt": "2024-08-26T19:08:34Z",
      "title": "Fair-goers scorched by heartland heat wave take refuge under misters as some schools let out early",
      "url": "https://apnews.com/370ab771f67da051f5dd99f3d7664a28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e65d3181d7c44bd93f1df8b7a0745bd/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}