{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "RAFAH, Gaza Strip (AP) — Hamas on Monday released two elderly Israeli women held hostage in Gaza as the United States expressed increasing concern that the escalating Israel-Hamas war will spark a wider conflict in the region, including attacks on American troops.",
      "publishedAt": "2023-10-23T06:39:25Z",
      "title": "Hamas frees two Israeli women as US advises delaying ground war to allow talks on captives",
      "url": "https://apnews.com/c0e7ec55428fedc97f75bdfdc0c0679a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6696b723e68b49e6965ffbf5cac68bdd/1920.jpeg"
    },
    {
      "author": "TARA COPP and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The Pentagon has sent military advisers, including a Marine Corps general versed in urban warfare, to Israel to aid in its war planning and is speeding multiple sophisticated air defense systems to the Middle East days ahead of an anticipated ground assault into Gaza.",
      "publishedAt": "2023-10-23T19:39:02Z",
      "title": "Pentagon rushes defenses and advisers to Middle East as Israel's ground assault in Gaza looms",
      "url": "https://apnews.com/1a906598be5baccc614897768b1824a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbcaa1b2657d4c77a029c60f1dd69cb7/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB and NAJIB JOBAIN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Yousra Abu Sharekh’s days begin in the southern Gaza Strip often after sleepless nights amid blaring ambulance sirens and the clamor of neighbors in the brief pause between relentless Israeli airstrikes.",
      "publishedAt": "2023-10-23T17:13:04Z",
      "title": "Two weeks ago she was thriving. Now, a middle-class mom in Gaza struggles to survive",
      "url": "https://apnews.com/24f139484879b0f388e864c6463d7e8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c082d2b1c31a4e3a9cd844b48a97dc24/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — On Day 20 without a House speaker, Republicans found themselves starting over Monday — bumbling ahead with few ideas about who will lead, what they are fighting over and when they will get Congress working again.",
      "publishedAt": "2023-10-23T16:44:07Z",
      "title": "It's Day 20 with no House speaker, and lower-level names seek Trump's support and race for the gavel",
      "url": "https://apnews.com/b4eceb0487c51de6695ecd1e49172f17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4e7cfdd072f4a428445ce55fa9dfa4b/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — At least seven people were killed Monday morning after a “superfog” of smoke from south Louisiana marsh fires and dense fog caused multiple massive car crashes involving 158 vehicles, authorities said.",
      "publishedAt": "2023-10-23T17:04:30Z",
      "title": "'Superfog' in Louisiana blamed for highway crashes that killed at least 7 people, officials say",
      "url": "https://apnews.com/d645f3494bc98b587c7d78ce09f90e3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6fdc4c3b1b544318aab3f0fec346f879/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — An off-duty pilot riding in the extra seat in the cockpit of a Horizon Air passenger jet tried to shut down the engines in midflight and had to be subdued by the crew, a pilot flying the plane told air traffic controllers.",
      "publishedAt": "2023-10-23T16:30:30Z",
      "title": "An off-duty pilot is accused of trying to shut down the engines of a Horizon Air jet in midflight",
      "url": "https://apnews.com/457e4bc7a1eca47842ce64aebe512c24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51a7a096a0154689908bae50e194c4e3/1920.jpeg"
    },
    {
      "author": "HOLLY RAMER and JILL COLVIN",
      "description": "CONCORD, N.H. (AP) — Former President Donald Trump compared himself to anti-apartheid activist Nelson Mandela on Monday as he cast himself as the victim of federal and state prosecutors he alleges are targeting him and his businesses for political reasons.",
      "publishedAt": "2023-10-23T15:23:49Z",
      "title": "Trump compares himself to Mandela and rails against Biden after filing for New Hampshire primary",
      "url": "https://apnews.com/8351611af96b54050f1e64d55d8648dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef1ecf9fb9844bbeba619ca4164b2394/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "WAYNE, Mich. (AP) — Throughout its 5-week-old strikes against Detroit’s automakers, the United Auto Workers union has cast an emphatically combative stance, reflecting the style of its pugnacious leader, Shawn Fain.",
      "publishedAt": "2023-10-23T10:00:44Z",
      "title": "UAW's confrontational leader makes gains in strike talks, but some wonder: Has he reached too far?",
      "url": "https://apnews.com/0e3e71f44f075fda066f499bb2165b48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f3a94d574814d2bacb5f92ca60435d7/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI and DAVID BILLER",
      "description": "BUENOS AIRES, Argentina (AP) — Argentina's economy minister and the anti-establishment upstart he faces in a presidential runoff next month began competing Monday to shore up the moderate voters they need.",
      "publishedAt": "2023-10-23T04:50:02Z",
      "title": "After presidential race surprise, Argentine economy minister and right-wing populist look to runoff",
      "url": "https://apnews.com/a603b4e3edf851cc47d0117738173b35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3bfd512fe3740f596abfa396fa9367f/1920.jpeg"
    },
    {
      "author": "DAN GELSTON",
      "description": "PHILADELPHIA (AP) — Merrill Kelly retired Kyle Schwarber, Trea Turner and Bryce Harper in order in the fifth inning, striking out Schwarber and Harper — October's biggest home run threats.When the pitcher reached the dugout, manager Torey Lovullo offered a handshake to signal the start was over after 90 pitches.",
      "publishedAt": "2023-10-24T00:20:33Z",
      "title": "Pham, Gurriel homer, Diamondbacks power past Phillies 5-1 to force NLCS Game 7",
      "url": "https://apnews.com/51e09d601593a0f08c922eaab1c53b4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb2369e85c604644b3945f37111dd1fa/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}