{
  "articles": [
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Taiwan's strongest earthquake in a quarter century rocked the island during the morning rush hour Wednesday, damaging buildings and highways and causing the deaths of four people.",
      "publishedAt": "2024-04-03T00:24:07Z",
      "title": "Taiwan's strongest earthquake in nearly 25 years damages buildings, leaving 4 dead",
      "url": "https://apnews.com/f086aac0c3082036d1ca77c01828fb28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9a32049689545288123362ed0dd065b/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Some of Israel's closest allies, including the United States, on Tuesday condemned the deaths of seven aid workers who were killed by airstrikes in Gaza — a loss that prompted multiple charities to suspend food deliveries to Palestinians on the brink of starvation.",
      "publishedAt": "2024-04-02T05:29:52Z",
      "title": "With famine looming, aid group halts food delivery in Gaza after Israeli strike kills 7 workers",
      "url": "https://apnews.com/9bdf66771b62af37d85a2800f71c0e6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9e48d772a7f47569275db291c0e53e9/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI and KAREEM CHEHAYEB",
      "description": "TEHRAN, Iran (AP) — Iran on Tuesday vowed to respond to an airstrike widely attributed to Israel that destroyed Iran’s Consulate in the Syrian capital of Damascus the previous day and killed 12 people, including two Iranian generals and a member of the Lebanese militant Hezbollah group.",
      "publishedAt": "2024-04-02T07:16:33Z",
      "title": "Tehran vows response after strike blamed on Israel destroyed Iran's Consulate in Syria and killed 12",
      "url": "https://apnews.com/f7a1af3a9fc67de1962d4f1589d7e9f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/253cf65cd23344669fe73ea97de7360b/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and CLAUDIA LAUER",
      "description": "In the moments before the cargo ship Dali rammed into the Francis Scott Key Bridge and sent it crumbling into the water, a flurry of urgent warnings crackled over radios and enabled police to block traffic from getting on the span, likely saving lives.",
      "publishedAt": "2024-04-03T04:11:02Z",
      "title": "Workers had little warning as Maryland bridge collapsed, raising concerns over safety, communication",
      "url": "https://apnews.com/f907ab712588d9ef0fdb58d85022bd95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d987555257b40a0b9808fa6f9242cce/3000.jpeg"
    },
    {
      "author": "GARY FIELDS and AMELIA THOMSON DEVEAUX",
      "description": "WASHINGTON (AP) — Despite the country's deep political polarization, most Americans share many core beliefs about what it means to be an American, according to a new poll.The poll from The Associated Press-NORC Center for Public Affairs Research found that about 9 in 10 U.S.",
      "publishedAt": "2024-04-03T04:03:20Z",
      "title": "Yes, we're divided. But new AP-NORC poll shows Americans still agree on most core American values",
      "url": "https://apnews.com/b1047da72551e13554a3959487e5181a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0123ba172e4448f0ae9694e929ade7e2/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI, ADRIANA GOMEZ LICON and JILL COLVIN",
      "description": "GRAND RAPIDS, Mich. (AP) — Donald Trump accused President Joe Biden of unleashing a “bloodbath” at the U.S.-Mexico border Tuesday, escalating his inflammatory rhetoric as he campaigned in two Midwestern swing states likely to be critical to the outcome of the 2024 election.",
      "publishedAt": "2024-04-02T04:08:14Z",
      "title": "Trump accuses Biden of causing a border 'bloodbath' as he escalates his immigration rhetoric",
      "url": "https://apnews.com/aa4b0912322dee09cf475ffad7c8cec7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b05b2ac402d40e48a56474c8ad6dd27/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER, DIDI TANG and FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — President Joe Biden and Chinese President Xi Jinping discussed Taiwan, artificial intelligence and security issues Tuesday in a call meant to demonstrate a return to regular leader-to-leader dialogue between the two powers.",
      "publishedAt": "2024-04-02T15:29:26Z",
      "title": "Biden and Xi discuss Taiwan, AI and fentanyl in a push to return to regular leader talks",
      "url": "https://apnews.com/c3317fae3e45b04cffcda5bb63adee56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7389071b8d2e4e7797cdc44bc3c886e2/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — A company that provides services for immigrants in federal detention was ordered Tuesday to pay more than $811 million in restitution and penalties in a lawsuit alleging it used deceptive and abusive tactics.",
      "publishedAt": "2024-04-02T22:52:02Z",
      "title": "Company helping immigrants in detention ordered to pay $811M+ in lawsuit alleging deceptive tactics",
      "url": "https://apnews.com/b44bdb95f23cfcd300026417f7125aed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccfbd8d111c04a9dbaed1b68da7513af/3000.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "The largest producer of fresh eggs in the U.S. said Tuesday it had temporarily halted production at a Texas plant after bird flu was found in chickens, and officials said the virus had also been detected at a poultry facility in Michigan.",
      "publishedAt": "2024-04-02T20:47:51Z",
      "title": "The largest fresh egg producer in the US has found bird flu in chickens at a Texas plant",
      "url": "https://apnews.com/dbae49f8786dda586036c1b86b9d0997",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/790f5e5b746946f29f8bfaeafd3fb5f2/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Houston’s police chief on Tuesday declined to say whether recent revelations that more than 264,000 cases filed with Houston police in the past eight years were dropped speak to broader problems within his agency that need to be fixed.",
      "publishedAt": "2024-04-02T23:43:33Z",
      "title": "Houston police chief won't say if thousands of dropped cases reveals bigger problems within agency",
      "url": "https://apnews.com/141f17e8be55e3045e036ec97dbb2973",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a992a430cd3443febaabcfba6e5118f4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}