{
  "articles": [
    {
      "author": "JOSH BOAK and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Going into November's election, neither Kamala Harris nor Donald Trump has a decisive edge with the public on the economy, turning an issue that was once a clear strength for Trump into the equivalent of a political jump ball.",
      "publishedAt": "2024-09-20T04:03:33Z",
      "title": "Voters split on whether Harris or Trump would do a better job on the economy: AP-NORC poll",
      "url": "https://apnews.com/dc80ac9e5d7da42900762910d5f0a283",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a97a9729b00540b9b75c439af8f00b5c/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and ZEKE MILLER",
      "description": "FARMINGTON HILLS, Mich. (AP) — Vice President Kamala Harris looked for a boost with persuadable and less-motivated voters as she participated in a livestream Thursday evening with former talk show host Oprah Winfrey to focus on her plans to cut costs for the middle class, restore a national right to abortion and address gun violence.",
      "publishedAt": "2024-09-20T00:03:05Z",
      "title": "Harris looks for boost from Oprah as part of digital-first media strategy",
      "url": "https://apnews.com/4ccf9234d489a61b5dacbde32fe015ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc7bf0f9f9324568ac194df55c4434ed/3000.jpeg"
    },
    {
      "author": "ZEINA KARAM and KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Chris Knayzeh was in a town overlooking Lebanon's capital when he heard the rumbling aftershock of the 2020 Beirut port blast.",
      "publishedAt": "2024-09-20T04:45:50Z",
      "title": "Thousands of exploding devices in Lebanon trigger a nation that has been on edge for years",
      "url": "https://apnews.com/6c51ff6c743ba63154b95790357d31df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cd9f2c844024df494fcb0385b0c6f05/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and MAJDI MOHAMMED",
      "description": "QABATIYA, West Bank (AP) — Israeli soldiers pushed three apparently lifeless bodies from rooftops during a raid in the northern part of the occupied West Bank on Thursday, according to an Associated Press journalist at the scene and video obtained by AP.",
      "publishedAt": "2024-09-19T22:43:48Z",
      "title": "Israeli soldiers pushed three apparently lifeless bodies from roofs during a West Bank raid",
      "url": "https://apnews.com/ae65d70f7da5db4603ba1b7c77f2ccd3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1ac99b2e34d48a4a186c9f590b8e454/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and CLAIRE GALOFARO",
      "description": "Yooree Kim marched into a police station in Paris and told an officer she wanted to report a crime. Forty years ago, she said, she was kidnapped from the other side of the world, and the French government endorsed it.",
      "publishedAt": "2024-09-20T04:32:58Z",
      "title": "Western nations were desperate for Korean babies. Now many adoptees believe they were stolen",
      "url": "https://apnews.com/67d6bb03fddede7dcca199c2e3cd486e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4039edc375df4db6a2c97298b2ec95b7/3000.jpeg"
    },
    {
      "author": "ALANIS THAMES",
      "description": "MIAMI (AP) — Shohei Ohtani looked up at a visiting crowd that turned out to cheer him and the Los Angeles Dodgers — and ended up getting to witness one of the greatest individual performances, and seasons, in major league history.",
      "publishedAt": "2024-09-19T21:01:57Z",
      "title": "Shohei Ohtani surpasses 50-50 milestone in spectacular fashion with a 3-homer, 2-steal game",
      "url": "https://apnews.com/f8141d695112175fc2b695a0e9e748d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0aa8062d0cc4a01a26b1846d5c63dcf/3000.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "FRANKFORT, Ky. (AP) — A judge in a rural Kentucky county was shot and killed in his courthouse chambers Thursday, and the local sheriff was charged with murder in the slaying, police said.The preliminary investigation indicates Letcher County Sheriff Shawn M.",
      "publishedAt": "2024-09-19T22:10:36Z",
      "title": "Kentucky sheriff charged in killing of judge at courthouse",
      "url": "https://apnews.com/f93419fff14202a88e28b5ea49b26810",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b3e1e7c4f8a54a6088a0bb68d065bbea/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "TIXTLA, México (AP) — Clemente Rodríguez has been documenting the long search for his missing son with tattoos. First, it was an ink drawing of a turtle — a symbol of 19-year-old Christian Rodríguez's school — with a smaller turtle on its shell.",
      "publishedAt": "2024-09-20T04:04:43Z",
      "title": "It's been a decade since 43 students disappeared in Mexico. Their parents still fight for answers",
      "url": "https://apnews.com/e2bf00122e95ac7e38e8391af47ec3e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a93e523613348c0aba142e6de158151/3000.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA and DEE-ANN DURBIN",
      "description": "CACONDE, Brazil (AP) — Silvio Almeida’s coffee plantation sits at an ideal altitude on a Brazilian hillside, whose clay-rich soil does well at retaining moisture from rainfall and a nearby reservoir.",
      "publishedAt": "2024-09-20T04:28:43Z",
      "title": "Brazil drought punishes coffee farms and threatens to push prices even higher",
      "url": "https://apnews.com/a6516a4b314e6ba7c11513c08afb6996",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51995a380285426082e357a4a85c3481/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "COLOMBO, Sri Lanka (AP) — Two years ago, tens of thousands of Sri Lankans rose up against their president and forced him to flee the country.",
      "publishedAt": "2024-09-20T04:18:14Z",
      "title": "Protests ousted Sri Lanka's last president. Ahead of new election, many are still waiting for change",
      "url": "https://apnews.com/e197eaf330758f2f35ece447a3f2739c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5709e01be6a74896976682da13cf3c32/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}