{
  "articles": [
    {
      "author": "ERIC TUCKER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — A U.N. court's order that Israel halt its offensive in the southern Gaza city of Rafah has deepened a disconnect with the United States over a military operation that faces mounting international condemnation but that American officials describe, at least for now, as limited and targeted.",
      "publishedAt": "2024-05-25T04:04:21Z",
      "title": "UN court order demanding that Israel halt its Gaza offensive further isolates the US position",
      "url": "https://apnews.com/403a7c44b248b828559253206140eae5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d637017d6a341a7923e10980868f936/3000.jpeg"
    },
    {
      "author": "YESICA FISCH",
      "description": "JERUSALEM (AP) — Scuffles between Israeli police and protesters erupted in Tel Aviv on Saturday after thousands gathered to demonstrate against the government and demand that it bring back the hostages being held by Hamas in Gaza.",
      "publishedAt": "2024-05-26T00:28:52Z",
      "title": "Scuffles erupt between police, protesters demanding return of Israeli hostages still held in Gaza",
      "url": "https://apnews.com/41c0e8c110323eb5d57f811ea18492cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a446d34492646a9aef6f71c240f6784/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Donald Trump was booed repeatedly while addressing the Libertarian Party National Convention on Saturday night, with many in the crowd shouting insults and decrying him for things like his COVID-19 policies, running up towering federal deficits and lying about his political record.",
      "publishedAt": "2024-05-25T04:07:07Z",
      "title": "Trump, accustomed to friendly crowds, confronts repeated booing during Libertarian convention speech",
      "url": "https://apnews.com/816e3209fdf993c2ba7f6caed0ebcdb7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8a9db37a42f4779a3b0dca96edf31e6/1920.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "OKLAHOMA CITY (AP) — Scattered severe storms continued in Oklahoma and forecasters issued a tornado warning for some parts of the state Saturday night, as some heat records were broken during the day in South Texas and people were warned of triple-digit temperatures over the long holiday weekend.",
      "publishedAt": "2024-05-25T14:10:16Z",
      "title": "Tornado warning issued for parts of Oklahoma amid severe storms as heat scorches South Texas",
      "url": "https://apnews.com/9918414160c0e892ce468b598e33b922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9668a19427c42ed87592b68b859e1e9/1920.jpeg"
    },
    {
      "author": "PATRICIA LUNA",
      "description": "SANTIAGO, Chile (AP) — A Chilean judge on Saturday ordered a volunteer firefighter and a former forestry official detained for allegedly planning and causing a mammoth forest fire in the Valparaiso region that caused 137 deaths and made 16,000 people homeless in February.",
      "publishedAt": "2024-05-26T01:49:02Z",
      "title": "Chile accuses volunteer firefighter and ex-forestry official with causing huge fire that killed 137",
      "url": "https://apnews.com/ab431b293fe71d9c0e5b0381778b8ffc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f78eaf601ea471ea76e84500e86d49a/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Richard M. Sherman, one half of the prolific, award-winning pair of brothers who helped form millions of childhoods by penning the instantly memorable songs for \"Mary Poppins,\" \"The Jungle Book\" and \"Chitty Chitty Bang Bang\" — as well as the most-played tune on Earth, \"It's a Small World (After All)\" — has died.",
      "publishedAt": "2024-05-25T22:24:31Z",
      "title": "Richard M. Sherman, who fueled Disney charm in 'Mary Poppins' and 'It's a Small World,' dies at 95",
      "url": "https://apnews.com/19bb30ab3af649c480153133c1faa307",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cf3dd6cfb6847db8db6b0ffbad715c4/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — Chinese and Japanese leaders were set to arrive in Seoul and meet with South Korea’s president separately on Sunday, a day before they gather for their first trilateral meeting in more than four years.",
      "publishedAt": "2024-05-26T03:44:25Z",
      "title": "Chinese and Japanese leaders travel to South Korea for their first trilateral meeting since 2019",
      "url": "https://apnews.com/48b0f5a9019ff030f69edc045bdc2166",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bba95f929a814fdc9f0544efb3570288/3000.jpeg"
    },
    {
      "author": "BEN NUCKOLS",
      "description": "When Balu Natarajan became the first Indian American champion of the Scripps National Spelling Bee in 1985, a headline on an Associated Press article read, “Immigrants’ son wins National Spelling Bee,” with the first paragraph noting the champion “speaks his parents’ native Indian language at home.”",
      "publishedAt": "2024-05-26T04:58:26Z",
      "title": "National Spelling Bee reflects the economic success and cultural impact of immigrants from India",
      "url": "https://apnews.com/b14ba87533dfcd8af813de568ee5958f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d47672141b34313bf9643a059fa19c8/2857.jpeg"
    },
    {
      "author": "ERIN HOOLEY",
      "description": "LISLE, Ill. (AP) — It was late morning when The Morton Arboretum's Senior Horticulturist Kate Myroup arrived at the Children’s Garden with a special guest: a rare, blue-eyed female Magicicada cassini cicada, spotted earlier in the day by a visitor.",
      "publishedAt": "2024-05-26T04:02:39Z",
      "title": "Rare blue-eyed cicada spotted during 2024 emergence at suburban Chicago arboretum",
      "url": "https://apnews.com/69d611e641a2279a09909042e2f84c26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e12faa4f7f794188ac6eb4f9bab9249a/3000.jpeg"
    },
    {
      "author": "DOUG FERGUSON",
      "description": "Two-time PGA Tour winner Grayson Murray died Saturday morning at age 30, one day after he withdrew from the Charles Schwab Cup Challenge at Colonial.",
      "publishedAt": "2024-05-25T19:37:20Z",
      "title": "Grayson Murray dies at age 30 a day after withdrawing from Colonial, PGA Tour says",
      "url": "https://apnews.com/1e7b61efd74e69b99b141b613c5072dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/665e51df3e6c420593cf2f5d0853b07e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}