{
  "articles": [
    {
      "author": "LISA MASCARO",
      "description": "President Donald Trump’s most controversial Cabinet nominees have flooded the zone Thursday in back-to-back-to-back confirmation hearings. Conspiracy theories about vaccines. Secret meetings with dictators. An enemies list. It was a blockbuster showing like nothing the Senate has seen in modern memory. Robert F. Kennedy Jr., Tulsi Gabbard and Kash Patel all faced grilling over their views and promises in testy exchanges. The whirlwind day — Day 10 of the new White House — unfolded as Trump himself was unloading racist theories about how diversity initiatives caused the tragic airplane-and-helicopter crash outside Washington’s Ronald Reagan National Airport.",
      "publishedAt": "2025-01-31T00:32:36Z",
      "title": "Takeaways from a wild day of confirmation hearings",
      "url": "https://apnews.com/article/kennedy-gabbard-patel-trump-confirmation-hearings-takeaways-6fed092408f8c120af8f4541d7c3c3d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed93658/2147483647/strip/true/crop/7289x4100+0+379/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F1f%2Fdb9c66d7927e5c59568280876893%2F7b9920766cbd4347896da3f3afc80ea1"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "The Senate has confirmed billionaire Doug Burgum as interior secretary. Lawmakers on Thursday voted 79-18 in favor of Burgum. President Donald Trump tapped the two-term North Dakota governor to spearhead Republican ambitions to boost fossil fuel production. He succeeds Deb Haaland, who curbed oil and gas lease sales and promoted wind and solar projects for the Biden administration. Trump wants to move in the opposite direction and Burgum is tasked with making it even easier for energy companies to tap fossil fuel resources. That’s raised alarms among environmentalists and some Democrats as greenhouse gas emissions from fossil fuels bake the planet.",
      "publishedAt": "2025-01-30T23:53:47Z",
      "title": "Senate confirms Doug Burgum as interior secretary",
      "url": "https://apnews.com/article/burgum-trump-interior-secretary-energy-a123dea9f2a1f03a1ed95f316593740d",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad86ff7/2147483647/strip/true/crop/5648x3177+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2Fdc%2F1c7ee3930ac1c6cd6d9752012bd4%2F7170cd453bfd49beb5fbd91c8507ee77"
    },
    {
      "author": "BRIAN SLODYSKO, JACK DURA",
      "description": "Emails obtained by The Associated Press reveal Doug Burgum as North Dakota governor catered to the whims of oil and gas executives while leveraging those connections to expand his political profile. Now that Burgum is nominated to be President Donald Trump's secretary of the Interior Department, those relationships are drawing a closer look. Many of the oil and gas companies Burgum developed a rapport with are certain to want things from him following his Senate confirmation to the post. A spokesman says the Republican routinely \"met with job creators and leaders who generated opportunities for the people of North Dakota.”",
      "publishedAt": "2025-01-30T19:19:28Z",
      "title": "Big Oil wants a lot from Trump. It has an ally in Doug Burgum, the president's Interior pick",
      "url": "https://apnews.com/article/trump-oil-gas-industry-burgum-interior-ally-3ebe90d0207c99866365d72e74eda371",
      "urlToImage": "https://dims.apnews.com/dims4/default/3036c65/2147483647/strip/true/crop/3919x2204+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F3c%2F5c8d5c81827ff6851d180683e262%2F13fcd57aa8244418b00e484dbc24cf6e"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER, MATT BROWN",
      "description": "Kash Patel, President Donald Trump’s pick to lead the FBI, is insisting to deeply skeptical Democrats that he does not have an “enemies list” and that the bureau under his leadership would not seek retribution against the president’s adversaries or launch politically motivated investigations. The reassurances were aimed at blunting a persistent line of attack from Democrats. Throughout Thursday’s hearing they confronted Patel with a vast catalog of his incendiary statements. They said those statements raise alarming questions about his loyalty to the president, including referring to some of the Jan. 6 rioters as “political prisoners” and calling for a purge of anti-Trump “conspirators” in the government and news media.",
      "publishedAt": "2025-01-30T05:02:15Z",
      "title": "Trump's FBI chief pick insists he has no 'enemies list'",
      "url": "https://apnews.com/article/trump-fbi-patel-senate-f3465219e265df1598e15da3ad0e8a07",
      "urlToImage": "https://dims.apnews.com/dims4/default/99ae12b/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F2c%2Fb8a7f1a8e49548a96b477e6e83ba%2F6a9c862d010c4198ad9521b837504808"
    },
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump says his 25% tariffs on Canada and Mexico are coming on Saturday. Trump also said he'll \"probably” decide on Thursday night whether to include oil from those countries as part of his import taxes. Trump says his decision will be based on whether the price of oil charged by the two trading partners is fair, although the basis of his threatened tariffs pertains to stopping illegal immigration and the smuggling of chemicals used for fentanyl.",
      "publishedAt": "2025-01-30T21:31:12Z",
      "title": "Trump says tariffs on Canada and Mexico coming Saturday, and he's deciding whether to tax their oil",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-oil-afb915762af6994573353135bcd30a1b",
      "urlToImage": "https://dims.apnews.com/dims4/default/5f9ff0b/2147483647/strip/true/crop/5972x3359+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F41%2Fca9ff1ea6cf5b00a2d122dd2ca12%2F1b87a6b81db74b08b57a4fae30221634"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "U.S. officials have approved a new type of pain drug designed to eliminate the risks of addiction and overdose associated with opioids. The Food and Drug Administration approved the pill from Vertex Pharmaceuticals for acute pain that often occurs after surgery or injuries. It's the first new pharmaceutical approach to treating pain in 20 years. But the medication’s modest effectiveness shows just how challenging it is to find new ways of managing pain. Vertex's drug was better than a dummy pill at reducing pain after surgery, but it didn't outperform opioid treatment. Vertex is studying the drug for a number of other conditions, including chronic nerve pain.",
      "publishedAt": "2025-01-30T23:14:57Z",
      "title": "FDA approves painkiller designed to eliminate risks of addiction associated with opioids",
      "url": "https://apnews.com/article/nonopioid-painkiller-fda-vertex-pharmaceuticals-b1dd4276fce3d88ff32e3062e95f408f",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ba05f4/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F49%2F970a8ba2eadcdcd2b746bd25c406%2Fea492e086d5b421fbff942a1501a9bf8"
    },
    {
      "author": "WAFAA SHURAFA, MOHAMMAD JAHJOUH, JOSEPH KRAUSS",
      "description": "Hamas-led militants have freed eight hostages as part of the ceasefire in the Gaza Strip. But the chaotic handover of some of the captives drew an angry protest from Israel. The hostages were shuttled through a rowdy crowd of thousands by masked militants. Israel later began releasing 110 Palestinian prisoners after the swap was initially put on hold by Prime Minister Benjamin Netanyahu. He demanded that mediators assure the safe exit for hostages going forward. He said later that he had received that commitment.",
      "publishedAt": "2025-01-30T04:28:08Z",
      "title": "Hamas frees 8 more hostages as Gaza truce holds",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-30-2025-3cc7131495a60ce2bda73ca691abb7c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c933c2/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F9d%2F286fab43dcec5f965678f83ac650%2Fb79513435ee64f128a6dea69bdb2dcd8"
    },
    {
      "author": "LOLITA C. BALDOR, TARA COPP, BRIAN MELLEY, SARAH BRUMFIELD",
      "description": "All 64 people aboard an American Airlines jet that collided with an Army helicopter were feared dead. Officials said it was likely to be the worst U.S. aviation disaster in almost a quarter century. At least 28 bodies were pulled from the icy waters of the Potomac River after the helicopter apparently flew into the path of the jet late Wednesday as it was landing at Ronald Reagan National Airport near Washington. The plane carried 60 passengers and four crew. Three soldiers were aboard the helicopter. John Donnelly is the fire chief in the nation’s capital. He says authorities are now switching from a rescue operation to a recovery operation.",
      "publishedAt": "2025-01-30T10:01:53Z",
      "title": "Everyone on American Airlines plane crash near D.C. is feared dead",
      "url": "https://apnews.com/article/ronald-reagan-national-airport-crash-62adba7fb1f546b4cf1716e42b86482b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0c2301/2147483647/strip/true/crop/5620x3161+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Fd4%2F8d8bbdbaacffe15a983d00c58f3f%2F5a3a7f1b080e49888ba17020f8beccc5"
    },
    {
      "author": "RYAN J. FOLEY, JIM MUSTIAN, MICHAEL BIESECKER",
      "description": "The airspace around Washington, D.C., is congested and complex — a combination aviation experts have long worried could lead to catastrophe. Those fears materialized Wednesday night when an American Airlines plane collided with a military helicopter, taking the lives of 67 people, including three soldiers and more than a dozen figure skaters. Even in peak flying conditions, experts say, the airspace around Reagan Washington National Airport can challenge the most experienced pilots, who must navigate hundreds of other commercial planes, military aircraft and restricted areas around sensitive sites.",
      "publishedAt": "2025-01-31T01:00:34Z",
      "title": "Pilots have long worried about DC's complex, crowded airspace",
      "url": "https://apnews.com/article/american-airlines-5342-blackhawk-reagan-national-airport-81a43f2ba5cc59cbe9273fa593f1e9cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/d58b903/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Fe2%2Fa0234435897aa9a3205223fc102b%2Ff5fe6030d3884a3595d58a5a66a16c10"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "Five Thai hostages have been released after 15 months of captivity in the Gaza Strip. On Thursday, dozens of doctors, nurses and representatives from Israel and Thailand waved flags, sang, and cheered as the five Thai citizens stepped off a military helicopter and entered a hospital outside Tel Aviv, where they will spend a few days undergoing medical tests and recuperating. Three Israelis were also released on Thursday, and Israel released 110 Palestinian prisoners in the exchange. The five Thai nationals were in fair health, doctors said. Hamas militants kidnapped 31 Thai nationals during the Oct. 7, 2023, assault on southern Israel, making them the largest group of foreigners held captive.",
      "publishedAt": "2025-01-30T22:55:22Z",
      "title": "Israeli doctors say five released Thai hostages in 'fair' health after 15 months of captivity",
      "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-hostage-release-thai-28c08783c4fc6113632470ed5a591299",
      "urlToImage": "https://dims.apnews.com/dims4/default/f978e12/2147483647/strip/true/crop/1477x831+0+77/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F85%2F1172fae6819e83a5ffccc4406d33%2F18687b8ce52c4b7d97570e1b8cb2ec78"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}