{
  "articles": [
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — When actor Casey Likes watched “Back to the Future” growing up, his mom would always say he reminded her a lot of the film’s star, Michael J.",
      "publishedAt": "2023-07-31T14:43:14Z",
      "title": "The stars of Broadway's 'Back to the Future' musical happily speed into the past every night",
      "url": "https://apnews.com/d09748d42c598f4c362c3fcbde76a458",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25fe8805b5944470b5614c6df615f753/3000.jpeg"
    },
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "The Justice Department has asked a federal judge overseeing the criminal case against former President Donald Trump in Washington to step in after he released a post online that appeared to promise revenge on anyone who goes after him.",
      "publishedAt": "2023-08-05T02:59:03Z",
      "title": "Prosecutors ask judge to issue protective order after Trump post appearing to promise revenge",
      "url": "https://apnews.com/71cd642e876c47fff4e1283c15f8ca01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f7955bd9fa14f9d84d6d7d56691e48d/2915.jpeg"
    },
    {
      "author": "COLLEEN LONG and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — When the Justice Department was announcing the highest-profile prosecution in its history in Washington, Attorney General Merrick Garland was 100 miles away, meeting with local police in Philadelphia.",
      "publishedAt": "2023-08-05T04:11:25Z",
      "title": "Justice Department faces biggest test in its history with election conspiracy case against Trump",
      "url": "https://apnews.com/0e7658920132697a8b7a20de0260f4fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02ce669f8fce4858abf0eadb6635e466/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "In the two-and-a-half years since the Jan. 6 assault on the U.S. Capitol, Congress passed a bipartisan law closing loopholes in the complex process of choosing a new president that Donald Trump tried to exploit in his push to stay in office after losing the 2020 election.",
      "publishedAt": "2023-08-05T04:06:57Z",
      "title": "Trump and allies boost calls for Justice Dept. takeover in new attack on democratic institutions",
      "url": "https://apnews.com/7b399ab628db7330ed99fac8c3784170",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89f30fe23dbc4b17b8c91d17a7422478/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Moscow promised retaliation Saturday after Ukrainian drones hit a Russian tanker in the Black Sea near Crimea late Friday, the second sea attack involving drones in one day. Ukraine struck a major Russian port earlier on Friday.",
      "publishedAt": "2023-08-05T09:14:02Z",
      "title": "Russia promises retaliation after Ukrainian drones hit a Russian tanker in 2nd sea attack in a day",
      "url": "https://apnews.com/d6ab9c0d71fe9d3d95e1af5953fe8d8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e6f8e1e2dc74835bc1d3caa8e6f18de/2762.jpeg"
    },
    {
      "author": "LISA RATHKE",
      "description": "MONTPELIER, Vt. (AP) — A beloved bookstore in Vermont's small capital city moved across the street to a new spot farther from the Winooski River after an ice jam sent river water into the store in 1992.",
      "publishedAt": "2023-08-05T04:56:39Z",
      "title": "Vermont’s flood-wracked capital city ponders a rebuild with one eye on climate change",
      "url": "https://apnews.com/5f93b8e799f9ddd005e505df2865ed9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/114dc9adc79242cf983d90bf1ee9fb52/1920.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "HARTFORD, Conn. (AP) — As state lawmakers rush to get a handle on fast-evolving artificial intelligence technology, they're often focusing first on their own state governments before imposing restrictions on the private sector.",
      "publishedAt": "2023-08-05T04:19:33Z",
      "title": "Artificial intelligence is gaining state lawmakers' attention, and they have a lot of questions",
      "url": "https://apnews.com/d22212c9242e9b86100d431717d76b0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e35665bc86274e58855471163d80553f/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Pakistan’s former Prime Minister Imran Khan was arrested Saturday after a court handed him a three-year jail sentence for corruption, a development that could end his future in politics.",
      "publishedAt": "2023-08-05T08:20:28Z",
      "title": "Pakistan's former Prime Minister Imran Khan arrested after corruption conviction",
      "url": "https://apnews.com/e44842d4880c581ee093ff680a9a09d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd5f8a7482124c2b9e4e26405d71a9bf/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "FATIMA, Portugal (AP) — Pope Francis visited the Portuguese town of Fatima on Saturday to pray for peace at a shrine known for apocalyptic prophesies of hell, peace and Soviet communism that have found new relevance with Russia’s war in Ukraine.",
      "publishedAt": "2023-08-05T08:01:15Z",
      "title": "Pope visits Portuguese shrine known for apocalyptic prophesy linked to Russia as war rages on",
      "url": "https://apnews.com/5154121a45ae768b21f4e8555b72d9e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff8ada9791fb419db109f6ee35711cbf/2160.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}