{
  "articles": [
    {
      "author": "STEVE MEGARGEE",
      "description": "Sixteen may be sweet, but it isn’t the only relevant number as the NCAA Tournament heads into the regional semifinals.Here are some other numbers worth knowing for each team.",
      "publishedAt": "2024-03-27T12:11:00Z",
      "title": "Here are some numbers that will help you get your March Madness fix for the Sweet 16",
      "url": "https://apnews.com/27cac421bef278344b4ccc87eb4f3b0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbf1834419554ca489d642c64229d65d/3000.jpeg"
    },
    {
      "author": "REESE DUNKLIN, RYAN J. FOLEY, JEFF MARTIN, JENNIFER McDERMOTT, HOLBROOK MOHR and JOHN SEEWER",
      "description": "Carl Grant, a Vietnam veteran with dementia, wandered out of a hospital room to charge a cellphone he imagined he had. When he wouldn’t sit still, the police officer escorting Grant body-slammed him, ricocheting the patient’s head off the floor.",
      "publishedAt": "2024-03-28T10:01:53Z",
      "title": "Why did more than 1,000 people die after police subdued them with force that isn't meant to kill?",
      "url": "https://apnews.com/02881a2bd3fbeb1fc31af9208bb0e310",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e8f74af45d04d729beaf2088d939f77/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and KAREEM CHEHAYEB",
      "description": "DEIR AL-BALAH, Gaza (AP) — An international team of doctors visiting a hospital in central Gaza was prepared for the worst. But the gruesome impact Israel’s war against Hamas is having on Palestinian children still left them stunned.",
      "publishedAt": "2024-03-28T04:16:20Z",
      "title": "Doctors visiting a Gaza hospital are stunned by the war's toll on Palestinian children",
      "url": "https://apnews.com/7c7a6117efae29e22a61e82151144613",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1890f34d8e5e43a3bd07175c1d4ebeef/1920.jpeg"
    },
    {
      "author": "LEA SKENE and BRIAN WITTE",
      "description": "BALTIMORE (AP) — The cargo ship that lost power and crashed into a bridge in Baltimore underwent “routine engine maintenance” in port beforehand, the U.S. Coast Guard said Wednesday, as divers recovered the bodies of two of six workers who plunged into the water when it collapsed.",
      "publishedAt": "2024-03-27T04:03:00Z",
      "title": "Cargo ship had engine maintenance in port before it collided with Baltimore bridge, officials say",
      "url": "https://apnews.com/6a95340e5daeff6551fc999d23feb278",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/456189f9ad80406486a4f5b83a2a80d8/1920.jpeg"
    },
    {
      "author": "KEN SWEET and LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Crypto entrepreneur Sam Bankman-Fried was sentenced Thursday to 25 years in prison for a massive fraud that unraveled with the collapse of FTX, once one of the world’s most popular platforms for exchanging digital currency.",
      "publishedAt": "2024-03-28T04:18:45Z",
      "title": "Fallen crypto mogul Sam Bankman-Fried sentenced to 25 years in prison",
      "url": "https://apnews.com/d7bb1a5e94b4c22039d74dfeab1a2ff1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd681cd91dc340a3955fdb387fc0e563/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and COLLEEN LONG",
      "description": "WASHINGTON (AP) — A fundraiser for President Joe Biden on Thursday in New York City that also stars Barack Obama and Bill Clinton is raising a whopping $25 million, setting a record for the biggest haul for a political event, his campaign said.",
      "publishedAt": "2024-03-28T04:03:46Z",
      "title": "Biden fundraiser with Obama and Clinton nets a record high $25 million, the campaign says",
      "url": "https://apnews.com/ebfbc81d3b70f38745ae00c7ce6a382d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eed45efb971a426ab1e213d7c6ca36db/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and PHILIP MARCELO",
      "description": "NEW YORK (AP) — Donald Trump will attend Thursday's wake of a New York City police officer gunned down in the line of duty, as the presumptive Republican presidential nominee has made crime a focus of his third White House campaign and accused President Joe Biden of lacking toughness.",
      "publishedAt": "2024-03-28T04:07:33Z",
      "title": "Trump will attend the wake of a slain New York police officer as he goes after Biden over crime",
      "url": "https://apnews.com/e91744c40c4513ead88caa247ab9916e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bd027074ade44d0b762b35f2411f673/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "ORLANDO, Fla. (AP) — For the first time in 27 years, the U.S. government is changing how it categorizes people by race and ethnicity, an effort that federal officials believe will more accurately count residents who identify as Hispanic and of Middle Eastern and North African heritage.",
      "publishedAt": "2024-03-28T12:46:31Z",
      "title": "US changes how it categorizes people by race and ethnicity. It's the first revision in 27 years",
      "url": "https://apnews.com/0b2c325b683efd95e8e8e24235654abd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e138083bff8c4751ac375f1ea4550831/3000.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON",
      "description": "CLEVELAND (AP) — Seventh-grade student Henry Cohen bounced side to side in time to the Beatles’ “Here Comes the Sun” playing in teacher Nancy Morris’ classroom, swinging his arms open and closed across the planets pictured on his T-shirt.",
      "publishedAt": "2024-03-28T04:20:38Z",
      "title": "Schools in the path of April's total solar eclipse prepare for a natural teaching moment",
      "url": "https://apnews.com/a179fe2c0ac71074087678d7b52dc281",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d7ce07b33804f7786d5fe731975c9e7/3000.jpeg"
    },
    {
      "author": "FRANCIS KOKUTSE and JESSSICA DONATI",
      "description": "ACCRA, Ghana (AP) — Shoppers may get a bitter surprise in their Easter baskets this year. Chocolate eggs and bunnies are more expensive than ever as changing climate patterns eat into global cocoa supplies and the earnings of farmers in West Africa.",
      "publishedAt": "2024-03-28T07:08:31Z",
      "title": "It's a bittersweet Easter for chocolate lovers and African cocoa farmers but big brands see profits",
      "url": "https://apnews.com/4a4d58a4e6076c8d46258c1b4dc414c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6eae45430a284b14aca44823b06e35d6/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}