{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — Donald Trump's defense attorney says the former president never asked Mike Pence to overturn the will of the voters in the 2020 election, but only wanted the former vice president to “pause” the certification of votes to allow states to investigate his claims of election fraud.",
      "publishedAt": "2023-08-06T17:07:23Z",
      "title": "Pence, Trump attorney clash over what Trump told his VP ahead of Jan. 6, 2021",
      "url": "https://apnews.com/ca1f049328ad8f240c6bf72cce97026e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f160755b23784f1b9b27d5b06bae9cc9/3000.jpeg"
    },
    {
      "author": "ANNE M. PETERSON",
      "description": "MELBOURNE, Australia (AP) — The United States played its best game of this Women's World Cup and it wasn't good enough to stop the two-time reigning champions from being eliminated in the round of 16.",
      "publishedAt": "2023-08-06T11:58:31Z",
      "title": "US loses to Sweden on penalty kicks in its earliest Women's World Cup exit ever",
      "url": "https://apnews.com/d9e30c1d4cbe185aaf015b2e7915261e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab97e2a84a9945319ff81bce7f00f269/3000.jpeg"
    },
    {
      "author": "ASIM TANVEER",
      "description": "MULTAN, Pakistan (AP) — A train derailed in southern Pakistan on Sunday, killing 30 people and injuring more than 90 others as rescue operations completed by early evening, officials said. Ten cars of a Rawalpindi-bound train derailed and some overturned, near the Pakistani town of Nawabshah, trapping many passengers, said senior railway officer Mahmoodur Rehman Lakho.",
      "publishedAt": "2023-08-06T10:48:11Z",
      "title": "Death toll from train derailment in Pakistan rises to 30 with 90 others injured, officials say",
      "url": "https://apnews.com/20fcf825ad7d86cec736dbd819c3e3fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9afda1ba141468eb3d9b0bbd23dddea/1920.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "Greta Gerwig should be feeling closer to fine these days.",
      "publishedAt": "2023-08-06T15:29:35Z",
      "title": "‘Barbie’ joins $1 billion club, breaks another record for female directors",
      "url": "https://apnews.com/7e313cd9c7e71496a01c75a8a694ee06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/412da8651c5e477ead28d7441eaeca5d/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Elon Musk says his potential in-person fight with Mark Zuckerberg would be streamed on his social media site X, formerly known as Twitter.",
      "publishedAt": "2023-08-06T12:01:13Z",
      "title": "Musk says his cage fight with Zuckerberg will be streamed on X",
      "url": "https://apnews.com/28598abc5be6959f01c1b0079211a360",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ce98d3d44ce4a09a66c4deb59784eb0/2000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "JACKSON, Miss. (AP) — Monica Lee sat outside her parents' home, where a former Mississippi sheriff’s deputy pummeled her son, who died hours later in the hospital.It was a sweltering afternoon in Braxton — the same town where, in a separate episode, six white law enforcement officers tortured two other Black men in January, shaking seasoned federal prosecutors, elected officials and ordinary people to their core.",
      "publishedAt": "2023-08-06T04:03:18Z",
      "title": "Racist abuse by Mississippi officers reveals a culture of misconduct, residents say",
      "url": "https://apnews.com/1feb54483e62bef53efe1a1a16be29f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63885d539f6b41f3a630dd30bd538bd2/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russia unleashed a missile and drone barrage Sunday across parts of Ukraine that killed six people, Kyiv officials said, as Moscow followed through on its promise to retaliate for an attack on a Russian tanker.",
      "publishedAt": "2023-08-06T09:43:01Z",
      "title": "Russia unleashes missile and drone strikes against Ukraine, retaliating for an attack on a tanker",
      "url": "https://apnews.com/9afba9271d343cd7f077211ff8507b88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/415ca711906b485aae285344d4826a2c/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — The U.S. government’s most ambitious plan ever to slash planet-warming greenhouse gas emissions from passenger vehicles faces skepticism both about how realistic it is and whether it goes far enough.",
      "publishedAt": "2023-08-06T14:02:17Z",
      "title": "The EPA's ambitious plan to cut auto emissions to slow climate change runs into skepticism",
      "url": "https://apnews.com/306783df62bd2a2af0ad0f8e0b0bb121",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11b79ac4fb1b4a81bad387dde2904ed4/3000.jpeg"
    },
    {
      "author": "BECKY BOHRER",
      "description": "JUNEAU, Alaska (AP) — Thousands of tourists spill onto a boardwalk in Alaska’s capital city every day from cruise ships towering over downtown. Vendors hawk shoreside trips and rows of buses stand ready to whisk visitors away, with many headed for the area’s crown jewel: the Mendenhall Glacier.",
      "publishedAt": "2023-08-06T06:13:00Z",
      "title": "Crammed with tourists, Alaska's capital wonders what will happen as its magnificent glacier recedes",
      "url": "https://apnews.com/281e736286abb62d7cee9c6bb6dc8dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72a6664f666b4dffa110e8b70782fe70/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}