{
  "articles": [
    {
      "author": "WAFAA SHURAFA, NAJIB JOBAIN and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Battles raged across Gaza on Sunday as Israel indicated it was prepared to fight for months or longer to defeat the territory's Hamas rulers, and a key mediator said willingness to discuss a cease-fire was fading.",
      "publishedAt": "2023-12-10T07:28:03Z",
      "title": "Battles rage across Gaza as Israel indicates it's willing to fight for months or more to beat Hamas",
      "url": "https://apnews.com/4414014e31015af32e99a5767b18927c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c806827d7994fc7a12106eb32d77314/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — A British Palestinian surgeon who spent weeks in the Gaza Strip during the current Israel-Hamas war as part of a Doctors Without Borders medical team said he has given testimony to a British war crimes investigation unit.",
      "publishedAt": "2023-12-09T21:55:17Z",
      "title": "A British Palestinian surgeon gave testimony to a UK war crimes unit after returning from Gaza",
      "url": "https://apnews.com/c0a40d6edc02bb0b91c94eb39cd8110d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6444f17c78294f22877480b888a429a8/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "LUKEVILLE, Ariz. (AP) — Gerston Miranda and his wife were among thousands of migrants recently arriving at this remote area on Arizona's southern border with Mexico, squeezing into the United States through a gap in the wall and walking overnight about 14 miles (23 kilometers) with two school-aged daughters to surrender to Border Patrol agents.",
      "publishedAt": "2023-12-10T05:20:47Z",
      "title": "Smugglers are bringing migrants to a remote Arizona border crossing, overwhelming US agents",
      "url": "https://apnews.com/ae04e8c861a95e98dbfc8d49244cf092",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfd5727b07e044459011a5e288042560/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Behind bars in penal colonies or in self-exile abroad, Russian opposition figures vow they will still put up a fight against President Vladimir Putin as he seeks yet another term in office in an election in March.",
      "publishedAt": "2023-12-09T05:08:04Z",
      "title": "With Putin's reelection all but assured, Russia's opposition still vows to undermine his image",
      "url": "https://apnews.com/ed74cfa0fb957317188de39fe9ae7d15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c4c665106e44e5a9db137d3f22585cc/3000.jpeg"
    },
    {
      "author": "KARL RITTER",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy traveled to Buenos Aires to witness the swearing-in on Sunday of Argentina’s new president, Javier Milei.",
      "publishedAt": "2023-12-10T10:46:17Z",
      "title": "Ukraine's Zelenskyy in Argentina in bid to win support from developing nations",
      "url": "https://apnews.com/496dc646174e1b89a145826963bb8bb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6555f5e542e412282249a07132d3fa3/1910.jpeg"
    },
    {
      "author": "MIKE CORDER and MELINA WALLING",
      "description": "ROTTERDAM, Netherlands (AP) — On the top deck of a three-tiered structure moored near downtown Rotterdam, brown and white cows graze on hay dropped from a conveyor belt above their heads and rinds of oranges salvaged from supermarket juice machines in the port city.",
      "publishedAt": "2023-12-10T04:57:07Z",
      "title": "Cows in Rotterdam harbor, seedlings on rafts in India; are floating farms the future?",
      "url": "https://apnews.com/d09831ec98390ef51f9464e28b357bd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ad5bc0bca6947a58a51746d55191be3/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "ANCHORAGE, Alaska (AP) — Gregory Golodoff spent most of his years on a quiet Alaska island, living an ordinary life, managing a co-op store, fishing for crab and serving as the village council president.",
      "publishedAt": "2023-12-10T05:10:12Z",
      "title": "Death of last surviving Alaskan taken by Japan during WWII rekindles memories of forgotten battle",
      "url": "https://apnews.com/c1d2c340af82f8e41129b8f6efb30c9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff07168bb19440dfa7a52cf9f7b5ab2b/3000.jpeg"
    },
    {
      "author": "SYLVIA HUI and HUIZHONG WU",
      "description": "LONDON (AP) — When her husband fled China in 2019 to escape a police crackdown on dissidents, Lu Lina thought she and their young son could soon join him in safety abroad. She did not know that she would be forced to move house, that her 8-year-old son would be effectively kicked out of school and that border police would block her from leaving the country over the next three years.",
      "publishedAt": "2023-12-10T05:04:10Z",
      "title": "China is hardening against dissent, rights groups say as they mark International Human Rights Day",
      "url": "https://apnews.com/019854630542c241cb48447fc0435e6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3204223c548145a9a50655c00f98c4a7/1600.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — For the first time in Hayao Miyazaki's decades-spanning career, the 82-year-old Japanese anime master is No. 1 at the North American box office. Miyazaki's latest enchantment, “The Boy and the Heron,” debuted with $12.8 million, according to studio estimates.",
      "publishedAt": "2023-12-10T17:24:03Z",
      "title": "Miyazaki's 'The Boy and the Heron' is No. 1 at the box office, a first for the Japanese anime master",
      "url": "https://apnews.com/81158fbde74556aa7add3be4f594f4c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2b0f73311104ec2a7b80e4cdeb604ea/1920.jpeg"
    },
    {
      "author": "DAVID BRANDT",
      "description": "PHOENIX (AP) — Shohei Ohtani's jaw-dropping $700 million, 10-year deal with the Los Angeles Dodgers has some similarities to other contracts for the world's biggest sports stars, including soccer icons Lionel Messi and Cristiano Ronaldo, along with NFL quarterback Patrick Mahomes.",
      "publishedAt": "2023-12-10T15:05:01Z",
      "title": "The Dodgers gave Shohei Ohtani $700 million to hit and pitch — but also because he can sell",
      "url": "https://apnews.com/31c707febd0613567805ed54ddde9c9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/524395bd380c4af7ab5d2338f928b4f9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}