{
  "articles": [
    {
      "author": null,
      "description": "A large Russian drone-and-missile attack has targeted Ukraine’s eastern city of Kharkiv, killing at least three people and injuring 21. Local Ukrainian officials said the attack on Saturday included deadly aerial glide bombs. Kharkiv’s mayor Ihor Terekhov said the barrage also damaged 18 apartment buildings and 13 private homes. Citing preliminary data, he said Russia used 48 Shahed drones, two missiles and four aerial glide bombs in the attack. The intensity of the Russian attacks on Ukraine over the past weeks has further dampened hopes that the warring sides could reach a peace deal anytime soon days — especially after Kyiv recently embarrassed the Kremlin with a surprising drone attack on military airfields deep inside Russia.",
      "publishedAt": "2025-06-07T06:12:32Z",
      "title": "A Russian attack on Ukraine's eastern city of Kharkiv kills 3 people",
      "url": "https://apnews.com/article/russia-ukraine-war-kharkiv-66093df9697bdb27794c8055d9beac10",
      "urlToImage": "https://dims.apnews.com/dims4/default/91b6f55/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F1c%2Ff9180dedd0dbd7c07c8421c91e61%2Ff8b705eb716742ac966d32311f0ef7e3"
    },
    {
      "author": null,
      "description": "Israel says it has retrieved the body of a Thai hostage kidnapped into Gaza on Oct. 7, 2023. The Prime Minister’s office said Saturday that the body of Thai citizen Nattapong Pinta was returned to Israel in a special military operation. Pinta was kidnapped from Kibbutz Nir Oz and killed in captivity near the start of the war, said the government. Thais were the largest group of foreigners held captive by Hamas militants. This comes two days after the bodies of two Israeli-American hostages were retrieved. Fifty-five hostages remain in Gaza, of whom Israel says more than half are dead.",
      "publishedAt": "2025-06-07T08:03:01Z",
      "title": "Israel says it retrieved the body of a Thai hostage kidnapped into Gaza",
      "url": "https://apnews.com/article/israel-palestinians-gaza-thai-hostage-bd910477d68ebc1ee98e0ea424c4fe45",
      "urlToImage": "https://dims.apnews.com/dims4/default/747686e/2147483647/strip/true/crop/799x449+0+42/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2Fbc%2F921aace0fc464aa274eff8382930%2F5a806f39efe049109d87c3c3b02ff6b7"
    },
    {
      "author": null,
      "description": "Call it the 911 presidency. Despite insisting that the United States has rebounded from calamity under his watch, President Donald Trump is harnessing emergency powers unlike any of his predecessors. Whether it’s leveling punishing tariffs, deploying troops to the border or sidelining environmental regulations, Trump has relied on rules and laws intended only for use in extraordinary circumstances like war and invasion. An analysis by The Associated Press shows that 20% of Trump’s 150 executive orders have included some kind of emergency declaration, a proportion that far exceed those issued by any other recent president during entire four-year terms.",
      "publishedAt": "2025-06-07T04:00:53Z",
      "title": "Trump flexes emergency powers in his second term",
      "url": "https://apnews.com/article/trump-emergency-powers-tariffs-immigration-5cbe386d8f2cc4a374a5d005e618d76a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e83df8e/2147483647/strip/true/crop/4353x2449+0+227/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F45%2F45ba0c760ecc6430f0388dcdd1a2%2F79a228ea731a42a9bba6f332258465c7"
    },
    {
      "author": null,
      "description": "Some Democratic-led states are doubling down on their resistance to President Donald Trump's crackdown on illegal immigration. Trump's administration has labeled hundreds of local governments as “sanctuary jurisdictions” for obstructing the enforcement of immigration laws. The Department of Justice also has targeted some of them with federal lawsuits. But Democratic state legislatures have passed measures expanding their prohibitions on cooperation with federal immigration agents. Several new measures specifically forbid schools from allowing immigration officials in without judicial warrants. Others attempt to shield information about people's immigration status from federal authorities.",
      "publishedAt": "2025-06-07T05:07:27Z",
      "title": "Democratic states doubling resistance to Trump immigration policies",
      "url": "https://apnews.com/article/immigration-trump-democratic-states-90b10b226426fecc997a54ad004aa0f7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5bddd6c/2147483647/strip/true/crop/4447x2501+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Ff4%2F5f2f72a254e6dcece3cdb4e2879b%2Fb7c8a1ed166c490b8412cf5b476dd494"
    },
    {
      "author": null,
      "description": "Chiseling away at President Barack Obama’s Affordable Care Act. Rolling back the green energy tax breaks central to President Joe Biden’s Inflation Reduction Act. At its core, the Republican “big, beautiful bill” is more than just an extension of tax breaks approved during President Donald Trump’s first term at the White House. The package is an attempt to undo, little by little, the signature domestic achievements of the past two Democratic presidents. House Speaker Mike Johnson says Republicans are going “to do what we said we were going to do.” But the bill's spending cuts pointed at the Democratic-led programs are causing the most political turmoil.",
      "publishedAt": "2025-06-07T11:34:20Z",
      "title": "Trump's big bill also seeks to undo the big bills of Biden and Obama",
      "url": "https://apnews.com/article/trump-big-beautiful-bill-medicaid-tax-cuts-bec87c569760ed979ac8c34cccba186b",
      "urlToImage": "https://dims.apnews.com/dims4/default/9085cde/2147483647/strip/true/crop/4830x2717+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F84%2F4c3e553eef6edf77358412c07e8d%2F6d9ffe8bd2d640eeba884ea0dc1551be"
    },
    {
      "author": null,
      "description": "President Donald Trump grew impatient with how long it was taking to finish new planes to serve as Air Force One, so he started to look for other options. He found one in a luxury jumbo jet that Qatar was willing to sell — and now may be turning into a divisive gift. Assuming legal issues around the transfer are resolved, the next question is how long it will take to refurbish the Boeing 747 for presidential travel. That could span years and cost billions of dollars, meaning he might not get to use the plane during his term. If he’s in a rush and wants to cut corners, it’s a matter of how much risk he’s willing to take.",
      "publishedAt": "2025-06-07T11:20:30Z",
      "title": "What it takes to convert Trump's Qatar jet into Air Force One",
      "url": "https://apnews.com/article/trump-qatar-air-force-one-covert-security-questions-8498cc3d222fd7864c3dd2c9c97d7e69",
      "urlToImage": "https://dims.apnews.com/dims4/default/0c1ce20/2147483647/strip/true/crop/5761x3241+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F22%2F591f2a406fe373fb969d9a5d8da5%2Fde74eb4918ca426589adf283ee9a41fe"
    },
    {
      "author": null,
      "description": "Wildfires have forced a further 1,000 people to flee their homes in the Canadian province of Manitoba, which is under a state of emergency. The town of Snow Lake, Manitoba issued a mandatory evacuation order for its residents on Friday as a large wildfire threatens the area. The fire has already forced out all 5,000 residents of the nearby city of Flin Flon and a thousand more in surrounding cottages and homes. When the Snow Lake evacuees are added in, Manitoba has about 19,000 displaced from their homes. There are 27 total fires in the province of Manitoba, eight of them out of control.",
      "publishedAt": "2025-06-06T21:46:48Z",
      "title": "Thousands flee wildfires in Canada's Manitoba and Saskatchewan",
      "url": "https://apnews.com/article/canada-wildfires-manitoba-saskatchewan-c2419af21141a89715733cffb06df41f",
      "urlToImage": "https://dims.apnews.com/dims4/default/68e97e6/2147483647/strip/true/crop/3000x1688+0+57/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F70%2Fe3edd3983587b69680e687697c51%2F23d2f928979442d4b8cacff1fb68f8ab"
    },
    {
      "author": null,
      "description": "One of the greatest challenges facing Pope Leo XIV is financial. He has inherited the Holy See’s chronic, 50 million to 60 million euro ($57-68 million) structural deficit, a 1 billion euro ($1.14 billion) pension fund shortfall and declining donations. Leo is a Chicago-born math major, canon lawyer and two-time superior of his global Augustinian religious order. People who know him say he is up to the challenge. Leo already has one thing going for him: his American-ness. American donors have long been the economic life support system of the Holy See, and Leo’s election as the first American pope has sent a jolt of excitement through U.S. Catholics who may well be asked to put their money behind him.",
      "publishedAt": "2025-06-07T05:15:18Z",
      "title": "Pope Leo XIV faces big challenge with Vatican's financial crisis",
      "url": "https://apnews.com/article/vatican-pope-leo-finance-donations-0daf975d09f477bd6f7f03eb8b737d6a",
      "urlToImage": "https://dims.apnews.com/dims4/default/cdf71e6/2147483647/strip/true/crop/7681x4321+0+401/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F79%2F52e06d596062e4a8ea48945642e7%2F94e462d5eb8841d6aa1ab38d15dd2d35"
    },
    {
      "author": null,
      "description": "The new film “Ocean With David Attenborough” is both a breathtaking celebration of marine life and a sobering exposé of the industrial forces pushing the ocean toward collapse. With never-before-seen footage from mass coral bleaching to the violent destruction of bottom trawling, it reveals the hidden toll of human activity beneath the waves. But it’s also a story of hope that spotlights thriving marine reserves and the power of protection. Timed to World Oceans Day and the U.N. Ocean Conference, “Ocean” makes the case that saving the sea is still possible, if we act now.",
      "publishedAt": "2025-06-07T06:00:38Z",
      "title": "David Attenborough's 'Ocean' exposes the unseen destruction of the seas",
      "url": "https://apnews.com/article/ocean-film-attenborough-climate-848a65883fc1ec2601550d3cbfb0e36a",
      "urlToImage": "https://dims.apnews.com/dims4/default/64b59c8/2147483647/strip/true/crop/3840x2160+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F63%2F4eb4a77ea400b71031b65591c5f8%2Ffbad5edf7aef4eb2b54947a28ea3476d"
    },
    {
      "author": null,
      "description": "The fourth week of Sean “Diddy” Combs' sex trafficking trial featured testimony from the second of two ex-girlfriends who are crucial witnesses in the government's quest to prove sex trafficking and racketeering conspiracy charges against the hip-hop mogul. A woman who testified under the pseudonym Jane sometimes spoke through sobs and tears over two days about the deterioration of her romance with the Bad Boy Records founder. She said a magical start in 2020 to their relationship turned into an endless stream of “hotel nights” when she felt forced to engage in sex with sex workers while Combs watched. Combs has pleaded not guilty.",
      "publishedAt": "2025-06-07T04:04:24Z",
      "title": "Key moments from the fourth week of Sean 'Diddy' Combs' sex trafficking trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-recap-543eb20ef11c7d03611dab8a54d53f36",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}