{
  "articles": [
    {
      "author": "TOM KRISHER, COREY WILLIAMS and MIKE HOUSEHOLDER",
      "description": "DETROIT (AP) — About 13,000 U.S. auto workers stopped making vehicles and went on strike Friday after their leaders couldn’t bridge a giant gap between union demands in contract talks and what Detroit’s three automakers are willing to pay.",
      "publishedAt": "2023-09-15T04:05:36Z",
      "title": "Workers are on strike at all 3 Detroit auto makers for the first time in their union's history",
      "url": "https://apnews.com/7ce3ca9d94b911250d07556b7af376c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b873033a4e947fcb2a2aa29b6d6c57e/1920.jpeg"
    },
    {
      "author": "YOUSEF MOURAD",
      "description": "DERNA, Libya (AP) — Libyan authorities evacuated residents from an inundated city Friday and limited access to it, as searchers dug through mud and hollowed-out buildings for 10,000 people missing and feared dead in flooding that has already killed more than 11,000.",
      "publishedAt": "2023-09-15T07:33:56Z",
      "title": "Libya evacuates flooded city as searchers look for 10,000 missing after death toll passes 11,000",
      "url": "https://apnews.com/72307547f3e0ff4fbf715a7f64c69383",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7af9420f7da34db0a14a9144249e8584/1920.jpeg"
    },
    {
      "author": "DAVID SHARP and PATRICK WHITTLE",
      "description": "PORTLAND, Maine (AP) — After a deluge of rain, flooding, sinkholes and tornadoes this week, New England is about to face Hurricane Lee.",
      "publishedAt": "2023-09-15T04:04:56Z",
      "title": "Hurricane Lee to strike weather-worn New England after heavy rain, flooding and tornadoes",
      "url": "https://apnews.com/870a13cf6f43a09086b1219cbabd3257",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dae51e167ad64cf4a98d9353bb85576a/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM, KIM TONG-HYUNG and EMMA BURROWS",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un peered into the cockpit of Russia’s most advanced fighter jet as he toured an aircraft factory Friday on an extended trip that has raised concerns about banned weapons transfer deals between the increasingly isolated countries.",
      "publishedAt": "2023-09-15T04:04:32Z",
      "title": "North Korea's Kim gets a close look at Russian fighter jets as his tour narrows its focus to weapons",
      "url": "https://apnews.com/421c4984a8b83d17bb0719676592c135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da085ec42778471a90ab2513f1999c81/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukraine's forces have recaptured a village in the country’s east after intense battles with Russian troops, the military said Friday as the invaded nation pursues a multi-pronged counteroffensive.",
      "publishedAt": "2023-09-15T06:46:43Z",
      "title": "Ukrainian forces reclaim a village in the east as part of counteroffensive",
      "url": "https://apnews.com/177f5250f7a6fea3dc3924c2a50629ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f341ca675864e05814f75bcd2a0a68e/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden was indicted Thursday on federal firearms charges, the latest step in a long-running investigation into the president's son that puts the case on track toward a possible high-stakes trial as the 2024 election looms.",
      "publishedAt": "2023-09-14T17:36:21Z",
      "title": "Hunter Biden is indicted on federal firearm-purchasing charges after plea deal fails",
      "url": "https://apnews.com/e5c8ded90ea8c22d2e2e7cb09804b747",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ba0c857b40d4b1ca69817816bae011b/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — President Joe Biden is trumpeting Medicare's new powers to negotiate directly with drugmakers on the cost of prescription medications — but a new poll shows that any immediate political boost that Biden gets for enacting the overwhelmingly popular policy may be limited.",
      "publishedAt": "2023-09-15T04:03:08Z",
      "title": "Americans overwhelmingly support Medicare drug negotiations, but Biden sees little political boost",
      "url": "https://apnews.com/b82928109ae8564e750a6a196c98cfe9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd9ba065b18f4672bf2d6bbf92bc6a26/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Tens of thousands of climate activists around the world are protesting Friday and through the weekend to call for an end to the burning of planet-warming fossil fuels as the globe suffers dramatic weather extremes and record-breaking heat.",
      "publishedAt": "2023-09-15T04:15:20Z",
      "title": "Climate protesters around the world are calling for an end to fossils fuels as Earth heats up",
      "url": "https://apnews.com/3b9b3a3bcc1f67d88d2cc142e2e8a471",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41892eb5b4c640cf9ac2b983933b1021/3000.jpeg"
    },
    {
      "author": "PETER PRENGAMAN",
      "description": "TEMPE, Ariz. (AP) — Bethany Patton steps up to the counter and places her pink mug into a shoebox-sized dishwasher. It spins. It whirs. Water splashes inside. After 90 seconds, the door opens and steam emerges.",
      "publishedAt": "2023-09-15T05:27:24Z",
      "title": "Citing sustainability, Starbucks wants to overhaul its iconic cup. Will customers go along?",
      "url": "https://apnews.com/5a3a5d7d4a66725f9747cbab23cb586d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8812f27662994e8790322e9529c4521a/3000.jpeg"
    },
    {
      "author": "DAN GELSTON",
      "description": "PHILADELPHIA (AP) — Jalen Hurts forced a throw into double coverage, one of his worst passes in years, and was picked off. A.J. Brown — he of the nearly 1,500 yards receiving a year ago — threw a tantrum on the sidelines when the ball didn't come his way.",
      "publishedAt": "2023-09-15T03:33:34Z",
      "title": "Jalen Hurts runs for 2 TDs, throws for a score; Eagles hold off fumble-prone Vikings 34-28",
      "url": "https://apnews.com/8982c779fad8ba9c10b33ed051c8e02f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17b3f9edb136437cb8fed0b16d935c61/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}