{
  "articles": [
    {
      "author": "FOSTER KLUG, JIWON SONG and JAE C. HONG",
      "description": "POHANG, South Korea (AP) — There are two Koreas, North and South. But there's also more than one South Korea, with the nation split into camps with polar opposite views on the danger posed by the nuclear-armed neighbor to the north.",
      "publishedAt": "2024-09-12T04:30:20Z",
      "title": "South Koreans are starkly divided over North Korea's nuclear threat",
      "url": "https://apnews.com/e4c272c59dee1a908c7a26fc7705b5a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9b1582a52484cc2927485a96bbec392/3000.jpeg"
    },
    {
      "author": "HAU DINH and DAVID RISING",
      "description": "HANOI, Vietnam (AP) — Nearly 200 people have died in Vietnam in the aftermath of Typhoon Yagi and more than 125 are missing as flash floods and landslides take their toll, state media reported Thursday.",
      "publishedAt": "2024-09-12T04:03:21Z",
      "title": "Vietnam death toll climbs to 197 as typhoon's aftermath brings flash floods and landslides",
      "url": "https://apnews.com/43af9564655861bafb2b6a211f8bd679",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57462b4c1e874631bb63d69b0168c7d9/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, JONATHAN J. COOPER and GARY D. ROBERTSON",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris and former President Donald Trump are making a beeline for swing states that they hope to flip in their favor this year, both of them trying to expand their narrow paths to victory in a closely fought presidential campaign.",
      "publishedAt": "2024-09-12T04:09:29Z",
      "title": "Harris and Trump are jockeying for battleground states after their debate faceoff",
      "url": "https://apnews.com/34bca16175c387a076131ad69bc18d47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/621836f883fc4320adc83ad9a21e9e62/3000.jpeg"
    },
    {
      "author": "PATRICK AFTOORA ORSAGOS, JULIE CARR SMYTH AND ELLIOT SPAGAT",
      "description": "SPRINGFIELD, Ohio (AP) — Many cities have been reshaped by immigrants in the last few years without attracting much notice. Not Springfield, Ohio.Its story of economic renewal and related growing pains has been thrust into the national conversation in a presidential election year — and maliciously distorted by false rumors that Haitian immigrants are eating their neighbors’ pets.",
      "publishedAt": "2024-09-11T19:05:28Z",
      "title": "An Ohio city reshaped by Haitian immigrants lands in an unwelcome spotlight",
      "url": "https://apnews.com/84aa8ae10963cbeadd48b3945b322620",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4cb210aaa2494d02a2c7d5b8dc8ebd6e/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes across Gaza overnight and Wednesday hit a U.N.",
      "publishedAt": "2024-09-11T15:22:14Z",
      "title": "Israeli airstrikes hit UN school and homes in Gaza and kill at least 34 people, hospitals say",
      "url": "https://apnews.com/44f93845d6b6cfc9dcc4d0ba37bdd263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ec6cfc2cbbe49cabca4c475e5ed92d0/3000.jpeg"
    },
    {
      "author": "JACK BROOK and SARA CLINE",
      "description": "MORGAN CITY, La. (AP) — Francine weakened to a tropical storm late Wednesday after striking Louisiana as a Category 2 hurricane that blacked out more than 275,000 homes and businesses, sent storm surge rushing into coastal communities and raised flood fears in New Orleans and beyond as drenching rains spread over the northern Gulf Coast.",
      "publishedAt": "2024-09-12T04:47:45Z",
      "title": "Francine weakens moving inland from Gulf Coast after hurricane winds cause blackouts",
      "url": "https://apnews.com/09879999e209ff5e043ef0e4ca7f527f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/809a82d83acf43e880a84b3e59699812/1920.jpeg"
    },
    {
      "author": "EUGENE GARCIA, ERIC THAYER, AMY TAXIN and OLGA R. RODRIGUEZ",
      "description": "WRIGHTWOOD, Calif. (AP) — Firefighters battling three major wildfires in the mountains east of Los Angeles took advantage of cooler weather Wednesday as they slowly gained the upper hand, but not before dozens of homes were destroyed and thousands of people were forced to evacuate.",
      "publishedAt": "2024-09-12T05:03:23Z",
      "title": "Firefighters hope cooler weather will aid their battle against 3 major Southern California fires",
      "url": "https://apnews.com/c57adb98fea42204140349e7d31ebece",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58aaa8cc7e6f4a67ae99590725cd53ad/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "SINGAPORE (AP) — Pope Francis on Thursday praised Singapore’s economic strength as a testament to human ingenuity but urged the city-state to look after the weakest, too, especially foreign workers, as he opened the final leg of his tour through some of Asia’s poorest countries in one of the world’s richest.",
      "publishedAt": "2024-09-12T03:15:36Z",
      "title": "Pope marvels at Singapore's skyscrapers and asks that the lowest migrant workers not be forgotten",
      "url": "https://apnews.com/9c9b04da19c98e4db26fa2057214c2ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6498bc3d42da4916afbf710527f21766/3000.jpeg"
    },
    {
      "author": "FRANKLIN BRICEÑO",
      "description": "LIMA, Peru (AP) — Alberto Fujimori, whose decade-long presidency began with triumphs righting Peru’s economy and defeating a brutal insurgency only to end in a disgrace of autocratic excess that later sent him to prison, has died.",
      "publishedAt": "2024-09-11T23:36:55Z",
      "title": "Alberto Fujimori, a former president of Peru who was convicted for human rights abuses, dies at 86",
      "url": "https://apnews.com/777fdfcb09eafd731a7412c8bf1a2f64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/266c1f42168e46519cf47d4f00690963/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "NEW YORK (AP) — Taylor Swift 's dominance continued at the MTV Video Music Awards, where she took home seven awards — including the night's biggest, the trophy for video of the year.",
      "publishedAt": "2024-09-11T05:31:13Z",
      "title": "Taylor Swift wins big at MTV Video Music Awards, ties Beyoncé’s record and thanks Travis Kelce",
      "url": "https://apnews.com/c8611104c22b980398b440ef9dd8ceed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d65c320593114659a22ca4227791b1bc/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}