{
  "articles": [
    {
      "author": "Kamila Hrabchuk",
      "description": "Negotiators from Moscow and Kyiv are holding a second day of U.S.-brokered talks in Abu Dhabi to end their war. The discussions come amid increased Russian attacks on Ukraine’s power grid and after a rise in civilian casualties. Ukrainian President Volodymyr Zelenskyy is urging allies to pressure Moscow to end the invasion, which began in 2022. He emphasizes the need for security guarantees to prevent future Russian attacks. Fighting continues alongside the talks, with Russia targeting Ukraine’s electricity network. Human Rights Watch reports a 31% increase in Ukrainian civilian casualties last year. Almost 15,000 civilians have been killed since the war began.",
      "publishedAt": "2026-02-05T09:06:30Z",
      "title": "Abu Dhabi hosts second day of US-brokered talks to end Moscow-Kyiv conflict",
      "url": "https://apnews.com/article/russia-ukraine-talks-peace-abu-dhabi-witkoff-31ccc70ae7599507bc5a98a6cd87e2aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/91481ca/2147483647/strip/true/crop/8099x5397+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Fa0%2Fd20f343055ac3e270c725f80d644%2Fd005242a68d7456da1604160df4244e6"
    },
    {
      "author": "Claire Rush",
      "description": "A judge says U.S. immigration agents in Oregon must stop arresting people without warrants unless they are likely to escape. U.S. District Judge Mustafa Kasubhai issued the preliminary injunction Wednesday. The ruling came in response to a lawsuit filed by a nonprofit law firm representing a man who was detained by immigration officers without a warrant despite having a valid work permit. In a memo last week, the acting head of U.S. Immigration and Customs Enforcement emphasized that agents should not make arrests without an administrative arrest warrant issued by a supervisor unless they develop probable cause to believe the person is likely to escape from the scene.",
      "publishedAt": "2026-02-05T01:57:31Z",
      "title": "Federal judge restricts warrantless immigration arrests in Oregon",
      "url": "https://apnews.com/article/immigration-warrantless-arrests-ice-oregon-lawsuit-f21f3856e3c60e283e7be4bac1f04272",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c650f0/2147483647/strip/true/crop/6374x4247+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F2d%2Ff13bc428578d7795cdf09d62974d%2F3eb754e9c80d42bc9bd58b0c92672662"
    },
    {
      "author": "Sam Metz",
      "description": "As Israeli strikes killed two dozen Palestinians on Wednesday, many in Gaza wondered what had become of the ceasefire reached between Israel and Hamas in October. Both sides accuse the other of violations, even as they continue to push ahead with the fragile process. At least 556 Palestinians have been killed in Israeli strikes since the U.S.-brokered truce came into effect, according to Gaza’s Health Ministry. Four Israeli soldiers have been killed in Gaza in the same period, with more injured, including a soldier who was severely wounded overnight. Little progress has been made on larger issues concerning Gaza's future.",
      "publishedAt": "2026-02-05T05:01:06Z",
      "title": "Violence is flaring in Gaza months after the Israel-Hamas ceasefire",
      "url": "https://apnews.com/article/israel-hamas-war-ceasefire-explainer-4c39a62c2ab250a7e365c8edcbadcfd3",
      "urlToImage": "https://dims.apnews.com/dims4/default/b56a2fa/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fb5%2F03580b698a0ed7b70b30d85a6b80%2F3710198f136f4a0ea0adda0f75d06b31"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "Shares have retreated in Asia on heavy selling of technology stocks, while the price of bitcoin fell as much as 8%. South Korea's Kospi dropped nearly 4%, while U.S. futures edged lower. Oil prices sank more than $1 a barrel. On Wednesday, the S&P 500 fell 0.5% for its fifth modest loss in the last six days. The Dow Jones Industrial Average rose 0.5%, and the Nasdaq composite sank 1.5%. More than twice as many stocks rose within the S&P 500 than fell, but the index sank as Advanced Micro Devices and other influential tech stocks weakened. AMD dropped even though the chip company reported a stronger profit for the latest quarter than analysts expected.",
      "publishedAt": "2026-02-05T03:00:52Z",
      "title": "Bitcoin plunges 8% and Korea's Kospi sinks 4% in latest tech-led sell-off",
      "url": "https://apnews.com/article/stocks-markets-tech-rates-gold-trump-d4ed66429ffa2f50f2feea99b0e583ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/785313e/2147483647/strip/true/crop/6705x4468+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2F51%2Fd3a1cafb47bfe1e9033851fd6227%2Fa18d7f7ae07a430693a82db5d0935439"
    },
    {
      "author": "Philip Marcelo",
      "description": "Nude photos. The names and faces of sexual abuse victims. Bank account and Social Security numbers in full view. All of these things appeared in the mountain of documents released publicly by the U.S. Justice Department as part of its effort to comply with a law requiring it to open its investigative files on Jeffrey Epstein. A review by The Associated Press and other news organizations has found countless examples of sloppy, inconsistent or nonexistent redactions that have revealed sensitive private information. Lawyers for some of the accusers have called on the Justice Department to temporarily take down the information. The Justice Department says it is taking down all inadvertently disclosed private information it’s been made aware of.",
      "publishedAt": "2026-02-04T23:23:13Z",
      "title": "Nude photos and potential victims exposed in Epstein files",
      "url": "https://apnews.com/article/jeffrey-epstein-files-28a28aeebcfd49890e0810eb69992724",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a3bd63/2147483647/strip/true/crop/5712x3806+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F15%2Ffd43a7b69b7c5e89658d4efd4bf4%2Fe1d4a2fb22ac4d79887a443282010a67"
    },
    {
      "author": "Dyepkazah Shybayan, Mark Banchereau",
      "description": "Gunmen have killed at least 162 people in attacks on two villages in Western Nigeria, according to a lawmaker. The assaults on Tuesday evening targeted the villages of Woro and Nuku in Kwara state. Amnesty International reported over 170 deaths, criticizing a \"stunning security failure.\" Nigeria faces a complex security crisis with Islamic militants and criminal gangs, known locally as \"bandits,\" expanding their reach. No group has claimed responsibility, but local officials suspect extremist groups. The attacks coincide with increased U.S. military support to Nigeria, aimed at addressing the country's escalating security challenges.",
      "publishedAt": "2026-02-05T07:44:02Z",
      "title": "What to know about the attacks in Nigeria that killed over 160 people",
      "url": "https://apnews.com/article/nigeria-attack-kwara-what-to-know-7d4371e36d8f0504017b6c692c58ddc2",
      "urlToImage": "https://dims.apnews.com/dims4/default/153fbbe/2147483647/strip/true/crop/960x640+0+320/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fb6%2Ff77ec9b470bfe9079b00de8be3d1%2F895f79aa77fe4d58a21ae3e911c55e7b"
    },
    {
      "author": "Jacques Billeaud, Sejal Govindarao, Mike Balsamo",
      "description": "Authorities say the search for “Today” show host Savannah Guthrie’s mother still has no suspect or person of interest, days after she disappeared with signs of forced entry at her home in southern Arizona. Authorities believe Nancy Guthrie was taken against her will. The Pima County sheriff has said Nancy Guthrie must be found soon because she could die without her medication. The sheriff's office said Monday that “detectives continue to speak with anyone who may have had contact with Mrs. Guthrie“ and they are ”working closely with the Guthrie family.”",
      "publishedAt": "2026-02-04T16:46:05Z",
      "title": "No suspects in search for 'Today' host Savannah Guthrie's missing mom",
      "url": "https://apnews.com/article/savannah-guthrie-nancy-guthrie-mom-missing-88e8731270d05e6e667730d2ed8633d3",
      "urlToImage": "https://dims.apnews.com/dims4/default/02f07f4/2147483647/strip/true/crop/4032x2687+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2Fdd%2F50b85963068c5bc65fed68807c80%2Fe20a12c6c28d4bf2a91ec2eaea515da1"
    },
    {
      "author": "Simina Mistreanu",
      "description": "Taiwan’s ties with the United States are “rock solid,” the island’s president said Thursday, hours after President Donald Trump and Chinese leader Xi Jinping spoke on the phone, including about the self-ruled island’s future. “The Taiwan-U.S. relationship is rock solid, and all cooperation projects will continue uninterrupted,” Taiwan President Lai Ching-te said. The comments came after Xi, in his first call with Trump since November, warned the U.S. president to be “prudent” when supplying arms to the self-ruled island, according to a readout of their call provided by China’s Foreign Ministry. In December, the U.S. State Department announced its largest-ever arms sales package to Taiwan, valued at more than $11.1 billion and including missiles, artillery systems and drones.",
      "publishedAt": "2026-02-05T04:45:59Z",
      "title": "Taiwan-US ties are ‘rock solid,’ the island’s president says after Trump-Xi call",
      "url": "https://apnews.com/article/taiwan-president-lai-china-arms-sales-us-2d980ade9a1a299682d9ba62470d0369",
      "urlToImage": "https://dims.apnews.com/dims4/default/771cbdf/2147483647/strip/true/crop/2048x1365+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F21%2F580f4022db19e1488ac9b405cbc8%2F6d88dd112e7d4e85afe42c206ef3fcc5"
    },
    {
      "author": null,
      "description": "The last remaining nuclear arms pact between Russia and the United States has expired, removing caps on their atomic arsenals for the first time in over 50 years. The end of the New START Treaty could lead to an unconstrained nuclear arms race. Russian President Vladimir Putin expressed readiness to stick to the treaty’s limits for another year if the U.S. agreed, but U.S. President Donald Trump has been noncommittal. On Wednesday, Putin discussed the expiration with Chinese leader Xi Jinping. Russia's Foreign Ministry stated that both countries are now free to choose their next steps. The treaty, signed in 2010, was extended in 2021 but inspections stopped in 2020.",
      "publishedAt": "2026-02-05T07:45:21Z",
      "title": "Fears of a new arms race after the last US-Russia nuclear pact expires",
      "url": "https://apnews.com/article/russia-us-putin-trump-nuclear-weapons-treaty-0e82c7fb5e5feca89a9c3f45d6f4feae",
      "urlToImage": "https://dims.apnews.com/dims4/default/de37dbc/2147483647/strip/true/crop/3530x2352+324+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F55%2F0d059b88749b61c47ed1aad3998d%2Fbb5137930b604a6a83df222cbdfbcc36"
    },
    {
      "author": "Fatima Hussein",
      "description": "A hearing with Treasury Secretary Scott Bessent turned chaotic Wednesday as Democratic lawmakers clashed with him over fiscal policy and Trump family conflicts. The hearing of the House Financial Services Committee featured fiery exchanges and insults from Bessent. Texas Rep. Sylvia Garcia snapped at Bessent for demeaning comments, while Massachusetts Rep. Stephen Lynch expressed frustration with his interruptions. California Rep. Maxine Waters asked if someone could \"shut him up.\" Experts say it was an unusual level of combativeness for a treasury secretary, whose role typically avoids political theater. Bessent is set to appear before the Senate Banking Committee on Thursday.",
      "publishedAt": "2026-02-05T01:53:57Z",
      "title": "Treasury Secretary Bessent’s testimony descends into shouting matches",
      "url": "https://apnews.com/article/trump-treasury-bessent-congress-79c0f2ffde2e0420bdf699123cecae74",
      "urlToImage": "https://dims.apnews.com/dims4/default/de2efab/2147483647/strip/true/crop/5085x3388+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2Fe8%2F258153e3e8aca4b8e838be3a7111%2Fdc56bc8d5f4c460fbc46436496d60bf8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}