{
  "articles": [
    {
      "author": "KEN RITTER and LINDA DEUTSCH",
      "description": "LAS VEGAS (AP) — For a long time, O.J. Simpson was the man who had it all.He lived the American dream as a sports legend, movie actor, commercial pitchman and millionaire.",
      "publishedAt": "2024-04-11T20:50:16Z",
      "title": "Legendary athlete, actor and millionaire: O.J. Simpson's murder trial lost him the American dream",
      "url": "https://apnews.com/782a2c38373a695a9b12e4371ece9cf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/172903c3e99a4b21a4bad2cdd7a5501f/1920.jpeg"
    },
    {
      "author": "MICHAEL FLEEMAN",
      "description": "EDITOR’S NOTE: The first week of the O.J. Simpson case in mid-June 1994 moved quickly, with reporters racing to reach the news. The only thing that was slow was The Chase.The football great had been accused of killing his ex-wife and her friend, and there he was on live television, in the back of his friend’s white Ford Bronco with a gun to his head.",
      "publishedAt": "2024-04-11T15:22:31Z",
      "title": "AP WAS THERE: OJ Simpson’s slow-speed chase",
      "url": "https://apnews.com/f646eaa936348cd193ea8e9510b7b7c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0728cefcb7374975bce851f654154a55/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "NEW YORK (AP) — A dog’s plaintive wail. A courtroom couplet-turned-cultural catchphrase about gloves. A judge and attorneys who became media darlings and villains. A slightly bewildered houseguest elevated, briefly, into a slightly bewildered celebrity.",
      "publishedAt": "2024-04-11T19:56:14Z",
      "title": "The OJ Simpson saga was a unique American moment. 3 decades on, we're still wondering what it means",
      "url": "https://apnews.com/3610d214475cc680bdecaa14d74f4605",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/217d83ae011349b2892e98b2ec48a6c9/1790.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and JOEY CAPPELLETTI",
      "description": "WASHINGTON (AP) — Osama Siblani was sipping his morning coffee at the office when his phone buzzed with a message from one of President Joe Biden's advisers. As publisher of the Arab American News in Dearborn, Michigan, Siblani serves as an occasional sounding board, and the White House wanted to know what he thought of Biden's recent call with Israeli Prime Minister Benjamin Netanyahu.",
      "publishedAt": "2024-04-11T17:17:08Z",
      "title": "Muslim leaders are 'out of words' as they tire of the White House outreach on the war in Gaza",
      "url": "https://apnews.com/32cbf8d76872863a6c672bdce087be23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60edd32dba3444e2a2e60ee10c6ef4cd/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Japanese Prime Minister Fumio Kishida addressed U.S. lawmakers at the Capitol on Thursday, urging them to consider the importance of global commitments at a time of tension in the Asia-Pacific and deep skepticism in Congress about U.S.",
      "publishedAt": "2024-04-11T04:04:16Z",
      "title": "Japanese Prime Minister Fumio Kishida addresses Congress amid skepticism about US role abroad",
      "url": "https://apnews.com/3c22f1b1e8d0003f27ade8789a8c4a43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/015bfcd9c24949c4a23af3b0cc9f2248/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — Thousands more firearms dealers across the United States will have to run background checks on buyers at gun shows or other places outside brick-and-mortar stores, according to a Biden administration rule that will soon go into effect.",
      "publishedAt": "2024-04-11T09:04:42Z",
      "title": "The Biden administration will require thousands more gun dealers to run background checks on buyers",
      "url": "https://apnews.com/70261cc0512eea8d52ef9585a9a48ab2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84c9ca7f30b74bc5877ef5a45c2bcb15/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Thirteen members of the Hasidic Jewish community pleaded not guilty Wednesday to charges stemming from their alleged role in a dispute over an illegal tunnel built beneath a historic Brooklyn synagogue.",
      "publishedAt": "2024-04-11T17:32:54Z",
      "title": "Thirteen men plead not guilty for role in Brooklyn synagogue tunnel scuffle",
      "url": "https://apnews.com/f20fdf0f8c3e9aa1f862515f557bc564",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b2ffa9d37d848abbdc37df72d6ecd8f/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — When he was elected two years ago as Manhattan’s first Black district attorney, Alvin Bragg spoke candidly about his unease with the job’s political demands. A former law professor, he’s more comfortable untangling complex legal questions than swaggering up to a podium.",
      "publishedAt": "2024-04-11T04:12:45Z",
      "title": "Manhattan District Attorney Alvin Bragg says Trump's hush money criminal trial isn't about politics",
      "url": "https://apnews.com/a164881f43b1d5064a528b36eada937e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd91801594e248118094eb89ea2a2f41/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Under heavy U.S. pressure, Israel has promised to ramp up aid to Gaza dramatically, saying last week it would open another cargo crossing and surge more trucks than ever before into the besieged enclave.",
      "publishedAt": "2024-04-11T19:28:22Z",
      "title": "More aid is supposed to be entering the Gaza Strip. Why isn’t it helping?",
      "url": "https://apnews.com/30173642b5c298c829f1457db357071e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7230bb203f114f659566a49f525afe69/3000.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — Federal authorities charged the former longtime interpreter for Los Angeles Dodgers star Shohei Ohtani on Thursday with federal bank fraud, alleging that he stole more than $16 million from the Japanese sensation to cover gambling bets and debts.",
      "publishedAt": "2024-04-11T17:43:35Z",
      "title": "Shohei Ohtani's ex-interpreter charged with stealing $16M from baseball star in sports betting case",
      "url": "https://apnews.com/ce1d0c55526715afdb1b345590ece4f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9d7eeb0ab4941508dadc1335d5bc105/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}