{
  "articles": [
    {
      "author": "Bill Barrow, Josh Boak",
      "description": "President Donald Trump has used his social media account to share a video about election conspiracy theories that includes a racist depiction of former President Barack Obama and his wife, Michelle Obama, as primates in a jungle. The Republican president's Thursday night post also amplified his false claims that his 2020 election defeat was fraudulent. Trump's post has drawn bipartisan backlash for its treatment of the nation’s first Black president and first lady, who are Democrats. Black Republican Sen. Tim Scott is among those criticizing the post as racist. The White House is pushing back against criticism of the post. An Obama spokeswoman says the former president has no response.",
      "publishedAt": "2026-02-06T14:02:22Z",
      "title": "Trump shares racist video depicting Obamas as primates in a jungle",
      "url": "https://apnews.com/article/trump-obama-racist-video-a48a6b8884a88f9ec30cd4913e352b51",
      "urlToImage": "https://dims.apnews.com/dims4/default/781ded9/2147483647/strip/true/crop/3058x2038+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2Fe4%2Ffe9ad159c9a632db4105b1f86493%2Fb86a9d230cfb4abaa18ba133dee43ee2"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy says the U.S. has given Ukraine and Russia a June deadline to reach a peace agreement. Zelenskyy said that if the deadline is not met, the Trump administration will likely apply pressure on both sides. Zelenskyy spoke to reporters on Friday, with his comments embargoed until Saturday morning. He said the Americans want the war to end by the beginning of summer. They plan to do everything possible to achieve this goal and seek a clear schedule of events.",
      "publishedAt": "2026-02-07T09:11:20Z",
      "title": "Zelenskyy says U.S. gave Ukraine and Russia a June deadline to reach agreement to end war",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-june-deadline-98da4e17de8ab377363ae9c3ff308001",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a6e82b/2147483647/strip/true/crop/5584x3721+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2F17%2F890d53bd9225f48539907b6f1e3b%2Fb0c5c959afb44e8f9ca9da6053652836"
    },
    {
      "author": "Jill Lawless",
      "description": "The Jeffrey Epstein files have rocked Europe's elite, revealing ties to a prince, an ambassador, and top politicians. The U.S. Department of Justice released documents that have ended careers and sparked investigations. King Charles III's brother lost his titles and home. Ex-U.K. ambassador Peter Mandelson was fired and may face prison. British Prime Minister Keir Starmer is in crisis for appointing Mandelson. Norway, Sweden and Slovakia have seen senior figures fall. Experts say the files expose Epstein's powerful network in Europe. The fallout contrasts with a more limited impact so far in the U.S. where only a handful of prominent Epstein associates have lost their jobs.",
      "publishedAt": "2026-02-07T10:41:15Z",
      "title": "Jeffrey Epstein files shake political careers in Europe",
      "url": "https://apnews.com/article/jeffrey-epstein-fallout-europe-us-mandelson-409c14e095a2e29bbea6398437411a8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e43f7e/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F4b%2F732ac12280a90280b960f4ba748b%2F0ce4d201467540bf8d42e37878060396"
    },
    {
      "author": null,
      "description": "It’s been a week since “Today” show host Savannah Guthrie’s mother disappeared from her home in Arizona in what authorities say was a kidnapping. Investigators have been examining ransom notes and looking for evidence but have not named a suspect. On Friday, officers returned to 84-year-old Nancy Guthrie’s home near Tucson and to the surrounding neighborhood to continue their search. Family members told officials they last saw Nancy Guthrie at 9:48 p.m. on Jan. 31 when they dropped her off at home after they ate dinner and played games together. The next day, family learned she didn’t attend church. They reported her missing after they checked on her.",
      "publishedAt": "2026-02-07T05:06:53Z",
      "title": "What to know about the search for Savannah Guthrie's kidnapped mom",
      "url": "https://apnews.com/article/savannah-guthrie-nancy-guthrie-mom-missing-534c68bfb666ab8e08123f130f937c2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e8f0d8/2147483647/strip/true/crop/1500x999+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F34%2Fdb0482c38db053c103bd3ca82870%2F2fbe5fd8226047219612eb0310e970b2"
    },
    {
      "author": "Safiyah Riddle",
      "description": "Experts say abductions for ransom are rare, despite dramatic portrayals on TV. The apparent kidnapping of “Today” show host Savannah Guthrie’s mother has raised questions about real-life hostage negotiations. Nancy Guthrie, 84, was taken from her home outside Tucson, Arizona. A local TV station received two alleged ransom letters demanding money for her return. Law enforcement hasn't confirmed the authenticity of these notes. Experts say kidnappings for ransom are uncommon and usually involve careful planning. The family has released videos appealing to the kidnappers. Patience and avoiding media attention can be crucial in these situations.",
      "publishedAt": "2026-02-07T05:00:09Z",
      "title": "How law enforcement handles hostage crises: Insights from Guthrie case",
      "url": "https://apnews.com/article/nancy-guthrie-kidnapper-negotiations-hostages-d40a08cab642016c5ea5565cd1f935dc",
      "urlToImage": "https://dims.apnews.com/dims4/default/302e44c/2147483647/strip/true/crop/1999x1332+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F18%2Faee3cb1db78f4ee9684288454dc1%2F49fc597e8bba47a6a708a99a96d41918"
    },
    {
      "author": "Jack Brook, Michael Biesecker, Jim Mustian, Cedar Attanasio",
      "description": "A Mexican immigrant whose skull was broken during his arrest by immigration officers last month in Minnesota says the beating was unprovoked. Alberto Castañeda Mondragón says federal agents began hitting him right after they pulled him from a vehicle. He was hospitalized with eight skull fractures and five life-threatening brain hemorrhages. Officers claimed he ran into a wall, but medical staff immediately doubted that account. His case has sparked calls for accountability and transparency. Castañeda Mondragón, who entered the U.S. legally, faces a long recovery and uncertain future. He hopes to stay in the U.S. and support his family despite fears of another encounter with ICE.",
      "publishedAt": "2026-02-07T05:01:10Z",
      "title": "Immigrant whose skull was broken during ICE arrest says beating was unprovoked",
      "url": "https://apnews.com/article/immigration-enforcement-minneapolis-hospital-ice-beating-assault-4e77742e0629fc7f127c0aa38b3d2a70",
      "urlToImage": "https://dims.apnews.com/dims4/default/cff3f9d/2147483647/strip/true/crop/2172x1447+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F98%2Fd3b31ba59f5bba8d4c0fd4bb3d28%2F94351bdc84064a95b5e3cb835e50b6db"
    },
    {
      "author": null,
      "description": "A drone attack by a notorious paramilitary group has hit a vehicle carrying displaced families in central Sudan, killing at least 24 people, including eight children, a doctors’ group said. Saturday's attack by the Rapid Support Forces occurred close to the city of Rahad in North Kordofan province, said the Sudan Doctors Network, which tracks the country’s ongoing war. The vehicle transported displaced people who fled fighting in the Dubeiker area of North Kordofan, the doctors’ group said in a statement. Among the dead children were two infants, the group said.",
      "publishedAt": "2026-02-07T08:30:51Z",
      "title": "Drone attack by paramilitary group in Sudan kills at least 24, including 8 children, doctors say",
      "url": "https://apnews.com/article/sudan-attack-war-rfs-military-displaced-21c24cd642120884e3fc00b05c02f97e",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "India and the United States have released a framework for an interim trade agreement to lower tariffs on Indian goods. The joint statement, released Friday, follows U.S. President Donald Trump's announcement to reduce import tariffs on India. This comes six months after imposing taxes to press New Delhi to cut its reliance on Russian crude. Under the deal, tariffs on Indian goods would drop to 18% from 25%. India would also reduce tariffs on U.S. goods. The agreement aims to support resilient supply chains. However, Indian opposition parties argue it favors the U.S. and impacts sensitive sectors like agriculture.",
      "publishedAt": "2026-02-07T06:01:23Z",
      "title": "India and US release framework for interim trade agreement",
      "url": "https://apnews.com/article/india-us-trade-deal-tariffs-exports-b8f7e1ce3439d023922e86f507ce9f8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Ali Swenson, Jeff Amy",
      "description": "Democrats are focusing on health care in the midterm elections, highlighting it as a key issue. Republicans have cut Medicaid through new work requirements and declined to extend COVID-era subsidies, leading to increased costs for Affordable Care Act plans. Democrats are using campaign ads and personal stories to emphasize the impact on Americans. On Saturday, Sen. Jon Ossoff plans to address health care challenges in Georgia. Republicans have struggled to pass legislation to offset health costs, making it a weak point for them. Democrats see this as an opportunity to gain political leverage in upcoming campaigns.",
      "publishedAt": "2026-02-07T05:00:18Z",
      "title": "Health costs are a top focus for Democrats in the midterms",
      "url": "https://apnews.com/article/democrats-republicans-election-2026-midterms-health-care-e2ba02302f151a03fae4f1d760cf555f",
      "urlToImage": "https://dims.apnews.com/dims4/default/810d397/2147483647/strip/true/crop/5358x3570+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Ffa%2F6a86d5e29ac821936a3363cd6741%2Fab0bc283fec24799a60e48964a76952e"
    },
    {
      "author": "Elliot Spagat",
      "description": "A federal judge says the Trump administration must bring back three deported families who should have been allowed to remain in the United States under a court settlement involving the separation of children from their parents at the border. U.S. District Judge Dana Sabraw in San Diego says the government relied on “lies, deception and coercion” to deport them. His order Thursday found the deported families could have stayed in the U.S. under terms of a legal settlement over the first Trump administration’s separation of thousands of families at the border.",
      "publishedAt": "2026-02-07T00:36:55Z",
      "title": "Judge orders Trump administration to return 3 deported families",
      "url": "https://apnews.com/article/trump-border-family-deported-separation-children-honduras-aa301c06c779e277b6487673cfd126af",
      "urlToImage": "https://dims.apnews.com/dims4/default/55d28e4/2147483647/strip/true/crop/5760x3838+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F72%2F93cea266b66f095c832753ce40c4%2F68a7cd74f85d42389900534a37b83d78"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}