{
  "articles": [
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — On Capitol Hill, House Republicans were all-in Wednesday on House Speaker Kevin McCarthy's announcement of an impeachment inquiry into President Joe Biden.",
      "publishedAt": "2023-09-13T22:19:55Z",
      "title": "Biden White House strategy for impeachment inquiry: Dismiss. Compartmentalize. Scold. Fundraise.",
      "url": "https://apnews.com/269f3791a2cf5535e860ac08ba5a5807",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9554698f6cc24a4eae3225d1a2475046/3000.jpeg"
    },
    {
      "author": "MARYCLAIRE DALE, MARC LEVY and MICHAEL RUBINKAM",
      "description": "POTTSTOWN, Pa. (AP) — A murderer who brazenly escaped from a Pennsylvania jail was captured Wednesday in the woods by a team of tactical officers, bringing an end to an intensive search that terrified residents as the fugitive broke into homes for food, changed his appearance and stole a van and rifle during two weeks on the run.",
      "publishedAt": "2023-09-13T12:40:32Z",
      "title": "Escaped murderer Danelo Cavalcante is captured in Pa. with the help of dogs and a heat-sensing plane",
      "url": "https://apnews.com/057903609fa9a6815c19d9614988b349",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ca32191ae084beeae1cbb02b7168af8/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — While a federal judge on Wednesday declared illegal a revised version of a federal policy that prevents the deportation of hundreds of thousands of immigrants brought to the U.S.",
      "publishedAt": "2023-09-13T22:34:15Z",
      "title": "Federal judge again declares that DACA is illegal with issue likely to be decided by Supreme Court",
      "url": "https://apnews.com/51ba8c941993ffa26e1251aef84b0284",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/502ab24dd1ee4a748ebc405efef4fde4/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and DASHA LITVINOVA",
      "description": "SEOUL, South Korea (AP) — North Korea’s Kim Jong Un vowed “full and unconditional support” for Russia’s Vladimir Putin on Wednesday as the two leaders isolated by the West held a summit that the U.S.",
      "publishedAt": "2023-09-13T04:03:14Z",
      "title": "North Korea's Kim vows full support for Moscow at a summit with Putin in Russia",
      "url": "https://apnews.com/0d70f5190df1088ebe53e8ca19f8e9c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c6789bd8177427db19560a41ccd854d/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and YOUSEF MURAD",
      "description": "DERNA, Libya (AP) — Search teams combed streets, wrecked buildings and even the sea Wednesday to look for bodies in a coastal Libyan city where the collapse of two dams unleashed a massive flash flood that killed at least 5,100 people.",
      "publishedAt": "2023-09-13T07:20:18Z",
      "title": "Searchers race to recover bodies in Libyan city where 5,100 died in flooding after 2 dams collapsed",
      "url": "https://apnews.com/39081eb32e4fd426119f4b486c9c2ade",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94790f0fb3f14bfd92831c8066bd41fb/1920.jpeg"
    },
    {
      "author": "MICHAEL CASEY and KATHY McCORMACK",
      "description": "LEOMINSTER, Mass. (AP) — Hurricane Lee looks poised to wallop New England later this week even as the region still deals with the impact of days of wild weather that produced torrential rain, flooding, sinkholes and a likely tornado.",
      "publishedAt": "2023-09-14T04:21:49Z",
      "title": "New England has been roiled by wild weather including a likely tornado. Next up is Hurricane Lee",
      "url": "https://apnews.com/3d1a261d6b46e6fd30bc57b44794acbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3be770da2b74874b496999a97787805/1920.jpeg"
    },
    {
      "author": "GRANT PECK and TIAN MACLEOD JI",
      "description": "BANGKOK (AP) — The younger son of ousted Myanmar leader Aung Sang Suu Kyi says he has always avoided talking to the media, but this time is different. He’s increasingly worried about his imprisoned 78-year-old mother’s health and about Myanmar's violent political crisis, which he calls desperate.",
      "publishedAt": "2023-09-13T15:58:41Z",
      "title": "Son of Aung Sang Suu Kyi is worried about her health in detention and about Myanmar's violent crisis",
      "url": "https://apnews.com/a8bc100f423395100ca2e1d89b8e5fef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5721517eefb4d05a1dd81c65350b0be/1528.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "Utah Republican Sen. Mitt Romney said Wednesday that he will not run for reelection, ending a storied two-decade political career that included the 2012 Republican GOP nomination for president and a term as Massachusetts governor.",
      "publishedAt": "2023-09-13T17:55:45Z",
      "title": "Utah GOP Sen. Mitt Romney won't seek reelection in 2024, marking end to decadeslong political career",
      "url": "https://apnews.com/e80ae66f9572ddcdcc63a666913be886",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca2f12422d95457589d50e7e83bd042a/3000.jpeg"
    },
    {
      "author": "ALI SWENSON",
      "description": "NEW YORK (AP) — As Americans fend off a late summer COVID-19 spike and prepare for a fresh vaccine rollout, Republicans are raising familiar fears that government-issued lockdowns and mask mandates are next.",
      "publishedAt": "2023-09-13T18:50:30Z",
      "title": "There's no sign of widespread COVID-19 mandates in the US. Republicans are warning of them anyway",
      "url": "https://apnews.com/0a68414277bd37458a7e2360b1bc4f11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3d8018c15284c2e964a866abf5ff136/2223.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A New Yorker upset that the city has been housing homeless migrants on his block has set up a loudspeaker to deliver an unwelcoming message to his new neighbors: \"Immigrants are not safe here.”",
      "publishedAt": "2023-09-13T17:38:52Z",
      "title": "Loudspeaker message outside NYC migrant shelter warns new arrivals they are 'not safe here'",
      "url": "https://apnews.com/d19cbe7cf5cae4cae938fe0e71866d02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d99b9b339224e16aea8a3ccf47d0882/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}