{
  "articles": [
    {
      "author": "YAHYA HABCHITI, KAREEM CHEHAYEB, and WAFAA SHURAFA",
      "description": "AITO, Lebanon (AP) — An Israeli airstrike hit an apartment building in northern Lebanon on Monday, killing at least 21 people, according to the Lebanese Red Cross.The Israeli military did not immediately comment and the target was not clear.",
      "publishedAt": "2024-10-14T06:30:26Z",
      "title": "Israeli strike in northern Lebanon kills at least 21 people",
      "url": "https://apnews.com/70c8cf5a93eec9ea643a5fda5670da93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/423cc2a79a2f4004b422e471d9952d95/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.N. Security Council expressed “strong concern” Monday as Israel has fired on and wounded U.N.",
      "publishedAt": "2024-10-14T23:59:13Z",
      "title": "UN Security Council voices 'strong concern' for UN peacekeepers after Israeli attacks",
      "url": "https://apnews.com/e391d8ffe57eebcf8bc294310bb922bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f97b1b73f8b495d8f996bcf5e7db029/3000.jpeg"
    },
    {
      "author": "GARY D. ROBERTSON and SARAH BRUMFIELD",
      "description": "RALEIGH, N.C. (AP) — Federal disaster workers paused and then changed some of their hurricane-recovery efforts in North Carolina, including abandoning door-to-door visits, after receiving threats that they could be targeted by a militia, officials said, as the government response to Helene is targeted by runaway disinformation.",
      "publishedAt": "2024-10-14T18:15:44Z",
      "title": "FEMA workers change some hurricane-recovery efforts in North Carolina after receiving threats",
      "url": "https://apnews.com/dbb6b5727eaa12e79f307bf38a4b6256",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b10312fe0c7486dad334c885a8d5211/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, WILL WEISSERT and MARK SCOLFORO",
      "description": "ERIE, Pa. (AP) — Vice President Kamala Harris zeroed in on former President Donald Trump 's comments suggesting the U.S.",
      "publishedAt": "2024-10-14T12:01:17Z",
      "title": "Harris slams Trump for suggesting military handle 'enemy from within' as they vie for Pennsylvania",
      "url": "https://apnews.com/837bf147439eabe552b56334035890bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79e0e8f1c299446d9a55c03a881d5fd4/1920.jpeg"
    },
    {
      "author": "PAUL WISEMAN and CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — With characteristic bravado, Donald Trump has vowed that if voters return him to the White House, “inflation will vanish completely.\"It’s a message tailored for Americans who are still exasperated by the jump in consumer prices that began 3 1/2 years ago.",
      "publishedAt": "2024-10-15T04:01:23Z",
      "title": "Trump's economic plans would worsen inflation, experts say",
      "url": "https://apnews.com/a18de763fcc01557258c7f33cab375ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d30c8be3e80489e835e5f77a3ef2f85/3000.jpeg"
    },
    {
      "author": null,
      "description": "SEOUL, South Korea (AP) — South Korea said North Korea blew up the northern parts of inter-Korean roads no longer in use on Tuesday, as the rivals are locked in rising animosities over North Korea’s claim that South Korea flew drones over its capital, Pyongyang.",
      "publishedAt": "2024-10-15T03:28:22Z",
      "title": "North Korea blows up parts of inter-Korean roads as tensions with South Korea soar",
      "url": "https://apnews.com/0672f5baf033cf0c4ecb2f1e1b958a41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/791db8f7908e477e8ea03ec7c21ca03c/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG, FOSTER KLUG and CLAIRE GALOFARO",
      "description": "SEOUL, South Korea (AP) — Rebecca Kimmel sat in a small room, stunned and speechless, staring at the baby photo she had just unearthed from her adoption file.It was a black-and-white shot of an infant, possibly taken at an orphanage in Gwangju, the South Korean city where Kimmel had heard all her life that she’d been abandoned.",
      "publishedAt": "2024-10-15T01:48:06Z",
      "title": "Who am I? A South Korean adoptee finds answers about the past — just not the ones she wants",
      "url": "https://apnews.com/c1a432ae1c0c3557b27004215c8ef3b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9a470913c9c4cacb1a0989a02fb5c52/3000.jpeg"
    },
    {
      "author": "ANITA SNOW, CHRISTOPHER L. KELLER and MORGAN LEE",
      "description": "ALBUQUERQUE, N.M. (AP) — Ten times as many migrants died in New Mexico near the U.S.-Mexico border in each of the last two years compared with just five years ago as smuggling gangs steer them — exhausted, dehydrated and malnourished — mostly into the hot desert, canyons or mountains west of El Paso, Texas.",
      "publishedAt": "2024-10-15T04:04:43Z",
      "title": "Migrant deaths in New Mexico have increased tenfold",
      "url": "https://apnews.com/677a6b57e729ca076a0d12dba31c3b70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0b939c1ab55430db19e4d1360f62737/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Sean “Diddy” Combs was hit Monday with a new wave of lawsuits accusing him of raping women, sexually assaulting men and molesting a 16-year-old boy.",
      "publishedAt": "2024-10-14T18:10:31Z",
      "title": "6 people accuse Diddy of sexual assault in new lawsuits, including man who was 16 at the time",
      "url": "https://apnews.com/6349f77fa3a5fb1cc4030d7abd65ccba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0917bc44ad3949758c06d1cb09a4322d/3000.jpeg"
    },
    {
      "author": "DENNIS WASZAK Jr.",
      "description": "EAST RUTHERFORD, N.J. (AP) — Josh Allen and the Buffalo Bills overcame a Hail Mary touchdown throw by Aaron Rodgers as the first half ended to outlast the New York Jets 23-20 on Monday night and take control of the AFC East.",
      "publishedAt": "2024-10-15T03:44:47Z",
      "title": "Allen and Bills overcome Rodgers' Hail Mary and beat Jets 23-20 to take control in AFC East",
      "url": "https://apnews.com/6689aadc56ec90447e89533f889f3ae5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d49a6bbf75434d0098ba701e8835e7c3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}