{
  "articles": [
    {
      "author": "SAMYA KULLAB",
      "description": "LYMAN, Ukraine (AP) — Concealed under pine branches in the forests of northeast Ukraine, the muzzle of a Soviet-era howitzer rises, aiming for a group of approaching Russian infantrymen many kilometers away.",
      "publishedAt": "2023-09-03T06:02:28Z",
      "title": "Russians press Ukraine in the northeast to distract from more important battles in counteroffensive",
      "url": "https://apnews.com/076958458cda077cca5d5320c755b626",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9761c91607054657bbff17403a881dd5/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "LIVE OAK, Fla. (AP) — President Joe Biden on Saturday saw from the sky Hurricane Idalia's impact across a swath of Florida before he set out on a walking tour of a city recovering from the storm.",
      "publishedAt": "2023-09-02T04:03:22Z",
      "title": "Biden tells Idalia's Florida victims 'your nation has your back.' DeSantis rejects meeting with him",
      "url": "https://apnews.com/3ff2f44e6a314dfaf1e329fa10ac1b5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73786c8ad0794ad2a6d54fbe1e635c93/1920.jpeg"
    },
    {
      "author": null,
      "description": "RENO, Nev. (AP) — Authorities in Nevada were investigating a death at the site of the Burning Man festival where thousands of attendees remained stranded Saturday night as flooding from storms swept through the Nevada desert.",
      "publishedAt": "2023-09-02T20:16:14Z",
      "title": "Death under investigation at Burning Man as flooding strands thousands at Nevada festival site",
      "url": "https://apnews.com/d6cd88ee009c6e1f6d2d92739ec1ca18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eeca78822834573a1795eb3b7c6dcde/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu said Sunday he wants Eritrean migrants involved in a violent clash in Tel Aviv to be deported immediately and has ordered a plan to remove all of the country's African migrants.",
      "publishedAt": "2023-09-03T09:31:50Z",
      "title": "Israel's Netanyahu says he wants Eritrean migrants involved in violent clashes to be deported",
      "url": "https://apnews.com/25d4e5ebe0bda2d6c40e2ae25c1e0cf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/672b51cf09874e8fbbc5e3eebb199473/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER",
      "description": "Body camera video of the fatal police shooting of Ta'Kiya Young, a 21-year-old pregnant mother in a suburb of Columbus, Ohio, has raised questions about how an allegation of shoplifting led to a bullet being fired through her windshield.",
      "publishedAt": "2023-09-03T04:04:24Z",
      "title": "Fatal police shooting of pregnant Ohio woman raises concerns over firing at moving vehicles",
      "url": "https://apnews.com/8bb256e64494834a84bee8bac3321d97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ffaadc2589b4c0d9533cd7833d45ad6/3000.jpeg"
    },
    {
      "author": "CARA ANNA",
      "description": "NAIROBI, Kenya (AP) — Much of the world takes daily weather forecasts for granted. But most of Africa's 1.3 billion people live with little advance knowledge of what’s to come. That can be both deadly and expensive, with damage running in the billions of dollars.",
      "publishedAt": "2023-09-03T06:45:05Z",
      "title": "As Africa opens a climate summit, poor weather forecasting keeps the continent underprepared",
      "url": "https://apnews.com/e50605f08f31d7a2daa1a6286693b7fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9520fc20f4574558afcd1c333d7ca550/3000.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — The governor of the German state of Bavaria said Sunday that he will let his deputy stay in office despite a furor that started with allegations he was responsible for an antisemitic flyer when he was a high school student 35 years ago.",
      "publishedAt": "2023-09-03T09:40:26Z",
      "title": "Bavaria's governor leaves his deputy in office despite a furor over antisemitism allegations",
      "url": "https://apnews.com/11b4dece159a7aadeaf1cf34dd4b1be5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7fb1f6354ea488fb2666207afe84775/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "TIJUANA, Mexico (AP) — As the U.S. government built its latest stretch of border wall, Mexico made a statement of its own by laying remains of the Berlin Wall a few steps away. The 3-ton pockmarked, gray concrete slab sits between a bullring, a lighthouse and the border wall, which extends into the Pacific Ocean.",
      "publishedAt": "2023-09-03T04:05:44Z",
      "title": "Berlin Wall relic gets a 'second life' on US-Mexico border as Biden adds barriers",
      "url": "https://apnews.com/19e6e05608cca24d1c0b00f3ccc5686f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7951f98225f5482187118f996df9fa7f/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and SARUUL ENKHBOLD",
      "description": "ULAANBAATAR, Mongolia (AP) — Pope Francis sent a special greeting to China’s “noble” people on Sunday, giving them a special shout-out at the end of a Mass celebrated in neighboring Mongolia during the first-ever papal visit that was largely overshadowed by Beijing and its crackdown on religious minorities.",
      "publishedAt": "2023-09-03T03:42:09Z",
      "title": "Pope gives 'noble' Chinese people a shout-out at Mass in Mongolia in bid to warm ties",
      "url": "https://apnews.com/1d7cf3a3987b3565d00d0d8f5b43182c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc90aee2318d49b3a006217f7351402c/2762.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — Taiwan suspended flights, rail transport and ferry services along with classes and outdoor events and urged workers to stay home on Sunday as Typhoon Haikui churned across the southern part of the island.",
      "publishedAt": "2023-09-03T03:28:48Z",
      "title": "Taiwan suspends work, transport and classes as Typhoon Haikui slams into the island",
      "url": "https://apnews.com/96100ee731a8175c37488e84812adcdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/375a3ca997be47a29f4f49ebeaabe9c9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}