{
  "articles": [
    {
      "author": "Nicholas Riccardi, Mark Sherman",
      "description": "The Supreme Court has blocked, for now, the deportations of any Venezuelans held in northern Texas under an 18th century wartime law. In a brief order early Saturday, the court directed the Trump administration not to remove Venezuelans held in the Bluebonnet Detention Center “until further order of this court.” Justices Clarence Thomas and Samuel Alito dissented. The high court acted in an emergency appeal from the American Civil Liberties Union contending that immigration authorities appeared to be moving to restart removals under the Alien Enemies Act of 1798.",
      "publishedAt": "2025-04-18T18:50:42Z",
      "title": "Supreme Court blocks, for now, deportations of any Venezuelans held in northern Texas",
      "url": "https://apnews.com/article/aclu-trump-deport-venezuelans-supreme-court-5d85ffec44fca7c267315b34cec9ddb2",
      "urlToImage": "https://dims.apnews.com/dims4/default/c417445/2147483647/strip/true/crop/3514x1977+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2Ff5%2F03af1fe2bfa9751087e83a54a2f5%2F6977895aa7624aa58ea012cb64146ffa"
    },
    {
      "author": "Mary Clare Jalonick, Adriana Gomez Licon",
      "description": "Maryland Sen. Chris Van Hollen says Kilmar Abrego Garcia, who was wrongly deported, told him he has been moved from the notorious Salvadoran prison known as CECOT to a detention center with better conditions. Van Hollen says the Salvadoran man told him in a meeting Thursday that he had shared a cell with 25 prisoners and was fearful of many of them. The senator, who visited El Salvador, told reporters the case is more than just about Abrego Garcia. “It’s about protecting the constitutional rights of everybody who resides in the United States,” Van Hollen said.",
      "publishedAt": "2025-04-18T18:59:06Z",
      "title": "US senator says Abrego Garcia case is about far more than one man",
      "url": "https://apnews.com/article/van-hollen-abrego-garcia-el-salvador-deportation-53c7c2dc95486f5f0c4afd96dc0fb01c",
      "urlToImage": "https://dims.apnews.com/dims4/default/51a5b13/2147483647/strip/true/crop/5673x3191+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F09%2F62717163b03908e528697903d72e%2Fae191a0f6a414c86a3c83e0427568c66"
    },
    {
      "author": "Meg Kinnard",
      "description": "During his campaign, Donald Trump said repeatedly that he would be able to end the war between Russia and Ukraine “in 24 hours” upon taking office. He has changed his tone since becoming president again. As various U.S. emissaries have held talks looking for an end to the war, both Trump and his top officials have become more reserved about the prospects of a peace deal. Secretary of State Marco Rubio on Friday suggested the U.S. might soon back away from negotiations altogether without more progress. Trump's shift is noteworthy given his prior term as president and his long histories with both Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy.",
      "publishedAt": "2025-04-19T04:01:29Z",
      "title": "How Trump backed away from promising to end Russia-Ukraine war",
      "url": "https://apnews.com/article/trump-russia-ukraine-war-633a216d0506c82353fc7745b69c0fe0",
      "urlToImage": "https://dims.apnews.com/dims4/default/7f29f3a/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffd%2F99%2F9c5c303988b41aa4751b2141e490%2F783dcea2f30041feb7b504d0644e3d46"
    },
    {
      "author": "Matthew Lee, Jon Gambrell",
      "description": "Iran and the United States are preparing for a second round of negotiations over Tehran’s rapidly advancing nuclear program in Rome. The talks Saturday in Italy over Easter weekend again will hinge on U.S. billionaire Steve Witkoff, the U.S. Mideast envoy of President Donald Trump, and Iranian Foreign Minister Abbas Araghchi. Whether the two men find common ground in the high-stakes negotiations could mean success or failure in the talks. At risk is a possible American or Israeli military strike on Iran’s nuclear sites, or the Iranians following through on their threats to pursue an atomic weapon.",
      "publishedAt": "2025-04-19T02:27:14Z",
      "title": "Iran, US prepare for second round of nuclear talks in Rome",
      "url": "https://apnews.com/article/iran-us-nuclear-negotiations-rome-oman-5539236d72216f55aa7766be90b963b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/8ec9969/2147483647/strip/true/crop/6512x3663+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2Fa6%2F49121926d3deff268acfed58b048%2F52a3775696134ff1b9e386f3341c8444"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States will hold talks Saturday in Rome, their second round of negotiations over Tehran’s rapidly advancing nuclear program. The talks follow a first round held in Muscat, Oman, where the two sides spoke face to face. Trump has imposed new sanctions on Iran as part of his “maximum pressure” campaign targeting the country. He has repeatedly suggested military action against Iran remained a possibility, while emphasizing he still believed a new deal could be reached by writing a letter to Iran’s 85-year-old Supreme Leader Ayatollah Ali Khamenei to jump start these talks. Khamenei has warned Iran would respond to any attack with an attack of its own.",
      "publishedAt": "2025-04-19T04:16:33Z",
      "title": "What to know about the Iran-US negotiations over Tehran's nuclear program",
      "url": "https://apnews.com/article/iran-nuclear-program-us-negotiations-explained-c8e7c09a2221c27338e151badade199f",
      "urlToImage": "https://dims.apnews.com/dims4/default/7c08f69/2147483647/strip/true/crop/2003x1127+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2F31%2F3ee7120662c3d816be5182b47702%2F4fd657095d3646a689c198e2ca03984f"
    },
    {
      "author": "Jon Gambrell",
      "description": "Yemen's Houthi rebels say U.S. airstrikes targeting the Ras Isa oil port have killed 20 people and wounded 50 others. The strikes were confirmed by the U.S. military’s Central Command, which did not acknowledge any casualties. The airstrikes represent one of the highest death tolls so far in the campaign launched under President Donald Trump that has involved hundreds of strikes since March 15. Central Command said U.S. forces acted to eliminate fuel for the Houthis and deprive them of illegal revenue.",
      "publishedAt": "2025-04-18T01:21:03Z",
      "title": "US strikes on oil port in Yemen kill 20, Houthi rebels say",
      "url": "https://apnews.com/article/yemen-us-airstrikes-563f61bbd96e1f2de68373fdf76c8811",
      "urlToImage": "https://dims.apnews.com/dims4/default/55a57bd/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F64%2F7202dc2069d1c5e6e7f243dbb0a6%2F44231e4191474113b7476d5342b9fa2c"
    },
    {
      "author": "Wafaa Shurafa, Fatma Khaled",
      "description": "Israeli airstrikes across Gaza have killed at least 17 people including children as the new U.S. ambassador to Israel made his first public appearance in Jerusalem. Gaza hospitals say among the dead early Friday were 10 people in the urban Jabaliya refugee camp, including eight from the same house. The strikes come a day after more than two dozen people died in Gaza as Israel ramps up attacks to pressure Hamas to return the hostages and disarm. U.S. Ambassador to Israel Mike Huckabee appeared at the Western Wall, the holiest Jewish prayer site in Jerusalem’s Old City, where he inserted a prayer handwritten by President Donald Trump.",
      "publishedAt": "2025-04-18T09:37:55Z",
      "title": "Israeli strikes kill at least 17 in Gaza and Huckabee makes first appearance as US ambassador",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-18-2025-4b267bb6600d0a41f899815bf3361563",
      "urlToImage": "https://dims.apnews.com/dims4/default/e8f748b/2147483647/strip/true/crop/7633x4294+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2Fe9%2Fa9f3c44cebe120926face5ecd6ea%2F814c264b0c844b1c8305ecfea0730486"
    },
    {
      "author": "Kate Payne, Heather Hollingsworth",
      "description": "After a deadly shooting at Florida State University, questions are emerging about how the stepson of a beloved sheriff’s deputy tasked with school safety at a middle school became the accused gunman. Political science student Phoenix Ikner was a long-standing member of a sheriff’s office youth advisory council. But when officers rushed to the university’s student union on reports of gunfire, authorities say it was the 20-year-old who used his stepmother’s former service weapon to open fire, killing two men and wounding six others. The chief of safety for Leon County Schools said the allegations underscore that “none of us are immune to tragedy.”",
      "publishedAt": "2025-04-19T04:03:31Z",
      "title": "Questions emerge about how a deputy's stepson became the accused gunman in deadly FSU shooting",
      "url": "https://apnews.com/article/phoenix-ikner-fsu-shooting-971835051a7f9b11e5cf4bc4ce018d8b",
      "urlToImage": "https://dims.apnews.com/dims4/default/70979a0/2147483647/strip/true/crop/2877x1618+0+150/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Ffc%2Faa330f1a50cc05f23811a9595d43%2F86100f9791de42ebaebd176a122e74f9"
    },
    {
      "author": "Hallie Golden",
      "description": "At least $1.6 million in federal funds for projects meant to capture and digitize stories of the systemic abuse of generations of Indigenous children in boarding schools at the hands of the U.S. government have been slashed due to federal funding cuts under President Donald Trump’s administration. The cuts are just a fraction of the grants canceled by the National Endowment for the Humanities in recent weeks as part of the Republican administration’s deep cost-cutting effort across the federal government. But coming on the heels of a major federal boarding school investigation by the previous administration and an apology by then-President Joe Biden, they illustrate a seismic shift.",
      "publishedAt": "2025-04-19T04:07:40Z",
      "title": "Trump administration makes major cuts to Native American boarding school research projects",
      "url": "https://apnews.com/article/boarding-school-native-americans-research-grants-6309640a3df5934e46bc1151e78c99f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/9240614/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F82%2F271f713136f8ed582ec497840e2f%2Fd8b21aba2e754c3e8075097ad5c7eee5"
    },
    {
      "author": "Collin Binkley",
      "description": "As U.S. colleges are pulling back on diversity, equity and inclusion practices, students of color say they are starting to lose campus mentors, move-in events, scholarships and diversity offices where they always have felt welcome on predominately white campuses. The full scope of campus DEI rollbacks is still emerging as colleges respond to the Trump administration’s orders against diversity practices. But students at some schools say early cuts are chipping away at the sense of community that has helped open the door to higher education. The retreat from DEI has accelerated under President Donald Trump and his threats to cut federal funding.",
      "publishedAt": "2025-04-19T04:09:42Z",
      "title": "College DEI rollbacks hit students' scholarships, campus mentors",
      "url": "https://apnews.com/article/dei-diversity-equity-inclusion-college-bbe09c081d8a47fcb5616c8fa3b23cee",
      "urlToImage": "https://dims.apnews.com/dims4/default/4914060/2147483647/strip/true/crop/7230x4067+0+377/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F7a%2Fd8022e8250d30cb0e4b707dbea6c%2Ff69faa32ca98458d8e724929c1996f1d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}