{
  "articles": [
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Robbie Robertson, The Band's Canada-born lead guitarist and songwriter who mined and helped remake Americana, dies at 80.",
      "publishedAt": "2023-08-09T20:23:52Z",
      "title": "Robbie Robertson, The Band's Canada-born lead guitarist and songwriter who mined and helped remake Americana, dies at 80",
      "url": "https://apnews.com/cb624282199d54e2e7b2d6d2b5b49c5a",
      "urlToImage": ""
    },
    {
      "author": "AUDREY MCAVOY and JENNIFER SINCO KELLEHER",
      "description": "KAHULUI, Hawaii (AP) — A wildfire tore through the heart of Maui on Wednesday with alarming speed and ferocity, destroying dozens of homes and businesses in a historic tourist town, killing at least six people and injuring at least two dozen others, and forcing panicked residents to jump into the ocean to flee the flames.",
      "publishedAt": "2023-08-09T12:08:25Z",
      "title": "At least 6 killed in wildfires that devastated parts of the Hawaiian island of Maui, official says",
      "url": "https://apnews.com/ec23c16abfbeb6ba689f1a98263720db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cb5a732fcb74c36aecacb8ddee16ecd/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "Special counsel Jack Smith's team obtained a search warrant in January for records related to former President Donald Trump's Twitter account, and a judge levied a $350,000 fine on the company for missing the deadline to comply, according to court documents released Wednesday.",
      "publishedAt": "2023-08-09T16:59:24Z",
      "title": "Special counsel got a search warrant for Twitter to turn over info on Trump's account, documents say",
      "url": "https://apnews.com/9e66943fd7ebdae0038838c144b57d4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf3c9e7fb9df4f6c9d1c98f833c06051/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — In a sign of growing strains between the world's two biggest powers, President Joe Biden signed an executive order Wednesday that would block and regulate high-tech U.S.-based investments going toward China.",
      "publishedAt": "2023-08-09T20:00:31Z",
      "title": "Biden issues an executive order restricting US investments in Chinese technology",
      "url": "https://apnews.com/dd6a5b138e6c7cba31468dc89f776e8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24c60619b31e4a0782a167817857f707/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and SAM METZ",
      "description": "SALT LAKE CITY (AP) — A Utah man accused of making threats against President Joe Biden was shot and killed by FBI agents hours before the president was expected to land in the state Wednesday, authorities said.",
      "publishedAt": "2023-08-09T19:51:57Z",
      "title": "Utah man suspected of threatening President Joe Biden shot and killed as FBI served warrant",
      "url": "https://apnews.com/ba3cc1d3b2f6cca8bd429febdcf04219",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e7bebff33e84591a79c27512fc03066/3000.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "Robbie Robertson, The Band's lead guitarist and songwriter who in such classics as “The Weight,” “Up on Cripple Creek” and “The Night They Drove Old Dixie Down\" mined and helped reshape American music, died Wednesday at 80.",
      "publishedAt": "2023-08-09T20:26:00Z",
      "title": "Robbie Robertson, lead guitarist and songwriter of The Band, dies at 80",
      "url": "https://apnews.com/ce20333333e04bf392a20976129459f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0c428e9a7b344caa5cddd3fea7465a6/3000.jpeg"
    },
    {
      "author": "SARA BURNETT and CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — Abortion wasn't technically on the ballot in Ohio's special election. But the overwhelming defeat of a measure that would have made it tougher to enshrine abortion rights in the state constitution this fall was the latest indicator that the issue remains a powerful force at the ballot box.",
      "publishedAt": "2023-08-09T15:21:57Z",
      "title": "Ohio vote shows enduring power of abortion rights at ballot box, giving Democrats a path in 2024",
      "url": "https://apnews.com/e3db04beec5c1edd860df5d648adfd60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fba0b97e75504d17898590b78c902266/1920.jpeg"
    },
    {
      "author": "BRENDAN FARRINGTON and FREIDA FRISARO",
      "description": "TALLAHASSEE, Fla. (AP) — Florida Gov. Ron DeSantis on Wednesday suspended the top prosecutor in Orlando, again wielding his executive power over local government in taking on a contentious issue in the 2024 presidential race.",
      "publishedAt": "2023-08-09T13:49:16Z",
      "title": "Florida Gov. DeSantis suspends another Democratic prosecutor as he seeks GOP presidential nomination",
      "url": "https://apnews.com/45d2f5955b87fb5c0e817d9da9133393",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43d41ab6ee4a447d9d81e5f3bd47a4dc/3000.jpeg"
    },
    {
      "author": "MICKENSON DUVERGÉ and DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Kidnappers in Haiti released a U.S. nurse and her daughter Wednesday, nearly two weeks after they were snatched at gunpoint from the campus of a Christian-run school near Port-au-Prince, underscoring the severe security risks for visitors to a capital city largely controlled by gangs.",
      "publishedAt": "2023-08-09T14:04:38Z",
      "title": "Kidnappers in Haiti release US nurse and her young daughter nearly 2 weeks after their abduction",
      "url": "https://apnews.com/3235714657b1797bd682ca4ead3706f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73b4c7e4f57a4c0ea9cf18e305eaac7e/1619.jpeg"
    },
    {
      "author": "BY DANIEL KOZIN, WILFREDO LEE and FREIDA FRISARO",
      "description": "LAYTON, Fla. (AP) — Steps away from the warming waters of Florida Bay, marine biologist Emily Becker removed covers from the dozens of water-filled tanks under her watchful eye.",
      "publishedAt": "2023-08-09T15:04:05Z",
      "title": "High ocean temperatures are harming the Florida coral reef. Rescue crews are racing to help",
      "url": "https://apnews.com/207cb6914deb0d588f29c3b27763b316",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/327fae8104634f83a4e6d1e0fddb33f5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}