{
  "articles": [
    {
      "author": "BOBBY CAINA CALVAN, JENNIFER SINCO KELLEHER and CHRISTOPHER WEBER",
      "description": "LAHAINA, Hawaii (AP) — The head of the Maui Emergency Management Agency resigned abruptly Thursday, a day after saying he had no regret about not using sirens to warn residents of wildfires that devastated the historic seaside community of Lahaina and killed at least 111 people.",
      "publishedAt": "2023-08-17T04:47:10Z",
      "title": "Maui's emergency services chief resigns after facing criticism for not activating sirens during fire",
      "url": "https://apnews.com/c8cfcacd2e63bdcd66ec13f2963cea8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b90086b74ca84a329b723313f0015933/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "The Justice Department is seeking 33 years in prison for Enrique Tarrio, the former Proud Boys leader convicted of seditious conspiracy in one of the most serious cases to emerge from the Jan.",
      "publishedAt": "2023-08-18T02:00:44Z",
      "title": "Justice Department seeks 33 years in prison for ex-Proud Boys leader Enrique Tarrio in Jan. 6 case",
      "url": "https://apnews.com/aa8fd5e8acbc5d173e6e462974014bc7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed87908ab91943aa8ad5bfdad62bda4f/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Rudy Giuliani glared across a Washington hearing room as a lawyer seeking his disbarment after the Jan. 6 insurrection asked: How did this man, celebrated as “America’s mayor” after 9/11, become a leader of an attempt to overturn a national election?",
      "publishedAt": "2023-08-17T20:14:04Z",
      "title": "The fall of Rudy Giuliani: How ‘America’s mayor’ tied his fate to Donald Trump and got indicted",
      "url": "https://apnews.com/eb2ff2ca7a94f9f80e95e897584c8e7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad52239a603d47eea4007d42aeb12608/3000.jpeg"
    },
    {
      "author": null,
      "description": "YELLOWKNIFE, Northwest Territories (AP) — Thousands of residents fled the capital of Canada's Northwest Territories ahead of an approaching wildfire Thursday, some driving hundreds of miles to safety and others waiting in long lines for emergency flights, the latest chapter in Canada's worst fire season on record.",
      "publishedAt": "2023-08-17T03:51:55Z",
      "title": "Residents flee, airlifts begin as wildfire approaches capital of Canada's Northwest Territories",
      "url": "https://apnews.com/ca509a053f45f3797b93286f94d6b198",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccc811adc74946ff8fc219d399f527f4/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and EMILY SWANSON",
      "description": "WASHINGTON (AP) — President Joe Biden has devoted the past several weeks to promoting the positive impacts of his policies — but his efforts have yet to meaningfully register with the public.Only 36% of U.S.",
      "publishedAt": "2023-08-17T04:07:01Z",
      "title": "Biden's approval rating on the economy stagnates despite slowing inflation, AP-NORC poll shows",
      "url": "https://apnews.com/c3fc17ffe3e1a9c865e2f9627ef4bea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d57dfb6eb30740b4864667330831d14c/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. military academies must improve their leadership, stop toxic practices such as hazing and shift behavior training into the classrooms, according to a Pentagon study aimed at addressing an alarming spike in sexual assaults and misconduct.",
      "publishedAt": "2023-08-17T12:01:12Z",
      "title": "Pentagon review calls for reforms to reverse spike in sexual misconduct at military academies",
      "url": "https://apnews.com/8753bdc6ba693836e787ee4dca5194d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3044a49559c2425c928c5e52364356c2/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Rosalynn Carter will celebrate her 96th birthday at home Friday with her husband, former President Jimmy Carter, and other family members, while the surrounding community of Plains, Georgia, honors the former first lady's years of public health advocacy.",
      "publishedAt": "2023-08-18T04:11:35Z",
      "title": "Rosalynn Carter marks 96th birthday at home with the former president, butterflies and ice cream",
      "url": "https://apnews.com/3ba02fcffd3669877ac2130395a18970",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd574901b2a145d69419991bed55e7e7/3000.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS",
      "description": "BROOKHAVEN, Miss. (AP) — Citing errors by police, a Mississippi judge declared a mistrial Thursday in the case of two white men accused of chasing and shooting at a Black FedEx driver who was making a delivery.",
      "publishedAt": "2023-08-17T14:39:00Z",
      "title": "Mississippi judge declares mistrial for 2 white men charged in attack on Black FedEx driver",
      "url": "https://apnews.com/ddf3f6575b285028f82b1ebcf43ed501",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a477671ab6db47c18f9cd35bf904d55e/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KABUL, Afghanistan (AP) — Women lose value if men can see their uncovered faces in public, a spokesman for a key ministry of Afghanistan’s Taliban government said Thursday, adding that religious scholars in the country agree that a woman must keep her face covered when outside the home.",
      "publishedAt": "2023-08-17T13:58:20Z",
      "title": "Taliban official says women lose value if their faces are visible to men in public",
      "url": "https://apnews.com/52937354eb8a89f916fd2dbc1f83c0d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a65cb54d2be49d281f439fd29f903a7/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A Canadian woman was sentenced to nearly 22 years in prison in Washington Thursday in the mailing of a threatening letter containing the poison ricin to then-President Donald Trump at the White House.",
      "publishedAt": "2023-08-17T17:37:39Z",
      "title": "Canadian woman sentenced to nearly 22 years for 2020 ricin letter sent to Trump in White House",
      "url": "https://apnews.com/10666b80df1c0beaf6c48bf4c453a47a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f097621189e430bbcf4eb8084c2d764/1489.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}