{
  "articles": [
    {
      "author": "NATALIE MELZER and KAREEM CHEHAYEB",
      "description": "NAHARIYA, Israel (AP) — Hezbollah launched more than 100 rockets early Sunday across a wider and deeper area of northern Israel, with some landing near the city of Haifa, as Israel launched hundreds of strikes on Lebanon.",
      "publishedAt": "2024-09-22T04:52:27Z",
      "title": "Hezbollah hits back with more than 100 rockets across a wider and deeper area of Israel",
      "url": "https://apnews.com/fb1aa8ae061885ba86855f7fe9ec5be7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f754fcd4718e4086bb8397b655b5eccb/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Israeli troops raided the offices of the satellite news network Al Jazeera in the Israeli-occupied West Bank early Sunday, ordering the bureau to shut down amid a widening campaign by Israel targeting the Qatar-funded broadcaster as it covers the Israel-Hamas war in the Gaza Strip.",
      "publishedAt": "2024-09-22T01:58:42Z",
      "title": "Israel raids and shuts down Al Jazeera's bureau in Ramallah in the West Bank",
      "url": "https://apnews.com/4abdb2969e39e7ad99dfbf9caa7bb32c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e4ed1d4fa084cfe9887260936b1ed0f/1920.jpeg"
    },
    {
      "author": "NASSER KARIMI",
      "description": "TEHRAN, Iran (AP) — An explosion in a coal mine in eastern Iran killed at least 34 workers and injured 17 others, officials said Sunday, marking one of the worst mining disasters in the country's history as others remained missing hours after the blast.",
      "publishedAt": "2024-09-22T04:50:26Z",
      "title": "An explosion at a coal mine in eastern Iran kills at least 34 workers",
      "url": "https://apnews.com/f118b458f3350d7d655116c36ec261b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a8c18456c30409f9d6e40d28d87b896/1707.jpeg"
    },
    {
      "author": "MEG KINNARD and ERIK VERDUZCO",
      "description": "WILMINGTON, N.C. (AP) — Donald Trump returned to North Carolina on Saturday, stumping in the southern battleground state with direct appeals to women, claiming he would be a better champion for them than Vice President Kamala Harris, who is vying to become the first female president.",
      "publishedAt": "2024-09-21T04:04:07Z",
      "title": "Trump appeals to women in return to North Carolina without Mark Robinson, a top in-state supporter",
      "url": "https://apnews.com/1bc79594567860c9ffe7f44375fac847",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19e66c5bfb6c42588ae2bfcba32e63f2/1920.jpeg"
    },
    {
      "author": "KRISHAN FRANCIS and SHIEKH SAALIQ",
      "description": "COLOMBO, Sri Lanka (AP) — Marxist lawmaker Anura Kumara Dissanayake was leading Sri Lanka’s presidential election after knocking out the incumbent liberal President Ranil Wickremesinghe from the race, as officials on Sunday began a second round of vote counting for the first time in the nation's history.",
      "publishedAt": "2024-09-22T04:11:33Z",
      "title": "A Marxist lawmaker leads the vote count in Sri Lanka's presidential election",
      "url": "https://apnews.com/50a8990acae90fabaddd8d01c0ef5bcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfa04d09be1344728fcf24a692e87369/3000.jpeg"
    },
    {
      "author": null,
      "description": "BERLIN (AP) — A state election is taking place in Brandenburg on Sunday, three weeks after a far-right party made gains in two other states in eastern Germany.",
      "publishedAt": "2024-09-22T06:12:33Z",
      "title": "German chancellor's Social Democrats seek to hold off far right in Brandenburg state election",
      "url": "https://apnews.com/810a84f9c74c6f86aa6b52c2aff57f9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29a120b2814e4df1b8c97ffd987c2c1f/3000.jpeg"
    },
    {
      "author": null,
      "description": "BIRMINGHAM, Ala. (AP) — Multiple victims in a mass killing in Alabama were caught in the crossfire during a shooting in a popular entertainment district late Saturday, police said.Four people were killed and 18 were wounded in the shooting shortly after 11 p.m.",
      "publishedAt": "2024-09-22T07:25:33Z",
      "title": "Multiple victims in Alabama mass shooting were caught in crossfire, police say",
      "url": "https://apnews.com/5293c5068e6fec5779d19dd100fc37f5",
      "urlToImage": ""
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ and DAVID B. CARUSO",
      "description": "NEW YORK (AP) — New York City's interim police commissioner revealed late Saturday that federal authorities had executed search warrants at his homes the previous day.Thomas Donlon, who became the interim commissioner just one week ago after the resignation of his predecessor, issued a statement on the search through the police department.",
      "publishedAt": "2024-09-22T04:15:35Z",
      "title": "New York City interim police commissioner says federal authorities searched his homes",
      "url": "https://apnews.com/e5aafbff1ab6425788a7539cbc55221e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/272afb9177994816a1c4f04fe1d83958/3000.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — Sidewalks once teeming with tents, tarps and people passed out next to heaps of trash have largely disappeared from great swaths of San Francisco, a city widely known for its visible homeless population.",
      "publishedAt": "2024-09-22T04:05:05Z",
      "title": "More shelter beds and a crackdown on tents mean fewer homeless encampments in San Francisco",
      "url": "https://apnews.com/c5dad968b8fafaab83b51433a204c9ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87a3364ea56645f088caa6bc32721212/3000.jpeg"
    },
    {
      "author": "NGALA KILLIAN CHIMTOM",
      "description": "MAYOS, Cameroon (AP) — The morning sun filtered through the forest canopy, casting dappled light on this village in Cameroon. For the Baka Indigenous community, it was a timeless image.But a passing truck broke the silence and stirred up billows of dust, a reminder that the Baka now live an uneasy life along roadsides after being forced from their traditional homes.",
      "publishedAt": "2024-09-22T04:13:27Z",
      "title": "Lack of birth certificates puts Cameroon’s Indigenous people on the brink of statelessness",
      "url": "https://apnews.com/e66ac688d68f1c57cabcfd2c0ec788d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/922d4c8dc1a342a1952be1b1632dc1d8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}