{
  "articles": [
    {
      "author": null,
      "description": "MELEKHOVO, Russia (AP) — A Russian court convicted imprisoned opposition leader Alexei Navalny on charges of extremism and sentenced him to 19 years in prison on Friday. Navalny is already serving a nine-year term on a variety of charges that he says were politically motivated.",
      "publishedAt": "2023-08-04T08:51:56Z",
      "title": "Kremlin critic Navalny convicted of extremism and sentenced to 19 years in prison",
      "url": "https://apnews.com/b42769d2ba1beb99954279fbb93815d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7dc0036a06ac45b8b4f0ae52cdda73c0/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court is reinstating a regulation aimed at reining in the proliferation of ghost guns, firearms without serial numbers that have been turning up at crime scenes across the nation in increasing numbers.",
      "publishedAt": "2023-08-08T16:46:37Z",
      "title": "Supreme Court reinstates regulation of ghost guns, firearms without serial numbers",
      "url": "https://apnews.com/46b871969dc6a7da35605c2ebc5385e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10c70377e5a84042ad855fb6c66db241/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Voters in Ohio on Tuesday are weighing whether to make it more difficult to change the state's constitution, a decision that will have national implications in the debate over the future of abortion rights in the United States.",
      "publishedAt": "2023-08-08T04:04:47Z",
      "title": "A proposed constitutional change before Ohio voters could determine abortion rights in the state",
      "url": "https://apnews.com/227cde039f8d51723612878525164f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbdc34f5de374e0fae8e0531c2cf889f/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Ukrainian officials on Tuesday accused the Kremlin’s forces of targeting rescue workers by hitting residential buildings with two consecutive missiles — the first one to draw crews to the scene and the second one to wound or kill them.",
      "publishedAt": "2023-08-08T07:53:15Z",
      "title": "Ukraine accuses Russia of targeting rescue workers with consecutive missile strikes",
      "url": "https://apnews.com/6fa27eed10747b7daa85d7518e99d5ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/580c8b5cd6c3440ab2595a826e520582/2000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Republican presidential candidate Ron DeSantis is replacing his campaign manager as the Florida governor resets his sluggish presidential campaign.",
      "publishedAt": "2023-08-08T15:33:35Z",
      "title": "DeSantis replaces his campaign manager as he resets his faltering 2024 presidential bid",
      "url": "https://apnews.com/5191c6199058124b195b278d0d1e549b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/efc30a51958b41acbdb7def8b8ae978d/3000.jpeg"
    },
    {
      "author": "SARAH BRUMFIELD",
      "description": "SILVER SPRING, Md. (AP) — Crews across the eastern U.S. worked Tuesday to clear downed trees and powerlines and restore electricity following severe storms that killed at least two people, cut power to more than a million customers at their peak, and forced thousands of flight delays and cancellations.",
      "publishedAt": "2023-08-08T17:00:27Z",
      "title": "US east cleans up after deadly storms as New England braces for flooding",
      "url": "https://apnews.com/097072b7852d2d8795d9f919df37c7dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b5de8ef7bf44021acd97bf4cd66b3b0/1920.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "Here we go again: COVID-19 hospital admissions have inched upward in the United States since early July in a small-scale echo of the three previous summers.With an updated vaccine still months away, this summer bump in new hospitalizations might be concerning, but the number of patients is far lower than before.",
      "publishedAt": "2023-08-08T18:49:37Z",
      "title": "COVID-19 hospitalizations in the US are on the rise again, but not like before",
      "url": "https://apnews.com/9a831de37210c53c1ee48a30ad2ee611",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8d0ad7d822a43f7a352e9c11d2cf9eb/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and TERRY TANG",
      "description": "TUSAYAN, Ariz. (AP) — Declaring it good “not only for Arizona but for the planet,” President Joe Biden on Tuesday signed a national monument designation for the greater Grand Canyon, turning the decades-long visions of Native American tribes and environmentalists into reality.",
      "publishedAt": "2023-08-08T04:16:27Z",
      "title": "Biden makes Grand Canyon monument designation, citing Arizona tribal heritage, climate concerns",
      "url": "https://apnews.com/9382960f18408dce7aec52f103404e11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69b605dea05440bc9782668a367bda51/3000.jpeg"
    },
    {
      "author": "MELINA WALLING",
      "description": "Even in Antarctica — one of the most remote and desolate places on Earth — scientists say they are finding shattered temperature records and an increase in the size and number of wacky weather events.",
      "publishedAt": "2023-08-08T04:29:02Z",
      "title": "Even frozen Antarctica is being walloped by climate extremes, scientists find",
      "url": "https://apnews.com/d9eff33e1acc06512e4e47156745237a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21a52850b0b14e31ba476883abfe4ae2/3000.jpeg"
    },
    {
      "author": "TOM MURPHY",
      "description": "INDIANAPOLIS (AP) — Eli Lilly’s diabetes treatment Mounjaro, which is widely used for weight loss, raked in nearly $1 billion in second-quarter sales, or more than $200 million above what Wall Street had expected.",
      "publishedAt": "2023-08-08T14:07:08Z",
      "title": "Soaring sales of diabetes drug Mounjaro, widely used for weight loss, sends Eli Lilly to new heights",
      "url": "https://apnews.com/3813e91810bc6eb108c95ed96cd773e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56cb6f1a66cf4be1981c5f5eebe46593/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}