{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, ERIC TUCKER, MICHELLE L. PRICE and COLLEEN LONG",
      "description": "NEW YORK (AP) — It wasn't until after a decade in the fold, after his family pleaded with him, after the FBI raided his office, apartment and hotel room, Michael Cohen testified Tuesday, that he finally decided to turn on Donald Trump.",
      "publishedAt": "2024-05-14T04:03:46Z",
      "title": "Check stubs, fake receipts, blind loyalty: Cohen offers inside knowledge in Trump's hush money trial",
      "url": "https://apnews.com/735aadfd1ce015e05ba955c203a96f1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/00cb62e1d69a4d90afb6dddafa252ec7/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — Palestinians on Wednesday will mark the 76th year of their mass expulsion from what is now Israel, an event that is at the core of their national struggle. But in many ways, that experience pales in comparison to the calamity now unfolding in Gaza.",
      "publishedAt": "2024-05-14T04:57:07Z",
      "title": "Palestinians mark 76 years of dispossession as a potentially even larger catastrophe unfolds in Gaza",
      "url": "https://apnews.com/b5cea9556e516655c25598d5dbe54192",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c28d7cc667e94e94ac97a7a460a90985/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "More than half a million Palestinians have been displaced in recent days by escalating Israeli military operations in Rafah and northern Gaza, the United Nations says.Israelis celebrated their Independence Day on Tuesday with barbecues in parks across the country, although the normally raucous parties were smaller and quieter this year because of the war in Gaza.",
      "publishedAt": "2024-05-14T06:54:14Z",
      "title": "The Latest | UN says over half a million people flee fighting in Gaza; Israel marks Independence Day",
      "url": "https://apnews.com/322dd129c72e2be9347560d7ea7674dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15d8ea72bcce4c51b82239482806438f/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER and TERRY SPENCER",
      "description": "OCALA, Fla. (AP) — The Florida Highway Patrol has arrested the driver of a pickup truck that crashed into a farmworker bus early Tuesday, killing eight, on charges of driving under the influence-manslaughter.",
      "publishedAt": "2024-05-14T15:21:33Z",
      "title": "Driver of pickup that collided with farmworker bus in Florida, killing 8, is arrested on DUI charges",
      "url": "https://apnews.com/e9693eb05f1f920cb20b166413d91d79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab752b981a0743e6ae815c30edf8d563/1920.jpeg"
    },
    {
      "author": "BRIAN WITTE, LEAH WILLINGHAM and STEVE PEOPLES",
      "description": "ANNAPOLIS, Md. (AP) — Voters across Maryland and West Virginia will decide key primary elections Tuesday with big implications in the fight for the Senate majority this fall.",
      "publishedAt": "2024-05-14T04:09:19Z",
      "title": "Primaries in Maryland and West Virginia will shape the battle this fall for a Senate majority",
      "url": "https://apnews.com/632750f07b79a9bd4922635fd07ca644",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b866acc7e3249cd87d38ceec4c37438/3000.jpeg"
    },
    {
      "author": "LEA SKENE and DENISE LAVOIE",
      "description": "BALTIMORE (AP) — The cargo ship Dali experienced electrical blackouts about 10 hours before leaving the Port of Baltimore and yet again shortly before it slammed into the Francis Key Bridge and killed six construction workers, federal investigators said Tuesday, providing the most detailed account yet of the tragedy.",
      "publishedAt": "2024-05-14T20:19:14Z",
      "title": "Cargo ship that caused Baltimore bridge collapse had power blackouts hours before leaving port",
      "url": "https://apnews.com/b6d4797441350823adb7721164848c04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63a7f66d562f42e89cb6d3fb7e69eec9/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Boeing has violated a settlement that allowed the company to avoid criminal prosecution after two deadly crashes involving its 737 Max aircraft, the Justice Department told a federal judge on Tuesday.",
      "publishedAt": "2024-05-14T22:39:11Z",
      "title": "Justice Department says Boeing violated deal that avoided prosecution after 737 Max crashes",
      "url": "https://apnews.com/82145b25ed988cd8cae0bce3de79ce9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0b73dfc84484c04940bb114b8312d4a/3000.jpeg"
    },
    {
      "author": "MARYCLAIRE DALE and NICOLAS VAUX-MONTAGNY",
      "description": "LYON, France (AP) — An American accused of sexually assaulting a Pennsylvania college student in 2013 and later sending her a Facebook message that said, “So I raped you,” has been detained in France after a three-year search.",
      "publishedAt": "2024-05-14T17:38:41Z",
      "title": "American sought after ‘So I raped you’ Facebook message detained in France on 2021 warrant",
      "url": "https://apnews.com/2c5ba8a2d51110a5cde300ccdf60e376",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f86804c9ba046b4934ed131abe4b429/1618.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "KYIV, Ukraine (AP) — U.S. Secretary of State Antony Blinken sought Tuesday to rally the spirits of glum Ukrainians facing a fierce new Russian offensive, assuring them during a visit to Kyiv that they are not alone and that billions of dollars in American military aid on its way after months of political delays will make a “real difference” on the battlefield.",
      "publishedAt": "2024-05-14T02:30:53Z",
      "title": "Blinken in Kyiv tries to rally sagging Ukrainian spirits as Russia makes new military gains",
      "url": "https://apnews.com/41df75260903f6b9527fbf3a1a44c815",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e89102243e964f62abe8361ddce57d8e/1920.jpeg"
    },
    {
      "author": "MARTHA BELLISLE",
      "description": "For decades, police across the United States have been warned that the common tactic of handcuffing someone facedown could turn deadly if officers pin them on the ground with too much pressure or for too long.",
      "publishedAt": "2024-05-14T10:19:07Z",
      "title": "AP Investigation: Training failures can lead police to deadly use of common handcuffing tactic",
      "url": "https://apnews.com/963e94a574ef8d34d03e7ab27ee61835",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b602849f02704b9cbc7e3c44c85588ef/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}