{
  "articles": [
    {
      "author": "ALI SWENSON and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Republican presidential nominee Donald Trump is scheduled to appear Friday at the annual gathering of Moms for Liberty, a national nonprofit that has spearheaded efforts to get mentions of LGBTQ+ identity and structural racism out of K-12 classrooms.",
      "publishedAt": "2024-08-30T04:14:53Z",
      "title": "Trump seeks to activate his base at Moms for Liberty gathering but risks alienating moderate voters",
      "url": "https://apnews.com/7b408b46f58c4ba6177f809c4d0b2fb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d38ccf497cb84aabaeb475865820d721/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and JEFF AMY",
      "description": "ATLANTA (AP) — The effort to make the peace between Donald Trump and Georgia's powerful Republican governor began in a sprawling neo-Victorian mansion in the exclusive Atlanta enclave of Buckhead.",
      "publishedAt": "2024-08-30T04:09:31Z",
      "title": "How Trump and Georgia's Republican governor made peace, helped by allies anxious about the election",
      "url": "https://apnews.com/04ebe25ef4780f5a192db6ad10237ced",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29c322bd126b41e38958b7359779c372/2000.jpeg"
    },
    {
      "author": "REBECCA SANTANA and FARNOUSH AMIRI",
      "description": "The United States' longest war is over. But not for everyone.Outside of San Francisco, surgeon Doug Chin has helped provide medical assistance to people in Afghanistan via video calls. He has helped Afghan families with their day-to-day living expenses.",
      "publishedAt": "2024-08-30T04:02:32Z",
      "title": "When the US left Kabul, these Americans tried to help Afghans left behind. It still haunts them",
      "url": "https://apnews.com/f6a42bfa49507f9ba7fb977a7ebb2feb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e484c513b684a07a34c88451a92df71/1920.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy fired the commander of the country’s air force Friday, four days after an F-16 warplane that Ukraine received from its Western partners crashed during a Russian bombardment.",
      "publishedAt": "2024-08-30T11:51:33Z",
      "title": "Ukrainian president fires air force commander after fatal F-16 crash",
      "url": "https://apnews.com/2755b4fd1a5dcf1e95ae975d44427b9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d9640b6bb1e4ee5b949e3438343c7f2/2800.jpeg"
    },
    {
      "author": "ANNIE MA, CHEYANNE MUMPHREY, and SHARON LURYE",
      "description": "Before he was suspended, Zaire Byrd was thriving. He acted in school plays, played on the football team and trained with other athletes. He had never been suspended before — he'd never even received detention.",
      "publishedAt": "2024-08-30T04:05:50Z",
      "title": "Black students are still kicked out of school at higher rates despite reforms",
      "url": "https://apnews.com/d099aab519ff743dc2be04c6b6132144",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef9c0dc2b3034083bf0e9e2dfa7ac477/3000.jpeg"
    },
    {
      "author": "MARÍA TERESA HERNÁNDEZ",
      "description": "MEXICO CITY (AP) — Each time the kidnapper hung up the phone, Veronica Rosas and her relatives did the only thing they could think of: kneel, grab each other’s hands and pray.“I told God: Please help me,” said Rosas, who has spent the past nine years searching for her son, Diego Maximiliano.",
      "publishedAt": "2024-08-30T13:04:49Z",
      "title": "One day, their children didn't make it back home. Faith helps these Mexican mothers' search for them",
      "url": "https://apnews.com/cc22436c3e8601a4496cbacd8a707bf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82b423630df84e4b94aaf79ddbbf1e70/3000.jpeg"
    },
    {
      "author": "STEPHEN WHYNO",
      "description": "NHL player Johnny Gaudreau and his younger brother were killed Thursday night when they were hit by a suspected drunken driver while riding bicycles in their home state of New Jersey, police said Friday.",
      "publishedAt": "2024-08-30T12:38:26Z",
      "title": "NHL player Johnny Gaudreau and brother killed when bicycles hit by car on eve of sister's wedding",
      "url": "https://apnews.com/35de1641d040f02ecd83a9638e6aca32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/843ca18b60ed46e79333037e47fd8aeb/3000.jpeg"
    },
    {
      "author": "BRIAN WITTE and LEA SKENE",
      "description": "ANNAPOLIS, Md. (AP) — Adnan Syed’s murder conviction still stands after Maryland’s highest court Friday ordered a redo of the hearing that freed him. The court ruled that the earlier proceeding violated the rights of the victim’s family, marking the latest development in a legal saga that gained widespread attention through the hit podcast “Serial.”",
      "publishedAt": "2024-08-30T14:37:12Z",
      "title": "Adnan Syed's murder conviction still stands in ‘Serial’ case as court orders new hearing",
      "url": "https://apnews.com/8214ec142906aa3f2662d6be51738407",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/222c4605a7f844e598583928eee62f5a/3000.jpeg"
    },
    {
      "author": "MICHAEL HILL",
      "description": "KINGSTON, N.Y. (AP) — On a residential block in upstate New York, college students dig and sift backyard dirt as part of an archaeological project that could provide insights into the lives of African Americans buried there centuries ago.",
      "publishedAt": "2024-08-30T04:07:39Z",
      "title": "A centuries-old cemetery for people who were enslaved is reclaimed in New York",
      "url": "https://apnews.com/2c37a30641ac07becfbc8716654ea393",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc1e17470cea49bfb36acb0896ab224f/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — After struggling to drum up interest following its Cannes Film Festival premiere, the young Donald Trump drama “The Apprentice,” starring Sebastian Stan as the former president, has found a distributor that plans to release the film shortly before the election in November.",
      "publishedAt": "2024-08-30T17:26:53Z",
      "title": "Trump film 'The Apprentice' finds distributor, will open before election",
      "url": "https://apnews.com/d749e3c6da028a45921d493db6f5bf70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/747cefd505494c58972ef8bfa6c1d8c9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}