{
  "articles": [
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "SAVANNAH, Ga. (AP) — Vice President Kamala Harris on Thursday defended shifting away from some of her more liberal positions in her first major television interview of her presidential campaign, but insisted her “values have not changed” even as she is “seeking consensus.”",
      "publishedAt": "2024-08-29T04:18:21Z",
      "title": "Harris defends shifting from some liberal positions in first interview of presidential campaign",
      "url": "https://apnews.com/94eff1aa1247e471b48948d03faf0edf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50dc9d198ab14640bfda8b065ace5eec/1920.jpeg"
    },
    {
      "author": "ALI SWENSON and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Republican presidential nominee Donald Trump is scheduled to appear Friday at the annual gathering of Moms for Liberty, a national nonprofit that has spearheaded efforts to get mentions of LGBTQ+ identity and structural racism out of K-12 classrooms.",
      "publishedAt": "2024-08-30T04:14:53Z",
      "title": "Trump seeks to activate his base at Moms for Liberty gathering but risks alienating moderate voters",
      "url": "https://apnews.com/7b408b46f58c4ba6177f809c4d0b2fb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d38ccf497cb84aabaeb475865820d721/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA and FARNOUSH AMIRI",
      "description": "The United States' longest war is over. But not for everyone.Outside of San Francisco, surgeon Doug Chin has helped provide medical assistance to people in Afghanistan via video calls. He has helped Afghan families with their day-to-day living expenses.",
      "publishedAt": "2024-08-30T04:02:32Z",
      "title": "When the US left Kabul, these Americans tried to help Afghans left behind. It still haunts them",
      "url": "https://apnews.com/f6a42bfa49507f9ba7fb977a7ebb2feb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e484c513b684a07a34c88451a92df71/1920.jpeg"
    },
    {
      "author": "MAJDI MOHAMMED and MELANIE LIDMAN",
      "description": "TULKAREM, West Bank (AP) — The Israeli military said it killed five more West Bank militants, including a local commander, as it pressed ahead Thursday with its deadliest operation in the occupied territory since the start of the war in Gaza.",
      "publishedAt": "2024-08-29T05:56:13Z",
      "title": "Israel kills a top militant in its deadliest West Bank raids since the Gaza war began",
      "url": "https://apnews.com/ee53e1dbf7ece94151088308510e8679",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/55836cdbaaaf4ca09c833a41f20dae92/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — It was their most challenging mission.U.S. Army soldiers in the 7th Transportation Brigade had previously set up a pier during training and in exercises overseas but never had dealt with the wild combination of turbulent weather, security threats and sweeping personnel restrictions that surrounded the Gaza humanitarian aid project.",
      "publishedAt": "2024-08-30T04:08:32Z",
      "title": "Challenges of the Gaza humanitarian aid pier offer lessons for the US Army",
      "url": "https://apnews.com/2c15774379559c39f1bfe3681c2fc670",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08df13ab8994418b849af6c0819bf0de/3000.jpeg"
    },
    {
      "author": "ANNIE MA, CHEYANNE MUMPHREY, and SHARON LURYE",
      "description": "Before he was suspended, Zaire Byrd was thriving. He acted in school plays, played on the football team and trained with other athletes. He had never been suspended before — he'd never even received detention.",
      "publishedAt": "2024-08-30T04:05:50Z",
      "title": "10 years after Ferguson, Black students still are kicked out of school at higher rates",
      "url": "https://apnews.com/d099aab519ff743dc2be04c6b6132144",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef9c0dc2b3034083bf0e9e2dfa7ac477/3000.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA, DAVID BILLER and BARBARA ORTUTAY",
      "description": "SAO PAULO (AP) — It's a showdown between the world's richest man and a Brazilian Supreme Court justice.The justice, Alexandre de Moraes, has threatened to suspend social media giant X nationwide in the coming hours if its billionaire owner Elon Musk doesn't swiftly comply with one of his orders.",
      "publishedAt": "2024-08-29T20:57:02Z",
      "title": "How one Brazilian judge could suspend Musk's X in the coming hours",
      "url": "https://apnews.com/70fdaeef282e1ac7d649b99cf8241b42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6db22f0d96d64deabf15b4712dc984a9/3000.jpeg"
    },
    {
      "author": "TY ONEIL, MATT YORK and RIO YAMAT",
      "description": "GRAND CANYON NATIONAL PARK, Ariz. (AP) — Sharon Ellison and Fred Jernigan spent four days hiking and camping from one end of the Grand Canyon to the other, with plans to relax at a hotel within the park on Thursday.",
      "publishedAt": "2024-08-29T18:08:28Z",
      "title": "Grand Canyon visitors move to hotels outside the park after unprecedented breaks in water pipeline",
      "url": "https://apnews.com/3819c4a5043164abb251622db485920c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15c0fb3201f84e8585076e450a18d91e/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — One of two doctors charged in connection with Matthew Perry's death is set to appear Friday in a federal court in Los Angeles, where he is expected to plead guilty to conspiring to distribute the surgical anesthetic ketamine.",
      "publishedAt": "2024-08-30T04:09:07Z",
      "title": "Doctor charged in connection with Matthew Perry’s death to appear in court after plea deal",
      "url": "https://apnews.com/ddf6d340b5a554132f0769bc0a0ae03b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff4bb351450c4a4ba905848750277bfe/2288.jpeg"
    },
    {
      "author": "BRIAN MAHONEY",
      "description": "NEW YORK (AP) — Iga Swiatek and Jannik Sinner flashed their No. 1 form on Thursday with powerful performances that moved them into the third round of the U.S. Open.Carlos Alcaraz and Naomi Osaka couldn't quite find the games that once had them on top of the rankings.",
      "publishedAt": "2024-08-29T18:25:47Z",
      "title": "No. 1 seeds Sinner, Swiatek move into the third round at the US Open; Alcaraz, Osaka eliminated",
      "url": "https://apnews.com/19d21d0e23be3dc91ea7e72810129a7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d1ef84d54ce42d39a7f16a9aa179f96/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}