{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — Democrat Ruben Gallego wins election to U.S. Senate from Arizona.",
      "publishedAt": "2024-11-12T04:50:15Z",
      "title": "Democrat Ruben Gallego wins election to U.S. Senate from Arizona",
      "url": "https://apnews.com/ae6f78c3392e488bb6f852eadbf7de87",
      "urlToImage": ""
    },
    {
      "author": "MICHELLE L. PRICE, JILL COLVIN, ZEKE MILLER and MATTHEW DALY",
      "description": "NEW YORK (AP) — President-elect Donald Trump on Monday named former New York congressman Lee Zeldin to lead the Environmental Protection Agency as he continues to build out his future administration with loyal supporters.",
      "publishedAt": "2024-11-11T16:25:43Z",
      "title": "Trump names former Rep. Lee Zeldin to lead EPA, adviser Stephen Miller to be deputy chief of policy",
      "url": "https://apnews.com/9cc6ad3118779b23bff88022ca5e2260",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8bedf847b4340dfbcb5578197c7d91a/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Control over the U.S. House of Representatives still hangs in the balance, teetering between a Republican or Democratic majority with fewer than 20 races left to be called.",
      "publishedAt": "2024-11-11T13:58:12Z",
      "title": "The Latest: Fewer than 20 races to be called as control of Congress hangs in the balance",
      "url": "https://apnews.com/19cddf27f405088edf67d802cbd5b08c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9313367711d4ce49b516cb4ca0ba59f/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — Democrat Ruben Gallego has been elected Arizona’s first Latino U.S. senator, defeating Republican Kari Lake and preventing Republicans from further padding their Senate majority.",
      "publishedAt": "2024-11-12T04:54:01Z",
      "title": "Democrat Ruben Gallego wins Arizona US Senate race against Republican Kari Lake",
      "url": "https://apnews.com/ea364326c93f9a8a32b7b9ca7ca696d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bb75dbc074c45c6bdefff60da0434f9/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel’s new foreign minister said Monday that there has been “certain progress” in efforts to end the fighting with Lebanon’s Hezbollah. But a spokesman for the militant group said it had not received any official proposal and was prepared to wage a long war if needed.",
      "publishedAt": "2024-11-11T07:11:49Z",
      "title": "Middle East latest: Israeli minister reports some progress toward cease-fire but Hezbollah unaware",
      "url": "https://apnews.com/8c59ef1c325baf6267bedd8ca4bf4aa6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/013f24797396405ca529c5220b57c25c/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Israel has begun a construction project along the so-called Alpha Line that separates the Israeli-occupied Golan Heights from Syria, apparently laying asphalt for a road right along the frontier, satellite photos analyzed by The Associated Press show.",
      "publishedAt": "2024-11-11T16:04:13Z",
      "title": "Israel's military is building along UN-patrolled demilitarized zone in Syria, satellite images show",
      "url": "https://apnews.com/6f1bf012a39f721ab36f33f1c6bea2b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39edb343d49a4fffba22058aa8ebafe1/2891.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korea ratified a major defense treaty with Russia stipulating mutual military aid, the North’s state media reported Tuesday, as the U.S., South Korea and Ukraine say North Korea has sent thousands of troops to Russia to support its war against Ukraine.",
      "publishedAt": "2024-11-12T03:06:11Z",
      "title": "North Korea ratifies major defense treaty with Russia",
      "url": "https://apnews.com/059d73e4c3492c19b555476b2fb45ca9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11113c76bd0940ba81413e53b206df44/3000.jpeg"
    },
    {
      "author": "EVENS SANON and MEGAN JANETSKY",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haiti’s international airport shut down on Monday after gangs opened fire at a commercial flight landing in Port-Au-Prince, prompting some airlines to temporarily suspend operations as the country swore in a new interim prime minister who promised to restore peace.",
      "publishedAt": "2024-11-11T19:30:56Z",
      "title": "Haiti’s main airport shuts down as gang violence surges and a new prime minister is sworn in",
      "url": "https://apnews.com/5a8a96a179f26fb6cde1265483e5f4b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aabf148000e64819a87209887149f25c/1920.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — New Zealand's Prime Minister Christopher Luxon made a “formal and unreserved” apology in Parliament on Tuesday for the widespread abuse, torture and neglect of hundreds of thousands of children and vulnerable adults in care.",
      "publishedAt": "2024-11-11T22:52:28Z",
      "title": "New Zealand's leader formally apologizes to survivors of abuse in state and church care",
      "url": "https://apnews.com/294b014a126cb8c067e1da16a94f4cc7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51e58462f857445f9adbc76001b38e16/3000.jpeg"
    },
    {
      "author": "SAFIYAH RIDDLE",
      "description": "TUSKEGEE, Ala. (AP) — Tuskegee University student Sid Guynn hid under a car when he heard the gunshots that ripped across his Alabama campus amid homecoming celebrations, then ran back to his dorm, frightened by what sounded to him like a machine gun.",
      "publishedAt": "2024-11-11T15:19:12Z",
      "title": "Gunshots at Tuskegee University sent terrified students running for their lives",
      "url": "https://apnews.com/5ee5c448135a2b8ab53ecfb86f535532",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83ae4f0ce23c4a88ba1fae7a047c6785/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}