{
  "articles": [
    {
      "author": null,
      "description": "An American aid organization in Gaza says 20 Palestinians were killed at a distribution site in Khan Younis. The Gaza Humanitarian Fund said 19 died in a stampede, and one was fatally stabbed on Wednesday. The group accuses Hamas of spreading panic but provides no evidence. The United Nations reports 875 Palestinians have died near aid sites since May. Meanwhile, hospital officials say Israeli strikes killed 41 others, including 11 children. Israel claims its strikes target Hamas infrastructure, accusing the group of hiding among civilians. Gaza faces a severe humanitarian crisis, with over 2 million residents struggling amid ongoing conflict and blockades.",
      "publishedAt": "2025-07-16T07:54:09Z",
      "title": "Israel-backed aid organization in Gaza says 20 killed at distribution site, mostly in stampede",
      "url": "https://apnews.com/article/israel-palestinians-aid-organization-gaza-stampede-5c7b1562c8faecd127fd0050b2fa52a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/a5f9e66/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F6e%2Fa610f09f594507a7d407003af495%2F11572faeba5f4551b155bfa818a12de4"
    },
    {
      "author": null,
      "description": "Officials say Russian weapons pounded Ukrainian cities overnight from Tuesday to Wednesday, injuring at least 15 people in an attack that mostly targeted energy infrastructure. The latest bombardment in Russia’s escalating aerial campaign against civilian areas came ahead of a Sept. 2 deadline set by U.S. President Donald Trump for the Kremlin to reach a peace deal in the three-year war, under the threat of possible severe Washington sanctions if it doesn’t. No date has yet been publicly set for a possible third round of direct peace talks between delegations from Russia and Ukraine. Two previous rounds delivered no progress apart from prisoner swaps.",
      "publishedAt": "2025-07-16T09:02:46Z",
      "title": "Russia attacks Ukraine's cities with US peace deadline countdown underway",
      "url": "https://apnews.com/article/russia-ukraine-attack-trump-ultimatum-50-days-7388ae351bc78e42c9ab844be6b93942",
      "urlToImage": "https://dims.apnews.com/dims4/default/39ebd2e/2147483647/strip/true/crop/5772x3247+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F8f%2F8c274a9df751b002bfec5833edce%2F253f96ff090c4c75bc7a0eccf2fac769"
    },
    {
      "author": null,
      "description": "The United States says it has sent five men to the small African nation of Eswatini in an expansion of the Trump administration’s third-country deportation program. The U.S. has already deported eight men to another African nation, South Sudan, after the Supreme Court lifted restrictions on sending people to countries where they have no ties. In a post on X, Homeland Security Department Assistant Secretary Tricia McLaughlin says the men, who are citizens of Vietnam, Cuba, Yemen and Laos, have arrived in Eswatini on a plane.",
      "publishedAt": "2025-07-16T07:44:29Z",
      "title": "US sends five men to Eswatini under the Trump administration's deportation program",
      "url": "https://apnews.com/article/deportees-trump-africa-eswatini-migrant-africa-8d10c5a1de7ba50cbea9712b6b5fbfbc",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d90765/2147483647/strip/true/crop/4917x2766+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2Fc3%2Fb2d8144c0eb1c071492da01e9469%2Ffb31aed061bc48978367f30d05a1c73b"
    },
    {
      "author": null,
      "description": "President Donald Trump says he plans to place tariffs of over 10% on smaller countries, including nations in Africa and the Caribbean. “We’ll probably set one tariff for all of them,” Trump said Tuesday, adding that it could be “a little over 10% tariff” on goods from at least 100 nations. Commerce Secretary Howard Lutnick interjected that the nations with goods being taxed at these rates would be in Africa and the Caribbean, places that generally do relatively modest levels of trade with the U.S. and would be relatively insignificant for addressing Trump’s goals of reducing trade imbalances with the rest of the world.",
      "publishedAt": "2025-07-15T23:28:16Z",
      "title": "Trump to put tariffs of over 10% on smaller nations",
      "url": "https://apnews.com/article/trump-tariffs-africa-caribbean-c0307a66f3fbab26c0ece454d78e48cb",
      "urlToImage": "https://dims.apnews.com/dims4/default/415a85b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F3f%2Fbb498fb0cebce83634ba08874adf%2Ffae0c9ad787e4e2e994e8c7556028986"
    },
    {
      "author": null,
      "description": "Clashes have intensified in Syria after a ceasefire between government forces and Druze armed groups broke down. Syria's Defense Ministry accuses Druze militias of violating the agreement in Sweida province, prompting military retaliation. Reports of extrajudicial killings, looting, and civilian casualties have emerged. The Syrian Observatory for Human Rights estimates over 250 deaths since Monday including civilians and soldiers. Meanwhile, Israel has launched airstrikes on Syrian forces, citing a commitment to protect the Druze minority. Israeli leaders have warned of escalating responses if Syrian forces remain near the border.",
      "publishedAt": "2025-07-16T08:32:48Z",
      "title": "Israel threatens to escalate involvement in Syria as a ceasefire collapses",
      "url": "https://apnews.com/article/syria-clashes-druze-israel-92a72655b85fba1d0b12cc36ffe2cef3",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ae9fe9/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F68%2F82c92fff0911a6e4566444dcaa46%2F4864775fa6804f92b8f5bdf5be0432ce"
    },
    {
      "author": null,
      "description": "An “American Idol” music supervisor and her husband have been found dead in their Los Angeles home. Officers were conducting a welfare check Monday afternoon at a home in the Encino neighborhood when they found the bodies of a man and woman with gunshot wounds. An “American Idol” spokesperson has confirmed the deaths of Robin Kaye and her husband, Thomas Deluca. According to public records, the couple owned the home. Los Angeles police arrested a suspect in their deaths Tuesday.",
      "publishedAt": "2025-07-15T22:52:43Z",
      "title": "'American Idol' music supervisor and husband both found dead at LA home",
      "url": "https://apnews.com/article/american-idol-robin-kaye-homicide-death-killed-e3c2bece2b4ef19c6b83940e0182c9e5",
      "urlToImage": "https://dims.apnews.com/dims4/default/2789f2d/2147483647/strip/true/crop/5581x3139+0+162/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F50%2Fd0b4dc691c6c8b5be22f99f14ba8%2F49c22c57855f4481b54b2230176f770b"
    },
    {
      "author": null,
      "description": "The Trump administration said Tuesday it is ending the deployment of 2,000 National Guard troops in Los Angeles. Chief Pentagon spokesman Sean Parnell announced the decision in a statement. Roughly 4,000 National Guard troops and 700 Marines had been deployed. It wasn’t immediately clear how long the rest would stay in the region. The troops were tasked with protecting federal buildings and guarding immigration agents as they carry out arrests. The deployment began in early June and was slated to last 60 days.",
      "publishedAt": "2025-07-15T22:40:16Z",
      "title": "Trump administration ends deployment of 2,000 National Guard troops in Los Angeles",
      "url": "https://apnews.com/article/immigration-raids-los-angeles-national-guard-4424658cc059df31317a83cb53c2b59e",
      "urlToImage": "https://dims.apnews.com/dims4/default/440fc66/2147483647/strip/true/crop/6500x3656+0+338/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Ff9%2F679228eda5856799d0c62e08a9a7%2F38643c6b38b94137864eb4a0d06d55e7"
    },
    {
      "author": null,
      "description": "The United Kingdom, France and Germany have agreed to restore tough U.N. sanctions on Iran by the end of August if there has been no concrete progress on a nuclear deal. That's according to two European diplomats. The three countries’ ambassadors to the United Nations met Tuesday at Germany’s U.N. Mission to discuss a possible Iranian deal and reimposing the sanctions. U.S. officials say the matter also came up in a phone call Monday between U.S. Secretary of State Marco Rubio and the foreign ministers of the three countries. Iran's foreign minister said recently that Tehran would accept a resumption of nuclear talks with the U.S. if there were assurances of no more attacks.",
      "publishedAt": "2025-07-16T02:11:39Z",
      "title": "France, UK and Germany set to restore UN sanctions on Iran without progress on nuclear deal",
      "url": "https://apnews.com/article/iran-un-sanctions-snapback-uk-france-germany-f9458505b67698935625185532fa5a0f",
      "urlToImage": "https://dims.apnews.com/dims4/default/15913a3/2147483647/strip/true/crop/3960x2228+0+206/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F19%2F8715e9da5df8d455ce562afc7a8e%2Fd58702e48bf5414c814c26939082d22f"
    },
    {
      "author": null,
      "description": "Some dolphins in Australia use sponges on their noses to hunt fish, a skill passed down through generations. Research published Tuesday reveals that this technique involves using sponges to protect their noses while stirring up fish from the seafloor. But the sponges interfere with the dolphins' echolocation, making the skill challenging to master. Only about 5% of the studied population, or 30 dolphins, use this method. Scientists say it’s an efficient but rare hunting strategy, learned over years and passed only from mother to calf. The findings highlight the complexity of dolphin behavior and appear in the journal Royal Society Open Science.",
      "publishedAt": "2025-07-15T23:05:52Z",
      "title": "Sponge hunting: How some dolphins protect their noses while foraging",
      "url": "https://apnews.com/article/dolphins-australia-sponge-noses-9ba412c3d0184ee84a66ec8b5a5b5319",
      "urlToImage": "https://dims.apnews.com/dims4/default/f642fcb/2147483647/strip/true/crop/4328x2435+0+226/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F76%2F442f05d3d307c29e420e34866f60%2Fa7d5f0d62ded4875be5ef88341db1636"
    },
    {
      "author": null,
      "description": "Kyle Schwarber went 3 for 3 in the first All-Star Game home run swing-off to put the National League ahead 4-3 following a 6-6 tie in which the American League rallied from a six-run deficit. In baseball’s equivalent of soccer’s penalty-kicks shootout, the game was decided by having three batters from each league take three swings each off coaches. The change was agreed to in 2022 to alleviate the concern of teams running out of pitchers. Schwarber was named All-Star MVP after going 0 for 2 with a walk in the game.",
      "publishedAt": "2025-07-16T03:58:43Z",
      "title": "Kyle Schwarber's 3 homers in All-Star Game's first tiebreaking swing-off lift NL over AL",
      "url": "https://apnews.com/article/allstar-game-swingoff-derby-score-32e4300951f82ff775f496afe88d609d",
      "urlToImage": "https://dims.apnews.com/dims4/default/13fa366/2147483647/strip/true/crop/5284x2972+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2Fd1%2F7dbe7d2d34fc3dabf3a13d2ef619%2F77112b97a48a4e838680a61819f3fade"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}