{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike on a mosque in the Gaza Strip early Sunday killed at least 19 people, Palestinian officials said, as Israel intensified its bombardment of northern Gaza and southern Lebanon in a widening war with Iran-allied militant groups across the region.",
      "publishedAt": "2024-10-06T04:39:16Z",
      "title": "A strike on a mosque kills 19 as Israel bombards northern Gaza and southern Lebanon",
      "url": "https://apnews.com/0210e9d539a899e21ee89b52807b6af7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19142d2b45de49e492cc41f6f56d180f/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Ne’man Abu Jarad sat on a tarp on the ground. Around him, canvas sheets hung from cords, forming the walls of his tent. For the past year, Ne’man; his wife, Majida; and their six daughters have trekked the length of the Gaza Strip, trying to survive as Israeli forces wreaked destruction around them.",
      "publishedAt": "2024-10-06T04:00:59Z",
      "title": "A displaced family's year of fleeing across the devastated Gaza Strip",
      "url": "https://apnews.com/161d9ad8d07e12b22bfd41c79d174c70",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d4591cf08d24e899bfc93a0c04a2546/3000.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "FRANKFORT, Ky. (AP) — The death toll from Hurricane Helene inched up to 227 on Saturday as the grim task of recovering bodies continued more than a week after the monster storm ravaged the Southeast and killed people in six states.",
      "publishedAt": "2024-10-05T23:27:31Z",
      "title": "Death toll from Hurricane Helene rises to 227 as grim task of recovering bodies continues",
      "url": "https://apnews.com/34d1226bb31f79dfb2ff6827e40587fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a19953ca7d234cf599ee63692f32223b/3000.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM",
      "description": "ERWIN, Tenn. (AP) — With shaking hands, Daniel Delgado kissed a photo of his wife, Monica Hernandez, before lighting a candle in a supermarket parking lot. Family members hugged pictures printed on poster board, some collapsing into them in tears as search helicopters flew overhead in the direction of the hills.",
      "publishedAt": "2024-10-06T04:44:36Z",
      "title": "Mexican immigrant families plagued by grief, questions after plant workers swept away by Helene",
      "url": "https://apnews.com/ac2e20a0293f660b3db9e38af16821f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64a5b1cc30ad4813871eb7b142949d82/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russian forces attacked Ukraine overnight with 87 Shahed drones and four different types of missiles, officials said Sunday.A 49-year-old man was killed in the Kharkiv region after his car was hit by a drone, said regional Gov.",
      "publishedAt": "2024-10-06T09:40:22Z",
      "title": "Russia strikes Ukraine with drones and missiles",
      "url": "https://apnews.com/fe11f1e598e66f456361a785237b9de0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/389649fa34164533a81f091a2fe424c7/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis named 21 new cardinals Sunday, significantly increasing the size of the College of Cardinals and further cementing his mark on the group of prelates who will one day elect his successor.",
      "publishedAt": "2024-10-06T10:55:41Z",
      "title": "Pope names 21 new cardinals, significantly increasing the pool who will one day elect his successor",
      "url": "https://apnews.com/e660bbfbc60d0cc2a298db6f444b99bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dcd941d44464742bf788f6e37716251/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH, JILL COLVIN and ADRIANA GOMEZ LICON",
      "description": "BUTLER, Pa. (AP) — Donald Trump returned on Saturday to the Pennsylvania fairgrounds where he was nearly assassinated in July, urging a large crowd to deliver an Election Day victory that he tied to his survival of the shooting.",
      "publishedAt": "2024-10-05T04:15:07Z",
      "title": "Trump urges his supporters to deliver victory in his return to scene of first assassination attempt",
      "url": "https://apnews.com/24a8718393eb6fdab01336ca4438a0e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc6becf4d0c54d1e831850d90a8aa361/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and BILL BARROW",
      "description": "WASHINGTON (AP) — On the last day of August, President Joe Biden was asked about his fall campaign plans. He promised a Labor Day appearance in Pittsburgh and said he would be “on the road from there on.”",
      "publishedAt": "2024-10-05T14:48:20Z",
      "title": "Biden pledged to campaign hard for Harris. So far, he's been mostly a no-show",
      "url": "https://apnews.com/79496a704736e8965010eea3bb6b6b5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18b7e9c899694581bb4cf77c1d58f03d/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — As a junior at George Washington University, Ty Lindia meets new students every day. But with the shadow of the Israel-Hamas war hanging over the Washington, D.C., campus, where everyone has a political opinion, each new encounter is fraught.",
      "publishedAt": "2024-10-06T04:31:51Z",
      "title": "A year into the Israel-Hamas war, students say a chill on free speech has reached college classrooms",
      "url": "https://apnews.com/46faa669edb6b8bf1da6f670f6186bbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1081509e34e4451fae1f322416a26988/3000.jpeg"
    },
    {
      "author": "JESSE BEDYAN and ARUSHI GUPTA",
      "description": "LOS ANGELES (AP) — For more than two decades, the low rent on Marina Maalouf’s apartment in a blocky affordable housing development in Los Angeles’ Chinatown was a saving grace for her family, including a granddaughter who has autism.",
      "publishedAt": "2024-10-06T05:23:55Z",
      "title": "As affordable housing disappears, states scramble to shore up the losses",
      "url": "https://apnews.com/8f68bcf189c17f910459142ee8a50289",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95c0b40539d3451da8efef8f05b50d1a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}