{
  "articles": [
    {
      "author": "TOM KRISHER, MIKE HOUSEHOLDER and JOHN SEEWER",
      "description": "DETROIT (AP) — Nearly one in 10 of America’s unionized auto workers went on strike Friday to pressure Detroit’s three automakers into raising wages in an era of big profits and as the industry begins a costly transition from gas guzzlers to electric vehicles.",
      "publishedAt": "2023-09-15T04:05:36Z",
      "title": "Workers strike at all 3 Detroit automakers, a new tactic to squeeze companies for better pay",
      "url": "https://apnews.com/7ce3ca9d94b911250d07556b7af376c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3422fc08c9b46d5bcdaca75a279e71a/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Pentagon's Central Command has ordered interviews of roughly two dozen more service members who were at the Kabul airport when suicide bombers attacked during U.S. forces' chaotic Afghanistan withdrawal, as criticism persists that the deadly assault could have been stopped.",
      "publishedAt": "2023-09-15T18:02:07Z",
      "title": "US military orders new interviews on the deadly 2021 Afghan airport attack as criticism persists",
      "url": "https://apnews.com/fb5725ccf8ba641f79dc7976e7b9db79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d821e77f791a44b5948b95d39a82f06b/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, ROBERT F. BUTAKY and PATRICK WHITTLE",
      "description": "BAR HARBOR, Maine (AP) — Fishermen removed lobster traps from the water and residents hauled hundreds of boats ashore — leaving some harbors looking like ghost towns — while utility workers from as far away as Tennessee began taking up positions Friday ahead of Hurricane Lee’s heavy winds, high seas and rain that's expected to span hundreds of miles (kilometers) of land and sea.",
      "publishedAt": "2023-09-15T04:04:56Z",
      "title": "Hurricane Lee targets New England and eastern Canada with wind, roiling seas and rain",
      "url": "https://apnews.com/870a13cf6f43a09086b1219cbabd3257",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/880f6cf6cbc94d409e9876e30754a17c/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER SHERMAN",
      "description": "MEXICO CITY (AP) — Mexico extradited Ovidio Guzmán López, a son of former Sinaloa cartel leader Joaquin “El Chapo” Guzmán, to the United States on Friday to face drug trafficking, money laundering and other charges, U.S.",
      "publishedAt": "2023-09-16T00:44:35Z",
      "title": "US: Mexico extradites Ovidio Guzmán López, son of Sinaloa cartel leader 'El Chapo,' to United States",
      "url": "https://apnews.com/9239796fda8db9cfa09fd65b139032cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5de1afb30e441da936aa0567d127c74/1941.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Federal prosecutors are seeking an order that would prevent Donald Trump from making “inflammatory” and “intimidating” comments about witnesses, lawyers and other people involved in the criminal case charging the former president with scheming to overturn the 2020 presidential election.",
      "publishedAt": "2023-09-15T20:00:43Z",
      "title": "Prosecutors seek narrow gag order on Trump in federal election case after ‘inflammatory’ comments",
      "url": "https://apnews.com/67ca118260af4761f41bcffd18d09855",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a536626fcfca4336addaf74f217ebfd0/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER and REBECCA BOONE",
      "description": "WAILUKU, Hawaii (AP) — Authorities in Hawaii have adjusted the number of deaths from the deadly Maui wildfire down to at least 97 people.",
      "publishedAt": "2023-09-15T23:27:46Z",
      "title": "Hawaii officials say DNA tests drop Maui fire death count to 97",
      "url": "https://apnews.com/3dc505d4d83b6af5ee01fdaf173c4f01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cca7db807c34fc4a451dec35c2c66ec/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — New Mexico Gov. Michelle Lujan Grisham on Friday narrowed an order that broadly suspended the right to carry firearms in and around Albuquerque to apply only to public parks and playgrounds where children and their families gather.",
      "publishedAt": "2023-09-15T18:46:36Z",
      "title": "New Mexico governor amends order suspending right to carry firearms to focus on parks, playgrounds",
      "url": "https://apnews.com/cfc792724df5c6e653eefbce318c8d31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10250869097648b1969425058d4eb873/3000.jpeg"
    },
    {
      "author": "JOHN HANNA and HEATHER HOLLINGSWORTH",
      "description": "TOPEKA, Kan. (AP) — Kansas will no longer change transgender people's birth certificates to reflect their gender identities, the state health department said Friday, citing a new law that prevents the state from legally recognizing those identities.",
      "publishedAt": "2023-09-15T20:49:00Z",
      "title": "Kansas will no longer change trans people's birth certificates to reflect their gender identities",
      "url": "https://apnews.com/8424f36613c05d03b7d4eb8f82229ee6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b88141ef86864bfead956507f44f76cd/3000.jpeg"
    },
    {
      "author": "MANUEL VALDES and ANDREW SELSKY",
      "description": "SEATTLE (AP) — Outrage grew Friday over a Seattle police officer's remark that the life of a young woman killed by a speeding patrol car had “limited value.\" Diplomats from India are asking for an investigation following the death of the Indian graduate student as people in Seattle protested the officer's callous jokes caught on bodycam video.",
      "publishedAt": "2023-09-15T20:33:30Z",
      "title": "Outrage boils in Seattle and in India over death of a student and an officer's callous remarks",
      "url": "https://apnews.com/0a63cef699ccfb923bf64311d53a8731",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e04cdc9743f4997abda925122aa29fc/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un on Saturday arrived in Russia's far eastern port of Vladivostok, where he was shown nuclear-capable bombers as he continued a trip that has sparked Western concerns about an arms alliance that could fuel Russian President Vladimir Putin’s war on Ukraine.",
      "publishedAt": "2023-09-16T00:26:01Z",
      "title": "Kim Jong Un arrives in Russian port city where he is shown Russian nuclear-capable bombers",
      "url": "https://apnews.com/0255d844b06e11c39920cc2acdb53406",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0d051947c5043399cb3a4941ef1e334/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}