{
  "articles": [
    {
      "author": "LISA MASCARO, AAMER MADHANI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy told America his country was fighting for “our freedom and yours” as he made an impassioned plea Tuesday for Congress to approve more assistance to fight Russia’s invasion.",
      "publishedAt": "2023-12-12T05:27:18Z",
      "title": "Zelenskyy pleads for Ukraine aid at Capitol and White House, says to US: Our fight is yours",
      "url": "https://apnews.com/5796a2429169d01959510f318fbc968a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f8fb2b71d6c463fa2063b2ceb63e50d/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel and the United States on Tuesday showed their sharpest public disagreement yet over the conduct and future of the war against Hamas as the two allies became increasingly isolated by global calls for a cease-fire.",
      "publishedAt": "2023-12-12T08:16:19Z",
      "title": "Israel and US show sharp divisions over mounting casualties and future of war against Hamas",
      "url": "https://apnews.com/b52ae70a89443728517f1d3d7508992c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a3a1e7885384237aa1e980523325cec/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The birth of their daughter should have marked the beginning of a joyful chapter for the young Palestinian couple. Instead, the devastating war in Gaza, now in its third month, has turned childbirth and parenthood into a time of worry and fear for Salim and Israa al-Jamala.",
      "publishedAt": "2023-12-12T19:01:40Z",
      "title": "Packed hospitals, treacherous roads, harried parents: Newborns in Gaza face steeper odds of survival",
      "url": "https://apnews.com/4dd63356a472d1b6ef41b7269c19a75f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acfbd065f8544ab0aaf38cc099004839/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER and JAMIE STENGLE",
      "description": "AUSTIN, Texas (AP) — Kate Cox, whose fetus had a fatal condition, did not qualify for an abortion in Texas: not after four emergency room visits, elevated vital signs, risks of a uterine rupture and with her ability to have more children in jeopardy.",
      "publishedAt": "2023-12-12T22:06:10Z",
      "title": "Kate Cox sought an abortion in Texas. A court said no because she didn't show her life was in danger",
      "url": "https://apnews.com/e85664b2ab76bcb689b1b91913d3e33e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fcb872d820b4b9bb6040abc68d937b1/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN, JON GAMBRELL, JAMEY KEATEN and SIBI ARASU",
      "description": "DUBAI, United Arab Emirates (AP) — A somewhat stronger and revamped proposal that calls for an eventual end to fossil fuel use was presented early Wednesday to negotiators at the United Nations climate summit known as COP28, after the conference presidency's initial document angered many countries by avoiding decisive calls for action on curbing warming.",
      "publishedAt": "2023-12-13T03:19:26Z",
      "title": "New, stronger climate proposal released at COP28, but doesn't quite call for fossil fuel phase-out",
      "url": "https://apnews.com/64c0e39e6ad54a98e05e5201a2215293",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e48d33bcf9cf490c91bf75ce5cee91b6/3000.jpeg"
    },
    {
      "author": "STEVE LeBLANC and KATHY McCORMACK",
      "description": "CAMBRIDGE, Mass. (AP) — Harvard President Claudine Gay will remain leader of the prestigious Ivy League school following her comments last week at a congressional hearing on antisemitism, the university's highest governing body announced Tuesday.",
      "publishedAt": "2023-12-12T12:48:59Z",
      "title": "Harvard board keeps president as leader of Ivy League school following antisemitism backlash",
      "url": "https://apnews.com/48277807b0e4e492ac47f7ed9dbea147",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2d1899ad37948ce878def4232d7ca87/2821.jpeg"
    },
    {
      "author": "STEVE PEOPLES and THOMAS BEAUMONT",
      "description": "CEDAR RAPIDS, Iowa (AP) — Ron DeSantis has visited each of Iowa's 99 counties. He has the endorsement of the governor and boasts the largest get-out-the-vote operation in the state.",
      "publishedAt": "2023-12-12T20:30:29Z",
      "title": "DeSantis’ campaign and allied super PAC face new concerns about legal conflicts, AP sources say",
      "url": "https://apnews.com/fa2238e79fa48e18962accfc071278a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebfd5cd2cded49f3aff29d1ebfe54b4d/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Scared for her life after Rudy Giuliani and other Donald Trump allies falsely accused her of fraud, former Georgia election worker Wandrea “Shaye” Moss told jurors Tuesday she seldom leaves her home, suffers from panic attacks and battles nightmares brought on by a barrage of threatening and racist messages.",
      "publishedAt": "2023-12-12T15:13:01Z",
      "title": "Georgia election worker suing Rudy Giuliani tells jurors that his lies made her fear for her life",
      "url": "https://apnews.com/0151222465923e9dcad489adb7661f0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af6e628b1bd1427b88229ffd339ff5bd/3000.jpeg"
    },
    {
      "author": "DÉBORA REY",
      "description": "BUENOS AIRES, Argentina (AP) — Argentina on Tuesday announced a sharp devaluation of its currency and cuts to energy and transportation subsidies as part of shock measures new President Javier Milei says are needed to deal with an economic emergency.",
      "publishedAt": "2023-12-12T23:16:16Z",
      "title": "Argentina sharply devalues its currency and cuts subsidies as part of shock economic measures",
      "url": "https://apnews.com/28089d64ae72bde12d53be59b5bc5a85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1985823a2bd641448cfb4fc50dcdeccd/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Andre Braugher, the Emmy-winning actor who would master gritty drama for seven seasons on \"Homicide: Life on The Street” and modern comedy for eight on “Brooklyn 99,” died Monday at 61.",
      "publishedAt": "2023-12-13T02:09:59Z",
      "title": "Andre Braugher, Emmy-winning actor who starred in 'Homicide' and 'Brooklyn Nine-Nine,' dies at 61",
      "url": "https://apnews.com/f2ee7dd990dbd40c8fd5258ac624bab7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2fe3f2198bf428fa27b5bd2f5834c77/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}