{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, JULIA FRANKEL",
      "description": "Stunned Palestinians rejected President Donald Trump's proposal to expel them from the Gaza Strip so that the U.S. could take over the territory and rebuild it for others. Many saw the comments as an effort to erase them from their homeland, a continuation of the “Nakba,” or “Catastrophe,\" their name for the expulsion and displacement of hundreds of thousands of Palestinians from what is now Israel during the 1948 war. Palestinians displaced during the Israel-Hamas war have shown a powerful determination to return to their homes, with hundreds of thousands during the current ceasefire flooding back to neighborhoods devastated by Israeli bombardment and offensives.",
      "publishedAt": "2025-02-05T17:42:24Z",
      "title": "'I won't leave. Put that in your brain.' Palestinians reject Trump's call to expel them from Gaza",
      "url": "https://apnews.com/article/gaza-trump-nakba-israel-netanyahu-f8d1a4f840d4c440cfddb03987fa53cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/4840ad5/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F4f%2F33b8ff158ef327b4e25da2a54925%2F561a3006781c4b72877d5363a0a05e63"
    },
    {
      "author": "MATTHEW LEE",
      "description": "Secretary of State Marco Rubio is defending the dismantling of the U.S. Agency for International Development and praising President Donald Trump’s widely panned proposal for the United States to take control of the Gaza Strip. Rubio spoke Wednesday at a news conference in Guatemala City. He said the administration was essentially forced to shut down USAID because of “insubordination” within its ranks by staffers who refused to comply with demands to justify its budget and its programs. Rubio said Trump’s suggestion that the U.S. take over Gaza was in fact a “very generous” offer to reconstruct and develop the war-ravaged Palestinian territory.",
      "publishedAt": "2025-02-05T18:07:08Z",
      "title": "Rubio defends dismantling of USAID, praises Trump's proposal for US control of Gaza Strip",
      "url": "https://apnews.com/article/rubio-immigration-guatemala-trump-border-deportation-f928f64eec96b46a880069cbd5580d34",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb4e3dc/2147483647/strip/true/crop/5430x3054+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F7c%2F8d3c8958a89e92cc81ce3095d6ce%2F7c025b74ee8d4b179bd323de6e7b934b"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "President Donald Trump has announced that the United States will withdraw from the U.N.’s top human rights body and will not resume funding for the U.N. agency helping Palestinian refugees. The U.S. left the Geneva-based Human Rights Council last year. And it stopped funding the agency assisting Palestinian refugees, known as UNRWA, after Israel accused it of harboring Hamas militants who participated in the attacks in southern Israel on Oct. 7, 2023, which UNRWA denies. Trump’s announcement Tuesday came on the day he met with visiting Israeli Prime Minister Benjamin Netanyahu, whose country has long accused both the rights body and UNRWA of bias against Israel and antisemitism.",
      "publishedAt": "2025-02-05T00:34:28Z",
      "title": "Trump announces withdrawal from UN human rights body and halt to funding for Palestinian refugees",
      "url": "https://apnews.com/article/trump-un-human-rights-palestinian-refugees-israel-05e1d57bbb41df38771d1ab69adb21a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/16413f1/2147483647/strip/true/crop/4883x2747+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F95%2F62506e1570751c41acdc794a7461%2Fd11d670e495d4205b980380e6607343a"
    },
    {
      "author": "MICHAEL HILL",
      "description": "Lawyers say the death of a handcuffed man who was pummeled by New York prison guards was ruled a homicide in an autopsy report. Attorneys for Robert Brooks' family said Wednesday that the report issued by the county medical examiner’s office last week concludes that the cause of his death in December was compression of the neck and multiple blunt impact injuries. The manner of death was determined to be homicide. Onondaga County District Attorney William Fitzpatrick was appointed a special prosecutor to investigate Brooks’ death. A grand jury is expected to hear evidence in the case.",
      "publishedAt": "2025-02-05T16:25:11Z",
      "title": "Death of New York man beaten by prison guards ruled a homicide in autopsy report, lawyers say",
      "url": "https://apnews.com/article/new-york-prison-death-brooks-autopsy-bd9a38fd8940f2b3e210767dec5e11f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4ebccf/2147483647/strip/true/crop/3000x1688+0+7/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2Fed%2F5f00d054dd9ceb702f66951bc9c1%2Fffd8ebde1d26407993b5f947907ff776"
    },
    {
      "author": "WILL GRAVES",
      "description": "President Donald Trump has signed an executive order designed to prevent transgender athletes from participating in girls' or women’s sports. The order gives federal agencies wide latitude to ensure entities that receive federal funding abide by Title IX in alignment with the Trump administration’s view, which interprets “sex” as the gender someone was assigned at birth. It is the latest aggressive shift by the Republican president’s second administration in how the government deals with transgender people and their rights. Trump has already ordered the government to define sex as only male or female.",
      "publishedAt": "2025-02-05T05:07:21Z",
      "title": "Trump signs executive order intended to bar transgender athletes from girls' and women's sports",
      "url": "https://apnews.com/article/donald-trump-transgender-athletes-3606411fc12efffec95a893351624e1b",
      "urlToImage": "https://dims.apnews.com/dims4/default/325219c/2147483647/strip/true/crop/5689x3200+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2F6d%2Fca3bfe5b8d80770d5e02d1111c14%2Fc189e7da352d48ed9f90554ac4b7ec1f"
    },
    {
      "author": "SALLY HO, TRÂN NGUYỄN",
      "description": "Next-door neighbors lost their near-identical homes in a California wildfire, but how they are navigating rebuilding is a story of contrasting fortunes and unequal recovery, a stark reflection of the nation’s growing home insurance crisis. Louise Hamlin’s house in Altadena was privately insured, while Chris Wilson was forced onto the state’s bare-bones insurance program that critics dub “The Unfair Plan.” Hamlin’s insurance has already paid out nearly a million dollars and she is searching for contractors to rebuild. Wilson meanwhile faces the prospect of loans, lawsuits and may have to leave California. They’re among thousands of people who lost everything in the Eaton and Palisades fires, which were among the most destructive in California history.",
      "publishedAt": "2025-02-05T05:30:05Z",
      "title": "'Unfair Plan' California wildfires reveals unequal insurance crisis for neighbors who pay more",
      "url": "https://apnews.com/article/california-wildfires-home-insurance-fair-plan-b545beb6c8d287eba852f9c1b1d1e504",
      "urlToImage": "https://dims.apnews.com/dims4/default/4836271/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2Fbd%2Fadc86be1f4aacef056cab6fcb479%2F5e70bc86215444eab0589f59324610a6"
    },
    {
      "author": "AAMER MADHANI, ZEKE MILLER",
      "description": "President Donald Trump promised voters an administration that wouldn’t waste precious American lives and taxpayer treasure on far-off wars and nation building. But just weeks into his second go-around in the White House, the Republican leader laid out plans to use American might to “take over” and reconstruct Gaza, threatened to reclaim U.S. control of the Panama Canal and floated the idea that the U.S. could buy Greenland from Denmark, which has shown no interest in parting with the island. The rhetorical shift from America First to America Everywhere is leaving even some of his allies slack-jawed — and wondering if he’s really serious.",
      "publishedAt": "2025-02-05T22:12:36Z",
      "title": "With Gaza rehab and other global policy ideas, Trump goes from America First to America Everywhere",
      "url": "https://apnews.com/article/trump-gaza-mideast-foreign-policy-1b792bd4d12cb3895b5a26b98ad63f2b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee3c5e5/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2Ffc%2F83a7cdad650195775d8310878b69%2Ff6f5b5d087934df8a8a79056c02aebbe"
    },
    {
      "author": "DAVID RISING, JON GAMBRELL",
      "description": "President Donald Trump’s proposal that the United States “take over” the Gaza Strip and permanently resettle its Palestinian residents has been swiftly rejected and denounced by American allies and adversaries alike. Saudi Arabia weighed in quickly, noting the kingdom's long call for an independent Palestinian state was a “firm, steadfast and unwavering position.” Similarly, Australian Prime Minister Anthony Albanese told reporters that his country has long supported a two-state solution in the Middle East and that nothing has changed. the militant Hamas group, which sparked the war with its attack on Israel, called the proposal a “recipe for creating chaos\" in the region.",
      "publishedAt": "2025-02-05T05:55:42Z",
      "title": "Allies, adversaries reject Trump's suggestion for US 'take over' of Gaza Strip",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-trump-netanyahu-db2c407baf803291a4acf6edfd708c48",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba11785/2147483647/strip/true/crop/8528x4797+0+445/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2F97%2F3e0c005850b164e9f9cb7d0c303b%2F9f2bee9f910548aa9e1c16c1aee1dac9"
    },
    {
      "author": "ELLEN KNICKMEYER, MATTHEW LEE, FARNOUSH AMIRI",
      "description": "U.S. aid staffers worldwide are scrambling for answers and starting to pack up households or pull their children from school. That turmoil follows a sudden Trump administration order yanking almost all of them off the job and out of the field. In Washington, Democratic lawmakers and other supporters of the U.S. Agency for International Development plan rallies Wednesday to protest the dismantling of the independent aid agency that was established six decades ago. USAID has been one of the agencies hardest hit as the Trump administration and Elon Musk’s budget-slashing team target federal programs it says are wasteful or not aligned with a conservative agenda.",
      "publishedAt": "2025-02-05T16:17:17Z",
      "title": "Trump’s demand that US aid workers return home sparks outrage in Washington and anxiety overseas",
      "url": "https://apnews.com/article/usaid-trump-musk-leave-notice-rubio-943b4306b96f726703842e5d55c05aea",
      "urlToImage": "https://dims.apnews.com/dims4/default/75a7e4b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2F06%2F50d0ce2890d770e8b85e9bdc4574%2F786b30dbc5b847ecadb76eeabd1c5461"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "Democrats on the Senate Intelligence Committee are demanding answers after they say President Donald Trump gave Elon Musk's staff access to sensitive and classified government information. The lawmakers wrote to the White House on Wednesday asking what security precautions had been taken to prevent unauthorized leaks of information by the staff at the Department of Government Efficiency, an agency led by Musk that has been granted access to sensitive information contained in the systems of dozens of agencies. The Democratic senators say the material includes personal medical or financial information about millions of Americans, as well as classified secrets and foreign intelligence.",
      "publishedAt": "2025-02-05T21:30:18Z",
      "title": "Democratic senators protest after Musk's staff accesses classified info",
      "url": "https://apnews.com/article/elon-musk-trump-doge-intelligence-cia-4a4e99c7925b02e014e6e65d2ef9a055",
      "urlToImage": "https://dims.apnews.com/dims4/default/474770e/2147483647/strip/true/crop/4109x2311+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2Ffd%2F6305a3b3c143b5a95a33fad82a1f%2F044159fd845e47db818b465a7bf862a6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}