{
  "articles": [
    {
      "author": null,
      "description": "Disastrous flash floods from a raging central Texas river have killed at least 51 people, a total that may increase. Officials say the death toll is 43 in the hardest-hit area of Kerr County. Authorities say 15 of the victims are children and 27 girls attending a summer camp are still missing. Gov. Greg Abbott promised that crews would work around the clock to rescue and recover victims as rescuers maneuver through broken trees, overturned cars and muck-filled debris. Abbott also issued a proclamation declaring Sunday as a day of prayer across the state. Pope Leo XIV, history's first American pontiff, offered special prayers for those touched by the disaster.",
      "publishedAt": "2025-07-06T13:57:41Z",
      "title": "Search for 27 missing girls plows forward after flash flood kills at least 51 people in Texas",
      "url": "https://apnews.com/article/flash-flood-texas-missing-girls-hill-country-0ea97b27df4cb30339a0a938539c7125",
      "urlToImage": "https://dims.apnews.com/dims4/default/2acdc93/2147483647/strip/true/crop/5610x3156+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F5a%2F01b134acb83445a00a5d7ba89aae%2Fd99b1f43ca4b43b68f30b1403a9e5559"
    },
    {
      "author": null,
      "description": "Flash floods in Texas have killed nearly 70 people, many of them children. An unknown number of people are missing. Heavy rains fell quickly in the predawn hours Friday in the Texas Hill Country, causing the Guadalupe River to rise 26 feet in just 45 minutes. Among the missing are 27 girls from Camp Mystic, a Christian summer camp. Officials are resisting estimating the total number of missing. The July Fourth holiday weekend likely brought an influx of visitors to the area outside San Antonio, making it difficult to track all the people who may have been in the area.",
      "publishedAt": "2025-07-06T16:25:30Z",
      "title": "What to know about the Texas flash floods and the rising death toll",
      "url": "https://apnews.com/article/flash-flood-texas-camp-mystic-aec9181a07d3ce8ff85197922e108b13",
      "urlToImage": "https://dims.apnews.com/dims4/default/154f53b/2147483647/strip/true/crop/3600x2025+0+80/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F78%2Fd1cad5f70533b8ed2593e866e61c%2F71337bc08bf34e5ebd8267d8fc6fb9a3"
    },
    {
      "author": null,
      "description": "Hospital officials say Israeli airstrikes have killed 14 Palestinians in Gaza and another 10 were killed as they sought food aid. U.S.-led ceasefire efforts appear to be gaining momentum after nearly 21 months of war as Israel's prime minister visits the White House on Monday. Weary Palestinians expressed cautious hope Saturday after Hamas gave a “positive” response to the latest U.S. proposal for a 60-day truce. But the militant group said further talks are needed on implementation. Two American aid workers with the Israel-backed Gaza Humanitarian Foundation were injured in southern Gaza in an attack at a food distribution site.",
      "publishedAt": "2025-07-05T13:02:05Z",
      "title": "Israeli airstrikes kill 14 Palestinians in Gaza and another 10 die seeking food",
      "url": "https://apnews.com/article/israel-gaza-hamas-palestinians-war-news-07-05-2025-72448fcc49b5bb026a32163740eaa97c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6ccf82/2147483647/strip/true/crop/8519x4792+0+444/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2Ff6%2F18f205cf66d2f23f509d23cb6b80%2Faa30a4a0872049b1ba4b07ce46b61147"
    },
    {
      "author": null,
      "description": "America’s largest trade partner is awaiting word on whether U.S. President Donald Trump will impose punishing tariffs on its goods. Trump imposed a 20% import tax on all European Union products as part of a set of tariffs targeting countries with which the United States has a trade imbalance. He then threatened to increase the rate to 50%. A deadline for trade negotiations ends on Wednesday. Economists have warned that the U.S. and the EU failing to reach a deal would have repercussions for companies and consumers on both sides of the Atlantic. Everything from French cheese and Italian leather goods to German electronics and Spanish pharmaceuticals would become much more expensive in the U.S.",
      "publishedAt": "2025-07-06T10:01:51Z",
      "title": "The European Union and fans of its products wait to hear how high Trump will set tariffs",
      "url": "https://apnews.com/article/trump-tariffs-european-union-49893d3983cd60384ca2e8557ca2c7b1",
      "urlToImage": "https://dims.apnews.com/dims4/default/a53e51e/2147483647/strip/true/crop/8404x4727+0+438/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F27%2Fcbdf309f4b82921de1f5497979cf%2F51db54589d784555b44a1bd3a58d1d9b"
    },
    {
      "author": null,
      "description": "Russia launched 550 drones and missiles across Ukraine overnight in the largest aerial assaults since the war began. The capital Kyiv was the primary target. At least 23 people were injured, and multiple residential buildings in the capital were damaged. Ukrainian air defenses shot down 270 targets and another 208 targets were lost from radar and presumed jammed, but dozens still struck or caused damage across the city. Fires and destruction were reported in at least five of Kyiv's 10 districts, and railway infrastructure was also hit. The attack came hours after President Donald Trump held a call with Russian President Vladimir Putin and made his first public comments on the U.S. decision to pause some shipments of weapons to Ukraine.",
      "publishedAt": "2025-07-04T06:33:48Z",
      "title": "Russia hits Ukraine with its largest aerial attack of the war",
      "url": "https://apnews.com/article/ukraine-russia-war-attack-missile-drone-58bc08ddcf1038fb409999c56b11e9fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a5c55e/2147483647/strip/true/crop/8056x4532+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F6e%2Fbf17c5f6f4da18799ea393da9514%2Fae1cabfc6cd8457fb86f8e98f8737c84"
    },
    {
      "author": null,
      "description": "Tropical Storm Chantal has formed off the southeastern U.S. coast. The National Hurricane Center in Miami says tropical storm warnings have been issued for portions of the Carolinas. Tropical storm conditions are expected in the affected areas later Saturday. The NHC said the storm’s center was expected to move across the coast of South Carolina late Saturday or early Sunday. Some additional strengthening is expected before Chantal reaches the coast. Heavy rain will likely fall across portions of the coastal plain of the Carolinas through Monday. Storm total rainfall of 2 to 4 inches, with local amounts up to 6 inches, is expected. The rain could cause flash flooding.",
      "publishedAt": "2025-07-05T13:15:48Z",
      "title": "Tropical Storm Chantal forecast to bring heavy rain to the Carolinas",
      "url": "https://apnews.com/article/tropical-storm-chantal-north-south-carolina-9d567a1221bbc04e5f1b98c8104f3495",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Eight men deported from the United States in May and held under guard for weeks at an American military base in the African nation of Djibouti while their legal challenge played out in court have now reached the Trump administration’s intended destination, war-torn South Sudan. It's a country that the State Department advises against travel to due to “crime, kidnapping, and armed conflict.” The immigrants from Cuba, Laos, Mexico, Myanmar, Vietnam and South Sudan arrived in South Sudan on Friday after a federal judge cleared the way for the Trump administration to relocate them. Their challenge had earlier gone to the Supreme Court, which permitted their removal.",
      "publishedAt": "2025-07-05T18:55:41Z",
      "title": "8 men deported to South Sudan after weeks of legal wrangling in US courts",
      "url": "https://apnews.com/article/trump-south-sudan-djibouti-deport-supreme-court-50f9162cff680b5c8729873e11d514e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/72dc9e4/2147483647/strip/true/crop/5240x2948+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F5a%2F82848840fd6b9a65cd79676b951c%2F2fb8e1305c1749e99edbbf56329a2cd4"
    },
    {
      "author": null,
      "description": "Donald Trump has made tax cuts a central part of his political legacy. There were his first-term cuts. And now the Republican has pushed through an extension of those cuts and added new tax breaks. But the bill he signed into law Friday also comes with significant cuts to Medicaid and food assistance, contradicting promises to protect such programs. Democrats plan to make that expected fallout a campaign focus, while Republicans argue the bill will boost the economy. Historically, major legislation that's been backed mostly by just one party has rarely translated into political rewards. So the long-term effects of Trump’s tax policy are unclear.",
      "publishedAt": "2025-07-05T12:43:42Z",
      "title": "Trump's big bill may come at a political cost",
      "url": "https://apnews.com/article/trump-tax-cuts-health-care-medicaid-elections-ec859e18ddc3619f529dcdfd6e087dd8",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a25bbd/2147483647/strip/true/crop/2825x1589+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F5b%2F9fd719f84999ac37bb7aa2147d5d%2Fd5286240b8d34b61b8ad903358af6876"
    },
    {
      "author": null,
      "description": "The lawyer whose defense team won acquittal for Sean “Diddy” Combs on life-sentence-eligible charges says the music mogul was greeted by a standing ovation from fellow prisoners when he returned to jail after the verdict. Attorney Marc Agnifilo says he told Combs before his September arrest that he could beat sex trafficking and conspiracy charges and set an example for other Black men unjustly charged. Agnifilo says he thinks Combs “took that to heart.” The 55-year-old Combs could still face several more years in prison for his conviction on prostitution-related charges. Sentencing, set for Oct. 3, might occur weeks earlier.",
      "publishedAt": "2025-07-06T16:35:19Z",
      "title": "Sean 'Diddy' Combs gets standing ovation from inmates after court victory, his lawyer says",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-defense-91674a2f63ad6ff55d359a78c1a88030",
      "urlToImage": "https://dims.apnews.com/dims4/default/5821822/2147483647/strip/true/crop/4800x2700+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F90%2Fd5a68111dd3c17abcf2e1c17eb68%2F802d0b182e5f40f4949b7c1e9d2d3b9d"
    },
    {
      "author": null,
      "description": "Lando Norris survived an incident-packed race in the rain to win Formula 1’s British Grand Prix on Sunday and cut the gap to his teammate and title rival Oscar Piastri. Norris won his home race for the first time after Piastri had to serve a 10-second penalty for sharp braking behind the safety car while in the lead. Sauber's Nico Hulkenberg was third for his first-ever podium finish in his 239th race of an F1 career that began in 2010.",
      "publishedAt": "2025-07-06T06:58:41Z",
      "title": "Lando Norris wins thrilling British Grand Prix in the rain to cut Oscar Piastri's F1 lead",
      "url": "https://apnews.com/article/f1-british-grand-prix-verstappen-piastri-norris-31758f43eaf5ee92d3a878625c14e5f6",
      "urlToImage": "https://dims.apnews.com/dims4/default/e3ae7fc/2147483647/strip/true/crop/7047x3964+0+367/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F23%2Fee72ef307a9ed694a879e4f7186c%2F84a699d443294f36a66a290c6509cc74"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}