{
  "articles": [
    {
      "author": "KATE BRUMBACK and ALANNA DURKIN RICHER",
      "description": "ATLANTA (AP) — A special prosecutor who had a romantic relationship with Fulton County District Attorney Fani Willis formally withdrew Friday from the Georgia election interference case against Donald Trump after a judge ruled he had to leave or Willis couldn't continue to pursue the charges.",
      "publishedAt": "2024-03-15T13:08:38Z",
      "title": "Prosecutor leaves Georgia election case against Trump after relationship with district attorney",
      "url": "https://apnews.com/60b7dd9642fc9ef7c03d75980692334c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17aba26d178b41dfb48d4ec71090f21f/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Stalled talks aimed at securing a cease-fire in the war between Israel and Hamas are expected to restart in earnest in Qatar as soon as Sunday, according to Egyptian officials.",
      "publishedAt": "2024-03-16T10:21:21Z",
      "title": "Cease-fire talks with Israel and Hamas expected to restart",
      "url": "https://apnews.com/53a0fff49d9196fc38f75ad1b37a64bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb2ec632801e4d6c96ab3a6b796f8e00/1920.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Alexei Navalny’s team is used to working independently. The most potent foe of Russian President Vladimir Putin was frequently absent for long stretches after being arrested, assaulted, poisoned, or imprisoned.",
      "publishedAt": "2024-03-16T05:52:16Z",
      "title": "With Navalny dead, his allies keep fighting to undermine Putin's grip on power",
      "url": "https://apnews.com/40664ca31977c8804fc4149e45093439",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73016690ef7f4744bc4be70eeffa806b/3000.jpeg"
    },
    {
      "author": "LEAH WILLINGHAM",
      "description": "Alex Pearlman shut the door on dreams of a standup comedy career almost a decade ago, pivoting from the stage to an office cubicle where he worked a customer service job. Then he started posting random jokes and commentary about pop culture and politics on TikTok.",
      "publishedAt": "2024-03-16T04:12:31Z",
      "title": "TikTok creators warn of economic impact if app sees ban, call it a vital space for the marginalized",
      "url": "https://apnews.com/4ae88afbc344630b2c1091a4a1784078",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ba3b5ada91048ee915b02e8aaa8efbb/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY",
      "description": "CAPE TOWN, South Africa (AP) — Mice accidentally introduced to a remote island near Antarctica 200 years ago are breeding out of control because of climate change, and they are eating seabirds and causing major harm in a special nature reserve with “unique biodiversity.”",
      "publishedAt": "2024-03-16T05:04:00Z",
      "title": "A warming island's mice are breeding out of control and eating seabirds. An extermination is planned",
      "url": "https://apnews.com/ec4f281f396ca49910c359df5b99b64d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/661b044c70cb42078393def5c75323e0/1920.jpeg"
    },
    {
      "author": "GABE STERN",
      "description": "RENO, Nev. (AP) — Last month, when the wife of a Republican U.S. Senate candidate from Nevada talked candidly about the abortion she had before the two met — and the long journey of regret and healing that followed — many Republicans welcomed it as a more compassionate approach to an issue that has hurt GOP candidates at the ballot box.",
      "publishedAt": "2024-03-16T04:15:17Z",
      "title": "Abortion story from wife of Nevada Senate hopeful reveals complexity of issue for GOP candidates",
      "url": "https://apnews.com/81bf8c872d0219fad5d6d3da9c576e23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/889a56259a1845f898e0a89bfc590461/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden was returning from church a week ago when he stepped out of his armored SUV onto the driveway of his Wilmington, Delaware, home on an important mission: He wanted to inspect the landscaping.",
      "publishedAt": "2024-03-16T04:14:08Z",
      "title": "The Hur interview transcript offers a window into the life of 'frustrated architect' Joe Biden",
      "url": "https://apnews.com/68a70e86ae2c9b7affe1b5352aee5347",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df3794e9b9a4473fbfca2a0f9d3556b6/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian shelling of the Russian city of Belgorod, close to the border with Ukraine, killed two people, Russian officials said Saturday. A man and a woman died in the attack and three other people were wounded, regional Gov.",
      "publishedAt": "2024-03-16T08:21:54Z",
      "title": "Russian officials say Ukrainian shelling kills 2 in a border city and drones target an oil refinery",
      "url": "https://apnews.com/10ad4cf3c67ee0d19f107d7885a61c10",
      "urlToImage": ""
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — If it's March, and it's green, it must be St. Patrick's Day. The day honoring the patron saint of Ireland is a global celebration of Irish heritage. And nowhere is that more so than in the United States, where parades take place in cities around the country and all kinds of foods and drinks are given an emerald hue.",
      "publishedAt": "2024-03-16T04:07:30Z",
      "title": "From 4-leaf clovers to some unexpected history, all you need to know about St. Patrick's Day",
      "url": "https://apnews.com/69cff15d799be00ed1473ec9f3c52a5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/346a196e54384ce1ac247f25a5fcc10b/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM",
      "description": "The 40-hour workweek has been standard in the U.S. for more than eight decades. Now some members of Congress want to give hourly workers an extra day off.Sen. Bernie Sanders, the far-left independent from Vermont, this week introduced a bill that would shorten to 32 hours the amount of time many Americans can work each week before they're owed overtime.",
      "publishedAt": "2024-03-16T04:03:54Z",
      "title": "Bernie Sanders wants the US to adopt a 32-hour workweek. Could workers and companies benefit?",
      "url": "https://apnews.com/076c14dd52c7938bfb41e988a9a6d347",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82101200b5c64ddcb2121d2b9d6f7ff2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}