{
  "articles": [
    {
      "author": "NAJIB JOBAIN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces on Tuesday expanded their ground offensive into urban refugee camps in central Gaza after bombarding the crowded Palestinian communities and ordering residents to evacuate.",
      "publishedAt": "2023-12-26T10:14:15Z",
      "title": "Israeli military says Gaza ground offensive has expanded into urban refugee camps",
      "url": "https://apnews.com/698c895797ccb057d13fe4f68690c98b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/935e561b17da44df8f4f8d820897ae02/1920.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — A top U.S. delegation is to meet with Mexico's president Wednesday in what many see as a bid to get Mexico to do more to stem a surge of migrants reaching the U.S.",
      "publishedAt": "2023-12-27T05:01:05Z",
      "title": "A US delegation to meet with Mexican government for talks on the surge of migrants at border",
      "url": "https://apnews.com/f39247c4848cb7cf1097fcbaa84edcbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/983be113daf54783bea742edc780f070/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN AND ELLIOT SPAGAT",
      "description": "MIAMI (AP) — Pedro Naranjo idolized his father growing up and followed him into the Venezuelan air force to fly helicopters. So deep was their bond that when the older Naranjo feared being jailed for plotting against Nicolás Maduro’s socialist government, father and son fled to the United States together.",
      "publishedAt": "2023-12-27T05:34:27Z",
      "title": "Deported by US, arrested in Venezuela: One family's saga highlights Biden's migration challenge",
      "url": "https://apnews.com/ff26a7ca3143ef9603da9399ba8ecdf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adbecc8a05bd4bc795bf45718e5354ca/2000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — With the GOP primary process just about to start, many Republicans aren't certain that votes will be counted correctly in their presidential primary contest, amid widespread pessimism about the future of both the Democratic and Republican parties, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
      "publishedAt": "2023-12-27T05:17:01Z",
      "title": "Americans sour on the primary election process and major political parties, an AP-NORC poll says",
      "url": "https://apnews.com/f2d3cca7c3b5803a28c06a85d7d8772b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1671e0fcbba34793b56ef20b42028671/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — Lee Sun-kyun, a popular South Korean actor best known for his role in the Oscar-winning movie “Parasite,” was found dead in a car in Seoul on Wednesday, authorities said, after weeks of an intense police investigation into his alleged drug use.",
      "publishedAt": "2023-12-27T03:00:35Z",
      "title": "South Korean actor Lee Sun-kyun of Oscar-winning film 'Parasite' is found dead",
      "url": "https://apnews.com/2faacd7290f5b84b6a996705d8351cdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7367a4d36f8a4d8ba319f2732aa323ea/2624.jpeg"
    },
    {
      "author": "GENE JOHNSON, JENNIFER SINCO KELLEHER, MARK THIESSEN and LINDSEY WASSON",
      "description": "LAHAINA, Hawaii (AP) — Sharlene Rabang and her calico cat fled the wildfire that destroyed her town on Maui and arrived at a family home on another Hawaii island after a 24-hour odyssey that included sleeping in a car.",
      "publishedAt": "2023-12-27T06:06:10Z",
      "title": "She died weeks after fleeing the Maui wildfire. Her family fought to have her listed as a victim.",
      "url": "https://apnews.com/7c846f4d8e6a80e5c629d33347dc50e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d1181c0966344e19ef278a4cb19867a/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "GILBERT, S.C. (AP) — Standing inside a rustic barn a short drive from the state capital, Henry McMaster shocked many South Carolina Republicans seven years ago by backing Donald Trump for president.",
      "publishedAt": "2023-12-27T05:17:39Z",
      "title": "Nikki Haley has bet her 2024 bid on South Carolina. But much of her home state leans toward Trump",
      "url": "https://apnews.com/56c0ceb5b1b93a46df87e9e88342f7f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19b88d2cd24441e5a1002b8be40ccdaa/3000.jpeg"
    },
    {
      "author": "TRAVIS LOLLER",
      "description": "NASHVILLE, Tenn. (AP) — On Dec. 28, 1973, President Richard Nixon signed the Endangered Species Act.",
      "publishedAt": "2023-12-27T05:10:34Z",
      "title": "As the Endangered Species Act turns 50, those who first enforced it reflect on its mixed legacy",
      "url": "https://apnews.com/8274b017d3ca4c61eb571d610aa86d21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05128f112795442ab951d7d6b7d04973/1142.jpeg"
    },
    {
      "author": "SCOTT SONNER",
      "description": "RENO, Nev. (AP) — The blank canvass of desert wilderness in northern Nevada seemed the perfect place in 1992 for artistic anarchists to relocate their annual burning of a towering, anonymous effigy.",
      "publishedAt": "2023-12-27T05:27:28Z",
      "title": "Burning Man survived a muddy quagmire. Will the experiment last 30 more years?",
      "url": "https://apnews.com/7d4a7d27907c39bb053ac9fef5dde662",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0cd7d8fc997846529c3073c64e2ad587/2000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — China says it is banning a United States research company and two analysts who have reported extensively on claims of human rights abuses committed against Uyghurs and other Muslim minority groups native to the country’s far northwestern region of Xinjiang.",
      "publishedAt": "2023-12-27T09:04:31Z",
      "title": "China sanctions a US research firm and 2 individuals over reports on human rights abuses in Xinjiang",
      "url": "https://apnews.com/c61afd3492e384a4ff702b4ee4ba0e80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e394a48c73664eb9883d3e88a587fef4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}