{
  "articles": [
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Kris Kristofferson, singer-songwriter and actor who brought gritty realism to country music, has died at 88.",
      "publishedAt": "2024-09-29T22:29:54Z",
      "title": "Kris Kristofferson, singer-songwriter and actor who brought gritty realism to country music, has died at 88",
      "url": "https://apnews.com/84053764fc45cb7433ad8724a8ff6926",
      "urlToImage": ""
    },
    {
      "author": "KATE PAYNE, JEFFREY COLLINS and PATRICK WHITTLE",
      "description": "PERRY, Fla. (AP) — The U.S. Southeast grappled Sunday with rising death tolls, a lack of vital supplies in isolated, flood-stricken areas and the widespread loss of homes and property while the devastating toll of Hurricane Helene became more clear and officials warned of a lengthy and difficult rebuild.",
      "publishedAt": "2024-09-29T04:04:53Z",
      "title": "Death toll rises from Helene while supplies are rushed to North Carolina and Florida digs out",
      "url": "https://apnews.com/16b41006d3cb6fedad78d19ca3f389a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/186b4af8a6674abe9f6e7cef6b4ff949/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — Witnesses on Monday reported the first Israeli airstrike in central Beirut in nearly a year of conflict, hours after Israel struck targets across Lebanon and killed dozens of people as Hezbollah sustained a string of deadly blows to its command structure, including the killing of its overall leader, Hassan Nasrallah.",
      "publishedAt": "2024-09-29T09:09:33Z",
      "title": "Witnesses report first Israeli airstrike in central Beirut in nearly a year of conflict",
      "url": "https://apnews.com/4696e581e28d8c747f017221f2cf420f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f94d59daf04f4de89c910f76032b8303/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and JACK JEFFERY",
      "description": "BEIRUT (AP) — In just over a week, intensified Israeli strikes in Lebanon killed seven high-ranking commanders and officials from the powerful Hezbollah militant group, including the group's leader, Hassan Nasrallah.",
      "publishedAt": "2024-09-29T20:27:44Z",
      "title": "Who were the 7 high-ranking Hezbollah officials killed over the past week?",
      "url": "https://apnews.com/8b2ae56a54d641c6910a79e9e5699824",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8efb16f1d164e238a0d6cb670458b97/3000.jpeg"
    },
    {
      "author": "STEPHANIE LIECHTENSTEIN",
      "description": "VIENNA (AP) — The Freedom Party secured the first far-right national parliamentary election victory in post-World War II Austria on Sunday, finishing ahead of the governing conservatives after tapping into anxieties about immigration, inflation, Ukraine and other issues.",
      "publishedAt": "2024-09-29T04:05:58Z",
      "title": "Austria's Freedom Party secures first far-right national election win since World War II",
      "url": "https://apnews.com/1a22057b230a2576e0ca0ee69607cf6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a9826eb2a9d4c42809867586462752f/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — The two astronauts stuck at the International Space Station since June welcomed their new ride home with Sunday’s arrival of a SpaceX capsule.",
      "publishedAt": "2024-09-29T21:34:06Z",
      "title": "Stuck NASA astronauts welcome SpaceX capsule that'll bring them home next year",
      "url": "https://apnews.com/1162a1723bc426f5de9f30e3817c2605",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0464aa4819ff4b488f43de388992478f/3000.jpeg"
    },
    {
      "author": "MICHAEL WEISSENSTEIN",
      "description": "The world’s greatest stage is the sprawling Midtown Manhattan complex where leaders meet each year to discuss humanity’s future.The United Nations' most powerful body — the Security Council — is paralyzed by disputes, so this year's most varied speeches were delivered before the 193-member General Assembly.",
      "publishedAt": "2024-09-29T14:49:10Z",
      "title": "Behind the loudest issues, the UN is a world stage for disputes that are often out of the spotlight",
      "url": "https://apnews.com/91733358c069861c18f04be4fb1f1594",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49f034fcc23c4a53b5d26db12c6d1fc8/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and COLLEEN LONG",
      "description": "ERIE, Pa. (AP) — Republican presidential nominee Donald Trump escalated his personal attacks on his Democratic rival, Kamala Harris, on Sunday by repeating an insult that she was “mentally impaired” while also saying she should be “impeached and prosecuted.\"",
      "publishedAt": "2024-09-29T15:59:37Z",
      "title": "Trump escalates attacks on Harris' mental fitness and suggests she should be prosecuted",
      "url": "https://apnews.com/a38195f876767332c48d12226a6aea2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20d659c021094fb8a3964065ba15e6ee/2618.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "LOS ANGELES (AP) — Vice President Kamala Harris is set to rally in Las Vegas on Sunday night as both she and Republican Donald Trump continue to make frequent trips to Nevada, looking to gain momentum in the swing state as Election Day nears.",
      "publishedAt": "2024-09-29T11:24:02Z",
      "title": "Harris is set to rally again in Las Vegas as both campaigns emphasize swing-state Nevada",
      "url": "https://apnews.com/5e43f8e9159925cea38070e0bb662e47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7f39991527b4baa9799b2eef89a456b/3000.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Kris Kristofferson, a Rhodes scholar with a deft writing style and rough charisma who became a country music superstar and A-list Hollywood actor, has died.Kristofferson died at his home on Maui, Hawaii on Saturday, family spokeswoman Ebie McFarland said in an email.",
      "publishedAt": "2024-09-29T22:32:30Z",
      "title": "Kris Kristofferson, singer-songwriter and actor, dies at 88",
      "url": "https://apnews.com/47becf20fecd41aba66840af2e1275db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7228e9709e5d49f3be21b75b95bbf47a/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}