{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — The judge in Donald Trump's hush money trial cleared the courtroom of reporters Monday and then threatened to remove the defense's witness from the trial after his behavoir on the stand, a court transcript shows.",
      "publishedAt": "2024-05-20T04:02:40Z",
      "title": "Judge in Trump's hush money trial threatened to throw witness out of court for behavior on stand",
      "url": "https://apnews.com/363a86879b97d2367831b1392f42689d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/151282659f1b488dbe94a690f2a14aaa/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — The chief prosecutor of the world's top war crimes court sought arrest warrants Monday for leaders of Israel and Hamas, including Israeli Prime Minister Benjamin Netanyahu, over actions taken during their seven-month war.",
      "publishedAt": "2024-05-20T11:16:12Z",
      "title": "War crimes prosecutor seeks arrest of Israeli and Hamas leaders, including Netanyahu",
      "url": "https://apnews.com/070941d21ccd1f2b9611032b88527575",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9d288b57f6f485ea98a7556f7325e05/3000.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — The International Criminal Court could soon issue arrest warrants for Israeli and Hamas leaders, including Israeli Prime Minister Benjamin Netanyahu, more than seven months into the war between the two sides, based on a request by the court’s chief prosecutor.",
      "publishedAt": "2024-04-29T18:48:50Z",
      "title": "What is the ICC and why it is considering arrest warrants for Israeli and Hamas leaders",
      "url": "https://apnews.com/1f683a6e2e150d91c415eb1d0a19a44d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fba81926024d4df8b3006ea35afa4766/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — The death of Iran's president is unlikely to lead to any immediate changes in Iran's ruling system or to its overarching policies, which are decided by Supreme Leader Ayatollah Ali Khamenei.",
      "publishedAt": "2024-05-20T17:29:30Z",
      "title": "What's next for Iran's government after death of its president in helicopter crash?",
      "url": "https://apnews.com/6d3b970bce0c6d436b25b550d887ceaf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1ceb8d66cf145a08257591756f41a0e/3000.jpeg"
    },
    {
      "author": "JOSHUA G0ODMAN and JIM MUSTIAN",
      "description": "In an isolated part of the U.S. Drug Enforcement Administration headquarters known as the 12th-floor “bubble,” chief Anne Milgram made an unusual request of top deputies summoned in March for what she called the “Marijuana Meeting”: Nobody could take notes.",
      "publishedAt": "2024-05-20T19:46:45Z",
      "title": "Top U.S. drug agency a notable holdout in Biden's push to loosen federal marijuana restrictions",
      "url": "https://apnews.com/cb7869d3286094f0124de728320d89c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7304f2dec5442a2aada1055eaeef5a9/3000.jpeg"
    },
    {
      "author": "KEN SWEET",
      "description": "NEW YORK (AP) — The White House said Monday that the chairman of the Federal Deposit Insurance Corporation will step down, a departure that follows the release earlier this month of a damning report about the agency’s toxic workplace culture.",
      "publishedAt": "2024-05-20T15:02:06Z",
      "title": "The White House says FDIC chairman to step down following report on agency's toxic workplace culture",
      "url": "https://apnews.com/172f1fc2f7a8586d0813b1051906b52a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9156a5ec7e9148e8882afc475c9b0471/3000.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS and MATTHEW DALY",
      "description": "WASHINGTON (AP) — Cyberattacks against water utilities across the country are becoming more frequent and more severe, the Environmental Protection Agency warned Monday as it issued an enforcement alert urging water systems to take immediate actions to protect the nation's drinking water.",
      "publishedAt": "2024-05-20T18:31:57Z",
      "title": "EPA warns of increasing cyberattacks on water systems, urges utilities to take immediate action",
      "url": "https://apnews.com/1435b3e6a569aa046e05c7947f0a0f3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ac3e08470df4532987713764320d654/2706.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haiti’s main international airport reopened Monday for the first time in nearly three months after relentless gang violence forced authorities to close it.",
      "publishedAt": "2024-05-20T17:03:51Z",
      "title": "Haiti’s main international airport reopens nearly three months after gang violence forced it closed",
      "url": "https://apnews.com/4db3189b511bdcb4633b395ebf545194",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8800f36deaed4bbdb39f3d51c42b137e/3000.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — The recovery from the deadly Baltimore bridge collapse reached a significant milestone Monday as tugboats escorted the ill-fated container ship Dali back to port, its damaged bow still covered with smashed shipping containers, fallen steel trusses and mangled concrete.",
      "publishedAt": "2024-05-20T04:02:16Z",
      "title": "Tugboats escort ship that caused deadly Baltimore bridge collapse back to port",
      "url": "https://apnews.com/83dde05d3ad999c88dd5270bb0cea1c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc179c348dca45a2bf1928aff5c7a922/1920.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — OpenAI says it plans to halt the use of one of its ChatGPT voices after some users said it sounded like Scarlett Johansson, who famously voiced a fictional, and at the time futuristic, AI assistant in the 2013 film “Her.”",
      "publishedAt": "2024-05-20T17:44:57Z",
      "title": "Is that 'Her'? OpenAI pauses a ChatGPT voice after some say it sounds like Scarlett Johansson",
      "url": "https://apnews.com/532c849ccae3ca9e9325dacfe88e0436",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da4b632b21f54091abbfa4b758cbbf73/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}