{
  "articles": [
    {
      "author": "ADAM SCHRECK and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel's government said a drone targeted Prime Minister Benjamin Netanyahu’s house Saturday, with no casualties, as fighting with Lebanon-based Hezbollah and Gaza -based Hamas showed no pause after the killing of the Hamas mastermind of last year’s Oct.",
      "publishedAt": "2024-10-19T07:40:37Z",
      "title": "A drone targets Israeli prime minister's house while strikes in Gaza kill more than 50",
      "url": "https://apnews.com/c49911f11a40b7d81b21bc8568ecfe11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2054d1f19ba4f5ca8d77e2fd4bcc576/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB and FATMA KHALED",
      "description": "The world’s final glimpse of Hamas’ leader was rough and raw, showing him wounded and cornered as he sat in a bombed-out Palestinian home and faced down the Israeli drone filming him, hurling a stick at it.",
      "publishedAt": "2024-10-19T12:53:57Z",
      "title": "In Israeli footage of the last minutes of Hamas leader's life, some see a symbol of defiance",
      "url": "https://apnews.com/3ef0667312dfe514f8f7f3125a4ac872",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e3c3492adbc4b0fafaff7aaa9a3cbbf/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and BASSEM MROUE",
      "description": "TEL AVIV, Israel (AP) — Israeli forces have spent much of the past year destroying Hamas’ vast underground network in Gaza.",
      "publishedAt": "2024-10-19T04:01:56Z",
      "title": "Israel unearths Hezbollah's web of tunnels in southern Lebanon",
      "url": "https://apnews.com/2f22d95269bdf3b5fa1304816f2fee81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79df770c823949a9ba702c55d92ef891/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — Over the past four years, judges at Washington’s federal courthouse have punished hundreds of rioters who stormed the U.S. Capitol in an unprecedented assault on the nation's democracy.",
      "publishedAt": "2024-10-19T04:05:36Z",
      "title": "Judges punishing Jan. 6 rioters say they fear more political violence as Election Day nears",
      "url": "https://apnews.com/ebb54ab9badccfcb2b1bc2fa0de5bf21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa5f09b51fb24ed8a0e8f109aeed557d/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "LEWISVILLE, Texas (AP) — Deep in the heart of Texas' sprawl, the city of Lewisville embodies the Lone Star State.Bisected by Interstate 35 and ribboned with six- and eight-lane thoroughfares lined with chain stores, Mexican restaurants and pawn shops, Lewisville, 23 miles north of Dallas, is the prototypical slice of the nation's second most populous state.",
      "publishedAt": "2024-10-19T13:26:01Z",
      "title": "Two Texas cities represent the divide between those who vote and those who could, but often don't",
      "url": "https://apnews.com/4757833c15266ac793ed61c50292b653",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67ff0b5436a948d9a72d605c5c24d24a/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "MESA, Ariz. (AP) — Karl Peterson has been living the cruel inverse of the American dream. His rent keeps getting higher, but his apartments keep getting smaller.Peterson left the Midwest nine years ago for the epicenter of an economic boom, only to gradually learn that endless sunshine and desert views are increasingly among the few bargains left in Arizona.",
      "publishedAt": "2024-10-19T15:19:56Z",
      "title": "American despair: In Arizona, high home prices and limited prospects shape voters' presidential pick",
      "url": "https://apnews.com/b7ccfbbbf90849834316e8c9dd164c03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e086ba3a03d4db8bb14620f9f66a359/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "ANCHORAGE, Alaska (AP) — On a desolate slab of island tundra in western Alaska, a resident of Adak will again become the last American to cast an in-person ballot for president, continuing a 12-year tradition for the nation’s westernmost community.",
      "publishedAt": "2024-10-19T04:04:06Z",
      "title": "The last in-person vote in the US will be cast on the desolate tundra of Alaska's Aleutian Islands",
      "url": "https://apnews.com/1460b6fba46e90f0bafbbda5f7611dfa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a0c7289ac3e4db6bc1591bb2b88ed12/3000.jpeg"
    },
    {
      "author": null,
      "description": "HAVANA (AP) — Cuba's government on Saturday said that some electricity was restored on the island after one of the country's major power plants failed and left millions without electricity in an outage that started two days earlier.",
      "publishedAt": "2024-10-19T14:55:55Z",
      "title": "Cuba gets some electricity back after major power outage left millions in the dark",
      "url": "https://apnews.com/8c1447bb14f4105f18317986fa949dc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/731bc82baf394527a796adc6787c146a/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — France's foreign minister pledged his support for Ukraine’s plan for ending the war with Russia, telling reporters in Kyiv on Saturday that he would work with Ukrainian officials to secure other nations’ backing for the proposal.",
      "publishedAt": "2024-10-19T10:28:12Z",
      "title": "France vows support for Ukraine's plan to end Russian invasion",
      "url": "https://apnews.com/22dbb9037a98c3185ca3a0e3470e074a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/271e4107cb6544b582dbf51519e82526/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "CLEVELAND (AP) — The Rock &amp; Roll Hall Fame induction ceremony on Saturday night promises to be starry, jamming — and bittersweet.",
      "publishedAt": "2024-10-19T04:07:49Z",
      "title": "Rock & Roll Hall of Fame induction ceremony has a poignant vibe this year",
      "url": "https://apnews.com/631f31bd3ef6d72bd58c532ed380c031",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a48b5a9899345a49b233f34bcb32b6b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}