{
  "articles": [
    {
      "author": "SETH BORENSTEIN",
      "description": "WASHINGTON (AP) — Human-caused climate change dialed up the thermostat and turbocharged the odds of this month's killer heat that has been baking the Southwestern United States, Mexico and Central America, a new flash study found.",
      "publishedAt": "2024-06-20T07:02:20Z",
      "title": "Climate change made killer heat wave in Mexico, Southwest US even warmer and 35 times more likely",
      "url": "https://apnews.com/4787a8bb1eb3aca0d398f46207f24247",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5e5d2371f9e43f0a941366a5e5bc54d/3000.jpeg"
    },
    {
      "author": "ALFREDO PEÑA and MARIANA MARTÍNEZ BARBA",
      "description": "TAMPICO, Mexico (AP) — Tropical Storm Alberto rumbled toward northeast Mexico early Thursday as the first named storm of the season, carrying heavy rains that left three people dead but also brought hope to a region suffering under a prolonged, severe drought.",
      "publishedAt": "2024-06-20T05:21:49Z",
      "title": "Alberto, season's first named tropical storm, dumps rain on Texas and Mexico, which reports 3 deaths",
      "url": "https://apnews.com/f337703900f312aaefc4d34ddd8e5e8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f5d037150b749858eef58e4adbffdba/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea on Thursday condemned an agreement reached by Russia and North Korea that pledged mutual defense assistance in the event of war and said it will reconsider its policy of limiting its support to Ukraine to non-lethal supplies.",
      "publishedAt": "2024-06-20T01:49:29Z",
      "title": "South Korea blasts Russia-North Korea deal, says it will consider supplying arms to Ukraine",
      "url": "https://apnews.com/d9bb8aee7eb1a692b932337578fb3e30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf25a862584c4e7db29f79e6322ec617/3000.jpeg"
    },
    {
      "author": "LORI HINNANT, VASILISA STEPANENKO and HANNA ARHIROVA",
      "description": "KHARKIV, Ukraine (AP) — The first shock wave shattered aisles stacked almost to the ceiling with home improvement products. The next Russian bomb streaked down like a comet seconds later, unleashing flames that left the megastore an ashen shell.",
      "publishedAt": "2024-06-20T06:12:59Z",
      "title": "Russia obliterates Ukraine's front-line towns faster with hacked bombs and expanded air base network",
      "url": "https://apnews.com/58380b8625df7ed52a3b5472326559b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5ac99c04c954b1a95cf21ee390b6589/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The fate of the proposed cease-fire deal for Gaza hinges in many ways on two men: Israeli Prime Minister Benjamin Netanyahu and Hamas’ leader in Gaza, Yahya Sinwar.",
      "publishedAt": "2024-06-20T04:06:54Z",
      "title": "The fate of the latest cease-fire proposal hinges on Netanyahu and Hamas’ leader in Gaza",
      "url": "https://apnews.com/0d61977607945bfddc402c8e7e2fd05f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fad38da365e841f79a3e23b130053bda/3000.jpeg"
    },
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — Louisiana has become the first state to require that the Ten Commandments be displayed in every public school classroom, the latest move from a GOP-dominated Legislature pushing a conservative agenda under a new governor.",
      "publishedAt": "2024-06-19T17:59:13Z",
      "title": "New law requires all Louisiana public school classrooms to display the Ten Commandments",
      "url": "https://apnews.com/571a2447906f7bbd5a166d53db005a62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8e026827351427c8a68b89dc84c6af1/3000.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDRÉS LEIGHTON",
      "description": "ROSWELL, N.M. (AP) — Heavy rain and hail fell Wednesday around an evacuated village in New Mexico threatened by wildfires that have killed at least two people and damaged more than 1,400 structures, offering the hope of some assistance for firefighters but adding the threat of high winds and flash floods.",
      "publishedAt": "2024-06-19T05:34:15Z",
      "title": "New Mexico wildfire claims second life, while rain offers hope of relief",
      "url": "https://apnews.com/7d367792f6ea70d4fdb1248c15e6899d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee231f3eae7a4da78de2fdc4ceb3100f/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW DELHI (AP) — At least 34 people have died and dozens hospitalized after drinking illegally brewed liquor in the southern Indian state of Tamil Nadu, local media reported on Thursday. The state's chief minister M K Stalin said the 34 died after consuming liquor that was tainted with methanol, according to the Press Trust of India news agency.",
      "publishedAt": "2024-06-20T05:10:26Z",
      "title": "Illegally brewed liquor kills at least 34 with dozens hospitalized in southern India",
      "url": "https://apnews.com/1ec967d5d76653e71475ca15ac936eed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bcbc6d9a5844a908d937de856984866/3000.jpeg"
    },
    {
      "author": null,
      "description": "MONTGOMERY, Ala. (AP) — Thousands of surnames grace the towering monument, representing the more than 4 million enslaved people who were freed after the Civil War.The Equal Justice Initiative, a criminal justice reform nonprofit, invoked the Juneteenth holiday — the day that commemorates the end of slavery in the U.S.",
      "publishedAt": "2024-06-19T20:41:48Z",
      "title": "On Juneteenth, monument dedicated in Alabama to those who endured slavery",
      "url": "https://apnews.com/6d6b721da53872a9b81cc913d209143a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5c9051f4f5c4c638eb9cde2c2c2d21d/3000.jpeg"
    },
    {
      "author": "JEFF McMILLAN",
      "description": "Marissa Lasoff-Santos and the person she would marry quickly fell head over heels in love. Lasoff-Santos was a gay woman. Her girlfriend was a bisexual woman — or so they thought. Now her partner has become her husband, and they both identify as queer.",
      "publishedAt": "2024-06-20T04:08:14Z",
      "title": "Can a marriage survive a gender transition? Yes, and even thrive. How these couples make it work",
      "url": "https://apnews.com/853ba976a3b28a78fb557ce4d2810578",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b6849e68ece42af96eb55c60ce6151d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}