{
  "articles": [
    {
      "author": "LAURA UNGAR and JONATHAN MATTISE",
      "description": "After being downgraded from a tropical storm, Ophelia on Sunday still threatened parts of the Northeast with coastal flooding, life-threatening waves and heavy rain from Washington to New York City, the National Hurricane Center said.",
      "publishedAt": "2023-09-24T05:22:41Z",
      "title": "Weakening Ophelia still poses a risk of coastal flooding and heavy rain in some parts of the US",
      "url": "https://apnews.com/326b445a9ae54d03e9c1026528f15539",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a4d00dda3ba4290b5a18c54c46a02d9/2000.jpeg"
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Working furiously to take control of a House in disarray, allies of Speaker Kevin McCarthy implored their Republican colleagues Saturday to drop their hardline tactics and work together to approve a conservative spending plan to prevent a federal shutdown.",
      "publishedAt": "2023-09-23T21:24:35Z",
      "title": "With House Republicans in turmoil, colleagues implore GOP holdouts not to shut down government",
      "url": "https://apnews.com/249d83636e9d61cdd2aabdf34a129514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f58ba0500e394a5d93caef0eb66ef7cf/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KRAMATORSK, Ukraine (AP) — Among the hundreds of trains criss-crossing Ukraine’s elaborate railway network every day, the Kyiv-Kramatorsk train stands apart, shrouded in solemn silence as passengers anticipate their destination.",
      "publishedAt": "2023-09-24T04:14:27Z",
      "title": "A Ukrainian train is a lifeline connecting the nation's capital with the front line",
      "url": "https://apnews.com/4e0547023d456e9f1a0c33372704cdf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27252625e34849f0be618821f14a570e/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden is set to establish diplomatic relations Monday with two South Pacific nations, the Cook Islands and Niue, as his administration aims to show to Pacific Island leaders that it is committed to increasing American presence in the region.",
      "publishedAt": "2023-09-24T09:00:35Z",
      "title": "US will establish diplomatic ties with the Cook Islands and Niue as Biden hosts Pacific leaders",
      "url": "https://apnews.com/c07493a9c05893e1477d991cf07b9ffb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2351b9a8e4448629b829ec1206c58b3/3000.jpeg"
    },
    {
      "author": null,
      "description": "TORONTO (AP) — Information shared by members of an intelligence-sharing alliance was part of what Canadian Prime Minister Justin Trudeau used to make public allegations of the Indian government's possible involvement in the assassination of a Sikh Canadian, the U.S.",
      "publishedAt": "2023-09-23T18:44:57Z",
      "title": "US diplomat says intelligence from 'Five Eyes' nations helped Canada to link India to Sikh's killing",
      "url": "https://apnews.com/c475ac129e09e5f1c9ebf68eaaf247ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e010ee35b244e4aa5d72ab468b9abee/3000.jpeg"
    },
    {
      "author": "JONATHAN LANDRUM Jr.",
      "description": "LOS ANGELES (AP) — Usher has a new confession: The Grammy winner will headline the Apple Music Super Bowl Halftime Show in Las Vegas.The NFL, Apple Music and Roc Nation announced Sunday that Usher would lead the halftime festivities from Allegiant Stadium on Feb.",
      "publishedAt": "2023-09-24T13:59:34Z",
      "title": "Usher to headline the 2024 Super Bowl halftime show in Las Vegas",
      "url": "https://apnews.com/05a21fe7663feff1368bba8e8ba7c47b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7026a68ec2844c9790f82e07bbcded7d/3000.jpeg"
    },
    {
      "author": "JULIE WATSON",
      "description": "The Afghan man speaks only Farsi, but he wasn't worried about representing himself in U.S. immigration court.",
      "publishedAt": "2023-09-24T14:07:56Z",
      "title": "He spoke no English, had no lawyer. An Afghan man's case offers a glimpse into US immigration court",
      "url": "https://apnews.com/cabf3bcdec9a62b12f08300d1260cd68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bcda8cd48d84b46b7dba60bccad5b40/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — Wildfires fueled by climate change have ravaged communities from Maui to the Mediterranean this summer, killing many people, exhausting firefighters and fueling demand for new solutions.",
      "publishedAt": "2023-09-24T07:08:24Z",
      "title": "The threat of wildfires is rising. So are new artificial intelligence solutions to fight them",
      "url": "https://apnews.com/62002360f2e3be32ccc7df020239efea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/672da93283644fea8ec881450554538e/3000.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "ST. LOUIS (AP) — Ben Phillips’ childhood memories include basketball games with friends, and neighbors gathering in the summer shade at their St. Louis housing complex. He also remembers watching men in hazmat suits scurry on the roofs of high-rise buildings as a dense material poured into the air.",
      "publishedAt": "2023-09-24T12:05:02Z",
      "title": "Government should pay compensation for secretive Cold War-era testing, St. Louis victims say",
      "url": "https://apnews.com/40f14597ceb9810fb4cdfba296221859",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f18d2ada3c84a63b209d13fa138c87a/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "NASA’s first asteroid samples fetched from deep space parachuted into the Utah desert Sunday to cap a seven-year journey.",
      "publishedAt": "2023-09-24T11:22:16Z",
      "title": "NASA's first asteroid samples land on Earth after release from spacecraft",
      "url": "https://apnews.com/9918c2c13b689e01800de4ea42d60188",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca0b4f6c4a0542518da422a3c24da5d4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}