{
  "articles": [
    {
      "author": "MICHAEL KUNZELMAN, LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Former Proud Boys leader Enrique Tarrio was sentenced Tuesday to 22 years in prison for orchestrating a failed plot to keep Donald Trump in power after the Republican lost the 2020 election, capping the case with the stiffest punishment that has been handed down yet for the U.S.",
      "publishedAt": "2023-09-05T10:42:07Z",
      "title": "Proud Boys’ Enrique Tarrio gets record 22 years in prison for Jan. 6 seditious conspiracy",
      "url": "https://apnews.com/da60222b3e1e54902db2bbbb219dc3fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/292a4c6762004eedb95680e056ba0ef0/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The humanitarian situation in conflict-wracked eastern Congo has deteriorated alarmingly in the past 18 months with 8 million people in urgent need of assistance and women and girls subjected to sexual violence on a massive scale -- just in three provinces, a senior U.N.",
      "publishedAt": "2023-09-06T03:00:28Z",
      "title": "An alarming humanitarian crisis and massive sexual violence wrack eastern Congo, UN official says",
      "url": "https://apnews.com/0f5ebeaccff39ab97c61e981f1a7a3cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9e6631f17204d73b06e320eac51543f/3000.jpeg"
    },
    {
      "author": "STEVE LeBLANC",
      "description": "Former White House aide Gabe Amo could become the first person of color to represent Rhode Island in Congress after his win Tuesday in the crowded Democratic primary for the state's 1st Congressional District special election sent him on to the general election in the heavily Democratic state.",
      "publishedAt": "2023-09-05T04:10:00Z",
      "title": "Democrat Amo could be 1st person of color to represent Rhode Island in Congress after primary win",
      "url": "https://apnews.com/1b694c616deae70b7cc2cb046a272d59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3acaafc71ef43ed9168322209583b7a/2100.jpeg"
    },
    {
      "author": null,
      "description": "SAN JUAN, Puerto Rico (AP) — Tropical Storm Lee formed Tuesday in the Atlantic Ocean and was forecast to become a major hurricane as it approaches the Caribbean by the weekend, forecasters said.The storm was located some 1,230 miles (1,980) kilometers east of the Lesser Antilles Tuesday night.",
      "publishedAt": "2023-09-05T21:19:37Z",
      "title": "Tropical Storm Lee forms in Atlantic, forecast to become major hurricane heading to the Caribbean",
      "url": "https://apnews.com/920cc05aa24a8eaabeefa39eb57e7153",
      "urlToImage": ""
    },
    {
      "author": "SCOTT SONNER, ED KOMENDA and GABE STERN",
      "description": "RENO, Nev. (AP) — The traffic jam leaving the Burning Man festival eased up considerably Tuesday as the exodus from the mud-caked Nevada desert entered another day following massive rain that left tens of thousands of partygoers stranded for days.",
      "publishedAt": "2023-09-05T17:34:53Z",
      "title": "No longer stranded, tens of thousands clean up and head home after Burning Man floods",
      "url": "https://apnews.com/3971a523f4b993f8f35e158fd1a17a1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d42bae92218a4c68b25caea232ad1814/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Justice Department special counsel Jack Smith warned Tuesday that former President Donald Trump's “daily” statements threaten to taint a jury pool in Washington in the criminal case charging him with scheming to overturn the results of the 2020 presidential election.",
      "publishedAt": "2023-09-05T23:13:02Z",
      "title": "Trump's comments risk tainting jury pool in federal election subversion case, special counsel says",
      "url": "https://apnews.com/9abe1cf490ddf44179b55327f1023358",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97d4379964de47f49c6ba397ad6a1aa5/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un may travel to Russia for a summit with President Vladimir Putin, a U.S.",
      "publishedAt": "2023-09-05T11:40:36Z",
      "title": "Kim Jong Un and Putin may meet. What do North Korea and Russia need from each other?",
      "url": "https://apnews.com/c44735b9903e6f30e7e8d673ef4c77f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24f036cecf9a4129938f09e4e7a1222d/3000.jpeg"
    },
    {
      "author": null,
      "description": "TOKYO (AP) — Prosecutors in Japan indicted a 24-year-old man Wednesday on attempted murder and other charges in the explosive attack on Prime Minister Fumio Kishida in April, Japanese media reported.",
      "publishedAt": "2023-09-06T03:07:43Z",
      "title": "Suspect indicted on attempted murder charge in explosives attack on Japan's Kishida, report says",
      "url": "https://apnews.com/9146f3d2d1acf4ca1a41551727b27ff1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b026c2340c34e9a8fa9ad225e68a718/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — A new book about Joe Biden portrays the president as someone whose middle-class upbringing helped foster a resentment of intellectual elitism that shaped his political career and sometimes caused strain with his onetime boss, Harvard-educated Barack Obama.",
      "publishedAt": "2023-09-05T18:32:29Z",
      "title": "New book details Biden-Obama frictions and says Harris sought roles 'away from the spotlight'",
      "url": "https://apnews.com/3f0ab52553f85d9fbd231c6ae1cba78f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20734fcfd7114565b92b0948805bfa1b/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Senate Republican Leader Mitch McConnell's health episodes show “no evidence” of a stroke or seizure disorder, the Capitol physician said Tuesday, but his statement still left questions about the apparent freeze-ups that have drawn concerns about the 81-year-old's situation.",
      "publishedAt": "2023-09-05T15:33:46Z",
      "title": "Sen. McConnell's health episodes show no evidence of stroke or seizure disorder but questions linger",
      "url": "https://apnews.com/162087fbf0d0c1dfa2c19beca1bd380f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b40e851a4f54471fb4400577528b88fd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}