{
  "articles": [
    {
      "author": null,
      "description": "Under intense pressure from President Donald Trump’s own supporters, his administration now says it will push a court to unseal secret documents related to Jeffrey Epstein’s case. It's an effort to put to rest for good a political crisis largely of the administration's own making. But even if those records eventually become public, it’s far from certain they will appease critics enraged over the administration’s unfulfilled promises of full transparency about the evidence against the wealthy financier. Meanwhile, the administration remains dogged by questions about its refusal to release other records in its possession.",
      "publishedAt": "2025-07-18T17:46:32Z",
      "title": "Trump administration seeks release of more Epstein records",
      "url": "https://apnews.com/article/trump-jeffrey-epstein-justice-department-bondi-91f911d2d7a909f78259cdca7b55d9a6",
      "urlToImage": "https://dims.apnews.com/dims4/default/192af96/2147483647/strip/true/crop/5776x3249+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F1f%2F00dcaaf0fa0f1cd71b471264fa01%2F29ee39764b114d3998767bf2b9741e99"
    },
    {
      "author": null,
      "description": "President Donald Trump has looked to the marble finishes and hefty price tag of the Federal Reserve headquarters to claim grounds to fire Chair Jerome Powell, with whom he has tussled for years over interest rates. But the extensive use of marble in the building is, at least in part, the result of policies backed by Trump himself. As the Fed moved forward with plans to renovate its Great Depression-era headquarters in Washington during Trump’s first term, it faced concerns in 2020 during a vetting process involving Trump appointees, who called for more “white Georgia marble” for the facade of building.",
      "publishedAt": "2025-07-18T14:46:59Z",
      "title": "Trump appointees pushed more marble in Fed building renovation White House now attacks",
      "url": "https://apnews.com/article/powell-trump-federal-reserve-16a3a78bab27f44e058d69829a8dcfa9",
      "urlToImage": "https://dims.apnews.com/dims4/default/21fd324/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2F72%2F84c7362105d36f430c66ab2f2c1f%2Fec53a4dba3c8401f97eaf2afc91bd889"
    },
    {
      "author": null,
      "description": "President Donald Trump on Friday will sign into law a new set of regulations for a type of cryptocurrency that are seen as a way to legitimize the burgeoning industry. The GENIUS Act sets initial guardrails and consumer protections for stablecoins, a type of cryptocurrency that is tied to a stable asset like the U.S. dollar to reduce price volatility. It passed both the House and Senate with wide bipartisan margins. The measure is meant to bolster consumer confidence in the rapidly growing crypto sector. Its passage comes as Trump makes it a mission to establish the U.S. as the “crypto capital of the world.”",
      "publishedAt": "2025-07-18T15:56:45Z",
      "title": "President Donald Trump will sign a new cryptocurrency bill into law on Friday",
      "url": "https://apnews.com/article/donald-trump-stablecoins-congress-cryptocurrency-94fa3c85e32ec6fd5a55576cf46e58ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/7b91de4/2147483647/strip/true/crop/5822x3275+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F66%2Faf6e09b0e9fdc6a76ef3c68be5e3%2Fb0e943886a084705b089ac3ff45c0736"
    },
    {
      "author": null,
      "description": "U.S. Attorney General Pam Bondi says at least three people are dead after an incident at a Los Angeles County Sheriff’s Department facility. There was a reported explosion at the facility Friday morning. The Los Angeles County Sheriff’s Department has not confirmed any deaths. The U.S. Attorney’s Office did not immediately respond to a request for comment. California Gov. Gavin Newsom’s office said he’s been briefed on the matter. The blast happened about 7:30 a.m. in East Los Angeles. That is according to the Los Angeles County Fire Department. Aerial footage from KABC-TV shows the explosion happened in a parking lot filled with sheriff patrol cars and box trucks.",
      "publishedAt": "2025-07-18T16:13:32Z",
      "title": "Attorney General Bondi says at least 3 dead after incident at LA sheriff facility",
      "url": "https://apnews.com/article/facility-sheriff-los-angeles-dead-explosion-da7ad1fdc444bbb7d8c14f33b44333e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Top church leaders have visited Gaza after its only Catholic church was struck by an Israeli shell the day before. The attack Thursday killed three people and wounded ten, including a priest who had developed a close friendship with the late Pope Francis. The strike drew condemnation from the pope and U.S. President Donald Trump, and prompted a statement of regret from Israel, which said it was a mistake. Since ending a ceasefire in March, Israel has regularly launched far deadlier strikes across Gaza against what it says are Hamas militants, frequently killing women and children. Strikes killed 18 people overnight, health officials said Friday.",
      "publishedAt": "2025-07-18T11:20:43Z",
      "title": "Christian patriarchs visit Gaza after pope and Trump condemn Israeli strike on church",
      "url": "https://apnews.com/article/israel-gaza-war-palestinians-church-pizzaballa-theophilos-8797732b94777534379f1adc4468cbb9",
      "urlToImage": "https://dims.apnews.com/dims4/default/8862afb/2147483647/strip/true/crop/4854x2730+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F15%2Fea4681973fd7018c32248958f9df%2F71ca9098f8ec4c58815eaf3adb036aaa"
    },
    {
      "author": null,
      "description": "Members of Syria's Druze community are searching for loved ones and counting their dead after days of clashes in a southern province that left bloodied bodies of civilians on the streets and homes looted. The fighting in Sweida province this week began with tit-for-tat kidnappings and attacks between local Sunni Bedouin tribes and Druze armed factions. Government forces that intervened to restore order clashed with the Druze militias, but also in some cases attacked civilians. One monitoring group said dozens of civilians were rounded up by fighters and shot and killed. The violence has left Druze more skeptical of Syria’s new leadership and doubtful of peaceful coexistence.",
      "publishedAt": "2025-07-18T05:03:14Z",
      "title": "Syria's Druze search for loved ones, find bodies in the streets after clashes",
      "url": "https://apnews.com/article/syria-sweida-druze-beduins-clashes-killings-18ef9342394408ecb7810fdb0e89168e",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fd118e/2147483647/strip/true/crop/3200x1800+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F6e%2Fb27cf87280c1d7d50d5a330e4733%2F654f02a6f2bd4498a212e9057fb7c950"
    },
    {
      "author": null,
      "description": "From crypto coins to bibles, overseas development deals to an upcoming line of cellphones, Trump family businesses have raked in hundreds of millions of dollars since his election. That flood of often shadowy money –- from billionaires, foreign governments and cryptocurrency tycoons, all with interests before the federal government –- has permitted the president to leverage the power of his office for personal gain unlike any of his predecessors.",
      "publishedAt": "2025-07-18T11:13:03Z",
      "title": "For Sale: Trump is leveraging power of his office to reap profits for family businesses",
      "url": "https://apnews.com/article/trump-businesses-trump-organization-white-house-conflicts-of-interest-b970b5681b27f86dcd461ff473be23fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/415a85b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F3f%2Fbb498fb0cebce83634ba08874adf%2Ffae0c9ad787e4e2e994e8c7556028986"
    },
    {
      "author": null,
      "description": "Brazil’s former President Jair Bolsonaro has been ordered to wear an ankle monitor, his press office has confirmed. The development on Friday came as federal police conducted searches at his home and his party’s headquarters in Brasília. The former president is facing trial at the Supreme Court for allegedly leading a coup attempt to overturn the 2022 election, which he lost to President Luiz Inácio Lula da Silva. On Tuesday, Brazil’s chief prosecutor accused Bolsonaro of inciting insurrection. Bolsonaro has called the trial a “witch hunt,” echoing statements by former U.S. President Donald Trump, who has defended him.",
      "publishedAt": "2025-07-18T12:52:42Z",
      "title": "Brazil's Bolsonaro ordered to wear ankle monitor",
      "url": "https://apnews.com/article/brazil-bolsonaro-investigation-supreme-court-b1e2c1fbb7f776103895b6efca94af4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/5445a72/2147483647/strip/true/crop/3744x2106+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2F68%2Fdf12178979347f74c7f5623d142a%2F45e93e35abef4edfa7b000086cf12442"
    },
    {
      "author": null,
      "description": "Wall Street is drifting toward the finish of its third winning week in the last four. The S&P 500 was flat Friday after setting its all-time high the day before. The Dow Jones Industrial Average slipped 155 points, and the Nasdaq composite was nearly unchanged after coming off its own record. Charles Schwab, Regions Financial and other stocks rallied following stronger-than-expected profit reports. But Netflix gave back some of its stellar gains for the year despite also topping analysts’ expectations. Treasury yields eased in the bond market after a report suggested U.S. consumers may be feeling less fearful about coming inflation.",
      "publishedAt": "2025-07-18T04:56:09Z",
      "title": "Wall Street drifts near records as it heads for the finish of a winning week",
      "url": "https://apnews.com/article/markets-stocks-japan-inflation-rates-43b87b3786fdd2971f3b8c52ffedc20a",
      "urlToImage": "https://dims.apnews.com/dims4/default/48e3574/2147483647/strip/true/crop/7024x3951+0+366/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F7b%2Fe570f760fca68223fe70179df04b%2Faec95b834e4546ec84f6aa8320b02085"
    },
    {
      "author": null,
      "description": "Oscar-winning lyricist Alan Bergman has died at 99. A family spokesperson said he died late Thursday in Los Angeles. Bergman teamed with his wife, Marilyn, for an enduring and loving partnership that produced such old-fashioned hits as “How do You Keep the Music Playing?,” “It Might Be You” and the classic “The Way We Were.” The Bergmans were among the most successful and prolific teams of their time. They provided words and occasional music for hundreds of songs, including movie themes that became as famous as the films themselves. Frank Sinatra, Michael Jackson, Barbra Streisand, Tony Bennett and many other artists performed their material.",
      "publishedAt": "2025-07-18T14:42:06Z",
      "title": "Alan Bergman, Oscar-winning lyricist, dies at 99",
      "url": "https://apnews.com/article/alan-bergman-dies-composer-77e4bf9dd39a17a26b3fc2f809a7efee",
      "urlToImage": "https://dims.apnews.com/dims4/default/6cd399d/2147483647/strip/true/crop/2525x1420+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F9a%2F1a63fd64c085a098d793160af2a4%2F54fd55ae89a14c29b2bacffae13345ad"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}