{
  "articles": [
    {
      "author": "BASSEM MROUE, JOHNSON LAI, and JUSTIN SPIKE",
      "description": "BEIRUT (AP) — Walkie-talkies and solar equipment exploded in Beirut and other parts of Lebanon on Wednesday in an apparent second wave of attacks targeting devices a day after pagers used by Hezbollah blew up, state media and officials for the militant group said.",
      "publishedAt": "2024-09-18T06:12:52Z",
      "title": "Lebanon is rocked again by exploding devices as Israel declares a new phase of war",
      "url": "https://apnews.com/ce6af3c2e6de0a0dddfae48634278288",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/700f3e20d6d84a20bdc831a82360ea04/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — With Israel's defense minister announcing a “new phase” of the war and an apparent Israeli attack setting off explosions in electronic devices in Lebanon, the specter of all-out combat between Israel and Hezbollah seems closer than ever before.",
      "publishedAt": "2024-09-18T20:15:01Z",
      "title": "A war with Hezbollah may be looming. Is Israel prepared?",
      "url": "https://apnews.com/df4c835ee3d1471e79d1a7fe951226bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/961b243688a042ad8b77de2cbd3271d0/3000.jpeg"
    },
    {
      "author": "MEG KINNARD, AAMER MADHANI and JILL COLVIN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris on Wednesday criticized Republican Donald Trump 's promise to deport millions of people who are in the United States illegally, questioning whether he would rely on massive raids and detention camps to carry it out.",
      "publishedAt": "2024-09-18T11:09:21Z",
      "title": "Harris hits Trump's promise of mass deportations as Trump rallies on Long Island",
      "url": "https://apnews.com/367611170a28f470afc537dcefe158ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a55ed701d47441b99b1e6c3c700f2935/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS and JONATHAN J. COOPER",
      "description": "WASHINGTON (AP) — Until recently, Lillian Dunsmuir of Bullhead City, Arizona, “didn’t really think about\" Kamala Harris and had no opinion of the vice president. But now she likes what she’s seeing.",
      "publishedAt": "2024-09-19T04:01:37Z",
      "title": "Voters view Harris more favorably as she settles into role atop Democratic ticket: AP-NORC poll",
      "url": "https://apnews.com/3f0a52c889027df9b46f2d9407190217",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db67a953b9e446f8b8a684dd7d760116/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and CLAIRE GALOFARO",
      "description": "SEOUL, South Korea (AP) — As the plane descended into Seoul, Robert Calabretta swaddled himself in a blanket, his knees tucked into his chest like a baby in the womb. A single tear ran down his cheek.",
      "publishedAt": "2024-09-19T04:20:20Z",
      "title": "Rampant adoption fraud separated generations of South Korean children from their families, AP finds",
      "url": "https://apnews.com/e4e7d4b8823212e3b260517c5128cd66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02f165c4cbf0466c901d285ab4333ce0/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "SPRINGFIELD, Ohio (AP) — In the quiet corners of Springfield, Ohio — out of sight of the drumbeat of politicians and journalists, troopers and newly installed security cameras — the people who live here are taking a breath, praying and attempting to carry on.",
      "publishedAt": "2024-09-19T04:14:58Z",
      "title": "Residents of Springfield, Ohio, hunker down and pray for a political firestorm to blow over",
      "url": "https://apnews.com/7e8b09654c0dd90d72c884dbb798c71b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76ef6de867df4f4fbffa5636dc2d2024/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MICHAEL BALSAMO",
      "description": "NEW YORK (AP) — As they unsuccessfully fought to keep Sean “Diddy” Combs out of jail after his sex trafficking arrest, the music mogul’s lawyers highlighted a litany of horrors at the Brooklyn federal lockup where he was headed: horrific conditions, rampant violence and multiple deaths.",
      "publishedAt": "2024-09-18T18:56:36Z",
      "title": "Inside the Brooklyn federal jail where Sean ‘Diddy’ Combs is locked up: violence, squalor and death",
      "url": "https://apnews.com/8c910839adf3ac54a8adc8d7cb3f0b79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbc711284ba048de92cb6abdd50fbc44/1920.jpeg"
    },
    {
      "author": "JIM MUSTIAN and JOSHUA GOODMAN",
      "description": "WASHINGTON (AP) — A longtime CIA officer who drugged, photographed and sexually assaulted more than two dozen women in postings around the world was sentenced to 30 years in federal prison Wednesday after an emotional hearing in which victims described being deceived by a man who appeared kind, educated and part of an agency “that is supposed to protect the world from evil.”",
      "publishedAt": "2024-09-18T21:17:43Z",
      "title": "Veteran CIA officer who drugged and sexually assaulted dozens of women gets 30 years in prison",
      "url": "https://apnews.com/f870024c1723b1a4d47425e6e16f8bfa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/303963663c4f4af0b51b749f933113e0/3000.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "FRANKFORT, Ky. (AP) — A body found in rural southeastern Kentucky is believed to be the man suspected of shooting and wounding five people on an interstate highway, authorities said Wednesday night.",
      "publishedAt": "2024-09-18T21:34:37Z",
      "title": "Search for suspect in Kentucky highway shooting ends with discovery of body believed to be his",
      "url": "https://apnews.com/aaf9f458a2e715b5b3a31fbda8dba25c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80d3449599ba4d0b8b1058e1a4242a78/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "KAMITUGA, Congo (AP) — Slumped on the ground over a mound of dirt, Divine Wisoba pulled weeds from her daughter’s grave. The 1-month-old died from mpox in eastern Congo in August, but Wisoba, 21, was too traumatized to attend the funeral.",
      "publishedAt": "2024-09-19T04:07:49Z",
      "title": "A gold mining town in Congo has become an mpox hot spot as a new strain spreads",
      "url": "https://apnews.com/f9affb7a7d73c8c30daf296c51c920c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30a43913f1a044d5a2aac1d25d32cffb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}