{
  "articles": [
    {
      "author": "AUDREY McAVOY and GENE JOHNSON",
      "description": "LAHAINA, Hawaii (AP) — Leola Vierra stepped gingerly among the hardened pools of melted metal, charred wood and broken glass that are almost all that remain of the home where she lived for nearly 50 years.",
      "publishedAt": "2023-09-27T02:32:44Z",
      "title": "Lahaina family finds heirloom in rubble of their home on first visit after deadly wildfire",
      "url": "https://apnews.com/dedecda517c90a2b6869c36d5ec572ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38544a7edfbb49aba041d73867dd3f7d/2000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Hollywood's writers strike was declared over after nearly five months Tuesday night when board members from their union approved a contract agreement with studios, bringing the industry at least partly back from a historic halt in production.",
      "publishedAt": "2023-09-26T04:20:20Z",
      "title": "The Hollywood writers strike is over after guild leaders approve contract with studios",
      "url": "https://apnews.com/d3119d670a4fd3449773bf8f4026fb2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/270ac75c1a2f4f9887e20ee97d0e8b50/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A judge ruled Tuesday that Donald Trump committed fraud for years while building the real estate empire that catapulted him to fame and the White House, and he ordered some of the former president's companies removed from his control and dissolved.",
      "publishedAt": "2023-09-26T20:24:03Z",
      "title": "Judge rules Donald Trump defrauded banks, insurers while building real estate empire",
      "url": "https://apnews.com/1569245a9284427117b8d3ba5da74249",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa036bfc4ccf4693a48708be783f0fb1/1424.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The Congress is starkly divided over very different paths to preventing a federal shutdown — the Senate charging ahead with a bipartisan package to temporarily fund the government but the House slogging through a longshot effort with no real chance of finishing by Saturday's deadline.",
      "publishedAt": "2023-09-26T04:03:27Z",
      "title": "Congress says its wants to avoid a shutdown. But the House and Senate are moving even further apart.",
      "url": "https://apnews.com/e4c37673b6507deaed2902f2166ef759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/201fe92e7704435699b6120e85ef433b/1920.jpeg"
    },
    {
      "author": "FARID ABDULWAHED",
      "description": "MOSUL, Iraq (AP) — A fire that raced through a hall hosting a Christian wedding in northern Iraq killed at least 100 people and injured 150 others, authorities said Wednesday, warning the death toll could rise.",
      "publishedAt": "2023-09-26T23:57:11Z",
      "title": "A fire at a wedding hall in northern Iraq has killed more than 100 people and injured 150",
      "url": "https://apnews.com/1d8a5dbbda46a01b1688a547b95b39a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bf10e311efc4c66931a39853a2b0dd0/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, TOM KRISHER and CHRIS MEGERIAN",
      "description": "VAN BUREN TOWNSHIP, Mich. (AP) — President Joe Biden grabbed a bullhorn on the picket line Tuesday and urged striking auto workers to “stick with it” in an unparalleled show of support for organized labor by a modern president.",
      "publishedAt": "2023-09-26T04:02:36Z",
      "title": "Biden urges striking auto workers to 'stick with it' in picket line visit unparalleled in history",
      "url": "https://apnews.com/8ecc84eeca15c99673f31bdac6921f7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0a4c75e70674925bd485832537e3b4e/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "U.S. regulators and 17 states are suing Amazon over allegations the e-commerce behemoth abuses its position in the marketplace to inflate prices on and off its platform, overcharge sellers and stifle competition.",
      "publishedAt": "2023-09-26T16:04:06Z",
      "title": "Amazon sued by FTC and 17 states over allegations it inflates online prices and overcharges sellers",
      "url": "https://apnews.com/1b91bf8026cc3edf81e817cf8596c4bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c2655d1b2f24abd84d4482fb1556899/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and JAKE OFFENHARTZ",
      "description": "WASHINGTON (AP) — Sen. Bob Menendez came under heavy pressure to resign Tuesday as a surging number of his Democratic colleagues in the Senate, including fellow New Jersey Democrat Cory Booker, urged him to step aside over the federal bribery allegations against him.",
      "publishedAt": "2023-09-26T15:54:09Z",
      "title": "Calls are mounting for Menendez to resign as Democrats grapple with 'shocking' bribery allegations",
      "url": "https://apnews.com/9d17cbf4520627be01d4969f05cce3a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab318c264d32439f83f0db5d52aa1082/1920.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "The second Republican presidential debate is drawing near with a smaller onstage lineup than the first event last month.",
      "publishedAt": "2023-09-26T20:55:24Z",
      "title": "Want to tune in for the second GOP presidential debate? Here's how to watch",
      "url": "https://apnews.com/1187625baa7388989231164cd53bf140",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f821a87729234c77b5bb05ec00c57864/3000.jpeg"
    },
    {
      "author": "ADAM BEAM",
      "description": "SACRAMENTO, Calif. (AP) — California will ban people from carrying firearms in most public places while doubling the taxes on guns and ammunition sold in the state under two new laws Gov. Gavin Newsom signed Tuesday that will test the limits of the U.S.",
      "publishedAt": "2023-09-26T17:59:17Z",
      "title": "California governor signs law raising taxes on guns and ammunition to pay for school safety",
      "url": "https://apnews.com/0870a673a3d4e85c78466897cfd7ff6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54bef2e04bd546bba28f36abb7ed8a26/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}