{
  "articles": [
    {
      "author": "STEPHEN GROVES",
      "description": "Republican skepticism in the Senate of President Donald Trump’s Cabinet nominees has been worn down. And that's put his unconventional choices for some of the most powerful positions in the federal government on the verge of confirmation. Floor votes are expected this week on Robert F. Kennedy Jr., who's in line to be the nation’s health secretary, and Tulsi Gabbard, the choice for director of national intelligence. One by one, Republicans have acquiesced to Trump’s picks, even those whose personal history, lack of experience and unorthodox views would have once made them hardly imaginable for a Cabinet.",
      "publishedAt": "2025-02-09T12:47:57Z",
      "title": "How Republican skeptics got to 'yes' on RFK Jr. and Gabbard",
      "url": "https://apnews.com/article/trump-cabinet-rfk-gabbard-vance-senate-republicans-e76b6af616715508e48084de04eecdbe",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c3cd73/2147483647/strip/true/crop/5108x2873+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F0e%2F4f879be126a4bc29d9807b73db75%2F98581235b0b940f59421cd434f9a4b93"
    },
    {
      "author": "EMMA BURROWS",
      "description": "Nearly three years after President Vladimir Putin invaded Ukraine, his troops are making steady progress on the battlefield. Kyiv is grappling with shortages of men and weapons. And a new U.S. president could soon halt Ukraine’s massive supply of military aid. Russian and Western analysts say Putin is closer than ever to achieving his objectives in the battle-weary country, with little incentive to come to the negotiating table, no matter how much U.S. President Donald Trump might cajole or threaten him. Both are signaling their readiness for discussions on Ukraine -– by phone or in person -– using a combination of flattery and threats.",
      "publishedAt": "2025-02-08T06:43:40Z",
      "title": "Trump says he wants to negotiate about Ukraine. It's not clear if Putin really does",
      "url": "https://apnews.com/article/putin-trump-russia-ukraine-war-51adbc0cde5a9ca0eaabf46153eb9580",
      "urlToImage": "https://dims.apnews.com/dims4/default/c96d599/2147483647/strip/true/crop/3301x1857+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F70%2F275e2e4541068d39376143e96e74%2Fc85f542bb6bc47539426d5d7eb274415"
    },
    {
      "author": "KEVIN FREKING",
      "description": "Talks on a spending bill for the current budget year have bogged down in the wake of President Donald Trump’s efforts to slash federal spending and its workforce. Republican leaders say Democrats have walked away from negotiations. Not so, say Democrats. The current stopgap measure lasts through March 14. After that, without congressional action, there would be a partial government shutdown. The two sides also disagree about following an agreement made in mid-2023 with then-President Joe Biden that would increase spending this budget year by 1% for both defense and nondefense. Democrats want to follow that agreement. Republicans don't.",
      "publishedAt": "2025-02-08T14:58:04Z",
      "title": "Spending bill talks bog down after Trump's efforts to slash government",
      "url": "https://apnews.com/article/congress-trump-spending-bill-negotiations-shutdown-democrats-ec5e27f15e765e6df0527338f63192e1",
      "urlToImage": "https://dims.apnews.com/dims4/default/db8c0d4/2147483647/strip/true/crop/8381x4714+0+437/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2Fdc%2F3147666a7f907f433b04ed0e1160%2Fddfd2bdc74e646d1bae6d94eaa8d8bbb"
    },
    {
      "author": "GERALD IMRAY",
      "description": "Groups representing some of South Africa’s white minority have responded to a plan by U.S. President Donald Trump to offer them refugee status and resettlement in the United States by saying: thanks, but no thanks. The plan was detailed in an executive order Trump signed Friday that stopped all aid and other financial assistance to South Africa as punishment for what his administration said were “rights violations” against white South Africans. The South African government denies it. Two of the most prominent groups representing Afrikaners said Saturday they are here to stay, but thanked Trump for raising their issues.",
      "publishedAt": "2025-02-08T15:44:24Z",
      "title": "Trump says some white South Africans are oppressed and could be resettled in the US. They say no thanks",
      "url": "https://apnews.com/article/trump-south-africa-afrikaners-0120efec17122b47e3371e0e39fe1db8",
      "urlToImage": "https://dims.apnews.com/dims4/default/9d8ae7a/2147483647/strip/true/crop/4205x2365+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2Fe0%2F6245833f772feedd0622dcb3a7d3%2F25f71951df3e41a6ac24ac101dbadc5c"
    },
    {
      "author": "LLAZAR SEMINI, FARNOUSH AMIRI, MUNIR AHMED",
      "description": "Thousands of Afghan refugees who worked alongside American soldiers in Afghanistan and underwent a yearslong vetting process to enter the United States are in limbo. That's because of President Donald Trump's executive orders on immigration. It's the latest setback for this group of American allies. They've already gained strong backing over the years from veteran groups and members of Congress. Yet they continue to face hurdles in rebuilding their lives after the U.S. withdrawal from Afghanistan. Many are now left stranded in Albania, Pakistan and Qatar. That's where they're awaiting transfer to the U.S. Others are in hiding from the Taliban in Afghanistan.",
      "publishedAt": "2025-02-09T12:40:17Z",
      "title": "Trump's immigration moves put Afghans who helped with US airstrikes against Taliban in limbo",
      "url": "https://apnews.com/article/refugees-trump-immigration-executive-orders-resettlement-afghans-2a673e3a01ff6fa5006ef47f50dba158",
      "urlToImage": "https://dims.apnews.com/dims4/default/ac568fc/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F14%2Fda59a4d83b6bfb21ef7855d876c8%2F9aad6d885dc847a0b143a28a12c09576"
    },
    {
      "author": "DEE-ANN DURBIN, MAE ANDERSON, WYATTE GRANTHAM-PHILIPS",
      "description": "This year’s Super Bowl commercials are going for laughs, with advertisers betting that viewers need a diversion from weighty matters. As the Philadelphia Eagles and the Kansas City Chiefs hit the field in New Orleans, a parade of silly ads will hit the airwaves on Sunday. A Northwestern University marketing professor says most Super Bowl ads were in development during last fall’s U.S. presidential election race, so avoiding controversy was even more of a priority. Many advertisers put their ads online ahead of the game, but some big brands held out to maintain an element of surprise. Marketing experts say the overall lineup features a lot of simple humor and nostalgia but few creative risks.",
      "publishedAt": "2025-02-09T15:22:38Z",
      "title": "Super Bowl 2025: Commercials rely on comedy and nostalgia as advertisers play it safe",
      "url": "https://apnews.com/article/super-bowl-commercials-2025-41c81bb3868e64156c0c3636e1829f1f",
      "urlToImage": "https://dims.apnews.com/dims4/default/e729e1c/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Ff5%2F846bbce3d447bc3052526eab0776%2F82efbdfd23b742ef90151914775e6cbe"
    },
    {
      "author": "KATIE WORKMAN",
      "description": "If you’re throwing a watch party for the Super Bowl, you couldn’t ask for a better backdrop and inspiration than host city New Orleans. It's known for enticing food, and one that's fun to make and enjoy is the po'boy sandwich. Experts say that what makes the po'boy different from other sandwiches is the bread. It's got a crisp, thin crust and an airy, malty interior. You use two big pieces of it. If you're not in New Orleans, you might have to use a baguette or Italian loaf instead of the traditional New Orleans French bread. A fully dressed po'boy means shredded lettuce, sliced tomato, sliced pickles and mayonnaise. But any combination is fine. Popular fillings include roast beef, fried oysters and fried shrimp.",
      "publishedAt": "2025-02-03T13:50:45Z",
      "title": "A Super Bowl in New Orleans is a good excuse to make shrimp po'boys",
      "url": "https://apnews.com/article/super-bowl-food-shrimp-poboy-2c27eff1b471e1690ac2b77ca9eb68d2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4fbbce4/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F00%2Fef13da6b130a0b3861f3a51d0ab5%2F582b638975bb4390926039ebf81bd3fd"
    },
    {
      "author": "JONATHAN LANDRUM JR.",
      "description": "New Orleans artist Tahj Williams used to stitch the Super Bowl logo and theme art in her sewing room, and now her creation is stretched across buildings near the Caesars Superdome. As visitors flood New Orleans this week and millions tune into the Super Bowl on Sunday, Williams will be celebrating her personal achievements and her culture. The 26-year-old artist is the first person to handcraft both the Super Bowl logo and theme art. Her intricate beadwork reflects the spirit of her city, and celebrates Black Masking culture, which she was introduced to during childhood.",
      "publishedAt": "2025-02-05T21:06:14Z",
      "title": "Super Bowl artist weaves Black Masking culture into vibrant logo and theme art for NFL global stage",
      "url": "https://apnews.com/article/super-bowl-2025-logo-theme-art-674bda6f8dfc140f47e7734831ed6b6d",
      "urlToImage": "https://dims.apnews.com/dims4/default/a732d6f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Fa9%2F99cfb66e800294e1ef40fcf871a0%2F42d6805140c648b79481a5b3d772838f"
    },
    {
      "author": "TIA GOLDENBERG, MOHAMMAD JAHJOUH",
      "description": "Israeli officials say Israeli forces have withdrawn from a key Gaza corridor, part of Israel’s commitments under a tenuous ceasefire deal with Hamas. The deal is moving ahead but faces a major test over whether the sides can negotiate its planned extension. Israel agreed as part of the truce to remove its forces from the 4-mile Netzarim corridor, a strip of land that bisects northern Gaza from the south. While the development Sunday signals the agreement is moving ahead, the sides appear to have made little progress on negotiating the deal’s second phase, which is meant to extend the truce and lead to the release of more Israeli hostages held by Hamas.",
      "publishedAt": "2025-02-09T08:29:32Z",
      "title": "Israeli forces withdrawing from Netzarim corridor in Gaza, official says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-09-2025-9c36734cd5175fbb86e6d1dabe3cfc07",
      "urlToImage": "https://dims.apnews.com/dims4/default/79b8ad0/2147483647/strip/true/crop/2579x1451+0+134/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2Fcc%2F074ae0eda455b553e02506d11ff3%2F542d99c95fbc40f2be2318a2e065f071"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "Five Thai workers released after being held hostage for over a year in Gaza arrived in Bangkok on Sunday. The five were the second batch of Thai hostages released since the war broke out. During an earlier ceasefire in November 2023, 23 Thai nationals were freed in a deal negotiated between Thailand and Hamas, with assistance from Qatar and Iran. There was no immediate information available about the last Thai hostage left in Gaza, Nattapong Pingsa, nor the two Thai workers whose bodies were taken into Gaza.",
      "publishedAt": "2025-02-09T01:42:57Z",
      "title": "Released Thai hostages return to Bangkok after being held for over a year in Gaza",
      "url": "https://apnews.com/article/thailand-middle-east-gaza-hostages-d225705053f453c403d25f29658d0fb5",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee3b6cb/2147483647/strip/true/crop/5931x3336+0+309/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2F86%2F85c0ce55c146f82bcea143518f9c%2Fa2bd7f9b4df343b89fdba054ce49f4a8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}