{
  "articles": [
    {
      "author": "MIKE CATALINI",
      "description": "A federal judge is set to hear the first arguments in a multi-state lawsuit seeking to block President Donald Trump’s executive order ending the constitutional guarantee of birthright citizenship regardless of the parents' immigration status. U.S. District Judge John C. Coughenour scheduled a hearing Thursday to consider the request from Arizona, Illinois, Oregon and Washington. The lawsuit filed in Seattle is one of at least five brought by a total of 22 states and a number of immigrant rights groups across the country.",
      "publishedAt": "2025-01-23T05:06:51Z",
      "title": "A bid to block Trump's cancellation of birthright citizenship is in federal court",
      "url": "https://apnews.com/article/birthright-citizenship-donald-trump-lawsuit-immigration-9ac27b234c854a68a9b9f8c0d6cd8a1c",
      "urlToImage": "https://dims.apnews.com/dims4/default/959bdb0/2147483647/strip/true/crop/5533x3112+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2Fbb%2Fb3cdd69d538b479f719f6a448a0e%2F7d3bfb7c093148b0be7a5ce7384409d9"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "President Donald Trump has his first piece of immigration legislation to sign: the Laken Riley Act, which requires unauthorized immigrants accused of theft and violent crimes to be detained.",
      "publishedAt": "2025-01-23T07:35:00Z",
      "title": "Live updates: House passes the Laken Riley Act, sending the bill to Trump's desk",
      "url": "https://apnews.com/live/trump-presidency-day-4-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/05b7237/2147483647/strip/true/crop/1024x576+0+54/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2F94%2F4a5dfd3643eb8eb956f4cf43dc97%2Fap25022004628818.jpg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "President Donald Trump is pardoning anti-abortion activists who were convicted in the October 2020 invasion and blockade of a Washington clinic. Lauren Handy was sentenced to nearly five years in prison for leading the blockade by directing activists to link themselves together with locks and chains to block the clinic’s doors. Trump pardoned Handy and her nine co-defendants. The news of the pardons comes ahead of Friday’s annual anti-abortion protest March for Life in Washington, D.C., where the president is expected to address the crowd in a video.",
      "publishedAt": "2025-01-23T21:36:18Z",
      "title": "Trump pardons anti-abortion activists who blockaded clinic entrances",
      "url": "https://apnews.com/article/abortion-trump-executive-order-pardon-817774b21d32a4edf6d39ee43cbc18f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/1458926/2147483647/strip/true/crop/5181x2914+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2Fe6%2F82a2ffcda6facc643fa1bd84af93%2F11880361b22e4ab7a23059504d59b25e"
    },
    {
      "author": "JON GAMBRELL",
      "description": "Saudi Arabia’s crown prince says the kingdom wants to invest $600 billion in the United States over the next four years, comments that came after President Donald Trump mused about returning to the kingdom as his first foreign trip. The comments from Crown Prince Mohammed bin Salman, reported early Thursday by the state-run Saudi Press Agency, came in a phone call with Trump. On Monday after his inauguration, Trump talked about possibly heading to the kingdom again as his first foreign trip, like he did in 2017.",
      "publishedAt": "2025-01-23T05:07:16Z",
      "title": "Saudi Arabia floats $600 billion investment in US",
      "url": "https://apnews.com/article/saudi-arabia-us-investment-trump-6730a89f93b44ed8d705638f95700cbb",
      "urlToImage": "https://dims.apnews.com/dims4/default/e10201c/2147483647/strip/true/crop/5297x2980+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F3d%2F91ea2dae6d7aad16839597a65526%2Fdbe2103276414ea09b12be5b58173be2"
    },
    {
      "author": "MORGAN LEE, STEPHEN GROVES",
      "description": "President Donald Trump’s promise to deport “millions and millions” of immigrants will hinge on securing money for detention centers. The Trump administration has not publicly said how many immigrant detention beds it needs to achieve its goals, or what the cost will be. However, an estimated 11.7 million people are living in the U.S. illegally. Immigration and Customs Enforcement currently has the budget to detain only about 41,000 people. Trump’s declaration of a national emergency at the U.S. border with Mexico leverages the U.S. military to shore up mass deportations and provide “appropriate detention space.” The American Civil Liberties Union estimates that ICE is considering an expansion of immigrant detention space across at least eight states.",
      "publishedAt": "2025-01-23T06:05:46Z",
      "title": "Immigrant detention beds may be maxed out as Trump moves to deport 'millions and millions'",
      "url": "https://apnews.com/article/immigration-detention-trump-costs-5c6c59afdb8fa79a7ca74848bd3b7cc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/df623f6/2147483647/strip/true/crop/4084x2297+0+215/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F10%2F8a%2F5eae78428b0a2d8009e70addbe6d%2F9543b89ed7344ffbbe7688c823ac2f84"
    },
    {
      "author": "ALI SWENSON, LINDSAY WHITEHURST",
      "description": "President Donald Trump's pardons of those convicted in the Jan. 6, 2021, attack on the U.S. Capitol and the rhetoric of retribution from some of those released this week is raising deep concern among attorneys, former federal investigators and experts who follow extremism. They worry that the indiscriminate release of everyone charged in the riots could embolden extremists to commit more violence on the president’s behalf – including during future elections. Some already have mimicked the president's call for retribution against perceived enemies. Enrique Tarrio, the former Proud Boys leader who was convicted of seditious conspiracy, said “the people who did this” need to “feel the heat.”",
      "publishedAt": "2025-01-23T18:35:13Z",
      "title": "Trump's Jan. 6 pardons could embolden extremists, experts say",
      "url": "https://apnews.com/article/trump-pardons-jan-6-extremists-capitol-riot-proud-boys-bdd25aa653ceb2a2db6fd3ef2f9bda6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/df8fc8e/2147483647/strip/true/crop/4200x2363+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F75%2F0f395bdc17ba38cbae610b03310d%2F172069da5f284b599a1b4030070df945"
    },
    {
      "author": "FERNANDA FIGUEROA, AYANNA ALEXANDER, COREY WILLIAMS",
      "description": "Federal agencies, employees and contractors are trying to process how President Donald Trump’s sweeping anti-DEI executive order will upend their work. Republican legislators who oppose DEI programs say they are discriminatory and promote left-wing ideology. DEI supporters say the programs are necessary to ensure that institutions meet the needs of increasingly diverse student populations. The executive action calls for the termination of DEI programs, mandates, policies, preferences and activities in the federal government along with the review and revision of existing federal employment practices, union contracts and training policies or programs. It also targets federal contractors and grantees.",
      "publishedAt": "2025-01-23T21:18:00Z",
      "title": "Trump order ending federal DEI programs leaves agencies and stakeholders on uncertain ground",
      "url": "https://apnews.com/article/trump-dei-executive-order-diversity-inclusion-f67ea86032986084dd71c5aa0c6b8d1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2e286f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F39%2F1e68945b0535510cdd007e62811b%2Ff0988800cf5c4ac3ba66c8d5add1f771"
    },
    {
      "author": "TARA COPP",
      "description": "Pete Hegseth, President Donald Trump’s nominee for defense secretary, paid $50,000 to the woman who accused him of sexual assault in 2017. That's according to answers he provided to a senator during his confirmation process that The Associated Press has obtained. The answers were provided to Massachusetts Democratic Sen. Elizabeth Warren in response additional questions she had for Hegseth as part of the vetting process. Hegseth attorney Timothy Parlatore declined to comment on the dollar figure Thursday. Hegseth told police at the time that the encounter had been consensual and denied any wrongdoing. The news of the payment comes the same day the Senate advanced Hegseth’s nomination along a party-line vote.",
      "publishedAt": "2025-01-23T21:46:56Z",
      "title": "Hegseth told senator he paid $50,000 to woman who accused him of 2017 sex assault",
      "url": "https://apnews.com/article/hegseth-sex-assault-payment-trump-6674cc8cfee654c374725948e01ff666",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f287bd/2147483647/strip/true/crop/5443x3062+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F21%2F7d%2Fb128a919234e5878af298b7b02d9%2F35edda763db647518551197f33ae129c"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "The Senate has confirmed Donald Trump's pick to lead the CIA. John Ratcliffe was director of national intelligence during Trump's first term and is the first person to have held that position and the top post at the CIA, the nation's premier spy agency. The Senate's confirmation Thursday gives Trump the second member of his new Cabinet. Ratcliffe told senators at a hearing last week that the CIA must do better when it comes to using technology like artificial intelligence to confront adversaries including Russia and China.",
      "publishedAt": "2025-01-23T19:26:35Z",
      "title": "Senate confirms John Ratcliffe to lead the CIA",
      "url": "https://apnews.com/article/cia-director-ratcliffe-trump-cabinet-national-intelligence-a73ceaef42086d46a728979189a9826b",
      "urlToImage": "https://dims.apnews.com/dims4/default/c9a02a5/2147483647/strip/true/crop/4985x2804+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F0e%2F2cf9f50b0afeb75a76fe8fb11c62%2F9c524dbd9bd842a688cc208c9cbe0d97"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "President Donald Trump has ordered the release of thousands of classified governmental records related to the assassination of President John F. Kennedy. The executive order Trump signed Thursday also aims to declassify the remaining federal records relating to the assassinations of Sen. Robert F. Kennedy and Martin Luther King Jr. The order is among a flurry of actions Trump has quickly taken as he begins a second term. Only a few thousand of the millions of governmental records related to the JFK assassination have yet to be fully declassified.",
      "publishedAt": "2025-01-23T21:51:09Z",
      "title": "Trump declassifies JFK, RFK and MLK assassination records",
      "url": "https://apnews.com/article/trump-jfk-mlk-rfk-assassination-files-e92f89d694eb55c595175f71a72cb5bc",
      "urlToImage": "https://dims.apnews.com/dims4/default/59fd915/2147483647/strip/true/crop/7340x4129+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2F32%2Fc8149e8e4c6062923381b5ba6596%2F99a6cf1be26446e2840d274d2c8b2cfe"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}