{
  "articles": [
    {
      "author": "AARON BEARD",
      "description": "The upcoming NBA draft is filled with talented forwards who either played internationally or bypassed college basketball.French teenager Zaccharie Risacher could very well be the No. 1 overall pick and checked in at No.",
      "publishedAt": "2024-06-22T10:00:37Z",
      "title": "French teenager Risacher, G League's Buzelis headline list of top forward prospects in the NBA draft",
      "url": "https://apnews.com/2bc41310d2199b5414e3ce07250c7b23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7acb44cd3dec4fd08bb2029588579210/3000.jpeg"
    },
    {
      "author": "ED WHITE and JOHN HANNA",
      "description": "Floodwaters forced people out of their homes in parts of Iowa, the result of weeks of rain, while much of the United States longed for relief Saturday from yet another round of extraordinary heat.Sirens blared at 2 a.m.",
      "publishedAt": "2024-06-22T16:06:22Z",
      "title": "Flooding forces people from homes in some parts of Iowa while much of US broils again in heat",
      "url": "https://apnews.com/3c96b904f1ccb4725ac856aa450180be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8409ec92d1cd42cdbe47d501401b859a/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — At least 39 people were killed by Israeli strikes across northern Gaza on Saturday, as rescue workers scrambled to find survivors beneath the rubble, according to Palestinian and hospital officials.",
      "publishedAt": "2024-06-22T07:56:53Z",
      "title": "At least 39 people killed in Israeli strikes across northern Gaza, officials say",
      "url": "https://apnews.com/39d09eccc39a7f225d573c97e73a2917",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dda60e44b1e347d8921797e74e603e87/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An attack by Yemen's Houthi rebels targeted a commercial ship traveling through the Gulf of Aden but apparently caused no damage, authorities said Saturday, in the latest strike on the shipping lane by the group.",
      "publishedAt": "2024-06-22T04:38:14Z",
      "title": "Yemen's Houthi rebels target ship in the Gulf of Aden as the Eisenhower aircraft carrier heads home",
      "url": "https://apnews.com/ffe35adc91e25379c0c6fd420b413099",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05cc162bf78341c9a564bea53a3f6568/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "DOYLESTOWN, Pa. (AP) — Thirty miles north of Philadelphia, upscale subdivisions such as Colonial Commons interrupt dairy farms, centuries-old roadside stone houses and the winding Neshaminy Creek that flows between Doylestown and Newtown.",
      "publishedAt": "2024-06-22T04:06:11Z",
      "title": "Biden and allied Republicans are trying to rally GOP women in swing-state suburbs away from Trump",
      "url": "https://apnews.com/9d1e7276ddc0121a35b768c3b1486510",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07fe8ed4d6124e4abc8f5d8ac49b2551/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — A 22-year-old woman who became an abortion rights advocate after she was raped by her stepfather as a child will campaign with first lady Jill Biden in Pennsylvania this weekend as part of a 2024 election push around the anniversary of the fall of Roe v.",
      "publishedAt": "2024-06-22T12:15:35Z",
      "title": "Now an abortion rights advocate, woman raped by stepfather as a child will campaign with first lady",
      "url": "https://apnews.com/5a63638ad0193c2e778ad54c9683ba64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19b603959e7a4e75b91de7560897ccc6/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — Donald Trump told a group of evangelicals they “cannot afford to sit on the sidelines” of the 2024 election, imploring them at one point to “go and vote, Christians, please!\"",
      "publishedAt": "2024-06-22T04:04:03Z",
      "title": "Trump endorses Ten Commandments in schools, implores evangelical Christians to vote in November",
      "url": "https://apnews.com/042cd25750a43a1f9a474e793c86c0a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70c5bf9220be401d82011f737cfb4560/1920.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE",
      "description": "Idaho librarian June Meissner was closing up for the day at the downtown Boise Public Library when a man approached her asking for help. As an information services librarian, answering patrons' questions is part of Meissner’s day-to-day work, and serving the community is one of her favorite parts of the job.",
      "publishedAt": "2024-06-22T13:01:02Z",
      "title": "LGBTQ+ librarians grapple with attacks on books - and on themselves",
      "url": "https://apnews.com/4ac552901f7ab0eca3a9dcf070b24350",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e17bd377ada419d85cb2aea1801ffb6/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL",
      "description": "HANOI, Vietnam (AP) — A senior U.S. diplomat held talks in Vietnam on Saturday and said that the trust between the two countries was at an “all-time high,” just days after Russian President Vladimir Putin's state visit to Hanoi.",
      "publishedAt": "2024-06-22T15:30:15Z",
      "title": "A U.S. envoy visits Hanoi days after Putin, saying US-Vietnam trust is at 'all-time high'",
      "url": "https://apnews.com/cc1873bee97218b50013bfdc3fdc5c10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cc77ee9fb004fb6bd6a7f07ce2069f6/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — A family of six was found dead by rescuers in Fujian province, state media reported Saturday, adding to the extreme weather deaths after downpours caused landslides in the area, even as authorities extended a warning of more severe weather ahead.",
      "publishedAt": "2024-06-22T09:37:58Z",
      "title": "Rescuers find family of 6 dead in landslide in eastern China, as severe weather warning extended",
      "url": "https://apnews.com/38e991e0a3633ce1819c5e018fe652f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6f6d9b33c2c48a294da02d4c54074b7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}