{
  "articles": [
    {
      "author": "FATIMA HUSSEIN",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump on Saturday threatened 100% tariffs against a bloc of nine nations if they act to undermine the U.S. dollar.His threat was directed at countries in the so-called BRIC alliance, which consists of Brazil, Russia, India, China, South Africa, Egypt, Ethiopia, Iran and the United Arab Emirates.",
      "publishedAt": "2024-11-30T19:08:33Z",
      "title": "Trump threatens 100% tariff on the BRIC bloc of nations if they act to undermine US dollar",
      "url": "https://apnews.com/8572985f41754fe008b98f38180945c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4e0e569c9bd4adab91f022e56758035/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — In the days after the presidential election, Sadie Perez began carrying pepper spray with her around campus. Her mom also ordered her and her sister a self-defense kit that included keychain spikes, a hidden knife key and a personal alarm.",
      "publishedAt": "2024-11-30T05:07:06Z",
      "title": "Emboldened 'manosphere' accelerates threats and demeaning language toward women after US election",
      "url": "https://apnews.com/d5cea53480437ac8bf837aaa821e5681",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbea7d32462b45048d180fb581e21351/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — For years, Pat Verhaeghe didn’t think highly of Donald Trump as a leader.Then Verhaeghe began seeing more of Trump’s campaign speeches online and his appearances at sporting events.",
      "publishedAt": "2024-11-30T18:11:42Z",
      "title": "Young men swung to the right for Trump after a campaign dominated by masculine appeals",
      "url": "https://apnews.com/ff30e38698a41132cf90345fffabe579",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/550e418aec0c4f8482ea919e673da874/2584.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — Thousands of Syrian insurgents took over most of Aleppo on Saturday, establishing positions in the country's largest city and controlling its airport before expanding their shock offensive to a nearby province.",
      "publishedAt": "2024-11-30T09:19:39Z",
      "title": "After entering Aleppo, Syrian insurgents advance to a nearby province. Assad says he'll defeat them",
      "url": "https://apnews.com/abff93e4f415ebfd827d49b1a90818e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29b6d23d549a4398a9670badcda82be3/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, TIA GOLDENBERG and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike on a car in the Gaza Strip on Saturday killed five people, including employees of World Central Kitchen.",
      "publishedAt": "2024-11-30T10:33:01Z",
      "title": "An Israeli strike in Gaza kills World Central Kitchen workers. Israel says 1 was an Oct. 7 attacker",
      "url": "https://apnews.com/506c8f976ad62afcf2a0ec977a8b6451",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/877bd41ece41460689638394136193ea/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "TYRE, Lebanon (AP) — The ceasefire between Israel and Hezbollah brought hope for normality back to many in southern Lebanon on Friday, including fishermen who long launched their wooden-hulled single-engine boats into the Mediterranean at dawn.",
      "publishedAt": "2024-11-30T05:46:05Z",
      "title": "Lebanese fishermen hope ceasefire with Israel means normal life returning",
      "url": "https://apnews.com/1eb9dad3ab8f0f5dae73db12a17f1a94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9efc88ef1b943f790f66afca4015688/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE, RICK CALLAHAN and CAROLYN THOMPSON",
      "description": "BUFFALO, N.Y. (AP) — The first big snowfall of the season blanketed towns along Lake Erie on Saturday in the middle of the hectic holiday travel and shopping weekend, and numbing cold and heavy snow were forecast to persist into next week and cause hazards in the Great Lakes, Plains and Midwest regions.",
      "publishedAt": "2024-11-30T05:12:16Z",
      "title": "Heavy snow blankets parts of the US during busy holiday travel weekend",
      "url": "https://apnews.com/c7dd6d98b0170c25972baa5dd27d1649",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04366a08b5324cdb8c75522a7e6a027f/1920.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "Southwest Airlines says it is ending its cabin service earlier on its flights starting next month. Beginning on Dec. 4, a company spokesperson said, flight attendants will begin preparing the cabin for landing at an altitude of 18,000 feet (5,486 meters) instead of 10,000 feet (3,048 meters).",
      "publishedAt": "2024-11-30T17:19:05Z",
      "title": "Southwest Airlines says it is ending cabin service earlier to reduce chance of injury",
      "url": "https://apnews.com/a2766c4de881e1467900b392789457de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c66fdd2757bf42ebb4e31e349c0ec629/3000.jpeg"
    },
    {
      "author": "JENNIFER McDERMOTT",
      "description": "BUSAN, South Korea (AP) — The world’s nations will wrap up negotiating a treaty this weekend to address the global plastic pollution crisis.",
      "publishedAt": "2024-11-30T05:45:39Z",
      "title": "What to know about the plastic pollution crisis as treaty talks conclude in South Korea",
      "url": "https://apnews.com/631960e4375aeec46517133348635a7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fa3bfc8eb2e4ab4a9b5349807f4628e/3000.jpeg"
    },
    {
      "author": "STEPHEN McGRATH",
      "description": "BUCHAREST, Romania (AP) — Hundreds of protesters gathered in Bucharest after a far-right populist unexpectedly won the first round of a presidential race, plunging Romania into turmoil just days before the country holds parliamentary elections.",
      "publishedAt": "2024-11-30T05:26:48Z",
      "title": "Romania's parliamentary vote risks being overshadowed by presidential race chaos",
      "url": "https://apnews.com/42548c4841392bd7a504761752e0970c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6cafe97d5f54682931b5ab1f47a6682/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}