{
  "articles": [
    {
      "author": "Chris Megerian",
      "description": "President Donald Trump's administration says federal agencies should begin planning to eliminate employee positions. The process is known as a reduction in force. Agency leaders must submit their plans by March 13. Trump is setting the stage for what could become a dramatic realignment of the federal government. He's already downsized the workforce by laying off probationary employees. Now the administration is turning its attention to career officials with civil service protection. Trump foreshadowed this goal in an executive order that he signed with Elon Musk, the billionaire entrepreneur who's advising the Republican president on overhauling the government.",
      "publishedAt": "2025-02-26T16:31:00Z",
      "title": "Trump administration sets stage for large-scale federal worker layoffs in new memo",
      "url": "https://apnews.com/article/trump-elon-musk-federal-workers-layoffs-d295d4bb2cdd5023c27d9cb03754e81b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d981041/2147483647/strip/true/crop/7394x4159+0+385/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbc%2F41%2Fe107c105defd724c2bdc48419a33%2F57ed9e887bf24efb9d5367711da29934"
    },
    {
      "author": "Ellen Knickmeyer, Matthew Lee, Mark Sherman",
      "description": "The Trump administration says it is eliminating more than 90% of the U.S. Agency for International Development’s foreign aid contracts and $60 billion in overall U.S. assistance around the world. That’s according to an internal memo obtained by The Associated Press as well as court filings Wednesday. They detail the outcome of a 90-day review ordered by President Donald Trump of all the money provided by USAID and the State Department for development and aid work overseas. The move leaves few surviving USAID projects for advocates to try to save in what are ongoing court battles. Meanwhile, the Supreme Court late Wednesday temporarily blocked a court order requiring the administration to release billions of dollars in foreign aid.",
      "publishedAt": "2025-02-26T23:27:52Z",
      "title": "Supreme Court blocks order for Trump administration to release billions in US foreign aid",
      "url": "https://apnews.com/article/trump-usaid-foreign-aid-cuts-6292f48f8d4025bed0bf5c3e9d623c16",
      "urlToImage": "https://dims.apnews.com/dims4/default/3576dc3/2147483647/strip/true/crop/5212x2932+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2Fbf%2Fc9d7bef4d9c72024409dc3f16ea9%2F295bbc7950564e698abd859d63bb8717"
    },
    {
      "author": "Tara Copp, Carla K. Johnson",
      "description": "The Department of Veterans Affairs has temporarily suspended billions of dollars in contract cuts after an uproar that critical veterans health services were harmed, lawmakers and veterans service organizations said Wednesday. The pause affects hundreds of VA contracts that Secretary Doug Collins a day earlier described as simply consulting deals whose cancellation would save $2 billion. The Associated Press has obtained the full list of 875 of contracts up for cancellation, and it shows the cuts would have affected everything from cancer care to the ability to assess toxic exposure. It underscores how the administration’s approach to broad swath spending cuts have had immediate and potentially unintended consequences.",
      "publishedAt": "2025-02-26T23:44:10Z",
      "title": "Veterans Affairs pauses cuts lauded by Elon Musk as lawmakers, veterans decry loss of critical care",
      "url": "https://apnews.com/article/doge-veterans-affairs-cuts-health-services-contracts-9a726b744e402da01d711023b0fc49a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/880d936/2147483647/strip/true/crop/5100x2869+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F21%2Fb2422e0c15ea0efc2189b5036c5c%2F001c7c8c71a04876882ece68d0d0b273"
    },
    {
      "author": "Lolita C. Baldor, Tara Copp",
      "description": "Building lethality in the military may be the buzzword for the new Trump administration, but busywork and paperwork have become the reality at the Pentagon, as service members and civilian workers are facing a broad mandate to purge all of the department’s social media sites and untangle confusing personnel reduction moves. A new memo requires the military services to spend countless hours poring over years of website postings, photos, news articles and videos to remove any mentions that “promote diversity, equity and inclusion.” If they can’t do that by March 5, they must “temporarily remove from public display\" all content published during the Biden administration’s four years in office.",
      "publishedAt": "2025-02-27T01:02:02Z",
      "title": "Pentagon orders new purge of social media sites to dump diversity, inclusion mentions by March 5",
      "url": "https://apnews.com/article/pentagon-social-media-purge-lethality-cc404f00493578d4210e3efe2440648f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3faf15/2147483647/strip/true/crop/5246x2951+0+276/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fa7%2Fbec5a5b099e6c571e1ae440da8fa%2F86901f68313141d0a1fef40c42ae389b"
    },
    {
      "author": "Elliot Spagat, Will Weissert",
      "description": "President Donald Trump says he plans to offer a “gold card” visa with a path to citizenship for $5 million, replacing a 35-year-old visa for investors. Commerce Secretary Howard Lutnick said Tuesday the Trump Gold Card would replace EB-5 visas in two weeks. EB-5s were created by Congress in 1990 to generate foreign investment and are available to people who spend about $1 million on a company that employs at least 10 people. Lutnick says the Republican president's gold card would raise the price of admission for investors and eliminate fraud. The gold card is actually a green card, or permanent legal residency.",
      "publishedAt": "2025-02-26T18:16:51Z",
      "title": "Trump sees 'a thirst' for his 'gold card' immigration visa idea",
      "url": "https://apnews.com/article/trump-gold-card-visa-million-investors-1aa4585dc053e21c7d887f1fdb9eec13",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe3d5ef/2147483647/strip/true/crop/5724x3220+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F89%2F02b5ff94141b3e76dee66e94dad8%2F2e6c4e72fe6b485ea0bbcc1324e5d92c"
    },
    {
      "author": "Zeke Miller",
      "description": "Elon Musk has taken a star turn at the first Cabinet meeting of President Donald Trump’s new term. Musk held forth in a black “Make America Great Again” campaign hat about his role as “humble tech support” for the federal government — and he laid out dire stakes if his cost-cutting efforts fail. Musk told department heads assembled around a large wooden table in the Cabinet Room that “if we don’t do this, America will go bankrupt.\" Trump is not one to easily share the spotlight, but he seemed happy to turn the top of the hour-plus meeting over to Musk for a “little summary” of what his Department of Government Efficiency has been up to, saying the team had found evidence of “horrible things” afoot in the government.",
      "publishedAt": "2025-02-26T21:05:22Z",
      "title": "Musk and his 'humble tech support' effort get star turn at Trump's Cabinet meeting",
      "url": "https://apnews.com/article/trump-elon-musk-doge-cabinet-briefing-d7c881a79a57a9014a915d815280a790",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec308eb/2147483647/strip/true/crop/4930x2773+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2Fe0%2Fa7070cc14bd8aa90cc3deef7a2b2%2Fb0de0e29a8ae49eba49f962417d70229"
    },
    {
      "author": "Samy Magdy, Melanie Lidman",
      "description": "An Israeli security official says Hamas has handed to Red Cross the bodies of four Israelis who were held hostage in Gaza. Hamas handed over the bodies late Wednesday, and Israel was set to release of hundreds of Palestinian prisoners, days before the first phase of their ceasefire will end. Israel has delayed the release of over 600 Palestinian prisoners since Saturday to protest what it called the cruel treatment of hostages during their handover by Hamas. The militant group has called the delay a “serious violation” of the ceasefire and said talks on a second phase aren’t possible until the Palestinians are freed. The handover would complete both sides’ obligations under the ceasefire’s first phase.",
      "publishedAt": "2025-02-26T07:47:50Z",
      "title": "Israeli official says Hamas has handed to Red Cross 4 bodies of Israelis held hostage in Gaza",
      "url": "https://apnews.com/article/israel-hamas-hostages-ceasefire-witkoff-494b3f97c46f17f42213f3a71375c345",
      "urlToImage": "https://dims.apnews.com/dims4/default/3ee5dbb/2147483647/strip/true/crop/4205x2365+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2F1d%2Fd3939cf0fbecc8e6c6753b390801%2F513def2fe46642a1a129ff228b52fbce"
    },
    {
      "author": null,
      "description": "Taiwan has condemned China’s military exercises after Beijing designated an area to conduct shooting drills off the self-governed island’s southwest coast. China considers the island a renegade province to be taken by force if necessary and in recent years has increased military activity around Taiwan’s waters and airspace. Taiwan’s Defense Ministry said Thursday it had detected 45 aircraft, 14 navy vessels and one ship from the Chinese military operating around Taiwan. Chinese state media reported that a senior official has called for China to take the initiative in cross-strait relations and push toward reunification.",
      "publishedAt": "2025-02-27T04:10:09Z",
      "title": "Taiwan condemns China for conducting shooting drills off its coast",
      "url": "https://apnews.com/article/taiwan-china-military-shooting-drills-e74bd7d6fc18ba8cf6780b4ca0831209",
      "urlToImage": "https://dims.apnews.com/dims4/default/09a0f0a/2147483647/strip/true/crop/3257x1832+0+101/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fd7%2F8a642101d99501493fce1caa5fa9%2Fe382138f43934409aa5cfa3441daa8de"
    },
    {
      "author": "Josh Funk, Josh Boak",
      "description": "The Trump administration believes a renewed emphasis on biosecurity can help in the battle against bird flu and ease egg prices. The Agriculture Department predicts the current record prices are going to get much worse this year. It’s also not clear how much more farmers can do to keep the virus out. Agriculture Secretary Brooke Rollins offered the first new details about her bird flu plan Wednesday. The USDA predicted this week that egg prices will soar more than 41% this year on top of the record average price of $4.95 per dozen.",
      "publishedAt": "2025-02-26T18:36:38Z",
      "title": "Egg prices could jump 41% this year, USDA says, as Trump's bird flu plan is unveiled",
      "url": "https://apnews.com/article/record-egg-prices-usda-bird-flu-virus-92e9f5fbc4e0a792be484a4aee5b9c16",
      "urlToImage": "https://dims.apnews.com/dims4/default/92bd6ea/2147483647/strip/true/crop/3000x1688+0+81/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2Fb9%2Fb6fd48b06cbab55d36dd87a2fc0a%2F2cb72ea5bd224bba884df15ce031d521"
    },
    {
      "author": "Susie Blann, Hanna Arhirova, Vasilisa Stepanenko",
      "description": "Three senior Ukrainian officials say that Ukraine and the U.S. have reached an agreement on a framework for a broad economic deal that would include the exploitation of rare earth minerals. The officials, who were familiar with the matter, spoke on condition of anonymity because they were not authorized to speak publicly. One of them said that Kyiv hopes that signing the agreement will ensure the continued flow of U.S. military support that the country urgently needs. There was no immediate response to a request for comment from the administration of U.S. President Donald Trump.",
      "publishedAt": "2025-02-25T21:29:24Z",
      "title": "Ukraine and US have agreed on a framework economic deal, Ukrainian officials say",
      "url": "https://apnews.com/article/russia-ukraine-war-economic-agreement-us-72ee2cfa720f6a42455c5425007060e6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c0e807/2147483647/strip/true/crop/8192x4608+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F0d%2F6eb6b5f0c5fef96fd09d67dc4c90%2Fe1a99fbe53af49bdae21abd1c3ea9d95"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}