{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JILL COLVIN",
      "description": "NEW YORK (AP) — Jurors in Donald Trump's hush money trial are expected to begin deliberations Wednesday after receiving instructions from the judge on the law and the factors they may consider as they strive to reach a verdict in the first criminal case against a former American president.",
      "publishedAt": "2024-05-29T04:04:18Z",
      "title": "Jury in Trump's hush money case will begin deliberations after hearing instructions from the judge",
      "url": "https://apnews.com/390f045e9e8a37f069e82576edd7a842",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bd65d95871a452ea7d6b95a29ed8d82/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "NEW YORK (AP) — Presumptive Republican nominee Donald Trump has been sitting for hours a day in a Manhattan courtroom, where his hush-money trial is nearing its end.",
      "publishedAt": "2024-05-29T04:07:56Z",
      "title": "Rallies and debates used to define campaigns. Now they're about juries and trials",
      "url": "https://apnews.com/f7982bf9c92129e4027db07e2f061371",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce77f163ac6c4b6b8ceaf5dd65823f29/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — After the International Criminal Court’s top prosecutor sought arrest warrants for Israeli Prime Minister Benjamin Netanyahu, his defense minister and top Hamas officials, the Israeli leader accused him of being one of “the great antisemites in modern times.”",
      "publishedAt": "2024-05-29T04:02:18Z",
      "title": "Netanyahu frequently makes claims of antisemitism. Critics say he's deflecting from his own problems",
      "url": "https://apnews.com/05ebd71bec931a62f58e7d5f9e93fa19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cfd8320921274bcabf944abde78436d1/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Three soldiers have been killed in Rafah, the Israeli military said Wednesday. Israeli media reported that the soldiers were killed when a booby trap exploded Tuesday, and three other soldiers were wounded.",
      "publishedAt": "2024-05-29T10:17:10Z",
      "title": "The Latest | 3 Israeli soldiers killed in Rafah booby trap explosion, media say, as offensive widens",
      "url": "https://apnews.com/c5f48e99dd5b7704df7c9b37ba6d16c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/873f4d54d725470d8dc83582c4984d56/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY, MOGOMOTSI MAGOME and FARAI MUTSAKA",
      "description": "JOHANNESBURG (AP) — South Africans voted Wednesday at schools, community centers, and in large white tents set up in open fields in an election seen as their country’s most important in 30 years.",
      "publishedAt": "2024-05-29T00:09:23Z",
      "title": "South Africans vote in a pivotal election as president says he has no doubt his ANC party will win",
      "url": "https://apnews.com/db201bc1aa21a1d986d50af1674a8e78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb11aa014ee74233b21e8d81b39ba415/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden and Vice President Kamala Harris are stepping up their reelection pitch to Black voters, a key part of their 2020 winning coalition that has shown signs of fraying.",
      "publishedAt": "2024-05-29T09:03:59Z",
      "title": "Biden, Harris to launch Black voter outreach effort amid signs of diminished support",
      "url": "https://apnews.com/0c4a7343c017f57a38c847bfc9b1316f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68334248c1d4495bad84176bfcb65437/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "PLAN DE AYALA, Mexico (AP) — At 4:30 a.m., the girls and women begin to appear in the dark streets of this rural village of Tojolabal people in southern Mexico. They walk in silence. Some are headed to grind corn to make their family’s tortillas.",
      "publishedAt": "2024-05-29T04:03:32Z",
      "title": "A woman will likely be Mexico's next president. But in some Indigenous villages, men hold the power",
      "url": "https://apnews.com/8112a9da0bf2ddb564f20bd478da4d62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc031dd258f34331a835b9aaae4fd169/1920.jpeg"
    },
    {
      "author": "LEKAN OYEKANMI and JOHN SEEWER",
      "description": "HOUSTON (AP) — Power outages remained widespread Wednesday in storm-weary Texas a day after another burst of severe weather flooded streets, uprooted trees and ripped off roofs.",
      "publishedAt": "2024-05-29T04:11:19Z",
      "title": "Weather-weary Texas battered again as powerful storm, strong winds kill 1, cause widespread damage",
      "url": "https://apnews.com/d23a5f8b3fef229b6ab619bef29721d8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70e6e21e98dc42f59a23504217f85469/1920.jpeg"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "ConocoPhillips is buying Marathon Oil in an all-stock deal valued at approximately $17.1 billion.The deal is valued at $22.5 billion when including $5.4 billion in debt.Crude prices have jumped more than 12% this year and the cost for a barrel rose above $80 this week.",
      "publishedAt": "2024-05-29T11:23:12Z",
      "title": "ConocoPhillips buying Marathon Oil for $17.1 billion in all-stock deal, plus $5.4 billion in debt",
      "url": "https://apnews.com/d5e229e53da50fa00fe88f47e83c9720",
      "urlToImage": ""
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Hopes for interest rate cuts this year by the Federal Reserve are steadily fading, with a stream of recent remarks by Fed officials underscoring their intention to keep borrowing costs high as long as needed to curb persistently elevated inflation.",
      "publishedAt": "2024-05-29T10:00:23Z",
      "title": "Inflation pressures lingering from pandemic are keeping Fed rate cuts on pause",
      "url": "https://apnews.com/aab628326f0d539c47fac53ecb5e2932",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f08b2adc0f1471086df1a4301144564/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}