{
  "articles": [
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court is allowing the Trump administration to strip legal protections from 350,000 Venezuelans, potentially exposing them to deportation. The court’s order Monday, with only one noted dissent, puts on hold a ruling from a federal judge in San Francisco that kept in place Temporary Protected Status for the Venezuelans that would have otherwise expired last month. The status allows people already in the United States to live and work legally because their native countries are deemed unsafe for return due to natural disaster or civil strife.",
      "publishedAt": "2025-05-19T16:42:50Z",
      "title": "Supreme Court allows Trump to strip protections from some Venezuelans",
      "url": "https://apnews.com/article/supreme-court-venezuelans-deportation-trump-5589f17e0ecd5d33bfb220e15720f88d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b9e9ef/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2Fb4%2F28aba2883a2a7268895fa56644b4%2Fee48c15dd5604f6281a7266388de25da"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu has acknowledged that his decision to resume aid to Gaza came from pressure from allies. In a video statement posted to social media, Netanyahu said on Monday that Israel’s allies had voiced concern about “images of hunger” and said they told the country that “with that, we will not be able to support you.” Netanyahu said the aid that would be let in would be “minimal,” without specifying precisely when it would resume. Israel on Sunday said it would resume aid deliveries into the war-battered territory after a complete halt on imports since early March.",
      "publishedAt": "2025-05-19T08:27:01Z",
      "title": "Netanyahu acknowledges pressure from allies to resume Gaza aid",
      "url": "https://apnews.com/article/mideast-wars-israel-gaza-hamas-05-19-2025-da619d393510e0dde9650adbd39cbf0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e14c831/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2Fc4%2Fd4e40bf6e70610e4055ca4ccacb4%2F6915a89551fa46caa34c99883d439425"
    },
    {
      "author": "Chris Megerian",
      "description": "The announcement that Joe Biden has prostate cancer is the latest example of how the final chapters of his political career have been shaped by the disease. One decade ago, his son Beau died from a brain tumor. Several years later, his wife Jill had two cancerous lesions removed in her own brush with the disease. Now the former president is facing his own diagnosis. Although the cancer can possibly be controlled with treatment, it is no longer curable. Biden wrote on social media that “cancer touches us all.” He had made increasing cancer research a priority for his administration.",
      "publishedAt": "2025-05-19T18:22:06Z",
      "title": "After a political career shaped by cancer, Biden faces his own grim diagnosis",
      "url": "https://apnews.com/article/joe-biden-prostate-cancer-diagnosis-e0cce67459403e192ba06aebb4db31ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/89924ea/2147483647/strip/true/crop/3858x2170+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2Fe3%2F33bdb8c8dfd1b6a6109a7f799882%2Fce80bcd0e138401f935d89e1d3ce1fc4"
    },
    {
      "author": "Dylan Lovan, Carolyn Kaster",
      "description": "Officials in Kansas and Texas are evaluating damage from overnight tornadoes just days after storms killed more than two dozen people in communities in Kentucky and Missouri. The National Weather Service says meteorologists predicted days of dangerous weather conditions across the central U.S. with heavy rains, thunderstorms and potential tornadoes. Officials in Reno County, Kansas, say a powerful tornado tore through late Sunday and damaged several homes, trees and utility poles. Officials say damage was extensive, but no injuries or deaths were reported. An official in Palo Pinto County, Texas, says they're evaluating damage there on Monday morning.",
      "publishedAt": "2025-05-19T15:34:58Z",
      "title": "Storms and tornadoes across central US kill dozens and damage homes",
      "url": "https://apnews.com/article/storms-tornadoes-kentucky-missouri-kansas-texas-c523eab4670e39455e9b8700268ed2a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/703e490/2147483647/strip/true/crop/3842x2161+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F6e%2F96709ae3d62f639bc3d072027193%2F773cc8bde6954c42ad94cbbce76eb308"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump is hoping separate phone calls with Russian leader Vladimir Putin and Ukrainian President Volodymyr Zelenskyy will make progress toward a ceasefire in the war in Ukraine. Trump expressed his hopes for a “productive day” Monday — and a ceasefire — in a social media post over the weekend. His effort will also include calls to NATO leaders. Trump has struggled to end a war that began with Russia’s invasion in 2022. That makes these conversations a serious test of his reputation as a dealmaker after having claimed he'd quickly settle the conflict once he was back in the White House, or even before he took office.",
      "publishedAt": "2025-05-19T04:01:42Z",
      "title": "Trump hopes for ceasefire progress in calls with Putin and Zelenskyy",
      "url": "https://apnews.com/article/trump-putin-zelenskyy-russia-ukraine-war-ceasefire-3ec4144fecac5d77c8bb33cc4d7018ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/03cc8c5/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5a%2Ff2%2F552e60b4fad1a60f7b08d5232f62%2F8da03f70b5d7436fb54b1f0c251cc099"
    },
    {
      "author": "Susan Haigh",
      "description": "The Mexican navy tall ship that struck the Brooklyn Bridge had departed less than 5 minutes before its masts crashed into the historic span. That's according to a timeline laid out by investigators Monday. Meanwhile, many crew members have flown home from New York. The Mexican navy says seven officers and 172 cadets who were aboard the sailing ship arrived early Monday at the port of Veracruz, where Mexico’s naval school is. Two cadets were killed in Saturday's crash while two remained in New York getting medical treatment. They were in stable condition.",
      "publishedAt": "2025-05-19T15:04:47Z",
      "title": "Radio calls asked tugs for help 45 seconds before Mexican ship hit Brooklyn Bridge, officials say",
      "url": "https://apnews.com/article/brooklyn-bridge-mexican-ship-crash-2cd92eb7cea17552d6c36be2916d2bbd",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b7aded/2147483647/strip/true/crop/5288x2975+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2Fb1%2F33d067802381fbfbdab607fbc620%2Fcff8b0fa0c0b4397a4cb861fa88b1720"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "Singer Dawn Richard has resumed her testimony in the sex trafficking and racketeering trial of Sean “Diddy” Combs, saying he threatened her with death if she told anyone that she saw the influential hip-hop promoter beat his longtime girlfriend, the singer Cassie. Prosecutors were using the testimony from Richard on Monday in Manhattan federal court to show that Combs used violence and threats to control others as he leveraged his fame to get what he wanted. He has pleaded not guilty and his lawyers say prosecutors are showing proof of domestic violence, but not the federal crimes with which he's charged.",
      "publishedAt": "2025-05-19T14:18:57Z",
      "title": "Singer Dawn Richard says Sean 'Diddy' Combs threatened her with death after she saw him beat Cassie",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-richard-cassie-8a7c96a0c48d95b9d6ac0adfddaae1a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/764487a/2147483647/strip/true/crop/4080x2295+0+389/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2F40%2Ff12b9eb06cf5cb464101ecc8fa50%2F1b1878373b054b5691309af6d2694a23"
    },
    {
      "author": "Kevin Freking, Lisa Mascaro, Leah Askarinam",
      "description": "President Donald Trump will look to build momentum for his sweeping tax cut and immigration bill, meeting with House Republicans as they try to work out their differences. Trump will attend the GOP’s weekly conference meeting on Tuesday. That's according to a White House official who spoke on condition of anonymity to discuss plans not yet made public. Republicans can afford only a few defections to get the bill through the House, and differences remain. Some deficit hawks are insisting on quicker cuts to Medicaid and green energy programs before giving their full support. Others are seeking a large increase in the state and local tax deduction.",
      "publishedAt": "2025-05-18T18:23:43Z",
      "title": "Trump looks to unite Republicans before votes on tax cut bill",
      "url": "https://apnews.com/article/republicans-tax-cuts-house-trump-johnson-border-f03b7e9cc3015ef9a0ece37b76bc5f66",
      "urlToImage": "https://dims.apnews.com/dims4/default/7203264/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F8e%2F475cf6e86656faf089cb87250ff3%2F7d9f218510ba44b19f9e37a67a539690"
    },
    {
      "author": "Schuyler Dixon",
      "description": "The fate of the tush push will be up for discussion again along with the NFL’s history of giving division champions with mediocre records home field in the playoffs. There will be a new topic as well when NFL owners gather Tuesday and Wednesday at the headquarters of the Minnesota Vikings. The league has proposed allowing its players to participate in flag football when the sport makes its Olympic debut in Los Angeles in 2028. Owners were set to vote on Philadelphia's famous tush push last month, but tabled the issue. The league also is discussing using records for playoff seeding rather than guaranteeing higher seeds for division champions.",
      "publishedAt": "2025-05-19T17:53:04Z",
      "title": "NFL owners set to discuss tush push again, along with playoff and flag football proposals",
      "url": "https://apnews.com/article/nfl-owners-meetings-playoffs-a79c1249628c41d8add8b9b2c0929051",
      "urlToImage": "https://dims.apnews.com/dims4/default/c06fb0a/2147483647/strip/true/crop/3458x1945+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fcc%2Fd7ba19c416392b08559c46401716%2F5c2d943ad7734ba6b2b8cff6ccf0352e"
    },
    {
      "author": null,
      "description": "Netflix has thrown “Sesame Street” a safety net with a new streaming deal. The deal announced Monday offers the popular children’s staple a broad reach while keeping it on its long-standing home, PBS, at the same time. Starting later this year, new episodes will run on Netflix, PBS and the PBS Kids app on the same day. No specific premiere date was immediately announced. The change for the more than 50-year-old show comes after Warner Bros. Discovery last year decided not to renew its deal for new episodes on HBO and Max. Episodes will remain there until 2027.",
      "publishedAt": "2025-05-19T15:04:10Z",
      "title": "'Sesame Street' finds a new home on Netflix",
      "url": "https://apnews.com/article/sesame-street-netflix-move-pbs-b74920f423e9790973b59735689696c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/a160859/2147483647/strip/true/crop/7304x4109+0+685/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd7%2F03%2F327893d5b0a71b489b69fcfd5c20%2Ff036471fdc5a416aa8c904fc86c91e86"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}