{
  "articles": [
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — The old Congress closed Friday and the new Congress is about to convene with one major task at hand — the election of the House speaker.",
      "publishedAt": "2025-01-03T12:03:14Z",
      "title": "Speaker Mike Johnson is trying to save his job as a new Congress convenes",
      "url": "https://apnews.com/ccbe593940ef488019563e8e4b98061e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bd08c6eb8e243b19a6fe80d13631b03/1920.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN, JOSH BOAK and MARC LEVY",
      "description": "WASHINGTON (AP) — President Joe Biden has blocked the nearly $15 billion proposed deal for Nippon Steel of Japan to purchase Pittsburgh-based U.S. Steel — affirming his earlier vow on the presidential campaign trail to prevent the acquisition of Steeltown USA’s most storied steel company.",
      "publishedAt": "2025-01-03T13:24:20Z",
      "title": "Biden blocks Nippon Steel's proposed deal to acquire US Steel",
      "url": "https://apnews.com/099564a3cddca587af0d7340e0c15ed6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1eb3e056ad74414cbdf9ad4a846d077e/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean investigators left the official residence of impeached President Yoon Suk Yeol after a near-six-hour standoff on Friday during which he defied their attempt to detain him.",
      "publishedAt": "2025-01-03T03:51:55Z",
      "title": "South Korea's impeached president defies warrant after hourslong standoff",
      "url": "https://apnews.com/c8dc1758647979455dbf0d56e70369a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1317cc951404473286d81faf5c52d262/1920.jpeg"
    },
    {
      "author": "TARA COPP, ALANNA DURKIN RICHER, COLLEEN LONG and TY ONEIL",
      "description": "LAS VEGAS (AP) — The highly decorated Army soldier inside a Tesla Cybertruck packed with fireworks that exploded outside Trump International Hotel in Las Vegas shot himself in the head just before detonation, authorities said Thursday.",
      "publishedAt": "2025-01-02T15:38:48Z",
      "title": "Soldier shot self in head before Cybertruck exploded outside Trump's Las Vegas hotel, officials say",
      "url": "https://apnews.com/5c5a8fd13a50e2bcde46370ae926d427",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09b16e6bbc0a44d39f281f1ec114b03b/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER, JIM MUSTIAN, KEVIN McGILL and JACK BROOK",
      "description": "NEW ORLEANS (AP) — Street performers and football fans returned to New Orleans streets as the city inched back toward normalcy while mourning victims of the deadly New Year's rampage in which an Army veteran plowed a pickup truck into revelers.",
      "publishedAt": "2025-01-03T05:04:03Z",
      "title": "New Orleans inches toward normalcy while mourning victims of deadly New Year’s rampage",
      "url": "https://apnews.com/88a300e2f36eaf2920ed634983d72f08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de55aaa17b944e9bb30867b57a47ef4e/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAM MEDNICK",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes killed at least 30 people in Gaza, including children, overnight and into Friday, hospital staff said, as often-stalled ceasefire talks to end the Israel-Hamas war were set to resume in Qatar.",
      "publishedAt": "2025-01-03T09:58:00Z",
      "title": "Israeli strikes kill at least 30 in Gaza as ceasefire talks set to resume in Qatar",
      "url": "https://apnews.com/1eb622d4d4dac17b9f10494107b9e136",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52c7948642ea41548f3ca0cbe5e7473a/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — As president, Jimmy Carter brokered the watershed peace agreement that removed Israel’s most powerful enemy from the battlefield.",
      "publishedAt": "2025-01-03T05:11:32Z",
      "title": "Carter's quest for Mideast peace didn't end with Camp David",
      "url": "https://apnews.com/af2fbf95bfac2c1ebb8df5a67fcbeb2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1ace3097d8640c0aa584ef1247ccf16/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — Alcohol is a leading cause of cancer, a risk that should be clearly labeled on drinks Americans consume, U.S. Surgeon General Vivek Murthy proposed on Friday.",
      "publishedAt": "2025-01-03T15:33:21Z",
      "title": "Surgeon General calls for new label on drinks to warn Americans of alcohol's cancer risk",
      "url": "https://apnews.com/e12d879108d3d6298052df0369f2e4a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0818db1b45848bd8059a6385dafa485/2957.jpeg"
    },
    {
      "author": "ANNIE RISEMBERG",
      "description": "ACCRA, Ghana (AP) — Flipping through a family album, Keachia Bowers paused on a photo of her as a baby on her father’s lap as he held the 1978 album “Africa Stand Alone” by the Jamaican reggae band Culture.",
      "publishedAt": "2025-01-03T07:17:40Z",
      "title": "Come home, Ghana told the African diaspora. Now some Black Americans take its citizenship",
      "url": "https://apnews.com/f0558892453aceb2eae1a7a6e2cb276d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cefefdc76b3482dbe1e65d3a0f19a91/1920.jpeg"
    },
    {
      "author": "JAIMIE DING and DAMIAN DOVARGANES",
      "description": "FULLERTON, Calif. (AP) — Two people died and 19 were injured Thursday when a small plane crashed through the roof of a sprawling furniture manufacturing building in Southern California where at least 200 people were working, police said.",
      "publishedAt": "2025-01-02T23:16:57Z",
      "title": "2 dead and 19 injured in Southern California plane crash",
      "url": "https://apnews.com/08ec23f1c117be7bc07fc9b8f4064f91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dad700e83563422a9baec3d21ccc188c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}