{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "President Donald Trump has signed a flurry of executive orders focused on the military, including one that directs Defense Secretary Pete Hegseth to revise the Pentagon’s policy on transgender troops, likely setting in motion a future ban on their military service.",
      "publishedAt": "2025-01-28T07:43:00Z",
      "title": "Live updates: Trump signs order that likely sets in motion a future ban on transgender troops",
      "url": "https://apnews.com/live/trump-presidency-updates-day-9",
      "urlToImage": "https://dims.apnews.com/dims4/default/79ffa22/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F26%2Fdad0f88c4a7dabe347afc677d456%2Ftrumptroops.jpg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "The youngest person to serve as White House press secretary has made her debut in the briefing room, promising to hold briefings often and saying President Donald Trump also will be available to reporters for questions. Karoline Leavitt said at the podium Tuesday podcasters and social media influencers could apply to participate in future briefings and reporters will have “access to the most transparent and accessible president in American history.\" Leavitt called on Mike Allen of Axios for the first question. It’s unclear how often the 27-year-old Leavitt plans to hold briefings. Previously, the youngest press secretary was Ronald Ziegler, who was 29 when he took the position in 1969 in Richard Nixon’s administration.",
      "publishedAt": "2025-01-28T12:01:45Z",
      "title": "Karoline Leavitt, youngest White House press secretary, makes debut in briefing room",
      "url": "https://apnews.com/article/trump-leavitt-white-house-first-press-briefing-5ba5ff116e18c29b04c934a24a8983d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fa7daa/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2Fab%2F2258fe535e6e36a7d632655db042%2Fd48972113c9b471f89502bea084446da"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "Democrats are planning to fight President Donald Trump's efforts to pause federal grants and loans. The court battle will likely begin with a lawsuit from the New York attorney general. The funding freeze is scheduled to take effect Tuesday as Trump’s administration begins an across-the-board ideological review. Administration officials said the pause is necessary to ensure that spending complies with the president's executive orders. The Republican administration's decision could affect trillions of dollars and cause widespread disruption in health care research, education programs and other initiatives. Even grants that have been awarded but not spent are supposed to be halted. It’s unclear how sweeping the pause will be.",
      "publishedAt": "2025-01-28T12:44:43Z",
      "title": "Legal battle looms as Trump orders a funding freeze during a review of federal loans and grants",
      "url": "https://apnews.com/article/donald-trump-pause-federal-grants-aid-f9948b9996c0ca971f0065fac85737ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ebb43e/2147483647/strip/true/crop/5252x2954+0+274/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2F6a%2F09123f0f5e13d9d5111301ac6cb1%2Fd6d49725e258467bbecd4048aeb09883"
    },
    {
      "author": "ZEKE MILLER",
      "description": "President Donald Trump on Tuesday signed an executive order aimed at curtailing gender transitions for people under age 19. It’s the latest push by Trump to reverse policies set by the Biden administration to protect transgender people and their care. On Monday, Trump directed the Pentagon to conduct a review that is likely to lead to them being barred from military service.",
      "publishedAt": "2025-01-28T22:14:58Z",
      "title": "Trump signs executive order aimed at curtailing gender transitions for kids",
      "url": "https://apnews.com/article/trump-transgender-transition-executive-order-301e4130233b411311978f66f455f1c4",
      "urlToImage": "https://dims.apnews.com/dims4/default/20d8972/2147483647/strip/true/crop/7830x4404+0+408/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1e%2F1f%2F7c35684d4018c6d42adb801c7639%2F2e5ff6827e3244fd9f98d364eb807266"
    },
    {
      "author": "ABDEL KAREEM HANA, WAFAA SHURAFA, SAMY MAGDY",
      "description": "More than 375,000 Palestinians have made their way back to homes in northern Gaza after 15 months on the run because of war. The Abu Jarad family returned to Beit Lahiya Monday to find that the orange, olive and palm trees that once stood in front of their house were bulldozed away. The roses and jasmine flowers were also gone. The house itself was a hollowed-out shell. But it stood. At the sight of it, Ne’man Abu Jarad; his wife, Majida; and their six daughters dropped the bags they had been lugging since dawn, fell to their knees and prayed. After 477 days of hell — fleeing the length of the Gaza Strip, hiding from bombardment, scrounging for food and water – they were finally home.",
      "publishedAt": "2025-01-28T22:14:44Z",
      "title": "This is what one family in Gaza returned home to after 15 months of war",
      "url": "https://apnews.com/article/gaza-palestinians-return-home-ceasefire-2495de01d4581b92789171cad34b7dce",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a8f7fa/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F51%2Fcf454c01443a9be35c34f513196b%2F322fd2e0c4634dbbb8b34a0e73651a72"
    },
    {
      "author": null,
      "description": "A science-oriented advocacy group says the Earth is moving closer to destruction. The Bulletin of the Atomic Scientists said Tuesday that they've moved their “Doomsday Clock” to 89 seconds to midnight, the closest it has ever been, because of worsening threats ranging from nuclear war to climate change to pandemics and artificial intelligence. The clock had stood at 90 seconds to midnight for the past two years. The advocacy group began to use a clock in 1947 to symbolize the potential and likelihood of people doing something to end humanity.",
      "publishedAt": "2025-01-28T16:37:46Z",
      "title": "'Doomsday Clock' moves closer to midnight",
      "url": "https://apnews.com/article/doomsday-clock-existential-threat-war-3aeb37b74a18d58db60d6c7ddba90fb5",
      "urlToImage": "https://dims.apnews.com/dims4/default/afef45e/2147483647/strip/true/crop/5749x3234+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2Fec%2F7d0ef1d2566e55ee60de18462741%2F24f394d6a1ae4b9f966693d15711c460"
    },
    {
      "author": "JONATHAN J. COOPER, BILL BARROW, AMELIA THOMSON DeVEAUX",
      "description": "Some of President Donald Trump's working-class and middle-class supporters see a lack of emphasis on lowering consumer costs and making daily American life more affordable. Trump's second administration has opened with a notable embrace of some of the world's wealthiest people alongside a flurry of executive actions on immigration and other topics. There's a delicate balance for the populist president. And some progressive activists say it already has exposed the billionaire Republican president's true loyalties. Arizona home construction contractor Enrique Lopez says he's struck by Trump's lack of emphasis on housing costs or consumer interests. Trump insists his overall agenda will help working- and middle-class Americans.",
      "publishedAt": "2025-01-28T17:31:06Z",
      "title": "Some Trump voters are skeptical of his embrace of billionaires",
      "url": "https://apnews.com/article/trump-working-class-billionaires-8e443e1345246911e34b8f0fe2b40da9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d0fa30/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F35%2F00f372071ffa941e21677e97fdf4%2F9482b08c1d5840a3bb29024aeeaf726b"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "As the White House paused federal grants and loans in a far-reaching executive order, early childhood education centers and states discovered Tuesday they could no longer access money they rely on to provide care for some of the nation’s neediest families and children. Staff encountered problems with Medicaid and Head Start payment websites around the country. The administration of President Donald Trump said those programs were not affected by the funding freeze and called the Medicaid problem an outage. The freeze was halted by a federal judge but the chaos showed how dependent programs serving low-income kids are on the federal government.",
      "publishedAt": "2025-01-28T22:15:50Z",
      "title": "Head Start and other services for low-income families hit glitches as Trump freezes federal money",
      "url": "https://apnews.com/article/head-start-medicaid-federal-funding-4fe440e35df70c7ede8ce8e0409cb581",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c26379/2147483647/strip/true/crop/6841x3848+0+356/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9f%2F9c%2Fc21668494d4a1dc752b443c12930%2F44ec4084dec6499f8cebc4e94014de3a"
    },
    {
      "author": "TARA COPP",
      "description": "Advocacy groups are preparing to file the first lawsuit challenging President Donald Trump’s executive order revising policy on transgender troops that likely sets the stage for their ban in the armed forces. It’s the same legal team that spent years during Trump’s first administration fighting the Republican’s ban on transgender troops before Democratic Joe Biden scrapped it when he took office. The head of the National Center for Lesbian Rights said Tuesday her group and GLAD Law are filing a challenge to Trump's executive order Tuesday in the District of Columbia. The Pentagon says it'll “fully execute” directives in the president's executive orders.",
      "publishedAt": "2025-01-28T16:30:26Z",
      "title": "Groups are ready to file the first lawsuit to challenge Trump's new order on transgender troops",
      "url": "https://apnews.com/article/transgender-troops-trump-pentagon-order-c92b17a47574d711efa11fb178ff6ae0",
      "urlToImage": "https://dims.apnews.com/dims4/default/f1c4c74/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F65%2Fda1b818957b4cb95025ad6ed6d42%2F9c6dec0e74324505b390154ae1dd38a8"
    },
    {
      "author": "DAVE COLLINS",
      "description": "Homeland Security Secretary Kristi Noem joined federal agents in New York City to announce the arrests of immigrants wanted on criminal charges. The arrests included a man accused of kidnapping who was seen on a viral video entering a Colorado apartment with reputed gang members. Noem was the latest high-ranking official from President Donald Trump’s administration to tout the president’s ramped-up immigration enforcement in a city where arrests were being made. Border czar Tom Homan and acting Deputy Attorney General Emil Bove were in Chicago on Sunday as federal agents made arrests there.",
      "publishedAt": "2025-01-28T21:39:30Z",
      "title": "Agents arrest man reportedly seen on viral video entering Colorado apartment with gang members",
      "url": "https://apnews.com/article/immigration-arrests-new-york-trump-5abbbb293ca865e539e48e3b74d8db77",
      "urlToImage": "https://dims.apnews.com/dims4/default/3036e10/2147483647/strip/true/crop/5737x3227+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2F1f%2Ffc722bbceb6c18403320c751570b%2F4f32e0915d364900abda93994863fc9e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}