{
  "articles": [
    {
      "author": "Zeke Miller, Jon Gambrell, Aamer Madhani",
      "description": "President Donald Trump is set to meet with Syrian President Ahmad al-Sharaa, in a face-to-face with the onetime insurgent leader who spent years imprisoned by U.S. forces after being captured in Iraq. The White House says Trump has agreed to “say hello” Wednesday to al-Sharaa before the U.S. leader wraps up his visit to Saudi Arabia and moves on to Qatar. Trump is also scheduled to attend a meeting of the Gulf Cooperation Council, the grouping of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, and the United Arab Emirates. He then sets off Wednesday for Qatar, the second stop in his Mideast tour. Trump will be honored with a state dinner in Qatar.",
      "publishedAt": "2025-05-14T04:01:32Z",
      "title": "Trump to meet Syria's president before heading to Qatar on his Mideast tour",
      "url": "https://apnews.com/article/trump-middle-east-syria-qatar-saudi-arabia-8bd63b3f9fc1856532a00adf1795e38f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dec3055/2147483647/strip/true/crop/2864x1611+0+149/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F39%2Fd7cbf10f9a7ec7b06e6342a87fec%2Ff8967972e51647fd82d8aa094b8e694a"
    },
    {
      "author": null,
      "description": "At least 22 children were killed in Gaza overnight Tuesday and early Wednesday in a punishing series of Israeli airstrikes on homes in northern Gaza. The strikes killed at least 48 people in total, the Indonesian Hospital in Jabaliya reported. The strikes came a day after Hamas released an Israeli-American hostage in a deal brokered by the United States, and as President Donald Trump was visiting Saudi Arabia. On Tuesday, Israeli Prime Minister Benjamin Netanyahu said there was “no way” Israel would halt its war in Gaza, dimming hopes for a ceasefire.",
      "publishedAt": "2025-05-14T07:18:11Z",
      "title": "Israeli airstrikes in Gaza kill 48 people, including 22 children, hospitals say",
      "url": "https://apnews.com/article/mideast-wars-israel-hamas-gaza-05-14-2025-bc5c95bdcf4106da61dda4fff762e5fe",
      "urlToImage": "https://dims.apnews.com/dims4/default/538c79c/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Ff3%2F08b24d635facd2fc7d35ae745505%2Ffe43995e54974c46b5b805b8baa0a8e5"
    },
    {
      "author": "Zeke Miller, Jon Gambrell, Aamer Madhani",
      "description": "President Donald Trump is set to meet with Syrian President Ahmad al-Sharaa, the onetime insurgent who last year led the overthrow of longtime autocrat Bashar Assad. Wednesday's meeting will come a day after Trump announced his plan to ease sanctions on Syria and normalize relations with its new government to give Syria “a chance at peace” under al-Sharaa. The former insurgent had been imprisoned in Iraq for his role in the insurgency following the 2003 U.S.-led invasion of the Arab country. He was named president of Syria in January, a month after a stunning offensive by insurgent groups led by al-Sharaa’s Hayat Tahrir al-Sham, or HTS, that stormed Damascus, ending the 54-year rule of the Assad family.",
      "publishedAt": "2025-05-14T06:25:25Z",
      "title": "Trump to meet Syria's new leader in Saudi Arabia",
      "url": "https://apnews.com/article/trump-syria-saudi-arabia-sharaa-assad-sanctions-bb208f25cfedecd6446fd1626012c0fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Steve Peoples, Linley Sanders",
      "description": "A new poll finds Democrats are deeply pessimistic about the future of their party. And neither the Democratic Party nor the Republican Party is viewed favorably by the majority of U.S. adults. The Associated Press-NORC Center for Public Affairs Research poll finds only about one-third of Democrats are “very optimistic” or even “somewhat optimistic” about their party’s future. The level of optimism is down sharply from July 2024, when about 6 in 10 Democrats had a positive outlook. The poll comes at a critical moment for the Democratic Party, which is desperately seeking momentum after losing the White House and both chambers of Congress last fall.",
      "publishedAt": "2025-05-14T11:24:52Z",
      "title": "AP-NORC Poll: Democrats' optimism about party's future drops sharply",
      "url": "https://apnews.com/article/poll-democrats-pessimism-sanders-ocasio-cortez-schumer-8dcde90d9666721fb376db90140f8e23",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7fae34/2147483647/strip/true/crop/5704x3209+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2Fc0%2F0d12884267885b7a74e570d99889%2F1b5f322db9b24bb8b6ed670c4b185fa4"
    },
    {
      "author": "Amanda Seitz",
      "description": "Robert F. Kennedy Jr. is making his first appearance as health secretary before the powerful Senate health committee. Kennedy is expected to face intense scrutiny Wednesday about the thousands of jobs he’s eliminated at the Department of Health and Human Services, the steep cuts he’s made to vaccination campaigns and his response to a measles outbreak that’s sickened 1,000 people. Kennedy will speak about the agency’s budget request for the year, which includes a $500 million boost for his “Make America Healthy Again” initiative to promote nutrition and healthier lifestyles. The proposed budget also makes deep cuts, including to infectious disease prevention, maternal health and preschool programs.",
      "publishedAt": "2025-05-14T10:55:33Z",
      "title": "What to expect at RFK Jr.'s first Senate hearing as health secretary",
      "url": "https://apnews.com/article/rfk-jr-hhs-senate-vaccines-layoffs-measles-8c99853031507ecb5408b4132329cdea",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e6769b/2147483647/strip/true/crop/5788x3256+0+302/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F45%2F1e05de176b3be34ec8ef9143076a%2F5a6c80f910ad4aa5abf5fdbb9a396740"
    },
    {
      "author": "Dasha Litvinova",
      "description": "The talks took place in the warring capitals of Moscow and Kyiv, from Washington and Riyadh, Saudi Arabia, to countries across Europe. Now, all eyes are finally turning back to Istanbul to seek an end to Russia’s 3-year-old, full-scale invasion of Ukraine. Russian President Vladimir Putin proposed restarting direct peace talks with Ukraine in the Turkish city that straddles Asia and Europe on Thursday – and President Volodymyr Zelenskyy challenged him to meet in Turkey in person. What will take place remains unclear. The Kremlin has refused to confirm who it will send to Turkey and whether Putin personally will go. Ukrainian presidential adviser Mykhailo Podolyak said Zelenskyy will only sit down with the Russian leader.",
      "publishedAt": "2025-05-14T04:05:42Z",
      "title": "What to know about possible Russia-Ukraine peace talks in Turkey",
      "url": "https://apnews.com/article/russia-ukraine-war-istanbul-peace-talks-putin-54e7e2b93df0c53712f1b8ce7248e824",
      "urlToImage": "https://dims.apnews.com/dims4/default/9624ddc/2147483647/strip/true/crop/7000x3937+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F61%2Fb083ad49105e502b344fcfa7142b%2F3562437d6b894e5e8a45b8e9d97d413a"
    },
    {
      "author": "Jaimie Ding",
      "description": "A Los Angeles judge is listening to arguments this week over whether Erik and Lyle Menendez should receive reduced sentences. The brothers have spent more than 30 years in prison for killing their parents at their Beverly Hills home in 1989. Their attorneys are expected to argue over the course of a two-day hearing starting Tuesday that the brothers have been rehabilitated in prison, and they have the support of their extended family. Prosecutors have said they oppose resentencing because the brothers have not admitted to lies told during their trial about why they killed their parents.",
      "publishedAt": "2025-05-13T04:05:02Z",
      "title": "LA judge to decide whether the Menendez brothers should be freed",
      "url": "https://apnews.com/article/menendez-brothers-resentencing-freedom-murder-95d642ef10b6d726d84c6f02a20a378c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e0b0f7b/2147483647/strip/true/crop/3021x1699+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fba%2F9e740e705ad91ac99653607675f3%2F2d6111198cb54fe4ab3accf920bcc1bd"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "The R&B singer Cassie is set to continue testifying Wednesday against her ex-boyfriend Sean “Diddy” Combs in his sex trafficking trial, a day after taking the witness stand to detail what she says was years of grotesque sexual and physical abuse. Cassie spent about five hours on the witness stand Wednesday. Combs is accused of exploiting his status as a powerful music executive to coerce women including Cassie into drugged-up sex parties he called “freak offs.” He has pleaded not guilty. His lawyers say all sexual acts were consensual.",
      "publishedAt": "2025-05-14T04:02:55Z",
      "title": "Cassie due back for 2nd day of testimony in Sean 'Diddy' Combs' trial",
      "url": "https://apnews.com/article/diddy-sex-trafficking-freak-offs-cassie-b2bb8f6d7017b1ebc227c49b44f86d6a",
      "urlToImage": "https://dims.apnews.com/dims4/default/deb7c37/2147483647/strip/true/crop/3872x2178+0+11/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fc7%2Fa896760638f8637dd3703d090966%2Ffde0b54fcc7147ad88d825532de42341"
    },
    {
      "author": null,
      "description": "Mexico’s government has confirmed reports that 17 family members of the son of a former cartel leader crossed into the United States. Mexican Security Secretary Omar García Harfuch said Tuesday that it appeared to be part of a deal between the Sinaloa Cartel's Ovidio Guzmán López and the Trump administration. Independent journalist Luis Chaparro reported over the weekend about Guzmán's relatives. The family flew from Sinaloa to Tijuana and crossed on foot to San Diego, California. Guzmán López is a son of former Sinaloa Cartel leader Joaquín “El Chapo” Guzmán.",
      "publishedAt": "2025-05-13T22:07:45Z",
      "title": "Mexican security chief confirms cartel family members entered US in a deal with Trump administration",
      "url": "https://apnews.com/article/el-chapo-sinaloa-cartel-trump-border-harfuch-86572a31c88a216da7cd5f33006a0011",
      "urlToImage": "https://dims.apnews.com/dims4/default/2714bc2/2147483647/strip/true/crop/4529x2548+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2Fef%2F5f4dee8bd6971481b0d8fdf35394%2Fef27c158f5b343969f6a00173adb381b"
    },
    {
      "author": null,
      "description": "Three years after Tom Cruise and “Top Gun: Maverick” flew into the Cannes Film Festival, he’s coming back Wednesday to the Croisette with “Mission: Impossible — The Final Reckoning.” Christopher McQuarrie’s latest “Mission: Impossible” installment is the biggest Hollywood tentpole wading ashore in Cannes this year, which will only magnify the spotlight on Cruise’s Cannes return. In 2022, Cruise received an honorary Palme d’Or from the festival and the “Top Gun: Maverick” premiere included an impressively timed jet fly over. Whether the 62-year-old Cruise has anything up his sleeve this time will be much anticipated at Cannes. On Sunday, Cruise climbed atop the roof of the British Film Institute in London.",
      "publishedAt": "2025-05-14T04:08:44Z",
      "title": "Tom Cruise returns to Cannes with 'Mission: Impossible — The Final Reckoning'",
      "url": "https://apnews.com/article/cannes-mission-impossible-tom-cruise-f95b5b7adc4f9b6dea622723934fa24c",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ac79f0/2147483647/strip/true/crop/7411x4169+0+387/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2Fe2%2F414b03f19cdd81ed7df5bb9604cc%2F5419aa3fbb8646ee94373cc06525b5e9"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}