{
  "articles": [
    {
      "author": null,
      "description": "Israel says it has launched a new military operation in the Gaza Strip to pressure Hamas to release the remaining hostages. Israel’s defense minister said Saturday that Operation Gideon Chariots began and is being led with “great force” by Israel’s army. The announcement comes after days of intensive strikes across Gaza that killed hundreds of people. Israel’s Prime Minister Benjamin Netanyahu vowed earlier in the week to escalate pressure on Hamas with the aim of destroying the militant group that has ruled Gaza for nearly two decades.",
      "publishedAt": "2025-05-17T11:52:46Z",
      "title": "Israel launches a new military operation in Gaza to pressure Hamas to release hostages",
      "url": "https://apnews.com/article/mideast-wars-israel-gaza-hamas-hostages-05-17-2025-baec52efaea911bf56f8ec25758b7011",
      "urlToImage": "https://dims.apnews.com/dims4/default/d130dc5/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F04%2F951d7b7f28998ece5db1526d8886%2Fc9f69b0fbdcb4706b80c121a597b9b56"
    },
    {
      "author": "Volodymyr Yurchuk, Hanna Arhirova",
      "description": "A Russian drone has struck a passenger bus in Ukraine’s northeastern Sumy region, killing nine people and injuring four others. Ukrainian officials said the attack happened on Saturday, just hours after Moscow and Kyiv held their first direct peace talks in years which failed to yield a ceasefire. The Sumy regional administration said in a post on the Telegram messaging app that “this is another war crime by Russia — a deliberate strike on civilian transport that posed no threat.” The peace talks ended after less than two hours on Friday, with both sides agreeing on a large prisoner swap while a ceasefire remained elusive.",
      "publishedAt": "2025-05-17T06:50:56Z",
      "title": "Russian drone strike kills 9 people in Ukraine, officials say",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-strike-sumy-e90d68ea2ef45f329a4cda16e200c141",
      "urlToImage": "https://dims.apnews.com/dims4/default/ccc0fa4/2147483647/strip/true/crop/4771x2684+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F41%2F753e359785c8611482f2987c1239%2F7e27a55f093f4772993eb1c541e59731"
    },
    {
      "author": "Corey Williams",
      "description": "As a punishing heat wave takes hold of Texas, weather forecasters are warning that severe storms with hail and even hurricane-force winds could hobble parts of Appalachia and the Midwest. Tornadoes were also a risk for Friday. The National Weather Service said severe weather was likely across parts of the central Appalachians and the Mid-Atlantic states. Residents in Kentucky, southern Indiana, southern Illinois and parts of Tennessee, Missouri, Arkansas and Ohio should brace for intense storms that could include baseball-sized hail.",
      "publishedAt": "2025-05-16T14:57:30Z",
      "title": "Forecasters warn severe storms, hail and high winds could hobble parts of Appalachia and Midwest",
      "url": "https://apnews.com/article/tornado-weather-thunderstorms-great-lakes-22395202a65b0c37cc06c541ea772172",
      "urlToImage": "https://dims.apnews.com/dims4/default/b395bc4/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F28%2Fb2cfb0f20689406b3f24ba245490%2F70703d337c5840db9f1de0dd0d08fb09"
    },
    {
      "author": null,
      "description": "Iran’s president says his country will continue talks over its rapidly advancing nuclear program but will not withdraw from its rights because of U.S. threats. In a speech to navy officials broadcast Saturday, President Masoud Pezeshkian says, “We are negotiating and we will negotiate, we are not after war but we do not fear any threat.” President Donald Trump has repeatedly threatened to unleash airstrikes targeting Iran’s program if a deal isn’t reached. A major sticking point in the negotiations remains Iran’s enrichment of uranium, which Tehran insists it must be allowed to do and the Trump administration increasingly insists the Islamic Republic must give up.",
      "publishedAt": "2025-05-17T09:03:44Z",
      "title": "Iran says it will continue nuclear talks with the US, shrugging off Trump's threats",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-trump-threats-8cb0f5c4f36e305b6448edb5fcc8e6a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/a866d10/2147483647/strip/true/crop/2550x1434+0+133/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2Fdc%2F6b0eff7752f9d51f154040f14a87%2F6c725bbbd3e44524aec03356d1549d6b"
    },
    {
      "author": "Matt Brown, Leah Askarinam",
      "description": "House Republicans are in the final rounds of negotiations over a sweeping budget plan that has been significantly influenced by President Donald Trump's priorities. Many GOP lawmakers expect the bill will only make it through the finish line if Trump personally weighs with members. It is not unusual in the modern era for a president to direct the legislative priorities in Congress, but many House Republicans see Trump’s role as singular and decisive as they aim to pass the bill before Memorial Day.",
      "publishedAt": "2025-05-17T04:05:38Z",
      "title": "Republicans forge their tax bill in Trump's image",
      "url": "https://apnews.com/article/trump-big-beautiful-bill-tax-cuts-medicaid-42f594eb6f1b99373ed1093515088076",
      "urlToImage": "https://dims.apnews.com/dims4/default/f756479/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F0e%2F7cde487126e3ae0510c17c5b79f9%2F0d3da90a193e4689ad3345084c51429e"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court has rejected the Trump administration’s appeal to quickly resume deportations of Venezuelans under an 18th century wartime law. Over two dissenting votes, the justices acted Friday on an emergency appeal from lawyers for Venezuelan men who have been accused of being gang members. The administration says that designation makes them eligible for rapid removal from the United States under the Alien Enemies Act of 1798. The high court had already called a temporary halt to the deportations from a north Texas detention facility in a middle-of-the-night order issued last month. Justices Samuel Alito and Clarence Thomas dissented.",
      "publishedAt": "2025-05-16T20:05:49Z",
      "title": "Supreme Court rejects Trump bid to resume quick deportations of Venezuelans under 18th century law",
      "url": "https://apnews.com/article/trump-supreme-court-venezuelans-deportations-c1dc29a89faa173593f5d42b62aa8276",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee92b39/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F6b%2F55a3f63410f5534ed4cb72f35b25%2F2469e2cdc3704cb18ed25331aec37954"
    },
    {
      "author": "Joshua Goodman, Jim Mustian",
      "description": "A fugitive known as Colombia's “Contraband King” corrupted agents in the U.S. Drug Enforcement Administration with expensive trips, fine dining and even prostitutes. That's according to an Associated Press investigation based on a trove of highly sensitive Justice Department files. The records show the DEA claimed Diego Marín was a top target, even as agents partied with him around the world. One agent helped Marín launder money as his business flourished into an empire generating up to $100 million a year, according to the Internal Revenue Service. Marín's lawyers declined to comment. The DEA did not respond to comment requests.",
      "publishedAt": "2025-05-17T04:03:32Z",
      "title": "An alleged smuggler to Colombia's cartels had a secret ally: the DEA",
      "url": "https://apnews.com/article/dea-smuggler-colombia-cartel-informant-diego-marin-a12b6afe858dfc1f9448e4be91415f61",
      "urlToImage": "https://dims.apnews.com/dims4/default/5facbfe/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F30%2Fcab670543e4af4f8d9ff6582b64b%2Fd04e2027f9ee4c0aaa1a7d6d58e87827"
    },
    {
      "author": null,
      "description": "Testimony in the Sean “Diddy” Combs sex trafficking trial has opened a window into what prosecutors say was the sordid world of group sex, drugs and violence beneath his glittering, jet-set persona. Much of the testimony that began on Monday was hard to watch. Combs ex-girlfriend, Cassie, recounted being beaten and pressured into degrading sexual performances with strangers. A lawyer for the Bad Boy Records founder conceded Combs was a jerk and a swinger prone to violence, but argued he wasn't a sex trafficker.",
      "publishedAt": "2025-05-17T04:11:43Z",
      "title": "Key moments from first week of Sean ‘Diddy’ Combs’ sex trafficking trial",
      "url": "https://apnews.com/article/combs-diddy-cassie-freak-offs-sex-trial-afa3c282e1482406783af679b88a78e4",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a7dd2b/2147483647/strip/true/crop/512x288+0+48/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F78%2Feba14378c78f40c8ca244f418f23%2F65c97abd995443cc8781d48b5e643605"
    },
    {
      "author": null,
      "description": "Orleans Parish Sheriff Susan Hutson says there are indications that the ten inmates who escaped from a New Orleans jail received help in their escape from people in the department. Authorities first noticed the 10 inmates were missing during a Friday morning headcount. One of the inmates was captured Friday after a brief foot chase through the French Quarter, the Louisiana State Police said in a post on the social media platform X.",
      "publishedAt": "2025-05-16T18:05:54Z",
      "title": "Sheriff says there are indications 10 inmates who escaped New Orleans jail had inside help",
      "url": "https://apnews.com/article/new-orleans-inmates-escape-0f96f173a3ded57b4b23f9a07b6cffac",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ae8582/2147483647/strip/true/crop/3000x1688+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F06%2F685cbd1144b89f063e1307a16940%2Fa2151771de3948e28bac22795e3c58a8"
    },
    {
      "author": "Brian Mahoney",
      "description": "The New York Knicks nearly ended their lengthy Eastern Conference finals drought last year, only to lose on their home floor to the Indiana Pacers in Game 7 of the second round. With two new starters and much better health, the Knicks finally made it this season for the first time in 25 years. The opponent will be those same Pacers, who return to Madison Square Garden for a series that begins Wednesday night. The Knicks got there by routing the Boston Celtics 119-81 on Friday night in Game 6.",
      "publishedAt": "2025-05-17T10:00:08Z",
      "title": "Finally back in Eastern Conference finals, Knicks face Pacers team that eliminated them last year",
      "url": "https://apnews.com/article/knicks-nba-playoffs-pacers-east-finals-5d6a334399acdd61ec87cc964f8622a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/f29bff0/2147483647/strip/true/crop/4311x2425+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2F73%2F520754d99a82347911ae2e6b18c7%2F348fba70bacc41ae80a3bf7c6f17f072"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}