{
  "articles": [
    {
      "author": "MOHAMMAD JAHJOUH and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israeli strikes on the southern Gaza city of Rafah overnight killed 18 people, including 14 children, health officials said Sunday, as the United States was on track to approve billions of dollars of additional military aid to its close ally.",
      "publishedAt": "2024-04-21T07:19:40Z",
      "title": "Israeli strikes on southern Gaza city of Rafah kill 18, mostly children, as US advances aid package",
      "url": "https://apnews.com/8c027f2587c2c433d0fde41b63a0e0c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2631431eabe4fc6b08688fb1720f90c/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Ukrainian and Western leaders welcomed a desperately needed aid package passed by the U.S.",
      "publishedAt": "2024-04-21T08:57:20Z",
      "title": "Ukrainian and Western leaders laud US aid package while the Kremlin warns of 'further ruin'",
      "url": "https://apnews.com/1138337200942ca738ffc28bfc289570",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7a63982c1be43d09b97bb8d2273eeff/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump’s hush money criminal trial shifts to opening statements Monday, followed by the start of witness testimony. A jury of seven men and five women, plus six alternates, was picked last week.",
      "publishedAt": "2024-04-21T03:30:53Z",
      "title": "Key players: Who's who at Donald Trump’s hush money criminal trial",
      "url": "https://apnews.com/5fdc819697a76536ed83cbf28d4a523c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ec5d86bb58941a3912d2dc94fcb592d/1920.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — As the sun sets, a burly man bellows into a megaphone while a curious crowd gathers around him. Next to him is a small cardboard box with several banknotes worth 10 Haitian gourdes — about 7 U.S.",
      "publishedAt": "2024-04-21T06:11:17Z",
      "title": "Haitians scramble to survive, seeking food, water and safety as gang violence chokes the capital",
      "url": "https://apnews.com/418c2a9fa54ea42c4d980917e146be3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ce63f0541204a90918e5ffbbafa78fb/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — As President Joe Biden and Donald Trump step up their campaigning in swing states, a quieter battle is taking place in the shadows of their White House rematch.The Republican National Committee, newly reconstituted under Trump, has filed election-related lawsuits in nearly half the states.",
      "publishedAt": "2024-04-21T11:21:15Z",
      "title": "Crush of lawsuits over voting in multiple states creates a shadow war for the 2024 election",
      "url": "https://apnews.com/c7d8943dcac776103d948532f62f2a5c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8069dfe750094971b61547771782303b/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Rarely a day goes without President Joe Biden mentioning insulin prices. He promotes a $35 price cap for the medication for Americans on Medicare — in White House speeches, campaign stops and even at non-health care events around the country.",
      "publishedAt": "2024-04-21T11:41:59Z",
      "title": "Biden sees a $35 price cap for insulin as a pivotal campaign issue. It’s not that clear-cut",
      "url": "https://apnews.com/f969191c3c5178c91cc973a1b89c2200",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03c9b687f8b94ceaa93f26914e351604/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — A single mother of two, Amy Chadwick spent years scrimping and saving to buy a house in the town of Lahaina on the Hawaiian island of Maui. But after a devastating fire leveled Lahaina in August and reduced Chadwick's home to white dust, the cheapest rental she could find for her family and dogs cost $10,000 a month.",
      "publishedAt": "2024-04-21T05:21:39Z",
      "title": "Hawaii lawmakers take aim at vacation rentals after Lahaina wildfire amplifies Maui housing crisis",
      "url": "https://apnews.com/3a7468c75cc9814a7895e03c623e400b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07cf4734e0a64ae89347cdbc16d8f05c/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and ALMUDENA CALATRAVA",
      "description": "ROSARIO, Argentina (AP) — The order to kill came from inside a federal prison near Argentina's capital. Unwitting authorities patched a call from drug traffickers tied to one of the country's most notorious gangs to collaborators on the outside.",
      "publishedAt": "2024-04-21T05:02:35Z",
      "title": "Unprecedented wave of narco-violence stuns Argentina city",
      "url": "https://apnews.com/33c910bbfbf1f97e68c18fa1ce0033cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65b029f8ed15408481b1a5b0e9458e1d/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — Ecuadorians head to the polls Sunday in a referendum touted by the country's fledgling leader as a way to crack down on criminal gangs behind a spiraling wave of violence.",
      "publishedAt": "2024-04-21T04:11:14Z",
      "title": "Ecuadorians head to polls to toughen fight against gangs behind wave of violence",
      "url": "https://apnews.com/85cf4190ba1bdd6028ff78180340499f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc2affd18af14525b7f711b3b3f72701/3000.jpeg"
    },
    {
      "author": null,
      "description": "BERLIN TOWNSHIP, Mich. (AP) — A young brother and sister died and several people were injured, some of them seriously, when a vehicle driven by a suspected drunken driver crashed into a young child's birthday party Saturday at a boat club, a Michigan sheriff said.",
      "publishedAt": "2024-04-21T00:03:42Z",
      "title": "Young brother and sister dead, several hurt when vehicle crashes into Michigan birthday party",
      "url": "https://apnews.com/5932669f804165ca86946a5b31ef6a96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78d2f834e971414eac88af8fc192d925/2511.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}