{
  "articles": [
    {
      "author": "Ty ONeil",
      "description": "Authorities investigating the apparent kidnapping of the mother of “Today” show host Savannah Guthrie have returned to the 84-year-old's Arizona neighborhood several times over the weekend. There’s still no word on whether Nancy Guthrie is alive, and authorities say they have no suspects connected to the case. Her purported abductors sent ransom notes with a Monday deadline demanding money for her return. Savannah Guthrie says the family is prepared to pay. Investigators say they believe Nancy Guthrie was taken from her home against her will on Jan. 31, and there are growing concerns about her health because she needs daily medication.",
      "publishedAt": "2026-02-09T15:50:14Z",
      "title": "Nancy Guthrie search moves into a second week as ransom deadline nears",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-ransom-deadline-arizona-3977f842fd3d1fd66952d1d763944b9d",
      "urlToImage": "https://dims.apnews.com/dims4/default/95ef6d9/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F1d%2F8d80289c3928906eb2612009c4a4%2Fbba86996fd22457fb42ee36510a1ff48"
    },
    {
      "author": "Mary Clare Jalonick, Kevin Freking, Seung Min Kim",
      "description": "Democratic leaders say a proposal from the White House is “incomplete and insufficient” as they are demanding new restrictions on President Donald Trump’s immigration crackdown and threatening a shutdown of the Homeland Security Department. Senate Democratic leader Chuck Schumer and House Democratic leader Hakeem Jeffries said in a statement late Monday that a White House counterproposal to the list of demands they transmitted over the weekend “included neither details nor legislative text” and does not address “the concerns Americans have about ICE’s lawless conduct.” The White House proposal was not released publicly.",
      "publishedAt": "2026-02-10T05:02:02Z",
      "title": "Democrats say White House offer on ICE 'insufficient' as funds deadline looms",
      "url": "https://apnews.com/article/democrats-ice-white-house-homeland-security-funding-84d4b2e5a7123f2b316cca4857b7762a",
      "urlToImage": "https://dims.apnews.com/dims4/default/7be6cd0/2147483647/strip/true/crop/3212x2140+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2Fc7%2Ffc09ae73a40795864afc9e5627b6%2Fdb72da265c09489893106e222fddc4b8"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy, Sam Metz",
      "description": "Israeli military strikes on Monday killed three people west of Gaza City, according to the hospital where the casualties arrived. Shifa hospital reported the deaths amid the months-old ceasefire that’s seen continued fighting. The Israeli army said Monday it is striking targets in response to an Israeli troops coming under fire in Rafah, which it says was a violation of the ceasefire. The army said it is striking targets “in a precise manner” and will put out a statement when it is finished.",
      "publishedAt": "2026-02-09T20:38:49Z",
      "title": "Israeli strikes kill 3 in Gaza, Shifa hospital says",
      "url": "https://apnews.com/article/gaza-hamas-israel-war-2-9-2026-e89f17f49a9dde63f7fd9658442b85f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/5da4f44/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2F4c%2Fb1405377128bb3486b459a846b1b%2F08f28112d50f41c09c8e9bf2e88e3eef"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iranian security official Ali Larijani is traveling to Oman, the country currently mediating talks between Tehran and the United States over Iran's nuclear program. Larijani will likely deliver Iran's response Tuesday to recent indirect talks held in Muscat. He is expected to meet with Omani Foreign Minister Badr al-Busaidi and Sultan Haitham bin Tariq. The talks are described as \"important,\" though details remain unclear. The U.S. has increased its military presence in the Middle East, including sending the aircraft carrier USS Abraham Lincoln, to pressure Iran into an agreement.",
      "publishedAt": "2026-02-10T02:22:08Z",
      "title": "Top Iran security official to travel to Oman, site of US talks",
      "url": "https://apnews.com/article/iran-oman-us-nuclear-talks-protests-crackdown-50cc3b6261bfd90ebe01da64ba9576d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee0092c/2147483647/strip/true/crop/7259x4837+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Fa6%2F58be052657abeb27b367235454a7%2Ff173668a687649b2b5506e358222dc3b"
    },
    {
      "author": "Kaitlyn Huamani, Barbara Ortutay",
      "description": "The world’s biggest social media companies face several landmark trials this year that seek to hold them responsible for harms to children who use their platforms. Opening statements for a trial in Los Angeles County Superior Court began on Monday. Instagram parent company Meta and Google’s YouTube will face claims that their platforms deliberately addict and harm children. TikTok and Snap, which were originally named in the lawsuit, settled for undisclosed sums. The companies will argue their case before a jury, and the outcome could have profound effects on their businesses and how they will handle children using their platforms.",
      "publishedAt": "2026-02-10T06:00:06Z",
      "title": "Lawyer likens social media platforms to addictive drugs in opening comments in landmark trial",
      "url": "https://apnews.com/article/meta-youtube-addiction-design-trial-e95054a356d73ca66736d42234013012",
      "urlToImage": "https://dims.apnews.com/dims4/default/359b785/2147483647/strip/true/crop/6362x4239+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F3f%2F426dc48e71339c47d349ebbf7db8%2F0756b1832a88491585f86e6574ec8f6c"
    },
    {
      "author": "Charlotte Graham-McLay",
      "description": "Brenton Tarrant, the white supremacist who murdered 51 Muslims in New Zealand's deadliest mass shooting, wanted to be described as a terrorist and always intended to admit to his crimes, his former lawyer says. The Australian man was sentenced to life without parole for terrorism, murder, and attempted murder after the 2019 Christchurch mosque attacks. Tarrant claims solitary confinement and harsh prison conditions made him mentally unfit to plead guilty. His former lawyers say they didn't believe his prison conditions affected his decisions. New Zealand’s Court of Appeal is considering his case. The judges will release their decision later.",
      "publishedAt": "2026-02-10T02:27:20Z",
      "title": "New Zealand mosque shooter glad to be known as a terrorist, former lawyer says",
      "url": "https://apnews.com/article/brenton-tarrant-appeal-christchurch-mosque-shooting-zealand-76edcc23c05cb0cb6ed95715287ec35f",
      "urlToImage": "https://dims.apnews.com/dims4/default/3797258/2147483647/strip/true/crop/1576x1050+210+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F0d%2F69f1fc937ccd2453283f5823652e%2F5e17c55a3aa74706aafca00aaf33b20b"
    },
    {
      "author": "Yuri Kageyama",
      "description": "Asian shares are mostly higher as Japan’s benchmark topped new highs after a historic election win for the nation’s first female prime minister. Tokyo's benchmark Nikkei 225 jumped on Tuesday, having set records the day before with a 3.9% advance after Prime Minister Sanae Takaichi's ruling Liberal Democrats scored a landslide victory in a parliamentary election. Shares slipped in Australia but rose in South Korea and China. U.S. stocks finished higher. The S&P 500, rising 0.5%, pulled closer to its all-time high set two weeks ago. The Dow Jones Industrial Average edged up by less than 0.1%. The Nasdaq gained 0.9%.",
      "publishedAt": "2026-02-10T03:36:21Z",
      "title": "Asian shares climb, led by post-election rally in Japan",
      "url": "https://apnews.com/article/stock-markets-inflation-tariffs-jobs-483d72163e6a4e21c61b8a8b1b2f3821",
      "urlToImage": "https://dims.apnews.com/dims4/default/98b9e5c/2147483647/strip/true/crop/8000x5331+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F8b%2F55e33bb1f38e2c056277b9f4afca%2F0afd8e1d52e048febbda47d7e3cc0549"
    },
    {
      "author": "Sam Mednick",
      "description": "Many Palestinians in the occupied West Bank are struggling to get by after losing their permits to work inside Israel. Israel revoked around 100,000 permits after Hamas’ Oct. 7, 2023, attack ignited the war in the Gaza Strip. Confined to the West Bank, where jobs are scarce and wages far lower, some Palestinians have sold their belongings or gone into debt. Others have paid steep fees for black-market permits or tried to sneak into Israel, risking arrest or worse. Israel, which has controlled the West Bank for nearly six decades, says it is under no obligation to allow Palestinians to enter for work and says it revoked the permits because of security considerations.",
      "publishedAt": "2026-02-10T05:22:49Z",
      "title": "Palestinians struggle in West Bank as Israel limits work permits",
      "url": "https://apnews.com/article/israel-palestinians-west-bank-economy-crisis-fb15ea54fca3f246b5906918f8a7842e",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f68d42/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2Fe0%2Fe7af36416fef215cb533e605854b%2Fd385e05a990b4375bb185353beef128e"
    },
    {
      "author": null,
      "description": "Federal authorities have denied attempting to expedite an end to asylum claims for the family of a 5-year-old boy who was detained with his father during the immigration crackdown that has shaken the Minneapolis area. Images of Liam Conejo Ramos wearing a bunny hat and Spider-Man backpack surrounded by immigration officers stirred outrage over the crackdown. Danielle Molliver, a lawyer for the boy and his father, told the New York Times that the government’s attempts to expedite the deportation proceedings “extraordinary” and possibly “retaliatory.\" The government denied targeting the family, with Homeland Security official Tricia McLaughlin saying “these are regular removal proceedings.”",
      "publishedAt": "2026-02-09T15:55:06Z",
      "title": "Officials deny seeking end to asylum claims for family of 5-year-old Liam Conejo Ramos",
      "url": "https://apnews.com/article/minnesota-immigration-liam-conejo-ramos-bc2bfa67e73dc73ba3f391d109e7597c",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e96805/2147483647/strip/true/crop/1536x1023+0+41/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F6c%2F193a4103f7ee7d6419da6c99b451%2F8639462d3c80406883929c3a8c3628b1"
    },
    {
      "author": "Kanis Leung",
      "description": "A massive fire in Hong Kong last November killed 168 people, devastating a tight-knit community. Residents displaced by the blaze remain uncertain whether they can visit their burnt apartments or when they can secure permanent housing. Authorities blamed substandard materials for the rapid spread of the fire and are still investigating. Many victims are in temporary housing and long for answers. Others mourn lost loved ones and seek transparency from officials. As the Lunar New Year approaches, families face difficult decisions about resettlement and the loss of cherished memories.",
      "publishedAt": "2026-02-09T23:00:35Z",
      "title": "Hong Kong survivors of fire at Wang Fuk Court await resettlement plans",
      "url": "https://apnews.com/article/hong-kong-resettlement-fire-tai-po-2caedfdaee6f9460351e257cdcaeef1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/303de7a/2147483647/strip/true/crop/4500x2998+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2Feb%2Fe1b420880cd4606ad01f8177fc5f%2F7cba83e00a1a4eb49c26ee146aec9e21"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}