{
  "articles": [
    {
      "author": "STEVE PEOPLES, WILL WEISSERT and JOEY CAPPELLETTI",
      "description": "WASHINGTON (AP) — Bernie Sanders describes President Joe Biden's recent debate performance as “painful.” In an interview, he says he's not confident that Biden can win this fall.",
      "publishedAt": "2024-07-02T18:11:47Z",
      "title": "Pressure is building on Biden to step aside. But many Democrats feel powerless to replace him",
      "url": "https://apnews.com/c10c872f8436966096b45b6089adee8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f022c7b9f4949d2a9f24c466c091900/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and JENNIFER PELTZ",
      "description": "In a major reprieve for former President Donald Trump, sentencing for his hush money convictions was postponed Tuesday until at least September — if ever — as the judge agreed to weigh the possible impact of a new Supreme Court ruling on presidential immunity.",
      "publishedAt": "2024-07-02T15:04:16Z",
      "title": "Judge delays Trump’s hush money sentencing until at least September after high court immunity ruling",
      "url": "https://apnews.com/4d5f8ce399656abff72d7c114a04060d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6488b6baac0d4fa8a667a263f5ca789d/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Donald Trump and the conservative interests that helped him reshape the Supreme Court got most of what they wanted this term, from substantial help for Trump's political and legal prospects to sharp blows against the administrative state they revile.",
      "publishedAt": "2024-07-02T19:57:51Z",
      "title": "Big wins for Trump and sharp blows to regulations mark momentous Supreme Court term",
      "url": "https://apnews.com/f34e56fd2c61ef58dd69c7822806ef44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/086a99bb06cc43aeba15cdc9f0c39ad9/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO and AMAR SPENCER-SAYERS",
      "description": "ST. GEORGE'S, Grenada (AP) — Hurricane Beryl roared through open waters Tuesday as a powerful Category 4 storm heading toward Jamaica after earlier making landfall in the southeast Caribbean, killing at least six people.",
      "publishedAt": "2024-07-02T10:43:42Z",
      "title": "Beryl heads toward Jamaica as a major hurricane after ripping through southeast Caribbean",
      "url": "https://apnews.com/8cf6928baf7c69554c48625fabd4a1b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6797fcbb032416682194d213f02178c/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — U.S. officials have approved another Alzheimer’s drug that can modestly slow the disease, providing a new option for patients in the early stages of the incurable, memory-destroying ailment.",
      "publishedAt": "2024-07-02T18:11:02Z",
      "title": "FDA approves a second Alzheimer's drug that can modestly slow disease",
      "url": "https://apnews.com/fd804c1271ae185a62f080e072d21698",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac1ea006e63743249021eb9ef015a497/3000.jpeg"
    },
    {
      "author": "STEPHANY MATAT",
      "description": "WEST PALM BEACH, Fla, (AP) — Hurricane season is upon us, known for disastrous flooding and high-speed winds in coastal areas of the United States and in the Caribbean and Central America, and emergency management officials are urging people to stay prepared.",
      "publishedAt": "2024-07-02T23:01:11Z",
      "title": "Hurricane season 2024 is here. Here's how to stay prepared",
      "url": "https://apnews.com/f59e4b1d693bbfaf99ca900ee9018f51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83a01ccc4a244e1386e01fa0237b8f0f/1920.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Rudy Giuliani, the former New York City mayor, federal prosecutor and legal adviser to Donald Trump, was disbarred in New York on Tuesday after a court found he repeatedly made false statements about Trump's 2020 election loss.",
      "publishedAt": "2024-07-02T15:14:45Z",
      "title": "Giuliani is disbarred in New York as court finds he repeatedly lied about Trump's 2020 election loss",
      "url": "https://apnews.com/81b327f9ab1f98548cb888f8e652c9a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74f63269aa1940cfae6fc06b7b1d68a3/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Hamdan family — around a dozen people from three generations — fled their home in the middle of the night after the Israeli military ordered an evacuation from the southern Gaza city of Khan Younis.",
      "publishedAt": "2024-07-02T19:40:41Z",
      "title": "Strike kills family as Israeli evacuation order sparks panicked flight from southern Gaza city",
      "url": "https://apnews.com/7ea786c949342f6c292984a926bf7620",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e1ef3171c9c48629a71bb9f9bc4cdd6/1920.jpeg"
    },
    {
      "author": "BISWAJEET BANERJEE and KRUTIKA PATHI",
      "description": "LUCKNOW, India (AP) — Thousands of people at a religious gathering in India rushed to leave a makeshift tent, setting off a stampede Tuesday that killed more than 100 and left scores injured, officials said.",
      "publishedAt": "2024-07-02T11:30:31Z",
      "title": "Stampede at religious event in India kills more than 100, mostly women and children",
      "url": "https://apnews.com/5ef739c5cbe8bb8b732c0b3099173810",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d511844c1494e1c8d19e965473cce9a/3000.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "FRANKTOWN, Va. (AP) — Arthur “Big Boy” Crudup helped invent rock ‘n’ roll.His 1946 song “That’s All Right,” an easygoing shrug to a lover, would become the first single Elvis Presley ever released. Rod Stewart would sing it on a chart-topping album.",
      "publishedAt": "2024-07-02T13:05:28Z",
      "title": "Arthur Crudup wrote the song that became Elvis' first hit. He barely got paid",
      "url": "https://apnews.com/1fc62464ce99d4a9291b7ef662f1913e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93dc071ae8ef4b07be4c26e196c21fb1/1468.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}