{
  "articles": [
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean President Yoon Suk Yeol declared martial law late Tuesday, vowing to eliminate “anti-state” forces as he struggles against an opposition that controls the country’s parliament and that he accuses of sympathizing with communist North Korea.",
      "publishedAt": "2024-12-03T13:40:05Z",
      "title": "South Korean parliament votes to defy president by lifting his declaration of martial law",
      "url": "https://apnews.com/997c22ac93f6a9bece68454597e577c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad19a84c9d5b479b851e7db7e393e60a/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Kash Patel has been well-known for years within Donald Trump's orbit as a loyal supporter who shares the president-elect's skepticism of the FBI and intelligence community.",
      "publishedAt": "2024-12-03T05:03:50Z",
      "title": "Trump's FBI pick has plans to reshape the bureau. This is what Kash Patel has said he wants to do",
      "url": "https://apnews.com/2d215ded96ad8a08689b6f7f0b2d49ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3013c26e215c4d0c9a040e04ea732fa8/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — As he concludes his time as chairman of the Democratic National Committee, Jaime Harrison is downplaying his party’s November loss to President-elect Donald Trump and arguing Democrats avoided even greater losses that parties in power have faced around the world.",
      "publishedAt": "2024-12-03T05:13:05Z",
      "title": "Democrats' outgoing chair says Trump's win forces party to reassess how it reaches voters",
      "url": "https://apnews.com/7974cddfa4187ff1afb0b9ac0aac06ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/394e44e2ae2c401184757cc861f3d1dc/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and JOSEF FEDERMAN",
      "description": "CAIRO (AP) — Palestinian officials say Fatah and Hamas are closing in on an agreement to appoint a committee of politically independent technocrats to administer the Gaza Strip after the war.",
      "publishedAt": "2024-12-03T09:08:42Z",
      "title": "Hamas and Fatah are near an agreement on who will oversee postwar Gaza",
      "url": "https://apnews.com/acc4da6042ed030f65d0cd0745b82217",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69a4c0349830449ab1bc558fe59a9dfc/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KABUL, Afghanistan (AP) — In a town that has been through it all and is clawing its way back, a man named Omidullah is looking to hit paydirt.The Kabul real estate agent is selling a nine-bedroom, nine-bath, white-and-gold villa in the Afghan capital.",
      "publishedAt": "2024-12-03T05:13:40Z",
      "title": "Thanks to peace, two unexpected words are echoing across Afghanistan's capital: Luxury housing",
      "url": "https://apnews.com/06cb2e2386a8fe1b24c416b0bd2bad92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fd64af0b708407eb70af45665b84303/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — President-elect Donald Trump will attend the reopening celebration for Notre Dame Cathedral in Paris this weekend, his first foreign trip since the election.",
      "publishedAt": "2024-12-03T00:52:21Z",
      "title": "Trump says he'll attend Notre Dame Cathedral reopening celebration in Paris this weekend",
      "url": "https://apnews.com/32d9086e3d2f21ae871f5bb1120929be",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/077fee9cc52541c9a1ae8ffe86ed3cbb/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY, SHARON LURYE and MORGAN LEE",
      "description": "SAN CARLOS, Ariz. (AP) — After missing 40 days of school last year, Tommy Betom, 10, is on track this year for much better attendance.",
      "publishedAt": "2024-12-03T05:08:09Z",
      "title": "Native American students miss school at higher rates. It only got worse during the pandemic",
      "url": "https://apnews.com/85179b9a8d29617661da74e29062faef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35a72e552dec421e9980f718cdc938b9/2000.jpeg"
    },
    {
      "author": "BERNARD McGHEE",
      "description": "It was a murder case almost everyone had an opinion on. O.J. Simpson 's “trial of the century” over the 1994 killings of his ex-wife and her friend bared divisions over race and law enforcement in America and brought an intersection of sports, crime, entertainment and class that was hard to turn away from.",
      "publishedAt": "2024-12-03T15:06:28Z",
      "title": "The year in review: Influential people who died in 2024",
      "url": "https://apnews.com/a0ee6673586e6687a63c829b66ac8fe7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9aeac638741d4947b2c16027ca5a97b6/3000.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "NEW YORK (AP) — I’ll get you, my pretty! And your little pygmy hippo, too!Forgive us the shameless attempt to link the fantasy hit “Wicked” to the delightful Moo Deng.",
      "publishedAt": "2024-12-03T15:00:21Z",
      "title": "2024 in pop culture: In a bruising year, we sought out fantasy, escapism — and cute little animals",
      "url": "https://apnews.com/c985d4b171608dcc00bf07c3989512d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14c8568b3fd64383a13980c8a29c3aa8/3000.jpeg"
    },
    {
      "author": "KRISTIE RIEKEN",
      "description": "HOUSTON (AP) — Houston's Azeez Al-Shaair was suspended by the NFL without pay for three games Tuesday for repeated violations of player safety rules following his violent hit to the head of Jacksonville's Trevor Lawrence, which led to a concussion.",
      "publishedAt": "2024-12-03T14:21:09Z",
      "title": "Texans' Azeez Al-Shaair suspended 3 games without pay after violent hit on Trevor Lawrence",
      "url": "https://apnews.com/f9bc6b14ee0fcdf8f865c51ae98c6c28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6e19f79acea49f0a5ec3636d1ecb168/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}