{
  "articles": [
    {
      "author": "NAJIB JOBAIN, BASSEM MROUE and DAVID RISING",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — U.S. Secretary of State Antony Blinken met Israel's prime minister on Friday to press American calls for a humanitarian pause in the fighting in Gaza, even as fears grew that the conflict could widen, with Israel warning that it was on high alert for attacks on its border with Lebanon.",
      "publishedAt": "2023-11-03T07:23:39Z",
      "title": "Blinken presses for pause in Gaza fighting on visit to Israel amid fears war could widen",
      "url": "https://apnews.com/94d5d0b58bc10a14be6ac191060e47e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e334679a5d254e9289abcb648a3ba8c1/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "BUREIJ REFUGEE CAMP, Gaza Strip (AP) — The gray film covering the faces of children rushed to Al-Aqsa Hospital in central Gaza Thursday made it hard to distinguish between the living and the dead.After two Israeli airstrikes flattened an entire block of apartment buildings in the Bureij refugee camp and damaged two U.N.",
      "publishedAt": "2023-11-02T21:28:09Z",
      "title": "Following an Israeli airstrike, crowded Gaza hospital struggles to treat wounded children",
      "url": "https://apnews.com/748552843cac672ee2b82571695d6ab1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f843000928ed486780be3fa1bb355546/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — FTX founder Sam Bankman-Fried’s spectacular rise and fall in the cryptocurrency industry — a journey that included his testimony before Congress, a Super Bowl advertisement and dreams of a future run for president — hit rock bottom Thursday when a New York jury convicted him of fraud for stealing at least $10 billion from customers and investors.",
      "publishedAt": "2023-11-02T19:17:22Z",
      "title": "FTX founder Sam Bankman-Fried convicted of defrauding cryptocurrency customers",
      "url": "https://apnews.com/baa4c94f2c4237c860475ff92e6bcf42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0c9360eb62946b1bce62b6b3afe03a9/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Eric Trump, one of two sons entrusted to run Donald Trump’s real estate empire, swore Thursday that he was never involved with financial statements that New York state lawyers say fraudulently puffed up the ex-president’s wealth and the worth of the family business.",
      "publishedAt": "2023-11-02T16:04:56Z",
      "title": "Eric Trump testifies he wasn’t aware of dad’s financial statements, but emails show some involvement",
      "url": "https://apnews.com/c2f546361ce3b5f0bdcf2360320c6060",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c443d76c5a934799b12e0fe898ca3ed7/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN and PATRICK WHITTLE",
      "description": "WASHINGTON (AP) — President Joe Biden is heading to Lewiston, Maine to mourn with a community where 18 people were killed in the deadliest mass shooting in state history. It's the type of trip that is becoming far too familiar.",
      "publishedAt": "2023-11-03T04:28:41Z",
      "title": "Biden is bound for Maine to mourn with a community reeling from a shooting that left 18 people dead",
      "url": "https://apnews.com/d3afb1a229b211395a0642224f8e7e80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a558eafbcfc432f8eb5426dda132cff/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and CARLA K. JOHNSON",
      "description": "FINDLAY, Ohio (AP) — Communities ravaged by America's opioid epidemic are starting to get their share of a $50 billion pie from legal settlements.Most of that money comes with a requirement that it be used to address the overdose crisis and prevent more deaths.",
      "publishedAt": "2023-11-03T04:19:41Z",
      "title": "As billions roll in to fight the US opioid epidemic, one county shows how recovery can work",
      "url": "https://apnews.com/d186d72250f35056892bc9d70b5ab2c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6909068bb02d445b92deac95e9c129da/3000.jpeg"
    },
    {
      "author": "SASHA CHAVKIN",
      "description": "WASHINGTON (AP) — As incomes in China have grown in the last decade, so has China’s appetite for beef. No longer out of reach for China’s middle class, beef now sizzles in home woks and restaurant kitchens.",
      "publishedAt": "2023-11-03T04:24:29Z",
      "title": "How an American meat broker is fueling Amazon deforestation",
      "url": "https://apnews.com/2a7a9a4310b6abca727dabb596e2e84d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2da05f293bcb47bca46443f47fed021b/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — America's employers likely kept hiring at a healthy pace last month, defying high interest rates, rising pressure on consumers and labor strikes that idled big swaths of the nation's auto industry.",
      "publishedAt": "2023-11-03T04:01:24Z",
      "title": "US jobs report for October could show solid hiring as Fed watches for signs of inflation pressures",
      "url": "https://apnews.com/941e0963d178e3435dfd01f3393787aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c331b6f7b514a2f822671a71bcb79de/3000.jpeg"
    },
    {
      "author": "COLLEEN BARRY",
      "description": "MILAN (AP) — Record-breaking rain produced floods in a vast swath of Italy's Tuscany region as Storm Ciarán pushed into the country overnight trapping residents in their homes, inundating hospitals and overturning cars.",
      "publishedAt": "2023-11-03T08:07:41Z",
      "title": "Storm Ciarán kills 5 people as it brings record rainfall to Italy, taking European death toll to 12",
      "url": "https://apnews.com/a96bc93e3a70e8da34ef792beb32a765",
      "urlToImage": ""
    },
    {
      "author": "FU TING",
      "description": "Long before “Friends” made its official debut in China, the show was a word-of-mouth phenomenon in the country. In the wake of Matthew Perry's death at 54, fans in China are mourning the loss of the star who felt less like a distant celebrity and more like an old friend.",
      "publishedAt": "2023-11-03T04:44:20Z",
      "title": "In the wake of Matthew Perry's death, Chinese fans mourn an old friend",
      "url": "https://apnews.com/0876bc8bf20b613c336d8c684eb5524f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/111837b571b44c91a75eed2317263895/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}