{
  "articles": [
    {
      "author": "MICHAEL R. SISAK and MARK SCOLFORO",
      "description": "ALTOONA, Pa. (AP) — After UnitedHealthcare’s CEO was gunned down on a New York sidewalk, police searched for the masked gunman with dogs, drones and the city's extensive surveillance system.",
      "publishedAt": "2024-12-10T06:03:24Z",
      "title": "Details emerge about suspect charged with murder in killing of UnitedHealthcare CEO",
      "url": "https://apnews.com/c68d0328f278d85fcf201ae89f634098",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/813221512bde449397bbab1345761b33/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "SAYDNAYA, Syria (AP) — They came from all over Syria, tens of thousands. The first place they rushed to after the fall of their longtime tormentor, former President Bashar Assad, was here: Saydnaya Prison, a place so notorious for its horrors it was long known as “the slaughterhouse.”",
      "publishedAt": "2024-12-10T05:05:04Z",
      "title": "Thousands scour Syria's most horrific prison but find no sign of their loved ones",
      "url": "https://apnews.com/9f533d54b4df72f97416f90921dd2a9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de554b3c402a49d883782399693bf58a/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli warplanes pounded military sites in Syria after Israeli troops seized a border buffer zone following the collapse of President Bashar Assad’s rule.",
      "publishedAt": "2024-12-10T06:57:57Z",
      "title": "Middle East latest: Israel bombs sites in Syria as Netanyahu testifies in his corruption trial",
      "url": "https://apnews.com/90bc663aea10628735f8c1acd75664d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1650cbfb41ee4e2194210bb4e8bf8ba0/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — A former South Korean defense minister was formally arrested Wednesday over his alleged collusion with President Yoon Suk Yeol and others in imposing martial law last week, as authorities investigate whether their acts amount to rebellion.",
      "publishedAt": "2024-12-10T04:40:33Z",
      "title": "South Korea's ex-defense minister is formally arrested over martial law imposition",
      "url": "https://apnews.com/c07fea5a701d5d708bfc236b3b81ee6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29ce27be5a2c4efca57c993a6b599906/1920.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "Women should have the option of taking their own test samples for cervical cancer screening, an influential health panel said Tuesday.Draft recommendations from the U.S.",
      "publishedAt": "2024-12-10T16:01:58Z",
      "title": "US health panel adds self-testing option for cervical cancer screening",
      "url": "https://apnews.com/4fca6f6072531a976a27cf369878fb59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcefb2da32ca491fb53f301f1bf4d3fa/1920.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "A bankruptcy judge scrutinizing The Onion’s bid for Alex Jones ’ Infowars platform was expected to hear a second day of testimony Tuesday after an auctioneer defended the satirical news outlet’s winning offer.",
      "publishedAt": "2024-12-10T05:26:37Z",
      "title": "The Onion's bid for Infowars is still in court as judge reviews auction",
      "url": "https://apnews.com/6bbdfb7d8d87b2f114570fcde4e39930",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7eaf99d383374821bda9c7b25571aefa/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu promised defiantly on Tuesday to knock down corruption allegations against him as he began testifying in his long-running trial, becoming the first sitting Israeli leader to take the stand as a criminal defendant.",
      "publishedAt": "2024-12-10T06:08:44Z",
      "title": "Israel's Netanyahu vows to challenge 'absurd' corruption charges as he takes the stand in his trial",
      "url": "https://apnews.com/478c957c7749986d5b8b2d039f670d54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1650cbfb41ee4e2194210bb4e8bf8ba0/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "MONROE, Mich. (AP) — In a packed union hall outside Detroit, a worker shifts the conversation from policy to the personal, quizzing Transportation Secretary Pete Buttigieg on his knowledge of Michigan, the state he only recently started calling home.",
      "publishedAt": "2024-12-10T12:00:40Z",
      "title": "Michigan Democrats look toward a future that some hope includes Pete Buttigieg",
      "url": "https://apnews.com/dcce1f0fbe78f900136bc1b0fefc4e9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e0e6401abc341e48309f103e4ff9efa/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Her memories of recording “Rockin' Around the Christmas Tree” are a little hazy. She remembers the producer placing decorations around the studio and blasting the air conditioner on a warm Nashville day to create a holiday spirit.",
      "publishedAt": "2024-12-10T12:44:03Z",
      "title": "Still rockin': As a singer turns 80, the Christmas song she sang as a teen is a holiday staple",
      "url": "https://apnews.com/6e255323765b5d43817b1961877ede63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e39a7ed588f47379013de997741bdc3/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "OKAPI WILDLIFE RESERVE, Congo (AP) — Scattered along the banks of the Ituri River, buildings cram together, cranes transport dirt and debris scatters the soil. The patches of trees are a scant reminder that a forest once grew there.",
      "publishedAt": "2024-12-10T03:00:22Z",
      "title": "Chinese gold mining threatens a protected UN heritage site in Congo",
      "url": "https://apnews.com/5e9499fd939c3c2d798a6165f3fc487b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7452f4999b824a9f825a0c11c8a1bdef/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}