{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and DAVID RISING",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Patients, staff and displaced people left Gaza's largest hospital Saturday, health officials said, leaving behind only a skeleton crew to care for those too sick to move and Israeli forces who had taken over the facility earlier in the week.",
      "publishedAt": "2023-11-18T08:15:49Z",
      "title": "Shifa Hospital patients, staff and displaced leave the compound as Israel strikes targets in south",
      "url": "https://apnews.com/5ffcdeeca3eb3dbcd8af8d207a8e4a4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a45364c11694133b03726972e4a33e2/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "Jordan's foreign minister offered blistering criticism Saturday of Israel's war on Hamas in the Gaza Strip, describing it as “blatant aggression” against Palestinian civilians that threatens to engulf the wider Middle East.",
      "publishedAt": "2023-11-18T07:12:18Z",
      "title": "Jordan's foreign minister offers blistering criticism of Israel as its war on Hamas rages on",
      "url": "https://apnews.com/331a642d62f2a52b13b66c45ab520168",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f98952f6f9884a47819ebca7ecc22611/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Iranian-backed militants in Iraq and Syria have long battled with U.S. and coalition forces, launching sporadic attacks against bases in the region where troops are deployed to fight Islamic State group insurgents.",
      "publishedAt": "2023-11-18T05:13:42Z",
      "title": "How the US strikes a delicate balance in responding to attacks on its forces by Iran-backed militias",
      "url": "https://apnews.com/c6b8a0b82698d113ac32619ab1adfc01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f83def7c4bd44782b09cd363a629debc/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON and ED KOMENDA",
      "description": "SEATTLE (AP) — The suspicious letters sent to vote centers and government buildings in six states this month were undeniably scary, some containing traces of fentanyl or white powder, accompanied by not-so-veiled threats and dubious political symbols.",
      "publishedAt": "2023-11-18T05:24:29Z",
      "title": "Officials stock up on overdose antidote naloxone after fentanyl-laced letters disrupt vote counting",
      "url": "https://apnews.com/163d2073f22995f479ffb87559811fee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4b4957fb8c14c308943008c4102d45c/3000.jpeg"
    },
    {
      "author": "DAVID BILLER and DANIEL POLITI",
      "description": "BUENOS AIRES, Argentina (AP) — This may sound familiar: A self-styled outsider aims to win the presidency and purge the political establishment so he can restore order to a broken nation — if only he can overcome a system rigged against him.",
      "publishedAt": "2023-11-18T05:01:54Z",
      "title": "Milei echoes Trump with fraud claims that inject uncertainty into Argentina's presidential runoff",
      "url": "https://apnews.com/683332bb71bc2084c604e22c5919e144",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d910130279b4895accc7e6d064bf68c/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — When Tymofii Postoiuk and his friends set up an online fundraising effort for Ukraine, donations poured in from around the globe, helping to purchase essential equipment for Ukrainian armed forces.",
      "publishedAt": "2023-11-18T05:46:14Z",
      "title": "The world's attention is on Gaza, and Ukrainians worry war fatigue will hurt their cause",
      "url": "https://apnews.com/94b6351b05178078dddc027f188526b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac8c38691cb74e959105e59f6dbd364a/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Video montages of sash-clad pageant contestants strolling beaches in El Salvador, snapping selfies in front of fireworks and wandering the streets of downtown San Salvador speckled social media this week as celebrations for the Miss Universe 2023 pageant kicked off in the Central American country.",
      "publishedAt": "2023-11-18T05:09:30Z",
      "title": "El Salvador's Miss Universe pageant drawing attention at crucial moment for president",
      "url": "https://apnews.com/a9fef908d32f108b019a6e41788d1862",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43cf9cf2bf3643bbac3cccdb902ac46a/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — A lawsuit by singer Cassie containing allegations of beatings and abuse by music producer Sean “Diddy” Combs has been settled, the artists announced Friday, one day after the lawsuit was filed.",
      "publishedAt": "2023-11-18T04:03:06Z",
      "title": "Sean 'Diddy' Combs and singer Cassie settle lawsuit alleging abuse 1 day after it was filed",
      "url": "https://apnews.com/2d2a4c8938eb82c34b62c01a30969554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56a635964b544d7e9be64621c1bfeba4/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and HANNAH FINGERHUT",
      "description": "FORT DODGE, Iowa (AP) — Former President Donald Trump will campaign Saturday in west-central Iowa as part of his fall push to sign up supporters and volunteers ahead of the state's leadoff caucuses, now less than two months away.",
      "publishedAt": "2023-11-18T05:10:07Z",
      "title": "Trump returns to Iowa for another rally and needles the state's governor for endorsing DeSantis",
      "url": "https://apnews.com/1c5d38574010a66d094df41d7c34b6e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a201f2324fea4bb89d34dbe3598c6938/3000.jpeg"
    },
    {
      "author": "DIDI TANG",
      "description": "SAN FRANCISCO (AP) — The 92-year-old businessman who represented Taiwan at this week's summit of Asia-Pacific leaders in San Francisco expressed hope Friday that the meeting between U.S.",
      "publishedAt": "2023-11-18T03:20:20Z",
      "title": "Taiwan envoy says he's hopeful Biden-Xi meeting will reduce tensions in the Asia-Pacific region",
      "url": "https://apnews.com/1767d84366607bbf9e2d93a65892b4f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8dee53234cbd482a9582f1301aaeb1c0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}