{
  "articles": [
    {
      "author": "BARBARA ORTUTAY",
      "description": "Pavel Durov, the founder and CEO of the messaging app Telegram, was arrested in Paris over the weekend over allegations that his platform is being used for illicit activity including drug trafficking and the distribution of child sexual abuse images.",
      "publishedAt": "2024-08-26T20:11:07Z",
      "title": "What is Telegram and why was its CEO arrested in Paris?",
      "url": "https://apnews.com/2c8015c102cce23c23d55c6ca82641c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c1135b9f351437dba25a7196b3cd209/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden’s top Middle East adviser on Tuesday held talks in Doha with senior Qatari leaders on the efforts to complete a cease-fire and hostage deal between Israel and Hamas as well as Qatar’s prime minister meeting this week with Iran’s president, according to a U.S.",
      "publishedAt": "2024-08-27T20:09:14Z",
      "title": "Biden adviser meets with Qatari leaders to discuss Israel-Hamas negotiations",
      "url": "https://apnews.com/521473a093532c66e8767588708178e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7273393a64944458d8adcd7f28c3755/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith filed a new indictment Tuesday against Donald Trump over his efforts to undo the 2020 presidential election that keeps the same criminal charges but narrows the allegations against him following a Supreme Court opinion that conferred broad immunity on former presidents.",
      "publishedAt": "2024-08-27T20:24:21Z",
      "title": "Feds file new indictment in Trump Jan. 6 case, keeping charges intact but narrowing allegations",
      "url": "https://apnews.com/186c874404912578e44d5781c8267e2d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3aaf3aa525d249afa9df2802924727be/1920.jpeg"
    },
    {
      "author": "SAM McNEIL and MELANIE LIDMAN",
      "description": "BEERSHEBA, Israel (AP) — Qaid Farhan Alkadi was alone underground Tuesday after 326 days of captivity in Gaza when Israeli forces scouring Hamas’ vast tunnel network found and freed him.",
      "publishedAt": "2024-08-27T12:33:09Z",
      "title": "A hostage in Gaza is rescued by Israel after 326 days of captivity",
      "url": "https://apnews.com/696f8ee830207815efd31320976ef118",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78acd2a4793c4f96b6f3ac33288ede8b/1600.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Born into the devastating Israel-Hamas war, 10-month-old Abdel-Rahman Abu El-Jedian started crawling early. Then one day, he froze — his left leg appeared to be paralyzed.",
      "publishedAt": "2024-08-27T21:13:48Z",
      "title": "A 10-month-old Palestinian baby suddenly stopped crawling. Polio had struck Gaza",
      "url": "https://apnews.com/59a09fbb2257dd9fcfaac0878dc3fe58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dddb8971db6f45c784d684b343b1ecc3/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israel's military has rescued its eighth hostage from Gaza since the 10-month-old war began.",
      "publishedAt": "2024-08-27T20:30:55Z",
      "title": "Negotiations so far more effective than rescues in bringing Israeli hostages home from Gaza",
      "url": "https://apnews.com/3bc1f183a6466b0be7713ac135b386c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65a669164ec64ba18f9bd6b446836230/2400.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — Mexico’s president told reporters Tuesday he has put relations with the United States and Canadian embassies “on pause” after the two countries voiced concerns over a proposed judicial overhaul that critics say could undermine the independence of the judiciary.",
      "publishedAt": "2024-08-27T19:06:39Z",
      "title": "Mexico puts relations with US and Canadian embassies 'on pause' for slamming judicial overhaul plan",
      "url": "https://apnews.com/d196520eead08883d0ae86ca2d86d97f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b13277969854eb4b985bd6ec86680b6/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and GISELA SALOMON",
      "description": "McALLEN, Texas (AP) — After President Joe Biden this summer announced a new U.S. citizenship pathway for immigrant spouses, Oscar Silva rushed to apply and was elated Monday when an email arrived confirming his appointment for a required biometric exam.",
      "publishedAt": "2024-08-27T16:32:46Z",
      "title": "Immigrant families in limbo after judge puts U.S. program for spouses on hold",
      "url": "https://apnews.com/9b282ce79793004d43e393f75081f331",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a78a58eb19f14662b4b4ac31fb8835e6/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — The Biden administration offered federal resources to Donald Trump and Kamala Harris for presidential transition planning for the first time Tuesday, with experts suggesting both are behind in preparing for their potential administrations.",
      "publishedAt": "2024-08-27T16:20:18Z",
      "title": "Presidential transition planning has begun in earnest, but Trump and Harris are already behind",
      "url": "https://apnews.com/944aa257180e7cbc5e50601a1a7119a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd44d4144c7c49e387e053bd608ad282/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's supreme leader opened the door Tuesday to renewed negotiations with the United States over his country's rapidly advancing nuclear program, telling its civilian government there was “no harm\" in engaging with its “enemy.”",
      "publishedAt": "2024-08-27T10:47:38Z",
      "title": "Iran's supreme leader opens door to negotiations with United States over Tehran's nuclear program",
      "url": "https://apnews.com/bc11763f45041ac84171ebc3866f1273",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df73405f7ab14b44ac671bd2c7c750cd/2200.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}