{
  "articles": [
    {
      "author": "Ty ONeil",
      "description": "“Today” show host Savannah Guthrie is pleading for the public’s help at “an hour of desperation” in the search for her missing mother. The family’s latest attempts to reach the abductors failed to yield any proof that she's alive or communication with the culprits. The FBI says it's not aware of ongoing communication between the family and the suspected kidnappers. The FBI says it hasn't identified any suspects or persons of interest in the disappearance of 84-year-old Nancy Guthrie. Guthrie says her family in Arizona continues to believe her mother is out there and hearing everyone’s prayers. By Monday evening, a purported ransom deadline apparently set by her mom’s abductors appeared to have passed.",
      "publishedAt": "2026-02-10T13:42:53Z",
      "title": "Savannah Guthrie pleads for help in search for missing mom",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-arizona-b765fed6b9669441383b75860263ac99",
      "urlToImage": "https://dims.apnews.com/dims4/default/7bf5e6d/2147483647/strip/true/crop/3405x2269+47+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2F91%2F0fbbcbecf1a9148a29f221924c3b%2F70a04c2b49b34cbbb96fb33014034181"
    },
    {
      "author": "Kate Brumback, Eric Tucker, Alanna Durkin Richer",
      "description": "An FBI search of the elections hub in Fulton County, Georgia, is part of an investigation into possible “deficiencies or defects” in the vote count in the 2020 contest lost by President Donald Trump, according to an affidavit unsealed Tuesday. The allegations outlined in the affidavit are largely based on claims that have long been made by people who assert that there was fraud in the 2020 election. Audits, state officials, courts and Trump’s own former attorney general have rejected the idea that there was widespread fraud in the 2020 election that could have altered the outcome.",
      "publishedAt": "2026-02-10T20:02:52Z",
      "title": "Affidavit: FBI search of Georgia offices tied to probe of possible 2020 election 'defects'",
      "url": "https://apnews.com/article/fbi-georgia-elections-fulton-county-2020-ballots-9dfecd778c09134e9aa0bba2848718f5",
      "urlToImage": "https://dims.apnews.com/dims4/default/5aa75bb/2147483647/strip/true/crop/2955x1969+272+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F8e%2F4bc3584380226f449bae1607ff91%2F26df9d34f88240518bbc23c7cc551f52"
    },
    {
      "author": "Steve Karnowski",
      "description": "Gov. Tim Walz says the federal immigration crackdown in Minnesota could end soon. He spoke with top Trump administration officials, including border czar Tom Homan and White House chief of staff Susie Wiles. Walz said Tuesday that he anticipates hearing more from the administration soon about the operation's future. Walz emphasized a \"trust but verify\" approach, as the situation could change. Walz also hopes for cooperation on joint investigations into the shooting deaths of two Minnesotans by federal officers. The crackdown has impacted local businesses, with employees and customers staying away out of fear.",
      "publishedAt": "2026-02-10T21:00:47Z",
      "title": "Walz says federal immigration crackdown in Minnesota could end soon",
      "url": "https://apnews.com/article/minnesota-immigration-crackdown-walz-homan-wiles-1f25629bf74467f91e41377f704a6b7a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9737eba/2147483647/strip/true/crop/3600x2399+0+140/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2F8b%2F98d3c410d47b1de1ae5219649101%2F1b667d6b8456496eb1ed9eeb0bf7ba93"
    },
    {
      "author": "Rebecca Santana",
      "description": "The heads of agencies enforcing President Donald Trump's immigration agenda are set to testify before Congress. This comes amid scrutiny over the shooting deaths of two protesters in Minneapolis by Homeland Security officers. Todd Lyons of Immigration and Customs Enforcement, Rodney Scott of Customs and Border Protection, and Joseph Edlow of U.S. Citizenship and Immigration Services will appear before the House Committee on Homeland Security. Critics argue ICE and CBP officers use excessive force and violate rights. Lyons, who has led ICE since March, defends his officers' tactics. The administration's mass deportation strategy faces growing criticism and declining public support.",
      "publishedAt": "2026-02-10T12:02:54Z",
      "title": "Trump's immigration chiefs are set to testify in Congress",
      "url": "https://apnews.com/article/immigration-customs-enforcement-border-patrol-trump-congress-1fa0cc0c9297479fcc02b1dc5a706d37",
      "urlToImage": "https://dims.apnews.com/dims4/default/92fefb5/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6e%2F63%2F310a95a22bd7e458f4394602dfee%2F4ee27af1affe42aea8264eca07eb06ee"
    },
    {
      "author": "Joey Cappelletti, Steve Peoples, Steven Sloan",
      "description": "The National Governors Association is not going to hold a formal meeting with President Donald Trump. This decision comes after the White House planned to invite only Republican governors to the event. Oklahoma Governor Kevin Stitt, a Republican, shared this in a letter to fellow governors on Monday. The NGA's mission is to represent all 55 governors, so the association will no longer facilitate the event. The NGA is scheduled to meet in Washington from February 19th to 21st. Representatives for Stitt, the White House, and the NGA didn't immediately comment on the letter.",
      "publishedAt": "2026-02-10T16:37:37Z",
      "title": "Governors won't hold Trump meeting after White House only invited Republicans",
      "url": "https://apnews.com/article/trump-kevin-stitt-governors-meeting-washington-ee4e696534082638795e1804d71f4966",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e743b7/2147483647/strip/true/crop/8355x5567+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F69%2F16fcd9c7e451b57cb43d4fa4dd07%2F7de02e485dda4cf69a9dd18509310189"
    },
    {
      "author": "Stephen Groves",
      "description": "Commerce Secretary Howard Lutnick has acknowledged that he had met with Jeffrey Epstein twice after his 2008 conviction for soliciting prostitution from a child. It's a reversal of Lutnick’s previous claim that he had cut ties with the late financier after 2005. He was questioned by Democrats during a Tuesday subcommittee hearing of the Senate Appropriations Committee. But Lutnick is facing calls from several lawmakers for his resignation after the release of case files on Epstein contradicted Lutnick’s claims on a podcast last year that he had decided to “never be in the room” with Epstein again after a 2005 tour of Epstein’s home that disturbed Lutnick and his wife.",
      "publishedAt": "2026-02-10T16:38:17Z",
      "title": "Commerce Secretary Howard Lutnick acknowledges meetings with Epstein that contradict previous claims",
      "url": "https://apnews.com/article/jeffrey-epstein-files-howard-lutnick-2ead9f281ba2491e0581aced50a0533d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dac861/2147483647/strip/true/crop/5236x3489+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F48%2F0224fcfad7a842dde3d9ae93f211%2F231e589b75c94fc59bb0936959293554"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iranian security official Ali Larijani is traveling to Oman, the country currently mediating talks between Tehran and the United States over Iran's nuclear program. Larijani will likely deliver Iran's response Tuesday to recent indirect talks held in Muscat. He is expected to meet with Omani Foreign Minister Badr al-Busaidi and Sultan Haitham bin Tariq. The talks are described as \"important,\" though details remain unclear. The U.S. has increased its military presence in the Middle East, including sending the aircraft carrier USS Abraham Lincoln, to pressure Iran into an agreement.",
      "publishedAt": "2026-02-10T02:22:08Z",
      "title": "Top Iran security official to travel to Oman, site of US talks",
      "url": "https://apnews.com/article/iran-oman-us-nuclear-talks-protests-crackdown-50cc3b6261bfd90ebe01da64ba9576d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee0092c/2147483647/strip/true/crop/7259x4837+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Fa6%2F58be052657abeb27b367235454a7%2Ff173668a687649b2b5506e358222dc3b"
    },
    {
      "author": "Wafaa Shurafa, Edna Tarigan",
      "description": "Two Palestinian men riding bicycles were killed in an Israeli drone strike Tuesday, hospital officials said, as deadly violence continued in Gaza despite an October ceasefire. Gaza health authorities say 586 Palestinians have been killed since the truce took effect, bringing the war’s overall toll to more than 72,000. Israel says its strikes respond to ceasefire violations. Some elements of the agreement have advanced, including the return of all hostages and limited reopening of the Rafah crossing. Plans for an international stabilization force are also emerging, with Indonesia saying it is preparing thousands of troops for humanitarian and reconstruction roles, though the force’s mandate remains unclear.",
      "publishedAt": "2026-02-10T14:03:17Z",
      "title": "Israeli drone strike kills 2 cyclists in Gaza",
      "url": "https://apnews.com/article/gaza-hamas-israel-war-2-10-2026-08acadd177a13e971de88c56b12d456f",
      "urlToImage": "https://dims.apnews.com/dims4/default/f3629e1/2147483647/strip/true/crop/5811x3872+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F7f%2F30dce7d754e21af65728b5fde9ff%2F59f6370759c5469a9af98514eaab3d71"
    },
    {
      "author": "Kaitlyn Huamani, Barbara Ortutay",
      "description": "Jurors in a landmark social media case that seeks to hold companies responsible for harms to children got their first glimpse into what will be a lengthy trial characterized by dueling narratives from the plaintiffs and the two remaining defendants, Meta and YouTube. At the core of the Los Angeles case is a 20-year-old identified only by the initials “KGM,” whose case could determine how thousands of other, similar lawsuits against social media companies will play out. She and two other plaintiffs have been selected for bellwether trials — essentially test cases for both sides to see how their arguments play out before a jury.",
      "publishedAt": "2026-02-10T06:00:06Z",
      "title": "Lawyer likens social media platforms to addictive drugs in opening comments in landmark trial",
      "url": "https://apnews.com/article/meta-youtube-addiction-design-trial-e95054a356d73ca66736d42234013012",
      "urlToImage": "https://dims.apnews.com/dims4/default/359b785/2147483647/strip/true/crop/6362x4239+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F3f%2F426dc48e71339c47d349ebbf7db8%2F0756b1832a88491585f86e6574ec8f6c"
    },
    {
      "author": "Steve Douglas",
      "description": "Olympic redemption will have to wait for Mikaela Shiffrin. The American skiing standout was given the ideal platform to win the new team combined event at the Milan Cortina Games after partner Breezy Johnson led the opening downhill leg. Shiffrin raced the slalom leg and finished 15th. That dropped the U.S. to fourth place. Shiffrin has gone seven straight Olympic races without a medal stretching back to Beijing in 2022. Johannes Høsflot Klæbo of Norway powered to his second straight Olympic gold medal and seventh of his career by winning the men’s cross-country sprint. He is one gold off the all-time Winter Olympics record.",
      "publishedAt": "2026-02-10T16:07:16Z",
      "title": "Shiffrin out of the medals again at Winter Olympics as Klæbo wins another gold",
      "url": "https://apnews.com/article/winter-olympics-shiffrin-klaebo-fontana-botn-d284237c724fdfba2ebc0d7f34058fff",
      "urlToImage": "https://dims.apnews.com/dims4/default/f1c2631/2147483647/strip/true/crop/4516x3009+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F4c%2F5c52f58fd2aa0a3db89c55d7291c%2F9440dfe8d770452d889b38e425486232"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}