{
  "articles": [
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK",
      "description": "The Senate is muscling Pete Hegseth’s nomination as defense secretary toward confirmation. The Republican senators are prioritizing the former Fox News host and combat veteran’s vow to create a “warrior culture” at the Pentagon over allegations of heavy drinking and aggressive behavior toward women. Votes are expected by Friday evening. Confirming Hegseth would round out President Donald Trump’s top national security Cabinet officials. It would also show Trump's ability to get what he wants from the Republican-led Senate considering his outsider nominees. Secretary of State Marco Rubio and CIA Director John Ratcliffe won confirmation within days of Trump’s return to the White House.",
      "publishedAt": "2025-01-24T20:33:11Z",
      "title": "Senate is preparing to confirm Pete Hegseth as defense secretary in late evening vote",
      "url": "https://apnews.com/article/pete-hegseth-defense-secretary-trump-cabinet-confirmation-12491935023692bce0a04d149663e784",
      "urlToImage": "https://dims.apnews.com/dims4/default/e9cd2dd/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F20%2F8a7a02d15bea88caff993873a3c8%2F27dd24d8bacf411584f999898f13dc90"
    },
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK",
      "description": "The Senate has advanced the nomination of Pete Hegseth as President Donald Trump’s defense secretary. Thursday's vote pushed Hegseth toward confirmation, despite grave objections from Democrats and stirring unease among Republicans over his behavior and qualifications to lead the U.S. military. Two Republicans, Sen. Lisa Murkowski of Alaska and Sen. Susan Collins of Maine, broke ranks to oppose Hegseth. The former combat veteran and Fox News host faces allegations of excessive drinking and aggressive actions toward women, which he has denied. A final confirmation vote is expected Friday.",
      "publishedAt": "2025-01-23T18:36:00Z",
      "title": "Senate advances Pete Hegseth as Trump's defense secretary",
      "url": "https://apnews.com/article/pete-hegseth-defense-secretary-pentagon-trump-confirmation-79d38a3d821eda7e03789e857b417a7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/36d9ef7/2147483647/strip/true/crop/5418x3048+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fc1%2F96b7ac942c8974577067e341e987%2F97199dc932dc4c6da854a53458ac9e32"
    },
    {
      "author": "MARK SHERMAN",
      "description": "The Supreme Court has agreed to take on a new culture war dispute: whether the nation’s first publicly funded religious charter school should be allowed to open in Oklahoma. The justices said Friday they would review an Oklahoma Supreme Court decision that invalidated a state board’s approval of an application by the Catholic Church in Oklahoma to open a charter school. The conservative-dominated high court has issued several decisions in recent years signaling a willingness to allow public funds to flow to religious entities. At the same time, conservative-led states have sought to insert religion into public schools, including Louisiana’s requirement that the Ten Commandments be posted in classrooms.",
      "publishedAt": "2025-01-24T21:37:01Z",
      "title": "US Supreme Court will weigh approval for nation's first publicly funded religious charter school",
      "url": "https://apnews.com/article/supreme-court-religious-charter-school-oklahoma-a4a31ba7ffc35811ad94a401cb85502f",
      "urlToImage": "https://dims.apnews.com/dims4/default/52c593c/2147483647/strip/true/crop/5584x3141+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F5d%2F9514b8cfab3b42eb325f15e4892b%2F157921b799fc4ec7bc67475f9e3be35c"
    },
    {
      "author": "SHLOMO MOR, WAAFA SHURAFA",
      "description": "An advocacy group representing the family members of Israelis held in Gaza has confirmed that the four hostages set to be released by Hamas on Saturday are female soldiers. Under the ceasefire agreement that paused the 15-month war, Israel would release 200 Palestinian prisoners or detainees in exchange for the four, including 120 militants serving life sentences after being convicted of deadly attacks. The four soldiers, Karina Ariev, 20; Daniella Gilboa, 20; Naama Levy, 20; and Liri Albag, 19, were captured in Hamas’ Oct. 7, 2023 attack that ignited the war and have had no contact with the outside world since then.",
      "publishedAt": "2025-01-24T11:09:47Z",
      "title": "Israeli families of hostages confirm that Hamas will release 4 female soldiers",
      "url": "https://apnews.com/article/israel-gaza-ceasefire-hostage-release-6f34326d042fcafff28033876e4a362f",
      "urlToImage": "https://dims.apnews.com/dims4/default/38366c0/2147483647/strip/true/crop/4968x2795+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F5b%2F2f3f1d691058fce66f78680734e3%2F29db9aae26744b26bc1601dd434092f6"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "People are listing phones preloaded with TikTok for tens of thousands of dollars on eBay, Facebook marketplace and other online storefronts. But it is not clear if there are many buyers at those prices. TikTok was briefly unavailable to U.S. users over the weekend, but as of Sunday anyone who had previously downloaded it has been able to use it. But the app is still not available for download on Apple and Google’s app stores, so anyone who didn’t think to get TikTok before Sunday is out of luck. As a result, some entrepreneurial spirits are selling phones and tablets that have TikTok — and other apps from its parent company ByteDance, such as Lemon8 and video editor CapCut. On eBay, listings could be found for as much as $50,000 (or as little as $340) on Friday.",
      "publishedAt": "2025-01-24T20:34:55Z",
      "title": "People are hawking TikTok-loaded phones for thousands on eBay, Facebook",
      "url": "https://apnews.com/article/tiktok-phones-ebay-facebook-stores-fcc55bfdde7483321f86cd6b8895f189",
      "urlToImage": "https://dims.apnews.com/dims4/default/65cbccb/2147483647/strip/true/crop/5905x3322+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F76%2F6b0fa4c5c6d6cee232d67f732460%2Ff752640c351f4ec39e64f9c0a75a8f30"
    },
    {
      "author": "WILL WEISSERT, CHRIS MEGERIAN",
      "description": "President Donald Trump is heading to hurricane-battered western North Carolina and wildfire-ravaged Los Angeles. It's the first trip of his second term. Trump has frequently blended politics and disasters, and Friday will likely be no different. He has sharply criticized President Joe Biden's administration for its handling of Hurricane Helene in North Carolina, and he's suggested withholding money from California unless it changes water policies. Trump will follow those stops with a Saturday victory rally in Las Vegas, where he plans to start detailing how he can begin keeping a campaign promise to exclude tips from federal taxes.",
      "publishedAt": "2025-01-24T05:05:04Z",
      "title": "Trump to visit disaster zones in North Carolina and California on first trip of second term",
      "url": "https://apnews.com/article/trump-first-trip-california-north-carolina-nevada-b906880254ce7bf249c3dcefa45bf846",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2e286f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F39%2F1e68945b0535510cdd007e62811b%2Ff0988800cf5c4ac3ba66c8d5add1f771"
    },
    {
      "author": "WILL WEISSERT, ZEKE MILLER",
      "description": "President Donald Trump has ended the federal security detail for Dr. Anthony Fauci, the infectious disease expert who advised him on the COVID-19 pandemic. That's according to a person familiar with the matter. Fauci is the latest in a string of former Trump aides-turned-critics to see their federal protection canceled despite ongoing threats to their lives. Speaking to reporters Friday in North Carolina, Trump said he wouldn’t feel any responsibility if harm befell the former government officials. A person familiar with the matter says Fauci’s federal security detail was ended on Thursday and he has since hired private security.",
      "publishedAt": "2025-01-24T17:57:05Z",
      "title": "Trump ends Fauci's security detail and says he'd feel no responsibility if harm befell him",
      "url": "https://apnews.com/article/fauci-trump-security-detail-4b2e317dc9e7768c0571df30750e863a",
      "urlToImage": "https://dims.apnews.com/dims4/default/20eb31d/2147483647/strip/true/crop/4754x2674+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F52%2F40f748f0a0e9c241e11bc18a7206%2F02717b3ba439464d93a934483243f7d9"
    },
    {
      "author": "JOSH BOAK",
      "description": "Like most presidents, Donald Trump faces an economy that seldom bends to political ambitions. The Republican has promised strong growth, high tariffs, income tax cuts and booming oilfields. But despite the solid job market and low 4.1% unemployment rate, he has to contend with headwinds like inflation, a budget deficit, increased tensions over trade, the fallout from his plans to curtail immigration and a persistent wealth gap. Each of these issues could help to shape how voters feel about a president they returned to the White House with the specific goal of fixing the economy.",
      "publishedAt": "2025-01-24T18:36:09Z",
      "title": "5 economic forces that could shape the first year of Trump's presidency",
      "url": "https://apnews.com/article/trump-inflation-debt-tariffs-wealth-immigrant-ea7d1ee97cae226fa4d427737ddaa22a",
      "urlToImage": "https://dims.apnews.com/dims4/default/038ef7d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F22%2F2441385b34b1588c53165f85f06f%2F7a64ad99e55b4598a223ad024a8f44e6"
    },
    {
      "author": "MICHAEL KUNZELMAN, ALANNA DURKIN RICHER",
      "description": "A federal judge has barred Oath Keepers founder Stewart Rhodes from entering Washington, D.C., without the court’s approval after President Donald Trump commuted the far-right extremist group leader’s 18-year prison sentence for orchestrating an attack on the U.S. Capitol four years ago. U.S. District Judge Amit Mehta's order on Friday comes two days after Rhodes visited the Capitol, where he met with at least one lawmaker, chatted with others and defended his actions during a mob’s attack on Jan. 6, 2021. Rhodes was released from a Maryland prison a day earlier.",
      "publishedAt": "2025-01-24T15:45:18Z",
      "title": "Judge bars Oath Keepers founder Rhodes from entering Washington without court's permission",
      "url": "https://apnews.com/article/capitol-riot-rhodes-oath-keepers-3494fd3a8a707a79ac187694572eb58f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a76aed2/2147483647/strip/true/crop/2884x1622+0+152/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fda%2Ff11f193e8c6c2f624c5c663ab181%2F7a43e76a81bc41c695d0328ffe2e5340"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "Americans see the federal government as rife with corruption, inefficiency and red tape — but they’re less sure about whether Elon Musk is the right person to fix it. An Associated Press-NORC Center for Public Affairs Research poll shows only about 3 in 10 U.S. adults strongly or somewhat approve of President Donald Trump’s Department of Government Efficiency, which Musk leads. The poll shows Americans aren’t broadly worried about a government filled with “deep state” actors poised to undermine Trump’s Republican agenda. They're also ambivalent about some of the changes Trump has mentioned, including eliminating large numbers of federal jobs and moving federal agencies outside Washington.",
      "publishedAt": "2025-01-24T12:06:59Z",
      "title": "What Americans think about Trump and Musk's plans for the government",
      "url": "https://apnews.com/article/doge-musk-trump-corruption-government-efficiency-16243280f446ea85ef50ff106c7e2841",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d03412/2147483647/strip/true/crop/7693x4327+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F0c%2F03c444621811b0c8318a0c409d5d%2Fb024f038517a49e580c9127a26701216"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}