{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Health officials said Sunday that 31 “very sick” premature babies were safely transferred from Gaza's main hospital to another in the south and will later go to Egypt, as scores of critically wounded patients remained stranded there days after Israeli forces entered the compound.",
      "publishedAt": "2023-11-19T07:14:03Z",
      "title": "31 'very sick' babies have been evacuated from Gaza's largest hospital, where trauma patients remain",
      "url": "https://apnews.com/08a2f441a9ea03bf0bb3db0de6fc5408",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0acf0d7cf495414588e66c050634cb22/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and JON GAMBRELL",
      "description": "JERUSALEM (AP) — Yemen's Houthi rebels seized an Israeli-linked cargo ship in a crucial Red Sea shipping route on Sunday, officials said, taking over two dozen crew members hostage and raising fears that regional tensions heightened over the Israel-Hamas war were playing out on a new maritime front.",
      "publishedAt": "2023-11-19T15:49:55Z",
      "title": "Yemen's Houthi rebels hijack an Israeli-linked ship in the Red Sea and take 25 crew members hostage",
      "url": "https://apnews.com/dc9b6448690bcf5c70a0baf7c7c34b09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec26a8017bfa49c4af6f409ea3cfe223/1539.jpeg"
    },
    {
      "author": "JOSH BOAK and ZEKE MILLER",
      "description": "WASHINGTON (AP) — President Joe Biden ends nearly every speech by saying he's \"never been more optimistic\" about the country's direction. But lately he also has begun painting a vision of a catastrophic future for the United States — that is, if Donald Trump returns to the presidency.",
      "publishedAt": "2023-11-19T12:32:33Z",
      "title": "Biden says he's an optimist. But his dire warnings about Trump have become central to his campaign",
      "url": "https://apnews.com/8ff0337afec92264ae6fbaf36f55e683",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1aae86a1ed6f421795e629277d9fc886/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, PAUL J. WEBER and MICHELLE L. PRICE",
      "description": "EDINBURG, Texas (AP) — Donald Trump returned to the U.S.-Mexico border for a visit Sunday and was endorsed by Republican Gov. Greg Abbott of Texas as the former president campaigns on a hard-line immigration agenda that would be far more expansive than the policies he pursued during his first term in the White House.",
      "publishedAt": "2023-11-19T12:50:06Z",
      "title": "Texas Gov. Abbott endorses Trump as the former president returns to the US-Mexico border",
      "url": "https://apnews.com/85b331c3e58fc2a016614ce733f0f492",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4efe4cdea22f404da1b26e9b48bec30e/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — Oregon's first-in-the-nation law that decriminalized the possession of small amounts of heroin, cocaine and other illicit drugs in favor of an emphasis on addiction treatment is facing strong headwinds in the progressive state after an explosion of public drug use fueled by the proliferation of fentanyl and a surge in deaths from opioids, including those of children.",
      "publishedAt": "2023-11-19T05:07:32Z",
      "title": "Oregon's first-in-the-nation drug decriminalization law faces growing pushback amid fentanyl crisis",
      "url": "https://apnews.com/bb209e6ba9835c69f95b093c8ee00279",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d73b558d7794246856a1bdecc444c30/2500.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Inflation has reached its lowest point in 2 1/2 years.",
      "publishedAt": "2023-11-19T11:00:26Z",
      "title": "Why Americans feel gloomy about the economy despite falling inflation and low unemployment",
      "url": "https://apnews.com/e9e96643d8a1eb3ab2f57810219b8324",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27f432d2238f48d28fbb93234df1478b/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEMPHIS, Tenn. (AP) — A suspect in Tennessee died of a self-inflicted gunshot wound while on the run Sunday after a series of shootings that killed four of his female relatives and seriously injured a fifth person, police said.",
      "publishedAt": "2023-11-19T08:12:25Z",
      "title": "A suspect in the killings of four people is found dead of a self-inflicted gunshot wound, police say",
      "url": "https://apnews.com/71e638797ec0f07d06e4ec260e5776fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54ef81bb6efb46a09c6cc71b4ee93f8e/3000.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — An elevated Los Angeles freeway closed because of an arson fire earlier this month is expected to reopen ahead of Monday morning's commute, California Gov. Gavin Newsom announced Sunday.",
      "publishedAt": "2023-11-19T08:32:25Z",
      "title": "Los Angeles freeway closed by Nov. 11 arson fire set to fully reopen before Monday's commute",
      "url": "https://apnews.com/407b4cf891e316b8a38530672d730120",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbf2e96b213846fa8e3d7c405a9822e7/3000.jpeg"
    },
    {
      "author": "MICHAEL HILL",
      "description": "ALBANY, N.Y. (AP) — For a year, a special New York law has cleared the way for a wave of headline-grabbing lawsuits against famous men accused of sexual misconduct, including former President Donald Trump, hip hop mogul Sean “Diddy” Combs and the comedian and actor Russell Brand.",
      "publishedAt": "2023-11-19T06:57:39Z",
      "title": "The Adult Survivors Act launched over 2,500 sex abuse suits. Now, it’s expiring",
      "url": "https://apnews.com/6fd16aa4cc992c089e91c6fef064f375",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b02ee2b5f8d24b27b7f075b5e7733767/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Ohio State passed Michigan and moved up to No. 2 in The Associated Press college football poll Sunday, a week before the Big Ten rivals play another top-five matchup, and No.",
      "publishedAt": "2023-11-19T19:02:02Z",
      "title": "AP Top 25: Ohio State jumps Michigan, moves to No. 2. Washington, FSU flip-flop at Nos. 4-5",
      "url": "https://apnews.com/b89dc67c10896b7f2b65f715d8a4534b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f6d5f5e3417459695f61d6c3733531c/2488.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}