{
  "articles": [
    {
      "author": "CHRIS MEGERIAN",
      "description": "President Donald Trump is going further than ever before to enforce his decisions. While orders were sometimes softened or even ignored during his first term, this time he's unwilling to let things slide. The White House summarizes Trump’s approach with the mantra “promises made, promises kept.” Administration officials also say Trump is entitled to impose his vision on the government that he was elected to lead. Others see something darker and more menacing for the country, and they accuse Trump of hollowing out institutions that have defied him in the past.",
      "publishedAt": "2025-02-19T05:01:08Z",
      "title": "Trump imposes his vision on America in departure from first-term stumbles",
      "url": "https://apnews.com/article/donald-trump-white-house-elon-musk-157a40167e63673e2c2f3a15e946a274",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb5cf87/2147483647/strip/true/crop/2613x1470+0+139/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Fe3%2Fb6f84db18540ad5515dc9530dcef%2F3431098aace84487b3ece39de6d0dfc0"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "The Trump administration is falsely claiming that tens of millions of dead people over 100 years old are receiving improper Social Security payments. Over the past few days, President Donald Trump and billionaire adviser Elon Musk have said on social media and in press briefings that people who are 100, 200 and even 300 years old are improperly getting benefits. Musk called it a “HUGE problem,” as his Department of Government Efficiency digs into federal agencies to root out waste, fraud and abuse. It is true that improper payments have been made, including some to dead people. But the numbers thrown out by Musk and the White House are overstated and misrepresent Social Security data.",
      "publishedAt": "2025-02-19T00:11:18Z",
      "title": "Tens of millions of dead people aren't getting Social Security checks, despite Trump and Musk claims",
      "url": "https://apnews.com/article/social-security-payments-deceased-false-claims-doge-ed2885f5769f368853ac3615b4852cf7",
      "urlToImage": "https://dims.apnews.com/dims4/default/6469ff2/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc4%2F567b096c40357421a58e7ecd5137%2Fddbd03eff35d411db8765dd1e451624b"
    },
    {
      "author": "CATHY BUSSEWITZ",
      "description": "President Donald Trump’s nominee to lead the Department of Labor has been hailed by union heads as pro-labor. But advocates for workers’ rights are questioning whether former U.S. Rep. Lori Chavez-DeRemer will be able to uphold that reputation in an administration that wants to drastically curtail government spending and the size of the federal workforce. The Republican from Oregon is scheduled to appear before the Senate Committee on Health, Education, Labor & Pensions for her confirmation hearing on Wednesday. Lori Chavez-DeRemer's voting record as a one-term congresswoman earned her union support. That's led some political observers to assume Trump picked her as a way to appeal to voters who are pro-union.",
      "publishedAt": "2025-02-19T10:00:08Z",
      "title": "Trump's Labor Department pick has union support. Worker advocates wonder how much power she'd have",
      "url": "https://apnews.com/article/confirmation-hearing-labor-secretary-lori-chavezderemer-4516f1cf0ca590bc664b5577855dc96f",
      "urlToImage": "https://dims.apnews.com/dims4/default/d91a018/2147483647/strip/true/crop/2751x1547+0+143/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2Ffc%2F0422dbaeb74d2ab1a72b0e649b8e%2Facaafb3bc68d4b46917cc9dcfe041519"
    },
    {
      "author": "ASSOCIATED PRESS",
      "description": "The Trump administration has stopped support for legal representation in immigration court for children who enter the United States alone, a setback for those fighting deportation who can’t afford a lawyer. The Acacia Center for Justice says it serves 26,000 migrant children under its federal contract. The Interior Department gave no explanation for the stop-work order on Tuesday, telling the group only that it was done for “causes outside of your control” and should not be interpreted as a judgment of poor performance. People fighting deportation may hire attorneys at their own expense but the government does not provide them.",
      "publishedAt": "2025-02-19T02:05:33Z",
      "title": "Trump administration halts support for representing unaccompanied children in immigration court",
      "url": "https://apnews.com/article/trump-legal-aid-unaccompanied-children-immigration-court-6ffbad896e86080765699d208980dbd0",
      "urlToImage": "https://dims.apnews.com/dims4/default/802c589/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F8e%2Fbc90911a74d75d3502f2416eaa52%2F2143396978ea4f70a4b0abd731146cef"
    },
    {
      "author": "DARLENE SUPERVILLE, MICHELLE L. PRICE",
      "description": "President Donald Trump has signed an executive order to study how to expand access to in vitro fertilization and make it more affordable. Tuesday's signing follows up on a campaign pledge that was at odds with some members of his party. Trump also signed another executive order as well as a presidential memorandum at his Florida home and club, Mar-a-Lago. The other executive order outlined the oversight functions of the Office of Management and Budget, while the presidential memorandum called for more transparency from the government. Trump answered questions from reporters after signing the orders. His first joint TV interview with adviser Elon Musk also aired on Fox News Channel.",
      "publishedAt": "2025-02-18T16:17:28Z",
      "title": "Trump signs order to study how to expand access to IVF",
      "url": "https://apnews.com/article/trump-executive-order-musk-hannity-143316eda581ac466cd923cdf4568d87",
      "urlToImage": "https://dims.apnews.com/dims4/default/586aad8/2147483647/strip/true/crop/4807x2704+0+253/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F92%2Fcd09e5a02078a7d8209b7d56092e%2Fb4aba367c9c34dfaa94a66533333f91e"
    },
    {
      "author": "DAVID BAUDER",
      "description": "President Donald Trump says his administration will continue to restrict The Associated Press' access to cover presidential events until the news agency goes along with his renaming of the Gulf of Mexico. It was the first time the president has commented on a dispute that began with the White House blocking AP journalists from events because of its decision to continue using Gulf of Mexico, while also noting Trump has renamed the international body of water the Gulf of America. The White House has also broadened its dispute against the AP for other recommendations it has made for word usage, such as the capitalization of Black and not white in racial references.",
      "publishedAt": "2025-02-19T01:08:52Z",
      "title": "Trump says AP will be curtailed at White House until it changes style to Gulf of America",
      "url": "https://apnews.com/article/trump-ap-white-house-press-corps-pool-91535a6384d681fee1cd7e384ea6c627",
      "urlToImage": "https://dims.apnews.com/dims4/default/6b6a3af/2147483647/strip/true/crop/5653x3180+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F27%2Fbe47d2f8c199511b743eed165a8d%2Ffe16199dd191482da4e665c3b2a06c0b"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "Tens of thousands of Palestinians have fled home following recent Israeli military operations across the northern West Bank. They have traveled by car and on foot, through muddy olive groves and snipers’ sight lines, in the occupied territory's largest displacement since the 1967 Mideast war. After announcing a widespread crackdown against West Bank militants on Jan. 21, Israeli forces descended on the city of Jenin, as they have dozens of times since Hamas’ Oct. 7, 2023, attack on Israel. Soldiers then pushed deeper and more forcefully into several other nearby towns, scattering families and stirring bitter memories of the 1948 war over Israel’s creation. During that war, 700,000 Palestinians fled or were forced from their homes in what Palestinians call the Nakba, or “catastrophe.”",
      "publishedAt": "2025-02-19T06:40:29Z",
      "title": "Israel's West Bank crackdown triggers a wave of displacement unseen in decades",
      "url": "https://apnews.com/article/israel-palestinians-west-bank-gaza-militants-displaced-2fb430ce6eeeff40b416df566712eb99",
      "urlToImage": "https://dims.apnews.com/dims4/default/db7c344/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F05%2F05e71563e8130675df42fc413c38%2F8aad916aee8440568bc4cb0f228b193a"
    },
    {
      "author": "DEVI SHASTRI, MORGAN LEE",
      "description": "The measles outbreak in rural West Texas has grown to 58 cases as of Tuesday. Eight people in neighboring eastern New Mexico also have been diagnosed with the highly contagious disease. New Mexico health department spokesman Robert Nott says the agency hasn’t “identified any direct contact” with the Texas cases. The Texas Department of State Health Services said Tuesday that 13 people are hospitalized, while none infected in New Mexico were hospitalized. Measles is a respiratory virus that can survive in the air for up to two hours.",
      "publishedAt": "2025-02-18T19:25:36Z",
      "title": "What to know about measles outbreaks in Texas and New Mexico",
      "url": "https://apnews.com/article/measles-texas-new-mexico-mmr-outbreak-vaccines-408371700e3ab548777bf0354e586549",
      "urlToImage": "https://dims.apnews.com/dims4/default/83998b2/2147483647/strip/true/crop/4149x2334+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2Fd3%2F60e0a515501249369ef40d0aa91d%2Ffad810f187e5499fa9e6094129ec46e5"
    },
    {
      "author": "FANNY BRODERSEN, STEFANIE DAZIO",
      "description": "Migrants who have settled in the German city of Magdeburg say they have experienced a sharp increase in racism and anti-immigration sentiments following a deadly Christmas market attack last year. The violence has ensured that migration remains a key issue as the country heads toward an early election Sunday. The suspect is a Saudi doctor who drove into the holiday market teeming with shoppers and left five women and a 9-year-old boy killed and 200 people injured. Just one day after Dec. 20 violence, there was a large right-wing demonstration in Magdeburg. Migrant community groups report that verbal and physical attacks on people with a migrant background have increased significantly in the city since then.",
      "publishedAt": "2025-02-19T07:32:47Z",
      "title": "Migrant groups say racist attacks increase in German city after deadly Christmas market violence",
      "url": "https://apnews.com/article/magdeburg-germany-racism-migration-ef1896d3b831e6b02a387b7256d78de5",
      "urlToImage": "https://dims.apnews.com/dims4/default/b09d556/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F0e%2F100f91f75b7c1271729937b43366%2Fecb2d9fa5b184c97ae0921fd0ddea609"
    },
    {
      "author": "MATTHEW LEE, VLADIMIR ISACHENKOV",
      "description": "Top U.S. and Russian officials had their most extensive high-level engagement since Moscow sent troops into Ukraine almost three years ago. They met for nearly four hours Tuesday in Saudi Arabia as President Donald Trump sought to advance his goal of ending the fighting in Ukraine and mending ties with Moscow. The delegations said the discussions were a good first step. However, the rapprochement may come at a cost to the transatlantic alliance of the U.S. and Europe and significantly damage Washington’s standing with Ukraine as well as with other nations counting on U.S. leadership in NATO and elsewhere for their security and protection.",
      "publishedAt": "2025-02-18T21:05:30Z",
      "title": "A deeper look at the talks between US and Russian officials and what comes next",
      "url": "https://apnews.com/article/us-russia-rubio-lavrov-ukraine-saudi-arabia-94bc4de5ecc86922d6ea4376e38f1cfd",
      "urlToImage": "https://dims.apnews.com/dims4/default/1266af6/2147483647/strip/true/crop/5500x3094+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F7f%2F0c718b498911960324314ad93170%2F72c5f372db4a4f8c94ad30140916b8b6"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}