{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli strike on the central Gaza Strip killed a family of eight, Palestinian medical officials said Sunday, as Israeli forces battled militants in the territory's north and airstrikes in pursuit of Hezbollah destroyed a century-old market in southern Lebanon.",
      "publishedAt": "2024-10-13T06:54:05Z",
      "title": "Israeli strikes kill a family of 8 in Gaza and destroy a century-old market in Lebanon",
      "url": "https://apnews.com/a8cd5df3e2bb4ab08405a78251244bb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd7203474c874371993894a8370ad85a/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu is examining a plan to seal off humanitarian aid to northern Gaza in an attempt to starve out Hamas militants, a plan that, if implemented, could trap without food or water hundreds of thousands of Palestinians unwilling or unable to leave their homes.",
      "publishedAt": "2024-10-13T13:46:33Z",
      "title": "Netanyahu mulls plan to empty northern Gaza of civilians and cut off aid to those left inside",
      "url": "https://apnews.com/219d7eb9a3050e281ccc032d5a56263c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb132e8f0d734ca19edafb5396f5ddde/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM, BRENDAN FARRINGTON and TY O'NEIL",
      "description": "VENICE, Fla. (AP) — No sooner had residents of the Bahia Vista Gulf condominium complex dug out and from Hurricane Helene than they were faced with the same daunting cleanup from new damage inflicted by Hurricane Milton.",
      "publishedAt": "2024-10-13T04:01:54Z",
      "title": "Determination to rebuild follows Florida's hurricanes with acceptance that storms will come again",
      "url": "https://apnews.com/a39b7a04052e9cd9d0d8598d090ea54b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89f18dbd22d048bab42803d46eb6b70f/1920.jpeg"
    },
    {
      "author": "GABRIELA AOUN ANGUEIRA",
      "description": "BAKERSVILLE, N.C. (AP) — Nearly two weeks after Hurricane Helene downed power lines and washed out roads all over North Carolina's mountains, the constant din of a gas-powered generator is getting to be too much for Bobby Renfro.",
      "publishedAt": "2024-10-13T04:03:36Z",
      "title": "Volunteers bring solar power to Hurricane Helene's disaster zone",
      "url": "https://apnews.com/095b6ff5f1290ac7439f12b555f9845d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/72c767c354e84fbc84404020faae007b/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — During his first term as president, Donald Trump tested the limits of how he could use the military to achieve policy goals. If given a second term, the Republican and his allies are preparing to go much further, reimagining the military as an all-powerful tool to deploy on U.S.",
      "publishedAt": "2024-10-13T11:23:14Z",
      "title": "Trump tested the limits on using the military at home. If elected again, he plans to go further",
      "url": "https://apnews.com/a136c69cc85184b07f161c4c09b46c50",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f82cd9a916b34c76aec346d1b25e2a19/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "ST. PETE BEACH, Fla. (AP) — President Joe Biden on Sunday saw firsthand some of the devastation that Hurricane Milton inflicted on Florida's Gulf Coast, including piles of water-logged debris outside almost every home in a beach community and the torn-up roof of Tropicana Field, home of the Tampa Bay Rays baseball team.",
      "publishedAt": "2024-10-13T09:01:07Z",
      "title": "Biden surveys Hurricane Milton damage in Florida and Harris attends church in North Carolina",
      "url": "https://apnews.com/84526011bf223902a04f41f59b7651b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9b94d06bd2842d993d1605f310cbad8/3000.jpeg"
    },
    {
      "author": "JOHN HANNA and DAVID A. LIEB",
      "description": "SHAWNEE, Kan. (AP) — After introducing herself at their front doors, Vanessa Vaughn West began her pitch to voters with a question: What issues are important to you? She heard frustration about rising local property taxes, a desire for smaller government and questions about affordable housing.",
      "publishedAt": "2024-10-13T04:24:52Z",
      "title": "Legislative majorities giving one party all the power are in play in several states",
      "url": "https://apnews.com/f8c35cefd07aed6e34c8ddfd313117cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e63a1c916a440158a389f5005d65937/3000.jpeg"
    },
    {
      "author": "JONATHAN MATTISE, TRAVIS LOLLER and KRISTIN M. HALL",
      "description": "NASHVILLE, Tenn. (AP) — The leading private prison company in the U.S. has spent more than $4.4 million to settle dozens of complaints alleging mistreatment — including at least 22 inmate deaths — at its Tennessee prisons and jails since 2016.",
      "publishedAt": "2024-10-13T13:01:20Z",
      "title": "Prison operator under federal scrutiny spent millions settling Tennessee mistreatment claims",
      "url": "https://apnews.com/1c2b3cd5cd395a7f1453566e366fb415",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f537eb20ab84dffa5a5d22438c3dbb5/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "SpaceX pulled off the boldest test flight yet of its enormous Starship rocket on Sunday, catching the returning booster back at the launch pad with mechanical arms.",
      "publishedAt": "2024-10-13T12:32:10Z",
      "title": "In an engineering feat, mechanical SpaceX arms catch Starship rocket booster back at the launch pad",
      "url": "https://apnews.com/7af865e987bb4a2aad38759e06013626",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d933a0583ff44ecbb96e3a37eafd00b7/1920.jpeg"
    },
    {
      "author": "CHINEDU ASADU",
      "description": "DAMASAK, Nigeria (AP) — When Boko Haram launched an insurgency in northeastern Nigeria in 2010, Abdulhameed Salisu packed his bag and fled from his hometown of Damasak in the country's battered Borno state.",
      "publishedAt": "2024-10-13T04:04:50Z",
      "title": "They fled their homes to escape Boko Haram. Now Nigeria is resettling them back despite their fears",
      "url": "https://apnews.com/1eb22e035f0d01cdfe7345f93ea122b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2acebf505f547f5b5a8e3437a4b1189/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}