{
  "articles": [
    {
      "author": "BERNARD CONDON",
      "description": "President Donald Trump's decision to pause enforcement of a law banning companies from bribing foreign government officials threatens to upend a half-century of U.S. policy embraced by both Republican and Democratic administrations. The executive order to freeze the Foreign Corrupt Practices Act could help U.S. businesses win deals abroad. But it also could tarnish America’s image abroad, allow autocrats ruling over often impoverished people to get even richer and lead wealthy allies to weaken their own anti-bribery laws so their companies can make payments, too. Says anti-bribery law expert Mark Pieth, “We are facing a Wild West situation.\"",
      "publishedAt": "2025-02-11T23:10:17Z",
      "title": "Trump's halt of US law banning business bribes abroad raises specter of a 'Wild West' of dealmaking",
      "url": "https://apnews.com/article/fcpa-bribery-trump-antibribery-law-executive-order-b656ef40a0035591618d053aa0ac7458",
      "urlToImage": "https://dims.apnews.com/dims4/default/94f2ce1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F25%2F14d052c2d2e4aed8f3d1a08f62ce%2F8a2484812b7a4e24beb61887a4cb02cb"
    },
    {
      "author": "The Associated Press",
      "description": "Defense Secretary Pete Hegseth has announced a major shift in U.S. policy on Ukraine, abandoning the country's pre-2014 borders. Also, inflation has worsened as President Donald Trump continues to ramp up tariffs, and Trump will host India's Prime Minister Narendra Modi on Wednesday.",
      "publishedAt": "2025-02-12T07:35:00Z",
      "title": "Live updates: Hegseth says NATO membership for Ukraine is unrealistic",
      "url": "https://apnews.com/live/trump-presidency-updates-2-12-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/542ce1f/2147483647/strip/true/crop/3031x1705+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2Fc8%2F626df4f3466885e894128c7597cf%2Fap25043517615247.jpg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "Eight government watchdogs have sued over their mass firing that removed oversight of President Donald Trump’s new administration. The lawsuit filed Wednesday asks a judge to declare the firings unlawful and restore the inspectors general to their positions at the agencies. They said in the filing that they play a critical, nonpartisan role overseeing trillions of dollars in federal spending and the conduct of millions of federal employees. Congress wasn't given the legally required 30-day notices about the removals, something that even a top Republican decried. Trump has said he'd put new “good people” in the jobs. There's no immediate comment from the White House on the lawsuit.",
      "publishedAt": "2025-02-12T15:06:16Z",
      "title": "Government watchdogs fired by Trump sue his administration and ask a judge to reinstate them",
      "url": "https://apnews.com/article/watchdogs-trump-mass-firing-inspectors-general-5b4629fb34a168322bf61170286efb76",
      "urlToImage": "https://dims.apnews.com/dims4/default/0f5fad1/2147483647/strip/true/crop/5084x2860+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2Ff5%2Ff0b4253fc0ff759d8cf032b00a2b%2Fae197d21b2d0459e800a271af7de0782"
    },
    {
      "author": "CHRIS MEGERIAN, MICHELLE L. PRICE",
      "description": "President Donald Trump’s most powerful adviser, Elon Musk, has made a rare public appearance at the White House to defend the swift and extensive cuts he’s pushing across the federal government while acknowledging there may be mistakes. He appeared in the Oval Office with Trump as the president praised Musk’s work slashing spending with his Department of Government Efficiency and signed an an executive order to continue downsizing the federal workforce. Musk, taking questions for the first time from reporters since he joined the Trump administration as a special government employee with sprawling influence over federal agencies, defended DOGE’s work as “common sense” and “not draconian or radical.”",
      "publishedAt": "2025-02-11T19:59:52Z",
      "title": "Musk appears at White House as Trump signs executive order to continue downsizing federal workforce",
      "url": "https://apnews.com/article/trump-downsizing-federal-workers-doge-00683abc4de44a151f26aaa6cb0d0f30",
      "urlToImage": "https://dims.apnews.com/dims4/default/cc4c334/2147483647/strip/true/crop/5716x3215+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F7c%2Fc74b16d9797ab2de49c83372a787%2Fa4c8677ab9994303bd8b315883e0f752"
    },
    {
      "author": "DAVID BAUDER",
      "description": "The White House blocked an Associated Press reporter from attending an event in the Oval Office after demanding the news agency alter its style on the Gulf of Mexico, which President Donald Trump has ordered renamed to the Gulf of America. It was a highly unusual move that could have constitutional free-speech implications. AP executives said the reporter tried to enter the White House event as usual Tuesday afternoon and was turned away. Julie Pace, senior vice president and executive editor of The Associated Press, called the administration’s move troubling and unacceptable. The Trump administration made no immediate announcements about the move.",
      "publishedAt": "2025-02-11T22:17:16Z",
      "title": "White House bars AP reporter from Oval Office due to AP style policy",
      "url": "https://apnews.com/article/trump-ap-journalism-first-amendment-8a83d8b506053249598e807f8e91e1ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/45494bf/2147483647/strip/true/crop/3656x2057+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2Fd9%2F5c529aa84c08d6cafcb673fb9a91%2F9e68fffc7b08440499f2612fcecf8d39"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "President Donald Trump’s unconventional pick for director of national intelligence is awaiting a final Senate vote on her nomination to oversee and coordinate the work of America’s 18 different intelligence agencies. There was initial skepticism of Tulsi Gabbard over her past comments sympathetic to Russia, a meeting she held with now-deposed Syrian President Bashar Assad and her previous support for government leaker Edward Snowden. But it's now faded among the Republicans who hold the majority in the Senate. Democratic opposition is strong. A vote is expected Wednesday on the military veteran and former Democratic congresswoman from Hawaii",
      "publishedAt": "2025-02-12T15:05:07Z",
      "title": "Gabbard awaits a final Senate vote on her nomination to be Trump's director of national intelligence",
      "url": "https://apnews.com/article/tulsi-gabbard-trump-senate-national-intelligence-director-a1045b3f6bf91e491892e347b42cdc90",
      "urlToImage": "https://dims.apnews.com/dims4/default/47e5fc0/2147483647/strip/true/crop/7441x4186+0+387/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F37%2F758f3a9dde28883c7d3a2870ddc4%2Fbcc41f93d07c461a9c703542e15498e4"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "Families of the hostages in Gaza are struggling to maintain hope as the fragile ceasefire between Israel and Hamas seems increasingly at risk of falling apart. Hamas says it won't free three hostages on Saturday as planned, citing alleged Israeli violations of the ceasefire deal. Israel says it’s ready to resume the war if the hostages aren't released. Relatives of hostages are pleading with Prime Minister Benjamin Netanyahu not to give up on the ceasefire framework, and to speed up the timeline of releases. Their worries are exacerbated by President Donald Trump’s demand that all of the hostages be freed by Saturday — and his insistence that Gaza be emptied of all Palestinians and redeveloped as a tourist enclave.",
      "publishedAt": "2025-02-12T05:24:24Z",
      "title": "Relatives of Israeli hostages are terrified as the Gaza ceasefire teeters",
      "url": "https://apnews.com/article/israel-gaza-ceasefire-hostages-release-hamas-f47ee44c76ee172b39a4116c2cb42d18",
      "urlToImage": "https://dims.apnews.com/dims4/default/7534664/2147483647/strip/true/crop/3047x1714+0+159/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2F6d%2F19d71051a5057ac6525376ecdc0b%2Fb864a05b5ca545d595bdc69ca08f99ab"
    },
    {
      "author": "ELSIE CHEN, ERIKA KINETZ, DAKE KANG",
      "description": "Tesla has sued its own customers and journalists in China for defamation – and won just about every time. Elon Musk’s company has pioneered an aggressive legal strategy in China and leveraged the patronage of political leaders to silence critics, reap financial rewards and limit its accountability. That’s led some car owners to take drastic action. As concerns mount about eroding checks and balances in the U.S., Tesla’s record in China shows how Musk has thrived in a system in which regulators, the media and the courts are by design intertwined.",
      "publishedAt": "2025-02-12T01:01:11Z",
      "title": "AP investigates Tesla's aggressive legal strategy in China",
      "url": "https://apnews.com/article/tesla-china-lawsuits-musk-investigation-58b10ccace488784fcc63646ab78b410",
      "urlToImage": "https://dims.apnews.com/dims4/default/1237303/2147483647/strip/true/crop/5702x3207+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F9d%2Fb59f94fc6e1c5d91aa79e6bdab9a%2Fe592207811a74e7b9c01f132703abd61"
    },
    {
      "author": "LORNE COOK, TARA COPP",
      "description": "U.S. Defense Secretary Pete Hegseth says NATO membership for Ukraine is unrealistic. In sweeping remarks Wednesday, Hegseth suggested that the way forward for Ukraine is for the country to abandon hopes of a return to its pre-2014 borders and prepare for a negotiated settlement with Russia — one that should be backed up with an international force of troops. Hegseth made the comments during the first trip to NATO and the Ukraine Defense Contact Group by a member of the new Trump administration. Allies have been waiting to hear how much continued military and financial support Washington intends to provide to Ukraine’s government.",
      "publishedAt": "2025-02-12T11:27:10Z",
      "title": "US defense chief Hegseth calls NATO membership for Ukraine unrealistic",
      "url": "https://apnews.com/article/nato-ukraine-us-hegseth-trump-russia-a3ca747b102cae6737436596444a32d0",
      "urlToImage": "https://dims.apnews.com/dims4/default/be830f8/2147483647/strip/true/crop/4440x2498+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F32%2F75%2Fc48623817adf3e131cfb0146a24a%2F2093a683b188458eb2730c1c129154a7"
    },
    {
      "author": "LEE KEATH",
      "description": "Rights groups say that behind U.S. President Donald Trump's vows to turn Gaza into a “Riviera of the Middle East” lies a plan to forcibly drive a population from its land. They warn that could be a war crime under international law. Palestinians have roundly rejected the idea of leaving and say his talk normalizes their erasure, denying their connection to their land. Trump has doubled down on the plan, saying Palestinians would not be allowed to return. He has left it ambiguous how they would be removed, insisting they want to go.",
      "publishedAt": "2025-02-12T11:03:54Z",
      "title": "Trump doubles down on plan to empty Gaza. This is what he has said and what's at stake",
      "url": "https://apnews.com/article/trump-gaza-plan-palestinians-israel-3f12eb51869da2221afbb22b0bcf47ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/c85f9f3/2147483647/strip/true/crop/8385x4717+0+437/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F99%2F18fe6cd56e3d88b236a63d7bae57%2F9ab4656a6539434a81eead25e407ff16"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}