{
  "articles": [
    {
      "author": "COURTNEY BONNELL",
      "description": "LONDON (AP) — Russia has repeatedly fired missiles and drones at Ukrainian ports key to sending grain to the world.",
      "publishedAt": "2023-07-22T06:06:13Z",
      "title": "Ukraine wants ships to keep exporting its grain despite Russian attacks. Some are interested",
      "url": "https://apnews.com/3e79b0842ca97c96e73b824d0e621722",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/755f260b39054be186ae683077448d2d/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — In the winter of 2010, shortly after police discovered the remains of his roommate and three other women buried on a remote stretch of Long Island shoreline, Dave Schaller provided detectives with a description of the person he believed to be the killer.",
      "publishedAt": "2023-07-22T00:59:10Z",
      "title": "He came face to face with an alleged serial killer. 12 years later, his tip helped crack the case",
      "url": "https://apnews.com/750c938a4e6737b233304db6e3b1f677",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab4740ed1da746979d13d39c2349c9f8/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "HUDSON, N.H. (AP) — They acknowledge Donald Trump's dominance, but weary Republicans across New Hampshire — even inside the governor's office — are fighting to stop the former president from winning the first-in-the-nation primary.",
      "publishedAt": "2023-07-22T04:11:20Z",
      "title": "Nervous Republicans turn to New Hampshire in hopes of stopping Trump",
      "url": "https://apnews.com/cee250b2171b68c2da79b1bbb8454deb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a721c43925fe4fe2ab31a55ebc99acb3/3000.jpeg"
    },
    {
      "author": "PETER PRENGAMAN",
      "description": "PHOENIX (AP) — I blink, and the edges of my eyelids feel like they are being singed. My cheeks burn as if they are being pressed with a hot iron ready to tackle a pile of wrinkled shirts. It is 4 p.m.",
      "publishedAt": "2023-07-22T05:02:26Z",
      "title": "As he leaves Phoenix's blistering sun, AP's climate news director reflects on desert life",
      "url": "https://apnews.com/294dd87991905928bcd9658d443ca066",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33491685821143b6aa56019fa91339c5/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — What do Paul McCartney, Queen Latifah, Lady Gaga and Stevie Wonder have in common?Oh, and Aretha Franklin, k.d. lang, Bono and Billy Joel. Not to mention Carrie Underwood, Judy Garland, John Legend and Placido Domingo.",
      "publishedAt": "2023-07-22T04:14:48Z",
      "title": "Tony Bennett left his heart to generations of music fans",
      "url": "https://apnews.com/8e8b68d86c7eaca6fc2c555a085f5be8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94097713249a440bb96623635c201f21/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "MEXICO CITY (AP) — Latin America is taking Barbie mania to an extreme, with everything from pink-colored tacos and pastries, commercial planes bearing the Barbie logo, political ads and even Barbie-themed protests.",
      "publishedAt": "2023-07-22T04:05:26Z",
      "title": "Barbie mania sweeps Latin America, but sometimes takes on a darker tone",
      "url": "https://apnews.com/8ca1399c06db421e9fd7bb4eba16f34b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18cb3c633349438e8f1b63236c53846b/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "The summer of 2023 is behaving like a broken record about broken records.Nearly every major climate-tracking organization proclaimed June the hottest June ever. Then July 4 became the globe's hottest day, albeit unofficially, according to the University of Maine’s Climate Reanalyzer.",
      "publishedAt": "2023-07-22T08:47:09Z",
      "title": "Sick of hearing about record heat? Scientists say those numbers paint the story of a warming world",
      "url": "https://apnews.com/7bcb569321504065cbf2356a34ba8902",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/986e98c022064517b091d4198bf20ba4/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Oceans of Israeli flags, steady drumbeats, cries of “Democracy!” Water cannons, police on horseback, protesters dragged off the ground.For seven straight months, tens of thousands of Israelis have taken to the streets in the most sustained and intense demonstrations the country has ever seen.",
      "publishedAt": "2023-07-22T09:04:41Z",
      "title": "Fierce protests have been rocking Israel for months. What's fueling them?",
      "url": "https://apnews.com/282e2cd18a2340a067625e148ebda41c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a16587afe8c241c5a50a372fca0bc65f/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korea fired several cruise missiles toward its western sea Saturday, South Korea’s military said, marking the second launch event this week, apparently in protest of the docking of a nuclear-armed U.S.",
      "publishedAt": "2023-07-21T23:38:19Z",
      "title": "While North Korea fires cruise missiles, it stays mum on US soldier who crossed into the country",
      "url": "https://apnews.com/c9fd009a622f1823b823b623ca04c218",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f1f8721e5594bba8f9d72e7e943283e/3000.jpeg"
    },
    {
      "author": "EVELYNE MUSAMBI",
      "description": "NAIROBI, Kenya (AP) — At the morgue, the bullet was still lodged in Douglas Kalasinga’s head. His family said they couldn’t afford an autopsy. At least 35 civilians have been shot dead by police in Kenya this month during protests over new taxes and the rising cost of living, and Kalasinga’s loved ones believe he’s one of them.",
      "publishedAt": "2023-07-22T07:08:48Z",
      "title": "A man lies in a Kenya morgue. His family says he's one of at least 35 shot dead by police this month",
      "url": "https://apnews.com/0a2b38a6d84a1ae9bca2fa8a1589b8b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8f8be300ce347679ab5b6298a9b8781/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}