{
  "articles": [
    {
      "author": "Jiang Junzhe, Elaine Kurtenbach",
      "description": "World shares and U.S. futures have surged after the U.S. and China announced they were suspending for 90 days most of the sharp tariff hikes each has imposed since U.S. President Donald Trump escalated his trade war. A joint statement said the U.S. would cut tariffs on Chinese goods to 30% from as high as 145%. China said its tariffs on U.S. goods would fall to 10% from 125%. U.S. futures gained more than 2% early Monday and shares in Asia and Europe also jumped. The agreement to talk followed two days of meetings in Geneva, Switzerland. On Friday, the S&P 500 slipped 0.1% and the Dow industrials fell 0.3%. The Nasdaq composite was little changed.",
      "publishedAt": "2025-05-12T03:58:45Z",
      "title": "World shares and US futures advance after China-US trade pact",
      "url": "https://apnews.com/article/stocks-markets-trade-trump-catl-62fbd84396aaea011c68231363b283de",
      "urlToImage": "https://dims.apnews.com/dims4/default/952c5a2/2147483647/strip/true/crop/4260x2396+0+222/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F14%2F9b1c1975bdfed1398d39ae13c0bf%2Fb87abd4f8618423aa05bb33607186420"
    },
    {
      "author": "Josh Boak, Didi Tang",
      "description": "President Donald Trump’s agreement with China to temporarily slash tariffs for 90 days offered the world a bit of welcome relief. But what persists is a sense of uncertainty and the possibility that the damage from the trade war could already be done. Trump declared the de-escalation of the trade war a victory, saying he would soon chat with Chinese President Xi Jinping about how to preserve the financial relationship between the world’s two largest economies. Regardless, the tariffs are now elevated from when Trump took office and the scramble to respond to the White House’s mix of threats and olive branches might leave CEOs, investors and consumers unwilling to take risks.",
      "publishedAt": "2025-05-12T20:44:01Z",
      "title": "What's next with Trump's trade war truce with China",
      "url": "https://apnews.com/article/trump-tariffs-whats-next-2d597284774fddd6ad9fa4f60e783d34",
      "urlToImage": "https://dims.apnews.com/dims4/default/dadf122/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F5f%2F535b50bcd6f8b514672378c4abd6%2Faacafabb79a04180853f354498a3b19f"
    },
    {
      "author": "Matthew Lee, Rebecca Santana, Mogomotsi Magome",
      "description": "The Trump administration is welcoming a small group of white South Africans as refugees, saying they face discrimination and violence at home. That's despite pushback from the country’s government denying they are facing persecution. The decision to admit the 59 Afrikaners on Monday also has raised questions from refugee advocates about why they should be admitted when the Trump administration has suspended efforts to resettle people who are fleeing war and persecution and have gone through years of vetting. The white South Africans arrived at an airport just outside Washington on a private charter plane. They were then leaving on other flights to various U.S. destinations.",
      "publishedAt": "2025-05-12T18:05:28Z",
      "title": "Trump administration welcomes 59 white South Africans as refugees",
      "url": "https://apnews.com/article/south-africa-us-refugees-trump-afrikaners-16e34760b93cfa66f15b4cd8380743c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ba8548/2147483647/strip/true/crop/7750x4359+0+404/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2Fe8%2Ff45e681a86bf63d7e10221800457%2Fd4b30cb80a064ee1b75d913e9df7b21e"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy, Tia Goldenberg",
      "description": "The Hamas militant group says it will release an American-Israeli hostage held in Gaza during the day. In a statement, Hamas did not immediately disclose further details about the release expected on Monday. Hamas had announced on Sunday that it would free Edan Alexander as a good will gesture for the Trump administration. Alexander, an Israeli soldier, was taken captive on Oct. 7, 2023. Israeli authorities earlier acknowledged Alexander's planned release, without saying when it would happen. It would be the first hostage release since Israel shattered an 8-week ceasefire with Hamas.",
      "publishedAt": "2025-05-12T07:36:30Z",
      "title": "Hamas says it will release American-Israeli hostage Edan Alexander on Monday",
      "url": "https://apnews.com/article/mideast-wars-gaza-hostages-05-12-2025-72ca1188e3df7677870fb518191c14df",
      "urlToImage": "https://dims.apnews.com/dims4/default/464f1a1/2147483647/strip/true/crop/6510x3662+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2F58%2Ffd77369edf973ca68eb5ad1efba8%2F41e2edda21d14e8abb1f75df74171a78"
    },
    {
      "author": "Julia Frankel, Melanie Lidman",
      "description": "Edan Alexander was 19 when Hamas militants stormed the Israeli military base where the American-Israeli from New Jersey was a soldier and dragged him into the Gaza Strip. Hamas released him on Monday. Alexander had been the last living American hostage in Gaza. His release came ahead of President Donald Trump’s visit to the region this week. The militant group called it a goodwill gesture aimed at reviving mediated efforts to end the 19-month war. Alexander was among 251 people taken hostage in Hamas’ Oct. 7, 2023, attack that ignited the war. Fifty-eight remain in Gaza. Around a third are believed to be alive.",
      "publishedAt": "2025-05-12T16:17:30Z",
      "title": "Who is Edan Alexander, the Israeli-American hostage released by Hamas?",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostage-alexander-trump-d412bcc6e75ada265b5c24bd2af3571b",
      "urlToImage": "https://dims.apnews.com/dims4/default/8e70f69/2147483647/strip/true/crop/1920x1080+0+100/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fc7%2F4b8c124176e8730e8e42f62956a4%2F882aa285f3344a39b057e9f93a5a2665"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A jury has begun hearing opening arguments in Sean “Diddy” Combs’ sex trafficking trial in New York. Prosecutors and the defense started summarizing their cases Monday shortly after the 12 regular jurors and six alternates were picked. Federal prosecutors will try to prove that Combs turned his hip-hop conglomerate into a racketeering enterprise that forced women to satisfy his sexual desires. Combs has pleaded not guilty. His lawyers say prosecutors are wrongly trying to make a crime out of a party-loving lifestyle that may have been indulgent but was not illegal. Combs could get at least 15 years in prison if he is convicted on all charges.",
      "publishedAt": "2025-05-12T10:21:44Z",
      "title": "Opening statements are expected in the Sean 'Diddy' Combs trial",
      "url": "https://apnews.com/article/diddy-trial-sean-combs-cassie-3eed7dca61020818ab4e3cd842f2aab3",
      "urlToImage": "https://dims.apnews.com/dims4/default/38ca5c0/2147483647/strip/true/crop/412x232+0+35/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Fa3%2F6432a5e3a0dceccac997ce679c33%2Feec96856baf34c44aa11b4376e88f2e4"
    },
    {
      "author": null,
      "description": "A federal judge is refusing to block the Internal Revenue Service from sharing immigrants’ tax data with Immigration and Customs Enforcement for the purpose of identifying and deporting people illegally in the U.S. In a win for the Trump administration, U.S. District Judge Dabney Friedrich denied a preliminary injunction Monday in a lawsuit filed by nonprofit groups. They argued that undocumented immigrants who pay taxes are entitled to the same privacy protections as U.S. citizens and immigrants who are legally in the country. The decision comes after former acting IRS commissioner Melanie Krause resigned over the deal allowing ICE to submit names and addresses of immigrants inside the U.S. illegally to the IRS for cross-verification against tax records.",
      "publishedAt": "2025-05-12T21:45:25Z",
      "title": "Judge refuses to block IRS from sharing tax data to identify and deport people illegally in U.S.",
      "url": "https://apnews.com/article/irs-ice-tax-data-deportations-federal-judge-fd696d215843bdc16260dfad471f500d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f8a3762/2147483647/strip/true/crop/4679x2632+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F93%2Ff677259d5f6a356bd0aa0a30d51b%2Fe8968b61207a4b1ba2779e6502852355"
    },
    {
      "author": "Chris Megerian, Zeke Miller, Bernard Condon",
      "description": "For President Donald Trump, accepting a free Air Force One replacement from Qatar is a no-brainer. But Trump’s plan threatens to turn a global symbol of American power into an airborne collection of ethical, legal, security and counterintelligence concerns. He tried to tamp down some of the opposition by saying he would donate the plane to a future presidential library after his term ends. Democrats are united in outrage over the plan, and even some of the Republican president’s allies have expressed concerns. Trump will likely face persistent questions about the plane in the coming days as he travels to the Middle East.",
      "publishedAt": "2025-05-12T21:06:54Z",
      "title": "Trump's plan to accept free jet from Qatar raises questions",
      "url": "https://apnews.com/article/donald-trump-qatar-air-force-one-2ef13d87b71185bde547abe6840b098c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dadf122/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F5f%2F535b50bcd6f8b514672378c4abd6%2Faacafabb79a04180853f354498a3b19f"
    },
    {
      "author": "Tim Reynolds",
      "description": "Sometime around 6 p.m. EDT Monday, locked inside a secure room with no way of communicating with the outside world, team executives and others will watch 14 ping-pong balls start to bounce inside a machine. The balls will be numbered, 1 through 14. One will be drawn, then a second, then a third, then a fourth. And with that, the people inside that room will find out, an hour or so before the rest of the world, which team won the No. 1 pick in next month’s NBA draft. The NBA draft lottery is Monday night in Chicago, with the winner getting the chance to pick No. 1 overall.",
      "publishedAt": "2025-05-12T10:00:07Z",
      "title": "The NBA draft lottery: 14 ping-pong balls, and the right to pick No. 1 overall on the line",
      "url": "https://apnews.com/article/nba-draft-lottery-cooper-flagg-9dc3a5cffa5bf4c9b15e3222fb661c88",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d71256/2147483647/strip/true/crop/7522x4231+0+392/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F7f%2F8ba21194d19d9a5a3976f3215bc2%2F8ea548c86a214a389a05cea817d8694d"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV has called for the release of imprisoned journalists and affirmed the “precious gift of free speech and the press.” He spoke in an audience with some of the 6,000 journalists who descended on Rome to cover his election as the first American pontiff. Leo received a standing ovation as he entered the Vatican auditorium for his first meeting with representatives of the general public. The 69-year-old Augustinian missionary, elected in a 24-hour conclave last week, called for journalists to use words for peace, to reject war and to give voice to the voiceless.",
      "publishedAt": "2025-05-12T09:19:53Z",
      "title": "Pope Leo XIV urges release of imprisoned journalists, affirms gift of free speech and press",
      "url": "https://apnews.com/article/pope-leo-journalists-free-press-121ae0103b771fb3cda71ae03870853d",
      "urlToImage": "https://dims.apnews.com/dims4/default/691767d/2147483647/strip/true/crop/7105x3997+0+370/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F38%2Fb5%2F7cac2045095718b52cced11ed4ad%2F4d4f6276db544dcfaf48a2d9451f2a4a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}