{
  "articles": [
    {
      "author": "JEFF MARTIN and ISABELLA O'MALLEY",
      "description": "ATLANTA (AP) — In the final hours before Hurricane Idalia struck Florida the storm had grown into a Category 4 beast lurking off the state’s west coast, and the forecast called for it to continue intensifying up until landfall.",
      "publishedAt": "2023-09-01T04:39:02Z",
      "title": "In final hours before landfall, Hurricane Idalia stopped intensifying and turned from Tallahassee",
      "url": "https://apnews.com/bd627422701eb57c7789911509dd557a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ec239268c744d00bf4c716d88ea7fd6/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY and JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — Hawaii Gov. Josh Green said Thursday his administration has opened several investigations into people who have allegedly made unsolicited offers for property in the fire-stricken Maui town of Lahaina in violation of a new emergency order.",
      "publishedAt": "2023-09-01T03:49:14Z",
      "title": "Hawaii investigates unsolicited land offers as the state tries to keep Lahaina in local hands",
      "url": "https://apnews.com/5c4db4072dc4237da4213800444f4f17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33690964c796447ebca30df3452a4c00/1920.jpeg"
    },
    {
      "author": null,
      "description": "Russian President Vladimir Putin will host Turkish leader Recep Tayyip Erdogan for talks in Russia's Black Sea resort of Sochi on Monday, the Kremlin announced Friday, just over six weeks after Moscow broke off a deal partly brokered by Ankara that allowed Ukrainian grain to reach world markets despite the 18-month war.",
      "publishedAt": "2023-09-01T08:35:12Z",
      "title": "Russia's Putin and Turkey's Erdogan will meet amid efforts to repair Ukraine grain deal",
      "url": "https://apnews.com/92826015814bf881f5b815ef79f7ddcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3c5098dd0df413993b2069d14cca280/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY and MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — Emergency services teams have left the scene of one of South Africa's deadliest inner-city fires and pathologists faced the grisly task Friday of identifying dozens of charred bodies and some body parts that have been transported to several mortuaries across the city of Johannesburg.",
      "publishedAt": "2023-09-01T11:00:45Z",
      "title": "Emergency services leave South Africa fire scene. Now comes the grisly task of identifying bodies",
      "url": "https://apnews.com/72b243ba43549b3afb3157ca6f39f58d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e09dde8c92834c4899fbf095cf51b07a/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Two former leaders of the far-right Proud Boys extremist group were sentenced to more than a decade each in prison Thursday for spearheading an attack on the U.S.",
      "publishedAt": "2023-08-31T16:43:02Z",
      "title": "Two ex-Proud Boys leaders get some of longest sentences in Jan. 6 Capitol attack",
      "url": "https://apnews.com/5c8bf8a8e5dc6381e7387e31e554cee6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe453f688b0146d8a1c60d9667c7f27c/2446.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — In newly public testimony, Donald Trump boasts about building a multibillion-dollar brand and saving “millions of lives” as president.",
      "publishedAt": "2023-08-31T23:23:43Z",
      "title": "A look inside Donald Trump's deposition: Defiance, deflection and the 'hottest brand in the world'",
      "url": "https://apnews.com/63f4708b27a52a1e544e3caa6f63fa3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a941ecb0c564468dac9c1d21695c4b61/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and SARUUL ENKHBOLD",
      "description": "ULAANBAATAR, Mongolia (AP) — Pope Francis arrived in Mongolia on Friday morning to encourage one of the world’s smallest and newest Catholic communities. It's the first time a pope has visited the landlocked Asian country and comes at a time when the Vatican’s relations with Mongolia’s two powerful neighbors, Russia and China, are once again strained.",
      "publishedAt": "2023-08-31T16:43:22Z",
      "title": "Pope arrives on first visit to Mongolia as Vatican relations with Russia and China remain strained",
      "url": "https://apnews.com/605975020cf2e4979d1387e8b4616e53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7a045392d534f37be273df4470d57e5/1920.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — Ecuador's fragile security situation was underscored Thursday by a series of car bombings and the hostage-taking of more than 50 law enforcement officers inside various prisons, just weeks after the country was shaken by the assassination of a presidential candidate.",
      "publishedAt": "2023-08-31T15:24:48Z",
      "title": "Car bomb explosions and hostage-taking inside prisons underscore Ecuador's fragile security",
      "url": "https://apnews.com/a54e52662be79e2af5670344298a4153",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecec201e77224b3688467f8be8b0cc79/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "ORGAN PIPE CACTUS NATIONAL MONUMENT, Ariz. (AP) — Border Patrol agents ordered the young Senegalese men to wait in the scant shade of desert scrub brush while they loaded a more vulnerable group of migrants — a family with three young children from India — into a white van for the short trip in triple-degree heat to a canopied field intake center.",
      "publishedAt": "2023-09-01T05:18:31Z",
      "title": "Smugglers are steering migrants into the remote Arizona desert, posing new Border Patrol challenges",
      "url": "https://apnews.com/6910a0552681e31232f37a8f3ab7fc8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1227abb5e1254e4090e4c9ab8ae7e24f/3000.jpeg"
    },
    {
      "author": "SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Body camera footage showing the final moments of a pregnant Black woman who was shot and killed by police in an Ohio parking lot last week is expected to be released to the public on Friday.",
      "publishedAt": "2023-09-01T05:08:53Z",
      "title": "Video of police fatally shooting a pregnant Black woman set to be released, Ohio department says",
      "url": "https://apnews.com/95daff91130a64bb43848431ea4441af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30656abcd668440781121a4a47ce399b/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}