{
  "articles": [
    {
      "author": "SEUNG MIN KIM and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris appears to have energized Democrats in the early days of her candidacy, with the surge in warm feelings extending across multiple groups, including some key Democratic constituencies that had been especially tepid about President Joe Biden, a new poll shows.",
      "publishedAt": "2024-07-31T04:02:02Z",
      "title": "About 8 in 10 Democrats are satisfied with Harris in stark shift after Biden drops out: AP-NORC poll",
      "url": "https://apnews.com/1feb5ed3c2e29623ce3cec3565b487cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f361775658f4c0aae0e0642a4289bc7/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — Hamas leader Ismail Haniyeh was killed by a predawn airstrike in the Iranian capital Wednesday, Iran and the militant group said, blaming Israel for a shock assassination that risks escalating the conflict even as the U.S.",
      "publishedAt": "2024-07-31T03:09:49Z",
      "title": "Hamas leader Ismail Haniyeh is killed in Iran by an alleged Israeli strike, threatening escalation",
      "url": "https://apnews.com/30968a7acb31cd8b259de9650014b779",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89b4457bb6bb4052954bc6eb4f5fc4af/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Ismail Haniyeh, Hamas’ top leader in exile who landed on Israel’s hit list after the militant group staged its surprise Oct. 7 attacks, was killed in an airstrike in the Iranian capital early Wednesday.",
      "publishedAt": "2024-07-31T07:42:08Z",
      "title": "Ismail Haniyeh, Hamas leader on Israel's hit list since Oct. 7, is killed in an airstrike at 62",
      "url": "https://apnews.com/2d16ae7ed668b954ac0e7a53eaf92671",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cde6d04618b24e52a6a197910b909d6a/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "GENEVA (AP) — The U.N. human rights office issued a report Wednesday saying Palestinians detained by Israeli authorities since the Oct.",
      "publishedAt": "2024-07-31T06:11:35Z",
      "title": "UN report says Palestinians detained by Israeli authorities since Oct. 7 faced torture, mistreatment",
      "url": "https://apnews.com/db4555b8ba44e23d445550b10f4c35ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a90ad0be6377466fa0b0e61038906332/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is facing the delicate task of calibrating her policy pitch to American voters, a standard task for any White House hopeful but one that comes with additional challenges this year.",
      "publishedAt": "2024-07-31T04:12:04Z",
      "title": "Harris is calibrating her policy pitch for going to battle with Trump",
      "url": "https://apnews.com/f93611f3e83adf48738bfb7aefc427f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a598aecb953c47f5a223a8d6f0b831c5/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA",
      "description": "NEW DELHI (AP) — Hundreds of rescue workers searched through mud and debris Wednesday from multiple landslides that have killed at least 151 people in southern India, police said.The landslides occurred after torrential rains triggered torrents of mud and water that swept through tea estates and villages.",
      "publishedAt": "2024-07-31T02:04:59Z",
      "title": "Rescuers search through mud and debris as deaths rise to 151 in landslides in southern India",
      "url": "https://apnews.com/b32045fc9bf86b7500333eeb3311cef7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f420b0b0e06646adbd773314d1a94763/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN, GISELA SALOMON and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — The Carter Center said it was unable to verify the results of Venezuela's presidential election, blaming authorities for a “complete lack of transparency” in declaring Nicolas Maduro the winner without providing any individual polling tallies.",
      "publishedAt": "2024-07-30T15:04:38Z",
      "title": "Carter Center unable to verify Venezuela election results, blasts officials for lack of transparency",
      "url": "https://apnews.com/3ec88b273cabfee8e5696ff67d24186d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccb6a6988be9435bac989bc0072fac7c/1920.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Residents swept up broken bricks, shattered glass and burnt plastic on Wednesday after far-right protesters clashed with police outside a mosque in a northwest England town where three girls were fatally stabbed.",
      "publishedAt": "2024-07-31T08:00:01Z",
      "title": "UK leader accuses far right of hijacking a town's grief after killing of 3 children sparks violence",
      "url": "https://apnews.com/a2e43d0d49776c138790d083713873f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47aaa2128e754cfb949bda5775a1c3d8/1920.jpeg"
    },
    {
      "author": "MARIAM FAM and SALAR SALIM",
      "description": "DOHUK, Iraq (AP) — The day they came to take her children, the young mother bundled them up against the cold. She asked her nearly 6-year-old son to take care of his younger sister.“Don’t let anyone hit her,” she told the boy.",
      "publishedAt": "2024-07-31T05:44:17Z",
      "title": "She became a mother after Islamic State captivity. A decade on, Yazidi community shuns her children",
      "url": "https://apnews.com/c68c45c2ede0379658d22407cf1b72c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a3834ac511f42359eb144d33f6726c6/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Boeing named a longtime aerospace industry veteran as its next chief executive, who will take over a company that has been rocked by legal, regulatory and production problems.Robert “Kelly” Ortberg, 64, a former CEO at aerospace supplier Rockwell Collins, will succeed David Calhoun, 67, as CEO effective Aug.",
      "publishedAt": "2024-07-31T11:55:03Z",
      "title": "Boeing names new CEO as it posts a loss of more than $1.4 billion in second quarter",
      "url": "https://apnews.com/c867970f875aaa4aba81a2a541ce0ed5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ddf73c43fdc4854b05cdbd675b3cad1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}