{
  "articles": [
    {
      "author": "CLAIRE RUSH, JENNIFER SINCO KELLEHER and BEATRICE DUPUY",
      "description": "LAHAINA, Hawaii (AP) — As the death toll from a wildfire that razed a historic Maui town reached 93, authorities warned Saturday that the effort to find and identify the dead was still in its early stages.",
      "publishedAt": "2023-08-13T04:28:09Z",
      "title": "As death toll from Maui fire reaches 93, authorities say effort to count the losses is just starting",
      "url": "https://apnews.com/fb2ebf6cd39c149a582b82eed6ac3930",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b65dd804e554f9d9bae4e6b51b15839/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Seven people – including a 23-day-old baby girl – were killed in Russian shelling in Ukraine's southern Kherson region on Sunday, the country's Internal Affairs Ministry said.Artillery shelling in the village of Shiroka Balka, on the banks of the Dnieper River killed a family — a husband, wife, 12-year-old boy and 23-day-old girl — and another resident.",
      "publishedAt": "2023-08-13T11:29:13Z",
      "title": "7 killed in Ukraine's Kherson region, including a 23-day-old baby girl",
      "url": "https://apnews.com/95be9d8fbe3e3c3f8c39908a7ab1f0c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ccb00de704245918be0348c740ed892/3000.jpeg"
    },
    {
      "author": "AARON MORRISON, AISHA I. JEFFERSON and KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — As bystanders trained their smartphone cameras on the riverfront dock while several white boaters pummeled a Black riverboat co-captain, they couldn’t have known the footage would elicit a national conversation about racial solidarity.",
      "publishedAt": "2023-08-13T04:36:36Z",
      "title": "Alabama riverfront brawl videos spark a cultural moment about race, solidarity and justice",
      "url": "https://apnews.com/b190302a1f347e11868a1a8ddfbd85bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0b0546c90b744dfbc85d47b467bdfe7/2911.jpeg"
    },
    {
      "author": "ANITA SNOW and KENDRIA LaFLEUR",
      "description": "PHOENIX (AP) — Postal worker Eugene Gates Jr. was delivering mail in the suffocating Dallas heat this summer when he collapsed in a homeowner's yard and was taken to a hospital, where he died. Carla Gates said she's sure heat was a factor in her 66-year-old husband's death, even though she's still waiting for the autopsy report.",
      "publishedAt": "2023-08-13T04:17:12Z",
      "title": "Mishmash of how US heat deaths are counted complicates efforts to keep people safe as Earth warms",
      "url": "https://apnews.com/7125ad9a5289625bd9ca312945996399",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f573f7865cd43c8b88f50d9b51cc3dd/2000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — One week after a deadline passed for mutinous soldiers in Niger to reinstate the country's ousted president or face military intervention, the junta has not acquiesced. No military action has been taken and the coup leaders appear to have gained the upper hand over the regional group that issued the threat, analysts say.",
      "publishedAt": "2023-08-13T07:59:17Z",
      "title": "Niger's junta gains upper hand over regional bloc threatening military force, analysts say",
      "url": "https://apnews.com/57900b121d1fa1499354ed21aca994d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9efa9e243ce46c48ac54a9be7e2c73b/3000.jpeg"
    },
    {
      "author": "VANESSA GERA",
      "description": "WARSAW, Poland (AP) — Poland’s ruling party wants to ask voters in a referendum whether they support accepting “thousands of illegal immigrants from the Middle East and Africa” as part of a European Union relocation plan, the prime minister said Sunday, as his conservative party seeks to hold onto power in an October parliamentary election.",
      "publishedAt": "2023-08-13T07:29:45Z",
      "title": "Polish government plans referendum asking if voters want 'thousands of illegal immigrants'",
      "url": "https://apnews.com/e43f5f5f76a34a6f7f3a24b3d39fbc00",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d26faaa98e74a8e918ac297a333f7a9/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "Patients who take blockbuster drugs like Wegovy or Ozempic for weight loss may face life-threatening complications if they need surgery or other procedures that require empty stomachs for anesthesia.",
      "publishedAt": "2023-08-13T08:00:21Z",
      "title": "Popular weight-loss drugs like Wegovy may raise risk of complications under anesthesia",
      "url": "https://apnews.com/6e2556948334d0c6aa2ee0c7cbacb77d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93fb044f29f5449da86dc4c974012225/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "SAN SALVADOR, El Salvador (AP) — Douglas Guzmán's TikTok feed was dotted with workout routines and videos showcasing his favorite parts of his country. That changed about a year ago, as rights groups, civil society and even some officials criticized El Salvador's President Nayib Bukele for violating human rights in his crackdown on criminal gangs, and said that his unconstitutional bid for re-election would corrode the country’s democracy.",
      "publishedAt": "2023-08-13T04:08:04Z",
      "title": "As free press withers in El Salvador, pro-government social media influencers grow in power",
      "url": "https://apnews.com/5523937ba0e499af71e7f2ff7e72eeac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03db9c019ce74e4995206bf9692fcb3e/3000.jpeg"
    },
    {
      "author": "LOUISE DELMOTTE",
      "description": "HONG KONG (AP) — Jimmy Lai, a former newspaper publisher and one of Hong Kong’s most prominent pro-democracy activists, spends around 23 hours a day in solitary confinement in a maximum-security facility while he awaits a trial that could send him to prison for life.",
      "publishedAt": "2023-08-13T06:08:50Z",
      "title": "AP gets rare glimpse of jailed Hong Kong pro-democracy publisher Jimmy Lai",
      "url": "https://apnews.com/8e03b4415b10754255487d0b0f7b0097",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22c33d93060b49af9cfd7ff1557666a2/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB and SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — If Wisconsin state Rep. Jimmy Anderson wants to visit residents in some of the northern neighborhoods he represents, he first must leave his own district — twice.From his Fitchburg home in suburban Madison, Anderson must exit his 47th Assembly District, pass through the 77th District, reenter the 47th District, then head north through the 48th District to finally reach a cluster of homes assigned like a remote outpost to his district.",
      "publishedAt": "2023-08-13T05:00:13Z",
      "title": "Lawsuit targets Wisconsin legislative districts resembling Swiss cheese",
      "url": "https://apnews.com/b980d967c4e4375679d91278ff038c35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79a97d39b6454b89bc530d7d3c2b59b3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}