{
  "articles": [
    {
      "author": null,
      "description": "Hope of finding survivors of the catastrophic flooding in Texas is dimming a day after the death toll surpassed 100. But crews have kept up the search for people missing in the aftermath. The search efforts benefited Tuesday from improving weather. The storms that battered the Hill Country for the past four days began to lighten up, although isolated pockets of heavy rain were still possible. Texas Gov. Greg Abbott planned to make another visit Tuesday to Camp Mystic, the century-old all-girls Christian summer camp where at least 27 campers and counselors died during the flash floods. Officials said Monday that 10 campers and one counselor have still not been found.",
      "publishedAt": "2025-07-08T13:47:10Z",
      "title": "Hope of finding Texas flood survivors dims",
      "url": "https://apnews.com/article/texas-floods-victims-camp-mystic-death-toll-ea38edadc7e965fb2c76c0ec46245a82",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d5e2e5/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2F78%2Fab3d1af58f2972024068586a9c36%2F61c12c6423834405bb5b62d7ae742361"
    },
    {
      "author": null,
      "description": "Intense rainstorms are becoming more frequent in most of the U.S. — though experts say where they occur and whether they cause catastrophic flooding is largely a matter of chance. More than 100 people died in Texas Hill Country over the weekend after 12 inches of rain fell in just hours. Last year, Hurricane Helene dumped more than 30 inches of rain on western North Carolina, where flooding killed 108. Experts say human-caused climate change is setting the stage because a hotter atmosphere holds more water. But it’s impossible to predict where flooding will occur in any given year.",
      "publishedAt": "2025-07-08T15:07:16Z",
      "title": "Intense rains like those in Texas are more frequent amid climate change",
      "url": "https://apnews.com/article/texas-flood-climate-change-drought-rainfall-23bfa1a45d9897676b0fe27c81c6fa2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ab5ee0/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F45%2F84b5a8335fcba32a5b3de3851a0e%2F04ce62be79f84b78b85b1d6f19004ac2"
    },
    {
      "author": null,
      "description": "President Donald Trump on Monday set a 25% tax on goods imported from Japan and South Korea, as well as new tariff rates on a dozen other countries. Trump provided notice of the tariffs to begin on Aug. 1 by posting letters on Truth Social that were addressed to the leaders of the various countries. The letters warned them to not retaliate by increasing their own import taxes, or else the Trump administration would further increase import taxes. The higher tariffs could hinder economic growth, if not increase recession risks.",
      "publishedAt": "2025-07-07T16:40:16Z",
      "title": "Trump announces more tariffs on Japan, South Korea, Malaysia, other nations",
      "url": "https://apnews.com/article/trump-japan-south-korea-tariff-25-2c725e8f06367e20f9300c1081ea4ec0",
      "urlToImage": "https://dims.apnews.com/dims4/default/04b9b5d/2147483647/strip/true/crop/7308x4111+0+381/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fe6%2F8707d986cd61d645b72eb551835d%2Ff3a1477a770e4df0a343abb3419f5ec5"
    },
    {
      "author": null,
      "description": "The Israeli military says five soldiers were killed in an attack in northern Gaza, while health officials in the Palestinian territory say 18 people were killed in Israeli strikes. The bloodshed came as Israeli Prime Minister Benjamin Netanyahu was visiting the White House for talks with President Donald Trump about a ceasefire plan to pause the Gaza fighting. While there was no announcement of a breakthrough from that meeting, there were signs of progress toward a deal. The killings of the soldiers could add to the pressure on Netanyahu to strike a deal in Israel, where polls have shown widespread support for ending the war.",
      "publishedAt": "2025-07-08T05:15:21Z",
      "title": "5 Israeli soldiers killed in northern Gaza and 18 Palestinians dead in Israeli strikes",
      "url": "https://apnews.com/article/israel-gaza-hamas-palestinians-war-news-07-08-2025-ec0e95f8988e8624d1d4e051116709f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/bac925d/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F18%2Fc8a8d1291de0c139da2e4eff2e34%2F59bc416ceeac4ebba142c159761692a8"
    },
    {
      "author": null,
      "description": "Houthi rebels in Yemen have launched attacks on cargo ships in the Red Sea, raising fears of renewed conflict in the vital shipping corridor. On Tuesday, authorities reported an ongoing assault on the Liberian-flagged ship Eternity C, leaving two crew members injured and two missing. The attack followed a similar strike on Sunday, where the rebels sank another vessel, Magic Seas, forcing its crew to abandon ship. These incidents mark a return to Houthi aggression against shipping after a pause since March. The attacks threaten trade routes and could escalate tensions involving U.S. and Western forces in the region.",
      "publishedAt": "2025-07-08T08:36:55Z",
      "title": "Yemen rebels launch hourslong attack on ship in Red Sea",
      "url": "https://apnews.com/article/mideast-wars-yemen-houthis-israel-6dc55ee05a9d1e78621788aa0bc52168",
      "urlToImage": "https://dims.apnews.com/dims4/default/fbee862/2147483647/strip/true/crop/2160x1215+0+113/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F29%2Fdb54ca2792baddf0596de42025cb%2Fd7565b207b9b4d4ab47edd6927d74dc9"
    },
    {
      "author": null,
      "description": "The State Department is warning U.S. diplomats of attempts to impersonate Secretary of State Marco Rubio and possibly other officials using AI-driven technology. That's according to two senior officials and a cable sent last week to all embassies and consulates. The warning came after the department discovered that an impostor posing as Rubio had tried to reach out to at least three foreign ministers, a U.S. senator and a governor, according to the July 3 cable, which was first reported by The Washington Post. The recipients of the scam messages, which were sent by text, Signal and voice mail, were not identified in the cable. A copy was shared with The Associated Press.",
      "publishedAt": "2025-07-08T15:28:14Z",
      "title": "Impostor uses AI to impersonate Rubio and contact foreign and US officials",
      "url": "https://apnews.com/article/rubio-artificial-intelligence-impersonation-1b3cc78464404b54e63f4eba9dd4f5a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7776359/2147483647/strip/true/crop/5226x2940+0+272/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F66%2F860c246a84a239cc0628c7e05223%2Fe9126ff6997c425f962352dfe74ce0a7"
    },
    {
      "author": null,
      "description": "World shares are mostly higher, with financial markets shrugging off U.S. tariff pressures on its trading partners. Germany’s DAX rose 0.2% in early European trading. Britain’s FTSE 100 edged 0.2% higher while France’s CAC 40 shed 0.1%. In Asia, Japan’s Nikkei 225 added 0.3%. South Korea’s Kospi surged 1.8% and Hong Kong’s Hang Seng index climbed 1.1%. On Wall Street on Monday, stocks fell as the Trump administration stepped up pressure on trading partners to make deals before punishing tariffs imposed by the U.S. take effect. The S&P 500 lost 0.8%, the Dow Jones Industrial Average gave back 0.9% and the Nasdaq composite fell 0.9%.",
      "publishedAt": "2025-07-08T05:00:10Z",
      "title": "World shares mostly rise as markets shrug off US tariff pressures",
      "url": "https://apnews.com/article/asia-us-stocks-trump-tariff-pressures-22360b275c91795bcb71f43f8c77d577",
      "urlToImage": "https://dims.apnews.com/dims4/default/f60a878/2147483647/strip/true/crop/4209x2368+0+219/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F85%2F84c62d855f95bf1ac5455e905ad0%2Fcaed0f2a26d84253adc3e930854610d3"
    },
    {
      "author": null,
      "description": "Filmmaker Peter Jackson's fascination with a large extinct New Zealand bird has led to an unusual partnership with a biotech company known for its grand and controversial plans to bring back lost species. Colossal Biosciences on Tuesday announced an effort to genetically engineer living birds to resemble the extinct South Island giant moa with $15 million in funding from Jackson and his partner Fran Walsh. Outside scientists say the idea of bringing back extinct species onto the modern landscape is likely impossible, although it may be feasible to tweak the genes of living animals to have similar physical traits.",
      "publishedAt": "2025-07-08T17:08:23Z",
      "title": "Peter Jackson wants to bring back this giant New Zealand bird from extinction",
      "url": "https://apnews.com/article/peter-jackson-moa-de-extinction-colossal-biosciences-04260e26cbe04e787640c9502df94dda",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff30423/2147483647/strip/true/crop/2604x1465+0+136/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F6e%2F6e692cc2aa94a16f43f1dc46fd16%2Fd82242fc8e44461688588d8eb249b228"
    },
    {
      "author": null,
      "description": "For the first time in almost 20 years, travelers may no longer have to take off their shoes during security screenings at certain U.S. airports. The Transportation Security Administration is looking to abandon the requirement, according to media reports. If implemented, it would put an end to a security screening mandate put in place almost 20 years ago, several years after “shoe bomber” Richard Reid’s attempt to take down a flight from Paris to Miami in late 2001. Travel newsletter Gate Access was first to report that the security screening change is coming, with ABC News citing an internal memo sent to TSA officers last week that states the new policy lets travelers keep their shoes on during screenings at many U.S. airports beginning on Sunday.",
      "publishedAt": "2025-07-08T13:53:49Z",
      "title": "Removing shoes to board a plane make be a thing of the past",
      "url": "https://apnews.com/article/tsa-shoes-security-precheck-bush-real-id-1b9fda716f7a24eddf2e706857f2b788",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3e36e7/2147483647/strip/true/crop/2910x1637+0+231/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F04%2F37%2F20b58fafee8e898adce49637f02e%2Fb7811b9a845d44959d2fe38d3e29ca42"
    },
    {
      "author": null,
      "description": "The horrific killing of a police bloodhound has outraged Italians and sparked a criminal investigation to find his killers. Bruno had found nine people during his sniffer-dog career. He was found dead Friday morning in his shed in southern Taranto. Bruno's trainer Arcangelo Caressa said that he had been fed bits of dog food laced with nails. Caressa urged police in a social media post on Tuesday to “find the killers before I do.” Premier Giorgia Meloni was photographed with Bruno after one of his rescues. She said that his slaughter was “vile, cowardly, unacceptable.” Lawmaker Michael Vittoria Brambilla filed a criminal complaint with prosecutors under a new law that she helped push through stiffening penalties for anyone who kills or mistreats an animal.",
      "publishedAt": "2025-07-08T12:55:01Z",
      "title": "Italy outraged at killing of heroic police bloodhound, found dead after eating food laced with nails",
      "url": "https://apnews.com/article/italy-police-dog-killed-bloodhound-nails-2c500f70d034e683f2ffe41ece2066ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/efdb607/2147483647/strip/true/crop/2400x1350+0+125/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F5d%2F71d629636172c6f64672f49128b7%2F39bb75c9c9044c4c89ec13f6e16a766b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}