{
  "articles": [
    {
      "author": "JACK JEFFERY and TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — Israel's military announced Sunday it had withdrawn its forces from the southern Gaza city of Khan Younis, wrapping up a key phase in its ground offensive against the Hamas militant group and bringing its troop presence in the territory to one of the lowest levels since the six-month war began.",
      "publishedAt": "2024-04-07T13:12:13Z",
      "title": "Israel is pulling some troops from southern Gaza. Now the plan is to clear Hamas from Rafah",
      "url": "https://apnews.com/5257a90302686de80788469f74aab40c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9846a4978fdd43dda734b41a4e0f0dfd/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — The head of the U.N.’s atomic watchdog agency on Sunday condemned a Ukrainian drone strike on one of six nuclear reactors at the Russian-controlled Zaporizhzhia Nuclear Power Plant in Ukraine, saying such attacks “significantly increase the risk of a major nuclear accident.\"",
      "publishedAt": "2024-04-07T14:34:25Z",
      "title": "Attacks on Zaporizhzhia nuclear plant significantly increase accident risk, IAEA head says",
      "url": "https://apnews.com/a28710a691f3259b5dd6586787838b60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f4e0850dd5b4556b68a1df613b99b1d/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump says he will finally announce Monday when he believes abortions should be banned, after months of refusing to stake a position on an issue that could decide the outcome of November’s presidential election.",
      "publishedAt": "2024-04-08T04:42:49Z",
      "title": "Trump says he'll announce his position on abortion Monday, a key moment in the presidential race",
      "url": "https://apnews.com/7bf06e0856b88a710c79a6eb85cffa6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cfcf92aafcb4775b29a3ca4005bd471/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "MESQUITE, Texas (AP) — Millions of spectators along a narrow corridor stretching from Mexico to the U.S. to Canada eagerly awaited Monday's celestial sensation — a total eclipse of the sun — even as forecasters called for clouds.",
      "publishedAt": "2024-04-08T05:00:20Z",
      "title": "Huge crowds await a total solar eclipse in North America. Clouds may spoil the view",
      "url": "https://apnews.com/a667cf827dd4d78d1f41fdd5483e3508",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01b98a825a214f8a943c8962ffbd5fa5/3000.jpeg"
    },
    {
      "author": "BY FARAI MUTSAKA",
      "description": "HARARE, Zimbabwe (AP) — A makeshift ferry sank off Mozambique’s northern coast on Sunday, killing more than 90 people including children, local media reported.The overcrowded boat was carrying 130 people and many of those who drowned were children, according to TV Diário Nampula, a local online outlet.",
      "publishedAt": "2024-04-08T05:32:59Z",
      "title": "Mozambique ferry accident leaves more than 90 people dead including children, local media say",
      "url": "https://apnews.com/cea57d8dc3e70ed5165ae8a3f5719b98",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "BALTIMORE (AP) — Salvage crews on Sunday began removing containers from the deck of the cargo ship that crashed into and collapsed the Francis Scott Key Bridge in Baltimore, an important step toward the full reopening of one of the nation’s main shipping lanes.",
      "publishedAt": "2024-04-08T01:23:53Z",
      "title": "Salvage crews have begun removing containers from the ship that collapsed Baltimore's Key bridge",
      "url": "https://apnews.com/c08089b5a4226a8b67adb2895d8b8759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a407f613d234434beada04805a93106/1500.jpeg"
    },
    {
      "author": "DAVID BILLER",
      "description": "RIO DE JANEIRO (AP) — A crusading Brazilian Supreme Court justice included Elon Musk as a target in an ongoing investigation over the dissemination of fake news and opened a separate investigation late Sunday into the executive for alleged obstruction.",
      "publishedAt": "2024-04-08T02:04:35Z",
      "title": "Brazil Supreme Court justice orders investigation of Elon Musk over fake news and obstruction",
      "url": "https://apnews.com/a645757b95a66ee658832802908466ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df7457d0b2b94a3b8f6615c39d18a96b/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and ANITA SNOW",
      "description": "PHOENIX (AP) — As ranchera music filled the Phoenix recording studio at Radio Campesina, a station personality spoke in Spanish into the microphone.“Friends of Campesina, in these elections, truth and unity are more important than ever,” said morning show host Tony Arias.",
      "publishedAt": "2024-04-08T04:12:20Z",
      "title": "Latino voters are coveted by both major parties. They also are a target for election misinformation",
      "url": "https://apnews.com/563ff36ba39d38d55eeb5d29d93d400e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/adedc220bda84fca9881a6bb667f89fb/1920.jpeg"
    },
    {
      "author": "DIDI TANG",
      "description": "WASHINGTON (AP) — The U.S. has denounced Hong Kong’s new national security law as a tool to potentially silence dissent both at home and abroad, but so far the action from Washington has been notably muted, disappointing those fighting for the Chinese territory's democracy and freedoms.",
      "publishedAt": "2024-04-08T04:03:58Z",
      "title": "US treads carefully in responding to Hong Kong's new national security law",
      "url": "https://apnews.com/50da83ec3957b3e72c746ff3286b1f8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b4dd99a7cdd41d6b2905fe05c8dfc39/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "CLEVELAND (AP) — Kamilla Cardoso delivered once again for Dawn Staley and South Carolina.A perfect finish.",
      "publishedAt": "2024-04-07T21:13:59Z",
      "title": "South Carolina finishes perfect season with NCAA championship, beating Clark and Iowa 87-75",
      "url": "https://apnews.com/80c556d6a9130a301d0f59e6eb997a4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c886f27e68274907a33b1d9c2321173d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}