{
  "articles": [
    {
      "author": "KIMBERLY CHANDLER and CHRISTOPHER O'MEARA",
      "description": "TAMPA, Fla. (AP) — The center of Hurricane Debby is expected to reach the Big Bend coast of Florida early Monday bringing potential record-setting rains, catastrophic flooding and life-threatening storm surge as it moves slowly across the northern part of the state before stalling over the coastal regions of Georgia and South Carolina.",
      "publishedAt": "2024-08-05T05:26:55Z",
      "title": "Hurricane Debby to bring heavy rains and catastropic flooding to Florida, Georgia and S. Carolina",
      "url": "https://apnews.com/eb9fc50d578826784824f35ba943a6da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5702b2535f24eb1b0db1c7e88a39874/1920.jpeg"
    },
    {
      "author": "NATALIE MELZER and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Israel is already in a “multi-front war” with Iran and its proxies, Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting Sunday, as the United States and allies prepared to defend Israel from an expected counterstrike and prevent an even more destructive regional conflict.",
      "publishedAt": "2024-08-04T05:44:53Z",
      "title": "US and allies prepare to defend Israel as Netanyahu says it's already in 'multi-front war' with Iran",
      "url": "https://apnews.com/5b480a3b22538edec9fa05908f28303f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ccf20b315ff4b75b95327266b0880ab/1920.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — Anti-government protesters across Bangladesh planned to march to the capital, Dhaka, on Monday after a weekend of violence that left dozens of people dead, as the military imposed a curfew for an indefinite period and authorities cut off mobile internet in an attempt to stem the unrest.",
      "publishedAt": "2024-08-05T05:04:29Z",
      "title": "Anti-government protesters in Bangladesh plan to march to capital after a weekend of deadly clashes",
      "url": "https://apnews.com/fdc7f2632c3d8fcbd913e6c0a1903fd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b66de4f87fff4b289b40bbb8b97c8b9b/1920.jpeg"
    },
    {
      "author": "ELAINE KURTENBACH",
      "description": "BANGKOK (AP) — Japan’s benchmark Nikkei 225 stock index plunged nearly 13% on Monday, extending sell-offs that shook world markets last week as worries flared over the state of the U.S. economy. Near closing time in Tokyo, the Nikkei was down more than 4,500 points at 31,341.29.",
      "publishedAt": "2024-08-05T00:40:50Z",
      "title": "Japan's Nikkei 225 index plunges nearly 13% as world markets tremble over risks to the US economy",
      "url": "https://apnews.com/c6240977e9482bf7207abc53b2a11e58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/148a8bc547f9429fb7cb9d9b90bcc34c/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "One Republican strategist who has run campaigns against Donald Trump says he recognizes what the former president is doing against Vice President Kamala Harris, even as Trump swings back and forth between attacking her record and questioning her racial identity.",
      "publishedAt": "2024-08-05T04:04:52Z",
      "title": "Focus on economy and answer the Harris 'Freedom' message: What GOP strategists think Trump should do",
      "url": "https://apnews.com/385938de6937924f131f8a7b4ee3858b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd84c30f00a44fb4bb4e5bc2dddf7a5d/3000.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — Facing the need to win battleground Pennsylvania, Vice President Kamala Harris is swearing off any prior assertion that she opposed fracking, but that hasn't stopped Republican Donald Trump from wielding her now-abandoned position to win over voters in a state where the natural gas industry means jobs.",
      "publishedAt": "2024-08-05T04:04:38Z",
      "title": "Harris once wanted to ban fracking. Trump wants voters in energy-rich Pennsylvania to remember",
      "url": "https://apnews.com/104f3f051df4d28e4645f05051eb6cff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d9c7b128c64415f96057772bf46ff2c/3000.jpeg"
    },
    {
      "author": "KADDOUR HABBARI and GREG BEACHAM",
      "description": "PARIS (AP) — Olympic boxer Imane Khelif said the wave of hateful scrutiny she has faced over misconceptions about her gender “harms human dignity,” and she called for an end to bullying athletes after being greatly affected by the international backlash against her.",
      "publishedAt": "2024-08-04T23:47:56Z",
      "title": "Olympic boxer Imane Khelif calls for end to bullying after backlash over gender misconceptions",
      "url": "https://apnews.com/7b171980b05bcef2117a7615f212eba9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec8032b755834c00b8ae42d46d49d9ff/1920.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ",
      "description": "CARACAS, Venezuela (AP) — Voices across the globe expressed concern Sunday over the growing number of arrests in Venezuela following last weekend’s disputed elections. Pope Francis said Venezuela is “living a critical situation” in his traditional Sunday remarks at the Vatican, adding, “I appeal to all parties to seek the truth, to avoid all kinds of violence.”",
      "publishedAt": "2024-08-04T17:23:04Z",
      "title": "Voices across the globe express concern over increasing arrests in Venezuela after disputed election",
      "url": "https://apnews.com/abb8176b46004554e59ec77f95130efe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa85a16f6ee74630ac9468b64b61e17e/1920.jpeg"
    },
    {
      "author": "PAN PYLAS",
      "description": "LONDON (AP) — U.K. Prime Minister Keir Starmer strongly condemned an attack Sunday on a hotel housing asylum seekers that saw at least 10 police officers injured, one seriously, describing it as “far-right thuggery.\"",
      "publishedAt": "2024-08-04T09:13:18Z",
      "title": "UK leader Starmer condemns attack on asylum-seeker hotel as far-right violence spreads",
      "url": "https://apnews.com/2de808d796f81f719950acb4ea6f0af5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b8676f59f05f4adaa228906b7babadc9/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK and SUMAN NAISHADHAM",
      "description": "PARIS (AP) — At the Paris Olympics, whether the water quality in the Seine River is safe enough to host some swimming events has been a major question.",
      "publishedAt": "2024-08-04T12:00:52Z",
      "title": "More Olympians are set to compete in the Seine River. Here's the latest on water quality concerns",
      "url": "https://apnews.com/66913280ee4a04e0e3012c3a2d7d3ef5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd8fecaf4ae0494a881f040874498d60/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}