{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAM MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel's war to destroy Hamas has killed more than 20,000 Palestinians, health officials in Gaza said Friday, as Israel expanded its offensive and ordered tens of thousands more people to leave their homes.",
      "publishedAt": "2023-12-22T05:27:23Z",
      "title": "Gaza death toll exceeds 20,000 as Israel expands ground war against Hamas",
      "url": "https://apnews.com/7453c6f92d74eb1e12e506489031b91b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56057d3891834b88b3e90226251c15e5/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.N. Security Council adopted a watered-down resolution Friday calling for immediate speeded-up aid deliveries to hungry and desperate civilians in Gaza – but without the original call for an “urgent suspension of hostilities” between Israel and Hamas.",
      "publishedAt": "2023-12-22T16:38:49Z",
      "title": "UN approves watered-down resolution on aid to Gaza without call for suspension of hostilities",
      "url": "https://apnews.com/a5bb32fb9f071689d231533a26beb838",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/941881916081408698f98d5ed4ed92f3/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump says he is eager to debate President Joe Biden, even if the debates are sponsored by the nonpartisan Commission on Presidential Debates.",
      "publishedAt": "2023-12-22T18:55:50Z",
      "title": "Trump says he’s eager to debate Biden in 2024, even if controversial commission plans events",
      "url": "https://apnews.com/428216dc2a0e9692a64dfde800753f72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbc94b4816904e9aa078340f955f28ce/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY",
      "description": "CAPE TOWN, South Africa (AP) — In an extraordinary pushback against Pope Francis, some Catholic bishops in Africa, Poland and elsewhere say they will not implement the new Vatican policy allowing blessings for same-sex couples.",
      "publishedAt": "2023-12-22T17:52:10Z",
      "title": "Some Catholic bishops reject Pope's stance on blessings for same-sex couples. Others are confused",
      "url": "https://apnews.com/baabeaf96ad180aa20e1df9fb4b4657e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b611d31a7e44585a5d8e545c6735bd1/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — This Congress started with showy bluster, a bitter 15-round, multi-day spectacle to elect a House speaker, a Republican who vowed to “never quit,” and then did just that.",
      "publishedAt": "2023-12-22T05:05:37Z",
      "title": "Punishing their own but passing few laws, a Congress in chaos leaves much to do in 2024",
      "url": "https://apnews.com/dda73a13a198293803e386976cf3414d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7b52ffd0a8945dbbca0fc184a36edc6/3000.jpeg"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "WASHINGTON (AP) — The Federal Reserve’s preferred measure of prices fell last month, another sign that inflation is easing and that Americans should benefit from reduced interest rates and get relief from painful price shocks in 2024.",
      "publishedAt": "2023-12-22T13:37:04Z",
      "title": "Federal Reserve's favored inflation gauge tumbles in November as prices continue to ease",
      "url": "https://apnews.com/bc386c513bbe3cd392360c8bc9283016",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20e6453b1850448ab6d08b8cb8bbfc34/3000.jpeg"
    },
    {
      "author": "ZEKE MLLER",
      "description": "WASHINGTON (AP) — President Joe Biden pardoned thousands of people who were convicted of use and simple possession of marijuana on federal lands and in the District of Columbia, the White House said Friday, in his latest round of executive clemencies meant to rectify racial disparities in the justice system.",
      "publishedAt": "2023-12-22T13:18:09Z",
      "title": "Biden pardons thousands convicted of marijuana charges on federal lands and in Washington",
      "url": "https://apnews.com/02abde991a05ff7dfa29bfc3c74e9d64",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/585c0dca0a13452abd30650b6ffb419c/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "PORTLAND, Maine (AP) — Police in Maine feared that confronting an Army reservist prior to the worst mass shooting in state history would “throw a stick of dynamite on a pool of gas,” according to video footage released by law enforcement.",
      "publishedAt": "2023-12-22T18:20:45Z",
      "title": "Police video shows police knew Maine shooter was a threat. They also felt confronting him was unsafe",
      "url": "https://apnews.com/96ecb7b9c02f84505592b55f779be617",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0e1b1fd9ea3440181c5943eef6cfaf2/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — Look for flu and COVID-19 infections to ramp up in the coming weeks, U.S. health officials say, with increases fueled by holiday gatherings, too many unvaccinated people and a new version of the coronavirus that may be spreading more easily.",
      "publishedAt": "2023-12-22T18:37:10Z",
      "title": "Flu and COVID infections are rising and could get worse over the holidays, CDC says",
      "url": "https://apnews.com/f382233d2d15301c75c7d3b3ba82c800",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c122feaea92d4719a3a929427660c925/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON",
      "description": "NEW YORK (AP) — The holiday travel rush hit its peak Friday as mild weather and lower flight cancelation rates raised hopes for merrier drivers and airline passengers than last year.",
      "publishedAt": "2023-12-22T12:44:05Z",
      "title": "Busiest holiday travel season in years is off to a smooth start with few airport delays",
      "url": "https://apnews.com/8f7958fda3dabda82494a5effb143eea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f02ba4f2149a4e63b3c323336c8ed6c0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}