{
  "articles": [
    {
      "author": "JILL LAWLESS and BRIAN MELLEY",
      "description": "LONDON (AP) — Far-right protesters fueled by anger and false online rumors hurled bottles and stones at officers and set a police van ablaze Tuesday outside a northwest England mosque near where three girls were fatally stabbed a day earlier.",
      "publishedAt": "2024-07-30T08:44:04Z",
      "title": "Police clash with a violent crowd gathered near the site of UK stabbing attack that killed 3 girls",
      "url": "https://apnews.com/8a9c7d7ed01441ce96332cd3d1250e43",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a72c68a47e714b5ab221f3f3b9deadc5/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE and TIA GOLDENBERG",
      "description": "BEIRUT (AP) — Israel on Tuesday carried out a rare strike on Beirut, which it said killed a top Hezbollah commander who was allegedly behind a weekend rocket attack that killed 12 young people in the Israeli-controlled Golan Heights.",
      "publishedAt": "2024-07-30T17:19:34Z",
      "title": "Israel carries out rare strike on Beirut that it says killed Hezbollah commander",
      "url": "https://apnews.com/52c2a1711e274859b60daf8d2db3e0e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1132830c3bb42da9958c6916b2b54e7/1920.jpeg"
    },
    {
      "author": "ALI SWENSON and LISA MASCARO",
      "description": "NEW YORK (AP) — The director of the Heritage Foundation's Project 2025 vision for a complete overhaul of the federal government stepped down Tuesday after blowback from Donald Trump's campaign, which has tried to disavow the program created by many of the former president's allies and former aides.",
      "publishedAt": "2024-07-30T19:40:28Z",
      "title": "Project 2025 shakes up leadership after criticism from Democrats and Trump, but says work goes on",
      "url": "https://apnews.com/e2674ea34da786d85e97c0908b0b98a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39648ce696014c138d5e4956bb60dd2c/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — U.S. President Joe Biden and Brazilian President Luiz Inácio Lula da Silva on Tuesday agreed that Venezuela must release detailed voting data from Sunday’s presidential vote after electoral authorities friendly to President Nicolás Maduro declared him the winner in a result disputed by the opposition.",
      "publishedAt": "2024-07-30T15:04:38Z",
      "title": "Biden and Lula urge Venezuelan authorities to release detailed presidential election voting data",
      "url": "https://apnews.com/3ec88b273cabfee8e5696ff67d24186d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1d2399412cc4654b4de0367c6cdfd4e/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and BILL BARROW",
      "description": "ATLANTA (AP) — Vice President Kamala Harris told a cheering, boisterous, packed arena on Tuesday that the next few months would be a serious fight and acknowledged the Democrats were right now the underdogs — but assured the crowd they would win in November.",
      "publishedAt": "2024-07-30T04:08:32Z",
      "title": "At boisterous Georgia rally, Harris says she will show Trump 'what real leadership looks like'",
      "url": "https://apnews.com/4454ff5825d8f6cf90929147f5b84a71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3ab1a709bd74e0f9987612a52d042d8/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — Donald Trump's invitation to address the National Association of Black Journalists has sparked an intense debate within the organization and a flurry of arguments online.",
      "publishedAt": "2024-07-30T21:09:59Z",
      "title": "A speaking invitation to Donald Trump splits the most prominent American group for Black journalists",
      "url": "https://apnews.com/c84311a4e3bec3fe3052236151597d81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34fce797702d4e54959a991a5da9e464/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, FARNOUSH AMIRI, REBECCA SANTANA and CLAUDIA LAUER",
      "description": "WASHINGTON (AP) — The Secret Service's acting director told lawmakers Tuesday that he considered it indefensible that the roof used by the gunman in the attempted assassination of former President Donald Trump was unsecured and said it was regrettable that local law enforcement had not alerted his agency before the shooting that an armed subject had been spotted on a nearby roof.",
      "publishedAt": "2024-07-30T04:05:05Z",
      "title": "Acting Secret Service director says he's 'ashamed' after the Trump assassination attempt",
      "url": "https://apnews.com/a382e3ec081dd13e85eaa9e726cca02c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fcd329c5ad540dab9dd07d42b26ba09/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — Simone Biles, Jordan Chiles and Sunisa Lee spent the night before perhaps the biggest gymnastics meet of their lives restless.There was a tension in the air.",
      "publishedAt": "2024-07-30T16:17:14Z",
      "title": "Simone Biles and Team USA earn 'redemption' by powering to Olympic gold in women's gymnastics",
      "url": "https://apnews.com/f6863232f86ee3a7f8e0bf2ec1e47519",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e617f0b120a45b7a2d7a8345eee924e/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "BILLINGS, Mont. (AP) — At least 973 Native American children died in the U.S. government’s abusive boarding school system, according to the results of an investigation released Tuesday by Interior Department officials who called on the government to apologize for the schools.",
      "publishedAt": "2024-07-30T18:32:42Z",
      "title": "Investigation finds at least 973 Native American children died in US government boarding schools",
      "url": "https://apnews.com/82645234fe9d7ce689e8375a51d7e161",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c8a663dc2664cabb1e15df500bdca28/1620.jpeg"
    },
    {
      "author": "NADIA LATHAN",
      "description": "AUSTIN, Texas (AP) — Meta has agreed to a $1.4 billion settlement with Texas in a privacy lawsuit over allegations that the tech giant used biometric data of users without their permission, officials said Tuesday.",
      "publishedAt": "2024-07-30T15:35:54Z",
      "title": "Meta agrees to $1.4B settlement with Texas in privacy lawsuit over facial recognition",
      "url": "https://apnews.com/3ed4d9c3c3abc4494a3731eac8643e4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/236183339b694f1591cbb1ade4356fa6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}