{
  "articles": [
    {
      "author": "TERRY SPENCER",
      "description": "PERRY, Fla. (AP) — Hurricane Idalia tore into Florida at the speed of a fast-moving train Wednesday, splitting trees in half, ripping roofs off hotels and turning small cars into boats before sweeping into Georgia and South Carolina as a still-powerful storm that flooded roadways and sent residents running for higher ground.",
      "publishedAt": "2023-08-30T04:37:06Z",
      "title": "Hurricane Idalia hits Florida with 125 mph winds, flooding streets, snapping trees and cutting power",
      "url": "https://apnews.com/2136985ceea53f5deb600c43aeea1138",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa2d537215424489af2bb00f683e6d3c/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "As former President Donald Trump continues to dominate the Republican presidential primary, some liberal groups and a growing number of legal experts contend that a rarely used clause of the Constitution prevents him from being president after the Jan.",
      "publishedAt": "2023-08-31T04:05:12Z",
      "title": "Groups seek to use the Constitution's 'insurrection' clause to block Trump from 2024 ballots",
      "url": "https://apnews.com/9c5f79203109ba221b35a48e708ad725",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4553602e05a41858e2f7907b166cce6/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — The National Weather Service on Wednesday warned gusty winds and low humidity have increased the risk that fires could spread rapidly in the western parts of each Hawaiian island, three weeks after a deadly blaze tore through a coastal Maui town during a similar alert.",
      "publishedAt": "2023-08-31T03:01:28Z",
      "title": "Forecasters are warning gusty winds and low humidity raise risk of fires spreading rapidly in Hawaii",
      "url": "https://apnews.com/4dfee66d3185b1a1f7ea5a946bce9eb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/231c5b14f22b48daa11a85e43f646287/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "Before the fatal shootings of three Black residents in Jacksonville, Florida, over the weekend, the gunman, a young white man with swastikas painted on his rifle, pulled into a parking lot at Edward Waters University and began putting on tactical gear.",
      "publishedAt": "2023-08-31T04:03:47Z",
      "title": "After Jacksonville shootings, historically Black colleges address security concerns, remain vigilant",
      "url": "https://apnews.com/6aa28d01fe5086b1dfdf5df2e72c2e35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f419de6bd8ab46a394d03a31b4a230f1/3000.jpeg"
    },
    {
      "author": "YVES LAURENT GOMA and SAM MEDNICK",
      "description": "LIBREVILLE, Gabon (AP) — Mutinous soldiers in Gabon proclaimed their republican guard chief as the country’s leader Wednesday after placing the just-reelected President Ali Bongo Ondimba under house arrest, alleging betrayal and massive embezzlement during his long-time rule over the oil-rich Central African nation.",
      "publishedAt": "2023-08-30T05:30:37Z",
      "title": "Mutineers in Gabon appoint a military leader after detaining the president, alleging corruption",
      "url": "https://apnews.com/a61d03963f75ae93ba85a4ba7eec3c71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60febf1770504f3784b2ea6c7566e210/1920.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japan’s Prime Minister Fumio Kishida sampled seafood and talked to workers at Tokyo’s Toyosu fish market Thursday to assess the impact of China’s ban on Japanese seafood in reaction to the release of treated radioactive wastewater from the wrecked Fukushima Daiichi plant to the sea.",
      "publishedAt": "2023-08-31T04:02:30Z",
      "title": "Japan's PM visits fish market, vows to help fisheries hit by China ban over Fukushima water release",
      "url": "https://apnews.com/57a6ecb7da4e8b0430fa4446fd44d85d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69b035910158493481f34ba603a0d20d/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korea said Thursday its latest missile launches simulated “scorched earth” nuclear strikes on South Korea and that it’s also been rehearsing an occupation of its rivals’ territory in the event of conflict.",
      "publishedAt": "2023-08-31T04:08:22Z",
      "title": "North Korea says it simulated nuclear attacks on South Korea and rehearsed occupation of its rivals",
      "url": "https://apnews.com/bfa7bd8c0970f5382395874807c1444d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d07e608d2a544f9c96b77f995a4ffce2/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A federal judge on Wednesday held Rudy Giuliani liable in a defamation lawsuit brought by two Georgia election workers who say they were falsely accused of fraud, ruling that the former New York city mayor gave “only lip service” to complying with his legal obligations while trying to portray himself as the victim in the case.",
      "publishedAt": "2023-08-30T15:49:26Z",
      "title": "Judge holds Giuliani liable in Georgia election workers' defamation case for withholding information",
      "url": "https://apnews.com/9b561a195fb74d991abc89d1b6587d66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d50ecb82794245eea12cbe2b33819d92/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — The U.S. Department of Health and Human Services has delivered a recommendation to the Drug Enforcement Administration on marijuana policy, and Senate leaders hailed it Wednesday as a first step toward easing federal restrictions on the drug.",
      "publishedAt": "2023-08-31T01:39:52Z",
      "title": "Marijuana recommendation by US health agency hailed as first step to easing weed restrictions",
      "url": "https://apnews.com/c00db5dabbeb9efd94cf17baff241e85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8030e816db5c4ae1bca4bd01263c9319/3000.jpeg"
    },
    {
      "author": "TERRY TANG",
      "description": "PHOENIX (AP) — Andrea Nissen is trying to prepare her 65-year-old husband, who has Alzheimer’s disease, for a solo flight from Arizona to Oklahoma to visit family. She worries about travelers and airport officials misinterpreting his forgetfulness or habit of getting in people's personal space, and feels guilty about not being able to accompany him.",
      "publishedAt": "2023-08-31T04:31:15Z",
      "title": "Some US airports strive to make flying more inclusive for those with dementia",
      "url": "https://apnews.com/1a69e61fbec6e5a98bcf8a60d50aa840",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66cfc162036c4a5786e850fad7aab123/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}