{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The fragile cease-fire between Israel and Hamas was back on track Sunday as the militants freed 17 more hostages, including 14 Israelis and the first American, in a third exchange under a four-day truce that the U.S.",
      "publishedAt": "2023-11-26T07:30:14Z",
      "title": "Hamas releases third group of hostages as part of truce, and says it will seek to extend the deal",
      "url": "https://apnews.com/556b251fadc25a234a499e957edd218d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c34956a6cb1a4b019734c5e92b214554/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Plastic chairs as beds. Meals of bread and rice. Hours spent waiting for the bathroom. As former hostages return to Israel after seven weeks of Hamas captivity, information about the conditions of their confinement has emerged.",
      "publishedAt": "2023-11-26T23:08:11Z",
      "title": "Irregular meals, benches as beds. As freed hostages return to Israel, details of captivity emerge",
      "url": "https://apnews.com/612542191742082f330d55433c012a05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47d0c209ee864910b940975c35a881df/1600.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — As Congress returns to session this week, lawmakers will be trying to forge an agreement on sending a new round of wartime assistance to Ukraine.",
      "publishedAt": "2023-11-26T12:30:07Z",
      "title": "Republicans want to pair border security with aid for Ukraine. Here's why that makes a deal so tough",
      "url": "https://apnews.com/dba31c3f461e1fa940f9cf00988444f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a0086ced688497c855783ad14fdbfd8/3000.jpeg"
    },
    {
      "author": "ERIKA KINETZ",
      "description": "In audio intercepts from the front lines in Ukraine, Russian soldiers speak in shorthand of 200s to mean dead, 300s to mean wounded. The urge to flee has become common enough that they also talk of 500s — people who refuse to fight.",
      "publishedAt": "2023-11-26T05:47:42Z",
      "title": "Dead, wounded or AWOL: The voices of desperate Russian soldiers trying to get out of the Ukraine war",
      "url": "https://apnews.com/d2418788051731a32689feb821cd29ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f48793f42794a7897c3ff5be7632563/1920.jpeg"
    },
    {
      "author": "KATHY McCORMACK",
      "description": "Three young men of Palestinian descent who were in Burlington for a Thanksgiving holiday gathering were shot and injured — one seriously — near the University of Vermont, police said Sunday. Authorities said the attack may have been a hate crime.",
      "publishedAt": "2023-11-26T18:55:41Z",
      "title": "3 men of Palestinian descent attending holiday gathering shot, injured near University of Vermont",
      "url": "https://apnews.com/ab836d1941e4237b3649353eaceb4092",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c585f68ffaaf4039953281422c020d09/3000.jpeg"
    },
    {
      "author": null,
      "description": "PORTLAND, Ore. (AP) — Oregon’s largest school district said late Sunday it had reached a tentative agreement with its teachers union and roughly 45,000 students would be back in school Monday after more than three weeks without classes.",
      "publishedAt": "2023-11-27T01:38:19Z",
      "title": "Schools in Portland, Oregon, reach tentative deal with teachers union after nearly month-long strike",
      "url": "https://apnews.com/dac8cc02e5a74cff73d8208f148b5924",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d127c1305b844a37a55ea9577d16e0b7/3000.jpeg"
    },
    {
      "author": "NICK PERRY",
      "description": "WELLINGTON, New Zealand (AP) — Christopher Luxon was sworn in as New Zealand's prime minister on Monday and said his top priority was to improve the economy.The 53-year-old former businessman leads a conservative coalition after his National Party struck a deal Friday with two smaller parties following a general election last month.",
      "publishedAt": "2023-11-27T02:20:02Z",
      "title": "Christopher Luxon sworn in as New Zealand prime minister, says priority is to improve economy",
      "url": "https://apnews.com/f3f6c4c80b75521647b8e61e5ff71673",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a2b94dd88de34b518f5f67b832c2375e/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — In a city known for its excesses, whether reaching toward the sky with the world's tallest building or hard partying at its beach resorts and bars, Dubai has pulled off another record-breaking feat in the rolling dunes of its desert outskirts.",
      "publishedAt": "2023-11-26T05:05:27Z",
      "title": "Skyscraper-studded Dubai has flourished during regional crises. Could it benefit from hosting COP28?",
      "url": "https://apnews.com/113f2b2c75431d2ab0d3d54be1681239",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a48108703c346b7a0c4d42faf791c96/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — In spring 1955, Rosalynn Carter was doing what she had sworn to avoid when she married an ambitious Naval officer: keeping house and raising children in the same tiny town where they grew up.",
      "publishedAt": "2023-11-26T13:07:55Z",
      "title": "Rosalynn and Jimmy Carter were not only a global power couple but also best friends and life mates",
      "url": "https://apnews.com/0b3b3b6c4dcb462265253c8e98f70228",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22cb4b8e109b4485b9e87e631eba54ce/3000.jpeg"
    },
    {
      "author": "DAKE KANG",
      "description": "SHENZHEN, China (AP) — In one painting, a child sits, mouth wide open, as a worker in white medical garb extends a long cotton swab toward her tonsils. In another, a masked officer and medical workers stand guard in front of an apartment cordoned off with ropes and seals reading “CLOSED,” as residents look on with frustration and despair.",
      "publishedAt": "2023-11-27T01:13:05Z",
      "title": "Artist Zeng Fanzhi depicts 'zero-COVID' after a lifetime of service to the Chinese state",
      "url": "https://apnews.com/06613c932427765f81bcede588b44616",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a70d60ec404145b0b8539ac1caf1d9b3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}