{
  "articles": [
    {
      "author": "ABBY SEWELL",
      "description": "ISTANBUL (AP) — A top Hamas political official told The Associated Press the Islamic militant group is willing to agree to a truce of five years or more with Israel and that it would lay down its weapons and convert into a political party if an independent Palestinian state is established along pre-1967 borders.",
      "publishedAt": "2024-04-25T04:26:28Z",
      "title": "Hamas official says group would lay down its weapons if a two-state solution is implemented",
      "url": "https://apnews.com/4912532b11a9cec29464eab234045438",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4202235f636430bb9546f6abefaa004/1920.jpeg"
    },
    {
      "author": "JIM VERTUNO, ACACIA CORONADO and NICK PERRY",
      "description": "AUSTIN, Texas (AP) — Police peacefully arrested student protesters at the University of Southern California on Wednesday, hours after police at a Texas university aggressively detained dozens in the latest clashes between law enforcement and those protesting the Israel-Hamas war on campuses nationwide.",
      "publishedAt": "2024-04-24T05:23:23Z",
      "title": "Dozens arrested on California campus after students in Texas detained as Gaza war protests persist",
      "url": "https://apnews.com/47f4f7f0916a6493b79eede3e4d0a55d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1b0bbd048dd34f7e87a3d76213c10376/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ, MICHAEL R. SISAK, COLLEEN LONG and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — A reluctant Donald Trump will be back in a New York City courtroom Thursday as his hush money trial resumes at the same time that the U.S.",
      "publishedAt": "2024-04-25T04:10:58Z",
      "title": "Trump will be in NY for the hush money trial while the Supreme Court hears his immunity case in DC",
      "url": "https://apnews.com/1dd3c3111febf219bdf1d8627504a3c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7817054d3f640b59f46cbdb7fe04415/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — On the left and right, Supreme Court justices seem to agree on a basic truth about the American system of government: No one is above the law, not even the president.“The law applies equally to all persons, including a person who happens for a period of time to occupy the Presidency,” Justice Samuel Alito wrote in 2020.",
      "publishedAt": "2024-04-25T04:06:06Z",
      "title": "No one is above the law. Supreme Court will decide if that includes Trump while he was president",
      "url": "https://apnews.com/72c885c07c77970d4380206f87b2d8ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3ff8a3b88a14feeadbe54140f54854c/3000.jpeg"
    },
    {
      "author": "JACQUES BILLEAUD, JONATHAN J. COOPER and JOSH KELETY",
      "description": "PHOENIX (AP) — An Arizona grand jury has indicted former President Donald Trump 's chief of staff Mark Meadows, lawyer Rudy Giuliani and 16 others for their roles in an attempt to overturn Trump’s loss to Joe Biden in the 2020 election.",
      "publishedAt": "2024-04-24T23:23:53Z",
      "title": "Arizona indicts 18 in election interference case, including Giuliani and Meadows",
      "url": "https://apnews.com/9da5a7e58814ed55ceea1ca55401af85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54ae8ec24ff64df1a0ec09d8168f5c61/1920.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Action in courts and state capitals around the U.S. this week have made it clear again: The overturning of Roe v. Wade and the nationwide right to abortion did not settle the issue.One iteration of the issue was back before the U.S.",
      "publishedAt": "2024-04-25T04:14:01Z",
      "title": "US abortion battle rages on with moves to repeal Arizona ban and a Supreme Court case",
      "url": "https://apnews.com/92af95ce79753e226c0fa7de2a02431e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52725f4c7ef24c1f960f254fe9bd2cc7/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "SHANGHAI (AP) — U.S. Secretary of State Antony Blinken opened his first full day of meetings in China on Thursday by talking with local government officials in Shanghai.Blinken discussed local and regional issues with Chen Jining, the Chinese Communist Party Secretary of Shanghai.",
      "publishedAt": "2024-04-25T02:47:43Z",
      "title": "Blinken, in Shanghai, begins expected contentious talks with Chinese officials",
      "url": "https://apnews.com/397a23494cc818a3205ceebb4bb78e4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6636f5e8d4434555a2df2b08adb220f1/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Legislation forcing TikTok's parent company to sell the video-sharing platform or face a ban in the U.S.",
      "publishedAt": "2024-04-25T04:01:29Z",
      "title": "TikTok has promised to sue over the potential US ban. What's the legal outlook?",
      "url": "https://apnews.com/386e6d81e2eef61a756bcdea96cd0aef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f257da60df6b4d42acdc76ce9761e920/3000.jpeg"
    },
    {
      "author": "ANNIE MA",
      "description": "Columbia University president Minouche Shafik is no stranger to navigating complex international issues, having worked at some of the world’s most prominent global financial institutions.",
      "publishedAt": "2024-04-25T04:34:04Z",
      "title": "Columbia's president, no stranger to complex challenges, walks tightrope on student protests",
      "url": "https://apnews.com/30a231f01f8a900ec9585dcf92337ec4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5094e7f791447ff98c40a0022662292/3000.jpeg"
    },
    {
      "author": "COLLEEN BARRY",
      "description": "VENICE, Italy (AP) — Under the gaze of the world’s media, the fragile lagoon city of Venice launches a pilot program Thursday to charge day-trippers a 5-euro (around $5.35) entry fee that authorities hope will discourage visitors from arriving on peak days and make the city more livable for its dwindling residents.",
      "publishedAt": "2024-04-25T04:09:30Z",
      "title": "Venice launches experiment to charge day-trippers an access fee in bid to combat over-tourism",
      "url": "https://apnews.com/e0a741e5e439fb8c027387534b086380",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32dbfe3abbed4b9f8ac94f88c2fbfd2e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}