{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Russia said it intercepted more than 100 Ukrainian drones fired at almost a dozen of its regions in an attack that forced all four airports around Moscow to temporarily suspend flights. The overnight assault came two days ahead of a unilateral 72-hour ceasefire in the more than three-year war announced by President Vladimir Putin to coincide with celebrations in Moscow marking Victory Day in World War II. The day celebrating Moscow’s defeat of Nazi Germany in 1945 is Russia’s biggest secular holiday when foreign dignitaries will gather in the Russian capital.",
      "publishedAt": "2025-05-06T08:52:38Z",
      "title": "Flight operations at 4 Moscow airports temporarily suspended due to Ukrainian drone attack",
      "url": "https://apnews.com/article/russia-ukraine-drone-attack-moscow-7b8cb01911706ae4de95752979cf1492",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2d027d/2147483647/strip/true/crop/5662x3185+0+295/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2Fb0%2F1666e4e10bf2400f39d8638e7891%2Fa0426720087d4a139200a1b6ffad21f1"
    },
    {
      "author": "Mari Yamaguchi, Didi Tang",
      "description": "Among all U.S. allies being wooed by Beijing in its tariff stare-down with Washington, Japan stands out as a peculiar case. That's not only for its staunch commitment to its alliance with the U.S. but also for its complicated and uneasy history with its neighboring Asian giant, particularly the war history from the 20th century that overshadows politics of today. Its senior officials are visiting Washington and Beijing as Tokyo seeks a delicate balance, while its prime minister recently traveled to Vietnam and the Philippines in a rivalry with Beijing.",
      "publishedAt": "2025-05-06T01:00:55Z",
      "title": "Threatened by Trump tariffs, Japan walks a tightrope between US and China",
      "url": "https://apnews.com/article/china-beijing-tariff-trump-xi-japan-1c9c669951146e9bee9c3563293dd694",
      "urlToImage": "https://dims.apnews.com/dims4/default/418e213/2147483647/strip/true/crop/3500x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe0%2F80%2F9abc2dd31eec680ce45f9c72cca7%2F65ad504a49af4059a1455d5ed6da3954"
    },
    {
      "author": "Stefanie Dazio",
      "description": "Conservative leader Friedrich Merz’s bid to become Germany’s 10th chancellor has failed in the first round of voting in parliament. Merz had been expected to win smoothly in the vote on Tuesday. A candidate for chancellor has never failed to win on the first ballot in post-World War II Germany. Merz needed a majority of 316 out of 630 votes in a secret ballot but only received 310 votes. The lower house of parliament has 14 days to elect a candidate with an absolute majority. Merz can run again, but other lawmakers can also throw their hat in the ring.",
      "publishedAt": "2025-05-06T04:01:05Z",
      "title": "In a historic first, Friedrich Merz's bid to become Germany's 10th chancellor fails first ballot",
      "url": "https://apnews.com/article/germany-government-merz-coalition-98e9007ea41b8bbd36be8d09baefb632",
      "urlToImage": "https://dims.apnews.com/dims4/default/c469118/2147483647/strip/true/crop/5899x3318+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F3f%2F006df5774d07780b24b9031763e1%2Ff59812f5c98549fca6acdba036c6a6a8"
    },
    {
      "author": "Wafaa Shurafa, Melanie Lidman",
      "description": "An Israeli plan to seize the Gaza Strip and expand the military operation has alarmed many in the region. Palestinians are exhausted and hopeless, pummeled by 19 months of heavy bombing. Families of Israeli hostages still being held in Gaza are terrified that the possibility of a ceasefire is slipping further away. Israeli officials said Monday that Cabinet ministers approved the plan to seize Gaza and remain in the Palestinian territory for an unspecified amount of time. Details of the plan were not formally announced. It may be another measure by Israel to try to pressure Hamas into making concessions in ceasefire negotiations.",
      "publishedAt": "2025-05-06T09:40:56Z",
      "title": "Israeli plan to seize Gaza alarms many: 'What's left for you to bomb?'",
      "url": "https://apnews.com/article/israel-palestinians-gaza-war-plan-reaction-e11aa45f829100c6e9b8afdaa4b2567f",
      "urlToImage": "https://dims.apnews.com/dims4/default/4da3941/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2F27%2F424ceb995c3c4bd5213823697381%2Fd3ac90abc3834e9c8c5d03dd8e74e9b2"
    },
    {
      "author": "Melanie Lidman, Samy Magdy",
      "description": "Israel’s military says it has carried out airstrikes against Houthi rebels in Yemen’s Red Sea city of Hodeida, a day after the Iranian-backed rebels launched a missile that hit Israel’s main airport. The rebels’ media office said the United States and Israel launched at least six strikes Monday afternoon that hit the crucial Hodeida port. The rebels said other strikes hit a cement factory in the Bajil district in Hodeida province. On Sunday, a missile launched by Iranian-backed rebels in Yemen briefly halted flights and commuter traffic at Israel’s main international airport. Four people were lightly injured. It was the first time a missile struck the grounds of Israel’s airport since the start of the war.",
      "publishedAt": "2025-05-05T18:08:51Z",
      "title": "Israel launches airstrikes on Yemen a day after Houthi rebels strike Israeli airport",
      "url": "https://apnews.com/article/israel-airstrikes-houthi-rebels-airport-ea0ea0ca695a3a07c71c18bedc987c3e",
      "urlToImage": "https://dims.apnews.com/dims4/default/6006415/2147483647/strip/true/crop/5148x2896+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2F22%2Fab72256e1d38edb8fc5c623d0767%2Fbdefc24a659844dc9b54fe7960b336e1"
    },
    {
      "author": "Tara Copp",
      "description": "Defense Secretary Pete Hegseth is directing the active duty military to shed 20% of its four-star general officers. The deep cuts are part of what the Trump administration says is an effort to promote efficiency but that critics worry could result in a more politicized force. Hegseth also is telling the National Guard to shed 20% of its top positions. In a memo dated Monday, he said the cuts will remove “redundant force structure to optimize and streamline leadership.” The Pentagon is under pressure to slash spending and personnel as part of the broader federal government cuts pushed by President Donald Trump and ally Elon Musk’s Department of Government Efficiency.",
      "publishedAt": "2025-05-05T20:45:12Z",
      "title": "Hegseth directs 20% cut to top military leadership positions",
      "url": "https://apnews.com/article/hegseth-pentagon-cuts-dd2107dff617951b0edf6ca86074d836",
      "urlToImage": "https://dims.apnews.com/dims4/default/6a41de8/2147483647/strip/true/crop/5380x3026+0+280/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F88%2Fd227a60a874922f34cdc8ed33ce8%2F98874e0817964671a21436b0afe73e91"
    },
    {
      "author": "Lisa Mascaro",
      "description": "Congress is drafting President Donald Trump’s big bill of tax breaks, spending cuts and beefed-up border security and deportation funds. But there’s still a lot of work to do, with \"bumps in the road,\" in the words of Republican Jason Smith, the chairman of the House Ways and Means Committee. The tax cuts portion is still a work in progress, as are the reductions in Medicaid and other mainstay government programs. House Speaker Mike Johnson’s goal is to pass the package out of his chamber by Memorial Day. Mostly, the Republicans in Congress have made progress on spending, adding some $350 billion to the Pentagon and Homeland Security.",
      "publishedAt": "2025-05-06T04:01:18Z",
      "title": "What's in the big bill that Republicans are crafting to meet Trump's agenda",
      "url": "https://apnews.com/article/trump-big-bill-tax-cuts-medicaid-1c893945b416419d806dacb6d24b895a",
      "urlToImage": "https://dims.apnews.com/dims4/default/0cb6de9/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2Fb1%2F96bb731808e660012ee4e5a93a45%2Fd606a2816c96457d9a1739f1f8dc3cc5"
    },
    {
      "author": "Julhas Alam",
      "description": "Bangladesh’s ailing former Prime Minister Khaleda Zia returned to the country from London on Tuesday after four months of medical treatment, adding to pressure for its interim leaders to hold elections. The South Asian country has been under a government led by Nobel Peace Prize laureate Muhammad Yunus since former Prime Minister Sheikh Hasina was ousted in a students-led mass uprising in August last year. Zia, Hasina’s archrival, and her Bangladesh Nationalist Party have been pushing Yunu’s government to hold a national election in December to return the country to democratic rule. Zia suffers from various serious health conditions, and she has not attended public gatherings for many years.",
      "publishedAt": "2025-05-06T04:51:25Z",
      "title": "Bangladesh's ex-premier Khaleda Zia returns, adding pressure for elections",
      "url": "https://apnews.com/article/bangladesh-zia-yunus-hasina-election-246a0a75ae2fcab2e03ddfb13c611491",
      "urlToImage": "https://dims.apnews.com/dims4/default/c8e75be/2147483647/strip/true/crop/5000x2813+0+279/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2Fe9%2Fb204c96b8c8d1512c3bc24d4ee64%2Fef38e123b987437aba9b4c6a7a9ddb7a"
    },
    {
      "author": "Nicole Winfield",
      "description": "Cardinals electing a new pope have some fundamental questions to weigh, beyond whether to give the Catholic Church its first Asian or African pope. Despite hailing from 70 different countries, the 133 cardinals seem fundamentally united in finding a pope who will be able to make the 2,000-year-old church credible and relevant today, especially to young people. That's a tall task, given the sexual abuse and financials scandals that have sullied the church’s reputation. Add to that the Holy See’s dire financial state and often-dysfunctional bureaucracy, and the job of being pope in the 21st century seems almost impossible. As Cardinal William Seng Chye Goh of Singapore put it: “We need a superman!”",
      "publishedAt": "2025-05-06T05:00:36Z",
      "title": "Beyond a possible Asian or African pope, what are the priorities of the cardinals in the conclave?",
      "url": "https://apnews.com/article/conclave-pope-election-vatican-cardinals-6038362e418d3194848229811c2d1a2d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f01703a/2147483647/strip/true/crop/9178x5163+0+478/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fec%2F5755c6df5e812cb4bd11d14273f9%2Fafb8f3590e98424791c7c3b80ac039b2"
    },
    {
      "author": "Kirsten Grieshaber, Vanessa Gera",
      "description": "A German organization is painstakingly searching for fallen German soldiers in order to identify them and rebury them, 80 years after World War II. The German War Graves Commission works to exhume and rebury the dead with dignity — regardless of the army they served. There are more than 2 million German soldiers still unaccounted for. The effort continues across former battlefields, including in Ukraine. The Volksbund sees the work as a moral obligation, even as most families are no longer actively searching for lost relatives. The ongoing recovery of the dead underscores how much remains unresolved as the world marks the 80th anniversary of the war’s end.",
      "publishedAt": "2025-05-06T05:05:22Z",
      "title": "80 years after World War II, Germany is still painstakingly searching for its fallen soldiers",
      "url": "https://apnews.com/article/german-soldiers-burial-world-war-ii-010883431217f21ac967be99a54a11ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/4cfb357/2147483647/strip/true/crop/6357x3576+0+331/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2Fef%2F9ebb20dd9201b011f51870684bf7%2Fd9e1348c70f34a2a85b7c6ac982bda1e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}