{
  "articles": [
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — Labor Day is right around the corner, along with the big sales and barbecues that come with it. But the activist roots of the holiday are especially visible this year as unions challenge how workers are treated — from Hollywood to the auto production lines of Detroit.",
      "publishedAt": "2023-09-01T09:00:20Z",
      "title": "From strikes to new union contracts, Labor Day's organizing roots are especially strong this year",
      "url": "https://apnews.com/cb4ef1bb135e6deebb29fb87a13b8824",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42486802dc754259adf1d8fa434c9c44/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A one-time leader in the Proud Boys far-right extremist group was sentenced Friday to 18 years in prison for his role in the Jan. 6 riot at the U.S. Capitol, tying the record for the longest sentence in the attack.",
      "publishedAt": "2023-09-01T17:37:48Z",
      "title": "Proud Boy convicted of helping spearhead Capitol attack ties Jan. 6 sentence record with 18 years",
      "url": "https://apnews.com/58173200af1664716cbaec8ed2c2a145",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d562c2dc3c84319b98080ccafb1ce02/2351.jpeg"
    },
    {
      "author": "DANICA KIRKA, CARA RUBINSKY and JILL LAWLESS",
      "description": "LONDON (AP) — Mohamed Al Fayed, the flamboyant Egypt-born businessman whose son was killed in a car crash with Princess Diana, died this week, his family said Friday. He was 94.Al Fayed, the longtime owner of Harrods department store and the Fulham Football Club, was devastated by the death of son Dodi Fayed in the car crash in Paris with Diana 26 years ago.",
      "publishedAt": "2023-09-01T21:17:49Z",
      "title": "Former Harrods owner Mohamed Al Fayed, whose son died in car crash with Princess Diana, dies at 94",
      "url": "https://apnews.com/564507cc4fc5d3fbfb1c1dd511543afc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/059059b566b94fb7894115ff8d51554b/2000.jpeg"
    },
    {
      "author": "SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Ohio authorities on Friday released bodycam video showing a police officer fatally shooting Ta’Kiya Young in her car in what her family denounced as a “gross misuse of power and authority” against the pregnant Black mother.",
      "publishedAt": "2023-09-01T05:08:53Z",
      "title": "Ta'Kiya Young's family urges officer's arrest after video shows him killing the pregnant Black woman",
      "url": "https://apnews.com/95daff91130a64bb43848431ea4441af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd99fd07cd1e403ca1c3f40226da7298/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ULAANBAATAR, Mongolia (AP) — Pope Francis on Saturday praised Mongolia’s tradition of religious freedom dating to the times of its founder, Genghis Khan, as he opened the first-ever papal visit to the Asian nation with a plea for peace and an end to the “insidious threat of corruption.”",
      "publishedAt": "2023-09-02T02:54:00Z",
      "title": "Pope starts Mongolia visit by praising the country's religious freedom dating back to Genghis Khan",
      "url": "https://apnews.com/98740116fdfefb395683b9b28c7e8c3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d3e595d500142c387d7df5b91cf980b/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden is heading to Florida on Saturday for a firsthand look at Hurricane Idalia's destruction, but he won't be seeing the state's Republican governor and 2024 presidential hopeful, Ron DeSantis, who suggested such a meeting could hinder disaster response efforts.",
      "publishedAt": "2023-09-02T04:03:22Z",
      "title": "Biden heads to Florida to see Idalia's destruction. But he won't be seeing Gov. DeSantis",
      "url": "https://apnews.com/3ff2f44e6a314dfaf1e329fa10ac1b5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b843cff4815409682d6f66c9bfb1309/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — Typhoon Saola made landfall in southern China before dawn Saturday after nearly 900,000 people were moved to safety and most of Hong Kong and other parts of coastal southern China suspended business, transport and classes.",
      "publishedAt": "2023-09-02T02:33:43Z",
      "title": "Typhoon Saola makes landfall in southern China after nearly 900,000 people moved to safety",
      "url": "https://apnews.com/b20a237e9365e8470048f3cdef05ccf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/913e3935a0da4cfbb27fb8e3fe97d2bf/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — Ecuadorian authorities announced Friday the release of 50 guards and seven police officers who were taken hostage for more than a day, in what the government described as a response by criminal groups to its efforts to regain control of several large correctional facilities in the South American country.",
      "publishedAt": "2023-09-01T19:46:20Z",
      "title": "Ecuador says 57 guards and police officers are released after being held hostage in several prisons",
      "url": "https://apnews.com/9d5efa8cdf749eed2081fae33e66874e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d67e62d717d45d398a00784c7ca81de/3000.jpeg"
    },
    {
      "author": "JANIE HAR",
      "description": "SAN FRANCISCO (AP) — Silicon Valley billionaires behind a secretive $800 million land-buying spree in Northern California have finally released some details about their plans for a new green city, but they still must win over skeptical voters and local leaders.",
      "publishedAt": "2023-09-01T17:25:08Z",
      "title": "Billionaires want to build a new city in rural California. They must convince voters first",
      "url": "https://apnews.com/35f91416dd7d84ecb03ed08199d87dd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/085fac030a5146f6945a94292ace804e/1920.jpeg"
    },
    {
      "author": "PAUL J. WEBER, ACACIA CORONADO and KENDRIA LaFLEUR",
      "description": "AUSTIN, Texas (AP) — A vision of armed officers at every school in Texas is crashing into the reality of not enough money or police as a new mandate took effect Friday, showing how a goal more states are embracing in response to America's cycle of mass killings is proving unworkable in many communities.",
      "publishedAt": "2023-09-01T04:33:03Z",
      "title": "Texas wanted armed officers at every school after Uvalde. Many can't meet that standard",
      "url": "https://apnews.com/9a68ff8935fa376965ad754056de1673",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1bcd508a3ca43e5a30066248c885c66/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}