{
  "articles": [
    {
      "author": null,
      "description": "Israel’s military warned people Thursday to evacuate the area around Iran’s Arak heavy water reactor. The warning came in a social media post on X. It included a satellite image of the plant in a red circle like other warnings that proceeded strikes. The Arak heavy water reactor is 155 miles southwest of Tehran. Heavy water helps cool nuclear reactors, but it produces plutonium as a byproduct that can potentially be used in nuclear weapons. That would provide Iran another path to the bomb beyond enriched uranium, should it choose to pursue the weapon. Iran had agreed under its 2015 nuclear deal with world powers to redesign the facility to relieve proliferation concerns.",
      "publishedAt": "2025-06-19T01:44:51Z",
      "title": "Israel’s military warns people to evacuate the area around Iran reactor",
      "url": "https://apnews.com/article/israel-iran-attacks-nuclear-news-06-19-2025-b508817b78ed8d2f6067c1516215cf94",
      "urlToImage": "https://dims.apnews.com/dims4/default/dfa1d67/2147483647/strip/true/crop/4559x2564+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F48%2F19d6eefc601712d491d66529a1e3%2Ffda40aab354741608927ef55ab17879d"
    },
    {
      "author": null,
      "description": "An Iranian missile hit the main hospital in southern Israel early Thursday, wounding people and causing “extensive damage,” the medical facility said. Separate Iranian strikes hit a high-rise apartment building in Tel Aviv and other sites in central Israel. At least 40 people were wounded, according to Israel’s Magen David Adom rescue service. Israel, meanwhile, carried out strikes on Iran’s Arak heavy water reactor, its latest attack on Iran’s sprawling nuclear program. Iranian state TV said the facility had been evacuated before the attack. The seventh day of conflict came a day after Iran’s supreme leader rejected U.S. calls for surrender and warned that any military involvement by the Americans would cause “irreparable damage to them.”",
      "publishedAt": "2025-06-19T04:44:19Z",
      "title": "The Latest: Dozens wounded in Iranian strikes across Israel, as Israel hits Arak reactor site",
      "url": "https://apnews.com/article/israel-palestinians-iran-war-latest-06-19-2025-14b868f4514a7c337d5b9859de130bf0",
      "urlToImage": "https://dims.apnews.com/dims4/default/778df65/2147483647/strip/true/crop/8153x4586+0+424/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2Fcc%2Fe3ef76ec7bf1543b0f14f8e14474%2Fa325c22a5f65431aa6ecf128c74e9323"
    },
    {
      "author": null,
      "description": "Celebrations are planned around the country to commemorate the Juneteenth holiday marking the day in 1865 when Union soldiers brought the news of freedom to enslaved Black people in Texas. The observances on Thursday come even as the Trump administration has been removing content about African American history from federal websites. Nevertheless, the day remains a federal holiday. The Black Heritage Trail of New Hampshire has been holding events for the last two weeks, though the state itself hasn't made the holiday a permanent paid and legal one. Organizers say they want participants to think about how the story of America would change if told by the descendants of enslaved people.",
      "publishedAt": "2025-06-19T04:04:14Z",
      "title": "Juneteenth celebrations commemorate end to slavery in US",
      "url": "https://apnews.com/article/juneteenth-june-19-events-dei-new-hampshire-3c03fd1e722dcfda2cfa9b30a4a3777c",
      "urlToImage": "https://dims.apnews.com/dims4/default/079697c/2147483647/strip/true/crop/1920x1080+0+100/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F07%2Fb49d2c6c350e839fee6ef9344538%2F44b44f7ed8924541b216fcf067246e36"
    },
    {
      "author": null,
      "description": "Forecasters say Erick has been upgraded to an \"extremely dangerous” Category 4 hurricane near Southern Mexico’s Pacific coast. The Miami-based U.S. National Hurricane Center reported early Thursday that Erick is about 70 miles west-southwest of Puerto Angel, Mexico, and about 90 miles southeast of Punta Maldonado, Mexico. The storm has maximum sustained winds of 145 mph and is moving northwest at 9 mph. Forecasters say Erick is expected to cause potentially destructive winds and life-threatening flash floods over a wide area.",
      "publishedAt": "2025-06-19T04:24:32Z",
      "title": "Erick upgraded to an 'extremely dangerous' Category 4 hurricane, US forecasters say",
      "url": "https://apnews.com/article/hurricane-erick-mexico-pacific-storm-winds-rain-f2e27fe7d8d30a48de2aa2b4cf952c0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0f0260/2147483647/strip/true/crop/4000x2250+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F4b%2F0ba069e7fdab28d666d31b8c8912%2Fa387450b36f74cca8790c5b56e8c01a2"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy is urging greater international pressure on Moscow following a deadly Russian missile strike that hit a Kyiv apartment building this week, killing 23 people. Visiting the site with top officials on Thursday, Zelenskyy called the attack a sign Russia is rejecting ceasefire efforts. He thanked allies ready to push the Kremlin to “feel the real cost of the war.” The strike was part of Russia’s largest assault on Kyiv this year amid a broader offensive along the front line. While Russian President Vladimir Putin has said he’s open to talks on ending the war, he has effectively rejected a U.S. ceasefire offers.",
      "publishedAt": "2025-06-19T09:52:35Z",
      "title": "Zelenskyy calls for more pressure on Russia after deadly Kyiv missile strike",
      "url": "https://apnews.com/article/ukraine-zelenskyy-war-russia-missile-strike-91245843b6ef6f191313686458676b82",
      "urlToImage": "https://dims.apnews.com/dims4/default/2888319/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F6f%2F89af3f1369e5460c100ebd231510%2F8d8b75d654e44dda9ad22884f5bbbf50"
    },
    {
      "author": null,
      "description": "President Donald Trump on Thursday signed an executive order to keep TikTok running in the U.S. for another 90 days to give his administration more time to broker a deal to bring the social media platform under American ownership. It is the third time Trump has extended the deadline. The first one was through an executive order on Jan. 20, his first day in office, after the platform went dark briefly when a national ban took effect. The second was in April when White House officials believed they were nearing a deal to spin off TikTok into a new company with U.S. ownership that fell apart after China backed out following Trump’s tariff announcement.",
      "publishedAt": "2025-06-19T15:35:39Z",
      "title": "Trump extends TikTok shutdown deadline for third time",
      "url": "https://apnews.com/article/tiktok-ban-trump-delay-executive-order-3211a98113615be44cf92b32dca69a8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e300389/2147483647/strip/true/crop/5135x2888+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F10%2F34cb8e838005fc1e3062e5eac8de%2F39f54b4fcba042c689b17de8fe262234"
    },
    {
      "author": null,
      "description": "Russia's Economy Minister Maxim Reshetnikov says the country is on the brink of a recession. Reshetnikov delivered the warning Thursday at the St. Petersburg International Economic Forum, an annual event designed to highlight the country’s economic prowess and court foreign investors. “Judging by the way businesses currently feel and the indicators, we are already, it seems to me, on the brink of going into a recession,” the minister was cited by the Russian business news outlet RBC as saying, The economy has outperformed predictions since imposition of a slew of sanctions after Russia sent troops into Ukraine in February 2022. But it is unclear how long the militarized economy can keep going.",
      "publishedAt": "2025-06-19T12:53:55Z",
      "title": "Russia's economy minister says the country is on 'the brink of recession'",
      "url": "https://apnews.com/article/russia-economy-recession-ukraine-conflict-9d105fd1ac8c28908839b01f7d300ebd",
      "urlToImage": "https://dims.apnews.com/dims4/default/fc2d032/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F99%2F43519f74b0e076e17dcfe009bcff%2F555cc9d299d5406bbe8813dbd47fa634"
    },
    {
      "author": null,
      "description": "The Supreme Court has upheld Tennessee’s ban on gender-affirming care for transgender minors, a stunning setback to transgender rights. The justices’ 6-3 decision Wednesday effectively protects from legal challenges many efforts by President Donald Trump’s Republican administration and state governments to roll back protections for transgender people. Another 26 states have laws similar to the one in Tennessee. Chief Justice John Roberts writes for a conservative majority the law does not violate the Constitution’s equal protection clause, which requires the government to treat similarly situated people the same. Justice Sonia Sotomayor writes in a dissent joined by her liberal colleagues that the majority “abandons transgender children and their families to political whims.”",
      "publishedAt": "2025-06-18T14:16:57Z",
      "title": "Supreme Court deals stunning setback to transgender rights in Tennessee case",
      "url": "https://apnews.com/article/supreme-court-transgender-health-care-trump-79fc6f3bbdab2e92d6f0184201a468a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7383f15/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fce%2F4101bc6c62f9af0878b853d89b4a%2F5a0e5010145e46e9a0363399a79c13bf"
    },
    {
      "author": null,
      "description": "A SpaceX rocket being tested in Texas has exploded, sending a dramatic fireball high into the sky. The company says the Starship “experienced a major anomaly” at about 11 p.m. Wednesday while on the test stand at Starbase, SpaceX’s launch site at the southern tip of Texas. The company says in a statement on X that \"all personnel are safe and accounted for.\" SpaceX says there are no hazards to nearby communities. It has asked people not to try to approach the site.",
      "publishedAt": "2025-06-19T06:05:48Z",
      "title": "SpaceX rocket being tested in Texas explodes, but no injuries reported",
      "url": "https://apnews.com/article/spacex-starship-launch-explosion-88b94b223d06b258d3e5a2308b7db2c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d5f210c/2147483647/strip/true/crop/5388x3031+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2Fac%2Fc7d898c6f618f30a7d8770c40290%2F6fe8677645b245b386a61bf067c2adcb"
    },
    {
      "author": null,
      "description": "The NBA season could end on Thursday night. It’s Game 6 of the NBA Finals, with the Oklahoma City Thunder leading the Indiana Pacers 3-2 in the title series. Game 6 is in Indianapolis and Game 7, if necessary, will be Sunday in Oklahoma City. Shai Gilgeous-Alexander and the Thunder are one win away from becoming NBA champions. And Gilgeous-Alexander is on the cusp of a nearly unprecedented season when it comes to individual honors.",
      "publishedAt": "2025-06-19T14:09:00Z",
      "title": "Game 6: Thunder look to clinch title, Pacers try to extend NBA Finals",
      "url": "https://apnews.com/article/nba-finals-game-6-pacers-thunder-2e0d61895cad2f2f9c6e74da20a83bdb",
      "urlToImage": "https://dims.apnews.com/dims4/default/9c6b02d/2147483647/strip/true/crop/6346x3570+0+331/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2Ff1%2F2be310928ba8477d47f7b10c065b%2F404cd160ed1a47ad83903a8f5634d385"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}