{
  "articles": [
    {
      "author": "Ellen Knickmeyer",
      "description": "Human rights received far less mention on President Donald Trump's trip to the Middle East this week than is usual for presidential visits to autocratic countries. Rights advocates say that's partly because of some improvements in the human rights record of Saudi Crown Prince Mohammed bin Salman. But they say it also reflects a worsening human rights picture in the United States. Trump in a speech to Saudi royals this week condemned what he called past American “lectures” to Gulf leaders on internal affairs. Some Saudis who fled to the U.S. say they're pulling back from public criticism of Saudi officials, citing the detentions and deportations faced by some immigrants and pro-Palestinian protesters under the Trump administration.",
      "publishedAt": "2025-05-16T01:01:50Z",
      "title": "Trump's Mideast trip dodges human rights concerns",
      "url": "https://apnews.com/article/trump-saudi-arabia-human-rights-f005cb14a8a0d51b1963a05215305d04",
      "urlToImage": "https://dims.apnews.com/dims4/default/f31beaf/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2Fc5%2F3f91835fc4f6ad3ef6217f615aa8%2F6651c4f96733442398ecb23901513d12"
    },
    {
      "author": "Mohammad Jahjouh, Tia Goldenberg",
      "description": "A hospital in southern Gaza says 54 people have been killed in overnight airstrikes on the city of Khan Younis. An Associated Press cameraman counted 10 airstrikes on the city overnight into Thursday and saw numerous bodies taken to the morgue in Nasser Hospital. Some bodies arrived in pieces, with some body bags containing the remains of multiple people. The hospital’s morgue confirmed 54 people had been killed. The strikes come as U.S. President Donald Trump visits the Middle East, visiting Gulf states but not Israel. There had been hope that Trump’s regional visit could usher in a ceasefire or renewal of humanitarian aid to Gaza. An Israeli blockade of the territory is now in its third month.",
      "publishedAt": "2025-05-15T06:43:42Z",
      "title": "54 people killed in overnight airstrikes on southern Gaza city, hospital says",
      "url": "https://apnews.com/article/mideast-wars-israel-hamas-gaza-05-15-2025-b32d055195ffec2b349a0948582c68e3",
      "urlToImage": "https://dims.apnews.com/dims4/default/28db1cd/2147483647/strip/true/crop/6886x3873+0+358/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F9d%2F7e2901282351a444195d5008cb28%2Fe174e34502a344e4a5be151e05fe3585"
    },
    {
      "author": "Taiwo Adebayo",
      "description": "Infant twins suffered from malnutrition in Nigeria. One died shortly after the Trump administration sharply cut funding for the United States Agency for International Development. USAID for years had been the backbone of the humanitarian response in northeastern Nigeria. It helped non-government organizations provide food, shelter and healthcare to millions of people under threat from Boko Haram militants. Now programs to feed hungry children are closing. A former USAID chief nutritionist predicts 163,500 additional deaths per year worldwide as treatment for severe malnutrition is limited. The mother in Nigeria cradles the surviving twin and says, “I don’t want to bury another child.\"",
      "publishedAt": "2025-05-16T04:15:25Z",
      "title": "Children die as USAID aid cuts snap a lifeline for the world's most malnourished",
      "url": "https://apnews.com/article/usaid-funding-cuts-humanitarian-children-trump-4447e210c4b5543b8ebb9a6b9e01aa53",
      "urlToImage": "https://dims.apnews.com/dims4/default/32d1c53/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F90%2F9b0e4093afac1adf5b825d89f859%2F9a12762f899346668e9ce65cc34e4b35"
    },
    {
      "author": "Jintamas Saksornchai",
      "description": "A construction magnate and more than a dozen other people have surrendered to police on criminal negligence charges for the collapse of a Bangkok high-rise during a March 28 earthquake. Premchai Karnasuta, the president of Italian-Thai Development Co, the main Thai contractor for the building project, and 16 other people were charged with the felony of professional negligence causing death. They have denied wrongdoing. Ninety-two people were confirmed dead in the rubble of the building that had been under construction. The building, which was to become a new State Audit Office, was the only one in Thailand to collapse in the earthquake that was centered in neighboring Myanmar.",
      "publishedAt": "2025-05-16T04:09:29Z",
      "title": "Thai construction magnate surrenders on felony negligence charges over building collapse in quake",
      "url": "https://apnews.com/article/bangkok-building-collapse-thailand-myanmar-earthquake-ee56ec5b47304c771d38c5998e587a5e",
      "urlToImage": "https://dims.apnews.com/dims4/default/31f8c77/2147483647/strip/true/crop/6988x3931+0+364/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F91%2Fb5a2919dd292651566ddaebf69b2%2Fe3d08c0d4dd64b2b9477a67f8ac49b09"
    },
    {
      "author": "Bruce Shipkowski",
      "description": "New Jersey Transit train engineers have gone on strike in a dispute over wages, leaving an estimated 350,000 commuters in New Jersey and New York City to seek other means to reach their destinations or consider staying home. The walkout effective Friday comes after the latest round of negotiations on Thursday didn’t produce an agreement. It’s the state’s first transit strike in more than 40 years. It halts all NJ Transit commuter trains, which provide heavily used routes between New York City’s Penn Station on one side of the Hudson River and communities in northern New Jersey on the other, as well as the Newark airport.",
      "publishedAt": "2025-05-15T14:27:40Z",
      "title": "New Jersey Transit train engineers go on strike, leaving some 350,000 commuters in the lurch",
      "url": "https://apnews.com/article/new-jersey-transit-strike-train-engineers-af47adece3c12069a8316722dc662999",
      "urlToImage": "https://dims.apnews.com/dims4/default/bf6f10f/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2Fbe%2F34da04194c57ed7e198c4ae17c3a%2Fafcdb5344c2844f9a393a069ea243dee"
    },
    {
      "author": "Lolita Baldor",
      "description": "Defense officials say military commanders will be told to identify troops in their units who are transgender or have gender dysphoria, then send them to medical checks in order to force them out of the service. A senior defense official laid out Thursday what could be a complicated and lengthy new process aimed at fulfilling President Donald Trump’s directive to remove all transgender service members from the U.S. military. The new order to commanders relies on routine annual health checks that service members are required to undergo. It scraps, for now, plans to go through troops’ health records to identify those with gender dysphoria. Instead, transgender troops who don’t voluntarily come forward could be outed by commanders or others.",
      "publishedAt": "2025-05-15T22:26:14Z",
      "title": "Military commanders will be told to send transgender troops to medical checks to oust them",
      "url": "https://apnews.com/article/transgender-ban-military-discharge-troops-0218f0b6fec595c420bd0ac072d87335",
      "urlToImage": "https://dims.apnews.com/dims4/default/8986ca1/2147483647/strip/true/crop/6298x3543+0+328/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2Fb7%2Fa784d823e5b5f89a4c26e172a780%2F98c345a55f0942ed97c6b3a8d1d87af3"
    },
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court is hearing arguments in its first case stemming from the flurry of actions marking the start of President Donald Trump’s second term. Before the court Thursday are the Trump administration’s emergency appeals of lower court orders putting nationwide holds on the Republican president’s push to deny citizenship to children born to people who are in the U.S. illegally. Birthright citizenship is among several issues the administration has urgently asked the court to deal with, after lower courts acted to slow Trump’s agenda. The administration, like the Biden administration before it, complains judges are overreaching by issuing nationwide injunctions that apply to everyone instead of just the parties before the court.",
      "publishedAt": "2025-05-15T10:40:09Z",
      "title": "What to know about the Supreme Court arguments over birthright citizenship",
      "url": "https://apnews.com/article/immigration-supreme-court-birthright-citizenship-nationwide-injunctions-2c495cddc1436e21a9fa976d295dc292",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee92b39/2147483647/strip/true/crop/4694x2640+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F6b%2F55a3f63410f5534ed4cb72f35b25%2F2469e2cdc3704cb18ed25331aec37954"
    },
    {
      "author": "Tim Sullivan",
      "description": "Asylum-seekers from around the world face new challenges at the U.S. border. President Donald Trump suspended the asylum system just after his inauguration as part of his wide-ranging crackdown on illegal immigration. Lawyers, activists and immigrants say the process is now unclear, with many people deported after fleeting conversations with immigration officials while others languish in Immigration and Customs Enforcement custody. Attorneys who work frequently with asylum-seekers at the border say their phones have gone quiet since Trump took office. Legal battles are ongoing, with rights groups challenging the restrictions.",
      "publishedAt": "2025-05-16T04:27:12Z",
      "title": "Asylum-seekers left in limbo after Trump's crackdown",
      "url": "https://apnews.com/article/trump-immigration-asylum-lawsuit-courts-d325740dd73f425309c66f89e670fd8f",
      "urlToImage": "https://dims.apnews.com/dims4/default/f93974a/2147483647/strip/true/crop/4979x2801+0+259/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Fca%2Fd2977a808a881277a3f65fb4f96d%2F13e90ee637e44101978eb78826604b30"
    },
    {
      "author": "Ben Finley, Michael Kunzelman",
      "description": "A federal judge in Maryland will hear arguments over whether the Trump administration can invoke the state secrets privilege in the court case involving Kilmar Abrego Garcia. The judge had ordered Abrego Garcia’s return from El Salvador in April after he was mistakenly deported. She has since directed the administration to provide information about what it's done to bring him back. Government lawyers say those details are protected state secrets. Abrego Garcia's attorneys disagree. They note that President Donald Trump and his administration have repeatedly discussed the case publicly and said Abrego Garcia won’t return. The judge's hearing was set to begin Friday afternoon.",
      "publishedAt": "2025-05-16T04:13:34Z",
      "title": "US wants to withhold details in Kilmar Abrego Garcia case. Judge will hear arguments",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-deportation-state-secrets-7a4d39f9a2013003b592efa94aa230ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/acbad8d/2147483647/strip/true/crop/1029x579+0+54/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2Fe9%2Fd4f34a97156268f6fdd695c4e66b%2F00c074ffb2ac4c46ad3912c3e5fdb0f0"
    },
    {
      "author": "David A. Lieb",
      "description": "State efforts to stamp out diversity, equity and inclusion initiatives are accelerating during Donald Trump's second term. Republican governors and lawmakers this year already have taken about twice as many actions targeting DEI offices and activities as last year. And last year's actions were about double those of 2023, when the movement began gaining ground. Some of the latest actions go beyond higher education to also target DEI in state and local government agencies. The actions come as Trump also has ordered a halt to DEI initiatives in the federal government, universities and schools. Many of Trump's actions face legal challenges.",
      "publishedAt": "2025-05-16T04:10:03Z",
      "title": "GOP states double efforts to stamp out DEI",
      "url": "https://apnews.com/article/diversity-equity-inclusion-dei-education-379c55d6a9487381d48d8450a639bd13",
      "urlToImage": "https://dims.apnews.com/dims4/default/0097112/2147483647/strip/true/crop/4678x2631+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F58%2F03acbc3e0694414c0f4e344ae01d%2F40430732eaef4aa49069c2e8bb7ce092"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}