{
  "articles": [
    {
      "author": "CLAIRE GALOFARO and MATT SEDENSKY",
      "description": "The smoke was starting to blot out the sun. Winds were howling, and heat bore down as flames licked the trees on the horizon.",
      "publishedAt": "2023-08-14T18:41:26Z",
      "title": "They were alone in a fight to survive. Maui residents had moments to make life-or-death choices",
      "url": "https://apnews.com/8a8bf7e4257c1cedaa161e4002b3e7fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/334dc031e945423bbe6deb62f704959f/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A list of criminal charges in Georgia against former President Donald Trump briefly appeared Monday on a Fulton County website, but prosecutors said Trump had not been indicted in a long-running investigation of the 2020 presidential election.",
      "publishedAt": "2023-08-14T16:23:05Z",
      "title": "Georgia court website publishes, then takes down, list of criminal charges against Trump",
      "url": "https://apnews.com/d39562cedfc60d64948708de1b011ed3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01b34fdc7dc44e8192867693dffde031/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Fulton County District Attorney Fani Willis opened her investigation into Donald Trump after the release of a recording of a January 2021 phone call between Trump and Georgia’s secretary of state, Brad Raffensperger.",
      "publishedAt": "2023-08-14T18:05:26Z",
      "title": "How a law associated with mobsters could be central in possible charges against Trump",
      "url": "https://apnews.com/2b18a1c1ed6a4ce22b1a2ca88ea861e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c3d0f0aba0c4a1d9fe5cfaa4943c2b0/3000.jpeg"
    },
    {
      "author": "AMY BETH HANSON and MATTHEW BROWN",
      "description": "HELENA, Mont. (AP) — A Montana judge on Monday sided with young environmental activists who said state agencies were violating their constitutional right t o a clean and healthful environment by permitting fossil fuel development without considering its effect on the climate.",
      "publishedAt": "2023-08-14T17:24:06Z",
      "title": "Judge sides with young activists in first-of-its-kind climate change trial in Montana",
      "url": "https://apnews.com/c7fdc1d8759f55f60346b31c73397db0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b486524e5c9467eb418576694980471/2464.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "BRANDON, Miss. (AP) — Six white former Mississippi law officers pleaded guilty on Monday to state charges for torturing two Black men in a racist assault.",
      "publishedAt": "2023-08-14T04:20:05Z",
      "title": "Six former Mississippi officers plead guilty to state charges for torturing two Black men",
      "url": "https://apnews.com/a04261f338812a0aaf43b4b7efa8c944",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4491ce02c154cd89ff75bd21c9a214b/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — David McCormick had a clear explanation for why his fellow Republican, Dr. Mehmet Oz, lost a critical Pennsylvania Senate seat last year: Voters viewed the daytime television celebrity as an interloper from New Jersey with limited ties to the state he hoped to represent.",
      "publishedAt": "2023-08-14T04:06:56Z",
      "title": "David McCormick is gearing up for a Senate run in Pennsylvania. But he lives in Connecticut",
      "url": "https://apnews.com/e84500b848f0be7efb9f9b3c495dd066",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff2741d5cc504febad279817e0dfb9da/3000.jpeg"
    },
    {
      "author": "GARY D. ROBERTSON",
      "description": "RALEIGH, N.C. (AP) — A national political movement that could offer a bipartisan presidential ticket in 2024 as an alternative to major-party nominees said Monday it has now won ballot access in 10 states, after North Carolina election officials formally granted official status to a “No Labels” affiliate.",
      "publishedAt": "2023-08-14T18:58:47Z",
      "title": "'No Labels' movement says it could offer bipartisan presidential ticket in 2024",
      "url": "https://apnews.com/d230dd3a3da6d78da6707c0165aa6443",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/497bb1fe1bea4f4ebc5a8f3d289a15a1/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump is assailing the federal judge overseeing the election conspiracy case against him, days after she warned him not to make inflammatory statements about the case.",
      "publishedAt": "2023-08-14T15:14:45Z",
      "title": "Trump assails judge in 2020 election case after she warned him not to make inflammatory remarks",
      "url": "https://apnews.com/f7c0611ab8cf34aee5f46b4cb0528edb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94b187e139e741eba7f5e33effea294e/3000.jpeg"
    },
    {
      "author": "TERESA M. WALKER",
      "description": "NASHVILLE, Tenn. (AP) — Michael Oher, the former NFL tackle known for the movie “The Blind Side,” filed a petition Monday in a Tennessee probate court accusing Sean and Leigh Anne Tuohy of lying to him by having him sign papers making them his conservators rather than his adoptive parents nearly two decades ago.",
      "publishedAt": "2023-08-14T19:09:06Z",
      "title": "Michael Oher, former NFL tackle known for 'The Blind Side,' sues to end Tuohys' conservatorship",
      "url": "https://apnews.com/c2593f08f8788db5ee267b9a23007c6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/735c3423a28f410a8ccd4939df291bd6/2268.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Georgia will begin its drive for an unprecedented college football championship three-peat as the No. 1 team in The Associated Press preseason Top 25.",
      "publishedAt": "2023-08-14T15:58:49Z",
      "title": "Georgia begins quest for 3rd straight championship as No. 1 in AP Top 25. Michigan, Ohio State next",
      "url": "https://apnews.com/d714d9fdebb714996aa0e32212ee6024",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe52f3062b224a61ac725c6bd381e89e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}