{
  "articles": [
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Trump White House official Peter Navarro was found guilty Thursday of contempt of Congress charges for refusing to cooperate with a congressional investigation into the Jan.",
      "publishedAt": "2023-09-07T15:49:43Z",
      "title": "Trump White House official Navarro convicted of contempt after defying House Jan. 6 subpoena",
      "url": "https://apnews.com/a4ad58e1f590e5884fd347c86c121a8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42df05c552fe483c82f6909410250894/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — A judge sentenced “That ’70s Show” show star Danny Masterson to 30 years to life in prison Thursday for raping two women, giving them some relief after they spoke in court about the decades of damage he inflicted.",
      "publishedAt": "2023-09-07T04:29:10Z",
      "title": "‘That ’70s Show' actor Danny Masterson gets 30 years to life in prison for rapes of 2 women",
      "url": "https://apnews.com/fd7a10eda44d0e3ddde582d4c7053eb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a672ecfefa4c498da565b284d6490a38/1920.jpeg"
    },
    {
      "author": "BRIAN MAHONEY and HOWARD FENDRICH",
      "description": "NEW YORK (AP) — Coco Gauff's U.S. Open semifinal victory over Karolina Muchova was delayed by 50 minutes because of a disruption by four environmental activists in the Arthur Ashe Stadium stands on Thursday night.",
      "publishedAt": "2023-09-08T00:27:31Z",
      "title": "Climate protester glues feet to floor at US Open, interrupts Coco Gauff's semifinal win over Muchova",
      "url": "https://apnews.com/00a82f465076adea36b098aa6ca08a0d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d1431e53f274c0bbea3d8941be80f31/3000.jpeg"
    },
    {
      "author": null,
      "description": "BAMAKO, Mali (AP) — Two attacks by al-Qaida linked insurgents in the restive north of Mali on Thursday killed 49 civilians and 15 government soldiers, the country's military junta said.A passenger boat near the city of Timbuktu on the Niger River and a Malian military position in Bamba further downstream in the Gao region were targeted, according to a statement from the military junta read on state television.",
      "publishedAt": "2023-09-07T23:00:49Z",
      "title": "Al-Qaida-linked insurgents in Mali kill 49 civilians and 15 soldiers in attacks, military says",
      "url": "https://apnews.com/5c9da064d244c8f48321277a501eb135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c50392722be4401ad9a8bc02e4830bc/3000.jpeg"
    },
    {
      "author": "JULIE CARR SMYTH",
      "description": "CLEVELAND (AP) — Supreme Court Justice Brett Kavanaugh told a judicial conference on Thursday he hopes there will be “concrete steps soon” to address recent ethics concerns surrounding the court, but he stopped short of addressing calls for justices to institute an official code of conduct.",
      "publishedAt": "2023-09-07T18:45:46Z",
      "title": "Supreme Court Justice Kavanaugh predicts 'concrete steps soon' to address ethics concerns",
      "url": "https://apnews.com/76c1e5474093d17127707535ccdea852",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39d9ba67515c462d9c05a34b557da410/3000.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN, ROBERT BUMSTED and ELLIOT SPAGAT",
      "description": "NEW YORK (AP) — Damien, age 5, was giddy with excitement as he left a Manhattan homeless shelter, sometimes running and skipping along the sidewalk accompanied by his wistful mother, a migrant from Ecuador.",
      "publishedAt": "2023-09-07T15:15:39Z",
      "title": "An influx of migrant children tests the preparedness of NYC schools",
      "url": "https://apnews.com/89ca1291432e940e4885befca105f2a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0635b3d7f747479a9368cf4890973dcc/1920.jpeg"
    },
    {
      "author": "TASSANEE VEJPONGSA and MARYCLAIRE DALE",
      "description": "WEST CHESTER, Pa. (AP) — An escaped murderer on the run in southeast Pennsylvania has so far eluded hundreds of law officers — including tactical teams in full combat gear, tracking dogs, cops on horseback and aircraft — as the search entered its second week Thursday and nervous residents stayed alert for any sign of the fugitive.",
      "publishedAt": "2023-09-07T14:00:38Z",
      "title": "Fugitive killer eludes Pennsylvania police for eighth day as wary residents keep a watchful eye",
      "url": "https://apnews.com/5db4a57a0b70d1f36bdf5c382918fadc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9548c208143a43528320bcfe7f2c6326/1920.jpeg"
    },
    {
      "author": "ROBERT BADENDIECK",
      "description": "ISTANBUL (AP) — Rescuers from across Europe rushed to a cave in Turkey on Thursday, launching an operation to save an American researcher who became trapped almost 1,000 meters (3,000 feet) below the cave's entrance after suffering stomach bleeding.",
      "publishedAt": "2023-09-07T11:18:12Z",
      "title": "An ailing American explorer trapped 3,000 feet deep in Turkish cave awaits difficult rescue",
      "url": "https://apnews.com/c9d4ac9ede90e6fe145e9bcf815b4ad8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ad9f793fe454188940cf0c1b11eb588/1920.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM and SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Ta’Kiya Young treated her two little boys like kings, dressing them sharply, letting them have too many sweets, cooking them big gourmet meals of T-bone steak with broccoli, cheese and rice.",
      "publishedAt": "2023-09-07T13:37:30Z",
      "title": "Ta’Kiya Young, killed by police in an Ohio parking lot, is mourned along with her unborn child",
      "url": "https://apnews.com/950a81a401d3d4de1221c7455bfdacc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/078329f52da346bfa1bfe0bbf69623d5/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "WASHINGTON (AP) — President Joe Biden wants to show the world at the Group of 20 summit in India and during a stop in Vietnam that the United States and its like-minded allies are better economic and security partners than China.",
      "publishedAt": "2023-09-07T14:08:45Z",
      "title": "Biden to use G20 summit and Vietnam visit to highlight US as trustworthy alternative to China",
      "url": "https://apnews.com/ed35f86a9a15f6fad311755ce3de1fb2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48ac7e3662f54fee8b8f17eb0b01d1ce/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}