{
  "articles": [
    {
      "author": "JEFF AMY",
      "description": "WINDER, Ga. (AP) — A 14-year-old student opened fire at a Georgia high school and killed four people on Wednesday, authorities said, sending students scrambling for shelter in their classrooms — and eventually to the football stadium — as officers swarmed the campus and parents raced to find out if their children were safe.",
      "publishedAt": "2024-09-04T15:56:03Z",
      "title": "A 14-year-old student fatally shot 4 people in a rampage at a Georgia high school, officials say",
      "url": "https://apnews.com/3969d34cf6a7adc787facf21c469ef4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f23376c76a440b4855466f6a0ff385b/1920.jpeg"
    },
    {
      "author": "ALAN SUDERMAN and ALI SWENSON",
      "description": "NEW YORK (AP) — They have millions of followers online. They have been major players in right-wing political discourse since Donald Trump was president. And they worked unknowingly for a company that was a front for a Russian influence operation, U.S.",
      "publishedAt": "2024-09-05T00:20:54Z",
      "title": "Right-wing influencers were duped to work for covert Russian influence operation, US says",
      "url": "https://apnews.com/999435273dd39edf7468c6aa34fad5dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be5bf3c645224095ba9ac1b315c3b050/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu said Wednesday that Israel must keep open-ended control of Gaza’s border with Egypt, digging in on his stance on an issue that has threatened to derail cease-fire efforts.",
      "publishedAt": "2024-09-04T19:52:34Z",
      "title": "Israel's Netanyahu demands open-ended control of Gaza's border with Egypt",
      "url": "https://apnews.com/62ff158ec4c7414dada38541dcb30c40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50a21a05751c4481af27674e128d840a/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA and DAKE KANG",
      "description": "TOKYO (AP) — One by one, the students, lawyers and others filed into a classroom in a central Tokyo university for a lecture by a Chinese journalist on Taiwan and democracy — taboo topics that can't be discussed publicly back home in China.",
      "publishedAt": "2024-09-05T00:35:56Z",
      "title": "For many investors and intellectuals leaving China, it's Japan — not the US — that's the bigger draw",
      "url": "https://apnews.com/99898105a2204d22669f6c693c58cbd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a64183dd1bee48c491b3feae7928de04/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has accepted the rules set forth for next week's debate with former President Donald Trump, although the Democratic nominee says the decision not to keep both candidates' microphones live throughout the matchup will be to her disadvantage.",
      "publishedAt": "2024-09-04T23:00:46Z",
      "title": "Harris accepts rules for Sept. 10 debate with Trump on ABC, including microphone muting",
      "url": "https://apnews.com/b32da6552750c16c8951221dbf87739d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd44d4144c7c49e387e053bd608ad282/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — A judge will hear arguments Thursday about potential next steps in the federal election subversion prosecution of Donald Trump in the first hearing since the Supreme Court narrowed the case by ruling that former presidents are entitled to broad immunity from criminal charges.",
      "publishedAt": "2024-09-05T04:16:43Z",
      "title": "Trump election subversion case back in court as judge holds hearing that could set its path forward",
      "url": "https://apnews.com/f29a81ddd995b15afe95fcc00e928465",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa5d927a896e4805ba4558a895684340/2811.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "DENVER (AP) — Opening statements are scheduled Thursday in the trial of a mentally ill man who shot and killed 10 people at a Colorado supermarket in 2021.",
      "publishedAt": "2024-09-05T04:12:50Z",
      "title": "Opening statements are scheduled in the trial of a man who killed 10 at a Colorado supermarket",
      "url": "https://apnews.com/ca3da921bf27bf81ca257be070e2d754",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c06b73a770164ea6b3542aae36943207/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Pope Francis and the grand imam of Southeast Asia’s largest mosque vowed Thursday to fight religiously inspired violence and protect the environment, issuing a joint call for interfaith friendship and common cause at the heart of Francis’ visit to Indonesia.",
      "publishedAt": "2024-09-05T03:00:07Z",
      "title": "Pope and imam of Southeast Asia's largest mosque make joint call to fight violence, protect planet",
      "url": "https://apnews.com/5a501271b2ed6a59a5c72897d1388b80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5b1067a6e3fc4931b91bd8ea0beab201/1920.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — A month ago, a student-led movement ousted Bangladesh’s prime minister, Sheikh Hasina, after weeks of protests and clashes that killed over 600 people and pushed the country to the brink of chaos.",
      "publishedAt": "2024-09-05T03:23:39Z",
      "title": "Students in Bangladesh forced out the country's leader a month ago. Where do things stand now?",
      "url": "https://apnews.com/cb3b0e6a651084f265fbb93dd55530ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6496385918ea440f85a7d3415f208d08/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — The questions wouldn't stop for Jessica Pegula: Why was she 0-6 in Grand Slam quarterfinals heading into her U.S.",
      "publishedAt": "2024-09-04T18:00:12Z",
      "title": "US Open: Jessica Pegula upsets No. 1 Iga Swiatek to reach her first Grand Slam semifinal",
      "url": "https://apnews.com/f2a30995515c89dabfbf4aa97d611642",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67740d42680c46d4b13b0b31d425f6c0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}