{
  "articles": [
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — When President Joe Biden needs advice, there are two people he can turn to who know what it’s like to sit in his chair. Sometimes he will invite Barack Obama over to the White House for a meal or he will get on the phone with Bill Clinton.",
      "publishedAt": "2024-03-27T13:01:06Z",
      "title": "Biden leans on his Democratic predecessors as Trump remains isolated from other Republican leaders",
      "url": "https://apnews.com/e6723a71708962f8f694628b54be53d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd07a163c6424f9e81c1b32197fd4f0a/3000.jpeg"
    },
    {
      "author": "LEA SKENE and BRIAN WITTE",
      "description": "BALTIMORE (AP) — Investigators began collecting evidence Wednesday from the cargo ship that plowed into Baltimore’s Francis Scott Key Bridge and caused its collapse, while in the waters below divers searched through twisted metal for six construction workers who plunged into the harbor and were feared dead.",
      "publishedAt": "2024-03-27T04:03:00Z",
      "title": "Investigation into Baltimore bridge collapse picks up speed as divers search for missing workers",
      "url": "https://apnews.com/6a95340e5daeff6551fc999d23feb278",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ac4b5c3c4fd4ffb9a6e6e59b4bed36b/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel's deadly airstrike in southern Lebanon targeting a paramedic center linked to a Sunni Muslim group triggered a barrage of rockets Wednesday into northern Israel that was claimed by the militant group Hezbollah, killing at least one person.",
      "publishedAt": "2024-03-27T09:25:37Z",
      "title": "The Latest | Hezbollah launches rockets into Israel after an Israeli strike kills 7 in Lebanon",
      "url": "https://apnews.com/dac468145fa4170a368938e527eec269",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afa2a2e2e1414e909c7370837b332cb8/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY, ANNIE MA and NOREEN NASIR",
      "description": "CHICAGO (AP) — When she started writing her college essay, Hillary Amofa told the story she thought admissions offices wanted to hear. About being the daughter of immigrants from Ghana and growing up in a small apartment in Chicago.",
      "publishedAt": "2024-03-27T04:12:00Z",
      "title": "Should college essays touch on race? Some feel the affirmative action ruling leaves them no choice",
      "url": "https://apnews.com/f0c006a6210ab244c1b6b4c2b1926b6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f32ff3560d694463a25b1d22f28aa4db/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — When President Joe Biden needs advice, there are two people he can turn to who know what it’s like to sit in his chair. Sometimes he will invite Barack Obama over to the White House for a meal or he will get on the phone with Bill Clinton.",
      "publishedAt": "2024-03-27T13:01:06Z",
      "title": "Biden leans on his Democratic predecessors as Trump remains isolated from other Republican leaders",
      "url": "https://apnews.com/e6723a71708962f8f694628b54be53d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd07a163c6424f9e81c1b32197fd4f0a/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "Donald Trump lashed out Wednesday at the New York judge who put him under a gag order that bars him from commenting publicly about witnesses, prosecutors, court staff and jurors in his upcoming hush-money criminal trial.",
      "publishedAt": "2024-03-27T16:31:14Z",
      "title": "Donald Trump assails judge and his daughter after gag order in New York hush-money criminal case",
      "url": "https://apnews.com/578a0c6334b206d81dc2ebf6a410a502",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4f8e29f9b464fbab55dc873845603c6/3000.jpeg"
    },
    {
      "author": "BILL BARROW and LINLEY SANDERS",
      "description": "ATLANTA (AP) — Many Americans are unenthusiastic about a November rematch of the 2020 presidential election. But presumptive GOP nominee Donald Trump appears to stoke more anger and fear among Americans from his opposing party than President Joe Biden does from his.",
      "publishedAt": "2024-03-27T04:01:40Z",
      "title": "Trump evokes more anger and fear from Democrats than Biden does from Republicans, AP-NORC poll shows",
      "url": "https://apnews.com/2d29d5b0be4fe11272ec372542b76b44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13b1cd523fca45f889a5466a3bcad9ff/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Earth’s changing spin is threatening to toy with our sense of time, clocks and computerized society in an unprecedented way — but only for a second.For the first time in history, world timekeepers may have to consider subtracting a second from our clocks in a few years because the planet is rotating a tad faster than it used to.",
      "publishedAt": "2024-03-27T16:01:58Z",
      "title": "A faster spinning Earth may cause timekeepers to subtract a second from world clocks",
      "url": "https://apnews.com/74eaac47b9c429910723a604897032a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed80700ab45941b2979c4f6bc5da6fa6/3000.jpeg"
    },
    {
      "author": "STEPHEN McGRATH",
      "description": "Since Russia invaded Ukraine two years ago, fears have risen in neighboring Moldova that it could also be in Moscow’s crosshairs.Like Ukraine, Moldova is a former Soviet republic that has aligned itself with the West and aspires to join the European Union.",
      "publishedAt": "2024-03-27T15:57:18Z",
      "title": "How events in Moldova's breakaway Transnistria region raised fears of Russian interference",
      "url": "https://apnews.com/99575f5e67c222edced149031417bd5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a20a5a460b94462a4f27ad38bc9e579/3000.jpeg"
    },
    {
      "author": "MIKE SCHNEIDER",
      "description": "ORLANDO, Fla. (AP) — Allies of Gov. Ron DeSantis and Disney reached a settlement agreement Wednesday in a state court fight over how Walt Disney World is developed in the future following the takeover of the theme park resort's government by the Florida governor.",
      "publishedAt": "2024-03-27T14:26:06Z",
      "title": "Settlement reached in lawsuit between Disney and Florida Gov. Ron DeSantis' allies",
      "url": "https://apnews.com/91040178ad4708939e621dd57bc5e494",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abd19aad8af64f9da90d3abf01664699/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}