{
  "articles": [
    {
      "author": null,
      "description": "Law enforcement are responding to what the FBI described as a “targeted terror attack” in Boulder, Colorado. FBI Director Kash Patel said in a social media post on Sunday that FBI agents and local police were on the scene and would provide more details soon. Boulder Police say they are evacuating several blocks of the typically popular pedestrian mall area. Police say there were “several victims” in the attack without providing further details.",
      "publishedAt": "2025-06-01T21:49:09Z",
      "title": "FBI and law enforcement respond to 'terror attack' in Boulder, Colorado",
      "url": "https://apnews.com/article/boulder-terror-attack-colorado-8af1b11734cbbe75c9945820a9b6684c",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Samya Kullab",
      "description": "President Volodymyr Zelenskyy says Ukraine will send a delegation to Istanbul for a new round of direct peace talks with Russia on Monday,. The meeting comes even as Russia pounded Ukraine with a missile strike that killed 12 soldiers and the biggest drone assault of the three-year war. Ukrainian officials had previously called on the Kremlin to provide a promised memorandum setting out its position on ending the war before the meeting takes place. Moscow had said it would share its memorandum during the talks. Ukraine's air force says Russia launched the biggest number of drones on Ukraine since the full-scale invasion on Sunday.",
      "publishedAt": "2025-06-01T11:16:23Z",
      "title": "Ukraine says Russia launched the biggest number of drones in the 3-year war",
      "url": "https://apnews.com/article/russia-ukraine-war-sumy-region-18966d4b286ffb6f4e764b94a6afaf61",
      "urlToImage": "https://dims.apnews.com/dims4/default/9555c01/2147483647/strip/true/crop/8514x4789+0+443/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F1f%2Ff770a3b11279fb7ff87fb7c81c9a%2Fd2a46c24c49244bbbe8985d1be2f6a45"
    },
    {
      "author": "Mohammad Jahjouh, Samy Magdy",
      "description": "Gaza health officials and multiple witnesses say at least 25 people were killed and scores were wounded as they were on their way to receive food in the strip. The witnesses said Israeli forces fired on crowds on Sunday around a kilometer away from an aid site run by an Israeli-backed foundation. The military released a brief statement saying it was unaware of any injuries caused by Israeli fire within the distribution site. The foundation said it delivered aid at its sites “without incident” early on Sunday. An Associated Press reporter saw dozens of people being treated at a nearby field hospital.",
      "publishedAt": "2025-06-01T05:01:36Z",
      "title": "At least 21 Palestinians killed, 175 injured while trying to get aid in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-06-01-2025-67688833abb96fc068c42d10da90a0a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/3f974bb/2147483647/strip/true/crop/4244x2387+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fd3%2Fcb534f5ae45f8f088b480cd10d10%2F6c40f11cc69541298a7ea395cfc46fc4"
    },
    {
      "author": "Vanessa Gera",
      "description": "Poles are voting in a decisive presidential runoff that could set the course for the nation’s political future and its relations with the European Union. The contest Sunday pits Warsaw Mayor Rafał Trzaskowski, a liberal pro-European Union figure, against Karol Nawrocki, a conservative historian backed by the right-wing Law and Justice party. The outcome will determine whether Poland continues along a nationalist path or pivots more decisively toward liberal democratic norms. With President Andrzej Duda completing his second and final term, the new president will have significant influence over the legislative agenda of Prime Minister Donald Tusk’s centrist government, given the presidential power to veto laws.",
      "publishedAt": "2025-06-01T05:05:36Z",
      "title": "Poland holds the second round of presidential election",
      "url": "https://apnews.com/article/poland-presidential-election-e9ae2771d1c774528bff6c6bc9e90e26",
      "urlToImage": "https://dims.apnews.com/dims4/default/a257a83/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F06%2F5454ed26e49747fe51805c169f64%2Fcc05e81107984604bc15ce90a994cc7e"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump faces the challenge of convincing Republican senators, global investors, voters and even Elon Musk that he won’t bury the federal government in debt with his multitrillion-dollar tax breaks package. The response so far from financial markets has been skeptical as Trump seems unable to trim deficits as promised. The tax and spending cuts that passed the House last month would add $5.1 trillion to the national debt in the coming decade if they are allowed to continue. That's according to the Committee for a Responsible Financial Budget, a fiscal watchdog group.",
      "publishedAt": "2025-06-01T11:23:12Z",
      "title": "Can Trump fix the US debt? Even Elon Musk has doubts",
      "url": "https://apnews.com/article/trump-beautiful-bill-budget-deficit-debt-31e5857c9e94deaa11a176bbec538831",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5ea45a/2147483647/strip/true/crop/5575x3136+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Fb6%2Faa043cffb54377c1b59960e60998%2F6e8fdbefe3964cbdaabcbc156dfe5e1f"
    },
    {
      "author": null,
      "description": "French authorities say 2 fans died and a police officer is in a coma after celebrations around the country for Paris-Saint Germain’s historic Champions League victory, European soccer’s biggest prize. A 17-year-old boy was stabbed to death in the city of Dax during a PSG street party, the national police service said Sunday. A man was killed in Paris when his scooter was hit by a car during PSG celebrations Saturday night, the interior minister’s office said. The circumstances of both are being investigated. A police officer was hit accidentally by fireworks in northwest France and placed in an artificial coma because of grave eye injuries, the national police service said.",
      "publishedAt": "2025-06-01T09:50:56Z",
      "title": "France: 2 fans died and an officer is in a coma after Champions League celebrations",
      "url": "https://apnews.com/article/france-psg-champions-league-celebrations-2e97d3ebd4ae21eacc9dafe0872a42a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/a58b152/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fce%2Ff23f64f0e13c7436fcef619e02ec%2F3f4722869082493b82d9ef27a6e7d74d"
    },
    {
      "author": null,
      "description": "More than 25,000 residents in three provinces have been evacuated as dozens of wildfires remained active Sunday and diminished air quality in parts of Canada and the U.S. Most of the evacuated residents were from Manitoba, which declared a state of emergency last week. About 17,000 there were evacuated by Saturday along with 1,300 in Alberta. About 8,000 people in Saskatchewan had been relocated but leaders there warned the number could climb in the coming days. Smoke was worsening air quality and reducing visibility in Canada and into some U.S. states along the border.",
      "publishedAt": "2025-06-01T16:33:53Z",
      "title": "Thousands evacuated in 3 provinces as Canadian wildfires threaten air quality into some US states",
      "url": "https://apnews.com/article/fire-canada-us-smoke-air-quality-firefighters-b1a37dac81acd22d549a9c8e331e0291",
      "urlToImage": "https://dims.apnews.com/dims4/default/6609b38/2147483647/strip/true/crop/5500x3094+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F03%2F819e4cac494403248747df27e291%2F9005a7a60397475187955d36b4cb4b57"
    },
    {
      "author": "Luis Andres Henao",
      "description": "A group of young Catholics attend Mass every weekday at noon at the Princeton University Chapel. The members of the Catholic campus ministry worship at a side altar reserved for these Masses. They see it as a sacred refuge amid a largely secular environment at the Ivy League school in New Jersey. News that the global Catholic Church would get its first U.S.-born pope was welcomed by Catholic students at Princeton and other U.S. universities. Some say they're hopeful that Pope Leo XIV will help bring a revival for Catholicism in America.",
      "publishedAt": "2025-06-01T12:01:17Z",
      "title": "Catholic students worship daily at Princeton University's side chapel",
      "url": "https://apnews.com/article/us-catholic-college-students-pope-528f011b0079228e43f27e180c1397ac",
      "urlToImage": "https://dims.apnews.com/dims4/default/bf42c76/2147483647/strip/true/crop/6306x3547+0+328/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2F9c%2F79172055bdc4e252c7659a448a92%2Fcb1ed4fbec6747819978a16545f18f83"
    },
    {
      "author": "Carla K. Johnson",
      "description": "A first-of-its-kind experiment shows a three-year exercise program improved survival in colon cancer patients. The findings were featured Sunday at a cancer meeting in Chicago and published by the New England Journal of Medicine. Experts say cancer centers and insurance plans should consider making exercise coaching a new standard of care. Researchers followed 889 patients with treatable colon cancer who had completed chemotherapy. Half were given health information while the others worked with an exercise coach. Over time, the people in the structured exercise program had 28% fewer cancers and 37% fewer deaths from any cause.",
      "publishedAt": "2025-06-01T12:02:11Z",
      "title": "Study suggests a new prescription for colon cancer patients: Exercise",
      "url": "https://apnews.com/article/colon-cancer-exercise-study-recovery-prevention-9d77c2927152dfc16b717fa9cc9b9471",
      "urlToImage": "https://dims.apnews.com/dims4/default/1978964/2147483647/strip/true/crop/3684x2072+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F3a%2F7b752848b03ff1c509dc3ab3563a%2F732c5c52b473423a9dd01cb64dfe6b8a"
    },
    {
      "author": "Lindsey Bahr",
      "description": "“Lilo & Stitch” has once again placed first on the box office charts. According to studio estimates Sunday, the hybrid live-action Disney movie added $63 million in domestic ticket sales. With $280.1 million total, it surpassed “Sinners” to become the second-highest grossing film of the year. Second place went to “Mission: Impossible—The Final Reckoning” with $27.3 million. Newcomer “Karate Kid: Legends” opened in third with $21 million. “Final Destination: Bloodlines” landed in fourth place with $10.8 million in its third weekend, while the new horror movie “Bring Her Back” rounded out the top five with $7.1 million.",
      "publishedAt": "2025-06-01T15:43:54Z",
      "title": "'Lilo & Stitch' passes 'Sinners' to become 2nd highest grossing film of 2025",
      "url": "https://apnews.com/article/lilo-stitch-box-office-4c60a0754654fe8a8e785208fc8b7582",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b0358e/2147483647/strip/true/crop/4469x2514+765+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F9f%2Fa25bae72713dad31b8f0340a64ca%2F1226f0a95b2849adb26288bc053a5667"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}