{
  "articles": [
    {
      "author": "DAVE COLLINS",
      "description": "A moving company representative and lawyers were expected to be given access to Rudy Giuliani's Manhattan apartment on Thursday after the former New York City mayor failed to turn over belongings to two former Georgia election workers who won a $148 million defamation judgment against him.",
      "publishedAt": "2024-10-31T18:23:37Z",
      "title": "Lawyers are allowed into Giuliani's NYC apartment after he misses a deadline for turning over assets",
      "url": "https://apnews.com/845234e21edd853ca9826ec559fadfbe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6981b5bceb0c484e80dfeb3c5f75b463/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and COLLEEN LONG",
      "description": "PHOENIX (AP) — Kamala Harris said Thursday that Donald Trump’s comment that he would protect women whether they “like it or not” shows that the Republican presidential nominee does not understand women’s rights “to make decisions about their own lives, including their own bodies.\"",
      "publishedAt": "2024-10-31T15:48:42Z",
      "title": "Kamala Harris says Trump's comment on women 'is offensive to everybody'",
      "url": "https://apnews.com/f5903d49488ebc733d7ba5812b36f935",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86723fe3e75242a4b3bc44b154631fcf/1920.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and SUSAN MONTOYA BRYAN",
      "description": "ALBUQUERQUE, N.M. (AP) — Donald Trump is traveling to New Mexico and Virginia in the campaign's final days, taking a risky detour from the seven battleground states to spend time in places where Republican presidential candidates have not won in decades.",
      "publishedAt": "2024-10-31T12:22:34Z",
      "title": "Donald Trump gambles with late-stage trips to Democratic New Mexico and Virginia",
      "url": "https://apnews.com/55502679ef9df70306d10e0a431a3d69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86723fe3e75242a4b3bc44b154631fcf/1920.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "WASHINGTON (AP) — Protesters can create awkward moments for presidential candidates. They interrupt, heckle and, oftentimes, knock a candidate off track.But Vice President Kamala Harris is trying a new strategy late in the campaign to turn what would otherwise be awkward interactions into moments of energy used to rally her supporters and subtly drive her message against her Republican opponent, Donald Trump.",
      "publishedAt": "2024-10-31T20:12:08Z",
      "title": "Harris tries to turn Gaza protests into a way to energize the crowds at her rallies",
      "url": "https://apnews.com/d6aac06c7492bd4c93c567d70aaba38e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83aa376cfba6498a8e6859aadfb81538/3000.jpeg"
    },
    {
      "author": "ALI SWENSON and GARY FIELDS",
      "description": "CHARLOTTESVILLE, Va. (AP) — Few elections in the nation’s history have provided such a divide as this year's, with the two major candidates and so many of their supporters saying the outcome will determine the fate of the country and whether it can hold to its democratic moorings.",
      "publishedAt": "2024-10-31T04:10:17Z",
      "title": "US voters hear a stark message in the presidential race: The country's fate is on the line",
      "url": "https://apnews.com/17a9fcaf68ab8c1b7d12552d973937d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/403e6f618a4c40cfbe208b652065ce84/1920.jpeg"
    },
    {
      "author": "TARA COPP, MATTHEW LEE and EDITH M. LEDERER",
      "description": "WASHINGTON (AP) — Some 8,000 North Korean soldiers are now in Russia near Ukraine’s border and are preparing to help the Kremlin fight against Ukrainian troops in the coming days, the Biden administration said Thursday.",
      "publishedAt": "2024-10-31T10:34:14Z",
      "title": "About 8,000 North Korean troops at Ukraine's border are expected in combat in days, US says",
      "url": "https://apnews.com/9ee96dc1d4f07ac0813c698e6873f96b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/064a647aefb044b99c39879d708d58f5/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN, JULIA FRANKEL and FADI TAWIL",
      "description": "TEL AVIV, Israel (AP) — Rocket barrages from Lebanon into northern Israel killed four foreign workers and three Israelis on Thursday, Israeli medics said, the deadliest cross-border strikes in Israel since it invaded Lebanon.",
      "publishedAt": "2024-10-31T11:51:27Z",
      "title": "Rocket fire from Lebanon kills 7 in Israel as US officials try to push for cease-fires",
      "url": "https://apnews.com/5554f469d1ac348c8da19b7faa3e5fbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19196d0ae6b84de48485a109f688367b/1920.jpeg"
    },
    {
      "author": "RUSS BYNUM",
      "description": "SAVANNAH, Ga. (AP) — Survivors of a deadly walkway collapse at a state-run ferry dock on a Georgia island said Thursday that the government should help them pay for funerals for the seven people who died as well as medical bills and mental health counseling for those who lived.",
      "publishedAt": "2024-10-31T22:16:38Z",
      "title": "Survivors of deadly collapse at Georgia dock seek state's help for funerals, counseling",
      "url": "https://apnews.com/48ded0e5936d56df39be0545a6f89669",
      "urlToImage": ""
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — Billions of dollars in advertising are raining down on voters across the Rust Belt, Rocky Mountains and American southwest as the two major political parties portray their opponent's candidates as extreme in a struggle for control of the U.S.",
      "publishedAt": "2024-10-31T13:03:06Z",
      "title": "The struggle for Senate control goes down to the wire as spending shatters records",
      "url": "https://apnews.com/32f653b47ab80ce67bd9204342b2253a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a825b0a682de45248be9a66f35b13dc4/3000.jpeg"
    },
    {
      "author": "ALBERTO SAIZ, JOSEPH WILSON and ALICIA LEÓN",
      "description": "BARRIO DE LA TORRE, Spain (AP) — Crews searched for bodies in stranded cars and sodden buildings Thursday as residents salvaged what they could from their ruined homes following monstrous flash floods in Spain that claimed at least 158 lives, with 155 deaths confirmed in the eastern Valencia region alone.",
      "publishedAt": "2024-10-31T08:18:41Z",
      "title": "Spain searches for bodies after unprecedented flooding claims at least 158 lives",
      "url": "https://apnews.com/30c6ef59ddf27598c691c89d0ba41442",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a00382b5abe465ea7b7405cc74e74f6/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}