{
  "articles": [
    {
      "author": null,
      "description": "TRABUCO CANYON, Calif. (AP) — 4 people killed in a shooting at a Southern California biker bar, Orange County Sheriff's officials say.",
      "publishedAt": "2023-08-24T04:07:46Z",
      "title": "4 people killed in a shooting at a Southern California biker bar, Orange County Sheriff's officials say",
      "url": "https://apnews.com/113a069cd357a70d01f980eada8d4299",
      "urlToImage": ""
    },
    {
      "author": null,
      "description": "OKUMA, Japan (AP) — The Fukushima Daiichi nuclear power plant has begun releasing its first batch of treated radioactive water into the sea.",
      "publishedAt": "2023-08-24T04:04:34Z",
      "title": "The Fukushima Daiichi nuclear power plant has begun releasing its first batch of treated radioactive water into the sea",
      "url": "https://apnews.com/5d1361d267f3e32e7bb239ea351a5881",
      "urlToImage": ""
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "OKUMA, Japan (AP) — The operator of the tsunami-wrecked Fukushima Daiichi nuclear power plant says it has begun releasing its first batch of treated radioactive water into the Pacific Ocean.In a live video from a control room at the plant Thursday, Tokyo Electric Power Company Holdings showed a staff member turn on a seawater pump, marking the beginning of the controversial project that is expected to last for decades.",
      "publishedAt": "2023-08-24T01:56:56Z",
      "title": "The Fukushima nuclear plant begins releasing radioactive wastewater into the sea",
      "url": "https://apnews.com/04d2423accd508e57afcd9e1eb6714ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f03c50f03b404880bdd25f99424fcef5/3000.jpeg"
    },
    {
      "author": null,
      "description": "MILWAUKEE (AP) — Follow along for live updates on the first 2024 Republican presidential debate. The field's early front-runner, Donald Trump, skipped the event and conducted an interview with Tucker Carlson instead.",
      "publishedAt": "2023-08-23T18:58:34Z",
      "title": "The first 2024 Republican presidential debate is in the books. Here's what happened",
      "url": "https://apnews.com/15e2b98fc7f6874aa75b585fe6d27cc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/681ef4a99ed44bdb90104dd779438f79/3000.jpeg"
    },
    {
      "author": null,
      "description": "TRABUCO CANYON, Calif. (AP) — Three people have been killed in a shooting at a Southern California biker bar, Orange County Sheriff’s officials said. The shooter also died, according to authorities.",
      "publishedAt": "2023-08-24T03:57:17Z",
      "title": "Authorities say 4 people dead in shooting at California biker bar",
      "url": "https://apnews.com/be474bdb916250261808d34cc20f67b3",
      "urlToImage": ""
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Mercenary leader Yevgeny Prigozhin, who led a brief armed rebellion against the Russian military earlier this year, was presumed dead Wednesday after a plane crash north of Moscow that killed all 10 people on board.",
      "publishedAt": "2023-08-23T17:20:45Z",
      "title": "Mercenary leader Yevgeny Prigozhin is presumed dead in a plane crash outside Moscow",
      "url": "https://apnews.com/a7859e4e57f2efa2547dfbe5bdbaa1b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d80bd403d7a46a7b268efe64edccfc4/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Rudy Giuliani, Donald Trump's lawyer and confidant, turned himself in at a jail in Atlanta on Wednesday on charges related to efforts to overturn then-President Trump's loss in the 2020 presidential election in Georgia.",
      "publishedAt": "2023-08-23T13:26:37Z",
      "title": "Giuliani turns himself in on Georgia 2020 election charges after bond is set at $150,000",
      "url": "https://apnews.com/203b1e69cbff227a0bf8cc59a6bb645f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/abf3b557f4b7417faffe49198322f35e/1920.jpeg"
    },
    {
      "author": "REBECCA BOONE, HEATHER HOLLINGSWORTH, CLAUDIA LAUER and CHRISTOPHER L. KELLER",
      "description": "As flames tore through a West Maui neighborhood, car after car of fleeing residents headed for the only paved road out of town in a desperate race for safety.",
      "publishedAt": "2023-08-23T04:53:19Z",
      "title": "In deadly Maui fires, many had no warning and no way out. Those who dodged a barricade survived",
      "url": "https://apnews.com/c8522222f6de587bd14b2da0020c40e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2f7ed7b141f448bb968681023849876/1920.jpeg"
    },
    {
      "author": "ASHOK SHARMA and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — India became the first country to land a spacecraft near the moon’s south pole on Wednesday — a historic voyage to uncharted territory that scientists believe could hold vital reserves of frozen water, and a technological triumph for the world’s most populous nation.",
      "publishedAt": "2023-08-23T07:23:23Z",
      "title": "India lands a spacecraft near the moon's south pole, a first for the world as it joins elite club",
      "url": "https://apnews.com/b31109bb08197f33b829e7a6e4edfc6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a2290b648354db88685cc27f9ebfcc8/1920.jpeg"
    },
    {
      "author": "JAMES POLLARD",
      "description": "COLUMBIA, S.C. (AP) — South Carolina’s newly all-male Supreme Court reversed course on abortion Wednesday, upholding a law banning most such procedures except in the earliest weeks of pregnancy.The continued erosion of legal abortion access across the U.S.",
      "publishedAt": "2023-08-23T14:24:54Z",
      "title": "South Carolina's new all-male highest court reverses course on abortion, upholding strict 6-week ban",
      "url": "https://apnews.com/f4e0d8ef8187fdd1e8db54dd464011b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14226c67cca84c15856d68820fc2ab82/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}