{
  "articles": [
    {
      "author": "Samya Kullab, Hanna Arhirova",
      "description": "Ukrainians are grappling with the consequences of the Trump administration’s decision to pause military aid vital for their fight against Russia’s invasion. That step came days after a disastrous Oval Office row that has deepened a rift between Kyiv and the White House. U.S. President Donald Trump directed the U.S. to pause all assistance to Ukraine as he seeks to pressure Ukrainian President Volodymyr Zelenskyy to engage in peace talks with Russia. Ukraine, which depends heavily on foreign help to hold back the Russian invasion that began on Feb. 24 2022, Kyiv has feared the possibility of aid being stopped to Ukraine ever since Trump took office.",
      "publishedAt": "2025-03-04T07:33:52Z",
      "title": "Ukrainians grapple with consequences of Trump's pause on all military aid",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-zelenskyy-military-aid-2ce8b167f0ba948b2b606381192de71d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e1edbb/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F91%2Ff1341c4558686103f9a903dee635%2Fb44068ffe5414269ada4c6acf253f811"
    },
    {
      "author": "Aamer Madhani, Zeke Miller, Lisa Mascaro",
      "description": "President Donald Trump has directed a “pause” to U.S. assistance to Ukraine after a disastrous Oval Office meeting as he seeks to pressure Ukrainian President Volodymyr Zelenskyy to engage in negotiations to end the war with Russia. A White House official said Monday that Trump is focused on reaching a peace deal and wants Zelenskyy “committed” to that goal. The official added that the U.S. was “pausing and reviewing” its aid to “ensure that it is contributing to a solution.” The official said the order will remain in effect until Trump determines that Ukraine has demonstrated a commitment to peace negotiations with Russia. The official spoke on the condition of anonymity to discuss the assistance.",
      "publishedAt": "2025-03-03T17:17:13Z",
      "title": "Trump hits 'pause' on US aid to Ukraine after Oval Office blowout with Zelenskyy",
      "url": "https://apnews.com/article/trump-zelenskyy-russia-ukraine-a15a459c9a3a393d040478ebbe250a9e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2e60696/2147483647/strip/true/crop/5406x3041+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F11%2Fbd228bd69da23a0d1c8d54177126%2Fa042713247604b1d960387634a3a2abf"
    },
    {
      "author": "Lolita C. Baldor, David Klepper",
      "description": "The U.S. Cyber Command is pausing its offensive operations against Russia. Defense Secretary Pete Hegseth made the decision, which was confirmed Monday by a U.S. official speaking on condition of anonymity to discuss sensitive operations. The suspension of some cybersecurity preparations comes as many national security experts warn of a greater threat posed by Russia, China and other adversaries. Hegseth’s decision doesn't affect cyberoperations conducted by other agencies, including the CIA. U.S. Cyber Command oversees and coordinates defensive and offensive cybersecurity work for the Pentagon and is known as America's first line of defense in cyberspace.",
      "publishedAt": "2025-03-03T23:50:04Z",
      "title": "Hegseth orders suspension of Pentagon's offensive cyberoperations against Russia",
      "url": "https://apnews.com/article/cyber-command-russia-putin-trump-hegseth-c46ef1396e3980071cab81c27e0c0236",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a00bcd/2147483647/strip/true/crop/5898x3318+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc5%2F95%2F4fec8f439d9b5a96bc933ed7e0d0%2F941e7344fa8b43f7a556580907c3e50e"
    },
    {
      "author": "Samya Kullab",
      "description": "Ukraine’s president has few options after last week’s astonishing Oval Office row with U.S. President Donald Trump, who berated the wartime leader. Now Ukraine’s future could depend on whether Volodymyr Zelenskyy can repair his relationship with the White House. The heated conversation that played out live on television looms over all American support for Ukraine and could shape the country’s war against the Russian invasion. The scene will almost certainly stick with Zelenskyy for the rest of his presidency, if not his life. American officials have said that they want an apology from Zelenskyy. He has maintained his cool in public appearances since the episode and leaned into European support.",
      "publishedAt": "2025-03-03T20:01:39Z",
      "title": "Without US help, Zelenskyy has few options except to repair his relationship with the White House",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-zelenskyy-meeting-30be085063f4f6f3df242553402234f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/e69b517/2147483647/strip/true/crop/3000x1688+0+89/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F8c%2F7e65d1240d29388e8372d6f5fa67%2F07755a3d2a3f425c842ffb2e5adafd88"
    },
    {
      "author": "Alex Turnbull, John Leicester",
      "description": "France’s prime minister has torn into U.S. President Donald Trump’s Oval Office thrashing of Ukrainian President Volodymyr Zelenskyy by calling it a staggering show of “brutality” that aimed to humiliate Ukraine's leader. The extraordinarily frank criticism from Prime Minister François Bayrou came in a parliamentary debate on Ukraine on Monday. His words diverged from the more nuanced tone that French President Emmanuel Macron has adopted in the wake of the clash at the White House on Friday and dropped the diplomatic niceties that customarily mark French-U.S. relations. Bayrou called it “a staggering scene” that was “marked by brutality” and “a desire to humiliate” Zelenskyy.",
      "publishedAt": "2025-03-03T17:02:49Z",
      "title": "France's prime minister tears into Trump's attack on Zelenskyy",
      "url": "https://apnews.com/article/trump-zelenskyy-france-bayrou-ukraine-oval-office-1b12c5024d0aad34bd4336ef931e51f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/66b5c02/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F32%2F195dded766fd39ec9be3febd866e%2F5f9cbe2997264a62901d3d005122cc3f"
    },
    {
      "author": "Eric Tucker",
      "description": "As his White House meeting with his Ukrainian counterpart devolved into a stunning blowup, President Donald Trump leaned on a familiar refrain to explain his unique kinship with Russian leader Vladimir Putin. He said that Putin had “suffered” through the investigation into Russian interference in the 2016 presidential election. The reference underscored the extent to which Trump’s lingering fury over an inquiry he has misleadingly branded a “hoax” remains top of mind even now. It also showed that Trump’s view of a war that Russia launched in Ukraine three years ago is colored not only by his relationship with Putin but also by his experience with Ukrainian President Volodymyr Zelenskyy.",
      "publishedAt": "2025-03-03T21:08:27Z",
      "title": "How Trump's history with Russia and Ukraine set the stage for a blowup with Zelenskyy",
      "url": "https://apnews.com/article/trump-russia-ukraine-fbi-mueller-ff6d60923de68632f2671e275083b54b",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e09336/2147483647/strip/true/crop/3725x2095+0+194/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fb3%2F5f7b2a70fc257be2ea121a8e048d%2F95657bc2e31147ca99168afd90e91651"
    },
    {
      "author": "Sam Mcneil",
      "description": "Palestinians cheered the Oscar win of the Palestinian-Israeli documentary “No Other Land,” documenting the struggle of West Bank villagers facing possible expulsion by the Israeli military. And they hope the increased attention for the film will bring them some help. The film looks at Masafer Yatta, a remote hilly area home to some 1,000 Palestinians that Israel has declared a military life-fire training zone. In the villages that make up the area, the director's younger brother pointed out Jewish settlements that have cropped up over the past 18 months. In Israel, the film has been met with anger.",
      "publishedAt": "2025-03-03T21:19:13Z",
      "title": "Palestinians hope 'No Other Land' Oscar win brings help as they face possible Israeli expulsion",
      "url": "https://apnews.com/article/no-other-land-oscar-win-palestinians-3c70e4ea1e7b213849f192dab5620a4c",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec25b2f/2147483647/strip/true/crop/6094x3428+0+318/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2F12%2F8fcaf24934e718fb0b197b756356%2F4e053be78f88448f977e5aaee97b35c2"
    },
    {
      "author": "Luis Andres Henao",
      "description": "Greenlanders have been pushed into the global spotlight in the weeks since U.S. President Donald Trump said America could take over their Arctic homeland. Most say they don’t want to be American. Many are worried and overwhelmed by the comments and the attention. But also hopeful. They say Trump’s comments have ignited unprecedented interest in full independence from Denmark — a key issue in a parliamentary election on March 11. Greenland is coveted for its strategic location, its valuable rare earth minerals and its potential for shipping routes as the ice that covers most of the world’s largest island keeps retreating due to climate change.",
      "publishedAt": "2025-03-04T06:14:07Z",
      "title": "On a cold northern island, a mantra rises: 'Greenland is not for sale'",
      "url": "https://apnews.com/article/buy-greenland-trump-united-states-denmark-c5c2169a4b43c133eacbc4529126f3b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/26aec3e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Fde%2Fab9da8fa4c9d95939f6c41039c3b%2F7c432e5894984a20b4cf2ba5d8818f80"
    },
    {
      "author": "Simina Mistreanu",
      "description": "China's leaders are overseeing a spell of deflation, or falling prices, that contrasts with inflationary pressures prevailing elsewhere in the world. While cheaper prices can be a blessing, deflation is a symptom of relatively weak demand and stalling economic growth. Falling housing prices have left many families reluctant to spend, while factories keep churning out goods. This has led to the country's longest deflationary streak since the 1960s. Deflation is an abstract economic concept but it reflects very concretely in family balance sheets. Economists say it may signal bigger trouble ahead, while rising tariffs on Chinese exports to the United States could dent demand, further aggravating the problem.",
      "publishedAt": "2025-03-04T03:04:02Z",
      "title": "Falling prices signal trouble for China's economy",
      "url": "https://apnews.com/article/china-economy-deflation-housing-congress-36d116f4657aa3064882af9b2dd57b14",
      "urlToImage": "https://dims.apnews.com/dims4/default/8b16048/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2Fab%2F3f5275ae333e42a213a96060a8b7%2F8a8918df8a4c4d77836d7d06116e4358"
    },
    {
      "author": "Josh Boak, Paul Wiseman, Rob Gillies",
      "description": "President Donald Trump’s long-threatened tariffs against Canada and Mexico have gone into effect, kicking off a trade war with America's neighbors. Starting just past midnight Tuesday, imports from Canada and Mexico are now taxed at 25%, with Canadian energy products subject to 10% import duties. In addition, the 10% tariff that Trump placed on Chinese imports in February was doubled to 20%. China retaliated Tuesday with additional tariffs of up to 15% on a wide array of U.S. farm exports, among other measures. Canada also has announced tariffs on American goods. Trump's moves have raised inflation fears, even as he has promised the American public that taxes on imports are the easiest path to national prosperity.",
      "publishedAt": "2025-03-04T05:03:54Z",
      "title": "Trump tariffs on Canada and Mexico take effect",
      "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-643086a6dc7ff716d876b3c83e3255b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/dbd1fcd/2147483647/strip/true/crop/3000x1688+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe1%2Fa8%2Fbdde94a2bac327067aab245c44c2%2F00c2c6a26d3b4061ba25590f48e727bb"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}