{
  "articles": [
    {
      "author": "COLLEEN LONG and WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden warned Monday that a Supreme Court ruling granting presidents broad immunity from prosecution would make an unchecked Republican Donald Trump “more emboldened to do whatever he wants” if he regains the White House in November’s election.",
      "publishedAt": "2024-07-01T19:06:46Z",
      "title": "After Supreme Court immunity ruling, Biden draws sharp contrast with Trump on obeying rule of law",
      "url": "https://apnews.com/c47243b3cedb88ce6ea7905a1975e164",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be92ef27dae54ae6bdb332ab768d5b3a/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Former President Donald Trump’s lawyers have asked the New York judge who presided over his hush money trial to set aside his conviction and delay his sentencing, scheduled for next week.",
      "publishedAt": "2024-07-02T00:28:45Z",
      "title": "Trump seeks to set aside his New York hush money guilty verdict after Supreme Court immunity ruling",
      "url": "https://apnews.com/3d97d2e9497a5a208c1309aec7a0cd6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b7612268ff744f896222fdc8566e1ff/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "An Israeli strike has killed at least nine people in the southern Gaza city of Khan Younis, Palestinian health officials said Tuesday, within a day of Israel ordering parts of the city to evacuate ahead of a likely ground operation.",
      "publishedAt": "2024-07-02T09:00:15Z",
      "title": "The Latest | Overnight strike kills 9 in Khan Younis, hours after Israel ordered a mass evacuation",
      "url": "https://apnews.com/a5bed910dd908aab84b54bcbc95773bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a02cd5d257f4786be7d037044eb0c4b/3000.jpeg"
    },
    {
      "author": "NASSER KARIMI and JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Over 20 years ago, Iran's Supreme Leader Ayatollah Ali Khamenei stood before a crowd at Friday prayers to denounce the United States for its disenchanted electorate.",
      "publishedAt": "2024-07-02T05:20:26Z",
      "title": "As Iran faces a rare runoff presidential election, disenchanted voters are staying away",
      "url": "https://apnews.com/9a146e2a73411e1623e15ce09a140b44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be6db542803a4b6e9e919f16e9dde118/3000.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "HENIN-BEAUMONT, France (AP) — In the former mining town at the heart of French far-right leader Marine Le Pen’s political strategy, her party's electoral success Sunday came as no surprise to hundreds of supporters who gathered to see her victory speech.",
      "publishedAt": "2024-07-02T10:06:26Z",
      "title": "Le Pen first had success in an ex-mining town. Her message there is now winning over French society",
      "url": "https://apnews.com/89c9f07aef85fea66420155cfcdeb8fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e58d6b5002ba4250a30f556ca16adb59/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Hurricane Beryl roared through open waters on Tuesday as a monstrous Category 5 storm on a path that would take it near Jamaica and the Cayman Islands after earlier making landfall in the southeast Caribbean, killing at least two people.",
      "publishedAt": "2024-07-02T10:43:42Z",
      "title": "Hurricane Beryl rips through open waters after devastating the southeast Caribbean",
      "url": "https://apnews.com/8cf6928baf7c69554c48625fabd4a1b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/730929da4968423c9c738b1e71252a64/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court ended its term by ruling for the first time that former presidents have broad immunity from prosecution, a decision that almost certainly means Donald Trump won't stand trial before the November election.",
      "publishedAt": "2024-07-02T04:01:23Z",
      "title": "Highlights from Supreme Court term: Rulings on Trump, regulation, abortion, guns and homelessness",
      "url": "https://apnews.com/5d49f74d8b523f250f91512b46e1ac22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/455ba3614345483fb26c4514e49c6c4b/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — Hungarian Prime Minister Viktor Orbán was in Kyiv on Tuesday for talks with Ukrainian President Volodymyr Zelenskyy, his first visit to the neighboring country since Russia’s full-scale invasion in February 2022 as Budapest has repeatedly broken ranks with the rest of the European Union and leaned toward Moscow.",
      "publishedAt": "2024-07-02T06:52:15Z",
      "title": "Hungary's leader is in Ukraine. It's the first visit by Russia’s top EU ally since the war began",
      "url": "https://apnews.com/79277d17ae9c452a4e4924c9f1f633f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c47e791c0ff44cdb815f7aedf31612a7/3000.jpeg"
    },
    {
      "author": "CORAL MURPHY MARCOS",
      "description": "SAN JUAN, Puerto Rico (AP) — Gang violence in Haiti has displaced more than 300,000 children since March, the U.N. children's agency said Tuesday as the Caribbean country struggles to curb killings and kidnappings.",
      "publishedAt": "2024-07-02T04:03:33Z",
      "title": "Haiti's gang violence has displaced 300,000 children, the UN says",
      "url": "https://apnews.com/e502ca0ba324ba8fae710af6058ab7fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/042eef3c05fd4cda98571e66613fe1fd/3000.jpeg"
    },
    {
      "author": "DAVE SKRETTA",
      "description": "KANSAS CITY, Mo. (AP) — Gregg Berhalter gave a single-word answer after the United States was eliminated from the Copa America with a loss to Uruguay when asked whether he was the right man to lead the Americans into the 2026 World Cup.",
      "publishedAt": "2024-07-02T03:05:17Z",
      "title": "US eliminated from Copa America with 1-0 loss to Uruguay, increasing pressure to fire Berhalter",
      "url": "https://apnews.com/4b71dabc975c35eafce95017926234d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec96126626704810acdba61a147a3fd4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}