{
  "articles": [
    {
      "author": "FARNOUSH AMIRI, TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "TEL AVIV, Israel (AP) — Secretary of State Antony Blinken arrived in Israel on Tuesday on his 11th visit to the region since the outbreak of the Israel-Hamas war.",
      "publishedAt": "2024-10-22T07:37:31Z",
      "title": "Blinken arrives in Israel as US looks to renew cease-fire efforts after the killing of Hamas leader",
      "url": "https://apnews.com/5a8d5a051e05267007192ac5c8d80efd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/578018d957fb4a32bb564a7b121fc874/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER and JOEY CAPPELLETTI",
      "description": "WASHINGTON (AP) — Two weeks out from Election Day, the crisis in the Middle East is looming over the race for the White House, with one candidate struggling to find just the right words to navigate its difficult cross-currents and the other making bold pronouncements that the age-old conflict can quickly be set right.",
      "publishedAt": "2024-10-22T04:06:59Z",
      "title": "Mideast conflict looms over US presidential race as Harris and Trump jostle for an edge",
      "url": "https://apnews.com/623945957dac623c238041242e13340a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/073882e9bab94be7acf23e9d72985156/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Both Kamala Harris and Donald Trump see economic policy as their best chance to win Latino voters.",
      "publishedAt": "2024-10-22T09:02:16Z",
      "title": "Harris bets her policies can attract Latino voters while Trump touts his time as president to them",
      "url": "https://apnews.com/18e99a491ba6df73f61a8c6cca004fd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77d9396905ca47df923fcde646ebc52a/3000.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "MACON, Ga. (AP) — Sabrina Friday scanned the room at Mother's Nest, an organization in Macon that provides baby supplies, training, food and housing to mothers in need, and she asked how many planned to vote.",
      "publishedAt": "2024-10-22T04:11:35Z",
      "title": "In battleground Georgia, some poor people see no reason to vote. That decision could sway election",
      "url": "https://apnews.com/34209a5bba0b2697eb6fcdd004dca584",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94c9b0e439d24614bd9a54e6071a8c4e/3000.jpeg"
    },
    {
      "author": null,
      "description": "KAZAN, Russia (AP) — China’s Xi Jinping, India’s Narendra Modi and other global leaders arrived Tuesday in the Russian city of Kazan for a summit of the BRICS bloc of developing economies that the Kremlin hopes to turn into a rallying point for defying the Western liberal order.",
      "publishedAt": "2024-10-22T09:33:12Z",
      "title": "Putin hosts Global South leaders at BRICS summit intended to counterbalance Western clout",
      "url": "https://apnews.com/39e90fce8443b922f4d224c65c2ec932",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/069746bd90104be6b84373bbd3a59159/3000.jpeg"
    },
    {
      "author": "ANDREA RODRIGUEZ and MILEXSY DURAN",
      "description": "HAVANA (AP) — Cuba's capital remained largely paralyzed on Monday and the rest of the island braced for the fourth night of a massive blackout that has generated a handful of small protests and a stern government warning that any unrest will be punished.",
      "publishedAt": "2024-10-21T04:49:59Z",
      "title": "Storm causes at least 6 deaths in Cuba, where a long power outage is raising tempers",
      "url": "https://apnews.com/b197e174af2c9f664d4c3aaf0c5a6e75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf90011c95d842c9a266b4e7b2802e1a/1920.jpeg"
    },
    {
      "author": "ANNIE MA",
      "description": "Dissent is thriving this fall at American colleges, and not just among student activists. With student protests limited by new restrictions, faculty have taken up the cause.To faculty, new protest rules threaten freedom of speech — and the freedom to think, both central to university life.",
      "publishedAt": "2024-10-22T04:05:07Z",
      "title": "New campus protest rules spur an outcry from college faculty",
      "url": "https://apnews.com/14da92667846c2b23a36eec64e1d8ff3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2910545fbd8a4dd3b67fe07cd5518ded/3000.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — King Charles III ends the first visit to Australia by a reigning British monarch in 13 years Tuesday as anti-monarchists hope the debate surrounding his journey is a step toward an Australian citizen becoming head of state.",
      "publishedAt": "2024-10-22T03:22:50Z",
      "title": "King Charles III ends first Australian visit by a reigning British monarch in 13 years",
      "url": "https://apnews.com/2bdb86c1e7e492f4447288efd84c74ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81d4529ed37a4e81aa80cce3e47590a2/1920.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Had she wanted to, Michelle Chumley could have afforded a pricey new SUV loaded with options. But when it came time to replace her Chevrolet Blazer SUV, for which she'd paid about $40,000 three years ago, Chumley chose something smaller.",
      "publishedAt": "2024-10-22T07:00:29Z",
      "title": "Lower-priced new cars are gaining popularity, and not just for cash-poor buyers",
      "url": "https://apnews.com/a9547c1d9a52199a492676f8ef2d5891",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a76985543134dcdba0a24dd962d836a/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "ALLENTOWN, Pa. (AP) — The sun was creeping over the horizon on a recent morning in Pennsylvania’s erstwhile steel country, but inside a house next to two radio towers, Victor Martinez stood with a microphone, ready to broadcast his views to thousands of Spanish-speaking listeners.",
      "publishedAt": "2024-10-22T04:18:58Z",
      "title": "In hard-fought Pennsylvania, fast-growing Hispanic communities present a test for Harris and Trump",
      "url": "https://apnews.com/42afc4d9fe388923b713b45b94e0adcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/255d36a7690e4c5d87fded71587f25cd/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}