{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli forces raided Gaza's largest hospital early Wednesday, where hundreds of patients, including newborns, have been stranded with dwindling supplies and no electricity, as the army extended its control across Gaza City and the north.",
      "publishedAt": "2023-11-15T06:27:20Z",
      "title": "Israeli forces raid Gaza's largest hospital, where hundreds of patients are stranded by fighting",
      "url": "https://apnews.com/b85e828db648f5f911278fa217e827e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f3da39b7b8d4e8baeb9f25962685aac/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI, COLLEEN LONG and DIDI TANG",
      "description": "SAN FRANCISCO (AP) — Presidents Joe Biden and Xi Jinping head into their big meeting at a country estate on Wednesday hoping to stabilize U.S.-China relations after a period of tumult, but the U.S. president also is prepared to confront his counterpart on difficult issues such as trade, Beijing’s burgeoning relationship with Iran and human rights concerns.",
      "publishedAt": "2023-11-15T08:09:25Z",
      "title": "Biden, Xi meeting is aimed at getting relationship back on better footing, but tough issues loom",
      "url": "https://apnews.com/58d11e7e3902955302182c2bc41430e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32c5dfbd8ae1445b8a8cad8b07f3d307/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — The House voted overwhelmingly Tuesday to prevent a government shutdown after new Republican Speaker Mike Johnson was forced to reach across the aisle to Democrats when hard-right conservatives revolted against his plan.",
      "publishedAt": "2023-11-14T05:05:47Z",
      "title": "House votes to prevent a government shutdown as GOP Speaker Johnson relies on Democrats for help",
      "url": "https://apnews.com/9cb26b703804a9e82e776e44caedcaa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee34c6177b1e43819bb6a4e37ff1f922/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Britain’s Supreme Court ruled Wednesday that the government’s contentious plan to send some migrants on a one-way trip to Rwanda is illegal, striking a major blow to a key policy of Prime Minister Rishi Sunak's government that has drawn international attention and criticism.",
      "publishedAt": "2023-11-15T06:09:01Z",
      "title": "UK top court says a plan to send migrants to Rwanda is unlawful because they would be at risk",
      "url": "https://apnews.com/6e9e99a33dc47d16cf128a226a84acac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5efbac1088ba45f3bce9f506a294f139/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN",
      "description": "MIAMI (AP) — Hazardous, forced work conditions sometimes akin to slavery have been detected on nearly 500 industrial fishing vessels around the world, but identifying those responsible for abuses at sea is hampered by a lack of transparency and regulatory oversight, a new report concluded.",
      "publishedAt": "2023-11-15T05:06:13Z",
      "title": "China leads list of labor abusers, sometimes akin to slavery, detected on fishing vessels worldwide",
      "url": "https://apnews.com/337cb7e790bdb3aec43f4781605ba7bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39d9c9783ab74266a876a63bcb15c31c/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA and MICHAEL BALSAMO",
      "description": "WASHINGTON (AP) — Supporters of Israel rallied by the tens of thousands on the National Mall under heavy security Tuesday, voicing solidarity in the fight against Hamas and crying “never again.\"The “March for Israel” offered a resounding and bipartisan endorsement of one of America's closest allies as criticism has intensified over Israel's offensive in Gaza, set off by the bloody Hamas incursion on Oct.",
      "publishedAt": "2023-11-14T19:24:21Z",
      "title": "Tens of thousands of supporters of Israel rally in Washington, crying 'never again'",
      "url": "https://apnews.com/830cb77476af80ffde431165ee01533d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14a5501091da464ba15034fb28004c12/1920.jpeg"
    },
    {
      "author": "DANIEL POLITI and RODRIGO ABD",
      "description": "BUENOS AIRES, Argentina (AP) — Batman and the Joker, a man decked out in a full-body lion costume, and another whose head and arms have been replaced by chainsaws. This isn’t Carnival or Comic-Con, but rather the outlandish campaign rally for Argentine presidential candidate Javier Milei.",
      "publishedAt": "2023-11-15T05:10:17Z",
      "title": "Populist Javier Milei is rallying for the Argentine presidency with chainsaws and Comic-Con costumes",
      "url": "https://apnews.com/ea4b2b181ab98a60a9dc96572c27005b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/799b614396a64a58939f8ed558e540fc/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — President Joe Biden and Chinese President Xi Jinping are expected to agree Wednesday to restore some military-to-military communications between their armed forces when they meet on the sidelines of the Asia-Pacific Economic Cooperation summit in San Francisco.",
      "publishedAt": "2023-11-15T05:09:51Z",
      "title": "Biden aims for improved military relations with China when he meets with Xi",
      "url": "https://apnews.com/339980a0d494bcde92905411838808a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/28ed59f70f9b49e1af89fc43c1a9c059/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL",
      "description": "HANOI, Vietnam (AP) — To meet the goal of limiting global warming to 1.5 degrees Celsius (2.7 degrees Fahrenheit), nine major Asian economies must increase the share of electricity they get from renewable energy from the current 6% to at least 50% by 2030, according to a report by a German thinktank released Wednesday.",
      "publishedAt": "2023-11-15T06:04:07Z",
      "title": "Asian economies must ramp up wind and solar power to keep global warming under 1.5C, report says",
      "url": "https://apnews.com/31f17bd2e3927da4aae882432eedbbc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b805c9fa5d5e4481be320a59ca084c1e/3000.jpeg"
    },
    {
      "author": "ANNIE MA",
      "description": "Nearly nine out of 10 parents believe their child is performing at grade level despite standardized tests showing far fewer students are on track, according to a poll released Wednesday by Gallup and the nonprofit Learning Heroes.",
      "publishedAt": "2023-11-15T05:18:25Z",
      "title": "Many parents don't know when kids are behind in school. Are report cards telling enough?",
      "url": "https://apnews.com/755cc4b52f5c7946f28207ab07fd5794",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6b0c80927db40c7a0acfe17bc1b1ed5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}