{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "The presidential campaign comes down to a final push across a handful of states on the eve of Election Day.",
      "publishedAt": "2024-11-04T13:54:02Z",
      "title": "The Latest: All eyes on Pennsylvania as candidates spend final day campaigning there",
      "url": "https://apnews.com/5baa17fca251b138056203276386ce9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8755a030d304969b6562171cbed18e6/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and ALI SWENSON",
      "description": "WASHINGTON (AP) — The nation’s federal law enforcement and election security agencies are debunking two new examples of Russian election disinformation on the eve of Election Day, highlighting attempts by foreign actors to sow doubt in the U.S.",
      "publishedAt": "2024-11-05T02:52:54Z",
      "title": "Federal agencies say Russia and Iran are ramping up influence campaigns targeting US voters",
      "url": "https://apnews.com/ab8ed2baadbb02364a4becff6d38f4f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65f1718ea4654ebab02bd3eadbef1e74/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, DARLENE SUPERVILLE and BILL BARROW",
      "description": "ALLENTOWN, Pa. (AP) — Vice President Kamala Harris and former President Donald Trump made their final pitches to voters Monday in the same parts of Pennsylvania at roughly the same time, focusing on the state that could make or break their chances during the last full day of the presidential campaign.",
      "publishedAt": "2024-11-04T05:07:07Z",
      "title": "Harris and Trump's final push before Election Day brings them to the same patch of Pennsylvania",
      "url": "https://apnews.com/0429c35a84739bd90d9e5bb92fe803de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fcf3a1fcbe54bfbb9208a04939855c8/1920.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "Former President Donald Trump is stepping up his demands that the winner of the presidential race be declared shortly after polls close Tuesday, well before all the votes are counted.Trump set the pattern in 2020, when he declared that he had won during the early morning hours after Election Day.",
      "publishedAt": "2024-11-04T20:37:18Z",
      "title": "Trump wants the presidential winner to be declared on election night. Why that's unlikely",
      "url": "https://apnews.com/61d69529c5e135f34fac2bf2d3bbe3e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4beec62fe5f140c783cf97abe2418e75/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration is stepping up criticism of Israel for not doing enough to improve humanitarian conditions in Gaza as a 30-day deadline looms for Israeli officials to meet certain requirements or risk potential restrictions on military assistance.",
      "publishedAt": "2024-11-04T21:25:16Z",
      "title": "US gives Israel a 'fail' grade on improving aid to Gaza so far",
      "url": "https://apnews.com/656d54b6ff0f37e6219f46deabc0baff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cde81050adcc46a698e7e3ae51959d84/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG, HYUNG-JIN KIM and MARI YAMAGUCHI",
      "description": "SEOUL, South Korea (AP) — North Korea fired a barrage of short-range ballistic missiles into the sea on Tuesday, its neighbors said, as it continued its weapons demonstrations hours before the U.S.",
      "publishedAt": "2024-11-04T22:50:34Z",
      "title": "North Korea fires a barrage of ballistic missiles toward the sea ahead of US election",
      "url": "https://apnews.com/3c00eaae880d1cdeb79f7c9aa0aded9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a7f89a2641714ab38f99d1106c0c5503/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and LINDSEY WASSON",
      "description": "SEATTLE (AP) — The voting has closed for unionized factory workers at Boeing who were deciding Monday whether to accept a contract offer or to extend their strike, which has lasted more than seven weeks and shut down production of most Boeing passenger planes.",
      "publishedAt": "2024-11-04T05:01:32Z",
      "title": "Boeing machinists hold contract vote that could end their 7-week strike",
      "url": "https://apnews.com/614c4d5afd97d1f50ab9cfe1f4f94255",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09becd4435744e6ca96b223750d8b42f/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER",
      "description": "A former police officer was convicted of murder Monday in the shooting of Andre Hill, a Black man who was holding a cellphone and keys when he was killed.",
      "publishedAt": "2024-11-04T17:38:23Z",
      "title": "Ex-officer found guilty in the 2020 shooting death of Andre Hill",
      "url": "https://apnews.com/7c9405baf78daf4394cb74df9ad2191e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/305ce8da60164d109a8648e49bb08a21/1920.jpeg"
    },
    {
      "author": "MARTHA MENDOZA",
      "description": "WICHITA, KANSAS (AP) — Sobs of relief broke out in a federal courtroom in Kansas on Monday as dozens of people whose life savings had been embezzled by a bank CEO learned that federal law enforcement had recovered their money.",
      "publishedAt": "2024-11-05T00:26:26Z",
      "title": "A courtroom of relief: FBI recovers funds for victims of scammed banker",
      "url": "https://apnews.com/d19d3b5603a1c9e4cc83e31b24d26fcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65f1718ea4654ebab02bd3eadbef1e74/3000.jpeg"
    },
    {
      "author": "JOSEPH WILSON",
      "description": "BARCELONA, Spain (AP) — Mud splattered the cheek of Spain's monarch as survivors of catastrophic floods unleashed their fury in a barrage of muck and mire. Felipe VI took it, literally, on the chin, and his determination to stay and speak to the enraged crowd could redefine his reign.",
      "publishedAt": "2024-11-04T19:40:51Z",
      "title": "Spain's king stood his ground under a mud barrage. What will the iconic moment mean for his reign?",
      "url": "https://apnews.com/903a0f29591049ff54e9778e916882b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f6d739bc12044b1a3f1c433d03b00a0/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}