{
  "articles": [
    {
      "author": "JULIO CORTEZ, KATE PAYNE and HAVEN DALEY",
      "description": "ST. PETERSBURG, Fla. (AP) — Rescue teams plucked Florida residents from the flotsam of Hurricane Milton on Thursday after the storm smashed through coastal communities where it tore homes into pieces, filled streets with mud and spawned a barrage of deadly tornadoes. At least six people were dead.",
      "publishedAt": "2024-10-10T05:21:44Z",
      "title": "Milton clobbers coastal communities in Florida, leaves millions without power and kills at least 6",
      "url": "https://apnews.com/5f6a112986eb6e21720f0f17c504afe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f996f05e6b54f70bd593be5ef992695/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Hurricane Milton brought powerful winds, a dangerous storm surge and flooding to much of Florida after making landfall along the Gulf Coast as a Category 3 storm.",
      "publishedAt": "2024-10-10T07:46:51Z",
      "title": "The Latest: Milton moves away from Florida, leaving at least 6 dead and millions in the dark",
      "url": "https://apnews.com/cec55add05a1d5f0228656232523335b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5054c173dc3c42e389ca81a6e92d8305/1920.jpeg"
    },
    {
      "author": "BILAL HUSSEIN, WAFAA SHURAFA and SAMY MAGDY",
      "description": "BEIRUT (AP) — Israeli airstrikes hit different areas of central Beirut on Thursday evening, killing at least 22 people, Lebanon’s health ministry said, leaving two neighborhoods smoldering and further escalating Israel’s bloody conflict with Iran-backed Hezbollah militants in Lebanon.",
      "publishedAt": "2024-10-10T09:10:39Z",
      "title": "At least 22 killed in airstrikes in central Beirut, with Israel also firing on UN peacekeepers",
      "url": "https://apnews.com/a5e53cdd4fca30be1909506b5c777922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41d8f3b123fb4f5aab2bbc027079f851/3000.jpeg"
    },
    {
      "author": "ISABELLA VOLMERT, DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "LAS VEGAS (AP) — Vice President Kamala Harris and the White House criticized Donald Trump for his attacks on the federal response to Hurricanes Helene and Milton and suggested he was wrongly trying to turn the deadly storms to his political advantage.",
      "publishedAt": "2024-10-10T13:49:01Z",
      "title": "Harris rips Trump for his criticism of federal storm response and calls for 'dignity'",
      "url": "https://apnews.com/2a9db630d1318e78de91efd2df5a16f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7797f465bd8447bf971825a14d0fe79a/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "AURORA, Colo. (AP) — The city of Aurora is roughly the size of pre-evacuation Tampa, Florida. With 400,000 people spread over 164 square miles, it has swank subdivisions, working-class neighborhoods and the high-end resort where Donald Trump will hold a rally Friday to highlight a city turned into “a war zone” by immigrants, in the words of his campaign.",
      "publishedAt": "2024-10-10T18:35:29Z",
      "title": "Trump seizes on one block of a Colorado city to warn of migrant crime threat, even as crime dips",
      "url": "https://apnews.com/c76df9f1dcda7e06a983105e5e970aeb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20bc2d7db8a0406cb3f7324ec1929cba/1500.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Millions of Social Security recipients will get a 2.5% cost-of-living increase to their monthly checks beginning in January, the Social Security Administration announced Thursday.",
      "publishedAt": "2024-10-10T04:07:47Z",
      "title": "Social Security recipients will get a 2.5% cost-of-living boost in 2025, smaller than in recent past",
      "url": "https://apnews.com/e25d292b6c0af80fc9cce9d309e48f02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0cdf58965a714259a7c4ce0e20821ede/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY and STEVE LeBLANC",
      "description": "BOSTON, Mass. (AP) — Ethel Kennedy, the wife of Sen. Robert F. Kennedy, who raised their 11 children after he was assassinated and remained dedicated to social causes and the family’s legacy for decades thereafter, died on Thursday, her family said.",
      "publishedAt": "2024-10-10T15:30:05Z",
      "title": "Ethel Kennedy, social activist and wife of Robert F. Kennedy, has died",
      "url": "https://apnews.com/00eb88951db24e0cada9bd48b66ad8ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e41579508664078a5fe9e4f393a7871/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — TD Bank will pay approximately $3 billion in a historic settlement with U.S.",
      "publishedAt": "2024-10-10T17:59:01Z",
      "title": "TD Bank to pay $3 billion in historic money-laundering settlement with the Justice Department",
      "url": "https://apnews.com/75426a569d40174fd61fa7bc83026176",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b9e5cf363c040138bc62859c743c215/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A May 5 trial date was set Thursday in Sean “Diddy” Combs'sex trafficking case, and a prosecutor argued that the jailed hip-hop mogul's lawyers were trying to exclude a “damning piece of evidence” by claiming it was leaked by the government.",
      "publishedAt": "2024-10-10T04:09:46Z",
      "title": "Sean 'Diddy' Combs' sex trafficking trial set for May",
      "url": "https://apnews.com/149b784f3f6b37a84afa6081f2a904e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ebea90e1c954da0a8b87a695f3df184/3000.jpeg"
    },
    {
      "author": "JOHN RABY",
      "description": "As an award-winning scientist, Peter Dodge had made hundreds of flights into the eyes of hurricanes — almost 400. On Tuesday, a crew on a reconnaissance flight into Hurricane Milton helped him make one more, dropping his ashes into the storm as a lasting tribute to the longtime National Oceanic and Atmospheric Administration radar specialist and researcher.",
      "publishedAt": "2024-10-10T20:57:57Z",
      "title": "A hurricane scientist logged a final flight as NOAA released his ashes into Milton’s eye",
      "url": "https://apnews.com/a75c9a219f67a8b55a2f2140d7dc0f0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf25030a2b8248b1b53fde7d53a895ee/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}