{
  "articles": [
    {
      "author": "THOMAS BEAUMONT, ADRIANA GOMEZ LICON, ZEKE MILLER and TARA COPP",
      "description": "WASHINGTON (AP) — Pete Hegseth, Donald Trump's Pentagon pick, was fighting to hold on to his Cabinet nomination amid growing questions Wednesday about his personal conduct as the president-elect's team considers alternatives, including Florida Gov.",
      "publishedAt": "2024-12-04T14:12:16Z",
      "title": "Trump considers DeSantis for the Pentagon with Hegseth under pressure over allegations: AP sources",
      "url": "https://apnews.com/3cb8c7d7bb555ed075cbbb4e8dad0741",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/715ae5f075ea4e878e81f9895a482dbe/1920.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "It was a history-making event: In a chapel at Fort Liberty, North Carolina, 2nd Lt. Khady Ndiaye stood proudly -- wearing a hijab – as she became the first Muslim woman commissioned by the U.S. Army as a chaplain candidate.",
      "publishedAt": "2024-12-04T15:18:08Z",
      "title": "US military takes pride in religious diversity. Would things change if Pete Hegseth takes charge?",
      "url": "https://apnews.com/3d21528cb5041eb4c5119d979b09af10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/131bf231453f4430be4affb083e9a2be/2000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and KAREN MATTHEWS",
      "description": "NEW YORK (AP) — UnitedHealthcare CEO Brian Thompson was killed Wednesday morning in what investigators suspect was a targeted shooting outside a Manhattan hotel where the health insurer was holding an investor conference.",
      "publishedAt": "2024-12-04T14:26:27Z",
      "title": "UnitedHealthcare CEO is killed in a 'targeted shooting' outside a New York hotel, officials say",
      "url": "https://apnews.com/daa1e8c8c05606197a5bd2e0242f1683",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fde511e4ce574c13948bb55b8d2801ac/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court is hearing arguments Wednesday in just its second major transgender rights case, which is a challenge to a Tennessee law that bans gender-affirming care for minors.",
      "publishedAt": "2024-12-04T05:03:47Z",
      "title": "Transgender rights case lands at Supreme Court amid debate over ban on medical treatments for minors",
      "url": "https://apnews.com/3fd2de125caeac6e323bd81ef7271837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/978ec4a2a150432ab0b8074e325c4e74/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — President Yoon Suk Yeol’s stunning martial law declaration lasted just hours, but experts say it raised serious questions about his ability to govern for the remaining 2 1/2 years of his term and whether he will abide by democratic principles.",
      "publishedAt": "2024-12-04T16:09:05Z",
      "title": "South Korean President Yoon's martial law declaration raises questions over his political future",
      "url": "https://apnews.com/f9f865c60ef95e57bdd39f2a384a0dc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f0307bc3f9b44b0937985e417391041/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump is bringing Peter Navarro, a former adviser who served prison time related to the Jan. 6 attack on the U.S.",
      "publishedAt": "2024-12-04T16:17:58Z",
      "title": "Trump hires Peter Navarro as White House adviser as he continues building administration",
      "url": "https://apnews.com/2566b318a1f82ad17d8d1abf17e9d218",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e00cd2ee70e0416caa1703238b182fe5/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s opposition parties moved Wednesday to impeach the president over the shocking and short-lived declaration of martial law that drew heavily armed troops to encircle parliament before lawmakers climbed walls to reenter the building and unanimously voted to lift his order.",
      "publishedAt": "2024-12-04T01:14:46Z",
      "title": "South Korea’s opposition parties move to impeach president over sudden declaration of martial law",
      "url": "https://apnews.com/25a2a7c957e77a19f771b6b7c56a2173",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5964d1fb28a4f6cbb307d5229898729/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS, HUMERA LODHI and ANNIE NG",
      "description": "WASHINGTON (AP) — The lead-up to the 2024 election was all about cat owners. But in the end, the dogs had their day.President-elect Donald Trump won slightly more than half of voters who own either cats or dogs, with a big assist from dog owners, according to AP VoteCast, a survey of more than 120,000 voters.",
      "publishedAt": "2024-12-04T13:11:53Z",
      "title": "Harris found success with women who have cats, but Trump got the dog owner vote: AP VoteCast",
      "url": "https://apnews.com/0f1f21fb148c31a276b5f0668270981f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a38e012d0434e0190f5b269a7128d38/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Members of a U.S. Senate subcommittee took aim at airline executives Wednesday for using an expanding menu of fees to charge customers for early boarding, better seats and other comforts that used to be part of the ticket price.",
      "publishedAt": "2024-12-04T15:39:54Z",
      "title": "US senators grill officials from 5 airlines over fees for seats and checked bags",
      "url": "https://apnews.com/3cd4a1fc1b29fc04f9607adea7b5bdf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7939c7f6e11e4c6289377f18990f930f/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "A California farm expanded a recall of raw milk sold in stores and halted production after state health and agriculture officials found bird flu virus in more milk samples.",
      "publishedAt": "2024-12-04T16:54:54Z",
      "title": "Raw milk recall in California expands after tests detect more bird flu virus",
      "url": "https://apnews.com/5893b7b823efcaf4389b77fc01fb0c56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e7155aea1df4782b6ed659bda6dc5e7/2348.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}