{
  "articles": [
    {
      "author": "Justin Spike",
      "description": "President Donald Trump has blamed Ukraine for starting the war that has cost tens of thousands of Ukrainian lives. His comments caused outrage and alarm in a country that has spent nearly three years fighting back a much larger Russian military. Trump called Ukrainian President Volodymyr Zelenskyy “a dictator without elections” and claimed his support among voters was near rock-bottom. Zelenskyy said Wednesday that the disinformation is coming from Russia, and some of what Trump has said does echo Russia’s own narrative of the conflict.",
      "publishedAt": "2025-02-19T19:25:37Z",
      "title": "Trump says Ukraine started the war that's killing its citizens. What are the facts?",
      "url": "https://apnews.com/article/ukraine-russia-trump-war-zelenskyy-putin-7fe8c0c80b4e93e3bc079c621a44e8bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5822ed/2147483647/strip/true/crop/4660x2621+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F73%2F3ffa368b078fb7b1d2221155e464%2Fafce5fdda4064e0baba94ac9c75ace9a"
    },
    {
      "author": "JUSTIN SPIKE, HANNA ARHIROVA",
      "description": "Ukraine President Volodymyr Zelenskyy says U.S. President Donald Trump is living in a Russian-made “disinformation space” as a result of his administration’s discussions with Kremlin officials. Trump suggested Tuesday that Ukraine was to blame for the war on its territory, which enters its fourth year next week. Zelenskyy spoke as Trump's envoy, Keith Kellogg, arrived in Kyiv for talks. Talks between top American and Russian diplomats in Saudi Arabia on Tuesday sidelined Ukraine and its European supporters. Trump’s comments marked a major shift in U.S. policy after years of efforts to isolate Russian President Vladimir Putin and are likely to vex Ukrainian officials.",
      "publishedAt": "2025-02-19T09:26:37Z",
      "title": "Trump is living in a Russian 'disinformation space,' says Zelenskyy",
      "url": "https://apnews.com/article/russia-ukraine-war-kellogg-zelenskyy-437f4c8fa4531059007dd3ab00c23458",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f7a422/2147483647/strip/true/crop/4510x2537+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2Fa5%2F69f5efbd4d1536e1086433991451%2F0a228c468c9d4ffb8a668a67696e9dbb"
    },
    {
      "author": "STEPHEN McGRATH, NICOLAE DUMITRACHE",
      "description": "NATO members are continuing their largest combat exercises of 2025 amid concern within the 32-nation alliance over its most powerful member, the United States. The drills in Romania come as a shaken Europe grapples with a new U.S. course under President Donald Trump. His defense secretary has demanded that allies dramatically ramp up military spending and said U.S. security priorities lie elsewhere. That cast doubts on Washington’s longstanding security guarantees provided to Europe. The NATO exercises also come days before the third anniversary of Russia’s full-scale invasion of Ukraine.",
      "publishedAt": "2025-02-19T14:21:31Z",
      "title": "A worried NATO holds large-scale combat drills as the US stance on Europe shifts under Trump",
      "url": "https://apnews.com/article/romania-nato-europe-russia-ukraine-us-f192b88b03f56d81fed0770fca445ba9",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0d9efb/2147483647/strip/true/crop/7568x4257+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F9c%2F109acd51b1f2eb289908adee0449%2F5a50f6fe509341409fb02e4ab759e96a"
    },
    {
      "author": "Stephany Matat, Aamer Madhani, Mike Pesoli",
      "description": "President Donald Trump has warned Ukrainian President Volodymyr Zelenskyy that he “better move fast” to negotiate an end to Russia’s invasion of Ukraine or risks not having a nation to lead. The rhetoric from Trump toward Ukraine comes amid an escalating back-and-forth between the two presidents and rising tensions between the United States and much of Europe over Trump’s approach to settling the biggest conflict on the continent since World War II. Trump’s broadside came not long after Zelenskyy’s comment that Trump was being influenced by Russian disinformation as he tries to bring the fighting to a close on terms that Kyiv says are too favorable to Moscow.",
      "publishedAt": "2025-02-19T16:31:40Z",
      "title": "Trump warns Zelenskyy to quickly negotiate war's end with Russia or risk not having a nation to lead",
      "url": "https://apnews.com/article/trump-zelenskyy-ukraine-russia-war-7d18400b935166773bbd3b3323c8aa5f",
      "urlToImage": "https://dims.apnews.com/dims4/default/224bc35/2147483647/strip/true/crop/7610x4281+0+396/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F34%2F4880976a2a42cd68b434c5eaebf1%2Ff7c9c46a6525423c8ba561637deecfab"
    },
    {
      "author": "Isabella Volmert",
      "description": "Michigan Supreme Court Chief Justice Elizabeth Clement says she will step down from the court by April 30. Wednesday's announcement of the upcoming resignation opens the door for Democratic Gov. Gretchen Whitmer to make an appointment that would leave Democratic-backed justices holding a 6-1 court majority. Clement did not give a reason for her decision. She was originally appointed to the court in 2017 by Republican Gov. Rick Snyder. While Supreme Court positions are nonpartisan in Michigan, nominations go through the political parties. Currently, Democratic-nominated justices hold a 5-2 majority on the court after they picked up one seat in the November election.",
      "publishedAt": "2025-02-19T23:37:16Z",
      "title": "Michigan Supreme Court Chief Justice announces she is stepping down",
      "url": "https://apnews.com/article/michigan-supreme-court-chief-justice-stepping-down-74419883f0e462d73f07825d31e559a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/be57a33/2147483647/strip/true/crop/2816x1584+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F48%2Fc15c14938269a6a493cae82d5ec6%2Fcd6b4def87c94100b9dd13e855114c6a"
    },
    {
      "author": "Hillel Italie",
      "description": "Until a few weeks ago, the biggest news to come out of the Kennedy Center in Washington, D.C., was its annual celebration of notable American artists. That has changed since the return of Donald Trump. In the first month of his second term, the president has ousted the arts institution’s leadership, filled the board of trustees with his supporters and announced he had been elected the board’s chair — unanimously. White House press secretary Karoline Leavitt says, “The Kennedy Center learned the hard way that if you go woke, you will go broke.",
      "publishedAt": "2025-02-19T21:19:36Z",
      "title": "What's going on with the Kennedy Center under Trump?",
      "url": "https://apnews.com/article/kennedy-center-trump-what-to-know-4305e2c3d5611c4bfb1686d597727369",
      "urlToImage": "https://dims.apnews.com/dims4/default/4503529/2147483647/strip/true/crop/4104x2309+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F72%2F7d6b2460e43931afb52173e0548d%2F0fcc7004315a416ebe74913b6da29117"
    },
    {
      "author": "Fu Ting",
      "description": "A surprising number of Chinese social media users have a new celebrity crush: Melania Trump. The two-time first lady has become an online celebrity in China, especially among women, despite her husband’s hostility toward China, but social media posts reflect an admiration for her independence, her taste in fashion and how she’s raising her teenage son. Experts say that many people in China enjoy following the Trumps as something like a soap opera, and admire Melania for fulfilling traditional gender roles while also showing some independence from her powerful husband.",
      "publishedAt": "2025-02-20T02:03:31Z",
      "title": "As Melania Trump returns to the White House, she's winning Chinese fans",
      "url": "https://apnews.com/article/melania-trump-internet-celebrity-china-ivanka-2fc1f4be23efdef4fe794c7dd50cc631",
      "urlToImage": "https://dims.apnews.com/dims4/default/edaebf7/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2Fae%2F33080174c889dc578e72db5ba3f4%2F9248993c3f794267b85fcf38f0d147cd"
    },
    {
      "author": "Will Weissert",
      "description": "It’s been a lingering question since the election: How long can a partnership between two billionaires who love being the center of attention last? In a joint Fox News Channel interview that aired Tuesday, Donald Trump and adviser Elon Musk Musk insisted they like each other a lot and would stick with their arrangement despite what the president said were attempts to “drive us apart.” That means joining forces to slash the federal bureaucracy and size of government. But Trump and Musk weren't always friends. And it's often those once closest to Trump often end up as his fiercest critics.",
      "publishedAt": "2025-02-19T22:24:07Z",
      "title": "Trump and Musk say they like working together. Will the bromance last?",
      "url": "https://apnews.com/article/trump-musk-hannity-joint-interview-lovefest-history-a8c289c58f5757fa6c27e324acfb753e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b651d7a/2147483647/strip/true/crop/5077x2856+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F71%2Fccb441b32272691c1f4e8ec9e528%2Fdab56e8655f04d9ab321bd62f80922cc"
    },
    {
      "author": "NICOLE WINFIELD, ANDREA ROSA, PAOLO SANTALUCIA",
      "description": "Italian Premier Giorgia Meloni has visited Pope Francis in the hospital and says he’s “alert and responsive” and full of good humor despite his pneumonia. In a statement issued by her office, Meloni said: ”We joked around as always. He has not lost his proverbial sense of humor.” Her visit marked the first confirmed outside visitor known to have called on the pope, beyond his secretaries and medical team, since his hospitalization Friday. The Vatican has said Francis, who had part of one lung removed as a young man, was up, eating and had gotten out of bed after a tranquil night, a day after tests confirmed he had pneumonia in both lungs on top of asthmatic bronchitis.",
      "publishedAt": "2025-02-19T07:31:47Z",
      "title": "Italian Premier Meloni visits Pope Francis in hospital and says he's in good spirits",
      "url": "https://apnews.com/article/pope-francis-vatican-respiratory-health-gemelli-rome-4afa8ce660cd74b30df15581adcf4239",
      "urlToImage": "https://dims.apnews.com/dims4/default/7fda3be/2147483647/strip/true/crop/7241x4073+0+377/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F1c%2F12fbaf2606fa9beb3e6d5ab43f34%2F71ce521e48904e319880e5f9e910b2c6"
    },
    {
      "author": "Michael Casey",
      "description": "Experts say a combination of training and technology were critical to all 76 passengers and four crew members surviving the fiery Delta Air Lines plane crash in Toronto. Video images of the plane landing hard on the runway, catching fire and flipping upside down raised questions about how anyone could have survived. But experts say advances in aviation technology have resulted in design features such as wings that can easily detach, which is important in a crash since fuel tanks are stored there. The seats, too, are built to withstand intense pressure and flight crews train repeatedly for scenarios similar to what happened Monday at Toronto Pearson International Airport.",
      "publishedAt": "2025-02-19T20:39:06Z",
      "title": "What's the key to surviving a plane crash? Skilled crew, strong seats and wings that detach",
      "url": "https://apnews.com/article/toronto-delta-air-lines-80-survived-87ccdaddb075630cbeb8fa537814db66",
      "urlToImage": "https://dims.apnews.com/dims4/default/fd72eb6/2147483647/strip/true/crop/1392x783+0+73/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2F7e%2Fe05342bfde841be3b070594c4b40%2Fa35673d133784719ab387b9f13309bd0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}