{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — Las Vegas Aces win back-to-back WNBA titles, beating New York Liberty 70-69 in Game 4 of Finals.",
      "publishedAt": "2023-10-19T02:16:52Z",
      "title": "Las Vegas Aces win back-to-back WNBA titles, beating New York Liberty 70-69 in Game 4 of Finals",
      "url": "https://apnews.com/13b42ae4f47c28c2b3982c20e6ed0da7",
      "urlToImage": ""
    },
    {
      "author": "NAJIB JOBAIN, ISABEL DEBRE and RAVI NESSMAN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel said Wednesday that it will allow Egypt to deliver limited humanitarian aid to the Gaza Strip. The first crack in a punishing 10-day siege on the territory came one day after a blast at a hospital killed hundreds and put immense strain on Gaza's struggling medical system.",
      "publishedAt": "2023-10-18T07:32:01Z",
      "title": "Israel will let Egypt deliver some aid to Gaza, as doctors struggle to treat hospital blast victims",
      "url": "https://apnews.com/d9606e0ead1f8c4e9fd00b602ed14a38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3ab4ddcd566454996c380678b55e80e/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ISABEL DEBRE",
      "description": "JERUSALEM (AP) — The courtyard of al-Ahli hospital, where thousands of Palestinians had sought shelter or medical treatment, is now a blackened expanse of charred cars, stretchers coated in ash and shredded dolls.",
      "publishedAt": "2023-10-18T20:41:14Z",
      "title": "From hospital, to shelter, to deadly inferno: Fleeing Palestinians lose another sanctuary in Gaza",
      "url": "https://apnews.com/3d255725997c4e2757372b3ee2fc8859",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b99bf588d5d42a0b071e82bb50717b2/3000.jpeg"
    },
    {
      "author": "JACK JEFFERY and SAMY MAGDY",
      "description": "CAIRO (AP) — As desperate Palestinians in sealed-off Gaza try to find refuge under Israel’s relentless bombardment in retaliation for Hamas' brutal Oct.",
      "publishedAt": "2023-10-18T17:22:36Z",
      "title": "Why Egypt and other Arab countries are unwilling to take in Palestinian refugees from Gaza",
      "url": "https://apnews.com/502c06d004767d4b64848d878b66bd3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d1b4cb9cb9a4f34a95115afc11b0774/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Republican Rep. Jim Jordan failed again Wednesday on a crucial second ballot to become House speaker, but the hard-fighting ally of Donald Trump showed no signs of dropping out despite losing support from even more of his GOP colleagues.",
      "publishedAt": "2023-10-18T04:07:03Z",
      "title": "GOP's Jim Jordan fails again on vote for House speaker as frustrated Republicans search for options",
      "url": "https://apnews.com/994067b90a874ed46dd6a1766d89a163",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4744a35ee6d43b9a418e1c6c91f2d5c/1920.jpeg"
    },
    {
      "author": "KIM CHANDLER and SUDHIN THANAWALA",
      "description": "BIRMINGHAM, Ala. (AP) — The chief suspect in the disappearance of Natalee Holloway has admitted he beat the young Alabama woman to death on a beach in Aruba after she refused his advances, then dumped her body into the sea.",
      "publishedAt": "2023-10-18T04:08:54Z",
      "title": "Suspect admits he killed Natalee Holloway in Aruba in 2005, pleads guilty to extorting her mother",
      "url": "https://apnews.com/1f9335330de758cd7163914b81d0759f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41e3bba7f5de4428b316facf4bd3a508/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — A spectator at Donald Trump’s civil fraud trial was arrested Wednesday after standing up in the middle of testimony and walking toward the front of the courtroom where the former president sat.",
      "publishedAt": "2023-10-18T16:57:41Z",
      "title": "Woman arrested after trying to get close to Trump at New York trial; she says she's a supporter",
      "url": "https://apnews.com/dd10ecf8bdc4cbf8c17990cc4f40ce9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bd25a2271734446aee8ba9f85879c21/3000.jpeg"
    },
    {
      "author": null,
      "description": "MALIBU, Calif. (AP) — A 22-year-old driver was arrested on suspicion of manslaughter after a crash in Malibu killed four college students and injured two other people, officials said Wednesday. The six pedestrians were struck around 8:30 p.m.",
      "publishedAt": "2023-10-18T04:53:10Z",
      "title": "Driver arrested after Pacific Coast Highway crash in Malibu kills 4 Pepperdine University students",
      "url": "https://apnews.com/ab620b3670f6146011fff8589956a05f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dac1e1ae399c41b08800f05b59a8c08e/3000.jpeg"
    },
    {
      "author": "MICHELLE R. SMITH and ALI SWENSON",
      "description": "When 12-year-old Braden Fahey collapsed during football practice and died, it was just the beginning of his parents’ nightmare.Deep in their grief a few months later, Gina and Padrig Fahey received news that shocked them to their core: A favorite photo of their beloved son was plastered on the cover of a book that falsely argues COVID-19 vaccines caused a spike of sudden deaths among healthy young people.",
      "publishedAt": "2023-10-18T15:52:19Z",
      "title": "RFK Jr. spent years stoking fear and mistrust of vaccines. These people were hurt by his work",
      "url": "https://apnews.com/2ccde2df146f57b5e8c26e8494f0a16a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba1c6e89b6c2450ea4a727e6a769a7d4/1920.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "RIO DE JANEIRO (AP) — A Brazilian congressional panel on Wednesday accused former President Jair Bolsonaro of instigating the country’s Jan. 8 riots and recommended that he be charged with attempting to stage a coup.",
      "publishedAt": "2023-10-18T21:29:54Z",
      "title": "Brazil's Bolsonaro should be charged with attempting to stage a coup, congressional panel says",
      "url": "https://apnews.com/8323518f3c45c3dec0ab7be9c93eb159",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c534339089714743a3857c3cc202bb12/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}