{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — More Democratic lawmakers call on Biden to step aside, as the president insists he'll return to campaign trail next week.",
      "publishedAt": "2024-07-19T17:26:27Z",
      "title": "More Democratic lawmakers call on Biden to step aside, as the president insists he'll return to campaign trail next week",
      "url": "https://apnews.com/d4800d4b017aecd94074199d2f71234f",
      "urlToImage": ""
    },
    {
      "author": "The Associated Press",
      "description": "A major internet outage affecting Microsoft is disrupting flights, banks, media outlets and companies across the world, with problems continuing hours after the technology company said it was gradually fixing an issue affecting access to Microsoft 365 apps and services.",
      "publishedAt": "2024-07-19T09:57:15Z",
      "title": "Internet outage latest | Airlines, businesses hit by global technology disruption",
      "url": "https://apnews.com/f9002b97124a718a392997987d34c51d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b953006b354403bb8cec94860bec446/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Much of the world faced online disarray Friday as a widespread technology outage affected companies and services across industries — grounding flights, knocking banks and hospital systems offline and media outlets off air.",
      "publishedAt": "2024-07-19T15:03:03Z",
      "title": "A massive tech outage is causing worldwide disruptions. Here's what we know",
      "url": "https://apnews.com/94b4fc5ac6eed46ddcd565a5f1e4b916",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e7c0578c41442af9d92db78983ef541/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, LISA MASCARO, MICHAEL BALSAMO and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden on Friday appealed for party unity to take on former President Donald Trump's “dark vision,\" working to hold off pressure from Democrats at the highest levels for him to bow out of the 2024 election to make way for a new nominee and avoid widespread losses.",
      "publishedAt": "2024-07-19T05:43:43Z",
      "title": "Biden pushes party unity as he resists calls to step aside, says he'll return to campaign next week",
      "url": "https://apnews.com/329071c25dfaaae583b5f06184586267",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c880b739b9d48b69c81cfebc5a2c3ed/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN and SAM METZ",
      "description": "TEL AVIV, Israel (AP) — An Iranian-made drone sent by Yemen’s Houthi rebels struck Tel Aviv on Friday, leaving one person dead and at least 10 wounded in the group’s first lethal strike into Israel.",
      "publishedAt": "2024-07-19T03:59:40Z",
      "title": "Drone strike by Yemen's Houthi rebels kills 1 person and wounds at least 10 in Tel Aviv",
      "url": "https://apnews.com/daa70aa0f6a3248a00997a281c3731ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80fdbe20442a47c892042ce727a9a486/1920.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — The top U.N. court said Friday that Israel’s presence in the occupied Palestinian territories is “unlawful” and called on it to end and for settlement construction to stop immediately, issuing an unprecedented, sweeping condemnation of Israel’s rule over the lands it captured 57 years ago.",
      "publishedAt": "2024-07-19T07:27:04Z",
      "title": "Top UN court says Israel's presence in occupied Palestinian territories is illegal and should end",
      "url": "https://apnews.com/2d5178500c0410341b252335859f2316",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ae00a076c604cbc950c1b9197395e23/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, JONATHAN J. COOPER and JILL COLVIN",
      "description": "MILWAUKEE (AP) — Donald Trump, somber and bandaged, accepted the GOP presidential nomination on Thursday at the Republican National Convention in a speech that described in detail the assassination attempt that could have ended his life just five days earlier before laying out a sweeping populist agenda, particularly on immigration.",
      "publishedAt": "2024-07-18T11:03:25Z",
      "title": "Trump urges unity after assassination attempt while proposing sweeping populist agenda in RNC finale",
      "url": "https://apnews.com/5f1f337ac39477e9d1c53d3e027edda3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50babdb13434450884d1e7dd47444251/1920.jpeg"
    },
    {
      "author": "KIRILL ZARUBIN",
      "description": "YEKATERINBURG, Russia (AP) — Wall Street Journal reporter Evan Gershkovich was convicted Friday of espionage and sentenced to 16 years in a maximum-security prison on charges that his employer and the U.S.",
      "publishedAt": "2024-07-19T05:58:11Z",
      "title": "Russia convicts US journalist of spying in a trial widely seen as politically motivated",
      "url": "https://apnews.com/ef2e9fffc44570cf797e97aa6afa50a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d468c341d9a94d1bb77d9661b8d1b75f/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — To borrow a favorite phrase from the man himself, President Joe Biden is at an inflection point. Is his on-the-ropes reelection campaign about public service or his ego?",
      "publishedAt": "2024-07-19T13:35:46Z",
      "title": "Joe Biden faces increasing pressure to quit the race, but has spent a lifetime overcoming the odds",
      "url": "https://apnews.com/6fa4b6ff9382d9161d21dfc52838008f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c880b739b9d48b69c81cfebc5a2c3ed/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "From a media perspective, Donald Trump failed to stick the landing at the Republican convention that nominated him as its presidential candidate for a third time.His acceptance speech, which exceeded 90 minutes and stretched past midnight Eastern time into Friday, won him wide praise for its vivid recounting of last weekend's assassination attempt yet switched gears into something resembling what most of his supporters see regularly on the campaign trail.",
      "publishedAt": "2024-07-19T13:10:21Z",
      "title": "From a media perspective, it was a tale of two Trump speeches — and long enough for both",
      "url": "https://apnews.com/346a6aee7cc1a056fbf1d5a46673d606",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83b8c88ec0d94f159717bb1fbace60a9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}