{
  "articles": [
    {
      "author": null,
      "description": "KANSAS CITY, Mo. (AP) — The shooting at Kansas City Chiefs Super Bowl parade appeared to stem from a dispute between several people, police say.",
      "publishedAt": "2024-02-15T16:43:25Z",
      "title": "The shooting at Kansas City Chiefs Super Bowl parade appeared to stem from a dispute between several people, police say",
      "url": "https://apnews.com/fcebcca8690f183257e5afa0e783030d",
      "urlToImage": ""
    },
    {
      "author": "WAFAA SHURAFA, BASSEM MROUE and MELANIE LIDMAN",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces stormed the main hospital in southern Gaza on Thursday, hours after Israeli fire killed a patient and wounded six others inside the complex. The Israeli army said it was a limited operation seeking the remains of hostages taken by Hamas.",
      "publishedAt": "2024-02-15T07:37:11Z",
      "title": "Israeli forces storm the main hospital in southern Gaza, saying hostages were likely held there",
      "url": "https://apnews.com/d3a25caf6b60fe560e1a31d4f8f6b45e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f04e697dd9d47b284eee209baaf6697/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ERIC TUCKER",
      "description": "NEW YORK (AP) — Donald Trump’s hush-money trial will go ahead as scheduled with jury selection starting on March 25, a New York judge ruled Thursday, turning aside demands for a delay from the former president’s defense lawyers.",
      "publishedAt": "2024-02-15T05:02:37Z",
      "title": "Trump's New York hush-money case will start March 25. It’s the first of his criminal trials",
      "url": "https://apnews.com/fbdff18df40920b75873b3a40317f5ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22b23a36c18e459fae699546650715c8/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A former friend and co-worker of Fulton County District Attorney Fani Willis testified Thursday that Willis’ personal relationship with a special prosecutor began before she hired him to lead the election interference case against Donald Trump.",
      "publishedAt": "2024-02-15T05:06:58Z",
      "title": "Relationship between DA Fani Willis and Nathan Wade started years earlier than claimed, witness says",
      "url": "https://apnews.com/c37fcf993ac33c150f3cb3e4a7a888db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a640ea6f351b4e10b3df7cbfd17c46d1/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and NICK INGRAM",
      "description": "KANSAS CITY, Mo. (AP) — Authorities in Kansas City said Thursday that the mass shooting that unfolded amid throngs of people at the Chiefs’ Super Bowl celebration appeared to stem from a dispute between several people.",
      "publishedAt": "2024-02-15T05:31:18Z",
      "title": "Shooting after Chiefs Super Bowl parade seemed to stem from dispute among several people, police say",
      "url": "https://apnews.com/62e69a17b469b854afd7bcc3f548d1fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9645dd1e8d76474885b6af831a17bece/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The Senate's border proposal was one of the toughest bipartisan bills to emerge on the issue in decades. Yet it quickly collapsed when Republicans — galvanized by Donald Trump, the likely Republican presidential nominee — rejected the compromise as insufficient.",
      "publishedAt": "2024-02-15T05:10:23Z",
      "title": "Democrats embrace tougher border enforcement, seeing Trump's demolition of deal as a 'gift'",
      "url": "https://apnews.com/57f62a34ce9c4c08d6e00795fcb24764",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62ddb63e35e749118459c1ad5155d50c/3000.jpeg"
    },
    {
      "author": "MOHAMMED ZAATARI and BASSEM MROUE",
      "description": "NABATIYEH, Lebanon (AP) — The civilian death toll from two Israeli airstrikes in Lebanon has risen to 10, Lebanese state media reported Thursday, making the previous day the deadliest in more than four months of cross-border exchanges.",
      "publishedAt": "2024-02-15T07:29:04Z",
      "title": "Israeli airstrikes killed 10 Lebanese civilians in a single day. Hezbollah has vowed to retaliate",
      "url": "https://apnews.com/294288635bb489fdefd8d36978651554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f764d76753b24360bd4733a1aad1fcf6/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and EMMA BURROWS",
      "description": "KYIV, Ukraine (AP) — A missile strike on the Russian city of Belgorod near the Ukraine border on Thursday killed six people, including a child, and injured 18 others, a Russian official said. It was the latest in exchanges of long-range missile and rocket fire in Russia's war on Ukraine.",
      "publishedAt": "2024-02-15T10:03:01Z",
      "title": "6 people are killed, 18 injured by a missile strike in the Russian city of Belgorod, officials say",
      "url": "https://apnews.com/93730c5954f9fdc5dcecd0ffaf527c71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e489ac44c00241d58f613b12ae5146f2/2000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and JIM MUSTIAN",
      "description": "MIAMI (AP) — Manuel Rocha was well known in Miami’s elite circles for an aristocratic, almost regal, bearing that seemed fitting for an Ivy League-educated career U.S. diplomat who held top posts in Argentina, Bolivia, Cuba and the White House.",
      "publishedAt": "2024-02-15T15:02:37Z",
      "title": "Red flags, missed clues: How accused US diplomat-turned-Cuban spy avoided scrutiny for decades",
      "url": "https://apnews.com/2b065bd90e7576d9fff8adc4fa9c981f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb6149db3cb444ce8557acf3123dd46d/2008.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — The former mother-in-law of the woman who opened fire at a Houston megachurch tried for years to alert authorities and others, including church staff, about her ex-daughter-in-law’s mental health struggles, she said Wednesday.",
      "publishedAt": "2024-02-15T05:42:06Z",
      "title": "Warning signs mounted before Texas shooter entered church with her son, former mother-in-law says",
      "url": "https://apnews.com/04b6f9c340517ae82f3c075afb1df570",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f75eec009824b94a9c84cb80a6ee9b5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}