{
  "articles": [
    {
      "author": "Zeke Miller, Aamer Madhani, Seung Min Kim",
      "description": "White House national security adviser Mike Waltz is set to depart the Trump administration. That's according to two people familiar with the matter, which marks the first major staff shakeup of President Donald Trump’s second term. Waltz came under searing scrutiny in March after revelations that he added journalist Jeffrey Goldberg to a private text chain on the encrypted messaging app Signal, which was used to discuss planning for a sensitive March 15 military operation against Houthi militants in Yemen. A far-right ally of the president, Laura Loomer, has also targeted Waltz, telling Trump in a recent Oval Office conversation that he needs to purge aides who she believes are insufficiently loyal to the “Make America Great Again” agenda.",
      "publishedAt": "2025-05-01T15:46:19Z",
      "title": "Mike Waltz out as Trump national security adviser in major shakeup",
      "url": "https://apnews.com/article/trump-waltz-national-security-signal-db2443f6fed98e4067edd57f26f23603",
      "urlToImage": "https://dims.apnews.com/dims4/default/633aaf7/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fbf%2F721c1002d3d37c53bc7be38ef408%2F88f658a8fc0c464ca20bcea30dcf7bbf"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "A federal judge has barred the Trump administration from deporting any Venezuelans from South Texas under an 18th-century wartime law. U.S. District Court Judge Fernando Rodriguez Jr. is the first judge to rule that the Alien Enemies Act cannot be used against people who the Republican administration claims are gang members invading the United States. In March, President Donald Trump issued a proclamation claiming that the Venezuelan gang Tren de Aragua was invading the U.S. He said he had special powers to deport immigrants, identified by his administration as gang members, without the usual court proceedings.",
      "publishedAt": "2025-05-01T16:13:54Z",
      "title": "Judge bars deportations of Venezuelans from South Texas under 18th-century wartime law",
      "url": "https://apnews.com/article/trump-deportations-alien-enemies-act-venezuelans-texas-e0dda59f64b1f5752fb92a91ff7878f8",
      "urlToImage": "https://dims.apnews.com/dims4/default/688a0fc/2147483647/strip/true/crop/2755x1550+0+143/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F9f%2Fb11ad3ef282db1cc8abf34a3792f%2F91244921105a4fecacef9624bef495e9"
    },
    {
      "author": "Yuri Kageyama",
      "description": "Shouting “banzai!” or “live long,” thousands of people gathered in a Tokyo park on Thursday and marched through the streets to the banging of traditional drums, as Japan kicked off celebrations to mark May Day. The holiday, also known as International Workers’ Day or Labor Day, marks the struggles and achievements of workers and the labor movement around the world. Thousands of people are expected to attend rallies and marches across the U.S., including in Chicago, Los Angeles, New York and Philadelphia. Junko Kuramochi, a member of a mothers’ group who joined the march in Japan’s capital, said: “For our children to be able to live with hope, the rights of workers must be recognized.\"",
      "publishedAt": "2025-05-01T05:48:25Z",
      "title": "From Tokyo to Los Angeles, workers observe May Day with marches and demonstrations",
      "url": "https://apnews.com/article/may-day-workers-labor-unions-rallies-marches-trump-46de8196d7f01d7458c3d77ccd5e0e54",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b3d59f/2147483647/strip/true/crop/6550x3684+0+341/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2Fcf%2F886f747e06354e6583476720dc56%2F466482b70e64441baf9813fd2f97388f"
    },
    {
      "author": "Geoff Mulvihill, Carla Johnson, Amanda Seitz",
      "description": "The Trump administration is calling for more reliance on behavioral therapy for transgender youth instead of broader gender-affirming medical care. A report from the Department of Health and Human Services questions the current practices and medical groups that endorse them. The administration’s position released Thursday sprang from Trump’s executive order calling for the federal government not to support gender transition for people under age 19. A court has put some parts of the order on hold. The new report is one of several ways Trump and his administration have contradicted guidelines for treating transgender people accepted by major medical organizations.",
      "publishedAt": "2025-05-01T13:01:42Z",
      "title": "Trump's HHS transgender review urges therapy not gender-affirming medical care",
      "url": "https://apnews.com/article/trump-hhs-rfk-transgender-therapy-53c20e8ba65b2d9e4750d5c3314492cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/b2d9054/2147483647/strip/true/crop/2985x1679+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2Fa6%2F3d47743e2ae2c64e4a5acace7b63%2Ffa6e4f222f7643a7ba2f40055db972a7"
    },
    {
      "author": "Jon Gambrell",
      "description": "Oman has announced that planned negotiations between Iran and the United States this weekend over Tehran’s rapidly advancing nuclear program have been postponed. A message online from Omani Foreign Minister Badr al-Busaidi made the announcement in a post on the social platform X. Al-Busaidi did not elaborate. Iran and the U.S. both acknowledged the talks would not be happening. They were to be held on Saturday in Rome. A person familiar with the U.S. negotiators said the U.S. expected the talks to occur in the near future.",
      "publishedAt": "2025-05-01T14:15:32Z",
      "title": "Iran-US nuclear talks postponed",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-oman-8121e584d9e6c63c5f3cd8e4b1654f81",
      "urlToImage": "https://dims.apnews.com/dims4/default/10e612c/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2F6c%2F6b0926d74b7f3b46c797a3c00f77%2F2c0db1dcce4d4e049345e370ba1c2e53"
    },
    {
      "author": "Lolita Baldor",
      "description": "U.S. defense officials say the number of sexual assaults reported across the military fell by nearly 4% last year and there was a significant drop in the Army. It’s the second year in a row with a decrease. That reverses a troubling trend that’s plagued the Defense Department for more than a decade. The officials say that while the decline is a good sign, the numbers of reported assaults are still too high and the military needs to do more to get victims to report the often undisclosed crime. The officials spoke on condition of anonymity because the report hasn’t been publicly released.",
      "publishedAt": "2025-05-01T04:04:14Z",
      "title": "Sex assault reports in the US military fell last year, AP learns",
      "url": "https://apnews.com/article/military-sexual-assault-reports-harassment-7afab0cb897287768ac1199139ba793f",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea76c6a/2147483647/strip/true/crop/5025x2827+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F02%2F10b21570bc30cb4e3e5b3674c33b%2F4400b5605ce74e84930e9c14dd5f5d88"
    },
    {
      "author": "Marcia Dunn",
      "description": "An astronaut who missed out on the first all-female spacewalk is getting her chance six years later. NASA's Anne McClain emerged from the International Space Station on Thursday alongside Nichole Ayers. They launched to the orbiting lab in March to replace NASA's two stuck astronauts, who are now back home. During their spacewalk, the pair will prepare the space station for new solar panels and move an antenna. McClain should have taken part in the first all-female spacewalk in 2019, but there weren't enough medium-size suits. The latest was the fifth all-female spacewalk in 60 years of spacewalking.",
      "publishedAt": "2025-05-01T13:21:39Z",
      "title": "NASA astronauts step outside space station to perform the 5th all-female spacewalk",
      "url": "https://apnews.com/article/nasa-astronauts-all-female-spacewalk-d2dfe696bfaaef8bae8de27cd846355a",
      "urlToImage": "https://dims.apnews.com/dims4/default/5df771f/2147483647/strip/true/crop/2764x1555+0+18/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2Ffc%2F1e131d65596763bafbb051bb6951%2F7e52c3dae1d3432ba37182e41fe48bf4"
    },
    {
      "author": "Jennifer Peltz, Michael R. Sisak",
      "description": "Harvey Weinstein’s lawyers are getting their turn to question a woman who alleges the one-time Hollywood heavyweight held her down on a bed and forced oral sex on her nearly two decades ago. Miriam Haley, testifying Thursday for a third day at Weinstein’s retrial, was grilled about her decision to hire a lawyer and go public with her allegations as the #MeToo movement exploded in October 2017. Defense attorney Jennifer Bonjean sparred with Haley over the details of her early statements, getting her to admit that back then, she didn’t give interviewers a full picture of their relationship. Weinstein has pleaded not guilty and denies sexually assaulting anyone.",
      "publishedAt": "2025-05-01T16:57:52Z",
      "title": "Harvey Weinstein’s lawyers get their turn to question accuser Miriam Haley at #MeToo retrial",
      "url": "https://apnews.com/article/harvey-weinstein-retrial-miriam-haley-metoo-913e004daf5bb6b9fee401f8619517f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/9e04cdc/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2Ffc%2Fef32aefdce3af069352b0ec4cc51%2Fd9fdcc1a6b704b148f7b0fb8b27a5cae"
    },
    {
      "author": "Christina Larson",
      "description": "Researchers say Ronan the sea lion can still keep a beat after all these years. Ronan burst to fame about a decade ago after scientists reported her musical skills. At age 15, she's still got it. And researchers say she was better than people at keeping rhythm. Findings were published Thursday in the journal Scientific Reports. Ronan joins a select group of animal movers and shakers -- which also includes Snowball the famed dancing cockatoo -- that together upended the long-held idea that the ability to respond to music and recognize a beat was distinctly human.",
      "publishedAt": "2025-05-01T15:22:27Z",
      "title": "Scientists once thought only humans could bob to music. Ronan the sea lion helped prove them wrong",
      "url": "https://apnews.com/article/ronan-dancing-sea-lion-boogie-wonderland-ef575607db2f710fe102e2dd7c994049",
      "urlToImage": "https://dims.apnews.com/dims4/default/7797840/2147483647/strip/true/crop/3008x1692+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2F93%2F918e0945004f2c7bc662e772c386%2F9f0ae5fa81724a168e133076ae86fd5d"
    },
    {
      "author": "Mark Kennedy",
      "description": "Three Broadway shows — “Buena Vista Social Club,” “Death Becomes Her” and “Maybe Happy Ending” — each earned a leading 10 Tony Award nominations Thursday. Nominators spread out the joy and gave nods to George Clooney, Sarah Snook and Bob Odenkirk in their debuts. Audra McDonald, as expected, heard her name called for her turn as Rose in a hailed revival of “Gypsy.” A revival of David Mamet’s “Glengarry Glen Ross” earned Odenkirk a nod, but not for his co-stars Kieran Culkin or comedian Bill Burr. And, in a shock, an edgy “Othello” with Denzel Washington and Jake Gyllenhaal that costs north of $900 for orchestra seat tickets, got not a single nomination.",
      "publishedAt": "2025-05-01T04:01:24Z",
      "title": "'Buena Vista Social Club,' 'Death Becomes Her' and 'Maybe Happy Ending' lead Tony Award nominations",
      "url": "https://apnews.com/article/tony-award-nominations-2025-9de5d6e964a4902b40e3b7c283e3af48",
      "urlToImage": "https://dims.apnews.com/dims4/default/c269ced/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F45%2Faacd00f0cc703b3ecf898be6ab28%2F27b62898508d48a3a4409450fbf0b219"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}