{
  "articles": [
    {
      "author": "Colleen Barry",
      "description": "Heads of state and royalty will begin converging on Rome for Pope Francis’ funeral in the Vatican’s St. Peter’s Square, but the group of poor people who will meet his casket in a small crosstown basilica are more in keeping with Francis’ humble persona and disdain for pomp. U.S. President Donald Trump and Argentine President Javier Milei are among the leaders arriving Friday. That is the last day Argentine pope will lie in state in St. Peter’s Basilica before his coffin is sealed in preparation for his funeral Saturday. More than 90,000 mourners have waited hours in line to bid farewell to Francis, who died Monday.",
      "publishedAt": "2025-04-25T04:07:48Z",
      "title": "Trump and Zelenskyy among dignitaries converging on Rome for funeral of Pope Francis",
      "url": "https://apnews.com/article/italy-vatican-pope-funeral-dignitaries-b8c206d03e3535b8ee3b18d42667b803",
      "urlToImage": "https://dims.apnews.com/dims4/default/2fba9c1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F91%2F18f17c1a0ac4cf08c7b08cca5c7d%2F12068fd3696c4425b9410471616641b3"
    },
    {
      "author": "Peter Smith, Michelle L. Price",
      "description": "The clash in style between Donald Trump and Pope Francis and their positions on migration, the environment and poverty will come into sharper focus as the president travels to Rome for Francis’ funeral. It will be held Saturday morning in St. Peter’s Square. Despite the billionaire former reality star’s divergences over the years with the holy leader known for a humble style, Trump’s support has risen over the years among American Catholics. He courted them in his last presidential campaign, and many influential bishops are among his supporters.",
      "publishedAt": "2025-04-25T04:06:55Z",
      "title": "Trump’s trip to Pope Francis’ funeral highlights years of clashes",
      "url": "https://apnews.com/article/trump-pope-francis-funeral-catholics-relationship-a34cb1f8a6ceb147e2e112cb4e02e32c",
      "urlToImage": "https://dims.apnews.com/dims4/default/53247ad/2147483647/strip/true/crop/3911x2200+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F33%2Fd3b153cd6acfd8416776c628da4f%2F2476823162114b2ea4d0a9a75056f92b"
    },
    {
      "author": "Nicole Winfield",
      "description": "Associated Press reporter Nicole Winfield, who covered Pope Francis at the Vatican during his entire pontificate, earned the nickname “la prima della classe” -- or “the first in class” -- from him in 2018. It came during a particularly low point in his papacy, when he was struggling with cases of priests who sexually abused children. Francis bestowed the name after Winfield challenged him with especially tough questions about his seeming indifference toward Chilean abuse victims. In an AP interview in 2023, Francis acknowledged that the 2018 news conference where the exchange took place was the moment he began to understand the depths of the scandal.",
      "publishedAt": "2025-04-25T04:11:43Z",
      "title": "Pope Francis bestowed a special nickname on AP's Vatican reporter for her often-tough questions",
      "url": "https://apnews.com/article/pope-francis-associated-press-vatican-correspondents-59f27fce3478d913a82dc90974fa984c",
      "urlToImage": "https://dims.apnews.com/dims4/default/64d7a60/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2F10%2Fad6c1100a0e7fef9d6cd736fe834%2F1f89e2e0cb2d4cb2a16313a3417ddc9e"
    },
    {
      "author": "Vasilisa Stepanenko, Samya Kullab",
      "description": "Ukraine President Volodymyr Zelenskyy says he is cutting short his official trip to South Africa and returning home after a Russian strike on Kyiv killed at least nine people and injured more than 70. The Russian attack on Kyiv came hours after weeks of peace negotiations appeared to be coming to a head without an agreement in sight. President Donald Trump lashed out at Zelenskyy on Wednesday, accusing him of prolonging the “killing field” by refusing to surrender the Russia-occupied Crimea Peninsula as part of a possible peace deal. Zelenskyy has repeated many times during the more than three-year war that recognizing occupied territory as Russian is a red line for his country.",
      "publishedAt": "2025-04-24T04:29:41Z",
      "title": "Zelenskyy cuts short South African trip after massive Russian strike on Kyiv kills 9",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-strike-913ca4a6b4e624ed50e6c1018576a8ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/af3632e/2147483647/strip/true/crop/7789x4381+0+406/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2Fcb%2Fb8760f75a4790e2e08c15f2334c8%2F8bac50404e304f4188b831bcb2eb4ea0"
    },
    {
      "author": "Julia Frankel, Phil Holm, Josef Federman",
      "description": "After the Hamas attack on Oct. 7, 2023 ignited the devastating war in Gaza, a deadly new reality also took hold for Palestinians in the occupied West Bank.",
      "publishedAt": "2025-04-25T05:02:46Z",
      "title": "While the world watches Gaza, here is what's happening in the West Bank",
      "url": "https://apnews.com/article/mideast-israel-palestinians-west-bank-9191f6c5b2417ed58a2bfaefb559199c",
      "urlToImage": "https://dims.apnews.com/dims4/default/516c249/2147483647/strip/true/crop/3162x1779+0+329/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2F21%2Ffbf00c404a25aa857ef485bf781d%2Fparting-shot.jpg"
    },
    {
      "author": "Lolita Baldor",
      "description": "Houthi rebels in Yemen have shot down seven U.S. Reaper drones in less than six weeks. It's a loss of aircraft worth more than $200 million in what is becoming the most dramatic cost to the Pentagon of the military campaign against the Iran-backed militants. Defense officials say three of the drones were shot down in the past week. This suggests the militants’ targeting of the unmanned aircraft flying over Yemen has improved. Officials say the drones were doing attack runs or conducting surveillance, and they crashed both into the water and onto land. They spoke on condition of anonymity to discuss military operations.",
      "publishedAt": "2025-04-24T22:53:24Z",
      "title": "Houthi rebels have shot down 7 US Reaper drones worth $200 million in recent weeks",
      "url": "https://apnews.com/article/houthis-us-warships-red-sea-e6e97a7131c48640ccf74b1916628234",
      "urlToImage": "https://dims.apnews.com/dims4/default/2323266/2147483647/strip/true/crop/6549x3684+0+341/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2F96%2F769b9410f96632c82ec6b517ddae%2Fefc8bea4a5ff4983a073f75514f75c86"
    },
    {
      "author": "Rajesh Roy",
      "description": "A deadly attack on tourists in Indian-controlled Kashmir has again moved India and Pakistan closer to war. The rivals have downgraded their diplomatic and trade ties, closed their main border crossing and revoked visas for each other’s nationals. Pakistan denies it was behind Tuesday’s attack in which 26 mostly Indian tourists were killed at a scenic spot in the Himalayan region. India claims it restored a sense of calm in Kashmir despite a decadeslong rebellion. India and Pakistan have fought two of their three wars over Kashmir, which is split between them and claimed by both in its entirety.",
      "publishedAt": "2025-04-24T12:43:36Z",
      "title": "Pahalgam attack: India and Pakistan again on the brink of conflict",
      "url": "https://apnews.com/article/india-pakistan-kashmir-explainer-c45cae691eea394e80d468918b038edb",
      "urlToImage": "https://dims.apnews.com/dims4/default/d88ee6c/2147483647/strip/true/crop/3700x2081+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F45%2Fac869aa1e2f4d8424546c42e78b8%2Ff8e119b65adb4515af2492bb90f7976b"
    },
    {
      "author": "Ali Swenson",
      "description": "A federal judge has blocked the Trump administration from immediately enacting certain changes to how federal election are run, including adding a proof-of-citizenship requirement to the federal voter registration form. President Donald Trump had called for that and other sweeping changes to U.S. elections in an executive order signed in March. The Republican president argued the U.S. “fails to enforce basic and necessary election protections” that exist in other countries. On Thursday, U.S. District Judge Colleen Kollar-Kotelly sided with voting rights groups and Democrats to grant a preliminary injunction to stop the citizenship requirement from moving forward while the lawsuit plays out. The parties in the case didn't immediately comment on the judge's order.",
      "publishedAt": "2025-04-24T17:42:17Z",
      "title": "Judge blocks parts of Trump’s overhaul of US elections",
      "url": "https://apnews.com/article/trump-elections-executive-order-citizenship-lawsuit-4b683fe2e1106316fdb05621be9b7d0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d712ec9/2147483647/strip/true/crop/5515x3102+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F70%2F975a7bc27e81de22cc642599de39%2F1c7a6a974865490f9a78641e50ef46a4"
    },
    {
      "author": "Joshua Goodman, Gisela Salomon",
      "description": "As President Donald J. Trump seeks to make good on his campaign pledge of mass arrests and removals of migrants, the U.S. immigration detention system is being overrun with prisoners. The overcrowding has been especially acute at the Krome Detention Center in Miami, which last month saw its population swell to almost three times its capacity of 600 detainees. Nationwide, detentions have surged to nearly 48,000 as of March 23, a 21% increase from the already elevated levels at the end of the Biden administration. Complaints of mistreatment are going unattended after the Trump administration shut down three Department of Homeland Security oversight offices charged with investigating such claims.",
      "publishedAt": "2025-04-25T04:07:45Z",
      "title": "As immigrant arrests surge, complaints of abuse mount at America's oldest detention center in Miami",
      "url": "https://apnews.com/article/immigration-miami-deportation-detention-ice-67a6c798b56ea4b42ee06afcc8c22428",
      "urlToImage": "https://dims.apnews.com/dims4/default/94e8055/2147483647/strip/true/crop/5402x3039+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F01%2Fc2dc1e5ef84872f2e4a2982f2077%2F0faa17fe5e9b440fa92856f844f4e30e"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "Booths of big Chinese, German and Japanese automakers are bustling at Shanghai's auto show as the industry keeps its sights on the wider global market not subject to steep U.S. tariffs on imports of cars and auto parts. U.S. President Donald Trump's 25% tariffs may fence the U.S. market in, raising costs and causing companies to recalibrate their strategies. Whatever happens with U.S. trade policy, auto and parts makers indicated their focus is on the fast growing global markets. Some attending the show said they believe that ultimately Trump will end up softening his stance.",
      "publishedAt": "2025-04-25T02:05:38Z",
      "title": "Automakers focus on the global market, chide the US over tariffs at Shanghai's auto show",
      "url": "https://apnews.com/article/china-auto-tariffs-trump-evs-397bc37d5412bb6c0aa1426665c3779b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e2078d9/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F3a%2Fd0a3e5d7bb6c8ef35211551b2918%2F6c48056edfa042bbb14fb987402d8ac4"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}