{
  "articles": [
    {
      "author": null,
      "description": "State media says Iran executed three more prisoners Wednesday for alleged spying in the latest hangings connected to its war against Israel. The hangings happened in Urmia Prison in Iran’s West Azerbaijan province, which is the country’s most northwest province. IRNA cited Iran’s judiciary for the news, saying the men had been accused of bringing “assassination equipment” into the country. Iran has carried out several hangings during its war with Israel, sparking fears from activists that it could conduct a wave of executions after the conflict ended.",
      "publishedAt": "2025-06-25T06:07:56Z",
      "title": "Iran executes 3 more prisoners it accused of spying for Israel",
      "url": "https://apnews.com/article/israel-iran-war-nuclear-06-23-2025-63d873b977642a40986d1f1dee5c4b37",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1997aa/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2Fdd%2F64ed9062095c7afa498afe51dbc6%2F3207f17b859c4469adc5ff66543b4882"
    },
    {
      "author": null,
      "description": "In a 48-hour whirlwind, President Donald Trump went from elated to indignant to triumphant as the fragile Israel-Iran ceasefire agreement came together, teetered toward collapse and ultimately coalesced. Trump publicly on Tuesday harangued Israelis and Iranians with pique that's even notable for someone who isn’t shy about letting the world know exactly what he thinks. The effort was helped along as his aides, and Qatari allies, sensed an opening after following a half-hearted, face-saving measure by Tehran to retaliate against the U.S. for strikes against three key nuclear sites. It didn’t hurt that Prime Minister Benjamin Netanyahu, after 12 days of bombing, could make the case to the Israeli public that Iran’s nuclear program was diminished.",
      "publishedAt": "2025-06-24T21:30:52Z",
      "title": "How Trump's Israel-Iran ceasefire agreement came together in 48 hours",
      "url": "https://apnews.com/article/trump-iran-israel-ceasefire-agreement-terms-b5fc5cc8a8c32b4899646130b496798a",
      "urlToImage": "https://dims.apnews.com/dims4/default/64311b0/2147483647/strip/true/crop/5508x3098+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Fea%2F37ede77ad62f257ee295854e6a30%2F43c540fafa60445693f0a4cf71087ec0"
    },
    {
      "author": null,
      "description": "The Israeli military says seven soldiers were killed in the southern Gaza city of Khan Younis when an explosive device affixed to their armored vehicle detonated. Tuesday’s explosion was a particularly deadly incident for Israel’s military inside Gaza. Over 860 Israeli soldiers have been killed since the war against Hamas began in 2023. Al-Qassam Brigades, Hamas’s military wing, said it had ambushed Israeli soldiers taking cover inside a residential building Tuesday in the southern Gaza Strip. It was not immediately clear whether the two incidents were the same. The deadly attack came as the Palestinian death toll inside Gaza passed 56,000.",
      "publishedAt": "2025-06-25T05:39:51Z",
      "title": "Explosive kills 7 Israeli soldiers in Gaza inside an armored vehicle, military says",
      "url": "https://apnews.com/article/israel-hamas-war-gaza-06-25-2025-fa3d0a63c2b78a2e95984f1122b89317",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a480fc/2147483647/strip/true/crop/8142x4580+0+424/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2Fbe%2Ff8c35fc56bc60d0b0fc839f942a1%2F334fb9dbf81a4d6b91169f3c572e4c6e"
    },
    {
      "author": null,
      "description": "Kilmar Abrego Garcia is expected to be released from jail in Tennessee on Wednesday, only to be taken into immigration custody. The Salvadoran national whose mistaken deportation became a flashpoint in the fight over President Donald Trump’s immigration policies has been in jail since he was returned to the U.S. on June 7. He faces two counts of human smuggling in Tennessee. A hearing to set conditions for his release on the criminal charges is set for Wednesday. However, attorneys have said U.S. Immigration and Customs Enforcement will detain him as soon as he is released. It is less clear whether ICE will try to immediately re-deport him or allow him to face the criminal charges.",
      "publishedAt": "2025-06-25T04:16:01Z",
      "title": "Kilmar Abrego Garcia is expected to be released from jail only to be taken into immigration custody",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-deportation-smuggling-27c3a6f7a1a0700d9a33209e852c06a6",
      "urlToImage": "https://dims.apnews.com/dims4/default/1ea78d7/2147483647/strip/true/crop/5635x3170+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F2f%2F348bc6d835829d8ef7a3738e18b3%2Fe3b845161f72428aa6db6f42a55b36d8"
    },
    {
      "author": null,
      "description": "Former Gov. Andrew Cuomo conceded New York City’s Democratic mayoral primary to Zohran Mamdani as the 33-year old member of the state Assembly had a tentative lead in the race Tuesday night. Cuomo’s concession came as the race’s outcome will be decided by a ranked choice count after neither Democrat got a clear majority in the vote. Mamdani, a 33-year-old democratic socialist member of the state Assembly, started to pull ahead with more than an estimated 80% of ballots counted. Cuomo, in a speech to supporters, said Mamdani “won” and that “we are going to take a look and make some decisions.”",
      "publishedAt": "2025-06-24T03:48:34Z",
      "title": "Andrew Cuomo concedes New York City Democratic mayoral primary to Zohran Mamdani",
      "url": "https://apnews.com/article/andrew-cuomo-zohran-mamdani-new-york-mayor-0d39764944e7e55a7e26a988d4136a86",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1831a1/2147483647/strip/true/crop/5839x3284+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc4%2F43%2F3ed4386b362546b3d80a29859dfe%2Fc1bf5a4567924c829ac1bca00a5b905b"
    },
    {
      "author": null,
      "description": "World shares are mixed as a fragile ceasefire between Israel and Iran appears to be holding. Investors have shifted their focus to comments to Congress by Federal Reserve Chair Jerome Powell. On Tuesday, the S&P 500 rallied 1.1% to within 0.8% of its record. The Dow Jones Industrial Average rose 1.2%, and the Nasdaq composite jumped 1.4%. Oil prices gained more than 1% early Wednesday after falling about 6% on Tuesday on hopes that Israel’s war with Iran will not damage the global flow of crude. Lower oil prices could give the Fed leeway to cut interest rates to help the economy, and Powell said it is waiting for the right time to do so.",
      "publishedAt": "2025-06-25T06:00:09Z",
      "title": "World shares are mixed as a fragile Israel-Iran ceasefire holds",
      "url": "https://apnews.com/article/stocks-markets-oil-powell-inflation-tariffs-80068c5388469b83648e478cdccf2f80",
      "urlToImage": "https://dims.apnews.com/dims4/default/6c220ff/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2F4f%2Fc4a3a593b15a47e56358443bc67f%2Fab7714b617bb446ea1e4c48b92523ca9"
    },
    {
      "author": null,
      "description": "NATO Secretary-General Mark Rutte is upbeat that the military organization will agree a massive spending hike at a “transformational summit,” as member state leaders including U.S. President Donald Trump are expected to agree a new defense spending target of 5% of gross domestic product. Russia remains the major threat in Europe, but the United States is shifting its attention to focus on security priorities elsewhere. Ahead of the meeting, Spain officially announced that it would not be able to reach the target by the new 2035 deadline, calling it “unreasonable.” Belgium signaled that it will not get there either, and Slovakia said it reserves the right to decide its own defense spending.",
      "publishedAt": "2025-06-25T06:54:49Z",
      "title": "Back to the future: NATO leaders hark back to the Cold War as they meet to hike defense spending",
      "url": "https://apnews.com/article/nato-defense-spending-trump-spain-db0912cbfdaedc4c6b57809c9e11d6bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/64ddf4d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F5c%2Fb2c0ad18044c1a221901dce6c7e9%2F20cd28f1aff34296ab037eba607c9cb7"
    },
    {
      "author": null,
      "description": "The temperature in New York City have reached 100 degrees as the eastern U.S. sweltered under an extreme heat wave. According to the National Weather Service, Kennedy International Airport recorded 100 degrees Fahrenheit at midday Tuesday. Large swaths of the country were broiling under a heat dome, worsened by a humid atmosphere that’s circling the East. After nearly 40 US cities broke record high marks Monday, the weather service expected dozens of records Tuesday when the heat dome should hit its peak.",
      "publishedAt": "2025-06-24T16:50:34Z",
      "title": "Temperature in New York City reaches 100 degrees as eastern US swelters under extreme heat wave",
      "url": "https://apnews.com/article/extreme-heat-new-york-city-fc6f3e60a868b5a5f615e3408c0d05fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/e004885/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2F92%2F413fd72d7be8471155879d9522c6%2F3ab0d225c27a4f45a941861aa6426625"
    },
    {
      "author": null,
      "description": "President Donald Trump heads into his sole full day at the NATO summit facing an alliance he has worked to bend to his will, even as he continues to rattle its members. Even before landing in the Netherlands on Tuesday, Trump cast doubt on whether the U.S. would abide by Article 5 of the NATO treaty, which calls on all members to defend one another in case of an attack. That came even as the 32-member alliance was poised to enact one of Trump’s chief priorities for NATO: increasing how much its member countries spend to shore up their defenses.",
      "publishedAt": "2025-06-25T04:07:09Z",
      "title": "At NATO summit, Trump faces an alliance further shaped to his liking",
      "url": "https://apnews.com/article/trump-nato-defense-ukraine-143b53c6429e8de256c8ce0b97fdcd7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b01c7eb/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F33%2Faee8d805ec8c3bae4395ce9d9791%2F264ceb9cd8954c7ca3b12e36d488c682"
    },
    {
      "author": null,
      "description": "One of Switzerland's glaciologists says his teams are noticing a strange phenomenon in the Alpine country's glaciers. Holes are emerging inside — a bit like Swiss cheese — seemingly caused by turbulence as water passes through the bottom of the glacier or air flows through the gaps that appear inside. The glaciers of Switzerland, which has the most of any country in continental Europe, are fading because of global warming. Their fragility became starkly apparent last month as a mudslide swallowed up the village of Blatten. Matthias Huss of the GLAMOS glacier monitoring group took The Associated Press to see one major glacier this month.",
      "publishedAt": "2025-06-25T01:45:05Z",
      "title": "Holes like Swiss cheese are forming in retreating glaciers",
      "url": "https://apnews.com/article/switzerland-rhone-glacier-blatten-climate-melting-20734108e501c3c05143dafb176441fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d2d072/2147483647/strip/true/crop/1338x753+0+70/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F8d%2F20da7f59315495f0fe2440108fb8%2F00f88b8059c74f81912c65a94bed3a9a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}