{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — House censures Rep. Rashida Tlaib over her rhetoric about Israel, rebuking the only Palestinian American in Congress.",
      "publishedAt": "2023-11-08T03:29:29Z",
      "title": "House censures Rep. Rashida Tlaib over her rhetoric about Israel, rebuking the only Palestinian American in Congress",
      "url": "https://apnews.com/567b79c4387967baea748b1b7ae5d5cf",
      "urlToImage": ""
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — There was plenty in the early results of Tuesday's off-year election to make Democrats happy, but it shouldn't be enough to make them feel secure heading into next year's presidential election.",
      "publishedAt": "2023-11-08T02:21:42Z",
      "title": "Democrats win on abortion rights and other highlights from Tuesday's elections",
      "url": "https://apnews.com/868a21bf3537a0533ae3fd8007d07eef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/049fa3351187405f8bd0b90165b9e4ee/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Democratic Kentucky Gov. Andy Beshear won reelection on Tuesday, while Ohio voters approved a constitutional amendment guaranteeing the right to an abortion and other forms of reproductive health care.",
      "publishedAt": "2023-11-07T11:42:10Z",
      "title": "Kentucky Gov. Beshear wins reelection. Ohio passes amendment on abortion rights. Follow live updates",
      "url": "https://apnews.com/464a4e2197cf99de8b4d5c631f808ffb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a36546ac8da4ced83b8332d5e70b9c9/1920.jpeg"
    },
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel said Tuesday that its ground forces were battling Hamas fighters deep inside Gaza’s largest city, signaling a major new stage in the month-old conflict, and its leaders foresee controlling the enclave's security after the war.",
      "publishedAt": "2023-11-07T07:21:59Z",
      "title": "Israel fights Hamas deep in Gaza City and foresees control of enclave’s security after war",
      "url": "https://apnews.com/6e1425d218de6a73f8a51e4c036cfd39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba294c289eac4d238e36d38af45d82a4/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The House voted late Tuesday to censure Democratic Rep. Rashida Tlaib of Michigan — the only Palestinian American in Congress — an extraordinary rebuke of her rhetoric about the Israel-Hamas war.",
      "publishedAt": "2023-11-07T20:49:11Z",
      "title": "House votes to censure Rep. Rashida Tlaib over her Israel-Hamas rhetoric in a stunning rebuke",
      "url": "https://apnews.com/8085189047a4c40f2d44ada4604aa076",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2237f40ec9cb4cbe81a07dd6b3e6ebf9/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump went off. Again and again. Making the witness stand at his civil fraud trial his podium, the former president laid into the judge who'll decide the case and the New York attorney general who’s suing him.",
      "publishedAt": "2023-11-07T22:39:06Z",
      "title": "Highlights of Donald Trump's hours on the witness stand at his New York civil fraud trial",
      "url": "https://apnews.com/f73b28ef92cf3606d66bc9418f3025bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17cfed6b938948729090f614b650ae18/2904.jpeg"
    },
    {
      "author": "MELINA WALLING",
      "description": "This October was the hottest on record globally, 1.7 degrees Celsius (3.1 degrees Fahrenheit) warmer than the pre-industrial average for the month — and the fifth straight month with such a mark in what will now almost certainly be the warmest year ever recorded.",
      "publishedAt": "2023-11-08T03:10:19Z",
      "title": "October obliterated temperature records, virtually guaranteeing 2023 will be hottest year on record",
      "url": "https://apnews.com/4c5b496420620a02f9c295604cf8d2b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/854b3888270644af95c5f2dcc7cb416e/2214.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The prosecutor overseeing the Hunter Biden investigation testified Tuesday that he had the ultimate authority in the yearslong case as he made an unprecedented appearance before Congress to rebut Republicans' explosive claims that the probe has been plagued with interference.",
      "publishedAt": "2023-11-07T05:35:25Z",
      "title": "Special counsel in the Hunter Biden case insists he was the 'decision-maker' in rare testimony",
      "url": "https://apnews.com/aed25541b709a57371cdfe1582be0c5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/454f13362e444f048224d5a6f05bf958/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court seemed likely Tuesday to preserve a federal law that prohibits people under domestic violence restraining orders from having guns.",
      "publishedAt": "2023-11-07T05:30:14Z",
      "title": "The Supreme Court seems likely to preserve a gun law that protects domestic violence victims",
      "url": "https://apnews.com/b86948dc6103573898c3757b998a0a6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f75123144dec4f9194d45e5eede8ec8a/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE and KENYA HUNTER",
      "description": "NEW YORK (AP) — Alarmed by yet another jump in syphilis cases in newborns, U.S. health officials are calling for stepped-up prevention measures, including encouraging millions of women of childbearing age and their partners to get tested for the sexually transmitted disease.",
      "publishedAt": "2023-11-07T18:01:44Z",
      "title": "Syphilis cases in US newborns skyrocketed in 2022. Health officials suggest more testing",
      "url": "https://apnews.com/25df6e6352508fce37fb20ac10770124",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4d815aab71747e5b15168a1b95b3582/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}