{
  "articles": [
    {
      "author": "SEUNG MIN KIM, ZEKE MILLER, LISA MASCARO and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden opened his highly anticipated press conference Thursday with a forceful defense of his foreign and domestic policies, and batted away questions about his ability to serve another four years even as he flubbed a reference to Donald Trump in one of his first answers.",
      "publishedAt": "2024-07-11T15:42:43Z",
      "title": "Biden forcefully declares he's staying in reelection race in major news conference",
      "url": "https://apnews.com/9e1781a17b3313f525ef70f8a00c310a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd1d89ec17784e60b207f45c0ce8348c/1920.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI, ISABELLA VOLMERT, MARC LEVY and JONATHAN J. COOPER",
      "description": "SAGINAW, Mich. (AP) — Considering her choices in this year’s rapidly approaching presidential election, Rochelle Jones thinks both major party candidates should step aside.",
      "publishedAt": "2024-07-11T04:12:25Z",
      "title": "Biden says pressure on him is driven by elites. Voters paint a more complicated picture",
      "url": "https://apnews.com/c694cae7a3d6a7ce688b4a49d1fbcc82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a591543cd982454880c8689962a3e2e4/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump’s lawyers are imploring a New York judge to overturn his hush money conviction and dismiss the case, arguing his historic trial was “tainted” by evidence that shouldn't have been allowed because of the Supreme Court’s recent presidential immunity ruling.",
      "publishedAt": "2024-07-11T22:05:11Z",
      "title": "Trump lawyers press judge to overturn hush money conviction after Supreme Court immunity ruling",
      "url": "https://apnews.com/b67bafcb92b287933c6e6d54fc122117",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccca6ce14ad54004850f464483f5ff64/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — The Israeli military on Thursday acknowledged a string of errors in its response to the deadly Hamas attacks last Oct. 7, including slow response times and disorganization, as it released the results of its first investigation into failures during the assault that triggered the war in Gaza.",
      "publishedAt": "2024-07-11T16:04:56Z",
      "title": "Israeli army acknowledges Oct. 7 failures, including slow response times and disorganization",
      "url": "https://apnews.com/91c9b7e565cd13aaf921938f0f425a6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f85816a0ddbe4ae2887ca840c4fd3037/3000.jpeg"
    },
    {
      "author": null,
      "description": "SHIJAIYAH, Gaza Strip (AP) — Palestinians returned to breathtaking scenes of destruction in the Gaza City district of Shijaiyah after Israeli troops withdrew, ending a two-week offensive there. Civil defense workers said Thursday that so far, they had found the bodies of 60 people in the rubble.",
      "publishedAt": "2024-07-11T22:24:40Z",
      "title": "'We have nothing': Palestinians return to utter destruction in Gaza City after Israeli withdrawal",
      "url": "https://apnews.com/6bd730f8c5638e3f1981b91a7b8ab32c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9a63b4f195f482e898ff21a5a1f7ac9/1763.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy on Thursday embraced the support of allies who have provided substantial new military aid and a path to joining NATO, even as he emphatically pushed for the help to arrive faster and for restrictions to be lifted on the use of U.S.",
      "publishedAt": "2024-07-11T14:10:43Z",
      "title": "Zelenskyy says to win the war, US needs to lift limits on striking military targets inside Russia",
      "url": "https://apnews.com/66656f03cd5e203d4074bdb2ead8abd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/529ad3cace2046eab6692620503192ac/1920.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — Alec Baldwin 's defense attorney questioned a crime scene technician over what he suggested were shoddy and subpar searches for the live ammunition that ended up in the actor's revolver and killed cinematographer Halyna Hutchins.",
      "publishedAt": "2024-07-11T04:02:53Z",
      "title": "Alec Baldwin's lawyer grills crime scene tech over search for live ammo at his shooting trial",
      "url": "https://apnews.com/86e4265a0c4d8e130b02a1289ae99520",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62a517d6fd3e45b9b64698b1593caf72/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN",
      "description": "MIAMI (AP) — The Biden administration on Thursday sanctioned a Venezuelan gang allegedly behind a spree of kidnappings, extortion and other violent crimes tied to migrants that have spread across Latin America and the United States.",
      "publishedAt": "2024-07-11T16:16:31Z",
      "title": "US sanctions a Venezuela gang for spreading criminal activity across Latin America",
      "url": "https://apnews.com/f742f6966d160ee80b703ed419dfdac3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3044cd811814d878c77661c68015c08/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "The federal government announced a $241.5 million settlement with Marathon Oil on Thursday for alleged air quality violations at the company's oil and gas operations on the Fort Berthold Indian Reservation in North Dakota.",
      "publishedAt": "2024-07-11T17:47:17Z",
      "title": "Marathon Oil reaches $241 million settlement with EPA for environmental violations in North Dakota",
      "url": "https://apnews.com/9ddb9e71588064587bbe26d014afe4d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9a3601c9cbf43f28f3db4ec406b0288/1024.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "NORTH CHARLESTON, S.C. (AP) — Shalom Korai never knew his real name or his birthday. He was saved from the streets of a burning Warsaw neighborhood while he was a toddler during World War II, when the rest of his family was killed by Nazis in Poland.",
      "publishedAt": "2024-07-11T16:47:12Z",
      "title": "He was orphaned in the Holocaust and never met any family. Now he has cousins, thanks to DNA tests",
      "url": "https://apnews.com/7b00af200ff75b745b25396e14f98f8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9b20210627e46009150ce77a67935e7/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}