{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — Gunman in the Trump shooting searched for Trump and Biden events but saw July rally as 'target of opportunity,' FBI says.",
      "publishedAt": "2024-08-28T17:42:20Z",
      "title": "Gunman in the Trump shooting searched for Trump and Biden events but saw July rally as 'target of opportunity,' FBI says",
      "url": "https://apnews.com/cc7a1b6cf5a68753497ff539eb81e35f",
      "urlToImage": ""
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The gunman in the assassination attempt of former President Donald Trump searched online for events of both Trump and President Joe Biden and saw the Pennsylvania campaign rally where he opened fire last month as a “target of opportunity,” a senior FBI official said Wednesday.",
      "publishedAt": "2024-08-28T17:46:59Z",
      "title": "Gunman in Trump assassination attempt saw rally as 'target of opportunity,' FBI official says",
      "url": "https://apnews.com/919bc3a7bba02f6e340fed321b20dfdd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32954b9652824e92be3df95815165df8/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Special counsel Jack Smith is pressing forward with his 2020 election inference case against Donald Trump, with a new indictment that aims to salvage the prosecution after the Supreme Court slammed the door on the possibility of a trial before the November election.",
      "publishedAt": "2024-08-28T17:07:59Z",
      "title": "What a new indictment means for Donald Trump's federal 2020 election interference case",
      "url": "https://apnews.com/b2a490d6c4faa2ee188f8b6749cfd0c0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4bb6956d37b64f10be63ef5a90446865/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and NASSER NASSER",
      "description": "AL-FARAA REFUGEE CAMP, West Bank (AP) — Israeli forces launched a large operation in the occupied West Bank overnight and into Wednesday, killing at least 10 Hamas militants, carrying out arrests and sealing off the volatile city of Jenin.",
      "publishedAt": "2024-08-28T06:03:07Z",
      "title": "Israeli forces launch a big operation in the West Bank and kill at least 10 militants",
      "url": "https://apnews.com/41d98ed3cda2ba4a783913b06fbdc7d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90a2d799a59243efa018898127f12657/1920.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — As Vice President Kamala Harris begins her fall campaign for the White House, she can look to history and hope for better luck than others in her position who have tried the same.",
      "publishedAt": "2024-08-28T04:04:18Z",
      "title": "Kamala Harris' election would defy history. Just 1 sitting VP has been elected president since 1836",
      "url": "https://apnews.com/defc726ac5a8db8ef0ba9a756fd8eec5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d443b214a11746beb474a9fdf6774195/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and JORGE RUEDA",
      "description": "CARACAS, Venezuela (AP) — Opponents of Venezuelan President Nicolás Maduro took to the streets Wednesday in an attempt to revive protests against him as he tightens his grip on power following last month's disputed election.",
      "publishedAt": "2024-08-28T16:10:14Z",
      "title": "Maduro opponents take to streets to revive protests disputing Venezuelan election results",
      "url": "https://apnews.com/3a3dc0501297ba0e658a30bd022fc2a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4339370fcb14aa3b36929fface6c8fa/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Over more than a decade, the founder and CEO of the messaging app Telegram has amassed various different citizenships, something that's only added to the mystery surrounding his detention in France.",
      "publishedAt": "2024-08-28T16:34:43Z",
      "title": "Telegram founder Pavel Durov's various citizenships add to the mystery of his detention",
      "url": "https://apnews.com/ce3b260f1366fe0f4480313f1e1d2c0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04299a9b17bc4afab1283d3e8eb18edc/1058.jpeg"
    },
    {
      "author": null,
      "description": "ROYAL OAK, Mich. (AP) — Crews for two of Michigan's largest utilities were working to restore power Wednesday to more than 300,000 homes and businesses left in the dark amid hot, muggy conditions after severe storms toppled trees and snapped power poles.",
      "publishedAt": "2024-08-28T15:21:30Z",
      "title": "Crews work to restore power to more than 300,000 Michigan homes, businesses after storms",
      "url": "https://apnews.com/9627011725c8cdb8dcd316f26278835a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4177a4f8dc64b5990393a1f6a668790/3000.jpeg"
    },
    {
      "author": "SARAH PARVINI",
      "description": "LOS ANGELES (AP) — Nvidia has led the artificial intelligence boom to become one of the stock market’s biggest companies, as tech giants continue to spend heavily on the company's chips and data centers needed to train and operate their AI systems.",
      "publishedAt": "2024-08-28T04:01:56Z",
      "title": "All eyes are on Nvidia as it prepares to report its earnings. Here's what to expect",
      "url": "https://apnews.com/464d35670b6e91a698751ec7ee157532",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4808e3651e0430e98fa47ccbb9259d9/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — When Jennifer Kent’s “The Babadook” opened in theaters a decade ago, it played at two cinemas. When it returns to theaters next month, it will be in 500.",
      "publishedAt": "2024-08-28T17:35:13Z",
      "title": "What's hot in theaters? Old movies — and some that aren't so old",
      "url": "https://apnews.com/5a19361bd73c0cad57749304cc72c4c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/541a99b9fdbf4e2081e51c59bb3c5c8e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}