{
  "articles": [
    {
      "author": "STEPHEN SMITH, KATE PAYNE and HEATHER HOLLINGSWORTH",
      "description": "CRAWFORDVILLE, Fla. (AP) — Authorities rescued people trapped by floodwaters and more than 3 million customers were in the dark across much of the southeastern U.S. as Hurricane Helene weakened to a tropical storm over Georgia early Friday after making landfall overnight in northwestern Florida as a Category 4 storm.",
      "publishedAt": "2024-09-27T05:27:23Z",
      "title": "Helene lashes the South with wind and flood rains after coming ashore as a Category 4 storm",
      "url": "https://apnews.com/e5769b56dea81e40fae2161ad1b4e75d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc1fa9e5b61e4fb99e4ea663a9ae4335/1920.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and ZEINA KARAM",
      "description": "When she first heard about the evacuation warnings Israel was sending to residents of Lebanon, Aline Naser’s thoughts immediately turned to Gaza.For the past year, the 26-year-old Beirut resident has been following with horror the reports about besieged Palestinians in the Gaza Strip ordered to move from one place to the other, fleeing to “humanitarian zones” only to be bombed and ordered to leave again.",
      "publishedAt": "2024-09-27T04:29:38Z",
      "title": "Lebanon fears Gaza-like carnage as Israel ramps up airstrikes across the country",
      "url": "https://apnews.com/ca37a9b6314d327f8719a4f513e81233",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03d82f719f854a279085d286372ba224/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel and Hezbollah each have strong incentives to heed international calls for a cease-fire that could avert all-out war — but that doesn't mean they will.",
      "publishedAt": "2024-09-26T16:53:54Z",
      "title": "What obstacles stand in the way of an Israel-Hezbollah cease-fire?",
      "url": "https://apnews.com/71b59e0db03f0014ce06d4aa21bc2907",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cfdac1edb2f47b6b46d31cfb86b6d65/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — New York City's embattled and indicted mayor, Eric Adams, could make his initial court appearance Friday on charges that he accepted illegal campaign contributions and free overseas trips from people looking to buy his influence in city government.",
      "publishedAt": "2024-09-27T04:04:16Z",
      "title": "Indicted New York City mayor could appear before a judge Friday",
      "url": "https://apnews.com/f384ecdbf6a7b6664bd898e7ebce6e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b651ecc71cb8449e86eec6ad13f65184/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and JONATHAN J. COOPER",
      "description": "PHOENIX (AP) — Vice President Kamala Harris on Friday will make her first visit to the U.S.-Mexico border since becoming the Democratic presidential nominee to confront head-on one of her biggest vulnerabilities ahead of the November election.",
      "publishedAt": "2024-09-27T09:05:03Z",
      "title": "Harris heads to the US-Mexico border to face down criticism of her record",
      "url": "https://apnews.com/4a87c6f3b2df1736aa226bc620f51b89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01812b5b07894b728837f57cfd96879d/3000.jpeg"
    },
    {
      "author": "LORNE COOK",
      "description": "BRUSSELS (AP) — As the war in Ukraine enters a critical period, the European Union has decided that it must take responsibility for what it sees as an existential threat to security in its own neighborhood and is preparing to tackle some of the financial burden, perhaps even without the United States.",
      "publishedAt": "2024-09-27T06:20:48Z",
      "title": "As the Ukraine war enters a critical period, the EU moves ahead without the US",
      "url": "https://apnews.com/d9ed4389497b4f88647d488fdd7531e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba7a120552ff48ad912b29ae6509528b/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, ADRIANA GOMEZ LICON and LISA MASCARO",
      "description": "NEW YORK (AP) — Donald Trump is set to meet with Ukrainian President Volodymyr Zelenskyy as public tensions have been rising between the two over Ukraine's defense against Russia's invasion.",
      "publishedAt": "2024-09-27T04:05:15Z",
      "title": "Trump and Zelenskyy will meet as tensions rise over US backing for Ukraine",
      "url": "https://apnews.com/7c163eb5068c5003b219b6d524436517",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e60f8344f10743679f709da604f2f462/3000.jpeg"
    },
    {
      "author": "DAVID CRARY and HOLLY MEYER",
      "description": "Former President Donald Trump recently reissued his loyalty test to religious Americans, declaring that he can best protect their freedoms while preemptively blaming members of certain faiths should he lose the presidential election in November.",
      "publishedAt": "2024-09-27T04:03:28Z",
      "title": "Jews and Catholics warn against Trump's latest loyalty test for religious voters",
      "url": "https://apnews.com/c6b2c15a6019583b8afae4d496480469",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88d8ba45b85643c9acf0361bad407d18/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and RAF CASERT",
      "description": "BRUSSELS (AP) — Belgium’s prime minister on Friday blasted Pope Francis for the Catholic Church’s horrific legacy of clerical sex abuse and cover-ups in his country, demanding “concrete steps” to come clean with the past and put victims’ interests first.",
      "publishedAt": "2024-09-27T08:36:37Z",
      "title": "Belgian PM and king blast Pope Francis for church's sex abuse cover-up legacy in blistering welcome",
      "url": "https://apnews.com/cc729630469787d87e35d537d54e47e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bdcdd62e9fa546eb8f152145cafdc0ed/3000.jpeg"
    },
    {
      "author": "TOM CANAVAN",
      "description": "EAST RUTHERFORD, N.J. (AP) — There was a sense of relief in a somewhat subdued Dallas Cowboys locker room after a hard-fought victory over the New York Giants. There was little celebration.What was important Thursday night were the numbers on the scoreboard at MetLife Stadium.",
      "publishedAt": "2024-09-27T03:39:43Z",
      "title": "Dak Prescott throws 2 TD passes and Cowboys win 7th straight over Giants, 20-15",
      "url": "https://apnews.com/61388ad930aadb23a8e769027cf625b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f891dad2d56844a09d3dab9c4f8143ee/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}