{
  "articles": [
    {
      "author": "MICHELLE L. PRICE, JILL COLVIN, ZEKE MILLER and MATTHEW DALY",
      "description": "NEW YORK (AP) — President-elect Donald Trump on Monday named former New York congressman Lee Zeldin to lead the Environmental Protection Agency as he continues to build out his future administration with loyal supporters.",
      "publishedAt": "2024-11-11T16:25:43Z",
      "title": "Trump names former Rep. Lee Zeldin to lead EPA, adviser Stephen Miller to be deputy chief of policy",
      "url": "https://apnews.com/9cc6ad3118779b23bff88022ca5e2260",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8bedf847b4340dfbcb5578197c7d91a/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Control over the U.S. House of Representatives still hangs in the balance, teetering between a Republican or Democratic majority with fewer than 20 races left to be called.",
      "publishedAt": "2024-11-11T13:58:12Z",
      "title": "The Latest: Fewer than 20 races to be called as control of Congress hangs in the balance",
      "url": "https://apnews.com/19cddf27f405088edf67d802cbd5b08c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9313367711d4ce49b516cb4ca0ba59f/3000.jpeg"
    },
    {
      "author": "DAN MERICA",
      "description": "WASHINGTON (AP) — Elon Musk's super PAC spent around $200 million to help elect Donald Trump, according to a person familiar with the group's spending, funding an effort that set a new standard for how billionaires can influence elections.",
      "publishedAt": "2024-11-11T22:59:24Z",
      "title": "Elon Musk's PAC spent an estimated $200 million to help elect Trump, AP source says",
      "url": "https://apnews.com/d248547966bf9c6daf6f5d332bc4be66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cea7ac7f3eae45719e7e042a6aef9be1/3000.jpeg"
    },
    {
      "author": "EVENS SANON and MEGAN JANETSKY",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haiti’s international airport shut down on Monday after gangs opened fire at a commercial flight landing in Port-Au-Prince, prompting some airlines to temporarily suspend operations as the country swore in a new interim prime minister who promised to restore peace.",
      "publishedAt": "2024-11-11T19:30:56Z",
      "title": "Haiti’s main airport shuts down as gang violence surges and a new prime minister is sworn in",
      "url": "https://apnews.com/5a8a96a179f26fb6cde1265483e5f4b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aabf148000e64819a87209887149f25c/1920.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — New Zealand's Prime Minister Christopher Luxon made a “formal and unreserved” apology in Parliament on Tuesday for the widespread abuse, torture and neglect of hundreds of thousands of children and vulnerable adults in care.",
      "publishedAt": "2024-11-11T22:52:28Z",
      "title": "New Zealand's leader formally apologizes to survivors of abuse in state and church care",
      "url": "https://apnews.com/294b014a126cb8c067e1da16a94f4cc7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51e58462f857445f9adbc76001b38e16/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Japanese Prime Minister Shigeru Ishiba, battered in parliamentary elections last month, has survived a rare runoff vote against the opposition to remain the country's leader but he still faces turmoil ahead.",
      "publishedAt": "2024-11-12T01:09:01Z",
      "title": "Ishiba survived a rare runoff to remain Japan's prime minister but will face turmoil",
      "url": "https://apnews.com/f43d8609e64d42588db7b2b090c54c0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59440a126c444ebca49ba98afcc0c850/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Israel has begun a construction project along the so-called Alpha Line that separates the Israeli-occupied Golan Heights from Syria, apparently laying asphalt for a road right along the frontier, satellite photos analyzed by The Associated Press show.",
      "publishedAt": "2024-11-11T16:04:13Z",
      "title": "Israel's military is building along UN-patrolled demilitarized zone in Syria, satellite images show",
      "url": "https://apnews.com/6f1bf012a39f721ab36f33f1c6bea2b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39edb343d49a4fffba22058aa8ebafe1/2891.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE, Netherlands (AP) — Dozens of people armed with sticks and firecrackers set a tram on fire in Amsterdam on Monday, police said, while the city is facing tensions following violence last week targeting fans of an Israeli soccer club.",
      "publishedAt": "2024-11-11T20:45:20Z",
      "title": "Dutch tram set on fire while tensions are high after violence targeting Israeli fans",
      "url": "https://apnews.com/20c8af43b8a72fa6bd9bab938ce7bd89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12bdf2fe52b94d4d87de78c82799c558/2574.jpeg"
    },
    {
      "author": "SAFIYAH RIDDLE",
      "description": "TUSKEGEE, Ala. (AP) — Tuskegee University student Sid Guynn hid under a car when he heard the gunshots that ripped across his Alabama campus amid homecoming celebrations, then ran back to his dorm, frightened by what sounded to him like a machine gun.",
      "publishedAt": "2024-11-11T15:19:12Z",
      "title": "Gunshots at Tuskegee University sent terrified students running for their lives",
      "url": "https://apnews.com/5ee5c448135a2b8ab53ecfb86f535532",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83ae4f0ce23c4a88ba1fae7a047c6785/1920.jpeg"
    },
    {
      "author": "SUSAN HAIGH",
      "description": "With a record 99 Grammy nominations and acclaim as one of the most influential artists in music history, pop superstar Beyoncé and her expansive cultural legacy will be the subject of a new course at Yale University next year.",
      "publishedAt": "2024-11-12T00:01:16Z",
      "title": "Queen Bey and Yale: The Ivy League university is set to offer a course on Beyoncé and her legacy",
      "url": "https://apnews.com/60ed2a72ea8975b95586119337607f9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8fb344a0542548e892bac90177a87d77/2438.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}