{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and CARA ANNA",
      "description": "RAFAH, Gaza Strip (AP) — Israel’s neighbors and key mediators warned Saturday of disaster and repercussions if its military launches a ground invasion in Gaza’s southern city of Rafah, where Israel says remaining Hamas strongholds are located — along with over half the besieged territory’s population.",
      "publishedAt": "2024-02-10T08:07:53Z",
      "title": "Gaza mediators and others warn Israel of disaster if it launches a ground invasion on crowded Rafah",
      "url": "https://apnews.com/2d80dc890a5030757e2ae76684fa75da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba20060a35924b339f7bfbf6cb94a398/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "JERUSALEM (AP) — The sound of gunfire crackled over the phone as the teenage girl hid in the car and spoke. An Israeli tank was near the vehicle as she and her family were trying to heed Israel’s call to evacuate their home in Gaza.",
      "publishedAt": "2024-02-10T20:04:49Z",
      "title": "'They are shooting at us.' A fleeing Gaza family is killed along with the medics sent to find them",
      "url": "https://apnews.com/06f15b155f1de426e00f6a655554b2a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c386272bc5843cb9d15967e9d75f826/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden's Democratic allies are launching an aggressive defense against a special counsel's explosive claims that the 81-year-old president couldn't remember major milestones in his life, trying to diminish the significance of the prosecutor's allegations that Biden was too forgetful to be charged for mishandling classified material.",
      "publishedAt": "2024-02-10T05:02:09Z",
      "title": "How Biden and his allies are pushing back against a special counsel's claims about his memory",
      "url": "https://apnews.com/a54f03441e8145f9d6915858caaac37e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/174d01734c0b4b8084b83b33183f2e91/1920.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG",
      "description": "JACKSON, Miss. (AP) — Diversity initiatives would be defunded or banned from universities and other public institutions under a slate of bills pending in Republican-led legislatures, with some lawmakers counting on the issue resonating with voters in this election year.",
      "publishedAt": "2024-02-10T05:04:32Z",
      "title": "Republican lawmakers are backing dozens of bills targeting diversity efforts on campus and elsewhere",
      "url": "https://apnews.com/4d80ec7e9d372e74b129efc402ac0b76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a7c9194c08c4f30b4364ca683c867ba/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and ABDULRAHMAN ZEYAD",
      "description": "BEIRUT (AP) — An Israeli drone struck a car near Lebanon’s southern port city of Sidon on Saturday, killing at least two people and wounding two others, security officials said.The strike came as tensions across the Middle East grow with the Israel-Hamas war, a drone attack last month that killed three U.S.",
      "publishedAt": "2024-02-10T05:51:23Z",
      "title": "An Israeli drone strike in Lebanon kills 2 in one of the deepest hits inside the country in weeks",
      "url": "https://apnews.com/d98a6983e6187864b10afedd3a6b5a84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e0043a35a734895998dd6e5aaf0a384/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — Hungary’s conservative president resigned Saturday amid public outcry over a pardon she granted to a man convicted as an accomplice in a child sexual abuse case, a decision that unleashed an unprecedented political scandal for the long-serving nationalist government.",
      "publishedAt": "2024-02-10T16:40:03Z",
      "title": "Hungary's president resigns over a pardon to a man convicted in a child sexual abuse case",
      "url": "https://apnews.com/fde3223061df720b6af8b4b6fae8025a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f5a5abdf914e4e30b981a5b26ea3513b/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — A Russian drone strike on Kharkiv, Ukraine's second largest city, killed seven people overnight, including three children, Kharkiv region governor Oleh Syniehubov reported Saturday.",
      "publishedAt": "2024-02-10T08:16:17Z",
      "title": "Russian drone strike on Kharkiv, Ukraine's 2nd largest city, kills 7",
      "url": "https://apnews.com/b5181631189a7a0d069f8ae26848cdcf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aae2f144a5a3428c84012f7e8369cf2f/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, MEG KINNARD and JAMES POLLARD",
      "description": "CONWAY, S.C. (AP) — With two weeks to go before the South Carolina Republican primary, Nikki Haley is trying to challenge Donald Trump on her home turf while the former president tries to quash his last major rival for the nomination.",
      "publishedAt": "2024-02-10T17:31:42Z",
      "title": "Haley challenges Trump on her home turf in South Carolina as the Republican primary looms",
      "url": "https://apnews.com/edeb501801a773cad21935ff7a2ed237",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b00b99fe132e44b5a4e845d8ed828801/3000.jpeg"
    },
    {
      "author": "LEANNE ITALIE",
      "description": "NEW YORK (AP) — Elise Plessis hasn't been in a long-term relationship for 26 years. It's by choice, yet she still suffers FOMO when Valentine's Day rolls around.“I'm the singleton of the family and the friend group,” said the 53-year-old Plessis, who lives in Manitoba, Canada.",
      "publishedAt": "2024-02-10T06:12:51Z",
      "title": "Here's how to beat the hype and overcome loneliness on Valentine's Day",
      "url": "https://apnews.com/7e5521a1defc6f98b986c19033984a2e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3434ed2442aa4c578bd58a9015fa4db7/3000.jpeg"
    },
    {
      "author": "FOSTER KLUG",
      "description": "TOKYO (AP) — Will she make it in time? Intrepid flight trackers online seem to think so.On social media, fans of Taylor Swift and aviation journalists believe they've located Swift's private jet, labeled “The Football Era,” currently on its way to Los Angeles' LAX airport and expected to arrive around 3 p.m.",
      "publishedAt": "2024-02-10T09:09:03Z",
      "title": "Taylor Swift expected to make epic journey from Tokyo to the Super Bowl. Will she make it in time?",
      "url": "https://apnews.com/13248c81324a4da46df425f0e6a7654c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab54065b718d46d5b166ed783e6ee411/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}