{
  "articles": [
    {
      "author": "SYLVIE CORBET and GIADA ZAMPANO",
      "description": "PARIS (AP) — Crowds were participating in pro-Palestinian and pro-Israeli protests and memorial events across Europe, North Africa and Asia on Sunday on the eve of the first anniversary of the Hamas attack on Israel.",
      "publishedAt": "2024-10-06T13:56:23Z",
      "title": "Pro-Palestinian and pro-Israeli crowds rally across the world on the eve of Oct. 7 anniversary",
      "url": "https://apnews.com/d1e8c03e14c28c64afa3fffe086c3e8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e332442d51a34d24a59c4e30dc0e5aec/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "Israel launched a new air and ground offensive in northern Gaza Sunday, hours after pounding Beirut’s southern suburbs in the heaviest bombardment since it stepped up its pursuit of the Hezbollah militant group last month.",
      "publishedAt": "2024-10-01T12:10:40Z",
      "title": "What to know about fighting in Lebanon and Gaza",
      "url": "https://apnews.com/c44358cb4c70db69bdab4b254cb2ed76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1119f132eeb4e08a6d496032b763358/3000.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "FRANKFORT, Ky. (AP) — The death toll from Hurricane Helene inched up to 227 on Saturday as the grim task of recovering bodies continued more than a week after the monster storm ravaged the Southeast and killed people in six states.",
      "publishedAt": "2024-10-05T23:27:31Z",
      "title": "Death toll from Hurricane Helene rises to 227 as grim task of recovering bodies continues",
      "url": "https://apnews.com/34d1226bb31f79dfb2ff6827e40587fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a19953ca7d234cf599ee63692f32223b/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The U.S. government’s top disaster relief official said Sunday that false claims and conspiracy theories about the federal response to Hurricane Helene — spread most prominently by Donald Trump — are “demoralizing” aid workers and creating fear in people who need recovery assistance.",
      "publishedAt": "2024-10-06T19:35:29Z",
      "title": "US disaster relief chief blasts false claims about Helene response as a 'truly dangerous narrative'",
      "url": "https://apnews.com/07d5b1f6968cb2af11b63357186a1a15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c30f1f683583477099282ddd52d0b85d/3000.jpeg"
    },
    {
      "author": "FREIDA FRISARO",
      "description": "FORT LAUDERDALE, Fla. (AP) — Hurricane Milton quickly intensified Sunday and is on track to become a major hurricane with the Tampa Bay area in its sights, putting Florida on edge and triggering evacuation orders along a coast still reeling from Helene’s devastation.",
      "publishedAt": "2024-10-06T13:29:42Z",
      "title": "Hurricane Milton is growing stronger as it blows toward Florida's Tampa Bay region",
      "url": "https://apnews.com/fe1a0232599542fffeb080e5d3a3683e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b1e28592fff45e392945c1ab89977ba/2067.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris opened a media blitz by the Democratic ticket on Sunday by appearing on the popular “Call Her Daddy” podcast about abortion, sexual abuse and other issues that resonate with women, working in some digs at her GOP opponent along the way.",
      "publishedAt": "2024-10-06T16:02:24Z",
      "title": "Harris talks abortion and more on 'Call Her Daddy' podcast as Democratic ticket steps up interviews",
      "url": "https://apnews.com/83325184cd7f93ca505df590f7a27ede",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ec147ca43d04271987f45c93788b25d/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER and ADRIANA GOMEZ LICON",
      "description": "JUNEAU, Wis. (AP) — Donald Trump on Sunday visited Wisconsin for the fourth time in eight days as his campaign showers attention on a pivotal state where Republicans fret about his ability to match Democrats’ enthusiasm and turnout machine.",
      "publishedAt": "2024-10-06T12:48:19Z",
      "title": "How important is Wisconsin? Trump's now visited 4 times in 8 days",
      "url": "https://apnews.com/b22c2042c9e68115c3de71794dc9c985",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4ec8835829d4f28ad945fc82d9b7143/3000.jpeg"
    },
    {
      "author": "PIERRE-RICHARD LUXAMA and ELÉONORE HUGHES",
      "description": "SAINT-MARC, Haiti (AP) — Nearly 6,300 people have fled their homes in the aftermath of an attack in central Haiti by heavily armed gang members that killed at least 70 people, according to the U.N.’s migration agency.",
      "publishedAt": "2024-10-06T19:26:11Z",
      "title": "Over 6,000 people in Haiti leave their homes after gang attack killed dozens",
      "url": "https://apnews.com/d45cbcbe3258523291d3b36bbd4f30f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f249a6b61034cbc9ca8d3491a7e6856/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis named 21 new cardinals Sunday, significantly increasing the size of the College of Cardinals and further cementing his mark on the group of prelates who will one day elect his successor.",
      "publishedAt": "2024-10-06T10:55:41Z",
      "title": "Pope names 21 new cardinals, significantly increasing the pool who will one day elect his successor",
      "url": "https://apnews.com/e660bbfbc60d0cc2a298db6f444b99bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dcd941d44464742bf788f6e37716251/3000.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE",
      "description": "Women make up roughly half of U.S. labor union membership, but representation in top level union leadership positions has lagged, even in female-dominated industries and particularly for women of color.",
      "publishedAt": "2024-10-06T12:00:33Z",
      "title": "More Black and Latina women are leading unions - and transforming how they work",
      "url": "https://apnews.com/0c186ea63ae8eebeaadb15e131b77a61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f38ab16c22344e48c809072aaf32e50/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}