{
  "articles": [
    {
      "author": "ADRIANA MORGA",
      "description": "NEW YORK (AP) — If you’re heading to college or starting to think about where you’d like to apply, you’re probably considering options for funding your education. If you need to borrow money to pursue your dreams, you are far from alone.",
      "publishedAt": "2023-08-15T16:30:30Z",
      "title": "Going to college? Here's what you should know about student loans",
      "url": "https://apnews.com/9fc6189536b11d2df0dfa37dddd04b0c",
      "urlToImage": ""
    },
    {
      "author": "KATE BRUMBACK and ERIC TUCKER",
      "description": "ATLANTA (AP) — Donald Trump and 18 allies were indicted in Georgia on Monday over their efforts to overturn his 2020 election loss in the state, with prosecutors using a statute normally associated with mobsters to accuse the former president, lawyers and other aides of a “criminal enterprise” to keep him in power.",
      "publishedAt": "2023-08-14T16:23:05Z",
      "title": "Trump and 18 allies charged in Georgia election meddling as former president faces 4th criminal case",
      "url": "https://apnews.com/d39562cedfc60d64948708de1b011ed3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7baad1574bfd44a58e432693f48b8667/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "ATLANTA (AP) — A day after the Jan. 6, 2021, attack on the U.S. Capitol, as the country was still reeling from the violent attempt to halt the transfer of presidential power, a local Republican Party official greeted a group of computer experts outside the election office in a rural county in south Georgia, where they were given access to voting equipment.",
      "publishedAt": "2023-08-15T19:03:41Z",
      "title": "Georgia election indictment highlights wider attempts to illegally access voting equipment",
      "url": "https://apnews.com/bc3db57cabd25fd8e335f85ed299e79c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2dd7a2ca32724c61919556b07f45b938/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — He says he won't sign the pledge required to participate, but former President Donald Trump's Republican rivals are actively preparing as if he will be onstage for the GOP's first 2024 presidential debate next week.",
      "publishedAt": "2023-08-15T14:21:02Z",
      "title": "Will Donald Trump show up at next week's presidential debate? GOP rivals are preparing for it",
      "url": "https://apnews.com/d3192137ee265d8455ff8af64a5f88ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f64539fcbc244881a8adb34d22abe724/3000.jpeg"
    },
    {
      "author": "CURT ANDERSON and ALANNA DURKIN RICHER",
      "description": "FORT PIERCE, Fla. (AP) — Mar-a-Lago property manager Carlos De Oliveira pleaded not guilty on Tuesday to scheming with Donald Trump to try to delete security footage sought by investigators probing the former president's hoarding of classified documents.",
      "publishedAt": "2023-08-15T04:04:56Z",
      "title": "Mar-a-Lago property manager pleads not guilty to charges in Trump's classified documents case",
      "url": "https://apnews.com/f0e81601408fcc80c2577a03aa6cb889",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2126a2588904d019581c5725c355bd3/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A legal showdown over the derailed plea deal for Hunter Biden continued Tuesday as prosecutors asserted that an agreement on a gun charge is dead along with the rest of the deal as the case makes a major shift into a special counsel investigation.",
      "publishedAt": "2023-08-15T19:04:09Z",
      "title": "Prosecutors in the Hunter Biden case deny defense push to keep gun charge agreement in place",
      "url": "https://apnews.com/de3702ea46e9f544e69d6fd2e694dce8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0acd81aedc754c7592c2b3bfe3f16ab8/2344.jpeg"
    },
    {
      "author": "ILAN BEN ZION",
      "description": "TEL MEGIDDO, Israel (AP) — An ancient Christian mosaic bearing an early reference to Jesus as God is at the center of a controversy that has riled archaeologists: Should the centuries-old decorated floor, which is near what's believed to be the site of the prophesied Armageddon, be uprooted and loaned to a U.S.",
      "publishedAt": "2023-08-15T06:10:24Z",
      "title": "Israel may uproot ancient Christian mosaic near Armageddon. Where it could go next sparks outcry",
      "url": "https://apnews.com/2b3a1806e238e995d51d11a8acbf2935",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ecb4a5db59b49a09c6747be92619b7c/3000.jpeg"
    },
    {
      "author": "JEFF McMILLAN and HANNAH SCHOENBAUM",
      "description": "States that declared themselves refuges for transgender people have essentially issued an invitation: Get your gender-affirming health care here without fearing prosecution at home.",
      "publishedAt": "2023-08-15T05:01:44Z",
      "title": "States that protect transgender health care now try to absorb demand",
      "url": "https://apnews.com/630f0a8ff873c33b7258cf0c3f6a2859",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c6cbd342aeb4ce686ba8baa82aa97f3/3000.jpeg"
    },
    {
      "author": "BEN FINLEY and DENISE LAVOIE",
      "description": "NEWPORT NEWS, Va. (AP) — The mother of a 6-year-old boy who shot his teacher in Virginia pleaded guilty Tuesday to a charge of felony child neglect, seven months after her son used her handgun to critically wound the educator in a classroom full of students.",
      "publishedAt": "2023-08-15T05:08:46Z",
      "title": "Mother pleads guilty to felony child neglect after 6-year-old son used her gun to shoot teacher",
      "url": "https://apnews.com/81d52f6bf35512c5684acb93baa8700b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f82e26b216a4ca6ae655ab0778426cd/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA and DAVID McHUGH",
      "description": "TALLINN, Estonia (AP) — Russia’s central bank made a big interest rate hike Tuesday, an emergency move designed to fight inflation and strengthen the ruble after the country's currency reached its lowest value since early in the war with Ukraine.",
      "publishedAt": "2023-08-15T07:35:09Z",
      "title": "Russia's central bank makes huge interest rate hike to try to prop up falling ruble",
      "url": "https://apnews.com/a680b840eaae767471180e2dca34fc86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bcdab6a83fc749c5b6909de7cc8f395b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}