{
  "articles": [
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Tentative deal reached to end the Hollywood writers strike. No deal yet for actors.",
      "publishedAt": "2023-09-25T02:19:36Z",
      "title": "Tentative deal reached to end the Hollywood writers strike. No deal yet for actors",
      "url": "https://apnews.com/c9a04dd456ca8d9d02144afb9309aab5",
      "urlToImage": ""
    },
    {
      "author": "LAURA UNGAR and JONATHAN MATTISE",
      "description": "Nearly a day after being downgraded from a tropical storm, Ophelia still threatened parts of the Northeast on Sunday with coastal flooding, life-threatening waves and heavy rain from Washington to New York City, the National Hurricane Center said.",
      "publishedAt": "2023-09-24T05:22:41Z",
      "title": "Weakening Ophelia still poses a risk of coastal flooding and heavy rain in some parts of the US",
      "url": "https://apnews.com/326b445a9ae54d03e9c1026528f15539",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a4d00dda3ba4290b5a18c54c46a02d9/2000.jpeg"
    },
    {
      "author": "ANGELA CHARLTON and DALATOU MAMANE",
      "description": "PARIS (AP) — President Emmanuel Macron announced Sunday that France will end its military presence in Niger and pull its ambassador out of the country as a result of the coup that removed the democratically elected president.",
      "publishedAt": "2023-09-24T18:43:24Z",
      "title": "President Macron says France will end its military presence in Niger, pull its ambassador after coup",
      "url": "https://apnews.com/0e866135cd49849ba4eb4426346bffd5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c9ee59e6cdc4a91b556fd16326d4863/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "NASA’s first asteroid samples fetched from deep space parachuted into the Utah desert Sunday to cap a seven-year journey.",
      "publishedAt": "2023-09-24T11:22:16Z",
      "title": "NASA's first asteroid samples land on Earth after release from spacecraft",
      "url": "https://apnews.com/9918c2c13b689e01800de4ea42d60188",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca0b4f6c4a0542518da422a3c24da5d4/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Working furiously to take control of a House in disarray, allies of Speaker Kevin McCarthy implored their Republican colleagues Saturday to drop their hardline tactics and work together to approve a conservative spending plan to prevent a federal shutdown.",
      "publishedAt": "2023-09-23T21:24:35Z",
      "title": "With House Republicans in turmoil, colleagues implore GOP holdouts not to shut down government",
      "url": "https://apnews.com/249d83636e9d61cdd2aabdf34a129514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f58ba0500e394a5d93caef0eb66ef7cf/3000.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "HONOLULU (AP) — From just outside the burn zone in Lahaina, Jes Claydon can see the ruins of the rental home where she lived for 13 years and raised three children. Little remains recognizable beyond the jars of sea glass that stood outside the front door.",
      "publishedAt": "2023-09-24T13:02:25Z",
      "title": "Residents prepare to return to sites of homes demolished in Lahaina wildfire 7 weeks ago",
      "url": "https://apnews.com/9de9c29fb633c9aaba618ad066af998c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43270ce9e2da433b9c259d08768edd14/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KRAMATORSK, Ukraine (AP) — Among the hundreds of trains criss-crossing Ukraine’s elaborate railway network every day, the Kyiv-Kramatorsk train stands apart, shrouded in solemn silence as passengers anticipate their destination.",
      "publishedAt": "2023-09-24T04:14:27Z",
      "title": "A Ukrainian train is a lifeline connecting the nation's capital with the front line",
      "url": "https://apnews.com/4e0547023d456e9f1a0c33372704cdf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27252625e34849f0be618821f14a570e/3000.jpeg"
    },
    {
      "author": "JULIE WATSON",
      "description": "The Afghan man speaks only Farsi, but he wasn't worried about representing himself in U.S. immigration court.",
      "publishedAt": "2023-09-24T14:07:56Z",
      "title": "He spoke no English, had no lawyer. An Afghan man's case offers a glimpse into US immigration court",
      "url": "https://apnews.com/cabf3bcdec9a62b12f08300d1260cd68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bcda8cd48d84b46b7dba60bccad5b40/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — Wildfires fueled by climate change have ravaged communities from Maui to the Mediterranean this summer, killing many people, exhausting firefighters and fueling demand for new solutions.",
      "publishedAt": "2023-09-24T07:08:24Z",
      "title": "The threat of wildfires is rising. So are new artificial intelligence solutions to fight them",
      "url": "https://apnews.com/62002360f2e3be32ccc7df020239efea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/672da93283644fea8ec881450554538e/3000.jpeg"
    },
    {
      "author": "RALPH D. RUSSO",
      "description": "Colorado and Deion Sanders fell out of The Associated Press college football poll on Sunday after a resounding loss in one of the weekend's showcase games, and the teams toward the top of the rankings were shuffled and tightened.",
      "publishedAt": "2023-09-24T18:05:45Z",
      "title": "AP Top 25: Colorado falls out of rankings after first loss and Ohio State moves up to No. 4",
      "url": "https://apnews.com/8e4bddbef2fee036725d6066c1ce0f09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4de510f29524442e906b0fd3fdae9ea3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}