{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and RAVI NESSMAN",
      "description": "RAFAH, Gaza Strip (AP) — Israeli warplanes struck targets across Gaza, two airports in Syria and a mosque in the occupied West Bank allegedly used by militants, as the 2-week-old war with Hamas threatened to spiral Sunday into a broader conflict.",
      "publishedAt": "2023-10-22T06:48:25Z",
      "title": "Israel strikes Gaza, Syria and West Bank as war against Hamas threatens to ignite other fronts",
      "url": "https://apnews.com/916edd66e3af095d49e5ba1c59d90c2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24933c6c9a244a0d872ff3a8bf89de4d/1920.jpeg"
    },
    {
      "author": "SYLVIE CORBET and JILL LAWLESS",
      "description": "LONDON (AP) — Thousands of people joined vigils in Berlin and London on Sunday to oppose antisemitism and support Israel, while in Paris and other cities, thousands of pro-Palestinian demonstrators demanded a cease-fire and relief for people in the besieged Gaza Strip.",
      "publishedAt": "2023-10-22T14:11:21Z",
      "title": "European cities see vigils to oppose antisemitism and rallies seeking relief for Gaza",
      "url": "https://apnews.com/7c23ec677d36df580d9a79144c56db95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fed3c964a6404daaba2ff9abec97e8d1/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Hezbollah announced the deaths of five more militants as clashes along the Lebanon-Israel border intensified and the Israeli prime minister warned Lebanon on Sunday not to let itself get dragged into a new war.",
      "publishedAt": "2023-10-22T15:49:26Z",
      "title": "Hezbollah and Israel exchange fire and warnings of a widened war",
      "url": "https://apnews.com/c279d38d6b67cac526ac95e63f9cca73",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c199e42b7dc4dce830d76d3b907e3b8/3000.jpeg"
    },
    {
      "author": "AMY TEIBEL",
      "description": "JERUSALEM (AP) — Deadly violence has been surging in the West Bank as the Israeli military pursues Palestinian militants in the aftermath of the Hamas attack from Gaza, with more than 90 Palestinians killed in the Israeli-occupied territory in the past two weeks, mainly in clashes with Israeli troops.",
      "publishedAt": "2023-10-22T09:05:36Z",
      "title": "Palestinian death toll in West Bank surges as Israel pursues militants following Hamas rampage",
      "url": "https://apnews.com/25b93d7eda4f2972360fe384d381bbff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/382456cfed2e44d98efef98f4d7779d9/3000.jpeg"
    },
    {
      "author": "PATRICK ORSAGOS",
      "description": "CIRCLEVILLE, Ohio (AP) — As Jadarrius Rose drove his 18-wheeler through rural Ohio, a simple missing mudflap caught the highway patrol’s eye. The trip ended with a police dog’s powerful jaws clamping down on Rose even as he tried to surrender.",
      "publishedAt": "2023-10-22T04:04:05Z",
      "title": "A police dog attacked a Black trucker on his knees. An Ohio city is dealing with the aftermath",
      "url": "https://apnews.com/4fd3d4806a71cca6f1667d8dbe58ded0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d268c5535ef40129b1ed87c01bf591f/3000.jpeg"
    },
    {
      "author": null,
      "description": "LA VERGNE, Tenn. (AP) — Police in Tennessee were searching Sunday for the estranged son of Nashville's police chief as the suspect in the shooting of two police officers outside a Dollar General store.",
      "publishedAt": "2023-10-22T07:14:35Z",
      "title": "Manhunt continues for Nashville police chief's son suspected in shooting of 2 Tennessee officers",
      "url": "https://apnews.com/db83dfaa27512b5ad084c3d8e5ae6c6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6c602ca680943dbb1b682eb1fc89f8a/2736.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "WILKES-BARRE, Pa. (AP) — The polls had just opened for last year’s midterms in Pennsylvania when the phones began ringing at the election office in Luzerne County.Polling places were running low on paper to print ballots.",
      "publishedAt": "2023-10-22T12:24:59Z",
      "title": "Turnover has plagued local election offices since 2020. One swing state county is trying to recover",
      "url": "https://apnews.com/8497130b5bbeae503d8f675e3b809d4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da8d40ede2774a33a2c91ff75472b659/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "MOSHCHUN, Ukraine (AP) — In the humble backyard of a destroyed house, a 13-year-old chops firewood to get ready for winter. His mother, Tetiana Yarema, has been preparing for months as she remembers last winter’s Russian strikes on the energy infrastructure that plunged Ukraine into darkness.",
      "publishedAt": "2023-10-22T04:06:30Z",
      "title": "Ukrainians prepare firewood and candles to brace for a winter of Russian strikes on the energy grid",
      "url": "https://apnews.com/4f8c111942f5a4883626db1afae8c35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e4ea4f518d94b809c38181321f276d0/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — A missile strike on a mail depot in the eastern city of Kharkiv killed six people, Ukrainian officials said Sunday, as Ukraine reported a record number of bomb attacks in the southern Kherson region.",
      "publishedAt": "2023-10-22T09:14:47Z",
      "title": "6 killed in Russian rocket strike on mail depot as Ukraine reports record bomb attack numbers",
      "url": "https://apnews.com/27c06116fd98988854a6b2bbacff380c",
      "urlToImage": ""
    },
    {
      "author": "DANIEL POLITI and DAVID BILLER",
      "description": "BUENOS AIRES, Argentina (AP) — Frustrated voters in Argentina weighed whether to hand the presidency to a right-wing populist who has shaken up the political system and pledges to drastically overhaul the state if he wins an election taking place Sunday.",
      "publishedAt": "2023-10-22T04:09:35Z",
      "title": "Mired in economic crisis, Argentines weigh whether to hand reins to anti-establishment populist",
      "url": "https://apnews.com/cead0d423f2e51444b48770af618940b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac175977c75142be8a936e6038e7671d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}