{
  "articles": [
    {
      "author": "Emilie Megnien, Jeff Amy, Jamie Stengle",
      "description": "More than 8,000 flights have been canceled across the U.S. as a major storm expected to wreak havoc across much of the country bears down. The storm threatens to knock out power for days and snarl major roadways. Roughly 140 million people were under a winter storm warning from New Mexico to New England. The National Weather Service forecast warns of widespread heavy snow and a band of catastrophic ice stretching from east Texas to North Carolina. The edge of the storm was sending freezing rain and sleet into parts of Texas on Friday night, while snow and sleet were falling in Oklahoma.",
      "publishedAt": "2026-01-24T06:17:53Z",
      "title": "Thousands of flights canceled as major winter storm bears down",
      "url": "https://apnews.com/article/storm-texas-oklahoma-ice-snow-a94c9d155615333a50e174a4d7d54fc1",
      "urlToImage": "https://dims.apnews.com/dims4/default/b4362d3/2147483647/strip/true/crop/3500x2332+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F47%2Fe5484277715eb31adddef4f80718%2Fbbcf605b274f4ee2bcb9973af1b70389"
    },
    {
      "author": null,
      "description": "Russian attacks on Ukraine killed one person and wounded 18 overnight, as negotiators from Ukraine, Russia and the United States were set to met in Abu Dhabi for a second day of talks aimed at ending Moscow’s nearly four-year invasion. One person died and four were wounded in Kyiv, while 14 were wounded in Kharkiv, Ukrainian officials said Saturday. The UAE-hosted talks mark the first known instance of Trump administration officials meeting with both countries. The White House called the first day productive. Ukrainian President Volodymyr Zelenskyy said a peace deal was “nearly ready,” though territorial disputes remain unresolved.",
      "publishedAt": "2026-01-24T07:21:21Z",
      "title": "Russian attacks on Ukraine kill 1 and wound 18 ahead of second day of peace talks",
      "url": "https://apnews.com/article/russia-ukraine-trump-putin-witkoff-kushner-zelenskyy-a77eadb50780c3d22882c42ea4764a54",
      "urlToImage": "https://dims.apnews.com/dims4/default/c25220f/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F6e%2F0ad818e2d97510ea6855f9045a71%2F2ba21e34cbda4dc1bd74c2f50feb413c"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Iran’s Revolutionary Guard commander warns the US, says his force has its ‘finger on the trigger’",
      "url": "https://apnews.com/article/iran-protests-trump-revolutionary-guard-059ba55b8e169d57f978fc3c52ccd05a",
      "urlToImage": null
    },
    {
      "author": null,
      "description": "Police say a suicide bomber detonated an explosive vest among guests at a wedding ceremony in northwestern Pakistan, killing at least seven people and wounding 25. The attack on Friday took place at the home of Noor Alam Mehsud, a pro-government elder, in Dera Ismail Khan, a district in Khyber Pakhtunkhwa province. No group immediately claimed responsibility. However, suspicion is likely to fall on the Pakistani Taliban, also known as Tehrik-e-Taliban Pakistan or TTP, who have carried out numerous attacks in the country in recent years. The group is separate from but allied with the Afghan Taliban.",
      "publishedAt": "2026-01-23T18:23:50Z",
      "title": "Suicide bomber kills 7 people at a wedding in Pakistan",
      "url": "https://apnews.com/article/pakistan-suicide-bombing-wedding-ceremony-northwest-4962ee33d1db9c08368c2a386356a579",
      "urlToImage": "https://dims.apnews.com/dims4/default/d00c77c/2147483647/strip/true/crop/2304x1535+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F72%2F077c2d9b35760acc8634202d2e5a%2F46caadab65ed449789921f0e8440e369"
    },
    {
      "author": "Patrick Whittle, Holly Ramer, Leah Willingham",
      "description": "Federal immigration officials say more than 100 people have been detained in Maine this week as part of an enforcement surge targeting what ICE calls “the worst of the worst.” But court records and legal filings reviewed by The Associated Press show the cases cited by the agency span a wide range of legal circumstances, including serious violent felony convictions, dismissed charges and unresolved immigration proceedings. ICE has released details on only a small number of arrests and provided limited information about the rest. State and local officials, attorneys and judges say the lack of context has made it difficult to assess who is being detained and why.",
      "publishedAt": "2026-01-24T05:26:44Z",
      "title": "Court filings shed light on Maine immigration arrests as ICE releases few details",
      "url": "https://apnews.com/article/maine-ice-immigration-d948bce8712d009b90e77175c7d5ded9",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae6596c/2147483647/strip/true/crop/4181x2786+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F3a%2Fda3ed39ba9e850b43f1cd5d2b28a%2F8070a72433a843bf8a6d8cf36c8b968e"
    },
    {
      "author": "Steve Karnowski",
      "description": "Federal immigration agents in Minnesota are accused of using a 5-year-old boy as \"bait\" to arrest his father. School officials claim agents told the boy to knock on a door to lure out his mother. The Department of Homeland Security denies this, calling it a \"horrific smear.\" The father and son are now at a family detention center in Texas. School officials say other adults offered to care for the boy, but agents refused. The family's lawyer is exploring legal options. The Trump administration's policy on detained parents states ICE should not take custody of children, but exceptions exist.",
      "publishedAt": "2026-01-24T01:36:13Z",
      "title": "Dueling narratives about ICE detaining a 5-year-old in Minnesota",
      "url": "https://apnews.com/article/ice-minnesota-immigration-enforcement-bait-child-470d9bbaf988454fa01837796e911d5f",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e96805/2147483647/strip/true/crop/1536x1023+0+41/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F6c%2F193a4103f7ee7d6419da6c99b451%2F8639462d3c80406883929c3a8c3628b1"
    },
    {
      "author": "Joseph Falzetta",
      "description": "After agreeing to accept deportees from the United States last year, South Sudan sent a list of requests to Washington that included American support for the prosecution of an opposition leader and sanctions relief for a senior official accused of diverting over a billion dollars in public funds. The requests are contained in a pair of diplomatic communications made public by the State Department last month. In the documents, the U.S. expresses “appreciation” to South Sudan for accepting the deportees and details the names, nationalities and crimes for which each individual was convicted. In July, South Sudan became the first African country to receive migrants deported from the U.S. Rwanda, Eswatini, Ghana and Equatorial Guinea have since received deportees.",
      "publishedAt": "2026-01-24T07:42:10Z",
      "title": "After accepting US deportees, South Sudan wanted sanctions relief for top official, documents show",
      "url": "https://apnews.com/article/south-sudan-us-migrants-10ac9844e775ad2a4f16132124558fd0",
      "urlToImage": "https://dims.apnews.com/dims4/default/0b58f51/2147483647/strip/true/crop/1898x1265+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F56%2F07a32df15f943a74478baa60ac00%2F5cab19b5f5f94d71a381db05dffe5de3"
    },
    {
      "author": "Konstantin Toropin, Courtney Bonnell",
      "description": "The Pentagon has released a National Defense Strategy that chastises U.S. allies to take control of their own security and reasserts the Trump administration’s focus on dominance in the Western Hemisphere over a longtime goal of countering China. The document released late Friday is highly political for a military blueprint, criticizing partners from Europe to Asia for relying on previous U.S. administrations to subsidize their defense. It calls for “a sharp shift — in approach, focus, and tone.” That translates to a blunt assessment that allies must take on more of the burden countering nations from Russia to North Korea. It caps off a week of animosity between President Donald Trump’s administration and traditional allies like Europe.",
      "publishedAt": "2026-01-24T01:48:02Z",
      "title": "Trump defense strategy charges allies to ensure their security",
      "url": "https://apnews.com/article/national-defense-strategy-hegseth-trump-china-greenland-08fdbe1f8e3f557d688f289fbf4a2c84",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae583b0/2147483647/strip/true/crop/3757x2503+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F33%2Fa6a85dd4dcfcc0e48ffd48163300%2F1c082dab8ec54fdc860f678767ec056f"
    },
    {
      "author": "Jon Gambrell",
      "description": "The scale of nationwide protests in Iran and the bloody crackdown that has followed is slowly coming into focus, even though authorities have cut off the country from the internet. Activists warn it shows Iran is engaging in the same tactics it has used for decades, just at an unprecedented scale. That includes firing down from rooftops on demonstrators, shooting birdshot into crowds and sending motorcycle-riding volunteer members of the paramilitary Revolutionary Guard in to beat and detain those who can’t escape. Meanwhile, a crackdown targeting protesters continues, with state media reporting dozens to hundreds of people detained daily.",
      "publishedAt": "2026-01-24T07:09:47Z",
      "title": "Scale of Iran protests and crackdown come into focus",
      "url": "https://apnews.com/article/iran-protests-nationwide-scale-us-trump-0eecd9962240600150530261dfab03f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/8aad2e2/2147483647/strip/true/crop/4926x3282+0+125/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F0f%2Fc8f18c79302fbb4764fa240f9d6c%2F3e4b0b1a3def4743b6a7156df6df879b"
    },
    {
      "author": "Rio Yamat, Ap Airlines, Travel Writer",
      "description": "Bad weather can derail even the best-laid travel plans. When that happens, U.S. airlines must provide refunds for canceled flights. If winter weather is expected, airlines might also allow you to postpone your trip without fees. If your flight is canceled, airlines usually rebook for free, but availability can be limited during peak times. You're entitled to a full refund if you choose not to travel or find a different way to get to your destination, but airlines aren’t required to cover lodging or meals for stranded passengers. Booking a backup flight if forecasts look bad is another option because some airlines offer full refunds as long as a passenger cancels within 24 hours of booking.",
      "publishedAt": "2026-01-24T07:49:33Z",
      "title": "What to do if winter weather disrupts your travel plans",
      "url": "https://apnews.com/article/flight-delays-cancellations-winter-weather-travel-eac0c8a540d5cb50ed4cff70eb49072e",
      "urlToImage": "https://dims.apnews.com/dims4/default/a38ad88/2147483647/strip/true/crop/3709x2471+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F3c%2F70068fb8559ab3cd13ef0063edd3%2F48e16d7d5d7c41cbb2e215f8c7345c47"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}