{
  "articles": [
    {
      "author": "Collin Binkley",
      "description": "On one side is Harvard, the nation’s oldest and wealthiest university, with a brand so powerful that its name is synonymous with prestige. On the other side is the Trump administration, determined to go farther than any other White House to reshape American higher education. Both sides are digging in for a clash that could test the limits of the government’s power and the independence that has made U.S. universities a destination for scholars around the world. On Monday, Harvard become the first university to openly defy the Trump administration as it demands sweeping changes to limit activism on campus.",
      "publishedAt": "2025-04-15T17:01:09Z",
      "title": "Harvard's challenge to Trump administration could test limits of government power",
      "url": "https://apnews.com/article/harvard-trump-administration-federal-cuts-037c3f5b259a7577358c5979e701c7c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/b5c3cf7/2147483647/strip/true/crop/2540x1429+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F5f%2F1d1fe8f795e8a21c613d398676b4%2Fb57cca02200840dbb798e899ecb2eb63"
    },
    {
      "author": "Bridget Brown, Bernard McGhee",
      "description": "President Donald Trump on Monday suggested that he might temporarily exempt the auto industry from tariffs he previously imposed on the sector, to give carmakers time to adjust their supply chains.",
      "publishedAt": "2025-04-15T07:40:00Z",
      "title": "Live updates: Trump considers a pause on his auto tariffs",
      "url": "https://apnews.com/live/donald-trump-news-updates-4-15-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/f974cd1/2147483647/strip/true/crop/4902x2757+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F38%2Fc49cbc3f83babcb63f3951984463%2Fbf4eb7c9296c4b0cb60f63dceea54b14"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "President Donald Trump keeps talking about sending U.S. citizens who commit violent crimes to prison in El Salvador. But that's likely illegal. The whole purpose of sending people to the Central American country's prisons is that they're harsher than ones in the United States and federal courts would have no way of ensuring prisoners' rights were respected. That violates several constitutional guarantees. Additionally, only immigrants, not U.S. citizens, can be deported from the United States. Trump has said his administration is trying to find ways to make such incarceration legal anyway.",
      "publishedAt": "2025-04-15T00:44:02Z",
      "title": "Trump wants to imprison US citizens in El Salvador. That's likely illegal",
      "url": "https://apnews.com/article/trump-citizens-prison-el-salvador-illegal-79113d0ccefefd1f7d8e51c3a4c3defd",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e6013a/2147483647/strip/true/crop/5836x3283+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2Fd2%2Fbb3e87bccbbfea2f6fb3a2cd0ae6%2Ffb15dcee97d74f159d05eb5da8704576"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "A federal judge has put a temporary hold on deportations of immigrants in Colorado who face possible removal under President Donald Trump's invocation of an 18th century law known as the Alien Enemies Act. The Republican president declared the law in effect to speed up deportations of people accused of being members of a Venezuelan gang. The last time the law was used was during World War II. The Supreme Court says those accused of being in the gang deserve a hearing in federal court before being deported. That's led judges in New York and Texas to put temporary holds on removals. Monday's Colorado ruling follows those decisions.",
      "publishedAt": "2025-04-15T15:10:54Z",
      "title": "Colorado Judge puts temporary hold on Trump removals sought under wartime law",
      "url": "https://apnews.com/article/trump-alien-enemies-deportation-colorado-venezuelan-gang-c8b4e376539125e46ee16971c8a0f4be",
      "urlToImage": "https://dims.apnews.com/dims4/default/8257e76/2147483647/strip/true/crop/3995x2247+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F8c%2F42ce72340eec55e83e887985b00e%2F391f02c7a17a4e7f976dc6e44ee7a64e"
    },
    {
      "author": "Michael Casey",
      "description": "A federal judge has dismissed a contempt case against an ICE agent whose arrest of man during his trial sparked criticism among the law enforcement community in Boston. ICE agent Brian Sullivan took 49-year-old Wilson Martell-Lebron into custody last month as he was leaving court. A Boston Municipal Court judge found Sullivan in contempt, arguing that he deprived Martell-Lebron of his rights to due process and fair trial. But on Monday, U.S. District Judge William Young dismissed the case after the Massachusetts Attorney General Andrea Campbell agreed with U.S. Attorney Leah Foley that the contempt order should be vacated.",
      "publishedAt": "2025-04-15T16:01:24Z",
      "title": "Federal judge drops contempt case against ICE agent over arrest outside Boston courthouse",
      "url": "https://apnews.com/article/ice-immigration-arrest-trial-contempt-8b35498ddd96ccf1bc3ff772e6ef5106",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A federal judge has ordered Bank of America to pay more than $540 million to resolve long-running litigation from a U.S. regulator that alleged the company underpaid mandatory assessments for deposit insurance. The order, reached March 31 and published publicly on Monday, arrives over eight years after the Federal Deposit Insurance Corporation sued Bank of America back in 2017. U.S. District Judge Loren L. AliKhan in Washington, D.C. partially granted and denied motions for both Bank of America and the FDIC. Bank of America said it was pleased the judge has ruled and has reserves reflecting the decision. The FDIC declined to comment further.",
      "publishedAt": "2025-04-15T16:46:33Z",
      "title": "Bank of America ordered to pay $540 million in long-running lawsuit from the FDIC",
      "url": "https://apnews.com/article/bank-of-america-fdic-540-million-9dedb78fad85825e4af11ac4aa4e295b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7e7d13/2147483647/strip/true/crop/4277x2406+0+223/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F9a%2Fbdbe5118d2a919d5136727657069%2F31541ba2931a499d88bcdaa1cd3a339b"
    },
    {
      "author": "Devna Bose, Benjamin Thorp/side Effects Public Media",
      "description": "An Associated Press and Side Effects Public Media data analysis shows one in six visits to the emergency department in 2022 that resulted in hospital admission had a wait of four or more hours. The analysis also showed 50% of the patients who were boarded for any length of time were 65 and older. Health care experts say some people who aren’t in the middle of a life-threatening emergency might even wait weeks to be admitted to the hospital. ER boarding is a symptom of the U.S. health care system’s struggles. Experts also warn the boarding issue will worsen as the number of people 65 and older in the U.S. with dementia grows in the coming decades.",
      "publishedAt": "2025-04-15T11:00:39Z",
      "title": "As dementia rates increase, experts warn hospital emergency rooms are underprepared",
      "url": "https://apnews.com/article/er-wait-boarding-hospital-dementia-daf48acf11631cffdaeb5de4abe3722e",
      "urlToImage": "https://dims.apnews.com/dims4/default/7da3834/2147483647/strip/true/crop/6084x3422+0+317/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F17%2F98765dfd505712e33ae215136b9e%2F482f54c753454d3e941117201cb1775d"
    },
    {
      "author": "Evelyne Musambi",
      "description": "Two Belgian teenagers have been charged in Kenya with wildlife piracy after they were found with thousands of ants packed in test tubes in what Kenyan authorities said was part of a trend in trafficking smaller and lesser known species. Lornoy David, 18, and Seppe Lodewijckx, 19, were arrested on April 5 with 5,000 ants at a guest house. They appeared distraught during their appearance before a magistrate, and said they were collecting the ants for fun and did not know that it was illegal. In a separate criminal case, Kenyan Dennis Ng’ang’a and Vietnamese Duh Hung Nguyen also have been charged with illegal trafficking, following their arrest while in possession of 400 ants.",
      "publishedAt": "2025-04-15T15:48:47Z",
      "title": "Ant smugglers arrested in Kenya as government warns of changing trafficking trends",
      "url": "https://apnews.com/article/garden-ants-kenya-smugglers-belgians-vietnamese-624f12ae80e0d66a87f03966079efbc1",
      "urlToImage": "https://dims.apnews.com/dims4/default/f221ae5/2147483647/strip/true/crop/6796x3823+0+354/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F69%2F116e0de719965b6fba8375429565%2F6d4588faa8094b1a832370babaf81f63"
    },
    {
      "author": "Julie Watson",
      "description": "At the San Diego Zoo Safari Park, a herd of African elephants was caught on video running over to protect their young by encircling them during a 5.2 magnitude earthquake. The elephants run as the video from the Southern California park starts to shake and then they appear to encircle the young. They stay in the cluster for several minutes after the rocking stops. The park says elephants have the ability to feel sound through their feet, and the behavior is known as an “alert circle.” The quake that hit Monday morning and was centered in San Diego County caused no injuries or major damage.",
      "publishedAt": "2025-04-15T00:29:47Z",
      "title": "Elephants at San Diego safari park huddle to protect calves during earthquake",
      "url": "https://apnews.com/article/earthquake-elephants-san-diego-zoo-safari-park-82311a59f471f5f48319c33f1c47f702",
      "urlToImage": "https://dims.apnews.com/dims4/default/56fe6b5/2147483647/strip/true/crop/2154x1212+0+112/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F39%2F9fe62c3bdc0108cac19c989727d9%2F6fcff387fc1e4490bfb502850cdd17fd"
    },
    {
      "author": "Dee-Ann Durbin",
      "description": "Starbucks is imposing new limits on what its baristas can wear under their green aprons. Starting May 12, store employees will be required to wear a solid black shirt and khaki, black or blue denim bottoms. Shirts can be short- or long-sleeved and collared or collarless, the company said in a memo released Monday. Starbucks will give each employee two free T-shirts. Starbucks said the new dress code will make its green aprons stand out and create a sense of familiarity for customers. But the labor group unionizing Starbucks workers opposes the move, saying it won't improve store operations and forces employees to buy new clothes.",
      "publishedAt": "2025-04-15T14:53:38Z",
      "title": "Starbucks imposes new limits on what baristas can wear under their green aprons",
      "url": "https://apnews.com/article/starbucks-dress-code-black-shirt-union-b7dd93b93c6c13448606545fb3f1778f",
      "urlToImage": "https://dims.apnews.com/dims4/default/227774c/2147483647/strip/true/crop/5472x3078+0+171/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2F61%2F76d6a1185fd879294ea18b3ae546%2Fc1a88533236b4244a345e1b83076350b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}