{
  "articles": [
    {
      "author": "NAJIB JOBAIN and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Heavy fighting raged overnight and into Sunday across Gaza, including in the devastated north, as Israel pressed ahead with its offensive after the U.S. blocked the latest international push for a cease-fire and rushed more munitions to its close ally.",
      "publishedAt": "2023-12-10T07:28:03Z",
      "title": "Heavy fighting across Gaza as Israel presses ahead with renewed US military and diplomatic support",
      "url": "https://apnews.com/4414014e31015af32e99a5767b18927c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a2f4916ee274fc49ae3d0bb4c658975/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "BEIRUT (AP) — A British Palestinian surgeon who spent weeks in the Gaza Strip during the current Israel-Hamas war as part of a Doctors Without Borders medical team said he has given testimony to a British war crimes investigation unit.",
      "publishedAt": "2023-12-09T21:55:17Z",
      "title": "A British Palestinian surgeon gave testimony to a UK war crimes unit after returning from Gaza",
      "url": "https://apnews.com/c0a40d6edc02bb0b91c94eb39cd8110d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6444f17c78294f22877480b888a429a8/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "LUKEVILLE, Ariz. (AP) — Gerston Miranda and his wife were among thousands of migrants recently arriving at this remote area on Arizona's southern border with Mexico, squeezing into the United States through a gap in the wall and walking overnight about 14 miles (23 kilometers) with two school-aged daughters to surrender to Border Patrol agents.",
      "publishedAt": "2023-12-10T05:20:47Z",
      "title": "Smugglers are bringing migrants to a remote Arizona border crossing, overwhelming US agents",
      "url": "https://apnews.com/ae04e8c861a95e98dbfc8d49244cf092",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfd5727b07e044459011a5e288042560/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — Behind bars in penal colonies or in self-exile abroad, Russian opposition figures vow they will still put up a fight against President Vladimir Putin as he seeks yet another term in office in an election in March.",
      "publishedAt": "2023-12-09T05:08:04Z",
      "title": "With Putin's reelection all but assured, Russia's opposition still vows to undermine his image",
      "url": "https://apnews.com/ed74cfa0fb957317188de39fe9ae7d15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c4c665106e44e5a9db137d3f22585cc/3000.jpeg"
    },
    {
      "author": "MIKE CORDER and MELINA WALLING",
      "description": "ROTTERDAM, Netherlands (AP) — On the top deck of a three-tiered structure moored near downtown Rotterdam, brown and white cows graze on hay dropped from a conveyor belt above their heads and rinds of oranges salvaged from supermarket juice machines in the port city.",
      "publishedAt": "2023-12-10T04:57:07Z",
      "title": "Cows in Rotterdam harbor, seedlings on rafts in India; are floating farms the future?",
      "url": "https://apnews.com/d09831ec98390ef51f9464e28b357bd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ad5bc0bca6947a58a51746d55191be3/3000.jpeg"
    },
    {
      "author": "MARK THIESSEN",
      "description": "ANCHORAGE, Alaska (AP) — Gregory Golodoff spent most of his years on a quiet Alaska island, living an ordinary life, managing a co-op store, fishing for crab and serving as the village council president.",
      "publishedAt": "2023-12-10T05:10:12Z",
      "title": "Death of last surviving Alaskan taken by Japan during WWII rekindles memories of forgotten battle",
      "url": "https://apnews.com/c1d2c340af82f8e41129b8f6efb30c9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff07168bb19440dfa7a52cf9f7b5ab2b/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Elon Musk has restored the X account of conspiracy theorist Alex Jones, pointing to a poll on the social media platform formerly known as Twitter that came out in favor of the Infowars host who repeatedly called the 2012 Sandy Hook school shooting a hoax.",
      "publishedAt": "2023-12-10T10:26:46Z",
      "title": "Elon Musk restores X account of conspiracy theorist Alex Jones",
      "url": "https://apnews.com/90cfc990631dec5e8f337167fbe16372",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cbe38584d9fe49b4ac161871e9082558/3000.jpeg"
    },
    {
      "author": "SYLVIA HUI and HUIZHONG WU",
      "description": "LONDON (AP) — When her husband fled China in 2019 to escape a police crackdown on dissidents, Lu Lina thought she and their young son could soon join him in safety abroad. She did not know that she would be forced to move house, that her 8-year-old son would be effectively kicked out of school and that border police would block her from leaving the country over the next three years.",
      "publishedAt": "2023-12-10T05:04:10Z",
      "title": "China is hardening against dissent, rights groups say as they mark International Human Rights Day",
      "url": "https://apnews.com/019854630542c241cb48447fc0435e6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3204223c548145a9a50655c00f98c4a7/1600.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "NORFOLK, Va. (AP) — A former U.S. Navy SEAL who says he shot Osama bin Laden is at the center of a much different fight in Virginia, where plans for a military-themed brewery are drawing opposition over his alleged racist and homophobic remarks.",
      "publishedAt": "2023-12-10T05:03:43Z",
      "title": "Military-themed brewery wants to open in a big Navy town. An ex-SEAL is getting in the way",
      "url": "https://apnews.com/6e71e20b0989b8a5ff5c91c76b2bfc95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d157e8b0e70b48ab9a5a07eb7ea9ecd8/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — The Chinese coast guard targeted Philippine vessels with water cannon blasts Sunday and rammed one of them, causing damage and endangering Filipino crew members off a disputed shoal in the South China Sea, just a day after similar hostilities at another contested shoal, Philippine officials said.",
      "publishedAt": "2023-12-10T04:39:09Z",
      "title": "Philippines says Chinese coast guard used water cannons against its vessels for a second day",
      "url": "https://apnews.com/632cbc349007048cc2ad56502ef4fc67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8c6cbfd25bd04449a3480f91ca9cebf1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}