{
  "articles": [
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — Palestinians on Wednesday will mark the 76th year of their mass expulsion from what is now Israel, an event that is at the core of their national struggle. But in many ways, that experience pales in comparison to the calamity now unfolding in Gaza.",
      "publishedAt": "2024-05-14T04:57:07Z",
      "title": "Palestinians mark 76 years of dispossession as a potentially even larger catastrophe unfolds in Gaza",
      "url": "https://apnews.com/b5cea9556e516655c25598d5dbe54192",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c28d7cc667e94e94ac97a7a460a90985/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "More than half a million Palestinians have been displaced in recent days by escalating Israeli military operations in southern and northern Gaza, the United Nations says.Around 450,000 Palestinians were driven out of Rafah in Gaza's south over the past week, the United Nations’ agency for Palestinian refugees said Tuesday.",
      "publishedAt": "2024-05-14T06:54:14Z",
      "title": "The Latest | More than half a million people flee fighting in Rafah and northern Gaza, UN says",
      "url": "https://apnews.com/322dd129c72e2be9347560d7ea7674dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b8b68cbe5c24e4b95d59f1fa0c554b1/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "KYIV, Ukraine (AP) — U.S. Secretary of State Antony Blinken said on Tuesday that American military aid on its way to Ukraine will make a “real difference” on the battlefield, as the top diplomat made an unannounced visit to reassure an ally facing a fierce new Russian offensive.",
      "publishedAt": "2024-05-14T02:30:53Z",
      "title": "Blinken in Kyiv says US arms will make a difference as Ukraine reels from a new Russian offensive",
      "url": "https://apnews.com/41df75260903f6b9527fbf3a1a44c815",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fb7e178ff1f42b6a8da13dc9d4fde3a/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, ERIC TUCKER, MICHELLE L. PRICE and COLLEEN LONG",
      "description": "NEW YORK (AP) — Donald Trump's fixer-turned-foe awaits a bruising round of questioning from the former president's lawyers on Tuesday after testimony that linked the celebrity client to all aspects of a hush money scheme that prosecutors say was aimed at stifling stories that threatened his 2016 campaign.",
      "publishedAt": "2024-05-14T04:03:46Z",
      "title": "Michael Cohen will face a bruising cross-examination by Trump's lawyers at the hush money trial",
      "url": "https://apnews.com/735aadfd1ce015e05ba955c203a96f1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77dbd2d373214915919e890847e784c4/1920.jpeg"
    },
    {
      "author": "JOSH BOAK, FATIMA HUSSEIN, PAUL WISEMAN and DIDI TANG",
      "description": "WASHINGTON (AP) — The Biden administration announced plans to slap new tariffs on Chinese electric vehicles, advanced batteries, solar cells, steel, aluminum and medical equipment — an election year move that's likely to increase friction between the world's two largest economies.",
      "publishedAt": "2024-05-14T09:03:32Z",
      "title": "Biden hiking tariffs on Chinese EVs, solar cells, steel, aluminum — adding to tensions with Beijing",
      "url": "https://apnews.com/2024ba735c47e04a50898a88425c5e2c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a78aa89b6ae7418bb8e964298a9c0b54/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER, REESE DUNKLIN and TAYLOR STEVENS",
      "description": "In hundreds of deaths where police used force meant to stop someone without killing them, officers violated well-known guidelines for safely restraining and subduing people — not simply once or twice, but multiple times.",
      "publishedAt": "2024-05-14T10:10:27Z",
      "title": "AP Investigation: In hundreds of deadly police encounters, officers broke multiple safety guidelines",
      "url": "https://apnews.com/e79c708e9123aac2e40dcefd64cce08f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f83b6e3a6b0a40f9ab5916d7e9381a01/3000.jpeg"
    },
    {
      "author": null,
      "description": "FORT NELSON, British Columbia (AP) — An intense wildfire could reach a town in western Canada this week, fire experts and officials warned, based on forecasts of winds that have fueled the out-of-control blaze, which has forced the evacuation of thousands of people.",
      "publishedAt": "2024-05-13T10:37:33Z",
      "title": "A town in western Canada prepares for a possible 'last stand' as wildfires rage in British Columbia",
      "url": "https://apnews.com/dace46a958c9426056eb7da908a3f115",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/218c80a08a014635944cdc3c5e92f589/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and TASSANEE VEJPONGSA",
      "description": "PHILADELPHIA (AP) — Former Ukrainian President Viktor Yushchenko said the long delay by the U.S.",
      "publishedAt": "2024-05-14T04:19:59Z",
      "title": "Ex-Ukrainian president says US delay in war aid was 'colossal' waste, let Putin inflict more damage",
      "url": "https://apnews.com/857a53214e963d2c208d1b8434eafade",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9c9a6f4936a4cb2bcde6c140fbaf69a/3000.jpeg"
    },
    {
      "author": "VICTORIA MILKO",
      "description": "JAKARTA, Indonesia (AP) — Fans of Korean pop bands around the world are increasingly channeling their millions-strong online community into climate and environmental activism, protesting business deals linked to coal power, urging K-pop entertainers to cut waste and raising awareness about climate-related issues.",
      "publishedAt": "2024-05-14T03:52:42Z",
      "title": "K-pop fans around globe rally for climate and environment goals",
      "url": "https://apnews.com/0e7ec393f20ca0194d7291e70f49b084",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32b297de663c4013be9a8c79df2a5a01/2000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "CANNES, France (AP) — The Cannes Film Festival opens Tuesday with the unveiling of Greta Gerwig's jury and the presentation of an honorary Palme d'Or for Meryl Streep, as the French Riviera spectacular kicks off a potentially volatile 77th edition.",
      "publishedAt": "2024-05-14T04:09:55Z",
      "title": "Cannes kicks off with Greta Gerwig's jury and a Palme d'Or for Meryl Streep",
      "url": "https://apnews.com/650243306d8e6fb23b76e55f8e452c6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8b7feefeaf7481984c5566e4b8d28cb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}