{
  "articles": [
    {
      "author": "ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden delivered a defiant argument for a second term in his State of the Union speech Thursday night, lacing into GOP front-runner Donald Trump for espousing “resentment, revenge and retribution\" and for jeopardizing freedom at home and abroad.",
      "publishedAt": "2024-03-07T05:03:44Z",
      "title": "Biden uses feisty State of the Union to contrast with Trump, sell voters on a second term",
      "url": "https://apnews.com/1a42ff9d4ef3e0f2753e43ac8d39fc18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5bf829fb06024f278199680850b6a986/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Sen. Katie Britt called President Joe Biden a “dithering and diminished leader” in the Republican rebuttal to his State of the Union address Thursday evening.",
      "publishedAt": "2024-03-08T00:55:46Z",
      "title": "Katie Britt calls Biden a 'diminished leader' in GOP response to the State of the Union",
      "url": "https://apnews.com/40cd6634bb0343d8c3c7d70dbd9524d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57dcf433000d423aa7534554a638d535/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The State of the Union address is one of the durable set pieces of the presidency, a forum that almost always favors the speaker in a one-way conversation with millions of Americans.",
      "publishedAt": "2024-03-08T04:08:59Z",
      "title": "Takeaways from Biden's State of the Union address: Combative attacks on a foe with no name",
      "url": "https://apnews.com/31cfc7a93213f052eb3f8a0bf51173d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a67c1d4766040ef8da9af5a4e12383f/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY, ABBY SEWELL, ELLEN KNICKMEYER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden ordered the U.S. military Thursday to set up a temporary port off the coast of Gaza, joining international partners in trying to carve out a sea route to deliver food and other aid to desperate Palestinian civilians cut off by the Hamas-Israel war and by Israeli restrictions on humanitarian access by land.",
      "publishedAt": "2024-03-07T11:22:43Z",
      "title": "Biden orders US military to set up temporary aid port for Gaza as famine threatens",
      "url": "https://apnews.com/5657eedc005040694a9ab935ce3e39e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c80c4dcc7ce402b8390e63f4701fede/1920.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — The federal judge who oversaw a New York defamation trial that resulted in an $83.3 million award to a longtime magazine columnist who says Donald Trump raped her in the 1990s refused Thursday to relieve the ex-president from the verdict’s financial pinch.",
      "publishedAt": "2024-03-07T23:17:54Z",
      "title": "Judge denies Trump relief from $83.3 million defamation judgment",
      "url": "https://apnews.com/eaa22724e1f40a6b6389517e07534cf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6f866c8e7674070bab3c43b435e1b5b/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "Power lines ignited massive wildfires across the Texas Panhandle that killed at least two people, destroyed homes and livestock, and left a charred landscape, officials said Thursday, including the largest blaze in state history.",
      "publishedAt": "2024-03-07T15:14:36Z",
      "title": "Power lines ignited the largest wildfire in Texas history and one nearby, officials say",
      "url": "https://apnews.com/22540df0a0c1d2c42a7fe0284858845a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea2a40ba7ad349389856e81be9ca2b0d/2684.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Fear of crime on subways and buses is back as a top concern in some U.S. cities, and so are efforts to persuade public officials to take the issue seriously.New York Gov. Kathy Hochul said Wednesday she would task 750 members of the National Guard with helping patrol the nation’s busiest subway system, saying she felt New York City police need reinforcements after a shooting on a train platform and a conductor getting slashed in the neck.",
      "publishedAt": "2024-03-07T22:32:21Z",
      "title": "Transit crime is back as a top concern in some US cities, and political leaders have taken notice",
      "url": "https://apnews.com/f26609cb9fda9f9ad32f13481c3d8b6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/115c604eeea24dafaba4b731a8b3028f/1920.jpeg"
    },
    {
      "author": "KANIS LEUNG and ZEN SOO",
      "description": "HONG KONG (AP) — Hong Kong unveiled a new national security bill Friday that proposes up to life imprisonment for offenses like treason and insurrection, a move deepening worries over further erosion of the city’s freedoms after Beijing imposed a similar law four years ago that all but wiped out dissent.",
      "publishedAt": "2024-03-08T00:28:20Z",
      "title": "Hong Kong's new national security bill includes stiff penalties and more power to suppress dissent",
      "url": "https://apnews.com/52dc068e5a82dd9ba4ea5bcd7b166290",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ab32d2e3dfe476699e0dbe89a8b30c8/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "UVALDE, Texas (AP) — An investigation Uvalde city leaders ordered into the Robb Elementary School shooting that killed 19 students and two teachers defended the actions of local police in a report released Thursday, prompting shouts of “cowards” during a City Council meeting and causing several family members of the victims to angrily walk out.",
      "publishedAt": "2024-03-07T05:14:12Z",
      "title": "Uvalde parents angered by new report that clears city police of missteps during Texas school attack",
      "url": "https://apnews.com/b5c9f8204f33f62f720a7c1644b47ffc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ffbb2b7cf86453cae134407a96abeb0/1920.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN",
      "description": "MIAMI (AP) — When Haitian Prime Minister Ariel Henry filled the void left by the assassination of the country’s president in 2021, he did so over the protest of wide segments of the population but with the full-throated support of the Biden administration.",
      "publishedAt": "2024-03-07T17:13:50Z",
      "title": "'They messed it up': Biden's backing for Haiti's unpopular leader digs US into deeper policy hole",
      "url": "https://apnews.com/c79d6c330f2074e44c08decaca2bc1f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a711963920d408188c360ce8004c1d4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}