{
  "articles": [
    {
      "author": "KATE PAYNE and HEATHER HOLLINGSWORTH",
      "description": "CRAWFORDVILLE, Fla. (AP) — Hurricane Helene strengthened into a Category 4 storm hours ahead of its expected landfall on Florida’s northwest coast Thursday night as forecasters warned that the enormous system could create a “nightmare” storm surge and bring dangerous winds and rain across much of the southeastern U.S.",
      "publishedAt": "2024-09-26T05:05:15Z",
      "title": "Helene strengthens to a Category 4 hurricane as it nears Florida's Gulf Coast",
      "url": "https://apnews.com/42fb7cc90604b7f87179920f97627873",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9500b60dec08420b9adf8e79957ce8f3/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, BASSEM MROUE and MELANIE LIDMAN",
      "description": "NEW YORK (AP) — Israeli Prime Minister Benjamin Netanyahu on Thursday vowed to carry out “full force” strikes against Hezbollah until it ceases firing rockets across the border, dimming hopes for a cease-fire proposal put forth by U.S.",
      "publishedAt": "2024-09-26T08:46:33Z",
      "title": "Netanyahu vows to use 'full force' against Hezbollah and dims hopes for a cease-fire",
      "url": "https://apnews.com/486f5aecac210273611124f9ade95fc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14c430ce9498489291f095987dba77a0/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel and Hezbollah each have strong incentives to heed international calls for a cease-fire that could avert all-out war — but that doesn't mean they will.",
      "publishedAt": "2024-09-26T16:53:54Z",
      "title": "What obstacles stand in the way of an Israel-Hezbollah cease-fire?",
      "url": "https://apnews.com/71b59e0db03f0014ce06d4aa21bc2907",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8cfdac1edb2f47b6b46d31cfb86b6d65/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ, LARRY NEUMEISTER and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — New York City Mayor Eric Adams vowed to stay in office Thursday after federal prosecutors unsealed an indictment accusing him of letting Turkish officials and businesspeople buy his influence with illegal campaign contributions and lavish overseas trips.",
      "publishedAt": "2024-09-26T12:08:59Z",
      "title": "Feds charge NYC mayor with selling his influence to foreign nationals. He says he won't resign",
      "url": "https://apnews.com/5aad135d1808cb9d049fccd74604e5d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6060da0b46f046b7b63ad11bd57cce3b/1920.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "ATMORE, Ala. (AP) — Alabama is preparing to carry out the nation’s second nitrogen gas execution Thursday as disagreements continue over the humaneness of the new method of putting prisoners to death.",
      "publishedAt": "2024-09-26T04:23:45Z",
      "title": "Alabama to carry out the second nitrogen gas execution in the US",
      "url": "https://apnews.com/29d624a776d5daa265f376a79ae2f86b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e44443b7ae34b4094e708117fab6158/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — With American support for Ukraine at a partisan crossroads, Vice President Kamala Harris on Thursday slammed suggestions that Kyiv should cede territory for the sake of peace with Moscow as “dangerous and unacceptable.”",
      "publishedAt": "2024-09-26T04:13:02Z",
      "title": "Harris blasts proposals for Ukraine to cede territory to Russia during Zelenskyy meeting",
      "url": "https://apnews.com/229804fd42332c584dfbe05224634e44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61e058023bba4ac5b074a1385839ff96/1920.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "MEXICO CITY (AP) — Families of the 43 students from a rural teacher’s college abducted 10 years ago in southern Mexico marked the painful anniversary Thursday disillusioned after what they say was a decade of unfulfilled government promises.",
      "publishedAt": "2024-09-26T20:26:04Z",
      "title": "The families of 43 missing students in Mexico are still demanding justice 10 years later",
      "url": "https://apnews.com/b46b193319fdcd6cdf92c0ce0d0699da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85e8d3e92511498094aaca8eacba6e7c/1920.jpeg"
    },
    {
      "author": "RANDALL CHASE",
      "description": "DOVER, Del. (AP) — A settlement was reached Thursday in a defamation lawsuit brought by electronic voting machine manufacturer Smartmatic against conservative news outlet Newsmax for airing accusations about vote manipulation in the 2020 election made by allies of former President Donald Trump.",
      "publishedAt": "2024-09-26T19:37:33Z",
      "title": "Voting technology firm, conservative outlet reach settlement in 2020 election defamation case",
      "url": "https://apnews.com/96d35dc10009b68cbb548ef7bea10284",
      "urlToImage": ""
    },
    {
      "author": "JANIE McCAULEY",
      "description": "OAKLAND, Calif. (AP) — Mark Kotsay treated this moment, this daunting day, like the World Series he has never had as a player or manager.",
      "publishedAt": "2024-09-26T21:25:28Z",
      "title": "Athletics bid emotional farewell to Oakland Coliseum that they called home since 1968",
      "url": "https://apnews.com/c835255943091f9f544768a6939f8ac8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a6945432ca74179baf095df050ba44c/3000.jpeg"
    },
    {
      "author": null,
      "description": "MIAMI (AP) — A Florida man is seeking a temporary injunction to stop Shohei Ohtani's 50th home run ball from going to auction, saying it was stolen from him moments after he secured it.",
      "publishedAt": "2024-09-26T23:02:28Z",
      "title": "Florida man files a lawsuit to prevent Ohtani's 50th HR ball from going to auction",
      "url": "https://apnews.com/fced6cc7ab2e27d1f5ead2fd30b7d360",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/642f3cdbf672430d93efda627c248ae9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}