{
  "articles": [
    {
      "author": "PHILIP MARCELO and DENISE LAVOIE",
      "description": "Police surrounded a pro-Palestinian encampment early Sunday at the University of Southern California, days before commencement events are set to begin on the Los Angeles campus. The university said campus safety officers assisted by the Los Angeles Police Department were clearing the area.",
      "publishedAt": "2024-05-05T11:45:27Z",
      "title": "Police surround pro-Palestine student encampment at University of Southern California",
      "url": "https://apnews.com/3afafc2d56c6dc87635549475d94e1d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2091bcef1fc4b47a3d1ec7cf935efd5/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK and JACK JEFFERY",
      "description": "TEL AVIV, Israel (AP) — A Hamas delegation was in Cairo on Saturday as Egyptian state media reported “noticeable progress” in cease-fire talks for Gaza.",
      "publishedAt": "2024-05-04T11:15:59Z",
      "title": "There's progress reported in Gaza truce talks, but Israel downplays chances of ending war with Hamas",
      "url": "https://apnews.com/4eae8b7a75440d4dd9a201219d60bcd9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2c9169235c944e4896a869b5ba1fc33/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and JON GAMBRELL",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu said on Sunday that his government has voted unanimously to shut down the local offices of Qatar-owned broadcaster Al Jazeera, escalating Israel’s long-running feud with the channel at a time when cease-fire negotiations with Hamas — mediated by Qatar — are gaining steam.",
      "publishedAt": "2024-05-05T10:22:43Z",
      "title": "Netanyahu's Cabinet votes to close Al Jazeera offices in Israel following rising tensions",
      "url": "https://apnews.com/eba9416aea82f505ab908ee60d1de5e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ed8dade8510477e92a560eef6b09875/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — They’re hallmarks of American history: protests, rallies, sit-ins, marches, disruptions. They date from the early days of what would become the United States to the sights and sounds echoing across the landscapes of the nation’s colleges and universities during this activist spring.",
      "publishedAt": "2024-05-05T04:59:28Z",
      "title": "The American paradox of protest: Celebrated and condemned, welcomed and muzzled",
      "url": "https://apnews.com/22b1325188e0808db7389c8c3f04c331",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c9a64480efc4e58b3a5c9263de69404/3000.jpeg"
    },
    {
      "author": "MAKIYA SEMINERA and GEOFF MULVIHILL",
      "description": "RALEIGH, N.C. (AP) — When Florida enacted its six-week abortion ban last week, clinics in several other Southern and mid-Atlantic states sprang into action, knowing women would look to them for services no longer available where they live.",
      "publishedAt": "2024-05-05T06:07:18Z",
      "title": "Many Florida women can't get abortions past 6 weeks. Where else can they go?",
      "url": "https://apnews.com/fa6ffb1e0627547356c55a85fb3a715e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eed5711270c347beb12559a174afded4/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and LEKAN OYEKANMI",
      "description": "HOUSTON (AP) — High waters flooded neighborhoods around Houston on Saturday following heavy rains that resulted in crews rescuing more than 400 people from homes, rooftops and roads engulfed in murky water.",
      "publishedAt": "2024-05-05T04:20:07Z",
      "title": "Hundreds rescued from Texas floods as forecast calls for more rain and rising water",
      "url": "https://apnews.com/793f0bcb98c9ec87da0727517e7f1787",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17ac42d1aa354cefabf39501b0c73d7e/1920.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — As Ukraine marked its third Easter at war, Russia launched a barrage of drones concentrated in Ukraine’s east and claimed its troops took control of a village they had been targeting.",
      "publishedAt": "2024-05-05T09:07:12Z",
      "title": "Ukraine marks its third Easter at war under fire from Russian drones",
      "url": "https://apnews.com/1702fb361c6e72fcf9d93f46ac89625e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7430d8aab3c646ed842ec329aace2de2/3000.jpeg"
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "ALBUQUERQUE, N.M. (AP) — It was a frigid winter morning when authorities found a Native American man dead on a remote gravel road in western New Mexico.",
      "publishedAt": "2024-05-05T04:37:24Z",
      "title": "As US spotlights those missing or dead in Native communities, prosecutors work to solve their cases",
      "url": "https://apnews.com/fb7f8145149850aa5ae14c44c9692667",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/203d4b5e94004a79be0eb2ca1f3d6785/3000.jpeg"
    },
    {
      "author": "ZELIPHA KIROBI",
      "description": "NAIROBI, Kenya (AP) — Armed with gardening hoes while others cradled bamboo seedlings, students gathered outside their school in Kenya's capital. They hoped the fully grown bamboo would help to filter filthy air from one of Africa's largest trash dumps next door.",
      "publishedAt": "2024-05-05T04:24:03Z",
      "title": "They study next to one of Africa's largest trash dumps. They're planting bamboo to try to cope",
      "url": "https://apnews.com/d75d555dbeebd9c7f18b06a02889fac7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7d4d763763349c180644f7828654261/3000.jpeg"
    },
    {
      "author": "JUAN ZAMORANO",
      "description": "PANAMA CITY (AP) — Panamanians head to the polls Sunday to vote in an election that has been consumed by unfolding drama surrounding the country’s ex-president, despite not even being on the ballot.",
      "publishedAt": "2024-05-05T04:33:53Z",
      "title": "Panamanians vote in election dominated by former president who was banned from running",
      "url": "https://apnews.com/a9954f8a3622885232771ffd51e69715",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9ebbc9780d741429eb74178a07f90d7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}