{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — Nikola Jokic of the Denver Nuggets wins the NBA MVP award for the third time in the last four seasons.",
      "publishedAt": "2024-05-08T23:34:49Z",
      "title": "Nikola Jokic of the Denver Nuggets wins the NBA MVP award for the third time in the last four seasons",
      "url": "https://apnews.com/9760786d8b4a0490ce3811956f4abe17",
      "urlToImage": ""
    },
    {
      "author": "ZEKE MILLER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden said Wednesday that he would not supply offensive weapons that Israel could use to launch an all-out assault on Rafah — the last major Hamas stronghold in Gaza — over concern for the well-being of the more than 1 million civilians sheltering there.",
      "publishedAt": "2024-05-08T15:40:28Z",
      "title": "Biden says US won't supply weapons for Israel to attack Rafah, in warning to ally",
      "url": "https://apnews.com/eed365ebef0477ba74bf9848cacae4f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9101ce3077964fdfbaf256309cb04aa1/3000.jpeg"
    },
    {
      "author": "DAVID FISCHER",
      "description": "MIAMI (AP) — Deputies responding to a disturbance call at a Florida apartment complex burst into the wrong unit and fatally shot a Black U.S. Air Force airman who was home alone when they saw he was armed with a gun, an attorney for the man’s family said Wednesday.",
      "publishedAt": "2024-05-08T23:06:08Z",
      "title": "Florida deputies who fatally shot US airman burst into wrong apartment, attorney says",
      "url": "https://apnews.com/8bcc82463ada69264389edf2a4f1a83d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56244d8b6a5b4e4d8b1d36c4ebb5d855/3000.jpeg"
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — Police used pepper spray to clear a pro-Palestinian tent encampment at George Washington University and arrested dozens of demonstrators on Wednesday just as city officials were set to appear before hostile lawmakers in Congress to account for their handling of the 2-week-old protest.",
      "publishedAt": "2024-05-08T10:05:43Z",
      "title": "Police clear pro-Palestinian protest camp and arrest 33 at DC campus as mayor's hearing is canceled",
      "url": "https://apnews.com/eac5c1cc396551bee1b110b48a94aefd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd55e209af1f4f8d800696e17031aeec/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SARAH EL DEEB and LEE KEATH",
      "description": "RAFAH, Gaza Strip (AP) — Tens of thousands of displaced and exhausted Palestinians have packed up their tents and other belongings from Rafah, dragging families on a new exodus.",
      "publishedAt": "2024-05-08T21:41:07Z",
      "title": "Palestinians flee chaos and panic in Rafah after Israel's seizure of border crossing",
      "url": "https://apnews.com/e0754cdae0f3786982038e80feaa159e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14d16c4ae12e4505991349d675413a9d/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Hardline Rep. Marjorie Taylor Greene tried and failed in sudden action Wednesday to oust Speaker Mike Johnson, her long-shot effort swiftly and resoundingly rejected by Democrats and Republicans tired of the political chaos.",
      "publishedAt": "2024-05-08T21:34:52Z",
      "title": "House quickly rejects Rep. Marjorie Taylor Greene's effort to remove Speaker Johnson from office",
      "url": "https://apnews.com/482da113f542b62ee00b5f1692f58a5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fde539279d8b409694f087a57c6b0af5/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The Biden administration plans to propose a new rule Thursday aimed at speeding up the asylum claims process for some migrants — a potential prelude to broader actions from President Joe Biden later this year that would impose a bigger crackdown at the border.",
      "publishedAt": "2024-05-08T20:23:01Z",
      "title": "Biden administration will propose tougher asylum standards for some migrants at the border",
      "url": "https://apnews.com/36b862f3eef338edd9e7ab1a73df94c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/232ea047bdf34d4faeecf68efbcc9047/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI, ED WHITE and SEAN MURPHY",
      "description": "PAVILION TOWNSHIP, Mich. (AP) — At least eight tornadoes have touched down in Ohio and three have been confirmed in Michigan as severe storms barreled through the central U.S.",
      "publishedAt": "2024-05-08T04:49:04Z",
      "title": "8 tornadoes confirmed in Ohio, 3 in Michigan as severe storms cross central US",
      "url": "https://apnews.com/1ac4133f09069997f926e434a28c75ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3de1904d20324e159b1c92391d261813/1920.jpeg"
    },
    {
      "author": "EDNA TARIGAN and KRISTEN GELINEAU",
      "description": "MEULABOH, Indonesia (AP) — The boat glided across waters that were dark and still, under a night sky that was cloudless and calm. But on board, the 12-year-old girl quaked with fear.The captain and crew who she says had tortured her and three other women and girls were not finished.",
      "publishedAt": "2024-05-08T03:07:46Z",
      "title": "Rape, terror and death at sea: How a boat carrying Rohingya children, women and men capsized",
      "url": "https://apnews.com/1d2ad5595a5240ea4d2c35e26ddf9394",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d400778a426f4b1384fd7e32217bc580/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — All dogs coming into the U.S. from other countries must be at least 6 months old and microchipped to help prevent the spread of rabies, according to new government rules published Wednesday.",
      "publishedAt": "2024-05-08T15:34:29Z",
      "title": "Dogs entering US must be 6 months old and microchipped to prevent spread of rabies, new rules say",
      "url": "https://apnews.com/572fa077a00afec3b2c13ab412f641ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5817deb770184425946dec2fcb9f0ee0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}