{
  "articles": [
    {
      "author": "BILL BARROW",
      "description": "Barack Obama was days shy of his 43rd birthday and months from being elected to the U.S. Senate when he stepped onto a Boston stage at the 2004 Democratic National Convention.",
      "publishedAt": "2024-08-20T04:40:07Z",
      "title": "Obama made his DNC debut 20 years ago. He's returning to make the case for Kamala Harris",
      "url": "https://apnews.com/58f15df279a382be92040dfbc6adde13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8435f207d45045d18aacb9a427a0eb5e/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Day two of the Democratic National Convention has begun.Former President Barack Obama, former first lady Michelle Obama and second gentleman Doug Emhoff will speak at the DNC, a day after the unofficial farewell for President Joe Biden, who served eight years as Obama’s vice president.",
      "publishedAt": "2024-08-20T11:18:26Z",
      "title": "The Latest: Day 2 of the DNC will feature the Obamas and second gentleman Doug Emhoff",
      "url": "https://apnews.com/c611b0d3a49a3c3b33f026e8f2fd277b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53b89b2860864b6e83397aecaea1f51f/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN, JOEY CAPPELLETTI and LEA SKENE",
      "description": "CHICAGO (AP) — Thirteen people were arrested during protests on the first day of the Democratic National Convention in Chicago, most them related to a “brief breach” of security fencing “within sight and sound of the United Center,\" the city's police superintendent said Tuesday.",
      "publishedAt": "2024-08-20T16:05:51Z",
      "title": "13 protesters arrested during first day of Democratic National Convention in Chicago",
      "url": "https://apnews.com/f064683535bbbe93231d31ecc2dbafc7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1070a93c8c874e158a782bfb09fbf53b/1920.jpeg"
    },
    {
      "author": "ISABELLA VOLMERT and BILL BARROW",
      "description": "HOWELL, Mich. (AP) — Former President Donald Trump pledged Tuesday to “Make America Safe Again\" while campaigning in Michigan as the Democrats who gathered in Chicago to nominate Kamala Harris branded him a career criminal.",
      "publishedAt": "2024-08-20T22:13:18Z",
      "title": "Trump campaigns to 'make America safe again' as Democratic convention zeroes in on his felony record",
      "url": "https://apnews.com/1cce84222d4a15f8174e6aa810152bd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0634beabba5a42f5a363db6b7082b48b/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel's demand for lasting control over two strategic corridors in Gaza, which Hamas has long rejected, threatens to unravel cease-fire talks aimed at ending the 10-month-old war, freeing scores of hostages and preventing an even wider conflict.",
      "publishedAt": "2024-08-20T04:43:27Z",
      "title": "Why is Israel demanding control over 2 Gaza corridors in the cease-fire talks?",
      "url": "https://apnews.com/03deb20a6c549273fb4b8ce3475fff17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da80598594474835bfc00d13d5a6ac1f/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian forces have either destroyed or damaged all three of the bridges over the Seym River in western Russia, according to Russian sources, as Kyiv's incursion into western Russia entered its third week Tuesday.",
      "publishedAt": "2024-08-20T09:20:25Z",
      "title": "Ukraine has destroyed or damaged all three bridges over Russia's Seym River, Russian sources say",
      "url": "https://apnews.com/0701b3c7f51d1dd1b6e74390f2201339",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/077f916d10df48f58d9afa7aa22bfcb7/1432.jpeg"
    },
    {
      "author": "ANDREA ROSA and MIKE CORDER",
      "description": "PORTICELLO, Sicily (AP) — Specialist cave divers working in 12-minute underwater shifts were searching Tuesday for six missing passengers and crew, including British tech tycoon Mike Lynch, believed to be in the submerged wreck of a luxury yacht that was slammed by a powerful storm and swiftly sank off Sicily.",
      "publishedAt": "2024-08-20T13:34:58Z",
      "title": "What is known about the sinking of a luxury yacht off the coast of Sicily and those aboard",
      "url": "https://apnews.com/7eb9496d2f22f85b82e9cfccaa397657",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/144009b2790a440997d5edeeb712e34a/2890.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "The University of Kentucky will disband its office promoting diversity and inclusion efforts in response to questions from policymakers that its focus on identity has stifled political discussions, its president said Tuesday.",
      "publishedAt": "2024-08-20T22:34:38Z",
      "title": "University of Kentucky to disband diversity office after GOP lawmakers pushed anti-DEI legislation",
      "url": "https://apnews.com/92f62d1b07c6aef3de364915c07a1634",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0bedaf4d078d468fa2b027a0fb87d244/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and DAVID SHARP",
      "description": "LEWISTON, Maine (AP) — Both the Army Reserve and police missed opportunities to intervene in a gunman’s psychiatric crisis and initiate steps to seize weapons from the spiraling reservist responsible for the deadliest shootings in Maine history, according to the final report released Tuesday by a special commission created to investigate the attacks, which killed 18 people.",
      "publishedAt": "2024-08-20T04:22:02Z",
      "title": "Final report outlines missed opportunities to stop Maine's deadliest shooting",
      "url": "https://apnews.com/0db62e967dcb77fab976e4782a63baa5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cada112451174b4e84425cc47c721b10/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Federal Reserve officials have said they're increasingly confident that they've nearly tamed inflation.",
      "publishedAt": "2024-08-20T07:00:26Z",
      "title": "Powell may use Jackson Hole speech to hint at how fast and how far the Fed could cut rates",
      "url": "https://apnews.com/7e581f4da9c0c228c997ea8eb361e7ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f9808b50e524656a89a9af45927b9fa/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}