{
  "articles": [
    {
      "author": null,
      "description": "PARIS (AP) — USA Gymnastics officials 'disappointed' an arbitration panel won't reconsider asking Jordan Chiles to return her medal.",
      "publishedAt": "2024-08-12T23:24:34Z",
      "title": "USA Gymnastics officials 'disappointed' an arbitration panel won't reconsider asking Jordan Chiles to return her medal",
      "url": "https://apnews.com/2e0d136a063d6fc2cff9cc4e88729b26",
      "urlToImage": ""
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — U.S. Defense Secretary Lloyd Austin has ordered a guided missile submarine to the Middle East and is telling the USS Abraham Lincoln aircraft carrier strike group to sail more quickly to the area, as the U.S.",
      "publishedAt": "2024-08-12T00:55:48Z",
      "title": "US beefs up posture in Middle East, warns an Iran-backed attack on Israel could come this week",
      "url": "https://apnews.com/43e2574e746af59993f54e4ef250a640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/979ecb25979d4b0fa42ce19211f7c049/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON (AP) — The FBI said Monday it is investigating allegations that sensitive documents from the Trump campaign were stolen in a cyber intrusion days after the campaign declared it had been hacked by Iran.",
      "publishedAt": "2024-08-12T21:15:13Z",
      "title": "FBI says it is investigating after Trump campaign said sensitive documents were hacked by Iran",
      "url": "https://apnews.com/02a44ea734c8ee92c4d3a576af7a79fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/769ca839004b4cb0a33cb7d1dae9d8da/3000.jpeg"
    },
    {
      "author": "MICHAEL HILL and PHILIP MARCELO",
      "description": "ALBANY, N.Y. (AP) — A judge ruled Monday that independent presidential candidate Robert F. Kennedy Jr.’s name should not appear on New York’s ballot, ruling that he falsely claimed a New York residence on nominating petitions despite living in California.",
      "publishedAt": "2024-08-12T22:59:47Z",
      "title": "Judge rules against RFK Jr. in fight to be on New York’s ballot, says he is not a state resident",
      "url": "https://apnews.com/faaf0c8d7638cdfcdbe3c4eb7b542eef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af51d1297fa84f7db125b6ba3b3c6471/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Republican presidential nominee Donald Trump has been spreading false claims that an image of thousands of people waiting at Detroit's airport as Democrat Kamala Harris arrived for a campaign rally was fabricated with the help of artificial intelligence.",
      "publishedAt": "2024-08-12T20:57:57Z",
      "title": "Trump falsely claims a crowd photo from Harris' campaign rally in Detroit was created using AI",
      "url": "https://apnews.com/ff54a66d8e3197c90068ba94847297cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be8b2e204dc1423d891b2f58c8c1c04b/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — Mars may be drenched beneath its surface, with enough water hiding in the cracks of underground rocks to form a global ocean, new research suggests.",
      "publishedAt": "2024-08-12T19:04:13Z",
      "title": "New Mars study suggests an ocean's worth of water may be hiding beneath the red dusty surface",
      "url": "https://apnews.com/c50281cac5b27d6662eab97140d10c7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c23c78782d754701bb669324877a6933/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukraine's top military commander says his forces now control 1,000 square kilometers (386 square miles) of Russia's neighboring Kursk region, the first time a Ukrainian military official has publicly commented on the gains of the lightning incursion that has embarrassed the Kremlin.",
      "publishedAt": "2024-08-12T09:24:25Z",
      "title": "Top Ukrainian commander says his forces now control almost 390 square miles of Russia's Kursk region",
      "url": "https://apnews.com/afa42b9613323901bef07800ac2cae9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49d29b18e72848adb4fc8e97e1d62a71/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "USA Gymnastics officials say an arbitration panel won't reconsider a decision asking gymnast Jordan Chiles to return the bronze medal she was awarded in the floor exercise at the Paris Olympics.",
      "publishedAt": "2024-08-12T22:54:40Z",
      "title": "Jordan Chiles medal inquiry: USA Gymnastics says arbitration panel won't reconsider decision",
      "url": "https://apnews.com/b982ecfff1e846c57b0e1cb524a84cad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/897c653e592140c3a9a96bb6dab606b8/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — The pilot of the plane that crashed down in Brazil last week was buried Monday in Sao Paulo, becoming the first person laid to rest among the 62 victims, as authorities continue working to determine what exactly caused the accident.",
      "publishedAt": "2024-08-12T23:16:22Z",
      "title": "Burials begin for victims of Brazil plane crash that killed 62, as questions remain about its cause",
      "url": "https://apnews.com/579ba05dcd9671c22e1ed9637055e951",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db715c6958124e87a15d4eadf7d2e2fa/2117.jpeg"
    },
    {
      "author": "HALLIE GOLDEN",
      "description": "SEATTLE (AP) — Coastal tribes in the Pacific Northwest experience some of the most severe effects of climate change — from rising seas to severe heat — but face an array of bureaucratic barriers to access government funds meant to help them adapt, a report released Monday found.",
      "publishedAt": "2024-08-12T07:02:28Z",
      "title": "Pacific Northwest tribes are battered by climate change but fight to get money meant to help them",
      "url": "https://apnews.com/df5bb68ad8eabbe304712161d8d77b77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c901e59219d843ae8fe7e0a199973b5e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}