{
  "articles": [
    {
      "author": "SAMY MAGDY",
      "description": "Israel says it has begun preparations for the departure of large numbers of Palestinians from the Gaza Strip in line with President Donald Trump’s plan for the territory. Officials meanwhile said Egypt has launched an diplomatic blitz behind the scenes to try and head off the plan. The Palestinians and much of the international community have rejected Trump’s proposal, fearing Israel will never allow the refugees to return and that it would destabilize the region. Egypt has warned that such a plan could undermine its historic peace treaty with Israel. Israeli leaders have welcomed Trump’s proposal but rights groups say the forcible relocation of a civilian population would amount to “ethnic cleansing.”",
      "publishedAt": "2025-02-06T09:42:49Z",
      "title": "Israel begins preparations for Gaza exodus as Egypt lobbies against Trump plan",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-egypt-trump-displacement-bc1c43f80655190824a5de4eb1d310cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/69b494b/2147483647/strip/true/crop/8229x4629+0+429/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F8b%2F8c6ea6acae0c8a347059673df9fa%2F9ecb1af51bba45cca887d106d21c88fe"
    },
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump's comments that the U.S. should take long-term control of war-shattered Gaza and that the area's residents should be permanently resettled have been contradicted by top people in his administration. Secretary of State Marco Rubio said Wednesday that the area’s residents would only be relocated on an interim basis as the U.S. rebuilds Gaza. White House press secretary Karoline Leavitt says U.S. taxpayers won’t finance rebuilding Gaza and insisted that Trump had “made it clear” that the people of Gaza would be moved out of the area only temporarily.",
      "publishedAt": "2025-02-06T01:08:57Z",
      "title": "In their own words: What Trump said about Gaza and how top administration officials contradicted him",
      "url": "https://apnews.com/article/trump-rubio-leavitt-gaza-permanent-temporary-funding-53d3c737d24dd8ea290e0e7962546575",
      "urlToImage": "https://dims.apnews.com/dims4/default/f65ec3e/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F02%2F6dd641b6daaf0771be15c4a13286%2Fa993841eb8c0462cbce98ba5668386f3"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "The group Arab Americans for Trump is renaming itself Arab Americans for Peace after President Donald Trump said the U.S. would “take over” the Gaza Strip. The group's chairman, Bishara Bahbah, told The Associated Press on Wednesday it's “completely opposed to the idea of the transfer of Palestinians from anywhere in Historic Palestine.” The group helped facilitate meetings between Arab American community leaders and Trump’s allies ahead of the 2024 presidential election. The name change came after Trump held a Tuesday press conference alongside Israeli Prime Minister Benjamin Netanyahu and proposed the U.S. take “ownership” in redeveloping Gaza into “the Riviera of the Middle East.”",
      "publishedAt": "2025-02-05T16:59:23Z",
      "title": "Pro-Trump Arab American group changes its name after the president's Gaza 'Riviera' comments",
      "url": "https://apnews.com/article/arab-americans-trump-gaza-name-peace-479f6777cac7bac52fb098daa0821cb5",
      "urlToImage": "https://dims.apnews.com/dims4/default/a19a77c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F79%2F6d79cc612da3a83e8ad482484f57%2Ffcb9c681068644c198d5f752c918876e"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "An American-Israeli hostage freed from Hamas captivity was forced to lie down at all times in a small room for weeks. That's according his brother, Lee Siegel. For most of Keith Siegel's ordeal, there was little electricity or running water. Hostages are returning after 15 months in captivity as part of a ceasefire deal between Israel and Hamas and with their freedom, the first details of their ordeals are emerging. Their conditions are shining a light on the roughly 75 captives who remain in Gaza and are driving the families of the freed captives to pledge to keep up their public campaign until everyone is free.",
      "publishedAt": "2025-02-06T08:32:35Z",
      "title": "'What can I do to bring the others home?' Hostages freed from Hamas captivity vow all must return",
      "url": "https://apnews.com/article/israel-freed-hostages-hamas-gaza-ceasefire-d2cc2f109b96b210f2613bd98fc2b806",
      "urlToImage": "https://dims.apnews.com/dims4/default/affd4e0/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F87%2F46fa691be794d9b03affc412dc37%2F5625e60bd3ab4d1eb63643ff2e8409a0"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, JULIA FRANKEL",
      "description": "Stunned Palestinians rejected President Donald Trump's proposal to expel them from the Gaza Strip so that the U.S. could take over the territory and rebuild it for others. Many saw the comments as an effort to erase them from their homeland, a continuation of the “Nakba,” or “Catastrophe,\" their name for the expulsion and displacement of hundreds of thousands of Palestinians from what is now Israel during the 1948 war. Palestinians displaced during the Israel-Hamas war have shown a powerful determination to return to their homes, with hundreds of thousands during the current ceasefire flooding back to neighborhoods devastated by Israeli bombardment and offensives.",
      "publishedAt": "2025-02-05T17:42:24Z",
      "title": "'I won't leave. Put that in your brain.' Palestinians reject Trump's call to expel them from Gaza",
      "url": "https://apnews.com/article/gaza-trump-nakba-israel-netanyahu-f8d1a4f840d4c440cfddb03987fa53cd",
      "urlToImage": "https://dims.apnews.com/dims4/default/4840ad5/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2F4f%2F33b8ff158ef327b4e25da2a54925%2F561a3006781c4b72877d5363a0a05e63"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "Vice President JD Vance recently cited medieval Catholic theology in justifying the immigration crackdown under President Donald Trump. “Just google ‘ordo amoris,’” he posted Jan. 30 on the social media platform X. The concept has been translated as “order of love” or “order of charity.” The ancient St. Augustine said everyone and everything should be loved in its own proper way. “But since you cannot do good to all, you are to pay special regard to those who ... are brought into closer connection with you,\" Augustine wrote. The medieval St. Thomas Aquinas echoed this theme but added sometimes one must help a stranger in greater need than a family member.",
      "publishedAt": "2025-02-06T13:03:21Z",
      "title": "What is 'ordo amoris?' Vice President JD Vance invokes this medieval Catholic concept",
      "url": "https://apnews.com/article/jd-vance-catholic-theology-migration-e868af574fb2e742c6ed3d756c569769",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6ae01d/2147483647/strip/true/crop/6199x3487+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F71%2Fde645028d4307cc7dbd89ac014c0%2F5e907158d6ad4eb5a74a999b9d3b8a92"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "Honeywell plans to separate its automation and aerospace technologies businesses from the U.S. industrial conglomerate, following similar actions by companies such as General Electric and Alcoa. Honeywell said Thursday that the move means there will be three publicly listed companies, when also accounting for its previously announced plan to spin off its advanced materials business.",
      "publishedAt": "2025-02-06T11:31:25Z",
      "title": "Honeywell, one of the few remaining US industrial conglomerates, will split into three companies",
      "url": "https://apnews.com/article/honeywell-24e46c1e34bfeb702acecead3fd98060",
      "urlToImage": "https://dims.apnews.com/dims4/default/61039d8/2147483647/strip/true/crop/2564x1442+0+134/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Fa4%2Ff188d1f11b8d667ce5594847b145%2F01994a622abd4641a28082f68af20669"
    },
    {
      "author": "CHRISTOPHER WEBER",
      "description": "A California utility says its equipment likely sparked a wildfire in Los Angeles that broke out the same day as two massive blazes in the area killed at least 29 people and destroyed thousands of homes. The admission Thursday by Southern California Edison over its likely role in the Hurst Fire came in a required filing with state utility regulators. The Hurst Fire did not destroy any structures or result in any deaths. In a second filing, the utility said it is looking into whether an idle transmission line sparked the deadly Eaton Fire. But it maintains that there’s no evidence that its equipment was responsible for starting that blaze.",
      "publishedAt": "2025-02-06T16:23:18Z",
      "title": "Utility says its equipment likely started a small blaze that erupted during January's LA firestorm",
      "url": "https://apnews.com/article/california-wildfires-socal-edison-hurst-fire-cause-1204b0bd207a01aa41dc617d6edc0ff2",
      "urlToImage": "https://dims.apnews.com/dims4/default/93e7267/2147483647/strip/true/crop/3413x1920+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2Fe0%2Fc057a2d6608ccb3b71eac73d4267%2Fa18b836b7aa54f9c9340003eb285ce19"
    },
    {
      "author": "CHRIS MEGERIAN, COLLIN BINKLEY, BYRON TAU",
      "description": "The deadline for federal workers to receive financial incentives to quit is approaching. More than 2 million employees have until Thursday at 11:59 p.m. EST to decide what to do. Administration officials have been increasing their pressure on workers to leave, saying that furloughs or layoffs could come next. They also said that workers would have fewer civil service protections and higher scrutiny if they remain. The attempt to downsize the federal workforce has been spearheaded by Elon Musk, and it's part of President Donald Trump's effort to overhaul Washington. Democrats and unions have warned against accepting the deal, saying workers could be stiffed.",
      "publishedAt": "2025-02-06T05:02:40Z",
      "title": "Is it real or is it a trick? Federal workers debate legitimacy of buyout offer as deadline nears",
      "url": "https://apnews.com/article/buyout-offer-deadline-trump-federal-workers-ce854b19c41b90cd657f75cf09511e96",
      "urlToImage": "https://dims.apnews.com/dims4/default/ad5835d/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F41%2Fcd50c4d3a03a9665ef5c4d941aa3%2Fae847ce1a1704b84b1dfd0696bf28f68"
    },
    {
      "author": "ALI SWENSON, CHRIS MEGERIAN",
      "description": "The emergence of X owner Elon Musk as the most influential figure around President Donald Trump has created an extraordinary dynamic — a White House adviser who's using one of the world’s most powerful information platforms to sell the government’s talking points while threatening its detractors. Musk's use of the social media platform he owns has become both a cudgel and a megaphone for the Republican administration. Democracy experts say that matters because as more Americans flock to social media to get their news, the arbiters of who controls the flow of information on those sites have enormous power to shape the electorate’s perspective.",
      "publishedAt": "2025-02-06T16:07:30Z",
      "title": "Musk uses his X ownership and White House position to push Trump priorities, intimidate detractors",
      "url": "https://apnews.com/article/musk-doge-trump-x-democracy-e581786ee599f8b047d40c2e2c7ad9da",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d03412/2147483647/strip/true/crop/7693x4327+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F0c%2F03c444621811b0c8318a0c409d5d%2Fb024f038517a49e580c9127a26701216"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}