{
  "articles": [
    {
      "author": null,
      "description": "Ukraine's air force says that Russia has fired a record 728 Shahed and decoy drones at Ukraine overnight as well as 13 missiles. It was the latest escalation amid mounting Russian aerial attacks in the more than three-year war. Ukrainian President Volodymyr Zelenskyy said Wednesday that the city of Lutsk in Ukraine’s northwest that borders Poland and Belarus was the hardest hit. Ten other regions were also struck. Lutsk is home to airfields used by the Ukrainian army. Cargo planes and fighter jets routinely fly over the city. An air force statement said that Ukraine’s air defenses shot down 296 drones and seven missiles while 415 more drones were lost from radars or jammed.",
      "publishedAt": "2025-07-09T07:11:09Z",
      "title": "Russia launches record drone attack on Ukraine",
      "url": "https://apnews.com/article/russia-record-drone-attack-ukraine-war-fe3d23673b9b5696bb5097def9ed0775",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d9f5f8/2147483647/strip/true/crop/2000x1125+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2F0a%2Fd5f871b3bcad0cc64f9e4888004b%2F47f16d779dc349b29a8a962d69325909"
    },
    {
      "author": null,
      "description": "Crews are using backhoes and their bare hands to dig through piles of debris that stretch for miles in the search for more than 160 people believed to be missing in the flash floods that laid waste to Texas Hill Country. Over 100 bodies have been recovered so far, but the large number of missing suggested that the full extent of the catastrophe was still unclear five days after the disaster. Gov. Greg Abbott says the efforts will not stop until every missing person is accounted for. Officials have been seeking more information about those who were in the popular tourist destination during the Fourth of July holiday weekend.",
      "publishedAt": "2025-07-09T05:50:22Z",
      "title": "Search goes on for more than 160 missing after deadly Texas flash floods",
      "url": "https://apnews.com/article/texas-floods-missing-deaths-16b0dfef4509cfef5a92a0c0598dc562",
      "urlToImage": "https://dims.apnews.com/dims4/default/938d0af/2147483647/strip/true/crop/8212x4619+0+427/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2Fa6%2F16b7ddabcb08bef60ae81ddd60f0%2Fec29cd39225c4d60993963ad9dac2810"
    },
    {
      "author": null,
      "description": "President Joe Biden’s White House physician is refusing answer questions as part of the House Republican investigation into Biden’s health in office. Dr. Kevin O’Connor's lawyers say O'Connor invoked doctor-client privilege and his rights under the Fifth Amendment before the House Oversight Committee on Wednesday. Republicans are investigating Biden’s actions in office and questioning whether the Democrat's use of an autopen may have been invalid. Biden has strongly denied he was not in a right state of mind at any point while in office, calling the claims “ridiculous and false.” Oversight Committee Chair Rep. James Comer of Kentucky says O’Connor’s decision not to testify makes it \"clear there was a conspiracy.”",
      "publishedAt": "2025-07-09T14:42:10Z",
      "title": "Biden's ex-doctor doesn't answer questions in House Republican probe",
      "url": "https://apnews.com/article/biden-doctor-kevin-oconnor-testimony-5c2a75c6bec319bb4ff8a417993e3d6c",
      "urlToImage": "https://dims.apnews.com/dims4/default/64652bf/2147483647/strip/true/crop/5316x2990+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2Fd2%2Fea6a20a49cce037a18e8934c0ffd%2F0a74f9372176409d82cd681d580ccb55"
    },
    {
      "author": null,
      "description": "Measles cases in the U.S. are at their highest in three decades. The U.S. Centers for Disease Control and Prevention says the U.S. has 1,288 cases since the beginning of the year. That’s higher than 2019, when there 1,274 cases driven by 22 outbreaks over 12 months. Seventeen states have seen outbreaks this year. Experts fear the U.S. may lose its status as having eliminated measles. There are also large outbreaks of the vaccine-preventable disease in Mexico and Canada.",
      "publishedAt": "2025-07-09T14:50:51Z",
      "title": "The US is having its worst year for measles in more than three decades",
      "url": "https://apnews.com/article/measles-outbreak-us-texas-mmr-vaccine-rfk-144ed193e13de675a750e52a505423e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/006cd24/2147483647/strip/true/crop/8474x4767+0+442/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F09%2F3e7297b0d417169d5c162a80cfb8%2Feb1949e0ddfa4c3badb288e84bbc0bcb"
    },
    {
      "author": null,
      "description": "Chipmaker Nvidia became the first public company to top $4 trillion in value on Wednesday after two-year investor frenzy. Nvidia shares rose 2.5%, or $3.97, in early trading Wednesday, topping $164 each. At the beginning of 2023, Nvidia shares were around $14 each.",
      "publishedAt": "2025-07-09T14:17:28Z",
      "title": "Nvidia becomes the first company to reach $4 trillion in value",
      "url": "https://apnews.com/article/nvidia-4-trillion-chipmaker-7947e86a7ee9a994b9f16c3c0779b74f",
      "urlToImage": "https://dims.apnews.com/dims4/default/2548afd/2147483647/strip/true/crop/4798x2699+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F76%2Fb799b8b76617c150ca8898434dd3%2Fa4f971a1694b464eb704c1ee71b7d866"
    },
    {
      "author": null,
      "description": "As talks for a ceasefire in the Gaza Strip resume, Palestinians in the battered enclave say they are desperate for deal to end the war between Israel and Hamas. At least 40 Palestinians were killed overnight, according to Nasser Hospital in the southern city of Khan Younis. The strikes come as Israeli Prime Minister Benjamin Netanyahu is in Washington meeting U.S. President Donald Trump. Israel and Hamas are considering a new U.S.-backed ceasefire proposal that would pause the war, free Israeli hostages and send much-needed aid into Gaza.",
      "publishedAt": "2025-07-09T09:11:28Z",
      "title": "40 Palestinians killed in Gaza as Netanyahu and Trump meet over a ceasefire",
      "url": "https://apnews.com/article/israel-gaza-hamas-palestinians-war-news-07-09-2025-b70b2de81552e38b98be7e54cf2efd9f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9524ee/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F28%2Fb21fe677271443d4a08c02fd9e0d%2Faaa4713aa45a483ea29607167ccc8f19"
    },
    {
      "author": null,
      "description": "Europe’s top human rights court has delivered a series of rulings against Russia, stating in the first ruling that Russia has violated international law during the conflict in Ukraine, the first time an international court has found Moscow responsible for human rights abuses since the full-scale invasion in 2022. The court also ruled Wednesday that Russia was behind the downing of Flight MH17, the first time an international court has found Moscow responsible for the 2014 tragedy that claimed 298 lives. Families of the victims of the MH17 disaster see the decision as an important milestone in their 11-year quest for justice.",
      "publishedAt": "2025-07-09T04:05:36Z",
      "title": "European human rights court rules on Russia's conflict in Ukraine and Flight MH17",
      "url": "https://apnews.com/article/ukraine-russia-european-human-rights-court-mh17-1bac36842f8a4cfe0e3e787f0fab0c1f",
      "urlToImage": "https://dims.apnews.com/dims4/default/d29bbf0/2147483647/strip/true/crop/4620x2599+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F97%2F23261ad4c2f5ee97dcbf0fcb0e62%2Fec6564f567b34e51b9959f09130e333c"
    },
    {
      "author": null,
      "description": "X CEO Linda Yaccarino said she’s stepping down after two years running Elon Musk’s social media platform. Yaccarino posted a positive message Wednesday about her tenure at the company formerly known as Twitter and said “the best is yet to come as X enters a new chapter with” Musk’s artificial intelligence company xAI, maker of the chatbot Grok. Musk hired Yaccarino, a veteran ad executive, in May 2023 buying Twitter for $44 billion in late 2022. He said at the time that Yaccarino’s role would be focused mainly on running the company’s business operations, leaving him to focus on product design and new technology.",
      "publishedAt": "2025-07-09T15:03:40Z",
      "title": "X CEO Linda Yaccarino resigns",
      "url": "https://apnews.com/article/x-ceo-linda-yaccarino-elon-musk-grok-39ba18ec4851445967ce114a0a452928",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Stocks are higher on Wall Street as the Trump administration seeks to win more deals with global trading partners. The S&P 500 index was up 0.7% in early trading Wednesday. The Dow Jones Industrial Average was up 224 points, or 0.5%, and the Nasdaq composite rose 1.1%. Treasury yields slipped in the bond market. Crude oil and other energy prices were lower. Copper prices eased after spiking a day earlier as President Donald Trump said he would impose 50% tariffs on imports of the metal. European markets were higher and Asian markets closed mixed.",
      "publishedAt": "2025-07-09T04:48:15Z",
      "title": "Wall Street opens higher as trade talks continue",
      "url": "https://apnews.com/article/financial-markets-tariffs-b51a81fa0ad373b0c6c9280d9b397af8",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ada652/2147483647/strip/true/crop/4700x2644+0+245/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2Fe3%2Ff2bace1da5776e7b866b0468bb99%2F599d7c21a373439e80c95b6cd0d52a31"
    },
    {
      "author": null,
      "description": "Officials say monsoon rains in southern New Mexico triggered flash flooding that killed three people and was so intense an entire house was swept downstream in a mountain village that is a popular summer retreat. The village of Ruidoso said in a statement that a man, a 4-year-old girl and 7-year-old boy were swept away Tuesday by floodwaters. Three people earlier had been reported missing, but it wasn’t immediately clear early Wednesday whether those were the same three who died. The water in the Ruidoso area had receded by Tuesday night and search and rescue and swift water rescue teams were scouring the town for the missing people.",
      "publishedAt": "2025-07-09T10:33:51Z",
      "title": "New Mexico flooding leaves 3 dead, officials say",
      "url": "https://apnews.com/article/flash-floods-new-mexico-mountain-village-ruidoso-35b6588030ac6ba506b620baf4dfcce4",
      "urlToImage": "https://dims.apnews.com/dims4/default/db9cd48/2147483647/strip/true/crop/1066x600+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2Fb6%2F1a4f0ed2eff0ec2bb2c89865b0de%2F1fcef2725b71413abaff7097428e13bf"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}