{
  "articles": [
    {
      "author": null,
      "description": "The man suspected of killing a Minnesota lawmaker and wounding another has been taken into custody, ending a nearly two-day search that put the entire state on edge. Vance Boelter was arrested Sunday evening. Former Democratic House Speaker Melissa Hortman and her husband, Mark, were killed in their Brooklyn Park home early Saturday in the northern Minneapolis suburbs. Sen. John Hoffman, also a Democrat, and his wife, Yvette, were injured at their Champlin home, about 9 miles away. Boelter was arrested in a rural area in Sibley County, southwest of Minneapolis.",
      "publishedAt": "2025-06-16T11:57:42Z",
      "title": "Man suspected of shooting 2 Minnesota lawmakers is in custody after surrendering to police",
      "url": "https://apnews.com/article/minnesota-lawmakers-shot-vance-boelter-e9fc59e4307eb3461881f027ae626073",
      "urlToImage": "https://dims.apnews.com/dims4/default/c432368/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F6d%2Ff0c7d9812fd54acc63f8e2659251%2Fb1fa88dd3a8240c59d31af03c56357f2"
    },
    {
      "author": null,
      "description": "Iran has launched a new wave of missile attacks on Israel, triggering air raid sirens across the country as emergency services reported at least five killed and dozens more wounded in the fourth day of open warfare between the regional foes. Iran announced it had launched some 100 missiles and vowed further retaliation for Israel’s surprise attack on its nuclear program and military leadership, which has killed at least 224 in the country since it began last Friday. In announcing the latest salvo after a weekend of escalating tit-for-tat attacks, Iran’s paramilitary Revolutionary Guard vowed that further rounds of strikes would be “more forceful, severe, precise and destructive than previous ones.”",
      "publishedAt": "2025-06-16T03:22:11Z",
      "title": "Iran renews missile attacks on Israel, killing 5 and wounding dozens",
      "url": "https://apnews.com/article/israel-iran-missile-attacks-nuclear-news-06-16-2025-c98074e62ce5afd4c3f6d33edaffa069",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0d1999/2147483647/strip/true/crop/7008x3942+0+365/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2Fd0%2F99fa7dfec960317a8d6039efe3df%2F043ef287fb774cc5961b4fba662da29b"
    },
    {
      "author": null,
      "description": "A judge has dismissed a juror in the sex trafficking trial of Sean “Diddy” Combs after concluding that his conflicting answers about where he lives might indicate he had an agenda or wanted to stay on the jury for a purpose. Judge Arun Subramanian made the ruling on Monday, rejecting arguments by Combs' attorneys that it would disrupt the diversity of the jury to replace the Black man with a white juror. Subramanian had first announced late Friday that he was dismissing the juror, but multiple defense lawyers protested. The judge delayed dismissing the juror until Monday, when the trial entered its sixth week.",
      "publishedAt": "2025-06-16T14:53:17Z",
      "title": "Juror dismissed in Diddy trial despite protests by Combs' lawyers",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-juror-removed-5f4a05fbe191d7a8ad8597ee23432d49",
      "urlToImage": "https://dims.apnews.com/dims4/default/201d725/2147483647/strip/true/crop/3000x1688+0+320/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F4d%2F05f043d014ab053a93d70f7b0dd2%2F119115ab5d304c789794a1e8286147e8"
    },
    {
      "author": null,
      "description": "The Louvre Museum has failed to open on time Monday, leaving thousands of visitors stuck in long, unmoving lines. A union representative said staff at the world's most-visited museum are protesting working conditions. She said the disruption was caused by a spontaneous movement among front-of-house staff, including gallery attendants, reception, and security workers. A few months ago, President Emmanuel Macron unveiled a sweeping decade-long plan to rescue the Louvre from precisely the problems now boiling over — water leaks, dangerous temperature swings, outdated infrastructure, and foot traffic far beyond what the museum can handle. But for workers on the ground, that promised future feels distant.",
      "publishedAt": "2025-06-16T10:45:46Z",
      "title": "Louvre shuts down in a staff strike, sounding the alarm on overtourism",
      "url": "https://apnews.com/article/louvre-museum-paris-closed-lines-delay-2bbf9be4f49de739fd14dd4d908e4d72",
      "urlToImage": "https://dims.apnews.com/dims4/default/40e9a36/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F8a%2F91940294f1e1cbc88f2ec0b46bff%2F65e955a905714b5583f4b7634ce16d91"
    },
    {
      "author": null,
      "description": "Calm is returning to Wall Street. U.S. stocks are rallying Monday, while oil prices are giving back some of their initial spurts following Israel’s attack on Iranian nuclear and military targets at the end of last week. The S&P 500 climbed 1.1% and was on track to reclaim nearly all of its drop from Friday. The Dow Jones Industrial Average added 392 points, and the Nasdaq composite rose 1.5%. They joined a worldwide rise for stock prices, stretching from Asia to Europe. The price for a barrel of benchmark U.S. oil fell by more than 3%, while gold's price eased.",
      "publishedAt": "2025-06-16T04:44:09Z",
      "title": "Stock markets rally and crude oil prices ease",
      "url": "https://apnews.com/article/stocks-markets-iran-oil-inflation-73ce222b5b803474c48ff0008f5a8626",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a7b5df/2147483647/strip/true/crop/5073x2854+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F95%2Fc4e8112e10253e76490a843adec1%2F3c2935cb20f94971a25afd5f113c4219"
    },
    {
      "author": null,
      "description": "The jury has returned for its first full day of deliberations in the second murder trial of Karen Read, who is charged with killing her Boston police officer boyfriend. Jurors began deliberations late last week, more than a month after the trial started. Read is accused of striking John O’Keefe with her car outside a suburban Boston house party and leaving him to die in the snow in January 2022. She has been charged with second-degree murder, manslaughter and leaving the scene. Read’s lawyers say O’Keefe was beaten, bitten by a dog, then left outside a home in Canton in a conspiracy orchestrated by the police that included planting evidence against Read.",
      "publishedAt": "2025-05-27T20:07:10Z",
      "title": "Jury begins first full day deliberating in Karen Read murder trial about killing of police boyfriend",
      "url": "https://apnews.com/article/karen-read-murder-trial-police-massachusetts-98273d143dbf781a57c78fdaf64c0c32",
      "urlToImage": "https://dims.apnews.com/dims4/default/3fc7d20/2147483647/strip/true/crop/4064x2286+0+212/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2Fba%2F09e481beba9d7757a25cbc35b8c3%2F0cd3fb2cd57648f398fa22a4175e76b4"
    },
    {
      "author": null,
      "description": "The Trump family company says it's launching a mobile phone company, the latest in a string of ventures that have been announced while Donald Trump is in the White House. Eric Trump, one of President Donald Trump’s sons who will run the company, said Monday that the new company would build its own phones and maintain a call center in the U.S. The new business follows several real estate deals for towers and resorts in the Middle East, including a golf development in Qatar announced in April, and a $1.5 billion partnership to build golf courses, hotels and real estate projects in Vietnam.",
      "publishedAt": "2025-06-16T12:44:59Z",
      "title": "Trump family says it's launching a mobile phone company",
      "url": "https://apnews.com/article/trump-mobile-phone-white-house-business-361455bb3c65593bade7d4edfe4da7e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7865735/2147483647/strip/true/crop/3008x1692+0+118/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Ff4%2F4d56348ae948df6afdf7bb1fb394%2Fc6ecb9858c3e4845a06d081010b29d3f"
    },
    {
      "author": null,
      "description": "When U.S. President Donald Trump last came to Canada for a Group of Seven summit, the enduring image was of him seated with his arms folded defiantly as then-German Chancellor Angela Merkel stared daggers at him. If there is a shared mission at this year’s G7 summit, which begins Monday in Canada’s Rocky Mountains, it's a desire to minimize any fireworks at a moment of combustible tensions. Trump already has hit several dozen nations with severe tariffs that risk a global economic slowdown. There's little progress on settling the wars in Ukraine and Gaza and now a new and escalating conflict between Israel and Iran over Tehran’s nuclear program.",
      "publishedAt": "2025-06-16T04:02:29Z",
      "title": "G7 summit opening in Canada with a focus on trade, wars and not riling Trump",
      "url": "https://apnews.com/article/trump-g7-carney-canada-trade-iran-75c17fffe96c9031d8ebb22af923d86c",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec4f4a4/2147483647/strip/true/crop/4592x2583+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F01%2F61389d040cdf8673d4e1e6bb6adc%2Fc0676942a7ed4eed8d8bc518a1e6d97f"
    },
    {
      "author": null,
      "description": "It was 160 years ago that enslaved people in Galveston, Texas, learned they had been freed — after Civil War's end and two years after President Abraham Lincoln’s Emancipation Proclamation. Many Americans are celebrating Juneteenth, that day in 1865 when a Union officer announced liberation. For generations, Black Americans have recognized the end of one of history’s darkest chapters with joy — such as parades or cookouts. It would take another century and a half and lots of rallying until President Joe Biden made Juneteenth a federal holiday in 2021. This year will be the first Juneteenth under the second Trump administration, which has banned DEI initiatives including Black history content.",
      "publishedAt": "2025-06-16T04:28:09Z",
      "title": "Juneteenth: A guide to the holiday, which started 160 years ago",
      "url": "https://apnews.com/article/juneteenth-galveston-texas-1f8b201949c3197932d68036c0472686",
      "urlToImage": "https://dims.apnews.com/dims4/default/a5dcd74/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F82%2F6d455a2cda447f0d4be336f64593%2Fad9491d2664e4f01b5f2408f072df359"
    },
    {
      "author": null,
      "description": "A pair of European satellites have created the first artificial solar eclipses through precise and fancy formation flying. The result is hours of on-demand totality for scientists. The European Space Agency released the eclipse pictures Monday. Launched late last year, the two spacecraft have produced 10 solar eclipses so far. They're still in the checkout phase of the mission, with scientific observations yet to begin. But scientists are already thrilled and anticipate nearly 200 total solar eclipses over the next two years, each one lasting several hours.",
      "publishedAt": "2025-06-16T14:32:18Z",
      "title": "How a pair of satellites are mimicking solar eclipses in space",
      "url": "https://apnews.com/article/artificial-solar-eclipse-esa-474fe13392398e247f3ba501bf4fe191",
      "urlToImage": "https://dims.apnews.com/dims4/default/67ea07a/2147483647/strip/true/crop/2048x1152+0+448/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1c%2F01%2F78d9a92f1744c5c7580dcb0d499f%2F659047382b2f4727a955f026404ac182"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}