{
  "articles": [
    {
      "author": "Eric Tucker, Michael R. Sisak, Alanna Durkin Richer",
      "description": "The Justice Department says it's releasing more than 3 million pages of documents in the latest Jeffrey Epstein disclosure. The documents were disclosed Friday under a law intended to reveal what the government knew about the millionaire financier’s sexual abuse of young girls and his interactions with the rich and powerful. The files include some of the several million pages of records officials said were withheld from an initial release of documents in December. Hundreds of department attorneys have been reviewing files to black out material that could reveal the identities of victims. Epstein killed himself in a New York jail in 2019 while awaiting trial.",
      "publishedAt": "2026-01-30T16:07:39Z",
      "title": "Justice Department releases more Epstein files",
      "url": "https://apnews.com/article/epstein-files-justice-department-trump-ed743598c320b94bd9d91631618678d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d9b633/2147483647/strip/true/crop/4790x3192+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2F88%2F13679738e5005c6e0a3c5709eb10%2Fee8342af102640afae1f5bd047f029be"
    },
    {
      "author": "Alanna Durkin Richer, Eric Tucker",
      "description": "Journalist Don Lemon has been arrested after he entered a Minnesota church and recorded anti-immigration enforcement protesters who disrupted a service. The protest Jan. 18 increased tensions between residents and the Trump administration. It is unclear what charge or charges Lemon is facing. The arrest came after a magistrate judge last week rejected prosecutors’ initial bid to charge the journalist. Lemon was taken into custody by federal agents in Los Angeles, where had been covering the Grammy Awards. His lawyer said Lemon will \"fight these charges vigorously and thoroughly in court.”",
      "publishedAt": "2026-01-30T13:23:24Z",
      "title": "Journalist Don Lemon arrested in protest at Minnesota church",
      "url": "https://apnews.com/article/don-lemon-arrest-minnesota-church-service-d3091fe3d1e37100a7c46573667eb85c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d9751f7/2147483647/strip/true/crop/3500x2332+0+22/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0d%2F20%2F083e9aa645905585d6f1eb2dc101%2Fbf9fd1c15d924e358d2e60acd56da164"
    },
    {
      "author": "Jack Brook, Jim Mustian, Michael Biesecker",
      "description": "Nurses in Minneapolis doubted federal immigration officers' claims about a Mexican immigrant's severe injuries. ICE agents said Alberto Castañeda Mondragón ran headfirst into a wall while handcuffed. But hospital staff found his injuries inconsistent with that account. The seemingly implausible explanation from ICE is just one example of recent encounters that have undermined the agency’s credibility at Minneapolis hospitals and contributed to mounting friction between medical staff and immigration officers. Workers at the Hennepin County facility say ICE officers have restrained patients in defiance of hospital rules and stayed at their sides for days. The agents have also lingered around the campus and pressed people for proof of citizenship.",
      "publishedAt": "2026-01-31T05:16:52Z",
      "title": "ICE presence at hospitals triggers friction with workers",
      "url": "https://apnews.com/article/immigration-enforcement-minneapolis-hospitals-32cd5ca61d495e155d43b7cfd5e563b9",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d7da3a/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F09%2F8787ac778cb99321148ac51a4f23%2F6937c13d78d24bc3accae6bc3a1858c5"
    },
    {
      "author": "Tom Verdin",
      "description": "A federal judge has blocked certain federal agencies from requesting citizenship status when distributing voter registration forms. The ruling Friday is the latest blow to a wide-ranging executive order on elections President Donald Trump signed last year. U.S. District Judge Colleen Kollar-Kotelly ruled that the Constitution’s separation of powers, giving states and to an extent Congress authority over election rules, lay at the heart of the case. The ruling said agencies will not be allowed to “assess citizenship” before providing a federal voter registration form to people enrolling in public assistance programs. It also barred the Secretary of Defense from requiring documentary proof of citizenship when military personnel register to vote or request ballots.",
      "publishedAt": "2026-01-31T00:59:04Z",
      "title": "Judge deals another setback to Trump's election executive order",
      "url": "https://apnews.com/article/trump-elections-executive-order-citizenship-ruling-305a9cf5f90402369305879ef0f319f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/1c4b2e9/2147483647/strip/true/crop/8293x5526+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fca%2Fb60c72005c4a9d0bc5a2452641af%2Fa40ecf233a574fc295c05b9a935ad848"
    },
    {
      "author": "Regina Garcia Cano",
      "description": "Venezuela’s acting President Delcy Rodríguez has announced an amnesty bill that could lead to the release of hundreds of prisoners, including opposition leaders, journalists and human rights activists detained for political reasons. The measure had long been sought by the United States-backed opposition. It is the latest concession Rodríguez has made since taking the reins of the country on Jan. 3 after the brazen seizure of then-President Nicolás Maduro in a U.S. military attack in Venezuela’s capital, Caracas. Rodríguez told a gathering of justices, magistrates and others that the ruling party-controlled National Assembly would take up the bill with urgency.",
      "publishedAt": "2026-01-31T00:07:53Z",
      "title": "Venezuela announces amnesty bill that could lead to release of political prisoners",
      "url": "https://apnews.com/article/venezuela-political-prisoners-maduro-rodriguez-trump-amnesty-f116c004d8f480687ae8671093f8dad8",
      "urlToImage": "https://dims.apnews.com/dims4/default/037cd8f/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2F5c%2F27f9357944598c6a83f17bae7f6d%2F9f1da3c69b794fb2ac04132454d089d9"
    },
    {
      "author": "Samy Magdy",
      "description": "Three months after paramilitary fighters overran the Sudanese city of el-Fasher, a doctor is providing a rare first-person account of the attack. The capital of North Darfur province was engulfed in violence, leaving bodies in the streets and forcing civilians to flee, according to Dr. Mohamed Ibrahim. United Nations officials say thousands of civilians were killed during the onslaught. Ibrahim described the chaos as people ran in terror, desperate to evade gunmen. He eventually reached safety, but is haunted by the brutality he witnessed.",
      "publishedAt": "2026-01-31T05:06:16Z",
      "title": "A Sudanese doctor describes his escape from a Darfur city under rebel attack",
      "url": "https://apnews.com/article/sudan-elfasher-rsf-war-darfur-f91bfe006211fbf3af21b12271710eed",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d99402/2147483647/strip/true/crop/4440x2958+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2Fd7%2Fb00eefb9a05dcc95aa4fa627a3fd%2F62f3ee4fc96c40809a102d7de4436c99"
    },
    {
      "author": "Justin Kabumba, Mark Banchereau",
      "description": "Rebel authorities say at least 200 people were killed in a landslide at coltan mines in eastern Congo. The collapse happened Wednesday due to heavy rains at the Rubaya mines, controlled by M23 rebels. Many victims remain buried in the mud. Several others were injured and taken to health facilities in Rubaya. The rebel-appointed governor has halted mining and ordered relocations near the site. Rubaya is a major source of tantalum, crucial for electronics. The region has long been plagued by conflict, with millions displaced.",
      "publishedAt": "2026-01-31T06:12:43Z",
      "title": "At least 200 killed in mine collapse in eastern Congo, rebels say",
      "url": "https://apnews.com/article/congo-m23-mine-collapse-rubaya-1d3c09b2facd0b5c5574c638069de00d",
      "urlToImage": "https://dims.apnews.com/dims4/default/c28c9ca/2147483647/strip/true/crop/7928x5283+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F4a%2F99071a0fbd4d75f6ee90f844506e%2Fef2c3db6ffca496a81f332b531ec8ba8"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Hospitals in Gaza said Israeli strikes killed at least 12 Palestinians early Saturday, one of the highest tolls since an October agreement aimed at stopping the fighting. The strikes hit northern and southern Gaza, including an apartment in Gaza City and a tent in Khan Younis, officials at the Nasser and Shifa Hospitals said. The casualties included two women and six children from two different families. Israel’s military did not immediately respond to questions about the strikes. The strikes came a day before a border crossing is set to open in Gaza’s southernmost city, a reminder that the death poll is still rising even as a ceasefire agreement inches forward.",
      "publishedAt": "2026-01-31T06:39:21Z",
      "title": "As ceasefire advances and Rafah nears reopening, hospitals say 12 killed in Israeli strikes in Gaza",
      "url": "https://apnews.com/article/mideast-wars-gaza-israel-strikes-88fcbfdbe8ea6265fa3765b7a407a5a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d20166/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F13%2Fa4ec45ffc1cc32a2bb94b43d7d7a%2Ff9b4463ab55947688db996f59f120eed"
    },
    {
      "author": "Sophie Bates, Sudhin Thanawala, Russ Bynum",
      "description": "Tens of thousands of people are entering their sixth day with no electricity as the Carolinas and Virginia prepare for a significant winter storm that could bring more snowfall than some parts of North Carolina have seen in years. The National Weather Service says arctic air moving into the Southeast will cause already frigid temperatures to plummet into the teens Friday night in cities like Nashville, Tennessee. With another wave of dangerous cold heading for the U.S. South, experts say the risk of hypothermia heightens for people in parts of Mississippi and Tennessee trapped at home without power in subfreezing temperatures.",
      "publishedAt": "2026-01-30T05:01:12Z",
      "title": "Dangerous cold wave heightens hypothermia risk in Mississippi and Tennessee",
      "url": "https://apnews.com/article/freezing-temperatures-hypothermia-mississippi-tennessee-6ae30d4be75522f7c0cd3566ba664957",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d45947/2147483647/strip/true/crop/4076x2716+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Fcd%2Fb737353f5b3094836c9bcb819260%2Fbd23362c440545c59bba1fcb1dde6367"
    },
    {
      "author": null,
      "description": "Catherine O'Hara has died at 71. The was Emmy-winning actor known for her roles in \"Home Alone\" and \"Schitt's Creek.\" Her agency, CAA, announced she died Friday at her Los Angeles home after a brief illness. O'Hara was a Canadian-born actor who gained fame through Toronto's Second City Theatre. She was also one of the creators of the sketch comedy show \"SCTV.\" Her career spanned decades, and she was celebrated for her comedic brilliance.",
      "publishedAt": "2026-01-30T18:32:59Z",
      "title": "Catherine O'Hara dies at 71",
      "url": "https://apnews.com/article/catherine-ohara-dies-9fdc89411b4961c1d599f836503a6203",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a2acf5/2147483647/strip/true/crop/5787x3856+77+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2F4f%2Fc09f5210dcba6971c8a1d5da26cc%2F265871b567524a6c87a538ecf05b1871"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}