{
  "articles": [
    {
      "author": "JOSH BOAK and NICHOLAS RICCARDI",
      "description": "CHICAGO (AP) — The Democratic National Convention's second night showcased a double dose of Obama firepower to validate Vice President Kamala Harris and deliver an unsparing indictment of Republican Donald Trump.",
      "publishedAt": "2024-08-21T00:58:28Z",
      "title": "A double dose of Obama firepower, a doting spouse and a dance party: Takeaways from Day 2 of the DNC",
      "url": "https://apnews.com/490981a504638749cf2c18848506c74b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e7bc1e321b0478d91f9d778bdff89dd/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and NICHOLAS RICCARDI",
      "description": "CHICAGO (AP) — The Democratic National Convention's second night showcased a double dose of Obama firepower to validate Vice President Kamala Harris and deliver an unsparing indictment of Republican Donald Trump.",
      "publishedAt": "2024-08-21T00:58:28Z",
      "title": "A double dose of Obama firepower, a doting spouse and a dance party: Takeaways from Day 2 of the DNC",
      "url": "https://apnews.com/490981a504638749cf2c18848506c74b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6549da19ec7a4afb9a96df4879b928b7/1000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, JONATHAN J. COOPER and ZEKE MILLER",
      "description": "CHICAGO (AP) — Vice presidential nominee Tim Walz and former President Bill Clinton will headline the Democratic National Convention on Wednesday, the third day of the party's choreographed rollout of a new candidate, Kamala Harris, and her pitch to voters.",
      "publishedAt": "2024-08-21T10:27:26Z",
      "title": "Tim Walz, Bill Clinton to speak at Democratic convention's third day",
      "url": "https://apnews.com/4f299bd2684c0284dd100f7f0731172f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65059596e1b841b99383ffdbe3afffdf/3000.jpeg"
    },
    {
      "author": "SOPHIA TAREEN, JAKE OFFENHARTZ, JOEY CAPPELLETTI and LEA SKENE",
      "description": "CHICAGO (AP) — Multiple pro-Palestinian demonstrators were arrested Tuesday after clashing with police during a protest that began outside the Israeli consulate and spilled out onto the surrounding streets on the second night of the Democratic National Convention.",
      "publishedAt": "2024-08-20T16:05:51Z",
      "title": "Pro-Palestinian protesters clash with police near Chicago's Israeli consulate on second night of DNC",
      "url": "https://apnews.com/f064683535bbbe93231d31ecc2dbafc7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1070a93c8c874e158a782bfb09fbf53b/1920.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Moscow came under one of the largest attacks yet by Ukrainian drones since the start of fighting in 2022, Russian authorities reported Wednesday, saying they destroyed all of those headed toward the capital.",
      "publishedAt": "2024-08-21T07:13:36Z",
      "title": "Moscow sees one of Ukraine's largest drone attacks as fighting rages in Kursk and eastern Ukraine",
      "url": "https://apnews.com/829eac0d80851258f03d8d9cbaf71eea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37fe6d3e1d9a42ac91e16722fd456069/1920.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "A year ago this week, President Vladmir Putin strode onto a stage in the Kursk region to commemorate the 80th anniversary of one of the Soviet army's proudest moments in World War II.Addressing a rapt audience that included soldiers fresh from fighting in Ukraine, Putin called the decisive victory in the Battle of Kursk “one of the great feats of our people.”",
      "publishedAt": "2024-08-21T04:13:07Z",
      "title": "Putin's slow response to the Kursk attack could test the patience of some of his backers in Russia",
      "url": "https://apnews.com/72d96d8cb52c105e9289dc6909900b13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8b8ec20401b48298557f822fed4a101/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Lebanon’s Hezbollah has launched more than 50 rockets, hitting a number of private homes in the Israeli-annexed Golan Heights.The attack on Wednesday came a day after U.S. Secretary of State Antony Blinken met with fellow mediators Egypt and Qatar as he pressed ahead with the latest diplomatic mission to secure a cease-fire in the war in Gaza, even as Hamas and Israel signaled that challenges remain.",
      "publishedAt": "2024-08-21T07:50:36Z",
      "title": "Israel-Hamas war latest: Hezbollah fires more than 50 rockets, hitting Israeli-annexed Golan Heights",
      "url": "https://apnews.com/e81f90961a6b16e47e3203e3a0261218",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/136fe8a5e91d41999694aa96465d8a1f/1920.jpeg"
    },
    {
      "author": "NASSER KARIMI",
      "description": "TEHRAN, Iran (AP) — A bus carrying Shiite pilgrims from Pakistan to Iraq crashed in central Iran, killing at least 28 people, an official said Wednesday.The crash happened Tuesday night in the central Iranian province of Yazd, said Mohammad Ali Malekzadeh, a local emergency official, according to the state-run IRNA news agency.",
      "publishedAt": "2024-08-21T04:24:26Z",
      "title": "Bus carrying Shiite pilgrims from Pakistan to Iraq crashes in Iran, killing at least 28 people",
      "url": "https://apnews.com/3434de3b77c716f2430174ffdb39410a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/955fa6ca2fbe4d1f9187016590a475f6/3000.jpeg"
    },
    {
      "author": "ISABELLA VOLMERT and BILL BARROW",
      "description": "HOWELL, Mich. (AP) — Former President Donald Trump pledged Tuesday to “Make America Safe Again\" while campaigning in Michigan as the Democrats who gathered in Chicago to nominate Kamala Harris branded him a career criminal.",
      "publishedAt": "2024-08-20T22:13:18Z",
      "title": "Trump campaigns to 'make America safe again' as Democratic convention zeroes in on his felony record",
      "url": "https://apnews.com/1cce84222d4a15f8174e6aa810152bd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0634beabba5a42f5a363db6b7082b48b/3000.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS",
      "description": "JACKSON, Miss. (AP) — Vice President Kamala Harris is accepting the Democrats' presidential nomination Thursday, exactly 60 years after another Black woman mesmerized the nation with a televised speech that challenged the seating of Mississippi's all-white delegation to the 1964 Democratic National Convention.",
      "publishedAt": "2024-08-21T04:02:29Z",
      "title": "Fannie Lou Hamer rattled the Democratic convention with her 'Is this America?' speech 60 years ago",
      "url": "https://apnews.com/79b54880412b373aa12fc832c9b2bb07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b89a3d5fdd34cdb8543050acae35dda/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}