{
  "articles": [
    {
      "author": "MEHMET GUZEL, ALEX TURNBULL and HYUNG-JIN KIM",
      "description": "ISTANBUL (AP) — Workers and activists around the world marked May Day with largely peaceful protests Wednesday over rising prices, low wages and calls for greater labor rights.",
      "publishedAt": "2024-05-01T06:34:36Z",
      "title": "Pro-Palestinian banners. Blazing Olympic rings. Workers' May Day rallies confront turbulent times",
      "url": "https://apnews.com/0c8605802cb451061eeb71f83bdef5fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4fc1d8814d74e939f04cd9ba1e48ade/1920.jpeg"
    },
    {
      "author": "JOHN ANTZAK, ETHAN SWOPE, JAKE OFFENHARTZ and JOSEPH B. FREDERICK",
      "description": "LOS ANGELES (AP) — Counter-protesters attacked a pro-Palestinian encampment at UCLA early Wednesday, and activists clashed with police officers who destroyed their tents at the University of Wisconsin in Madison, part of a series of escalating violence on some college campuses over the war in Gaza.",
      "publishedAt": "2024-05-01T05:49:21Z",
      "title": "Violence, chaos erupts on campuses as protesters and counter-protesters clash over the war in Gaza",
      "url": "https://apnews.com/c6e5549532c85f13493daa22d0d143ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/074aea10b6724018a93cdb1904aa0319/1920.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Before police officers poured into Columbia University on Tuesday night, arresting more than 100 people as they cleared an occupied school building and tent encampment, New York City Mayor Eric Adams said he received a piece of intelligence that shifted his thinking about the campus demonstrations over the war in Gaza.",
      "publishedAt": "2024-05-01T22:37:15Z",
      "title": "A retired teacher saw inspiration in Columbia's protests. Eric Adams called her an outside agitator",
      "url": "https://apnews.com/5319fdf36599295a3840d77c69458b57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c621479a8f9e4ebb97ad0d027c37052e/2048.jpeg"
    },
    {
      "author": "STEVE LeBLANC and NICK PERRY",
      "description": "BOSTON (AP) — Boston College students held a protest rally against the Israel-Hamas war last week. Bullhorns were banned, lest the noise disturb studying for finals.",
      "publishedAt": "2024-05-01T15:22:08Z",
      "title": "Student protests take over some campuses. At others, attention is elsewhere",
      "url": "https://apnews.com/1290da721bdb26950ba857719b7441e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8907cd734a4248a08c7512f56aa4dfa7/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE, SAMY MAGDY and SAM MEDNICK",
      "description": "JERUSALEM (AP) — U.S. Secretary of State Antony Blinken hiked up pressure on Hamas on Wednesday to accept the latest proposal for a cease-fire with Israel, saying the “time is now” for an agreement that would free hostages and pause the nearly seven months of war in Gaza.",
      "publishedAt": "2024-05-01T07:17:43Z",
      "title": "Blinken presses Hamas to seal cease-fire with Israel, says 'the time is now' for a deal",
      "url": "https://apnews.com/7cbf7c696989cdc3a22383c823fb2e0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3fcb66b68a84590b162ae0057bcd658/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "For one day, workers ruled the world’s biggest streets. Thousands strong marched Wednesday to mark May Day, the first day of the month when workers’ rights are celebrated in demonstrations around the globe.",
      "publishedAt": "2024-05-01T20:02:26Z",
      "title": "AP PHOTOS: Workers rule the streets on May Day",
      "url": "https://apnews.com/0b7e1464d0890d2b527ce630a5e66fe4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec5a63211ea1418d85e66129424f5a15/3000.jpeg"
    },
    {
      "author": "ANITA SNOW and MORGAN LEE",
      "description": "PHOENIX (AP) — The Arizona Legislature approved a repeal of a long-dormant ban on nearly all abortions Wednesday, advancing the bill to Democratic Gov. Katie Hobbs, who is expected to sign it.Two Republicans joined with Democrats in the Senate on the 16-14 vote in favor of repealing a Civil War-era ban on abortions that the state’s highest court recently allowed to take effect.",
      "publishedAt": "2024-05-01T05:04:31Z",
      "title": "Arizona lawmakers vote to undo near-total abortion ban from 1864, with Gov. Hobbs expected to sign",
      "url": "https://apnews.com/24578e546b69ca087e01034bcaf4aa01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30730178412d48088dde7a123621d55e/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON, SCOTT BAUER and MICHELLE L. PRICE",
      "description": "WAUKESHA, Wis. (AP) — Donald Trump returned briefly to the campaign trail Wednesday and called the judge presiding over his hush money trial “crooked” a day after he was held in contempt of court and threatened with jail time for violating a gag order.",
      "publishedAt": "2024-05-01T04:06:27Z",
      "title": "Trump calls judge 'crooked' after facing a warning of jail time if he violates a trial gag order",
      "url": "https://apnews.com/f3d448782edc81e10274cf99175f3844",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c0ae521a8fe4d528126ed050bf860f1/1920.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "CHARLOTTE, N.C. (AP) — United Methodist delegates repealed their church’s longstanding ban on LGBTQ clergy with no debate on Wednesday, removing a rule forbidding “self-avowed practicing homosexuals” from being ordained or appointed as ministers.",
      "publishedAt": "2024-05-01T14:01:30Z",
      "title": "United Methodists repeal longstanding ban on LGBTQ clergy",
      "url": "https://apnews.com/acabe18fe22b6838e3005ad8895534fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4570295c05d04bc292c1279860a96127/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "The first calls that Dr. Barb Petersen received in early March were from dairy owners worried about crows, pigeons and other birds dying on their Texas farms. Then came word that barn cats — half of them on one farm — had died suddenly.",
      "publishedAt": "2024-05-01T18:40:53Z",
      "title": "This Texas veterinarian helped crack the mystery of bird flu in cows",
      "url": "https://apnews.com/07bd5accb01441bc5d279464271d2371",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/023b600066894c1ebe7a47c6af18ffb8/2316.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}