{
  "articles": [
    {
      "author": "ZEKE MILLER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The U.S. paused a shipment of bombs to Israel last week over concerns that Israel was approaching a decision on launching a full-scale assault on the southern Gaza city of Rafah against the wishes of the U.S., a senior administration official said Tuesday.",
      "publishedAt": "2024-05-08T01:56:54Z",
      "title": "US paused bomb shipment to Israel to signal concerns over Rafah invasion, official says",
      "url": "https://apnews.com/432aa51e3569d1a73b22273295b1a53f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fad33c20b6a4aad91dbfcd90b889227/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY, MELANIE LIDMAN and LEE KEATH",
      "description": "CAIRO (AP) — Israeli troops seized control of Gaza’s vital Rafah border crossing on Tuesday in what the White House described as a limited operation, as fears mount of a full-scale invasion of the southern city and talks with Hamas over a cease-fire and hostage release remain on a knife’s edge.",
      "publishedAt": "2024-05-07T05:59:14Z",
      "title": "Israel seizes Gaza's vital Rafah crossing, but the US says it isn't the full invasion many fear",
      "url": "https://apnews.com/113bf4ee5dad87dc5c003d76ed2785bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b24321bcb0948a4b69826973546e49d/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ, MICHAEL R. SISAK and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump squirmed and scowled, shook his head and muttered as Stormy Daniels described the unexpected sex she says they had nearly two decades ago, saying she remembered “trying to think of anything other than what was happening.”",
      "publishedAt": "2024-05-08T01:06:23Z",
      "title": "Inside the courtroom where Trump was forced to listen to Stormy Daniels",
      "url": "https://apnews.com/7883af6da39566472d0e6e1736d2f90a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed7cd38cdc684d658f89083e62ae093b/3000.jpeg"
    },
    {
      "author": "EDNA TARIGAN and KRISTEN GELINEAU",
      "description": "MEULABOH, Indonesia (AP) — The boat glided across waters that were dark and still, under a night sky that was cloudless and calm. But on board, the 12-year-old girl quaked with fear.The captain and crew who she says had tortured her and three other women and girls were not finished.",
      "publishedAt": "2024-05-08T03:07:46Z",
      "title": "Rape, terror and death at sea: How a boat carrying Rohingya children, women and men capsized",
      "url": "https://apnews.com/1d2ad5595a5240ea4d2c35e26ddf9394",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/307e007fc9eb4522baf44b15738398f0/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "KYIV, Ukraine (AP) — Paintbrush in hand, Anastasiya Sereda is working on a painting of a chubby-faced panda in the uniform of a Ukrainian soldier.Propped on her easel is the reason why – a photo of her boyfriend Bohdan, a burly serviceman with a gentle smile.",
      "publishedAt": "2024-05-08T04:20:51Z",
      "title": "Grit, humor, grief and gloom mix as Ukrainians face a dangerous new phase in the war",
      "url": "https://apnews.com/f5e7e06215aa2e3f95c57c4de62527b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e43a8b2ef19413f9422717d29d9df27/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ AND AARON FAVILA",
      "description": "LAOAG, Philippines (AP) — Military force from the United States, Australian and the Philippines launched a barrage of high-precision rockets, artillery fire and airstrikes to sink a ship Wednesday as part of largescale war drills in waters facing the disputed South China Sea that have antagonized Beijing.",
      "publishedAt": "2024-05-08T03:08:00Z",
      "title": "US, Australian and Philippine forces sink a ship during war drills in the disputed South China Sea",
      "url": "https://apnews.com/0157be2b96b90abad85b9c30b29e40a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c0577bddf0e491ca9b56b85d8cb851a/3000.jpeg"
    },
    {
      "author": "ED WHITE, ALEXA ST. JOHN and SEAN MURPHY",
      "description": "DETROIT (AP) — Severe storms continued to barrel through the Midwest early Wednesday, unleashing a curtain of heavy rain, gusty winds and tornadoes that forecasters warned could spill out of the region.",
      "publishedAt": "2024-05-08T04:49:04Z",
      "title": "Storms battering the Midwest bring tornadoes, hail and strong winds",
      "url": "https://apnews.com/1ac4133f09069997f926e434a28c75ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c9380773991450e867f48ea5ac576ec/1920.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE and GABRIELA SÁ PESSOA",
      "description": "PORTO ALEGRE, Brazil (AP) — The mayor of a major city in southern Brazil on Tuesday pleaded with residents to comply with his water rationing decree, given that some four-fifths of the population is without running water, a week after major flooding that has left at least 90 people dead and more than 130 others missing.",
      "publishedAt": "2024-05-07T13:58:15Z",
      "title": "Too much water, and not enough: Brazil's flooded south struggles to access basic goods",
      "url": "https://apnews.com/dda51e5aae0e63a09b9ef64189f553b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c4605763a954d33b1d512153216c94e/1920.jpeg"
    },
    {
      "author": "CHARLES REX ARBOGAST, PAT EATON-ROBB and STEVE LeBLANC",
      "description": "CHICAGO (AP) — Police cleared a pro-Palestinian tent encampment at the University of Chicago on Tuesday after administrators who had initially adopted a permissive approach said the protest had crossed a line and caused growing concerns about safety.",
      "publishedAt": "2024-05-07T04:09:26Z",
      "title": "Some colleges that had been permissive of pro-Palestinian protests begin taking a tougher stance",
      "url": "https://apnews.com/9bb8051253c45947509feb32ced78f8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3454f3a62574bdcb21d1d5cf34723d3/1920.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "SALT LAKE CITY (AP) — Transgender activists have flooded a Utah tip line created to alert state officials to possible violations of a new bathroom law with thousands of hoax reports in an effort to shield trans residents and their allies from any legitimate complaints that could lead to an investigation.",
      "publishedAt": "2024-05-07T23:19:20Z",
      "title": "Transgender activists flood Utah tip line with hoax reports to block bathroom law enforcement",
      "url": "https://apnews.com/943112e6ff6f5768caa0cd42403957a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0014d6e3ce9540729474a57ef29e0884/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}