{
  "articles": [
    {
      "author": null,
      "description": "Savannah Guthrie has told the potential kidnappers of her mother Nancy Guthrie that the family is prepared to pay for her safe return. Savannah Guthrie appeared in a video on Instagram on Saturday while flanked by her two siblings. She said: “We received your message and we understand ... This is very valuable to us, and we will pay.” It was not immediately clear if Guthrie was referring to a new message from someone who might have kidnapped Nancy Guthrie. The frantic search for the 84-year-old Nancy Guthrie has entered a seventh day. Authorities have not identified any suspects or ruled anyone out.",
      "publishedAt": "2026-02-08T00:10:53Z",
      "title": "Savannah Guthrie pleads for safe return of mother, says 'We will pay'",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-92dff046a91f2c5c0093f17cd3b7ad42",
      "urlToImage": "https://dims.apnews.com/dims4/default/40c0dfa/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F6c%2F917e8a5800f78f9312746c49c3c1%2Ff5ba4eb95bfb4920836ba3f51f739f17"
    },
    {
      "author": "David Bauder",
      "description": "Washington Post publisher Will Lewis says he’s stepping down, three days after the troubled newspaper said that it was laying off one-third of its staff. Lewis sent an email to the Post’s staff, saying that “difficult decisions have been taken in order to ensure the sustainable future of The Post.” Lewis and the newspaper’s billionaire owner Jeff Bezos, did not participate in a meeting with staff announcing the layoffs this week. The Post’s chief financial officer, Jeff D’Onofrio, was named acting publisher and CEO. The British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Post in January 2024. His tenure has been rocky from the start, marked by layoffs and a failed reorganization plan.",
      "publishedAt": "2026-02-07T23:20:38Z",
      "title": "Washington Post publisher Will Lewis says he's stepping down",
      "url": "https://apnews.com/article/washington-post-will-lewis-stepping-down-layoffs-c8559f5e1d9f4d73f37163e4a708f9da",
      "urlToImage": "https://dims.apnews.com/dims4/default/6103af0/2147483647/strip/true/crop/5018x3344+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Fa6%2F3790822bd36075967dd3be490a9a%2F418b9d7ef11e4a3baf56ebcaa885f17d"
    },
    {
      "author": "Ben Finley, Konstantin Toropin",
      "description": "President Donald Trump has taken an unusual step of turning to military leaders for high-level diplomacy. The top U.S. commander in the Middle East is involved in talks over Iran’s nuclear program. Trump's Army secretary is engaged in negotiations on trying to end the Russia-Ukraine war. It's not clear whether the military leaders were brought in because of their expertise, connections or to signal potentially tougher options. But the move reflects how the Trump administration has upended traditional U.S. foreign policy and diplomacy. Envoy Steve Witkoff and Trump's son-in-law Jared Kushner are balancing both sets of difficult negotiations.",
      "publishedAt": "2026-02-07T13:20:58Z",
      "title": "Trump's military leaders help with diplomacy on Iran and Ukraine",
      "url": "https://apnews.com/article/military-diplomacy-trump-iran-ukraine-russia-09decddeb6264a4dd83cc3535553b2f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6c86ac/2147483647/strip/true/crop/7952x5299+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Fc6%2Fa740dc997047583c2f98b8a1e276%2Fb3cc592cabf34096ac059e8e79c22a42"
    },
    {
      "author": "Matt Brown",
      "description": "President Donald Trump is facing rare criticism from his Republican Party over a racist video. Trump's White House removed a video that contained a racist image of former President Barack Obama and former first lady Michelle Obama after a bipartisan blowback from lawmakers on Capitol Hill. The condemnation from congressional Republicans marked a rare moment of pushback from GOP lawmakers, who otherwise rarely criticize Trump in public. Trump said that he did not support the racist parts of the video and declined to apologize. Democrats and supporters of the Obamas rallied to the former first couple's defense",
      "publishedAt": "2026-02-07T19:37:33Z",
      "title": "Trump faces rare GOP blowback over post depicting Obamas as primates",
      "url": "https://apnews.com/article/trump-obama-racist-video-tim-scott-067cf84eea0ec4a03122d6a245ce5714",
      "urlToImage": "https://dims.apnews.com/dims4/default/74d68a0/2147483647/strip/true/crop/5049x3364+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F4d%2Fd0c0f0b83d621bf386fe8080d5ec%2F1875dc3bab41439888293037a92b1579"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy says the U.S. has given Ukraine and Russia a June deadline to reach a peace agreement. Zelenskyy said that if the deadline is not met, the Trump administration will likely apply pressure on both sides. Zelenskyy spoke to reporters on Friday, with his comments embargoed until Saturday morning. He said the Americans want the war to end by the beginning of summer. They plan to do everything possible to achieve this goal and seek a clear schedule of events.",
      "publishedAt": "2026-02-07T09:11:20Z",
      "title": "Zelenskyy says U.S. gave Ukraine and Russia a June deadline to reach agreement to end war",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-june-deadline-98da4e17de8ab377363ae9c3ff308001",
      "urlToImage": "https://dims.apnews.com/dims4/default/7a6e82b/2147483647/strip/true/crop/5584x3721+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F01%2F17%2F890d53bd9225f48539907b6f1e3b%2Fb0c5c959afb44e8f9ca9da6053652836"
    },
    {
      "author": "Natalie Melzer",
      "description": "Israeli Prime Minister Benjamin Netanyahu will meet with U.S. President Donald Trump in Washington on Wednesday about the U.S. talks with Iran. Iran’s foreign minister threatened U.S. military bases in the region a day after indirect discussions in Oman. Netanyahu's office on Saturday said the prime minister believes that negotiations must include limiting Iran's ballistic missiles and ending its support for armed proxies. Friday's talks were on how to approach discussions over Tehran’s nuclear program. Trump called the talks “very good” and said more were planned for early next week. Concerns remain high about possible regional conflict.",
      "publishedAt": "2026-02-07T18:19:31Z",
      "title": "Netanyahu-Trump meeting about Iran scheduled for Wednesday",
      "url": "https://apnews.com/article/iran-israel-netanyahu-trump-washington-aad9f0290212fad4e9f81576f99becf2",
      "urlToImage": "https://dims.apnews.com/dims4/default/23c4cb0/2147483647/strip/true/crop/1280x853+0+42/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fbf%2F8922da45f4a10649f3947f0e4ef2%2Fd797c5e9c23d4da3a54dc19d322a097a"
    },
    {
      "author": "Jill Lawless",
      "description": "The Jeffrey Epstein files have rocked Europe's elite, revealing ties to a prince, an ambassador, and top politicians. The U.S. Department of Justice released documents that have ended careers and sparked investigations. King Charles III's brother lost his titles and home. Ex-U.K. ambassador Peter Mandelson was fired and may face prison. British Prime Minister Keir Starmer is in crisis for appointing Mandelson. Norway, Sweden and Slovakia have seen senior figures fall. Experts say the files expose Epstein's powerful network in Europe. The fallout contrasts with a more limited impact so far in the U.S. where only a handful of prominent Epstein associates have lost their jobs.",
      "publishedAt": "2026-02-07T10:41:15Z",
      "title": "Jeffrey Epstein files shake political careers in Europe",
      "url": "https://apnews.com/article/jeffrey-epstein-fallout-europe-us-mandelson-409c14e095a2e29bbea6398437411a8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/4e43f7e/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2F4b%2F732ac12280a90280b960f4ba748b%2F0ce4d201467540bf8d42e37878060396"
    },
    {
      "author": "Ali Swenson, Jeff Amy",
      "description": "Democrats are focusing on health care in the November elections and making it a key issue. Republicans have cut Medicaid through new work requirements and they've declined to extend COVID-era subsidies. That's led to increased costs for people covered under Affordable Care Act plans. Democrats are using campaign ads and personal stories to emphasize the impact on Americans. Jon Ossoff is one high-profile Democrat in a tough reelection campaign this year. The Georgia senator plans to address health care at an event Saturday. Republicans have struggled to pass legislation to offset health costs and that's become weak point for them. Democrats see a chance to gain political leverage in the midterms.",
      "publishedAt": "2026-02-07T05:00:18Z",
      "title": "Health costs are a top focus for Democrats in the midterms",
      "url": "https://apnews.com/article/democrats-republicans-election-2026-midterms-health-care-e2ba02302f151a03fae4f1d760cf555f",
      "urlToImage": "https://dims.apnews.com/dims4/default/810d397/2147483647/strip/true/crop/5358x3570+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Ffa%2F6a86d5e29ac821936a3363cd6741%2Fab0bc283fec24799a60e48964a76952e"
    },
    {
      "author": "Jack Brook, Michael Biesecker, Jim Mustian, Cedar Attanasio",
      "description": "A Mexican immigrant whose skull was broken during his arrest by immigration officers last month in Minnesota says the beating was unprovoked. Alberto Castañeda Mondragón says federal agents began hitting him right after they pulled him from a vehicle. He was hospitalized with eight skull fractures and five life-threatening brain hemorrhages. Officers claimed he ran into a wall, but medical staff immediately doubted that account. His case has sparked calls for accountability and transparency. Castañeda Mondragón, who entered the U.S. legally, faces a long recovery and uncertain future. He hopes to stay in the U.S. and support his family despite fears of another encounter with ICE.",
      "publishedAt": "2026-02-07T05:01:10Z",
      "title": "Immigrant whose skull was broken during ICE arrest says beating was unprovoked",
      "url": "https://apnews.com/article/immigration-enforcement-minneapolis-hospital-ice-beating-assault-4e77742e0629fc7f127c0aa38b3d2a70",
      "urlToImage": "https://dims.apnews.com/dims4/default/cff3f9d/2147483647/strip/true/crop/2172x1447+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F98%2Fd3b31ba59f5bba8d4c0fd4bb3d28%2F94351bdc84064a95b5e3cb835e50b6db"
    },
    {
      "author": "Safiyah Riddle",
      "description": "Experts say abductions for ransom are rare, despite dramatic portrayals on TV. The apparent kidnapping of “Today” show host Savannah Guthrie’s mother has raised questions about real-life hostage negotiations. Nancy Guthrie, 84, was taken from her home outside Tucson, Arizona. A local TV station received two alleged ransom letters demanding money for her return. Law enforcement hasn't confirmed the authenticity of these notes. Experts say kidnappings for ransom are uncommon and usually involve careful planning. The family has released videos appealing to the kidnappers. Patience and avoiding media attention can be crucial in these situations.",
      "publishedAt": "2026-02-07T05:00:09Z",
      "title": "How law enforcement handles hostage crises: Insights from Guthrie case",
      "url": "https://apnews.com/article/nancy-guthrie-kidnapper-negotiations-hostages-d40a08cab642016c5ea5565cd1f935dc",
      "urlToImage": "https://dims.apnews.com/dims4/default/302e44c/2147483647/strip/true/crop/1999x1332+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F18%2Faee3cb1db78f4ee9684288454dc1%2F49fc597e8bba47a6a708a99a96d41918"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}