{
  "articles": [
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "A passenger jet carrying 64 people collided with an Army helicopter while landing at Ronald Reagan National Airport near Washington, prompting a large search-and-rescue operation in the nearby Potomac River.",
      "publishedAt": "2025-01-29T22:17:00Z",
      "title": "American Airlines jet with 64 aboard collides with Army helicopter at Reagan Airport near DC",
      "url": "https://apnews.com/live/dc-plane-crash-reagan-updates",
      "urlToImage": "https://dims.apnews.com/dims4/default/4347a62/2147483647/strip/true/crop/4219x2373+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2Fdd%2F81db57af4aeb99ba9967b23d760d%2Fap25030166944412.jpg"
    },
    {
      "author": "HALLIE GOLDEN",
      "description": "A jet with 60 passengers and four crew members collided with an Army helicopter while landing at the Ronald Reagan National Airport near Washington. Multiple people were killed in the crash Wednesday and a large search-and-rescue operation has started in the nearby Potomac River. The crash occurred in some of the most tightly controlled and monitored airspace in the world, just over 3 miles south of the White House and the Capitol. Authorities were conducting a search-and-rescue operation in an attempt to find survivors in the water and around the crash site.",
      "publishedAt": "2025-01-30T08:34:30Z",
      "title": "What to know about the collision between a passenger jet and Army helicopter near DC",
      "url": "https://apnews.com/article/ronald-reagan-national-airport-aircraft-crash-9d79051a9e535bd855df5a4e5553b2e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/eb13d34/2147483647/strip/true/crop/3581x2014+0+189/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F33%2F6de9fa3d7760a84785b4ea548f0e%2F07e145d6c3a9431ca76ca852a507eeb3"
    },
    {
      "author": null,
      "description": "Law enforcement and other officials say an aircraft went down near Ronald Reagan National Airport, and all takeoffs and landings have been halted. Multiple helicopters, including those from the U.S. Park Police and the D.C. Metropolitan Police Department and U.S. military, were flying over the scene of the incident in the Potomac River on Wednesday night. D.C. Fire and EMS said on X that fireboats were on the scene. The airport said emergency personnel were responding to “an aircraft incident on the airfield.” Video from an observation camera at the nearby Kennedy Center shows two sets of lights consistent with aircraft appearing to conjoin in a fireball.",
      "publishedAt": "2025-01-30T02:29:38Z",
      "title": "Aircraft down near Washington's Reagan Airport; takeoffs and landings halted",
      "url": "https://apnews.com/article/ronald-reagan-national-airport-crash-cebb142d24859ba0c4e0e4fd6c33773f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "A passenger jet carrying 64 people collided with an Army helicopter while landing at Ronald Reagan National Airport near Washington, prompting a large search-and-rescue operation in the nearby Potomac River.",
      "publishedAt": "2025-01-29T22:17:00Z",
      "title": "American Airlines jet with 64 aboard collides with Army helicopter at Reagan Airport near DC",
      "url": "https://apnews.com/live/dc-plane-crash-reagan-updates#00000194-b6a1-d3c6-af9d-b7f9140b0000",
      "urlToImage": "https://dims.apnews.com/dims4/default/4347a62/2147483647/strip/true/crop/4219x2373+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2Fdd%2F81db57af4aeb99ba9967b23d760d%2Fap25030166944412.jpg"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "An American Airlines jet with 60 passengers and four crew members aboard has collided with an Army helicopter while coming in for a landing at Ronald Reagan National Airport near Washington and multiple people were killed. Fatal crashes of commercial aircraft in the U.S. have become a rarity. The last was in 2009 near Buffalo, New York. All 45 passengers and the four crew members were killed. The collision Wednesday occurred over the Potomac River and the aircraft fell into the water. In 1982 an Air Florida flight crashed into the Potomac and killed 78.",
      "publishedAt": "2025-01-30T07:55:09Z",
      "title": "Here are some of the deadliest plane crashes in US history",
      "url": "https://apnews.com/article/aircraft-crashes-history-washington-ee55776ea0c5f9e322fc77ea1ea452d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ce1422/2147483647/strip/true/crop/2048x1152+0+110/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2Fd3%2F5b1b9188d8b5ae67167efd053006%2F6abf992fc6064346ad890eeaccfb6fc8"
    },
    {
      "author": "ASSOCIATED PRESS",
      "description": "President Donald Trump says he will use a detention center at Guantanamo Bay to hold tens of thousands of criminal immigrants in the U.S. illegally who can’t be sent back to their home countries. While the U.S. naval base is best known for the suspects brought in after the Sept. 11, 2001, attacks, it also has a separate facility used for decades to hold detained immigrants. The U.S. has leased Guantanamo from Cuba for more than a century. Cuba opposes the lease and typically rejects the nominal U.S. rent payments. Trump signed a presidential memorandum and said he'd direct federal officials to get facilities ready. Border czar Tom Homan said U.S. Immigration and Customs Enforcement would run the facility. Still, details of the plan weren’t immediately clear.",
      "publishedAt": "2025-01-29T21:51:30Z",
      "title": "What to know about base where Trump will send 'criminal aliens'",
      "url": "https://apnews.com/article/guantanamo-bay-detention-migrants-what-to-know-trump-d027c5c24b523f31a62271dcbe7c010e",
      "urlToImage": "https://dims.apnews.com/dims4/default/c55a71d/2147483647/strip/true/crop/5918x3329+0+258/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F44%2Fc7a09d45b6e756a8f37689a34373%2Fa0f232f59a5e4741b445a0c39b9ec303"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "The first bill signed by President Donald Trump is named after a slain Georgia nursing student whose name became a rallying cry during Trump’s White House campaign. The Laken Riley Act will require the detention of unauthorized immigrants accused of theft and violent crimes. The bill won bipartisan support in both the House and Senate. Under the law signed Wednesday, federal officials will be required to detain any migrant arrested or charged with crimes like shoplifting, assaulting a police officer or crimes that injure or kill someone.",
      "publishedAt": "2025-01-24T05:02:19Z",
      "title": "What is the Laken Riley Act? And who voted for it?",
      "url": "https://apnews.com/article/what-is-laken-riley-act-trump-immigration-2667d626139ddf5a16d1533516eab18f",
      "urlToImage": "https://dims.apnews.com/dims4/default/11b9b96/2147483647/strip/true/crop/7447x4189+0+390/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Ff7%2F78ac8e1bab6b2560dd3038a50352%2Fe718e5c4274148b3b031bf4960ad03d3"
    },
    {
      "author": "COLLIN BINKLEY, ZEKE MILLER",
      "description": "President Donald Trump is ordering U.S. schools to stop teaching what he views as “critical race theory” and other material dealing with race and sexuality or risk losing their federal money. A separate plan announced Wednesday calls for aggressive action to fight antisemitism on college campuses, promising to prosecute offenders and revoke student visas for international students found to be “Hamas sympathizers.” Both plans were outlined in executive orders to be signed by Trump on Wednesday. The measures seek to fulfill some of the Republican president’s core campaign promises around education, though it’s unclear how much power he has to enact the proposals.",
      "publishedAt": "2025-01-29T19:50:10Z",
      "title": "Trump's orders take aim at critical race theory and antisemitism on college campuses",
      "url": "https://apnews.com/article/trump-critical-race-theory-antisemitism-college-protests-18136b8c8f5adb9c75c47907e020268a",
      "urlToImage": "https://dims.apnews.com/dims4/default/74e4bdb/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Fed%2F203435faa159c33219e78391792a%2Feb684f6c5c6244bc9a8c100be46639e6"
    },
    {
      "author": "LOLITA C. BALDOR, TARA COPP, ERIC TUCKER",
      "description": "An American Airlines jet carrying 60 passengers and four crew members has collided with an Army helicopter while landing at Ronald Reagan National Airport near Washington, prompting a large search-and-rescue operation in the nearby Potomac River. There were multiple fatalities, according to a person familiar with the matter, but the precise number of victims was unclear. There was no immediate word on the cause of the collision late Wednesday. All takeoffs and landings from the airport were halted as helicopters from law enforcement agencies across the region flew over the scene in search of survivors. Inflatable rescue boats were launched into the Potomac, just north of the airport. District of Columbia Mayor Muriel Bowser declined to say how many bodies had been recovered.",
      "publishedAt": "2025-01-30T10:01:53Z",
      "title": "Passenger jet with 64 aboard collides with Army helicopter while landing at Reagan Airport near DC",
      "url": "https://apnews.com/article/ronald-reagan-national-airport-crash-62adba7fb1f546b4cf1716e42b86482b",
      "urlToImage": "https://dims.apnews.com/dims4/default/92e1dc1/2147483647/strip/true/crop/4070x2289+0+216/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2F96%2F11503c41d71c2f42f78e40a4ac74%2Ffe94056da8f840dd83f7292c711d84ce"
    },
    {
      "author": "WAFAA SHURAFA, JOSEPH KRAUSS",
      "description": "Hamas is set to free three more Israeli hostages as well as five Thai captives, and Israel is to release another 110 Palestinian prisoners. The exchange expected Thursday would be the third since the start of a ceasefire in the Gaza Strip that has held for a week and a half. The truce is aimed at winding down the deadliest and most destructive war ever fought between Israel and Hamas, whose Oct. 7, 2023, attack into Israel sparked the fighting. It has held despite a dispute earlier this week over the sequence in which the hostages were released.",
      "publishedAt": "2025-01-30T04:28:08Z",
      "title": "Hamas is set to free 8 more hostages and Israel will release 110 prisoners as Gaza ceasefire holds",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-30-2025-3cc7131495a60ce2bda73ca691abb7c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ad3c19/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2Fd1%2Fffca3a8da5b5a612ba0a6f4d934b%2F7cb201d155274b639d85c72fd3627380"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}