{
  "articles": [
    {
      "author": "CLAUDIA LAUER and ALANNA DURKIN RICHER",
      "description": "WILMINGTON, Del. (AP) — Hunter Biden's legal woes are not over after his conviction on three felony firearms charges in a trial that put a spotlight on his drug-fueled past.",
      "publishedAt": "2024-06-11T23:39:47Z",
      "title": "What's next for Hunter Biden after his conviction on federal gun charges",
      "url": "https://apnews.com/7cc9bab53e4df19f46e28f131566008b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1dc9f59a4ad34b70bd59dc1ca5c4a924/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE and ABBY SEWELL",
      "description": "BEIRUT (AP) — Hamas said Tuesday that it gave mediators its reply to the U.S.-backed proposal for a cease-fire in Gaza, seeking some “amendments” on the deal. It appeared the reply was short of an outright acceptance that the United States has been pushing for but kept negotiations alive over an elusive halt to the eight-month war.",
      "publishedAt": "2024-06-11T10:03:52Z",
      "title": "Hamas responds to Gaza cease-fire plan seeking some changes. US says it's 'evaluating' the reply",
      "url": "https://apnews.com/d3733d55c6a66222da1a4a051997094c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a12c61fac1c424e8f4cc4f02eb032fa/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "GENEVA (AP) — The U.N. human rights office is citing possible war crimes by Israeli forces and Palestinian armed groups in connection with a deadly raid by Israeli forces that freed four hostages over the weekend and killed hundreds of Palestinians.",
      "publishedAt": "2024-06-11T09:32:42Z",
      "title": "UN says Israeli forces and Palestinian armed groups may have committed war crimes in a deadly raid",
      "url": "https://apnews.com/40a3e17012915c409e8a5d50475dd122",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f19c9ed42494c4598ad4f2a2c26c9b9/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Groups pushing tighter gun laws have been building political muscle through multiple elections, boosted by the outcry following mass shootings at schools and other public places, in addition to the nation's daily gun violence.",
      "publishedAt": "2024-06-11T04:15:12Z",
      "title": "Biden and gun control advocates want to flip an issue long dominated by the NRA",
      "url": "https://apnews.com/069fa483fc8af1e321ef8b53040f70ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ff26a3824dc4059a77405aca9f57734/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "INDIANAPOLIS (AP) — Even as they prepare to vote on a formal ban on churches with women pastors, delegates to the Southern Baptist Convention annual meeting voted overwhelmingly Tuesday to boot one such church from its ranks.",
      "publishedAt": "2024-06-11T14:52:23Z",
      "title": "Southern Baptists expel Virginia church for believing women can serve as pastors",
      "url": "https://apnews.com/f1f43f93947fda83119c761c06ea18f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d59f3c71045d4354ab71f0e3e7ae97c8/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER",
      "description": "FORT LAUDERDALE, Fla. (AP) — A federal judge on Tuesday struck down a 2023 Florida law that blocked gender-affirming care for transgender minors and severely restricted such treatment for adults, calling the statute unconstitutional.",
      "publishedAt": "2024-06-11T18:37:47Z",
      "title": "A Florida law blocking treatment for transgender children is thrown out by a federal judge",
      "url": "https://apnews.com/592b24b28e365ded336ca841f2ac90ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d025e3a1a8e42d5b7c2c095d3333e97/3000.jpeg"
    },
    {
      "author": "GREGORY GONDWE and GERALD IMRAY",
      "description": "BLANTYRE, Malawi (AP) — Malawi's Vice President Saulos Chilima and nine other people died when the small military plane they were traveling in crashed in bad weather in a mountainous region in the north of the country, the president said Tuesday.",
      "publishedAt": "2024-06-11T08:06:08Z",
      "title": "Malawi's vice president and 9 others are confirmed dead after their plane's wreckage is found",
      "url": "https://apnews.com/c071c832931d7cfeae92f9bb1c199075",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2aafbeaada86417998d0ce410ebb5adb/1920.jpeg"
    },
    {
      "author": "MEGAN JANETSKY and FÉLIX MÁRQUEZ",
      "description": "VILLAHERMOSA, Mexico (AP) — “Here, again.” Yeneska García’s face crumbled as she said it, and she pressed her head into her hands.Since fleeing crisis in Venezuela in January, the 23-year-old had trekked through the Darien Gap jungle dividing Colombia and Panama, narrowly survived being kidnapped by a Mexican cartel and waited months for an asylum appointment with the United States that never came.",
      "publishedAt": "2024-06-11T18:59:01Z",
      "title": "Mexico's tactic to cut immigration to the US: wear out migrants",
      "url": "https://apnews.com/a5498f0791f5f1ef99f1dfd9accce8f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86aaa05b269d4a03804f040dc89bc5ea/3000.jpeg"
    },
    {
      "author": "LAURIE KELLMAN",
      "description": "LONDON (AP) — He has no political experience. No high-profile endorsements. No party affiliation. What Fidias Panayiotou does have are 2.6 million followers on YouTube and more on TikTok. And now he has won a seat in the European Parliament representing Cyprus, one of several unusual candidates who launched improbable campaigns only to snag membership in the 720-seat legislature.",
      "publishedAt": "2024-06-11T05:24:10Z",
      "title": "These candidates who won seats in the European Parliament this week aren't who you might expect",
      "url": "https://apnews.com/2e508a3dd2bc3695f0ec48286f7aaaf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac0745a30de842b89c30387471c9b3cb/3000.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS, JIM SALTER and CAMILLE FASSETT",
      "description": "WEST ALTON, Mo. (AP) — Devastating flooding, driven in part by climate change, is taking an especially damaging toll on communities that once thrived along the banks of America's most storied river.",
      "publishedAt": "2024-06-11T14:21:32Z",
      "title": "For shrinking Mississippi River towns, frequent floods worsen fortunes",
      "url": "https://apnews.com/56e825cdda0f57d895cce753b08f9987",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a1222d8f6264be3a2003e753fe15bed/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}