{
  "articles": [
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Thursday appeared likely to reject former President Donald Trump’s claim of absolute immunity from prosecution over election interference, but several justices signaled reservations about the charges that could cause a lengthy delay, possibly beyond November’s election.",
      "publishedAt": "2024-04-25T04:06:06Z",
      "title": "Supreme Court seems skeptical of Trump's claim of absolute immunity but decision's timing is unclear",
      "url": "https://apnews.com/72c885c07c77970d4380206f87b2d8ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be06cf1a67f0424f834270fc8057ecd0/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Catch and kill. Checkbook journalism. Secret deals. Friends helping friends.Even by National Enquirer standards, testimony by its former publisher David Pecker at Donald Trump's hush money trial this week has revealed an astonishing level of corruption at America's best-known tabloid and may one day be seen as the moment it effectively died.",
      "publishedAt": "2024-04-25T15:24:15Z",
      "title": "The National Enquirer was the go-to American tabloid for many years. Donald Trump helped change that",
      "url": "https://apnews.com/57f0c462af437fb07967a041b6f66022",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd17383287b749c4b19d95b2fa587c1e/2028.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — Ukraine has sidelined U.S.-provided Abrams M1A1 battle tanks for now in its fight against Russia, in part because Russian drone warfare has made it too difficult for them to operate without detection or coming under attack, two U.S.",
      "publishedAt": "2024-04-25T23:23:22Z",
      "title": "Ukraine pulls US-provided Abrams tanks from the front lines over Russian drone threats",
      "url": "https://apnews.com/19d71475d427875653a2130063a8fb7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdcffec1e8b843c29d4a52a1c01dfbee/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and DAVE COLLINS",
      "description": "NEW YORK (AP) — New York’s highest court on Thursday threw out Harvey Weinstein ’s 2020 rape conviction with a ruling that shocked and disappointed women who celebrated historic gains during the #MeToo era and left those who testified in the case bracing for a retrial against the ex-movie mogul.",
      "publishedAt": "2024-04-25T13:09:34Z",
      "title": "Harvey Weinstein’s rape conviction is overturned by New York's top court",
      "url": "https://apnews.com/ed29faeec862abf0c071e8bd3574c4a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac7383804eed4459bfe8be96df90f5cb/1920.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — As Donald Trump seeks a return to the White House, criminal charges are piling up for the people who tried to help him stay there in 2020 by promoting false theories of voter fraud.",
      "publishedAt": "2024-04-25T21:33:56Z",
      "title": "These people were charged with interfering in the 2020 election. Some are still in politics today",
      "url": "https://apnews.com/8137b90da8c3a971316e0cfa3acfd6a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35f4fd9a330c4fe28c86c60a365309de/3000.jpeg"
    },
    {
      "author": "STEVE LeBLANC and NICK PERRY",
      "description": "The University of Southern California canceled its main graduation ceremony Thursday and dozens more college students were arrested at other campuses nationwide as protests against the Israel-Hamas war continued to spread.",
      "publishedAt": "2024-04-25T07:04:41Z",
      "title": "USC cancels graduation ceremony and dozens are arrested on other campuses as anti-war protests grow",
      "url": "https://apnews.com/fbd7dd06431f32d24d0f8abcc8a56b8b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22efbe3d18a440eba1b9f4396a73995e/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Palestinian militant group Hamas has said for more than 15 years that it could accept a two-state compromise with Israel — at least, a temporary one.",
      "publishedAt": "2024-04-25T21:58:53Z",
      "title": "Hamas again raises the possibility of a 2-state compromise. Israel and its allies aren't convinced",
      "url": "https://apnews.com/f756cc054732eb3f7e0c49a9987560a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96420f8670d8421ab8dc45d272927e29/3000.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI",
      "description": "NASHVILLE, Tenn. (AP) — Tennessee's GOP-controlled Statehouse on Thursday gave their final approval to legislation criminalizing adults who help minors receive gender-affirming care without parental consent, clearing the way for the first-in-the-nation proposal to be sent to Gov.",
      "publishedAt": "2024-04-25T21:56:43Z",
      "title": "Tennessee lawmakers OK bill criminalizing adults who help minors receive gender-affirming care",
      "url": "https://apnews.com/b7b6700f6a54a3788ec0697f065281b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b55dd0ecba884920bca78299d700bbdd/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haiti opened a new political chapter Thursday with the installation of a transitional council tasked to pick a new prime minister and prepare for eventual presidential elections, in hopes of quelling spiraling gang violence that has killed thousands in the Caribbean country.",
      "publishedAt": "2024-04-25T13:36:23Z",
      "title": "With fear and hope, Haiti warily welcomes new governing council as gang-ravaged country seeks peace",
      "url": "https://apnews.com/22868c51b5f4c9ca5a8d69fcb5df376b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4761b2408aa4a90ade5f34d00aee510/1920.jpeg"
    },
    {
      "author": null,
      "description": "DETROIT (AP) — The Latest on the first round of the NFL draft (all times local):How to watch the 2024 NFL Draft\r\nThe Chicago Bears go on the clock with the NFL draft’s first pick shortly after 7 p.m.",
      "publishedAt": "2024-04-25T20:20:45Z",
      "title": "NFL Draft Latest: The Bears are up, with Caleb Williams expected to go No. 1",
      "url": "https://apnews.com/6f8dff81b41e8ce8d344e4b7ce4e1082",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7db2f601f82644f88afda3baea74d630/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}