{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JULIA FRANKEL and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel said Friday that the military was rounding up Palestinian men in northern Gaza for interrogation, searching for Hamas militants, while desperate Palestinians in the south crowded into an ever-shrinking area, and the U.N.",
      "publishedAt": "2023-12-08T08:49:14Z",
      "title": "Israeli troops round up Palestinian men in northern Gaza as UN warns aid operation is 'in tatters'",
      "url": "https://apnews.com/364b8f23ced3704273faede6f2ca6f38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80fea8dc7b7c4e13be62c5473250ecdc/1920.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The United States vetoed a United Nations resolution Friday backed by almost all other Security Council members and dozens of other nations demanding an immediate humanitarian cease-fire in Gaza.",
      "publishedAt": "2023-12-08T20:22:49Z",
      "title": "US vetoes UN resolution backed by many nations demanding immediate humanitarian cease-fire in Gaza",
      "url": "https://apnews.com/6d3bfd31d6c25168e828274d96b85cf8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f4ea6500cd148c9a7e06bddfb716162/3000.jpeg"
    },
    {
      "author": "ED WHITE and COREY WILLIAMS",
      "description": "PONTIAC, Mich. (AP) — A judge sentenced a Michigan teenager to life in prison Friday for killing four students and terrorizing others at Oxford High School, after listening to hours of gripping anguish from parents and wounded survivors.",
      "publishedAt": "2023-12-08T05:01:14Z",
      "title": "Michigan teen gets life in prison for Oxford High School attack",
      "url": "https://apnews.com/fb10065053ca542b0d443671bab53947",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a38a0f03fad8438d9b8085233838893a/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — A federal appeals court in Washington largely upheld a gag order on Donald Trump in his 2020 election interference case on Friday, but narrowed the restrictions on his speech to allow the former president to criticize the special counsel who brought the case.",
      "publishedAt": "2023-12-08T19:19:32Z",
      "title": "Appeals court upholds gag order on Trump in Washington case but narrows restrictions on his speech",
      "url": "https://apnews.com/33f75551e369b43cc903ad9f2c5d9439",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ad47745df62420fbc196f517ea97438/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — A federal judge on Friday prohibited the separation of families at the border for purposes of deterring immigration for eight years, preemptively blocking resumption of a lightning-rod, Trump-era policy that the former president hasn’t ruled out if voters return him to the White House next year.",
      "publishedAt": "2023-12-08T05:34:19Z",
      "title": "Federal judge prohibits separating migrant families at US border for 8 years",
      "url": "https://apnews.com/2720c59c1873a9c3fc53da1aad4d1a80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c434e8a1026144adb54d39f16740c597/3000.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "Vladimir Putin on Friday moved to prolong his repressive and unyielding grip on Russia for at least another six years, announcing his candidacy in the presidential election next March that he is all but certain to win.",
      "publishedAt": "2023-12-08T11:18:08Z",
      "title": "Putin will seek another term as Russian president, aiming to extend his rule of over two decades",
      "url": "https://apnews.com/f68dfd9139d232929e3da8db639a55c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df303e6f951b48789779f72bf08cdf24/1920.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — European Union negotiators clinched a deal Friday on the world's first comprehensive artificial intelligence rules, paving the way for legal oversight of AI technology that has promised to transform everyday life and spurred warnings of existential dangers to humanity.",
      "publishedAt": "2023-12-08T22:49:51Z",
      "title": "Europe reaches a deal on the world's first comprehensive AI rules",
      "url": "https://apnews.com/59466a4d8fd3597b04542ef25831322c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb36844e9d5e4bdb85ac76f87cdd5331/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MICHAEL BALSAMO",
      "description": "Derek Chauvin was stabbed nearly two dozen times in the law library at a federal prison in Arizona.",
      "publishedAt": "2023-12-08T05:15:38Z",
      "title": "High-profile attacks on Derek Chauvin and Larry Nassar put spotlight on violence in federal prisons",
      "url": "https://apnews.com/410aa291befb9a8dc29e0d77fa13c96e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb2958212e93489fbe198950fd4fd412/2100.jpeg"
    },
    {
      "author": "COLLIN BINKLEY and MARC LEVY",
      "description": "WASHINGTON (AP) — Harvard University's president apologized as pressure mounted for the University of Pennsylvania's president to resign over their testimony at a congressional hearing on antisemitism that critics from the White House on down say failed to demonstrate they would stand up to antisemitism on campus.",
      "publishedAt": "2023-12-08T15:54:14Z",
      "title": "Harvard president apologizes for remarks on antisemitism as pressure mounts on Penn's president",
      "url": "https://apnews.com/20b8513293ee2dbaee053a6fd3f8ce7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbb72e215baa4326943637b44c623e52/3000.jpeg"
    },
    {
      "author": "ANTHONY McCARTNEY",
      "description": "LOS ANGELES (AP) — Ryan O'Neal, the heartthrob actor who went from a TV soap opera to an Oscar-nominated role in \"Love Story\" and delivered a wry performance opposite his charismatic 9-year-old daughter Tatum in \"Paper Moon,\" died Friday, his son said.",
      "publishedAt": "2023-12-08T22:31:59Z",
      "title": "Ryan O'Neal, star of 'Love Story,' 'Paper Moon,' 'Peyton Place' and 'Barry Lyndon,' dies at 82",
      "url": "https://apnews.com/bbb21318db9742d0b1e5e4a51c2fa26d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f1da4fb2edf4959bb381bdb1ba77bd8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}