{
  "articles": [
    {
      "author": "Jill Lawless",
      "description": "The leader of the Labour Party in Scotland, Anas Sarwar, has called on Prime Minister Keir Starmer to resign after revelations about the relationship between former British ambassador to Washington Peter Mandelson and the late sex offender Jeffrey Epstein. Sarwar says that “the distraction needs to end and the leadership in Downing Street has to change.” Sarwar is the most senior Labour figure to call for Starmer to quit, piling more pressure on the prime minister over his decision to appoint Mandelson to the high-profile diplomatic post. Starmer’s chief of staff and his communications director have also quit. Starmer’s office said Monday that he is not planning to step down.",
      "publishedAt": "2026-02-09T09:36:13Z",
      "title": "Leader of Scotland’s Labour Party calls on Starmer to resign",
      "url": "https://apnews.com/article/britain-keir-starmer-crisis-epstein-mandelson-fe972453d392f9a9ca926fc7578c497c",
      "urlToImage": "https://dims.apnews.com/dims4/default/52fd60b/2147483647/strip/true/crop/4660x3105+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2Fec%2F34696177d84aeb7489f41f9d7858%2Fe931c9f052e349bd933e1af73ec060ad"
    },
    {
      "author": "Pan Pylas",
      "description": "British Prime Minister Keir Starmer is facing a battle to stay in post as he comes under heavy criticism for his decision in 2024 to appoint veteran Labour politician Peter Mandelson as the U.K. ambassador to the U.S. despite his ties to Jeffrey Epstein. Starmer’s judgment is in the spotlight like never before after the recent release of millions of Epstein-related documents by the U.S. Justice Department showed how close those ties were. Starmer's leadership has now been called into question as some lawmakers call for him to quit. He could resign or he could face a leadership challenge.",
      "publishedAt": "2026-02-06T14:53:40Z",
      "title": "How Keir Starmer could be replaced if Epstein fallout brings him down",
      "url": "https://apnews.com/article/starmer-britain-epstein-mandelson-leadership-labour-1672f25ab8e2ec9fb4eaed9cb744c0b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/52fd60b/2147483647/strip/true/crop/4660x3105+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2Fec%2F34696177d84aeb7489f41f9d7858%2Fe931c9f052e349bd933e1af73ec060ad"
    },
    {
      "author": "Ty ONeil",
      "description": "Authorities investigating the apparent kidnapping of the mother of “Today” show host Savannah Guthrie have returned to the 84-year-old's Arizona neighborhood several times over the weekend. There’s still no word on whether Nancy Guthrie is alive, and authorities say they have no suspects connected to the case. Her purported abductors sent ransom notes with a Monday deadline demanding money for her return. Savannah Guthrie says the family is prepared to pay. Investigators say they believe Nancy Guthrie was taken from her home against her will on Jan. 31, and there are growing concerns about her health because she needs daily medication.",
      "publishedAt": "2026-02-09T15:50:14Z",
      "title": "Nancy Guthrie search moves into a second week as ransom deadline nears",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-ransom-deadline-arizona-3977f842fd3d1fd66952d1d763944b9d",
      "urlToImage": "https://dims.apnews.com/dims4/default/95ef6d9/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F1d%2F8d80289c3928906eb2612009c4a4%2Fbba86996fd22457fb42ee36510a1ff48"
    },
    {
      "author": "Morgan Lee",
      "description": "A trial focused on whether Meta misrepresented the safety of its platforms when it comes to the dangers of child sexual exploitation is set to start in New Mexico. Opening statements are scheduled for Monday. It’s the first stand-alone trial from state prosecutors in a stream of lawsuits against major social media companies over harms to children. New Mexico Attorney General Raúl Torrez sued Meta in 2023. He alleges Meta platforms enabled predators who target children for sexual exploitation. Meta denies the allegations and says prosecutors are taking a “sensationalist” approach. The trial is likely to highlight explicit online content and its effects.",
      "publishedAt": "2026-02-09T05:15:31Z",
      "title": "Trial begins in New Mexico over Meta's effects on children",
      "url": "https://apnews.com/article/meta-new-mexico-child-exploitation-trial-19195fc680dba782fb971d68082e11a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec52b0a/2147483647/strip/true/crop/5804x3867+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2Fd1%2F22df183be50efd17c6a852ce5e38%2Ff258644f266d416d8a589c48c9932e7d"
    },
    {
      "author": "Kaitlyn Huamani, Barbara Ortutay",
      "description": "The world’s biggest social media companies face several landmark trials this year that seek to hold them responsible for harms to children who use their platforms. Opening arguments for the first, in Los Angeles County Superior Court, begin this week. Instagram parent company Meta and Google’s YouTube will face claims that their platforms deliberately addict and harm children. TikTok and Snap, which were originally named in the lawsuit, settled for undisclosed sums. This case marks the first time the companies will argue their case before a jury, and the outcome could have profound effects on their businesses and how they will handle children using their platforms.",
      "publishedAt": "2026-02-09T06:00:08Z",
      "title": "Arguments to begin in landmark social media addiction trial set in Los Angeles",
      "url": "https://apnews.com/article/meta-instagram-youtube-social-media-addiction-los-angeles-1b409b31438e5ba46e2e8c064229b51a",
      "urlToImage": "https://dims.apnews.com/dims4/default/359b785/2147483647/strip/true/crop/6362x4239+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F3f%2F426dc48e71339c47d349ebbf7db8%2F0756b1832a88491585f86e6574ec8f6c"
    },
    {
      "author": "Lisa Mascaro",
      "description": "The images of masked federal officers has become a flashpoint in the Trump administration’s immigration enforcement operations. Not in recent U.S. memory has an American policing operation so consistently masked its officers from the public. Whether to allow — or ban — the masks has emerged as a central question as Congress debates over funding for the Department of Homeland Security. Democrats want to ban masks as one of several proposals to rein in immigration operations. But many Republicans support the masks. The Department of Homeland Security believes the masks are important to safeguard employees from online harassment. Lawmakers face a Friday midnight funding deadline to avoid a partial agency shutdown.",
      "publishedAt": "2026-02-09T12:05:22Z",
      "title": "Masks become symbol of Trump's ICE crackdown and a flashpoint in Congress",
      "url": "https://apnews.com/article/ice-masks-congress-homeland-security-shutdown-funding-3c5b2050286aab930d8c81eb9cb1e03e",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1fa4e7/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2Fb2%2F9f472876853f39810213ee6bff76%2Faae1fcd2d2224d3c85abb5bbba919588"
    },
    {
      "author": "Gisela Salomon",
      "description": "Prolonged detention has become more common in President Donald Trump’s second term, at least partly because a new policy generally prohibits immigration judges from releasing detainees while their deportation cases wind through backlogged courts. The number of people in Immigration and Customs Enforcement detention has topped 70,000 for the first time. The agency said there were 7,252 people in custody at least six months in mid-January, including 79 held for more than two years. That’s more than double the 2,849 who were in ICE custody at least six months in December 2024, the last full month of Joe Biden’s presidency.",
      "publishedAt": "2026-02-09T05:06:32Z",
      "title": "Trump's second term sees rise in prolonged ICE detention cases",
      "url": "https://apnews.com/article/immigration-migrants-detention-trump-deportations-c8bfb50adac8fe9554f4d5aeefbe30cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/bcadf5d/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F49%2Fce89c929b7ded1c9f9519cb3770c%2F028c7b6269de406f9fdcbe6fcaed285c"
    },
    {
      "author": "Philip Marcelo, Jennifer Peltz",
      "description": "Nurses and two major hospital systems in New York City have reached a deal to end a nearly monthlong strike over staffing levels, workplace safety and other issues. The tentative agreement announced Monday involves Montefiore and Mount Sinai hospital systems. Nurses remain on strike at NewYork Presbyterian. The walkout began Jan. 12. The hospitals scrambled to hire legions of temporary nurses to fill in during a demanding flu season. Mount Sinai alone hired 1,400 temporary nurses. The three-year deal, which still needs to be approved by union members, affects roughly 10,500 of the some 15,000 nurses on strike at some of the city’s biggest private, nonprofit hospitals.",
      "publishedAt": "2026-02-09T16:04:36Z",
      "title": "NYC nurses reach deal to end strike at Montefiore and Mount Sinai",
      "url": "https://apnews.com/article/nursing-strike-nyc-hospitals-agreement-0d837a65f5f3d74ea73eceeea89c2e74",
      "urlToImage": "https://dims.apnews.com/dims4/default/1129d74/2147483647/strip/true/crop/5445x3628+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Faa%2Ffa2d58622d8283ab9e6406082738%2F9172d48c735840268cc2afcaaa64ad21"
    },
    {
      "author": "Janie Mccauley",
      "description": "Sam Darnold and that stingy Seattle Seahawks defense captured the franchise’s second Super Bowl championship on the familiar field of their rival, the San Francisco 49ers. General manager John Schneider considered that an advantage in his team’s 29-13 victory against the New England Patriots after Seattle won 13-3 at Levi’s Stadium just last month. The week leading up to Super Bowl 60 was filled with memorable moments, including AP NFL MVP Matthew Stafford announcing he's returning next season for the Los Angeles Rams and Bad Bunny performing at halftime.",
      "publishedAt": "2026-02-09T11:00:07Z",
      "title": "Super Bowl week in the Bay Area an eventful one",
      "url": "https://apnews.com/article/super-bowl-maye-williams-bad-bunny-52fc8101437ac2f473cf8f867470ceb8",
      "urlToImage": "https://dims.apnews.com/dims4/default/79c07e4/2147483647/strip/true/crop/6075x4048+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F69%2F96159e1f517b068cfa0d669dadf8%2F834fe16a1d5d465cb6c4fbd9b9bd0ea1"
    },
    {
      "author": "Andrew Dampf, Pat Graham",
      "description": "Lindsey Vonn's crash in the Olympic downhill has sparked debate over whether she should have raced with a severely injured knee. Nine days before the crash, Vonn revealed she had a ruptured ACL, an injury that typically sidelines athletes for months. Despite this, she decided to compete after consulting with her medical team. The International Ski and Snowboard Federation (FIS) president, Johan Eliasch, says the decision should be left to the athlete. Vonn underwent surgery for a broken leg after the crash. Many in the skiing community support her choice, emphasizing personal responsibility in the sport.",
      "publishedAt": "2026-02-09T13:42:07Z",
      "title": "Ski federation, racers defend Lindsey Vonn's right to race Olympic downhill",
      "url": "https://apnews.com/article/lindsey-vonn-crash-olympics-cortina-81da72485c0e860aead3fdf91b841f7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a5864f1/2147483647/strip/true/crop/2365x1576+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F47%2Ff42c930b8661146ddec8198fbac2%2F26093321c50b40e887e7e0850be16e0f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}