{
  "articles": [
    {
      "author": "THOMAS BEAUMONT and COLLEEN LONG",
      "description": "WASHINGTON (AP) — While President Joe Biden was out of sight at Camp David Sunday spending time with family, prominent Democrats rallied with a public show of unwavering support for his campaign following his unsteady debate performance and growing anxiety over whether he should remain in the White House race.",
      "publishedAt": "2024-06-30T17:33:49Z",
      "title": "Biden allies rally behind him with a public show of support as he spends family time at Camp David",
      "url": "https://apnews.com/01bd3586a2f2da9217a04d031ddd7934",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f939740915c84e2884d18670711cc1a0/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — French voters face a decisive choice on July 7 in the runoff of snap parliamentary elections that could see the country’s first far-right government since the World War II Nazi occupation — or no majority emerging at all.",
      "publishedAt": "2024-06-30T22:24:33Z",
      "title": "French far right ahead in 1st round of snap elections. Here's how runoff works and what comes next",
      "url": "https://apnews.com/193233ade08821a71731980d8a17eb4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41e0198fc13742f4be5518da2a66b951/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "The U.S. Justice Department is pushing Boeing to plead guilty to criminal fraud in connection with two deadly plane crashes involving its 737 Max jetliners, according to several people who heard federal prosecutors detail a proposed offer Sunday.",
      "publishedAt": "2024-06-30T20:11:33Z",
      "title": "US wants Boeing to plead guilty to fraud over fatal crashes, lawyers say",
      "url": "https://apnews.com/861175435e04039112fde0ac6bdbf75a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03574d85a7c74bd8866533bb7954709e/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Hurricane Beryl strengthened into what experts called an \"extremely dangerous” Category 4 storm as it approached the southeast Caribbean, which began shutting down Sunday amid urgent pleas from government officials for people to take shelter.",
      "publishedAt": "2024-06-30T10:50:38Z",
      "title": "Hurricane Beryl strengthens into a Category 4 storm as it nears the southeast Caribbean",
      "url": "https://apnews.com/aaae273e307658866fdd27f9f2c76592",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5b2f70b8f404244868532c2c7aa6dcc/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — The monthlong celebration of LGBTQ+ Pride reached its exuberant grand finale on Sunday, bringing rainbow-laden revelers to the streets for marquee parades in New York, Chicago, San Francisco and elsewhere across the globe.",
      "publishedAt": "2024-06-30T05:41:20Z",
      "title": "LGBTQ+ Pride Month culminates with parades in NYC, San Francisco and beyond",
      "url": "https://apnews.com/0c8dd29c5f0d09c9e52b8b47a39efcd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18f364fce25b4438ad6f4bd7773522e4/1920.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "LA PAZ, Bolivia (AP) — Former President Evo Morales on Sunday accused his political ally-turned-rival President Luis Arce of deceiving Bolivians by staging a “self-coup” last week to earn political points among the electorate, marking a sharp downturn in an already fraught relationship.",
      "publishedAt": "2024-06-30T20:15:44Z",
      "title": "Bolivian president orchestrated a 'self-coup,' political rival Evo Morales claims",
      "url": "https://apnews.com/b0051f5a98fdd7ec5ba212bbe49d9850",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52fd056e4a1542819e7bd00cd40b25dc/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "On Wednesday, Nyah Mway finished middle school in the central New York city where his family moved about a decade ago as refugees from Myanmar, relatives said.By Friday night, the 13-year-old was fatally shot by police who’d tackled him to the ground after he allegedly pointed what turned out to be a BB gun at them during a foot chase.",
      "publishedAt": "2024-06-30T16:24:59Z",
      "title": "Family demands accountability for NY police killing of 13-year-old boy. Police said he aimed BB gun",
      "url": "https://apnews.com/234d947f193da65b25b4a5d1ed2c2fce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06971c4cc9a742d3be89fa16567c679e/1920.jpeg"
    },
    {
      "author": "OHAD ZWIGENBERG",
      "description": "JERUSALEM (AP) — Thousands of Jewish ultra-Orthodox men clashed with Israeli police in central Jerusalem on Sunday during a protest against a Supreme Court order for them to begin enlisting for military service.",
      "publishedAt": "2024-06-30T18:41:05Z",
      "title": "Ultra-Orthodox protest against order to enlist in Israeli military turns violent in Jerusalem",
      "url": "https://apnews.com/5b17485638c0a3e578b179a8bbf44fe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c793d8094014228ab73251d186c6a88/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Beginning Monday, a California law will require credit card networks like Visa and Mastercard to provide banks with special retail codes that can be assigned to gun stores in order to track their sales.",
      "publishedAt": "2024-06-30T04:38:33Z",
      "title": "Should gun store sales get special credit card tracking? States split on mandating or prohibiting it",
      "url": "https://apnews.com/abe3a28ea7117340d9a4a8bcde3693fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a710c563f6604218ae3834bbe31cfec1/3000.jpeg"
    },
    {
      "author": "MAE ANDERSON",
      "description": "NEW YORK (AP) — With summer having gotten off to a scorching start, workers across the country may be dreaming of a seaside escape or cutting out early to watch a movie in an air-conditioned theater.",
      "publishedAt": "2024-06-30T12:09:11Z",
      "title": "Summer hours are a perk small businesses can offer to workers to boost morale",
      "url": "https://apnews.com/bd420489d2b71649deec784f68e14440",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5643a1b7c1f44b0a8919f4554f0cc31/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}