{
  "articles": [
    {
      "author": "Alanna Durkin Richer, Giovanna Dell'Orto",
      "description": "Attorney General Pam Bondi says a woman who led an anti-immigration enforcement protest that disrupted a service at a Minnesota church has been arrested. Bondi announced the arrest of Nekima Levy Armstrong in a post on X on Thursday. On Sunday, protesters entered the Cities Church in St. Paul, where a local official with U.S. Immigration and Customs Enforcement serves as a pastor. The group interrupted services by chanting “ICE out” and “Justice for Renee Good,” referring to the 37-year-old mother of three who was fatally shot by an ICE officer in Minneapolis earlier this month. Levy Armstrong, a civil rights attorney and prominent local activist, had called for the pastor affiliated with ICE to resign.",
      "publishedAt": "2026-01-22T14:41:30Z",
      "title": "Woman arrested for leading a protests at a Minnesota church",
      "url": "https://apnews.com/article/justice-department-minnesota-church-disruption-bondi-ed084f5005187f58eabe0cc627d1862b",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba8601d/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F67%2F415b77bdc0f5f83ed5e8ce2627f2%2F3f51bd3a8d644c038b291a27b3ada84e"
    },
    {
      "author": "Hallie Golden, Sarah Raza",
      "description": "Federal agents have detained a 5-year-old boy and his father in Minnesota, taking them to a detention facility in Texas. School officials and the family's lawyer say this is part of the ongoing immigration enforcement surge in the Twin Cities. Zena Stenvik, the school superintendent in the Minneapolis suburb of Columbia Heights, says the boy, Liam Conejo Ramos, was “essentially” used “as bait” to apprehend his father, who is pursuing an asylum claim in the U.S. The Department of Homeland Security says the operation targeted the father, not the child. It's not clear if the father asked for his son to be taken into custody with him. Liam is the district's fourth student who has been detained recently.",
      "publishedAt": "2026-01-22T14:57:34Z",
      "title": "Federal agents detain 5-year-old boy in Minnesota immigration raid",
      "url": "https://apnews.com/article/immigration-minnesota-boy-father-detained-342f319fafb766d13afe07f5bcc1f112",
      "urlToImage": "https://dims.apnews.com/dims4/default/29cdada/2147483647/strip/true/crop/1536x1023+0+512/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F6c%2F193a4103f7ee7d6419da6c99b451%2F8639462d3c80406883929c3a8c3628b1"
    },
    {
      "author": "Lisa Mascaro, Mary Clare Jalonick, Alanna Durkin Richer, Eric Tucker",
      "description": "Former Special Counsel Jack Smith testified publicly for the first time on Capitol Hill about his investigation of President Donald Trump’s efforts to overturn the 2020 election. Over five hours, he detailed how the defeated president “sought to prey” on supporters and “stay in power,” culminating in the Jan. 6, 2021, Capitol attack. The House Judiciary Committee delved into far-flung details — from a former White House aide's earlier blockbuster testimony to Smith's subpoena of certain lawmakers' phone records. Trump was live-posting his rage against Smith, suggesting the former career prosecutor should himself be prosecuted. Smith said he would “not be intimidated.”",
      "publishedAt": "2026-01-22T23:22:16Z",
      "title": "Takeaways from Jack Smith's testimony on his case against Trump",
      "url": "https://apnews.com/article/jack-smith-trump-prosecution-testimony-congress-riot-31a32aa0f81f409b2830dd4d19eafe1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/7193dba/2147483647/strip/true/crop/7610x5071+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2F8c%2F95ee12c5d22cf6c7c1f17615050a%2Ff33b789fe1c54a6f98deddd8b8a422eb"
    },
    {
      "author": "Emilie Megnien, Sean Murphy",
      "description": "Crews spread salt on roads and readied snowplows as a storm threatened to bring snow, sleet and freezing rain to a broad section of the U.S. in the coming days. Meteorologists say ice may linger on roads and sidewalks because temperatures will be slow to warm in many areas. Ice could also weigh down trees and power lines, triggering widespread outages. Forecasters say the storm will hit much of the nation’s midsection starting Friday and then head toward the East Coast through Sunday. The National Weather Service said the coldest windchills may fall below minus 50 Fahrenheit across the Northern Plains.",
      "publishedAt": "2026-01-22T05:01:48Z",
      "title": "States from New Mexico to the Carolinas prepare for severe ice storm",
      "url": "https://apnews.com/article/winter-storm-ice-snow-freezing-rain-f8f2277db0d87b1aa3d4893c565ce57c",
      "urlToImage": "https://dims.apnews.com/dims4/default/d9b2b4a/2147483647/strip/true/crop/5022x2825+0+262/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2F8d%2Fea49b224e1395a6732f8840c4098%2F2d275591fed340369521991b91e01b04"
    },
    {
      "author": "Geoff Mulvihill",
      "description": "President Donald Trump's budget office is telling government agencies to compile data on federal money sent to a group of 14 mostly Democratic-controlled states and the District of Columbia. The administration says in a memo obtained by The Associated Press that the purpose is to “facilitate efforts to reduce the improper and fraudulent use of those funds.” The memo to the agencies does not explain why it's focusing on those states. The order comes the week after Trump threatened to deny federal funding to states that are home to local governments that resist his immigration policies.",
      "publishedAt": "2026-01-22T19:54:17Z",
      "title": "Trump administration compiles data on funds for Democratic states",
      "url": "https://apnews.com/article/federal-funding-democratic-states-trump-86ca32c623f1a2b947a462fced4a8f2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/bf7934a/2147483647/strip/true/crop/4861x3239+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F95%2F5221ecc38bcff6b6b853f641c741%2F8c4bff1b07394d4e86aedd62766b8e90"
    },
    {
      "author": null,
      "description": "President Donald Trump is suing JPMorgan Chase and its CEO Jamie Dimon for $5 billion. He alleges the bank closed his accounts for political reasons after he left office in January 2021. The lawsuit, filed in Miami-Dade County court, claims JPMorgan abruptly closed multiple accounts in February 2021, giving 60 days' notice without explanation. Trump says this cut him off from millions and disrupted his businesses. JPMorgan, in a statement, expressed regret over the lawsuit but denied political motives. A spokesperson said the suit lacks merit, emphasizing accounts are closed for legal or regulatory risks, not political reasons.",
      "publishedAt": "2026-01-22T18:32:56Z",
      "title": "Trump sues JPMorgan for $5 billion, alleges bank closed his accounts for political reasons",
      "url": "https://apnews.com/article/trump-jpmorgan-debanking-jamie-dimon-a976813384a942e5152f17659fdebd16",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ef2094/2147483647/strip/true/crop/2786x1856+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2Fce%2F5314001c5b95fd72fa531a4fc8c4%2F68c6aff52a34428cb446978ff6780542"
    },
    {
      "author": "Kamila Hrabchuk, Kostya Manenkov",
      "description": "Ukrainian President Volodymyr Zelenskyy is criticizing European allies for their slow and fragmented response to Russia's invasion. Speaking at the World Economic Forum in Davos, he highlighted Europe's inadequate support compared to the U.S. push for peace. Zelenskyy met with U.S. President Donald Trump, calling the talks productive. He urges Europe to become a global force, contrasting its response to Washington's actions in Venezuela and Iran. Despite European support, internal disagreements and slow responses frustrate Kyiv. Zelenskyy stresses the need for Western weaponry and international focus on the war as Russia's influence persists.",
      "publishedAt": "2026-01-22T16:29:43Z",
      "title": "Ukraine's leader slams Europe for not acting on his repeated warnings",
      "url": "https://apnews.com/article/russia-ukraine-war-davos-peace-europe-2868a90778ddd304002b91f5d06fe454",
      "urlToImage": "https://dims.apnews.com/dims4/default/3da7a05/2147483647/strip/true/crop/5460x3638+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2Fb0%2F92a333438fbd5f71e1f917752739%2F0f169a2ddcea43d9b285a7cda43cca1a"
    },
    {
      "author": "The Associated Press",
      "description": "The Trump administration is ending the use of abortion-derived fetal tissue in research funded by the National Institutes of Health. The government has funded research involving fetal tissue for decades, under both Republicans and Democrats. The tissue has been critical for research involving HIV, cancer and other diseases. Opponents say there are alternatives, although scientists say there aren't always adequate substitutes. The policy announced Thursday expands restrictions issued in the first Trump administration to cover all NIH-funded research. In 2024, the $47 billion agency counted just 77 funded projects that included fetal tissue.",
      "publishedAt": "2026-01-22T20:06:07Z",
      "title": "NIH ends funding of research using abortion-derived fetal tissue",
      "url": "https://apnews.com/article/fetal-tissue-abortion-research-nih-90c096dec2b533dd19983b8eabde692a",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d9629c/2147483647/strip/true/crop/2516x1676+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2F2c%2F3255d1f3960f64f4eb33b00af0dd%2F148ce4bc19db423dbc66eadeb24e7883"
    },
    {
      "author": "Kaitlyn Huamani",
      "description": "TikTok has finalized a deal to create a new American entity, avoiding the looming threat of a ban in the U.S. that has been in discussion for years. The social video platform company signed agreements with major investors including Oracle, Silver Lake and MGX to form the joint venture. The new version will operate under “defined safeguards” with an emphasis on data protections and software assurances for U.S. users, the company said in a statement Thursday. The establishment of a U.S. unit marks the end of years of uncertainty about the fate of the popular video-sharing platform in the United States.",
      "publishedAt": "2026-01-23T01:43:05Z",
      "title": "TikTok finalizes deal to form new US unit",
      "url": "https://apnews.com/article/tiktok-deal-us-china-eccb46c3bfee4cf3d362a01fe4968a4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c704b51/2147483647/strip/true/crop/3077x2050+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F66%2F2bac3eab8b6bc2092f3be5c760b8%2F63068171209947e9b2a96af8438c9fbd"
    },
    {
      "author": "Lindsey Bahr",
      "description": "Leonardo DiCaprio has picked up his sixth lead actor Oscar nomination for his role in “One Battle After Another.” Ten years after winning for “The Revenant,” he joins a select group of actors with this many nominations. Including his supporting nomination for “What’s Eating Gilbert Grape,” he now has eight nominations overall. DiCaprio says the most important thing is being part of a timeless film. The film received 13 nominations, but co-star Chase Infiniti was notably snubbed. DiCaprio tells The Associated Press he spoke to her and that she had an amazing attitude. DiCaprio also emphasized the importance of original filmmaking and the theatrical experience.",
      "publishedAt": "2026-01-22T18:36:21Z",
      "title": "Oscar nominations 2026: DiCaprio joins elite group with sixth nod",
      "url": "https://apnews.com/article/leonardo-dicaprio-oscar-nomination-798743e63d4bb8c56a60cbd3e98d38e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/d00fb35/2147483647/strip/true/crop/3210x2139+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F87%2F3b5d774061afbd6b33bbc3b9d8e7%2Ffb42367a49744f878cd43cb6d2ecb273"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}