{
  "articles": [
    {
      "author": "Eric Tucker, Aamer Madhani",
      "description": "President Donald Trump’s removal of national security adviser Mike Waltz brings further disruption to his national security team. It's a team that's already endured scrutiny over top officials’ use of Signal to discuss sensitive military operations. There also have been mounting questions over the leadership of Defense Secretary Pete Hegseth and about the firing of the four-star general who led the National Security Agency. But Waltz's ouster also enables Trump to consolidate foreign policy matters in just a few hands, with the president asserting even more White House power over the decision-making process and relying on people who've entirely embraced his “America First” agenda.",
      "publishedAt": "2025-05-03T12:08:15Z",
      "title": "Waltz ouster adds to tumult in Trump's national security team",
      "url": "https://apnews.com/article/trump-waltz-rubio-national-security-hegseth-d787db43d45922668ad0c1c62e608f85",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0c59b1/2147483647/strip/true/crop/3266x1837+0+170/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2Feb%2Fdbd8e4e2b9aa0144ced419e940e8%2F3278f17f28cd48a393e5bfb9a418b76f"
    },
    {
      "author": "Nicholas Riccardi",
      "description": "A new mission statement for the Justice Department unit that upholds voting rights shows it's being redirected toward prioritizing President Donald Trump's executive order on elections. Trump has continued to insist that widespread fraud cost him the 2020 presidential election. Repeated audits, investigations and court cases show otherwise. The mission statement is silent on the voting section's normal mission of protecting the right to vote and people from being disenfranchised by gerrymandering. Instead it says the section will combat fraud and ensure that only U.S. citizens vote, even though voting by noncitizens is already illegal and has been shown to be extremely rare.",
      "publishedAt": "2025-05-03T12:27:40Z",
      "title": "Justice Department will prioritize Trump's elections order, memo says",
      "url": "https://apnews.com/article/trump-justice-department-voting-rights-elections-fraud-0717d58a10daa11b3957d277a7ca8e0e",
      "urlToImage": "https://dims.apnews.com/dims4/default/f51003d/2147483647/strip/true/crop/5110x2874+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2Ff3%2Ffaea117ba9a7517b8e37f64647f2%2Fc731c69d87464b2c854c1e9b5f8f510e"
    },
    {
      "author": "Mohammed Jahjouh, Sarah El Deeb",
      "description": "Malnutrition and hunger are prevelant in the Gaza strip as Israel’s blockade enters its third month. Shortage of food and supplies has driven the territory toward starvation. Supplies to treat and pervent malnutrition are depeleted and quickly running out as documented cases of malnutrition rise. Some 3,600 children were admitted and treated for acute malnutrition in the past month_ a figure that is likely rising. Parents are running out of options of what to feed their children and where to take fhem to get help. Images of emaciated children are becoming more frequent and hungry children at community kitchens are fighting for food, alongside adults.",
      "publishedAt": "2025-05-03T17:16:25Z",
      "title": "Mothers struggle to feed their children in Gaza",
      "url": "https://apnews.com/article/gaza-israel-palestinians-malnutrition-children-f94af55885aadaee7e95b2492fc432e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/5869b9a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F8b%2Febdbdb6e9fca1cf859b141fe965c%2F7038c0a7e067409cba5735f2a98dca06"
    },
    {
      "author": "Munir Ahmed",
      "description": "Pakistan has test fired a ballistic missile as tensions with India spike over last month's deadly attack on tourists in the disputed Kashmir region. The surface-to-surface missile has a range of about 280 miles, the Pakistani military said. Saturday's launch of the Abdali Weapon System was aimed at ensuring the “operational readiness of troops and validating key technical parameters,” according to a statement from the military. There was no immediate comment about the launch from India, which blames Pakistan for the April 22 gun massacre that killed 26 people in the resort town of Pahalgam. Pakistan denies the charge.",
      "publishedAt": "2025-05-03T08:21:05Z",
      "title": "Pakistan test fires ballistic missile as tensions with India spike",
      "url": "https://apnews.com/article/pakistan-india-ballistic-missile-kashmir-tensions-70ad575139eeef3673c0c99cbed30302",
      "urlToImage": "https://dims.apnews.com/dims4/default/055ad38/2147483647/strip/true/crop/6384x3591+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2Ffb%2F165e80b8f7e94187b72ae22cfb9a%2F3085fefe176143e7b329c054267b08d8"
    },
    {
      "author": "Rod McGuirk",
      "description": "Australians are voting in Australia’s general election as Prime Minister Anthony Albanese and his rival Peter Dutton ended campaigning along the east coast. Both Albanese and Dutton began Saturday in the electorally-crucial city of Melbourne. Albanese returned home to Sydney and Dutton to his hometown of Brisbane to vote. Albanese’s center-left Labor Party is seeking a second three-year term. Dutton wants to become the first opposition leader to oust a first-term government since 1931, when Australians were reeling from the Great Depression. The election is taking place against a backdrop of what both sides of politics describe as a cost of living crisis.",
      "publishedAt": "2025-05-02T22:04:34Z",
      "title": "Australians vote in election with high prices and shortage of housing major issues",
      "url": "https://apnews.com/article/australia-election-albanese-dutton-251063e866513dfa48b773fb4d6b0d29",
      "urlToImage": "https://dims.apnews.com/dims4/default/d6d926d/2147483647/strip/true/crop/3229x1816+0+168/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fb2%2Fb393301a1742a069b09a89840dcf%2Ff6ef0e95342d4a8780460d5808631de5"
    },
    {
      "author": "Hanna Arhirova, Elise Morton",
      "description": "Ukraine and Russia are at odds over competing ceasefire proposals. Moscow has accused Ukrainian President Volodymyr Zelenskyy of threatening the safety of dignitaries attending Victory Day celebrations after he dismissed Russia’s unilateral 72-hour ceasefire. Zelenskyy instead renewed calls for a more substantial 30-day pause in hostilities, as was initially proposed by the U.S. He said the proposed ceasefire could start anytime as a meaningful step toward ending the three-year war. He said that Ukraine cannot provide security assurances to foreign officials planning to visit Russia around May 9 Victory Day, warning that Moscow could stage provocations and later attempt to blame Ukraine.",
      "publishedAt": "2025-05-03T07:24:19Z",
      "title": "Russia and Ukraine clash over ceasefire proposals as fighting rages",
      "url": "https://apnews.com/article/russia-ukraine-war-drones-kharkiv-4396be6394f46a6320cac4bf82be2941",
      "urlToImage": "https://dims.apnews.com/dims4/default/e6f720b/2147483647/strip/true/crop/2000x1125+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2F8a%2Ff964c0354c0fc89a107b67da90ae%2F68cd7d548a32432ca38395e4ca477840"
    },
    {
      "author": "Nicole Winfield, Jill Colvin",
      "description": "President Donald Trump has posted an artificial intelligence-generated image of himself dressed as pope. The social media post comes as the mourning of Pope Francis continues and the papal conclave is set to begin in a few days. The image is raising eyebrows on social media, at the Vatican, from a group representing Catholic bishops in New York and from Italians. Catholics are in the period of official mourning after Francis' death. Catholic cardinals are due to open the solemn conclave to elect his successor on Wednesday. The death of a pope and election of another is a matter of utmost solemnity for Catholics",
      "publishedAt": "2025-05-03T17:38:29Z",
      "title": "Trump draws criticism with AI image of himself as the pope",
      "url": "https://apnews.com/article/trump-pope-francis-conclave-ai-image-bishops-9d88286886c350c4465f7c2afb7a5e41",
      "urlToImage": "https://dims.apnews.com/dims4/default/53247ad/2147483647/strip/true/crop/3911x2200+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F33%2Fd3b153cd6acfd8416776c628da4f%2F2476823162114b2ea4d0a9a75056f92b"
    },
    {
      "author": "Lauran Neergaard",
      "description": "Some Denver parents got texts during this winter's brutal flu season with videos sharing why people in their neighborhoods chose flu shots for their kids. It was an unusual study about trust and vaccines in a historically Black community but no one will know how it worked out: The Trump administration canceled the project before the data could be analyzed. It's an example of research being lost at time when understanding vaccine hesitancy is especially urgent. Flu killed a near-record 216 children this year and vaccine-preventable measles and whooping cough are soaring.",
      "publishedAt": "2025-05-03T13:00:06Z",
      "title": "A community rallied to share flu shot experiences. Then the government stopped the study",
      "url": "https://apnews.com/article/trump-rfk-vaccine-flu-covid-shot-9efed9b468c849a3db1f793dd7effae6",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ed6e49/2147483647/strip/true/crop/3000x1688+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F0c%2F063b725a201d919632f025b209a1%2Fbfaf084cc7a34befbbc381b46a00ffaf"
    },
    {
      "author": "Josh Funk",
      "description": "Warren Buffett's company reported just over one-third of last year's profit Saturday morning just as thousands of Berkshire Hathaway shareholders streamed into an Omaha arena to listen to the revered investor answer questions. The profit numbers were weighed down by a major drop in the value of its investments and $860 million in insurance losses related to policies that Geico and its other insurance companies wrote before the devastating Southern California wildfires. But Buffett’s comments will be the main attraction Saturday. Investors will be looking for him to explain why Berkshire is now sitting on $347.7 billion cash.",
      "publishedAt": "2025-05-03T12:35:53Z",
      "title": "Warren Buffett's profits fall on wildfire losses as thousands line up to listen to him Saturday",
      "url": "https://apnews.com/article/berkshire-hathaway-warren-buffett-shareholders-annual-meeting-c48c85fc5e1aa24f5dd64b271e57ab2e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b7eab0e/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2F88%2F4e0473562b3120a1997137d939d8%2F702d081bdbc940a7b1b913bce7eb1d95"
    },
    {
      "author": "Jill Lawless",
      "description": "The rift between Prince Harry and his family has burst into the open again. The prince gave a raw television interview after losing a court case over his security. The 40-year-old prince said he wants reconciliation with his estranged family. He also re-aired grievances against the royal family, Britain's government and the media. Harry said that he won't bring his wife Meghan and children to Britain since he was stripped of his government-paid police protection after quitting official royal duties. He said his father King Charles III won’t speak to him because of “this security stuff.” And he highlighted concerns for the health of the king, who has cancer. Harry said “I don’t know how much longer my father has.”",
      "publishedAt": "2025-05-03T11:29:17Z",
      "title": "Grievances and forgiveness were both on display in Prince Harry's raw TV interview",
      "url": "https://apnews.com/article/prince-harry-security-royal-rift-interview-takeaways-22c5d771d9c3d1a94671f32374bbef80",
      "urlToImage": "https://dims.apnews.com/dims4/default/1aa8c7a/2147483647/strip/true/crop/2000x1125+0+105/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2Fdf%2F6b05743c3b5054e9938317daee68%2Fbb3d6a43b469442b958ec3e7be66794a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}