{
  "articles": [
    {
      "author": "SARAH EL DEEB and SAMY MAGDY",
      "description": "BEIRUT (AP) — Lebanese were surveying the damage on Monday after overnight Israeli strikes hit nearly a dozen branches of a Hezbollah-run financial institution that Israel says is used to fund attacks but where many ordinary people keep their savings.",
      "publishedAt": "2024-10-21T09:36:27Z",
      "title": "Lebanon assesses damage after Israel strikes Hezbollah-run financial institution",
      "url": "https://apnews.com/3fe94c75a6d6d44c89f350d7e94785df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0737e37d4da4a2085d3040e9ced2d9f/1920.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "On top of the grievous toll in human life and misery, Israel's war against the Hamas and Hezbollah militant groups has been expensive, and the painfully high financial costs are raising concerns about the long-term effect of the fighting on the country's economy.",
      "publishedAt": "2024-10-21T04:42:02Z",
      "title": "Israel's wars are expensive. Paying the bill could force tough choices",
      "url": "https://apnews.com/32a53a86d946418022ca636539a83f4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3615ce4338e0450693c038dbc4d6b320/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "RUTHERFORDTON, N.C. (AP) — Renee Kyro already has voted for Republican nominee Donald Trump for the third consecutive presidential election. But she plans to volunteer for the first time, reaching out to her neighbors in hurricane-battered western North Carolina to make sure they have a voting plan amid a flurry of precinct changes.",
      "publishedAt": "2024-10-21T04:20:25Z",
      "title": "In North Carolina, Trump and Harris navigate a hurricane and a rollercoaster governor's race",
      "url": "https://apnews.com/2dea5d3130416a56f21a5c22ce2e4386",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c71769153ec04cd7a9fcbd411ff75ee2/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — Millions of people with private health insurance would be able to pick up over-the-counter methods like condoms, the “morning after” pill and birth control pills for free under a new rule the White House proposed on Monday.",
      "publishedAt": "2024-10-21T09:03:09Z",
      "title": "White House says health insurance needs to fully cover condoms, other over-the-counter birth control",
      "url": "https://apnews.com/f9701dc9137867c62f6a22e1501bebe6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc055144e1c14541aec64956152d1113/3000.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM",
      "description": "SAYLORSBURG, Pa. (AP) — Fethullah Gülen, a reclusive U.S.-based Islamic cleric who inspired a global social movement while facing accusations he masterminded a failed 2016 coup in his native Turkey, has died.",
      "publishedAt": "2024-10-21T09:11:37Z",
      "title": "Self-exiled Turkish spiritual leader Fethullah Gülen dies in the US",
      "url": "https://apnews.com/d808184b89acffcd1c9b24ba87d3d5f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3981efafcfb5412e98052b21ed368ba1/3000.jpeg"
    },
    {
      "author": "ANDREA RODRIGUEZ and MILEXSY DURAN",
      "description": "HAVANA (AP) — Cuba's widespread blackouts stretched into their fourth day as Hurricane Oscar crossed the island’s eastern coast with winds and heavy rain.",
      "publishedAt": "2024-10-21T04:49:59Z",
      "title": "Cubans struggle with an extended power outage and a new tropical storm",
      "url": "https://apnews.com/b197e174af2c9f664d4c3aaf0c5a6e75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aea1f81d9edd4d71994b100309db1c5e/1920.jpeg"
    },
    {
      "author": null,
      "description": "CANBERRA, Australia (AP) — An Indigenous senator told King Charles III that Australia is not his land as the British royal visited Australia’s parliament on Monday.",
      "publishedAt": "2024-10-21T02:48:26Z",
      "title": "'You are not my king,' Indigenous Australian senator yells at visiting King Charles",
      "url": "https://apnews.com/4ea87d39d17c4a9fe3cbfab3455fb8f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b823e89474a242ff81ad5dbe99c6ffe3/1920.jpeg"
    },
    {
      "author": "RUSS BYNUM and EMILY WAGSTER PETTUS",
      "description": "SAVANNAH, Ga. (AP) — The metal gangway where dozens of people waited to board a ferry boat made a loud, creaking noise before snapping in the middle amid panicked cries from those sent plunging into the water.",
      "publishedAt": "2024-10-21T04:07:11Z",
      "title": "Eyewitness video captures frantic efforts to save lives after deadly collapse of dock walkway",
      "url": "https://apnews.com/cc67d03b802cc97594d1fb1a591cb408",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38cafc201fe04b70b0cd06b7cb1a328d/1920.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — Broadway vs. Hollywood. Subway vs. Freeway. Judge vs. Ohtani.New York neighbors who became cross-country rivals, the Yankees and Dodgers renew their starry struggle in the World Series for the first time in 43 years.",
      "publishedAt": "2024-10-21T03:34:03Z",
      "title": "Yankees and Dodgers meet in World Series for 12th time in matchup of Broadway and Hollywood",
      "url": "https://apnews.com/a0996d2d1906deafe38b2b15dc26ad0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a9f22f4bfcd4549a809037842bc37a1/1176.jpeg"
    },
    {
      "author": "STEVEN GRATTAN",
      "description": "BOGOTA, Colombia (AP) — Global environmental leaders gathered Monday in Cali, Colombia to assess the world’s plummeting biodiversity levels and commitments by countries to protect plants, animals and critical habitats.",
      "publishedAt": "2024-10-21T02:02:45Z",
      "title": "Environmental delegates gather in Colombia for a conference on dwindling global biodiversity",
      "url": "https://apnews.com/a188a2f1c6319e16ad4f7071a0fc8572",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/451a5bdf682f4bfd95d66489e0cc7e52/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}