{
  "articles": [
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden was indicted Thursday on federal firearms charges, the latest step in a long-running investigation into the president's son that puts the case on track toward a possible high-stakes trial as the 2024 election looms.",
      "publishedAt": "2023-09-14T17:36:21Z",
      "title": "Hunter Biden indicted on federal firearms charges in long-running probe weeks after plea deal failed",
      "url": "https://apnews.com/e5c8ded90ea8c22d2e2e7cb09804b747",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4306b7c97b084d409fea6448d4a1240f/2160.jpeg"
    },
    {
      "author": "COLLEEN LONG and EMILY SWANSON",
      "description": "WASHINGTON (AP) — About half of Americans say they have little or no confidence that the Justice Department is handling its investigation into Hunter Biden in a fair and nonpartisan way, and 1 in 3 are highly concerned about whether President Joe Biden may have committed wrongdoing related to his son’s business dealings, according to a new poll.",
      "publishedAt": "2023-09-14T17:06:32Z",
      "title": "Americans sharply divided over whether Biden acted wrongly in son's businesses, AP-NORC poll shows",
      "url": "https://apnews.com/39a0268a3e2d4a0df1bed285d769b74a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/094bf8b07a0846d397be7dee23df736a/1671.jpeg"
    },
    {
      "author": "SAMY MAGDY and YOUSEF MURAD",
      "description": "DERNA, Libya (AP) — The death toll in Libya's coastal city of Derna has soared to 11,300 as search efforts continue following a massive flood fed by the breaching of two dams in heavy rains, the Libyan Red Crescent said Thursday",
      "publishedAt": "2023-09-14T08:07:24Z",
      "title": "Flooding death toll soars to 11,300 in Libya's coastal city of Derna, aid group says",
      "url": "https://apnews.com/21b1a195d261a642e12dac13f0d19431",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ce2eaefb7ba4ad6bc7faf142e5e3c71/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Angry, frustrated and unable to lead a fractured and unruly Republican majority, House Speaker Kevin McCarthy on Thursday told the colleagues threatening to oust him: Do it.",
      "publishedAt": "2023-09-14T15:57:16Z",
      "title": "Angry and frustrated, McCarthy finds that even a Biden impeachment inquiry isn't enough for GOP",
      "url": "https://apnews.com/3ec12e37d00004b1e84b3d3db3237863",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a770d765222e4d1eafa4a27a66072cb8/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — Donald Trump will not face trial next month in Georgia after a judge ruled Thursday that the former president and 16 others accused of illegally trying to overturn the results of the 2020 election will be tried separately from two other defendants in the case.",
      "publishedAt": "2023-09-14T13:45:59Z",
      "title": "Trump won't be tried with Powell and Chesebro next month in the Georgia election case, a judge rules",
      "url": "https://apnews.com/5b1e1338ac2d1e4bf209b9fde38fa02f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77447dfb631c452b95d4f68887a89e42/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "New England is known for its fickle weather, powerful nor'easters and blizzards. Destructive hurricanes, however, are relatively rare and typically don't pack the same punch as tropical cyclones that hit the Southeast.",
      "publishedAt": "2023-09-14T20:03:57Z",
      "title": "How hard will Hurricane Lee hit New England? The cold North Atlantic may decide that",
      "url": "https://apnews.com/4be9fed47adbf17e9d1f5a2224d35528",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60e3dcc168fc42b2950e47be9427d711/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD and SHELBY LUM",
      "description": "NEW YORK (AP) — Dozens of doctors and nurses silently lined the hospital hallway in tribute: For a history-making two months, a pig’s kidney worked normally inside the brain-dead man on the gurney rolling past them.",
      "publishedAt": "2023-09-14T14:28:51Z",
      "title": "Pig kidney works a record 2 months in donated body, raising hope for animal-human transplants",
      "url": "https://apnews.com/83dfb5e6d022ca72039a821cc6bc00ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fdf11a0055c4cc389404851fc21d8cf/1571.jpeg"
    },
    {
      "author": "HARM VENHUIZEN",
      "description": "MADISON, Wis. (AP) — The Republican-controlled Wisconsin Senate voted Thursday to fire the battleground state’s nonpartisan top elections official ahead of the 2024 presidential election.",
      "publishedAt": "2023-09-14T04:07:55Z",
      "title": "GOP-led Wisconsin Senate votes to fire nonpartisan official targeted by 2020 election skeptics",
      "url": "https://apnews.com/62a0ec656530c740934b03083b3e3b11",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2396d123d4df43ff9ad053042df253f2/3000.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM",
      "description": "A murderer who escaped from a Pennsylvania jail and was captured two weeks later told authorities he had been planning to carjack someone and flee to Canada or Puerto Rico, a law enforcement official said Thursday.",
      "publishedAt": "2023-09-14T17:21:32Z",
      "title": "Escaped murderer Danelo Cavalcante told officials he planned to carjack someone and flee US",
      "url": "https://apnews.com/e4cb1527352b4725d8dc533c0e44864b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d87579c35ad464c8fd08b7fb336cf60/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — NASA said Thursday that the study of UFOs will require new scientific techniques, including advanced satellites as well as a shift in how unidentified flying objects are perceived.",
      "publishedAt": "2023-09-14T09:00:17Z",
      "title": "NASA releases UFO report and says more science and less stigma are needed to understand them",
      "url": "https://apnews.com/8b477a5ed6a42f99bb13a4518368ce9a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eed2f7996ba74ba6bb17b218d2a8fc6e/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}