{
  "articles": [
    {
      "author": "MICHAEL BIESECKER and JASON DEAREN",
      "description": "As Hurricane Milton bears down on Florida’s west coast with powerful winds and flooding rain, environmentalists are worried it could scatter the polluted leftovers of the state’s phosphate fertilizer mining industry and other hazardous waste across the peninsula and into vulnerable waterways.",
      "publishedAt": "2024-10-09T20:47:25Z",
      "title": "Polluted waste from Florida's fertilizer industry is in the path of Milton's fury",
      "url": "https://apnews.com/9c08338cf2d6d415329ce594ba818cde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5be271d3a2249e2b71a8cd9bfffb3f7/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER and KATE PAYNE",
      "description": "TAMPA, Fla. (AP) — Hurricane Milton hurled rain, tornadoes and tropical storm-force winds at the U.S. coast Wednesday as time began to run out for residents to evacuate from the potentially catastrophic path the storm was carving toward Florida.",
      "publishedAt": "2024-10-09T04:10:30Z",
      "title": "Rain, tornadoes and tropical storm-force winds lash Florida as Hurricane Milton draws near",
      "url": "https://apnews.com/08bde4b9c29460f471d43c6512821c93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6beadadc86854ae9af8019fac88d4a63/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, SAMY MAGDY and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Israel's defense minister warned on Wednesday that his country's retaliation for a recent Iranian missile attack will be “lethal” and “surprising,” while the Israeli military pushed ahead with a large-scale operation in northern Gaza and a ground offensive in Lebanon against Hezbollah militants.",
      "publishedAt": "2024-10-09T09:11:13Z",
      "title": "Israeli defense minister warns an attack on Iran would be 'lethal' and 'surprising'",
      "url": "https://apnews.com/31a2dff9a2bb49bc3b76f32b1ddee128",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d45f4647ebb48cf8416fa3a2673bd7f/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — A new book's assertion that former President Donald Trump may have had as many as seven private phone calls with Russian President Vladimir Putin since leaving the White House has refocused attention on their politically fraught relationship and on Trump's sustained dialogue with world leaders as he seeks a return to power.",
      "publishedAt": "2024-10-09T21:15:14Z",
      "title": "Trump-Putin ties are back in the spotlight after new book describes calls",
      "url": "https://apnews.com/58fd70da281d47bfa3a3a963e21fc067",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4d17d0c3a8643ec9c74625b027069df/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — Nearly a decade into the Trump Era of politics, less than a month from his third Election Day as the Republican candidate for president and there is still remarkably little consensus within the media about how best to cover Donald Trump.",
      "publishedAt": "2024-10-09T14:44:45Z",
      "title": "Sanewashing? The banality of crazy? A decade into the Trump era, media hasn't figured him out",
      "url": "https://apnews.com/e906e990b5dcfe44b5e672336fe82b32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/117079567c1c40229648c822ee863dd6/2642.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, WILL WEISSERT and JILL COLVIN",
      "description": "SCRANTON, Pa. (AP) — Former President Donald Trump offered his prayers to those in the path of Hurricane Milton as it began to lash Florida while continuing to insult his rival, Vice President Kamala Harris, and other women — saying he had no interest in stopping even if it turned off female voters.",
      "publishedAt": "2024-10-09T12:53:46Z",
      "title": "Trump offers prayers for people in hurricane's path after lashing out at Harris and other women",
      "url": "https://apnews.com/b1f46744537c483e8643a9564d0ebcdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77d9396905ca47df923fcde646ebc52a/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — Sherri Myers, an 82-year-old resident of Pensacola City, Florida, says the Social Security cost-of-living increase she'll receive in January “won't make a dent” in helping her meet her day-to-day expenses.",
      "publishedAt": "2024-10-09T15:24:22Z",
      "title": "Social Security's scheduled cost of living increase 'won't make a dent' for some retirees",
      "url": "https://apnews.com/7c116e6de82bfe3903b1c625d39547eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0cdf58965a714259a7c4ce0e20821ede/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — Justices on the Wisconsin Supreme Court said Wednesday that Gov. Tony Evers' creative use of his expansive veto power in an attempt to lock in a school funding increase for 400 years appeared to be “extreme” and “crazy\" but questioned whether and how it should be reined in.",
      "publishedAt": "2024-10-09T03:59:08Z",
      "title": "Wisconsin Supreme Court grapples with governor's 400-year veto, calling it 'crazy'",
      "url": "https://apnews.com/716bed642511ef8b79b67f69f5dc85e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bf957e34c3f439aa3aefbe597d7ac47/3000.jpeg"
    },
    {
      "author": "EVENS SANON and PIERRE-RICHARD LUXAMA",
      "description": "PONT-SONDÉ, Haiti (AP) — The death toll in a brutal gang attack last week on a small town in central Haiti has risen to 115, a local official told The Associated Press on Wednesday.The attack on residents of Pont-Sondé on Oct.",
      "publishedAt": "2024-10-09T14:11:29Z",
      "title": "The death toll in a gang attack on a small Haitian town rises to 115, a local official says",
      "url": "https://apnews.com/1a45faafb929a605f30af4efd8454aeb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cad49aef40f24feba23344825e6ebd78/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "WASHINGTON (AP) — As if the largest bug to ever live – a monster nearly 9 feet long with several dozen legs – wasn’t terrifying enough, scientists could only just imagine what the extinct beast’s head looked like.",
      "publishedAt": "2024-10-09T18:02:14Z",
      "title": "Scientists recreate the head of this ancient 9-foot-long bug",
      "url": "https://apnews.com/d7d40a748f81026059cb95201702426b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbcfdcecef4a4557a0320f35cf539397/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}