{
  "articles": [
    {
      "author": "JUSTIN SPIKE, NICHOLAS RICCARDI",
      "description": "U.S. conservatives have looked to Hungary's Viktor Orbán as an inspiration for a right-wing America, and the prime minister has become a close ally of President Donald Trump. During Orbán's 15 years in power, he's transformed Hungary from a young democracy into what the European Parliament calls an “electoral autocracy.” The Orbán-Trump relationship is drawing renewed interest as Trump pushes to expand his presidential power in his second term. While the countries’ systems of government are different, there are striking parallels between Trump’s actions and agenda, and what Orbán has achieved in Hungary.",
      "publishedAt": "2025-02-15T12:42:43Z",
      "title": "How Hungary's 'electoral autocracy' parallels Trump's return",
      "url": "https://apnews.com/article/trump-orban-hungary-autocracy-authoritarian-republicans-dfdf6299a614ec4e364be37c1132e446",
      "urlToImage": "https://dims.apnews.com/dims4/default/faf6722/2147483647/strip/true/crop/5045x2838+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F62%2F4d%2F6d52e83e30c2f522d591e369959a%2F9defd5d3439b4edd9c0fb29cee689b9d"
    },
    {
      "author": "PHILIPP JENNE, SUSIE BLANN, EMMA BURROWS",
      "description": "Two top European leaders have stiffened their spines over unsettling new policies from President Donald Trump. Ukraine’s president urged creation of an “armed forces of Europe” and the leader of Germany denounced meddling in its election after U.S. Vice President JD Vance met with a German far-right leader. Strident speeches from Ukrainian President Volodymyr Zelenskyy and German Chancellor Olaf Scholz at the Munich Security Conference on Saturday testified to the impact of Trump decisions that have resonated at home and in Europe. Those include Trump's hopes to end the Russia-Ukraine war and nurture political allies.",
      "publishedAt": "2025-02-15T08:06:51Z",
      "title": "Zelenskyy says time has come for creation of 'armed forces of Europe'",
      "url": "https://apnews.com/article/germany-munich-vance-election-zelenskyy-scholz-ukraine-4e48e115b504f9e3609b3457b48f9db0",
      "urlToImage": "https://dims.apnews.com/dims4/default/4323c35/2147483647/strip/true/crop/5685x3198+0+445/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2Fff%2Feef2a55fcf25b45fd0c808315eac%2F495abdcee36b4bf091e13e3613c11e86"
    },
    {
      "author": "ALFONSO NQUNJANA, GERALD IMRAY",
      "description": "Some white South Africans have showed support for President Donald Trump and gathered at the U.S. Embassy in Pretoria to claim they are victims of racism by their own government. Hundreds of protesters held placards Saturday that read “Thank God for President Trump” and displayed other messages criticizing what they see as racist laws instituted by the South African government that discriminate against the white minority. Many were from the white Afrikaner community that Trump focused on in an executive order a week ago that cut aid and assistance to the South African government.",
      "publishedAt": "2025-02-15T10:39:12Z",
      "title": "White South Africans gather in support of Trump",
      "url": "https://apnews.com/article/trump-south-africa-white-afrikaners-b41aa729360af4d1d090ea1ac1e22cce",
      "urlToImage": "https://dims.apnews.com/dims4/default/c28ed8a/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F55%2Fb6e677ce615b63042c08113ed1af%2Fb6b1f74e5e1044bdb1ecbe472bb22cb1"
    },
    {
      "author": "HOLLY RAMER, PATRICK WHITTLE, MARK SCOLFORO",
      "description": "A traffic stop in Vermont has cracked open a cultlike group called Zizians linked to six deaths in three states. Officials have offered few details about their cross-country investigation, but police and court records, interviews and online postings point to a small group of young computer scientists portrayed as highly intelligent and increasingly violent. Their goals aren’t clear, but online writings span topics from radical veganism and gender identity to artificial intelligence. The dead include Border Patrol Agent David Maland, two members of the group, the parents of another member and a California landlord who tried to evict some of them.",
      "publishedAt": "2025-02-15T05:03:30Z",
      "title": "A Vermont border agent’s death was the latest violence linked to the cultlike Zizian group",
      "url": "https://apnews.com/article/vermont-border-patrol-shooting-youngblut-lasota-zizians-6541ebcefc2806efd105d7db99a24aaf",
      "urlToImage": "https://dims.apnews.com/dims4/default/edfd14f/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2Fc1%2Fa48e011416b25ac3d0b11cf97f5d%2F75895b07e3cd4b8cb837536b5c48a8ac"
    },
    {
      "author": "CLAIRE SAVAGE, ALEXANDRA OLSON",
      "description": "The U.S. Equal Employment Opportunity Commission has moved to dismiss six of its own cases on behalf of workers alleging gender identity discrimination, arguing that the cases now conflict with President Donald Trump’s recent executive order. The agency's requests raise serious questions about whether its protections will continue to extend to transgender and gender nonconforming people going forward. Just last year, the EEOC updated its guidance to specify that deliberately using the wrong pronouns for an employee, or refusing them access to bathrooms corresponding with their gender identity, constituted a form of harassment. That followed a 2020 Supreme Court ruling that gay, lesbian and transgender people are protected from employment discrimination.",
      "publishedAt": "2025-02-15T11:00:08Z",
      "title": "EEOC seeks to drop a gender discrimination case over Trump's orders",
      "url": "https://apnews.com/article/eeoc-trump-gender-identity-discrimination-alabama-73a065c8aa5e0060472e1cac1ecd8212",
      "urlToImage": "https://dims.apnews.com/dims4/default/8074add/2147483647/strip/true/crop/4881x2746+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9a%2F3e%2F2c2aae466797134f65b6e76a1b30%2Fd144d74f0dea4e1c94289a54d3ba164d"
    },
    {
      "author": "MOHAMMAD JAHJOUH, MELANIE LIDMAN, JALAL BWAITEL",
      "description": "Hamas-led militants have released three male Israeli hostages, and Israeli forces began releasing hundreds of prisoners in return, in the latest indication that the fragile ceasefire deal that has paused fighting in the Gaza Strip but that had teetered in recent days, is holding. The three — Iair Horn, Sagui Dekel Chen and Alexander (Sasha) Troufanov — had been abducted from Kibbutz Nir Oz, a hard-hit community in the Oct. 7, 2023, attack that ignited the war. Israel is expected to release 369 Palestinian prisoners and detainees, including 36 serving life sentences over deadly attacks.",
      "publishedAt": "2025-02-15T04:47:59Z",
      "title": "Israel begins releasing Palestinian prisoners after Hamas freed 3 hostages",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-15-2025-22a2d731961eb766e6c7914cb84e3990",
      "urlToImage": "https://dims.apnews.com/dims4/default/49d4412/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F0b%2Fc1f4144e7a052c7b74dee2722cfa%2F3c696641bfe6480a9f3d969c2b2a5160"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "The Vatican says Pope Francis slept well during a quiet first night in the hospital after being admitted with a respiratory tract infection. Francis, 88, ate breakfast Saturday morning and read the newspapers while continuing his drug therapy. Francis was admitted to Rome’s Gemelli hospital on Friday after a weeklong bout of bronchitis worsened. It was his fourth hospitalization since his 2013 election and raised questions about his increasingly precarious health.",
      "publishedAt": "2025-02-15T11:15:02Z",
      "title": "Pope spends quiet first night in hospital, continues drug therapy and reads papers, Vatican says",
      "url": "https://apnews.com/article/vatican-pope-health-bronchitis-104b60f7fc6c9a2c8a8f094d3d63dd18",
      "urlToImage": "https://dims.apnews.com/dims4/default/edb1080/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F2c%2F31672e7dde9f81ab6890fe1650f8%2F691a3fc068a440f592e2106c881e89b5"
    },
    {
      "author": null,
      "description": "A 23-year-old man has stabbed five passersby in southern Austria in what police said was a random attack that left a 14-year-old dead and four others injured.. The suspect was detained Saturday by police. He is a Syrian national with legal residence in Austria. A 42-year-old man who works for a food delivery company witnessed the incident from his car. He drove toward the suspect and helped to prevent things from getting worse, a police spokesperson told Austria’s public broadcaster ORF.",
      "publishedAt": "2025-02-15T18:41:16Z",
      "title": "A 23-year-old man stabbed 5 people in Austria killing 1 in what police described as a random attack",
      "url": "https://apnews.com/article/austria-stabbings-4913f6921c6f27e6d7fd8590da85cc9f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "The IRS will lay off thousands of probationary workers in the middle of tax season, according to two sources familiar with the agency’s plans, and cuts could come as soon as next week. This comes as the Trump administration intensified sweeping efforts to shrink the size of the federal workforce, by ordering agencies to lay off nearly all probationary employees who had not yet gained civil service protection. IRS employees involved in the 2025 tax season were told they will not be allowed to accept a buyout offer from the Trump administration until after the taxpayer filing deadline, according to a letter sent recently to IRS employees.",
      "publishedAt": "2025-02-15T16:23:39Z",
      "title": "IRS to lay off thousands of probationary workers amid tax season",
      "url": "https://apnews.com/article/irs-treasury-layoffs-doge-tax-season-2be8db11fdd510b7ce6ac0db56f9a503",
      "urlToImage": "https://dims.apnews.com/dims4/default/8574d70/2147483647/strip/true/crop/5709x3211+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2Fa0%2F8d790d130184e2125d643094ed67%2Fdd3e1d7440e2448d8a10b2d555bec30e"
    },
    {
      "author": "WILL WEISSERT, JOSH BOAK, LINDSAY WHITEHURST",
      "description": "It's been nearly a month in office for President Donald Trump, and he's acted with dizzying speed to reorder the American economy and global diplomacy. In the early going, he's empowered Elon Musk to help force the firing of thousands of federal employees and potentially shutter entire agencies. The new president has imposed tariffs, wiped out diversity programs and rolled back transgender rights. His administration has begun an immigration crackdown that's been overshadowed by so many other steps. At the same time, the economy is beginning to soften, judges are having their say and even some Republicans in Congress are starting to grumble.",
      "publishedAt": "2025-02-15T14:09:09Z",
      "title": "The warning signs in Trump's first month",
      "url": "https://apnews.com/article/trump-firings-tariffs-lawsuits-economy-ukraine-putin-19b79f62ad7c9d51cfb1f0551953051e",
      "urlToImage": "https://dims.apnews.com/dims4/default/df4944b/2147483647/strip/true/crop/4055x2281+0+216/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd1%2F83%2F88411ff1ab76f00bc8258914eb47%2Ff8b2326f236d4c9d862204fe58bdc267"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}