{
  "articles": [
    {
      "author": null,
      "description": "Canadian police say eight people were killed in a school shooting in British Columbia, including a shooter, and dozens more were injured. The Royal Canadian Mounted Police said Tuesday that a suspect has been found dead with what is believed to be a self-inflicted injury. School shootings are rare in Canada.",
      "publishedAt": "2026-02-11T01:40:17Z",
      "title": "School shooting in northeastern British Columbia kills 8",
      "url": "https://apnews.com/article/canada-shooting-british-columbia-66b021ac7c75e857885b81dc78a29d05",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran’s president has apologized to “all those affected” by the nationwide protest and bloody crackdown that followed it. President Masoud Pezeshkian also denounced on Wednesday unspecified “Western propaganda” surrounding the protests. Pezeshkian said he knew the “great sorrow” felt by people in the protests and crackdown, without directly acknowledging the hand Iranian security forces had in the bloodshed. Pezeshkian also insisted that his nation was “not seeking nuclear weapons. ... and are ready for any kind of verification.” His comments came during a speech at a commemoration marking Iran’s 1979 Islamic Revolution.",
      "publishedAt": "2026-02-11T06:52:00Z",
      "title": "Iran marks 47th anniversary of revolution",
      "url": "https://apnews.com/article/iran-revolution-anniversary-us-nuclear-talks-protests-4ffab53ef628073ca90b9c8707485577",
      "urlToImage": "https://dims.apnews.com/dims4/default/5fb262b/2147483647/strip/true/crop/4174x2781+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F79%2F05e9e6f9f317d7810f1db354c414%2Fafcb32e8928d45d7b0d6f96dee84147b"
    },
    {
      "author": "Ty ONeil, John Seewer, Hallie Golden",
      "description": "Officials say a person has been detained for questioning in the disappearance of Nancy Guthrie. The Pima County Sheriff’s Department said in a statement Tuesday night that deputies detained someone during a traffic stop south of Tucson. The department later said a location in Rio Rico, about an hour's drive from Tucson, was being searched. The news was another potential break in a case that has gripped the nation for more than a week. It came hours after the FBI released surveillance images of a masked person with a handgun holster outside Guthrie’s front door the night she vanished. It wasn’t clear if the person being questioned is the same person captured on surveillance video.",
      "publishedAt": "2026-02-11T09:07:30Z",
      "title": "Investigators searching a location in Arizona in disappearance of Nancy Guthrie",
      "url": "https://apnews.com/article/savannah-guthrie-mom-missing-arizona-6f1016e390e2c59d82604731f795a8ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/5fe5f8d/2147483647/strip/true/crop/5000x3332+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2Ffb%2F24e7ddafb1b6a5f69f27f389ea64%2F23d59d53447a428eaf511b88e3156199"
    },
    {
      "author": "Ryan J. Foley",
      "description": "Investigators say one immigration official abused his girlfriend for years. Another admitted he sexually abused a woman in his custody. A third is charged with taking bribes. A review by The Associated Press found at least two dozen U.S. Immigration and Customs Enforcement employees and contractors have been charged with crimes since 2020. The wrongdoing includes patterns of physical and sexual abuse and corruption. Most cases happened before Congress gave ICE $75 billion last year to hire more agents and detain more people, but experts say these kinds of crimes could accelerate. A spokesperson says ICE takes allegations of misconduct \"extremely seriously\" and thoroughly vets new applicants.",
      "publishedAt": "2026-02-11T05:14:35Z",
      "title": "Crimes by ICE personnel in recent years show patterns of abuse, corruption, AP review shows",
      "url": "https://apnews.com/article/ice-agents-arrested-misconduct-crimes-abuse-corruption-45b0d2248c0add9523e0bf5a953faaea",
      "urlToImage": "https://dims.apnews.com/dims4/default/99c2d5f/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F48%2F5591799bc8841c420b129ac978d5%2Fa36e0e633e5e4429a59a20f0c2568816"
    },
    {
      "author": "Kate Brumback, Eric Tucker, Alanna Durkin Richer",
      "description": "An FBI search of the elections hub in Fulton County, Georgia, is part of an investigation into possible “deficiencies or defects” in the vote count in the 2020 contest lost by President Donald Trump, according to an affidavit unsealed Tuesday. The allegations outlined in the affidavit are largely based on claims that have long been made by people who assert that there was fraud in the 2020 election. Audits, state officials, courts and Trump’s own former attorney general have rejected the idea that there was widespread fraud in the 2020 election that could have altered the outcome.",
      "publishedAt": "2026-02-10T20:02:52Z",
      "title": "Affidavit: FBI search of Georgia offices tied to probe of possible 2020 election 'defects'",
      "url": "https://apnews.com/article/fbi-georgia-elections-fulton-county-2020-ballots-9dfecd778c09134e9aa0bba2848718f5",
      "urlToImage": "https://dims.apnews.com/dims4/default/5aa75bb/2147483647/strip/true/crop/2955x1969+272+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6f%2F8e%2F4bc3584380226f449bae1607ff91%2F26df9d34f88240518bbc23c7cc551f52"
    },
    {
      "author": "Farnoush Amiri, Melanie Lidman",
      "description": "President Donald Trump and Israeli Prime Minister Benjamin Netanyahu are expected to discuss new nuclear talks with Iran. The longtime Israeli leader is visiting the White House on Wednesday. It comes as both Tehran and Washington are projecting cautious optimism after holding indirect talks in Oman on Friday about how once again to approach negotiations over Iran’s nuclear program. It remains unclear how much influence Netanyahu will have over Trump's approach toward Iran. Trump said Tuesday that he wants “no nuclear weapons, no missiles.” Netanyahu’s office has said he wants Iran talks to include limits on Iran’s ballistic missile program and support for militant groups like the Palestinian Hamas and Lebanon’s Hezbollah.",
      "publishedAt": "2026-02-11T05:02:10Z",
      "title": "Trump and Netanyahu meeting to focus on Iran",
      "url": "https://apnews.com/article/israel-iran-trump-netanyahu-nuclear-talks-fa5be8069deb4b1b01cdf30d3e3525e7",
      "urlToImage": "https://dims.apnews.com/dims4/default/148d1b9/2147483647/strip/true/crop/2800x1866+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb4%2F92%2Fcff3128a8d93f54f000c9cdb02d4%2F61591b9a504845cfa509b1fa75e2c1c5"
    },
    {
      "author": "Steve Karnowski",
      "description": "Gov. Tim Walz says the federal immigration crackdown in Minnesota could end soon. He spoke with top Trump administration officials, including border czar Tom Homan and White House chief of staff Susie Wiles. Walz said Tuesday that he anticipates hearing more from the administration soon about the operation's future. Walz emphasized a \"trust but verify\" approach, as the situation could change. Walz also hopes for cooperation on joint investigations into the shooting deaths of two Minnesotans by federal officers. The crackdown has impacted local businesses, with employees and customers staying away out of fear.",
      "publishedAt": "2026-02-10T21:00:47Z",
      "title": "Walz says federal immigration crackdown in Minnesota could end soon",
      "url": "https://apnews.com/article/minnesota-immigration-crackdown-walz-homan-wiles-1f25629bf74467f91e41377f704a6b7a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9737eba/2147483647/strip/true/crop/3600x2399+0+140/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2F8b%2F98d3c410d47b1de1ae5219649101%2F1b667d6b8456496eb1ed9eeb0bf7ba93"
    },
    {
      "author": "Illia Novikov",
      "description": "A Russian drone has struck a home in Ukraine's Kharkiv region, killing a father and his three small children. Their mother, who is 35 weeks pregnant, was seriously injured. The attack destroyed the house and trapped the family under rubble. The drone was identified as a Russian-made Geran-2. Ukraine's Air Force reports Russia launched 129 long-range drones at Ukraine last night. Meanwhile, a Ukrainian drone attack caused a fire at an industrial plant in Volgograd, Russia. Eight Russian airports briefly suspended flights due to drone attacks, according to officials.",
      "publishedAt": "2026-02-11T08:41:40Z",
      "title": "Russian drone attack in Ukraine's Kharkiv region kills father and three children",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-strike-kharkiv-children-d680de8e1ac590dd1be54056ca3989f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/295c329/2147483647/strip/true/crop/675x450+12+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Joey Cappelletti, Steve Peoples, Steven Sloan",
      "description": "The National Governors Association is not going to hold a formal meeting with President Donald Trump. This decision comes after the White House planned to invite only Republican governors to the event. Oklahoma Governor Kevin Stitt, a Republican, shared this in a letter to fellow governors on Monday. The NGA's mission is to represent all 55 governors, so the association will no longer facilitate the event. The NGA is scheduled to meet in Washington from February 19th to 21st. Representatives for Stitt, the White House, and the NGA didn't immediately comment on the letter.",
      "publishedAt": "2026-02-10T16:37:37Z",
      "title": "Governors won't hold Trump meeting after White House only invited Republicans",
      "url": "https://apnews.com/article/trump-kevin-stitt-governors-meeting-washington-ee4e696534082638795e1804d71f4966",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e743b7/2147483647/strip/true/crop/8355x5567+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F69%2F16fcd9c7e451b57cb43d4fa4dd07%2F7de02e485dda4cf69a9dd18509310189"
    },
    {
      "author": "Lauran Neergaard, Matthew Perrone",
      "description": "The U.S. Food and Drug Administration is refusing to consider Moderna’s application for a new flu vaccine made with mRNA technology. The company announced the news on Tuesday. The FDA's decision reflects heightened scrutiny under Health Secretary Robert F. Kennedy Jr., who has criticized mRNA technology. Moderna received a “refusal-to-file” letter, objecting to its clinical trial methods. The FDA said the trial didn’t compare the new shot to the best available standard of care. Moderna has requested an urgent meeting with the FDA and noted it has applied for approval in Europe, Canada and Australia.",
      "publishedAt": "2026-02-10T23:15:06Z",
      "title": "Moderna says FDA will not consider its mRNA flu vaccine",
      "url": "https://apnews.com/article/moderna-vaccine-flu-mrna-2fc551cb2fb45735e67db0a4e2e2b0fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/0fa5c0f/2147483647/strip/true/crop/3938x2624+363+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F38%2Fa59979e013f551e8932b51485e8e%2F59232d8b28d746d2bd8a66c05a0184ec"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}