{
  "articles": [
    {
      "author": "BASSAM HATOUM, MELANIE LIDMAN and BASSEM MROUE",
      "description": "MARJAYOUN, Lebanon (AP) — Israeli strikes on Monday killed more than 270 Lebanese in the deadliest barrage since the 2006 Israel-Hezbollah war as the Israeli military warned residents in southern and eastern Lebanon to evacuate ahead of a widening air campaign against Hezbollah.",
      "publishedAt": "2024-09-23T06:21:29Z",
      "title": "Lebanon sees deadliest day of conflict since 2006 as Israeli strikes kill more than 270",
      "url": "https://apnews.com/e3ca9c83642056f962fdf76319e3b8de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aaff883c4e574d608dcdad8f0c47bf96/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Israel is bombing targets across many parts of Lebanon, striking senior militants in Beirut and apparently hiding bombs in pagers and walkie-talkies.",
      "publishedAt": "2024-09-23T14:30:28Z",
      "title": "Is this war? The Israeli-Hezbollah conflict is hard to define — or predict",
      "url": "https://apnews.com/57eb5ef4a77f3bcc0d2b920bc4536706",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1abdde1d82994d79b46ed1667e3d71e9/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — Iran’s president accused Israel on Monday of seeking a wider war in the Middle East and laying “traps” to lead his country into a wider conflict.Masoud Pezeshkian told about two dozen media representatives that Iran doesn’t want to see the current war in Gaza and airstrikes across the Israeli-Lebanon border expanded.",
      "publishedAt": "2024-09-23T15:40:48Z",
      "title": "Iran's president accuses Israel of seeking wider Mideast war and laying 'traps' to lead Iran into it",
      "url": "https://apnews.com/529d09bced2d3c579df5ab025b467a55",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca4a465c21654f24b314322ac5c7777c/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — The man accused in the apparent assassination attempt of Donald Trump at a golf course in Florida left behind a note saying that he intended to kill the former president and kept in his car a handwritten list of dates and venues where Trump was to appear, the Justice Department said Monday.",
      "publishedAt": "2024-09-23T12:38:06Z",
      "title": "Feds: Man accused in apparent assassination attempt left note indicating he intended to kill Trump",
      "url": "https://apnews.com/1295144a65f46059ce39b4ccd7288fbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9489a96ff37444cdb80704501330e506/1500.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — One presidential candidate is talking up gun ownership and promising tough border security measures. The other vows to cap credit card interest rates and force insurance companies to cover in vitro fertilization.",
      "publishedAt": "2024-09-23T04:02:43Z",
      "title": "Harris owns a gun? Trump wants to cap credit card rates? Party lines blur in campaign's last stretch",
      "url": "https://apnews.com/87cd75cfa0d82b0e2b026c69278ff912",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d2689cc5bcb4e8190825ed12a405575/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "The co-founder of the company that owned the experimental submersible that imploded en route to the wreckage of the Titanic told a Coast Guard panel Monday that he hoped that the silver lining of the disaster will inspire a renewed interest in exploration, including the deepest waters of the world's oceans.",
      "publishedAt": "2024-09-23T04:03:14Z",
      "title": "OceanGate co-founder says he hopes submersible tragedy yields renewed interest in exploration",
      "url": "https://apnews.com/e8b5ef4b797b86b43e8b65e721216b26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90640a96ac354b3abf56a8467c50a02e/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Violent crime in the U.S. dropped in 2023, according to FBI statistics that show a continued trend downward after a coronavirus pandemic-era crime spike.",
      "publishedAt": "2024-09-23T15:00:40Z",
      "title": "FBI finds violent crime declined in 2023. Here's what to know about the report",
      "url": "https://apnews.com/5bff94ec67f509740bbb53fb99576d5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66cbd6c495bc47df9eebda41de03cd2a/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The U.N. General Assembly adopted a “Pact for the Future” to meet the challenges of the 21st century. Now comes the hard part: uniting the world’s divided nations to move quickly to implement its 56 actions.",
      "publishedAt": "2024-09-23T04:02:32Z",
      "title": "At the UN, world leaders try to lay out a vision for the future — and actually make it happen",
      "url": "https://apnews.com/351c195ef839d505d875e6ab862d58b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9625ed120f574e74a6fe075ff743764a/1920.jpeg"
    },
    {
      "author": "BHARATHA MALLAWARACHI",
      "description": "COLOMBO, Sri Lanka (AP) — Marxist politician Anura Dissanayake won Sri Lanka’s presidential election over the weekend, dealing a blow to a political old guard that has been widely blamed for the unprecedented economic crisis that hit the South Asian island nation two years ago.",
      "publishedAt": "2024-09-23T11:23:57Z",
      "title": "Who is Anura Kumara Dissanayake, Sri Lanka's new Marxist president?",
      "url": "https://apnews.com/b451271b4bd9bf4318a76b599fe9d0b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/325a313cb517477aa327f15f89b03762/3000.jpeg"
    },
    {
      "author": "SCOTT McFETRIDGE",
      "description": "WYOMING, Iowa (AP) — Taking a late-summer country drive in the Midwest means venturing into the corn zone, snaking between 12-foot-tall green, leafy walls that seem to block out nearly everything other than the sun and an occasional water tower.",
      "publishedAt": "2024-09-23T14:01:59Z",
      "title": "‘Short corn’ could replace the towering cornfields steamrolled by a changing climate",
      "url": "https://apnews.com/b5e580aee90ec4cbbabf7b8f6e9e62ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc43bfc24e8d48a182f43201da217ea1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}