{
  "articles": [
    {
      "author": "STEPHEN WHYNO and PAT GRAHAM",
      "description": "It took the NHL until 1979 to mandate helmets and goalie masks for new players. It wasn't until 2013 that eye-protecting visors became mandatory — grandfathered in for veterans, of course.",
      "publishedAt": "2023-11-02T18:33:43Z",
      "title": "Death of a player from a skate to the neck reignites hockey's stubborn debate over protective gear",
      "url": "https://apnews.com/d1016a502de6b49eefc4c00ee0fac9f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40b74e8480134fd7b5e53b9fd71d0210/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, BASSEM MROUE and CARA ANNA",
      "description": "RAFAH, Gaza Strip (AP) — The United States and Arab partners disagreed Saturday on the need for an immediate cease-fire in the Gaza Strip as Israeli military strikes killed civilians at a U.N.",
      "publishedAt": "2023-11-04T07:48:05Z",
      "title": "US and Arab partners disagree on the need for a cease-fire as Israeli airstrikes kill more civilians",
      "url": "https://apnews.com/baf5a858e29aa6a4b8100e3afc5afdf2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16c1fcdc8255451b9503b3d0a038ca1f/1920.jpeg"
    },
    {
      "author": "JIM SALTER and MARC LEVY",
      "description": "ST. LOUIS (AP) — Most members of Congress have stood firmly behind Israel since the Hamas attack last month, but not Cori Bush.",
      "publishedAt": "2023-11-04T04:03:03Z",
      "title": "War in the Middle East upends the dynamics of 2024 House Democratic primaries",
      "url": "https://apnews.com/1b8616887e31f86a930ebc2e767c9a12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c4393fba31cc4108bc2d91dbfcfb5962/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and BILL BARROW",
      "description": "KISSIMMEE, Fla. (AP) — Donald Trump is trying to bury the Oval Office ambitions of Florida Gov. Ron DeSantis, expanding his 2024 campaign support in their shared home state as the former president and his 2024 rival make appeals Saturday to Republican leaders and activists.",
      "publishedAt": "2023-11-04T04:07:22Z",
      "title": "The Trump-DeSantis rivalry grows intense, personal and crude as GOP candidates gather in Florida",
      "url": "https://apnews.com/4e290803224da2c9ebef65f41b409542",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3166010a083344e7af3d605ac64dadd1/3000.jpeg"
    },
    {
      "author": "DEEPA BHARATH",
      "description": "The tension between Nikki Haley and Vivek Ramaswamy was hard to miss when they last met on a debate stage.",
      "publishedAt": "2023-11-04T14:06:21Z",
      "title": "Haley and Ramaswamy show the rising political power of Indian Americans even as they feud in debates",
      "url": "https://apnews.com/916a01928d35d083ec6c10bc11b41a5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0acb1fc2653e48b3a3ab913cff3277cc/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and JOEY CAPPELLETTI",
      "description": "WASHINGTON (AP) — President Joe Biden called the head of the United Auto Workers union to congratulate him this past week on getting a new contract with General Motors and to wish him a happy 55th birthday — a sign of how the relationship had evolved since their first get-to-know-you meeting in the Oval Office on July 19.",
      "publishedAt": "2023-11-04T12:04:56Z",
      "title": "During strike talks, Biden worked to build ties to the UAW's leader. They have yet to fully pay off",
      "url": "https://apnews.com/065ed44fb22fd5c18440a6b1fcbd4cae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97072d6e0810467b8231099db7ae302a/3000.jpeg"
    },
    {
      "author": "BINAJ GURUBACHARYA",
      "description": "KATHMANDU, Nepal (AP) — Helicopters and ground troops rushed to help people hurt in a strong earthquake that shook districts in northwestern Nepal just before midnight Friday, killing at least 128 people and injuring dozens more, officials said Saturday.",
      "publishedAt": "2023-11-03T19:01:17Z",
      "title": "Quake shakes northwest Nepal, killing at least 128 and injuring dozens. Officials fear toll to rise",
      "url": "https://apnews.com/47b0b262ed1aa26957285dd1a55699fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d0738ef681b40f2bfa95932068dd1b2/2884.jpeg"
    },
    {
      "author": "STEPHEN GROVES and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Rep. Ken Buck has had enough.When the Colorado Republican announced this past week that he would not seek reelection, he began with the type of criticism of Democratic policies that is standard fare for a hard-line conservative.",
      "publishedAt": "2023-11-04T13:13:07Z",
      "title": "GOP Rep. Ken Buck plans to challenge his party's direction under Trump as he leaves the House",
      "url": "https://apnews.com/237860f2ee09e4e54c7545f8562050b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acd25d5ea8d545c9ad32bd580b60c6c2/3000.jpeg"
    },
    {
      "author": "JEFF McMURRAY",
      "description": "CHICAGO (AP) — Sophee Langerman was on her way to a bicycle safety rally in Chicago’s Lakeview neighborhood in June when a car turning right rolled through a red light and slammed into her bike, which she was walking off the curb and into the crosswalk.",
      "publishedAt": "2023-11-04T04:21:31Z",
      "title": "Right turn on red? With pedestrian deaths rising, US cities are considering bans",
      "url": "https://apnews.com/7f5bdee9c7b3f4cbf005f1844f486123",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8d62c43a790480490e46abbd196bcd8/3000.jpeg"
    },
    {
      "author": "TOM KRISHER and ALEX VEIGA",
      "description": "DETROIT (AP) — Stellantis plans to build a new midsize pickup truck, along with battery-run versions of six Jeep, Ram and Dodge vehicles.Ford envisions at least three new electric vehicles that will preserve jobs at several factories.",
      "publishedAt": "2023-11-04T18:02:52Z",
      "title": "New vehicles from Detroit's automakers are planned in contracts that ended UAW strikes",
      "url": "https://apnews.com/33be8538fceab29f4b248c9d0b2f4260",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6cb02c86e804c449180e4d256d0ac3f/2934.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}