{
  "articles": [
    {
      "author": "MICHAEL BALSAMO, JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — New clues emerged Thursday in the hunt for the masked gunman who stalked and killed UnitedHealthcare CEO Brian Thompson, including possible leads about his travel before the shooting and a message scrawled on ammunition found at the crime scene.",
      "publishedAt": "2024-12-05T05:10:29Z",
      "title": "New clues emerge as investigators hunt for the gunman who killed UnitedHealthcare's CEO",
      "url": "https://apnews.com/7f6581ba6b0b520938d82c361e77a83c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/227f3de3c5e244c5a9b554504aa4fd75/1920.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s governing party chief expressed support Friday for suspending the constitutional powers of President Yoon Suk Yeol for imposing martial law this week, in a bombshell reversal that makes Yoon’s impeachment more likely.",
      "publishedAt": "2024-12-06T00:44:31Z",
      "title": "South Korea's governing party head supports suspending Yoon's powers, making impeachment more likely",
      "url": "https://apnews.com/bfea0520c0361294f96edd6602ac8534",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff8879086df143008b9c0ed742e17874/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden is weighing whether to issue sweeping pardons for officials and allies who the White House fears could be unjustly targeted by President-elect Donald Trump’s administration, a preemptive move that would be a novel and risky use of the president’s extraordinary constitutional power.",
      "publishedAt": "2024-12-06T03:08:31Z",
      "title": "Biden is considering preemptive pardons for officials and allies before Trump takes office",
      "url": "https://apnews.com/f36ead0eb92ea30e47cbfddfaf326f20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21d47b97e4f44034a776c376ee81eece/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and AAMER MADHANI",
      "description": "WASHINGTON (AP) — President-elect Donald Trump said Thursday he has selected former Sen. David Perdue of Georgia to serve as his ambassador to China, leaning on a former business executive turned politician to serve as the administration's envoy to America's most potent economic and military adversary.",
      "publishedAt": "2024-12-06T02:57:22Z",
      "title": "Trump names former Sen. David Perdue of Georgia to be ambassador to China",
      "url": "https://apnews.com/c481302fb42d7b6fc9d90dda23b45258",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/482a65e8df244458865904337afd7786/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "GREENVALE, N.Y. (AP) — President-elect Donald Trump said Thursday night in accepting the “Patriot of the Year” award at Fox Nation’s Patriot Awards that he has already accomplished more since his election victory than President Joe Biden has in his entire term.",
      "publishedAt": "2024-12-05T18:31:21Z",
      "title": "Trump talks up election victory as he receives 'Patriot of the Year' award at Fox Nation event",
      "url": "https://apnews.com/f99629d40359b65f0d37c5db190671d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15ab5377a0eb49c3a75ff311e32160ae/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "ISTANBUL (AP) — A Hamas official said Thursday that international mediators have resumed negotiating with the militant group and Israel over a ceasefire in Gaza, and that he was hopeful a deal to end the 14-month war was within reach.",
      "publishedAt": "2024-12-05T19:33:12Z",
      "title": "Hamas official says Gaza ceasefire talks have resumed after weekslong hiatus",
      "url": "https://apnews.com/d09bb192b298adb3fa76d0e819721fdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ad1e2bf910a45adb4d2e8070a0985da/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — A Russian woman with permanent U.S. residency who was returned to the United States after authorities said she sneaked on board a flight from New York to Paris made her first appearance in court Thursday, claiming she has been abused.",
      "publishedAt": "2024-12-05T22:54:50Z",
      "title": "Stowaway who boarded New York-to-Paris flight claims she sought asylum in France",
      "url": "https://apnews.com/acbec8eff4a215cc29e93e642ef51767",
      "urlToImage": ""
    },
    {
      "author": "TERRY CHEA and STEFANIE DAZIO",
      "description": "OROVILLE, Calif. (AP) — A gunman who critically wounded two kindergartners at a tiny religious school in Northern California was mentally ill and believed by targeting children he was carrying out “counter-measures” in response to America’s involvement in Middle East violence, a sheriff said Thursday.",
      "publishedAt": "2024-12-05T08:08:35Z",
      "title": "Gunman who shot 2 kindergartners at a California school wrote about attack targeting children",
      "url": "https://apnews.com/1a183fcd1670d47dedeff81d9f1ce492",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2bbeb52b5c64fa6b4498984f72f7f0c/1920.jpeg"
    },
    {
      "author": "OLGA R. RODRIGUEZ and STEFANIE DAZIO",
      "description": "SAN FRANCISCO (AP) — A 7.0 magnitude earthquake shook a large area of Northern California on Thursday, knocking items off grocery store shelves, sending children scrambling under desks and prompting a brief tsunami warning for 5.3 million people along the U.S.",
      "publishedAt": "2024-12-05T19:08:22Z",
      "title": "7.0 earthquake off Northern California prompts brief tsunami warning",
      "url": "https://apnews.com/e1c73514097b78dfc082e40f98d0d426",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b75cefcd73b47e4b36cefe4b04b6912/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — It was one of the darkest moments in the modern history of the Arab world. More than four decades ago, Hafez Assad, then president of Syria, launched what came to be known as the Hama Massacre.",
      "publishedAt": "2024-12-05T20:26:31Z",
      "title": "Why the rebel capture of Syria's Hama, a city with a dark history, matters",
      "url": "https://apnews.com/799f37fd2608532a253cccb48df4e613",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0f8bc67de69d428396fe7a50c773ae15/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}