{
  "articles": [
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Russian President Vladimir Putin thanked North Korea for supporting his actions in Ukraine and said their countries will cooperate closely to overcome U.S.-led sanctions as he headed to Pyongyang on Tuesday for a summit with North Korean leader Kim Jong Un.",
      "publishedAt": "2024-06-18T00:49:07Z",
      "title": "Before his summit with North Korea's Kim, Putin vows they'll beat sanctions together",
      "url": "https://apnews.com/05f0ed66f9978ac1ba34f2d708ad7504",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a9f1bf99cfc426096bbb591358146c9/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.",
      "publishedAt": "2024-06-18T03:04:18Z",
      "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month",
      "url": "https://apnews.com/2aa0eaef30dbc5801d5e787205b577a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/576bf623f2f54c768e738e4d1d5e4705/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JACK JEFFERY",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu disbanded his war Cabinet Monday, a move that consolidates his influence over the Israel-Hamas war and likely diminishes the odds of a cease-fire in the Gaza Strip anytime soon.",
      "publishedAt": "2024-06-17T18:45:00Z",
      "title": "Netanyahu dissolved his war Cabinet. How will that affect cease-fire efforts?",
      "url": "https://apnews.com/b50f7fe8913b06aaba377ae6b37c3fed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c38448b700c4e95b35cd3d7bd2096ee/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Extreme heat alerts continued for tens of millions of people in the United States on Tuesday as cities including Chicago broke records at the start of a week of sweltering weather.",
      "publishedAt": "2024-06-18T04:25:14Z",
      "title": "Tens of millions in the US remain under dangerous heat warnings",
      "url": "https://apnews.com/45df289d7da2107b272a3839f5828e2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/202dc979802c414699adfa41339284b3/1920.jpeg"
    },
    {
      "author": "STEPHEN GROVES, SEUNG MIN KIM and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — President Joe Biden is planning to announce a sweeping new policy Tuesday that would lift the threat of deportation for hundreds of thousands of people married to U.S. citizens, an aggressive election-year action on immigration that had been sought by many Democrats.",
      "publishedAt": "2024-06-17T19:21:36Z",
      "title": "Biden will announce deportation protection and work permits for spouses of US citizens",
      "url": "https://apnews.com/509d520529867db6a77ddcf2dcebe2a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38946ef89221476186ecc10bd6c0cab8/3000.jpeg"
    },
    {
      "author": "MEG KINNARD and MICHELLE L. PRICE",
      "description": "WASHINGTON (AP) — Whether it’s a grinning Joe Biden as “Dark Brandon” or Donald Trump’s face superimposed onto a scene from HBO’s “Game of Thrones,” both presidential campaigns this year have embraced digital memes, the lingua franca of social media.",
      "publishedAt": "2024-06-18T04:08:47Z",
      "title": "The politics of memes: How Biden and Trump are fighting each other on the internet",
      "url": "https://apnews.com/2e31e2347d1045babf1229fe210dddf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3db20182751a4fbb83a925b01bf82da1/3000.jpeg"
    },
    {
      "author": "CORA LEWIS and LINLEY SANDERS",
      "description": "NEW YORK (AP) — Janille Williams wants to buy a house someday — but first, he has to pay down tens of thousands of dollars in medical debt. “I was hospitalized for a blood infection for three months more than ten years ago, and the bill was for more than $300,000,” said Williams, 38, a Fairbanks, Alaska, resident who works as a retail sales manager for AT&amp;T.",
      "publishedAt": "2024-06-18T04:03:05Z",
      "title": "Majority of Americans favor forgiving medical debt, AP-NORC poll finds",
      "url": "https://apnews.com/cc46b73d93dbf883ce9f9f2e07bbfcaf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd5750a75b9f49a5a77f14b9b9b70749/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "PITTSBURGH (AP) — Last week in Parkland, Florida, wrecking equipment began demolishing the building at Marjory Stoneman Douglas High School where a gunman's rampage in 2018 ended with 17 people dead.",
      "publishedAt": "2024-06-18T04:13:28Z",
      "title": "When violence and trauma visit American places, a complex question follows: Demolish, or press on?",
      "url": "https://apnews.com/3193ad66681eaffb4bf35188cfbe83cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38dea8691114427fa5e466e6e037f093/3000.jpeg"
    },
    {
      "author": "MICHAEL RUBINKAM and MARYCLAIRE DALE",
      "description": "PHILADELPHIA (AP) — Katherine Anderson trekked from Texas to Philadelphia last year for a college program she couldn’t find anywhere else, combining the music business, entrepreneurship and technology.",
      "publishedAt": "2024-06-18T04:21:18Z",
      "title": "When colleges close, students are left scrambling. Some never go back to school",
      "url": "https://apnews.com/7c884439f16f24d99a61544381f49c23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65f9e024cb66429182c95b6e9f77d2bc/3000.jpeg"
    },
    {
      "author": "KYLE HIGHTOWER",
      "description": "BOSTON (AP) — Jayson Tatum put his hands behind his head, with TD Garden fans standing on their feet cheering around him, and took it all in.Walking to the bench, he wrapped both arms around Celtics coach Joe Mazzulla.",
      "publishedAt": "2024-06-18T03:08:42Z",
      "title": "Celtics win 18th NBA championship with 106-88 Game 5 victory over Dallas Mavericks",
      "url": "https://apnews.com/0cdf7b0fb7bc641a5007c8dff836832a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/981126bad4a34baaad56c8de5864197f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}