{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JILL COLVIN, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump was intimately involved with all aspects of a scheme to stifle stories about sex that threatened to torpedo his 2016 campaign, his former lawyer said Monday in matter-of-fact testimony that went to the heart of the former president’s hush money trial.",
      "publishedAt": "2024-05-13T04:22:31Z",
      "title": "Star witness Michael Cohen says Trump was intimately involved in all aspects of hush money scheme",
      "url": "https://apnews.com/f96dd7289cf952145cdd6737b29add3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77dbd2d373214915919e890847e784c4/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Nearly half a million Palestinians have been displaced in recent days by escalating Israeli military operations in southern and northern Gaza, the United Nations says.Around 360,000 Palestinians were driven out of Rafah in Gaza's south over the past week, the United Nations’ agency for Palestinian refugees said.",
      "publishedAt": "2024-05-13T10:04:22Z",
      "title": "The Latest | Nearly half a million people flee fighting in Rafah and northern Gaza, UN says",
      "url": "https://apnews.com/18bde11f5581a7d296d2242b9f204ce9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c8e33aa3f5141fe8a0ec4e76d1650f0/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "REHOBOTH BEACH, Del. (AP) — Secretary of State Antony Blinken on Sunday delivered some of the Biden administration’s strongest public criticism yet of Israel’s conduct of the war in Gaza, saying Israeli tactics have meant “a horrible loss of life of innocent civilians” but failed to neutralize Hamas leaders and fighters and could drive a lasting insurgency.",
      "publishedAt": "2024-05-12T17:16:48Z",
      "title": "Blinken delivers some of the strongest US public criticism of Israel's conduct of the war in Gaza",
      "url": "https://apnews.com/6e0f887bd307f707a05190b33708fe58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8819ca152ff4e69aab5cf2051619a8b/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russian troops were locked in intense battles with Ukrainian soldiers around the embattled town of Vovchansk in northeast Ukraine on Monday, pushing ahead with a ground offensive that opened a new front and put more pressure on overstretched Ukrainian forces.",
      "publishedAt": "2024-05-13T08:18:17Z",
      "title": "Russian assault opens new front, diverting Ukraine forces as Western aid trickles in",
      "url": "https://apnews.com/397dd892f936726bd1acbd45991a18a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41381aff7c0047b29cf3c547ddc8eda2/1920.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — Crews set off a chain of carefully placed explosives Monday to break down the largest remaining span of the collapsed Francis Scott Key Bridge in Baltimore, and with a boom and a splash, the mangled steel trusses came crashing down into the river below.",
      "publishedAt": "2024-05-13T17:33:55Z",
      "title": "Collapsed Baltimore bridge span comes down with a boom after crews set off chain of explosives",
      "url": "https://apnews.com/1575472095b90256ce00bc69a88d5acb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af2844c6f512419ea7a846dd090413f7/1920.jpeg"
    },
    {
      "author": null,
      "description": "FORT NELSON, British Columbia (AP) — An intense wildfire could reach a town in western Canada this week, fire experts and officials warned, based on forecasts of winds that have fueled the out-of-control blaze, which has forced the evacuation of thousands of people.",
      "publishedAt": "2024-05-13T10:37:33Z",
      "title": "A town in western Canada prepares for a possible 'last stand' as wildfires rage in British Columbia",
      "url": "https://apnews.com/dace46a958c9426056eb7da908a3f115",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/218c80a08a014635944cdc3c5e92f589/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — At the apartment door where a Florida deputy shot and killed Senior Airman Roger Fortson, a small shrine is growing with the tributes from the Air Force unit grappling with his loss.",
      "publishedAt": "2024-05-13T20:36:55Z",
      "title": "Questions and grief linger at the apartment door where a deputy killed a US airman",
      "url": "https://apnews.com/9235ca642a70f3585c38e19ad529cc39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60ffec1b82e24b04b3fc62dfcd4762ee/3000.jpeg"
    },
    {
      "author": "MAKIYA SEMINERA",
      "description": "RALEIGH, N.C. (AP) — As North Carolina's public university system considers a vote on changing its diversity policy, the system's flagship university board voted Monday to cut funding for diversity programs in next year's budget.",
      "publishedAt": "2024-05-13T18:00:37Z",
      "title": "UNC board slashes diversity program funding to divert money to public safety resources",
      "url": "https://apnews.com/18970755ac9bef36c5a4011a1ef5236b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cba02a1a9e0544998e9e7c3023a0ff24/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "PROVIDENCE, R.I. (AP) — The voice Alexis “Lexi” Bogan had before last summer was exuberant.She loved to belt out Taylor Swift and Zach Bryan ballads in the car. She laughed all the time — even while corralling misbehaving preschoolers or debating politics with friends over a backyard fire pit.",
      "publishedAt": "2024-05-13T09:02:32Z",
      "title": "Illness took away her voice. AI created a replica she carries in her phone",
      "url": "https://apnews.com/a6512c33481072c22182c116d2cbe419",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54644b9d2c134c92bcbbd0cb2900c110/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — The sharp interest rate hikes of the past two years will likely take longer than previously expected to bring down inflation, several Federal Reserve officials have said in recent comments, suggesting there may be few, if any, rate cuts this year.",
      "publishedAt": "2024-05-13T12:19:34Z",
      "title": "Are US interest rates high enough to beat inflation? The Fed will take its time to find out",
      "url": "https://apnews.com/52156f98736527a254d5717b83e219f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad21b6f0394c4d99bf1ee6c61a7a0807/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}