{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAM MEDNICK and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Israel ordered new evacuations in Gaza's southern city of Rafah on Saturday, forcing tens of thousands more people to move as it prepares to expand its operation and adding that it is also moving into an area in northern Gaza where Hamas has regrouped.",
      "publishedAt": "2024-05-11T07:02:12Z",
      "title": "Israel orders new evacuations in the southern Gaza city of Rafah as it prepares to expand operations",
      "url": "https://apnews.com/7cc8784d8c6eec017ecaef696f492b25",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52e946c2b753405bb75b0140a96c25f4/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The alleged sexual encounter at the center of Donald Trump's criminal hush money trial got a graphic airing in court this past week as porn actor Stormy Daniels shared her account before a rapt jury.",
      "publishedAt": "2024-05-11T04:06:20Z",
      "title": "Trump trial turns to sex, bank accounts and power: Highlights from the third week of testimony",
      "url": "https://apnews.com/c69d54c51e2fccbbc0b19e2220222b0e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f885f342e878451e99a1bc6026de0c5d/1920.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Russian forces have captured five villages as part of a renewed ground assault in Ukraine’s northeast, the country’s Defense Ministry said Saturday.Ukrainian journalists reported Friday that Russian troops took the villages of Borysivka, Ohirtseve, Pylna and Strilecha, all of which lie in a militarily contested “grey zone” on the border of Ukraine's Kharkiv region and Russia.",
      "publishedAt": "2024-05-11T10:09:43Z",
      "title": "Russia claims capture of villages in northeast Ukraine as more than 1,700 civilians flee",
      "url": "https://apnews.com/26184a3898db0aece9f6e9eb3a700e7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/475b8fdedb664bee83d4dd2a1a1483d0/2000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — An unusually strong solar storm hitting Earth produced stunning displays of color in the skies across the Northern Hemisphere early Saturday, with no immediate reports of disruptions to power and communications.",
      "publishedAt": "2024-05-10T14:12:06Z",
      "title": "Solar storm hits Earth, producing colorful light shows across Northern Hemisphere",
      "url": "https://apnews.com/fc23251025efc2d20dc128dc0b6a7c68",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b7a1d4405794858a315be13e8479650/1920.jpeg"
    },
    {
      "author": "RAHIM FAIEZ",
      "description": "ISLAMABAD (AP) — Flash floods from unusually heavy seasonal rains in Afghanistan have killed more than 300 people and destroyed over 1,000 houses, the U.N.",
      "publishedAt": "2024-05-11T08:07:26Z",
      "title": "Flash floods kill more than 300 people in northern Afghanistan after heavy rains, UN says",
      "url": "https://apnews.com/4a7aefabad9d3e38f0c5b5f20c3aa8da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c43cc007be21432cb5b81cd057d8dd0a/2992.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — Brenda Edwards considers the four bedroom ranch-style house where she has lived for 20 years her forever home. It's where the 70-year-old retired nurse and her 79-year-old husband want to stay as their mobility becomes more limited.",
      "publishedAt": "2024-05-11T09:00:41Z",
      "title": "Some older Americans splurge to keep homes accessible while others struggle to make safety upgrades",
      "url": "https://apnews.com/a40df169bc69fe94d163ecc76c0801ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f4261e31a6a4ebd90ddd10baa417c7e/3000.jpeg"
    },
    {
      "author": "JEFF McMURRAY",
      "description": "As cars and trucks get smarter and more connected, the humble lights that have controlled the flow of traffic for more than a century could also be on the cusp of a major transformation.Researchers are exploring ways to use features in modern cars, such as GPS, to make traffic safer and more efficient.",
      "publishedAt": "2024-05-11T04:13:50Z",
      "title": "Red, yellow, green ... and white? Smarter vehicles could mean big changes for the traffic light",
      "url": "https://apnews.com/757d6151e85565e9656d7b95c6e72490",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d525446f65404b398a4354ecc3cf1f7f/3000.jpeg"
    },
    {
      "author": "ANNA FURMAN",
      "description": "Over the past two decades, Gee’s Bend quilts have captured the public’s imagination with their kaleidoscopic colors and their daring geometric patterns. The groundbreaking art practice was cultivated by direct descendants of slaves in rural Alabama who have faced oppression, geographic isolation and intense material constraints.",
      "publishedAt": "2024-05-11T04:35:26Z",
      "title": "They made one-of-a-kind quilts that captured the public's imagination. Then Target came along",
      "url": "https://apnews.com/c6e1d9500ef044e34c2ae329ce0917c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/506b85fafb3048b1bf546d0a162a25bd/2048.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "MALMO, Sweden (AP) — The Netherlands' contestant in the Eurovision Song Contest was dramatically expelled from competition hours before Saturday's final over a backstage incident that is being investigated by police.",
      "publishedAt": "2024-05-11T07:38:40Z",
      "title": "Dutch contestant kicked out of Eurovision hours before tension-plagued song contest final",
      "url": "https://apnews.com/09e31963ed7db607ea137c9333eabf87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6620e9595516436091f2bb34edac9a0e/3000.jpeg"
    },
    {
      "author": "DAVE CAMPBELL",
      "description": "MINNEAPOLIS (AP) — The Denver Nuggets were simply too determined, too experienced, too proud and too talented to let their flop in the first two games define this series against the surging Minnesota Timberwolves.",
      "publishedAt": "2024-05-11T04:21:24Z",
      "title": "Nuggets bounce back with 117-90 blowout of Timberwolves behind 24 points from energized Murray",
      "url": "https://apnews.com/8958900aed05993238fac4b1891db0b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/312a0f631bfb4986b5fb36247095ccba/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}