{
  "articles": [
    {
      "author": "JOSHUA GOODMAN and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Venezuelan opposition candidate Edmundo González on Monday said his campaign has the proof it needs to show that he was the winner of the country's highly anticipated presidential election whose victory authorities handed to President Nicolás Maduro.",
      "publishedAt": "2024-07-29T06:40:46Z",
      "title": "Venezuelan opposition says it has proof its candidate defeated President Maduro in disputed election",
      "url": "https://apnews.com/acee6c8cd3a8fc88086c2dd71963b759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/789a16736ee84c57970ca99575cc182b/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — President Joe Biden on Monday proposed major changes for the U.S. Supreme Court: an enforceable code of ethics, term limits for justices and a constitutional amendment that would limit the justices’ recent decision on presidential immunity.",
      "publishedAt": "2024-07-29T17:31:30Z",
      "title": "Biden proposed enforceable ethics code and term limits for Supreme Court. How might they work?",
      "url": "https://apnews.com/b281a03f8ce2df60109f60722619cc4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85ca9f6327af49c690f69f9a64f2ed53/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "AUSTIN, Texas (AP) — No longer on the campaign trail, President Joe Biden on Monday delivered a speech at the LBJ Presidential Library designed to help cement his legacy.Slightly more than a week after dropping out of this year's election, Biden marked the 60th Anniversary of the Civil Rights Act by speaking out for the rule of law and democratic principles.",
      "publishedAt": "2024-07-29T04:05:49Z",
      "title": "Focused on legacy, Biden calls out Trump and says how civil rights led him into politics",
      "url": "https://apnews.com/d096e3ca4968f79ffafd5c13095eb5f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22bc18814942469d9477b2565e6ca28d/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Bloodied children ran screaming from a dance and yoga class “like a scene from a horror movie” to escape a teenager’s savage knife attack that killed two children and wounded 11 other people Monday in northwest England, police and witnesses said.",
      "publishedAt": "2024-07-29T12:21:41Z",
      "title": "2 children dead and 11 people injured in stabbing rampage at a dance class in England, police say",
      "url": "https://apnews.com/fe16d43c8fc92b7b19c63ba4889c4850",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d2cfda71d054102adb9ca8477170081/3000.jpeg"
    },
    {
      "author": "EUGENE GARCIA",
      "description": "FOREST RANCH, Calif. (AP) — Firefighters made progress and were helped by improving weather over the weekend in the battle against wildfires covering massive areas in the western United States, but further evacuations have been necessary as thousands of personnel tackle the flames.",
      "publishedAt": "2024-07-29T06:41:41Z",
      "title": "California firefighters make progress as wildfires push devastation and spread smoke across US West",
      "url": "https://apnews.com/3e888a7e89f7b5b6b9c2172afb4671a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f707a9f557884e989adb9f26179c7737/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Former President Donald Trump has agreed to be interviewed by the FBI as part of an investigation into his attempted assassination in Pennsylvania earlier this month, a special agent said on Monday in disclosing how the gunman prior to the shooting had researched mass attacks and explosive devices.",
      "publishedAt": "2024-07-29T14:52:54Z",
      "title": "Trump agrees to be interviewed as part of an investigation into his assassination attempt, FBI says",
      "url": "https://apnews.com/9c3838fcf9753b3e61caf97804112fca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3d29168662840ce9919cd8b862748ff/3000.jpeg"
    },
    {
      "author": "SAM McNEIL and SAMY MAGDY",
      "description": "SDE TEIMAN BASE, Israel (AP) — The Israeli military said Monday it was holding nine soldiers for questioning following allegations of “substantial abuse” of a detainee at a shadowy facility where Israel has held Palestinian prisoners throughout the war in Gaza.",
      "publishedAt": "2024-07-29T13:08:29Z",
      "title": "Israeli military detains 9 soldiers over alleged abuse of a detainee at a shadowy military facility",
      "url": "https://apnews.com/844aac9711be878604afca5c53abc9f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44d64f45b60c4bb1b7f791e49ab6d6a4/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — Before they stood with their arms wrapped around each other in a brotherhood forever etched into U.S. Olympic lore, Brody Malone, Frederick Richard, Asher Hong, Paul Juda and Stephen Nedoroscik were collegians.",
      "publishedAt": "2024-07-29T21:51:43Z",
      "title": "The U.S. men's gymnastics team ended a lengthy Olympic medal drought. They hope the NCAA notices",
      "url": "https://apnews.com/c0fc34f7d27c223e4f517a7bcade6499",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9f1982e1f234dcba0c6cce35db21199/3000.jpeg"
    },
    {
      "author": "JOHN O'CONNOR and LOLITA BALDOR",
      "description": "SPRINGFIELD, Ill. (AP) — The Illinois sheriff's deputy charged in the shooting death of Sonya Massey was kicked out of the Army for the first of two drunken driving convictions in which he had a weapon in his car, authorities said, but that didn't stop multiple law enforcement agencies from giving him a badge.",
      "publishedAt": "2024-07-29T16:39:45Z",
      "title": "With DUI-related ejection from Army, deputy who killed Massey should have raised flags, experts say",
      "url": "https://apnews.com/6ac3ff78bc29f18bd65c6e2763fab96f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9fbf2916b3274a368ac8c945c69eb0da/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — Tongue-tie —a condition in infants that can affect breastfeeding — may be overdiagnosed in the U.S. and too often treated with unnecessary surgery, a prominent doctors' group said Monday.",
      "publishedAt": "2024-07-29T04:02:29Z",
      "title": "Infants' tongue-tie may be overdiagnosed and needlessly treated, American Academy of Pediatrics says",
      "url": "https://apnews.com/86a4d37b5ae924dc7848f17b8cdd5e3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5939b9d790945b7a467584a4fade4ac/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}