{
  "articles": [
    {
      "author": "LISA MASCARO and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Despite a week of campaign stops, interviews and insistence that he is the best candidate to confront Republican Donald Trump, President Joe Biden hasn't softened the push for him to exit the 2024 race.",
      "publishedAt": "2024-07-20T04:00:31Z",
      "title": "Biden's ability to win back skeptical Democrats is tested at a perilous moment for his campaign",
      "url": "https://apnews.com/2b1c163c863130675b3b5b60718741c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30d986757ab64bac99d51de0b92e9174/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI and JILL COLVIN",
      "description": "LANSING, Mich. (AP) — Republican Donald Trump on Saturday will hold his first public campaign rally since he was injured in an assassination attempt, with an event in the battleground state of Michigan alongside his new running mate.",
      "publishedAt": "2024-07-20T04:08:34Z",
      "title": "Trump returns to the campaign trail in Michigan with his new running mate, Vance, by his side",
      "url": "https://apnews.com/dcc7969cd53e281e32beb72a2c6e0fe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d9f6083442e423b832ece5690fbcd6d/3000.jpeg"
    },
    {
      "author": "AHMED AL-HAJ, WAFAA SHURAFA and JACK JEFFERY",
      "description": "SANAA, Yemen (AP) — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.The Israeli strikes appeared to be the first on Yemeni soil since the Israel-Hamas war began in October, and they threatened to open a new front in the region as Israel battles proxies of Iran.",
      "publishedAt": "2024-07-20T10:13:28Z",
      "title": "Israeli military says it has struck several Houthi targets in Yemen in response to attacks",
      "url": "https://apnews.com/786ff10ee4c3534024833ebbf586fadc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1148926ddacb45dd9db561b24d02fdd7/1920.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — During Abraham Lincoln's presidency, anyone could come to the White House and see him. Come they did: mothers looking to have their sons released from military service, wives urging that their husbands be freed from prison after resisting the draft, others who simply wanted to meet the president.",
      "publishedAt": "2024-07-20T11:23:38Z",
      "title": "This is how Secret Service protection has changed for presidents over the years",
      "url": "https://apnews.com/8e205d0f53015cd4b5f0177d70c2ece9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/35a858e62a4d45f3ae6c1bbdddc977ec/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG and ISABELLA O'MALLEY",
      "description": "As the world continues to recover from massive business and travel disruptions caused by a faulty software update from cybersecurity firm CrowdStrike, malicious actors are trying to exploit the situation for their own gain.",
      "publishedAt": "2024-07-20T17:22:07Z",
      "title": "8.5 million computers running Windows affected by faulty update from CrowdStrike",
      "url": "https://apnews.com/ebcba985600530a4689289eae38619bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/506828f0a3824f799740c3034267c33e/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO",
      "description": "Longtime U.S. Rep. Sheila Jackson Lee of Texas, who helped lead federal efforts to protect women from domestic violence and recognize Juneteenth as a national holiday, has died. She was 74.Lillie Conley, her chief of staff, confirmed that Jackson Lee, who had pancreatic cancer, died in Houston Friday night with her family around her.",
      "publishedAt": "2024-07-20T04:23:51Z",
      "title": "Biden praises longtime US Rep Sheila Jackson Lee of Texas, who died of cancer",
      "url": "https://apnews.com/b2de57de41d39053a7648b16438eb009",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/766411208331445498f1f37f69d41f75/2875.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "They plan to gather one last time on Sunday — the handful of mostly elderly members of First Baptist Church in Mt. Vernon, Illinois.They'll say the Lord's Prayer, recite the Apostle's Creed and hear a biblical passage typically used at funerals, “To everything there is a season ...",
      "publishedAt": "2024-07-20T12:54:50Z",
      "title": "As a scholar, he's charted the decline in religion. Now the church he pastors is closing its doors",
      "url": "https://apnews.com/c6b9e938eb228c8018fb911b02a791f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f9fbd1896f94d0584669d6da99cf366/3000.jpeg"
    },
    {
      "author": null,
      "description": "TAIPEI, Taiwan (AP) — Chinese authorities say at least 11 people have died and 30 are missing in the partial collapse of a highway bridge in the northwest of the country following heavy storms and flooding.",
      "publishedAt": "2024-07-20T05:42:25Z",
      "title": "11 dead and dozens missing after a highway bridge in China crumbles in flooding and heavy storms",
      "url": "https://apnews.com/9b8d2c799ae4da8a2655e8e9142c3e3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce7d5f6ce4d547258a3f1abb0a8a05c3/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — As U.S. health officials investigate a fatal outbreak of listeria food poisoning, they're advising people who are pregnant, elderly or have compromised immune systems to avoid eating sliced deli meat unless it's recooked at home to be steaming hot.",
      "publishedAt": "2024-07-20T16:21:48Z",
      "title": "Here's what to do with deli meats as the CDC investigates a listeria outbreak across the U.S.",
      "url": "https://apnews.com/8d747960d6f7966138046047d00656ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/833c685a8ab24a9eacd87eee9c9a8143/3000.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "PARIS (AP) — Sure, they call it the City of Light. But Paris is also the City of Fashion, one of most influential fashion capitals of the world for decades, no, centuries (remember Louis XIV?)",
      "publishedAt": "2024-07-20T04:06:10Z",
      "title": "The Olympics are coming to the capital of fashion. Expect uniforms befitting a Paris runway",
      "url": "https://apnews.com/840eeda91f58c02cd78969bf583aaada",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/93dc6267d7744c718189fdb8103dcf4a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}