{
  "articles": [
    {
      "author": "Melanie Lidman, Samy Magdy",
      "description": "Israel has identified the remains two hostages after Hamas handed over their bodies to the Red Cross. Israeli officials say that the bodies belong to Ronen Engel and Sonthaya Oakkharasri. They were killed during Hamas' attack on southern Israel on Oct. 7, 2023. Israel has threatened on Sunday to keep the Rafah border crossing closed until Hamas fulfills its ceasefire role of returning all deceased hostages. Hamas has handed over the remains of 13 bodies. Eleven of them have been identified as hostages. Israel said one of the bodies released didn't belong to a hostage. The Palestinian group said that talks to launch the second phase of ceasefire negotiations have begun.",
      "publishedAt": "2025-10-19T06:42:26Z",
      "title": "Israel identifies bodies of 2 hostages as major Gaza crossing remains closed",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-10-19-2025-f3d95cf76018541ff824853d1bcd3356",
      "urlToImage": "https://dims.apnews.com/dims4/default/334b004/2147483647/strip/true/crop/7382x4152+0+384/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F1c%2F5d3c949b875a92e98080bc3c02a8%2Fd8683f45818741dfa399b81a7726ea62"
    },
    {
      "author": "Chris Megerian, Dánica Coto",
      "description": "President Donald Trump says he'll slash U.S. funding to Colombia because the country’s leader “does nothing to stop” drug production. In a social media post Sunday, Trump referred to Colombian President Gustavo Petro as “an illegal drug dealer” who is “low rated and very unpopular.” He warned that Petro “better close up” drug operations “or the United States will close them up for him, and it won’t be done nicely.”",
      "publishedAt": "2025-10-19T13:01:05Z",
      "title": "Trump announces an end to US aid to Colombia",
      "url": "https://apnews.com/article/trump-petro-colombia-drugs-us-aid-c3955b2ce351737119920741178e0567",
      "urlToImage": "https://dims.apnews.com/dims4/default/510ebbc/2147483647/strip/true/crop/6320x3555+0+329/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7a%2F7f%2F62fb9223a9d1fc35f59a8c95e671%2Fa7fbe0ad39b049859db2e8cf002882e6"
    },
    {
      "author": null,
      "description": "A cargo aircraft has skidded off a Hong Kong airport runway into the sea when landing, with two people confirmed dead. The flight, arriving from Dubai, was landing at Hong Kong International Airport around 3:50 a.m. Monday, according to Hong Kong’s airport authority. Four crew members on the plane have been rescued and taken to hospital. But police said initial reports suggested two people on an airport ground vehicle were confirmed dead.",
      "publishedAt": "2025-10-19T23:49:58Z",
      "title": "A cargo aircraft skids off a Hong Kong airport runway into the sea, leaving two 2 confirmed dead",
      "url": "https://apnews.com/article/hong-kong-airplane-skid-runway-44416b8e6c7b4fae48e6cb82271b2746",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Isabel DeBre, Paola Flores",
      "description": "Early results from Bolivia’s presidential runoff election show centrist Sen. Rodrigo Paz headed for a clear victory with 54.5% of the vote, Bolivia’s electoral tribunal announced on Sunday, paving the way for the political transformation of this crisis-hit Andean nation after two decades of one-party rule. With official results still trickling in from across the country, the preliminary count showed Paz’s rival, right-wing former President Jorge “Tuto” Quiroga, clinching 45.4% of the vote.",
      "publishedAt": "2025-10-19T04:20:36Z",
      "title": "Early results in Bolivia’s election show centrist Rodrigo Paz with lead over right-wing rival",
      "url": "https://apnews.com/article/bolivia-runoff-election-jorge-quiroga-rodrigo-paz-ef7643d07d8968452cdce784e75a7810",
      "urlToImage": "https://dims.apnews.com/dims4/default/c6d2775/2147483647/strip/true/crop/5402x3039+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F7f%2Ff936f88ea938c79050237e611610%2F24bb85eaa7cf42528652e869fc2cd931"
    },
    {
      "author": "Didi Tang",
      "description": "China has expanded its export rules on rare earths, requiring foreign firms to get approval for exporting products containing even small amounts of China-originated materials. This move mirrors the U.S.'s foreign direct product rule, which restricts China's access to certain U.S. technologies. Experts say China is adopting U.S. strategies in trade disputes. Since 2018, China has developed laws and policies to retaliate in trade conflicts, similar to U.S. practices. These include the Unreliable Entity List and the Anti-Foreign Sanction Law. While these tools help China counter U.S. actions, they also risk escalating tensions.",
      "publishedAt": "2025-10-20T00:01:05Z",
      "title": "China mimics US tactics with new rare earth export controls",
      "url": "https://apnews.com/article/china-trump-tariff-sanction-export-controls-3224a28221243f0569f065a18dd645e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/b310e3d/2147483647/strip/true/crop/5085x2860+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc9%2F15%2Fdd0ea743690a9f10dfb24b93871a%2Fb2cfa1a14dfe496ca86a1dc18c9d3407"
    },
    {
      "author": "Christopher Megerian",
      "description": "President Donald Trump says the United States could purchase Argentinian beef in an attempt to bring down prices for American consumers. He told reporters aboard Air Force One during a flight Sunday from Florida to Washington that \"If we do that, that will bring our beef prices down.” Trump promised earlier this week to address the issue as part of his efforts to keep inflation in check.",
      "publishedAt": "2025-10-20T00:44:41Z",
      "title": "Trump suggests US will buy Argentinian beef to bring down prices for American consumers",
      "url": "https://apnews.com/article/beef-argentina-us-consumers-prices-f7fadbe1b3fef4646f9c3623f901209a",
      "urlToImage": "https://dims.apnews.com/dims4/default/45053c4/2147483647/strip/true/crop/7621x4287+0+397/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa7%2Fb8%2F792378db090a5b4b2e6644692f20%2F1a891274974d4c3b912fbd3a7a1b76da"
    },
    {
      "author": null,
      "description": "Freed from the prison where he had been serving time for ripping off his campaign donors, former U.S. Rep. George Santos says he’s humbled by his experience behind bars. But he says he's also unconcerned about the “pearl clutching” of critics upset that President Donald Trump granted him clemency. Speaking on CNN’s “State of the Union,” Santos said Sunday that if Trump “had pardoned Jesus Christ off the cross, he would have had critics.” Santos won office after inventing a bogus persona as a Wall Street dealmaker. He was serving a 7-year prison sentence for fraud and identity theft when Trump ordered him released him Friday.",
      "publishedAt": "2025-10-19T18:02:08Z",
      "title": "George Santos humbled by commutation but dismisses critics",
      "url": "https://apnews.com/article/trump-george-santos-commutation-pardon-interview-ff21b286cdcffcf45853883ba05ee69d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c21ab0/2147483647/strip/true/crop/2585x1454+0+134/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2Fbd%2F8b22fcbe634a39c19101c486cfee%2Fae3f3e7e51bd43f9bb5058e3a96bcb70"
    },
    {
      "author": "Thomas Adamson",
      "description": "Thieves have pulled off a daring heist at the Louvre, using a basket lift to reach the museum on Sunday morning. They forced a window, smashed display cases, and fled with jewels of \"inestimable value,\" according to France's interior minister. The museum closed for the day as police sealed gates and ushered visitors out. The robbery took place in the Galerie d’Apollon, where part of the French Crown Jewels are displayed. The thieves reportedly took nine pieces from the jewelry collection of Napoleon and the Empress. Security and staffing at the Louvre have been under scrutiny.",
      "publishedAt": "2025-10-19T09:46:25Z",
      "title": "Thieves use basket lift in daring Louvre robbery, steal priceless jewels",
      "url": "https://apnews.com/article/france-louvre-museum-robbery-a3687f330a43e0aaff68c732c4b2585b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6fb39d/2147483647/strip/true/crop/4030x2267+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faa%2F29%2F9a8dc2bca0198aa5c0597749170f%2Fc1d6fa3557f84bf5931e8a2dfda4b9f3"
    },
    {
      "author": "Gabriela Aoun Angueira",
      "description": "State emergency management officials say they're facing funding challenges from the federal government that threaten the country's ability to respond to crises. The Trump administration has cut state grants and tied funding to immigration enforcement. And the government shutdown adds to the problem. Last week, a federal judge ordered the Department of Homeland Security to stop linking grants to immigration enforcement. Some states have seen drastic cuts to homeland security grants, leading to a freeze on the entire $1 billion program. Emergency management agencies are delaying hiring and equipment purchases. Experts warn these disruptions could jeopardize preparedness and response to disasters.",
      "publishedAt": "2025-10-19T11:32:59Z",
      "title": "Delays in federal FEMA grants risk jeopardizing disaster response",
      "url": "https://apnews.com/article/fema-grants-disasters-immigration-homeland-security-d9c085bc480c12a0ea4c8f283252510b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d76676/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F92%2F83d4bd29732bfd1ebc0175b4eec2%2F511616ce02af44938e82b51670757459"
    },
    {
      "author": "JoNel Aleccia",
      "description": "A study that upended medical practice by recommending feeding babies peanut products early to prevent allergies has had a big effect in the real world. About 60,000 children have avoided developing potentially life-threatening allergies after such guidance was first issued in 2015. A new study in the medical journal Pediatrics found that peanut allergies in children ages 0 to 3 declined by more than 27% after guidance was first issued, and by more than 40% after it was expanded in 2017. For decades, doctors had recommended delaying feeding children peanuts and other foods likely to trigger allergies until age 3.",
      "publishedAt": "2025-10-20T04:01:17Z",
      "title": "New study shows 60,000 kids have been spared peanut allergies by feeding them peanuts as babies",
      "url": "https://apnews.com/article/peanut-allergy-children-infants-anaphylaxis-9a6df6377a622d05e47c340c5a9cffc8",
      "urlToImage": "https://dims.apnews.com/dims4/default/c87ec0f/2147483647/strip/true/crop/3000x1688+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fde%2F80ea8afc33b3ca1e3b8435119653%2F4d9f2f10604c4a16940396d3ad532c9b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}