{
  "articles": [
    {
      "author": "TIA GOLDENBERG, JACK JEFFERY and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Israel and Hamas agreed to extend their cease-fire for two more days past Monday, raising the prospect of further exchanges of militant-held hostages for Palestinians imprisoned by Israel and a longer halt to their deadliest and most destructive war.",
      "publishedAt": "2023-11-27T07:58:51Z",
      "title": "Israel and Hamas agree to extend truce for two more days, and to free more hostages and prisoners",
      "url": "https://apnews.com/852065d35c4643f4c874fb5993313b13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cf211732552487cbbcf4364023daafe/1920.jpeg"
    },
    {
      "author": "LISA RATHKE",
      "description": "BURLINGTON, Vt. (AP) — Three college students of Palestinian descent out for a walk in Vermont were seriously injured over the weekend when a man shot them at close range on a city street — an attack being investigated as a possible hate crime, authorities said Monday.",
      "publishedAt": "2023-11-26T18:55:41Z",
      "title": "Suspect in shooting of 3 men of Palestinian descent near the University of Vermont pleads not guilty",
      "url": "https://apnews.com/ab836d1941e4237b3649353eaceb4092",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86b1972e86524f3691d2f6b38e8731e5/1920.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Consumers are scouring the internet for online deals as they begin to cap off the five-day post-Thanksgiving shopping bonanza with Cyber Monday.Even though e-commerce is now part and parcel of our everyday lives and much of the holiday shopping season, Cyber Monday — a term coined back in 2005 by the National Retail Federation — continues to be the biggest online shopping day of the year, thanks to the deals and the hype the industry has created to fuel it.",
      "publishedAt": "2023-11-27T05:01:26Z",
      "title": "Cyber Monday marks the year's biggest online shopping day, and one more chance to save on gifts",
      "url": "https://apnews.com/edb7b802ff51d76db4274293439dafa8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73b69ae810af460ab88c695d6fd1746e/3000.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "WASHINGTON (AP) — Campaigning in Iowa this year, Donald Trump said he was prevented during his presidency from using the military to quell violence in primarily Democratic cities and states.",
      "publishedAt": "2023-11-27T05:03:52Z",
      "title": "Trump hints at expanded role for the military within the US. A legacy law gives him few guardrails",
      "url": "https://apnews.com/03858b6291e4721991b5a18c2dfb3c36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0c8bb32cc8c45a7975757bc0aa4a37c/3000.jpeg"
    },
    {
      "author": "GISELA SALOMON and SOPHIA TAREEN",
      "description": "HOMESTEAD, Fla. (AP) — In New York, migrants at a city-run shelter grumble that relatives who settled before them refuse to offer a bed. In Chicago, a provider of mental health services to people in the country illegally pivoted to new arrivals sleeping at a police station across the street.",
      "publishedAt": "2023-11-27T11:21:55Z",
      "title": "Tensions simmer as newcomers and immigrants with deeper US roots strive for work permits",
      "url": "https://apnews.com/ec0cfd003abab70bdba5f113f14bbdbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ad319ca25ed441b8bffa609b0ccec28/3000.jpeg"
    },
    {
      "author": "SHARON LURYE",
      "description": "SPRINGFIELD, La. (AP) — Arliya Martin accepted her high school diploma with relief and gratitude. It was her ticket to better-paying work, she felt, after getting kicked out of high school and toiling for eight years at factory jobs to support her children.",
      "publishedAt": "2023-11-27T08:08:39Z",
      "title": "Diplomas for sale: $465, no classes required. Inside one of Louisiana’s unapproved schools",
      "url": "https://apnews.com/a37a44dab69f11e2c37132549f9cd450",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dcd95fc74fd14160a089d48015609d7c/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "AMERICUS, Ga. (AP) — Hundreds turned out to salute Rosalynn Carter on Monday with the former U.S. first lady and global humanitarian's final journey from her rural hometown to the Jimmy Carter Presidential Center in Atlanta as her family began three days of memorials following her death at age 96.",
      "publishedAt": "2023-11-27T05:03:29Z",
      "title": "Rosalynn Carter tributes highlight her reach as first lady and humanitarian",
      "url": "https://apnews.com/2e798e487dc7e727a18f104d02248ad8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d7c573243b42ee91845d88dfdc9f6a/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — For a year, New York's Adult Survivors Act suspended the usual legal deadlines to give sexual assault victims one last chance to file lawsuits over misconduct that occurred years or decades ago.",
      "publishedAt": "2023-11-27T22:27:10Z",
      "title": "Celebrities, politicians among those named in sex abuse suits filed under NY's Adult Survivors Act",
      "url": "https://apnews.com/5952cd8f0213bd8ba34c47950511dfd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4a091c6161a4d9bb19b355da7c07b33/3000.jpeg"
    },
    {
      "author": "THALIA BEATY",
      "description": "What motivates people to donate to charities or causes they care about is often deeply personal.",
      "publishedAt": "2023-11-27T05:58:40Z",
      "title": "Why do they give? Donors speak about what moves them and how they plan end-of-year donations",
      "url": "https://apnews.com/a0a954303a6e916e4cec3141201a82bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a79fbb674b84c329e52a6abf7a2d08f/3000.jpeg"
    },
    {
      "author": "STEVE REED",
      "description": "CHARLOTTE, N.C. (AP) — The Frank Reich era in Carolina is over after only 11 games.The Carolina Panthers fired their coach on Monday following the team’s NFL-worst 1-10 start in his first year at the helm.",
      "publishedAt": "2023-11-27T15:10:13Z",
      "title": "Panthers fire Frank Reich after 11 games and name Chris Tabor their interim head coach",
      "url": "https://apnews.com/bd5ca8da7bd3ef1e394eb0a675e62c96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a2a7f73021b440fa1941560746a7f88/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}