{
  "articles": [
    {
      "author": "SAM METZ and MOSA'AB ELSHAMY",
      "description": "TAFEGHAGHTE, Morocco (AP) — The toll of the massive earthquake that devastated Morocco could be seen Monday in dozens of remote villages such as Tafeghaghte, where more than half of the 160 inhabitants are thought to have died.",
      "publishedAt": "2023-09-11T10:42:09Z",
      "title": "Dozens of remote Moroccan villages struggle in aftermath of devastating earthquake",
      "url": "https://apnews.com/a1b2cbc0ce88afbfe7ad23e652ce11de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e5ff38ac92840f1bfa99a40115831d8/1920.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — The U.S. approved updated COVID-19 vaccines Monday, hoping to rev up protection against the latest coronavirus strains and blunt any surge this fall and winter.The Food and Drug Administration decision opens the newest shots from Moderna and Pfizer and its partner BioNTech to most Americans even if they’ve never had a coronavirus vaccination.",
      "publishedAt": "2023-09-11T18:00:16Z",
      "title": "US approves updated COVID vaccines to rev up protection this fall",
      "url": "https://apnews.com/234f27c74438fb4812a014dbd98ddbde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40e7d2011c9b4489a636ecae88646583/1134.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un will visit Russia, both countries said Monday, and he is expected to hold a highly anticipated meeting with President Vladimir Putin that has sparked Western concerns about a potential arms deal for Moscow’s war in Ukraine.",
      "publishedAt": "2023-09-11T08:22:37Z",
      "title": "North Korean leader Kim Jong Un will visit Russia, setting the stage for a meeting with Putin",
      "url": "https://apnews.com/674e9f1155de1c83ca1a819e7dbf96ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee942520aa524948828e49bd468fd999/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration has cleared the way for the release of five American citizens detained in Iran by issuing a blanket waiver for international banks to transfer $6 billion in frozen Iranian money from South Korea to Qatar without fear of U.S.",
      "publishedAt": "2023-09-11T19:45:23Z",
      "title": "US makes deal with Iran to swap prisoners and release $6 billion in frozen Iranian funds",
      "url": "https://apnews.com/3e834df0a845ef2cc5c52af14598c66f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8ea08dde9a445d6a8620eb9124841a6/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and KAREN MATTHEWS",
      "description": "NEW YORK (AP) — From ground zero to small towns, Americans looked back Monday on 9/11 with moments of silence, tearful words and appeals to teach younger generations about the terror attacks 22 years before.",
      "publishedAt": "2023-09-11T04:04:54Z",
      "title": "The US marks 22 years since 9/11 with tributes and tears, from ground zero to Alaska",
      "url": "https://apnews.com/47488758b18fd78f541674041e36d263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15c119b227ee4e82bb2a29b615996124/1920.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "The U.S. government is taking aim at what has been an indomitable empire: Google’s ubiquitous search engine that has become the internet’s main gateway.The legal attack will swing into full force Tuesday in a Washington D.C.",
      "publishedAt": "2023-09-11T15:29:18Z",
      "title": "Google's search engine dominance is at the center of the biggest US antitrust trial in decades",
      "url": "https://apnews.com/2cfb06271455c7e12c4927959061e832",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6455addff7c4955a2cbd79e42569f57/3000.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "Authorities searched Monday for escaped murderer Danelo Souza Cavalcante who has eluded capture since breaking out of a southeastern Pennsylvania prison a week and a half ago after he apparently slipped through a search perimeter, changed his appearance, stole a dairy delivery van and contacted acquaintances.",
      "publishedAt": "2023-09-11T11:09:30Z",
      "title": "Escaped murderer Danelo Cavalcante flees search area, Pennsylvania police preauthorize deadly force",
      "url": "https://apnews.com/cef94b9cbab4f563269e02bfa6c232e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a87cc78210c49c7bf811f9acdcac855/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Mediterranean storm Daniel caused devastating floods in Libya that swept away entire neighborhoods and wrecked homes in multiple coastal towns in the east of the North African nation.",
      "publishedAt": "2023-09-11T10:02:07Z",
      "title": "Flooding in eastern Libya after weekend storm leaves 2,000 people feared dead",
      "url": "https://apnews.com/8fac4fe35b962242568ff219456c6870",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/250e1bbc7f0e4235b988c668cbab2fe7/2143.jpeg"
    },
    {
      "author": "SUZAN FRASER",
      "description": "ANKARA, Turkey (AP) — A major rescue operation is underway in Turkey’s Taurus Mountains to bring out an American researcher who fell seriously ill nine days ago at a depth of some 1,000 meters (3,000 feet) from the entrance of one of the world’s deepest caves.",
      "publishedAt": "2023-09-11T12:45:40Z",
      "title": "What to know about a major rescue underway to bring a US researcher out of a deep Turkish cave",
      "url": "https://apnews.com/f317601160de0eba58b1b8773abbce78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2925e2251eb54d81ae52c5e4ca598c2a/3000.jpeg"
    },
    {
      "author": "TALES AZZONI",
      "description": "Spanish soccer is ready to move forward, three weeks after its women’s team won the Women's World Cup but had its celebrations marred by a kiss that ignited a crisis.",
      "publishedAt": "2023-09-11T11:59:36Z",
      "title": "With Rubiales finally out, Spanish soccer ready to leave embarrassing chapter behind",
      "url": "https://apnews.com/c7b6930f841f462571f91c459d557729",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/deede399cff8433cade3896d59126546/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}