{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and JULIA FRANKEL",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel’s war with Hamas erupted again Friday, as airstrikes hit houses and buildings in the Gaza Strip minutes after a weeklong truce expired.",
      "publishedAt": "2023-12-01T05:05:56Z",
      "title": "Israeli airstrikes on Gaza resume after weeklong truce with Hamas ends",
      "url": "https://apnews.com/c944c736efdf8993c7a17cf683d6e364",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4870f43928694e5b9b0aaa4f0674739c/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — A weeklong cease-fire that brought the exchanges of dozens of hostages held by Hamas for scores of Palestinian prisoners held by Israel gave way Friday morning to resumed fighting between Israel and Hamas.",
      "publishedAt": "2023-12-01T19:08:29Z",
      "title": "Bombs are falling on Gaza again. Who are the hostages still remaining in the besieged strip?",
      "url": "https://apnews.com/d760e0b30a5fc8bb29623ee350ce0668",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dac2e235ed064d73bab829332bd4db1f/1600.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House voted on Friday to expel Republican Rep. George Santos of New York after a critical ethics report on his conduct that accused him of converting campaign donations for his own use.",
      "publishedAt": "2023-12-01T05:13:33Z",
      "title": "House expels New York Rep. George Santos. It's just the sixth expulsion in the chamber's history",
      "url": "https://apnews.com/fd0f1524065883c6b2fe3e6f9afd84db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/595a64178b874878a06ba8fd8c19e9e7/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Retired Supreme Court Justice Sandra Day O’Connor, an unwavering voice of moderate conservatism and the first woman to serve on the nation’s highest court, died Friday.",
      "publishedAt": "2023-12-01T15:02:29Z",
      "title": "Retired Justice Sandra Day O'Connor, the first woman on the Supreme Court, has died at age 93",
      "url": "https://apnews.com/304f91633f069c46350bdfff540ff9fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58514bac50aa4f8d9732b37e23f36fe6/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — Flu is picking up steam while RSV lung infections that can hit kids and older people hard may be peaking, U.S. health officials said Friday.COVID-19, though, continues to cause the most hospitalizations and deaths among respiratory illnesses — about 15,000 hospitalizations and about 1,000 deaths every week, said Dr.",
      "publishedAt": "2023-12-01T19:13:09Z",
      "title": "Flu is on the rise while RSV infections may be peaking, US health officials say",
      "url": "https://apnews.com/e89147cb8da5580dd470f75ab6526e45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dad518c7884943659f2cae0efa037999/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Lawsuits against Donald Trump over the U.S. Capitol riot can move forward, a federal appeals court ruled on Friday, rejecting the former president's bid to dismiss the cases accusing him of inciting the violent mob on Jan.",
      "publishedAt": "2023-12-01T15:33:50Z",
      "title": "Lawsuits against Trump over Jan. 6 riot can move forward, appeals court rules",
      "url": "https://apnews.com/14b219df31b3a5ebec43e979ad36587a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb7a5bfde1ef438fadaad946c31426fc/3000.jpeg"
    },
    {
      "author": "LISA RATHKE",
      "description": "BURLINGTON, Vt. (AP) — Nearly a week after three college students of Palestinian descent were shot and seriously wounded while taking an evening walk, relatives of two of the victims have arrived in Vermont from the war-torn West Bank, grappling with a new reality that has shattered their lives and a place they thought was a safe haven.",
      "publishedAt": "2023-12-01T18:18:27Z",
      "title": "Families arrive from the West Bank to care for the 3 college students shot in Vermont",
      "url": "https://apnews.com/1c662c8bcbae9b1400bb3df07ab2ea2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0271154fa7414b0cbb7ff4b2435feb4a/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "BOSTON (AP) — The American legal system is facing a crisis of trust in communities around the country, with people of all races and across the political spectrum.For many, recent protests against police brutality called attention to longstanding discrepancies in the administration of justice.",
      "publishedAt": "2023-12-01T14:08:50Z",
      "title": "AP Exclusive: America's Black attorneys general discuss race, politics and the justice system",
      "url": "https://apnews.com/819c9e11c91f8bde1502fd258145a66a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef0992ae2c4b437b80229cd077878246/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris will tackle two delicate tasks this weekend in Dubai: She'll try to demonstrate U.S. environmental leadership despite President Joe Biden 's notable absence from an annual summit on climate change and she'll work to nudge forward fragile efforts to shape the next phase of the war between Israel and Hamas.",
      "publishedAt": "2023-12-01T13:23:49Z",
      "title": "Harris heads to Dubai to tackle delicate tasks of talking climate and Israel-Hamas war",
      "url": "https://apnews.com/faa8031d0e41b3b9458eecebf03e564b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d666be54950e4e5eae195b6502fdd183/3000.jpeg"
    },
    {
      "author": "JEFF McMILLAN",
      "description": "When Sam Schultz was sexually assaulted, it felt like a part of them died.It took eight years and the burgeoning #MeToo movement to spur them to go public and make a police report, and an additional five years for their attackers to plead guilty.",
      "publishedAt": "2023-12-01T05:09:14Z",
      "title": "For a male sexual assault survivor, justice won in court does not equal healing",
      "url": "https://apnews.com/183cd34b8b86543b10ca3d041f8aacd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70d4a3b96d6b442eabf8186bcf693c65/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}