{
  "articles": [
    {
      "author": "WAFAA SHURAFA, NAJIB JOBAIN and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — A four-day cease-fire in Gaza between Israel and Hamas was set to begin Friday morning, Qatar said after a daylong delay extended the agony for those hoping for some relief from the deal, which is to bring the release of dozens of hostages held by militants and Palestinians imprisoned by Israel.",
      "publishedAt": "2023-11-23T06:50:08Z",
      "title": "Qatar says Gaza cease-fire will begin Friday morning, with aid to follow 'as soon as possible'",
      "url": "https://apnews.com/fae556c7bdcc5d120b7617d72238b26e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc1fdfdd9af044ff8f6befd5dc4713dc/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "JERUSALEM (AP) — Israel's military offensive has turned much of northern Gaza into an uninhabitable moonscape. Whole neighborhoods have been erased.",
      "publishedAt": "2023-11-23T13:55:13Z",
      "title": "Gaza has become a moonscape in war. When the battles stop, many fear it will remain uninhabitable",
      "url": "https://apnews.com/f299a28410b70ee05dd764df97d8d3a0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5eb01e60d1e44183a9ff5302b8f0d3b5/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — Retailers are kicking off the unofficial start of the holiday shopping season on Friday with a bevy of discounts and other enticements. But executives are growing concerned with a spending slowdown that could temper sales on the day after Thanksgiving as well as throughout the holidays.",
      "publishedAt": "2023-11-23T11:01:05Z",
      "title": "Retailers are ready to kick off Black Friday just as shoppers pull back on spending",
      "url": "https://apnews.com/e0a7e0cf276aa9af50599e60c7a942ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0b547467adc4c12be42b892f15bb6a5/3000.jpeg"
    },
    {
      "author": "PAN PYLAS",
      "description": "LONDON (AP) — Violent clashes broke out in central Dublin on Thursday evening, with vehicles torched and riot police attacked, after a 5-year-old girl was seriously injured in a knife attack earlier in the day that also saw a woman and two other young children hospitalized.",
      "publishedAt": "2023-11-23T15:27:35Z",
      "title": "Violent clashes break out in Dublin after knife attack that injured 3 children, one seriously",
      "url": "https://apnews.com/9a75c71fbac34fe789220c684c5eb661",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a7596143b414a6bac22f6c19c88280b/3000.jpeg"
    },
    {
      "author": "RAF CASERT",
      "description": "BRUSSELS (AP) — If ever the hard right in Europe needed a set of jumper cables to rev up their electoral engine again in the wake of last month's major setback in Poland, Geert Wilders in the Netherlands provided it.",
      "publishedAt": "2023-11-23T14:33:39Z",
      "title": "Europe's far-right populists buoyed by Wilders' win in Netherlands, hoping the best is yet to come",
      "url": "https://apnews.com/c8617a97a03011f98ed898ce863b579f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0576ecc7f5a3402ca6af40e8a6970e73/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY",
      "description": "CAPE TOWN, South Africa (AP) — Oscar Pistorius could be granted parole on Friday after spending nearly 10 years in prison for murder. It's the latest turn in the story of the double-amputee Olympic runner who was one of the world's most admired athletes before he killed his girlfriend by shooting her multiple times through a toilet door at his home.",
      "publishedAt": "2023-11-24T00:04:57Z",
      "title": "Olympic runner Oscar Pistorius up for parole Friday, 10 years after a killing that shocked the world",
      "url": "https://apnews.com/fb0ea8f28f786f6b91fb93b85ab0d315",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5182a6d1c4a74d3caaff02fef8beca47/2500.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and MARK SHERMAN",
      "description": "WASHINGTON (AP) — The agreement by the maker of OxyContin to settle thousands of lawsuits over the harm done by opioids could help combat the overdose epidemic that the painkiller helped spark.",
      "publishedAt": "2023-11-23T12:44:25Z",
      "title": "OxyContin maker's settlement plan divides victims of opioid crisis. Now it's up to the Supreme Court",
      "url": "https://apnews.com/403e6d0fd01852b858ac3ce6d2a17e9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d41d37932b44dd0afb2606bc6a558c0/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI",
      "description": "BUENOS AIRES, Argentina (AP) — Former President Donald Trump has told Argentina’s President-elect Javier Milei that he plans to travel to the South American country so the two can meet, Milei's office said Thursday.",
      "publishedAt": "2023-11-23T16:15:33Z",
      "title": "Trump tells Argentina's President-elect Javier Milei he plans to visit Buenos Aires",
      "url": "https://apnews.com/5d75b7d86ae1e5948c46b5f40c5264d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1334079e19234bc1973b144ea2997279/3000.jpeg"
    },
    {
      "author": null,
      "description": "LIVINGSTON, Ky. (AP) — A chemical fire at a Kentucky train derailment that caused evacuations has been extinguished and people can return to their homes, rail operator CSX said Thursday.CSX spokesperson Bryan Tucker said in an email Thursday afternoon that “the fire is completely out.” He said that authorities and CSX officials reviewed air monitoring data and decided it was safe to let displaced return home.",
      "publishedAt": "2023-11-23T14:43:46Z",
      "title": "Residents of Kentucky town can return home after crews extinguish derailment fire",
      "url": "https://apnews.com/100c6581176e7e47ff13d8a664e03471",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64ea8d4369b5413ba801d9ace76c50b7/1920.jpeg"
    },
    {
      "author": "ISABELLA O'MALLEY and ALEXANDRE PLAZA",
      "description": "KING GEORGE ISLAND, Antarctica (AP) — On the cusp of the COP28 climate talks, U.N. Secretary-General Antonio Guterres visited Antarctica on Thursday, after previously saying the world must slash carbon emissions to prevent this delicate environment from melting.",
      "publishedAt": "2023-11-23T14:24:51Z",
      "title": "On the cusp of climate talks, UN chief Guterres visits crucial Antarctica",
      "url": "https://apnews.com/11c99dd43dc99f5c8b98cee481da15d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccb15cf9d4e9423eba6134c1b69e94d6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}