{
  "articles": [
    {
      "author": "SAM METZ and MOSA'AB ELSHAMY",
      "description": "AMIZMIZ, Morocco (AP) — An aftershock rattled Moroccans on Sunday as they mourned victims of the nation’s strongest earthquake in more than a century and sought to rescue survivors while soldiers and aid workers raced to reach ruined mountain villages.",
      "publishedAt": "2023-09-10T07:48:16Z",
      "title": "Aftershock rattles Morocco as rescuers seek survivors from the earthquake that killed over 2,100",
      "url": "https://apnews.com/a927c7d286bf6e1047feb1c91ab96fd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b44fa075dfd34c8a9484714921bc37cf/1920.jpeg"
    },
    {
      "author": "SAM METZ and AHMED HATEM",
      "description": "MOULAY BRAHIM, Morocco (AP) — The ground shook with a force few had ever felt, thundering through the remote Moroccan village in the dark of night. When the earthquake was over late Friday, the town carved into the Atlas Mountains lay in devastation, with possibly dozens dead, scores of homes crumpled and walls reduced to rubble.",
      "publishedAt": "2023-09-10T04:43:44Z",
      "title": "Moroccan villagers mourn after earthquake brings destruction to their rural mountain home",
      "url": "https://apnews.com/52cc12e8b556bc86970fff8575e79581",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80d4845672c74dec9cc35c9c84a9096f/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — Michael White had only recently arrived in a grim Iranian jail when a curious fellow prisoner, an English-speaking Iranian, approached him in the courtyard for a conversation.",
      "publishedAt": "2023-09-10T11:54:36Z",
      "title": "A US Navy veteran got unexpected help while jailed in Iran. Once released, he repaid the favor",
      "url": "https://apnews.com/0a6b5a9c63c414e530a6871b9deebb1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45837db1c58040898de6a1f28fc9a9b8/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and ADAM SCHRECK",
      "description": "NEW DELHI (AP) — G20 leaders paid their respects to Indian independence leader Mahatma Gandhi as their summit came to a close Sunday, a day after the group added a new member and reached agreement on a range of issues but softened language on Russia's war in Ukraine.",
      "publishedAt": "2023-09-10T04:29:54Z",
      "title": "G20 leaders pay respects at Gandhi memorial as they wrap up Indian summit and hand over to Brazil",
      "url": "https://apnews.com/9a44765ce588f9ed1b690a0f475a61ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4c7370e15334bb2a81bd40187ed2b35/1920.jpeg"
    },
    {
      "author": "JOSH BOAK and AAMER MADHANI",
      "description": "HANOI (AP) — President Joe Biden said Sunday his visit to Vietnam to showcase stronger ties with Hanoi was not about trying to start a “cold war” with China, but rather was part of a broader effort to provide global stability by building U.S.",
      "publishedAt": "2023-09-10T03:32:28Z",
      "title": "Biden says US outreach to Vietnam is about providing global stability, not containing China",
      "url": "https://apnews.com/ac8f9dd899f77910c42295769d3fedb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8aa99f5bc953490f95d8c745b5b27ca6/2791.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Two foreign aid workers were reportedly killed in eastern Ukraine on Sunday as Russian shelling hit a van carrying a team of four working with a Ukrainian nongovernmental organization, while dozens of Russian drones targeted Kyiv and wounded at least one civilian.",
      "publishedAt": "2023-09-10T10:14:33Z",
      "title": "Russian strikes on Ukraine kill 2 foreign aid workers and target Kyiv",
      "url": "https://apnews.com/a8d300ce02127880ff168d610b312c6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8df773cb8a6e453bafe82781c05bba05/3000.jpeg"
    },
    {
      "author": null,
      "description": "MADRID (AP) — Suspended Spanish soccer federation president Luis Rubiales has resigned from his post after a kiss scandal which tarnished Spain's victory at the Women's World Cup.Rubiales announced his resignation Sunday in a message posted on X, formerly known as Twitter.",
      "publishedAt": "2023-09-10T20:35:29Z",
      "title": "Suspended Spanish soccer federation president Luis Rubiales resigns after kiss scandal at World Cup",
      "url": "https://apnews.com/7ae39241dd3798d251230ba3c8ffa303",
      "urlToImage": ""
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — About 146,000 U.S. auto workers are set to go on strike this week if General Motors, Ford and Stellantis fail to meet their demands for big pay raises and the restoration of concessions the workers made years ago when the companies were in financial trouble.",
      "publishedAt": "2023-09-10T11:00:28Z",
      "title": "Why the United Auto Workers union is poised to strike major US car makers this week",
      "url": "https://apnews.com/0c41761e174236151a29cc698f5dc7d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/977d90caed8f4e12a313575e4e73971d/3000.jpeg"
    },
    {
      "author": "ISSAM ADWAN",
      "description": "GAZA CITY, Gaza Strip (AP) — Israeli fighter jets bombed the Zorob family’s two-story home in the Gaza Strip in 2019, leaving nothing but a pile of debris and despair.",
      "publishedAt": "2023-09-10T05:17:02Z",
      "title": "Families in Gaza have waited years to move into new homes. Political infighting is keeping them out",
      "url": "https://apnews.com/7d0f528ca58802d4007e9e0bab0dda8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f637945f1e14299b36de98fba804cd2/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "PHOENIXVILLE, Pa. (AP) — Authorities say an escaped murderer who has eluded capture since breaking out of a southeastern Pennsylvania prison a week and a half ago slipped out of the search area, changed his appearance, stole a dairy delivery van, abandoning it miles away and remained at large.",
      "publishedAt": "2023-09-10T11:58:03Z",
      "title": "Escaped murderer still at large slips out of search area, steals van, tries to contact ex-co-workers",
      "url": "https://apnews.com/a729fb5d39251c2c1c336513e9f5a324",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6f91c1fcab14778859b763551100812/2976.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}