{
  "articles": [
    {
      "author": "JOSEF FEDERMAN, KAREEM CHEHAYEB and BASSEM MROUE",
      "description": "JERUSALEM (AP) — Israel and Lebanon-based Hezbollah militants began a ceasefire Wednesday in a major step toward ending nearly 14 months of fighting as a region on edge wondered whether it will hold.",
      "publishedAt": "2024-11-26T12:36:43Z",
      "title": "Israel and Lebanon's Hezbollah start a ceasefire after nearly 14 months of fighting",
      "url": "https://apnews.com/aa165645d900a3d681ad127e05b0c561",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70572da9a0c54ae1aa53f468a92ead78/1920.jpeg"
    },
    {
      "author": "ADAM GELLER",
      "description": "A ceasefire deal that could end more than a year of cross-border fighting between Israel and Lebanon's Hezbollah militant group won backing from Israeli leaders Tuesday, raising hopes and renewing difficult questions in a region gripped by conflict.",
      "publishedAt": "2024-11-26T22:01:56Z",
      "title": "What both sides are saying about the ceasefire deal between Israel and Lebanon's Hezbollah",
      "url": "https://apnews.com/3ed296f8317ecaa89c4e3548c75c9602",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25e424f411f84186ad1ecc8de50a6b8a/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — The Biden administration kept President-elect Donald Trump's incoming administration closely apprised of its efforts to broker the ceasefire deal between Israel and Hezbollah that took effect early Wednesday, according to the outgoing Democratic administration.",
      "publishedAt": "2024-11-27T00:35:18Z",
      "title": "Trump team says Israel-Hezbollah ceasefire deal brokered by Biden is actually Trump's win",
      "url": "https://apnews.com/c377aa342396d5fff0f3adc996a2225f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acc119b3872f4f17b87d935dbeb363b4/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — In a Monday evening announcement, President-elect Donald Trump railed against Mexico and Canada, accusing them of allowing thousands of people to enter the U.S.Hitting a familiar theme from the campaign trail and his first term in office, Trump portrayed the country's borders as insecure and immigrants as contributing to crime and the fentanyl crisis.",
      "publishedAt": "2024-11-26T22:20:11Z",
      "title": "Trump vows tariffs over immigration. What the numbers say about border crossings, drugs and crime",
      "url": "https://apnews.com/1528ef9c04f786478184a279ad26abb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2696e379122d4b2a890ac639d3180ac6/1920.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Pakistani security forces launched an operation Tuesday night to disperse supporters of imprisoned former Prime Minister Imran Khan who had gathered in the capital to demand his release from prison.",
      "publishedAt": "2024-11-26T04:40:50Z",
      "title": "Pakistani authorities start clearing Imran Khan supporters from the capital after deadly clashes",
      "url": "https://apnews.com/46ea4720c1f4a28326f73f449f21355e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fe1e39da1c645f78d0d6ad1ade9a451/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — One year after the Jan. 6, 2021, U.S. Capitol attack, Attorney General Merrick Garland said the Justice Department was committed to holding accountable all perpetrators “at any level” for “the assault on our democracy.” That bold declaration won't apply to at least one person: Donald Trump.",
      "publishedAt": "2024-11-26T21:04:58Z",
      "title": "How Trump's bet on voters electing him managed to silence some of his legal woes",
      "url": "https://apnews.com/32b894148b1fd7c4ad13f9dbf1ea9372",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1ffe008754447c69e8f20222b5dd89f/3000.jpeg"
    },
    {
      "author": "ALEXANDRA OLSON and CATHY BUSSEWITZ",
      "description": "NEW YORK (AP) — Walmart's sweeping rollback of its diversity policies is the strongest indication yet of a profound shift taking hold at U.S. companies that are re-evaluating the legal and political risks associated with bold programs to bolster historically underrepresented groups.",
      "publishedAt": "2024-11-26T22:17:53Z",
      "title": "Walmart's DEI rollback signals a profound shift in the wake of Trump's election victory",
      "url": "https://apnews.com/f2fc1ab086186ec6600c38950d8d2c74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b456149ddd94e8bb1b7d5069238412d/3000.jpeg"
    },
    {
      "author": "MICHELLE R. SMITH and JASON DEAREN",
      "description": "Pete Hegseth, Donald Trump's pick to lead the Department of Defense, sat in front of a screen with the headline: “Study Disproves Military Extremism Problem.”",
      "publishedAt": "2024-11-26T19:14:11Z",
      "title": "AP finds that a Pentagon-funded study on extremism in the military relied on old data",
      "url": "https://apnews.com/ea43535cd37abded5a0ed6aaba514115",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/881702db09044545b8360f6ca287995c/2720.jpeg"
    },
    {
      "author": "ROD McGUIRK",
      "description": "MELBOURNE, Australia (AP) — Australia’s House of Representatives on Wednesday passed a bill that would ban children younger than 16 years old from social media, leaving it to the Senate to finalize the world-first law.",
      "publishedAt": "2024-11-26T23:46:08Z",
      "title": "Australia's House of Representatives passes bill that would ban young children from social media",
      "url": "https://apnews.com/bf0ca2aedaf61b71fe335421240e94c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/226b0dfdc5d04bedb879c8f66a82c3f5/1920.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "The Southeastern Conference's losses were almost everyone else's gain in the College Football Playoff rankings, with SMU nudging its way into the top 12 and Indiana staying in the mix at No. 10 despite a lopsided loss of its own.",
      "publishedAt": "2024-11-27T01:53:31Z",
      "title": "SEC losses are big gains for SMU and Indiana in latest College Football Playoff rankings",
      "url": "https://apnews.com/6008100da595581d7143cd4010f28c3e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8b7891481084bb99900537a3075dc6b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}