{
  "articles": [
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE, WILL WEISSERT, BILL BARROW and DARLENE SUPERVILLE",
      "description": "ATLANTA (AP) — A raspy and sometimes halting President Joe Biden tried repeatedly to confront Donald Trump in their first debate ahead of the November election, as his Republican rival countered Biden's criticism by leaning into falsehoods about the economy, illegal immigration and his role in the Jan.",
      "publishedAt": "2024-06-27T04:08:30Z",
      "title": "A halting Biden tries to confront Trump at debate but stirs Democratic panic about his candidacy",
      "url": "https://apnews.com/0e7577e9a354a69f50675494fea54ca9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d08b446338047479b233ded7601ed3d/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — Thursday’s presidential debate was a re-run that featured two candidates with a combined age of 159, but it went especially poorly for one of them, President Joe Biden.",
      "publishedAt": "2024-06-28T03:06:57Z",
      "title": "Debate takeaways: Trump confident, even when wrong, Biden halting, even with facts on his side",
      "url": "https://apnews.com/44e71c900a1c4af2bed93041fdfe923d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1bbfbcdd8e343c887b41a4cf294f2ae/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and ZEKE MILLER",
      "description": "ATLANTA (AP) — Above all, Joe Biden 's allies wanted him to demonstrate strength and energy on the debate stage Thursday night to help put to rest questions about the 81-year-old Democrat's physical and mental acuity.",
      "publishedAt": "2024-06-28T05:24:55Z",
      "title": "Biden's debate performance spurs Democratic panic about his ability to lead party against Trump",
      "url": "https://apnews.com/fe6546f2c9762e80e6067ba10abedea8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcfca1ff32df40cb890814cb92fe7782/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "President Joe Biden and former President Donald Trump traded barbs and a variety of false and misleading information as they faced off in their first debate of the 2024 election.",
      "publishedAt": "2024-06-27T04:12:34Z",
      "title": "FACT FOCUS: Here's a look at some of the false claims made during Biden and Trump's first debate",
      "url": "https://apnews.com/577507522762aa10f6ee5be3a0ced2bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42e710a523764dd4b18945db4edda00e/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and NASSER KARIMI",
      "description": "DUBAI, United Arab Emirates (AP) — Iranians were voting Friday in a snap election to replace the late President Ebrahim Raisi, killed in a helicopter crash last month, as public apathy has become pervasive in the Islamic Republic after years of economic woes, mass protests and tensions in the Middle East.",
      "publishedAt": "2024-06-28T04:32:20Z",
      "title": "Iranians vote to replace president killed in a helicopter crash, but apathy remains high",
      "url": "https://apnews.com/bf09cc8c219750d31bc91042f203cc20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2bd27cb12ee74f118121cdf8280339b6/1920.jpeg"
    },
    {
      "author": "PAOLA FLORES and ISABEL DEBRE",
      "description": "LA PAZ, Bolivia (AP) — Bolivian President Luis Arce on Thursday angrily called accusations that he was behind an attempted coup against his government “lies,” saying the general who apparently led it acted on his own and vowing that he would face justice.",
      "publishedAt": "2024-06-27T11:55:30Z",
      "title": "Bolivia’s president lambasts accusations of a self-coup as 'lies' as his supporters rally",
      "url": "https://apnews.com/568a17444e3356bce9812b7979e933f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1883b7d70e374200bf3b6581afd0818f/1920.jpeg"
    },
    {
      "author": "JIM VERTUNO",
      "description": "AUSTIN, Texas (AP) — The former Uvalde schools police chief was indicted over his role in the slow police response to the 2022 massacre at a Texas elementary school that left 19 children and two teachers dead, the local sheriff said Thursday.",
      "publishedAt": "2024-06-27T23:15:28Z",
      "title": "Former Uvalde police chief indicted over response to Robb Elementary shooting",
      "url": "https://apnews.com/e603acfc25c452695e6e29dd756152d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df2f72b96e6c460c958f0487570ea104/3000.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — In the months since Hamas’ surprise attack sent them scattering across fields or hiding in desert brush, thousands of survivors of a massacre at a trance festival in Israel have come together as a community to heal.",
      "publishedAt": "2024-06-28T04:10:20Z",
      "title": "Survivors of Israel music festival massacre unite to build a healing community",
      "url": "https://apnews.com/89d5785b3caed4e5796b8750010877f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f58ec840a73d4d959c30a9dac538b7c4/1920.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "ULAANBAATAR, Mongolia (AP) — Voters in the youthful democracy of Mongolia are electing a new parliament on Friday in the landlocked Asian democracy that is squeezed between China and Russia, two much larger authoritarian states.",
      "publishedAt": "2024-06-27T23:14:40Z",
      "title": "The young democracy of Mongolia begins voting for an expanded 126-seat parliament",
      "url": "https://apnews.com/bdf3852aed557d710570f1331b2998a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5cca326f7934d6b8a1c8877151d8001/3000.jpeg"
    },
    {
      "author": null,
      "description": "HAMILTON, Ohio (AP) — U.S. President Joe Biden and his Republican rival, former President Donald Trump, met for the first general election debate of the 2024 season — a chance for the candidates to try to reshape the political narrative and persuade undecided voters.",
      "publishedAt": "2024-06-28T04:33:45Z",
      "title": "Photo Gallery: Americans watch Trump and Biden in election debate",
      "url": "https://apnews.com/4426553a83cad0446421c4e667e8598f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b81f0e8850a74c088ddaaefff91dfa88/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}