{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — Biden says he hopes cease-fire, hostage deal to pause Israel-Hamas war can take effect by next Monday.",
      "publishedAt": "2024-02-26T22:48:02Z",
      "title": "Biden says he hopes cease-fire, hostage deal to pause Israel-Hamas war can take effect by next Monday",
      "url": "https://apnews.com/5028b28e896dcefa0cf5355f23e99044",
      "urlToImage": ""
    },
    {
      "author": "WAFAA SHURAFA, TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "RAFAH, Gaza Strip (AP) — President Joe Biden said Monday that he hopes a cease-fire between Israel and Hamas that would pause hostilities and allow for remaining hostages to be released can take effect by early next week.",
      "publishedAt": "2024-02-26T08:53:03Z",
      "title": "Biden hopes cease-fire, hostage deal to pause Israel-Hamas war can take effect by next Monday",
      "url": "https://apnews.com/8682b5446e285a7fc641c9f869df9348",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96efaaa434c14a8280ed08ea7a1817c7/1920.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — February's end is bringing wild weather to much of the United States, with record heat allowing for golf in Wisconsin and outdoor food trucks in Minnesota, along with an increased fire risk across much of the Great Plains.",
      "publishedAt": "2024-02-26T16:11:54Z",
      "title": "Wild weather hits Northwest with snow even as Midwest gets a taste of summer",
      "url": "https://apnews.com/dbbb5939c655a9a6e28ade6401b7ec88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb567489b13a432ea084976ebf50c2c8/1920.jpeg"
    },
    {
      "author": "ISABELLA O'MALLEY",
      "description": "A powerful winter storm was dumping deep snow in parts of the West on Monday and much of the central U.S. was unseasonably warm: People played golf in Wisconsin and comfortably walked their dogs in Iowa, where some bulbs were starting to flower.",
      "publishedAt": "2024-02-26T20:10:53Z",
      "title": "Why so much of the US is unseasonably hot",
      "url": "https://apnews.com/59aa15e41f20a474566e00857df441eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d87e95b00398407d9a1b6bc31aa9cb8d/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Prosecutors in Donald Trump’s New York hush-money criminal case asked a judge Monday to impose a gag order on the former president ahead of next month's trial, citing what they called his “long history of making public and inflammatory remarks” about people involved in his legal cases.",
      "publishedAt": "2024-02-26T19:13:58Z",
      "title": "Manhattan DA asks judge for a gag order in Trump's hush-money case ahead of next month's trial",
      "url": "https://apnews.com/7e627d75e81ad20e8977a9a715ad54c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5284a4c093042deb917b98fdc83c437/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "The Palestinian Authority's prime minister announced his government's resignation on Monday, seen as the first step in a reform process urged by the United States as part of its latest ambitious plans to resolve the Israeli-Palestinian conflict.",
      "publishedAt": "2024-02-26T19:20:05Z",
      "title": "What would a new Palestinian government in the West Bank mean for the war in Gaza?",
      "url": "https://apnews.com/aefe041e045f2c60918b42f42185f41e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95d0f89078cb407ca4f57b118118674a/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM, COLLEEN LONG, ZEKE MILLER and JILL COLVIN",
      "description": "WASHINGTON (AP) — President Joe Biden and former President Donald Trump will make dueling trips to the U.S-Mexico border on Thursday, as both candidates try to turn the nation’s broken immigration system to their political advantage in an expected campaign rematch this year.",
      "publishedAt": "2024-02-26T15:31:29Z",
      "title": "Biden and Trump both plan trips to the Mexico border Thursday, dueling for advantage on immigration",
      "url": "https://apnews.com/734b45dd77b70a41471c9c843c36cc49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56d92e303e7846cca8408d2714012916/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Body camera footage released by Houston police on Monday showed off-duty officers with weapons drawn as they confronted a woman who opened fire at celebrity pastor Joel Osteen’s Houston megachurch earlier this month before she was gunned down.",
      "publishedAt": "2024-02-26T22:41:25Z",
      "title": "Barrage of gunfire as officers confront Houston megachurch shooter, released body cam footage shows",
      "url": "https://apnews.com/946045e19ef9b57895e72bb39ef5a340",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/160399a67b5b4a378369eb04564462a9/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court cast doubt Monday on state laws that could affect how Facebook, TikTok, X, YouTube and other social media platforms regulate content posted by their users.",
      "publishedAt": "2024-02-26T13:53:17Z",
      "title": "Supreme Court casts doubt on GOP-led states' efforts to regulate social media platforms",
      "url": "https://apnews.com/19180ad0a9bdf48ddb77f14a5e335545",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/418b0bb0d1f248fcac0d9761c3c7df5f/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — Hungary’s parliament voted Monday to ratify Sweden's bid to join NATO, ending more than 18 months of delays that frustrated the alliance as it sought to expand in response to Russia's war in Ukraine.",
      "publishedAt": "2024-02-26T09:20:52Z",
      "title": "Hungary's parliament ratifies Sweden's NATO bid, clearing the final obstacle to membership",
      "url": "https://apnews.com/efc791c0d2e4da9fdcb247a2d6624cab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0d45d6085c43a1922a33debe56a024/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}