{
  "articles": [
    {
      "author": "MOHAMMED JAHJOUH and FATMA KHALED",
      "description": "MUWASI, Gaza Strip (AP) — On his key chain, Hassan Nofal keeps the keys to two homes. One is to the house of his grandparents in what is now southern Israel, which his family was driven out of by Israeli forces in 1948 and to which they’ve never been able to return.",
      "publishedAt": "2024-07-09T04:05:55Z",
      "title": "House keys carry symbolic weight for Gaza families repeatedly displaced by war",
      "url": "https://apnews.com/900c4bacf70080249ea8e62f818c410f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b18283fcd9b4e50ab30d34e1a08f261/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Rescuers searched the rubble at a children’s hospital Tuesday for more dead and wounded, Ukrainian President Volodymyr Zelenskyy said, a day Russian missiles slammed into the facility and cities across the country in a massive daytime barrage.",
      "publishedAt": "2024-07-09T08:41:02Z",
      "title": "Kyiv mourns as rescuers sift piles of rubble at a children's hospital hit by a Russian missile",
      "url": "https://apnews.com/0a33ed16baf2c509b205705bdd1155db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc8a675d3f78429c8fdf1960ddf18845/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — NATO leaders gathering in Washington starting Tuesday plan to shore up transatlantic support for Ukraine in its battle against Russia.",
      "publishedAt": "2024-07-09T04:06:08Z",
      "title": "Biden looks to make the case at the NATO summit that he is still up for the job",
      "url": "https://apnews.com/a6521773d23bd79637590fdb6526b57c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7c0753530454e20a207f5321e341a4c/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — Former President Donald Trump is getting back on the campaign trail Tuesday, rallying voters in his home state at his flagship golf resort in a celebratory mood as Democrats face tough calls over President Joe Biden's reelection chances.",
      "publishedAt": "2024-07-09T04:12:44Z",
      "title": "Trump returns to campaign trail with VP deadline nearing amid calls for Biden to withdraw",
      "url": "https://apnews.com/6893fb5c5aac589ad83f151e49729bb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a27396a7a244c5892240598bedc8f15/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and AMELIA THOMSON-DEVEAUX",
      "description": "WASHINGTON (AP) — A solid majority of Americans oppose a federal abortion ban as a rising number support access to abortions for any reason, a new poll finds, highlighting a politically perilous situation for candidates who oppose abortion rights as the November election draws closer.",
      "publishedAt": "2024-07-09T04:02:16Z",
      "title": "Support for legal abortion has risen since Supreme Court eliminated protections, AP-NORC poll finds",
      "url": "https://apnews.com/498d14f6e2bbfe1f313f006ad089de4e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4140adf64d204c0893d1032794f23692/3000.jpeg"
    },
    {
      "author": "TY O'NEIL, CLAIRE RUSH and ANITA SNOW",
      "description": "DEATH VALLEY, Calif. (AP) — Hundreds of Europeans touring the American West and adventurers from around the U.S. are still being drawn to Death Valley National Park, even though the desolate region known as one of the Earth's hottest places is being punished by a dangerous heat wave blamed for a motorcyclist's death over the weekend.",
      "publishedAt": "2024-07-09T04:24:00Z",
      "title": "Tourists still flock to Death Valley amid searing US heat wave blamed for several deaths",
      "url": "https://apnews.com/e1b875ae9d6e72afd179061e34153f8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1dd8b24dc1994b01938d8b14333fad1d/1920.jpeg"
    },
    {
      "author": "MARK VANCLEAVE and JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Power started to come back for some of the millions of homes and businesses left in the dark when Hurricane Beryl slammed into the Houston area, while the weakened storm moved east, spawning suspected tornadoes and causing more damage.",
      "publishedAt": "2024-07-09T04:04:36Z",
      "title": "Some power restored in Houston after Hurricane Beryl while storm spawns tornadoes as it moves east",
      "url": "https://apnews.com/8bfeeed79444eed0bf116d09f1ea7e6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4d45f88deea425dbb9391c111998744/1920.jpeg"
    },
    {
      "author": "MORGAN LEE and ANDREW DALTON",
      "description": "SANTA FE, N.M. (AP) — Alec Baldwin’s trial in the shooting of a cinematographer is set to begin Tuesday with the selection of jurors who will be tasked with deciding whether the actor is guilty of involuntary manslaughter.",
      "publishedAt": "2024-07-09T04:12:53Z",
      "title": "Alec Baldwin's involuntary manslaughter trial begins with jury selection",
      "url": "https://apnews.com/a6731e3226df0990f0469845df3ccde8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1b23be550fe4473ad4312017c365bd3/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — A Massachusetts man has regained his voice after surgeons removed his cancerous larynx and, in a pioneering move, replaced it with a donated one.Transplants of the so-called voice box are extremely rare, and normally aren't an option for people with active cancer.",
      "publishedAt": "2024-07-09T11:00:49Z",
      "title": "A rare voice box transplant helped a cancer patient speak again, part of a pioneering study",
      "url": "https://apnews.com/4feb9cb71dcb9c38837169344730832e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59d9d1013b234bc78f547dbd96d950e8/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Global shares were mostly higher Tuesday, with Tokyo's benchmark hitting another record. France's CAC 40 lost 0.5% in early trading to 7,590.35, while Germany's DAX fell 0.3% to 18,418.81.",
      "publishedAt": "2024-07-09T06:43:08Z",
      "title": "Stock market today: Global stocks mostly rise, with Japan's Nikkei 225 index logging record close",
      "url": "https://apnews.com/e90ef4b51ee2492fa37210d86db47050",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82b9f20892db4559ae503bb993fc9dcf/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}