{
  "articles": [
    {
      "author": "JOSEF FEDERMAN and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — A new round of Israeli airstrikes in Yemen on Thursday targeted the Houthi rebel-held capital and multiple ports, while the World Health Organization's director-general said the bombardment occurred nearby as he prepared to board a flight in Sanaa, with a crew member injured.",
      "publishedAt": "2024-12-26T06:34:41Z",
      "title": "Israel strikes Houthi rebels in Yemen's capital while the WHO chief says he was meters away",
      "url": "https://apnews.com/2e8c33648410c2da94ae7d0d73c0b1a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/667950bd4e4e411fb3e33cd648df5cef/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL",
      "description": "HOMS, Syria (AP) — Syria's new security forces checked IDs and searched cars in the central city of Homs on Thursday, a day after protests by members of the Alawite minority erupted in gunfire and stirred fears that the country's fragile peace could break down.",
      "publishedAt": "2024-12-26T20:22:20Z",
      "title": "An uneasy calm settles over Syrian city of Homs after outbreak of sectarian violence",
      "url": "https://apnews.com/6c8d534d9f93da13dc8629f2f2c49aae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e86c62fa97cf4d119b7709f93c0249f5/1920.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — A lead organization monitoring for food crises around the world withdrew a new report this week warning of imminent famine in north Gaza under what it called Israel's “near-total blockade,” after the U.S.",
      "publishedAt": "2024-12-26T17:34:59Z",
      "title": "The US says it pushed retraction of a famine warning for north Gaza. Aid groups express concern",
      "url": "https://apnews.com/89b4a0d3ab684669ee4456566b406621",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dacfd70f28d746d2ae7964266acbe3fb/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s opposition-controlled National Assembly voted Friday to impeach acting President Han Duck-soo despite vehement protests by governing party lawmakers, further deepening the country’s political crisis set off by President Yoon Suk Yeol’s stunning imposition of martial law and ensuing impeachment.",
      "publishedAt": "2024-12-27T07:47:17Z",
      "title": "South Korea's opposition-controlled National Assembly votes to impeach acting President Han",
      "url": "https://apnews.com/0276374e86e88d9a97c7c2a06d9fabfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61b1d160ea1d4c4a90ef1c26e71055b2/1920.jpeg"
    },
    {
      "author": null,
      "description": "DALLAS (AP) — Parts of Texas, Louisiana and Arkansas were under severe weather watches early Friday as the National Weather Service predicted a storm system in the Gulf of Mexico could bring high winds, hail and possible tornadoes to the region.",
      "publishedAt": "2024-12-27T06:09:55Z",
      "title": "Powerful thunderstorms threaten Texas and Louisiana, delaying holiday travel",
      "url": "https://apnews.com/b86663ab2d074c38cd49262d739eac69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bc80d8b5a0d41e8bf4e22bbcc1bb4a8/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Artificial intelligence. Abortion. Guns. Marijuana. Minimum wages. Name a hot topic, and chances are good there's a new law about it taking effect in 2025 in one state or another. Many of the laws launching in January are a result of legislation passed this year.",
      "publishedAt": "2024-12-27T05:11:50Z",
      "title": "New 2025 laws hit hot topics from AI in movies to rapid-fire guns",
      "url": "https://apnews.com/b7df7562069cf99147dd7e6d957676db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/301d1873d20c49149c178a883399f912/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "ATLANTA (AP) — Republicans plan to move quickly in their effort to overhaul the nation’s voting procedures, seeing an opportunity with control of the White House and both chambers of Congress to push through long-sought changes that include voter ID and proof-of-citizenship requirements.",
      "publishedAt": "2024-12-26T12:46:25Z",
      "title": "Trump has pressed for voting changes. GOP majorities in Congress will try to make that happen",
      "url": "https://apnews.com/88342cf09d01b0555851aa3d64c45432",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/785239cd44f143828e1abec71c44038e/3000.jpeg"
    },
    {
      "author": "DAVID McHUGH",
      "description": "FRANKFURT, Germany (AP) — German President Frank-Walter Steinmeier on Friday ordered parliament dissolved and set new elections for Feb. 23 in the wake of the collapse of Chancellor Olaf Scholz's governing coalition.",
      "publishedAt": "2024-12-27T10:09:00Z",
      "title": "Germany's president dissolves parliament, sets national election for Feb. 23",
      "url": "https://apnews.com/32a9c393067faac264fae7bb29b3e4ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ecddc069360b4f9ab2d838113d817634/3000.jpeg"
    },
    {
      "author": "SAŠA KAVIĆ",
      "description": "ZAGREB, Croatia (AP) — Croatia’s left-leaning president, an outspoken critic of Western military support for Ukraine in its war against Russia, is running for reelection this weekend against an array of contenders, including the candidate backed by the conservative government.",
      "publishedAt": "2024-12-27T05:03:05Z",
      "title": "Croatia's outspoken president is seeking reelection. He faces several contenders in Sunday's vote",
      "url": "https://apnews.com/73147e652adbbfb3a9bdb3de89316122",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/084c2e75e1154d8e9e1581ff859ad82c/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Aviation experts said Thursday that Russian air defense fire was likely responsible for the Azerbaijani plane crash the day before that killed 38 people and left all 29 survivors injured.",
      "publishedAt": "2024-12-26T09:43:12Z",
      "title": "Aviation experts say Russia's air defense fire likely caused Azerbaijan plane crash as nation mourns",
      "url": "https://apnews.com/872800d95273ee96e0950192a32e5228",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9c373ce01da468e9b4f0a5429db01bf/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}