{
  "articles": [
    {
      "author": "AAMER MADHANI, MATTHEW LEE and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The U.S., France and other allies jointly called Wednesday for an immediate 21-day cease-fire to allow for negotiations in the escalating conflict between Israel and Hezbollah that has killed more than 600 people in Lebanon in recent days.",
      "publishedAt": "2024-09-25T16:04:26Z",
      "title": "US and allies call for an immediate 21-day cease-fire between Israel and Hezbollah",
      "url": "https://apnews.com/ff2ec626f5d8883014f577b9a0cfaf1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e45573cde4049e7931fb52f0505787c/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and ALBERT AJI",
      "description": "JDEIDET YABOUS, Syria (AP) — Families fleeing the escalating conflict in Lebanon poured into Syria in growing numbers on Wednesday, waiting for hours in heavy traffic to reach the relative safety of another war-torn country.",
      "publishedAt": "2024-09-25T17:25:58Z",
      "title": "Thousands are pouring into Syria, fleeing worsening conflict in Lebanon",
      "url": "https://apnews.com/8a1fbde03c81fb3672e27d479f5b5a34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67a9e22c74164d378c6013ccaac7c4bd/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ, LARRY NEUMEISTER and ANTHONY IZAGUIRRE",
      "description": "NEW YORK (AP) — New York City Mayor Eric Adams has been indicted by a grand jury on federal criminal charges, according to two people familiar with the matter, an extraordinary culmination to weeks of searches, subpoenas and resignations of top officials that have thrust the city’s government into crisis.",
      "publishedAt": "2024-09-25T21:08:39Z",
      "title": "New York City Mayor Eric Adams has been indicted, sources say",
      "url": "https://apnews.com/419eb7135ac7d52edbf32f7e45d0f5da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c686fcd5e49f4a0c843c387820793498/2946.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and STEPHEN SMITH",
      "description": "TALLAHASSEE, Fla. (AP) — Fast-moving Hurricane Helene was advancing Thursday across the Gulf of Mexico toward Florida, threatening an “unsurvivable” storm surge in northwestern parts of the state as well as damaging winds, rains and flash floods hundreds of miles inland across much of the southeastern U.S., forecasters said.",
      "publishedAt": "2024-09-26T05:05:15Z",
      "title": "Hurricane Helene threatens 'unsurvivable' storm surge and vast inland damage, forecasters say",
      "url": "https://apnews.com/42fb7cc90604b7f87179920f97627873",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5900c087fa124954ad361f38ce37a79e/2439.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Americans are more likely to believe that being a woman will hurt Kamala Harris ' chances in the November election, compared to eight years ago when Hillary Clinton was running.",
      "publishedAt": "2024-09-26T04:02:39Z",
      "title": "Americans are more likely to see Harris' gender as a hurdle than they were for Clinton: AP-NORC poll",
      "url": "https://apnews.com/db505c53d5221b98763025cccf876014",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdbe6d6ed5174a6f8a5a85b507456782/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris will visit the U.S.-Mexico border in Arizona on Friday as her campaign tries to turn the larger issue of immigration from a liability into a strength and hopes to counter a line of frequent, searing political attacks from former President Donald Trump.",
      "publishedAt": "2024-09-25T17:05:16Z",
      "title": "Harris will campaign on Arizona's border with Mexico in attempted show of strength on immigration",
      "url": "https://apnews.com/7f69b21e927319ef48e854e9305a9a3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c1320592e97488ba54aa12a0f588384/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER",
      "description": "Former President Donald Trump described Ukraine in bleak and mournful terms Wednesday, referring to its people as “dead” and the country itself as “demolished,\" and further raising questions about how much the former president would be willing if elected again to concede in a negotiation over the country's future.",
      "publishedAt": "2024-09-25T20:21:38Z",
      "title": "Trump says Ukraine is 'demolished' and dismisses its defense against Russia's invasion",
      "url": "https://apnews.com/0f4d539aa73a943474d779716e5fe42a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1dd7038b26194194b3b615696c97ea18/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Ukrainian President Volodymyr Zelenskyy is visiting Washington on Thursday as U.S. support for his country's fight against Russia faces a partisan reckoning in this year's presidential election.",
      "publishedAt": "2024-09-26T04:13:02Z",
      "title": "Zelenskyy is visiting the White House as a partisan divide grows over Ukraine war",
      "url": "https://apnews.com/229804fd42332c584dfbe05224634e44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/009281d44376441f92dbee467d5339be/2578.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — A Japanese court ruled Thursday that an 88-year-old former boxer was not guilty in a retrial for a 1966 quadruple murder, reversing an earlier wrongful conviction after decades on death row, Japanese broadcaster NHK reported.",
      "publishedAt": "2024-09-26T05:24:14Z",
      "title": "Japanese court acquits a former boxer in a 1966 murder retrial after decades on death row",
      "url": "https://apnews.com/a99eb431ab14fbb8edeb5113e7043977",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d12896ef82e34017bf71bb752e96782a/3000.jpeg"
    },
    {
      "author": "SOPHIKO MEGRELIDZE and DASHA LITVINOVA",
      "description": "TBILISI, Georgia (AP) — Dozens of Georgians stood in tearful silence in a central square near parliament last week to mourn Kesaria Abramidze, a transgender actor and model who was stabbed to death the previous day in her apartment.",
      "publishedAt": "2024-09-26T04:05:03Z",
      "title": "Georgia's anti-LGBTQ+ measures raise fears of hate crimes in the conservative South Caucasus nation",
      "url": "https://apnews.com/af51de7625d8ed349e858eeb5da1f66b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e04d6f7ae2564afa9c089aaea19caca5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}