{
  "articles": [
    {
      "author": "JOSEPH WILSON, MELANIE LIDMAN and JOSEPH KRAUSS",
      "description": "TEL AVIV, Israel (AP) — Norway, Ireland and Spain said Wednesday they would recognize a Palestinian state, a historic but largely symbolic move that further deepens Israel’s isolation more than seven months into its grinding war against Hamas in Gaza.",
      "publishedAt": "2024-05-22T06:42:14Z",
      "title": "Norway, Ireland and Spain say they will recognize a Palestinian state, deepening Israel's isolation",
      "url": "https://apnews.com/ddfd774a23d39f77f5977b9c89c43dbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f561c698ce3a48e389d363c384ac7509/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Chaim Otmazgin had tended to dozens of shot, burned or mutilated bodies before he reached the home that would put him at the center of a global clash.Working in a kibbutz that was ravaged by Hamas’ Oct.",
      "publishedAt": "2024-05-22T04:02:32Z",
      "title": "How 2 debunked accounts of sexual violence on Oct. 7 fueled a global dispute over Israel-Hamas war",
      "url": "https://apnews.com/ca7905bf9520b1e646f86d72cdf03244",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/220ab346edef4b9686324ec0fa93fb6c/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT, SCOTT McFETRIDGE and MARGERY A. BECK",
      "description": "GREENFIELD, Iowa (AP) — Multiple people were killed when a tornado tore through a small town in Iowa and left a wide swath of obliterated homes and crumpled cars, while the howling winds also twisted and toppled wind turbines.",
      "publishedAt": "2024-05-22T04:39:47Z",
      "title": "Tornado kills multiple people in Iowa as powerful storms again tear through Midwest",
      "url": "https://apnews.com/26c73e14ab481ef77a1b0606a2b10adc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42868d52fa2f40a5bfa1cd2095a0f2a8/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's supreme leader prayed Wednesday over the coffins of the country's late president, foreign minister and other officials who were killed in a helicopter crash earlier this week.",
      "publishedAt": "2024-05-22T05:15:14Z",
      "title": "Iran's supreme leader prays for late president and others killed in helicopter crash",
      "url": "https://apnews.com/2a66914de4e15c5033fcd688cf262275",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d450ab16eee647cbadfe072bff90fd2a/1920.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Among Iranian communities from London to Los Angeles, few tears are being shed over the death of President Ebrahim Raisi, killed in a weekend helicopter crash.",
      "publishedAt": "2024-05-22T07:11:33Z",
      "title": "From London to Los Angeles, many Iranians overseas cheer, and fear, after president's death",
      "url": "https://apnews.com/c2d29d9bb3cc4dfde25d00f29bc7685c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27606731ba674e54919990a694c31350/3000.jpeg"
    },
    {
      "author": "TERRY SPENCER and ERIC TUCKER",
      "description": "FORT PIERCE, Fla. (AP) — Prosecutors and defense lawyers in the classified documents case against former President Donald Trump are due in court Wednesday for the first time since the judge indefinitely postponed the trial earlier this month.",
      "publishedAt": "2024-05-22T04:22:41Z",
      "title": "Judge in the Florida Trump classified documents case will hear more arguments on dismissing charges",
      "url": "https://apnews.com/632d6e0f6c8000138bc7c9d47529e20c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99b29bb6c5d846e687e3ffd75faf949a/3000.jpeg"
    },
    {
      "author": "COLLIN BINKLEY",
      "description": "WASHINGTON (AP) — The Biden administration is canceling student loans for another 160,000 borrowers through a combination of existing programs.The Education Department announced the latest round of cancellation on Wednesday, saying it will erase $7.7 billion in federal student loans.",
      "publishedAt": "2024-05-22T09:22:34Z",
      "title": "Biden administration canceling student loans for another 160,000 borrowers",
      "url": "https://apnews.com/60ffeaec17737d6317b4aee188893cc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48bb4c7f0eab4704b8d0d13a4dc7aad1/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Sustained Russian attacks on Ukraine's power grid in recent weeks have forced leaders of the war-ravaged country to institute nationwide rolling blackouts. Without adequate air defenses to counter assaults and allow for repairs, though, the shortages could still worsen as need spikes in late summer and the bitter-cold winter.",
      "publishedAt": "2024-05-22T04:10:34Z",
      "title": "Russian attacks on Ukraine power grid touch Kyiv with blackouts ahead of peak demand",
      "url": "https://apnews.com/c763050237bcc1388747283bf336f8ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3752b1ace29d4a5680fbdf8dbbfe9e57/3000.jpeg"
    },
    {
      "author": "NAPAT KONGSAWAD",
      "description": "BANGKOK (AP) — Singapore Airlines said a relief plane flew into Singapore early Wednesday morning with most of the passengers who were on a flight that was battered by severe turbulence over the Indian Ocean and had to make an emergency landing in Bangkok after one man died and dozens of people were injured.",
      "publishedAt": "2024-05-22T04:29:53Z",
      "title": "Most of passengers from battered Singapore Airlines jetliner arrive in Singapore from Bangkok",
      "url": "https://apnews.com/a6aec916cf38cc82b122198a35b95fd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/447b546de3db49389fc13830587137e9/3000.jpeg"
    },
    {
      "author": "KYLE HIGHTOWER",
      "description": "BOSTON (AP) — The Celtics entered the playoffs expecting to get everyone’s best shot. The East’s top seed barely survived a tough one to open the Eastern Conference finals. Jayson Tatum scored 36 points, including 10 in overtime after Jaylen Brown's tying 3-pointer with 6.1 seconds remaining in regulation, and Boston rallied just in time for a 133-128 victory over the Indiana Pacers on Tuesday night.",
      "publishedAt": "2024-05-22T03:13:31Z",
      "title": "Tatum scores 36, Brown hits 3 to force OT and Celtics edge Pacers 133-128 in Game 1 of East finals",
      "url": "https://apnews.com/1d3ed15e99035ff21eac2b9b4c2e54c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32d972b86ba24a64a313f10436edc94f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}