{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The death toll in the Gaza Strip from the 14-month war between Israel and Hamas militants has topped 45,000 people, Palestinian health officials said Monday, with 52 dead arriving at hospitals across the bombed-out strip over the past 24 hours.",
      "publishedAt": "2024-12-16T09:30:28Z",
      "title": "Death toll in Gaza Strip from Israel-Hamas war tops 45,000, Palestinians say",
      "url": "https://apnews.com/9f7c8f0df71dc4c97a6b31aed6e13304",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63465114c0d44461a250d62e07ed918c/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Palestinian health officials said Monday the death toll from the Israel-Hamas war, now in its 14th month, topped 45,000 people.This comes as an Israeli strike killed at least 10 people, including a family of four, in Gaza City overnight, according to Palestinian medics.",
      "publishedAt": "2024-12-16T07:57:46Z",
      "title": "Middle East latest: Death toll from Israel-Hamas war tops 45,000. Israel strikes Syrian targets",
      "url": "https://apnews.com/4ed0ec24506a1b78f0561ed0cc8f0994",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37898ec2ad26498b99540d303e5af040/2082.jpeg"
    },
    {
      "author": "GERALD IMRAY",
      "description": "CAPE TOWN, South Africa (AP) — France was rushing help by ship and military aircraft to its poor overseas territory of Mayotte in the Indian Ocean on Monday after the island was shattered by its worst storm in nearly a century.",
      "publishedAt": "2024-12-16T09:21:45Z",
      "title": "France rushes help to Mayotte, where hundreds or even thousands died in Cyclone Chido",
      "url": "https://apnews.com/43890b2cee0d90e67b6263f278782334",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94327c3d487f4c53a9b855370dda4bf3/2105.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s impeached President Yoon Suk Yeol dodged requests by investigative agencies to appear for questioning over his short-lived martial law decree, as the Constitutional Court began its first meeting Monday on Yoon's case to determine whether to formally unseat or reinstate him.",
      "publishedAt": "2024-12-16T00:39:12Z",
      "title": "South Korea’s impeached leader avoids investigators as court begins meeting to determine his fate",
      "url": "https://apnews.com/8ec38d61f0ea5c48b3bd1f683b5e9c8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3ed00d3cae948fcbd6cf56382364f85/1920.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "SAN PEDRO SULA, Honduras (AP) — As dozens of deported migrants pack into a sweltering airport facility in San Pedro Sula, Norma sits under fluorescent lights clutching a foam cup of coffee and a small plate of eggs – all that was waiting for her in Honduras.",
      "publishedAt": "2024-12-16T04:17:21Z",
      "title": "As Trump threatens mass deportations, Central America braces for an influx of vulnerable migrants",
      "url": "https://apnews.com/c28e71c590a9f3df2d607df13b956656",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d827fa22aa6d4418acdfbf5319c604d2/3000.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — For the press heading into a second Trump administration, there's a balancing act between being prepared and being fearful.The return to power of Donald Trump, who has called journalists enemies and talked about retribution against those he feels have wronged him, has news executives nervous.",
      "publishedAt": "2024-12-16T06:42:00Z",
      "title": "Journalists anticipate a renewed hostility toward their work under the incoming Trump administration",
      "url": "https://apnews.com/1915c25137eb4605b95ab3b3ccc6fb4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/315d8d2223c549ac85540b921e146397/3000.jpeg"
    },
    {
      "author": "GEIR MOULSON",
      "description": "BERLIN (AP) — Chancellor Olaf Scholz faces a confidence vote in the German parliament on Monday that he's expected to lose, paving the way for the European Union's most populous member and biggest economy to hold an early election in February.",
      "publishedAt": "2024-12-16T05:01:44Z",
      "title": "Germany's Scholz faces a confidence vote. It's expected to lead to an election in February",
      "url": "https://apnews.com/87c6c0c64726eefaa95d9c46dae611dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6da66d626b6744dcafe1f2378699428a/3000.jpeg"
    },
    {
      "author": "REBECCA BOONE",
      "description": "BOISE, Idaho (AP) — Nearly every detail about the religious group Lisa Webb’s family belonged to was hidden from the outside world. Its followers met in homes rather than churches. Its leadership structure was hard to discern, its finances opaque.",
      "publishedAt": "2024-12-16T05:08:22Z",
      "title": "Survivors seek a reckoning as FBI investigates child sex abuse in little-known Christian sect",
      "url": "https://apnews.com/a94073c27168a7998c1a225f72672a3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69f60ca388974cabab36c575e4aa850f/3000.jpeg"
    },
    {
      "author": "MORIAH BALINGIT",
      "description": "WASHINGTON (AP) — President Joe Biden and Vice President Kamala Harris on Sunday thanked deep-pocketed Democratic donors who raised record sums in last month's election loss to President-elect Donald Trump and urged them not to lose hope and to remain politically engaged.",
      "publishedAt": "2024-12-16T00:52:57Z",
      "title": "Biden, Harris thank major Democratic donors and urge them to stay engaged after tough loss to Trump",
      "url": "https://apnews.com/a535c094e16d1807161759bd02c12b57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8df5657b90da4359ba48776e1d9a913d/1920.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — Zakir Hussain, one of India's most accomplished classical musicians who defied genres and introduced tabla to global audiences, died on Sunday. He was 73.The Indian classical music icon died from idiopathic pulmonary fibrosis, a chronic lung disease, at a hospital in San Francisco, his family said in a statement.",
      "publishedAt": "2024-12-16T04:12:45Z",
      "title": "Zakir Hussain, one of India's most accomplished classical musicians, dies at 73",
      "url": "https://apnews.com/4e6b09e2a85a35e417d486188c433fe2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17d875e314364cdcb140e4e3e1a63d5e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}