{
  "articles": [
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iranian President Ebrahim Raisi, a hard-line protégé of the country's supreme leader who helped oversee the mass executions of thousands in 1988 and later led the country as it enriched uranium near weapons-grade levels and launched a major drone-and-missile attack on Israel, has died.",
      "publishedAt": "2024-05-20T04:43:25Z",
      "title": "Iran President Ebrahim Raisi, supreme leader's protégé, dies at 63 in helicopter crash",
      "url": "https://apnews.com/107ffb888540ef022a84ec719b81398c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c31e0270bc3e445ebf473df07ec628de/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iranian President Ebrahim Raisi, the country’s foreign minister and others were found dead Monday hours after their helicopter crashed in a foggy, mountainous region of the country’s northwest, state media reported.",
      "publishedAt": "2024-05-20T02:32:11Z",
      "title": "Iran's president, foreign minister and others found dead at helicopter crash site, state media says",
      "url": "https://apnews.com/426c6f4ae2dd1f0801c73875bb696f48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c31e0270bc3e445ebf473df07ec628de/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JOSEPH KRAUSS",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike killed 27 people in central Gaza, mostly women and children, and fighting with Hamas raged across the north on Sunday as Israel's leaders aired divisions over who should govern Gaza after the war, now in its eighth month.",
      "publishedAt": "2024-05-19T09:18:40Z",
      "title": "Airstrike kills 27 in central Gaza and fighting rages as Israel's leaders are increasingly divided",
      "url": "https://apnews.com/d6ea9776d293130d52d308abd284556e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7261db52e87d4b4884b9fba41390ef05/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump's hush money trial is heading into the final stretch, with prosecutors' last and star witness back on the stand Monday for more grilling before the former president's lawyers get their chance to put on a case.",
      "publishedAt": "2024-05-20T04:02:40Z",
      "title": "Michael Cohen to face more grilling as Trump's hush money trial enters its final stretch",
      "url": "https://apnews.com/363a86879b97d2367831b1392f42689d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f88f8b37ffa46ad9e1c87392013c1d5/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER BODEEN and SIMINA MISTREANU",
      "description": "TAIPEI, Taiwan (AP) — Taiwan’s new President Lai Ching-te in his inauguration speech has urged China to stop its military intimidation against the self-governed island Beijing claims as its own territory.",
      "publishedAt": "2024-05-20T01:18:20Z",
      "title": "Taiwan's new President Lai in his inauguration speech urges China to stop its military intimidation",
      "url": "https://apnews.com/af4ff1f254e11c24f751cea000fb42d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88b85df9f42246bc992e800c8066d679/3000.jpeg"
    },
    {
      "author": "MARTÍN ADAMES ALCÁNTARA & MEGAN JANETSKY",
      "description": "SANTO DOMINGO, Dominican Republic (AP) — Dominican Republic President Luis Abinader is headed to a second term following Sunday’s general elections, declaring victory after his top competitors conceded early in the night as he held a strong leader in early vote tallies.",
      "publishedAt": "2024-05-19T04:01:17Z",
      "title": "Dominican Republic President Luis Abinader heads to reelection as competitors concede early",
      "url": "https://apnews.com/59d10ff3d422842c5f3988b34a39588a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f65ee945a4d40ad9fce2e60cea5242b/2812.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, MATT BROWN and BILL BARROW",
      "description": "ATLANTA (AP) — President Joe Biden on Sunday offered his most direct recognition of U.S. students' anguish over the Israel-Hamas war, telling graduates of historically Black Morehouse College that he heard their voices of protest and that scenes from the conflict in Gaza break his heart, too.",
      "publishedAt": "2024-05-19T03:25:39Z",
      "title": "Biden tells Morehouse graduates that scenes in Gaza from the Israel-Hamas war break his heart, too",
      "url": "https://apnews.com/e42d08d7431bf9218afa90177efa3f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8cc2ea93acb42d0ae4373b7a15c14f2/3000.jpeg"
    },
    {
      "author": null,
      "description": "BALTIMORE (AP) — The container ship that caused the deadly collapse of Baltimore's Francis Scott Key Bridge is scheduled to be refloated on Monday and moved to a nearby marine terminal.The Dali has remained at the collapse site since it lost power and crashed into one of the bridge’s supporting columns on March 26, killing six construction workers and snarling traffic into Baltimore Harbor.",
      "publishedAt": "2024-05-20T04:02:16Z",
      "title": "Ship that caused deadly Baltimore bridge collapse to be refloated and moved",
      "url": "https://apnews.com/83dde05d3ad999c88dd5270bb0cea1c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87c6be6413374e83aa02484fa7bd1c02/3000.jpeg"
    },
    {
      "author": "SIBI ARASU",
      "description": "BEED, India (AP) — Almost 970 million Indians are voting in general elections amid sweltering heat and unpredictable weather extremes exacerbated by human-caused climate change, leading to loss of livelihood, forced migration and increasingly difficult living conditions for millions across the country.",
      "publishedAt": "2024-05-20T02:14:57Z",
      "title": "Climate change impacts millions in India. But as the country votes, some politicians skirt the issue",
      "url": "https://apnews.com/810b9038bc40209d640e1ea9b96c2d7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6f2b27f73ff45f998b39fb8f70827c6/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Sean “Diddy” Combs admitted that he beat his ex-girlfriend Cassie in a hotel hallway in 2016 after CNN released video of the attack, saying in a video apology he was “truly sorry” and his actions were “inexcusable.”",
      "publishedAt": "2024-05-19T15:38:23Z",
      "title": "Diddy admits beating ex-girlfriend Cassie, says he's sorry, calls his actions 'inexcusable'",
      "url": "https://apnews.com/4e6a81d3e9ab40fa229edef2fb8ad357",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2885b309e8f64b3992655c108e31139e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}