{
  "articles": [
    {
      "author": "Dylan Lovan",
      "description": "Severe storms across parts of the U.S. Midwest and South have left at least 27 people dead. Kentucky Gov. Andy Beshear said Saturday that there were 18 weather-related deaths in his state. Ten others in the state were hospitalized in critical condition. A devastating tornado in Kentucky damaged homes, tossed vehicles and left many people homeless. Seventeen of the deaths were in Laurel County, located in the state’s southeast. The other was in Pulaski County: Fire Department Maj. Roger Leslie Leatherman, a 39-year veteran who was fatally injured while responding to the deadly weather. Beshear said parts of two dozen state roads were closed, and some could take days to reopen.",
      "publishedAt": "2025-05-18T03:22:38Z",
      "title": "Severe weather leaves at least 27 dead, including 18 in Kentucky",
      "url": "https://apnews.com/article/severe-weather-midwest-south-kentucky-a6b8932577b800f996d6963290d3f3d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/959e386/2147483647/strip/true/crop/4786x2692+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F7d%2F4e94a9bade4ab612da1756d58803%2Fa55cc5f5df5f4b188ce5a963d83d9bb0"
    },
    {
      "author": "The Associated Press",
      "description": "Officials say police and firefighters are responding to an explosion that rocked the city of Palm Springs. The city of Palm Springs says the explosion happened at 11 a.m. local time and that residents were being asked to avoid the area around North Indian Canyon Drive near East Tachevah Drive. Palm Springs is a tony community in the desert about a two-hour drive west of Los Angeles, known for upscale resorts and a history of celebrity residents.",
      "publishedAt": "2025-05-17T19:32:07Z",
      "title": "Police and firefighters respond to an explosion rocking the California city of Palm Springs",
      "url": "https://apnews.com/article/california-explosion-palm-springs-eb8887fbe5877a20a40916aba86554ea",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A Mexican navy sailing ship has hit the Brooklyn Bridge during a promotional tour in New York City, the top of its mast brushing the iconic span as it sailed through the East River. Fire officials say there have been some injuries. The Mexican navy said in a post on the social platform X that Saturday's incident involved the Cuauhtemoc, an academy training vessel. It said the Cuauhtemoc was damaged and prevented from continuing its voyage. The navy added that the status of personnel and material was under review by naval and local authorities, which were providing assistance.",
      "publishedAt": "2025-05-18T01:42:03Z",
      "title": "Mexican navy training vessel hits New York's Brooklyn Bridge. Some injuries reported",
      "url": "https://apnews.com/article/brooklyn-bridge-collision-mexican-navy-ship-ca335dc85ebfbf981bc38516985461c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/6103def/2147483647/strip/true/crop/3000x1688+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2F6e%2F8ae11d03f4c52487eb42dc575d3c%2Fc1c415612cbf4fd3b980adc8ded92933"
    },
    {
      "author": "Volodymyr Yurchuk, Hanna Arhirova",
      "description": "A Russian drone has struck a passenger bus in Ukraine’s northeastern Sumy region, killing nine people and injuring four others. Ukrainian officials said the attack happened on Saturday, just hours after Moscow and Kyiv held their first direct peace talks in years which failed to yield a ceasefire. The Sumy regional administration said in a post on the Telegram messaging app that “this is another war crime by Russia — a deliberate strike on civilian transport that posed no threat.” The peace talks ended after less than two hours on Friday, with both sides agreeing on a large prisoner swap while a ceasefire remained elusive.",
      "publishedAt": "2025-05-17T06:50:56Z",
      "title": "Russian drone strike kills 9 people in Ukraine, officials say",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-strike-sumy-e90d68ea2ef45f329a4cda16e200c141",
      "urlToImage": "https://dims.apnews.com/dims4/default/ccc0fa4/2147483647/strip/true/crop/4771x2684+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3f%2F41%2F753e359785c8611482f2987c1239%2F7e27a55f093f4772993eb1c541e59731"
    },
    {
      "author": null,
      "description": "Israel says it has launched a new military operation in the Gaza Strip to pressure Hamas to release the remaining hostages. Israel’s defense minister said Saturday that Operation Gideon Chariots began and is being led with “great force” by Israel’s army. The announcement comes after days of intensive strikes across Gaza that killed hundreds of people. Israel’s Prime Minister Benjamin Netanyahu vowed earlier in the week to escalate pressure on Hamas with the aim of destroying the militant group that has ruled Gaza for nearly two decades.",
      "publishedAt": "2025-05-17T11:52:46Z",
      "title": "Israel launches a new military operation in Gaza to pressure Hamas to release hostages",
      "url": "https://apnews.com/article/mideast-wars-israel-gaza-hamas-hostages-05-17-2025-baec52efaea911bf56f8ec25758b7011",
      "urlToImage": "https://dims.apnews.com/dims4/default/d130dc5/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F15%2F04%2F951d7b7f28998ece5db1526d8886%2Fc9f69b0fbdcb4706b80c121a597b9b56"
    },
    {
      "author": "Nicole Winfield",
      "description": "About 150 official delegations are expected at the formal installation Mass for Pope Leo XIV. Sunday's ceremony in St. Peter's Square blends ancient ritual, evocative symbols and a nod to modern-day celebrity. Leo will start the day by taking his first tour through the piazza in the popemobile. The open-topped vehicle has become synonymous with the papacy’s global reach and mediatic draw. Leo will receive the two potent symbols of the papacy during the Mass. They are the lambswool stole known as a pallium. And the fisherman’s ring.",
      "publishedAt": "2025-05-18T03:02:27Z",
      "title": "Ritual, symbol and a popemobile tour mark Pope Leo XIV's installation Mass",
      "url": "https://apnews.com/article/vatican-pope-leo-xiv-installation-mass-b210865c4f0ed422ae74702c6eea1a93",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a082c7/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F4a%2F9cd8a5a5ed1ffd556a1aa74d7ccf%2F787f3ef2e4ef43e0a90c43429cd39e41"
    },
    {
      "author": "Stephen Mcgrath, Justin Spike",
      "description": "Romanians are casting their ballots in a tense presidential runoff between a hard-right nationalist and a pro-Western centrist. It's a high-stakes election rerun that could determine the geopolitical direction of the European Union and NATO member country. Sunday’s race pits front-runner George Simion, the 38-year-old leader of the hard-right Alliance for the Unity of Romanians, and incumbent Bucharest Mayor Nicusor Dan. It comes months after the previous election was annulled and plunged Romania into its worst political crisis in decades. Polls opened at 7 a.m. local time and will close at 9 p.m.",
      "publishedAt": "2025-05-18T04:01:06Z",
      "title": "Romanians cast ballots in a tense presidential runoff that pits nationalist against pro-EU centrist",
      "url": "https://apnews.com/article/romania-election-presidential-europe-runoff-democracy-6408339a1a9d310bcc540c75b1d110f9",
      "urlToImage": "https://dims.apnews.com/dims4/default/69de5ba/2147483647/strip/true/crop/4078x2294+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Fae%2Fe2506013f4d6c2ac9c885c9f8ff6%2F1b637fc3fdeb4e6185f5df41d197ab24"
    },
    {
      "author": "Josh Boak",
      "description": "President Donald Trump on Saturday ripped into the retailer Walmart, saying on social media that it should eat the additional costs created by his import taxes. As the U.S. president has jacked up tariffs, he has tried to assure a skeptical public that foreign producers would pay for the taxes and that retailers and automakers would absorb the additional expenses. Most economic analyses are deeply skeptical of those claims and have warned that the tariffs would worsen inflation, but Walmart warned on Thursday that everything from bananas to children’s car seats could increase in price.",
      "publishedAt": "2025-05-17T15:55:20Z",
      "title": "Trump warns Walmart not to raise prices due to his tariffs",
      "url": "https://apnews.com/article/trump-tariffs-walmart-inflation-import-taxes-e2012e0d9e242b0be0b9474aa58d41fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/92eb22a/2147483647/strip/true/crop/2122x1194+0+110/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F8d%2F29a045c4c05201c99dcb69e9e0e5%2F99a9a56643ae4e22901f19eead5cc5f6"
    },
    {
      "author": "Lauran Neergaard",
      "description": "The Food and Drug Administration has approved Novavax's COVID-19 vaccine but with unusual restrictions. Novavax makes the nation's only traditional protein-based coronavirus vaccine and while it has long been authorized for use, it had expected full approval last month. Late Friday, the FDA licensed the vaccine but for use only in adults 65 and older — or those 12 to 64 who have at least one health problem that puts them at increased risk from the virus. Novavax also is required to do additional clinical trials of the shot.",
      "publishedAt": "2025-05-18T02:21:22Z",
      "title": "FDA approves Novavax COVID-19 shot but with unusual restrictions",
      "url": "https://apnews.com/article/novavax-covid19-vaccine-fda-a477c1aa612ceb293e70d904b46611b0",
      "urlToImage": "https://dims.apnews.com/dims4/default/877d8cb/2147483647/strip/true/crop/4959x2789+0+258/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F18%2Fa071c1a2e9c2e25a5d5a31f70451%2Fbb1f9522401d46799998e0a09444a3b9"
    },
    {
      "author": "Jake Coyle",
      "description": "With remarkable regularity, Anderson has been crafting movies uniquely his own since his 1996 debut, “Bottle Rocket.” There are variations. Some are expansive family dramas (“The Royal Tenenbaums”). Some are more intimate (“Rushmore”). Some are more densely layered (“Asteroid City”). “The Phoenician Scheme,” a leaner tale which Focus Features will release May 30, is Anderson working in high comic gear. A playful and poignant kind of thriller, it stars Benicio Del Toro as the tycoon Zsa-Zsa Korda, who decides to name his daughter heir to his dubiously accrued fortune.",
      "publishedAt": "2025-05-17T20:27:41Z",
      "title": "Wes Anderson talks 'The Phoenician Scheme,' Gene Hackman and his Cannes bus",
      "url": "https://apnews.com/article/wes-anderson-phoenician-scheme-cannes-interview-3cb36734f1803dfc13fe1ad50f27b899",
      "urlToImage": "https://dims.apnews.com/dims4/default/071c127/2147483647/strip/true/crop/7072x3978+0+536/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2Fc0%2Fbcad98e650920ba189abf44ce10a%2F58f3943f715a4b72a974843c54cae3a0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}