{
  "articles": [
    {
      "author": "FRANK BAJAK and DAKE KANG",
      "description": "Chinese police are investigating an unauthorized and highly unusual online dump of documents from a private security contractor linked to the nation's top policing agency and other parts of its government — a trove that catalogs apparent hacking activity and tools to spy on both Chinese and foreigners.",
      "publishedAt": "2024-02-21T19:29:41Z",
      "title": "An online dump of Chinese hacking documents offers a rare window into pervasive state surveillance",
      "url": "https://apnews.com/aac38c75f268b72910a94881ccbb77cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87e1ff6f878742c58e935429ba8de08a/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels set a ship ablaze in the Gulf of Aden on Thursday as Israel intercepted what appeared to be another Houthi attack near the port city of Eilat, authorities said.",
      "publishedAt": "2024-02-22T06:08:12Z",
      "title": "Suspected Houthi rebel missile sets cargo ship ablaze. Israel intercepts separate attack near Eilat",
      "url": "https://apnews.com/216c0bde5f79ed857f1f5ef7f157a66b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4cb0423cbef414caf3cdfd2adba7608/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Three gunmen opened fire Thursday morning on the road near a checkpoint in the Israeli-occupied West Bank, killing one Israeli and wounding at least eight, police said, as violence persists in the territory.",
      "publishedAt": "2024-02-22T07:11:20Z",
      "title": "Live updates | Attackers open fire in the West Bank, killing 1 Israeli and wounding others",
      "url": "https://apnews.com/f49e456ea5e0cf75a322c3885f997f98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8223463c4d97425384f5e360a9236c1f/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and COLLEEN LONG",
      "description": "WASHINGTON (AP) — The White House is considering using provisions of federal immigration law repeatedly tapped by former President Donald Trump to unilaterally enact a sweeping crackdown at the southern border, according to three people familiar with the deliberations.",
      "publishedAt": "2024-02-22T01:06:40Z",
      "title": "White House weighing executive actions on the border — with immigration powers used by Trump",
      "url": "https://apnews.com/f0ca943f0f148e165bc6e8ebfd149f14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae234682a6f14ae58548b950df3d87ff/2117.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump could be at risk of losing some of his prized properties if he can’t pay his staggering New York civil fraud penalty. With interest, he owes the state nearly $454 million — and the amount is going up $87,502 each day until he pays.",
      "publishedAt": "2024-02-22T05:06:11Z",
      "title": "New York AG says she’ll seize Donald Trump’s property if he can’t pay $454 million civil fraud debt",
      "url": "https://apnews.com/63e643d0fe098cc1ac178c003f21a40d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f34bbb8eacc24fcdb21fe679d5f03878/3000.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "MONTGOMERY, Ala. (AP) — Alabama's largest hospital paused in vitro fertilization treatments Wednesday as providers and patients across the state scrambled to assess the impact of a court ruling that said frozen embryos are the legal equivalent of children.",
      "publishedAt": "2024-02-21T20:48:13Z",
      "title": "Alabama hospital puts pause on IVF in wake of ruling saying frozen embryos are children",
      "url": "https://apnews.com/4cf5d3139e1a6cbc62bc5ad9946cc1b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3421ed9c6281451d97d931c8776370a7/3000.jpeg"
    },
    {
      "author": "ELAINE KURTENBACH",
      "description": "Japan’s benchmark Nikkei 225 index surged Thursday past the record it set in 1989 before its financial bubble burst, ushering in an era of faltering growth. The index closed Thursday at 39,098.68, up 2.2%.",
      "publishedAt": "2024-02-22T06:37:48Z",
      "title": "Japan's Nikkei stock index breaks its 1989 record and surges to an all-time high",
      "url": "https://apnews.com/93003abeedbc99cf8f3dab78de78c298",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1368de3c68949bda5b80a150541595f/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and SUSIE BLANN",
      "description": "LYMAN, Ukraine (AP) — When the Russian army mounted a full-scale invasion two years ago, Ukrainian men zealously rushed to recruitment centers across the country to enlist, ready to die in defense of their nation.",
      "publishedAt": "2024-02-22T05:17:43Z",
      "title": "Desperate for soldiers, Ukraine weighs unpopular plan to expand the draft",
      "url": "https://apnews.com/b2ca1d0ecd72019be2217a653989fbc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32cfe86dfc2a40aca048bb8d1a7e2199/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "LONDON (AP) — Yulia Navalnaya used to avoid the cameras, staying in the background while her husband, Russian opposition leader Alexei Navalny, rose to become President Vladimir Putin’s greatest foe.",
      "publishedAt": "2024-02-22T05:53:50Z",
      "title": "Yulia Navalnaya once avoided the limelight. Now she's Russia’s newest opposition leader",
      "url": "https://apnews.com/92efe8fa54fa6a6614fb3433c27e4878",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/459ed887f68b42a5b1db4d190f1946ee/2674.jpeg"
    },
    {
      "author": "JULIE WATSON",
      "description": "SAN DIEGO (AP) — China plans to send a new pair of giant pandas to the San Diego Zoo, renewing its longstanding gesture of friendship toward the United States after a recalling nearly all the iconic bears on loan to U.S.",
      "publishedAt": "2024-02-22T04:03:28Z",
      "title": "China plans to send San Diego Zoo more pandas this year, reintroducing panda diplomacy",
      "url": "https://apnews.com/6976587ee9992c861d9a56db0cb1ff89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae50b8af1a71454092c006179f11be52/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}