{
  "articles": [
    {
      "author": "DAMIAN DOVARGANES and JORDI LEBRIJA",
      "description": "SAN DIEGO (AP) — Tropical Storm Hilary inundated streets across Mexico’s arid Baja California Peninsula with deadly floodwaters Sunday before moving over Southern California, where it swamped roads and downed trees, as concerns mounted that flash floods could strike in places as far north as Idaho.",
      "publishedAt": "2023-08-20T17:06:19Z",
      "title": "Rain from Tropical Storm Hilary lashes California and Mexico, swamping roads and trapping cars",
      "url": "https://apnews.com/f89aeddeb62d55c935699ac81ca85f1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f786b7ca5bae469f9527fb4382bf33ce/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Former President Donald Trump confirmed Sunday that he will be skipping Wednesday's first Republican presidential primary debate — and others as well.",
      "publishedAt": "2023-08-20T22:37:35Z",
      "title": "Trump says he will skip GOP presidential primary debates",
      "url": "https://apnews.com/9b6c7e74c7ce908cd082df3bb192535f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/effe9b6cc9a84b01877863595d3fe6d7/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — Ecuadorians put aside fears of leaving their homes amid unprecedented violence and voted for a new president Sunday in a special election that was heavily guarded by police and soldiers in part due to the assassination of a presidential candidate this month.",
      "publishedAt": "2023-08-20T04:07:10Z",
      "title": "Vote count in Ecuador points to likely runoff between ally of ex-president and banana tycoon’s son",
      "url": "https://apnews.com/0d1b5a7c56c671217a47c1ecb7e826fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c8efeb8001744339b1a46c5cf1efecd/3000.jpeg"
    },
    {
      "author": "SONIA PÉREZ D. and CHRISTOPHER SHERMAN",
      "description": "GUATEMALA CITY (AP) — Outsider Bernardo Arévalo appeared to be the “virtual winner” of Sunday's election to be Guatemala’s next president after voters angry at widespread corruption and leaders’ failure to tackle it made a decisive choice for change.",
      "publishedAt": "2023-08-20T04:02:22Z",
      "title": "Progressive Arévalo is 'virtual winner' of Guatemala election after corruption angered voters",
      "url": "https://apnews.com/d5bffc895c90570aafa77a0b2056a640",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/109c98525ad5403385563df7b4617dd6/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and EVELYNE MUSAMBI",
      "description": "DUBAI, United Arab Emirates (AP) — Border guards in Saudi Arabia have fired machine guns and launched mortars at Ethiopians trying to cross into the kingdom from Yemen, likely killing hundreds of the unarmed migrants in recent years, Human Rights Watch said in a report released Monday.",
      "publishedAt": "2023-08-21T04:03:35Z",
      "title": "Rights group says Saudi Arabia border guards fired on and killed hundreds of Ethiopian migrants",
      "url": "https://apnews.com/c6958c2593573c0c8fc64794a60f777c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/727ae7bf863048efae23b6fa748ddab3/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Sweltering temperatures lingered Sunday in a large swath of the central U.S., causing misery from the Gulf of Mexico to the Great Lakes.Record high temperatures were recorded in Texas and other states.",
      "publishedAt": "2023-08-20T16:28:01Z",
      "title": "Sweltering temperatures bring misery to large portion of central US, setting heat records",
      "url": "https://apnews.com/c55d9f858297c9941560c3e38b3dc77b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e22d9504b3943c68b9d4a985a5f7b8e/3000.jpeg"
    },
    {
      "author": "SUSAN HAIGH and JIM MORRIS",
      "description": "VANCOUVER, British Columbia (AP) — As tens of thousands of people were under evacuation orders across British Columbia and firefighters battled raging wildfires throughout Canada on Sunday, fire chiefs in a region known as a summer destination for families said they’ve made some progress in the struggle.",
      "publishedAt": "2023-08-20T05:33:36Z",
      "title": "As thousands flee homes across British Columbia from wildfires, chiefs in one region report progress",
      "url": "https://apnews.com/2450568b1db8152ad8f39b8197df321b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9aa2e97352c4b06a803a7b4be1925d4/1920.jpeg"
    },
    {
      "author": "ANNE M. PETERSON",
      "description": "SYDNEY (AP) — A champion's medal around her neck, Salma Paralluelo lay on the field for a while and nestled into the golden glitter that had fallen over Spain’s Women’s World Cup team as it celebrated a 1-0 victory over England.",
      "publishedAt": "2023-08-20T12:03:31Z",
      "title": "From turmoil to triumph, Spain earns its first Women's World Cup title with a 1-0 win over England",
      "url": "https://apnews.com/232025b71703e9acde0ae39addb16c10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04bb8ce3b49c465c961696aadf14934a/1920.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — More than a year after the U.S. Supreme Court overturned the federal right to abortion, the issue has at times dominated the discussion among the Republicans seeking their party's 2024 presidential nomination and is sure to be on display during the first GOP campaign debate Wednesday in Milwaukee.",
      "publishedAt": "2023-08-20T13:59:47Z",
      "title": "Where do the 2024 presidential candidates stand on abortion? Take a look",
      "url": "https://apnews.com/32f0b379ef6610aec0219e9c197bbbde",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13592c5fafcb43f7b31adff09bdad680/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An oil tanker long suspected of carrying sanctioned Iranian crude oil offloaded its cargo near Texas on Sunday, tracking data showed, even as Tehran has threatened to target shipping in the Persian Gulf over it.",
      "publishedAt": "2023-08-20T03:40:20Z",
      "title": "A tanker believed to hold sanctioned Iran oil starts offloading near Texas despite Tehran's threats",
      "url": "https://apnews.com/3f257407678b844e5c71c39334866bb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bb02123dc3f48b4bb15095497128c63/1023.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}