{
  "articles": [
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — The director of the Secret Service resigned Tuesday in the aftermath of the assassination attempt against former President Donald Trump that unleashed an outcry about how the agency failed in its core mission to protect current and former presidents.",
      "publishedAt": "2024-07-23T14:35:05Z",
      "title": "Secret Service director steps down after assassination attempt against ex-President Trump at rally",
      "url": "https://apnews.com/8b1b13cece2ff25590c81093032dceb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d59f40a3f43422b8b281ac8734c9417/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and ZEKE MILLER",
      "description": "MILWAUKEE (AP) — Vice President Kamala Harris flew to her first battleground state Tuesday after locking up nomination support from Democratic delegates, determined to prosecute the Democrats' political case against Republican former President Donald Trump.",
      "publishedAt": "2024-07-23T09:02:08Z",
      "title": "Harris visits battleground Wisconsin in first rally as Democrats coalesce around her for president",
      "url": "https://apnews.com/012c6474b8b23960d2cf616e92989a4b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a6eb84fb99fa4f51a3c7a8c77985868b/1920.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "ATLANTA (AP) — Kamala Harris was greeted by a massive, cheering crowd during the first rally of her newly announced presidential campaign in 2019.",
      "publishedAt": "2024-07-23T11:03:56Z",
      "title": "Kamala Harris is preparing to lead Democrats in 2024. There are lessons from her 2020 bid",
      "url": "https://apnews.com/a87d01db5a152ac88d0945a30494405d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18418599e3f9486cb6093b6270f62cba/2646.jpeg"
    },
    {
      "author": "CALVIN WOODWARD, MARY CLARE JALONICK, STEPHEN GROVES and ZEKE MILLER",
      "description": "WASHINGTON (AP) — As the formulaic “pass the torch” drumbeat thumped on from lawmakers wanting him to quit the race, President Joe Biden maintained a brave face.",
      "publishedAt": "2024-07-23T04:04:12Z",
      "title": "Biden passed that torch slowly, hanging on until the wheels finally came off",
      "url": "https://apnews.com/f891f5a42a70cb616289e874d79eb103",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd8bb7ae82314ffe948a2383f1aaf3ab/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "REHOBOTH BEACH, Delaware (AP) — President Joe Biden will address the nation from the Oval Office on Wednesday evening on his decision to drop his 2024 Democratic reelection bid.",
      "publishedAt": "2024-07-23T15:22:49Z",
      "title": "Biden will address the nation Wednesday on his decision to drop his 2024 Democratic reelection bid",
      "url": "https://apnews.com/11b30094dd3cd1a9dcbeefaaab057acc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccf2f48320054b619fb131fdc2d2ae65/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER, ASHRAF KHALIL and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Israeli Prime Minister Benjamin Netanyahu's visit to Washington this week is looming as a fraught one between the two allies, coming at a moment of extreme political flux in the United States and wariness among American leaders about Netanyahu's history of interjecting himself into U.S.",
      "publishedAt": "2024-07-23T04:19:10Z",
      "title": "Netanyahu is in Washington at a fraught time for Israel and the US. What to know about his visit",
      "url": "https://apnews.com/6d8deabff2701273ea77bf634ba1949b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cda7566f35ae4e3d9197e0a7d91dc54e/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — An Iowa judge has ruled the state's strict abortion law will take effect Monday, preventing most abortions after about six weeks of pregnancy, before many women know they are pregnant.",
      "publishedAt": "2024-07-23T15:41:43Z",
      "title": "Iowa law banning most abortions after six weeks of pregnancy to take effect Monday",
      "url": "https://apnews.com/b512e24eeea4e7a40cdabece4d9d3b01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d577c05fb0445c6a4433f02f5202b1b/3000.jpeg"
    },
    {
      "author": "JONATHAN MATTISE and KIMBERLEE KRUESI",
      "description": "NASHVILLE, Tenn. (AP) — Among the throngs of tourists in cowboy attire who flock to Nashville's famed downtown honky-tonks, a small but unsettling group has distracted locals and visitors from the neon lights lately with Nazi salutes and white supremacist rhetoric.",
      "publishedAt": "2024-07-23T17:32:49Z",
      "title": "Nashville grapples with lingering neo-Nazi presence in tourist-friendly city",
      "url": "https://apnews.com/193fddb42fe3f5d577ffaa6a3ab10b3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb3608a8c0f34020a586b797017877ec/3000.jpeg"
    },
    {
      "author": "AMANUEL GEBREMEDHIN BIRHANE",
      "description": "ADDIS ABABA, Ethiopia (AP) — Mudslides triggered by heavy rain in a remote part of Ethiopia have killed at least 229 people, including many who tried to rescue survivors, local authorities said Tuesday, in what the prime minister called a \"terrible loss.\"",
      "publishedAt": "2024-07-23T07:02:29Z",
      "title": "Mudslides in Ethiopia have killed at least 229. It's not clear how many people are still missing",
      "url": "https://apnews.com/cb727bb89150c9d521ccbe2ef1a63f14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/945c56c6b73f430e8eece7b71ea24be2/1920.jpeg"
    },
    {
      "author": "HOWARD FENDRICH and EDDIE PELLS",
      "description": "Lydia Jacoby was a breakout star in the pool for the United States at the last Summer Games, earning a gold medal in the 100-meter breaststroke and a relay silver.",
      "publishedAt": "2024-07-23T10:00:24Z",
      "title": "Biles, Osaka and Phelps spoke up about mental health. Has anything changed for the Paris Olympics?",
      "url": "https://apnews.com/891c2dc08b59a3ccb0b15ffeca239089",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/058e6a7631554a4abcd78e331c2423c6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}