{
  "articles": [
    {
      "author": null,
      "description": "A spokesperson says parts of the Fort Stewart in southeast Georgia were locked down after an active shooter was reported on the sprawling Army post. Lt. Col. Angel Tomko told The Associated Press on Wednesday that an active shooter had been confirmed. Fort Stewart, located southwest of Savannah, is the largest Army post east of the Mississippi River. It’s home to thousands of soldiers and family members.",
      "publishedAt": "2025-08-06T15:52:12Z",
      "title": "Army base in Georgia is on lockdown after report of an active shooter, spokesperson tells AP",
      "url": "https://apnews.com/article/georgia-army-post-lockdown-shooter-0b3b2cda384d1f33d107d988e6088d92",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "The shooting of five U.S. Army soldiers at a base in Georgia is the latest in a growing list of violent incidents at American military installations over the years. Some shootings have been isolated incidents between service members. But others have been attacks on bases or mass-casualty events. A 2009 shooting at Ford Hood in Texas by an Army pyschiatrist left 13 people dead. It was the deadliest attack on a domestic military installation in U.S. history. Wednesday's shooting in Georgia occurred at Fort Stewart. Authorities said the shooter has been taken into custody. The conditions of the victims were not immediately released.",
      "publishedAt": "2025-08-06T18:35:11Z",
      "title": "Shooting of 5 soldiers in Georgia is the latest in a series of incidents at US military bases",
      "url": "https://apnews.com/article/military-bases-shootings-56b98c620ac5b12f9f9876a59da664ca",
      "urlToImage": "https://dims.apnews.com/dims4/default/4a4ec8c/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F9d%2F5e3e9a192c25b74529b8faef2991%2Fe715613dc7894458972d1292e3d368aa"
    },
    {
      "author": null,
      "description": "U.S. President Donald Trump's special envoy, Steve Witkoff, has arrived in Moscow. Russian media reported his visit on Wednesday, just days before the White House's deadline for Russia to reach a peace deal with Ukraine. If not, Moscow could face severe economic penalties. Witkoff was seen taking a stroll with Kirill Dmitriev, the Russian president's envoy for investment and economic cooperation. Moscow has not confirmed whether Witkoff will meet with President Vladimir Putin. Trump's deadline for Putin ends on Friday. Washington has threatened severe tariffs and other penalties if the conflict in Ukraine continues.",
      "publishedAt": "2025-08-06T07:04:34Z",
      "title": "Trump's envoy Witkoff arrives in Moscow ahead of Russia-Ukraine peace deadline, Russian media say",
      "url": "https://apnews.com/article/russia-ukraine-war-witkoff-moscow-trump-deadline-118b3cbcfa12d1dd9a75ce20b0b3e61e",
      "urlToImage": "https://dims.apnews.com/dims4/default/5ef638f/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F66%2Fb74bb38b98e3ad597721c9a10b20%2Ff68b934decb149e4b96ca007d93afad9"
    },
    {
      "author": null,
      "description": "Trump has signed an executive order to place an additional 25% tariff on India for its purchases of Russian oil. That brings the combined tariffs imposed by the United States on India to 50%. The tariffs would go into effect 21 days after the signing of the order Wednesday, meaning that both India and Russia might have time to negotiate with the administration on the import taxes. Trump’s move could reshape India’s economic ambitions. Many American companies have seen India as an alternative to the Chinese manufacturing that Trump had hoped to diminish through the use of tariffs.",
      "publishedAt": "2025-08-06T14:35:16Z",
      "title": "Trump to put additional 25% import taxes on India",
      "url": "https://apnews.com/article/trump-india-russia-oil-tariffs-2db9dc22d7b56624bdceb2e15c134d60",
      "urlToImage": "https://dims.apnews.com/dims4/default/da9c979/2147483647/strip/true/crop/6342x3567+0+330/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe9%2Fc7%2F1ed490edf68ab3a78323fcc22d98%2Fe38f4200ccd74e34bb5aa34e192a5574"
    },
    {
      "author": null,
      "description": "President Donald Trump says he's imposing a 100% tariff on computer chips— a move that will likely raise the cost of electronics, autos, household appliances and other essential goods. Companies making computer chips in the U.S. or planning to do so will be spared the import taxes. During the pandemic, a shortage of computer chips increased the price of autos and contributed to an increase in overall inflation.",
      "publishedAt": "2025-08-06T21:36:33Z",
      "title": "Trump says he plans to put a 100% tariff on computer chips",
      "url": "https://apnews.com/article/apple-trump-computer-tariff-c01b5ce0265b0d294dd10b8966be4436",
      "urlToImage": "https://dims.apnews.com/dims4/default/bbd1e71/2147483647/strip/true/crop/4742x2667+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F68%2F040b5b63459afdd8d537e57e43b7%2Fd7bff071ac964639ba071b6152d3af47"
    },
    {
      "author": null,
      "description": "The man accused of shooting two Israeli Embassy staff members outside a Jewish museum in Washington has been indicted on federal hate crime and murder charges. The indictment against Elias Rodriguez was unsealed Wednesday and includes nine counts, including hate crime resulting in death. It also could clear the way for the Justice Department to potentially seek the death penalty. Rodriguez is accused of killing Yaron Lischinsky and Sarah Milgrim in May, reportedly shouting “Free Palestine” during his arrest. Prosecutors say Rodriguez planned the attack, flying from Chicago with a handgun. Witnesses described him pacing outside before opening fire. He allegedly confessed inside the museum afterward.",
      "publishedAt": "2025-08-06T21:40:32Z",
      "title": "Man accused of killing Israeli Embassy staffers indicted on federal hate crimes charges",
      "url": "https://apnews.com/article/israeli-embassy-staffers-killed-justice-department-aaa313746984c6abfc41e5b6e65b5e08",
      "urlToImage": "https://dims.apnews.com/dims4/default/ce7e855/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2F4b%2F0cb19283f4b310500e09157675ba%2Fcd74bd36c3994346af2ce8e6a3a9d6ec"
    },
    {
      "author": null,
      "description": "Local health officials say at least 38 Palestinians were killed overnight and into Wednesday in the Gaza Strip while seeking aid from United Nations convoys and sites run by an Israeli-backed American contractor. The Israeli military said it had fired warning shots when crowds approached its forces. The latest deaths came as Prime Minister Benjamin Netanyahu was expected to announced further military action — and possibly plans for Israel to fully reoccupy Gaza. Experts say Israel’s ongoing military offensive and blockade are already pushing the territory of some 2 million Palestinians into famine.",
      "publishedAt": "2025-08-06T14:22:59Z",
      "title": "Dozens killed seeking aid in Gaza as Israel considers further military action",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-08-06-2025-bcdd6419be65017f97f51ab2e58d5c8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/53916e2/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Ff6%2F220a5289bfb48414d651aee2b422%2Feae90f035eca4514847cdfa30cf6e028"
    },
    {
      "author": null,
      "description": "New research from a watchdog group reveals ChatGPT can provide harmful advice to teens. The Associated Press reviewed interactions where the chatbot gave detailed plans for drug use, eating disorders, and even suicide notes. The Center for Countering Digital Hate found that testing ChatGPT with harmful prompts led the chatbot to respond in dangerous ways more than half the time. The study highlights the risks as more people, particularly teens, turn to AI for companionship and advice. OpenAI, the maker of ChatGPT, said after viewing the findings that its “work is ongoing” in refining “how models identify and respond appropriately in sensitive situations.”",
      "publishedAt": "2025-08-06T13:01:32Z",
      "title": "Watchdog: ChatGPT gives teens dangerous advice on drugs, alcohol and suicide",
      "url": "https://apnews.com/article/chatgpt-study-harmful-advice-teens-c569cddf28f1f33b36c692428c2191d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/6512377/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2F98%2Ff01a0f58cbc04b5bb688f63b9597%2Faf7c1d69e0ef4e23a78b215517c85eff"
    },
    {
      "author": null,
      "description": "Jen Pawol is set to become the first woman to umpire a game in Major League Baseball when she works games this weekend between the Miami Marlins and Atlanta Braves. Pawol will work the bases in Saturday’s doubleheader at Truist Park and the plate on Sunday, MLB said Wednesday. Pawol, a 48-year-old from New Jersey, worked spring training games in 2024 and this year. MLB’s move comes 28 years after the gender barrier for game officials was broken in the NBA, 10 years after it ended the NFL and three years after the men’s soccer World Cup employed a female referee.",
      "publishedAt": "2025-08-06T17:06:34Z",
      "title": "Jen Pawol to make history as first woman umpire in Major League Baseball",
      "url": "https://apnews.com/article/mlb-female-umpire-jen-pawol-000cf10d7d458329e89d4fa83f8cefcc",
      "urlToImage": "https://dims.apnews.com/dims4/default/2a007bb/2147483647/strip/true/crop/2755x1550+0+144/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fe6%2Fcf011ccd303eaa91ef95ccbb4216%2Fdff666da3a144d2891f9e7e886cb1a34"
    },
    {
      "author": null,
      "description": "Rescuers are scouring a devastated Himalayan village in northern India's Uttarakhand state to find missing people, a day after flash floods killed at least four and left many others trapped under debris. Teams of army and disaster force rescuers were searching for dozens, including at least 11 Indian army soldiers, who are believed to be trapped under the rubble. Officials said at least 60 people have been rescued and moved to safer locations, but adverse weather conditions, damaged roads and rugged terrain were hampering rescue efforts. Flood waters triggered by intense rains gushed down the narrow mountains into Dharali, a mountain village, on Tuesday. It swept away homes, roads and a local market.",
      "publishedAt": "2025-08-06T06:14:15Z",
      "title": "Uttarkashi flash floods: Four people killed, rescuers search for missing",
      "url": "https://apnews.com/article/india-flash-flood-cloudburst-uttarakhand-himalayan-04f67370a3774ee705d1a34cca006757",
      "urlToImage": "https://dims.apnews.com/dims4/default/45b7ee6/2147483647/strip/true/crop/1349x759+0+70/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc5%2Fe8%2F3eff52f13aec2cfa96a02cda8700%2F02ebe092274047759a0a0d78f57f2cad"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}