{
  "articles": [
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — John Eastman, the conservative attorney who pushed a plan to keep Donald Trump in power, turned himself in to authorities Tuesday on charges in the Georgia case alleging an illegal plot to overturn the former president’s 2020 election loss.",
      "publishedAt": "2023-08-22T14:09:33Z",
      "title": "Attorney John Eastman surrenders on charges in Trump's Georgia 2020 election subversion case",
      "url": "https://apnews.com/7641b5c61dbcc39ee3f0edbe51558925",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d970afd1e64f4ed0aaf6a66b2f617dcc/1920.jpeg"
    },
    {
      "author": "AUDREY McAVOY, GENE JOHNSON and JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Authorities in Hawaii pleaded Tuesday with relatives of those missing after the deadliest U.S.",
      "publishedAt": "2023-08-22T04:52:07Z",
      "title": "Hawaii officials urge families of people missing after deadly fires to give DNA samples",
      "url": "https://apnews.com/e6909a2be7860fc7f9062c886a15f979",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7445dccef52243a6b1d44e6cb702e4a0/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — After three months of crossing the desert and then watching other migrants die at sea in his failed attempt to reach Europe, Sahr John Yambasu gave up on getting across the Mediterranean and decided to go back home.",
      "publishedAt": "2023-08-23T03:02:42Z",
      "title": "Thousands of discouraged migrants are stranded in Niger because of border closures following coup",
      "url": "https://apnews.com/de1aab51732948f6a48b21f5f02aabb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a8783615a5542e0b9bf41f72deb7817/3000.jpeg"
    },
    {
      "author": "RIAZ KHAN and MUNIR AHMED",
      "description": "PESHAWAR, Pakistan (AP) — Eight people who got trapped in a disabled cable car dangling high above a valley in Pakistan returned safely to the ground Tuesday after military commandos staged a daring and delicate rescue using helicopters and a makeshift chairlift.",
      "publishedAt": "2023-08-22T08:51:49Z",
      "title": "Rescuers save 8 people trapped in cable car dangling above canyon in Pakistan",
      "url": "https://apnews.com/9028d31f14de15ba3089549f4a971286",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/613cac8dd78b4f8091561aa27d71233a/1920.jpeg"
    },
    {
      "author": "HALELUYA HADERO and MATT OTT",
      "description": "The union representing 340,000 UPS workers said Tuesday that its members voted to approve the tentative contract agreement reached last month, putting a final seal on contentious labor negotiations that threatened to disrupt package deliveries for millions of businesses and households nationwide.",
      "publishedAt": "2023-08-22T20:32:04Z",
      "title": "UPS workers approve 5-year contract, capping contentious negotiations that threatened deliveries",
      "url": "https://apnews.com/b104ca459ddb810f2018c68046d063ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/229e1ee20a20452881397555198a5cac/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Russian defenses downed Ukrainian drones in Moscow and the region around the capital early Wednesday, the defense ministry and the mayor said. No casualties were reported.Moscow Mayor Sergey Sobyanin said one drone fell into a building under construction in Moscow City, a prestigious business complex hit by drones twice before.",
      "publishedAt": "2023-08-23T02:39:57Z",
      "title": "Drones downed in Moscow and surrounding region with no casualties, Russian officials say",
      "url": "https://apnews.com/111bca81fcbb71a8aa82279d9a41a150",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44060546b7864412b17395bdd8abff86/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — Donald Trump won't be on the Republican debate stage Wednesday.",
      "publishedAt": "2023-07-30T12:03:16Z",
      "title": "Who's in, who's out, who's boycotting: The 8 candidates expected on-stage for the first GOP debate",
      "url": "https://apnews.com/863ffb85147072c4e9cf021e85d4ba1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5432c4dbe1d40e4ba900bad5ea2f303/1920.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Kazutaka Yonekura dreams of a world where everyone will have their very own digital “clone” — an online avatar that could take on some of our work and daily tasks, such as appearing in Zoom meetings in our place.",
      "publishedAt": "2023-08-23T01:04:14Z",
      "title": "Digital clones and Vocaloids may be popular in Japan. Elsewhere, they could get lost in translation",
      "url": "https://apnews.com/f86011d0fa43aa7a9b27d58768aab111",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a34981aaed94d5c915b6b11a26a6eb2/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — Mexico's government has repeatedly raised concerns with the U.S. about large buoys Texas put on the Rio Grande to deter migrants and agreements between the two countries could suffer if the floating barrier remains in place, a State Department official said in court Tuesday.",
      "publishedAt": "2023-08-22T05:30:09Z",
      "title": "Texas' floating barrier to stop migrants draws recurring concerns from Mexico, US official says",
      "url": "https://apnews.com/7006ac19f8c11723c9ce20b7f0065628",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae90cae6bc83496fad36bc9144874e23/1920.jpeg"
    },
    {
      "author": "JOHN HANNA and JIM SALTER",
      "description": "MARION, Kan. (AP) — Newly released video shows the 98-year-old mother of a Kansas newspaper publisher confronting police officers as they searched her home in a raid that has drawn national scrutiny, at one point demanding: “Get out of my house!”",
      "publishedAt": "2023-08-22T14:27:35Z",
      "title": "'Get out of my house!' Video shows 98-year-old mother of Kansas newspaper publisher upset amid raid",
      "url": "https://apnews.com/4427af3241da82767deb76028836cffd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1206f0ff47b14b70bc71b30a22550d52/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}