{
  "articles": [
    {
      "author": null,
      "description": "A massive search is stretching into its second day for a man who authorities say posed as a police officer and fatally shot a Democratic state lawmaker in her suburban Minneapolis home. Authorities say the suspect also shot and wounded a second lawmaker. Authorities have identified him as 57-year-old Vance Boelter. Melissa Hortman, a former Minnesota House Speaker, and her husband were fatally shot early Saturday in their Brooklyn Park home. The second state lawmaker, Sen. John Hoffman, and his wife were shot multiple times in nearby Champlin. Gov. Tim Walz has called it “a politically motivated assassination.” The FBI has issued a reward of up to $50,000 for information leading to Boelter's arrest and conviction.",
      "publishedAt": "2025-06-15T04:02:22Z",
      "title": "Authorities still searching for suspect in shooting of 2 Minnesota state lawmakers",
      "url": "https://apnews.com/article/minnesota-lawmakers-shot-8ce70a94c9eb90688baaa1a71faef6cc",
      "urlToImage": "https://dims.apnews.com/dims4/default/7110fa9/2147483647/strip/true/crop/2781x1564+0+145/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F76%2F42e5c295dbd8e15f27ad47e31f10%2F757ac56de9114bbc9bd6b0411b1327a9"
    },
    {
      "author": null,
      "description": "The attacks on two Democratic Minnesota state lawmakers at home are the latest in a grim and alarming spike in political violence. One lawmaker and her husband were killed while a second one and his wife were gravely wounded. Those attacks follow the firebombing of a march in Colorado calling for the release of hostages in Gaza, the killing of two Israeli embassy workers in Washington, D.C., and the firebombing of the Pennsylvania governor's mansion. And that's just in the past two months. Before that came the attempted assassination of Donald Trump during the presidential campaign, the attack on former House Speaker Nancy Pelosi's husband and a shooting at a Republican congressional baseball practice.",
      "publishedAt": "2025-06-14T22:50:37Z",
      "title": "Political violence is threaded through recent US history",
      "url": "https://apnews.com/article/political-violence-assassination-minnesota-trump-3c750cff0749633872ab6101bfa23b23",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4ef238/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F0c%2Fa365fa9b3c85441714594ee07ca8%2F18324da4e6584d8e96e4bd2326976159"
    },
    {
      "author": null,
      "description": "Lawmakers are still reeling from the shooting that killed one Minnesota state legislator and her husband and severely wounded another and his wife. Even as authorities searched for the suspect in the shooting, the state's two U.S. Senators noted the attack was one of an increasing examples of political violence. Sen. Tina Smith said she was contemplating the previously unthinkable notion of regular security guards. Sen. Amy Klobuchar said people need to remember that politicians are human beings.",
      "publishedAt": "2025-06-15T17:06:38Z",
      "title": "Minnesota Democrat Tina Smith contemplates more security after shooting",
      "url": "https://apnews.com/article/minnesota-shooting-tina-smith-amy-klobuchar-6fada373a3d089466b1be4aaf9371983",
      "urlToImage": "https://dims.apnews.com/dims4/default/f5e8d6c/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2Fd1%2Fca9a1c37493466357e68af0fe3f6%2F8781e5b7258740de91d4f64404fb0fe4"
    },
    {
      "author": null,
      "description": "Israel unleashed airstrikes across Iran for a third day and threatened even greater force as some Iranian missiles evaded Israeli air defenses to strike buildings in the heart of the country. Planned talks on Iran’s nuclear program, which could provide an off-ramp, were called off. The region braced for a protracted conflict after Israel’s surprise bombardment of Iran’s nuclear and military sites on Friday killed several top generals and nuclear scientists, and neither side showed any sign of backing down. Israel reportedly targeted a gas installation, raising the prospect of a broader assault on Iran’s heavily-sanctioned energy industry that could affect global markets.",
      "publishedAt": "2025-06-15T06:33:06Z",
      "title": "Israel and Iran trade strikes for a third day as nuclear talks are called off",
      "url": "https://apnews.com/article/israel-iran-mideast-war-news-06-15-2025-d7e902fda4933aa1b0a30d901d4ff479",
      "urlToImage": "https://dims.apnews.com/dims4/default/d28814d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fc3%2F0a37559187a1b3adec7617fd4aba%2F9de9ac237ac84c6eadf64301b36cd96e"
    },
    {
      "author": null,
      "description": "President Donald Trump is issuing a stark warning to Iran against retaliating against U.S. targets in the Middle East while also predicting Israel and Iran would “soon” make a deal to end their escalating conflict. Trump in an early morning social media posting on Sunday said the United States “had nothing to do with the attack on Iran” as Israel and Iran traded missile attacks for the third straight day. Iran has said it would hold the U.S., which has provided Israel with much of its deep arsenal of weaponry, for its backing of Israel. Trump on Sunday also predicted Israel and Iran “will make a deal” and touted his track record as a global peacemaker.",
      "publishedAt": "2025-06-15T15:36:43Z",
      "title": "Trump believes Israel-Iran may come to deal 'soon' and warns Tehran against retaliating against US",
      "url": "https://apnews.com/article/trump-iran-israel-attack-43e3b1ce47d12477ae4533c941386b75",
      "urlToImage": "https://dims.apnews.com/dims4/default/78c154c/2147483647/strip/true/crop/4360x2453+0+227/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Ff9%2F6fb6907d68593f33e8cb2966f7d5%2Fd0cd87fed1c340fd849d348b6a772b52"
    },
    {
      "author": null,
      "description": "Indian authorities have started handing over remains of the victims of one of India’s worst aviation disasters after identifying some through DNA tests. The Air India flight crashed shortly after takeoff Thursday and killed at least 270 people, including 29 on the ground, in the northwestern city of Ahmedabad. One passenger survived. Hundreds of relatives of the crash victims have provided DNA samples at the hospital. Most of the bodies were charred or mutilated, making them unrecognizable.",
      "publishedAt": "2025-06-15T10:23:05Z",
      "title": "Authorities start handing remains of Air India crash victims over to relatives",
      "url": "https://apnews.com/article/air-india-plane-crash-boeing-dna-test-b44556b7c0e9e04adcece615262e439e",
      "urlToImage": "https://dims.apnews.com/dims4/default/dabb67c/2147483647/strip/true/crop/6566x3693+0+342/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F22%2F873a9f7fad53276cd505c0b4348f%2F453f7dcc15d743878e4ede71f84f5645"
    },
    {
      "author": null,
      "description": "Leaders of some of the world’s biggest economic powers arrive in the Canadian Rockies for a Group of Seven summit that's been shadowed by an escalating conflict between Israel and Iran and U.S. President Donald Trump’s unresolved trade war. Israel’s strikes on Iran and Tehran’s retaliation appeared to catch many world leaders unawares. Canadian Prime Minister Mark Carney has decided to abandon the annual practice of issuing a joint statement. With other leaders wanting to talk to Trump in an effort to talk him out of slapping tariffs, the summit risks being a series of bilateral conversations rather than a show of unity.",
      "publishedAt": "2025-06-15T04:00:54Z",
      "title": "G7 leaders gather for summit in shadow of Israel-Iran crisis and trade wars",
      "url": "https://apnews.com/article/g7-summit-canada-trump-iran-b98aad10779d9af5456c1a6553ffe59b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4e0115/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2F68%2Fd8973540f551b2357739f3ced04a%2F6ccbd9c2210f4fd4abb2f7d9b003a099"
    },
    {
      "author": null,
      "description": "The Trump administration's Justice Department has begun targeting Democratic and presidential swing states with demands for election data or changes to voter registration procedures. While the requests may seem technical and mundane, collectively they suggest the department is moving away from its traditional stance of protecting access to the ballot box. Instead, the actions address concerns that have been raised by a host of conservative activists following years of false claims surrounding elections in the U.S. By targeting certain states — presidential battlegrounds or those controlled by Democrats — they also could be foreshadowing an expanded role for the department in future elections.",
      "publishedAt": "2025-06-15T12:10:39Z",
      "title": "Justice Department's early moves on voting and elections signal a shift from its traditional role",
      "url": "https://apnews.com/article/trump-justice-department-voting-elections-democrats-efa955a7785fdaddbf6d28956d1072ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7355ce/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2Fbb%2Fbabec819c174920446911febf870%2F4b066ead5054418695a3a1ec09113af1"
    },
    {
      "author": null,
      "description": "Not one suspect imprisoned in Haiti has faced trial after being accused in the killing of President Jovenel Moïse, who was gunned down at his home in Port-au-Prince nearly four years ago. Gang violence, death threats and a crumbling judicial system have held up an ongoing investigation defined by outbursts and tense exchanges between suspects and judges. Six Haitian judges are investigating whether there is enough evidence to warrant a trial for 20 suspects. While the case in Haiti has stalled, the U.S. has charged 11 extradited suspects, with five already pleading guilty to conspiring to kill Moïse.",
      "publishedAt": "2025-06-15T04:01:08Z",
      "title": "Probe into who killed Haiti's president drags on 4 years later",
      "url": "https://apnews.com/article/haiti-president-killed-moise-investigation-court-judge-3292934f132e2da95a72b147c33550c9",
      "urlToImage": "https://dims.apnews.com/dims4/default/3aeb4c6/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F54%2Feba4a4706ccc39a6902d58a1666c%2F6f83c0bc6b994d368f64ab957586eb7f"
    },
    {
      "author": null,
      "description": "A growing number of Spaniards are souring on the country's highly successful tourism industry which is being blamed for a stubborn housing crisis. Many people believe that the proliferation of apartments rented for days to tourists reduces the supply of housing for residents while driving up prices. Anger is growing, and spreading: anti-tourism protests are being planned on Sunday across Spain, Portugal and Italy. In Spain, authorities are trying their best to placate residents while protecting an industry that provides 12% of its economic growth. Barcelona has pledged to close all of the city's 10,000 tourist apartments by 2028 and national authorities are cracking down on Airbnb.",
      "publishedAt": "2025-06-15T05:01:27Z",
      "title": "Spaniards sour on tourism industry amid housing crunch",
      "url": "https://apnews.com/article/spain-tourism-housing-airbnb-protest-46250dd17afbfcd270e4f951865ae667",
      "urlToImage": "https://dims.apnews.com/dims4/default/6eb5c0e/2147483647/strip/true/crop/5120x2880+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F9b%2F6398dc1a48f414c9958f0ddbbc3d%2Fd64001ee22fc4763a8ba8ff140b18fae"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}