{
  "articles": [
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Former Rep. Matt Gaetz said Friday that he will not be returning to Congress after withdrawing his name from consideration to be attorney general under President-elect Donald Trump amid growing allegations of sexual misconduct.",
      "publishedAt": "2024-11-22T18:34:39Z",
      "title": "Matt Gaetz says he won't return to Congress next year after withdrawing name for attorney general",
      "url": "https://apnews.com/9718a3de53c1e3436a52a14a8e17775a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddec7036414d46b7aec0ca9c8d5f9039/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — After several weeks working mostly behind closed doors, Vice President-elect JD Vance returned to Capitol Hill this week in a new, more visible role: Helping Donald Trump try to get his most contentious Cabinet picks to confirmation in the Senate, where Vance has served for the last two years.",
      "publishedAt": "2024-11-22T17:26:49Z",
      "title": "Vance takes on a more visible transition role, working to boost Trump's most contentious picks",
      "url": "https://apnews.com/904e652215323702727304f4905eb861",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0afc944307ae4e6682f6099c87c73b4b/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "A social-media tribute to Coptic Christians. A billboard in Amish country. A visit to a revered Jewish gravesite. While Donald Trump's lock on the white evangelical vote is legendary, he and his campaign allies also wooed smaller religious groups, far from the mainstream.",
      "publishedAt": "2024-11-22T13:12:18Z",
      "title": "Beyond evangelicals, Trump and his allies courted smaller faith groups, from the Amish to Chabad",
      "url": "https://apnews.com/eee11dc29462ea9051bb4086c571dd1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05f41056e5e448c697cb9e3ec90eb484/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and VOLODYMYR YURCHUK",
      "description": "KYIV, Ukraine (AP) — NATO and Ukraine will hold emergency talks Tuesday after Russia attacked a central city with an experimental, hypersonic ballistic missile that escalated the nearly 33-month-old war.",
      "publishedAt": "2024-11-22T10:30:56Z",
      "title": "NATO and Ukraine to hold emergency talks after Russia's attack with new hypersonic missile",
      "url": "https://apnews.com/d374dc8ca0fa626e674d29df01ce95cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19aa4299c4fb4b369dbd2c1b32786652/1920.jpeg"
    },
    {
      "author": "NADIA LATHAN and KENDRIA LAFLEUR",
      "description": "AUSTIN, Texas (AP) — Texas’ education board voted Friday to allow Bible-infused teachings in elementary schools under optional new curriculum that could test boundaries between religion and public classrooms in the U.S.",
      "publishedAt": "2024-11-22T05:07:37Z",
      "title": "Texas education board approves optional Bible-infused curriculum for elementary schools",
      "url": "https://apnews.com/52b74577982b34ce2607b693bd51cae7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0343e8efafa4417ad4cb19b06944e3b/1920.jpeg"
    },
    {
      "author": "MARK VANCLEAVE and MICHAEL GOLDBERG",
      "description": "FERGUS FALLS, Minn. (AP) — A jury convicted two men on Friday of charges related to human smuggling for their roles in an international operation that led to the deaths of a family of Indian migrants who froze while trying to cross the Canada-U.S.",
      "publishedAt": "2024-11-22T18:11:01Z",
      "title": "2 convicted in human smuggling case after Indian family froze to death on US-Canada border",
      "url": "https://apnews.com/de2f999332e6cc8be1ea78c7fdfb6590",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/14cdd510ef934059bd46ab1cce829aa4/3000.jpeg"
    },
    {
      "author": "NOAH BERGER and OLGA R. RODRIGUEZ",
      "description": "HEALDSBURG, Calif. (AP) — Heavy rain from a major storm prompted evacuation warnings for communities near a Northern California river that was flooding Friday, as the system continued to dump heavy snow in mountainous areas where some ski resorts opened for the season.",
      "publishedAt": "2024-11-22T13:40:32Z",
      "title": "Storm inundates Northern California with rain, heavy snow. Thousands remain in the dark in Seattle",
      "url": "https://apnews.com/590bac4e27f5ef91f3580561625d0f24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92a9a1d9432a470aabdff31c1459bb65/3000.jpeg"
    },
    {
      "author": "CHRISTINA LARSON",
      "description": "WASHINGTON (AP) — Long before the ancient Maya built temples, their predecessors were already altering the landscape of Central America’s Yucatan peninsula.",
      "publishedAt": "2024-11-22T19:02:55Z",
      "title": "Archaeologists discover 4,000-year-old canals used to fish by predecessors of ancient Maya",
      "url": "https://apnews.com/ebec21901049b634ab910d8190cf89ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b0a4933318c4653b12074f31cacae8c/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE and JONEL ALECCIA",
      "description": "Health officials on Friday confirmed bird flu in a California child — the first reported case in a U.S. minor.The child had mild symptoms, was treated with antiviral medication and is recovering, the Centers for Disease Control and Prevention said in announcing the test results.",
      "publishedAt": "2024-11-22T19:27:50Z",
      "title": "California case is the first confirmed bird flu infection in a US child",
      "url": "https://apnews.com/6798cd1e2f33067d5b7082b7d34a81a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64db3d93b24c463fa648bb5a286e2c25/2579.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA and MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — Brazil’s federal police on Thursday formally accused former President Jair Bolsonaro and 36 other people of attempting a coup to keep him in office after his defeat in the 2022 elections.",
      "publishedAt": "2024-11-21T18:39:36Z",
      "title": "Brazilian police formally accuse former President Bolsonaro and aides of alleged 2022 coup attempt",
      "url": "https://apnews.com/0d62fe0a7399483aee48cf3c845560ea",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/084ac4709d8c4185b17b7651625390e2/2698.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}