{
  "articles": [
    {
      "author": "LORI HINNANT, ILLIA NOVIKOV and DMYTRO ZHYHINAS",
      "description": "KYIV, Ukraine (AP) — The clock on her wall stopped almost as soon as the day began, its hands frozen by the Russian bomb that hit the dormitory serving as home for Ukrainians displaced by war.",
      "publishedAt": "2024-11-19T05:09:58Z",
      "title": "1,000 days of war in Ukraine, distilled in a single 24-hour span of violence and resilience",
      "url": "https://apnews.com/ade5a60cf2345d694871f85df162d08a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66b33821ed50475f8e3178d7fc779fbe/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "President Vladimir Putin on Tuesday signed a revised nuclear doctrine declaring that a conventional attack on Russia by any nation that is supported by a nuclear power will be considered a joint attack on his country.",
      "publishedAt": "2024-11-19T09:11:50Z",
      "title": "Putin signs new Russian nuclear doctrine after Biden's arms decision for Ukraine",
      "url": "https://apnews.com/91f20e0c9b0f9e5eaa3ed97c35789898",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7a11abc8f6e64245b2abfe6e4ab80745/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB, WAFAA SHURAFA and FATMA KHALED",
      "description": "BEIRUT (AP) — A United States envoy returned to Beirut on Tuesday, where Lebanese officials have tentatively welcomed a proposal for an Israel-Hezbollah cease-fire. There was no such optimism in the Gaza Strip, where the looting of nearly 100 aid trucks by armed men worsened an already severe food crisis.",
      "publishedAt": "2024-11-19T09:34:36Z",
      "title": "US envoy pushes for cease-fire in Lebanon as food crisis worsens after looting in Gaza",
      "url": "https://apnews.com/a76670f9373598edd964139280eba60c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9603b7b44c9541a6b086c21f2d1b010a/1920.jpeg"
    },
    {
      "author": "KANIS LEUNG and ZEN SOO",
      "description": "HONG KONG (AP) — Forty-five ex-lawmakers and activists were sentenced to four to 10 years in prison Tuesday in Hong Kong’s biggest national security case under a Beijing-imposed law that crushed a once-thriving pro-democracy movement.",
      "publishedAt": "2024-11-19T01:23:49Z",
      "title": "45 pro-democracy activists get 4 to 10 years in prison in Hong Kong's biggest national security case",
      "url": "https://apnews.com/1ed13be76fa4918d83f7d3e498f2f543",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/52f25bfbc06e467d9bfbee9ddad32f69/3000.jpeg"
    },
    {
      "author": "CHARLOTTE GRAHAM-McLAY",
      "description": "WELLINGTON, New Zealand (AP) — As tens of thousands crowded the streets in New Zealand’s capital, Wellington, on Tuesday, the throng of people, flags aloft, had the air of a festival or a parade rather than a protest.",
      "publishedAt": "2024-11-19T03:30:48Z",
      "title": "Tens of thousands crowd New Zealand's Parliament grounds in support of Māori rights",
      "url": "https://apnews.com/54d5a5345815bed2c2a12687d4f6b625",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e22999eacc041d4ada26c35f3b10d72/3000.jpeg"
    },
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — Donald Trump's first stint in the White House proved to be a chaotic ride for the District of Columbia. Now with Trump set to return to power — backed by a Republican-controlled Congress and the momentum of a sweeping electoral win — local officials in the nation's capital are trying to sound conciliatory while preparing for the worst.",
      "publishedAt": "2024-11-19T05:11:33Z",
      "title": "Local Washington officials brace for four years of playing defense against Trump",
      "url": "https://apnews.com/6c6a8a9a61ecfd596f862769344c2f3d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bbbe9e9fa3d4b9e9b119ddb767a400e/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE and DARLENE SUPERVILLE",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump said Monday he is naming former Wisconsin Rep. Sean Duffy as his nominee for transportation secretary, as he continues to roll out picks for his Cabinet.",
      "publishedAt": "2024-11-18T23:08:42Z",
      "title": "Trump says he is naming former Wisconsin Rep. Sean Duffy to be transportation secretary",
      "url": "https://apnews.com/c465bbc516b5f898233f86bee31a7a45",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07303ec99e7c4022b871af281c8bd385/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE, ELÉONORE HUGHES and DAVID BILLER",
      "description": "RIO DE JANEIRO (AP) — Leaders of the world's 20 major economies called for a global pact to combat hunger, more aid for war-torn Gaza and an end to hostilities in the Mideast and Ukraine, issuing a joint declaration Monday that was heavy on generalities but short of details on how to accomplish those goals.",
      "publishedAt": "2024-11-19T04:28:31Z",
      "title": "G20 summit calls for more aid to Gaza and an end to the war in Ukraine",
      "url": "https://apnews.com/bb4f4ece63832580498d5829199c67b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/20b090b8a9514097bcc2cec4119488de/3000.jpeg"
    },
    {
      "author": "TARA COPP, KEVIN VINEYS and AARON KESSLER",
      "description": "CANNON AIR FORCE BASE, N.M. (AP) — Over a New Mexico training range named the Hornet, two Osprey aircraft speed 100 feet off the ground, banking hard over valleys and hills as they close in on a dusty landing zone.",
      "publishedAt": "2024-11-19T05:04:12Z",
      "title": "The Osprey's safety issues spiked over five years and caused deaths. Pilots still want to fly it",
      "url": "https://apnews.com/376bfa13622fb1caafea576164a1f761",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cb251e64eb84d978c14b01c8e911ffa/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN and SIBI ARASU",
      "description": "BAKU, Azerbaijan (AP) — Just as a simple lever can move heavy objects, rich nations are hoping another kind of leverage — the financial sort — can help them come up with the money that poorer nations need to cope with climate change.",
      "publishedAt": "2024-11-19T05:57:40Z",
      "title": "Big money to respond to climate change is key to UN talks in Baku. How can nations raise it?",
      "url": "https://apnews.com/5704a4c4c724b757446f484d03f14425",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/516de6978b9949f9b9142a3013d0c90c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}