{
  "articles": [
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — In a singular moment for American history, the hush money trial of former President Donald Trump begins Monday with jury selection.",
      "publishedAt": "2024-04-15T04:04:39Z",
      "title": "Trump's history-making hush money trial starts Monday with jury selection",
      "url": "https://apnews.com/8da8759352478be8effd3d5734aae35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b874c832e96d43678c3aeada43abb26a/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "World leaders are urging Israel not to retaliate after Iran launched an attack involving hundreds of drones, ballistic missiles and cruise missiles.British Foreign Secretary David Cameron told the BBC on Monday the U.K.",
      "publishedAt": "2024-04-15T09:39:33Z",
      "title": "The Latest | World leaders urge Israel not to retaliate for the Iranian drone and missile attack",
      "url": "https://apnews.com/05ca1ac2780defa8a1a0345754708512",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f45d40737743437294b3b4b8bc72700a/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military renewed warnings on Monday for Palestinians in Gaza not to return to the embattled territory’s north, a day after Gaza hospital officials said five people were killed as throngs of displaced residents tried to reach their homes in the war-torn area.",
      "publishedAt": "2024-04-15T10:20:35Z",
      "title": "Israeli military renews warnings to Palestinians not to return to war-torn northern Gaza",
      "url": "https://apnews.com/5d6b5dc1483771045113eea2c1904449",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bd5239ff7474bc6b2029db96a61a86f/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and QASSIM ABDUL-ZAHRA",
      "description": "WASHINGTON (AP) — President Joe Biden is set to host Iraq’s leader this week for talks that come as tensions across the Middle East have soared over the war in Gaza and Iran's unprecedented weekend attack on Israel in retaliation for an Israeli military strike against an Iranian facility in Syria.",
      "publishedAt": "2024-04-15T04:10:14Z",
      "title": "Biden to host Iraqi leader as Mideast tensions soar, raising more questions about US troop presence",
      "url": "https://apnews.com/ee56b6caa34a0c5054ed015ce6a410dd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91d3a90e6d9f4fef9a85181ee2bfdad8/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and JILL COLVIN",
      "description": "WASHINGTON (AP) — Tax Day reveals a major split in how Joe Biden and Donald Trump would govern: The presidential candidates have conflicting ideas about how much to reveal about their own finances and the best ways to boost the economy through tax policy.",
      "publishedAt": "2024-04-15T04:05:42Z",
      "title": "Tax Day reveals a major split in how Joe Biden and Donald Trump would govern",
      "url": "https://apnews.com/55d3031de64251169eb247f52430618d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bf357b87cc94bb19f3b90dbd7967758/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — On this Tax Day, the IRS is promoting the customer service improvements the agency rolled out since receiving tens of billions in new funding dollars through Democrats' Inflation Reduction Act.",
      "publishedAt": "2024-04-15T09:01:20Z",
      "title": "The IRS is quicker to answer the phone on this Tax Day",
      "url": "https://apnews.com/dee7ae01dc6061697412a2571d406843",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0946fa72a5f94096a6251117d0a24f83/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — As Union and Confederate armies clashed in a bloody fourth year of the Civil War, President Abraham Lincoln tasked one man to create the legal code for Arizona, almost 50 years before the territory became a state.",
      "publishedAt": "2024-04-15T04:08:39Z",
      "title": "The Civil War raged and fortune-seekers hunted for gold. This era produced Arizona's abortion ban",
      "url": "https://apnews.com/cf6598d4384fa35a4e073dfae3a844f2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a841d9e3deab4e90a86cc8a33a78f6b5/3000.jpeg"
    },
    {
      "author": "AIJAZ HUSSAIN and SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — Indian Prime Minister Narendra Modi and his government are increasingly wielding strong-arm tactics to subdue political opponents and critics of the ruling Hindu-nationalist party ahead of the nationwide elections that begin this week.",
      "publishedAt": "2024-04-15T04:17:00Z",
      "title": "In Modi's India, opponents and journalists feel the squeeze ahead of election",
      "url": "https://apnews.com/8f22465a6f0f021d43105a06a71d7840",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e8665e6bf8d449581c5ab570cc4f505/3000.jpeg"
    },
    {
      "author": "SAMUEL PETREQUIN",
      "description": "French President Emmanuel Macron on Monday said the opening ceremony for the Paris Olympics planned on the River Seine could be shifted instead to the Stade de France if the security threat is deemed too high.",
      "publishedAt": "2024-04-15T07:36:48Z",
      "title": "Macron says the Olympic opening ceremony on the Seine could be moved to stadium for security reasons",
      "url": "https://apnews.com/64f108046459499da0a3f50b571dfc17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/712d3c4213fb41a3951b41735f7ea5e5/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA and LINLEY SANDERS",
      "description": "NEW YORK (AP) — If you're feeling — YAWN — sleepy or tired while you read this and wish you could get some more shut-eye, you're not alone. A majority of Americans say they would feel better if they could have more sleep, according to a new poll.",
      "publishedAt": "2024-04-15T08:00:31Z",
      "title": "Are Americans feeling like they get enough sleep? Dream on, a new Gallup poll says",
      "url": "https://apnews.com/2111be46f0b03e0455124d1733659327",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ae646f0077f4d839ef38a1c08f1a45a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}