{
  "articles": [
    {
      "author": "DAVID KOENIG and MANUEL VALDES",
      "description": "SEATTLE (AP) — Machinists at Boeing voted Thursday to go on strike, another setback for the giant aircraft maker whose reputation and finances have been battered and now faces a shutdown in production of its best-selling airline planes.",
      "publishedAt": "2024-09-12T04:06:19Z",
      "title": "Boeing machinists vote to strike after rejecting pay increases of 25% over 4 years",
      "url": "https://apnews.com/12d008c0127bab57f8cc9941f48e3ac6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f49f7b94ac314e4c8eb3ed28f90fbe35/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and COLLEEN LONG",
      "description": "LOS ANGELES (AP) — Former President Donald Trump will campaign Friday in Western states as his opponent, Vice President Kamala Harris keeps her focus on one of the biggest battleground prizes in the East, Pennsylvania.",
      "publishedAt": "2024-09-13T04:06:06Z",
      "title": "Trump campaigns in Western states as Harris focuses on critical Pennsylvania",
      "url": "https://apnews.com/4d01558e10a3cbf9bd8b921971e03de2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39db3d88f80142f6a464acc46ff306ba/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korea offered a rare glimpse into a secretive facility to produce weapons-grade uranium as state media reported Friday that leader Kim Jong Un visited the area and called for stronger efforts to “exponentially” increase the number of his nuclear weapons.",
      "publishedAt": "2024-09-13T01:04:51Z",
      "title": "North Korea discloses a uranium enrichment facility as Kim calls for more nuclear weapons",
      "url": "https://apnews.com/feedc5606c455a94fcee67fa50e1236d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1099d3451d34b5ca53009a0f6f32a69/1920.jpeg"
    },
    {
      "author": null,
      "description": "HANOI, Vietnam (AP) — The death toll in the aftermath of a typhoon in Vietnam climbed to 233 on Friday as rescue workers recovered more bodies from areas hit by landslides and flash floods, state media reported.",
      "publishedAt": "2024-09-13T04:41:08Z",
      "title": "Vietnam typhoon death toll rises to 233 as more bodies found in areas hit by landslides and floods",
      "url": "https://apnews.com/95c5de93c84e636c32f2a875c77db0fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0e3ac5cbf1049eca884bd0cc67ba759/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — U.S. President Joe Biden and British Prime Minister Keir Starmer are meeting Friday amid an intensified push by Ukraine to loosen restrictions on using weapons provided by the U.S.",
      "publishedAt": "2024-09-13T04:03:12Z",
      "title": "The US and British leaders will talk about Ukraine's push to ease weapons restrictions",
      "url": "https://apnews.com/8fec11abca0245d92a03291ab2d6b3fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7c5391d67a54b43b262146a7c645dbe/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — Even as she promoted her efforts to boost clean energy, Vice President Kamala Harris said in Tuesday's debate that the Biden-Harris administration has overseen “the largest increase in domestic oil production in history because of an approach that recognizes that we cannot over rely on foreign oil.″",
      "publishedAt": "2024-09-13T04:02:25Z",
      "title": "Former drilling foe Harris now says she supports it. 'Sprint to the middle' or climate betrayal?",
      "url": "https://apnews.com/1b86dfb4297facd0b89c487724a9e5b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da8ea37e7ffe43e6a7c03a5872d81558/3000.jpeg"
    },
    {
      "author": "RENATA BRITO",
      "description": "BARCELONA, Spain (AP) — Unauthorized migration to European Union countries dropped significantly overall in the first eight months of this year, even as political rhetoric and violence against migrants increased and far-right parties espousing anti-immigration policies made gains at the polls.",
      "publishedAt": "2024-09-13T04:33:34Z",
      "title": "Unauthorized migration into the EU declined despite heated politics",
      "url": "https://apnews.com/0d5b29dbca615e323b01a10baaea6fb3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e59bd2bdc960469c87716a17fa0d3c60/3000.jpeg"
    },
    {
      "author": "JACK BROOK and SARA CLINE",
      "description": "DULAC, La. (AP) — Shortly after Hurricane Francine's storm surge flooded a cemetery in the Louisiana bayou town of Dulac, Lori-Ann Bergeron arrived Thursday to check on three generations of family graves.",
      "publishedAt": "2024-09-13T04:16:56Z",
      "title": "Gulf Coast residents still reeling from Hurricane Ida clean up mess left by Francine",
      "url": "https://apnews.com/6a14c9947a393e497ca63b15d0518cee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06e4a5760cc14f40b22eebde80489237/1920.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "BANGKOK (AP) — Pope Francis has wrapped up his longest and most challenging trip ever, which took the 87-year-old pontiff more than 32,000 kilometers (20,000 miles) by air to four countries in the Asia-Pacific from Sept.",
      "publishedAt": "2024-09-13T05:32:52Z",
      "title": "AP PHOTOS: Pope Francis concludes Asia-Pacific visit to 4 countries in his longest trip ever",
      "url": "https://apnews.com/7509ab7a625fc63d951c05ce5b67a133",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a562756d973446d783a5ac5ec47e6c35/3000.jpeg"
    },
    {
      "author": "ELÉONORE HUGHES",
      "description": "RIO DE JANEIRO (AP) — Indigenous chants and the rattle of maracas resounded Thursday in a Rio de Janeiro park, where Brazil's Tupinambá people gathered to celebrate the homecoming of a sacred cloak absent for some 380 years.",
      "publishedAt": "2024-09-13T00:03:03Z",
      "title": "Brazil Indigenous group hails a sacred cloak's homecoming after centuries in Europe",
      "url": "https://apnews.com/6fbf5074e4b332b4a795e94ed44064b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8f23e30ae7d74cde9b161691cd94ebc6/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}