{
  "articles": [
    {
      "author": "Chris Megerian, Farnoush Amiri",
      "description": "President Donald Trump is again banning people from countries his administration deems dangerous from coming to America. The travel ban issued Wednesday is a repeat of an order of his first administration that led to widespread confusion at airports. This version includes Afghanistan, Burma, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. The Republican president’s first travel ban was issued in 2017 and banned travel to the U.S. by citizens of seven predominantly Muslim countries. After legal challenges, the order was retooled until a version was upheld by the Supreme Court in 2018. Trump has said the initial ban was aimed at protecting the country.",
      "publishedAt": "2025-06-04T23:52:57Z",
      "title": "Trump announces travel ban affecting a dozen countries set to go into effect Monday",
      "url": "https://apnews.com/article/trump-travel-ban-adeaec442cb0f00f4f8a34d208118445",
      "urlToImage": "https://dims.apnews.com/dims4/default/c3a24eb/2147483647/strip/true/crop/4228x2378+0+220/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F56%2F93656c591b5f21b0b81df4d87365%2F868792d3b05b4a26be43dc920cccd18d"
    },
    {
      "author": null,
      "description": "At least five people, including a one-year-old child, were killed in a Russian drone strike on the northern Ukrainian city of Pryluky overnight, regional governor Viacheslav Chaus said Thursday. Six more people were wounded in the attack and have been hospitalized, Chaus said. According to him, six Shahed-type drones struck residential areas of Pryluky early Thursday morning, causing severe damage to residential buildings. Hours later, seventeen people were wounded in a Russian drone strike on the eastern Ukrainian city of Kharkiv early Thursday, including children, a pregnant woman, and a 93-year-old woman, regional head Oleh Syniehubov wrote on Telegram.",
      "publishedAt": "2025-06-05T05:50:33Z",
      "title": "Russian strike kills 5, including 1 year old, hours after Trump calls Putin",
      "url": "https://apnews.com/article/russia-ukraine-war-strikes-trump-putin-950b9b293dfb53b0da938275e5f3f3a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/7d356c6/2147483647/strip/true/crop/2500x1406+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F08%2Fb7f5cd4f8675a3c34b26fa81c483%2Febfeb1e04afc4a03a7f9cb9bffa8f07a"
    },
    {
      "author": "Melanie Lidman, Natalie Melzer",
      "description": "Israel says it has recovered the bodies of two hostages taken in Hamas’ Oct. 7, 2023, attack that ignited the war in the Gaza Strip. Prime Minister Benjamin Netanyahu said in a statement Thursday that the bodies of Judih Weinstein and Gad Haggai had been recovered and returned to Israel. Weinstein and Haggai, both in their early 70s, were talking a morning walk near their kibbutz when they were abducted. They were survived by four children and seven grandchildren.",
      "publishedAt": "2025-06-05T06:44:08Z",
      "title": "Israel says it has recovered the bodies of 2 hostages from the Gaza Strip",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostages-06-05-2025-017ad072824c251a570852a8a2ca374b",
      "urlToImage": "https://dims.apnews.com/dims4/default/83be630/2147483647/strip/true/crop/7971x4484+0+415/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F3a%2F9a39579a5631a3cea6b2bb457f03%2F31a704aec6ad4436a766654caad607ad"
    },
    {
      "author": "Matt Brown",
      "description": "The House Oversight Committee is requesting interviews with members of former President Joe Biden’s innermost circle. Oversight Chairman James Comer of Kentucky requested transcribed interviews with five former Biden aides, alleging that they had participated in a cover-up. The requests come after committee Comer requested interviews with Biden's physician and four other senior aides. The Republican inquiry so far has focused on the final moves of Biden’s administration, which they claim may be invalid. Comer a new book that details concerns and debates inside the White House and Democratic Party over Biden’s mental state and age. Biden and members of his family have vigorously denied the book’s claims.",
      "publishedAt": "2025-06-04T22:03:22Z",
      "title": "House panel expands inquiry into Biden's health in office",
      "url": "https://apnews.com/article/joe-biden-investigation-autopen-james-comer-ae7013baea1f3da5417d02a6e83811ec",
      "urlToImage": "https://dims.apnews.com/dims4/default/89924ea/2147483647/strip/true/crop/3858x2170+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2Fe3%2F33bdb8c8dfd1b6a6109a7f799882%2Fce80bcd0e138401f935d89e1d3ce1fc4"
    },
    {
      "author": "Hanna Arhirova, Michelle L. Price",
      "description": "President Donald Trump said Russian President Vladimir Putin told him “very strongly” in a phone call Wednesday that he will respond to Ukraine’s weekend drone attack on Russian airfields. The president said in a social media post that “It was a good conversation, but not a conversation that will lead to immediate Peace.” The call that lasted for an hour and 15 minutes was Trump’s first known with Putin since May 19. Trump said he and Putin also discussed Iran’s nuclear program.",
      "publishedAt": "2025-06-04T14:30:58Z",
      "title": "Trump says Putin told him that Russia will respond to Ukrainian attack",
      "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-truce-peace-b211da51905cd117b913bc0fac658de3",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c85c3e/2147483647/strip/true/crop/8214x4620+0+428/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2Ff2%2Fc2b54242de9431efbebeb6b743a4%2F5e233c2ecc9c496ca2f9091939454b46"
    },
    {
      "author": "Lorne Cook",
      "description": "NATO defense ministers are set to approve plans to buy more weapons and military equipment to better defend Europe, the Arctic and North Atlantic. The “capability targets” are assigned to each of the 32 member countries and are part of a U.S. push to ramp up security spending. Priority purchases include air and missile defense systems, artillery, ammunition, drones and “strategic enablers” like air-to-air refueling, heavy air transport and logistics. NATO Secretary-General Mark Rutte said Thursday that the targets help fill “the gaps we have, not only to be able to defend ourselves today, but also three, five, seven years from now.\" U.S. Defense Secretary Pete Hegseth says that “to be an alliance, you’ve got to be more than flags.\"",
      "publishedAt": "2025-06-05T06:55:29Z",
      "title": "NATO is set to approve new military purchases as part of a major defense spending hike",
      "url": "https://apnews.com/article/nato-capability-targets-plans-defense-spending-trump-b123977c8f3c1bce277fb1b9957b1b78",
      "urlToImage": "https://dims.apnews.com/dims4/default/0b9a03b/2147483647/strip/true/crop/5124x2882+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2Fff%2Fa46f792d479214a1b967366f32c7%2Ff4be2dbfbeca440eae6306c64638a321"
    },
    {
      "author": "Colleen Slevin, Jesse Bedayn, Rebecca Santana, Hallie Golden",
      "description": "Hundreds of people have gathered at the local Jewish Community Center for a vigil to support the victims of the firebombing attack in Boulder. The event Wednesday evening featured prayer, singing and emotional testimony from a victim and witnesses. Mohamed Sabry Soliman has been charged in Sunday’s attack and is scheduled to make an appearance in state court on Thursday. A federal judge has ordered the government to immediately halt deportation proceedings against his wife and five children. None of his family members have been charged in the attack that injured 15 demonstrators calling for the release of Israeli hostages in Gaza.",
      "publishedAt": "2025-06-05T05:40:00Z",
      "title": "Hundreds attend vigil to support victims of the Boulder firebombing attack",
      "url": "https://apnews.com/article/boulder-firebombing-attack-9820f4b51d73efc3da72150b80634ea2",
      "urlToImage": "https://dims.apnews.com/dims4/default/915041d/2147483647/strip/true/crop/3572x2009+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2F62%2Fe986af80764ac34f7b5a714477c4%2F65a4f814fccd4a63ba8e59505af8e299"
    },
    {
      "author": "Kate Payne",
      "description": "A former Republican congressman and vocal critic of Donald Trump says he wants to become governor in the president’s adopted home state of Florida, and he’s running as a Democrat. David Jolly made the announcement Thursday. Jolly is the latest party convert hoping to wrest back control of what had been the country’s premier swing state that in recent years has made a hard shift to the right. Jolly says he’s running because “Republicans in Tallahassee have gone too far in dividing us.” Under state law, term-limited Republican Gov. Ron DeSantis can’t run for reelection in 2026.",
      "publishedAt": "2025-06-05T08:06:23Z",
      "title": "David Jolly, Trump critic and ex-GOP congressman, to run for Florida governor as a Democrat",
      "url": "https://apnews.com/article/david-jolly-governor-race-florida-democrat-trump-86ac06034e76481a3b6c204af75b7300",
      "urlToImage": "https://dims.apnews.com/dims4/default/bec7597/2147483647/strip/true/crop/3414x1920+0+291/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2F22%2Fd1069b248c3f3b78837b4fbff29a%2Ff200f00268354030a37696f482b38b38"
    },
    {
      "author": "Yuri Kageyama",
      "description": "Global shares are mostly higher after Wall Street’s big recent rally lost some momentum following a pair of potentially discouraging reports on the American economy. Benchmarks were higher in early Thursday trading in France, Germany and Britain. U.S. futures rose. Earlier in the day in Asia, Japan's benchmark Nikkei 225 declined , but shares jumped in South Korea following an election of a leading liberal politician as its new president. Shares also gained in Hong Kong and Shanghai. Expectations remain for the U.S. Federal Reserve to cut interest rates later this year.",
      "publishedAt": "2025-06-05T03:15:52Z",
      "title": "Global shares mostly rise after Wall Street’s rally stalls on U.S. economic data",
      "url": "https://apnews.com/article/stock-market-tariffs-trump-jobs-8abc12c2c9d83481484f9d5f97596073",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e88e93/2147483647/strip/true/crop/5699x3206+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F35%2F69807226c64722993aa97ff75eab%2F92191e8b05034b55a7337168f3d8d69f"
    },
    {
      "author": "Ayaka Mcgill",
      "description": "Eager customers have lined up outside electronics stores hours in advance in Tokyo to collect Nintendo’s much-anticipated Switch 2 video game consoles. The Switch 2 is an upgrade to its eight-year-old predecessor, with new social features meant to draw players into online gaming. The new consoles were sold through a competitive lottery system that Nintendo said got about 2.2 million applications in Japan alone. Outside the official draw, some retailers offered their own lottery to pre-order the devices. The new console comes with a larger and higher resolution screen than its predecessor, with improved processing power, offering smoother and more vivid graphics.",
      "publishedAt": "2025-06-05T08:56:28Z",
      "title": "Nintendo Switch 2 launch draws eager fans",
      "url": "https://apnews.com/article/japan-nintendo-switch-launch-gaming-8289bd5f6e8ad9c3950d07849e2bd1c7",
      "urlToImage": "https://dims.apnews.com/dims4/default/67a68d8/2147483647/strip/true/crop/4000x2250+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fd5%2F6665517e91e5f03179e8a0cb6e62%2F0e78f7a546074f36ac69fa8a9260ab3d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}