{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — More than 29,000 Palestinians have been killed in the territory since the start of the Israel-Hamas war, Gaza's Health Ministry said Monday.",
      "publishedAt": "2024-02-19T10:23:17Z",
      "title": "Gaza Health Ministry says over 29,000 Palestinians have been killed in Israel-Hamas war",
      "url": "https://apnews.com/81c2d362340b611a98e4b929b4b5d0a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/29c4f97eb37b4ae3905fca8c8473fcdd/1920.jpeg"
    },
    {
      "author": "MIKE CORDER",
      "description": "THE HAGUE, Netherlands (AP) — The Palestinian foreign minister on Monday accused Israel of apartheid and urged the United Nations' top court to declare that Israel’s occupation of lands sought for a Palestinian state is illegal and must end immediately and unconditionally for any hope for a two-state future to survive.",
      "publishedAt": "2024-02-19T07:35:58Z",
      "title": "Palestinian FM tells top UN court Israel’s occupation of lands is illegal and imposes apartheid",
      "url": "https://apnews.com/ab4b6118247c8c6fd797ebe96f1dd19a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa00048accea457388ae0615c36d0a41/3000.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI and HEATHER HOLLINGSWORTH",
      "description": "BURNSVILLE, Minn. (AP) — A suburban Minneapolis community was in mourning on Monday after authorities said two police officers and a firefighter were killed by a heavily armed man who shot at them from inside a home that was filled with children.",
      "publishedAt": "2024-02-19T05:14:44Z",
      "title": "Minnesota community mourns 2 officers, 1 firefighter killed at the scene of a domestic call",
      "url": "https://apnews.com/76ae1cd7362b4bf3bca4e9598f9a968f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5dc9af9a3e7e40d0aef173c2d7c2cc91/1920.jpeg"
    },
    {
      "author": "VLADIMIR ISACHENKOV",
      "description": "The mother of Russian opposition leader Alexei Navalny on Monday was denied access to a morgue where his body was believed to be kept after his death in an Arctic penal colony, and Navalny's allies accused authorities of trying to hide evidence.",
      "publishedAt": "2024-02-19T09:55:09Z",
      "title": "Russian authorities extend a probe into Navalny's death as allies accuse officials of cover-up",
      "url": "https://apnews.com/56d3cf1d114e6be452465d5e312b4fad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81d19d9a46934303b0da1bb2c82afd6d/3000.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — Russian forces have completed their takeover of Avdiivka by eliminating the last pocket of resistance at the eastern Ukraine city’s huge coke plant, the Russian military said Monday, after the sheer weight of its troop numbers and greater air and artillery firepower drove out Kyiv’s forces.",
      "publishedAt": "2024-02-19T09:11:50Z",
      "title": "Russia says it has crushed the last pocket of resistance in Avdiivka to complete the city's capture",
      "url": "https://apnews.com/b2e9487c4f96c3ed81f799303c738f58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d40a0ca81b946288169454b1ec36758/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen's Houthi rebels that damaged a Belize-flagged ship traveling through the Bab el-Mandeb Strait that connects the Red Sea and the Gulf of Aden has forced the crew to abandon the ship, authorities said Monday.",
      "publishedAt": "2024-02-19T00:42:12Z",
      "title": "Houthi rebels' attack severely damages a Belize-flagged ship in key strait leading to the Red Sea",
      "url": "https://apnews.com/67cf1acc17f4e17d04075a99688e4da8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4cb0423cbef414caf3cdfd2adba7608/3000.jpeg"
    },
    {
      "author": null,
      "description": "SAN FRANCISCO (AP) — The latest in a series of wet winter storms gained strength in California early Monday, with forecasters warning of possible flooding, hail, strong winds and even brief tornadoes as the system moves south over the next few days.",
      "publishedAt": "2024-02-19T05:09:26Z",
      "title": "California again braces for flooding as another wet winter storm hits the state",
      "url": "https://apnews.com/f359d1eccd44b5a7f3a09f0d436d7689",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/921b7cc1d70e4026973d59463affcbf5/2937.jpeg"
    },
    {
      "author": "DIDI TANG",
      "description": "WASHINGTON (AP) — U.S. lawmakers are raising alarms about what they see as America’s failure to compete with China in biotechnology, warning of the risks to U.S. national security and commercial interests.",
      "publishedAt": "2024-02-19T05:07:54Z",
      "title": "US rivalry with China expands to biotech. Lawmakers see a failure to compete and want to act",
      "url": "https://apnews.com/c892d9d18d8f38dad7e955fa8038e7d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/95cc20955f8c4d0299945b6120554fa7/3000.jpeg"
    },
    {
      "author": "ELAINE GANLEY",
      "description": "SAINT-BREVIN-LES-PINS, France (AP) — The mayor of a small resort town on the Atlantic coast of France resigned, closed his medical practice and moved away after his house and two cars were set on fire.",
      "publishedAt": "2024-02-19T05:01:32Z",
      "title": "French mayors face violence and intimidation from xenophobic far-right groups",
      "url": "https://apnews.com/c507227bfad6598201a8642cfb95b19c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4dff4184e34c4fde8752221c17d95600/3000.jpeg"
    },
    {
      "author": "BRIAN P. D. HANNON",
      "description": "The funeral of a renowned transgender activist in a New York cathedral elicited a denunciation of the event by a senior church official, who called the mass a scandal within one of the preeminent houses of worship in U.S.",
      "publishedAt": "2024-02-19T06:59:44Z",
      "title": "New York Archdiocese denounces transgender activist's funeral, holds Mass of Reparation",
      "url": "https://apnews.com/75580316101b7f6b8a010a019a016297",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a4ac62c19b14a03863fcab172671450/2000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}