{
  "articles": [
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER, MATT BROWN",
      "description": "Kash Patel, President Donald Trump’s pick to lead the FBI, is insisting to deeply skeptical Democrats that he does not have an “enemies list” and that the bureau under his leadership would not seek retribution against the president’s adversaries or launch politically motivated investigations. The reassurances were aimed at blunting a persistent line of attack from Democrats. Throughout Thursday’s hearing they confronted Patel with a vast catalog of his incendiary statements. They said those statements raise alarming questions about his loyalty to the president, including referring to some of the Jan. 6 rioters as “political prisoners” and calling for a purge of anti-Trump “conspirators” in the government and news media.",
      "publishedAt": "2025-01-30T05:02:15Z",
      "title": "Trump's FBI chief pick insists he has no 'enemies list'",
      "url": "https://apnews.com/article/trump-fbi-patel-senate-f3465219e265df1598e15da3ad0e8a07",
      "urlToImage": "https://dims.apnews.com/dims4/default/99ae12b/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F2c%2Fb8a7f1a8e49548a96b477e6e83ba%2F6a9c862d010c4198ad9521b837504808"
    },
    {
      "author": "BRIAN SLODYSKO, JACK DURA",
      "description": "Emails obtained by The Associated Press reveal Doug Burgum as North Dakota governor catered to the whims of oil and gas executives while leveraging those connections to expand his political profile. Now that Burgum is nominated to be President Donald Trump's secretary of the Interior Department, those relationships are drawing a closer look. Many of the oil and gas companies Burgum developed a rapport with are certain to want things from him following his Senate confirmation to the post. A spokesman says the Republican routinely \"met with job creators and leaders who generated opportunities for the people of North Dakota.”",
      "publishedAt": "2025-01-30T19:19:28Z",
      "title": "Big Oil wants a lot from Trump. It has an ally in Doug Burgum, the president's Interior pick",
      "url": "https://apnews.com/article/trump-oil-gas-industry-burgum-interior-ally-3ebe90d0207c99866365d72e74eda371",
      "urlToImage": "https://dims.apnews.com/dims4/default/3036c65/2147483647/strip/true/crop/3919x2204+0+204/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F3c%2F5c8d5c81827ff6851d180683e262%2F13fcd57aa8244418b00e484dbc24cf6e"
    },
    {
      "author": "DAVID KLEPPER, FARNOUSH AMIRI",
      "description": "Tulsi Gabbard, President Donald Trump's pick to be director of national intelligence, has faced tough questions from lawmakers during a fiery confirmation hearing Thursday. Democrats and Republicans alike are focusing on her past comments sympathetic to Russia, her meeting with Syria’s now-deposed leader and her past support for government leaker Edward Snowden. Gabbard is a former Democratic congresswoman from Hawaii who served two military tours in the Middle East. A Trump loyalist, she has won over some Republicans. But given thin Republican margins in the Senate, she will need almost all GOP senators to vote yes in order to win confirmation.",
      "publishedAt": "2025-01-30T05:06:12Z",
      "title": "Tulsi Gabbard, Trump's pick to oversee US spy agencies, grilled about Snowden, Syria and Russia",
      "url": "https://apnews.com/article/gabbard-trump-intelligence-director-senate-confirmation-5750d01104cf650b8ef0853dabb2e5a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/47e5fc0/2147483647/strip/true/crop/7441x4186+0+387/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F37%2F758f3a9dde28883c7d3a2870ddc4%2Fbcc41f93d07c461a9c703542e15498e4"
    },
    {
      "author": "WILL WEISSERT",
      "description": "President Donald Trump on Wednesday used a signing ceremony for the Laken Riley Act to announce that his administration plans to send the “worst criminal aliens” to detention in Guantanamo Bay, Cuba. The bipartisan Laken Riley Act was the first piece of legislation that Trump has signed into law. It is named for a 22-year-old Georgia nursing student who was slain last year by a Venezuelan man in the U.S. illegally. The law makes it easier to deport immigrants in the U.S. illegally who have been accused of crimes. But Trump said some of the immigrants can't be trusted to not return, necessitating their lockup at Guantanamo. He later issued a presidential memorandum on Guantanamo.",
      "publishedAt": "2025-01-29T05:17:27Z",
      "title": "Trump to send criminal immigrants in US illegally to Guantanamo Bay",
      "url": "https://apnews.com/article/trump-signs-laken-riley-act-immigration-crackdown-30a34248fa984d8d46b809c3e6d8731a",
      "urlToImage": "https://dims.apnews.com/dims4/default/39450f4/2147483647/strip/true/crop/5580x3139+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F57%2Ff39c34ae8e384715ebb5e53eee7a%2F98b6249590a94b65b31b6e81d537e82b"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "The most obvious shift from Joe Biden to Donald Trump has been the flood of talking from the White House. Trump is speaking publicly far more than his predecessor, overwhelming his opponents and leaving them struggling to get a word in edgewise. Even the White House stenographers responsible for transcribing a president's remarks are racing to keep up with him. According to Factba.se, Trump spoke 81,235 words in his first week in office, up from 24,259 in the same timespan for Biden. The Republican president's admirers and critics agree that he's skilled at harnessing the country's undivided attention.",
      "publishedAt": "2025-01-30T11:24:16Z",
      "title": "Donald Trump talks so much that even stenographers are struggling",
      "url": "https://apnews.com/article/trump-white-house-speeches-talking-communications-094b2c5b4d5a6d1ab1fd06ade090ed4c",
      "urlToImage": "https://dims.apnews.com/dims4/default/e064838/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F99%2F4fe7d6a54387aca62e28281bb5b1%2F4ef24a6407fa49ef8b77ba85dfa211e9"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "The nation’s cybersecurity agency has played a critical role in helping states shore up the defenses of their voting systems, but its election mission appears uncertain amid sustained criticism from Republicans and key figures in the Trump administration. President Donald Trump has yet to name anyone to lead the U.S. Cybersecurity and Infrastructure Security Agency. And for the first time since the agency was formed, there are no plans for anyone in its leadership to address the annual gathering of the nation’s secretaries of state, beginning Thursday in Washington. Trump’s allies remain angry over its efforts to counter misinformation about the 2020 presidential election and the COVID-19 pandemic.",
      "publishedAt": "2025-01-30T11:34:27Z",
      "title": "US cyber agency's future role in elections remains murky under the Trump administration",
      "url": "https://apnews.com/article/cisa-dhs-cybersecurity-election-security-trump-d17f40ad31f85a7538a7904efbea6b49",
      "urlToImage": "https://dims.apnews.com/dims4/default/260b831/2147483647/strip/true/crop/3818x2148+0+199/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F4c%2F525e3ff663efcf322c56d29a32cf%2F65ea6b8266184e2c9f1e59964d58464d"
    },
    {
      "author": "ALMA SOLÍS",
      "description": "Panama President José Raúl Mulino says there will be no negotiation with the United States over ownership of the Panama Canal. He also says that he hopes U.S. Secretary of State Marco Rubio’s upcoming visit will allow them to focus on shared interests like migration and combating drug trafficking. Being the destination for the first overseas visit by the top U.S. diplomat would have been big for Panama in any case, but Rubio comes as the emissary of U.S. President Donald Trump who has repeatedly suggested the U.S. retake the Panama Canal.",
      "publishedAt": "2025-01-30T17:36:45Z",
      "title": "Panama's president says there will be no negotiation about ownership of canal",
      "url": "https://apnews.com/article/panama-canal-us-rubio-mulino-a3b1ccdf2fe1b0e957b44f1cf7a9fcfe",
      "urlToImage": "https://dims.apnews.com/dims4/default/fb793da/2147483647/strip/true/crop/4916x2765+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2F66%2Fc0f14e2d2b333d978b43efcfadaa%2F2c377049e18740c8b8ca66d23aad4727"
    },
    {
      "author": "LOLITA C. BALDOR, TARA COPP, BRIAN MELLEY, SARAH BRUMFIELD",
      "description": "All 64 people aboard an American Airlines jet that collided with an Army helicopter were feared dead. Officials said it was likely to be the worst U.S. aviation disaster in almost a quarter century. At least 28 bodies were pulled from the icy waters of the Potomac River after the helicopter apparently flew into the path of the jet late Wednesday as it was landing at Ronald Reagan National Airport near Washington. The plane carried 60 passengers and four crew. Three soldiers were aboard the helicopter. John Donnelly is the fire chief in the nation’s capital. He says authorities are now switching from a rescue operation to a recovery operation.",
      "publishedAt": "2025-01-30T10:01:53Z",
      "title": "Everyone on American Airlines plane crash near D.C. is feared dead",
      "url": "https://apnews.com/article/ronald-reagan-national-airport-crash-62adba7fb1f546b4cf1716e42b86482b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d0c2301/2147483647/strip/true/crop/5620x3161+0+292/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2Fd4%2F8d8bbdbaacffe15a983d00c58f3f%2F5a3a7f1b080e49888ba17020f8beccc5"
    },
    {
      "author": null,
      "description": "Passengers aboard the American Airlines flight that collided with an Army helicopter and crashed into the Potomac River included teen figure skaters returning from the U.S. Figure Skating Championships and their Russian coaches. U.S. Figure Skating said Thursday that several skaters, coaches and their family members were on the flight after attending a development camp that followed the championships that wrapped up Sunday in Wichita, Kansas. There were 60 passengers and four crew members on the American Airlines flight Wednesday and three soldiers aboard the training flight on the Blackhawk helicopter. The Kremlin confirms coaches Evgenia Shishkova and Vadim Naumov were on the plane. It's believed there were no survivors.",
      "publishedAt": "2025-01-30T12:36:38Z",
      "title": "Evgenia Shishkova & Vadim Naumov among skaters in D.C. plane crash",
      "url": "https://apnews.com/article/washington-plane-collision-victims-ee829891574aa35a30d8262b7e07e638",
      "urlToImage": "https://dims.apnews.com/dims4/default/83da8cb/2147483647/strip/true/crop/4712x2651+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F5b%2Fb0717499b61d71724780803f293b%2Ff0238a4eced8479e9f2848ec45cd653a"
    },
    {
      "author": "WAFAA SHURAFA, MOHAMMAD JAHJOUH, JOSEPH KRAUSS",
      "description": "Hamas-led militants have freed eight hostages as part of the ceasefire in the Gaza Strip. But the chaotic handover of some of the captives drew an angry protest from Israel. The hostages were shuttled through a rowdy crowd of thousands by masked militants. Israel later began releasing 110 Palestinian prisoners after the swap was initially put on hold by Prime Minister Benjamin Netanyahu. He demanded that mediators assure the safe exit for hostages going forward. He said later that he had received that commitment.",
      "publishedAt": "2025-01-30T04:28:08Z",
      "title": "Hamas frees 8 more hostages as Gaza truce holds",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-30-2025-3cc7131495a60ce2bda73ca691abb7c8",
      "urlToImage": "https://dims.apnews.com/dims4/default/3c933c2/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2F9d%2F286fab43dcec5f965678f83ac650%2Fb79513435ee64f128a6dea69bdb2dcd8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}