{
  "articles": [
    {
      "author": null,
      "description": "Insiders have speculated about a potential falling-out between Donald Trump and Elon Musk for months. It never seemed to happen — until Thursday. The world’s most powerful man and its wealthiest began attacking each other in a spectacle that left Washington breathless. The feud began with Musk’s criticism of Trump’s legislative agenda, which would increase the deficit while eliminating tax incentives that have helped his electric automaker Tesla. Trump responded by threatening to cut government subsidies and contracts for Musk’s companies, and things only escalated from there.",
      "publishedAt": "2025-06-06T04:02:05Z",
      "title": "Trump and Musk break up, and Washington holds its breath",
      "url": "https://apnews.com/article/elon-musk-donald-trump-28263ffbfc191602b3657618138ee585",
      "urlToImage": "https://dims.apnews.com/dims4/default/e24797e/2147483647/strip/true/crop/3975x2236+0+207/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F9f%2F17007d2b2fa640359dd7a6878e64%2F48ecd44b31744303b590a5a1e70b6777"
    },
    {
      "author": null,
      "description": "Elon Musk is threatening to decommission a capsule used to take astronauts and supplies to the International Space Station for NASA. The threat came as President Donald Trump and Musk argued on social media on Thursday. Trump said he could cut government contracts given to Musk’s SpaceX company. Musk responded by saying SpaceX will begin decommissioning its Dragon spacecraft. It’s unclear how serious he was. But SpaceX is the only U.S. company capable right now of transporting crews to and from the space station, using its four-person Dragon capsules. NASA’s other immediate option is paying Russia to take U.S. astronauts up.",
      "publishedAt": "2025-06-05T22:28:21Z",
      "title": "Musk threatens to withdraw Dragon spacecraft in spat with Trump",
      "url": "https://apnews.com/article/musk-trump-spacex-dragon-capsule-e1fa0607a8e69bc2ad1677f5920b5f56",
      "urlToImage": "https://dims.apnews.com/dims4/default/8496223/2147483647/strip/true/crop/4626x2602+0+241/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F64%2F4b8569d980a807df7ae069ba3918%2F0d9549b722c0454f8cb6ca868a2c2751"
    },
    {
      "author": null,
      "description": "Officials say Ukraine was under an ongoing Russian ballistic missile and drone attack early Friday that wounded at least three people. Multiple explosions were heard in the capital, Kyiv, where falling debris sparked fires across several districts as air defense systems attempted to intercept incoming targets. Three people were wounded, local officials said. They urged residents to seek shelter. Authorities reported damage in several districts, and rescue workers were responding at multiple locations. In northern Chernihiv region, a Shahed drone exploded near an apartment building, shattering windows and doors, according to the regional military administration chief. He added that explosions from ballistic missiles were also recorded on the outskirts of the city.",
      "publishedAt": "2025-06-06T00:44:54Z",
      "title": "Ukraine is under an ongoing Russian missile and drone attack",
      "url": "https://apnews.com/article/russia-ukraine-war-putin-zelenskyy-trump-80c8984bc2e52da0212da4e0d4cf8220",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5f5e59/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2F6e%2F169b28ea7ecf7fa345c645d731e8%2Fa2c16881857c45358f027dce9a6a7c7b"
    },
    {
      "author": null,
      "description": "Democratic state attorneys general are seeking to block President Donald Trump’s proposal for an overhaul of U.S. elections in a case that tests a constitutional bedrock — the separation of powers. The top law enforcement officials from 19 states filed a federal lawsuit after the Republican president signed the executive order in March, arguing its provisions would step on states’ power to set their own election rules. Trump’s order says its intent is to ensure “honest elections.” Trump's Justice Department says the order falls within his authority to direct federal officials. The two sides will be in U.S. District Court in Boston on Friday, when the attorneys general will argue for a preliminary injunction.",
      "publishedAt": "2025-06-06T10:17:39Z",
      "title": "Democratic attorneys general challenge Trump's election overhaul in court",
      "url": "https://apnews.com/article/trump-executive-order-elections-democrats-states-8a329645f15e161103709409ecf3e746",
      "urlToImage": "https://dims.apnews.com/dims4/default/cec22d8/2147483647/strip/true/crop/3500x1969+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F16%2F6af32f3a5ec76cb9d233aeeb22b1%2Fac916e460f914777b4455d51a47d0ebd"
    },
    {
      "author": null,
      "description": "A federal judge late Thursday temporarily blocked a proclamation by President Donald Trump that banned foreign students from entering the U.S. to attend Harvard University. Trump’s proclamation, issued Wednesday, marked his administration’s latest attempt to cut off Harvard from a quarter of its student body, which accounts for much of the elite university’s research and scholarship. Hours earlier, Harvard had filed a legal challenge asking the federal judge to block Trump’s order, calling it illegal retaliation for Harvard’s rejection of White House demands. In an amended lawsuit filed Thursday, Harvard said the president was attempting an end-run around a previous court order.",
      "publishedAt": "2025-06-06T04:39:49Z",
      "title": "Harvard ban on foreign students blocked temporarily by judge",
      "url": "https://apnews.com/article/harvard-judge-lawsuit-trump-international-students-bb3cf204111567927cf37b63e5927582",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d9c912/2147483647/strip/true/crop/3900x2194+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Fc8%2Fda3b618f95b4afa54cfce0190350%2Fa895c6b374d541ed9cbbf325f4bbd36a"
    },
    {
      "author": null,
      "description": "People across the war-ravaged Gaza Strip marked the start of one of Islam’s most important holidays with prayers outside destroyed mosques and homes, with little hope the war with Israel will end soon. With much of Gaza in rubble, men and children were forced to hold the traditional Eid al-Adha prayers Friday in the open air and with food supplies dwindling, families were having to make do with what they could scrape together for the three-day feast.",
      "publishedAt": "2025-06-06T09:54:45Z",
      "title": "Gaza marks the start of Eid with outdoor prayers amongst the rubble and food growing ever scarcer",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-eid-aid-06-06-2025-0a4f66bbc783799eb2d2151babd8e92e",
      "urlToImage": "https://dims.apnews.com/dims4/default/2cbd65f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F69%2F817e2f0490281d2fbc121750ddd3%2Fc9fe8bfda4994cce9bdf92eee7b1be4f"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu said that Israel has “activated” some local clans of Palestinians in Gaza in the fight against Hamas. In a video posted to his X account, Netanyahu said the government made the move on the advice of “security officials” in order to save lives of Israeli soldiers. The announcement Thursday came hours after a political opponent criticized him for arming unofficial groups of Palestinians in Gaza.",
      "publishedAt": "2025-06-05T17:57:58Z",
      "title": "Netanyahu: Israel has 'activated' Palestinian clans in fight against Hamas",
      "url": "https://apnews.com/article/netanyahu-palestinian-clans-activated-armed-8f2461f5253550d0a4ce4ea661c580ef",
      "urlToImage": "https://dims.apnews.com/dims4/default/e0b55cd/2147483647/strip/true/crop/5148x2896+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0c%2F8f%2F5eeccd792e47b52c1a498bdc2420%2F202b4804d2b647d29421023952a48d10"
    },
    {
      "author": null,
      "description": "A unanimous Supreme Court has made it easier to bring lawsuits over so-called reverse discrimination, siding with an Ohio woman who claims she didn’t get a job and was demoted because she's straight. The justices’ decision Thursday affects lawsuits in 20 states and the District of Columbia where, until now, courts had set a higher bar when members of a majority group, including those who are white and heterosexual, sue for discrimination under federal law. The court ruled in an appeal from Marlean Ames, who's worked for the Ohio Department of Youth Services for years. Justice Ketanji Brown Jackson says federal civil rights law draws no distinction between members of majority and minority groups.",
      "publishedAt": "2025-06-05T14:08:34Z",
      "title": "Supreme Court makes it easier to claim 'reverse discrimination' in employment",
      "url": "https://apnews.com/article/supreme-court-discrimination-lawsuit-ohio-205f07a2d47d7a46cfc96a5fefdf9269",
      "urlToImage": "https://dims.apnews.com/dims4/default/a519aa0/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F38%2F37255488e051ca68d07e2d0543d4%2F925c93a5304048459f79a7ffbd470f68"
    },
    {
      "author": null,
      "description": "North Korea says it righted a capsized destroyer and moored it at a pier in the northeastern port of Chongjin as it continues to repair a new warship leader Kim Jong Un has described as a significant asset for his nuclear-armed military. The report by North Korean state media aligned with South Korean military assessments and recent commercial satellite images, which indicated that the ship was in an upright position and floating in the harbor. Outside experts say it remains unclear how severely the 5,000-ton-class destroyer was damaged during a botched launching ceremony in late May, which triggered a furious response from Kim, who called the failure a “criminal act.\"",
      "publishedAt": "2025-06-05T23:49:38Z",
      "title": "North Korea has raised capsized destroyer upright as it continues repair",
      "url": "https://apnews.com/article/north-korea-destroyer-upright-kim-jong-un-nuclear-russia-7ce10bef83dfbe868accf2ca52b3070a",
      "urlToImage": "https://dims.apnews.com/dims4/default/318e8ed/2147483647/strip/true/crop/1290x726+0+67/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F55%2Fcc%2F2c9c587c7821aae45923034ffa16%2Fe2432df3628a4e909bab8ef771e66f98"
    },
    {
      "author": null,
      "description": "Asian shares are mostly higher ahead of an update Friday about the U.S. job market that will offer insights into how the economy is faring. U.S. futures edged higher and oil prices fell. On Thursday, the S&P 500 fell 0.5% and the Dow Jones Industrial Average lost 0.3%. The Nasdaq composite sank 0.8%. Tesla shares regained 0.8% in after-hours trading after tumbling as ties soured between CEO Elon Musk and President Donald Trump. Treasury yields held relatively steady after Trump said trade talks are set to resume with China following an encouraging phone call with Xi Jinping, the leader of the world’s second-largest economy.",
      "publishedAt": "2025-06-06T03:49:17Z",
      "title": "Asian shares mostly gain ahead of Friday's US jobs report",
      "url": "https://apnews.com/article/stocks-markets-musk-china-trump-61087505f58835e3c2e59ff51204f437",
      "urlToImage": "https://dims.apnews.com/dims4/default/370d7ec/2147483647/strip/true/crop/4004x2252+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2F15%2F925c60645001ca3e97bef9a90cdc%2Fa590f3b9e6c7443ea8727c5f52ab504d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}