{
  "articles": [
    {
      "author": "IGNACIO MARTINEZ and STEFANIE DAZIO",
      "description": "CABO SAN LUCAS, Mexico (AP) — Hurricane Hilary moved closer to the coast of Mexico early Sunday on a continued path to the Baja California peninsula as a weakened but dangerous Category 1 hurricane, which the National Weather Service said was likely to bring “catastrophic and life-threatening” flooding to the region and cross into the southwestern U.S.",
      "publishedAt": "2023-08-19T08:07:19Z",
      "title": "Hilary weakens to Category 1 hurricane as storm moves within striking distance of Mexican peninsula",
      "url": "https://apnews.com/7fddeb8c6eaf2e6cb8893dfe4db838fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59c5d7cfd102466cb71052aeb127df38/2500.jpeg"
    },
    {
      "author": "BOBBY CAINA CALVAN",
      "description": "LAHAINA, Hawaii (AP) — The days of waiting have become harder and harder as the odds grow longer and longer, but Kevin Baclig remains undeterred in his search for his wife and her parents, missing since Aug.",
      "publishedAt": "2023-08-19T17:19:04Z",
      "title": "Hope is hard to let go after Maui fire, as odds wane over reuniting with still-missing loved ones",
      "url": "https://apnews.com/bfded9da4e1e1053a4b4be2a48a39d62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7debbd89764c43c9b3af9973b2edf0ab/1920.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russia's Luna-25 spacecraft crashed into the moon after it spun into an uncontrolled orbit, the country's Roscosmos space agency said Sunday. The pilotless spacecraft was aiming to be the first ever to land on the south pole of the moon, an area where scientists believe there could be important reserves of frozen water and precious elements.",
      "publishedAt": "2023-08-20T09:13:52Z",
      "title": "Russia's Luna-25 spacecraft crashes into the moon, ending its bid to reach the lunar south pole",
      "url": "https://apnews.com/658f5118c34cfa0f1501cc7522074323",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/158a6de90cff4f4e96e271a5cc44d1a3/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, JIM MORRIS and MARTHA BELLISLE",
      "description": "VANCOUVER, British Columbia (AP) — Firefighters kept wildfires at bay near the capital of Canada's Northwest Territories as well as a threatened city in British Columbia, though no one claimed victory as forecasters warned that drier and windier weather was coming.",
      "publishedAt": "2023-08-20T05:33:36Z",
      "title": "Firefighters curb blazes threatening 2 cities in western Canada but are 'not out of the woods yet'",
      "url": "https://apnews.com/2450568b1db8152ad8f39b8197df321b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9aa2e97352c4b06a803a7b4be1925d4/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Mutinous soldiers in Niger are under pressure from regional sanctions as they refuse to reinstate the country's president whom they toppled nearly a month ago while being fearful of attacks from France, an official said.",
      "publishedAt": "2023-08-20T08:48:10Z",
      "title": "Talks between regional bloc and Niger's junta yield little, an official tells The Associated Press",
      "url": "https://apnews.com/cf275c0961530b679523255a4fcc99e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d2614fb9e614fda96d4bd0c03c76ba6/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy on Sunday vowed stern retaliation for a Russian missile strike in the center of the northern Ukrainian city of Chernihiv that killed seven people and wounded almost 150 others the day before.",
      "publishedAt": "2023-08-20T09:04:19Z",
      "title": "Zelenskyy vows retaliation for Chernihiv attack that killed seven people and wounded almost 150",
      "url": "https://apnews.com/d1f3d50def45b2c9d92e3fe472233b7b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25a21b0eaed449499a5cbf3d62c8b9c3/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "GUAYAQUIL, Ecuador (AP) — Ecuador is holding a special election Sunday to pick a new president, with police and soldiers on guard against unprecedented violence, including the assassination of a candidate this month.",
      "publishedAt": "2023-08-20T04:07:10Z",
      "title": "Ecuadorians choosing a new president amid increasing violence that may scare away voters",
      "url": "https://apnews.com/0d1b5a7c56c671217a47c1ecb7e826fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5aa76f535c044e0eb406045ccbabee39/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "CUMMING, Ga. (AP) — When Allison Strickland urged a suburban Atlanta school board in June to remove four books from school libraries, she was following a path cleared by Georgia’s Republican lawmakers.",
      "publishedAt": "2023-08-20T04:04:19Z",
      "title": "Georgia made it easier for parents to challenge school library books. Almost no one has done so",
      "url": "https://apnews.com/6fdfbe7951c7592d932723a8bc06f7d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/758a94a3262e42bc9a2e37cffedf0458/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An American-owned oil tanker long suspected of carrying sanctioned Iranian crude oil began offloading its cargo near Texas late Saturday, tracking data showed, even as Tehran has threatened to target shipping in the Persian Gulf over it.",
      "publishedAt": "2023-08-20T03:40:20Z",
      "title": "A tanker believed to hold sanctioned Iran oil starts offloading near Texas despite Tehran's threats",
      "url": "https://apnews.com/3f257407678b844e5c71c39334866bb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b9c5181ca6b4b09afe32cc09507ea2f/2000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — The United States, Japan and Australia are planning a joint navy drill in the South China Sea off the western Philippines this week to underscore their commitment to the rule of law in the region after a recent show of Chinese aggression in the disputed waters, Filipino security officials said Sunday.",
      "publishedAt": "2023-08-20T07:02:46Z",
      "title": "US, Japan and Australia plan joint navy drills in disputed South China Sea, Philippine officials say",
      "url": "https://apnews.com/3fe7a0b39dbdea19a6854dba347ff712",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/704db2be36f94adfbf9ca362eae28a0e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}