{
  "articles": [
    {
      "author": null,
      "description": "Israel’s air campaign on Iran’s capital appeared to broaden on the fourth day of an intensifying conflict as U.S. President Donald Trump posted an ominous message warning residents of the city to evacuate. Earlier, the Israeli military called for the some 330,000 residents of a neighborhood in the city center to evacuate. Israel says its sweeping assault on Iran’s top military leaders, uranium enrichment sites and nuclear scientists, is necessary to prevent its longtime adversary from getting any closer to building an atomic weapon. The strikes have killed at least 224 people since Friday. Iran has retaliated by launching more than 370 missiles and hundreds of drones at Israel. So far, 24 people have been killed in Israel and more than 500 injured.",
      "publishedAt": "2025-06-17T05:03:28Z",
      "title": "Israel strikes Iran and Trump tells capital's residents to evacuate",
      "url": "https://apnews.com/article/israel-iran-missile-attacks-nuclear-news-tehran-trump-06-17-2025-3f08988b5e8fd375645967b6e22916f3",
      "urlToImage": "https://dims.apnews.com/dims4/default/01b6e16/2147483647/strip/true/crop/4285x2410+0+402/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Fb5%2F313bc031e4db86db9caed5f1897a%2Fd674c596204543adbb19beeeb2654b0d"
    },
    {
      "author": null,
      "description": "At least 51 Palestinians were killed and over 200 wounded in the Gaza Strip while waiting for U.N. and commercial trucks to enter the territory with desperately needed food, according to Gaza’s Health Ministry and a local hospital. Palestinian witnesses told The Associated Press that Israeli forces had fired on the crowds. The military said it was looking into reports that its forces had fired toward the crowd, causing several casualties. It did not appear to be related to a new Israeli- and U.S.-supported aid delivery network that rolled out last month and has been marred by controversy and violence.",
      "publishedAt": "2025-06-17T07:33:23Z",
      "title": "At least 51 Palestinians killed while waiting for aid trucks in Gaza, health officials say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-gaza-aid-06-17-2025-7af5503ea7d2176674fba26d34f6ef74",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d6f342/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2Ff1%2F01784acd98fe5fbb6381bbc362f0%2F419377a7ba8643cb87ee439505810f17"
    },
    {
      "author": null,
      "description": "Six of the Group of Seven leaders will try to show the wealthy nations’ club still has the clout to shape world events despite the early departure of President Donald Trump. Prime Minister Mark Carney and his counterparts from the U.K., France, Germany, Italy and Japan will be joined Tuesday by Ukrainian President Volodymyr Zelenskyy and NATO chief Mark Rutte to discuss Russia’s relentless war on its neighbor. That's just one of several crises in an increasingly unstable world. Another is a dangerous showdown between Israel and Iran. Trump left the summit in the Canadian Rockies saying it was very important for him to return.",
      "publishedAt": "2025-06-17T04:11:56Z",
      "title": "G7 leaders try to salvage a summit without Trump",
      "url": "https://apnews.com/article/g7-summit-canada-trump-departure-ukraine-6c86a0a8463603c9b1a3e950382af0a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7424e0/2147483647/strip/true/crop/3173x1785+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F97%2Ff2f849068f55b7a9848073d8b0c1%2F891c87358beb40d598fc9e3b0c0f50f9"
    },
    {
      "author": null,
      "description": "Los Angeles Mayor Karen Bass is lifting a curfew in downtown Los Angeles. Her Tuesday announcement comes after she first imposed the curfew June 10 in response to clashes with police and vandalism amid protests against President Donald Trump’s immigration crackdown in the city. Bass, a Democrat, said she’s lifting the curfew following “successful crime prevention and suppression efforts.” On Monday she trimmed back the hours after fewer arrests during evening demonstrations. She says the curfew protected stores, restaurants, businesses and residents from people engaging in vandalism.",
      "publishedAt": "2025-06-17T18:59:01Z",
      "title": "Los Angeles mayor lifts downtown curfew she imposed during protests against immigration raids",
      "url": "https://apnews.com/article/los-angeles-mayor-curfew-immigration-protests-c3e94c9666791d7752f67e7eb5f43913",
      "urlToImage": "https://dims.apnews.com/dims4/default/7b60b6b/2147483647/strip/true/crop/5435x3057+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F74%2Fc4704e3010c73881c0d954f09d86%2F824a98491f714d82b645585593609c9c"
    },
    {
      "author": null,
      "description": "President Donald Trump will sign an executive order this week to extend a deadline for TikTok’s Chinese owner to divest the popular video sharing app. White House press secretary Karoline Leavitt announced Trump's intention after Trump indicated earlier Tuesday he would “probably” make the move. Leavitt said in a statement Tuesday evening that “Trump does not want TikTok to go dark.” The extension will last for 90 days. Trump had signed an order in early April to keep TikTok running for an additional 75 days after a potential deal to sell the app to American owners was put on ice.",
      "publishedAt": "2025-06-17T13:01:31Z",
      "title": "Trump will sign an order extending deadline for TikTok's Chinese owner to sell app",
      "url": "https://apnews.com/article/tiktok-trump-9b41b996c230cbcc0470071165403e2e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e300389/2147483647/strip/true/crop/5135x2888+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F10%2F34cb8e838005fc1e3062e5eac8de%2F39f54b4fcba042c689b17de8fe262234"
    },
    {
      "author": null,
      "description": "Officials say a Russian missile and drone bombardment has killed at least 15 people and injured 156 others in Ukraine overnight, with the main barrage demolishing a nine-story apartment building in Kyiv. It was the deadliest attack on the Ukrainian capital this year and came as two rounds of direct peace talks have failed to make progress on ending the war, now in its fourth year. The city's military administration says 14 people were killed and 138 others were injured in the capital as explosions echoed for hours. Russia has repeatedly hit civilian areas of Ukraine with missiles and drones, and the United Nations says the attacks have killed more than 12,000 Ukrainian civilians.",
      "publishedAt": "2025-06-17T00:08:16Z",
      "title": "Overnight Russian attack on Ukraine kills 15 and injures 156",
      "url": "https://apnews.com/article/russia-drone-attack-kyiv-187fafa3d7324130e5ee7e20e0a3a5dc",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d16abd/2147483647/strip/true/crop/1000x563+0+52/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fdd%2F9a289b4c5e1b19ef0f1326cac3de%2F724c5bb5d8174b789625d7ea44d66144"
    },
    {
      "author": null,
      "description": "New York City comptroller and Democratic mayoral candidate Brad Lander has been arrested at a federal building in Manhattan as he was trying to accompany a person out of an immigration courtroom. A reporter with The Associated Press witnessed Lander’s arrest on Tuesday. The person Lander was walking out of the courtroom was also arrested. Lander had spent the morning observing immigration court hearings and told an AP reporter that he was there to “accompany” some immigrants out of the building. Emailed inquiries to the FBI and U.S. Immigration and Customs Enforcement were not immediately returned.",
      "publishedAt": "2025-06-17T16:36:31Z",
      "title": "Brad Lander, NYC comptroller and mayoral candidate, is arrested outside immigration court",
      "url": "https://apnews.com/article/brad-lander-nyc-immigration-court-arrest-6ed341297efab31a08a14421674d8ed8",
      "urlToImage": "https://dims.apnews.com/dims4/default/af72716/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F54%2Fe9f93513bee4fc0e8ced04775bf7%2F67ee628d735c45debbd7241b96ad2e51"
    },
    {
      "author": null,
      "description": "British lawmakers voted to decriminalize abortion after a lawmaker argued it was cruel to prosecute women for ending a pregnancy. The House of Commons voted 379-137 on Tuesday on an amendment to a broader crime bill that would bar the prosecution of women who take steps to end their pregnancies at any stage. Tonia Antoniazzi, the Labour member of Parliament who introduced the amendment, said the change was needed because police have investigated more than 100 women for suspected illegal abortions over the past five years, including some who suffered natural miscarriages and stillbirths.",
      "publishedAt": "2025-06-17T10:39:00Z",
      "title": "UK Parliament votes to decriminalize abortion amid concern about the prosecution of women",
      "url": "https://apnews.com/article/abortion-rights-britain-debate-2f1fad9c048b5798abc9f11ed65644df",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d20988/2147483647/strip/true/crop/5335x3001+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa3%2F41%2Fd40457939400bc8e09b972d90449%2F20ade68e18084f0e93ba734f3e2cbe95"
    },
    {
      "author": null,
      "description": "Hopes that Sean “Diddy” Combs might testify at his federal sex trafficking trial have faded after his lawyer predicted a defense presentation lasting two to five days. The defense made the estimate Tuesday when the judge asked how long their case would last. Prosecutors hope to rest Wednesday after presenting evidence for six weeks. The judge says the jury could begin deliberations next week. The 55-year-old Combs has pleaded not guilty to sex trafficking and racketeering conspiracy charges. The judge also scolded prosecutors and defense lawyers on Tuesday, saying information about a closed court proceeding involving a juror last Friday was leaked to a media outlet.",
      "publishedAt": "2025-06-17T15:19:43Z",
      "title": "Lawyers hint that Diddy likely won't testify at his own trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-034f49755372cff005a3d9c38fb02fb2",
      "urlToImage": "https://dims.apnews.com/dims4/default/e4647be/2147483647/strip/true/crop/1753x986+0+126/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd8%2F65%2F54a13cb40ffdb216bd6ed466ed07%2Fab10451bb17d49dba8de0d66346e85fb"
    },
    {
      "author": null,
      "description": "The Edmonton Oilers are turning back to Stuart Skinner to start in net for Game 6 of the Stanley Cup Final facing elimination against the Florida Panthers. Skinner started the first four games of the final before getting replaced by Calvin Pickard. John Klingberg and Kasperi Kapanen are also returning as Edmonton goes back to its Game 1 lineup. Coach Kris Knoblauch said the changes are what he thinks gives his team the best chance of extending the series. The Panthers are trying to close it out to become the NHL's first back-to-back champions since Tampa Bay in 2020 and '21.",
      "publishedAt": "2025-06-17T10:00:09Z",
      "title": "Oilers turn back to Skinner in Game 6 of Stanley Cup Final vs. Panthers",
      "url": "https://apnews.com/article/stanley-cup-nhl-playoffs-8a87ac5a24afb90cf482a89b15ad23c0",
      "urlToImage": "https://dims.apnews.com/dims4/default/923546d/2147483647/strip/true/crop/5333x3000+0+457/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F33%2F5c68cf20dcafd26716dda4b0c8dc%2F641fa43f17fb44d1be682251899783f2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}