{
  "articles": [
    {
      "author": null,
      "description": "Thousands of protesters took to the street in Los Angeles on Sunday in response to President Donald Trump's extraordinary deployment of the National Guard against Gov. Gavin Newsom's wishes. The demonstrations centered on a cluster of federal buildings including a detention center where immigrants arrested on Friday were taken. As the protests swelled on Sunday, demonstrators blocked a freeway entrance, set self-driving cars on fire and threw objects including concrete and electric scooters at law enforcement officers and vehicles. Los Angeles Police Chief Jim McDonnell says some of the protesters engaging in the most aggressive behavior are agitators looking to cause trouble.",
      "publishedAt": "2025-06-09T04:25:10Z",
      "title": "Protests intensify in Los Angeles after Trump deploys hundreds of National Guard troops",
      "url": "https://apnews.com/article/los-angeles-protests-national-guard-trump-14c9dda32663d7d2c45f2b1c5a1d219c",
      "urlToImage": "https://dims.apnews.com/dims4/default/3af0f0d/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fca%2F0e3b7a85ec3116cc0548a446acee%2Fb0ec65081ab14f35b8ab14d75cba5f5f"
    },
    {
      "author": null,
      "description": "President Donald Trump says he’s deploying 2,000 California National Guard troops to Los Angeles to respond to immigration protests, over the objections of California Gov. Gavin Newsom. It’s not the first time Trump has activated the National Guard to quell protests. In 2020, he asked governors of several states to send troops to Washington, D.C. to respond to demonstrations that arose after George Floyd was killed by Minneapolis police officers. Here are some things to know about when and how the president can deploy troops on U.S. soil.",
      "publishedAt": "2025-06-08T04:24:03Z",
      "title": "What to know about Trump's deployment of National Guard troops to LA protests",
      "url": "https://apnews.com/article/insurrection-act-trump-troops-newsom-military-national-guard-a842f79e1c0e244039be274a6f266a7a",
      "urlToImage": "https://dims.apnews.com/dims4/default/84a9b9b/2147483647/strip/true/crop/2974x1673+0+155/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd2%2Fae%2Fa7bb5b876204248d3fcacd653669%2Ffbe5a926360b401d8c56d0bc5cda2a32"
    },
    {
      "author": null,
      "description": "President Donald Trump’s new ban on travel to the United States by citizens from 12 mainly African and Middle Eastern countries is set to take effect on Monday. The ban comes amid escalating tension over the president’s unprecedented campaign of immigration enforcement. Trump signed the new proclamation on Monday. It applies to citizens of Afghanistan, Myanmar, Chad, the Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen. It also imposes heightened restrictions on people from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela who are outside the U.S. and don’t hold a valid visa.",
      "publishedAt": "2025-06-08T18:26:49Z",
      "title": "Trump's new travel ban set to take effect amid escalating tension over immigration enforcement",
      "url": "https://apnews.com/article/trump-travel-ban-immigration-enforcement-visas-b1eb79c7b5717c96daf51e978db83d1b",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6d26fe/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F4e%2F6b69e6e719df174b0468b87899ce%2Fa389db7b896f41c68b200dd5fedc5afe"
    },
    {
      "author": null,
      "description": "Israeli forces have stopped a Gaza-bound aid boat and detained Greta Thunberg and other activists on board, enforcing a longstanding blockade of the Palestinian territory that has been tightened during the war with Hamas. The Freedom Flotilla Coalition, which had organized the voyage to deliver humanitarian aid to the Gaza Strip and protest Israel’s blockade and wartime conduct, said the activists had been “kidnapped by Israeli forces.” Israel said the passengers would return to their home countries and the aid would be delivered to Gaza through established channels.",
      "publishedAt": "2025-06-09T01:20:54Z",
      "title": "Israeli forces detain Greta Thunberg after halting Freedom Flotilla aid boat",
      "url": "https://apnews.com/article/mideast-wars-gaza-flotilla-greta-thunberg-b64e897fb37ee374e4494381304ff9be",
      "urlToImage": "https://dims.apnews.com/dims4/default/be50b33/2147483647/strip/true/crop/4928x2772+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2Fc7%2Fcd0bf01bc66a2cbb83e57fecc5d8%2Fa38136d8c5344e9badbd78e93dda8702"
    },
    {
      "author": null,
      "description": "A pair of singing androids. Two Pulitzer Prize-winning plays. A drunken Mary Todd Lincoln. A musical with a corpse as its hero. A “Romeo and Juliet” with teddy bears and rave music. Not to mention George Clooney. Broadway has had a stuffed season with seemingly something for everyone and now it’s time to recognize the best with the Tony Awards. They're set for Sunday night on CBS and streaming on Paramount+ with Cynthia Erivo as host. Broadway buzz is usually reserved for musical but this year plays powered by A-list talent are driving the conversation.",
      "publishedAt": "2025-06-08T04:24:25Z",
      "title": "2025 Tony Awards offer many intriguing matchups",
      "url": "https://apnews.com/article/tony-awards-2025-337e617e5b3601503d65dbd7159856e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/e37dcf2/2147483647/strip/true/crop/8058x4533+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F00%2Ffd6fc0d067ad7d1c01bb85004392%2F23d5fa950f61431f917517d9251aebac"
    },
    {
      "author": null,
      "description": "Tropical Storm Barbara was strengthening off Mexico’s Pacific coast and could become a hurricane Monday. U.S. forecasters said Barbara was centered about 235 miles west-southwest of the touristic port of Zihuatanejo in Guerrero state late Sunday. It had maximum sustained winds of 65 mph and was moving west-northwest. The storm was forecast to remain at sea, though heavy rainfall may cause flooding and mudslides on Mexico’s western coast. Around 2 to 4 inches of rain were possible across portions of Guerrero, Michoacan, Colima, and Jalisco states through Monday. That has the potential to cause localized flooding and landslides. Surf and rip current conditions could be life-threatening for the next few days.",
      "publishedAt": "2025-06-08T11:32:49Z",
      "title": "Tropical Storm Barbara strengthens off Mexico's Pacific coast",
      "url": "https://apnews.com/article/tropical-storm-barbara-hurricane-6b771ba809cd78f10ca298081658c6b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c4e355/2147483647/strip/true/crop/1686x948+0+47/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F3d%2F50537bb84d2064d6bff2cc949752%2F1b25247938ee44b4b53e2cc26924f129"
    },
    {
      "author": null,
      "description": "China has reported its exports rose 4.8% in May from a year earlier, lower than expected as shipments to the United States fell nearly 10%. Imports declined 3.4% year-on-year, leaving a trade surplus of $103.2 billion. Chinese customs data released Monday show China's exports to the U.S. in May totaled $28.8 billion, while imports fell 7.4% year-on-year to $10.8 billion. China's global exports jumped 8.1% in April. They slowed even after U.S. President Donald Trump struck a deal with Beijing to delay implementation of stiff tariff hikes to allow time for talks. The next round of U.S.-China talks was due to take place later Monday in London.",
      "publishedAt": "2025-06-09T03:39:21Z",
      "title": "China's exports climb 4.8% in May as shipments to the US fall nearly 10%",
      "url": "https://apnews.com/article/china-trade-exports-trump-tariffs-a6f55570462e4ffce106698ef23ac7be",
      "urlToImage": "https://dims.apnews.com/dims4/default/1e17425/2147483647/strip/true/crop/7146x4020+0+372/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0b%2F95%2F4d87b81028b4940e771caa582c53%2F20e4f76db0e9426e9f404129a87519b4"
    },
    {
      "author": null,
      "description": "Jannik Sinner has dropped a set for the first time at Roland-Garros this year but still leads two sets to one in the French Open final against defending champion Carlos Alcaraz. After falling behind early in the third, Alcaraz won four consecutive games then took the set 6-4 to keep his title defense alive. Sinner, the top-ranked player, leads 6-4, 7-6 (4), 4-6.",
      "publishedAt": "2025-06-08T06:00:06Z",
      "title": "Alcaraz fights back to take third set in French Open final",
      "url": "https://apnews.com/article/french-open-men-final-alcaraz-sinner-e0de8f0c10f4b3e988f31257a3e08a9c",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d6a09c/2147483647/strip/true/crop/5209x2930+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2Fe4%2Fa38b9b8b4ef3cac3e6d926de7c89%2Fab875bd395fc4390b7e329fed266d677"
    },
    {
      "author": null,
      "description": "After the raucous rainbow-hued festivities of Saturday’s parade, the final day of World Pride 2025 in the nation’s capital kicked off on a more downbeat note. Thousands gathered under grey skies Sunday morning at the Lincoln Memorial for a rally and protest march, as the community gathers its strength for a looming fight under President Donald Trump’s second administration. The speeches didn’t just target the Trump administration or the Republican party. Some turned their ire on Democratic politicians, who they say have wilted under the pressure of Republican control of the White House and both houses of Congress.",
      "publishedAt": "2025-06-08T16:13:53Z",
      "title": "World Pride celebrations end with anti-Trump sentiment on display",
      "url": "https://apnews.com/article/pride-trump-dc-gay-washington-f3ed5feaec4f98916cf55933351a0d8d",
      "urlToImage": "https://dims.apnews.com/dims4/default/31e77ba/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F46%2F898b02b38c952ea7a7d348305612%2Fed32a7e5273540a5af2aca2fa8f2f649"
    },
    {
      "author": null,
      "description": "Russian officials say that Moscow is still awaiting confirmation from Kyiv on a planned exchange of 6,000 bodies of soldiers killed in action and is accusing Ukraine of delaying the process. Lt. Gen. Alexander Zorin, a Russian negotiator, said on Sunday that Russia delivered 1,212 bodies of Ukrainian troops to a border site and is receiving “signals” the transfer may be postponed until next week. The swap was agreed during direct talks in Istanbul, though both sides have since accused each other of undermining the plan. Ukraine has denied a date was agreed and accused Russia of manipulating facts and submitting incorrect repatriation lists.",
      "publishedAt": "2025-06-08T09:41:32Z",
      "title": "Russia accuses Ukraine of delaying exchange of dead fighters",
      "url": "https://apnews.com/article/russia-ukraine-war-prisoner-swap-bodies-743d264ed87083e16846e668c35144f1",
      "urlToImage": "https://dims.apnews.com/dims4/default/5abe438/2147483647/strip/true/crop/4129x2323+0+215/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2Ff7%2F9b91deb17e6413ef3d21324c0e4e%2Ff3fe84febe914d4c956d35f1bba6324e"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}