{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An Israeli airstrike hit a school-turned-shelter in Gaza early Saturday, killing at least 80 people and wounding nearly 50 others, Palestinian health authorities said, in one of the deadliest attacks of the 10-month Israel-Hamas war.",
      "publishedAt": "2024-08-10T04:26:06Z",
      "title": "Israeli airstrike on a Gaza school used as a shelter kills at least 80, Palestinian officials say",
      "url": "https://apnews.com/f33867d7596ebb70c1cb3a77fd4437cc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dca0492fad394609bd4c672897e58cdc/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — As law enforcement officers hung back outside Khloie Torres' fourth-grade classroom in Uvalde, Texas, she begged for help in a series of 911 calls, whispering into the phone that there were “a lot” of bodies and telling the operator: “Please, I don’t want to die.",
      "publishedAt": "2024-08-10T17:08:06Z",
      "title": "‘I don’t want to die,’ Uvalde student told 911 dispatcher during mass shooting",
      "url": "https://apnews.com/2eaabf46b09866b037b3a9dee81b9cd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f501da363fc94a4e97ac935002f27f2b/1920.jpeg"
    },
    {
      "author": "RIO YAMAT, DARLENE SUPERVILLE, WILL WEISSERT and JOSH BOAK",
      "description": "LAS VEGAS (AP) — Vice President Kamala Harris promised Saturday to work to eliminate taxes on tips paid to restaurant workers and other service employees, echoing a pledge that her opponent in November, Donald Trump, has made, and creating a rare instance of political overlap from both sides.",
      "publishedAt": "2024-08-10T04:01:25Z",
      "title": "Harris pledges to work to end taxes on tips for service industry employees, echoing Trump vow",
      "url": "https://apnews.com/ac21118dbb24290e46d32ad9669507d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb6d76069a704e1faea2054b6129822d/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "Former President Donald Trump’s presidential campaign said Saturday that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents.",
      "publishedAt": "2024-08-10T21:13:41Z",
      "title": "Donald Trump's campaign says its emails were hacked",
      "url": "https://apnews.com/036ffd3ed07cf3fe9fb74d4958808b65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe198d963fee4c0e8cfd490a8929d082/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE and TATIANA POLLASTRI",
      "description": "SAO PAULO (AP) — Families of victims of an airliner crash in Brazil are gathering Sunday at a morgue and hotels in Sao Paulo as forensics experts work to identify the remains of the 62 people killed in the accident.",
      "publishedAt": "2024-08-11T05:17:03Z",
      "title": "Families of Brazilian plane crash victims gather in Sao Paulo as experts work to identify the dead",
      "url": "https://apnews.com/c92b1f4cb8fd27feaa073fd2553fcbcb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d24eca695024162ab879ada62b7d1b2/1920.jpeg"
    },
    {
      "author": "DAVID SHARP, MICHAEL HILL, MARK SCOLFORO and PATRICK WHITTLE",
      "description": "The sun came out but the power stayed off in more than 100,000 homes and businesses across four states Saturday as Debby finally moved out of the U.S.After first arriving in Florida as a hurricane, the storm spent the better part of a week unleashing tornadoes and flooding, damaging homes and taking lives as it moved up the East Coast.",
      "publishedAt": "2024-08-10T04:10:21Z",
      "title": "Debby finally moves out of the US, though some flooding risk and power outages remain",
      "url": "https://apnews.com/a369f782a8e6fa18fdb7f722ade4b3c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f073224caf054c0d8714a2821cb79a49/1920.jpeg"
    },
    {
      "author": "RODNEY MUHUMUZA",
      "description": "NEAR MOUNT ELGON, Uganda (AP) — The dancers shook their hips to the beat of drummers who led the way, anticipating the start of mass circumcision among the Bamasaaba people of Uganda’s mountainous east.",
      "publishedAt": "2024-08-11T05:13:47Z",
      "title": "In a remote Ugandan region, a sacred circumcision ritual faces a contentious test of purity",
      "url": "https://apnews.com/e2a29cfa85eb1dd8d03fcdd4b4696653",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ace8695199374ff1bd39feb0cb1c033d/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "PARIS (AP) — Lin Yu-ting fought to remain poised and calm throughout the Paris Olympics boxing tournament, even when it seemed like most of the chattering world was maligning her, misrepresenting her and questioning the very nature of her being.",
      "publishedAt": "2024-08-10T19:56:51Z",
      "title": "Boxer Lin Yu-ting wins gold, following Imane Khelif to conclude an Olympics filled with scrutiny",
      "url": "https://apnews.com/28d3e1a46ed8fe5c1aa6cd612e2561ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/247c56adecc4426b8f47b484f847e9e0/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PARIS (AP) — Romania’s Ana Barbosu could replace American Jordan Chiles as the Olympic bronze medalist in gymnastics floor exercise after the International Gymnastics Federation restored Barbosu to third.",
      "publishedAt": "2024-08-10T21:19:09Z",
      "title": "Jordan Chiles could lose her bronze medal from the Olympic floor finals. What happened?",
      "url": "https://apnews.com/5a7db5537e2defb3ebe57b0b746556f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ddbab3d17ba44a28bb19c1af177bfce/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "PARIS (AP) — Stephen Curry was thinking about this two years ago, after winning his fourth NBA title with the Golden State Warriors. The only thing left for him to win was Olympic gold.And in the ultimate moment, he made sure that medal would be his.",
      "publishedAt": "2024-08-10T21:20:34Z",
      "title": "Golden Steph: Curry's late barrage seals another Olympic men's basketball title, as US beats France",
      "url": "https://apnews.com/11c95e9b6dfdb25f77c122cd1abe58e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05c00480b2664ad0ad3b8576806c7974/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}