{
  "articles": [
    {
      "author": "DAVID J. PHILLIP, LISA BAUMANN and CHRISTOPHER WEBER",
      "description": "HOUSTON (AP) — Fast-moving thunderstorms pummeled southeastern Texas on Thursday for the second time this month, killing at least four people, blowing out windows in high-rise buildings, downing trees and knocking out power to more than 850,000 homes and businesses in the Houston area.",
      "publishedAt": "2024-05-17T01:04:14Z",
      "title": "Severe storms kill at least 4 in Houston, knock out power to 850,000 homes and businesses",
      "url": "https://apnews.com/d14447267de0a8900e1475a8ad7ed8ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e83049bac954afb8154560bdacf2155/3000.jpeg"
    },
    {
      "author": "MOLLY QUELL",
      "description": "THE HAGUE, Netherlands (AP) — Israel will respond to charges of genocide at the United Nations’ top court on Friday, after South Africa filed an urgent request with the court to order a cease-fire in Gaza.",
      "publishedAt": "2024-05-17T04:05:15Z",
      "title": "Israel will respond to genocide charges at UN court after South Africa urgently requests cease-fire",
      "url": "https://apnews.com/2f739ad4f64ff3a8186a423ad8f350e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83caf93cde234d58a766b7bdf97aaa93/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAM MEDNICK",
      "description": "DEIR AL-BALAH, Gaza (AP) — Atef Al-Buhaisi, 6, once dreamed of a career building houses. Now, all he craves is to return to school. In Israel's war with Hamas, Atef's home has been bombed, his teacher killed and his school in Nuseirat turned into a refuge for displaced people.",
      "publishedAt": "2024-05-17T05:10:37Z",
      "title": "For the children of Gaza, war means no school — and no indication when formal learning might return",
      "url": "https://apnews.com/9f8aecc7f91db017e69b4c4a4c0d299d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cd0be62378c41809b5f121dae17dcd2/1920.jpeg"
    },
    {
      "author": "BY BASSEM MROUE",
      "description": "BEIRUT (AP) — The Lebanese militant group Hezbollah this week struck a military post in northern Israel using a drone that fired two missiles. The attack wounded three soldiers, one of them seriously, according to the Israeli military.",
      "publishedAt": "2024-05-17T05:17:35Z",
      "title": "Hezbollah introduces new weapons and tactics against Israel as war in Gaza drags on",
      "url": "https://apnews.com/cd9f59ffa7f876aa755b3c6612246763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ec92e7a45094755a9544ccb867d4db5/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU and EMILY WANG FUJIYAMA",
      "description": "BEIJING (AP) — Russian President Vladimir Putin focused on trade and cultural exchanges Friday on his state visit to China that started with bonhomie in Beijing and a summit with China's leader Xi Jinping that deepened their “no-limits” partnership as both countries face rising tensions with the West.",
      "publishedAt": "2024-05-17T04:42:12Z",
      "title": "Putin focuses on trade and cultural exchanges in Harbin, China, after reaffirming ties with Xi",
      "url": "https://apnews.com/907134e5d2ec2cc62376caca5d8df79b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/053f7f36f48a4954b22fc4a814691dfd/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "HUITZILAC, Mexico (AP) — Tailed by trucks of heavily armed soldiers, four caskets floated on a sea of hundreds of mourners. Neighbors peered nervously from their homes as the crowd pushed past shuttered businesses, empty streets and political campaign posters plastering the small Mexican town of Huitzilac.",
      "publishedAt": "2024-05-17T04:05:37Z",
      "title": "Mexico's cartel violence haunts civilians in the lead-up to June elections",
      "url": "https://apnews.com/47b4025537fd12bba73c3596c1a68937",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d21d78628a16443b81ae5b3e91c6a51c/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, JAKE OFFENHARTZ and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump's lawyers accused the star prosecution witness in his hush money trial of lying to jurors, portraying Trump fixer-turned-foe Michael Cohen on Thursday as a serial fabulist who is bent on seeing the presumptive Republican presidential nominee behind bars.",
      "publishedAt": "2024-05-16T04:01:37Z",
      "title": "Michael Cohen pressed on his crimes and lies as defense attacks key Trump hush money trial witness",
      "url": "https://apnews.com/ec08be1219703deb3cd10604844deacb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f98f09f70a204b189062cfc8a2efa45d/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "JACUMBA HOT SPRINGS, Calif. (AP) — On many nights, hundreds of migrants squeeze through poles in a border wall or climb over on metal ladders. They gather in a buffer zone between two walls with views of the night lights of Tijuana, Mexico, waiting hours for Border Patrol agents while volunteers deliver hot coffee, instant ramen and bandages for busted knees and swollen ankles.",
      "publishedAt": "2024-05-17T04:17:34Z",
      "title": "The latest hot spot for illegal border crossings is San Diego. But routes change quickly",
      "url": "https://apnews.com/da1e7b7c81e4e58912deff6d36dbdb9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7214da84fefe49b1859f22627140dc69/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VATICAN CITY (AP) — The Catholic Church has a long and controversial history of the faithful claiming to have had visions of the Virgin Mary, of statues that purportedly wept blood tears and stigmata that erupted on hands mimicking the wounds of Christ.",
      "publishedAt": "2024-05-17T04:09:25Z",
      "title": "Vatican updates norms to authenticate visions of Mary, weeping statues and stigmata",
      "url": "https://apnews.com/f9b5659e2947e7eb966db2e491e17267",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc9318f913fc49709df1334b9786692e/2000.jpeg"
    },
    {
      "author": "JEFF MARTIN and CURT ANDERSON",
      "description": "STONECREST, Ga. (AP) — A funeral will be held Friday for a Black U.S. Air Force senior airman who was shot and killed in his Florida home by a sheriff's deputy, a day after the decorated military member's mother vowed during an emotional news conference to get justice for her son.",
      "publishedAt": "2024-05-17T04:10:28Z",
      "title": "Funeral set for Roger Fortson, the Black US Air Force member killed in his home by Florida deputy",
      "url": "https://apnews.com/6decf235d8acee616daaa5b9a08f85c9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0e0c10e368c437e85bec87f417f487f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}