{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli troops battled Hamas militants and attacked underground compounds on Tuesday with a focus on northern Gaza, from which an estimated 800,000 Palestinians have fled south despite continued Israeli bombardment across the besieged enclave.",
      "publishedAt": "2023-10-31T07:23:16Z",
      "title": "Israeli forces battle Hamas around Gaza City, as military says 800,000 have fled south",
      "url": "https://apnews.com/54ab6bd7f6861be86266770c245827e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e59c693ab5c24605b841e50a587a4db5/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The head of the United Nations agency for Palestinian refugees told a U.N. emergency meeting Monday “an immediate humanitarian cease-fire has become a matter of life and death for millions,” accusing Israel of “collective punishment” of Palestinians and the forced displacement of civilians.",
      "publishedAt": "2023-10-31T00:07:55Z",
      "title": "UN agency in Gaza says urgent cease-fire is a matter of life and death for millions of Palestinians",
      "url": "https://apnews.com/a26629bbda0c6b2e2bc46a6896c944fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e680d7521d3e44c39d79bf9030f4c448/3000.jpeg"
    },
    {
      "author": "DAVID SHARP, ROBERT F. BUKATY, JAKE BLEIBERG and BERNARD CONDON",
      "description": "LEWISTON, Maine (AP) — Five months before the deadliest mass shooting in Maine’s history, the gunman’s family alerted the local sheriff that they were becoming concerned about his deteriorating mental health while he had access to firearms, authorities said Monday.",
      "publishedAt": "2023-10-30T04:44:45Z",
      "title": "Maine mass shooter's family reached out to sheriff 5 months before rampage, sheriff's office says",
      "url": "https://apnews.com/35e78383dfb4fd84bfe07bcfc63760ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7286de432f64cd1a89ed8d8be23fc21/1920.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — Maui police held a news conference on Monday to show 16 minutes of body camera footage taken the day a wildfire tore through Lahaina town in August, including video of officers rescuing 15 people from a coffee shop and taking a severely burned man to a hospital.",
      "publishedAt": "2023-10-31T02:58:07Z",
      "title": "Maui police release 16 minutes of body camera footage from day of Lahaina wildfire",
      "url": "https://apnews.com/6639ee3a59dfea3f2b39614c79395b69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9739238645354273a34f841487da413e/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY",
      "description": "ACAPULCO, Mexico (AP) — Estela Sandoval Díaz was huddled in her tiny concrete bathroom, sure these were the final moments of her life, when Hurricane Otis ripped off her tin roof.With it went clothing, savings, furniture, photos and 33 years of the life Sandoval built piece-by-piece on the forgotten fringes of Acapulco, Mexico.",
      "publishedAt": "2023-10-30T19:58:30Z",
      "title": "Two hours of terror and now years of devastation for Acapulco's poor in Hurricane Otis aftermath",
      "url": "https://apnews.com/42841e8c9ef6a1e448f27a72dfc39c60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77f9e707afde49f09b65d02d8039290c/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — The videos playing in a Colorado courtroom were both chilling and, by now, familiar — a violent mob, with some wearing tactical gear, smashing through the U.S. Capitol, attacking police officers and chanting “Hang Mike Pence!”",
      "publishedAt": "2023-10-31T04:10:16Z",
      "title": "Does Jan. 6 constitutionally block Trump from 2024 ballot? Lawyers to make case on day 2 of hearing",
      "url": "https://apnews.com/6a8528813e29c9f45a0bb4972369e97e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff5b70995c104cc596c6b078cb323b1c/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Defense Secretary Lloyd Austin and Secretary of State Antony Blinken will make the case Tuesday that the United States should immediately send aid to Israel and Ukraine, testifying at a Senate hearing as the administration’s massive $105 billion emergency aid request for conflicts in those countries and others has already hit roadblocks in the divided Congress.",
      "publishedAt": "2023-10-31T04:04:16Z",
      "title": "Biden’s Cabinet secretaries will push a divided Congress to send aid to Israel and Ukraine",
      "url": "https://apnews.com/a56354873731af2ea5a96db227059969",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c8b94eabae1496183b7f4406a6f79e4/3000.jpeg"
    },
    {
      "author": null,
      "description": "AGUANGA, Calif. (AP) — A wildfire fueled by gusty Santa Ana winds ripped through rural land southeast of Los Angeles on Monday, forcing about 4,000 people from their homes, fire authorities said.The so-called Highland Fire erupted at about 12:45 p.m.",
      "publishedAt": "2023-10-31T05:32:52Z",
      "title": "Southern California wildfire prompts evacuation order for thousands as Santa Ana winds fuel flames",
      "url": "https://apnews.com/1f26223165d7306ab19f5831f8dff0db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcfc23df7908435ea661037b87d301c0/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — Chatbots like ChatGPT wowed the world with their ability to write speeches, plan vacations or hold a conversation as good as or arguably even better than humans do, thanks to cutting-edge artificial intelligence systems.",
      "publishedAt": "2023-10-31T06:05:51Z",
      "title": "Cutting-edge AI raises fears about risks to humanity. Are tech and political leaders doing enough?",
      "url": "https://apnews.com/ce89e842a176e55e46b6cc493cd515a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99dfa0956fbc4db6ac4bf65866bcd3e9/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Kenneth Williams spent his whole life in Brooklyn, but it wasn't until a night in 2018 when he crossed a narrow footbridge in shackles, that he learned about New York City’s last floating jail.",
      "publishedAt": "2023-10-31T04:19:09Z",
      "title": "Last operating US prison ship, a grim vestige of mass incarceration, set to close in NYC",
      "url": "https://apnews.com/9d552d4cda48b58bdb141a40dffc8df5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/becb1c6b514f4f38aa8240730d460bd5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}