{
  "articles": [
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Shohei Ohtani's interpreter fired by Los Angeles Dodgers after allegations of illegal gambling, theft from Japanese star.",
      "publishedAt": "2024-03-20T22:47:59Z",
      "title": "Shohei Ohtani's interpreter fired by Los Angeles Dodgers after allegations of illegal gambling, theft from Japanese star",
      "url": "https://apnews.com/b4fbf807a15491cecd8c7383faf13c2b",
      "urlToImage": ""
    },
    {
      "author": "ALANNA DURKIN RICHER and SUDHIN THANAWALA",
      "description": "ATLANTA (AP) — The judge overseeing the Georgia 2020 election interference case cleared the way Wednesday for Donald Trump and other defendants to appeal a ruling allowing Fulton County District Attorney Fani Willis to remain on the prosecution.",
      "publishedAt": "2024-03-20T15:06:29Z",
      "title": "Judge clears way for Trump to appeal ruling keeping Fani Willis on Georgia 2020 election case",
      "url": "https://apnews.com/d6df1ed788efac8bc37c3ce392cdc050",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/516232a901bf4dcca0e14d6a660cd580/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ and LINDSAY WHITEHURST",
      "description": "McALLEN, Texas (AP) — A dizzying volley of courtroom maneuvers over a Texas law that would allow the state to arrest and deport people who enter the U.S.",
      "publishedAt": "2024-03-20T06:19:56Z",
      "title": "Court action on Texas' migrant arrest law leads to confusion at the US-Mexico border",
      "url": "https://apnews.com/8e232b8a0c2979943c87c7309652ed34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d6741a2f6ad4486ac510817aaf040e4/1920.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — Israel is determined to launch a ground offensive against Hamas in Rafah, Gaza's southernmost town, a plan that has raised global alarm because of the potential for harm to the hundreds of thousands of civilians sheltering there.",
      "publishedAt": "2024-03-20T17:51:56Z",
      "title": "Why Israel is so determined to launch an offensive in Rafah",
      "url": "https://apnews.com/541e91c0f09196944a4dabeded94596f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9028067408024f31bf3dd52c91d9d615/3000.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG and EMILY WAGSTER PETTUS",
      "description": "JACKSON, Miss. (AP) — Two former Mississippi deputies wept in court Wednesday as a federal judge sentenced them to years in prison and condemned their cruelty for breaking into a home with four other white officers and torturing two Black men.",
      "publishedAt": "2024-03-20T05:10:58Z",
      "title": "Mississippi ex-deputy gets 40-year sentence as judge decries brutal attack on 2 Black men",
      "url": "https://apnews.com/94d9dcfa00e582b9d50a6eb7288b058b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bcba1bf8de94b75ad69d9b54081b0f0/1920.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congressional leaders from both parties looked to put a positive light on a $1.2 trillion spending package that lawmakers are working to approve before funding expires at midnight Friday for a host of key government agencies.",
      "publishedAt": "2024-03-20T22:09:18Z",
      "title": "Congressional leaders sell $1.2 trillion spending package to members before shutdown deadline",
      "url": "https://apnews.com/38ed7713ae6436ee27c81ce62b0a9a7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18e7165d632a450f8b5bb3f4069e1cd5/3000.jpeg"
    },
    {
      "author": "MATTHEW DALY and TOM KRISHER",
      "description": "WASHINGTON (AP) — The Biden administration announced new automobile emissions standards Wednesday that officials called the most ambitious plan ever to cut planet-warming emissions from passenger vehicles.",
      "publishedAt": "2024-03-20T15:32:49Z",
      "title": "EPA issues new auto rules aimed at cutting carbon emissions, boosting electric vehicles and hybrids",
      "url": "https://apnews.com/e6d581324af51294048df24269b5d20a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa1d2cf365cc4d0f95e8c186914f049c/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON and MARK THIESSEN",
      "description": "A white supremacist Idaho prison gang member and an accomplice remained on the loose Wednesday after the accomplice staged a brazen overnight attack to free the inmate as he was being transported from a Boise hospital, police said.",
      "publishedAt": "2024-03-20T14:12:30Z",
      "title": "Idaho police search for escaped inmate and accomplice after ambush at Boise hospital",
      "url": "https://apnews.com/e7381ac66bbf4c5d8ea9eebb51a70ab0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af2894e5c59a4831b87642f2f28b35e5/1920.jpeg"
    },
    {
      "author": "MARTHA MENDOZA, MAHESH KUMAR and PIYUSH NAGPAL",
      "description": "SAN FRANCISCO (AP) — Noriko Kuwabara was excited to try a new recipe she’d seen on social media for crispy shrimp spring rolls, so she and her husband headed to Costco’s frozen foods aisle. But when she grabbed a bag of farm-raised shrimp from the freezer and saw “Product of India,” she wrinkled her nose.",
      "publishedAt": "2024-03-20T15:13:37Z",
      "title": "AP finds grueling conditions in Indian shrimp industry that report calls 'dangerous and abusive'",
      "url": "https://apnews.com/e5b51878eafbb6e28977710b191eb7de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b3cb841d04447f79377f506181b8dbc/1920.jpeg"
    },
    {
      "author": null,
      "description": "LOS ANGELES (AP) — Shohei Ohtani’s interpreter and close friend has been fired from the Los Angeles Dodgers following allegations of illegal gambling and theft from the Japanese baseball star.Interpreter Ippei Mizuhara was let go from the team Wednesday following reports from The Los Angeles Times and ESPN about his alleged ties to an illegal bookmaker.",
      "publishedAt": "2024-03-20T22:51:20Z",
      "title": "Shohei Ohtani's interpreter fired by Dodgers after allegations of illegal gambling, theft",
      "url": "https://apnews.com/13a0238b89bfad4a4e508a5fef944537",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1cfd464cff1d43a3a2c08f324f980f79/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}