{
  "articles": [
    {
      "author": "ROB GILLIES and FATIMA HUSSEIN",
      "description": "WEST PALM BEACH, Fla. (AP) — Canadian Prime Minister Justin Trudeau flew to Florida on Friday to have dinner with President-elect Donald Trump at his Mar-a-Lago club after Trump threatened to impose sweeping tariffs on Canadian products.",
      "publishedAt": "2024-11-29T18:19:00Z",
      "title": "Canadian Prime Minister Trudeau flies to Florida to meet with Trump after tariffs threat",
      "url": "https://apnews.com/4129d793d8e1a60fd6d1f45697901a21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33902a102a2f4042af58ab56fc18b68f/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — In the days after the presidential election, Sadie Perez began carrying pepper spray with her around campus. Her mom also ordered her and her sister a self-defense kit that included keychain spikes, a hidden knife key and a personal alarm.",
      "publishedAt": "2024-11-30T05:07:06Z",
      "title": "Emboldened 'manosphere' accelerates threats and demeaning language toward women after US election",
      "url": "https://apnews.com/d5cea53480437ac8bf837aaa821e5681",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbea7d32462b45048d180fb581e21351/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The 13-year civil war in Syria has roared back into prominence with a surprise rebel offensive on Aleppo, one of Syria's largest cities and an ancient business hub.",
      "publishedAt": "2024-11-29T22:21:07Z",
      "title": "What to know about sudden rebel gains in Syria's 13-year war and why it matters",
      "url": "https://apnews.com/2be43ee530b7932b123a0f26b158ac22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97903e9a259547e3be50e2cb31a3822c/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and BASSEM MROUE",
      "description": "TEL AVIV, Israel (AP) — Israeli aircraft struck Hezbollah weapons smuggling sites along Syria's border with Lebanon, the Israeli military said Saturday, testing a fragile, days-old ceasefire that halted months of fighting between the sides but has seen continued sporadic fire.",
      "publishedAt": "2024-11-30T10:33:01Z",
      "title": "Israel says it struck Hezbollah weapons smuggling sites in Syria, testing a fragile ceasefire",
      "url": "https://apnews.com/506c8f976ad62afcf2a0ec977a8b6451",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea4695837be6445598979f5d48c97b6f/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "TYRE, Lebanon (AP) — The ceasefire between Israel and Hezbollah brought hope for normality back to many in southern Lebanon on Friday, including fishermen who have long launched their single-engine wooden boats into the Mediterranean at dawn.",
      "publishedAt": "2024-11-30T05:46:05Z",
      "title": "Fishers at a Lebanese port hope ceasefire with Israel means normal life is returning",
      "url": "https://apnews.com/1eb9dad3ab8f0f5dae73db12a17f1a94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9efc88ef1b943f790f66afca4015688/3000.jpeg"
    },
    {
      "author": "MAURICIO SAVARESE and ELÉONORE HUGHES",
      "description": "SAO PAULO (AP) — Brazil's Federal Police in late November formally accused far-right former President Jair Bolsonaro and 36 others of planning a coup to keep him in office.",
      "publishedAt": "2024-11-30T04:07:59Z",
      "title": "How Brazilian police say Bolsonaro plotted a coup to stay in office",
      "url": "https://apnews.com/43bae30906925a8dc04e319b901488f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96603225835047af95b0b015b6fb354f/3000.jpeg"
    },
    {
      "author": "SOPHIKO MEGRELIDZE",
      "description": "TBILISI, Georgia (AP) — Thousands of demonstrators protesting the Georgian government's decision to suspend negotiations to join the European Union rallied outside the parliament and clashed with police for a second straight night on Friday.",
      "publishedAt": "2024-11-29T07:50:22Z",
      "title": "Georgian protesters clash with police for a second night after EU talks are suspended",
      "url": "https://apnews.com/9f6e6f274e61fea2c50bfaba0850f004",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3982542f18884c139054c9c7b99ec4d0/1920.jpeg"
    },
    {
      "author": "STEPHEN McGRATH",
      "description": "BUCHAREST, Romania (AP) — Hundreds of protesters gathered in Bucharest after a far-right populist unexpectedly won the first round of a presidential race, plunging Romania into turmoil just days before the country holds parliamentary elections.",
      "publishedAt": "2024-11-30T05:26:48Z",
      "title": "Romania's parliamentary vote risks being overshadowed by presidential race chaos",
      "url": "https://apnews.com/42548c4841392bd7a504761752e0970c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6cafe97d5f54682931b5ab1f47a6682/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un vowed his country will “invariably support” Russia’s war in Ukraine as he met Russia's defense chief, the North’s state media reported Saturday.",
      "publishedAt": "2024-11-30T02:30:52Z",
      "title": "North Korea's Kim vows steadfast support for Russia’s war in Ukraine",
      "url": "https://apnews.com/35a6fd80f64ae2dd01637ed5e5b6451d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3892c749f56348e39fad4d698915cd44/1920.jpeg"
    },
    {
      "author": "CAROLYN THOMPSON",
      "description": "BUFFALO, N.Y. (AP) — The first big snow of the season threatened to bury towns in New York along lakes Erie and Ontario during a hectic holiday travel and shopping weekend. In Michigan, heavy lake-effect snow in northern parts of the state was expected to continue into the weekend, according to the National Weather Service in Gaylord.",
      "publishedAt": "2024-11-30T05:12:16Z",
      "title": "New York state and Michigan brace for lake-effect snow that could snarl travel and disrupt football",
      "url": "https://apnews.com/c7dd6d98b0170c25972baa5dd27d1649",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8829710fedf942298617fe40f424031a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}