{
  "articles": [
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s parliament voted Saturday to impeach President Yoon Suk Yeol over his short-lived martial law decree, a historic rebuke that was cheered by jubilant crowds who described the outcome as another defiant moment in the nation’s resilient democratic journey.",
      "publishedAt": "2024-12-14T01:44:38Z",
      "title": "South Korea’s parliament votes to impeach President Yoon Suk Yeol over his martial law order",
      "url": "https://apnews.com/6432768aafc8b55be26215667e3c19d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/130fbc178f03497d8d45e30feee10412/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s parliament on Saturday voted to impeach embattled President Yoon Suk Yeol over his short-lived martial law decree this month, a shocking stunt that paralyzed the country’s politics, halted foreign policy and spooked financial markets.",
      "publishedAt": "2024-12-12T09:51:26Z",
      "title": "A look at the whirlwind events that led to the impeachment of South Korea's president",
      "url": "https://apnews.com/336b2e3defa5c4e36221ca08ae75cbc7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b383fa34bb5043a6a0c6ec4d11642e69/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY, MICHAEL HILL and GEOFF MULVIHILL",
      "description": "Texas has sued a New York doctor for prescribing abortion pills to a woman near Dallas, launching one of the first challenges in the U.S. to shield laws that Democrat-controlled states passed to protect physicians after Roe v.",
      "publishedAt": "2024-12-13T19:31:11Z",
      "title": "Texas' abortion pill lawsuit against New York doctor marks new challenge to interstate telemedicine",
      "url": "https://apnews.com/74c9b7d5c3c152e4c8f199b29132daec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/92724ccc11f14268a40f5de0dca1ab87/2557.jpeg"
    },
    {
      "author": "BASSEM MROUE and KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — A severely hobbled Hezbollah was in no position to help defend former Syrian President Bashar Assad, a longtime ally, from the lightning-fast insurgency that toppled him. With Assad gone, the militant group based in Lebanon is even weaker.",
      "publishedAt": "2024-12-14T05:05:49Z",
      "title": "A diminished Hezbollah is made even weaker by the toppling of Assad in Syria",
      "url": "https://apnews.com/fadc4fa97f2036a24f821f51e4eb6634",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f865e4171d7e47af82414cab1a614059/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The U.S. military has transported out of Syria an American who had disappeared seven months ago into former President Bashar Assad’s notorious prison system and was among the thousands released this week by rebels, U.S.",
      "publishedAt": "2024-12-13T18:57:44Z",
      "title": "US military flies American released from Syrian prison to Jordan, officials say",
      "url": "https://apnews.com/443d1c3b2b9cf551cdcfdff22bdcedc9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12bcbed3c5d54190a1027977441f9f86/3000.jpeg"
    },
    {
      "author": "SOPHIKO MEGRELIDZE",
      "description": "TBILISI, Georgia (AP) — Former soccer player Mikheil Kavelashvili became president of Georgia on Saturday, as the ruling party tightened its grip in what the opposition calls a blow to the country’s EU aspirations and a victory for former imperial ruler Russia.",
      "publishedAt": "2024-12-14T05:23:30Z",
      "title": "Ex-soccer player Kavelashvili becomes Georgia's president in a blow to its EU aspirations",
      "url": "https://apnews.com/3a7f5018879c77b6c596d312a163b79c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4dbf9a66e0b42768d84ddfadc251235/3000.jpeg"
    },
    {
      "author": "SIBI ARASU",
      "description": "BENGALURU, India (AP) — Despite two weeks of U.N.-sponsored talks in Saudi Arabia’s Riyadh, the participating 197 nations failed to agree early Saturday on a plan to deal with global droughts, made longer and more severe by a warming climate.",
      "publishedAt": "2024-12-14T06:27:52Z",
      "title": "UN talks fail to reach agreement on dealing with rising risk of global drought",
      "url": "https://apnews.com/a353d12a2fe8c19e932f96198fa3421d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/711a13e0d0b746feb5372e1c319efdca/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — President-elect Donald Trump’s lawyers urged a judge again Friday to throw out his hush money conviction, balking at the prosecution’s suggestion of preserving the verdict by treating the case the way some courts do when a defendant dies.",
      "publishedAt": "2024-12-13T20:29:26Z",
      "title": "Trump’s lawyers rebuff DA's idea for upholding his hush money conviction, calling it 'absurd'",
      "url": "https://apnews.com/ab70a9078e7c89006b21ed416f112ce0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16351d6c50564bedbcf9c42dbaba8f4b/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "A federal appeals court on Friday left in place a mid-January deadline in a federal law requiring TikTok to be sold or face a ban in the United States, rejecting a request made by the company to halt enforcement until the Supreme Court reviews its challenge of the statute.",
      "publishedAt": "2024-12-14T00:55:15Z",
      "title": "Court denies TikTok's request to halt enforcement of potential US ban until Supreme Court review",
      "url": "https://apnews.com/504a7b4a13184ab171415d3800017fa7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/212fa50df473435fa576c5dbcd465c0f/3000.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI",
      "description": "TOMS RIVER, N.J. (AP) — Gov. Phil Murphy has asked the Biden administration to put more resources into an investigation of mysterious drone sightings that have been reported in New Jersey and nearby states.",
      "publishedAt": "2024-12-13T18:59:08Z",
      "title": "New Jersey governor wants more federal resources for probe into drone sightings",
      "url": "https://apnews.com/82f3d8bc816350dbfc0953e5de6063e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbc4b8b657f243b993e1aeb622d887d6/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}