{
  "articles": [
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Tiers of graves are stacked deep underground in a bloated Gaza cemetery, where Sa’di Baraka spends his days hacking at the earth, making room for more dead.",
      "publishedAt": "2024-08-15T10:43:28Z",
      "title": "As Gaza death toll passes 40,000, corpses are buried in yards, streets, tiered graves",
      "url": "https://apnews.com/988d16b648e06e222f04964dc9440da0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7324a26694034ed099568ad064fc0055/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Some families of hostages held in Gaza believe the latest round of cease-fire talks between Israel and Hamas could be the last best chance to set their loved ones free after more than 300 days of captivity.",
      "publishedAt": "2024-08-16T04:08:31Z",
      "title": "Families of hostages in Gaza hope cease-fire talks will end their nightmare",
      "url": "https://apnews.com/339a8dd7966143f04f012fa4d2b67162",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6834dc04259421782a9bdcb3564c61d/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "A daring Ukrainian military push into Russia’s Kursk region has seen Kyiv's forces seize scores of villages, take hundreds of prisoners and force the evacuation of tens of thousands of civilians in what has become the largest attack on the country since World War II.",
      "publishedAt": "2024-08-16T04:10:08Z",
      "title": "Ukraine’s swift push into the Kursk region shocked Russia and exposed its vulnerabilities",
      "url": "https://apnews.com/1178b99b32b476816db3a48ffa06b11a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/360c1b78d8744f21b2127fbba23d2c88/3000.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO, MICHAEL R. BLOOD and ALAN SUDERMAN",
      "description": "WASHINGTON (AP) — As California’s attorney general, Kamala Harris successfully defended the death penalty in court, despite her past crusade against it.As a new senator, she proposed to abolish cash bail — a reversal from when she chided San Francisco judges for making it “cheaper” to commit crimes by setting bail amounts too low.",
      "publishedAt": "2024-08-16T04:41:06Z",
      "title": "What do marijuana, the death penalty and fracking have in common? Harris shifted positions on them",
      "url": "https://apnews.com/f35dbacc2137e6aebc214befd4503ff8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/deda05646db44bf58d71474a52ef0b9c/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "Former President Donald Trump on Thursday gave his second news conference in as many weeks as he adjusts to a newly energized Democratic ticket ahead of next week's Democratic National Convention.",
      "publishedAt": "2024-08-15T23:49:24Z",
      "title": "FACT FOCUS: Trump blends falsehoods and exaggerations at rambling NJ press conference",
      "url": "https://apnews.com/f8ed52f64a12cf450b0d0f2591c9d92b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa795622c6594802a2bb90d0b6af884e/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — Five summers ago, Donald Trump’s running mate JD Vance — then a 34-year-old memoirist and father of a 2-year-old boy — took the stage at a conservative conference and tackled an issue that would become a core part of his political brand: the United States' declining fertility rate.",
      "publishedAt": "2024-08-16T04:38:44Z",
      "title": "Beyond 'childless cat ladies,' JD Vance has long been on a quest to encourage more births",
      "url": "https://apnews.com/555c0f78ef8dd4c13c88b9e8d5f0024a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2906e6bb717b4294a6e7221bf9ab566d/2828.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "BANGKOK (AP) — Thailand’s Parliament elected Paetongtarn Shinawatra, the youngest daughter of the divisive former leader Thaksin Shinawatra, as the country’s new prime minister Friday.",
      "publishedAt": "2024-08-16T03:07:02Z",
      "title": "Parliament elects Thaksin's daughter Paetongtarn Shinawatra as Thailand's prime minister",
      "url": "https://apnews.com/59d65bc10b9a7e16505b9e574a1ba66b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b65bfd5a39a542248f7b8f52a60379d8/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — Venezuela’s opposition was dealt a blow Thursday when countries that had been pressuring President Nicolás Maduro to release vote tallies backing his claim to victory in last month’s presidential election began suggesting a repeat of the contest instead.",
      "publishedAt": "2024-08-15T14:41:36Z",
      "title": "Venezuela's opposition faces setback after countries suggest repeat of presidential election",
      "url": "https://apnews.com/1c3afbf01f4c85e7903c2fc3d7fdbf38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e50f86933190459b9309d190a0a110e7/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.",
      "publishedAt": "2024-08-15T11:05:42Z",
      "title": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda, leaving many in Puerto Rico without power",
      "url": "https://apnews.com/6d919d9b8f9831c8a664457aeebdb8da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec9a2bacde954b94941ad48d9c936c41/1920.jpeg"
    },
    {
      "author": "ANDREW DALTON and KAITLYN HUAMANI",
      "description": "LOS ANGELES (AP) — Nearly 10 months after the death of Matthew Perry, the long-simmering investigation into the ketamine that killed him came dramatically into public view with the announcement that five people had been charged with having roles in the overdose of the beloved “Friends” star.",
      "publishedAt": "2024-08-16T05:22:51Z",
      "title": "Matthew Perry's death leads to sweeping indictment of 5, including doctors and reputed dealers",
      "url": "https://apnews.com/eb5fd5af85e2cffdc61642b7a4fbe0b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/233f68aa8a9c4f6d9d91c746a2146768/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}