{
  "articles": [
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — He is among the very last survivors of his Gaza family, a clan so close they knew without thinking how blood and marriage bound them across generations and city blocks.Then, branch by branch, 173 of Youssef Salem’s relatives were killed in Israeli airstrikes in a matter of days in December.",
      "publishedAt": "2024-06-17T05:15:25Z",
      "title": "The war in Gaza has wiped out entire Palestinian families. AP documents 60 who lost dozens or more",
      "url": "https://apnews.com/a9f8bcfe402c17f1f78903eae67b7a7d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb990505be184f39add1ea19783bc449/1920.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN, WAFAA SHURAFA and LEE KEATH",
      "description": "JERUSALEM (AP) — Israel's military announced on Sunday that it would pause fighting during daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries for desperate Palestinians enduring a humanitarian crisis sparked by the war, now in its ninth month.",
      "publishedAt": "2024-06-16T04:01:50Z",
      "title": "Israel's army says it will pause daytime fighting along a route in southern Gaza to help flow of aid",
      "url": "https://apnews.com/8c111f2dcf783f8671e6dd6f19547b17",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c22532abd82e4a25bc4d4fa7f36e9606/1920.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "OBBÜRGEN, Switzerland (AP) — Nearly 80 countries called Sunday for the “territorial integrity” of Ukraine to be the basis for any peace agreement to end Russia’s two-year war, though some key developing nations at a Swiss conference did not join in.",
      "publishedAt": "2024-06-16T11:21:04Z",
      "title": "78 countries at Swiss conference agree Ukraine's territorial integrity must be basis of any peace",
      "url": "https://apnews.com/568cafee5fbe9c3b19b79b041583a5d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3eff720d9464b6498f8c2260e9921e9/1920.jpeg"
    },
    {
      "author": "ALI SWENSON, DAN MERICA and GARANCE BURKE",
      "description": "Adrian Perkins was running for reelection as the mayor of Shreveport, Louisiana, when he was surprised by a harsh campaign hit piece.The satirical TV commercial, paid for by a rival political action committee, used artificial intelligence to depict Perkins as a high school student who had been called into the principal’s office.",
      "publishedAt": "2024-06-17T04:04:40Z",
      "title": "AI experimentation is high risk, high reward for low-profile political campaigns",
      "url": "https://apnews.com/1d5080a5c916d5ff10eadd1d81f43dfd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50d51a459396408a81f433e76ae97f20/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "ABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA (AP) — The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the U.S. Navy, but it's still fighting — despite repeated false claims by Yemen's Houthi rebels.",
      "publishedAt": "2024-06-17T05:05:18Z",
      "title": "US aircraft carrier counters false Houthi claims with 'Taco Tuesdays' as deployment stretches on",
      "url": "https://apnews.com/5dc09566c116913ed316eff87f3eff82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2d595dc698741949dac8ec4ed491d1e/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIJING (AP) — A Chinese vessel and a Philippine supply ship collided near the disputed Spratly Islands in the South China Sea on Monday, China’s coast guard said.The coast guard said a Philippine supply ship entered waters near the Second Thomas Shoal, a submerged reef in the Spratly Islands that’s part of territory claimed by several nations.",
      "publishedAt": "2024-06-17T03:17:58Z",
      "title": "China says a Chinese vessel and Philippine supply ship collided in the disputed South China Sea",
      "url": "https://apnews.com/8c14b945066967189b01d701b17c10ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6e7c6e18c69943ee82dad4dcf5f6b3c1/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI",
      "description": "JAKARTA, Indonesia (AP) — Muslims in Asia on Monday celebrated Eid al-Adha, or the Feast of Sacrifice, with food and prayers for people in Gaza suffering from the Israel-Hamas war.",
      "publishedAt": "2024-06-17T03:01:20Z",
      "title": "Muslims in Asia celebrate Eid al-Adha with sacrifice festival and traditional feast",
      "url": "https://apnews.com/3c357a46b0329e794bbefe51fe83242c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eb01c0b48216425480dcfb25ae42a2fc/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "PHOENIX (AP) — Heat and cold extremes are expected this week in the U.S. Officials warned Southwest residents to take precautions as a heat wave moves east, while heavy rains and flooding could drench the Gulf states and snow threatens parts of the Rockies and Northwest.",
      "publishedAt": "2024-06-17T05:28:48Z",
      "title": "Severe weather forecast around US with high Southwest temperatures, Gulf rain and Rockies snow",
      "url": "https://apnews.com/43b96b6f2996b9735e8b201b8dd3cc31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1d748d85a9743298c1f868b70ab7665/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and HOLLY RAMER",
      "description": "PORTLAND, Maine (AP) — The deadly implosion of an experimental submersible en route to the deep-sea grave of the Titanic last June has not dulled the desire for further ocean exploration, despite lingering questions about the disaster.",
      "publishedAt": "2024-06-17T04:14:26Z",
      "title": "A year after the Titan's tragic dive, deep-sea explorers vow to pursue ocean's mysteries",
      "url": "https://apnews.com/05903e98b0155b9d69249b86d3df6c89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea523e6e81044e8794705d4cb81528b8/1920.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — “The Outsiders,” a gritty adaptation of the classic young adult novel, became the essence of a Broadway insider on Sunday, winning the Tony Award for best new musical on a night when women made strides.",
      "publishedAt": "2024-06-16T05:00:38Z",
      "title": "'The Outsiders' wins best musical and 'Stereophonic' best play as women make strides at Tony Awards",
      "url": "https://apnews.com/160b563f159adb750c0691e665161a9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/07322c3a0de347e89d72fd7243135653/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}