{
  "articles": [
    {
      "author": "Giovanna Dell'Orto",
      "description": "A vast network of labor unions, progressive organizations and clergy has been asking Minnesotans to stay away from work, school and stores Friday to protest against immigration enforcement in the state. The Twin Cities of Minneapolis and St. Paul have seen daily protests since Renee Good was fatally shot by a U.S. Immigration and Customs Enforcement officer during an operation on Jan. 7. Federal law enforcement officers have surged in the area for weeks and have repeatedly squared off with community members and activists who track their movements online and in the streets. But Friday’s mobilization was planned as the largest action to date, including a march in downtown Minneapolis despite dangerously cold temperatures.",
      "publishedAt": "2026-01-23T06:03:30Z",
      "title": "Minnesota plans anti-immigration enforcement protest",
      "url": "https://apnews.com/article/minnesota-ice-immigration-protest-unions-faith-leaders-edc6c4884f8cc26be9ad34a28d82a7a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/ac27d9a/2147483647/strip/true/crop/4000x2665+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F8b%2Fd1f15a005436db8125f6ff36b6d4%2Fc14ba30bb64f40cbb245b426ab2e7818"
    },
    {
      "author": "Julie Watson, Amy Taxin",
      "description": "It has become common knowledge in immigrant communities across the U.S. to not open the door for federal immigration agents unless they show a warrant signed by a judge. But an internal Immigration and Customs Enforcement memo obtained by The Associated Press states immigration officers can forcibly enter people’s homes without a judge’s warrant. That marks a dramatic shift that could upend the legal advice given to immigrants for decades. Law enforcement and legal experts warn if more agents barge into homes, everyone could be put at greater risk.",
      "publishedAt": "2026-01-23T06:02:13Z",
      "title": "Memo allowing ICE to forcibly enter homes without judge's warrant raises alarm",
      "url": "https://apnews.com/article/ice-arrests-warrants-forced-entry-fourth-amendment-26e9b492c7850982a85c554c24695a23",
      "urlToImage": "https://dims.apnews.com/dims4/default/cff82c9/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2F96%2Fbacc59e219440d8b60d563987b72%2F145f4ffd78d94e14acb31f76e807667d"
    },
    {
      "author": "Kamila Hrabchuk, Kostya Manenkov",
      "description": "Russian President Vladimir Putin discussed the settlement in Ukraine with U.S. President Donald Trump’s envoys during marathon overnight talks, and the Kremlin insisted that the territorial issue needs to be resolved to make peace. The Kremlin meeting, which lasted past 3 a.m. Friday, came hours after Ukraine’s President Volodymyr Zelenskyy sharply criticized his European allies Thursday for what he cast as their slow and fragmented response to Russia’s nearly four-year full-scale invasion. Kremlin foreign affairs adviser Yuri Ushakov, who took part in Putin’s meeting with Trump’s envoys Steve Witkoff and Jared Kushner, said it would be impossible to reach a peace deal “without solving the territorial issue.”",
      "publishedAt": "2026-01-23T03:49:02Z",
      "title": "Kremlin says territorial issue key obstacle to Ukraine peace",
      "url": "https://apnews.com/article/russia-ukraine-trump-putin-witkoff-kushner-zelenskyy-e985cdc189a479c7618ba4523a50463a",
      "urlToImage": "https://dims.apnews.com/dims4/default/56f4dd2/2147483647/strip/true/crop/5185x3455+122+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F55%2F3628d60cc8dcc02dc20e63242455%2F6322614c377e46c38df6a06dc9db98e7"
    },
    {
      "author": "Toqa Ezzidin, Julia Frankel",
      "description": "Desperate Palestinians at a garbage dump in a Gaza neighborhood are digging with their bare hands for plastic items to burn to keep warm in the cold and damp winter in the enclave, battered by two years of the Israel-Hamas war. The scene in the Muwasi area of the city of Khan Younis contrasted starkly with the vision of the territory projected by world leaders gathered in Davos, Switzerland, where they inaugurated U.S. President Donald Trump’s Board of Peace that will oversee Gaza on Thursday. Trump claimed in Davos this week that “record levels” of humanitarian aid had entered Gaza since the October start of a U.S.-brokered ceasefire deal. His envoys touted the enclave's development potential.",
      "publishedAt": "2026-01-22T14:54:35Z",
      "title": "Families dig through garbage in Gaza for things to burn to keep warm",
      "url": "https://apnews.com/article/gaza-hamas-israel-crisis-palestinian-b0bb6f00ab69c82f52c8758745eaea78",
      "urlToImage": "https://dims.apnews.com/dims4/default/426d818/2147483647/strip/true/crop/6888x4590+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F98%2F2e3b91255d76223dd6138c390b3e%2F580d2b96a1e94dd1918358279bd6a60f"
    },
    {
      "author": "Jon Gambrell",
      "description": "Activists report that Iran's crackdown on nationwide protests has killed at least 5,002 people. Many more are feared dead, but information is scarce in part because Iran has imposed the most comprehensive internet blackout in its history. The U.S.-based Human Rights Activists News Agency provided the latest death toll Friday and noted more than 26,800 people have been detained. Iran's government says 3,117 have died, but it has a history of giving lower tolls for political reasons. The Associated Press has been unable to verify these numbers due to the two-week internet shutdown. Meanwhile, the U.S. has moved an aircraft carrier group closer to the Middle East, and President Donald Trump is warning of potential action against Iran.",
      "publishedAt": "2026-01-23T01:56:39Z",
      "title": "Iran's protest crackdown has killed more than 5,000, activists say",
      "url": "https://apnews.com/article/iran-protests-crackdown-death-toll-acb1968a973f19be217ea28b4a7adb0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/969d896/2147483647/strip/true/crop/7859x5237+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F0e%2F89ce70c59833609365cc4701e539%2Fb4a0c36b59c94051a4e404dbde9a4514"
    },
    {
      "author": "Mari Yamaguchi",
      "description": "Japan’s Prime Minister Sanae Takaichi has dissolved the lower house of Parliament, paving the way for a Feb. 8 snap election. The move Friday is an attempt to capitalize on her popularity to help governing party regain ground after major losses in recent years, but will delay a vote on a budget that aims at boosting a struggling economy and addressing soaring prices. Takaichi was elected in October as Japan’s first female leader.",
      "publishedAt": "2026-01-23T04:02:25Z",
      "title": "Japan's Takaichi dissolves parliament, setting up February snap election",
      "url": "https://apnews.com/article/japan-politics-takaichi-parliament-dissolution-election-74e9b32eb12a6f9823242255b92150b2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4eb4f98/2147483647/strip/true/crop/4972x3313+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2F10%2Fa3b24585380a6e70912bc971321e%2F7aff745a55854296a27e9c184ac04983"
    },
    {
      "author": "Emilie Megnien, Jeffrey Collins, Jamie Stengle",
      "description": "Texas and Oklahoma are bracing for ice and heavy snow in what forecasters predict will be some of the initial major effects of a huge winter storm. The forecasted days-long event threatens catastrophic damage, extensive power outages and bitterly cold weather in the eastern two-thirds of the U.S. Forecasters warn the storm could rival a hurricane in damage to power lines and trees, especially in areas with heavy ice. The storm is expected to start Friday in New Mexico, Texas and Oklahoma, moving east through the South and then up the coast into New England. Bitterly cold air could follow, with wind chills dropping to minus 50 degrees Fahrenheit in parts of Minnesota and North Dakota.",
      "publishedAt": "2026-01-23T06:00:58Z",
      "title": "Texas and Oklahoma brace for heavy snow and crippling ice",
      "url": "https://apnews.com/article/winter-storm-snow-ice-texas-oklahoma-e970ee13ffaaf870f51dfa1540607604",
      "urlToImage": "https://dims.apnews.com/dims4/default/9377c6e/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2Ffe%2F6b74ea68fa1708678ddad76eea04%2Fbbb9bf56d05f49bdad16889bdef33cbf"
    },
    {
      "author": "Kaitlyn Huamani",
      "description": "TikTok has finalized a deal to create a new American entity, avoiding the looming threat of a ban in the U.S. that has been in discussion for years. The social video platform company signed agreements with major investors including Oracle, Silver Lake and MGX to form the joint venture. The new version will operate under “defined safeguards” with an emphasis on data protections and software assurances for U.S. users, the company said in a statement Thursday. The establishment of a U.S. unit marks the end of years of uncertainty about the fate of the popular video-sharing platform in the United States.",
      "publishedAt": "2026-01-23T01:43:05Z",
      "title": "TikTok finalizes deal to form new US unit",
      "url": "https://apnews.com/article/tiktok-deal-us-china-eccb46c3bfee4cf3d362a01fe4968a4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c704b51/2147483647/strip/true/crop/3077x2050+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F66%2F2bac3eab8b6bc2092f3be5c760b8%2F63068171209947e9b2a96af8438c9fbd"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "European shares are mixed after markets advanced in Asia. U.S. futures turned lower early Friday. The Bank of Japan kept its key interest rate unchanged, as expected. Oil prices and the prices of gold and silver rose. On Thursday, the S&P 500 climbed 0.5%, extending its rally after President Donald Trump called off tariffs on European countries that he said opposed his calls for U.S. control of Greenland. The Dow Jones Industrial Average rose 0.6%, and the Nasdaq composite gained 0.9%. Details are still sparse about a deal on Greenland that Trump said he reached with the head of NATO, leaving investors wary of what's to come.",
      "publishedAt": "2026-01-23T05:15:33Z",
      "title": "World shares are mixed and US futures slip as investors remain wary",
      "url": "https://apnews.com/article/stocks-markets-japan-trump-6e894c8ecd7de9e05ad245beed41bd3e",
      "urlToImage": "https://dims.apnews.com/dims4/default/6e83e22/2147483647/strip/true/crop/4309x2871+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fab%2F3bfb6c22c5fa860e2e10e102784f%2F8dd17d0cd3344bf59e901fe93b7355a8"
    },
    {
      "author": "Eric Tucker, Mary Clare Jalonick, Lisa Mascaro, Alanna Durkin Richer",
      "description": "Former Justice Department special counsel Jack Smith has defended his investigations of Donald Trump at a public congressional hearing. Smith insisted Thursday he acted without regard to politics and had no second thoughts about the criminal charges he brought. Smith said no one should be above the law, and the law required that Trump “be held to account.” Smith's criminal investigations in Washington, D.C., and Florida shadowed Trump during his 2024 Republican presidential campaign. He testified behind closed doors last month but returned to the House Judiciary Committee for the public hearing. Republican lawmakers looked to undermine Smith while Democrats hoped to elicit damaging testimony about Trump’s conduct. Trump says Smith has “destroyed many lives.”",
      "publishedAt": "2026-01-22T11:25:44Z",
      "title": "Jack Smith testifies at public hearing on his Trump investigations",
      "url": "https://apnews.com/article/jack-smith-congress-justice-department-trump-056c73bd6b5c46dc213266aa01677f36",
      "urlToImage": "https://dims.apnews.com/dims4/default/f683146/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F94%2F9f5b8a39794633536f5283d58826%2Fc7bd0eb57c1242bc9540bd4afcff410c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}