{
  "articles": [
    {
      "author": "Lisa Mascaro, Josh Boak",
      "description": "President Donald Trump’s 2026 budget plan would slash non-defense domestic spending by $163 billion, while increasing expenditures on national security. That's according to statements released by the White House on Friday. The budget showed a desire to crack down on diversity programs and initiatives to address climate change. But the administration has yet to release detailed tables on what it wants income taxes, tariffs or the budget deficit to be. This budget is engineered by Trump budget director Russell Vought, a chief architect of Project 2025. It comes as Congress is already deep into drafting the Republican president's big bill of tax breaks, spending cuts and bolstered money for deportations and border security.",
      "publishedAt": "2025-05-02T12:04:48Z",
      "title": "White House will unveil Trump's 2026 budget",
      "url": "https://apnews.com/article/trump-budget-taxes-spending-vought-4549eb165410186da001c8cdce462492",
      "urlToImage": "https://dims.apnews.com/dims4/default/8399a22/2147483647/strip/true/crop/4468x2513+0+232/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb5%2Fa0%2Fee970540346605ce3aa8b66ff39d%2Feb34fd75a3b945379d31da80793398ef"
    },
    {
      "author": "Sam Mednick, Lee Keath",
      "description": "Israel has blocked aid from entering Gaza for two months and says it won’t allow food, fuel, water or medicine into the besieged territory until it can prevent Hamas and other militants from siphoning it away from Palestinian civilians. But officials from the U.N. and aid groups say proposals Israel has floated to use its military to distribute vital supplies are untenable. They are problematic, these officials say, because they allow military and political objectives to impede humanitarian goals, put restrictions on who is eligible to give and receive aid, and could force large numbers of Palestinians to move — which would violate international law.",
      "publishedAt": "2025-05-03T05:15:33Z",
      "title": "Groups fear Israeli proposal for controlling aid in Gaza will forcibly displace people",
      "url": "https://apnews.com/article/gaza-aid-displacement-humanitarian-crisis-ddcd504e37edeb52ef70772a70e76941",
      "urlToImage": "https://dims.apnews.com/dims4/default/41aae50/2147483647/strip/true/crop/7669x4314+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F09%2Fb246b4d46d1ce2e4c7342d571e2d%2Ffd080e0692d743899cc02f95445649ab"
    },
    {
      "author": "Nicole Winfield",
      "description": "British Cardinal Vincent Nichols provides an insider's view of what's going on in these days before the conclave to elect a successor to Pope Francis. The archbishop of Westminster is participating in his first conclave, and says these are days of ''attentive listening,\" as cardinals get to know one another and identify what the Catholic Church needs in a new leader. His predecessor as archbishop of Westminster was a key behind-the-scenes player in the 2013 conclave that elected an Argentine Jesuit pope.",
      "publishedAt": "2025-05-03T05:18:13Z",
      "title": "Dinner parties, listening and lobbying. What goes on behind closed doors to elect a pope",
      "url": "https://apnews.com/article/conclave-lobbying-new-pope-53a036f2763234537469290ca0f06333",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe888df/2147483647/strip/true/crop/7409x4168+0+386/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2F98%2F310abc232090af8f9141cadb0f2d%2F20fe592d79d44aea9494272a19241913"
    },
    {
      "author": "Rod McGuirk",
      "description": "Australians are voting in Australia’s general election as Prime Minister Anthony Albanese and his rival Peter Dutton ended campaigning along the east coast. Both Albanese and Dutton began Saturday in the electorally-crucial city of Melbourne. Albanese returned home to Sydney and Dutton to his hometown of Brisbane to vote. Albanese’s center-left Labor Party is seeking a second three-year term. Dutton wants to become the first opposition leader to oust a first-term government since 1931, when Australians were reeling from the Great Depression. The election is taking place against a backdrop of what both sides of politics describe as a cost of living crisis.",
      "publishedAt": "2025-05-02T22:04:34Z",
      "title": "Australians vote in election with high prices and shortage of housing major issues",
      "url": "https://apnews.com/article/australia-election-albanese-dutton-251063e866513dfa48b773fb4d6b0d29",
      "urlToImage": "https://dims.apnews.com/dims4/default/d6d926d/2147483647/strip/true/crop/3229x1816+0+168/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fb2%2Fb393301a1742a069b09a89840dcf%2Ff6ef0e95342d4a8780460d5808631de5"
    },
    {
      "author": "Darlene Superville, Julie Carr Smyth",
      "description": "President Donald Trump has dispatched Vice President JD Vance all over the world in the opening months of the administration. Vance took a five-day trip to Europe, a hastily reorganized trek to Greenland and toured Italy and India. The vice president is usually accompanied by his wife, Usha, and their three children, and he routinely mixes business with cultural excursions, pairing sometimes prickly official remarks with lighter events. Experts say such trips aren't unusual. His quick shifts between work and leisure may be emblematic of his generation.",
      "publishedAt": "2025-05-03T04:01:11Z",
      "title": "VP Vance's global trips blend diplomacy, deals, soft power and family time",
      "url": "https://apnews.com/article/vice-president-vance-travel-europe-india-greenland-fa3297665373eefe988f552ca0e0e51a",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c917d8/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F9b%2F6011715043ec0c0de6e45f23dd15%2F8c247e1ac9254e05b3f21554e42167fe"
    },
    {
      "author": "Lindsay Whitehurst",
      "description": "The Trump administration is asking the Supreme Court to clear the way for Elon Musk’s Department of Government Efficiency to access Social Security systems containing personal data on millions of Americans. The emergency appeal filed Friday comes after a judge in Maryland restricted the team’s access under federal privacy laws. The government says the DOGE team needs access to target waste in the federal government. An appeals court majority refused to lift the block on DOGE access, though it split along ideological lines. Social Security holds personal records on nearly everyone in the country, from school records to salary information.",
      "publishedAt": "2025-05-02T20:29:17Z",
      "title": "Trump administration asks Supreme Court to allow DOGE into Social Security systems",
      "url": "https://apnews.com/article/doge-social-security-trump-administration-supreme-court-a38db8e9908e56b01265432f4d46e8e3",
      "urlToImage": "https://dims.apnews.com/dims4/default/19c16ed/2147483647/strip/true/crop/6000x3375+0+313/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2Fa0%2F94296109c15deffa9df12c2c9dbe%2F0084c824fe2a44b3b802fa337e1eddfb"
    },
    {
      "author": "Nayara Batschke",
      "description": "While right-wing populism surges in some of the world’s leading democracies, Chile’s leftist government is rushing in the opposite direction, taking on sensitive, liberal social issues in its waning months. President Gabriel Boric has promised to urgently address a bill that seeks to legalize euthanasia and assisted dying. It is a crucial period for Boric’s social agenda ahead of the November presidential election. In 2021, the euthanasia bill passed in the Chamber of Deputies but has since been stalled in the Senate. Over the years, several terminally ill people have made anguished public appeals in hopes of securing the right to have what they describe as dignified deaths.",
      "publishedAt": "2025-05-03T05:08:24Z",
      "title": "Chilean woman with muscular dystrophy becomes face of euthanasia debate as bill stalls in Senate",
      "url": "https://apnews.com/article/chile-euthanasia-assisted-suicide-debate-congress-boric-368b7eb7a59b70dc90916a40dc9e600f",
      "urlToImage": "https://dims.apnews.com/dims4/default/ffbf19b/2147483647/strip/true/crop/8072x4541+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2Fc8%2F7a12ed1c329753d342cd374f6fb4%2F4e9846771ee247b7b3779cf41ae49eaa"
    },
    {
      "author": "Safiyah Riddle",
      "description": "Alireza Doroudi has been detained in an immigration facility in Louisiana for nearly six weeks. Doroudi’s detention has instilled fear in the small Iranian community in Tuscaloosa, Alabama, where he and his fiancee are doctoral students. Doroudi's visa was revoked in 2023, but he wasn't given a reason. His fiancee says he was told that he was legally allowed to stay in the U.S. as long as he remained a student. Now, one Iranian doctoral student says the fear in her community “feels like we’re returning back to Iran again.\" The student spoke to The Associated Press on condition of anonymity because she fears retaliation.",
      "publishedAt": "2025-05-03T04:06:54Z",
      "title": "University of Alabama student from Iran faces deportation",
      "url": "https://apnews.com/article/immigration-university-students-iran-alabama-alireza-doroudi-3ab04109fe902c35c5eaeea02a56179c",
      "urlToImage": "https://dims.apnews.com/dims4/default/04a549f/2147483647/strip/true/crop/4032x2268+0+210/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F97%2F32cb6cc295cff672a6ae12269fae%2F613cb71919c64eda89d0a2da3fd4dc43"
    },
    {
      "author": "John Raby, Jamie Stengle",
      "description": "After Hurricane Helene devastated Asheville, North Carolina, the sound coming from open car windows as residents gathered on a street at the top of a ridge trying to get cell service last fall was Blue Ridge Public Radio. And as they stood in line for water or food, the latest news they’d heard on the station was a frequent topic of conversation. Now, public radio stations are being targeted for cuts by President Donald Trump, who this week signed an executive order aimed at slashing public subsidies to NPR and PBS, alleging “bias” in the broadcasters’ reporting.",
      "publishedAt": "2025-05-03T04:18:57Z",
      "title": "NPR stations targeted for cuts have provided lifelines to listeners",
      "url": "https://apnews.com/article/national-public-radio-rural-trump-cuts-6863e254abc94290394aefa4de056275",
      "urlToImage": "https://dims.apnews.com/dims4/default/fff6a96/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F25%2Faf%2F2475748e284ee26fbacbb88db421%2F47f41c7086e74d67b60c7acac8d26a31"
    },
    {
      "author": "Holly Ramer",
      "description": "A Dartmouth College professor who worked as a consultant on the latest Assassin's Creed video game ended up getting harassed by gamers. But she fought back with kindness, reaching out to the haters and engaging them in conversation. Sachi Schmidt-Hori is an associate professor of Japanese literature and culture. When the trailer for Assassin's Creed Shadows came out last year, gamers who objected to having a Black man as a protagonist in a game set in 16th century Japan came after her, even though the character is based on a historical figure and she wasn't involved in his selection. She responded by contacting her harassers, some of whom apologized and took down their negative posts.",
      "publishedAt": "2025-05-03T04:43:47Z",
      "title": "Assassin's Creed gamers harassed a professor over a 'woke' character. She fought back with kindness",
      "url": "https://apnews.com/article/assassins-creed-video-game-harassment-4b68890b7ed9ead8dbe3ad09dbee9859",
      "urlToImage": "https://dims.apnews.com/dims4/default/03ae388/2147483647/strip/true/crop/3840x2160+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2Faa%2F312b0bacbe3f0e4236c43af02cbb%2F8f45180e54f24761b77eceeaf24bdcdc"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}