{
  "articles": [
    {
      "author": "SAM METZ",
      "description": "RABAT, Morocco (AP) — A rare, powerful earthquake struck Morocco late Friday night, killing hundreds of people and damaging buildings from villages in the Atlas Mountains to the historic city of Marrakech.",
      "publishedAt": "2023-09-08T23:08:13Z",
      "title": "Powerful earthquake strikes Morocco, killing hundreds and damaging historic buildings in Marrakech",
      "url": "https://apnews.com/7f4a503009dede0dec0208c08d6b100b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b613d31da23641fd9f0918cb3e5b0947/3000.jpeg"
    },
    {
      "author": "ADAM SCHRECK and DAVID RISING",
      "description": "NEW DELHI (AP) — Leaders of many of the world's biggest economies prepared to huddle in the Indian capital for the Group of Twenty summit Saturday, though growing global rifts and the absence of key players meant that reaching consensus on the thorniest issues could prove elusive.",
      "publishedAt": "2023-09-09T03:38:06Z",
      "title": "India hopes for progress on global agenda as G20 leaders meet despite rifts over the war in Ukraine",
      "url": "https://apnews.com/f0054ecaea54f53d4ceb0c64a4457620",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57318f25b3c34748992b3306ed0eabc6/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "NEW DELHI (AP) — President Joe Biden and his allies plan to roll out plans on Saturday for a shipping corridor that would connect India with the Middle East and ultimately Europe — a possible game changer for global trade to be announced at the Group of 20 summit.",
      "publishedAt": "2023-09-09T03:58:54Z",
      "title": "Biden and Modi to announce rail and shipping project to link India to Middle East and Europe",
      "url": "https://apnews.com/eb8988dfbd6c9c6f2c411c893d548333",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d879be10b9c4cf798bd519ddb2e76e7/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — New Mexico Gov. Michelle Lujan Grisham on Friday issued an emergency order suspending the right to carry firearms in public across Albuquerque and the surrounding county for at least 30 days in response to a spate of gun violence.",
      "publishedAt": "2023-09-08T23:41:48Z",
      "title": "New Mexico governor issues order suspending the right to carry firearms in public across Albuquerque",
      "url": "https://apnews.com/fc5b4b79bf411b8022c3ad58975724d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10250869097648b1969425058d4eb873/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — The special grand jury that investigated efforts by Donald Trump and others to overturn Georgia’s 2020 election results recommended indictments against twice as many people as the 19 ultimately charged by prosecutors, leaving South Carolina Sen.",
      "publishedAt": "2023-09-08T04:06:36Z",
      "title": "Georgia special grand jury recommended charges against 39 people, including Sen. Lindsey Graham",
      "url": "https://apnews.com/08b2cccaed514c2d8e1baae49e2f05eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/098fa1587ab442929679adf1007709b6/3000.jpeg"
    },
    {
      "author": "JEFF MARTIN",
      "description": "ATLANTA (AP) — Hurricane Lee is rewriting old rules of meteorology, leaving experts astonished at how rapidly it grew into a goliath Category 5 hurricane.Lee could also be a dreadful harbinger of what is to come as ocean temperatures climb, spawning fast-growing major hurricanes that could threaten communities farther north and farther inland, experts say.",
      "publishedAt": "2023-09-09T04:16:05Z",
      "title": "Hurricane Lee is charting a new course in weather and could signal more monster storms",
      "url": "https://apnews.com/36e45b46071f8b68fd7a83a6d4936a51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffbb5b346d66457da8aa847b251ddad8/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korea invited visiting Chinese delegates and Russian artists to a paramilitary parade featuring rocket launchers pulled by trucks and tractors, state media said Saturday, in leader Kim Jong Un's latest effort to display his ties with Moscow and Beijing in the face of deepening confrontations with Washington.",
      "publishedAt": "2023-09-09T03:47:43Z",
      "title": "Kim Jong Un hosts Chinese and Russian guests at a parade celebrating North Korea's 75th anniversary",
      "url": "https://apnews.com/78a201eca07034d6eec131224aab92c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a4c8c0be8a34398930435baada03f2b/3000.jpeg"
    },
    {
      "author": "MARY ALTAFFER and LEANNE ITALIE",
      "description": "NEW YORK (AP) — Christian Siriano marked 15 years in business Friday with Sia performing on his runway and a nostalgic, ballet-inspired fantasy on his models during New York Fashion Week.",
      "publishedAt": "2023-09-09T00:58:41Z",
      "title": "FASHION PHOTOS: Siriano marks 15 years in business with Sia singing and a sparkling ballet fantasy",
      "url": "https://apnews.com/2c188d99da84ee910b31611e3b632e78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/502c858fd519402aaf1a38466e548d4d/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY",
      "description": "HONOLULU (AP) — One month after the deadliest U.S. wildfire in more than a century leveled the historic town of Lahaina, Hawaii Gov.",
      "publishedAt": "2023-09-08T22:14:34Z",
      "title": "The number of people missing following devastating Maui wildfires has dropped to 66, governor says",
      "url": "https://apnews.com/5255b24219ba35e98ecf2d684c197717",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1956eadb554746ba8a0a155a65fdc6d2/3000.jpeg"
    },
    {
      "author": null,
      "description": "WEST CHESTER, Pa. (AP) — A prison tower guard has been fired after a murderer slipped away on his watch in a brazen daytime escape, officials said Friday, as the nine-day-old search pressed on amid southeastern Philadelphia suburbs, farmland and a vast botanical garden.",
      "publishedAt": "2023-09-08T13:36:38Z",
      "title": "Prison guard who missed killer's escape is fired, as hunt for fugitive focuses on botanic garden",
      "url": "https://apnews.com/4f9095cc4cdfc8ddc58ad731012fd7d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9548c208143a43528320bcfe7f2c6326/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}