{
  "articles": [
    {
      "author": "NAJIB JOBAIN, ISABEL DEBRE, RAVI NESSMAN and MATTHEW LEE",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Doctors in Gaza City faced with dwindling medical supplies performed surgery on hospital floors, often without anesthesia, in a desperate bid to save badly wounded victims of a massive blast that killed civilians sheltering in a nearby hospital amid Israeli bombings and a blockade of the territory.",
      "publishedAt": "2023-10-18T07:32:01Z",
      "title": "Gaza's doctors struggle to save hospital blast survivors as Middle East rage grows",
      "url": "https://apnews.com/d9606e0ead1f8c4e9fd00b602ed14a38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfbfc803943948c29737f8478eec2410/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and COLLEEN LONG",
      "description": "TEL AVIV, Israel (AP) — President Joe Biden vowed to show the world that the U.S. stands in solidarity with Israelis during his visit there Wednesday, and offered an assessment that the deadly explosion at a Gaza Strip hospital apparently was not carried out by the Israeli military.",
      "publishedAt": "2023-10-18T04:04:54Z",
      "title": "Biden pledges solidarity with Israelis and suggests 'other team' to blame for Gaza hospital blast",
      "url": "https://apnews.com/a85cb682fdc61b80285cf4ab354354ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e94b0e1ffe24a529a90f12bc64d6aa9/2772.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "President Joe Biden is in Israel on an urgent mission to keep the Israel-Hamas war from spiraling into a broader regional conflict and to encourage the delivery of humanitarian aid to the Palestinians.",
      "publishedAt": "2023-10-18T05:28:00Z",
      "title": "Live updates | Biden meets with Israeli leaders as tensions grow after hospital blast in Gaza",
      "url": "https://apnews.com/dcada8b617115d99fd7dd58a401eee84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60740fa122114e469041d08cc9759ec9/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Having lost the first vote to become House speaker, Rep. Jim Jordan will try again on a decisive second ballot that will test whether the hard-edged ally of Donald Trump can win over the holdouts or if his bid for the gavel is collapsing, denied by detractors.",
      "publishedAt": "2023-10-18T04:07:03Z",
      "title": "GOP's Jim Jordan will try again to become House speaker, but his detractors are considering options",
      "url": "https://apnews.com/994067b90a874ed46dd6a1766d89a163",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c8c94c6e9264a5aa3aa4eb15f59e84f/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — At a time when Americans are deeply divided along party lines, a new poll shows considerable agreement on at least one issue: The United States' two-decade-long war in Afghanistan was not worth fighting.",
      "publishedAt": "2023-10-18T04:09:37Z",
      "title": "Republicans and Democrats agree that the Afghanistan war wasn't worth it, an AP-NORC poll shows",
      "url": "https://apnews.com/268ebebb40beea7be3b1528ed6ae5808",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b22ce0ac3744ea5b172f418c76bf402/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY and JOSEPH KRAUSS",
      "description": "CAIRO (AP) — Within hours after a blast was said to have killed hundreds at a Gaza hospital, protesters hurled stones at Palestinian security forces in the occupied West Bank and at riot police in neighboring Jordan, venting fury at their leaders for failing to stop the carnage.",
      "publishedAt": "2023-10-18T10:02:30Z",
      "title": "Gaza carnage spreads anger across Mideast, alarming US allies and threatening to widen conflict",
      "url": "https://apnews.com/590f24d154fb3cb256ec1707ec78b816",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db904a4a2c5941f7aa290afc3adfbdf8/3000.jpeg"
    },
    {
      "author": "KIRSTEN GRIESHABER",
      "description": "BERLIN (AP) — German Chancellor Olaf Scholz strongly condemned a firebomb assault on a synagogue in Berlin on Wednesday, saying “we will never accept when attacks are carried out against Jewish institutions.”",
      "publishedAt": "2023-10-18T07:36:08Z",
      "title": "The German chancellor condemns a firebomb attack on a Berlin synagogue and vows protection for Jews",
      "url": "https://apnews.com/fdd10f32f7d5efc6da973f00c9a8b030",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/541278ca4cd640809ecaaae5e56f63eb/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN and MATTHEW BROWN",
      "description": "DENVER (AP) — The remains of at least 189 people have been removed from a Colorado funeral home, up from an initial estimate of about 115 when the decaying and improperly stored bodies were discovered two weeks ago, officials said Tuesday.",
      "publishedAt": "2023-10-17T22:37:32Z",
      "title": "Remains of at least 189 people removed from Colorado funeral home, up from 115, officials say",
      "url": "https://apnews.com/d83e65897404bef632dbb7ad4a8e4bfe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e28b5345c4664e778efbb5de18987bfc/3000.jpeg"
    },
    {
      "author": "SIMINA MISTREANU",
      "description": "BEIJING (AP) — Chinese President Xi Jinping promised foreign companies greater access to China’s huge market and more than $100 billion in new financing for other developing economies as he opened a forum Wednesday on his signature Belt and Road infrastructure initiative.",
      "publishedAt": "2023-10-18T04:04:10Z",
      "title": "China's Xi promises open markets and billions in new investments for 'Belt and Road' projects",
      "url": "https://apnews.com/2ffe38c38cdf91556fe4c48c01f0acaf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a53994863e0d4ee180c4e0d25dbde84e/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "LONDON (AP) — When Laima Springe-Janssen was looking to replace her French-made gasoline-powered SUV with an electric car, she considered models from Volvo and Nissan.The Volvo extras she wanted would have busted her budget, while the Nissan lacked the “wow factor.” The Copenhagen, Denmark, resident ended up buying a compact SUV from China’s BYD.",
      "publishedAt": "2023-10-18T05:05:42Z",
      "title": "Europe is looking to fight the flood of Chinese electric vehicles. But Europeans love them",
      "url": "https://apnews.com/4f00df1c7588ca375efebb89a2b83783",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/902abd803d3d47a1947eeb4fc32f7a6d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}