{
  "articles": [
    {
      "author": "SERKAN GURBUZ and JEFFREY COLLINS",
      "description": "BALTIMORE (AP) — Teams of engineers are working on the intricate and careful process of hauling away the twisted steel and shattered concrete of the Francis Scott Key Bridge in Maryland while also trying to recover the bodies of four workers still missing and presumed dead.",
      "publishedAt": "2024-03-30T04:04:36Z",
      "title": "At collapsed Baltimore bridge, focus shifts to the weighty job of removing the massive structure",
      "url": "https://apnews.com/3edebfb3b7fb48fd81be81cf69ebfbf5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47e9928fabe447b3837fbdb92493e6ac/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB, MICHAEL CASEY, JEFF MCMURRAY and CHRISTOPHER KELLER",
      "description": "After a yearlong closure, a bridge over the Puyallup River reopened in 2019 with a sturdy new span and a brand new name. It even won a national award.But today, the Fishing Wars Memorial Bridge is closed again after federal officials raised concerns about a vintage section of the nearly century-old bridge that carried about 15,000 vehicles a day.",
      "publishedAt": "2024-03-30T04:08:28Z",
      "title": "The Baltimore collapse focused attention on vital bridges. Thousands are in poor shape across the US",
      "url": "https://apnews.com/7c8e28ef55d099c9a4e1103d442b302c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/676c3c58e6104c74831637b1f322041b/1920.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — Lawmakers in more than a dozen states have proposed legislation to allow spiritual chaplains in public schools, a move that proponents say will ease a youth mental health crisis, bolster staff retention and offer spiritual care to students who can’t afford or access religious schools.",
      "publishedAt": "2024-03-30T05:25:21Z",
      "title": "Some state lawmakers want school chaplains as part of a 'rescue mission' for public education",
      "url": "https://apnews.com/37cef85a76af48fe0d1e8b3f57cbfdbd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c11e0b352a2d42339a7c3adb9dfe5f00/2042.jpeg"
    },
    {
      "author": null,
      "description": "JERUSALEM (AP) — A three-ship convoy left a port in Cyprus on Saturday with 400 tons of food and other supplies for Gaza as concerns about hunger in the territory soar.",
      "publishedAt": "2024-03-30T08:00:49Z",
      "title": "Ships with a second round of aid for Gaza have departed Cyprus as concerns about hunger soar",
      "url": "https://apnews.com/c0ab29bb92b859e22c927ae82637192b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daf84253306b4d25b40c5017e0ffb03b/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Israel's Supreme Court ruling curtailing subsidies for ultra-Orthodox men has rattled Prime Minister Benjamin Netanyahu's governing coalition and raised questions about its viability as the country presses on with the war in Gaza.",
      "publishedAt": "2024-03-30T04:27:25Z",
      "title": "Israel's high court says the government must stop funding seminaries. Could that topple Netanyahu?",
      "url": "https://apnews.com/1536d26e9a2720d19210f513697ff5ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0eaa96422264ab79819c92cd1de6a56/3000.jpeg"
    },
    {
      "author": "SEUNG MIN KIM and BRIAN SLODYSKO",
      "description": "WASHINGTON (AP) — President Joe Biden’s reelection campaign is raising gobs of cash.",
      "publishedAt": "2024-03-30T04:05:32Z",
      "title": "President Joe Biden is lapping Donald Trump when it comes to campaign cash — and he'll need it",
      "url": "https://apnews.com/9c0a1daa97da1ab2945ae3254333eac8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1da6a47d496745d9a69bb8ffb59b3825/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — As Donald Trump campaigns on promises of mass deportations and pardons for those convicted in the Jan.",
      "publishedAt": "2024-03-30T12:40:54Z",
      "title": "Some of Trump's allies in Congress already support his 2025 ideas on deportations and Jan. 6 pardons",
      "url": "https://apnews.com/c8e5398b3c2c8ce43149e32cd0805865",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b3ac90aa8cd4b88a807aee8dc4f5944/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — British counterterrorism police are investigating the stabbing of an Iranian television presenter outside his home in London as concern grows over threats to a Farsi-language satellite news channel long critical of Iran’s theocratic government.",
      "publishedAt": "2024-03-30T11:56:46Z",
      "title": "UK counterterrorism police investigate an attack on an Iranian TV presenter outside his London home",
      "url": "https://apnews.com/1eefb01cbd5e8f1e25de97c53c333524",
      "urlToImage": ""
    },
    {
      "author": "SUSAN MONTOYA BRYAN",
      "description": "The largest uranium producer in the United States is ramping up work just south of Grand Canyon National Park on a long-contested project that largely has sat dormant since the 1980s. The work is unfolding as global instability and growing demand drive uranium prices higher.",
      "publishedAt": "2024-03-30T04:16:32Z",
      "title": "Uranium is being mined near the Grand Canyon as prices soar and the US pushes for more nuclear power",
      "url": "https://apnews.com/98d43974de13924fb3c36f62b55f53b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6643b2ccb0304019ac6a0bab3ed3d56d/1920.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "MATANZAS, Cuba (AP) — Proudly wearing a rainbow-colored clergy stole and a rainbow flag in her clerical collar, the Rev. Elaine Saralegui welcomed all to her LGBTQ+ inclusive church in the Cuban port city of Matanzas.",
      "publishedAt": "2024-03-30T12:05:21Z",
      "title": "LGBTQ-inclusive church in Cuba welcomes all in a country that once sent gay people to labor camps",
      "url": "https://apnews.com/29e45106d382890865870ff3534236ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df61c0407be74cafbd84c0f14092641e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}