{
  "articles": [
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — The sound you might have heard after the presidential debate this past week was of voters falling between a rock and a hard place.",
      "publishedAt": "2024-06-29T13:33:16Z",
      "title": "Despair in the air: For many voters, the Biden-Trump debate means a tough choice just got tougher",
      "url": "https://apnews.com/be129803b3cd7983d67de50bbfe74fba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b81f0e8850a74c088ddaaefff91dfa88/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and STEVE PEOPLES",
      "description": "NEW YORK (AP) — President Joe Biden is looking to recapture his mojo and reassure donors at a Saturday fundraiser that he is fully up to the challenge of beating Donald Trump.",
      "publishedAt": "2024-06-29T15:01:09Z",
      "title": "Biden is making appeals to donors as concerns persist over his presidential debate performance",
      "url": "https://apnews.com/419531be556da1447856f17549371cd7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5080f2be9ff48a7a4c1b605153e0e41/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — As Donald Trump narrows his options for a potential running mate, two politicians known to be on his list are from Florida, leaving open a scenario where his vice presidential nominee would have to move if the Republican ticket wins.",
      "publishedAt": "2024-06-29T12:50:25Z",
      "title": "The VP race's Florida question: Would Rubio or Donalds have to move if Trump picks either of them?",
      "url": "https://apnews.com/da837d4dcbc49dcf4fb98f41015368c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f05b9a6e7aaf46d7961564b2e37f1222/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — In the last 10 days of June, on a frenetic pace of its own making, the Supreme Court touched a wide swath of American society in a torrent of decisions on abortion, guns, the environment, health, the opioid crisis, securities fraud and homelessness.",
      "publishedAt": "2024-06-29T12:10:29Z",
      "title": "The Supreme Court nears the end of another momentous term. A decision on Trump's immunity looms",
      "url": "https://apnews.com/b0e2f4677267be2921fc83466ed5fb69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f894c9a61b4640bca82d7011d9eaecdd/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — U.S., European and Arab mediators are pressing to keep stepped-up cross-border attacks between Israel and Lebanon's Hezbollah militants from spiraling into a wider Middle East war that the world has feared for months.",
      "publishedAt": "2024-06-29T15:39:56Z",
      "title": "US and Europe warn Lebanon's Hezbollah to ease strikes on Israel and back off from wider Mideast war",
      "url": "https://apnews.com/d6000dffd597f9580af2c7ea16374938",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9eac56f7084f4083ad5006a211b09c0a/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — About a year and a half ago, a lawyer for Julian Assange presented federal prosecutors in Virginia with a longshot request: Dismiss the case against the WikiLeaks founder.",
      "publishedAt": "2024-06-29T04:04:32Z",
      "title": "The Saipan surprise: How delicate talks led to the unlikely end of Julian Assange's 12-year saga",
      "url": "https://apnews.com/86760b88e01553c8cfeb2fa00c78d5b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/615d2356f92b4f11b3ec4f41f72c0e8e/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — In the first presidential debate, Republican Donald Trump skimmed over the Jan.",
      "publishedAt": "2024-06-29T14:41:56Z",
      "title": "Jan. 6 shadows the 2024 campaign, but not on the debate stage. That alarms democracy advocates",
      "url": "https://apnews.com/1aff225eb804a22ea88a7ed2c691cf1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27f756eb6e5b43e8bea51da1f7a29583/3000.jpeg"
    },
    {
      "author": "HOLLY MEYER and PETER SMITH",
      "description": "Christians and Jews believe in the Ten Commandments — just not necessarily the version that will hang in every public school and state-funded college classroom in Louisiana.",
      "publishedAt": "2024-06-29T12:38:32Z",
      "title": "Ten Commandments. Multiple variations. Why the Louisiana law raises preferential treatment concerns",
      "url": "https://apnews.com/7c4af860da21df52c304346fab76c4ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7adc3e240364ccca5ef46f12903bc81/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Slowly but steadily this summer, Russian troops are forging through Ukraine's outgunned and undermanned defenses in a relentless onslaught, prompting the West to push for new weapons and strategies to shore up Kyiv.",
      "publishedAt": "2024-06-29T04:21:06Z",
      "title": "Russia presses its offensive in Ukraine and issues new threats as the West tries to blunt the push",
      "url": "https://apnews.com/a0c813d0c5c3c05943d4bec9306dbcd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e339caecd62453eab3429f714b7cf67/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "SAN JUAN, Puerto Rico (AP) — Tropical Storm Beryl chugged toward the southeast Caribbean on Saturday as forecasters warned it was expected to strengthen into a dangerous major hurricane before reaching Barbados late Sunday.",
      "publishedAt": "2024-06-29T03:16:34Z",
      "title": "Tropical Storm Beryl forecast to become a major hurricane as it approaches the southeast Caribbean",
      "url": "https://apnews.com/0a61043f36a9439f8037147d60e3c9e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4152ad730851462fa52750d0ad0e5960/1800.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}