{
  "articles": [
    {
      "author": "KRUTIKA PATHI and ROB GILLIES",
      "description": "NEW DELHI (AP) — Canada expelled a top Indian diplomat as it investigates what Prime Minister Justin Trudeau called credible allegations its government may have had links to the assassination in Canada of a Sikh activist, an accusation that India rejected as “absurd” on Tuesday.",
      "publishedAt": "2023-09-19T03:23:54Z",
      "title": "Canada expels Indian diplomat as it probes possible link to Sikh's slaying. India denies allegation",
      "url": "https://apnews.com/3c5572d9027769ea6adbd047ec6f462a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bddbf859062c4238a207747cd9a1a85b/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "MIAMI (AP) — The classified documents indictment of Donald Trump would seem, on paper at least, to be the most straightforward of the four criminal cases the former president is facing.",
      "publishedAt": "2023-09-19T04:18:16Z",
      "title": "Florida jury pool could give Trump an advantage in classified documents case",
      "url": "https://apnews.com/68155de474a855cd37e2a5c27ce55cbc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77903ab20b174109bbab33a370099692/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL, LUJAIN JO and MATTHEW LEE",
      "description": "DOHA, Qatar (AP) — Five Americans detained for years in Iran walked off a plane and into freedom Monday, most arm-in-arm, as part of a politically risky deal that saw President Joe Biden agree to the release of nearly $6 billion in frozen Iranian assets owed by a third country, South Korea.",
      "publishedAt": "2023-09-18T07:40:35Z",
      "title": "Five Americans detained in Iran walk free, released in deal for frozen Iranian assets",
      "url": "https://apnews.com/4e1fa477f8e6af45fb764acd259c2f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/302f213b5bd646e8825c79d31e3bd7f5/2790.jpeg"
    },
    {
      "author": null,
      "description": "NORTH CHARLESTON, S.C. (AP) — The crash site for a stealth fighter jet that went missing during the weekend after its pilot ejected was located Monday in rural South Carolina after the military asked the public for help finding an aircraft built to elude detection.",
      "publishedAt": "2023-09-18T14:59:54Z",
      "title": "Officials find debris from F-35 fighter jet that crashed in South Carolina after pilot ejected",
      "url": "https://apnews.com/b60ed0eb50791778b982be0c40a796a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf050e94114b457482cdfed0be734761/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Days before potentially crossing paths with Russia’s top diplomat at the United Nations, Ukrainian President Volodymyr Zelenskyy suggested Monday that the world body needs to answer for allowing his country's invader a seat at the tables of power.",
      "publishedAt": "2023-09-19T00:45:39Z",
      "title": "Heading for UN, Ukraine's president questions why Russia still has a place there",
      "url": "https://apnews.com/1e6b464628a7a391289b2ad386bd2d8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f6fdb15fb354fb583ad2940a694c927/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "The United Auto Workers and Detroit's Big Three carmakers resumed talks aimed at ending a strike now in its fourth day, and under the threat that the walkout could soon spread.Stellantis said it resumed negotiations with the union Monday and described the talks as “constructive.” A spokesman for General Motors said representatives of the company and the United Auto Workers also were continuing to negotiate.",
      "publishedAt": "2023-09-18T15:38:23Z",
      "title": "Carmakers and the United Auto Workers are talking. No signs of a breakthrough to end the strike",
      "url": "https://apnews.com/f948704cce3d6dc9ca484142c5d0d98e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/890251f98bf64f5c87669011e2e9a467/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Hunter Biden sued the Internal Revenue Service on Monday, claiming that two agents publicly alleging tax-probe interference wrongly shared his personal information, a case that comes amid escalating legal and political struggles as the 2024 election looms.",
      "publishedAt": "2023-09-18T12:34:44Z",
      "title": "Hunter Biden sues the IRS over tax disclosures after agent testimony before Congress",
      "url": "https://apnews.com/08a6ecce30fcab3a2be5019be6464c76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/82e4ab25deab4f798eeb6dd49452f34c/1920.jpeg"
    },
    {
      "author": "SARA BURNETT",
      "description": "Donald Trump is facing new blowback from anti-abortion activists for refusing to commit to national abortion restrictions and for calling Florida Gov. Ron DeSantis' signing of a six-week ban on the procedure a “terrible mistake.”",
      "publishedAt": "2023-09-18T16:03:20Z",
      "title": "Trump calls DeSantis abortion ban 'a terrible mistake,' sparking anger from some key Republicans",
      "url": "https://apnews.com/5bdbba55f9c2f328d49b5fbe9727677e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/834f04fc976b446894391847e8a98070/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The commitments were far-reaching and ambitious. Among them: End extreme poverty and hunger. Ensure every child on Earth gets a quality secondary education. Achieve gender equality.",
      "publishedAt": "2023-09-18T05:05:22Z",
      "title": "As leaders convene, the UN pushes toward its crucial global goals. But progress is lagging",
      "url": "https://apnews.com/f738131544da7da506bce97db74b4149",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef5adb5929094830bd82ba800a2e7a36/3000.jpeg"
    },
    {
      "author": "MICHAEL TARM",
      "description": "CHICAGO (AP) — Ovidio Guzmán López, a son of former Sinaloa cartel leader Joaquin “El Chapo” Guzmán, pleaded not guilty in Chicago on Monday to U.S. drug trafficking, money laundering and other charges during his first court appearance since being extradited to the U.S. from Mexico.",
      "publishedAt": "2023-09-18T18:30:33Z",
      "title": "‘El Chapo’ son Ovidio Guzmán López pleads not guilty to US drug and money laundering charges",
      "url": "https://apnews.com/aa87d44a1290b6473006d4caf6220908",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5de1afb30e441da936aa0567d127c74/1941.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}