{
  "articles": [
    {
      "author": "HALELUYA HADERO",
      "description": "A federal appeals court panel on Friday upheld a law that could lead to a ban on TikTok in a few short months, handing a resounding defeat to the popular social media platform as it fights for its survival in the U.S.",
      "publishedAt": "2024-12-06T15:35:41Z",
      "title": "Federal appeals court upholds law requiring sale or ban of TikTok in the U.S.",
      "url": "https://apnews.com/6bfd505295ad44126df0544fc083d6a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63068171209947e9b2a96af8438c9fbd/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "MANAMA, Bahrain (AP) — Iran stands poised to “quite dramatically” increase its stockpile of near weapons-grade uranium as it has started cascades of advanced centrifuges, the head of the International Atomic Energy Agency warned Friday.",
      "publishedAt": "2024-12-06T06:18:32Z",
      "title": "IAEA chief: Iran poised to 'quite dramatically' increase stockpile of near weapons-grade uranium",
      "url": "https://apnews.com/26b332d54d39173db8524b006848b6c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/911d62491d2443edbf051aef05635c28/2000.jpeg"
    },
    {
      "author": "PAUL WISEMAN and ANNE D'INNOCENZIO",
      "description": "WASHINGTON (AP) — America’s job market rebounded in November, adding 227,000 workers in a solid recovery from the previous month, when the effects of strikes and hurricanes had sharply diminished employers’ payrolls.",
      "publishedAt": "2024-12-06T05:01:18Z",
      "title": "US added a strong 227,000 jobs in November in bounce-back from October slowdown",
      "url": "https://apnews.com/bb2c2cf596ffe8b080c45e98cdaeebc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88db3d85c0124869ba9e167658b9bb0a/3000.jpeg"
    },
    {
      "author": "MICHAEL BALSAMO, JAKE OFFENHARTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — As the investigation into a masked gunman who stalked and killed the head of one of the largest U.S.",
      "publishedAt": "2024-12-06T06:03:25Z",
      "title": "Hunt for the gunman who killed UnitedHealthcare's CEO heads into third day as new clues emerge",
      "url": "https://apnews.com/48590215ba756741bbaadeeb6255d135",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e60efc9a7fce40a9bbd7b7e99a152487/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — President-elect Donald Trump on Friday offered a public show of support for Pete Hegseth, his embattled choice to lead the Defense Department whose confirmation by the Senate is in doubt as he faces questions over allegations of excessive drinking, sexual assault and his views on women in combat.",
      "publishedAt": "2024-12-06T14:53:52Z",
      "title": "Trump offers a public show of support for Pete Hegseth, his embattled nominee to lead the Pentagon",
      "url": "https://apnews.com/74d056e44c3cd14a1a9ae97704cda53e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9c6b209f52a423ebeb65810d6c3cf8a/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Thousands of people fled the central Syrian city of Homs, the country's third largest, as insurgents seized two towns on the outskirts Friday, positioning themselves for an assault on a potentially major prize in their march against President Bashar Assad.",
      "publishedAt": "2024-12-06T09:15:32Z",
      "title": "Thousands flee as Syrian insurgents advance to the doorstep of the country's third-largest city",
      "url": "https://apnews.com/08d18aa519dd9883eb291f5a534a02f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/43afcba18cec4649b6ba4f4f11e8d81c/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — The jurors in Daniel Penny’s fatal subway chokehold trial told the judge Friday morning that they can't reach a unanimous verdict on the top charge of manslaughter.",
      "publishedAt": "2024-12-06T16:31:13Z",
      "title": "Jurors in NYC subway chokehold case tell judge they can't reach a unanimous verdict",
      "url": "https://apnews.com/e7db3b52395aa61a80adbac5cf8ea9b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fb92ed430194d099640dd656a454b33/1629.jpeg"
    },
    {
      "author": "ZEKE MILLER and COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden is weighing whether to issue sweeping pardons for officials and allies who the White House fears could be unjustly targeted by President-elect Donald Trump’s administration, a preemptive move that would be a novel and risky use of the president’s extraordinary constitutional power.",
      "publishedAt": "2024-12-06T03:08:31Z",
      "title": "Biden is considering preemptive pardons for officials and allies before Trump takes office",
      "url": "https://apnews.com/f36ead0eb92ea30e47cbfddfaf326f20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21d47b97e4f44034a776c376ee81eece/3000.jpeg"
    },
    {
      "author": "STEPHEN McGRATH",
      "description": "BUCHAREST, Romania (AP) — A top Romanian court on Friday annulled the first round of the country's presidential election, days after allegations that Russia ran a coordinated online campaign to promote the far-right outside r who won the first round.",
      "publishedAt": "2024-12-06T13:19:49Z",
      "title": "Romania's top court annuls first round of presidential vote won by far-right candidate",
      "url": "https://apnews.com/585e8f8f3ce7013951f5c7cf4054179b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0bfa941c6de401bbd2abdfc7583df19/3000.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — Deciding whether Juan Soto tops Shohei Ohtani for baseball’s largest contract could be in the eye of the beholder because of all the deferred money in Ohtani's deal.",
      "publishedAt": "2024-12-06T15:02:23Z",
      "title": "Will Juan Soto top Shohei Ohtani's deal? In the era of deferred money, it might depend on the math",
      "url": "https://apnews.com/a0013bc971bc6add3a5eb8673e810c44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8988fb8bf3e741049788f25f6cece7b3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}