{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "The Israeli military said Thursday it has completed a two-day operation in the occupied West Bank that the Palestinian Health Ministry says killed 12 Palestinians and wounded 25. Rippling tensions from the Israel-Hamas war were also felt in the Red Sea, where a missile splashed down in the water near the crucial Bab el-Mandeb Strait on Thursday, but caused no damage, and in Lebanon, where state-run National News Agency says an Israeli drone strike killed one person and wounded three school students who were passing nearby in a bus.",
      "publishedAt": "2024-05-23T08:19:56Z",
      "title": "The Latest | 12 Palestinians killed and 25 wounded in Israel's 2-day West Bank operation",
      "url": "https://apnews.com/cb1c2aa5ed9cd5942c036dd94c7e43e6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b74da19ecd8404287c81c883c4ee5ce/3000.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — Diminished but not deterred, Hamas is still putting up a fight after seven brutal months of war with Israel, regrouping in some of the hardest-hit areas in northern Gaza and resuming rocket attacks into nearby Israeli communities.",
      "publishedAt": "2024-05-23T08:10:37Z",
      "title": "How does this end? With Hamas holding firm and fighting back in Gaza, Israel faces only bad options",
      "url": "https://apnews.com/0fcb4e20821ba8c0e49edf6571486d3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f01efd2f3ccb4f1988a94c1fad8a4b08/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and MARGERY A. BECK",
      "description": "GREENFIELD, Iowa (AP) — A deadly tornado that wreaked havoc in the small city of Greenfield, Iowa, left four people dead and nearly three dozen injured, officials said, while a fifth person was killed elsewhere.",
      "publishedAt": "2024-05-23T04:15:07Z",
      "title": "5 dead and nearly 3 dozen hurt in tornadoes that tore through Iowa, officials say",
      "url": "https://apnews.com/0c8fb42453cdac5a7e0ec7e193071e6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24da3b8cbe7546ed90288eed420a2528/1920.jpeg"
    },
    {
      "author": "ALBERTO MENDOZA",
      "description": "SAN PEDRO GARZA GARCIA, Mexico (AP) — A strong gust of wind toppled the stage at a campaign rally Wednesday evening in the northern Mexican state of Nuevo Leon, killing at least nine people — including a child — and injuring 63, the state's governor said.",
      "publishedAt": "2024-05-23T03:37:03Z",
      "title": "Strong winds topple stage at a campaign rally in northern Mexico, killing at least 9 people",
      "url": "https://apnews.com/1c4745f31a5b3caf2bce2db47d7cec12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a03eb1f4d0640a78f0b411ef94c867e/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and GEOFF MULVIHILL",
      "description": "CHICAGO (AP) — Republican lawmakers in states across the U.S. have been rejecting Democrats' efforts to protect or expand access to birth control, an issue Democrats are promoting as a major issue in this year's elections along with abortion and other reproductive rights concerns.",
      "publishedAt": "2024-05-23T04:01:58Z",
      "title": "A comment from Trump and GOP actions in the states put contraceptive access in the 2024 spotlight",
      "url": "https://apnews.com/d376b5c489298e3035f7f433fe579b1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d753358e3efe482ab8bf1a68ff16556b/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran on Thursday prepared to inter its late president at the holiest site for Shiite Muslims in the Islamic Republic, a final sign of respect for a protégé of Iran's supreme leader killed in a helicopter crash earlier this week.",
      "publishedAt": "2024-05-23T05:45:50Z",
      "title": "Iran begins burying late president, foreign minister and others killed in helicopter crash",
      "url": "https://apnews.com/aa975288bab8a63af93c8c5f9a31a615",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/45c9fdb865fe45569523e11d55bf2c6c/1920.jpeg"
    },
    {
      "author": "CHRISTOPHER BODEEN",
      "description": "TAIPEI, Taiwan (AP) — Taiwan scrambled jets and put missile, naval and land units on alert Thursday over Chinese military exercises being conducted around the self-governing island democracy where a new president took office this week.",
      "publishedAt": "2024-05-23T03:12:15Z",
      "title": "Taiwan scrambles jets and puts missile, naval and land units on alert over China's military drills",
      "url": "https://apnews.com/2598c308207041be0638a0be028a9097",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/05208f75d6d8464e94bdc1a02a1ded41/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Russian missiles slammed into Ukraine’s second-largest city in the northeast of the country and killed at least six civilians early Thursday, officials said, as Kyiv’s army labored to hold off an intense cross-border offensive by the Kremlin’s larger and better-equipped forces.",
      "publishedAt": "2024-05-23T10:29:26Z",
      "title": "Russian missiles kill 6 in Ukraine's second-largest city where Moscow's troops are pressing",
      "url": "https://apnews.com/208d1921bb4782fcf403f30cd0fea1d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a91c464b8db84bbca24eaa2fb5f2b57d/3000.jpeg"
    },
    {
      "author": "DOUG FEINBERG",
      "description": "Toronto has been awarded the WNBA’s first franchise outside the United States, with the expansion team set to begin play in 2026.Larry Tanenbaum-led Kilmer Sports Ventures is paying $50 million for the team.",
      "publishedAt": "2024-05-23T09:03:33Z",
      "title": "Toronto awarded WNBA's first franchise outside US, with expansion team set to begin play in 2026",
      "url": "https://apnews.com/3e45b24aeb7d205fcdc77ae51d446bd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8e297754af540e6b50f392f7a39a109/3000.jpeg"
    },
    {
      "author": "FRANKLIN BRICEÑO",
      "description": "LIMA, Peru (AP) — The crack of bat on ball and the sight of Venezuelan children running the bases on the soccer field turned baseball diamond on the outskirts of Peru's capital are watched with confusion by locals accustomed to soccer.",
      "publishedAt": "2024-05-23T04:04:05Z",
      "title": "Baseball becomes a shelter for Venezuelan children in soccer-mad Peru",
      "url": "https://apnews.com/2db8aa8616bbcea874b703f87dd26f35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a349c4e9fe4948eabf2b440cc9712502/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}