{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "President Donald Trump will host Jordan’s King Abdullah II at the White House on Tuesday as he escalates pressure on the Arab nation to take in refugees from Gaza as part of his audacious plan to remake the Middle East.",
      "publishedAt": "2025-02-11T07:38:00Z",
      "title": "Live updates: Trump to host Jordan's King as he escalates pressure on his Gaza resettlement plan",
      "url": "https://apnews.com/live/trump-presidency-updates-2-11-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/a206cc2/2147483647/strip/true/crop/4805x2703+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2F7f%2Fb0bae52840a62f74ea67fcf69e4b%2Ffd1667cc764d47e5a8182c784853386f"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "President Donald Trump plans to sign an executive order on Tuesday that would continue downsizing the federal workforce. He wants strict limits on hiring, with agencies only adding one new employee for every four who leave. He also wants agencies to plan for “large-scale reductions in force,” a phrase that's normally used to describe layoffs. A White House fact sheet on the executive order was reviewed by the Associated Press. It's intended to advance Elon Musk’s work slashing spending with his Department of Government Efficiency. Musk's work has been controversial, and Democrats accuse him of consolidating power.",
      "publishedAt": "2025-02-11T19:59:52Z",
      "title": "Trump prepares executive order to continue downsizing federal workforce",
      "url": "https://apnews.com/article/trump-downsizing-federal-workers-doge-00683abc4de44a151f26aaa6cb0d0f30",
      "urlToImage": "https://dims.apnews.com/dims4/default/720559b/2147483647/strip/true/crop/6666x3750+0+348/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffe%2Fed%2F612d542ff0a22b8fda1d18022366%2F077e9a84be674785a64ea6fd6592f04b"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "A new lawsuit accuses the Trump administration of stiffing U.S. businesses of hundreds of millions of dollars in unpaid bills for work that has already been done amid its dismantling of the U.S. Agency for International Development. The lawsuit was filed Tuesday in federal court in D.C. on behalf of an organization representing 173 American small businesses, large U.S.-based suppliers, a Jewish group working for displaced people and others. It says President Donald Trump's foreign aid funding freeze has left hundreds of millions of dollars of owed bills unpaid and goods stuck in the supply chain. The USAID deputy administrator has defended the funding cutoff in an affidavit in another lawsuit.",
      "publishedAt": "2025-02-11T17:57:19Z",
      "title": "US government owes millions in unpaid bills amid USAID shutdown, suit says",
      "url": "https://apnews.com/article/usaid-american-companies-layoffs-lawsuit-8c116d877c179169fbce2d3348fcd997",
      "urlToImage": "https://dims.apnews.com/dims4/default/69c3297/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F47%2Fadf4bdb0392b40316130ee79a96f%2F1030eae021cf44c9b0bd1e8ce7dc7a9c"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "The White House blocked an Associated Press reporter from attending an event in the Oval Office after demanding the news agency alter its style on the Gulf of Mexico, which President Trump has ordered renamed to the Gulf of America. It was a highly unusual move that could have constitutional free-speech implications. AP executives said the reporter tried to enter the White House event as usual Tuesday afternoon and was turned away. Julie Pace, senior vice president and executive editor of The Associated Press, called the administration’s move troubling and unacceptable. The Trump administration made no immediate announcements about the move.",
      "publishedAt": "2025-02-11T22:17:16Z",
      "title": "White House bars AP reporter from Oval Office due to AP style policy",
      "url": "https://apnews.com/article/trump-ap-journalism-first-amendment-8a83d8b506053249598e807f8e91e1ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/45494bf/2147483647/strip/true/crop/3656x2057+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2Fd9%2F5c529aa84c08d6cafcb673fb9a91%2F9e68fffc7b08440499f2612fcecf8d39"
    },
    {
      "author": null,
      "description": null,
      "publishedAt": null,
      "title": "Senator seeks watchdog inquiry into Kash Patel, alleges behind-the-scenes role in purge at FBI",
      "url": "https://apnews.com/article/fbi-trump-kash-patel-durbin-0b68c346a75ee21a38896c1be4692916",
      "urlToImage": null
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "The White House says American teacher Marc Fogel has been released by Russia. President Donald Trump's special envoy Steve Witkoff left Russian airspace with Fogel on Tuesday. Trump national security adviser Michael Waltz says the U.S. and Russia “negotiated an exchange” but did not say if the U.S. released anybody in return. Waltz describes the development as “a sign we are moving in the right direction to end the brutal and terrible war in Ukraine.” Trump has promised to find a way to end the conflict. Fogel is from Pennsylvania.",
      "publishedAt": "2025-02-11T18:33:17Z",
      "title": "Russia has released detained American teacher Marc Fogel, the White House says",
      "url": "https://apnews.com/article/donald-trump-vladimir-putin-20ab40d17f8a9b4abf9b3498da979859",
      "urlToImage": "https://dims.apnews.com/dims4/default/f9041ca/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F7d%2F87ca738e493e7fa53032f80276f7%2F233ce90d4b7c4c19937953b95b466479"
    },
    {
      "author": "JENNIFER McDERMOTT",
      "description": "Straws might seem insignificant, but the plastic straw has come to symbolize a global pollution crisis over the past decade. President Donald Trump waded into the issue Monday when he signed an executive order to reverse a federal push away from plastic straws, declaring that paper straws “don’t work” and don’t last very long. Trump said he thinks it’s OK to continue using plastic straws, although they’ve have been blamed for polluting oceans and harming marine life. In 2015, video of a marine biologist pulling a plastic straw out of a turtle’s nose sparked outrage worldwide and countries and cities started banning them.",
      "publishedAt": "2025-02-11T18:25:12Z",
      "title": "Plastic straws have come to symbolize a global pollution crisis. Trump wants them to stay",
      "url": "https://apnews.com/article/trump-plastic-straws-pollution-oceans-packaging-e40da624633e75f120221d1d1d202554",
      "urlToImage": "https://dims.apnews.com/dims4/default/c8a8b7b/2147483647/strip/true/crop/5988x3368+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fbf%2Fd143d024bb18adee6a67ccba2b26%2Fc293a921a52d43ffbcb1b1d84e5c2d73"
    },
    {
      "author": "ZEKE MILLER, CHRIS MEGERIAN",
      "description": "President Donald Trump has hosted Jordan’s King Abdullah II at the White House and renewed his suggestions Gaza could be emptied of residents and redeveloped as a tourist area — a plan that could likely only work if the Arab nation agrees to accept more refugees. The pair met Tuesday in the Oval Office, where Trump suggested he wouldn’t withhold U.S. aid to Jordan or countries like Egypt if they don’t agree to dramatically increase the number of people from Gaza they take in. The Republican president says he doesn't “have to threaten that.” That contradicted Trump previously suggesting that holding back aid was a possibility.",
      "publishedAt": "2025-02-11T05:01:44Z",
      "title": "Trump, hosting Jordan's king, renews his insistence that the US can control and redevelop Gaza",
      "url": "https://apnews.com/article/trump-abdullah-jordan-gaza-hamas-israel-1f3ef249419ce61fc5c0f41412c24cb0",
      "urlToImage": "https://dims.apnews.com/dims4/default/6fc7cd7/2147483647/strip/true/crop/4168x2345+0+217/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F34%2F28edd7f46d70de78d4d015583000%2Fe64194f7cee8449887a2d967f1363693"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "Israeli Prime Minister Benjamin Netanyahu has threatened to resume fighting in Gaza unless more hostages are released Saturday. An Israeli official said Tuesday that Netanyahu has ordered the army to add more troops in and around Gaza after Hamas threatened to call off the next scheduled release of hostages on Saturday. The official, who spoke on condition of anonymity to discuss a private meeting, says Netanyahu also ordered officials “to prepare for every scenario if Hamas doesn’t release our hostages this Saturday.” The official was not clear if Netanyahu’s order referred to the release of all remaining hostages in Gaza, or just the three scheduled for release on Saturday. Hamas says Israel has failed to meet the terms of the ceasefire by not allowing enough aid into Gaza.",
      "publishedAt": "2025-02-11T16:25:12Z",
      "title": "Netanyahu threatens to resume fighting in Gaza if hostages aren't released Saturday",
      "url": "https://apnews.com/article/israel-netanyahu-troops-beefed-up-ceasefire-39533292445c3fe25d0d2d460439305d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2cd93a6/2147483647/strip/true/crop/5043x2837+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2F71%2F9e51e44ac617993454b97fab9d89%2Ff85a1da422e0426286f5a0e3024b5a18"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "Federal Reserve Chair Jerome Powell says Americans’ bank accounts are safe despite the Trump administration’s shutdown of a consumer financial regulatory agency. Powell, testifying before the Senate Banking Committee on Tuesday, said “bank accounts overall across the economy are safe” and backed by government deposit insurance. Sen. Elizabeth Warren who initially conceived of the CFPB in the wake of the 2008 financial crisis and recession, said she would have concerns about doing business with a giant bank \"when there’s no cop on the beat.”",
      "publishedAt": "2025-02-10T17:59:55Z",
      "title": "Fed chair says bank accounts 'safe' despite Trump's teardown of consumer protection agency",
      "url": "https://apnews.com/article/interest-rates-powell-fed-trump-4b0cc2df7809761b42e93964773afffe",
      "urlToImage": "https://dims.apnews.com/dims4/default/ea3bdd2/2147483647/strip/true/crop/5109x2874+0+266/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2F65%2Fb35e8b78dd872a0c22d032949a43%2Fe7d14fb9b6794a9a824f0037c8c14f35"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}