{
  "articles": [
    {
      "author": null,
      "description": "NEW YORK (AP) — Police officer fired gun while clearing protesters from Columbia University building, Manhattan prosecutors say.",
      "publishedAt": "2024-05-02T23:47:29Z",
      "title": "Police officer fired gun while clearing protesters from Columbia University building, Manhattan prosecutors say",
      "url": "https://apnews.com/3af2d9e8e70f6f226270f2334345b1ee",
      "urlToImage": ""
    },
    {
      "author": "RYAN PEARSON, JULIE WATSON, CHRISTOPHER L. KELLER and CAROLYN THOMPSON",
      "description": "LOS ANGELES (AP) — A police officer who was involved in clearing protesters from a Columbia University administration building earlier this week fired his gun inside the hall, a spokesperson for District Attorney Alvin Bragg’s office confirmed Thursday.",
      "publishedAt": "2024-05-02T04:03:30Z",
      "title": "Police officer fired gun while clearing protesters from Columbia building, prosecutors say",
      "url": "https://apnews.com/ec3f62c51c08599f8fcecd99f7cf9e33",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ef9cc7244554ecc8bd3ed54e0738395/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, PHILIP MARCELO, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Jurors in the hush money trial of Donald Trump heard a recording Thursday of him discussing with his then-lawyer and personal fixer a plan to purchase the silence of a Playboy model who has said she had an affair with the former president.",
      "publishedAt": "2024-05-02T04:03:50Z",
      "title": "Jurors in Trump hush money trial hear recording of pivotal call on plan to buy affair story",
      "url": "https://apnews.com/fe6995afbc96650b67f46d813ab05f06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de4997ecd7d94acf9c96de71c03b85e8/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE, LEE KEATH and SAM MEDNICK",
      "description": "BEIRUT (AP) — Hamas said Thursday that it was sending a delegation to Egypt for further cease-fire talks, in a new sign of progress in attempts by international mediators to hammer out an agreement between Israel and the militant group to end the war in Gaza.",
      "publishedAt": "2024-05-02T11:12:13Z",
      "title": "Hamas is sending a delegation to Egypt for further cease-fire talks in the latest sign of progress",
      "url": "https://apnews.com/0699ef663cba7318c375c0ee5bbf20ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66e9f4f5353a40a3b30be4c2eae097c5/1920.jpeg"
    },
    {
      "author": "SAMY MAGDY and DREW CALLISTER",
      "description": "CAIRO (AP) — Israel and Hamas appear to be seriously negotiating an end to the war in Gaza and the return of Israeli hostages.",
      "publishedAt": "2024-05-02T20:11:08Z",
      "title": "Here's what's on the table for Israel and Hamas in the latest cease-fire talks",
      "url": "https://apnews.com/7cec005ccd59dbd817ef9614a8611ca4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0770da056ea3427ca48ae1c973e2667a/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Two years after a leaked draft of a U.S. Supreme Court opinion signaled that the nation's abortion landscape was about to shift dramatically, the issue is still consuming the nation's courts, legislatures and political campaigns — and changing the course of lives.",
      "publishedAt": "2024-05-02T04:12:21Z",
      "title": "Abortion is still consuming US politics and courts 2 years after a Supreme Court draft was leaked",
      "url": "https://apnews.com/9ee070c3540cb730b251d707e5f98ffc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60986915986f4ad58aba0fab284879ef/3000.jpeg"
    },
    {
      "author": "SUSAN HAIGH and PAT EATON-ROBB",
      "description": "HARTFORD, Conn. (AP) — The major traffic artery linking New England with New York will be closed in Connecticut for days after a tanker fire damaged a bridge over Interstate 95, Gov. Ned Lamont said Thursday.",
      "publishedAt": "2024-05-02T15:05:48Z",
      "title": "I-95 in Connecticut will close for days after fiery crash damages bridge, governor says",
      "url": "https://apnews.com/1c8fef89561bbedd0d6704e2ee37cb93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e33b12290a2642f29180854173ee9535/1920.jpeg"
    },
    {
      "author": "STEFANIE DAZIO and AMY TAXIN",
      "description": "LOS ANGELES (AP) — A federal judge in Los Angeles on Thursday sentenced a scuba dive boat captain to four years in prison and three years supervised release for criminal negligence after 34 people died in a fire aboard the vessel.",
      "publishedAt": "2024-05-02T05:03:22Z",
      "title": "Captain sentenced to 4 years for criminal negligence in fiery deaths of 34 aboard scuba boat",
      "url": "https://apnews.com/79f032df2cc6ae1140eb8ca6bc87e837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5686712dfbf84291a190cbef4259a925/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "FORT LIBERTY, N.C. (AP) — The video is unsettling, with haunting images of faceless people, fire and soldiers. The voiceover is a cascade of recognizable historical voices as the screen pulses cryptic messages touting the power of words, ideas and “invisible hands.”",
      "publishedAt": "2024-05-02T04:31:30Z",
      "title": "Faceless people, invisible hands: New Army video aims to lure recruits for psychological operations",
      "url": "https://apnews.com/f216951fdaff4fa0130386a8f85c76e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e335fbbf17534b94a18b1113a36b0aab/2560.jpeg"
    },
    {
      "author": "REBECCA SANTANA",
      "description": "WASHINGTON (AP) — A bipartisan group of senators is pushing for restrictions on the use of facial recognition technology by the Transportation Security Administration, saying they are concerned about travelers' privacy and civil liberties.",
      "publishedAt": "2024-05-02T13:05:23Z",
      "title": "Senators want limits on the government's use of facial recognition technology for airport screening",
      "url": "https://apnews.com/7b97462591c49184d1cb19cda9c95211",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/440031f6b93e4fc9b8e5a2a6275b83ba/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}