{
  "articles": [
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States are poised Friday to hold negotiations in Oman at least over Tehran’s nuclear program. The talks follow a chaotic week that initially saw plans for regional countries to take part in talks in Turkey. Previous rounds of meetings turned to ash following Israel’s launch of a 12-day war against Iran back in June. The U.S. bombed Iranian nuclear sites during that war. Meanwhile, nationwide protests have shaken Iran's theocracy. It responded with a bloody crackdown that killed thousands and reportedly saw tens of thousands arrested. President Donald Trump has threatened to strike the country in the time since, spurring the talks.",
      "publishedAt": "2026-02-06T02:59:03Z",
      "title": "Iran and US set for talks in Oman over nuclear program",
      "url": "https://apnews.com/article/iran-us-protests-nuclear-negotiations-oman-muscat-32d621b98f7a3a68831f885d262bb70e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a239a1/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Ffc%2F656f9a9b6faed54cc26b99bc5926%2F265e9954c2334a6c863434b160aa85b2"
    },
    {
      "author": "Sejal Govindarao, Jacques Billeaud",
      "description": "There has been no public sign of a response to NBC “Today” show host Savannah Guthrie’s message to her 84-year-old mother’s kidnapper. In a recorded video posted Wednesday on social media, Guthrie said her family is ready to talk. But she says they want proof that Nancy Guthrie, who authorities believe was taken from her home in Arizona against her will, is still alive. Guthrie says her family heard media reports about a ransom letter. Nancy Guthrie was last seen Saturday night and she was reported missing midday Sunday after she didn’t appear at a church. Authorities on Wednesday offered no detailed update on their search. Their next news conference is scheduled for Thursday.",
      "publishedAt": "2026-02-05T12:34:13Z",
      "title": "No sign of response to Guthrie's message to her mom's kidnapper",
      "url": "https://apnews.com/article/savannah-guthrie-nancy-guthrie-mom-missing-2765f354b498e6146b955162c3b71d4f",
      "urlToImage": "https://dims.apnews.com/dims4/default/156b2e7/2147483647/strip/true/crop/2341x1560+329+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F19%2Fc59e122a370290bd5210f2e5762f%2Ff085a4ce99ef43ceab5ce9c26dfa3a55"
    },
    {
      "author": "Kamila Hrabchuk",
      "description": "Negotiators from Moscow and Kyiv are holding a second day of U.S.-brokered talks in Abu Dhabi to end their war. The discussions come amid increased Russian attacks on Ukraine’s power grid and after a rise in civilian casualties. Ukrainian President Volodymyr Zelenskyy is urging allies to pressure Moscow to end the invasion, which began in 2022. He emphasizes the need for security guarantees to prevent future Russian attacks. Fighting continues alongside the talks, with Russia targeting Ukraine’s electricity network. Human Rights Watch reports a 31% increase in Ukrainian civilian casualties last year. Almost 15,000 civilians have been killed since the war began.",
      "publishedAt": "2026-02-05T09:06:30Z",
      "title": "Abu Dhabi hosts second day of US-brokered talks to end Moscow-Kyiv conflict",
      "url": "https://apnews.com/article/russia-ukraine-talks-peace-abu-dhabi-witkoff-31ccc70ae7599507bc5a98a6cd87e2aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/91481ca/2147483647/strip/true/crop/8099x5397+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8d%2Fa0%2Fd20f343055ac3e270c725f80d644%2Fd005242a68d7456da1604160df4244e6"
    },
    {
      "author": "Vladimir Isachenkov",
      "description": "The Kremlin says it regretts the expiration of the last remaining nuclear arms pact between Russia and the United States, while President Donald Trump declared he was against keeping its limits and wants a better deal. The end of the New START treaty left no caps on the two largest atomic arsenals for the first time in more than a half-century, fueling fears of an unconstrained nuclear arms race. Russian President Vladimir Putin expressed readiness to stick to the pact’s limits for another year if Washington agreed. But Trump indicated he wants China to be a part of a new pact — something Beijing has rebuffed. The treaty, signed in 2010, was extended in 2021 for five more years.",
      "publishedAt": "2026-02-05T07:45:21Z",
      "title": "Russia says it regrets expiration of last nuclear arms treaty but Trump says he wants a new pact",
      "url": "https://apnews.com/article/russia-us-putin-trump-nuclear-weapons-treaty-0e82c7fb5e5feca89a9c3f45d6f4feae",
      "urlToImage": "https://dims.apnews.com/dims4/default/32030c1/2147483647/strip/true/crop/3255x2169+0+84/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2F66%2Ff4fa8f047a346ed1c6c7e4b424bd%2Fb562f51339324c3da1c63a3109b3d97d"
    },
    {
      "author": "Mary Clare Jalonick, Lisa Mascaro",
      "description": "Senate Majority Leader John Thune says Democrats' demands for new restrictions on federal immigration officers are “unrealistic.” And he's warning that the Department of Homeland Security will shut down next week if Democrats don’t work with Republicans and the White House. Democrats are pressing for changes at U.S. Immigration and Customs Enforcement and other federal law enforcement agencies in the wake of the fatal shootings of two protesters in Minneapolis last month. The Democratic congressional leaders have come out with an expanded list of 10 detailed proposals. Short-term funding for DHS lasts through Feb. 13.",
      "publishedAt": "2026-02-05T18:40:43Z",
      "title": "Homeland Security shutdown more likely as GOP rebuffs Democratic demands",
      "url": "https://apnews.com/article/homeland-security-shutdown-ice-democrats-demands-ff3aadec8eeab250aea5bf8a8ecdb960",
      "urlToImage": "https://dims.apnews.com/dims4/default/36757b5/2147483647/strip/true/crop/4802x3200+0+90/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2Ff8%2F268ac2d2e95c78e4ebdff4de00e5%2Ff344d49b52bb4651922a88fd5f969625"
    },
    {
      "author": "Meg Kinnard",
      "description": "The chairman of prestigious law firm Paul Weiss has resigned from that position after emails revealed his exchanges with Jeffrey Epstein. Brad Karp will remain at the firm where he's practiced for 40 years and has served as chairman since 2008. He said in a statement from the firm that “recent reporting has created a distraction and has placed a focus on me that is not in the best interests” of Paul Weiss. Emails recently released by the Department of Justice as part of its Epstein investigation show Karp thanking Epstein for hosting an unforgettable evening in 2015. Karp also sought Epstein's help in 2016 for Karp's son's film career.",
      "publishedAt": "2026-02-05T18:05:50Z",
      "title": "Chairman of law firm Paul Weiss resigns after release of Epstein emails",
      "url": "https://apnews.com/article/epstein-karp-paul-weiss-emails-justice-department-0af16206a386198cd85ade0cd6c807d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/19895b6/2147483647/strip/true/crop/4842x3226+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F7b%2Fac2de2383b2af88176bb8374cb36%2F29303bc65d794eccbca66b346eedab76"
    },
    {
      "author": "Jesse Bedayn",
      "description": "Derrick Johnson buried his mother’s ashes in 2023 alongside his home on Maui, fulfilling her wish of a final resting place overlooking her grandchildren. The FBI called Johnson a year later. They said his mother’s remains weren’t in the ashes he buried. Instead, his mother was among nearly 200 decomposing bodies found inside a Colorado funeral home. The funeral home owners had given families fake ashes for years, trying to conceal the bodies. Jon and Carie Hallford were arrested in 2023 and charged with abusing nearly 200 corpses. On Friday, Jon Hallford, will be sentenced. Johnson will be among the grieving families to speak, advocating for the maximum sentence of 50 years in prison.",
      "publishedAt": "2026-02-05T23:17:30Z",
      "title": "A man whose mother's body was among 189 corpses stashed in a Colorado funeral home speaks out",
      "url": "https://apnews.com/article/funeral-home-colorado-decomposing-bodies-human-remains-ac3bcd47bf6f492ba177a70fb4b30d71",
      "urlToImage": "https://dims.apnews.com/dims4/default/7918fbb/2147483647/strip/true/crop/3000x1999+0+35/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F3e%2Fa8d081853e96c7bc5098ccdb3ae7%2Fe320851c8cda49fc837f930bf6fc4ca5"
    },
    {
      "author": "Kanis Leung",
      "description": "Hong Kong’s pro-democracy former media tycoon Jimmy Lai will be sentenced Monday following his conviction in December under a Beijing-imposed national security law. Lai, the 78-year-old founder of the now-defunct Apple Daily newspaper, could face up to life in prison in the case that has stirred criticism from some foreign governments. The judiciary said Friday on its website that it’s calling for the sentencing session at 10 a.m. Monday. Lai was an outspoken critic of China’s ruling Communist Party and was arrested in 2020 under the national security law that Beijing deemed necessary for the city’s stability following anti-government protests the previous year.",
      "publishedAt": "2026-02-06T03:06:30Z",
      "title": "Jimmy Lai will be sentenced Monday after national security conviction",
      "url": "https://apnews.com/article/hong-kong-jimmy-lai-national-security-df660ddc87aa019122b3ed2ac55a8693",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe7c04c/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F9d%2F144dfb7f1177681bdcbcf8932342%2F4cf032c03eb8448196c02a3b98f0d45d"
    },
    {
      "author": "Ali Swenson",
      "description": "The Trump administration is set to launch TrumpRx, a website to help patients buy prescription drugs directly from manufacturers at discounted rates. White House press secretary Karoline Leavitt announced Thursday's expected unveiling in a social media post. The website is not a purchasing platform but directs users to drugmakers’ own sites. President Trump first mentioned TrumpRx in September, highlighting deals with pharmaceutical companies to lower drug prices. The website's release faced delays, but it now showcases efforts to reduce costs through agreements with major companies like Pfizer and AstraZeneca. However, the actual savings for consumers remain unclear.",
      "publishedAt": "2026-02-05T17:13:09Z",
      "title": "TrumpRx website for discounted drugs is set to launch",
      "url": "https://apnews.com/article/trumprx-website-trump-drug-prices-pharmaceuticals-eae897ebf87349510a7795035a3043a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/aca5419/2147483647/strip/true/crop/5187x3456+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2F7e%2Fc74d7727887d56888bf832f78bfc%2Fd5b175233f2544b789c20a072b335cb4"
    },
    {
      "author": "Rob Maaddi",
      "description": "The league MVP and the other seven AP NFL awards will be announced at NFL Honors on Thursday night, days before Super Bowl 60. Christian McCaffrey is a finalist for three awards, including the 2025 NFL Most Valuable Player. He joins Josh Allen, Trevor Lawrence, Drake Maye and Matthew Stafford in the MVP race. Maye, who is leading the New England Patriots against the Seattle Seahawks in the Super Bowl, and McCaffrey are also finalists for Offensive Player of the Year. A panel of 50 media members completed voting before the playoffs. The awards ceremony will be held in San Francisco.",
      "publishedAt": "2026-02-05T16:06:02Z",
      "title": "NFL MVP, other top awards to be announced at NFL Honors",
      "url": "https://apnews.com/article/nfl-mvp-awards-1f6a4d94a8ffcdd5844855c5d4ba510a",
      "urlToImage": "https://dims.apnews.com/dims4/default/c63bd08/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F4f%2Fe5e1c9fefc88df0789454736a8f9%2Fdb32afb069d9401eb56e899f7ba4a87c"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}