{
  "articles": [
    {
      "author": "SETH BORENSTEIN",
      "description": "As temperatures and humidity soar outside, what's happening inside the human body can become a life-or-death battle decided by just a few degrees. The critical danger point outdoors for illness and death from relentless heat is several degrees lower than experts once thought, say researchers who put people in hot boxes to see what happens to them.",
      "publishedAt": "2024-06-21T14:32:34Z",
      "title": "How does heat kill? It confuses your brain. It shuts down your organs. It overworks your heart.",
      "url": "https://apnews.com/b70e6ff98a81e80d9b99ed088e6de3d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04f5d3192af140ac86bedb86497cc5bc/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ADRIANA GOMEZ LICON",
      "description": "FORT PIERCE, Fla. (AP) — Lawyers for Donald Trump made a longshot argument Friday that the Justice Department prosecutor who charged the former president with hoarding classified documents at his Florida estate was illegally appointed and that the case should therefore be dismissed.",
      "publishedAt": "2024-06-21T04:11:30Z",
      "title": "Trump attorneys in classified documents case are challenging prosecutor's appointment",
      "url": "https://apnews.com/00ca368253a7d53881ba54d83e7f6a6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b48d3b3044e4a84a6a7ce91ea5a5552/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Friday upheld a federal gun control law that is intended to protect victims of domestic violence.",
      "publishedAt": "2024-06-21T14:24:56Z",
      "title": "The Supreme Court upholds a gun control law intended to protect domestic violence victims",
      "url": "https://apnews.com/d63ee828e51911cc5e5a01780820f224",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c815e6094e304a198183dbf85edb6e66/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Prosecutors on Friday urged the judge overseeing Donald Trump’s criminal hush money case to uphold provisions of a gag order that bar him from criticizing jurors and court staff, while agreeing to lift a restriction on his public statements about trial witnesses.",
      "publishedAt": "2024-06-21T14:35:29Z",
      "title": "NY prosecutors urge judge to keep gag order blocking Trump from criticizing jurors who convicted him",
      "url": "https://apnews.com/017ee70af7749c225975bb428113dfd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e71698818ab43bbba7cff0fed2949b5/3000.jpeg"
    },
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — Louisiana has long been reliably red. The Bayou State has voted for the Republican candidate in every presidential election since 2000, with residents overwhelmingly supporting Donald Trump during the past two, and the GOP has held a majority in the statehouse for years.",
      "publishedAt": "2024-06-21T04:14:31Z",
      "title": "Long a Republican state, Louisiana is redder than ever under new governor",
      "url": "https://apnews.com/bef181b17cb5a5819514c7c68ae8f2e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf9e4edb4df6423f8ec094ee27521739/3000.jpeg"
    },
    {
      "author": "DIDI TANG and KEN MORITSUGU",
      "description": "BEIJING (AP) — With no obvious options, China appears to be keeping its distance as Russia and North Korea move closer to each other with a new defense pact that could tilt the balance of power among the three authoritarian states.",
      "publishedAt": "2024-06-21T06:55:39Z",
      "title": "Russia-North Korea pact could dent China's influence, but Beijing still holds sway over both",
      "url": "https://apnews.com/3998a978ed89fd42b6da654ab1572873",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf25a862584c4e7db29f79e6322ec617/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Judges, state lawmakers and voters are deciding the future of abortion in the U.S. two years after the Supreme Court jolted the legal status quo with a ruling that overturned Roe v.",
      "publishedAt": "2024-06-21T04:05:24Z",
      "title": "The Supreme Court overturned Roe v. Wade in 2022. Here’s the state of abortion rights now in the US",
      "url": "https://apnews.com/cadff0d905d1c4d7b9825c8406aadffb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38bc30b6bbb64e4680b72b8664f648e1/1920.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "NEW YORK (AP) — President Joe Biden begins an intense period of private preparations Friday at Camp David for what may be the most consequential presidential debate in decades.",
      "publishedAt": "2024-06-21T04:12:22Z",
      "title": "How Biden and Trump are taking very different approaches to preparing for next week's debate",
      "url": "https://apnews.com/2f67b119f58136b310b625e42fad3d3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d8956ae2e9d4a5a9704194e7e19df75/3000.jpeg"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "WASHINGTON (AP) — The Food and Drug Administration on Friday authorized the first menthol-flavored electronic cigarettes for adult smokers, acknowledging that vaping flavors can reduce the harms of traditional tobacco smoking.",
      "publishedAt": "2024-06-21T15:26:37Z",
      "title": "FDA OKs first menthol e-cigarettes, citing potential to help adult smokers",
      "url": "https://apnews.com/6493efc348291434af9d7c88601154e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/258ccf320c6840bb956121fbece31820/3000.jpeg"
    },
    {
      "author": "RODRIGO ABD",
      "description": "SUCUSARI, Peru (AP) — It is the longest bridge ever built in Peru, a massive structure of cement and iron spanning the Nanay River as it connects to untouched areas of the Peruvian Amazon So far, it goes nowhere.",
      "publishedAt": "2024-06-21T13:46:11Z",
      "title": "It's the longest bridge ever built in Peru, and so far, it goes nowhere",
      "url": "https://apnews.com/f3a55a579f5bec42d6d4d78f46ace3ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e8849855a704287b1120bfd30e07bc2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}