{
  "articles": [
    {
      "author": "COLLEEN LONG",
      "description": "WASHINGTON (AP) — President Joe Biden is commuting the sentences of roughly 1,500 people who were released from prison and placed on home confinement during the coronavirus pandemic and is pardoning 39 Americans convicted of nonviolent crimes.",
      "publishedAt": "2024-12-12T10:00:45Z",
      "title": "Biden commutes roughly 1,500 sentences and pardons 39 people in biggest single-day act of clemency",
      "url": "https://apnews.com/4432002d67334e6716c2776fd73f3cc8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1831d1c2a5e04427947ac38eade15d07/2764.jpeg"
    },
    {
      "author": "JILL COLVIN, LISA MASCARO and HANNAH FINGERHUT",
      "description": "WASHINGTON (AP) — She’s an Iraq War combat veteran and sexual assault survivor who has advocated for years to improve how the military handles claims of sexual misconduct.But when Sen.",
      "publishedAt": "2024-12-12T12:26:36Z",
      "title": "Pressure on a veteran and senator shows what's next for those who oppose Trump",
      "url": "https://apnews.com/dd15a8b031ca8cad2a99237ab99b53a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2348af25fab54b1e9325d4af1d07b87d/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WEST PALM BEACH, Fla. (AP) — President-elect Donald Trump has invited Chinese President Xi Jinping to attend his inauguration next month — extending a diplomatic olive branch even as Trump threatens to levy massive tariffs on Chinese goods.",
      "publishedAt": "2024-12-12T14:25:10Z",
      "title": "Trump invites China's Xi to his inauguration even as he threatens massive tariffs on Beijing",
      "url": "https://apnews.com/d654da01f90bf3bec071bb9890ffbd29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd1a80e28c0b4a39be0bfdf0d632614c/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MARK SCOLFORO",
      "description": "ALTOONA, Pa. (AP) — The gun found on the man charged with killing United Healthcare’s CEO matched shell casings found at the site of the shooting, New York City’s police commissioner said Wednesday as authorities scrutinized evidence and the suspect's experiences with the victim's industry.",
      "publishedAt": "2024-12-11T05:07:34Z",
      "title": "Gun found on suspect in killing of UnitedHealthcare CEO matches shell casings at scene, police say",
      "url": "https://apnews.com/64ba21747f41c3a81f661900e797b6d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f18a92bf82ff45728637089b785bba40/1920.jpeg"
    },
    {
      "author": "DYLAN LOVAN and ALANNA DURKIN RICHER",
      "description": "LOUISVILLE, Ky. (AP) — The U.S. Justice Department and the city of Louisville have reached an agreement to reform the city’s police force after an investigation prompted by the fatal police shooting of Breonna Taylor, officials said Thursday.",
      "publishedAt": "2024-12-12T16:41:31Z",
      "title": "Justice Department, Louisville reach deal after probe prompted by Breonna Taylor killing",
      "url": "https://apnews.com/3aa7638bc8026f5a5a6e808757d56309",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de7e333ea45c49e1a455b244f68eef2d/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "The head of the Federal Aviation Administration, who has led a tougher enforcement policy against Boeing since a panel blew off a Boeing jet in January, said Thursday that he will step down next month, clearing the way for President-elect Donald Trump name his choice to lead the agency.",
      "publishedAt": "2024-12-12T15:32:52Z",
      "title": "Head of the Federal Aviation Administration to resign, allowing Trump to pick his successor",
      "url": "https://apnews.com/c6501489e7b633d6eeaf14821324f93c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3698e43599124b84bb60df6a37d786f7/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — What was once a bipartisan effort to expand by 66 the number of federal district judgeships across the country passed the House of Representatives on Thursday, though prospects for becoming law are murky after Republicans opted to bring the measure to the floor only after President-elect Donald Trump had won a second term.",
      "publishedAt": "2024-12-12T16:14:56Z",
      "title": "House passes bill to add 66 new federal judgeships, but prospects murky after Biden veto threat",
      "url": "https://apnews.com/b33b61805338643eb711cce35f278a51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d07bb04f585b43d2aa44fa31a9bc9f36/3000.jpeg"
    },
    {
      "author": "BRUCE SHIPKOWSKI",
      "description": "A large number of mysterious drones have been reported flying over parts of New Jersey in recent weeks, sparking speculation and concern over who sent them and why.",
      "publishedAt": "2024-12-12T16:33:03Z",
      "title": "What do we know about the mysterious drones reported flying over New Jersey?",
      "url": "https://apnews.com/0f4aba00748ac464d42270fbe7457733",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17667fb32cd24929987714aa4a3f6dee/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "Some early breast cancer patients can safely avoid specific surgeries, according to two studies exploring ways to lessen treatment burdens.",
      "publishedAt": "2024-12-12T15:01:06Z",
      "title": "Some breast cancer patients can avoid certain surgeries, studies suggest",
      "url": "https://apnews.com/983e2835a4ecd1f90f53105a5bab4bb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aab06a00b91842509e2a760326344212/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — Juan Soto will be introduced by the New York Mets at Citi Field on Thursday, a day after his record $765 million, 15-year contract was finalized.",
      "publishedAt": "2024-12-12T16:45:56Z",
      "title": "Juan Soto to be introduced by Mets at Citi Field after striking record $765 million, 15-year deal",
      "url": "https://apnews.com/c47a95f961a1348a0432d43ef30ccaf0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8988fb8bf3e741049788f25f6cece7b3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}