{
  "articles": [
    {
      "author": "GABRIELA AOUN ANGUEIRA and AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — Josephine Fraser worried her young family's next home would be a tent.Fraser and her partner, their two sons and their dog had moved nine times in as many months, from one hotel room to another, since the deadliest U.S.",
      "publishedAt": "2024-08-04T04:45:44Z",
      "title": "A year after Maui wildfire, chronic housing shortage and pricey vacation rentals complicate recovery",
      "url": "https://apnews.com/b4d68e3e22eb68693c6e173dd1642b93",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f317de0249e4f288cd39d296fd6c7a8/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE, JOEY CAPPELLETTI and MEG KINNARD",
      "description": "EAU CLAIRE, Wis. (AP) — Vice President Kamala Harris declared herself and her new running mate, Minnesota Gov. Tim Walz, “joyful warriors\" against Donald Trump on Wednesday as they spent their first full day campaigning together across the Midwest.",
      "publishedAt": "2024-08-07T04:11:52Z",
      "title": "Harris and Walz say they're 'joyful warriors,' narrowly miss tarmac confrontation with Vance",
      "url": "https://apnews.com/d66fad315f34ec68a50c81b118b18480",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/202c40d27b5f4b2887921e8e790a34d9/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "Ohio Sen. JD Vance, Donald Trump's running mate, defended on Wednesday a false claim the former president made about Vice President Kamala Harris ' racial identity, suggesting wrongly that Harris had downplayed her Black heritage in trying to suggest she's inauthentic.",
      "publishedAt": "2024-08-07T21:23:52Z",
      "title": "Vance and other Trump allies amplify a false claim about Harris' racial identity",
      "url": "https://apnews.com/6ebe9152437b6508f021bdd913193c6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc60c37f1f874a01b8dd60492b18c943/3000.jpeg"
    },
    {
      "author": null,
      "description": "VIENNA (AP) — Organizers of three Taylor Swift concerts in Vienna this week called them off on Wednesday after officials announced arrests over an apparent plot to launch an attack on an event in the Vienna area such as the concerts.",
      "publishedAt": "2024-08-07T17:32:23Z",
      "title": "Organizers cancel Taylor Swift concerts in Vienna over fears of an attack",
      "url": "https://apnews.com/7ece0b264f6e4152b8214c9fba8c425b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a81f08f511b4f03a13edf9bc319cb68/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "FORT MEADE, Md. (AP) — Defense Secretary Lloyd Austin's surprise decision to throw out a plea deal with accused 9/11 mastermind Khalid Sheikh Mohammed and two of his co-defendants has left their case at Guantanamo Bay, Cuba, in disarray, with the defense, prosecution and judge all uncertain about when and how it would move forward.",
      "publishedAt": "2024-08-07T16:54:55Z",
      "title": "9/11 hearings at Guantanamo Bay in upheaval after surprise order by US defense chief",
      "url": "https://apnews.com/d1ea80cf69649927d85b638f9913c76f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e1652c7424af47e396a6d2d68b48dc34/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "PARIS (AP) — Boxer Lin Yu-ting of Taiwan has advanced to the gold-medal bout in the women’s featherweight division, winning her third consecutive bout while dealing with widespread scrutiny regarding misconceptions about her gender at the Paris Olympics.",
      "publishedAt": "2024-08-07T19:54:42Z",
      "title": "Lin Yu-ting advances to gold-medal Olympic bout, excelling amid misconceptions about her gender",
      "url": "https://apnews.com/dd5707b283b57e232ff3ef28639063fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b2db4573a504fafae85e87dab5a100b/3000.jpeg"
    },
    {
      "author": "JEFFREY COLLINS and JOHN MINCHILLO",
      "description": "HUGER, S.C. (AP) — Days of rain forced the deluge-hardened residents of a South Carolina community to begin the near-ritualistic task of assessing damage left behind by Tropical Storm Debby, which continued spinning over the Atlantic Ocean and influencing thunderstorms from the East Coast to the Great Lakes on Wednesday.",
      "publishedAt": "2024-08-07T04:14:07Z",
      "title": "Tropical Storm Debby doles out repeat deluges for weather-weary residents",
      "url": "https://apnews.com/3d3e634978b9a03790c4e998b20505c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1e5a227500249338530e0829cab1689/1920.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — What should have been a quick trip to the International Space Station may turn into an eight-month stay for two NASA astronauts if they have to switch from Boeing to SpaceX for a ride home.",
      "publishedAt": "2024-08-07T21:10:24Z",
      "title": "NASA says chances are growing that astronauts may switch from Boeing to a SpaceX ride back to Earth",
      "url": "https://apnews.com/e2912c86bcb19dbcecee407fd146e3df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/788a0a3fa5a849d984ef006d01ce5a8b/1920.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and KIMBERLEE KRUESI",
      "description": "The number of women getting abortions in the U.S. actually went up in the first three months of 2024 compared with before the Supreme Court overturned Roe v Wade, a report released Wednesday found, reflecting the lengths that Democratic-controlled states went to expand access.",
      "publishedAt": "2024-08-07T13:01:43Z",
      "title": "US abortion numbers have risen slightly since Roe was overturned, study finds",
      "url": "https://apnews.com/7179dda48eae0a764be89c2e0aafd80a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d72a1375cb84f2baabe3085e66b53c4/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Yahya Sinwar's appointment as the top leader of Hamas formalizes a role he assumed in the early hours of Oct.",
      "publishedAt": "2024-08-07T13:47:16Z",
      "title": "Hamas has a new leader. How will that affect the war in Gaza and cease-fire efforts?",
      "url": "https://apnews.com/25d870421bb2ccd7ebc659a40d32429f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62c0bfd29d93409db97a9301c690435a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}