{
  "articles": [
    {
      "author": null,
      "description": "JERUSALEM (AP) — Israeli military chief warns \"there will be a response\" to Iranian missile attack.",
      "publishedAt": "2024-04-15T17:33:38Z",
      "title": "Israeli military chief warns \"there will be a response\" to Iranian missile attack",
      "url": "https://apnews.com/82c882979c1ec1b00d40e2a7cb3fda59",
      "urlToImage": ""
    },
    {
      "author": "JENNIFER PELTZ, MICHAEL R. SISAK and ERIC TUCKER",
      "description": "NEW YORK (AP) — Donald Trump arrived Monday at a New York court for the start of jury selection in his hush-money trial, marking a singular moment in American history as the former president answers to criminal charges that he falsified business records in order to stifle stories about his sex life.",
      "publishedAt": "2024-04-15T04:04:39Z",
      "title": "Trump's history-making hush-money trial begins with challenge of picking a jury",
      "url": "https://apnews.com/8da8759352478be8effd3d5734aae35e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/946e7c14e8fd4a65a92fb8c8ced88d78/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "NEW YORK (AP) — Prosecutors asked the judge overseeing Donald Trump ’s historic hush money trial to fine the former president $3,000 over three social media posts they say violated a gag order barring Trump from commenting on witnesses.",
      "publishedAt": "2024-04-15T14:15:07Z",
      "title": "The Latest | Ahead of jury selection, prosecutors ask judge to fine Trump over social media posts",
      "url": "https://apnews.com/e140fbf9e3b7dd8ab204d00be49563d4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/946e7c14e8fd4a65a92fb8c8ced88d78/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran's direct attack on Israel over the weekend upended decades of its shadowy warfare by proxy, something Tehran has used to manage international repercussions for its actions.",
      "publishedAt": "2024-04-15T12:54:00Z",
      "title": "Analysis: Iran upends decades of shadow warfare in direct attack on Israel as tensions mount at home",
      "url": "https://apnews.com/95a0861c8b51cda375d31a806686c23a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1d6034ee7e046218fed476278442397/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The Israeli military renewed warnings Monday for Palestinians not to return to northern Gaza, a day after witnesses and medical officials said Israeli troops opened fire and killed five people among throngs of displaced residents trying to walk back to their homes in the devastated area.",
      "publishedAt": "2024-04-15T10:20:35Z",
      "title": "Israeli military tells Palestinians not to return to north Gaza after witnesses say troops kill 5",
      "url": "https://apnews.com/5d6b5dc1483771045113eea2c1904449",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/801ec4c8d3c944a48fa383e4b965aed9/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and MICHAEL BALSAMO",
      "description": "The federal Bureau of Prisons said Monday it will close a women's prison in California known as the “rape club” despite attempts to reform the troubled facility after an Associated Press investigation exposed rampant staff-on-inmate sexual abuse.",
      "publishedAt": "2024-04-15T14:40:34Z",
      "title": "Bureau of Prisons to close California women's prison where inmates have been subjected to sex abuse",
      "url": "https://apnews.com/17731ecb5d0a14adf6011e853bf7e05d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a689405d263c4b4b9585b1b0c946203b/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, LEA SKENE and SARAH BRUMFIELD",
      "description": "BALTIMORE (AP) — The massive container ship that caused the deadly collapse of a Baltimore bridge experienced apparent electrical issues before it left port but set out anyway, someone with knowledge of the situation told The Associated Press on Monday, hours after the FBI said it was investigating whether any laws might have been broken.",
      "publishedAt": "2024-04-15T12:05:44Z",
      "title": "Ship that caused bridge collapse had apparent electrical issues while still docked, AP source says",
      "url": "https://apnews.com/58188d524035c756872603055f309c78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b122b175470a458c9292ae2ff0295736/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and JILL COLVIN",
      "description": "WASHINGTON (AP) — Tax Day reveals a major split in how Joe Biden and Donald Trump would govern: The presidential candidates have conflicting ideas about how much to reveal about their own finances and the best ways to boost the economy through tax policy.",
      "publishedAt": "2024-04-15T04:05:42Z",
      "title": "Tax Day reveals a major split in how Joe Biden and Donald Trump would govern",
      "url": "https://apnews.com/55d3031de64251169eb247f52430618d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bf357b87cc94bb19f3b90dbd7967758/3000.jpeg"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — On this Tax Day, refunds are looking a bit bigger for taxpayers. According to the latest IRS statistics, the average income tax refund so far this season is $3,011, up $123 from last year.",
      "publishedAt": "2024-04-15T09:01:20Z",
      "title": "It's Tax Day. And your refund may be big this year",
      "url": "https://apnews.com/dee7ae01dc6061697412a2571d406843",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0946fa72a5f94096a6251117d0a24f83/3000.jpeg"
    },
    {
      "author": "BARBARA SURK and SAMY MAGDY",
      "description": "PARIS (AP) — World donors pledged more than $2.1 billion in humanitarian aid for Sudan after a yearlong war that has pushed its population to the brink of famine, French President Emmanuel Macron said Monday.",
      "publishedAt": "2024-04-15T08:02:18Z",
      "title": "World donors pledge $2.1 billion in aid for war-stricken Sudan to ward off famine",
      "url": "https://apnews.com/1ee1c66d63835a96df813d0b0618bbfc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a1df969325f443894592d7c3d752581/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}