{
  "articles": [
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — Palestinians on Wednesday will mark the 76th year of their mass expulsion from what is now Israel, an event that is at the core of their national struggle. But in many ways, that experience pales in comparison to the calamity now unfolding in Gaza.",
      "publishedAt": "2024-05-14T04:57:07Z",
      "title": "Palestinians mark 76 years of dispossession as a potentially even larger catastrophe unfolds in Gaza",
      "url": "https://apnews.com/b5cea9556e516655c25598d5dbe54192",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/250bb230e87b4ca59b726ad712f90c3f/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, JOSEPH KRAUSS and SAMY MAGDY",
      "description": "RAFAH, Gaza Strip (AP) — Aid workers struggled Monday to distribute dwindling food and other supplies to hundreds of thousands of Palestinians displaced by what Israel says is a limited military operation in Rafah, as the two main crossings near the southern Gaza city remained closed.",
      "publishedAt": "2024-05-13T13:52:23Z",
      "title": "Misery deepens in Gaza's Rafah as Israeli troops press operation",
      "url": "https://apnews.com/6fae60f33d3664c282d5f535beb13c98",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a16376ee4cca45bfa5e690a1fd0c10ea/1920.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "KYIV, Ukraine (AP) — U.S. Secretary of State Antony Blinken arrived in Kyiv on Tuesday in an unannounced diplomatic mission to reassure Ukraine that it has American support as it struggles to defend against increasingly intense Russian attacks.",
      "publishedAt": "2024-05-14T02:30:53Z",
      "title": "Blinken visits Ukraine to tout US support for Kyiv's fight against Russia's advances",
      "url": "https://apnews.com/41df75260903f6b9527fbf3a1a44c815",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ba7d7431d9b4e07948a17d720d88f8e/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, ERIC TUCKER, MICHELLE L. PRICE and COLLEEN LONG",
      "description": "NEW YORK (AP) — Donald Trump 's fixer-turned-foe awaits a bruising round of questioning from the former president's lawyers on Tuesday after testimony that linked the celebrity client to all aspects of a hush money scheme that prosecutors say was aimed at stifling stories that threatened his 2016 campaign.",
      "publishedAt": "2024-05-14T04:03:46Z",
      "title": "Michael Cohen to face bruising cross-examination by Trump's lawyers",
      "url": "https://apnews.com/735aadfd1ce015e05ba955c203a96f1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f56935b9db347c88eb70dffcc1ab858/1920.jpeg"
    },
    {
      "author": "LEA SKENE",
      "description": "BALTIMORE (AP) — Crews set off a chain of carefully placed explosives Monday to break down the largest remaining span of the collapsed Francis Scott Key Bridge in Baltimore, and with a boom and a splash, the mangled steel trusses came crashing down into the river below.",
      "publishedAt": "2024-05-13T17:33:55Z",
      "title": "Collapsed Baltimore bridge span comes down with a boom after crews set off chain of explosives",
      "url": "https://apnews.com/1575472095b90256ce00bc69a88d5acb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3d703d1e0df4fb297e5dd03cbb384e8/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW DELHI (AP) — A large billboard collapsed onto people during heavy rain and thunderstorms in India's western city of Mumbai, killing at least 14 and injuring 74 others, reports said.A rescue operation was ongoing Tuesday morning, and it was unclear how many people may still be trapped.",
      "publishedAt": "2024-05-14T03:14:17Z",
      "title": "Billboard collapses onto people in Mumbai, India, killing at least 14 but others may be trapped",
      "url": "https://apnews.com/3e370788d5071f65f9a1c0f7e88ae3da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/584475917e2e432e989e1809b86fba44/3000.jpeg"
    },
    {
      "author": null,
      "description": "FORT NELSON, British Columbia (AP) — An intense wildfire could reach a town in western Canada this week, fire experts and officials warned, based on forecasts of winds that have fueled the out-of-control blaze, which has forced the evacuation of thousands of people.",
      "publishedAt": "2024-05-13T10:37:33Z",
      "title": "A town in western Canada prepares for a possible 'last stand' as wildfires rage in British Columbia",
      "url": "https://apnews.com/dace46a958c9426056eb7da908a3f115",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/218c80a08a014635944cdc3c5e92f589/1920.jpeg"
    },
    {
      "author": "HANNA ARHIROVA and TASSANEE VEJPONGSA",
      "description": "PHILADELPHIA (AP) — Former Ukrainian President Viktor Yushchenko said the long delay by the U.S.",
      "publishedAt": "2024-05-14T04:19:59Z",
      "title": "Ex-Ukrainian president says US delay in war aid was 'colossal' waste, let Putin inflict more damage",
      "url": "https://apnews.com/857a53214e963d2c208d1b8434eafade",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9c9a6f4936a4cb2bcde6c140fbaf69a/3000.jpeg"
    },
    {
      "author": "JUSTIN SPIKE",
      "description": "BUDAPEST, Hungary (AP) — When Chinese President Xi Jinping visited Hungary last week, he arrived to one of the few places in the European Union where his country is considered an indispensable ally rather than a rival.",
      "publishedAt": "2024-05-14T04:07:01Z",
      "title": "Xi's visit to Hungary and Serbia brings new Chinese investment and deeper ties to Europe's doorstep",
      "url": "https://apnews.com/8b112f599ab51a18e290d5183b971970",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c0b44c96d66c49589c2dbfed890582da/3000.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "CANNES, France (AP) — The Cannes Film Festival opens Tuesday with the unveiling of Greta Gerwig's jury and the presentation of an honorary Palme d'Or for Meryl Streep, as the French Riviera spectacular kicks off a potentially volatile 77th edition.",
      "publishedAt": "2024-05-14T04:09:55Z",
      "title": "Cannes kicks off with Greta Gerwig's jury and a Palme d'Or for Meryl Streep",
      "url": "https://apnews.com/650243306d8e6fb23b76e55f8e452c6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8b7feefeaf7481984c5566e4b8d28cb/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}