{
  "articles": [
    {
      "author": "MAHMOUD ILLEAN and NATALIE MELZER",
      "description": "ALLENBY CROSSING, West Bank (AP) — Three Israelis were shot and killed Sunday at the border crossing between the West Bank and Jordan, Israeli officials said, in what appeared to be an attack linked to the 11-month-old war in Gaza.",
      "publishedAt": "2024-09-08T07:27:02Z",
      "title": "Shooting attack at the West Bank-Jordan border crossing kills 3 Israelis",
      "url": "https://apnews.com/5278cf1f7ec254fb6ecca0f2758e7e3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fe728306f8a4278aa726dcd6bfa3d3d/3000.jpeg"
    },
    {
      "author": "JALAL BWAITEL and JULIA FRANKEL",
      "description": "KHIRBET ZANUTA, West Bank (AP) — An entire Palestinian community fled their tiny West Bank village last fall after repeated threats from Israeli settlers with a history of violence.",
      "publishedAt": "2024-09-08T04:25:26Z",
      "title": "Chased away by Israeli settlers, these Palestinians returned to a village in ruins",
      "url": "https://apnews.com/b426fa223791d88e97bcd48d3e618081",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f2b93ed6ffa4b048e1eed715b21eec4/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM and CLAIRE RUSH",
      "description": "The mother of the 14-year-old who has been charged with murder over the fatal shooting of four people at his Georgia high school called the school before the killings, warning staff of an “extreme emergency” involving her son, a relative said.",
      "publishedAt": "2024-09-07T04:06:12Z",
      "title": "Mother of Georgia shooting suspect called school to warn of emergency, aunt says",
      "url": "https://apnews.com/92fce6b86f5e2ad23c3337aff1997cab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e1b4facf3fc4cd9b3e28fd6e1437ab9/1920.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG, JILL COLVIN and SCOTT BAUER",
      "description": "MOSINEE, Wis. (AP) — With just days to go before his first — and likely only — debate against Vice President Kamala Harris, former President Donald Trump posted a warning on his social media site threatening to jail those “involved in unscrupulous behavior” this election, which he said would be under intense scrutiny.",
      "publishedAt": "2024-09-07T04:04:52Z",
      "title": "Trump threatens to jail adversaries in escalating rhetoric ahead of pivotal debate",
      "url": "https://apnews.com/a6923d6c5758dabb6d959417ea9d7d12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91e261798a014908bb8243113fad1b50/1920.jpeg"
    },
    {
      "author": "BRUCE SCHREINER",
      "description": "LONDON, Ky. (AP) — A manhunt was underway early Sunday as police searched for a gunman in a rural area of southeastern Kentucky near Interstate 75, according to authorities who said seven people were hurt in the shooting and a vehicle accident that accompanied the violence.",
      "publishedAt": "2024-09-07T23:56:29Z",
      "title": "Authorities search for shooter along I-75 in southeastern Kentucky with up to 7 people hurt",
      "url": "https://apnews.com/08391eb00af983c81a9bc8856201f572",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15230712d7f7418695dfc8e2c8ee29d0/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson is heeding the demands of the more conservative wing of his Republican conference and has teed up a vote this week on a bill that would keep the federal government funded for six more months and require states to obtain proof of citizenship, such as a birth certificate or passport, when registering a person to vote.",
      "publishedAt": "2024-09-08T11:32:49Z",
      "title": "House Republicans push to link government funding to a citizenship check for new voters",
      "url": "https://apnews.com/6c97f372a7d27c40deea15a948178794",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cc5d8831bc84a4daddfe3b9166a6239/3000.jpeg"
    },
    {
      "author": "JORGE RUEDA, JOSHUA GOODMAN and JOSEPH WILSON",
      "description": "CARACAS, Venezuela (AP) — Former Venezuelan opposition presidential candidate Edmundo González has fled into exile after being granted asylum in Spain, delivering a major blow to millions who placed their hopes in his upstart campaign to end two decades of single-party rule.",
      "publishedAt": "2024-09-08T03:30:27Z",
      "title": "Opposition presidential candidate González flees Venezuela for asylum in Spain",
      "url": "https://apnews.com/749131a560dd9d762e04e201e43b9495",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e2a6d750a154880b2763dd0d37fa016/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "VANIMO, Papua New Guinea (AP) — Pope Francis traveled to the remote jungles of Papua New Guinea on Sunday to celebrate the Catholic Church of the peripheries, bringing with him a ton of medicine, musical instruments and a message of love for the people who live there.",
      "publishedAt": "2024-09-07T23:11:56Z",
      "title": "Pope arrives in the remote jungles of Papua New Guinea with a ton of humanitarian aid and toys",
      "url": "https://apnews.com/33fb0e7ca68a8c9595812271586388d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ef8cd7d62bd46be873e90efe95bc51b/3000.jpeg"
    },
    {
      "author": "ANIRUDDHA GHOSAL",
      "description": "HANOI, Vietnam (AP) — At least 14 people have died and 176 others injured in Vietnam after Typhoon Yagi slammed the country's north, state media said Sunday, as officials warned of heavy downpours despite its waning power.",
      "publishedAt": "2024-09-08T08:29:41Z",
      "title": "Typhoon Yagi kills 14 in Vietnam as officials warn of heavy rain that can cause flooding",
      "url": "https://apnews.com/8da74ac4ed2058b9eafa7e8227acd52c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53219bfd6e974e3690b53146be34f56f/3000.jpeg"
    },
    {
      "author": "HOWARD FENDRICH",
      "description": "NEW YORK (AP) — Aryna Sabalenka left the U.S.",
      "publishedAt": "2024-09-07T16:25:18Z",
      "title": "Aryna Sabalenka beats Jessica Pegula to win the US Open for her third Grand Slam title",
      "url": "https://apnews.com/e2fcc2778a1e9fdee72b3a00b70409b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38fd9c96a4324dc0a06ac616b548aa43/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}