{
  "articles": [
    {
      "author": null,
      "description": "President Donald Trump will convene a peace summit at the White House with the leaders of Armenia and Azerbaijan. The meeting is meant to end decades of conflict and help reopen key transportation corridors across the South Caucasus that have been shut since the early 1990s. Trump says the two leaders will participate in a peace ceremony and sign economic agreements with the U.S. that will “fully unlock the potential of the South Caucasus Region.” The Republican president on Friday will first meet with Armenian Prime Minister Nikol Pashinyan and then will host Azerbaijan's President Ilham Aliyev. All three leaders will participate in a joint signing ceremony in the State Dining Room.",
      "publishedAt": "2025-08-08T13:36:46Z",
      "title": "Trump hosts Armenia and Azerbaijan for peace summit",
      "url": "https://apnews.com/article/donald-trump-white-house-armenia-azerbaijan-069379e9c4a058c96af38afbf4684829",
      "urlToImage": "https://dims.apnews.com/dims4/default/0d675af/2147483647/strip/true/crop/5327x2996+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F20%2Fdbb3f6ef42fa11ce05897ea87ad8%2Ffc387d7797234005bd38aaf6b37a364c"
    },
    {
      "author": null,
      "description": "The Justice Department has subpoenaed New York Attorney General Letitia James as it investigates whether she violated Trump’s civil rights. That's according to people familiar with the matter on Friday. The subpoenas mark an escalation of the Trump administration’s ongoing efforts to scrutinize perceived adversaries of the president, including those like James who had investigated Trump before his election win last November. News of the subpoena comes as the Justice Department advances an investigation into the Trump-Russia probe that shadowed Trump for much of his first term as president and as the administration has engaged in a widespread purge from the workforce of law enforcement officials who had been involved in examining the activities of Trump and his supporters.",
      "publishedAt": "2025-08-08T15:36:10Z",
      "title": "Justice Department subpoenas NY AG James relative to Trump",
      "url": "https://apnews.com/article/trump-james-attorney-general-justice-department-subpoena-9dec45248df0e06b1d99ff9944e6d327",
      "urlToImage": "https://dims.apnews.com/dims4/default/8f16c7d/2147483647/strip/true/crop/6400x3600+0+334/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F46%2F6674ea912f103ecfd8b5554e06b8%2F8b6ab665f68243c0b4e43731ed2466e4"
    },
    {
      "author": null,
      "description": "An appeals court is tossing out a judge’s contempt finding against President Donald Trump's administration in a case over deportations to an El Salvador prison. The Friday decision from the appeals court based in the nation’s capital reverses a finding from U.S District Judge James E. Boasberg that there was probable cause to hold the Trump administration in criminal contempt of court. Boasberg had accused administration officials of rushing deportees out of the country under the Alien Enemies Act before they could challenge their removal in court and then willfully disregarding his order that planes already in the air should return to the United States. The Republican administration has denied violating his order.",
      "publishedAt": "2025-08-08T15:02:03Z",
      "title": "Appeals court tosses contempt finding against Trump in prison deportations",
      "url": "https://apnews.com/article/trump-deportations-boasberg-judge-el-salvador-ae0c8040273de0ca89fac0539227b987",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5f012f/2147483647/strip/true/crop/3452x1942+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F9f%2F979e9034c10d6a9f42f563cd9107%2Fab9a0b837cfd4d0988b08474ab7d367e"
    },
    {
      "author": null,
      "description": "Israel says it plans to take over Gaza City in another escalation of its 22-month war with Hamas. The decision, made after a late-night meeting of top officials, drew Palestinian rejection, fueled mounting international calls to end the war and provoked worries in Israel over the fate of hostages still held by Hamas. Israel’s air and ground war has already killed tens of thousands of people in Gaza, displaced most of the population, destroyed vast areas and pushed the territory toward famine. Another major ground operation would almost certainly exacerbate the humanitarian catastrophe. Hamas in a statement rebuffed Netanyahu’s plans and vowed remain defiant.",
      "publishedAt": "2025-08-08T06:20:07Z",
      "title": "Israel announces plan to retake Gaza City in another escalation of the war",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-hostages-gaza-08-08-2025-920f5b4bfd3fe07ded6acd28f5d77768",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c48ff2/2147483647/strip/true/crop/6124x3445+0+319/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2F2d%2F110abd56da33a34463f6a7184624%2Fd9d69b9fb6c14d1588830dc4c37b33d4"
    },
    {
      "author": null,
      "description": "Nagasaki is marking the U.S. atomic attack on the southern city 80 years ago, with survivors determined to make their hometown the last place on earth hit by the bomb. Survivors in the Japanese city will commemorate the anniversary Saturday by passing on their stories and telling younger people it remains relevant to their future. Survivors increasingly worry the world is moving in the opposite direction. The atomic bomb dropped by the U.S. on Nagasaki on Aug. 9, 1945, killed some 70,000 people three days after the bombing of Hiroshima that killed 140,000. Japan surrendered on Aug. 15, 1945, ending World War II.",
      "publishedAt": "2025-08-09T01:38:34Z",
      "title": "Nagasaki marks 80th A-bombing anniversary as survivors ask youth to work for nuke ban",
      "url": "https://apnews.com/article/japan-nagasaki-atomic-bombing-anniversary-wwii-ceremony-409af035fc6ca4834f5102592e8d464b",
      "urlToImage": "https://dims.apnews.com/dims4/default/7442332/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F34%2F0ea303a9664509398dd34a7b4f04%2Faa690733c3274cb4908bf1cb6ea96f0d"
    },
    {
      "author": null,
      "description": "German Chancellor Friedrich Merz says Germany will not authorize exports of military equipment that could be used in Gaza “until further notice.” This decision comes after the Israeli Cabinet announced plans to take over Gaza City. On Friday, Merz emphasized that Israel “has the right to defend itself against Hamas’ terror.” He stated that the release of Israeli hostages and negotiations toward a cease-fire in the 22-month conflict “are our top priority.” Merz added that the recent military actions by Israel make it difficult for Germany to see how these goals will be achieved.",
      "publishedAt": "2025-08-08T10:31:08Z",
      "title": "Germany stops military exports that could be used in Gaza",
      "url": "https://apnews.com/article/germany-mideast-weapons-b957e28b73ee94ed33fbd2d4e4d36246",
      "urlToImage": "https://dims.apnews.com/dims4/default/10ebff4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2Fd4%2F6233e30ffe309e49b09b18d97d34%2F847fee673abd441b9a611804b98537e5"
    },
    {
      "author": null,
      "description": "Ukrainian soldiers are expressing little hope for a diplomatic solution to the war with Russia. U.S. President Donald Trump’s Friday deadline for the Kremlin to stop the killing has arrived. Trump is eyeing a possible summit with Russian President Vladimir Putin to discuss the conflict. His efforts to pressure Putin have delivered no progress so far. Russia’s army is advancing deeper into Ukraine and it is bombarding cities. In eastern Ukraine, a commander says Moscow isn’t interested in peace. Hungarian Prime Minister Viktor Orbán says Europe should lead efforts to end the conflict.",
      "publishedAt": "2025-08-08T10:49:06Z",
      "title": "Ukrainian troops have little hope for peace as Trump presses Putin",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-deadline-putin-423e6a28df5186a48b7383eae41c11c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/ca6c91c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Fdb%2Fb00b3291f089e967cdd297b76e22%2F21fa3b40e5954a729b03efac87ec2fbb"
    },
    {
      "author": null,
      "description": "Texas Republicans are planning to escalate their efforts to end a weeklong holdout by Democrats if they don’t return to the state Capitol to face a vote on new congressional voting maps. The state House of Representatives was scheduled on Friday to convene again in a third attempt this week to reach a quorum. Texas Attorney General Ken Paxton has pledged legal action to try to get the missing Democrats removed from office if they do not return. Gov. Greg Abbott has threatened to keep calling lawmakers into special sessions until outnumbered Democrats return.",
      "publishedAt": "2025-08-08T15:49:39Z",
      "title": "Texas Democrats head to California as Republicans warn of more escalations over walkout",
      "url": "https://apnews.com/article/texas-redistricting-holdout-donald-trump-f308f15f972952d84194f12edea1b3ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/4d0c9d3/2147483647/strip/true/crop/3600x2025+0+166/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fc5%2F466c22388dce564b34975628d915%2F76f1828f3a25405d825a8cc4b3590606"
    },
    {
      "author": null,
      "description": "Emory University has alerted students and staff Friday to an active shooter on their Atlanta campus. The alert Friday told students to “RUN, HIDE, FIGHT” and avoid the area. Atlanta police said they were responding to reports of an active shooter. They did not immediately say whether anyone was injured in the shooting.",
      "publishedAt": "2025-08-08T21:45:42Z",
      "title": "Active shooter reported at Emory University in Atlanta, authorities say",
      "url": "https://apnews.com/article/emory-university-shooting-atlanta-407f755f2db20dbab7d04981614f1428",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Authorities say they have captured a man suspected in a shooting at a Montana bar that left four people dead. Law enforcement officers had spend the past week scouring nearby mountains. Forty-five-year-old Michael Paul Brown was taken into custody around 2 p.m. Friday. Montana Attorney General Austin Knudsen said Brown was flushed out after about 130 officers made what he called a hard push on a hill a few miles from Anaconda. He said tips from the public helped verify they were searching the right area. Authorities have not said what sparked last week’s shooting at The Owl Bar in Anaconda.",
      "publishedAt": "2025-08-08T21:48:31Z",
      "title": "Man suspected of killing 4 people at a Montana bar is in custody",
      "url": "https://apnews.com/article/montana-shooting-michael-paul-brown-51723a5141062860b0e63fcd3eadd49b",
      "urlToImage": "https://dims.apnews.com/dims4/default/1dc4f99/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F15%2Fed425a0fee36c0eddcf0a77deccc%2F980e0661928e4f969368b6e230687675"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}