{
  "articles": [
    {
      "author": "Illia Novikov",
      "description": "Officials say a Russian drone has struck an apartment building in a southeastern Ukraine city, killing three people and injuring 10 others. The attack early Friday came a day after U.S. President Donald Trump rebuked Russia’s leader for a deadly missile and drone attack on Kyiv while Washington endeavors to stop the more than three-year war. Russia pounded Kyiv in an hourslong barrage Thursday, killing at least 12 people and injuring 87 in its deadliest assault on the Ukrainian capital since July. Trump envoy Steve Witkoff is expected to meet with President Vladimir Putin in Moscow on Friday for the second time this month.",
      "publishedAt": "2025-04-25T08:23:52Z",
      "title": "Ukraine says Russia kills 3 in another drone attack after Trump rebukes Putin",
      "url": "https://apnews.com/article/russia-ukraine-war-trump-putin-33015fe967ab7cd09fee165fed59953e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e3ece30/2147483647/strip/true/crop/7377x4150+0+384/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F64%2Fa0fd2b356466dafc87092d1f5c11%2F2d3514f6bd7b4439a769dba42f82e7c9"
    },
    {
      "author": "Colleen Barry",
      "description": "Heads of state and royalty will begin converging on Rome for Pope Francis’ funeral in the Vatican’s St. Peter’s Square, but the group of poor people who will meet his casket in a small crosstown basilica are more in keeping with Francis’ humble persona and disdain for pomp. U.S. President Donald Trump and Argentine President Javier Milei are among the leaders arriving Friday. That is the last day Argentine pope will lie in state in St. Peter’s Basilica before his coffin is sealed in preparation for his funeral Saturday. More than 90,000 mourners have waited hours in line to bid farewell to Francis, who died Monday.",
      "publishedAt": "2025-04-25T04:07:48Z",
      "title": "Trump and Zelenskyy among dignitaries converging on Rome for funeral of Pope Francis",
      "url": "https://apnews.com/article/italy-vatican-pope-funeral-dignitaries-b8c206d03e3535b8ee3b18d42667b803",
      "urlToImage": "https://dims.apnews.com/dims4/default/2fba9c1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F91%2F18f17c1a0ac4cf08c7b08cca5c7d%2F12068fd3696c4425b9410471616641b3"
    },
    {
      "author": "Nicole Winfield",
      "description": "Associated Press reporter Nicole Winfield, who covered Pope Francis at the Vatican during his entire pontificate, earned the nickname “la prima della classe” -- or “the first in class” -- from him in 2018. It came during a particularly low point in his papacy, when he was struggling with cases of priests who sexually abused children. Francis bestowed the name after Winfield challenged him with especially tough questions about his seeming indifference toward Chilean abuse victims. In an AP interview in 2023, Francis acknowledged that the 2018 news conference where the exchange took place was the moment he began to understand the depths of the scandal.",
      "publishedAt": "2025-04-25T04:11:43Z",
      "title": "Pope Francis bestowed a special nickname on AP's Vatican reporter for her often-tough questions",
      "url": "https://apnews.com/article/pope-francis-associated-press-vatican-correspondents-59f27fce3478d913a82dc90974fa984c",
      "urlToImage": "https://dims.apnews.com/dims4/default/64d7a60/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F17%2F10%2Fad6c1100a0e7fef9d6cd736fe834%2F1f89e2e0cb2d4cb2a16313a3417ddc9e"
    },
    {
      "author": "Aijaz Hussain, Rajesh Roy",
      "description": "Indian officials said the army had a brief exchange of fire with Pakistani soldiers along their highly militarized frontier in the Himalayan region of Kashmir, as the nuclear-armed rivals ramped up tit-for-tat diplomatic offensive following a deadly attack on tourists in the disputed area. The report of a gunfight comes amid soaring tensions between New Delhi and Islamabad after gunmen killed 26 people near the resort town of Pahalgam in Kashmir on Tuesday. India immediately described the massacre a “terror attack” and said it had “cross border” links, blaming Pakistan for backing it. Pakistan denied any connection to the attack, which was claimed by a previously unknown militant group calling itself the Kashmir Resistance.",
      "publishedAt": "2025-04-25T06:21:50Z",
      "title": "Indian troops exchanged fire with Pakistani soldiers in disputed Kashmir, officials say",
      "url": "https://apnews.com/article/kashmir-india-pakistan-pahalgam-tourist-attack-tensions-94de38a3c24137dcc25e77dffc4cc5f2",
      "urlToImage": "https://dims.apnews.com/dims4/default/b6a6ab6/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F78%2F55fbd2dc70d370e6f5f9eff1bfc9%2Fdbb83cc5180c43c6ad61eb92ea0b4391"
    },
    {
      "author": "Rajesh Roy",
      "description": "A deadly attack on tourists in Indian-controlled Kashmir has again moved India and Pakistan closer to war. The rivals have downgraded their diplomatic and trade ties, closed their main border crossing and revoked visas for each other’s nationals. Pakistan denies it was behind Tuesday’s attack in which 26 mostly Indian tourists were killed at a scenic spot in the Himalayan region. India claims it restored a sense of calm in Kashmir despite a decadeslong rebellion. India and Pakistan have fought two of their three wars over Kashmir, which is split between them and claimed by both in its entirety.",
      "publishedAt": "2025-04-24T12:43:36Z",
      "title": "Pahalgam attack: India and Pakistan again on the brink of conflict",
      "url": "https://apnews.com/article/india-pakistan-kashmir-explainer-c45cae691eea394e80d468918b038edb",
      "urlToImage": "https://dims.apnews.com/dims4/default/d88ee6c/2147483647/strip/true/crop/3700x2081+0+193/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F45%2Fac869aa1e2f4d8424546c42e78b8%2Ff8e119b65adb4515af2492bb90f7976b"
    },
    {
      "author": "Linley Sanders",
      "description": "A new poll finds President Donald Trump’s handling of immigration remains a point of strength as he takes wide-ranging action to ramp up deportations and target people in the U.S. illegally. The Associated Press-NORC Center for Public Affairs Research poll shows just under half of U.S. adults approve of Trump’s handling of immigration, which is nearly 10 percentage points higher than his approval rating on the economy and foreign trade. But about half of Americans say the Republican president has “gone too far” when it comes to deporting immigrants in the U.S. illegally. Americans are divided on the deportation of Venezuelan immigrants accused of being gang members to El Salvador.",
      "publishedAt": "2025-04-25T11:02:58Z",
      "title": "Trump's strongest issue is immigration, but many say he's gone too far",
      "url": "https://apnews.com/article/trump-immigration-deportation-poll-el-salvador-81f8040599b9c585554678371e12ed5a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d9682d6/2147483647/strip/true/crop/4535x2551+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2Fce%2F03dbb4b7d1ff260ae1ee911b56f0%2Fab75dd2eb0f446749f2a279a463e7b4b"
    },
    {
      "author": "Jill Colvin",
      "description": "Since returning to the White House, President Donald Trump has launched an unprecedented campaign of immigration enforcement that has pushed the limits of executive power and clashed with federal judges trying to restrain him. But unlike in his first term, Trump’s efforts have not sparked the kind of widespread condemnation that forced him to retreat from some unpopular positions. Immigration has emerged as one of the Republican president's strongest issues in public polling. The White House has seized on this shift, mocking critics and egging on Democrats to engage on an issue Trump’s team sees as a win.",
      "publishedAt": "2025-04-25T11:13:57Z",
      "title": "How public's shift on immigration paved way for Trump's crackdown",
      "url": "https://apnews.com/article/trump-immigration-enforcement-deportation-public-polling-df7d0d35dfa031e1444bfa9e9e0b13bd",
      "urlToImage": "https://dims.apnews.com/dims4/default/d64d6b1/2147483647/strip/true/crop/5452x3067+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F43%2F040818f2d502efb25285634e89a4%2F72589501ea084bcead751729055f9421"
    },
    {
      "author": "Jon Gambrell",
      "description": "Negotiations between Iran and the United States over Tehran’s rapidly advancing nuclear program will return Saturday to the secluded sultanate of Oman. Experts on both sides will start hammering the technical details of any possible deal. The talks seek to limit Iran’s nuclear program in exchange for the lifting of some of the crushing economic sanctions the U.S. has imposed on the Islamic Republic closing in on half a century of enmity. Trump repeatedly has threatened to unleash airstrikes targeting Iran’s program if a deal isn’t reached. Iranian officials increasingly warn that they could pursue a nuclear weapon with their stockpile of uranium enriched to near weapons-grade levels.",
      "publishedAt": "2025-04-25T05:28:58Z",
      "title": "Iran-US nuclear talks return to secluded Oman",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-oman-8cba4d7101195408a127e8c3b89eda3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5317aa0/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F44%2Fcd7cf5acc9c9b93991a23d5001d5%2F06b530a747cf408fb05ee1239aa096f9"
    },
    {
      "author": "Mike Catalini",
      "description": "Authorities say a man set wooden pallets on fire and failed to properly put them out in New Jersey’s Pine Barrens, sparking a quick-moving wildfire with smoke affecting the air quality in the New York City area. Ocean County Prosecutor Bradley Billhimer and Department of Environmental Protection Commissioner Shawn LaTourette said the 19-year-old Waretown man faces aggravated arson and arson charges in the southern New Jersey wildfire. The fire by Thursday morning grew to more than 23.8 square miles. New Jersey also cautioned early Thursday about air quality. The prosecutor’s office said the arrested man has no attorney listed yet.",
      "publishedAt": "2025-04-24T11:34:39Z",
      "title": "Man charged with arson in New Jersey Pine Barrens fire",
      "url": "https://apnews.com/article/new-jersey-wildfire-smoke-ny-air-quality-67b146ae19bef2cb111d7efc3d0b563d",
      "urlToImage": "https://dims.apnews.com/dims4/default/1053eaa/2147483647/strip/true/crop/2843x1599+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2F89%2Fc12fe8fc28df1b1053a64a94f905%2Ff9989f176dd7415386ccf0ca45291ea3"
    },
    {
      "author": "Rob Maaddi",
      "description": "Cam Ward went from zero-star recruit to No. 1 pick in the NFL draft. Travis Hunter cost Jacksonville a premium. Jaxson Dart was selected before Shedeur Sanders. While Ward, Hunter and Abdul Carter went 1-2-3 as expected, Sanders wasn't picked at all in the first round. Sanders was passed over by every team that had a need for a potential franchise quarterback, even though some draft analysts had him rated higher than Ward. The New York Giants had two chances to take Sanders and went with Penn State edge rusher Carter with the No. 3 pick, bolstering an already strong pass rush. The Giants then moved back into the first round and selected Dart, a quarterback from Ole Miss, at No. 25.",
      "publishedAt": "2025-04-25T00:20:35Z",
      "title": "Cam Ward goes No. 1 overall in NFL draft as Titans get their QB",
      "url": "https://apnews.com/article/nfl-draft-2025-8047d03bcba02eb5eb37c96fd8e2c48a",
      "urlToImage": "https://dims.apnews.com/dims4/default/b50530f/2147483647/strip/true/crop/7469x4201+0+390/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F36%2Fecde731c95017b2df1cc3358efab%2F9e51415e9d7c4b3dbd69f73da33a3892"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}