{
  "articles": [
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The House voted on Friday to expel Republican Rep. George Santos of New York after a critical ethics report on his conduct that accused him of converting campaign donations for his own use.",
      "publishedAt": "2023-12-01T05:13:33Z",
      "title": "House expels New York Rep. George Santos. It's just the sixth expulsion in the chamber's history",
      "url": "https://apnews.com/fd0f1524065883c6b2fe3e6f9afd84db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/595a64178b874878a06ba8fd8c19e9e7/1920.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and JULIA FRANKEL",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel’s war with Hamas erupted again Friday, as airstrikes hit houses and buildings in the Gaza Strip minutes after a weeklong truce expired.",
      "publishedAt": "2023-12-01T05:05:56Z",
      "title": "Israeli airstrikes on Gaza resume after weeklong truce with Hamas ends",
      "url": "https://apnews.com/c944c736efdf8993c7a17cf683d6e364",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4870f43928694e5b9b0aaa4f0674739c/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Retired Supreme Court Justice Sandra Day O’Connor, an unwavering voice of moderate conservatism and the first woman to serve on the nation’s highest court, died Friday.",
      "publishedAt": "2023-12-01T15:02:29Z",
      "title": "Retired Justice Sandra Day O'Connor, the first woman on the Supreme Court, has died at age 93",
      "url": "https://apnews.com/304f91633f069c46350bdfff540ff9fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/02cba2aa473d4eb89fbe8f2360e8914e/1986.jpeg"
    },
    {
      "author": "JAMES JORDAN, SAMYA KULLAB and ILLIA NOVIKOV",
      "description": "KHARKIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy says the war with Russia is in a new stage, with winter expected to complicate fighting after a summer counteroffensive that failed to produce desired results due to enduring shortages of weapons and ground forces.",
      "publishedAt": "2023-12-01T05:03:26Z",
      "title": "The AP Interview: Ukraine's Zelenskyy says the war with Russia is in a new phase as winter looms",
      "url": "https://apnews.com/75f1f785b17452fc23819d459e6ab64b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e6dbcf4f4224084b9c23fdcbaf4d22d/1920.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — Lawsuits against Donald Trump over the U.S. Capitol riot can move forward, a federal appeals court ruled on Friday, rejecting the former president's bid to dismiss the cases accusing him of inciting the violent mob on Jan.",
      "publishedAt": "2023-12-01T15:33:50Z",
      "title": "Lawsuits against Trump over Jan. 6 riot can move forward, appeals court rules",
      "url": "https://apnews.com/14b219df31b3a5ebec43e979ad36587a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb7a5bfde1ef438fadaad946c31426fc/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "JERUSALEM (AP) — There was no trace of Hanan Yablonka — not on the 42-year-old Israeli's social media accounts nor on his phone, found in the bullet-riddled car he and four friends tried to flee in after Hamas militants attacked the music festival they were attending in southern Israel.",
      "publishedAt": "2023-12-01T06:06:31Z",
      "title": "Nearly 2 months into the war, many Israelis have no idea if their relatives are dead or alive",
      "url": "https://apnews.com/095f64d06108416ff9c58ea7550b9a74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2d47f36b52c1475cb9db4ec5a0dc4250/3000.jpeg"
    },
    {
      "author": "PETER PRENGAMAN",
      "description": "DUBAI, United Arab Emirates (AP) — Ask most people what the annual U.N. climate talks are and the likely answer will be: “Huh?” Ask those who do know and the answer may be: “Why should I care?\"The negotiations, called Conference of Parties, are nearly two weeks long and in their 28th iteration in Dubai.",
      "publishedAt": "2023-12-01T05:52:37Z",
      "title": "5 reasons why COP 28, the UN climate talks, are worth your attention",
      "url": "https://apnews.com/8df2b30f6420477e9e404ed6bc23b2b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d06d4f2b97ad4559ab01771f6df566f3/3000.jpeg"
    },
    {
      "author": "JEFF McMILLAN",
      "description": "When Sam Schultz was sexually assaulted, it felt like a part of them died.It took eight years and the burgeoning #MeToo movement to spur them to go public and make a police report, and an additional five years for their attackers to plead guilty.",
      "publishedAt": "2023-12-01T05:09:14Z",
      "title": "For a male sexual assault survivor, justice won in court does not equal healing",
      "url": "https://apnews.com/183cd34b8b86543b10ca3d041f8aacd4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70d4a3b96d6b442eabf8186bcf693c65/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — More Americans now believe the death penalty, which is undergoing a yearslong decline of use and support, is being administered unfairly, a finding that is adding to its growing isolation in the U.S., according to an annual report on capital punishment.",
      "publishedAt": "2023-12-01T05:06:21Z",
      "title": "Report: Belief death penalty is applied unfairly shows capital punishment's growing isolation in US",
      "url": "https://apnews.com/fa998133f3b8b0bbe2b80b21c08534f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d4ed2714fba4f7d8934bdc635c290a3/1776.jpeg"
    },
    {
      "author": "JENNIFER SINCO KELLEHER",
      "description": "KALAUPAPA, Hawaii (AP) — Kalaupapa beckoned to Kyong Son Toyofuku. She had long prayed to visit the hard-to-reach Hawaiian peninsula, trapped by its deep-green, sheer sea cliffs and rugged, black rock shores that glisten under the Pacific’s pristine waters.",
      "publishedAt": "2023-12-01T13:00:05Z",
      "title": "Pilgrims yearn to visit isolated peninsula where Catholic saints cared for Hawaii's leprosy patients",
      "url": "https://apnews.com/3ff14d257d6f59ae167e51c0bea608a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ae61fcc530b43689a7b813707a7fddd/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}