{
  "articles": [
    {
      "author": "Steve Karnowski, Mark Vancleave",
      "description": "Authorities and a hospital say at least five children have been injured in a shooting during the first week of classes at a Minneapolis Catholic school. Minnesota Gov. Tim Walz called the violence “horrific.” The Minneapolis city government said the shooter had been “contained” after the gunfire Wednesday at Annunciation Catholic School. The city says there is no “active threat” to residents. Children’s Minnesota says five children have been admitted for care. Hennepin Healthcare says it also is caring for patients from the shooting. The pre-kindergarten through eighth grade school had an all-school Mass scheduled at 8:15 a.m. Wednesday morning. Monday was the first day of school.",
      "publishedAt": "2025-08-27T14:24:30Z",
      "title": "At least five children injured in Minneapolis Catholic school shooting; governor calls it horrific",
      "url": "https://apnews.com/article/minneapolis-school-shooting-annunciation-0fb27d2c911fe63a9f04791b444f298f",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe38071/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2Fcb%2F956576d79670042cf6756cf641e4%2F5b91b300cbc94d1188c93418672bb1c0"
    },
    {
      "author": "R.J. Rico",
      "description": "A shooter has opened fire during Mass at a Minneapolis Catholic school, killing two children and injuring 17 other people before killing himself. The victims include two children, aged 8 and 10, who were fatally shot while in the church pews. Seventeen others, including 14 children, were injured. Authorities say a man in his early 20s fired dozens of rounds through the church windows before killing himself in the parking lot. Officials did not say whether he had any known connection to the school. The White House has been briefed on the situation, and the FBI is investigating.",
      "publishedAt": "2025-08-27T17:04:52Z",
      "title": "What to know about the shooting at Minnesota's Annunciation Catholic School",
      "url": "https://apnews.com/article/minneapolis-catholic-school-shooting-annunciation-church-271e65d699d38e01e83a6502c18df155",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe38071/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2Fcb%2F956576d79670042cf6756cf641e4%2F5b91b300cbc94d1188c93418672bb1c0"
    },
    {
      "author": "Mike Stobbe",
      "description": "The director of the nation’s top public health agency is out after less than one month in the job. The U.S. Department of Health and Human Services said Wednesday that Susan Monarez is no longer director of the Centers for Disease Control and Prevention. HHS officials did not explain why Monarez is no longer with the agency. Monarez was the agency’s 21st director and the first to pass through Senate confirmation following a 2023 law. She was sworn in on July 31 — less than a month ago, making her the shortest-serving CDC director in the history of the 79-year-old agency.",
      "publishedAt": "2025-08-27T21:55:16Z",
      "title": "CDC director Susan Monarez is out after less than a month on the job",
      "url": "https://apnews.com/article/cdc-director-susan-monarez-50dfbec849b53b4593755d2e6e616687",
      "urlToImage": "https://dims.apnews.com/dims4/default/a8caf90/2147483647/strip/true/crop/5555x3125+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F10%2F5a74333a088737853fa79af908db%2F8c35197332654dcda7abc626ef75a080"
    },
    {
      "author": "Kate Payne, Mike Schneider",
      "description": "A top Florida official says the controversial state-run immigration detention facility in the Everglades will likely be empty in a matter of days, even as Republican Gov. Ron DeSantis’ administration fights a federal judge’s order to shutter the facility dubbed “Alligator Alcatraz” by a late October deadline. That’s according to an email exchange shared with The Associated Press. In a message sent to a South Florida rabbi on Aug. 22 in regard to providing chaplaincy services at the facility, Florida Division of Emergency Management Executive Director Kevin Guthrie said “we are probably going to be down to 0 individuals within a few days.”",
      "publishedAt": "2025-08-27T16:43:01Z",
      "title": "Top Florida official: Florida's 'Alligator Alcatraz' Detention Center to be empty within days",
      "url": "https://apnews.com/article/florida-immigration-detention-center-desantis-alligator-alcatraz-f36fd04c18635eb7938a9ec26a31e92e",
      "urlToImage": "https://dims.apnews.com/dims4/default/57794da/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2F5f%2F42cc623733dc8ee6aceca81bb33f%2F6d1fbf88ef484a8397b38eaa8bd005de"
    },
    {
      "author": "Darlene Superville",
      "description": "President Donald Trump’s administration is taking control of Washington's Union Station from Amtrak, marking another federal intervention in the nation's capital. Transportation Secretary Sean Duffy announced the move Wednesday during the launch of the NextGen Acela high-speed train. Duffy says Union Station has \"fallen into disrepair\" when it should be a \"point of pride\" for the city, where Trump's Republican administration has increased federal law enforcement and immigration agents. Duffy echoes Trump's call for $2 billion from Congress to beautify Washington as part of his crackdown on the city. National Guard troops have been patrolling Union Station, which is walking distance from the U.S. Capitol. Duffy says Trump wants Union Station to be beautiful again.",
      "publishedAt": "2025-08-27T13:12:56Z",
      "title": "Trump takes management of Washington's Union Station away from Amtrak",
      "url": "https://apnews.com/article/trump-duffy-union-station-amtrak-management-8c1f5d00ab7591f3f021cf4a9ee8d8e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba785a0/2147483647/strip/true/crop/5486x3086+0+307/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F6f%2F044c53734a3b877e25265e2c17eb%2Fa0c7ebe2ad0d4f7db9f7ae463bcbfb9d"
    },
    {
      "author": "Wafaa Shurafa, Sam Metz, Sally Abou Aljoud",
      "description": "Israeli and American officials are preparing to meet in Washington to discuss postwar Gaza. Their meeting on Wednesday comes as ceasefire talks show little apparent movement and outrage mounts over a deadly Israeli strikes on a southern Gaza hospital that killed 20, including journalists and emergency responders. Despite the postwar talk, there are few signs that it's nearing an end. Israel’s military said Wednesday it was continuing to prepare Gaza City residents, many already displaced, for an impending evacuation. Talks about the strip's future are unfolding as aid groups warn an expanded Israeli offensive could worsen the territory's humanitarian crisis.",
      "publishedAt": "2025-08-27T10:46:15Z",
      "title": "Israel's military calls Gaza City evacuation ‘inevitable’ as Washington hosts talks on post-war Gaza",
      "url": "https://apnews.com/article/gaza-mideast-war-israel-trump-bbf916e1576b93d964c8d94fb7c46512",
      "urlToImage": "https://dims.apnews.com/dims4/default/33689f2/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2Fbd%2F950c411554713ee3ab5585a789f3%2F57a78b0d5a7b460383ebabb01477140a"
    },
    {
      "author": "Matthew Perrone",
      "description": "The Food and Drug Administration has approved updated COVID-19 vaccines for the upcoming fall and winter season. But it could be weeks before many Americans know whether they’ll be able to get one, under new restrictions from the Trump administration. The new shots from Pfizer, Moderna and Novavax target newer version of the coronavirus. They are approved for all seniors but only for younger adults and children with at least one underlying health problem, like obesity. Additionally, officials revoked use of Pfizer's vaccine in young children.",
      "publishedAt": "2025-08-27T16:56:54Z",
      "title": "FDA approves updated COVID-19 shots but with some limits",
      "url": "https://apnews.com/article/vaccines-covid-shots-fda-kennedy-pfizer-children-9ce19908ae7afb354732aa162fd28532",
      "urlToImage": "https://dims.apnews.com/dims4/default/470e794/2147483647/strip/true/crop/1195x672+0+62/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2F1f%2Fb60848ba77c8db4c9f1b4e16645a%2F02b5707d00454085b435f30afc9c48b1"
    },
    {
      "author": "Michael Kunzelman, Ben Finley",
      "description": "Lawyers for Kilmar Abrego Garcia, who has become the face of President Donald Trump’s hardline immigration agenda, say he wants to seek asylum in the United States. His lawyers told that to a federal judge Wednesday. The 30-year-old Salvadoran national was detained Monday in Baltimore by U.S. Customs and Immigration Enforcement after leaving a Tennessee jail on Friday. Administration officials have said he’s part of the dangerous MS-13 gang, an allegation Abrego Garcia denies. His lawyers are fighting the deportation efforts in court, arguing he has the right to express fear of persecution and torture in Uganda.",
      "publishedAt": "2025-08-27T13:29:19Z",
      "title": "Kilmar Abrego Garcia seeks asylum in the US after arrested again by ICE",
      "url": "https://apnews.com/article/kilmar-abrego-garcia-deportation-asylum-62f3d781878a3787ae27d6ea42662dc0",
      "urlToImage": "https://dims.apnews.com/dims4/default/a1ffb9e/2147483647/strip/true/crop/4115x2315+0+214/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F58%2F41%2F248ee4bdea87b88cfcbed99aefb1%2F4733266c8d394280885a7a74daca1eef"
    },
    {
      "author": null,
      "description": "Denmark's foreign minister has summoned the top U.S. diplomat in the country after reports of covert influence operations in Greenland linked to people connected to Donald Trump. Both Denmark and Greenland, a semi-autonomous Danish territory, says the territory is not for sale, despite Trump's interest. Danish broadcaster DR reported Wednesday that at least three Americans have been involved in these operations. They allegedly compiled lists of U.S.-friendly Greenlanders and tried to influence local politics. The Danish Security and Intelligence Service believes Greenland is a target for influence campaigns. It said it is strengthening its efforts and presence in Greenland in cooperation with authorities there.",
      "publishedAt": "2025-08-27T08:05:10Z",
      "title": "Denmark summons US envoy after report of Americans carrying out influence operations in Greenland",
      "url": "https://apnews.com/article/denmark-greenland-us-trump-6c9544314792cf1e287e21af06111c1e",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f64d87/2147483647/strip/true/crop/5279x2969+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fca%2Fb8%2Fdfe1f79998e8e30147ad27aa86e9%2Ff844712edff546bdaa22716cce654f08"
    },
    {
      "author": "Joe Reedy",
      "description": "The NFL is easing some restrictions on Tom Brady as he prepares for his second season as Fox Sports' top analyst. Brady can now participate in production meetings with teams, but only virtually. He still can't watch practices or visit training complexes. These rules are due to his 5% ownership stake in the Las Vegas Raiders. Brady attended virtual meetings with the Kansas City Chiefs and Philadelphia Eagles before Super Bowl 59. He said not attending meetings didn't affect his research. Fox's top crew, including Brady, will call the NFC East matchup between the New York Giants and Washington Commanders on Sept. 7.",
      "publishedAt": "2025-08-27T19:44:55Z",
      "title": "NFL eases restrictions on Tom Brady's role as Fox Sports analyst",
      "url": "https://apnews.com/article/brady-fox-nfl-8928b99c26d93e5f183b0f34a893fead",
      "urlToImage": "https://dims.apnews.com/dims4/default/2734871/2147483647/strip/true/crop/5215x2933+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2F1d%2Fe0db37109f3dfdb6b9e29d977f95%2Fbe101f611a024ede97d74196a4e38a47"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}