{
  "articles": [
    {
      "author": null,
      "description": "Japan’s meteorological agency says that a powerful earthquake has hit near Russia’s Kamchatka Peninsula and issued a tsunami advisory for Japan. The agency said the quake registered a preliminary magnitude of 8.0 when it hit early on Wednesday. It issued an advisory for a tsunami of up to 1 meter (yard) along the Pacific coast of Japan. The quake was about 250 kilometers (160 miles) away from Hokkaido and was felt only slightly. That's according to Japan’s NHK television. So far no damage has been reported. A tsunami watch, which is a relatively low-level warning, has been issued for Hawaii.",
      "publishedAt": "2025-07-29T23:59:58Z",
      "title": "Japan says powerful quake has hit near Russia’s Kamchatka Peninsula, issues a tsunami advisory",
      "url": "https://apnews.com/article/japan-russia-kamchatka-earthquake-tsunami-warning-a88cbe8a1e985cff54dc0ad849ea5ddb",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "A powerful earthquake that struck off the coast of Russia has generated tsunami warnings and advisories for a broad section of the Pacific, including Alaska, Hawaii and the U.S. West Coast. The U.S. Geological Survey says the quake registered a magnitude of 8.8 and was centered off the coast of Kamchatka peninsula. If you get a tsunami warning, move to higher ground if you are in a tsunami hazard zone. Some communities have buildings designated as meetup points during tsunami warnings, such as a school. Others might simply urge residents to retreat up a hillside.",
      "publishedAt": "2025-07-30T03:40:35Z",
      "title": "What to know about tsunami warnings and advisories",
      "url": "https://apnews.com/article/pacific-tsunami-warning-evacuation-4bf4cda5efc9dcc7bfdff736abf0f3af",
      "urlToImage": "https://dims.apnews.com/dims4/default/4c9e2d2/2147483647/strip/true/crop/2685x1510+0+140/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Feb%2Ffa8ebc0a1b6340e947d0414d7a36%2Fcd07a06fb6914e5481e7cf57c9895e05"
    },
    {
      "author": null,
      "description": "New York City Mayor Eric Adams says that a gunman who killed four people at a Manhattan office building was trying to target the headquarters of the National Football League but took the wrong elevator. Investigators believe Shane Tamura was trying to get to the NFL offices after shooting several people in the building’s lobby but accidentally entered the wrong set of elevator banks, Adams said in interviews on Tuesday. Four people, including an off-duty New York City police officer, were killed. Police said Tamura had a history of mental illness, and a rambling note found on his body suggested he had a grievance against the NFL over an unsubstantiated claim that he suffered from chronic traumatic encephalopathy.",
      "publishedAt": "2025-07-29T12:03:59Z",
      "title": "Mayor says gunman was targeting NFL headquarters",
      "url": "https://apnews.com/article/manhattan-office-shooting-nfl-nyc-d32bec88dfe208af1a413cec02034a14",
      "urlToImage": "https://dims.apnews.com/dims4/default/2f74fd7/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fd8%2F03c95569b23a779fd0dc5317846c%2Fa6d9a72b23d742b6a0431189d2528ed4"
    },
    {
      "author": null,
      "description": "The man who killed four people in the New York City skyscraper that is home to NFL headquarters carried a note blaming the league for the cognitive problems he developed as a high school football player. Shane Tamura said in the three-page note found in his wallet that he had chronic traumatic encephalopathy, a degenerative brain disease that can’t be diagnosed until death, and implored those who found him to study his brain. CTE has been linked to concussions in contact sports. The disease has been diagnosed in more than 100 former NFL players and arisen as an existential threat to the United States’ most powerful pro sports league.",
      "publishedAt": "2025-07-29T22:29:27Z",
      "title": "What to know about the brain disease the NYC shooter blamed for his mental health issues",
      "url": "https://apnews.com/article/cte-nfl-shooting-new-york-brain-disease-b7185134d79d56823a5a30af66f6aa79",
      "urlToImage": "https://dims.apnews.com/dims4/default/c8daf5d/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2Faa%2F3c466644da088125314e9c43a712%2F0ac75573481945e68a2d8a5ca32e4a24"
    },
    {
      "author": null,
      "description": "An off-duty New York City police officer and an executive at an investment firm were among four people killed by a gunman at a Manhattan office tower. The officer, Didarul Islam, was working a corporate security detail at the midtown skyscraper that is home to the headquarters of both the NFL and Blackstone, one of the world’s largest investment firms. Blackstone has confirmed senior managing director Wesley LePatner was fatally shot. NFL Commissioner Roger Goodell said a worker at the league's office was seriously wounded. A labor union identified a security officer killed in the shooting as Aland Etienne. Authorities haven’t identified the other person killed in the attack.",
      "publishedAt": "2025-07-29T16:16:38Z",
      "title": "A police officer and investment firm executive are among New York City shooting victims",
      "url": "https://apnews.com/article/victims-office-shooting-new-york-nfl-2869b5bb31e6480dc2c20175d270ad88",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a7d2d1/2147483647/strip/true/crop/8439x4747+0+440/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F11%2Fa603361617cafadf8ed20928b33a%2Fabaf280eae9342eba2e2f02a86f82ed4"
    },
    {
      "author": null,
      "description": "Ghislaine Maxwell is open to answering questions from Congress if granted immunity from future prosecution, her lawyers say. Maxwell, serving a 20-year sentence for conspiring with Jeffrey Epstein to abuse underage girls, has requested questions in advance and wants any interview scheduled after her Supreme Court petition is resolved. The House Oversight Committee, however, has stated it will not consider offering her immunity. Maxwell's lawyers have also urged the Supreme Court to review her conviction, claiming she did not receive a fair trial. They suggest she might testify openly if pardoned by former President Trump.",
      "publishedAt": "2025-07-29T18:20:15Z",
      "title": "Ghislaine Maxwell seeks immunity for Congress testimony on Jeffrey Epstein",
      "url": "https://apnews.com/article/jeffrey-epstein-congress-ghislaine-maxwell-justice-department-3ca45e130deb5f2eee8deff36d99734f",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "The leading international authority on food crises says the “worst-case scenario of famine is currently playing out in Gaza\" and it predicts “widespread death” without immediate action. Yet this authority — the Integrated Food Security Phase Classification, or IPC — stopped short Tuesday of formally declaring a famine. Even though Israel eased a 2 1/2-month blockade on the territory in May, aid groups say only a trickle of assistance is getting into the enclave and that Palestinians face catastrophic levels of hunger. Still, the IPC has not yet obtained data that would meet its threshold for declaring a famine in Gaza.",
      "publishedAt": "2025-07-29T18:16:05Z",
      "title": "Why there hasn't been a formal declaration of famine in Gaza",
      "url": "https://apnews.com/article/gaza-famine-ipc-hunger-ce9053afd13df29c8579d01e1b488871",
      "urlToImage": "https://dims.apnews.com/dims4/default/c336927/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2Fb0%2Fa1d7fd6dcfc3687705c161e993b5%2F9b4dd59348664b898e7c30facd75bfb9"
    },
    {
      "author": null,
      "description": "Over 60,000 Palestinians have been killed in the 21-month Israel-Hamas war, according to Gaza’s Health Ministry. The ministry's statement on Tuesday did not say how many were civilians or militants, but has said women and children make up around half the dead. The ministry, part of the Hamas-run government, said the latest death toll had risen to 60,034, with 145,870 people wounded since Hamas’ Oct. 7, 2023, attack. Israel’s offensive has destroyed vast areas of Gaza, displaced around 90% of the population and caused to a catastrophic humanitarian crisis, with experts warning of famine.",
      "publishedAt": "2025-07-29T10:10:16Z",
      "title": "Over 60,000 Palestinians have died in the 21-month Israel-Hamas war, Gaza’s Health Ministry says",
      "url": "https://apnews.com/article/palestinians-death-toll-war-health-ministry-816d592952814db869924f9626ca8876",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5e8829/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F3c%2F6970bdf41dba05f97eeb92d77a84%2F48efc724951e43cda13ced6bbc5b9de8"
    },
    {
      "author": null,
      "description": "The Senate has confirmed former Trump lawyer Emil Bove for a lifetime appointment as a federal appeals court judge. The 50-49 vote comes despite Democratic attempts to stop the nomination and whistleblower complaints against Bove. The most recent whistleblower to share evidence with Congress has not come forward publicly but recently provided an audio recording of Bove that contradicts some of his testimony at his confirmation hearing last month, according to two people familiar with the recording. The people requested anonymity because the whistleblower has not made the recording public.",
      "publishedAt": "2025-07-29T20:39:05Z",
      "title": "Senate confirms Trump lawyer Emil Bove for appeals court amid whistleblower claims",
      "url": "https://apnews.com/article/emil-bove-confirmation-whistleblowers-trump-republicans-democrats-71f92822cb2e8d57387748c2451fa724",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ae6737/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F69%2Fd772a36aed7016c3cfe0e734117e%2F363553b7d1ee4314bb25323c6a0fead2"
    },
    {
      "author": null,
      "description": "Sean \"Diddy\" Combs is asking a judge to release him on a $50 million bond while he awaits sentencing in October. Combs was acquitted of the most serious federal charges he faced, but convicted of lesser prostitution-related offenses. His lawyer, Marc Agnifilo, argued on Tuesday that conditions at the Metropolitan Detention Center in Brooklyn are dangerous. Agnifilo noted that others convicted of similar offenses were typically released before sentencing. In July, Combs was denied bail after being acquitted of sex trafficking and racketeering charges. Judge Arun Subramanian said Combs hasn't shown he is not a danger to the community.",
      "publishedAt": "2025-07-29T21:14:45Z",
      "title": "Sean 'Diddy' Combs seeks $50M bond before October sentencing",
      "url": "https://apnews.com/article/sean-diddy-combs-sentencing-bond-603faeb7b26a3290e10b83dd28dadab3",
      "urlToImage": "https://dims.apnews.com/dims4/default/87e076c/2147483647/strip/true/crop/4032x2268+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F6a%2F146b14d6374b1e3f8b9f8617798d%2F89b0f0471e064ee081bb254c5a0aa1d2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}