{
  "articles": [
    {
      "author": "MEAD GRUVER and KENDRIA LaFLEUR",
      "description": "FORT COLLINS, Colo. (AP) — They creep, slither and slide over and around each other by the dozen and now there's a webcam so that anybody can watch them online at any time, even at night.A “mega den” with as many as 2,000 rattlesnakes isn't top binge-watching for many people.",
      "publishedAt": "2024-07-16T21:33:04Z",
      "title": "Webcam monitors hundreds of rattlesnakes at a Colorado 'mega den' for citizen science",
      "url": "https://apnews.com/46897f0a8e13d92cb54c26f93ab977a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6992dea362c54cbc99a166e20db1b77b/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE, ADRIANA GOMEZ LICON, ALI SWENSON and CHRISTINE FERNANDO",
      "description": "MILWAUKEE (AP) — Immigration took center stage as the Republican National Convention resumed Tuesday, with speakers spotlighting a key element of former President Donald Trump ’s political brand that helped endear him to the GOP base when he began his first campaign in 2015.",
      "publishedAt": "2024-07-16T04:04:51Z",
      "title": "Republican Convention turns to immigration and the border, central issues for Trump's campaign",
      "url": "https://apnews.com/d832fedbbd0df0a4fa68f941474c0209",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5f730c3feb54e11b4afd60dc935b6b8/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG, AAMER MADHANI and JILL COLVIN",
      "description": "WASHINGTON (AP) — A threat on Donald Trump’s life from Iran prompted additional security in the days before Saturday’s campaign rally, but it was unrelated to the assassination attempt on the Republican presidential nominee, two U.S.",
      "publishedAt": "2024-07-16T18:59:45Z",
      "title": "Iran threat prompted more security at Trump rally as officials warn of potential for copycat attacks",
      "url": "https://apnews.com/87f9a1e6e74c2ac18636334e9b2e03a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/224594c93c3e4832a00fd1868c15b39f/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER and PHILIP MARCELO",
      "description": "NEW YORK (AP) — U.S. Sen. Bob Menendez was convicted of all charges Tuesday in a sweeping corruption trial in which he was accused of accepting bribes of gold and cash from three New Jersey businessmen and acting as an agent for the Egyptian government.",
      "publishedAt": "2024-07-16T05:10:28Z",
      "title": "Sen. Bob Menendez guilty of taking bribes in cash and gold and acting as Egypt's foreign agent",
      "url": "https://apnews.com/bab89b99a77fc6ce95531c88ab26cc4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9bd6cc77da3a4f348c70602e2107a2dd/1920.jpeg"
    },
    {
      "author": "MELISSA PEREZ WINDER, ED WHITE and JIM SALTER",
      "description": "CHICAGO (AP) — Hundreds of people in a southern Illinois town were ordered to evacuate Tuesday as water rolled over the top of a dam, just one perilous result of severe weather that raged through the Midwest overnight with relentless rain and tornadoes and hit the Chicago area especially hard.",
      "publishedAt": "2024-07-16T00:30:51Z",
      "title": "A dam fails after rain, wind, tornadoes pound the Midwest. The Chicago area is cleaning up",
      "url": "https://apnews.com/949aa0d324988c7920e2c16b2f7a2f60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e464603ff1aa4b4e9144ac1f973b3085/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and ZEKE MILLER",
      "description": "LAS VEGAS (AP) — President Joe Biden returned to the campaign trail Tuesday for the first time since the attempted assassination of former President Donald Trump, continuing his call to calm the divisive rhetoric on both sides, but also arguing that doing so \"doesn’t mean we should stop telling the truth” as he tore into his Republican rival.",
      "publishedAt": "2024-07-16T09:03:10Z",
      "title": "Biden says cooling political rhetoric doesn't mean he'll 'stop telling the truth' about Trump",
      "url": "https://apnews.com/3f9386fae612adbb7630bad3c62b683d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b5130278c1b40a787dae08cc64dc659/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES, THOMAS BEAUMONT and FARNOUSH AMIRI",
      "description": "MILWAUKEE (AP) — JD Vance is supposed to help Donald Trump win the Midwest this fall.",
      "publishedAt": "2024-07-16T04:12:45Z",
      "title": "JD Vance is a relative political unknown. He's been asked to help Donald Trump avenge his 2020 loss",
      "url": "https://apnews.com/5b698796a382d313155476b1ee3b7e8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c76e9ceb32554f04a349372d62a309be/2526.jpeg"
    },
    {
      "author": "JOHN HANNA, CAROLYN THOMPSON, GEOFF MULVIHILL and JEFFREY COLLINS",
      "description": "BUFFALO, N.Y. (AP) — Long before a would-be assassin shot and wounded former President Donald Trump, the fuse of political violence had been burning across America.",
      "publishedAt": "2024-07-16T18:34:50Z",
      "title": "Violence plagued all levels of American politics long before the attempt on Trump's life",
      "url": "https://apnews.com/3cbc5575e2b4c53a231e8abd9b786d22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3367e0e8bccd49f0b789075c006f64e4/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — The Israeli military on Tuesday said it would begin sending draft notices to Jewish ultra-Orthodox men next week — a step that could destabilize Prime Minister Benjamin Netanyahu's government.",
      "publishedAt": "2024-07-16T14:40:02Z",
      "title": "Israeli military says it will begin drafting ultra-Orthodox men. That could rattle the government",
      "url": "https://apnews.com/c35b3a025da8cdd9b61f1c748a209419",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3cbe1d06bc8f4e2a9717f555c65719de/3000.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI and NAPAT KONGSAWAD",
      "description": "BANGKOK (AP) — The bodies of six people were found Tuesday in a luxury hotel in downtown Bangkok and their deaths may have been caused by poisoning, police and officials said. Bangkok police chief Lt.",
      "publishedAt": "2024-07-16T14:13:35Z",
      "title": "Six people are found dead in a hotel in downtown Bangkok, with poisoning a possibility",
      "url": "https://apnews.com/fef64b28304c8dcb201bd40c8dd09862",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/102117795d694bcdaf60bc88f65e4030/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}