{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Donald Trump tried to illegally influence the 2016 presidential election by preventing damaging stories about his personal life from becoming public, a prosecutor told jurors Monday at the start of the former president's historic hush money trial.",
      "publishedAt": "2024-04-22T04:03:21Z",
      "title": "Trump tried to 'corrupt' the 2016 election, prosecutor alleges as hush money trial gets underway",
      "url": "https://apnews.com/6beee9b99114898ee0dd60185d43bac5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be56de5e0e27427c9282034a2a162df7/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — In opening statements in Donald Trump's historic hush money trial, prosecutors said Monday that the former president “orchestrated a criminal scheme to corrupt” the 2016 presidential election.",
      "publishedAt": "2024-04-22T10:17:13Z",
      "title": "The Latest | Lawyers in Trump hush money case paint competing portraits of him in opening statements",
      "url": "https://apnews.com/0b824550156f8f321a7754a712a8111a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be56de5e0e27427c9282034a2a162df7/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — The head of Israeli military intelligence said Monday he would resign because of Hamas' Oct.",
      "publishedAt": "2024-04-22T07:20:32Z",
      "title": "Israel's military intelligence chief resigns over failure to prevent Hamas attack on Oct. 7",
      "url": "https://apnews.com/85da1c989f71f8c3bf00d8b45a0ed7f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ed2034b24fda4e778c2d8be1046ee261/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — An independent review of the neutrality of the U.N. agency helping Palestinian refugees found that Israel never expressed concern about anyone on the staff lists it has received annually since 2011.",
      "publishedAt": "2024-04-22T16:38:38Z",
      "title": "Review of UN agency helping Palestinian refugees found Israel did not express concern about staff",
      "url": "https://apnews.com/28a63ddef23efdc4b050b0bcbdb587ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/56779cefd97e4b389f9578acc02226ec/3000.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY",
      "description": "TRAVERSE CITY, Mich. (AP) — The group gathered inside the conference room, mostly women, fell silent as the audio recording began to play.The male voice, clearly agitated, railed against what he thought had been fraud that cost former President Donald Trump reelection four years ago.",
      "publishedAt": "2024-04-22T04:08:33Z",
      "title": "Local election workers fear threats to their safety as November nears. One group is trying to help",
      "url": "https://apnews.com/d2702ae1e1e57c766c3df36f1a7ff763",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b8e3e8896c8442c8ec433fcf551dab1/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukrainian commander Oleksiy Tarasenko witnessed a frightening shift last month in Russia's efforts to punch through Kyiv’s defense of the industrial region known as the Donbas.",
      "publishedAt": "2024-04-22T04:16:14Z",
      "title": "Aid approval brings Ukraine closer to replenishing troops struggling to hold front lines",
      "url": "https://apnews.com/5b2cfac8351bff94d8c1ead8704110a3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db59f4a23ef34c079c04049bd1b3888f/3000.jpeg"
    },
    {
      "author": "DAKE KANG and MARIA CHENG",
      "description": "BEIJING (AP) — The hunt for the origins of COVID-19 has gone dark in China, the victim of political infighting after a series of stalled and thwarted attempts to find the source of the virus that killed millions and paralyzed the world for months.",
      "publishedAt": "2024-04-22T06:37:04Z",
      "title": "Toxic: How the search for the origins of COVID-19 turned politically poisonous",
      "url": "https://apnews.com/bed5ab50dca8e318ab00f60b5911da0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99710b3e84464fdc825bf43672dab149/3000.jpeg"
    },
    {
      "author": "ALEXA ST. JOHN and WILL WEISSERT",
      "description": "WASHINGTON (AP) — President Joe Biden is marking Earth Day by announcing $7 billion in federal grants for residential solar projects serving 900,000-plus households in low- and middle-income communities.",
      "publishedAt": "2024-04-22T09:05:42Z",
      "title": "Biden is marking Earth Day by announcing $7 billion in federal solar power grants",
      "url": "https://apnews.com/5bece7e419e9141241287575abb0fefc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d09baa27e0cb46608cd9d8ff25d688ea/3000.jpeg"
    },
    {
      "author": "MARÍA TERESA HERNÁNDEZ",
      "description": "MEXICO CITY (AP) — By mid-2024, Claudia Sheinbaum will most likely become Mexico’s first female president. She would also be its first leader with a Jewish background in a country that’s home to nearly 100 million Catholics.",
      "publishedAt": "2024-04-22T12:09:57Z",
      "title": "Mexico's likely next president has a Jewish origin. Is that relevant in a deeply Catholic country?",
      "url": "https://apnews.com/5932fcf5d74c215ae0e08a40eff8a64f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1df4c7dd27944e5863e2dc33604635e/2943.jpeg"
    },
    {
      "author": "KEN RITTER",
      "description": "LAS VEGAS (AP) — A $12 billion high-speed passenger rail line between Las Vegas and the Los Angeles area has started construction, officials said Monday, amid predictions that millions of ticket-buyers will be boarding trains by 2028.",
      "publishedAt": "2024-04-22T04:19:19Z",
      "title": "Work starts on bullet train rail line from Sin City to the City of Angels",
      "url": "https://apnews.com/595913ff2fa3d9001fb89bfab4e6c4d2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22c8b27915094c4080271cb9d6ca76af/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}