{
  "articles": [
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — A strong earthquake shook a high-altitude region of western China and areas of Nepal on Tuesday, damaging hundreds of houses, littering streets with rubble and killing at least 95 people in Tibet.",
      "publishedAt": "2025-01-07T01:51:33Z",
      "title": "Strong earthquake kills at least 95 people in western China near Mount Everest",
      "url": "https://apnews.com/ca21bd4848209370b9eebcaf107208df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc68b2b6311a4a1da10916316de6f9ab/1507.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The Israeli military launched a wave of raids across the occupied West Bank overnight and into Tuesday, killing at least three Palestinians it said were militants a day after a deadly shooting attack.",
      "publishedAt": "2025-01-07T09:51:15Z",
      "title": "Middle East latest: Israel's military launches wave of raids across the occupied West Bank",
      "url": "https://apnews.com/c7b3e72f9f11513fd80f3f9e3ec74f87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6aa9b9ff173b451dab65a1cdc573617b/3000.jpeg"
    },
    {
      "author": "SARAH EL DEEB and MALAK HARB",
      "description": "DAMASCUS, Syria (AP) — Handcuffed and squatting on the floor, Abdullah Zahra saw smoke rising from his cellmate’s flesh as his torturers gave him electric shocks. Then it was Zahra’s turn. They hanged the 20-year-old university student from his wrists until his toes barely touched the floor and electrocuted and beat him for two hours.",
      "publishedAt": "2025-01-07T05:11:58Z",
      "title": "Long silenced by fear, Syrians now speak about rampant torture under Assad",
      "url": "https://apnews.com/ad4c676858c8016ea5fd4f7a4946353e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9ed809525594000b057cc033e7ef257/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE and BRIAN WITTE",
      "description": "ANNAPOLIS, Md. (AP) — The next round of bitter cold was set to envelop the southern U.S. on Tuesday, after the first significant winter storm of the year blasted a huge swath of the country with ice, snow and wind.",
      "publishedAt": "2025-01-07T06:05:02Z",
      "title": "The next round of bitter cold and snow will hit the southern US",
      "url": "https://apnews.com/3d4a3826d070d9e84d69bbf2800198a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fea10de29e214a11961691611ad0132a/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Some lawmakers emotionally recalled the violence. Others said they’d rather move on.",
      "publishedAt": "2025-01-06T23:12:43Z",
      "title": "On Jan. 6, lawmakers remember the carnage of 2021 in sharply different ways",
      "url": "https://apnews.com/4872a3503f5fb820ba0da6095d35cc77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53cbb51406c2486fa1c98bf771abe9c4/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW ORLEANS (AP) — Louisiana Attorney General Liz Murrill ordered on Monday an investigation into safety and security deficiencies in New Orleans, where an Army veteran sped around a police blockade and raced down Bourbon Street, killing 14 New Year's revelers.",
      "publishedAt": "2025-01-06T23:13:23Z",
      "title": "Louisiana AG orders security investigation as Biden directs resources to help New Orleans",
      "url": "https://apnews.com/5dd0509ce0cfff1756a255c4c1cd631c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8e7de918518442f88176b9e1f4b86544/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — Canadian Prime Minister Justin Trudeau announced his resignation after facing an increasing loss of support both within his party and in the country.",
      "publishedAt": "2025-01-07T05:08:25Z",
      "title": "Canada's Liberals look for a new prime minister as Trump threatens tariffs and an election looms",
      "url": "https://apnews.com/84ff95a506d0c58226f0653447d8809b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a73ba79c675471cbcdf903dbd667061/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — President-elect Donald Trump remains on track to be sentenced this week in his hush money case after a judge on Monday denied his request to halt proceedings while he appeals a ruling that upheld the historic verdict.",
      "publishedAt": "2025-01-06T14:34:59Z",
      "title": "Trump's sentencing still on for Friday after judge rebuffs his push for a delay while he appeals",
      "url": "https://apnews.com/e20933f9418bd378925e5f9e75f28485",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48a0df45299f4adab56c57db8a3141fb/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — North Korea said Tuesday its latest weapons test was a new hypersonic intermediate-range missile designed to strike remote targets in the Pacific as leader Kim Jong Un vowed to further expand his collection of nuclear-capable weapons to counter rival nations.",
      "publishedAt": "2025-01-07T00:57:41Z",
      "title": "North Korea says it tested hypersonic intermediate range missile aimed at remote Pacific targets",
      "url": "https://apnews.com/2190733a5bdb63fa68b32d2620c924a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffff1c0dfbb24976884f098fee27e5e5/1920.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Nippon Steel was standing firm on its proposed $15 billion acquisition of U.S. Steel, Chief Executive Eiji Hashimoto said Tuesday after President Joe Biden’s blocked the top Japanese steelmaker’s move.",
      "publishedAt": "2025-01-07T01:07:32Z",
      "title": "Nippon Steel stands firm on a US Steel takeover and denies risks cited by Biden",
      "url": "https://apnews.com/3dbaea0e12f80ab9f42d5472e7e4ab1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab719d32246e404eabd093a4f4ec6b12/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}