{
  "articles": [
    {
      "author": null,
      "description": "YELLOWKNIFE, Northwest Territories (AP) — Residents of the capital of Canada's Northwest Territories fled an approaching wildfire Thursday, some driving hundreds of miles to safety and others signing up for emergency flights, the latest chapter in Canada's worst fire season on record.",
      "publishedAt": "2023-08-17T03:51:55Z",
      "title": "Residents flee, airlifts begin as wildfire approaches capital of Canada's Northwest Territories",
      "url": "https://apnews.com/ca509a053f45f3797b93286f94d6b198",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a27fb9835884977b2e27edbc2e6a4b8/3000.jpeg"
    },
    {
      "author": "JAMES POLLARD AND THALIA BEATY",
      "description": "After learning that 100 pounds of insulin was stuck, grounded last week at Kona International Airport on the big island, volunteers at Maui Brewing Company, Hawaii’s largest craft brewery, got to work.",
      "publishedAt": "2023-08-17T19:11:31Z",
      "title": "Maui residents fill philanthropic gaps while aid makes the long journey to the fire-stricken island",
      "url": "https://apnews.com/f343a8045c87e209df1b84c1443445cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46530c2168a64468b1d82a61ea1ed2cf/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and EMILY SWANSON",
      "description": "WASHINGTON (AP) — President Joe Biden has devoted the past several weeks to promoting the positive impacts of his policies — but his efforts have yet to meaningfully register with the public.Only 36% of U.S.",
      "publishedAt": "2023-08-17T04:07:01Z",
      "title": "Biden's approval rating on the economy stagnates despite slowing inflation, AP-NORC poll shows",
      "url": "https://apnews.com/c3fc17ffe3e1a9c865e2f9627ef4bea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d57dfb6eb30740b4864667330831d14c/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. military academies must improve their leadership, stop toxic practices such as hazing and shift behavior training into the classrooms, according to a Pentagon study aimed at addressing an alarming spike in sexual assaults and misconduct.",
      "publishedAt": "2023-08-17T12:01:12Z",
      "title": "Pentagon review calls for reforms to reverse spike in sexual misconduct at military academies",
      "url": "https://apnews.com/8753bdc6ba693836e787ee4dca5194d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3044a49559c2425c928c5e52364356c2/3000.jpeg"
    },
    {
      "author": "EMILY WAGSTER PETTUS",
      "description": "BROOKHAVEN, Miss. (AP) — Citing errors by police, a Mississippi judge declared a mistrial Thursday in the case of two white men accused of chasing and shooting at a Black FedEx driver who was making a delivery.",
      "publishedAt": "2023-08-17T14:39:00Z",
      "title": "Mississippi judge declares mistrial for 2 white men charged in attack on Black FedEx driver",
      "url": "https://apnews.com/ddf3f6575b285028f82b1ebcf43ed501",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a477671ab6db47c18f9cd35bf904d55e/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "KABUL, Afghanistan (AP) — Women lose value if men can see their uncovered faces in public, a spokesman for a key ministry of Afghanistan’s Taliban government said Thursday, adding that religious scholars in the country agree that a woman must keep her face covered when outside the home.",
      "publishedAt": "2023-08-17T13:58:20Z",
      "title": "Taliban official says women lose value if their faces are visible to men in public",
      "url": "https://apnews.com/52937354eb8a89f916fd2dbc1f83c0d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a65cb54d2be49d281f439fd29f903a7/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A Canadian woman was sentenced to nearly 22 years in prison in Washington Thursday in the mailing of a threatening letter containing the poison ricin to then-President Donald Trump at the White House.",
      "publishedAt": "2023-08-17T17:37:39Z",
      "title": "Canadian woman sentenced to nearly 22 years for 2020 ricin letter sent to Trump in White House",
      "url": "https://apnews.com/10666b80df1c0beaf6c48bf4c453a47a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f097621189e430bbcf4eb8084c2d764/1489.jpeg"
    },
    {
      "author": "ALEX VEIGA and MATT OTT",
      "description": "The average long-term U.S. mortgage rate climbed this week to its highest level in more than 20 years, grim news for would-be homebuyers already challenged by a housing market that remains competitive due to a dearth of homes for sale.",
      "publishedAt": "2023-08-17T16:01:22Z",
      "title": "Average long-term US mortgage rate climbs to 7.09% this week to highest level in more than 20 years",
      "url": "https://apnews.com/c0945b1a68dc8d007d580d8eb4b940fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/635393573af34937804d467af1a6a95c/2400.jpeg"
    },
    {
      "author": "JAKE COYLE",
      "description": "NEW YORK (AP) — After Bradley Cooper's prosthetic nose in the trailer for the upcoming Leonard Bernstein biopic “Maestro” stoked criticism of antisemitism, the conductor's children have come to the defense of the actor.",
      "publishedAt": "2023-08-17T16:52:00Z",
      "title": "Composer Bernstein's children defend Bradley Cooper's prosthetic nose after 'Maestro' is criticized",
      "url": "https://apnews.com/b9495ee597278a4317dfb102fed26a86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c47326ba7b544166902188d87bb1bfbf/1920.jpeg"
    },
    {
      "author": "ROB MAADDI",
      "description": "More NFL hopefuls are getting an opportunity to stick around a little longer to showcase their skills this summer.When the league eliminated the first two rounds of roster cuts in March, it allowed teams to carry 90 players throughout the preseason.",
      "publishedAt": "2023-08-17T17:44:33Z",
      "title": "Sidelines are crowded because NFL teams are carrying 90-man rosters throughout preseason",
      "url": "https://apnews.com/ad77e0349a1e240f619dd00ca83a7100",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04580e620b7f4316aa266cb9be6f0990/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}