{
  "articles": [
    {
      "author": null,
      "description": "U.S. Immigration and Customs Enforcement officials will gain access to personally identifiable information for all of the nation’s 79 million Medicaid enrollees. That's according to an agreement obtained by The Associated Press. ICE officials plan to track immigrants who may not be living legally in the United States. The agreement was signed Monday between officials at the Centers for Medicare and Medicaid Services and the Department of Homeland Security. Direct access will be given to the addresses, Social Security numbers, birth dates as well as the ethnicity and race of all Medicaid enrollees.",
      "publishedAt": "2025-07-17T16:19:47Z",
      "title": "Trump administration hands over nation's Medicaid enrollee data to ICE",
      "url": "https://apnews.com/article/immigration-medicaid-trump-ice-ab9c2267ce596089410387bfcb40eeb7",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9000fb/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Fc9%2F487a5a83c70b764651f423a1d942%2F17de1c7cd4c74c1f8d4f7b9ddb4122a8"
    },
    {
      "author": null,
      "description": "The House is expected to approve President Donald Trump’s request to claw back about $9 billion for public broadcasting and foreign aid. A final vote to approve the spending cuts package is scheduled for Thursday evening. Republicans are targeting institutions and programs they view as bloated or out of step with their agenda. The White House has described the package as a test case and says if Congress goes along, more requests will come. The House’s approval would mark the first time in decades that a president has successfully submitted such a request to Congress.",
      "publishedAt": "2025-07-17T16:58:02Z",
      "title": "House set to OK Trump's $9 billion cut to public broadcasting and foreign aid",
      "url": "https://apnews.com/article/pbs-npr-budget-cuts-trump-republicans-b0044285659ab708e23eb2dc2f3eabfa",
      "urlToImage": "https://dims.apnews.com/dims4/default/4370289/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2Fe5%2F2ab65bfc786e5ea4a992b70769a3%2F93a946a4feba42c0a10c155f5d5a981e"
    },
    {
      "author": null,
      "description": "The White House says President Donald Trump had a recent medical checkup after he noticed “mild swelling” in his legs. Press secretary Karoline Leavitt says tests by the White House medical unit showed “no evidence of deep vein thrombosis or arterial disease,” but that Trump has a condition called “chronic venous insufficiency.\" It's a fairly common condition in older adults when little valves inside the veins that normally help move blood against gravity up the legs gradually lose the ability to work properly. Leavitt also said bruising on Trump’s hand that’s been covered up by makeup is “consistent” with irritation from his “frequent handshaking and the use of aspirin.”",
      "publishedAt": "2025-07-17T18:53:06Z",
      "title": "Trump has swelling in his lower legs and a makeup-covered hand",
      "url": "https://apnews.com/article/trump-swelling-legs-chronic-venous-insufficiency-health-40beb3c818cfb914645db9d1f143fdd8",
      "urlToImage": "https://dims.apnews.com/dims4/default/db0a081/2147483647/strip/true/crop/3836x2158+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2Fdd%2Fb88ac2dd8d46e4eedfb499a33dbe%2F2b5acb4c3a374849a3d0240d73855e4f"
    },
    {
      "author": null,
      "description": "Swollen legs led to President Donald Trump being diagnosed with what’s called chronic venous insufficiency. It’s a fairly common condition among older adults but requires a thorough checkup to rule out more serious causes of swelling in the legs. It happens when veins in the legs can’t properly carry blood back to the heart, which can lead to blood pooling in the lower legs. In addition to swelling, usually around the feet and ankles, symptoms can include legs that are achy, heavy feeling or tingly, and varicose veins. Treatment can include wearing compression stockings, elevating the legs and achieving a healthy weight.",
      "publishedAt": "2025-07-17T20:20:05Z",
      "title": "Here's what to know about chronic venous insufficiency, a condition affecting Trump",
      "url": "https://apnews.com/article/chronic-venous-insufficiency-trump-c2e8884d5e5debd1a0c156cb0060928a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8f89b4/2147483647/strip/true/crop/5091x2864+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2Fbe%2F841170b2836dc3c4c906db1e6b1a%2F2e59fec73a364f9fbd6c803633d02ecb"
    },
    {
      "author": null,
      "description": "Maurene Comey, the daughter of former FBI director James Comey who as a federal prosecutor in Manhattan worked on cases against Sean “Diddy” Combs and Jeffrey Epstein, has told colleagues in a note that “fear is the tool of a tyrant” and that her firing without reason should fuel “a fire of righteous indignation at abuses of power.” In a message obtained by The Associated Press, she wrote that “if a career prosecutor can be fired without reason, fear may seep into the decisions of those who remain.\" She told colleagues that they should not let that happen.",
      "publishedAt": "2025-07-17T16:12:57Z",
      "title": "Fired federal prosecutor Maurene Comey warns against Trump's abuse of power",
      "url": "https://apnews.com/article/trump-comey-epstein-justice-department-sean-combs-6a75266874bb7723ac83a9b548b7d257",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ddd651/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F81%2Fe86d37a9fc6344b55487cca9903f%2F0d681c4b4ca74d38bbddef8af3b5f101"
    },
    {
      "author": null,
      "description": "Syrian government forces have started withdrawing from the southern province of Sweida following days of vicious clashes with militias from the Druze minority. Druze leaders and Syrian government officials announced a renewed ceasefire late Wednesday that was mediated by the U.S., Turkey and Arab countries. Syria’s interim President Ahmad al-Sharaa said in an address early Thursday that some Druze factions and clerics were appointed to maintain internal security in Sweida. Israeli strikes targeting government troops did not immediately stop. The dayslong fighting has threatened to unravel Syria’s postwar political transition and brought in further military intervention by Israel.",
      "publishedAt": "2025-07-17T09:39:31Z",
      "title": "Syrian forces leave Sweida after ceasefire with Druze militias takes effect",
      "url": "https://apnews.com/article/syria-druze-israel-clashes-sweida-ceasefire-sharaa-67fdcbd1be73c4890a4ce81bd954d447",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f76588/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F35%2Fd59227d2c244d023fe0c33049528%2F3066bdd9e3c1449782e4bace267d2399"
    },
    {
      "author": null,
      "description": "Connie Francis, the wholesome pop star of the 1950s and 1960s whose hits include “Pretty Little Baby” and who would later serve as an ironic title for a personal life filled with heartbreak and tragedy, has died at age 87. Her death was announced Thursday by her friend and publicist, Ron Roberts, who didn't immediately provide additional details. Francis was a top performer of the pre-Beatles era, rarely off the charts from 1957-64. Able to appeal to both young people and adults, she had more than a dozen top 20 hits, starting with “Who’s Sorry Now?” and including the No. 1 songs “Don’t Break the Heart That Loves You” and “The Heart Has a Mind of Its Own.”",
      "publishedAt": "2025-07-17T11:58:39Z",
      "title": "Star-crossed singer Connie Francis, whose hits included 'Pretty Little Baby' dead at 87",
      "url": "https://apnews.com/article/connie-francis-died-87-singer-pretty-little-baby-785646a658c66d61f4263eeb5b5d5d42",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Federal health officials will allow Juul to keep selling its electronic cigarettes. The Food and Drug Administration said Thursday that Juul's benefits as a less harmful alternative for adult smokers outweigh the risks of teen use. It's a major win for a company that has struggled for years after being widely blamed for sparking the teen vaping trend. Parents, politicians and antitobacco advocates wanted a ban on the devices that many blame for the recent spike in underage vaping. The FDA decision applies to both tobacco and menthol-flavored versions of the reusable product.",
      "publishedAt": "2025-07-17T16:00:17Z",
      "title": "Juul can continue selling its tobacco and menthol e-cigarettes, FDA says",
      "url": "https://apnews.com/article/juul-vaping-ecigarettes-fda-teens-ban-9561d6a26972c01613c4fd3ebbbd981e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b3b6d73/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Fc0%2Feab88059376e72e74488cc08987a%2Ffbd9431081d349039186b110be89f9a0"
    },
    {
      "author": null,
      "description": "North Carolina has declared a state of emergency after Tropical Storm Chantal caused severe flooding and at least six deaths. Gov. Josh Stein announced the declaration Thursday, citing overwhelmed local response efforts. The storm, followed by more severe weather, dumped up to 12 inches of rain in some areas, causing rivers to reach record levels. Damage to water systems left some residents without safe drinking water. The emergency declaration, effective Wednesday, allows the state to seek federal aid for recovery. Emergency crews rescued dozens of people, but several were found dead, including people killed by floodwaters.",
      "publishedAt": "2025-07-17T18:31:20Z",
      "title": "Severe weather in tropical storm's wake triggers North Carolina state of emergency",
      "url": "https://apnews.com/article/tropical-storm-chantal-north-carolina-emergency-544544e063bb9eaa2dd72d34137d5653",
      "urlToImage": "https://dims.apnews.com/dims4/default/3d0498d/2147483647/strip/true/crop/4890x2751+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2Fa3%2F412417cac428d6b77c6c6086b1b2%2F8bf509ac1c7441c297dedbac69e5b02c"
    },
    {
      "author": null,
      "description": "A man accused of sexually assaulting a Pennsylvania college student in 2013 and later sending her a Facebook message that said “So I raped you” has pleaded guilty. Thirty-two-year-old Ian Cleary faces a proposed 4- to 8-year sentence after Thursday’s plea. Cleary is an American who has been in custody since he was arrested in France last year. A lawyer for Cleary says he experienced several mental health episodes there. Shannon Keeler, the former Gettysburg University student who pursued the case for more than a decade, faced Cleary in court Thursday for the first time since the encounter.",
      "publishedAt": "2025-07-17T18:32:40Z",
      "title": "Man who sent Facebook message about committing a campus sexual assault pleads guilty",
      "url": "https://apnews.com/article/pennsylvania-campus-assault-guilty-plea-b2467188d0390525933698c5218c0634",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}