{
  "articles": [
    {
      "author": "ADAM GELLER",
      "description": "NEW YORK (AP) — The images, captured by Associated Press photographers throughout 2023 and recognized Monday with a Pulitzer Prize, spotlight the humanity of an unprecedented global migration story often overlooked in a storm of statistics and political rhetoric.",
      "publishedAt": "2024-05-06T21:22:12Z",
      "title": "Associated Press images of migrants' struggle are recognized with a Pulitzer Prize",
      "url": "https://apnews.com/23aeee7cc4a770e8a2e4be5ae1a82277",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/324f3f6bac9d474f8dda9f0093dd2085/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK, JOSEF FEDERMAN and BASSEM MROUE",
      "description": "JERUSALEM (AP) — Hamas announced its acceptance Monday of an Egyptian-Qatari cease-fire proposal, but Israel said the deal did not meet its “core demands” and that it was pushing ahead with an assault on the southern Gaza city of Rafah.",
      "publishedAt": "2024-05-06T05:29:00Z",
      "title": "Hamas accepts Gaza cease-fire; Israel says it will continue talks but is conducting strikes in Rafah",
      "url": "https://apnews.com/8659eae6e0a7362504f0aa4aa4be53e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/671909fed7484068a455d4e895dbfc10/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — The judge in Donald Trump’s hush money trial fined him $1,000 on Monday and, in his sternest warning yet, told the former president that future gag order violations could send him to jail.",
      "publishedAt": "2024-05-06T04:24:11Z",
      "title": "Trump fined $1,000 for gag order violation in hush money case as ex-employee recounts reimbursements",
      "url": "https://apnews.com/c41df6a82434247352fe7a110daae981",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/58814cc1429746c886fef430cad65a8a/3000.jpeg"
    },
    {
      "author": "KAREN MATTHEWS",
      "description": "NEW YORK (AP) — Columbia University canceled its large university-wide commencement ceremony Monday following weeks of pro-Palestinian protests that have roiled its campus and others across the U.S., but said students will still be able to celebrate at a series of smaller, school-based ceremonies this week and next.",
      "publishedAt": "2024-05-06T13:08:26Z",
      "title": "Columbia University cancels main commencement after weeks of pro-Palestinian protests",
      "url": "https://apnews.com/080a42e09d9bac2e37321874ac37a8c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd55e209af1f4f8d800696e17031aeec/1920.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — Floodwaters in the Houston area and parts of Southeast Texas began to recede on Monday, allowing residents to begin returning to their homes and assess damages after days of heavy rainfall that pummeled the area and led to hundreds of rescues — including people who were stranded on rooftops.",
      "publishedAt": "2024-05-06T04:30:11Z",
      "title": "Floodwaters start receding around Houston area as recovery begins following rescues and evacuations",
      "url": "https://apnews.com/117b0f63c9bd53be31ee34e11547da21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/444391208e894780b1eaf0efa5aed1fe/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "NEW YORK (AP) — The New York Times and The Washington Post were awarded three Pulitzer Prizes apiece on Monday for work in 2023 that dealt with everything from the war in Gaza to gun violence, and The Associated Press won in the feature photography category for coverage of global migration to the U.S.",
      "publishedAt": "2024-05-06T04:04:09Z",
      "title": "Pulitzer Prizes in journalism awarded to The New York Times, The Washington Post, AP and others",
      "url": "https://apnews.com/6e07cdcf937d49158d452f2cc0dbc214",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce839f923e414fc9a7df645f231b1319/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — For the first time, researchers have identified a genetic form of late-in-life Alzheimer’s disease — in people who inherit two copies of a worrisome gene.Scientists have long known a gene called APOE4 is one of many things that can increase people’s risk for Alzheimer's, including simply getting older.",
      "publishedAt": "2024-05-06T15:01:15Z",
      "title": "A gene long thought to just raise the risk for Alzheimer's may cause some cases",
      "url": "https://apnews.com/c1b4f0abfc708d3be0bb9c5fb70cbc77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/912cd912fe42440a86d946f26d8a5d5b/1944.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and ADRIANA GOMEZ LICON",
      "description": "NEW YORK (AP) — Donald Trump is accusing Joe Biden of offering a weak response to antisemitism, wielding the clashes on colleges campuses over the war in Gaza as a campaign issue. But Trump's attacks ignore his own long history of rhetoric that invokes the language of Nazi Germany and plays on stereotypes of Jews and politics.",
      "publishedAt": "2024-05-06T23:01:39Z",
      "title": "Donald Trump calls Joe Biden weak on antisemitism, ignoring his own rhetoric",
      "url": "https://apnews.com/55de1e89627bc9721798d469e9569e5b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70f165aeed684093998abd0ce1fb15ef/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — An American soldier has been arrested in Russia and accused of stealing, according to two U.S. officials.U.S. officials said the soldier, Staff Sgt. Gordon Black, 34, was stationed in South Korea and was in the process of returning home to Fort Cavazos in Texas.",
      "publishedAt": "2024-05-06T19:33:50Z",
      "title": "An American soldier was arrested in Russia and accused of stealing, US officials say",
      "url": "https://apnews.com/ca2842597a0af45062667f8cc552eca6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d23cf2b7398247acaba8c0902b7532d9/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "ATLANTA (AP) — Four months after The Associated Press wrote about an Atlanta family struggling to enroll in school, all of the children — in a complete turnaround — returned to class last month.",
      "publishedAt": "2024-05-06T19:47:47Z",
      "title": "After AP investigation, family of missing students enrolls in school",
      "url": "https://apnews.com/255757b5541bf425c4cfde48961af79e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd5e17af1dff41c09248701278eb32fe/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}