{
  "articles": [
    {
      "author": "ERIC TUCKER, JIM MUSTIAN, KEVIN McGILL and JACK BROOK",
      "description": "NEW ORLEANS (AP) — A mix of law enforcement, street performers and football fans has filled New Orleans’ blocks as the city inches back to normalcy while mourning victims of the deadly New Year's rampage in which an Army veteran plowed a truck into revelers.",
      "publishedAt": "2025-01-03T05:04:03Z",
      "title": "New Orleans inches toward normalcy while mourning victims of deadly New Year’s rampage",
      "url": "https://apnews.com/88a300e2f36eaf2920ed634983d72f08",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/899a7ebb44894a63a42e99f2d2f96b6f/1920.jpeg"
    },
    {
      "author": "MARTHA BELLISLE",
      "description": "An 18-year-old woman dreaming of becoming a nurse, a single mother, a father of two and a former Princeton football star were killed when the driver of a white pickup truck sped down Bourbon Street, packed with holiday revelers.",
      "publishedAt": "2025-01-01T22:58:04Z",
      "title": "An aspiring nurse, a football star, a single mother and a father of 2 killed in New Orleans attack",
      "url": "https://apnews.com/9f2fbcc3e48d8b391590f60969e80e61",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6db7a3c9cbcb4773b74890e225574c2f/3000.jpeg"
    },
    {
      "author": "TARA COPP, ALANNA DURKIN RICHER, COLLEEN LONG and TY ONEIL",
      "description": "LAS VEGAS (AP) — The highly decorated Army soldier inside a Tesla Cybertruck packed with fireworks that exploded outside Trump International Hotel in Las Vegas shot himself in the head just before detonation, authorities said Thursday.",
      "publishedAt": "2025-01-02T15:38:48Z",
      "title": "Soldier shot self in head before Cybertruck exploded outside Trump's Las Vegas hotel, officials say",
      "url": "https://apnews.com/5c5a8fd13a50e2bcde46370ae926d427",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09b16e6bbc0a44d39f281f1ec114b03b/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korean investigators left the official residence of impeached President Yoon Suk Yeol after a near-six-hour standoff on Friday during which he defied their attempt to detain him.",
      "publishedAt": "2025-01-03T03:51:55Z",
      "title": "South Korea's impeached president defies warrant after hourslong standoff",
      "url": "https://apnews.com/c8dc1758647979455dbf0d56e70369a4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1317cc951404473286d81faf5c52d262/1920.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN",
      "description": "WASHINGTON (AP) — A harrowing chapter in American history remains shrouded in mystery: Who planted pipe bombs outside offices of the Democratic and Republican national committees in Washington on the eve of the attack on the Capitol?",
      "publishedAt": "2025-01-02T23:05:29Z",
      "title": "FBI releases new video of a suspect planting a pipe bomb near DNC offices on eve of the Capitol riot",
      "url": "https://apnews.com/ea85b6fe5fe9140f1c75b7ee8c0554b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae06fd147b8445739015fdf0fc37a0f5/1920.jpeg"
    },
    {
      "author": "JAIMIE DING and DAMIAN DOVARGANES",
      "description": "FULLERTON, Calif. (AP) — Two people died and 19 were injured Thursday when a small plane crashed through the roof of a sprawling furniture manufacturing building in Southern California where at least 200 people were working, police said.",
      "publishedAt": "2025-01-02T23:16:57Z",
      "title": "2 dead and 19 injured in Southern California plane crash",
      "url": "https://apnews.com/08ec23f1c117be7bc07fc9b8f4064f91",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dad700e83563422a9baec3d21ccc188c/1920.jpeg"
    },
    {
      "author": "AUDREY McAVOY, JENNIFER SINCO KELLEHER and GENE JOHNSON",
      "description": "HONOLULU (AP) — In recent years, occasions large and small — parties, Super Bowls, mixed-martial arts fights, even Thanksgiving — have provided a reason for residents across Hawaii to set off illegal fireworks.",
      "publishedAt": "2025-01-03T05:05:15Z",
      "title": "Will a devastating New Year's Eve explosion change Hawaii's fireworks culture?",
      "url": "https://apnews.com/62e7e02fb018a8c29d4298c6f2804f1b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/221db36cd9c34a76a6a8a524be411cba/1920.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The federal courts will not refer allegations that Supreme Court Justice Clarence Thomas may have violated ethics laws to the Justice Department, the judiciary's policymaking body said Thursday.",
      "publishedAt": "2025-01-03T01:16:07Z",
      "title": "Federal courts won't refer Supreme Court Justice Clarence Thomas to attorney general over ethics",
      "url": "https://apnews.com/f9c9fee5554e5859e7f6185698fb4f76",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd09b6cd0ee84c57bfe484c73799a8cb/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAM MEDNICK",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — At least 30 people, including children, were killed in Gaza by Israeli strikes overnight and into Friday morning, said hospital staff, as air sirens sounded across Israel and stalled ceasefire talks were set to resume.",
      "publishedAt": "2025-01-03T09:58:00Z",
      "title": "At least 30 people killed by Israeli strikes in Gaza as stalled ceasefire talks set to resume",
      "url": "https://apnews.com/1eb622d4d4dac17b9f10494107b9e136",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2c51d7037864e43bc06ef021f01f3db/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — As president, Jimmy Carter brokered the watershed peace agreement that removed Israel’s most powerful enemy from the battlefield.",
      "publishedAt": "2025-01-03T05:11:32Z",
      "title": "Carter's quest for Mideast peace didn't end with Camp David",
      "url": "https://apnews.com/af2fbf95bfac2c1ebb8df5a67fcbeb2b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1ace3097d8640c0aa584ef1247ccf16/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}