{
  "articles": [
    {
      "author": "AAMER MADHANI, COLLEEN LONG, ZEKE MILLER AND WILL WEISSERT",
      "description": "NEW YORK (AP) — Vice President Kamala Harris made a surprise appearance on “Saturday Night Live” in the final days before the election, playing herself as the mirror-image double of Maya Rudolph’s version of her in the show's cold open.",
      "publishedAt": "2024-11-02T23:32:43Z",
      "title": "Harris appears on 'Saturday Night Live' as mirror image of Maya Rudolph with election looming",
      "url": "https://apnews.com/f58069ca1db9ec077b092a52bd118ac5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47e48791fae541439b1eca8aeb355b1d/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI, JILL COLVIN and DARLENE SUPERVILLE",
      "description": "CHARLOTTE, N.C. (AP) — Democrat Kamala Harris and Republican Donald Trump zeroed in on the Sun Belt on Saturday as they embarked on one last weekend quest to sway every undecided voter in the battleground states.",
      "publishedAt": "2024-11-02T14:31:19Z",
      "title": "Harris and Trump focus on Sunbelt states during final weekend push for votes",
      "url": "https://apnews.com/437e0faf54c19bee5944650166383bfb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49bc3d01e8694577b0e0c5382786a5fa/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE, JULIA FRANKEL and LEE KEATH",
      "description": "JERUSALEM (AP) — They were built to be places of healing. But once again, three hospitals in northern Gaza are encircled by Israeli troops and under fire.Bombardment is pounding around them as Israel wages a new offensive against Hamas fighters that it says have regrouped nearby.",
      "publishedAt": "2024-11-03T04:21:55Z",
      "title": "Still wrecked from past Israeli raids, hospitals in northern Gaza come under attack again",
      "url": "https://apnews.com/7f3d7db74304cbe1b12d2b2e950dec82",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfea9e368894445abbdeff20bf77487f/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Palestinian officials say an Israeli drone strike on a clinic in northern Gaza where children were being vaccinated for polio wounded six people, including four children.",
      "publishedAt": "2024-11-03T08:07:35Z",
      "title": "Palestinians say Israel struck a Gaza clinic during a polio campaign. The army denies it",
      "url": "https://apnews.com/9806fad6404f68737c5192c6fa1c7b9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bdbcdf9f0f24c5c873256fc7366c756/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — An Iranian-American journalist who once worked for a U.S. government-funded broadcaster is believed to have been detained by Iran for months now, authorities said Sunday, further raising the stakes as Tehran threatens to retaliate over an Israeli attack on the country.",
      "publishedAt": "2024-11-03T06:41:52Z",
      "title": "US says Iranian-American held in Iran as tensions high following Israeli attack on country",
      "url": "https://apnews.com/fe47ab33a4ac29a19ac0177ee06786ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcac1e5e99da488e9409a3460382b54c/3000.jpeg"
    },
    {
      "author": null,
      "description": "OKLAHOMA CITY (AP) — A tornado and severe thunderstorm struck the Oklahoma City area early Sunday, causing an unspecified amount of damage, according to weather forecasters and local media.There were no immediate reports of injuries.",
      "publishedAt": "2024-11-03T10:36:36Z",
      "title": "Tornado and severe thunderstorm cause damage in Oklahoma City area",
      "url": "https://apnews.com/a6e8d2107448b71855150c0af6491ec6",
      "urlToImage": ""
    },
    {
      "author": "JOSEPH WILSON",
      "description": "PAIPORTA, Spain (AP) — The pictures of the smiling toddlers on the wall somehow survived.Most everything else in the daycare — the cradles, the highchairs, the toys — was ruined when a crushing wall of water swept through Paiporta, turning the Valencia municipality of 30,000 into the likely epicenter of Spain's deadliest natural disaster in living memory.",
      "publishedAt": "2024-11-02T10:50:37Z",
      "title": "'It is all in ruins.' The shattered lives of Paiporta at the epicenter of Spain's floods",
      "url": "https://apnews.com/f52e40c9fdf2af44814617948afdb920",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ac00c89b3f249baa1813a2d16c1b068/3000.jpeg"
    },
    {
      "author": "BY STEPHEN McGRATH and VADIM GHIRDA",
      "description": "CHISINAU, Moldova (AP) — Moldovans are casting votes in a decisive presidential runoff Sunday that pits pro-Western incumbent Maia Sandu against a Russia-friendly opponent, as ongoing claims of voter fraud and intimidation threaten democracy in the European Union candidate country.",
      "publishedAt": "2024-11-03T05:07:28Z",
      "title": "Moldovans choose president in decisive runoff overshadowed by fraud and intimidation claims",
      "url": "https://apnews.com/5886447779a4a818e9f30fdadcb8bbe5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/77849fe14e2c4ae2a28be088521d1ec1/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and SUMMER BALLENTINE",
      "description": "Orlando Harris’ family pleaded with Missouri police to confiscate the 19-year-old’s bullet-proof vest, ammunition and AR-15-style rifle. They knew his mental health was fragile after more than one suicide attempt.",
      "publishedAt": "2024-11-03T04:19:04Z",
      "title": "Family pleaded to have assault rifle seized before deadly school shooting. Officers had few options",
      "url": "https://apnews.com/dba891ceaec8d3881ef07e05eb966eb9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3dab1504b31c4b808735db5140f41955/3000.jpeg"
    },
    {
      "author": "TRAVIS LOLLER",
      "description": "NASHVILLE, Tenn. (AP) — In 1989, Americans were riveted by the shotgun murders of Jose and Kitty Menendez in their Beverly Hills mansion by their own children.",
      "publishedAt": "2024-11-03T05:05:21Z",
      "title": "True crime's popularity brings real change for defendants and society. It's not all good",
      "url": "https://apnews.com/66790454ecf2edebbffd4250d681da2a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4e934f067e5453a971dfc4fd5ee7b97/2946.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}