{
  "articles": [
    {
      "author": "KEVIN McGILL",
      "description": "NEW ORLEANS (AP) — A new congressional district map giving Louisiana a second majority-Black House district was rejected Tuesday by a panel of three federal judges, fueling new uncertainty about district boundaries as the state prepares for fall congressional elections.",
      "publishedAt": "2024-04-30T23:11:16Z",
      "title": "US judges have rejected a map that would have given Louisiana a new majority-Black House district",
      "url": "https://apnews.com/f3a5a51ff937f036303479888bfdc7ce",
      "urlToImage": ""
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, COLLEEN LONG and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — The first week of testimony in Donald Trump’s hush money trial was the scene-setter for jurors.",
      "publishedAt": "2024-04-30T21:37:06Z",
      "title": "Takeaways from the start of week 2 of testimony in Trump's hush money trial",
      "url": "https://apnews.com/d0832549a000c118d38a794240eda81f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f35544ecc3a7487f891b741703cfef55/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and MATTHEW LEE",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu pledged Tuesday to launch an incursion into the southern Gaza city of Rafah, where hundreds of thousands of Palestinians are sheltering from the almost 7-month-long war, just as cease-fire negotiations between Israel and Hamas appear to be gaining steam.",
      "publishedAt": "2024-04-30T10:43:44Z",
      "title": "Netanyahu vows to invade Rafah 'with or without a deal' as cease-fire talks with Hamas continue",
      "url": "https://apnews.com/f5e14fd176d69f9c4e23b48f3ab5af6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9cbce9f581474b35bc773b0fbb7ee2fe/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The U.S. Drug Enforcement Administration is moving toward reclassifying marijuana as a less dangerous drug.",
      "publishedAt": "2024-04-30T22:21:33Z",
      "title": "What marijuana reclassification means for the United States",
      "url": "https://apnews.com/3c9478472e124c7aaa9b934270b0d450",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4540dadac38542d5abe7ee1830546f4a/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — Former President Donald Trump says in a new interview it should be left to the states whether to prosecute women for abortions or whether to monitor women's pregnancies. He declined to comment on access to the abortion pill mifepristone, which has been embroiled in an intense legal battle.",
      "publishedAt": "2024-04-30T17:54:35Z",
      "title": "Trump says states should decide on prosecuting women for abortions, has no comment on abortion pill",
      "url": "https://apnews.com/7f43c7e9ab192ebe874a1f0b1b7ba60b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c14d72ed1db84279889f7dcd9849f542/3000.jpeg"
    },
    {
      "author": "ERIK VERDUZCO and JEFFREY COLLINS",
      "description": "CHARLOTTE, N.C. (AP) — Law enforcement officers with an arrest warrant demanded that a man come out of a house in North Carolina before four were killed by gunfire, the victims unable to survive shots coming from inside the dwelling, a witness and officials said Tuesday.",
      "publishedAt": "2024-04-30T12:26:10Z",
      "title": "4 officers killed in North Carolina were at disadvantage as shots rained from above, police say",
      "url": "https://apnews.com/64a4a9c849b721631cd2f8872945e08d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2605a1af02854ef283e24dff1c552654/1920.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "CHARLOTTE, N.C. (AP) — United Methodist delegates began making historic changes in their policies on sexuality on Tuesday — voting without debate to reverse a series of anti-LGBTQ policies.The delegates voted to delete mandatory penalties for conducting same-sex marriages and to remove their denomination's bans on considering LGBTQ candidates for ministry and on funding for gay-friendly ministries.",
      "publishedAt": "2024-04-30T17:17:24Z",
      "title": "United Methodists begin to reverse longstanding anti-LGBTQ policies",
      "url": "https://apnews.com/fa9a335a74bdd58d138163401cd51b54",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bd6e6c70bae454fa418feb62ad45b64/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "SEATTLE (AP) — Binance founder Changpeng Zhao was sentenced Tuesday to four months in prison for allowing rampant money laundering on the world’s largest cryptocurrency exchange. A judge credited Zhao for taking responsibility for his wrongdoing but said he was troubled by the now-former CEO's decision to ignore U.S.",
      "publishedAt": "2024-04-30T04:38:16Z",
      "title": "Binance founder Changpeng Zhao sentenced to 4 months for allowing money laundering",
      "url": "https://apnews.com/cf81925ff9b4b65e27f80f906a6a63ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1f81616222ee49c7b4a14a524b9a7eed/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "Regular mammograms to screen for breast cancer should start younger, at age 40, according to an influential U.S. task force. Women ages 40 to 74 should get screened every other year, the group said.",
      "publishedAt": "2024-04-30T15:04:58Z",
      "title": "Mammograms should start at 40 to address rising breast cancer rates at younger ages, panel says",
      "url": "https://apnews.com/2b4ebc0dcd0335fd08d17e2e03bc7b23",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea5378d11b634a1e850d8387b57701e1/1920.jpeg"
    },
    {
      "author": "LINDSEY BAHR",
      "description": "A breakout moment in Hollywood can happen at any age and stage. This summer at the movies, there are plenty of talents to discover, from the formerly incarcerated man whose story inspired the film he stars in to the “It” bully whose childhood dream of playing an ape in a movie came true.",
      "publishedAt": "2024-04-30T17:39:15Z",
      "title": "Summer Movies: 5 breakout stars to watch in 'Sing Sing,' 'Quiet Place, 'Horizon' and more",
      "url": "https://apnews.com/6d78b9006e2738ccffde490d17b91baf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab2184e8f77149afb4dda235c723c0c2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}