{
  "articles": [
    {
      "author": "JOSEPH KRAUSS",
      "description": "President Donald Trump’s suggestion that Egypt and Jordan take in Palestinians from the war-ravaged Gaza Strip is likely to be met with a hard “no” from the two close U.S. allies and the Palestinians themselves. They fear Israel would never allow them to return. Trump floated the idea on Saturday, saying he would urge the leaders of the two Arab countries to take in Gaza’s now largely homeless population, so that “we just clean out that whole thing.” He added that resettling Gaza’s population “could be temporary or long term.”",
      "publishedAt": "2025-01-26T09:43:56Z",
      "title": "Trump wants Egypt and Jordan to take in Palestinians from Gaza. Here's why they are likely to refuse",
      "url": "https://apnews.com/article/israel-palestinians-trump-gaza-egypt-jordan-c6bedbd6ca0702c22b80f1bf07cd4326",
      "urlToImage": "https://dims.apnews.com/dims4/default/ade1884/2147483647/strip/true/crop/5780x3251+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2Ffa%2F02e932572942f14009027387adb7%2F5f20ba8fa9db4dfea7f0801a3e2b336b"
    },
    {
      "author": "ZEKE MILLER, WILL WEISSERT",
      "description": "President Donald Trump says he’d like to see Arab nations increase the number of Palestinian refugees they are accepting from the Gaza Strip — potentially moving out enough of the population to “clean out” the area to create a virtual clean slate. He told reporters aboard Air Force One on Saturday that he'd discussed his vision on a call with King Abdullah II of Jordan and would speak Sunday with Egypt's president. Trump also said he’s ended his predecessor’s hold on sending 2,000-pound bombs to Israel. That lifts a pressure point meant to reduce civilian casualties during Israel's war with Hamas in Gaza that is now halted by a tenuous ceasefire.",
      "publishedAt": "2025-01-26T00:59:48Z",
      "title": "Trump wants Jordan, Egypt to accept more Palestinian refugees, floats plan to 'just clean out' Gaza",
      "url": "https://apnews.com/article/trump-biden-israel-bomb-gaza-hamas-war-023b36984c6116c128b5e47f117bba2a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d566c03/2147483647/strip/true/crop/2336x1314+0+122/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F69%2F72%2Fad4536f39f5c690997435d9cd038%2Fa8f189a0753e43048107651fcc849c7d"
    },
    {
      "author": "KAREEM CHEHAYEB, ABBY SEWELL",
      "description": "At least three people were killed and more than 40 others injured in southern Lebanon Sunday when Israeli forces opened fire on protesters who had breached roadblocks the Israeli army set up a day before, Lebanon’s health ministry reported. Demonstrators attempted to enter several villages to protest Israel’s failure to withdraw its troops from southern Lebanon by the 60-day deadline stipulated in a ceasefire agreement that halted the Israel-Hezbollah war in late November. Israel has said that it needs to stay longer because the Lebanese army has not deployed to all areas of southern Lebanon to ensure that Hezbollah does not reestablish a military presence in the area. The Lebanese army has said it cannot deploy until Israeli forces withdraw.",
      "publishedAt": "2025-01-26T08:26:24Z",
      "title": "At least 3 killed, 40 injured after Israeli forces fire on protestors in Lebanon",
      "url": "https://apnews.com/article/lebanon-israel-ceasefire-idf-withdrawal-protesters-killed-4e4f3fc42a44762d1df8dbdbbdfcf213",
      "urlToImage": "https://dims.apnews.com/dims4/default/fab6fe1/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2F4d%2F72fe95cdbf6efd09d5c97947ea8f%2F8bf49306808742a3b1cc662c489244e5"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, JOSEPH KRAUSS",
      "description": "Health officials in Gaza say a Palestinian man was killed and seven people were wounded by Israeli fire overnight. They were among crowds who gathered in hopes of returning to the northern Gaza Strip under a fragile week-old ceasefire, the officials said Sunday. Israel on Saturday was to begin allowing Palestinians to return to northern Gaza on foot. Israel put the move on hold until Hamas freed a hostage who Israel said was supposed to have been freed that day. In a separate development, President Donald Trump suggested that most of Gaza’s population should be at least temporarily resettled elsewhere, including in Egypt and Jordan. Both countries and the Palestinians have previously rejected that idea.",
      "publishedAt": "2025-01-26T08:29:20Z",
      "title": "Israeli fire kills 1, wounds 7 as Palestinians are kept out of north Gaza over a ceasefire dispute",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-26-2025-d0f9d113ceec2dababe462967ee8d398",
      "urlToImage": "https://dims.apnews.com/dims4/default/90f2a60/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F13%2F6a1acc7e5968b8aa17ee1d2a11ab%2F2b46194b634d4ffcb5fd3e16a3d600c8"
    },
    {
      "author": "MATTHEW PERRONE",
      "description": "The nomination of Robert F. Kennedy Jr. to become the nation's top health official has put health advocates in an awkward position: voicing support for some of his proposals while warning of the catastrophic consequences of others. The anti-vaccine lawyer has been tapped by President Donald Trump to lead the nation's public health agencies. Later this week he will face questions from Senate lawmakers considering his nomination. While Kennedy's views on vaccines are universally rejected by health experts, they acknowledge that some of his ideas on improving U.S. food and nutrition are sound. Some advocates say they are willing to help Kennedy if he pursues ideas that could improve public health.",
      "publishedAt": "2025-01-26T14:00:06Z",
      "title": "Skeptical health experts say they’re willing to work with RFK Jr.",
      "url": "https://apnews.com/article/rfk-senate-confirmation-vaccines-trump-health-f000bbb5c5f2c800299a7ff8e64fee0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/74d49cf/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2F44%2Ffcc14f761827ae3ccb9c9debe28f%2Ffdeb3670369641fd826d5b30efdafc35"
    },
    {
      "author": "LOLITA C. BALDOR, TARA COPP",
      "description": "There will be a lot on the plate for new Defense Secretary Pete Hegseth when he steps into his office on the Pentagon’s third floor E Ring. Issues confronting him beginning Monday morning range from global conflicts and border security to administrative tasks. He'll have to address President Donald Trump’s priority to strengthen the U.S. military presence along the southern border. And Hegseth will be reviewing whether active-duty forces should be used for law enforcement. That's something done rarely. He'll have decisions to make about aid to Ukraine, the ceasefire in Gaza and troop deployments in the Mideast. Not to mention Trump directives to rid the government of diversity programs and personnel.",
      "publishedAt": "2025-01-26T13:40:32Z",
      "title": "As Hegseth takes charge at the Pentagon, here's what changes could be in store",
      "url": "https://apnews.com/article/pentagon-hegseth-priorities-border-budget-3227111b703be8a90ad93da289784932",
      "urlToImage": "https://dims.apnews.com/dims4/default/99a7baa/2147483647/strip/true/crop/7410x4168+0+386/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F77%2Feaff75e91b3fa26a89c63d1474d9%2Fd8acb40c65f44e25b9de8ed8eef901f7"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "The CIA now believes the virus responsible for the COVID-19 pandemic most likely originated from a laboratory. That's according to an assessment released Saturday pointing the finger at China even while acknowledging the spy agency has “low confidence” in its own conclusion. The finding isn't the result of any new intelligence, and the report was completed at the behest of the Biden administration and former CIA Director William Burns. It was declassified and released Saturday on the orders of President Donald Trump’s pick to lead the agency, John Ratcliffe, who was sworn in Thursday as director.",
      "publishedAt": "2025-01-25T20:41:34Z",
      "title": "CIA believes COVID likely originated from a lab, but has low confidence in the finding",
      "url": "https://apnews.com/article/covid-cia-trump-china-pandemic-lab-leak-9ab7e84c626fed68ca13c8d2e453dde1",
      "urlToImage": "https://dims.apnews.com/dims4/default/714e457/2147483647/strip/true/crop/8819x4961+0+459/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2Fd9%2Fcbc02a6bca9ef0a2695e5429099d%2Fd3e968cd4d3245028a22127117683c6d"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "The Democratic Party has so far been splintered in responding to President Donald Trump’s push against illegal immigration. The new president is acting to seal off the U.S.-Mexico border border to asylum seekers and deport millions of immigrants who do not have permanent legal status. On Capitol Hill, a crucial faction of Democrats are looking for places of agreement with Trump. And in fact, Democrats helped send an immigration bill to his desk during his first week in office. Democrats are searching for a new message on border security and immigration as polls show broad support for tougher measures.",
      "publishedAt": "2025-01-26T13:04:59Z",
      "title": "Democrats are splintered on immigration and how to respond to Trump",
      "url": "https://apnews.com/article/congress-immigration-trump-laken-riley-democrats-deport-f6ef14cc837f0b28edd1a10a5a848788",
      "urlToImage": "https://dims.apnews.com/dims4/default/c7b107b/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F04%2F0d3afe39de230b8dbe0ce9323fda%2Ff49acbe7d4d7487da958020e4ebb3b6b"
    },
    {
      "author": "CHRIS MEGERIAN, JOSH BOAK",
      "description": "Inflation was a driving force behind Donald Trump's election victory, but he's put the issue on the back burner during his first week in office. He's instead focusing on immigration, which he describes as his top priority. Trump is banking that voters will give him a pass and continue to blame former President Joe Biden for high prices. Trump is working to bring down energy prices by asking oil companies to produce more. But presidents have little direct control over prices of groceries, housing and other things that are frustrating Americans.",
      "publishedAt": "2025-01-26T13:44:45Z",
      "title": "Trump puts inflation on the back burner during first week",
      "url": "https://apnews.com/article/trump-inflation-grocery-prices-energy-production-consumers-c8afa45fc2b44471d55a1516e99ea351",
      "urlToImage": "https://dims.apnews.com/dims4/default/6cba2d4/2147483647/strip/true/crop/6644x3737+0+346/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff2%2F52%2F2e4f05f87074f0c5339903c7e913%2F3a556a902f494d2d9ac36c571c5c0570"
    },
    {
      "author": "MARK THIESSEN",
      "description": "President Donald Trump has changed the name of Alaska's Denali back to Mount McKinley. It's a nod to President William McKinley, who was from Ohio and who never set foot in Alaska. Many Alaskans say they'll never stop calling the mountain Denali. That name respects the Indigenous people who've lived in its shadows for thousands of years. Jeff King, a four-time winner of the Iditarod Trail Sled Dog Race, lives near the mountain. He says he doesn't know a single person who likes the idea of the new name. But Trump's move is drawing praise in Ohio, where a former congressman says \"it was the appropriate thing to do.”",
      "publishedAt": "2025-01-26T12:58:09Z",
      "title": "Many Alaskans continue to use Denali as name for Mount McKinley",
      "url": "https://apnews.com/article/trump-alaska-denali-mckinley-name-39c6e735fc56f4046200259cfe9e9934",
      "urlToImage": "https://dims.apnews.com/dims4/default/3abb628/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F7f%2F604ff5a9360ae5cde7cce7f5a34e%2F8c01f8af54b5406fb5608a7449b84a81"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}