{
  "articles": [
    {
      "author": "MARY CLARE JALONICK and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The Senate early Tuesday passed a $95.3 billion aid package for Ukraine, Israel and Taiwan, pushing ahead after months of difficult negotiations and growing political divisions in the Republican Party over the role of the United States abroad.",
      "publishedAt": "2024-02-13T11:42:36Z",
      "title": "Senate passes a $95.3 billion aid package for Ukraine and Israel, but fate in the House is uncertain",
      "url": "https://apnews.com/5fdcf8cb1964681dcce0f4fe7b9a0f86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8d85bfdb4d64293827acdd67d26567d/1920.jpeg"
    },
    {
      "author": null,
      "description": "TALLINN, Estonia (AP) — Estonia’s prime minister has been put on a wanted list in Russia because of her efforts to remove Soviet-era World War II monuments in the Baltic nation, officials said Tuesday as tensions between Russia and the West soar amid the war in Ukraine.",
      "publishedAt": "2024-02-13T09:52:11Z",
      "title": "Russia puts leader of NATO member Estonia on a wanted list over removal of Soviet-era monuments",
      "url": "https://apnews.com/4ca301df09eace6643be66a9a4a93fe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4220da6d125747b6a4e59a3c95f647a4/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY, NAJIB JOBAIN and TIA GOLDENBERG",
      "description": "CAIRO (AP) — Israel and Hamas are making progress toward another cease-fire and hostage-release deal, officials said Tuesday, as negotiations went on and Israel threatened to expand its offensive to Gaza's southern edge, where some 1.4 million Palestinians have sought refuge.",
      "publishedAt": "2024-02-13T11:22:06Z",
      "title": "Israel and Hamas are making progress in cease-fire and hostage-release talks, officials say",
      "url": "https://apnews.com/1a0509346f4725ed40d1422808fed076",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7b718689f5f46e48ac479f096d9ec3d/1920.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "HARTFORD, Conn. (AP) — Parts of the Northeast U.S. were hit Tuesday by a snowstorm that canceled and delayed flights, made roads slippery and prompted many school districts to cancel classes or switch to remote learning —- or at least try to switch.",
      "publishedAt": "2024-02-13T13:46:52Z",
      "title": "Winter storm hits Northeast, causing difficult driving, closed schools and canceled flights",
      "url": "https://apnews.com/ea899ba16d4e81279517d633a5600727",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89326abea03347638c63879e526a571e/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Former President Donald Trump is asking the Supreme Court to extend the delay in his election interference trial, saying he is immune from prosecution on charges he plotted to overturn his 2020 election loss.",
      "publishedAt": "2024-02-12T13:21:06Z",
      "title": "Trump asks Supreme Court to put off his election interference trial, claiming immunity",
      "url": "https://apnews.com/60bd61263299a88e48d4005d70b6094f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65d072711d824b08b562f6bfcbc4c7fb/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Having failed to impeach Homeland Security Secretary Alejandro Mayorkas the first time, House Republicans are determined to try again Tuesday, but it's not at all certain the do-over vote will produce a better tally after last week's politically embarrassing setback.",
      "publishedAt": "2024-02-13T05:02:38Z",
      "title": "House GOP will try again to impeach Mayorkas after failing once. But outcome is still uncertain",
      "url": "https://apnews.com/80cbd5bbb8f512c6814f155f825a1214",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/426f2c57b8e84b7aa7e5f092013f2892/3000.jpeg"
    },
    {
      "author": null,
      "description": "Iconic white ballot boxes and ballots to let the nearly 205 million eligible voters of Indonesia choose candidates in this Wednesday’s election have been carried across the world's largest archipelago by motorcycle, boat and even horse — as well as on foot.",
      "publishedAt": "2024-02-13T16:27:25Z",
      "title": "Election ballots and boxes carried across Indonesia by motorcycle, boat, horse and on foot",
      "url": "https://apnews.com/9169a01cc25cde9978ae29398753a534",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a9376bbaebd04da7b97c1c00e5cb3d08/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — The weeks after Kaniya Harris found out she was pregnant were among the hardest in her life.Final exams were fast approaching for the college junior. Her doctors told her she had an ovarian cyst, and the risk of ectopic pregnancy was high.",
      "publishedAt": "2024-02-13T15:27:27Z",
      "title": "Mental health emerges as a dividing line in abortion rights initiatives planned for state ballots",
      "url": "https://apnews.com/6268ec88d1638009128b55fc56e3610c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/83e87c70145d4b19b51ced11c783bdf4/3000.jpeg"
    },
    {
      "author": "CHRISTOPHER RUGABER",
      "description": "WASHINGTON (AP) — Consumer inflation in the United States cooled last month yet remained elevated in the latest sign that the pandemic-fueled price surge is only gradually and fitfully coming under control.",
      "publishedAt": "2024-02-13T05:01:47Z",
      "title": "US inflation slows but remains elevated in sign that price pressures are easing only gradually",
      "url": "https://apnews.com/539b662f32a3cea4a514407ae4389174",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/628d58c7a68d45368e35c1dae5af477e/2578.jpeg"
    },
    {
      "author": "JOE REEDY",
      "description": "The longest Super Bowl game will also go down as the most-watched program in U.S. television history.According to Nielsen and Adobe Analytics, Kansas City's 25-22 overtime victory over San Francisco on Sunday night averaged 123.4 million viewers across television and streaming platforms.",
      "publishedAt": "2024-02-13T03:41:28Z",
      "title": "Super Bowl was the most-watched program ever in the US, averaging 123.4 million viewers",
      "url": "https://apnews.com/e2f0288ea474bd564ee4df430e41b8bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/532b6be2b8814629a9cd160ec0813c4c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}