{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israeli troops and armor pushed deeper into northern and central Gaza on Monday, as the U.N. and medical staff warned that airstrikes are hitting closer to hospitals where tens of thousands of Palestinians have sought shelter alongside thousands of wounded.",
      "publishedAt": "2023-10-30T07:19:07Z",
      "title": "Israel expands ground assault into Gaza as fears rise over airstrikes near crowded hospitals",
      "url": "https://apnews.com/131e9537aaad8e74586cc114d2668e5a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/567c4ca2fb7c4d689d3ae8e2b85e188c/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israel expanded its military assault deeper into the northern Gaza Strip as the U.N.",
      "publishedAt": "2023-10-30T07:19:50Z",
      "title": "Live updates | Israel deepens military assault in the northern Gaza Strip",
      "url": "https://apnews.com/d33ac65b49723b9715ebf47041ac5f66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5665b4ef02574f35ada6d47be61c5e88/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and MATT O'BRIEN",
      "description": "WASHINGTON (AP) — President Joe Biden on Monday will sign a sweeping executive order to guide the development of artificial intelligence — requiring industry to develop safety and security standards, introducing new consumer protections and giving federal agencies an extensive to-do list to oversee the rapidly progressing technology.",
      "publishedAt": "2023-10-30T09:36:46Z",
      "title": "Biden wants to move fast on AI safeguards and will sign an executive order to address his concerns",
      "url": "https://apnews.com/cb86162000d894f238f28ac029005059",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/41a1f84fcaa94c5bbc678ffbf2f291e1/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — The campaign to use the U.S. Constitution's “insurrection” clause to bar former President Donald Trump from running for the White House again enters a new phase this week as hearings begin in two states on lawsuits that might end up reaching the U.S.",
      "publishedAt": "2023-10-30T04:03:43Z",
      "title": "Court arguments on blocking Trump from the presidential ballot under the ‘insurrection’ clause begin",
      "url": "https://apnews.com/f5d6c6174476ec414208323785df6e15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c494628094d84bfba37737c94b0be08e/1920.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "LEWISTON, Maine (AP) — Residents of Lewiston return to work Monday, the morning after coming together to mourn those lost in Maine’s worst mass shooting.",
      "publishedAt": "2023-10-30T04:44:45Z",
      "title": "More than 1,000 pay tribute to Maine's mass shooting victims on day of prayer, reflection and hope",
      "url": "https://apnews.com/35e78383dfb4fd84bfe07bcfc63760ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22e184252c6c477983676bb836f272a2/1920.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Hundreds of people stormed into the main airport in Russia's Dagestan region and rushed onto the landing field, chanting antisemitic slogans and seeking passengers arriving on a flight from the Israeli city of Tel Aviv, Russian news agencies and social media reported.",
      "publishedAt": "2023-10-29T19:26:58Z",
      "title": "Hundreds storm airport in Russia in antisemitic riot over arrival of plane from Israel",
      "url": "https://apnews.com/fa06b16131ed41c0c789981cdcaac84f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89b156caec8d459cb63b7b8f56a7e672/1920.jpeg"
    },
    {
      "author": null,
      "description": "JOLIET, Ill. (AP) — A man accused of murder, attempted murder and a hate crime in an attack on a Palestinian American woman and her young son is scheduled to appear in court on Monday following his indictmen t by an Illinois grand jury.",
      "publishedAt": "2023-10-30T04:18:33Z",
      "title": "Illinois man to appear in court on hate crime and murder charges in attack on Muslim mother and son",
      "url": "https://apnews.com/2e63edb587176bd85f7e3f8428a90ad1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/829f3f42b38b43e0a958b590219bfac3/2064.jpeg"
    },
    {
      "author": "HELEN WIEFFERING and GRACE EKPU",
      "description": "OKITIPUPA, Nigeria (AP) — It was the dead of night when the ship caught fire, Patrick Aganyebi remembers, but the flames made it seem as bright as day.The explosion that night woke him and knocked him to the floor.",
      "publishedAt": "2023-10-30T04:02:16Z",
      "title": "Deadly explosion off Nigeria points to threat posed by aging oil ships around the world",
      "url": "https://apnews.com/1d4cc4791cbfc28e6ccf942075510a60",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da83fdfbb5054588996b0991ff51fb36/1920.jpeg"
    },
    {
      "author": "COREY WILLIAMS and AISHA I. JEFFERSON",
      "description": "WAYNE, Mich. (AP) — As Britney Johnson paced the picket line outside Ford's Wayne Assembly plant, she wasn't just carrying a sign demanding higher pay and other changes.She also carried a legacy of car factory jobs and union wages that allowed generations of her family to enjoy middle-class lifestyles and that for years had been unattainable for many Black Americans.",
      "publishedAt": "2023-10-30T04:09:17Z",
      "title": "Some striking UAW members carry family legacies, Black middle-class future along with picket signs",
      "url": "https://apnews.com/1449b7e3ca984155bb825d2cfe38750e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f184c118009a49e6be0c4cde51911b5e/1920.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT and DIDI TANG",
      "description": "SAN DIEGO (AP) — The young Chinese man looked lost and exhausted when Border Patrol agents left him at a transit station. Deng Guangsen, 28, had spent the last two months traveling to San Diego from the southern Chinese province of Guangdong, through seven countries on plane, bus and foot, including traversing Panama's dangerous Darién Gap jungle.",
      "publishedAt": "2023-10-30T04:25:13Z",
      "title": "As economy falters, more Chinese migrants take a perilous journey to the US border to seek asylum",
      "url": "https://apnews.com/381c215ff30f0f2349c2ea118aa280c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ca4f4c8430f43ac8c2cfda12b45c835/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}