{
  "articles": [
    {
      "author": "CHRISTOPHER MEGERIAN and SYLVIE CORBET",
      "description": "PARIS (AP) — U.S. President Joe Biden on Friday for the first time publicly apologized to Ukraine for a monthslong holdup in American military assistance that let Russia make gains on the battlefield, as Ukrainian President Volodymyr Zelenskyy appealed for bipartisan U.S.",
      "publishedAt": "2024-06-07T07:36:54Z",
      "title": "Biden apologizes to Ukraine's Zelenskyy for monthslong holdup to weapons that let Russia make gains",
      "url": "https://apnews.com/a77546e23fa571eb7f6509d4e14b89b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b2eefcad30e84200b4985b9878dca0ee/2652.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and ZEKE MILLER",
      "description": "PARIS (AP) — President Joe Biden will return to Normandy for a second day during his trip to France as he tries to rally Americans in defense of democracy from Pointe du Hoc, a legendary spot along the coast where Army Rangers scaled cliffs during the D-Day invasion.",
      "publishedAt": "2024-06-07T04:09:24Z",
      "title": "Like Reagan before him, Biden looks to capture magic of Pointe du Hoc story",
      "url": "https://apnews.com/bc97ae35237e222caee55033ddb3588f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/450b30072af6453bba290cc49f34e066/3000.jpeg"
    },
    {
      "author": "RANDALL CHASE, MICHAEL KUNZELMAN, COLLEEN LONG and CLAUDIA LAUER",
      "description": "WILMINGTON, Del. (AP) — Federal prosecutors are wrapping up their gun case against Hunter Biden, with two more witnesses expected Friday in their effort to prove to jurors that the president's son lied on a mandatory gun purchase form when he said he wasn’t “an unlawful user of, or addicted to” drugs.",
      "publishedAt": "2024-06-07T04:07:30Z",
      "title": "The prosecution is wrapping up in Hunter Biden's gun trial. There are 2 more witnesses expected",
      "url": "https://apnews.com/8fc5b9e6960c1115c714e12c6e1217ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba7f69dde7c747ecb0da5669e1ac4eff/1920.jpeg"
    },
    {
      "author": "GARANCE BURKE and MEG KINNARD",
      "description": "Gene Folkes had just been jettisoned as a contestant on “The Apprentice” and was commiserating with a crew member at a bar inside the lobby of Trump Tower.",
      "publishedAt": "2024-06-07T04:05:29Z",
      "title": "A new account rekindles allegations that Trump disrespected Black people on 'The Apprentice'",
      "url": "https://apnews.com/d962dfce1220920681ede63b90058f5d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0827a157f35b4b07833c2a44a9aae1c0/2000.jpeg"
    },
    {
      "author": "JON GAMBRELL and BARAA ANWER",
      "description": "DUBAI, United Arab Emirates (AP) — At least nine Yemeni employees of United Nations agencies have been detained by Yemen's Houthi rebels under unclear circumstances, authorities said Friday, as the rebels face increasing financial pressure and airstrikes from a U.S.-led coalition.",
      "publishedAt": "2024-06-07T09:05:15Z",
      "title": "Yemen's Houthi rebels detain at least 9 UN staffers and others in sudden crackdown, officials say",
      "url": "https://apnews.com/966dce0c3d7cd96679b3c3562ee57068",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d0dc4f7eea44535a8617f9c882ea469/3000.jpeg"
    },
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — The proportion of Palestinian women and children being killed in the Israel-Hamas war appears to have declined sharply, an Associated Press analysis of Gaza Health Ministry data has found, a trend that both coincides with Israel’s changing battlefield tactics and contradicts the ministry’s own public statements.",
      "publishedAt": "2024-06-07T04:25:11Z",
      "title": "Women and children of Gaza are killed less frequently as war’s toll rises, AP data analysis finds",
      "url": "https://apnews.com/65e18f3362674245356c539e4bc0b67a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59816643a186486b9efae3a540359e82/3000.jpeg"
    },
    {
      "author": "ABDULRAHMAN ZEYAD and KAREEM CHEHAYEB",
      "description": "BAGHDAD (AP) — A dozen masked men jump out of two SUVs and a white pickup and storm a KFC in Baghdad, smashing everything in sight before fleeing the scene. A few days earlier, similar violence played out at Lee's Famous Recipe Chicken and Chili House — all American brands popular in the Iraqi capital.",
      "publishedAt": "2024-06-07T05:05:56Z",
      "title": "Attacks on businesses linked to US brands rattle Baghdad as anger over the war in Gaza surges",
      "url": "https://apnews.com/b4c8c64c4bfddb04b5e5ce43bd40e46b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf3da17349184ed4a26ff93d61550586/1991.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "KENT, Wash. (AP) — Kabongo Kambila Ringo stood outside the tent where he has been staying with his pregnant wife and ate from a clear plastic tray of Girl Scout cookies melting in the midday sun. He was one of around 240 asylum-seekers camping in a grassy lot along a highway south of Seattle, wondering if police would follow through on threats to arrest them for trespassing, and hoping officials instead might let them move into the vacant motel next door.",
      "publishedAt": "2024-06-07T04:09:42Z",
      "title": "Hundreds of asylum-seekers are camped out near Seattle. There's a vacant motel next door",
      "url": "https://apnews.com/aa05d9f113f2e16d3dfa463ae4e25358",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fcd94d889af1408eb9aca8b1e995d59f/3000.jpeg"
    },
    {
      "author": "BERNARD CONDON",
      "description": "NEW YORK (AP) — They are called zombies, companies so laden with debt that they are just stumbling by on the brink of survival, barely able to pay even the interest on their loans and often just a bad business hit away from dying off for good.",
      "publishedAt": "2024-06-07T05:23:14Z",
      "title": "Zombies: Ranks of world's most debt-hobbled companies are soaring, and not all will survive",
      "url": "https://apnews.com/52bd9ebbe1dd98983d39fe7d14e3c7fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b31887afd3e1495982e86a02d74ecd44/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — The Paris Olympics organizers on Friday unveiled a display of the five Olympic rings mounted on the Eiffel Tower as the French capital marks 50 days until the start of the Summer Games.",
      "publishedAt": "2024-06-07T05:21:50Z",
      "title": "Paris Olympics organizers unveil a display of the five Olympic rings mounted on the Eiffel Tower",
      "url": "https://apnews.com/d5ebf7009076a9834eb910260e5ed2ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4010db7110d4402d81522309eb630f13/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}