{
  "articles": [
    {
      "author": "The Associated Press",
      "description": "Ukrainian President Volodymyr Zelenskyy will meet with President Donald Trump in Washington on Friday as he seeks some form of U.S. backing for Ukraine's security against any future Russian aggression.",
      "publishedAt": "2025-02-28T07:46:00Z",
      "title": "Live updates: Trump to meet with Zelenskyy as Ukraine seeks an end to Russian aggression",
      "url": "https://apnews.com/live/donald-trump-latest-news-2-28-2025",
      "urlToImage": "https://dims.apnews.com/dims4/default/284e157/2147483647/strip/true/crop/8640x4860+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2F74%2F8677e7a04d2486797289a9e7ee9e%2Fap25057611146699.jpg"
    },
    {
      "author": "Michelle L. Price",
      "description": "President Donald Trump is expected to sign an executive order on Friday designating English as the official language of the United States. That's according to the White House. The order will allow government agencies and organizations that receive federal funding to choose whether to continue to offer documents and services in language other than English, according to a fact sheet about the impending order. The executive will rescind a mandate from former President Bill Clinton that required the government and organizations that received federal funding to provide language assistance to non-English speakers.",
      "publishedAt": "2025-02-28T15:24:01Z",
      "title": "Trump to sign order Friday designating English as the official language of the US",
      "url": "https://apnews.com/article/trump-english-national-language-d4b000e593ae7db2ac8264a6dbc5078f",
      "urlToImage": "https://dims.apnews.com/dims4/default/32e22ea/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F22%2Fe167ba40fdff1938756e0b0c991a%2F33fe82b41e4246d182cc60f02b5be0c8"
    },
    {
      "author": "Seth Borenstein",
      "description": "Hundreds of weather forecasters and other federal National Oceanic and Atmospheric Administration employees on probationary status have been fired, lawmakers and weather experts say. Federal workers who were not let go said the Thursday afternoon layoffs included meteorologists who do crucial local forecasts in National Weather Service offices across the country. Cuts at NOAA appeared to be happening in two rounds, one of 500 and one of 800. That’s about 10% of NOAA’s workforce. Congresswoman Grace Meng of New York called the terminations “unconscionable” and said, \"This action will only endanger American lives going forward.”",
      "publishedAt": "2025-02-28T03:21:43Z",
      "title": "Hundreds of weather forecasters fired in latest wave of DOGE cuts",
      "url": "https://apnews.com/article/national-weather-service-layoffs-trump-doge-a65360a1eb2500b7d47c9c966e383f4a",
      "urlToImage": "https://dims.apnews.com/dims4/default/79dcf6b/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F93%2Fc5%2F37d944929a7794f73099984525e3%2F59f1be55bac94a8b8d5729ad3d00b3fd"
    },
    {
      "author": "Meg Kinnard, Kevin S. Vineys",
      "description": "Civilian federal jobs are being cut by the thousands, as Elon Musk’s Department of Government Efficiency continues to shrink the government workforce at the behest of President Donald Trump. That’s brought a lot of churn and uncertainty in the nation’s capital, where 20% of the country’s more than 2 million civilian — or nonmilitary — federal workers are located. It’s also affecting workers and communities outside the Washington, D.C. area, where about 80% of that workforce is based. Those cuts mean that members of Congress are now facing potential angst among the out-of-work federal employees in their districts across the country. Some of the highest concentrations of federal workers are in places such as Oklahoma, Alaska, Alabama and New Mexico.",
      "publishedAt": "2025-02-27T20:48:14Z",
      "title": "Where are federal jobs affected by DOGE cuts? A look at congressional districts across the US",
      "url": "https://apnews.com/article/doge-federal-job-cuts-congressional-districts-data-5d79e2a7ef2160166b0bee59dfa4e9e2",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ad665e/2147483647/strip/true/crop/1442x811+0+103/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Fa7%2F802522fd8fcf73aae6cc52b83786%2F5d3eb399a07e4c729980f7d43f05fa3d"
    },
    {
      "author": "Janie Har",
      "description": "A federal judge in San Francisco finds the mass firings of probationary employees were likely unlawful. Thursday’s decision grants temporary relief to a coalition of labor unions and organizations that has sued to stop the Trump administration’s massive trimming of the federal workforce. U.S. District Judge William Alsup ordered the Office of Personnel Management to inform certain federal agencies that it had no authority to order the firings of probationary employees, including the Department of Defense. Lawyers for the personnel office say individual agencies made the decision to fire employees and that it had no role in ordering the firings.",
      "publishedAt": "2025-02-27T17:26:12Z",
      "title": "Judge finds mass firings of federal probationary workers were likely unlawful",
      "url": "https://apnews.com/article/trump-federal-employees-firings-a85d1aaf1088e050d39dcf7e3664bb9f",
      "urlToImage": "https://dims.apnews.com/dims4/default/0ff6c88/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2F09%2F4c19f031d3565982ab17c2ae81a7%2F4717b5ef5966451d9d72b3e929019e20"
    },
    {
      "author": "Fatima Hussein",
      "description": "The Social Security Administration is preparing to lay off at least 7,000 people from its workforce of 60,000 — and the final reduction in force number could be as high as 50%, according to two people familiar with the agency’s plans who are not authorized to speak publicly. It’s unclear how the layoffs will directly impact benefits of the 72.5 million beneficiaries, including retirees and children who receive retirement and disability benefits. However, advocates and Democratic lawmakers warn that layoffs will reduce the agency’s ability to serve recipients in a timely manner. The layoffs are part of the Trump administration’s intensified efforts to shrink the size of the federal workforce through the Department of Government Efficiency, run by Trump advisor Elon Musk.",
      "publishedAt": "2025-02-27T21:16:00Z",
      "title": "Social Security Administration could cut halve its workforce amid DOGE cuts",
      "url": "https://apnews.com/article/social-security-layoffs-doge-musk-trump-93efbed33957af5ec8ac37744d0592de",
      "urlToImage": "https://dims.apnews.com/dims4/default/6469ff2/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc4%2F567b096c40357421a58e7ecd5137%2Fddbd03eff35d411db8765dd1e451624b"
    },
    {
      "author": "Anne D'innocenzio, Haleluya Hadero",
      "description": "A grassroots organization is encouraging U.S. residents not to spend any money on Friday. The People’s Union USA describes it as an act of “economic resistance” to protest what the group’s founder sees as the malign influence of billionaires, big corporations and both major political parties on the lives of working Americans. The group calls the 24 hours of spending abstinence set to start at midnight an “economic blackout,” a term that has since been shared and debated on social media. Other activists and faith-based leaders are organizing boycotts to protest companies that have scaled back their diversity, equity and inclusion initiatives, and to oppose President Donald Trump’s moves to abolish all federal DEI programs and policies.",
      "publishedAt": "2025-02-27T20:17:05Z",
      "title": "Economic Blackout: Will a 24-hour boycott make a difference?",
      "url": "https://apnews.com/article/feb-28-economic-blackout-2025-d6b0bf2d1c989ee3071016e36598d76c",
      "urlToImage": "https://dims.apnews.com/dims4/default/c7d7a25/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2F99%2Fc318ee6cbb8d7929123b6fdc2245%2F37f71bbaba8c4e5cacbd0c527819138b"
    },
    {
      "author": "Susie Blann, Justin Spike",
      "description": "A preliminary economic agreement between Ukraine and the United States would ensure long-term U.S. involvement in rebuilding the country, but the deal leaves the question of security guarantees sought by Kyiv to future negotiations. According to the final version of the deal obtained by The Associated Press, the United States and Ukraine will establish a co-owned and jointly managed investment fund aimed at financing the reconstruction of Ukraine and its war-damaged economy. The agreement comes after two weeks of back-and-forth between Kyiv and Washington over how the U.S. could gain access to Ukraine’s natural resources.",
      "publishedAt": "2025-02-26T19:15:26Z",
      "title": "Economic deal between US and Ukraine will tie the countries together for years. Here’s what it says",
      "url": "https://apnews.com/article/trump-zelenskyy-deal-minerals-security-guarantees-1dfba27d47b5e4cbfabecd8f2821ddd4",
      "urlToImage": "https://dims.apnews.com/dims4/default/214991c/2147483647/strip/true/crop/7626x4290+0+397/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2F16%2F951d5fe4ae717148eb890a85c7a0%2F97dca957ede84bdcae6a3bb1d40dd37f"
    },
    {
      "author": "Graham Lee Brewer",
      "description": "More than 50 years after a shootout on the Pine Ridge Indian Reservation landed him in federal prison, Leonard Peltier remains defiant. He maintains his innocence in the deaths of two FBI agents in 1975. President Joe Biden commuted Peltier's life sentence so he could return to the Turtle Mountain Reservation, his tribal homeland in North Dakota. He says he will spend the rest of his life fighting for Native American rights. Peltier was part of a movement in the late 1960s and 1970s that fought for Native American rights and tribal self-determination, sometimes resulting in the occupation of federal and tribal property.",
      "publishedAt": "2025-02-28T05:12:12Z",
      "title": "Leonard Peltier remains defiant in AP interview, maintaining innocence and vowing continued activism",
      "url": "https://apnews.com/article/leonard-peltier-native-american-rights-fbi-prison-release-ff3fd1d8cb47f3ee193d1291b6b3f8cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/264de7f/2147483647/strip/true/crop/6091x3426+0+317/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F37%2Fa29cf0012f714bd3c290ab7c76de%2Fa43bbfdb27ee4895b65e29c1d3a26b00"
    },
    {
      "author": "Justin Spike, Aamer Madhani",
      "description": "Ukrainian President Volodymyr Zelenskyy is meeting with President Donald Trump in Washington. Friday's meeting is a pivotal moment for Zelenskyy's country, one that hinges on whether he can persuade the Republican to provide some form of U.S. backing for Ukraine’s security against any future Russian aggression. During the visit, Ukraine is expected to sign a landmark economic agreement with the U.S. that would bind the two countries economically for years. But Zelenskyy insists on firm security guarantees to safeguard his country. There are concerns that Trump may broker a peace deal favoring Russia. But U.S. officials argue American investments in Ukraine will inherently enhance its security.",
      "publishedAt": "2025-02-28T05:01:36Z",
      "title": "Zelenskyy will meet Trump and seek assurances against future Russian aggression",
      "url": "https://apnews.com/article/zelenskyy-security-guarantees-trump-meeting-washington-eebdf97b663c2cdc9e51fa346b09591d",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf72c60/2147483647/strip/true/crop/2585x1454+0+137/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcf%2Fbd%2F83c63b8ced689c6b5de1f5a52e3b%2Fb126372fa39a43b4a9dcf21ccd55f1fd"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}