{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and TIA GOLDENBERG",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — An apparent Israeli airstrike killed four international aid workers with the World Central Kitchen charity and their Palestinian driver late Monday, hours after the group brought in a new shipload of food to northern Gaza, which has been isolated and pushed to the brink of famine by Israel’s offensive.",
      "publishedAt": "2024-04-01T05:55:21Z",
      "title": "Gaza medical officials say Israeli strike kills 4 foreign aid workers, driver after delivering food",
      "url": "https://apnews.com/e75cf75aa88a9133774a883d987115c1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36229736ae154c92881ffdb61fc219f6/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump posted a $175 million bond on Monday in his New York civil fraud case, halting collection of the more than $454 million he owes and preventing the state from seizing his assets to satisfy the debt while he appeals, according to a court filing.",
      "publishedAt": "2024-04-02T00:22:55Z",
      "title": "Donald Trump has posted a $175 million bond to avert asset seizure as he appeals NY fraud penalty",
      "url": "https://apnews.com/feb0593a5bbd3837edc0db195554eda1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36a2ebf6da844c768f593f188aa69dc4/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB and ALBERT AJI",
      "description": "DAMASCUS, Syria (AP) — An Israeli airstrike that demolished Iran’s consulate in Syria on Monday killed two Iranian generals and five officers, according to Iranian officials. The strike appeared to signify an escalation of Israel’s targeting of military officials from Iran, which supports militant groups fighting Israel in Gaza, and along its border with Lebanon.",
      "publishedAt": "2024-04-01T16:14:18Z",
      "title": "Israeli strike on Iran's consulate in Syria killed 2 generals and 5 other officers, Iran says",
      "url": "https://apnews.com/edca34c52d38c8bc57281e4ebf33b240",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be18a29267e141eba6c334198ad7b28b/1920.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN and REBECCA BOONE",
      "description": "The owner and manager of a cargo ship that rammed into Baltimore's Francis Scott Key Bridge before the span collapsed last week filed a court petition Monday seeking to limit their legal liability for the deadly disaster.",
      "publishedAt": "2024-04-01T19:30:14Z",
      "title": "Cargo ship's owner and manager seek to limit legal liability for deadly bridge disaster in Baltimore",
      "url": "https://apnews.com/16de885948e769566e7181ffa35b1753",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73c967907ecf42788b79316d56a1921d/3000.jpeg"
    },
    {
      "author": "PHILIP MARCELO",
      "description": "NEW YORK (AP) — Above a bodega in New York City’s Harlem neighborhood, a mosque congregation hosts iftar, the traditional Islamic end of fast meal, for hundreds of hungry migrants every night during this holy month of Ramadan.",
      "publishedAt": "2024-04-02T04:17:00Z",
      "title": "Mosques in NYC struggle to house and feed an influx of Muslim migrants this Ramadan",
      "url": "https://apnews.com/7f0a9e2ac81426aa621adb28e87658f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8276baaef60b44309659776f0bc9072b/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — The judge in Donald Trump's April 15 hush-money criminal trial declared his family off-limits to the former president’s rancor on Monday, expanding a gag order days after Trump assailed his daughter and made false claims about her on social media.",
      "publishedAt": "2024-04-02T00:17:52Z",
      "title": "Judge expands Trump's gag order after ex-president's social media posts about judge's daughter",
      "url": "https://apnews.com/f182e7d5c27967b86a59277fd24743e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/457127337a054ef1a34a6bfe22e74381/3000.jpeg"
    },
    {
      "author": "BRENDAN FARRINGTON",
      "description": "TALLAHASSEE, Fla. (AP) — The Florida Supreme Court on Monday cleared the way for the state to ban abortions after six weeks of pregnancy, before many women know they are pregnant, while also giving voters a chance to remove restrictions in November.",
      "publishedAt": "2024-04-01T20:17:58Z",
      "title": "Florida Supreme Court upholds state’s 15-week abortion ban, but voters will soon have a say",
      "url": "https://apnews.com/6a4949fc7459afe9b5e298086a793126",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64a9803d994e429983c5176f2ed25c15/1302.jpeg"
    },
    {
      "author": "PIERRE-RICHARD LUXAMA",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Heavy gunfire erupted Monday in the downtown area of Haiti’s capital as police battled gang members near the National Palace for several hours.Local media reported that at least one policeman was shot after he and other officers were forced to flee an armored car that was later set on fire.",
      "publishedAt": "2024-04-01T21:56:31Z",
      "title": "Gunbattle between Haitian police and gangs paralyzes area near National Palace",
      "url": "https://apnews.com/c87fc362638cdb586628f866759d19ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e3f1887c4084decae4e524f73701d7b/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "SAN FRANCISCO (AP) — Google has agreed to purge billions of records containing personal information collected from more than 136 million people in the U.S. surfing the internet through its Chrome web browser.",
      "publishedAt": "2024-04-01T19:11:59Z",
      "title": "Google to purge billions of files containing personal data in settlement of Chrome privacy case",
      "url": "https://apnews.com/203cc5063f1a1d4013de1900d9376814",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2aa10c115aa140589b26c4251601377e/3000.jpeg"
    },
    {
      "author": "TIM BOOTH",
      "description": "PORTLAND, Ore. (AP) — After being a spectator a year ago, Paige Bueckers is headed back to the Final Four after scoring 28 points and lifting UConn to a 80-73 win over Southern California in the women's NCAA Tournament on Monday night.",
      "publishedAt": "2024-04-02T03:59:30Z",
      "title": "Paige Bueckers lifts UConn back to the Final Four with 80-73 win over JuJu Watkins and USC",
      "url": "https://apnews.com/56ce9ece7c278ce85af2e8042f4b1fe1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ec2eb20a85445b6937fc2f6a96a76f2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}