{
  "articles": [
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Mediators are making progress on an agreement for a weekslong cease-fire between Israel and Hamas and the release of dozens of hostages held in Gaza as well as Palestinians imprisoned by Israel, Israeli media reported Sunday.",
      "publishedAt": "2024-02-25T08:31:20Z",
      "title": "Israeli media report progress on reaching a temporary truce in Gaza and a hostage-prisoner exchange",
      "url": "https://apnews.com/f3e4ea708548689cf8d9d404c3ee94ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b89495c4dd9f4f4c998ba3cd0b64ca74/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "NEW YORK (AP) — Donald Trump trounced Nikki Haley on Saturday in the South Carolina primary, a victory that emphatically punctuated the depth and breadth of his support among Republican primary voters as he vanquished his lone remaining major opponent in her home state.",
      "publishedAt": "2024-02-25T00:17:01Z",
      "title": "Takeaways from South Carolina primary: Donald Trump's Republican home field advantage is everywhere",
      "url": "https://apnews.com/e42427234446c38ee06b2a771bddc16e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dec6c786a3ab46e08d939dbe9bec0d99/3000.jpeg"
    },
    {
      "author": "RAF CASERT",
      "description": "WESTROZEBEKE, Belgium (AP) — It was the puddles of green sludge left by the tires of massive tractors in western Belgium’s industrial farmlands that drew the attention of biological engineer Ineke Maes.",
      "publishedAt": "2024-02-25T05:03:28Z",
      "title": "Tractor protests threaten to drive the EU's green farming policies into a ditch",
      "url": "https://apnews.com/9e6369d9fb4c06c31c26c71a30ec2f40",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d99871ac6d124f8897ddae67c771ae3f/3000.jpeg"
    },
    {
      "author": "YURAS KARMANAU",
      "description": "TALLINN, Estonia (AP) — Polls opened Sunday in Belarus' tightly controlled parliamentary and local elections that are set to cement the steely rule of the country's authoritarian leader, despite calls for a boycott from the opposition, which dismissed the balloting as a “senseless farce.”",
      "publishedAt": "2024-02-25T04:04:38Z",
      "title": "Belarusians vote in tightly controlled election amid opposition calls for its boycott",
      "url": "https://apnews.com/b32e1a653d058be987adfee47a136a3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2691436791994261a9bdb85d85056508/2000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "GENEVA (AP) — Since late last century and the early days of the web, providers of digital media like Netflix and Spotify have had a free pass when it comes to international taxes on films, video games and music that are shipped across borders through the internet.",
      "publishedAt": "2024-02-25T06:12:37Z",
      "title": "Tax-free status of movie, music and games traded online is on table as WTO nations meet in Abu Dhabi",
      "url": "https://apnews.com/0ecda9f0c06ec37b961a2b2a77803fbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afd5a9da1004475d84b0e6066425f1c5/3000.jpeg"
    },
    {
      "author": "KRYSTA FAURIA",
      "description": "LOS ANGELES (AP) — Inside the ballroom at the 30th Screen Actors Guild Awards, “Oppenheimer” was front and center literally and figuratively, snagging the night’s top prize along with trophies for Cillian Murphy and Robert Downey Jr.",
      "publishedAt": "2024-02-25T06:44:02Z",
      "title": "Inside the SAG Awards: A mostly celebratory mood for 1st show since historic strike",
      "url": "https://apnews.com/663d25e3143330eb50a53c7e91841e34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfd1abc3c0bb4ced84ec4842d045bd16/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "EDMOND, Okla. (AP) — Vigils took place across the nation on Friday and Saturday for an Oklahoma teenager who died the day after a fight in a high school bathroom in which the nonbinary student claimed to be a target of bullying.",
      "publishedAt": "2024-02-25T08:07:37Z",
      "title": "Vigils held nationwide for nonbinary Oklahoma teenager who died following school bathroom fight",
      "url": "https://apnews.com/fd7695afb780d09c00b823fa0618e79f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d93533ec58443f8a478291872d2b29d/3000.jpeg"
    },
    {
      "author": "BARRY HATTON",
      "description": "LISBON, Portugal (AP) — The official two-week campaign period before Portugal’s early general election began on Sunday, with the country’s two moderate mainstream parties once again expected to collect the most votes but with the expected rise of a populist party potentially adding momentum to Europe’s drift to the right.",
      "publishedAt": "2024-02-25T05:09:50Z",
      "title": "Corruption scandals cast a shadow over Portugal’s early general election and may favor populists",
      "url": "https://apnews.com/781173c00fe310d9c6dc665f0be329c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee2a5fc6fce1474c8cc265a1e66ff1ab/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR and TARA COPP",
      "description": "WASHINGTON (AP) — The U.S. and Britain struck 18 Houthi targets in Yemen on Saturday, answering a recent surge in attacks by the Iran-backed militia group on ships in the Red Sea and Gulf of Aden, including a missile strike this past week that set fire to a cargo vessel.",
      "publishedAt": "2024-02-24T09:29:12Z",
      "title": "US and British strikes on Houthi sites in Yemen answer militants’ surge in Red Sea attacks on ships",
      "url": "https://apnews.com/89b3f92ae9dd6279b56d945439010a27",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69263fd2bce24e02913df04de8d79d93/1920.jpeg"
    },
    {
      "author": "SUSIE BLANN",
      "description": "KYIV, Ukraine (AP) — President Volodymyr Zelenskyy welcomed Western leaders to Kyiv Saturday to mark the second anniversary of Russia's full-scale invasion, as Ukrainian forces run low on ammunition and foreign aid hangs in the balance.",
      "publishedAt": "2024-02-24T05:59:52Z",
      "title": "Western leaders rally around Kyiv to mark 2 years since Russia's full-scale invasion",
      "url": "https://apnews.com/65088ba9eb9bd729cf8c677e2115cb35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd609c302f1548fdabbcb8779a80a4d9/2953.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}