{
  "articles": [
    {
      "author": "ADRIANA GOMEZ LICON and ALANNA DURKIN RICHER",
      "description": "MIAMI (AP) — An employee of Donald Trump's Mar-a-Lago estate, Carlos De Oliveira, is expected to make his first court appearance Monday on charges accusing him of scheming with the former president to hide security footage from investigators probing Trump's hoarding of classified documents.",
      "publishedAt": "2023-07-31T04:11:39Z",
      "title": "Mar-a-Lago worker charged in Trump's classified documents case will make his 1st court appearance",
      "url": "https://apnews.com/f7e6879fe80e96a321b46279b150bdf9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a29207b38d24751a8f95ac58863a1f6/3000.jpeg"
    },
    {
      "author": "WALTER BERRY",
      "description": "PHOENIX (AP) — Phoenix sizzled through its 31st consecutive day of at least 110 degrees Fahrenheit (43.3 Celsius) and other parts of the country grappled Sunday with record temperatures after a week that saw significant portions of the U.S.",
      "publishedAt": "2023-07-30T23:33:58Z",
      "title": "July keeps sizzling as Phoenix hits another 110-degree day and wildfires spread in California",
      "url": "https://apnews.com/c4e7ff29fef6fcf9c95b8b9c82f6f72b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba2f8efa10dc45e08c2102c27c1fc5af/3000.jpeg"
    },
    {
      "author": null,
      "description": "ST. ANTHONY, Idaho (AP) — Idaho mother Lori Vallow Daybell faces up to life in prison without parole Monday as she is sentenced in the murders of her two youngest children and a romantic rival in a case that included bizarre claims that her son and daughter were zombies and that she was a goddess sent to usher in the Biblical apocalypse.",
      "publishedAt": "2023-07-31T04:04:47Z",
      "title": "Idaho mom Lori Vallow Daybell faces sentencing in deaths of 2 children and her romantic rival",
      "url": "https://apnews.com/1e0a1cfa1f4e67b4dbb7b43cba86156d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca480edbbd104597a45403c1eac3e414/3000.jpeg"
    },
    {
      "author": "ANWARULLAH KHAN and RIAZ KHAN",
      "description": "KHAR, Pakistan (AP) — Hundreds of mourners attended funerals in Pakistan on Monday after a suicide bombing killed at least 54 people at an election rally for a pro-Taliban cleric, carrying caskets draped in colorful cloths to burial sites in the hills.",
      "publishedAt": "2023-07-31T07:19:03Z",
      "title": "Pakistan buries dead from massive suicide attack at political rally that killed 54",
      "url": "https://apnews.com/21bc29f3d7c3e75cd5ea9ade1d8d0cd6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f579cd02ce1c4607a061c3728746fb95/1920.jpeg"
    },
    {
      "author": "FELIPE DANA",
      "description": "KYIV, Ukraine (AP) — Russian missiles slammed into an apartment complex and a university building in the central Ukrainian city of Kryvyi Rih Monday, killing four people and wounding scores of others as the blasts trapped residents beneath rubble, Ukraine's interior minister said.",
      "publishedAt": "2023-07-31T08:34:28Z",
      "title": "Russian missiles strike an apartment building, killing at least 4 in Ukrainian leader's hometown",
      "url": "https://apnews.com/429c1b97cc19484e0a6e2f3ce92d739a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4a616f42d89444eb65ae4deb17cd1ce/2000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A Georgia prosecutor is expected to seek a grand jury indictment in the coming weeks in her investigation into efforts by Donald Trump and his Republican allies to overturn the then-president's 2020 election loss.",
      "publishedAt": "2023-07-31T04:23:36Z",
      "title": "Trump could be indicted soon in Georgia. Here's a look at that investigation",
      "url": "https://apnews.com/30f7874b58137831cfa5dd86415a9e9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59dcceb1f8ff493f85a975be9c322894/2371.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — West African nations have given Niger's coup leaders one week to reinstate the country's democratically elected president and have threatened to use force if the demands aren't met.",
      "publishedAt": "2023-07-31T09:17:09Z",
      "title": "West African nations threaten to use force if Niger's president isn't reinstated within a week",
      "url": "https://apnews.com/369ade0cb11447844a9265196f918ac8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e49d912535764c6e9ce5401c93fe3a03/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "PORTLAND, Maine (AP) — A primordial sea animal that lives on the tidal mudflats of the East Coast and serves as a linchpin for the production of vital medicines stands to benefit from new protective standards.",
      "publishedAt": "2023-07-31T03:10:47Z",
      "title": "Blue blood from horseshoe crabs is valuable for medicine, but a declining bird needs them for food",
      "url": "https://apnews.com/321477016cbf9809989cb9b0a77f560e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dc635d7f3868442585ebcab91407b7f3/3000.jpeg"
    },
    {
      "author": "JOE McDONALD",
      "description": "BEIJING (AP) — The Fangbiaogan Real Estate Agency in the southern city of Nanning is still waiting for China’s post-COVID rebound.Home sales are 30-40% below last year's depressed level after the economy barely grew in the latest quarter, according to the owner, who would give only his surname, Cai.",
      "publishedAt": "2023-07-31T03:29:35Z",
      "title": "Skepticism prevails as Chinese leaders promise to back private businesses to spur slowing economy",
      "url": "https://apnews.com/ad462b32457de194e4756ea331611376",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a99ab83bdd704c3796645b0b51481165/3000.jpeg"
    },
    {
      "author": "KANIS LEUNG",
      "description": "HONG KONG (AP) — Fans of singer and songwriter Coco Lee, who was known for her powerful voice and live performances, were gathering with flowers to pay their respects to their idol at her funeral in Hong Kong on Monday.",
      "publishedAt": "2023-07-31T07:43:24Z",
      "title": "Fans pay tribute to Coco Lee, Hong Kong singer who had international success",
      "url": "https://apnews.com/859c5797c2a7aecd09f108b76b604ce1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/750f6eddfd924108bcd24222c16e3473/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}