{
  "articles": [
    {
      "author": "MELANIE LIDMAN and TIA GOLDENBERG",
      "description": "RE'IM, Israel (AP) — Israelis held somber ceremonies on Monday to mark a year since the deadliest attack in the country's history, a Hamas-led raid that shattered its sense of security and ignited wars on two fronts with no end in sight.",
      "publishedAt": "2024-10-07T03:35:39Z",
      "title": "Israelis, scarred and battling on multiple fronts, mark a year since Hamas' Oct. 7 attack",
      "url": "https://apnews.com/cf123f95609051e8e8eaf6aebe661b6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6debc3ee08ed4a199b7ce9270271c1ef/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS and SARAH EL DEEB",
      "description": "The Gaza Strip is in ruins.There are hills of rubble where apartment blocks stood, and pools of sewage-tainted water spreading disease.",
      "publishedAt": "2024-10-07T04:27:05Z",
      "title": "Gaza is in ruins after Israel's yearlong offensive. Rebuilding may take decades",
      "url": "https://apnews.com/6b41ad9f64887228e90793705dd379a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/faf1f473705b41efa95cb6e4fa33d93a/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "KFAR AZA, Israel (AP) — On a sun-dappled day in Kibbutz Kfar Aza, Liora Eilon stood at the spot where her son was killed. She stooped to pick a figurine from the pile of belongings scattered around an abandoned home nearby.",
      "publishedAt": "2024-10-07T04:21:49Z",
      "title": "A year after the Hamas attack shattered this Israeli community, going home still feels impossible",
      "url": "https://apnews.com/344b289751d8ee80d4909f15864f508c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4124f43a8b0e4dccb283bf26314471f7/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Palestinian militants in Gaza fired a barrage of rockets into Israel on Monday as mourners marked the anniversary of the Oct. 7 attack, without disrupting a nearby ceremony.",
      "publishedAt": "2024-10-07T05:45:39Z",
      "title": "Middle East latest: Palestinian militants in Gaza fire rockets into Israel as it marks Oct. 7",
      "url": "https://apnews.com/d3d272d83e70d420ba547dbd7e09ef52",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1dfd9a5bc53346a5967527b4c7297c61/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — The United States has spent a record of at least $17.9 billion on military aid to Israel since the war in Gaza began and led to escalating conflict around the Middle East, according to a report for Brown University's Costs of War project, released on the anniversary of Hamas’ attacks on Israel.",
      "publishedAt": "2024-10-07T04:09:45Z",
      "title": "US spends a record $17.9 billion on military aid to Israel since last Oct. 7",
      "url": "https://apnews.com/8e6e5033f7a1334bf6e35f86e7040e14",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e3b8a3437bf48c7b42981b114d2549c/3000.jpeg"
    },
    {
      "author": "JEFF MARTIN and FREIDA FRISARO",
      "description": "FORT LAUDERDALE, Florida (AP) — Milton increased to a Category 2 hurricane early Monday as Florida gears up for what could be its biggest evacuation in seven years as the storm heads toward major population centers including Tampa and Orlando.",
      "publishedAt": "2024-10-07T04:14:16Z",
      "title": "Milton increases to a Category 2 hurricane as Florida prepares for massive evacuations",
      "url": "https://apnews.com/557c5c512135e0a8661b298e45e17c92",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0b3f56af9e34ab09e0755448abb13ce/1920.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The U.S. government’s top disaster relief official said Sunday that false claims and conspiracy theories about the federal response to Hurricane Helene — spread most prominently by Donald Trump — are “demoralizing” aid workers and creating fear in people who need recovery assistance.",
      "publishedAt": "2024-10-06T19:35:29Z",
      "title": "US disaster relief chief blasts false claims about Helene response as a 'truly dangerous narrative'",
      "url": "https://apnews.com/07d5b1f6968cb2af11b63357186a1a15",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c30f1f683583477099282ddd52d0b85d/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — Soon, the ballots will be cast, the polls will close and a campaign marked by assassination attempts, animosity and anxiety will come to an end. But for U.S. adversaries, the work to meddle with American democracy may be entering its most critical phase.",
      "publishedAt": "2024-10-07T04:04:50Z",
      "title": "For US adversaries, Election Day won't mean the end to efforts to influence Americans",
      "url": "https://apnews.com/efff7f7fcbc71032b1152d011c953eba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab611f5a543d471ba279258759ae8c1d/3000.jpeg"
    },
    {
      "author": "DANIEL NIEMANN, MARIA CHENG and MIKE CORDER",
      "description": "STOCKHOLM (AP) — The Nobel Prize in physiology or medicine was awarded Monday to Americans Victor Ambros and Gary Ruvkun for their discovery of microRNA, tiny pieces of genetic material that alter how genes work at the cellular level and could lead to new ways of treating cancer.",
      "publishedAt": "2024-10-07T07:14:52Z",
      "title": "Nobel Prize in medicine honors American duo for their discovery of microRNA",
      "url": "https://apnews.com/dc84622d7a15317bc83e873d3f9a2dbf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe40bbdc64f44e29b144dd3550b4eab5/3000.jpeg"
    },
    {
      "author": "WILL GRAVES",
      "description": "PITTSBURGH (AP) — Dak Prescott drifted to his left, then drifted some more. On a seemingly endless night, what was another couple of seconds going to hurt?With a flick of the wrist as T.J. Watt and the rest of the Pittsburgh defense closed in, the NFL's highest-paid player delivered a money throw to Jalen Tolbert with 20 seconds to go that lifted the Dallas Cowboys to a 20-17 victory early Monday.",
      "publishedAt": "2024-10-07T05:17:35Z",
      "title": "Prescott throws TD pass to Tolbert with 20 seconds left to lift Cowboys past Steelers, 20-17",
      "url": "https://apnews.com/5b4ed36f37b325f706fe42d74b9d06bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d458870b79bd430f8c283dd22bdd0482/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}