{
  "articles": [
    {
      "author": "COLLEEN LONG, ZEKE MILLER, JOHN HANNA, STEVE KARNOWSKI",
      "description": "President Joe Biden has commuted the sentence of Indigenous activist Leonard Peltier, who was convicted in the 1975 killings of two FBI agents and is serving life in prison. Peltier was denied parole as recently as July and wasn’t eligible for parole again until 2026. He was serving life in prison for the deaths of the agents during a standoff on the Pine Ridge Indian Reservation in South Dakota. Biden says Peltier will transition to home confinement. The fight for Peltier’s freedom is entangled with the Indigenous rights movements. Nearly half a century later, Peltier’s name remains a rallying cry.",
      "publishedAt": "2025-01-20T16:46:49Z",
      "title": "Biden commutes sentence for Indigenous activist Leonard Peltier",
      "url": "https://apnews.com/article/leonard-peltier-biden-pardons-eba525b713f2ec739b84aa4426366775",
      "urlToImage": "https://dims.apnews.com/dims4/default/00080fe/2147483647/strip/true/crop/2144x1206+0+249/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F40%2Fe0c517c6e2d773c123cefd301dc3%2Faaf83f1867a147599515a116604802ff"
    },
    {
      "author": "ZEKE MILLER, COLLEEN LONG, ALANNA DURKIN RICHER",
      "description": "It was just moments before Joe Biden's presidential term ended when he announced pardons for his siblings and their spouses. Biden said Monday his family had been “subjected to unrelenting attacks and threats, motivated solely by a desire to hurt me.” The family pardons were the surprise finale in a series of unprecedented presidential actions by the Democrat. Biden's move was designed to guard against possible retribution by Republican Donald Trump, who was sworn as president on Monday. The pardons came just before noon. Biden was already at the Capitol to see Trump inaugurated when word came out.",
      "publishedAt": "2025-01-20T16:53:33Z",
      "title": "Biden pardons his siblings and their spouses",
      "url": "https://apnews.com/article/biden-pardons-family-trump-white-hous-caee326c4723a4ba6d972f7daf750a0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/61f2658/2147483647/strip/true/crop/6056x3407+0+316/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fde%2F13e670aa386f31502c04db5a053b%2Faa2f19b63fd04c088a740aefba7f11a9"
    },
    {
      "author": "COLLEEN LONG, ZEKE MILLER",
      "description": "Dr. Anthony Fauci and retired Gen. Mark Milley say they appreciate their pardons from President Joe Biden. The Democratic president on Monday pardoned Milley, Fauci and members of the House committee that investigated the Jan. 6 attack on the Capitol, using the extraordinary powers of his office in his final hours to guard against potential “revenge” by the incoming Republican Trump administration. Donald Trump has warned of an enemies list filled with those who’ve crossed him politically or sought to hold him accountable for his attempt to overturn his 2020 election loss and his role in the storming of the Capitol on Jan. 6, 2021. Fauci spoke to ABC.",
      "publishedAt": "2025-01-20T12:13:18Z",
      "title": "Biden pardons Fauci, Milley, and members of the Jan. 6 committee",
      "url": "https://apnews.com/article/biden-trump-fauci-milley-pardons-january-6-3cba287f89051513fb48d7ae700ae747",
      "urlToImage": "https://dims.apnews.com/dims4/default/92e0ad2/2147483647/strip/true/crop/5647x3176+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2Fa8%2F654c69a432ed6eb6cfebe318e280%2Ffcf24b94e060459ea4889bcaea1b6082"
    },
    {
      "author": "MATTHEW LEE",
      "description": "A large number of senior career diplomats who served in politically appointed top leadership positions at the State Department have left their posts at the demand of the incoming Trump administration, which plans to install its own people in those positions. That's according to current and outgoing U.S. officials. Personnel changes in the senior ranks of the department are not uncommon after a presidential election. And career officials serving in those roles are required to submit letters of resignation before an incoming administration takes office. In the past, some of those resignations have not been accepted, allowing career officials to remain in their posts at least temporarily until the new president can nominate his team. That offers some degree of continuity.",
      "publishedAt": "2025-01-20T18:55:29Z",
      "title": "A wave of Trump-demanded departures hits senior leadership at the State Department",
      "url": "https://apnews.com/article/trump-state-department-rubio-d6c2cb864852c32b144101eb38150d29",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f02a50/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fb3%2F721ed9d6223b0b7763f333146a57%2Ff44d32c367fa440e973ed1aab6bc3d79"
    },
    {
      "author": "SAMY MAGDY, JOSEPH KRAUSS",
      "description": "As a ceasefire brought calm to Gaza’s ruined cities, Hamas was quick to emerge from hiding. The militant group has not only survived Israel’s 15-month military campaign — among the deadliest and most destructive in recent memory — but it remains firmly in control of the coastal territory that now resembles an apocalyptic wasteland. For all the might it deployed in Gaza, Israel failed to remove Hamas from power, one of its central war aims. That makes a return to fighting more likely, but the results might be the same.",
      "publishedAt": "2025-01-20T16:46:40Z",
      "title": "Hamas still rules over what remains of Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-militants-rule-93da074c251d0fcaa395503749e2849e",
      "urlToImage": "https://dims.apnews.com/dims4/default/343cfee/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2Fb8%2Ff9471cfcbac6a18214bdb2a8539d%2F6ef73c50f2434c91b221a091c1100383"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "Residents across the country from the Northern Plains to the tip of Maine are bracing for dangerously low temperatures as residents along the East Coast contend with a thick blanket of snow — and more snowfall in the forecast. Winter storm warnings are in effect for parts of the Mid-Atlantic and New England. Heavy lake-effect snow is expected in western New York state Monday through Wednesday morning. Meanwhile, an area from the Rockies into the Northern Plains is expected to see temperatures drop unusually low, up to minus 55 degrees Fahrenheit. Sub-zero wind chills are forecast to reach as far south as Oklahoma and the Tennessee Valley.",
      "publishedAt": "2025-01-20T05:17:07Z",
      "title": "Millions across the US brace for plummeting temperatures and winter storms",
      "url": "https://apnews.com/article/extreme-cold-winter-storm-snow-5840ab2626b23dba983bbac7c00390d9",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b453a5/2147483647/strip/true/crop/3568x2007+0+43/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F46%2F7d2d0b9b28ee8f3b7b0d3b57804e%2F4261278bbf3a45a6b31fb25cce1952c5"
    },
    {
      "author": "JILL COLVIN, BARBARA ORTUTAY",
      "description": "During his first term as president, Donald Trump led the effort to ban TikTok, the hugely popular video-sharing site he said posed threats to U.S. national security. But on the eve of his return to the White House, the president-elect is being hailed as the app’s savior. The developments over the weekend served as a reminder of how dramatically debates over technology, social media and national security have changed since Trump was last in the White House. It also signaled how closely Trump is following those shifts after waging a successful campaign in which he made inroads with voters in part by harnessing the appeal of some social media platforms.",
      "publishedAt": "2025-01-20T01:47:37Z",
      "title": "Trump's evolution on TikTok: From backing a ban to being hailed as a savior",
      "url": "https://apnews.com/article/trump-tiktok-ban-da11df6d59c17e2c17eea40c4042386d",
      "urlToImage": "https://dims.apnews.com/dims4/default/7ef3fe3/2147483647/strip/true/crop/5150x2897+0+268/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Fc3%2F1eb1175f6616a32f5efa83bfaf85%2F368baa94a8bb4a2a9e87f988641da384"
    },
    {
      "author": "ZEKE MILLER, CHRIS MEGERIAN, MICHELLE L. PRICE",
      "description": "Donald Trump has been sworn in as the 47th president, returning to power with a promise to end America’s decline and to “completely and totally reverse” the actions of the man who drove him from office four years ago. Trump overcame impeachments, criminal indictments and a pair of assassination attempts to win another term in the White House. He planned to act swiftly after the ceremony. Dozens of executive orders have already been prepared for his signature to clamp down on border crossings, increase fossil fuel development and end diversity and inclusion programs across the federal government.",
      "publishedAt": "2025-01-20T05:06:30Z",
      "title": "Trump returns to power after unprecedented comeback, emboldened to reshape American institutions",
      "url": "https://apnews.com/article/donald-trump-inauguration-swearing-capitol-b3549ebe5dae74a872502aa79def7a11",
      "urlToImage": "https://dims.apnews.com/dims4/default/4cc5770/2147483647/strip/true/crop/7040x3960+0+364/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2Ff4%2F31edaaa5df5a909805ab0ce9e95e%2Fca28e9cb0d534b5b9d1b20c8f0ab7269"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "President Donald Trump's inaugural address was punctuated by several false or misleading claims, many of which he has made before. The Republican vowed to reverse changes made by the outgoing Democratic president, Joe Biden, offering a glimpse of several executive actions to chart a new course for America. But in making a case for his agenda, Trump made false claims in areas including immigration, the economy, electric vehicles and the Panama Canal.",
      "publishedAt": "2025-01-20T19:44:43Z",
      "title": "FACT FOCUS: A look at false and misleading claims Trump made during his inaugural address",
      "url": "https://apnews.com/article/trump-inauguration-fact-check-b920161868e192d0430df534a42ea5ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/18c77b9/2147483647/strip/true/crop/3936x2214+0+209/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2Fb5%2F8f7db6f6525e05e02bb75d93836e%2F4d8be891419b4e42bafcb2a93846bf9d"
    },
    {
      "author": "GISELA SALOMON, SOPHIA TAREEN",
      "description": "For millions in the U.S. illegally or with temporary legal status, the start of Donald Trump’s second term as president comes with a feeling their time in the U.S. may end soon. Trump made mass deportations a signature issue of his campaign and has promised a raft of orders to remake immigration policy when he takes office Monday. Plans for deportation arrests appear to be in flux after news leaked of an operation in Chicago this week. Trump’s “border czar” Tom Homan said on Fox News Sunday that Chicago was not off the table, but officials were reconsidering when and how to conduct enforcement. So-called sanctuary cities such as Chicago, which limit how local police cooperate with federal immigration authorities, have been a favorite Trump target.",
      "publishedAt": "2025-01-20T05:23:58Z",
      "title": "As Trump returns to the White House, families prepare for mass deportations",
      "url": "https://apnews.com/article/trump-deportation-immigration-homan-asylum-inauguration-ac10480dc636b758ab3c435b974aeb19",
      "urlToImage": "https://dims.apnews.com/dims4/default/371c6b7/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcb%2F54%2F32d72acb57b1059cde5885752880%2Fa064e4d4571f465daa90f052618d710a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}