{
  "articles": [
    {
      "author": "SAM METZ and MOSA'AB ElSHAMY",
      "description": "MARRAKECH, Morocco (AP) — A rare, powerful earthquake struck Morocco late Friday night, killing more than 800 people and damaging buildings from villages in the Atlas Mountains to the historic city of Marrakech.",
      "publishedAt": "2023-09-08T23:08:13Z",
      "title": "Powerful quake in Morocco kills more than 800 people and damages historic buildings in Marrakech",
      "url": "https://apnews.com/7f4a503009dede0dec0208c08d6b100b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3feb8dfdf6e94276b25362e553fe88e8/3000.jpeg"
    },
    {
      "author": "ADAM SCHRECK and DAVID RISING",
      "description": "NEW DELHI (AP) — The Group of 20 top world economies welcomed the African Union as a member at their annual summit Saturday, but their wording on the contentious issue of Russia's war in Ukraine was limited to a call to avoid forcefully seizing territory or using nuclear weapons.",
      "publishedAt": "2023-09-09T03:38:06Z",
      "title": "G20 adds the African Union as a member, issues call rejecting use of force in reference to Ukraine",
      "url": "https://apnews.com/f0054ecaea54f53d4ceb0c64a4457620",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57318f25b3c34748992b3306ed0eabc6/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and JOSH BOAK",
      "description": "NEW DELHI (AP) — President Joe Biden and his allies on Saturday were to outline plans for a rail and shipping corridor that would connect India with the Middle East and ultimately Europe — a possible game changer for global trade to be announced at the Group of 20 summit.",
      "publishedAt": "2023-09-09T03:58:54Z",
      "title": "Biden, Modi and EU to announce rail and shipping project linking India to Middle East and Europe",
      "url": "https://apnews.com/eb8988dfbd6c9c6f2c411c893d548333",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0dfd8a7aa7c4fc98c8571cf86194b37/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY",
      "description": "LONDON (AP) — A former soldier who escaped from a London prison while awaiting trial on terrorism charges was captured Saturday, police said.Daniel Abed Khalife was on the run four days before a massive search managed to nab him in Chiswick in west London.",
      "publishedAt": "2023-09-09T11:05:31Z",
      "title": "UK police catch terrorism suspect who escaped from a London prison",
      "url": "https://apnews.com/76a5d61b07a1cf3cb0df23b8422af828",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d11f5cb8dcb94e4792296fb074116b5a/3000.jpeg"
    },
    {
      "author": "EVELYNE MUSAMBI, FARNOUSH AMIRI, CARA ANNA and ELLEN KNICKMEYER",
      "description": "NAIROBI, Kenya (AP) — The graves at the edge of the orphanage tell a story of despair. The rough planks in the cracked earth are painted with the names of children, most of them dead in the 1990s. That was before the HIV drugs arrived.",
      "publishedAt": "2023-09-09T04:34:49Z",
      "title": "Republican opposition to abortion threatens global HIV/AIDS program that has saved 25 million lives",
      "url": "https://apnews.com/d9ef380acba1a0e96409197b39dea7fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bdf86cca729418597967eba915e3e96/3000.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "NARVA, Estonia (AP) — At the Ivangorod-Narva border crossing, the last glimpse of Russia is of a sprawling fortress and the first sight of Estonia is another fortress on the other bank of a slender river.",
      "publishedAt": "2023-09-09T04:20:47Z",
      "title": "For nearly a quarter century, an AP correspondent watched the Putin era unfold in Russia",
      "url": "https://apnews.com/9efd1c2bc2d9504f82893aa450c7531e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4cead30987204326a2dbb7387387996b/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — New Mexico Gov. Michelle Lujan Grisham on Friday issued an emergency order suspending the right to carry firearms in public across Albuquerque and the surrounding county for at least 30 days in response to a spate of gun violence.",
      "publishedAt": "2023-09-08T23:41:48Z",
      "title": "New Mexico governor issues order suspending the right to carry firearms in public across Albuquerque",
      "url": "https://apnews.com/fc5b4b79bf411b8022c3ad58975724d7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10250869097648b1969425058d4eb873/3000.jpeg"
    },
    {
      "author": "JEFF MARTIN",
      "description": "ATLANTA (AP) — Hurricane Lee is rewriting old rules of meteorology, leaving experts astonished at how rapidly it grew into a goliath Category 5 hurricane.Lee could also be a dreadful harbinger of what is to come as ocean temperatures climb, spawning fast-growing major hurricanes that could threaten communities farther north and farther inland, experts say.",
      "publishedAt": "2023-09-09T04:16:05Z",
      "title": "Hurricane Lee is charting a new course in weather and could signal more monster storms",
      "url": "https://apnews.com/36e45b46071f8b68fd7a83a6d4936a51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffbb5b346d66457da8aa847b251ddad8/3000.jpeg"
    },
    {
      "author": "LAURAN NEERGAARD",
      "description": "WASHINGTON (AP) — Updated COVID-19 vaccines are coming soon, just in time to pair them with flu shots.",
      "publishedAt": "2023-09-09T04:29:29Z",
      "title": "Updated COVID shots are coming. They're part of a trio of vaccines to block fall viruses",
      "url": "https://apnews.com/2a55728638c1c0879ce58deeeb0196bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61d547d06bbb419bb16f1cc8fce3bc18/2945.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — Donald Trump will cross paths with several Republican rivals Saturday when he attends Iowa's in-state college football grudge match, one of the former president's few visits so far to the state that holds the first nominating caucus.",
      "publishedAt": "2023-09-09T04:19:13Z",
      "title": "Trump, DeSantis and other 2024 GOP prospects vie for attention at Iowa-Iowa State football game",
      "url": "https://apnews.com/f398a634ce11048c5e49b207263994c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce9b0ed43f8c42d2a8a4b723c3903c5e/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}