{
  "articles": [
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "The Kremlin says top Russian officials will hold talks with U.S. counterparts on restoring ties, ending the war in Ukraine and preparing a meeting between Russian President Vladimir Putin and U.S. President Donald Trump. Kremlin spokesman Dmitry Peskov says Russian Foreign Minister Sergey Lavrov and Putin’s foreign affairs adviser Yuri Ushakov will fly to the Saudi capital on Monday to take part in the talks set for Tuesday. He said the talks will be primarily focused on “restoring the entire complex of U.S.-Russian relations” as well as organizing possible talks on the Ukrainian settlement and the meeting of the two presidents.",
      "publishedAt": "2025-02-17T10:00:40Z",
      "title": "Top Russian officials will hold talks with US in Saudi Arabia on Tuesday",
      "url": "https://apnews.com/article/russia-ukraine-war-us-saudi-talks-0c7f21c2125c97fd0a1f6459eebeb65b",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe5ce53/2147483647/strip/true/crop/8083x4547+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F3c%2F52734a0c648ad5e8fa772ec9bc1d%2F43f837ab393e4666be58044671b139a9"
    },
    {
      "author": "JON GAMBRELL",
      "description": "Ukrainian President Volodymyr Zelenskyy traveled to the United Arab Emirates late Sunday as momentum grows for potential peace talks ending Moscow’s war on the country. U.S. President Donald Trump last week suggested he would be meeting Russian President Vladimir Putin in Saudi Arabia. The UAE, home to Abu Dhabi and Dubai, long has been floated as a possible site for peace talks as well given the large population of Russian and Ukrainian expatriates who have flooded the country since the war began, and due to the Emirates’ work on prisoner exchanges in the past.",
      "publishedAt": "2025-02-17T02:16:25Z",
      "title": "Russia-Ukraine war: Zelenskyy in UAE as momentum grows for peace talks",
      "url": "https://apnews.com/article/uae-russia-ukraine-war-a09b2fc2d81276551f40d89383a348c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/a6dee21/2147483647/strip/true/crop/5400x3038+0+446/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbb%2F8e%2Fe90a655c67746f1bd6b1081141b0%2F8afbf2688afe42c78a1c89976bf43583"
    },
    {
      "author": "RAF CASERT, SYLVIE CORBET",
      "description": "French President Emmanuel Macron has called leaders from key European Union nations and the United Kingdom to his ornate Elysee Palace for an emergency meeting Monday. He wants to discuss how to deal with the Trump administration and step up plans to increase defense spending. The European leaders have been stunned by a weeklong diplomatic blitz on Ukraine from the Trump administration that seemed to embrace the Kremlin while it cold-shouldered many of its age-old European allies. There were belligerent warnings ahead of Donald Trump’s reelection as U.S. president. But EU leaders publicly ignored the ominous forebodings and somehow hoped Trump would stand side by side with Europe.",
      "publishedAt": "2025-02-17T05:08:58Z",
      "title": "European leaders regroup in Paris for strategy huddle after Trump diplomatic blitz on Ukraine",
      "url": "https://apnews.com/article/eu-europe-ukraine-nato-security-summit-trump-060c8661c59f8f75b96711d3889ce559",
      "urlToImage": "https://dims.apnews.com/dims4/default/0326f74/2147483647/strip/true/crop/2998x1686+0+109/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F89%2F01bca9984397477a3b194409ba48%2F1d86402c1c3b4832bd453699e7e38230"
    },
    {
      "author": "EMMA BURROWS",
      "description": "Ukrainian President Volodymyr Zelenskyy says he directed his ministers not to sign off on a proposed agreement to give the United States access to Ukraine’s rare earth minerals because the document was too focused on U.S. interests. The proposal, which was a key part of Zelenskyy’s talks with U.S. Vice President JD Vance on the sidelines of the Munich Security Conference on Friday, did not offer any specific security guarantees in return. That's according to one current and one former senior official familiar with the talks. Zelenskyy’s decision not to sign a deal, at least for now, was described as “short-sighted” by a senior White House official.",
      "publishedAt": "2025-02-16T05:11:08Z",
      "title": "Zelenskyy declines to accept US proposal to access Ukraine's minerals",
      "url": "https://apnews.com/article/ukraine-us-zelenskyy-agreement-trump-minerals-4d5eefcc44c9f17f330db98d81720b29",
      "urlToImage": "https://dims.apnews.com/dims4/default/fe5ce53/2147483647/strip/true/crop/8083x4547+0+421/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F3c%2F52734a0c648ad5e8fa772ec9bc1d%2F43f837ab393e4666be58044671b139a9"
    },
    {
      "author": null,
      "description": "In an exchange with reporters Sunday, Trump said Ukrainian President Volodymyr Zelenskyy “will be involved” in the negotiations. Trump offered no further explanation.",
      "publishedAt": "2025-02-17T00:05:00Z",
      "title": "Trump comments on Zelenskyy's role in Russia-Ukraine peace negotiations",
      "url": "https://apnews.com/video/ukraine-and-europe-worry-about-being-sidelined-as-trump-pushes-for-direct-talks-with-russia-on-wars-end-2fcd53ca888b4c6ebb7688805c2fb38d",
      "urlToImage": "https://dims.apnews.com/dims4/default/6993a77/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F50%2Fae4478f89822240db584cdf134c3%2Fus-fl-trump-ukraine-putin-20250216cr-1920x1080.jpg"
    },
    {
      "author": null,
      "description": "An anti-settlement watchdog says Israel has issued tenders for the construction of nearly 1,000 additional settler homes in the occupied West Bank. Peace Now said Monday the development would allow the population of the Efrat settlement to expand by 40% and further block the development of the nearby Palestinian city of Bethlehem. Construction could begin as soon as next year. Israel captured the West Bank, along with the Gaza Strip and east Jerusalem, in the 1967 Mideast war. The Palestinians want all three territories for their future state and view the settlements as a major obstacle to peace, a position with wide international support.",
      "publishedAt": "2025-02-17T07:21:29Z",
      "title": "Watchdog says Israel is advancing plans for nearly 1,000 more settler homes in West Bank",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-02-17-2025-c20c9664938b267354c9ac4812621a1e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b9f2a88/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2F89%2F3ee52a3c87ec8c206aac47d7c039%2F8ca264427bc64204ba731da970e563a6"
    },
    {
      "author": "DAVID MCHUGH",
      "description": "Germany needs a new business model to get its stalled economy going again. Delivering that fresh growth strategy is going to be the biggest challenge for the government that takes office after a snap national election set for Feb. 23. The nation that became known for the quality of its products has not seen real economic growth for five years. Business leaders complain about a shortage of skilled workers, too much bureaucracy and a lack of infrastructure upgrades. Rising competition from China and high energy prices due to Russia’s war in Ukraine also have left Europe’s biggest economy mired in stagnation and angst about the future.",
      "publishedAt": "2025-02-17T06:04:56Z",
      "title": "Fixing Germany's economy is a critical task for the country's next government",
      "url": "https://apnews.com/article/germany-election-government-economy-4248f25f322cb8bef2aebfdeb7664ae7",
      "urlToImage": "https://dims.apnews.com/dims4/default/dae13b3/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2Faa%2Fe44063f5ead2b0af2ad6310f7695%2Ff26d89f954a7464f900984748c8eb07c"
    },
    {
      "author": "MOGOMOTSI MAGOME",
      "description": "In the rural villages of South Africa, U.S. President Donald Trump’s sudden freeze on foreign aid impacts hundreds of thousands of HIV patients. The freeze has affected the President’s Emergency Plan for AIDS Relief, or PEPFAR, which annually contributes more than $400 million to South Africa’s various HIV programs and non-governmental organizations. That's about 17% of the total funding. NGOs worry about patients defaulting on treatment, infection rates going up and eventually a rise in deaths. Last week, a federal judge ordered the Trump administration to temporarily lift the funding freeze while the U.S. Embassy in South Africa said PEPFAR projects would resume under a limited waiver. But many aid groups have already shut down.",
      "publishedAt": "2025-02-16T19:53:49Z",
      "title": "South African NGOs worry Trump's aid freeze will impact HIV treatment",
      "url": "https://apnews.com/article/south-africa-trump-pepfar-hiv-aid-freeze-0d9def2a63b0e2f53bfda9441baf584d",
      "urlToImage": "https://dims.apnews.com/dims4/default/6b90c7b/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F99%2F513cc70bae124e8c01f2e581f2a1%2F6758f70c01ef4df19451b368123e47c9"
    },
    {
      "author": null,
      "description": "Harsh weather moved west as a polar vortex was expected to grip the Rockies and the northern Plains after winter storms pummeled the eastern U.S. over the weekend, killing at least 10 people, including nine victims in Kentucky who died during flooding from heavy rains. The National Weather Service warned of “life-threatening cold” into Tuesday, with temperatures in northeastern Montana predicted to dip as low as 45 degrees below zero. Weather forces in the Arctic are combining to push the chilly air that usually stays near the North Pole into the U.S. and Europe. In Kentucky, Gov. Andy Beshear said Sunday that at least 1,000 people stranded by floods had to be rescued.",
      "publishedAt": "2025-02-17T05:06:38Z",
      "title": "'Life-threatening cold' expected as polar vortex stretches across U.S. after deadly weekend flooding",
      "url": "https://apnews.com/article/winter-weather-60715bce197e1668e9a225801acc967e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8611fdd/2147483647/strip/true/crop/4121x2318+388+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2F8d%2Fbbfb6be65d6a1ecc61220effcc10%2F328368f4eeb14f4385a0727faeaf2a3b"
    },
    {
      "author": null,
      "description": "China’s Foreign Ministry has taken issue with a revised U.S. government fact sheet that removed a line on American opposition to independence for Taiwan. A ministry spokesperson said the U.S. has “gravely backpedaled” on its position on Taiwan and sent the wrong message to “separatist forces” on the island. Taiwan and China split in 1949 during the civil war that brought the communists to power in China. Taiwan has its own government and military but has never declared formal independence from China. The U.S. State Department removed the phrase “we do not support Taiwan independence” from the fact sheet last week.",
      "publishedAt": "2025-02-17T09:08:14Z",
      "title": "China says US has 'gravely backpedaled' on Taiwan",
      "url": "https://apnews.com/article/china-taiwan-us-statement-independence-8374f7675d25a747f00364617b1bc970",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1b8286/2147483647/strip/true/crop/5000x2813+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fe5%2F419fffc63f001f77d056ae92512e%2Fd3e8b7ab2e8649429c624ec74bd7446d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}