{
  "articles": [
    {
      "author": "Seung Min Kim",
      "description": "President Donald Trump has floated cutting tariffs on China from 145% to 80% ahead of a weekend meeting as he looks to deescalate the trade war. Top U.S. officials are set to meet with a high-level Chinese delegation in Switzerland in the first major talks between the two nations since Trump sparked a trade war with stiff tariffs on imports. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson Greer will meet with their counterparts in Geneva in the most-senior known conversations between the two countries in months. It comes amid growing U.S. market worry over the impact of the tariffs on the prices and supply of consumer goods.",
      "publishedAt": "2025-05-09T11:39:51Z",
      "title": "Trump floats cutting China tariffs to 80% ahead of meeting",
      "url": "https://apnews.com/article/trump-tariffs-china-41d189bfe510e3ed7692da8647a14e64",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c358f6/2147483647/strip/true/crop/5858x3295+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F63%2F5642ecbdae186798c3b77fc70415%2F20c88dc7dbae4c338f80acb05908381d"
    },
    {
      "author": "Nicole Winfield",
      "description": "Pope Leo XIV will celebrate his first Mass after his historic election as the first North American pope. He will meet on Friday with the cardinals who chose him to lead the Catholic Church and follow in Pope Francis’ reform-minded footsteps. Leo, the Chicago-born Augustinian missionary Robert Prevost, surprised the world on Thursday when he emerged on the loggia of St. Peter’s Basilica, since there had long been a taboo against a pope from the United States. He spoke to the crowd in Italian and Spanish, but not English, and honored Pope Francis for his final salute to the crowd on Easter Sunday.",
      "publishedAt": "2025-05-09T05:00:24Z",
      "title": "Pope Leo XIV celebrates first Mass as Francis' successor",
      "url": "https://apnews.com/article/vatican-pope-prevost-leo-cardinals-1c1752bacc935c02af5f839a05de9a39",
      "urlToImage": "https://dims.apnews.com/dims4/default/c5a2ace/2147483647/strip/true/crop/4000x2250+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2d%2F9f%2Febbfc2d8cc573d37091e642f4be5%2F9bc7f431112d4b6eb0cb9c3ae6a2e274"
    },
    {
      "author": "Obed Lamy, Hallie Golden",
      "description": "When white smoke poured out of the Sistine Chapel revealing that a new pope had been chosen, John Prevost turned on his television in Illinois and watched in awe as his brother’s name was announced. He said Thursday that he was in “disbelief” and then felt an incredible sense of pride that his brother, Cardinal Robert Prevost, had become the 267th pontiff to lead the Catholic Church, taking the name Leo XIV. That makes the Chicago-born missionary the first U.S. pope. John Prevost described his brother as being very concerned for the poor and those who don’t have a voice. He said he expects him to be a “second Pope Francis.”",
      "publishedAt": "2025-05-09T05:00:19Z",
      "title": "Leo XIV's brother recalls feeling of 'disbelief' over his sibling becoming pope",
      "url": "https://apnews.com/article/pope-leo-xiv-brother-john-prevost-631d38eeef66ea85ab905b204c61d799",
      "urlToImage": "https://dims.apnews.com/dims4/default/8dfb4f1/2147483647/strip/true/crop/2543x1430+0+133/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F20%2F7129faca13ee341526dc8d0d55ab%2Fe8771a49602d4906b316928ff41624aa"
    },
    {
      "author": "Josh Funk",
      "description": "The air traffic controllers directing planes into the Newark, New Jersey, airport lost their radar Friday morning for the second time in two weeks. The Federal Aviation Administration said the radar at the facility in Philadelphia that directs planes in and out of Newark airport went black for 90 seconds at 3:55 a.m. Friday. That’s similar to what happened on April 28. That first radar outage led to hundreds of flights being cancelled or delayed at the Newark airport in the past two weeks after the FAA slowed down traffic at the airport to ensure safety.",
      "publishedAt": "2025-05-09T15:41:58Z",
      "title": "Air traffic controllers briefly lose radar access again at Newark airport",
      "url": "https://apnews.com/article/newark-airport-radar-outage-c41c772690e710b39412cd02c83819f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/4b48945/2147483647/strip/true/crop/7627x4290+0+397/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F12%2Fc3%2F345a4631cd274fff782f78d2ca93%2Fb53aa00bbd10403480706729030a7eb8"
    },
    {
      "author": "Mark Sherman",
      "description": "Retired Supreme Court Justice David H. Souter has died at age 85. The ascetic bachelor and New Hampshire Republican became a darling of liberals during his nearly 20 years on the bench. The court says Souter died Thursday at his home in New Hampshire. He retired from the court in June 2009, giving President Barack Obama his first Supreme Court vacancy to fill. Obama chose Sonia Sotomayor, the court’s first Latina justice. Souter was appointed by Republican President George H.W. Bush in 1990. He was a reliably liberal vote on abortion, church-state relations, freedom of expression and the accessibility of federal courts.",
      "publishedAt": "2025-05-09T13:11:37Z",
      "title": "Supreme Court says retired Justice David Souter has died at age 85",
      "url": "https://apnews.com/article/supreme-court-justice-david-souter-dies-8cf552b7322297b03ef8c251a6a11d13",
      "urlToImage": "https://dims.apnews.com/dims4/default/836940d/2147483647/strip/true/crop/2000x1125+0+148/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2Fcc%2F31dd14556d506714e2c0b6589e5f%2F00c9d83b66484a5a8065e907fb6dc532"
    },
    {
      "author": "Anne D'Innocenzio, Didi Tang",
      "description": "Toy dolls have become the latest rhetorical poster child for President Donald Trump's tariffs crusade. Trump asserted that children will be fine having two or three dolls instead of 30 if U.S. import taxes increase consumer prices. The response on social media included memes of him portrayed as the Grinch. The president’s comments also touched a nerve with parents who acknowledged their own kids have more toys than they need. Either way, the U.S. toy industry has a lot riding on a possible deescalation of the administration's trade standoff with China, which produces most of America's playthings. Some smaller importers say they won't have enough holiday inventory without a reprieve in the next two weeks.",
      "publishedAt": "2025-05-09T17:21:25Z",
      "title": "Two dolls instead of 30? Toys become the latest symbol of Trump's trade war",
      "url": "https://apnews.com/article/trump-two-dolls-tariffs-toys-7b0e5d3a9035471317e6dc4ee1fbfbc1",
      "urlToImage": "https://dims.apnews.com/dims4/default/b342540/2147483647/strip/true/crop/4458x2508+0+199/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2Ff7%2F2f25d1e85a93a49caa40f0ae7fba%2F3d06d0fb30a6424eabc037ad7ed7acec"
    },
    {
      "author": "Michael R. Sisak, Jennifer Peltz",
      "description": "Harvey Weinstein’s lawyers are seeking to raise doubts about a former model’s allegation that he repeatedly sexually assaulted her when she was a teenager. Defense lawyer Mike Cibella began questioning Kaja Sokola on Friday at Weinstein's retrial. Among other things, Cibella pointed to differences in the details of her testimony this week and what she told a grand jury last year. Weinstein is facing charges including a criminal sex act count that's based on Sokola's allegation that he forced oral sex on her in 2006, when she was 19. Weinstein has pleaded not guilty and denies ever sexually assaulting anyone.",
      "publishedAt": "2025-05-09T16:14:23Z",
      "title": "Defense begins quizzing ex-model who accuses Harvey Weinstein of sex assaults during her teens",
      "url": "https://apnews.com/article/harvey-weinstein-metoo-sexual-assault-retrial-04d10a44cc4b5e027b0c95d0634a8101",
      "urlToImage": "https://dims.apnews.com/dims4/default/a3b1180/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2F7e%2Ff17a495e5ade16347cf1685edd40%2F5a1f398bad2d4f8e9bba79674504c321"
    },
    {
      "author": "Christina Larson",
      "description": "A new study shows that chimpanzees drum with regular rhythm when they beat on tree trunks. Previous research has shown that chimps have their own signature drumming style. A new analysis of 371 bouts of chimpanzee drumming demonstrates that the chimps clearly play their instruments -- the tree trunks -- with regular rhythms. This suggests that the ability to produce rhythm predates the last common ancestor of humans and chimpanzees, dating back more than 6 million years. Scientists believe that the drumming is a form of long-distance communication. The research was published Friday in the journal Current Biology.",
      "publishedAt": "2025-05-09T15:01:40Z",
      "title": "Chimpanzees drum with regular rhythm when they beat on tree trunks, a form of ancient communication",
      "url": "https://apnews.com/article/chimpanzee-drumming-rhythm-238c1337b8e73055664a455e05efdf42",
      "urlToImage": "https://dims.apnews.com/dims4/default/7800836/2147483647/strip/true/crop/5782x3252+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2Ffb%2Fffa1362cafc839904e306ebf3637%2F71808967342447428d1038a81ec6b761"
    },
    {
      "author": "Megan Janetsky",
      "description": "Vaccination teams are part of an effort by health authorities across Mexico to contain the country’s biggest measles outbreak in decades. Cases are climbing not only in Mexico, but in the U.S. and Canada. Mexico's cases have been concentrated in the Mennonite community in the northern border state of Chihuahua. It's a community long skeptical of vaccines and distrustful of authorities. Officials say results of the campaign alongside Mennonite leaders are mixed. They cite tens of thousands of vaccinations in Chihuahua. But infections have ballooned, spreading past the community to Indigenous and other populations. Vaccination teams say door-to-door efforts are helping, even if not everyone is open to the shot. Some ask questions and follow up later. Others won't even open the door.",
      "publishedAt": "2025-05-09T05:10:51Z",
      "title": "In Mexico's measles outbreak, Mennonites face vaccine misinformation",
      "url": "https://apnews.com/article/mexico-measles-vaccines-misinformation-mmr-mennonites-misinformation-ea6158b9a4d513b20f33cbc09034e5c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/1464010/2147483647/strip/true/crop/5159x2902+0+269/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2F7c%2F115dd305ec231e3fca875ee5cafb%2F28cf2a2f53194d4aade1d8f86e3e1a97"
    },
    {
      "author": "Sara Cline, Stephen Smith",
      "description": "Two years after a Louisiana mother donated her kidney to her daughter, the duo graduated together from nursing school. Ambrealle Brown was forced to put her dreams of becoming a nurse on hold after being bedridden during dialysis to address a life-threatening kidney disease. Her mother, Nija Bulter, stepped in and donated one of her healthy kidneys. The two both attended nursing school in Baton Rouge together following the surgery. They both graduated with their registered nurse licenses last month.",
      "publishedAt": "2025-05-09T04:05:32Z",
      "title": "Daughter says mom 'gave me life twice' with kidney donation as pair graduate nursing school together",
      "url": "https://apnews.com/article/mother-daughter-kidney-transplant-nursing-louisiana-b6326dffe1fb0d84b41cd9a3c12c9604",
      "urlToImage": "https://dims.apnews.com/dims4/default/08a4ec6/2147483647/strip/true/crop/3024x1701+0+158/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4f%2F19%2F283b1fe0d7d46974795bb6917d3b%2F9dbd40a3395143a2ab6f99235ca90297"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}