{
  "articles": [
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli troops and Hamas gunmen battled Saturday outside Gaza 's largest hospital where frantic doctors said the last generator had run out of fuel, causing the death of a premature baby and four other patients.",
      "publishedAt": "2023-11-11T08:29:24Z",
      "title": "Gaza's main hospital goes dark in intense fighting as Israel's attacks put it at odds with allies",
      "url": "https://apnews.com/d4d272416107c02e63dabd9548395026",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76d06304e89944b38b3e9b57257e6195/1920.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — Pro-Palestinian demonstrators marched peacefully through central London on Saturday, even as right-wing counter-protesters clashed with police, after a week of angry debate over whether to permit the event on a day when Britain honored its war dead.",
      "publishedAt": "2023-11-11T11:13:02Z",
      "title": "London pro-Palestinian march passes off peacefully but police clash with far-right protesters",
      "url": "https://apnews.com/e57e2ec31af2fab16660161e5ed85ae8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1783ee943ed64badbde836847a246e71/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN, ALAN SUDERMAN and CHRIS MEGERIAN",
      "description": "ELLWOOD CITY, Pa. (AP) — When a health care startup dreamed of building a network of rural hospitals several years ago, it turned to Jim Biden.",
      "publishedAt": "2023-11-11T05:16:26Z",
      "title": "Jim Biden's last name has helped open doors. It also has made him a target of House Republicans",
      "url": "https://apnews.com/7a64c5e577787308090f9503ec80adb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/76a5f342c7094ffba90d035c301142c8/1560.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis on Saturday forcibly removed the bishop of Tyler, Texas, a conservative prelate active on social media who has been a fierce critic of the pontiff and has come to symbolize the polarization within the U.S.",
      "publishedAt": "2023-11-11T11:36:40Z",
      "title": "Pope forcibly removes a leading US conservative, Texas bishop Strickland",
      "url": "https://apnews.com/0f9f0be7d5938b36d6e7ead8c33e5150",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b360e6b7a29b489682a46119e031b702/2000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER",
      "description": "Donald Trump is pushing for his federal election interference trial in Washington to be televised, joining media outlets that say the American public should be able to watch the historic case unfold.",
      "publishedAt": "2023-11-11T14:23:00Z",
      "title": "Trump joins media outlets in pushing for his federal election interference case to be televised",
      "url": "https://apnews.com/60d4d87c4123b8bc4741a62364e988b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0ec973a64c448ca9a3b7b51ccceb3ae/3000.jpeg"
    },
    {
      "author": "R.J. RICO",
      "description": "ATLANTA (AP) — Along a busy Atlanta residential road, a 68-year-old Vietnam War-era Army veteran has found what he calls a \"match made in heaven.” Harold Tilson Jr. found himself homeless earlier this year but for the past few months has been living in transitional housing run by the nonprofit Veterans Empowerment Organization, or VEO.",
      "publishedAt": "2023-11-11T05:06:09Z",
      "title": "Nonprofits making progress in tackling homelessness among veterans, but challenges remain",
      "url": "https://apnews.com/f3678eae4f03f5be8054181caff9f0af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3880b1ed27e144309a8b08cb768b6621/1920.jpeg"
    },
    {
      "author": "JIM GOMEZ AND JOEAL CALUPITAN",
      "description": "ABOARD THE BRP CABRA (AP) — As a U.S. Navy surveillance plane flew in circles, keeping a close watch, dozens of Chinese coast guard and accompanying ships chased and encircled Philippine vessels in the latest confrontation in one of the most dangerous flashpoints in the South China Sea.",
      "publishedAt": "2023-11-11T13:56:15Z",
      "title": "Dozens of Chinese ships chase Philippine vessels as US renews warning it will defend its treaty ally",
      "url": "https://apnews.com/f702d9b9b84f9019083fb4d530fdf970",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8dd6bf93c904bbe945b8b678441ca24/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "The popular weight-loss drug Wegovy reduced the risk of serious heart problems by 20% in a large, international study that experts say could change the way doctors treat certain heart patients.The research is the first to document that an obesity medication can not only pare pounds, but also safely prevent a heart attack, stroke or a heart-related death in people who already have heart disease — but not diabetes.",
      "publishedAt": "2023-11-11T13:30:26Z",
      "title": "Obesity drug Wegovy cut risk of serious heart problems by 20%, study finds",
      "url": "https://apnews.com/8721279813feabce46ac0cb9cd600a59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/74475a96bb264040b266f2e2fb4ac152/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT and DIDI TANG",
      "description": "WASHINGTON (AP) — When President Joe Biden meets Chinese leader Xi Jinping on Wednesday, there will be no such thing as a small detail.How they greet?",
      "publishedAt": "2023-11-11T05:08:58Z",
      "title": "Biden and Xi are set to meet next week at the APEC summit. No detail is too small to sweat",
      "url": "https://apnews.com/171051514458fbce3b83ed959c80b8cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5c63e93d96b4de1be3f8f95fd277248/3000.jpeg"
    },
    {
      "author": "MELINA WALLING, AMANDA LOMAN and BROOKE HERBERT",
      "description": "MOUNT ANGEL, Ore. (AP) — On a bright day this fall, tractors crisscrossed Gayle Goschie's farm about an hour outside Portland, Oregon. Goschie is in the beer business — a fourth-generation hops farmer.",
      "publishedAt": "2023-11-11T12:15:33Z",
      "title": "How researchers, farmers and brewers want to safeguard beer against climate change",
      "url": "https://apnews.com/b0e752c96c2bf160927e76bd604ce14a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/87d614cbc9004c568986e25ea91d5b8f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}