{
  "articles": [
    {
      "author": "JOCELYN GECKER",
      "description": "WESTPORT, Conn. (AP) — Kate Bulkeley's pledge to stay off social media in high school worked at first. She watched the benefits pile up: She was getting excellent grades. She read lots of books. The family had lively conversations around the dinner table and gathered for movie nights on weekends.",
      "publishedAt": "2024-06-05T04:22:41Z",
      "title": "Life as a teen without social media isn't easy. These families are navigating adolescence offline",
      "url": "https://apnews.com/e32f82d46ea74b807c9099d61aec25d5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d0ea1775f0eb4c4e9666f41a03fd9743/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAM MEDNICK and JACK JEFFREY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel on Saturday carried out its largest hostage rescue operation since the latest war with Hamas began, taking four to safety out of central Gaza amid the military's heavy air and ground assault.",
      "publishedAt": "2024-06-08T10:46:01Z",
      "title": "Israel rescues 4 hostages taken in Hamas' Oct. 7 attack. At least 94 Palestinians are killed",
      "url": "https://apnews.com/a5d1ef04763a5ed17de2d050ebc5d490",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b6e4d510eb964a2cbcb33f3e77b431d6/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, ZEKE MILLER and SYLVIE CORBET",
      "description": "PARIS (AP) — President Joe Biden said France was America's “first friend” at its founding and is one of its closest allies more than two centuries later as he was honored with a state visit Saturday by French President Emmanuel Macron aimed at showing off their partnership on global security issues and easing past trade tensions.",
      "publishedAt": "2024-06-08T04:00:47Z",
      "title": "Biden calls France 'our first friend' and enduring ally as he's honored by Macron with a state visit",
      "url": "https://apnews.com/0c46f64738ecfcbb45e624e9dd226d9f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/112a5746a2db47f5b582456b2e7b9cd9/1920.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, MICHAEL KUNZELMAN, RANDALL CHASE and ALANNA DURKIN RICHER",
      "description": "WILMINGTON, Del. (AP) — Pictures of President Joe Biden's son with drug paraphernalia and bare-chested in a bubble bath. Text messages between Hunter Biden and drug dealers.",
      "publishedAt": "2024-06-08T14:42:25Z",
      "title": "Takeaways from Hunter Biden's gun trial: His family turns out as his own words are used against him",
      "url": "https://apnews.com/a385e245fb4a0f06ad6ee73d38fcd374",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/899311c8db69476eafcd5938b7bfcbfe/1920.jpeg"
    },
    {
      "author": "GIADA ZAMPANO, KAREL JANICEK and RAF CASERT",
      "description": "ROME (AP) — Prime Minister Giorgia Meloni joined voters in Italy and a half dozen European Union nations in casting a ballot during the penultimate day of European Union parliamentary elections on Saturday.",
      "publishedAt": "2024-06-08T05:18:35Z",
      "title": "Your time is up, Italy's hard-right leader tells EU center parties as she votes in European election",
      "url": "https://apnews.com/0e7fd468dcbe8c85a6277b2992de9da0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86f5d10e831748a0961e8823700b1c8c/3000.jpeg"
    },
    {
      "author": "DARREN SANDS",
      "description": "CALVERTON, Md. (AP) — The Rev. Matthew L. Watley says it’s not happenstance his suburban Maryland congregation, part of the historically Black African Methodist Episcopal denomination, landed at the top of a list of the fastest-growing churches in America.",
      "publishedAt": "2024-06-08T12:33:22Z",
      "title": "How this Maryland pastor ended up leading one of the fastest-growing churches in the nation",
      "url": "https://apnews.com/566ac03a1d0aee9fc338d1b3606ceba3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bedf06f534e34d29862546ef25ecfacb/3000.jpeg"
    },
    {
      "author": "CORA LEWIS",
      "description": "NEW YORK (AP) — Seriously overdue credit card debt is at the highest level in more than a decade, and people 35 and under are struggling more than other age groups to pay their bills.",
      "publishedAt": "2024-06-08T14:27:46Z",
      "title": "Credit card delinquencies are rising. Here's what to do if you're at risk",
      "url": "https://apnews.com/c8197a70d38a3c5605f40fc1f4f775bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be114a4664a54db09b0150a3a2f1478d/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "BOSTON (AP) — A soaring demand for food delivered fast has spawned small armies of couriers — and increasing alarm — in big cities where scooters, motorcycles and mopeds zip in and out of traffic and hop onto pedestrian-filled sidewalks as their drivers race to drop off salads and sandwiches.",
      "publishedAt": "2024-06-08T04:10:25Z",
      "title": "Demand for food delivery has skyrocketed. So have complaints about some drivers",
      "url": "https://apnews.com/e35b5667cb7f2140bdc778ca52f59695",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ab0d4cbac8464d44a39d98956d493e1d/1920.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "CARENTAN-LES-MARAIS, France (AP) — Together, the collective age of the bride and groom was nearly 200. But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.",
      "publishedAt": "2024-06-08T11:17:23Z",
      "title": "A World War II veteran just married his bride near Normandy's D-Day beaches. He's 100, she's 96",
      "url": "https://apnews.com/fd4c4d73b87238787fe616719286a561",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/593b0a806fbf4c3badeb027c45561d5a/1920.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "LOS GATOS, Calif. (AP) — Although its video streaming service sparkles with a Hollywood sheen, Netflix still taps its roots in Silicon Valley to stay a step ahead of traditional TV and movie studios.",
      "publishedAt": "2024-06-08T11:40:19Z",
      "title": "Netflix's recipe for success includes 'secret sauce' spiced with Silicon Valley savvy",
      "url": "https://apnews.com/7146b50bc23d72f752f7eba8d3b156e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73e03c4fd48040ee81f9e019f48c7836/2672.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}