{
  "articles": [
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "ATLANTA (AP) — Four months after The Associated Press wrote about an Atlanta family struggling to enroll in school, all of the children — in a complete turnaround — returned to class last month.",
      "publishedAt": "2024-05-06T19:47:47Z",
      "title": "After AP investigation, family of missing students enrolls in school",
      "url": "https://apnews.com/255757b5541bf425c4cfde48961af79e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd5e17af1dff41c09248701278eb32fe/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — Stormy Daniels took the witness stand Tuesday at Donald Trump's hush money trial, describing for jurors a sexual encounter the porn actor says she had with him in 2006 that resulted in her being paid off to keep silent during the presidential race 10 years later.",
      "publishedAt": "2024-05-07T04:02:20Z",
      "title": "Stormy Daniels describes meeting Trump during occasionally graphic testimony in hush money trial",
      "url": "https://apnews.com/d853768fff5fafbdee55623579889140",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73d00a3a59fa49489358d5120a2688cc/1920.jpeg"
    },
    {
      "author": null,
      "description": "NEW YORK (AP) — As the third week of witness testimony in Donald Trump's hush money trial takes place, all eyes are on Stormy Daniels, who took the stand Tuesday morning and recounted for jurors the lead-up to meeting Trump and a 2006 sexual encounter she has said the two engaged in.",
      "publishedAt": "2024-05-07T11:25:20Z",
      "title": "The Latest | Stormy Daniels takes the witness stand in Trump's hush money trial",
      "url": "https://apnews.com/07f27c40c8712594b5488b6de80e84ce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d3fc6fa9f04456aa47fd6f1bd2656bc/2738.jpeg"
    },
    {
      "author": "SAMY MAGDY, MELANIE LIDMAN and LEE KEATH",
      "description": "CAIRO (AP) — Israeli troops seized control of Gaza’s vital Rafah border crossing on Tuesday in what the White House described as a limited operation, as fears mount of a full-scale invasion of the southern city and cease-fire talks with Hamas remain on a knife's edge.",
      "publishedAt": "2024-05-07T05:59:14Z",
      "title": "Israel seizes Gaza's vital Rafah crossing, but the US says it isn't the full invasion many fear",
      "url": "https://apnews.com/113bf4ee5dad87dc5c003d76ed2785bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d35ba44e9f714ab6b88c3d3d8b0406ce/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL, MELANIE LIDMAN and JACK JEFFERY",
      "description": "JERUSALEM (AP) — The Israeli tanks that entered the periphery of Rafah early Tuesday stoked global fears that an offensive on Gaza's southernmost city could endanger the more than a million Palestinian civilians sheltering there.",
      "publishedAt": "2024-05-07T17:28:55Z",
      "title": "Israeli tanks have rolled into Rafah. What does this mean for the Palestinians sheltering there?",
      "url": "https://apnews.com/2f4e37cb3e40560f4980d8a70baaa81e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/456943c1a64341a38bd0e15ba0d60e7d/1920.jpeg"
    },
    {
      "author": "CHARLES REX ARBOGAST, PAT EATON-ROBB and STEVE LeBLANC",
      "description": "CHICAGO (AP) — Police cleared a pro-Palestinian tent encampment at the University of Chicago on Tuesday after administrators who had initially adopted a permissive approach said the protest had crossed a line and caused growing concerns about safety.",
      "publishedAt": "2024-05-07T04:09:26Z",
      "title": "Some colleges that had been permissive of pro-Palestinian protests begin taking a tougher stance",
      "url": "https://apnews.com/9bb8051253c45947509feb32ced78f8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f004579b43224bc2bf19bca2653ef43f/1920.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "IRVING, Texas (AP) — The Boy Scouts of America is changing its name for the first time in its 114-year history and will become Scouting America.",
      "publishedAt": "2024-05-07T15:26:29Z",
      "title": "Boy Scouts of America changing name to more inclusive Scouting America after years of woes",
      "url": "https://apnews.com/d583f5712680f155b4f6b762128734d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f07831a96a414799a3b81589acf4cd6d/3000.jpeg"
    },
    {
      "author": "EMMA BURROWS",
      "description": "President Vladimir Putin began his fifth term at a glittering Kremlin inauguration Tuesday, embarking on another six years as leader of Russia after destroying his political opponents, launching a devastating war in Ukraine and concentrating all power in his hands.",
      "publishedAt": "2024-05-07T04:10:59Z",
      "title": "Putin begins his fifth term as president, more in control of Russia than ever",
      "url": "https://apnews.com/355bd36a2e833800187af848dc24a7dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5eb7718540ec472a85a12717466e08e9/1920.jpeg"
    },
    {
      "author": "MARIA CHENG",
      "description": "ROSEAU, Dominica (AP) — Scientists studying the sperm whales that live around the Caribbean island of Dominica have described for the first time the basic elements of how they might be talking to each other, in an effort that could one day help better protect them.",
      "publishedAt": "2024-05-07T15:01:13Z",
      "title": "Scientists are learning the basic building blocks of sperm whale language after years of effort",
      "url": "https://apnews.com/a94df8e07b129f19917437fcb85e7655",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3a2bc2a454c42558515c501fdbcf6ff/3000.jpeg"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "TikTok and its Chinese parent company ByteDance are suing the U.S. over a law that would ban the popular video-sharing app unless it’s sold to another company, arguing that it violates the First Amendment.",
      "publishedAt": "2024-05-07T16:29:52Z",
      "title": "TikTok sues US to block law that could ban the social media platform",
      "url": "https://apnews.com/3b4c1fa44c89d4568d26f1c7caf303ec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f75dcc53069c4860acf1a9b3163d6e3c/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}