{
  "articles": [
    {
      "author": "NAJIB JOBAIN and KAREEM CHEHAYEB",
      "description": "RAFAH, Gaza Strip (AP) — Israeli troops advanced toward Gaza City on Thursday, as the Palestinian death toll rose above 9,000. With no end in sight after weeks of heavy fighting, U.S.",
      "publishedAt": "2023-11-02T07:17:05Z",
      "title": "Diplomacy to pause fighting and ease siege intensifies as Israeli ground troops advance on Gaza City",
      "url": "https://apnews.com/6a398d4aeba979aef24960efc31eb772",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42593213f82e47c9bbd586e0e739adf0/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — More than 3,600 Palestinian children were killed in the first 25 days of the war between Israel and Hamas, according to Gaza's Hamas-run Health Ministry.",
      "publishedAt": "2023-11-01T21:13:20Z",
      "title": "‘A curse to be a parent in Gaza’: More than 3,600 Palestinian children killed in just 3 weeks of war",
      "url": "https://apnews.com/4a352398b32887e60a658e0270f0a021",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ae5363ee4c1475d9668fa5013587310/1920.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and AAMER MADHANI",
      "description": "MINNEAPOLIS (AP) — President Joe Biden said he thought there should be a humanitarian “pause” in the Israel-Hamas war, after his campaign speech Wednesday evening was interrupted by a protester calling for a cease-fire.",
      "publishedAt": "2023-11-02T01:11:32Z",
      "title": "Biden calls for humanitarian 'pause' in Israel-Hamas war",
      "url": "https://apnews.com/422ed95081e5fe224dd9f0ed7920c4e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b1e1af18137b4403b653c8bed3294a80/2449.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI and NICHOLAS RICCARDI",
      "description": "ST. PAUL, Minn. (AP) — Efforts to use the Constitution’s “insurrection” clause to prevent former President Donald Trump from running again for the White House turn to Minnesota on Thursday with oral arguments before the state Supreme Court, a hearing that will unfold as a similar case plays out in Colorado.",
      "publishedAt": "2023-11-02T04:17:06Z",
      "title": "Court fights to prevent Trump from running again for the White House turn to Minnesota",
      "url": "https://apnews.com/5cb50c1ee6432efe72fd643c31dec474",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e41944794ff84e9c8484441172290553/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump Jr. testified Wednesday that he never worked on his father's financial statements, the documents now at the heart of the civil fraud trial that threatens former President Donald Trump’s real estate empire.",
      "publishedAt": "2023-11-01T04:05:27Z",
      "title": "Donald Trump Jr. testifies he never worked on the key documents in his father's civil fraud trial",
      "url": "https://apnews.com/3ceb1a1d9eefdc9fddec5d04ce813ea4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23b3388064d64611becc3b183e1fde6d/1920.jpeg"
    },
    {
      "author": "JIM HEINTZ",
      "description": "TALLINN, Estonia (AP) — Vladimir Putin isn't quite the man he used to be — more than a decade has passed since the Russian president engaged in public stunts to boast of his vigor by hugging a polar bear or riding a horse barechested in the mountains.",
      "publishedAt": "2023-11-02T04:48:54Z",
      "title": "Putin is expected to seek reelection in Russia, but who would run if he doesn't?",
      "url": "https://apnews.com/58154b1f252908e76083c944efc6828e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/206c3549f8c6404db49d4d5f07d88467/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — Winds up to 180 kilometers per hour (108 mph) slammed France's Atlantic coast overnight as Storm Ciaran lashed countries around western Europe, uprooting trees, blowing out windows and leaving 1.2 million French households without electricity Thursday.",
      "publishedAt": "2023-11-02T08:51:17Z",
      "title": "Storm Ciaran whips western Europe, blowing record winds in France and leaving millions without power",
      "url": "https://apnews.com/61b722101874e7f0610961c03c509229",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/950c88c484ec4dfbb3be7c24d578103b/3000.jpeg"
    },
    {
      "author": "DEVI SHASTRI",
      "description": "All the chairs in the waiting room were filled by dozens of newly arrived migrants waiting to be seen by a Cook County health worker at a clinic in Chicago. Julio Figuera, 43, was among them.He didn’t want to talk much about traveling to Chicago from Venezuela, where a social, political and economic crisis has pushed millions into poverty and led 7 million to flee, Figuera and three of his kids included.",
      "publishedAt": "2023-11-02T08:03:41Z",
      "title": "Migrants in cities across the US may need medical care. It's not that easy to find",
      "url": "https://apnews.com/79353b08f07933f66961a7f07cf3e397",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/981b275f48a54328ba5ac91494a4b8bc/3000.jpeg"
    },
    {
      "author": "BIANCA VÁZQUEZ TONESS",
      "description": "LOS ANGELES (AP) — This was the summer Deneffy Sánchez was supposed to learn algebra, biology and the other ninth grade classes he failed last year because he was too depressed and overwhelmed. But advancing to 10th grade had to take a back seat for now.",
      "publishedAt": "2023-11-02T04:15:07Z",
      "title": "At 15, he is defending his home and parenting his sister. One young man's struggle to stay in school",
      "url": "https://apnews.com/4187c5ad288be91683550d085f8d5035",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/27071fc2cd8d4542844ee06967b45101/3000.jpeg"
    },
    {
      "author": "DAVID BRANDT",
      "description": "PHOENIX (AP) — Corey Seager took a mighty swing and barely connected, sending a squibber through an open area on the left side of the infield for his team's first hit in the seventh inning.The Texas Rangers shortstop and World Series MVP provided plenty of power throughout a stellar October run.",
      "publishedAt": "2023-11-02T03:05:39Z",
      "title": "Texas Rangers win first World Series title with 5-0 victory over Arizona Diamondbacks in Game 5",
      "url": "https://apnews.com/c7ad4ecac587ddece819faf6475a539c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad7887003fe24d90a9d4dcfff3c49220/2390.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}