{
  "articles": [
    {
      "author": "GARY FIELDS",
      "description": "WASHINGTON (AP) — Concern for U.S. democracy amid deep national polarization has prompted the entities supporting 13 presidential libraries dating back to Herbert Hoover to call for a recommitment to the country's bedrock principles, including the rule of law and respecting a diversity of beliefs.",
      "publishedAt": "2023-09-07T10:30:56Z",
      "title": "Presidential centers from Hoover to Bush and Obama unite to warn of fragile state of US democracy",
      "url": "https://apnews.com/5530a89df2c41d58a22961f63fb0e6ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e63a655697a4786b2734c5e699d96d6/3000.jpeg"
    },
    {
      "author": "FABIOLA SÁNCHEZ and MEGAN JANETSKY",
      "description": "MEXICO CITY (AP) — A Mexican Supreme Court decision to end the federal ban on abortion extended a regional trend of increasing access to the procedure, but left in place a patchwork of varying state restrictions.",
      "publishedAt": "2023-09-07T04:54:02Z",
      "title": "Mexico ends its federal ban on abortion, but a patchwork of state restrictions remains",
      "url": "https://apnews.com/82cd9798abe91106fda1e7afddf91c34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a25134fcd80f43bdad6f128e5a791e6f/3000.jpeg"
    },
    {
      "author": "MSTYSLAV CHERNOV",
      "description": "KOSTIANTYNIVKA, Ukraine (AP) — The Russian missile that struck Wednesday in eastern Ukraine turned an outdoor market into a fiery, blackened ruin where weeping civilians looked for loved ones among the mangled, burned bodies scattered across the ground.",
      "publishedAt": "2023-09-06T16:35:58Z",
      "title": "Russian missile turns Ukrainian market into fiery, blackened ruin strewn with bodies",
      "url": "https://apnews.com/6c1545768d77d927a5cda148fc197e3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8534ca8eb89485c85527b7bce22baf4/3000.jpeg"
    },
    {
      "author": "DAVID RISING",
      "description": "NEW DELHI (AP) — Indian Prime Minister Narendra Modi says his country is “becoming the voice of the Global South,” and that at the upcoming Group of 20 meetings being held in New Delhi, that voice will be heard.",
      "publishedAt": "2023-09-07T04:19:49Z",
      "title": "Everyone's talking about the Global South. But what is it?",
      "url": "https://apnews.com/19fa68cf8c60061e88d69f6f2270d98b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c8c61f197814efcb52af7fd44140446/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "JAKARTA, Indonesia (AP) — It took more than a day of flying, including two refueling stops, for Vice President Kamala Harris to reach this year’s summit of Southeast Asian countries.",
      "publishedAt": "2023-09-07T04:57:15Z",
      "title": "In Southeast Asia, Harris says 'we have to see the future'",
      "url": "https://apnews.com/37e46580bf4740a2e1be2ce289517307",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66264483bad04c3d99772995c302f1a7/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING and TARA COPP",
      "description": "WASHINGTON (AP) — Top defense officials are accusing Republican Alabama Sen. Tommy Tuberville of jeopardizing America's national security with his hold on roughly 300 military promotions, raising the stakes in a clash over abortion policy that shows no signs of easing.",
      "publishedAt": "2023-09-07T04:02:08Z",
      "title": "Hundreds of military promotions are on hold as a Republican senator demands end to abortion policy",
      "url": "https://apnews.com/e38d853526de044ac59338d32d7a0e10",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8a2e4dc50cea4462b5115ee134f0f6d7/3000.jpeg"
    },
    {
      "author": "BECKY BOHRER and MATTHEW DALY",
      "description": "JUNEAU, Alaska (AP) — In an aggressive move that angered Republicans, the Biden administration canceled the seven remaining oil and gas leases in Alaska's Arctic National Wildlife Refuge on Wednesday, overturning sales held in the Trump administration's waning days, and proposed stronger protections against development on vast swaths of the National Petroleum Reserve-Alaska.",
      "publishedAt": "2023-09-06T19:02:09Z",
      "title": "Biden administration cancels remaining oil and gas leases in Alaska's Arctic Refuge",
      "url": "https://apnews.com/318dcc3f2d5b104a800bf3ba48e764b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7233bbcd857b4456b65937ba5dac3268/1500.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A Greek shipping company has pleaded guilty to smuggling sanctioned Iranian crude oil and agreed to pay a $2.4 million fine, newly unsealed U.S. court documents seen Thursday by The Associated Press show.",
      "publishedAt": "2023-09-07T00:44:13Z",
      "title": "Greek shipper pleads guilty to smuggling Iranian crude oil and will pay $2.4 million fine",
      "url": "https://apnews.com/a9a4bf6b6616a8502c4eb052bcfef5aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aee54a2b5b3a46938fb182cb45b14e86/2046.jpeg"
    },
    {
      "author": "PAN PYLAS",
      "description": "LONDON (AP) — A former British soldier awaiting trial on terror charges who appears to have escaped from a London prison by strapping himself to the underside of a food delivery truck remained at large Thursday as police stepped up security checks across the United Kingdom amid concerns he may try to flee the country.",
      "publishedAt": "2023-09-07T09:43:49Z",
      "title": "Police comb the UK and put ports on alert for an escaped prison inmate awaiting terrorism trial",
      "url": "https://apnews.com/65e3becef1435bd86fc4d36c11a663f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c6bd2d6b3384f0cae0ba8205a580217/3000.jpeg"
    },
    {
      "author": "MICHELLE CHAPMAN",
      "description": "Google will soon require that political ads using artificial intelligence be accompanied by a prominent disclosure if imagery or sounds have being synthetically altered.Starting in November, just under a year before Election Day, Google said in an update to its political content policy that disclosure of AI to alter images must be clear and conspicuous and be located somewhere that users are likely to notice it.",
      "publishedAt": "2023-09-07T12:07:28Z",
      "title": "AI used to alter imagery or sounds in political ads will require prominent disclosure on Google",
      "url": "https://apnews.com/792cbae3e651d31028ae2c64f65f112c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34c2589ef9c3425483477048a969a4b3/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}