{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — The jury in Donald Trump’s hush money trial ended its first day of deliberations without a verdict Wednesday but asked to rehear testimony from key witnesses about the alleged hush money scheme at the heart of the history-making case.",
      "publishedAt": "2024-05-29T04:04:18Z",
      "title": "Jurors in Trump hush money trial end 1st day of deliberations after asking to rehear testimony",
      "url": "https://apnews.com/390f045e9e8a37f069e82576edd7a842",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d21ecc40af0b4be0aeae5a72ad6da882/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Justice Samuel Alito is rejecting calls to step aside from Supreme Court cases involving former President Donald Trump and Jan.",
      "publishedAt": "2024-05-29T17:33:34Z",
      "title": "Alito rejects calls to quit Supreme Court cases on Trump and Jan. 6 because of flag controversies",
      "url": "https://apnews.com/e53c1d1fef7b81f9dc87fa31b1622c4c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1aa2b1e651614f8ab11d06e356ed7d0a/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Israel’s military said Wednesday it seized control of a strategic corridor along Gaza’s border with Egypt to cut off smuggling tunnels as it tries to destroy the militant Hamas group in a war that is now in its eighth month.",
      "publishedAt": "2024-05-29T14:47:37Z",
      "title": "Israel says it's taken control of key area of Gaza's border with Egypt awash in smuggling tunnels",
      "url": "https://apnews.com/7952f779552f41ef6fb44c3b662f5c48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c20a894e8774d5a8ca044c173ed7b73/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI and SEUNG MIN KIM",
      "description": "PHILADELPHIA (AP) — President Joe Biden renewed his election-year pitch to Black voters on Wednesday, lashing out at Donald Trump’s “MAGA lies” and saying the winner of this year's White House race will make crucial decisions, including on nominees for the Supreme Court, that could affect the country for decades.",
      "publishedAt": "2024-05-29T09:03:59Z",
      "title": "'Are you with me?' Biden and Harris launch Black voter outreach and warn of a second Trump term",
      "url": "https://apnews.com/0c4a7343c017f57a38c847bfc9b1316f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f43d86a3fd64be3a3b259f03293b553/3000.jpeg"
    },
    {
      "author": "KAREN MATTHEWS",
      "description": "NEW YORK (AP) — A nurse was fired by a New York City hospital after she referred to Israel's war in Gaza as a “genocide” during a speech accepting an award.Labor and delivery nurse Hesen Jabr, who is Palestinian American, was being honored by NYU Langone Health for her compassion in caring for mothers who had lost babies when she drew a link between her work and the suffering of mothers in Gaza.",
      "publishedAt": "2024-05-29T17:45:27Z",
      "title": "A nurse honored for compassion is fired after referring to Gaza 'genocide' in speech",
      "url": "https://apnews.com/55c694d6a0c64b1612262310dc208124",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e23781e8aab5434d812a551f54dc8333/3000.jpeg"
    },
    {
      "author": "SARA CLINE",
      "description": "BATON ROUGE, La. (AP) — Critics of a new Louisiana law, which makes it a crime to approach within 25 feet (7.6 meters) of a police officer under certain circumstances, fear that the measure could hinder the public’s ability to film officers — a tool that has increasingly been used to hold police accountable.",
      "publishedAt": "2024-05-29T20:19:20Z",
      "title": "New Louisiana law will criminalize approaching police under certain circumstances",
      "url": "https://apnews.com/85f269d421b03a173bfbd4b98e95a018",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f739cd02f05c4dab9f504c2ca210cb0f/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA",
      "description": "PLAN DE AYALA, Mexico (AP) — At 4:30 a.m., the girls and women begin to appear in the dark streets of this rural village of Tojolabal people in southern Mexico. They walk in silence. Some are headed to grind corn to make their family’s tortillas.",
      "publishedAt": "2024-05-29T04:03:32Z",
      "title": "A woman will likely be Mexico's next president. But in some Indigenous villages, men hold the power",
      "url": "https://apnews.com/8112a9da0bf2ddb564f20bd478da4d62",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ae3efbf12f204b3b8c39169c1929818e/3000.jpeg"
    },
    {
      "author": "GERALD IMRAY, MOGOMOTSI MAGOME and FARAI MUTSAKA",
      "description": "JOHANNESBURG (AP) — South Africans voted Wednesday at schools, community centers, and in large white tents set up in open fields in an election seen as their country’s most important since apartheid ended 30 years ago.",
      "publishedAt": "2024-05-29T00:09:23Z",
      "title": "Polls close and South Africa counts votes in election framed as its most important since apartheid",
      "url": "https://apnews.com/db201bc1aa21a1d986d50af1674a8e78",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb11aa014ee74233b21e8d81b39ba415/1920.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — Josh Gibson became Major League Baseball’s career leader with a .372 batting average, surpassing Ty Cobb’s .367, when Negro Leagues records for more than 2,300 players were incorporated Tuesday after a three-year research project.",
      "publishedAt": "2024-05-28T23:57:25Z",
      "title": "Josh Gibson becomes MLB career and season batting leader as Negro Leagues statistics incorporated",
      "url": "https://apnews.com/4a204a3cac0527ab5be750783fd411df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a545944fd21b41be85026fb2b8ca03cd/3000.jpeg"
    },
    {
      "author": "THALIA BEATY",
      "description": "Melinda French Gates ' has a long history of supporting the women’s movement, but it’s her new eye-popping funding commitments that could finally change women’s groups’ long-running lament that less than 2% of philanthropic giving in the United States directly benefits women and girls.",
      "publishedAt": "2024-05-29T18:56:04Z",
      "title": "Less than 2% of philanthropic giving goes to women and girls. Can Melinda French Gates change that?",
      "url": "https://apnews.com/29dec3ed0934283db61f3ac3e6b780e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/190951df650f472e90daf2b7c1486875/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}