{
  "articles": [
    {
      "author": "MOHAMED JAHJOUH and JOSEF FEDERMAN",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel said it targeted Hamas’ shadowy military commander in a massive strike Saturday in the crowded southern Gaza Strip that killed at least 71 people, according to local health officials.",
      "publishedAt": "2024-07-13T10:27:48Z",
      "title": "An Israeli attack targeting the Hamas military commander kills at least 71 in southern Gaza",
      "url": "https://apnews.com/83bc4de7ed25b317c7871fd5c0999ad1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc3944ec9d7a4c7d869b87a791954d6f/1920.jpeg"
    },
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden is on a public and private blitz to shake off concerns about his cognitive capacities.But with public doubts about his fitness to serve unabating, Biden’s every move is now under a withering microscope as any potential stumble risks becoming magnified and delivering another blow to his candidacy.",
      "publishedAt": "2024-07-13T04:01:23Z",
      "title": "Biden's supporters want to 'let Joe be Joe' — but his stumbles are now under a bigger spotlight",
      "url": "https://apnews.com/834695dd707d3de47e86a791d4387915",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd1d89ec17784e60b207f45c0ce8348c/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump will have one last chance Saturday to unveil his vice presidential pick on a rally stage before the Republican National Convention kicks off in Milwaukee next week.",
      "publishedAt": "2024-07-13T04:00:26Z",
      "title": "Trump heads to Pennsylvania for pre-convention rally as VP announcement looms",
      "url": "https://apnews.com/7c7ba6b99b5f38d2d840ed95b2fdc3e5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/111c41ae4a5e4f8b8554b76d46ff9fb0/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MILWAUKEE (AP) — Milwaukee loves its Miller Beer, Brewers baseball and “ Bronze Fonz ” statue.",
      "publishedAt": "2024-07-13T04:03:13Z",
      "title": "Deeply Democratic Milwaukee wrestles with hosting Trump and the Republican National Convention",
      "url": "https://apnews.com/3a6c8b391ff4d0ba54332347c95e767c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/09a86f29d8ce4c7297b027373000900e/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — European allies in NATO are stepping up their military spending, just as Donald Trump wanted. They're pointing to common interests, such as concerns over China.",
      "publishedAt": "2024-07-13T12:13:56Z",
      "title": "With words, deeds and arms deals, allies make the case for NATO in terms that would appeal to Trump",
      "url": "https://apnews.com/824a12356d561caad2341805b04d58ae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ecc67f6c03945b0a400aa4f013a7aeb/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "NEW YORK (AP) — Dr. Ruth Westheimer, the diminutive sex therapist who became a pop icon, media star and best-selling author through her frank talk about once-taboo bedroom topics, has died. She was 96.",
      "publishedAt": "2024-07-13T14:39:41Z",
      "title": "Dr. Ruth Westheimer, America’s diminutive and pioneering sex therapist, dies at 96",
      "url": "https://apnews.com/6d4af57b5f034bf9a90977de41b88735",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cd62f92b3cc84ee6ab65dcad0cc26b00/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU and DEEPA BHARATH",
      "description": "HUALIEN, Taiwan (AP) — When a 7.4-magnitude earthquake ripped through Taiwan in April, it took about 30 minutes for the region’s most ubiquitous charity to set up an emergency response center.",
      "publishedAt": "2024-07-13T04:05:11Z",
      "title": "A Taiwan-based Buddhist charity attempts to take the founding nun's message of compassion global",
      "url": "https://apnews.com/9d8600a7d53d4f5a8e04f8c810f8f658",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/301b0e689144484999b2907422f99e1e/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and ELISE MORTON",
      "description": "KYIV, Ukraine (AP) — Russian shelling of Ukraine killed four people on Saturday, officials said, as the two countries exchanged drone attacks, one of which set ablaze a Russian oil depot. Two people died in Ukraine’s partly occupied Kherson region and two were wounded in the attack close to the regional capital, said Gov.",
      "publishedAt": "2024-07-13T08:47:29Z",
      "title": "Shelling kills 4 in Ukraine as a drone attack sparks fire at an oil depot in Russia",
      "url": "https://apnews.com/cd0e673169643690c5b9b57ff1c97186",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0820f9ce793541cdb4fd33ce2cfd98f9/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — A nearly three-year legal saga for Alec Baldwin in the fatal shooting of a cinematographer ended Friday without a verdict but with tears of relief for the actor and a small coterie of family who had settled into a somber daily routine on wooden benches inside a windowless New Mexico courtroom at trial.",
      "publishedAt": "2024-07-13T06:11:35Z",
      "title": "Inside the courtroom as case dismissed against Alec Baldwin in fatal shooting of cinematographer",
      "url": "https://apnews.com/8db05f8b2d88e80da241730bac975db0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d91420fa0fb4335b7591a65cd54d581/3000.jpeg"
    },
    {
      "author": "JAMES POLLARD",
      "description": "HOUSTON (AP) — The deafening hum of a generator was a welcome noise Thursday evening at a Houston independent living center where several dozen seniors had lost power in the wake of Hurricane Beryl.",
      "publishedAt": "2024-07-13T04:07:02Z",
      "title": "Houston community groups strain to keep feeding and cooling a city battered by repeat storms",
      "url": "https://apnews.com/054704e2de841b8d58c4c84b078d01a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b9f2c7dc50c40ada5d9565146cad2a7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}