{
  "articles": [
    {
      "author": "FATIMA HUSSEIN, CHRIS RUGABER, JOSH BOAK and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump announced Friday that he'll nominate billionaire hedge fund manager Scott Bessent, an advocate for deficit reduction, to serve as his next treasury secretary, one of several personnel decisions that he unveiled as he closed out the workweek.",
      "publishedAt": "2024-11-23T00:03:29Z",
      "title": "Trump chooses Bessent to be treasury secretary, Vought as budget chief, Chavez-DeRemer for Labor",
      "url": "https://apnews.com/8df8be88e4c83df4b9f3c4238966e79d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c6732b66fec3496ba6d056684dda979c/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and FATIMA HUSSEIN",
      "description": "WASHINGTON (AP) — President-elect Donald Trump launched a blitz of picks for his Cabinet, but he took his time before settling on billionaire investor Scott Bessent as his treasury secretary nominee.",
      "publishedAt": "2024-11-23T05:03:18Z",
      "title": "Trump raced to pick many Cabinet posts. He took more time to settle on a treasury secretary",
      "url": "https://apnews.com/f01fc0bab029c10b453ee9afb2b41b24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19002ea6b1f54971926ab6bdc1ad8b7d/3000.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "JEFFERSON CITY, Mo. (AP) — Two weeks before Election Day, activists from across the country gathered for an online rally heralding the historic number of state ballot initiatives seeking to change the way people vote.",
      "publishedAt": "2024-11-23T05:03:39Z",
      "title": "Voters rejected historic election reforms across the US, despite more than $100M push",
      "url": "https://apnews.com/bc797f209e5f98a18afb2e5f784e63b6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1456407b2cef4ea3be85bc3ca0e05f59/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and BASSEM MROUE",
      "description": "BEIRUT, Lebanon (AP) — Israeli airstrikes Saturday killed at least 11 people and injured dozens in central Beirut, as diplomats scrambled to broker a cease-fire. Lebanon's civil defense said the death toll was provisional as emergency responders were still digging through the rubble looking for survivors.",
      "publishedAt": "2024-11-23T08:51:22Z",
      "title": "At least 11 killed and dozens injured in Israeli strikes in Beirut as diplomats push for cease-fire",
      "url": "https://apnews.com/60f383ef1f42ff9928770a77d27ec4b8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01cf29373b57450ab3a5968c9f5617dd/1920.jpeg"
    },
    {
      "author": "RIAZ KHAN",
      "description": "PESHAWAR, Pakistan (AP) — Fighting between armed Sunni and Shiite groups in northwestern Pakistan killed at least 33 people and injured 25 others, a senior police officer from the region said Saturday.",
      "publishedAt": "2024-11-23T07:16:35Z",
      "title": "Fighting between armed sectarian groups in restive northwestern Pakistan kills at least 33 people",
      "url": "https://apnews.com/aec6e365dd13de8e381740008fbd14b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b2826e8ccd24879b66e26899affa434/3000.jpeg"
    },
    {
      "author": "JINTAMAS SAKSORNCHAI",
      "description": "VANG VIENG, Laos (AP) — The Laotian government on Saturday officially acknowledged the mass poisoning that has killed at least six tourists, promising it would bring perpetrators to justice.Two Australian teenagers and a British woman died from suspected methanol poisoning after drinking tainted alcohol in Laos.",
      "publishedAt": "2024-11-23T07:20:52Z",
      "title": "Laos government pledges justice in mass alcohol poisoning case that has killed 6 tourists",
      "url": "https://apnews.com/8b499ecc32faad18cf52e00f5691c744",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e5241b15a2fe4f438bb8126d72872ff1/3000.jpeg"
    },
    {
      "author": "MELINA WALLING, SETH BORENSTEIN, MICHAEL PHILLIS and SIBI ARASU",
      "description": "BAKU, Azerbaijan (AP) — The United Nations' annual climate talks pushed into overtime Saturday as negotiators pressed on to get a deal on money for developing nations to curb and adapt to climate change.",
      "publishedAt": "2024-11-23T04:16:41Z",
      "title": "Negotiators work through the night at UN climate talks to try to reach a cash deal for poor nations",
      "url": "https://apnews.com/8ab629945660ee97d58cdbef10136f35",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/017f3ec837a74ae7a96988cdf98cc018/1920.jpeg"
    },
    {
      "author": "NOAH BERGER and OLGA R. RODRIGUEZ",
      "description": "HEALDSBURG, Calif. (AP) — A major storm dropped more snow and record rain in California, causing small landslides and flooding some streets, while on the opposite side of the country blizzard or winter storm warnings were in effect Saturday for areas spanning from the Northeast to central Appalachia.",
      "publishedAt": "2024-11-23T06:01:21Z",
      "title": "Storm dumps record rain in Northern California, while US Northeast deals with winter storms",
      "url": "https://apnews.com/e0b787685ad719b1a99c722658f484f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b905d4e9e6054ca9a01faea5493952f1/1920.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "SADO, Japan (AP) — Japan will hold a memorial ceremony on Sunday near the Sado Island Gold Mines, which were listed this summer as a UNESCO World Heritage site after the country moved past years of historical disputes with South Korea and reluctantly acknowledged the mines' dark history.",
      "publishedAt": "2024-11-23T06:26:02Z",
      "title": "Japan will hold first memorial for 'all workers' at Sado gold mines but blurs WWII atrocity. Why?",
      "url": "https://apnews.com/0218064869fb4a1270dad471432b9c46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/287b2ac1b53f4dd2b17c83fd470bbcec/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV and VOLODYMYR YURCHUK",
      "description": "KYIV, Ukraine (AP) — NATO and Ukraine will hold emergency talks Tuesday after Russia attacked a central city with an experimental, hypersonic ballistic missile that escalated the nearly 33-month-old war.",
      "publishedAt": "2024-11-22T10:30:56Z",
      "title": "NATO and Ukraine to hold emergency talks after Russia's attack with new hypersonic missile",
      "url": "https://apnews.com/d374dc8ca0fa626e674d29df01ce95cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/19aa4299c4fb4b369dbd2c1b32786652/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}