{
  "articles": [
    {
      "author": "CHRIS MEGERIAN, JONATHAN J. COOPER and GARY D. ROBERTSON",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris and former President Donald Trump are making a beeline for swing states that they hope to flip in their favor this year, both of them trying to expand their narrow paths to victory in a closely fought presidential campaign.",
      "publishedAt": "2024-09-12T04:09:29Z",
      "title": "Harris and Trump are jockeying for battleground states after their debate faceoff",
      "url": "https://apnews.com/34bca16175c387a076131ad69bc18d47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/621836f883fc4320adc83ad9a21e9e62/3000.jpeg"
    },
    {
      "author": "MIKE CATALINI",
      "description": "BRISTOL, Pa. (AP) — The presidential debate this week was the final affront to Rosie Torres' lifelong Republicanism. She said her allegiance to Donald Trump, already strained by his stand on abortion, snapped in the former president's “eye opener” encounter with Kamala Harris.",
      "publishedAt": "2024-09-12T04:19:53Z",
      "title": "Debate was an 'eye opener' in suburban Philadelphia and Harris got a closer look",
      "url": "https://apnews.com/a077717b399dbb9322a347d10c6e761b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/98a476823a4747a4bd37b1f733b82fb8/3000.jpeg"
    },
    {
      "author": "ADAM GELLER and JALAL BWAITEL",
      "description": "JENIN, West Bank (AP) — In the web of battered, sun-baked streets winding up the hillside, bloodshed is as unrelenting as the heat. So it is not hard to see why, when raid sirens and gunfire erupted yet again on a morning in late May, 15-year-old Mahmoud Hamadneh turned his bike down an alley that held out the promise of refuge.",
      "publishedAt": "2024-09-12T11:03:25Z",
      "title": "As war rages in Gaza, Israel’s crackdown on West Bank insurgency is killing Palestinian youths",
      "url": "https://apnews.com/852c8a636713ed0d99956f0ec7504ecc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3485734a0eaa45cd91e8934c209aba9e/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON",
      "description": "SEATTLE (AP) — For her 26th birthday in July, human rights activist Aysenur Ezgi Eygi gathered friends for a bonfire at one of her favorite places, a sandy beach in Seattle where green-and-white ferries cruise across the dark, flat water and osprey fish overhead.",
      "publishedAt": "2024-09-12T06:47:26Z",
      "title": "Hundreds gather on a Seattle beach to remember an American activist killed by the Israeli military",
      "url": "https://apnews.com/9fbdfbc17df5e7bc27c2f14da17cc6e4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbad52ea351e4e0384d07425299bec84/3000.jpeg"
    },
    {
      "author": "JEFF AMY and CHARLOTTE KRAMON",
      "description": "ATLANTA (AP) — Georgia's state House speaker says lawmakers in 2025 will consider new policies to foster student mental health, detect guns and encourage people to safely store guns after a school shooting killed four at a high school northeast of Atlanta.",
      "publishedAt": "2024-09-12T11:01:56Z",
      "title": "Georgia Republican leader seeks changes after school shooting, but Democrats want more",
      "url": "https://apnews.com/55c7965ac0a54c96292444f27cb4a38f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aaca8893426a45829e625de2226745b1/3000.jpeg"
    },
    {
      "author": "FOSTER KLUG, JIWON SONG and JAE C. HONG",
      "description": "POHANG, South Korea (AP) — There are two Koreas, North and South. But there's also more than one South Korea, with the nation split into camps with polar opposite views on the danger posed by the nuclear-armed neighbor to the north.",
      "publishedAt": "2024-09-12T04:30:20Z",
      "title": "South Koreans are starkly divided over North Korea's nuclear threat",
      "url": "https://apnews.com/e4c272c59dee1a908c7a26fc7705b5a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9b1582a52484cc2927485a96bbec392/3000.jpeg"
    },
    {
      "author": "HAU DINH and DAVID RISING",
      "description": "HANOI, Vietnam (AP) — Nearly 200 people have died in Vietnam in the aftermath of Typhoon Yagi and 128 are missing as flash floods and landslides take their toll, state media reported Thursday.Vietnam's VNExpress newspaper reported that 199 people have died while more than 800 have been injured.",
      "publishedAt": "2024-09-12T04:03:21Z",
      "title": "Death toll climbs to 199 in Vietnam as typhoon's aftermath brings flash floods and landslides",
      "url": "https://apnews.com/43af9564655861bafb2b6a211f8bd679",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/967d598e46394061aec2107040a9c0c3/1920.jpeg"
    },
    {
      "author": "JACK BROOK and SARA CLINE",
      "description": "MORGAN CITY, La. (AP) — Francine weakened Thursday after striking Louisiana as a Category 2 hurricane that knocked out power to hundreds of thousands of homes and businesses, sent storm surge rushing into coastal communities and raised flood fears in New Orleans and beyond as drenching rains spread over the northern Gulf Coast.",
      "publishedAt": "2024-09-12T04:47:45Z",
      "title": "Francine weakens moving inland from the Gulf Coast after hurricane winds cause power outages",
      "url": "https://apnews.com/09879999e209ff5e043ef0e4ca7f527f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7f4aad5780a48689f127667f6db3e4f/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A billionaire stepped out for the first private spacewalk Thursday, teaming up with SpaceX on the daring endeavor hundreds of miles above Earth.",
      "publishedAt": "2024-09-12T06:00:40Z",
      "title": "Billionaire steps out of SpaceX capsule for first private spacewalk hundreds of miles above Earth",
      "url": "https://apnews.com/87d4c78853f0249baf29631bedfac749",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6865b6d1ec0b49fba914bc549aa0c28e/1920.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "Coco loved being the life of the party — cracking jokes, doing pranks and making people laugh, her mom, Julianna Arnold, recalled recently.“Her favorite pastime was fashion,” Arnold said. “She didn’t like looking at magazines or going to fancy stores, but preferred to make her own creations from used clothing she would find at thrift stores....",
      "publishedAt": "2024-09-12T10:11:39Z",
      "title": "Dealers' paradise? How social media became a storefront for deadly fake pills as families struggle",
      "url": "https://apnews.com/8adb28d33f11cd3f52a104aa83a54e32",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c1a2c4b28e1414a9621a73cffaa5a4d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}