{
  "articles": [
    {
      "author": "KAREEM CHEHAYEB and SAMY MAGDY",
      "description": "BEIRUT (AP) — Israel pressed forward on two fronts Wednesday, pursuing a ground incursion into Lebanon against Hezbollah that left eight Israeli soldiers dead and conducting strikes in Gaza that killed dozens, including children.",
      "publishedAt": "2024-10-02T05:50:18Z",
      "title": "Israel presses forward on two fronts and reports 8 combat deaths as fears of a wider war mount",
      "url": "https://apnews.com/7d93f71b7894177b4f9c303671ee55de",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b22ed638143742d98dcb06ee0b466683/1920.jpeg"
    },
    {
      "author": "SARAH EL DEEB",
      "description": "BEIRUT (AP) — When Israel bombed buildings outside the southern Lebanese city of Sidon, Mohamed Arkadan and his team rushed to an emergency unlike anything they had ever seen.About a dozen apartments had collapsed onto the hillside they once overlooked, burying more than 100 people.",
      "publishedAt": "2024-10-02T07:05:19Z",
      "title": "Lebanon’s rescuers struggle to respond to Israeli offensive while under fire and using old equipment",
      "url": "https://apnews.com/cc0e211c73d8f033387574a69e14a32f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b916c598f8e4532ad249f6e1d3fa2a5/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The Biden administration says there is a significant difference between Israeli actions that have expanded its war against the Iranian-backed militant groups Hamas and Hezbollah and Iran’s retaliatory missile attack against Israel, which it condemned as escalatory.",
      "publishedAt": "2024-10-02T04:10:56Z",
      "title": "After pressing an Israel-Hezbollah cease-fire, the Biden administration shifts its message",
      "url": "https://apnews.com/8bed0f7a37b5059ba4c94552ff750f34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/758fc626097345018dde0993039bf8d1/3000.jpeg"
    },
    {
      "author": "JEFF AMY, ERIK VERDUZCO and JOHN SEEWER",
      "description": "ASHEVILLE, N.C. (AP) — Isolated and without electricity or phone service since Hurricane Helene inflicted devastation across the Southeast nearly a week ago, residents in the mountains of western North Carolina are relying on old-fashioned ways of communicating and coping.",
      "publishedAt": "2024-10-02T04:23:32Z",
      "title": "Southerners stay in touch the old-fashioned way after Helene cuts roads, power, phones",
      "url": "https://apnews.com/3f812f70c4d2649e2198362e9ae42b06",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a9144e3288646629796c4b7de0d32e6/1920.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Hurricanes in the United States end up hundreds of times deadlier than the government calculates, contributing to more American deaths than car accidents or all the nation's wars, a new study said.",
      "publishedAt": "2024-10-02T15:07:56Z",
      "title": "Hurricanes like Helene are deadly when they strike and keep killing for years to come",
      "url": "https://apnews.com/6c9585e4c695dbc00fa313577f9f328f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca3c616c23f8440b83bb82883c2823fa/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN, COLLEEN LONG and WILL WEISSERT",
      "description": "AUGUSTA, Ga. (AP) — Vice President Kamala Harris handed out meals, embraced a shaken family and surveyed Hurricane Helene’s “extraordinary” path of destruction through Georgia on Wednesday as she left the campaign trail to pledge federal help and personally take in scenes of toppled trees, damaged homes and lives upended.",
      "publishedAt": "2024-10-02T04:17:23Z",
      "title": "'I am now listening:' Harris takes in Helene's devastation and scenes of lives upended in Georgia",
      "url": "https://apnews.com/48baf62af5560a9617ae2032f8776d1e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2696f0d703f4431ac0754d3bf30b98c/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Donald Trump laid the groundwork to try to overturn the 2020 election even before he lost, knowingly pushed false claims of voter fraud and “resorted to crimes” in his failed bid to cling to power, according to a newly unsealed court filing from prosecutors that offers new evidence from the landmark criminal case against the former president.",
      "publishedAt": "2024-10-02T19:53:53Z",
      "title": "Prosecutors lay out new evidence in Trump election case, accuse him of having 'resorted to crimes'",
      "url": "https://apnews.com/0b9969b480036bb1f7c61a73980d406c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aebce365f3764a0eb2a53dca322b8d78/3000.jpeg"
    },
    {
      "author": "MARK SCOLFORO",
      "description": "BUTLER, Pa. (AP) — Donald Trump is going back to Butler, where the world last saw him pump his fist and beseech followers to “fight,” even as blood streaked his face from a would-be assassin's bullet.",
      "publishedAt": "2024-10-02T04:07:21Z",
      "title": "Pennsylvania town grapples with Trump assassination attempt ahead of his return",
      "url": "https://apnews.com/54f385fbdac215b89c6df047fa399039",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1e2a23b6e984670b87dafc06175ecc7/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — U.S. kindergarten vaccination rates dipped last year and the proportion of children with exemptions rose to an all-time high, according to federal data posted Tuesday.",
      "publishedAt": "2024-10-02T21:50:10Z",
      "title": "US school-entry vaccination rates fall as exemptions keep rising",
      "url": "https://apnews.com/1c0f9a196a70491fccf48b9125090de0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2de7319f8f094f348556787df8422c5c/2130.jpeg"
    },
    {
      "author": "STEVE KARNOWSKI",
      "description": "MINNEAPOLIS (AP) — When the issue of gun violence came up at the vice presidential debate, Minnesota Gov. Tim Walz had a personal story to tell: His teenage son, Gus, had been at a sports center last year when a shooting took place.",
      "publishedAt": "2024-10-02T18:52:28Z",
      "title": "Coach praises Tim Walz's son for helping protect other kids after shooting",
      "url": "https://apnews.com/000be5d166708536a39b9e764868fbb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04eacae3f72242cb976781e95d207555/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}