{
  "articles": [
    {
      "author": "Darlene Superville, Aamer Madhani",
      "description": "President Donald Trump says he doubts Russia’s Vladimir Putin wants to end his war in Ukraine. Trump is expressing new skepticism that a peace deal can be reached soon. And his comments come only a day after saying Ukraine and Russia were “very close to a deal.” Trump said in a social media post Saturday as he flew back to the United States after Pope Francis’ funeral that “there was no reason for Putin to be shooting missiles into civilian areas, cities and towns, over the last few days.” Trump hinted at further sanctions against Russia. Trump said, “It makes me think that maybe he doesn’t want to stop the war, he’s just tapping me along.”",
      "publishedAt": "2025-04-26T11:41:11Z",
      "title": "Trump express doubts that Putin is willing to end the war in Ukraine",
      "url": "https://apnews.com/article/trump-russia-ukraine-zelenskyy-funeral-francis-vatican-7b3b3e6e194e7099e5463d1f23b5f3cf",
      "urlToImage": "https://dims.apnews.com/dims4/default/c4b52ac/2147483647/strip/true/crop/1407x791+0+73/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2Fc3%2F9a70df4b57195e1a38dda0d0dcb0%2F3cbef852c0814b73b2c7ca99356e71a6"
    },
    {
      "author": null,
      "description": "All Ukrainian troops have been forced from Russia’s Kursk region, Kremlin spokesperson Dmitry Peskov said Saturday. Ukrainian officials have not commented on the claim. Meanwhile, Ukrainian officials said three people were killed overnight by Russian attacks across Ukraine. The attacks came hours before U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskyy met in Vatican City on the sidelines of the funeral of Pope Francis. The presidents met at St. Peter’s Basilica for about 15 minutes and agreed to continue negotiations later on Saturday, Ukrainian presidential spokesman Serhii Nykyforov said.",
      "publishedAt": "2025-04-26T10:30:06Z",
      "title": "Russia says all Ukrainian troops have left the Kursk region as Zelenskyy meets Trump at Vatican",
      "url": "https://apnews.com/article/russia-ukraine-war-attacks-ceasefire-peace-talks-vatican-b75aeccb7af0e3363cd97a276ba3777a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e099b08/2147483647/strip/true/crop/2000x1125+0+104/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2Fc1%2Fa14d7ed75d954b82a9a63ba3ef11%2Ffc8b744773f949e4bcbf219cb5069cb7"
    },
    {
      "author": "Nicole Winfield, Colleen Barry",
      "description": "Tens of thousands of people are pouring into St. Peter’s Square for Pope Francis' funeral. With hours to go, the piazza is filling up. The farewell ceremony reflects his priorities as pope and wishes as pastor: Presidents and princes will be on hand, but prisoners and migrants will welcome him into the basilica. Francis choreographed the ceremony himself when he revised and simplified the Vatican’s funeral rites and rituals last year. He aimed to emphasize the pope’s role as a mere priest and not “a powerful man of this world.” Francis is breaking with recent tradition and will be buried in the St. Mary Major Basilica.",
      "publishedAt": "2025-04-26T04:35:54Z",
      "title": "Mourners rush to St. Peter's Square for Pope Francis' funeral",
      "url": "https://apnews.com/article/pope-francis-vatican-funeral-d6a8a471978c21c71c3f1dc07f663e78",
      "urlToImage": "https://dims.apnews.com/dims4/default/8767383/2147483647/strip/true/crop/2196x1235+0+115/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F67%2Ff0%2Fae65e97f8080e8439a56f73d3628%2Ffba8894a4aae45fbab784a1d21a213a0"
    },
    {
      "author": null,
      "description": "A massive explosion and fire has struck the Iranian port city of Bandar Abbas. A provincial disaster management official told Iranian state television there were injuries in Saturday's blast, without elaborating. He added that first responders were trying to reach the area while others were attempting to evacuate the site. The official said the blast came from containers at Rajaei port in the city. Social media videos showed a huge plume of black smoke. Rajaei port mainly handles container traffic and also has oil tanks and other petrochemical facilities.",
      "publishedAt": "2025-04-26T09:32:07Z",
      "title": "A massive explosion and fire strikes the Iranian port city of Bandar Abbas",
      "url": "https://apnews.com/article/iran-explosion-fire-bandar-abbas-72637c6b3e152a30045275f57ace29ed",
      "urlToImage": "https://dims.apnews.com/dims4/default/2234569/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fb8%2F550c1603af5b86e16d9bc8ba03a2%2Feb18966322944b7193001e9520f9a1a2"
    },
    {
      "author": "Jon Gambrell",
      "description": "Iran and the United States are preparing to start in-depth negotiations in Oman over Tehran’s rapidly advancing nuclear program, talks that likely will hinge on the Islamic Republic’s enrichment of uranium. Iranian state television suggested the talks could start mid-day Saturday in Muscat, the mountain-wrapped capital of this sultanate on the eastern edge of the Arabian Peninsula. However, neither Iranian Foreign Minister Abbas Araghchi nor U.S. Mideast envoy Steve Witkoff offered any immediate specifics or details on the talks that they’ll lead. Witkoff on Friday was in Moscow meeting Russian President Vladimir Putin. He arrived Saturday to Oman.",
      "publishedAt": "2025-04-26T06:15:16Z",
      "title": "Iran and US prepare for expert nuclear talks in Oman",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-oman-f2e4ecf49c62c11a0240153d7f900d0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/a61f09e/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2F65%2F301cb2baf511f99243fbbbdce856%2F19bff9aab044437d911586b47ad11611"
    },
    {
      "author": "Seung Min Kim, Linley Sanders",
      "description": "An AP-NORC poll finds many Americans don't agree with President Trump’s aggressive efforts to quickly enact his agenda, and even Republicans aren't overwhelmingly convinced his attention has been in the right place. Americans are nearly twice as likely to say Trump has been mostly focusing on the wrong priorities as to say he's been focusing on the right ones. The findings suggest Democrats are even unhappier with the reality of the second Trump term than before he was sworn in. While about 7 in 10 Republicans say Trump has been at least a “good” president so far, only about half say he’s emphasized the right things.",
      "publishedAt": "2025-04-26T11:23:37Z",
      "title": "Only about half of Republicans say Trump's priorities are right, poll finds",
      "url": "https://apnews.com/article/trump-economy-immigration-trade-100-days-poll-625efe6128d5f2e90e04bcc7f30479eb",
      "urlToImage": "https://dims.apnews.com/dims4/default/5e1b039/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F31%2Ff0%2F030b88fe7d8fee886c3dc11bb0f9%2F2610ee8fca9a4779b7ad6287619a5703"
    },
    {
      "author": "Wafaa Shurafa, Samy Magdy",
      "description": "Health officials in Gaza aid that at least 49 people were killed by Israeli strikes in the last 24 hours and Arab mediators are scrambling to restart a ceasefire. A strike in a neighborhood in western Gaza City early Saturday morning, flattened a three-story house, killing 10 people. Three more people were killed in the Shati refugee camp along the city’s shoreline. The attacks come as Hamas sent a high-level delegation to Cairo Saturday, to try and get the stalled ceasefire back on track.",
      "publishedAt": "2025-04-26T10:55:52Z",
      "title": "49 killed by Israeli strikes in Gaza over 24 hours, as mediators scramble to restart ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-04-26-2026-4483e0e411a3aa7cf7bd2bd434d69e50",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d4d782/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2Fd3%2F10136c2b54884b700454403b7f1d%2Fe05d9679e63e446c9ddcc991e9607953"
    },
    {
      "author": "Michael Casey",
      "description": "Sixty years after the Rev. Martin Luther King Jr. led a rally protesting housing discrimination and segregated schools in Boston, hundreds of people gathered at the same site to honor and reflect on the historic event. The rally was held Saturday at the Boston Common near the site of a 20-foot-high memorial to racial equity, which shows King embracing his wife, Coretta Scott King. King's eldest son, Martin Luther King III, was a leader of the rally. He said in an interview that more work is needed to ensure everyone has access to quality health care, a decent home and a good paying job.",
      "publishedAt": "2025-04-26T04:06:43Z",
      "title": "Trump's attack on diversity takes center stage as Boston remembers 1965 Freedom Rally led by MLK",
      "url": "https://apnews.com/article/freedom-rally-1965-martin-luther-king-jr-8256f61320a2466ecd8d20417405c500",
      "urlToImage": "https://dims.apnews.com/dims4/default/72e2c22/2147483647/strip/true/crop/6000x3375+0+675/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9c%2Fc8%2F47ae38aaf598169856d458bec0a0%2Fb02a027ab3c4437ca82859b1fd290b7b"
    },
    {
      "author": "Aijaz Hussain, Rajesh Roy, Munir Ahmed",
      "description": "India’s military says Pakistani soldiers shot at Indian posts along the highly militarized frontier in disputed Kashmir for a second consecutive night. The cross-border fire followed a gun attack on tourists in Kashmir that India blames Pakistan for. It was the worst assault targeting civilians in the restive region for years. Pakistan denies involvement. The killings set off tit-for-tat measures on visas, treaties and diplomats. India said Saturday that its troops responded appropriately during the overnight firing. In the past, each side has accused the other of starting border skirmishes in the Himalayan region, which both claim in its entirety.",
      "publishedAt": "2025-04-26T04:47:12Z",
      "title": "Indian military says Pakistani troops fired along border in disputed Kashmir overnight",
      "url": "https://apnews.com/article/india-pakistan-kashmir-attack-829911d3eae7cfe6738eda5c0c84d6ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/d747be4/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F56%2F8d%2F8d6981b97ef299e52c3a44539fc7%2Fa65a61d902814af9b108aafc7d938c35"
    },
    {
      "author": "Laura Ungar",
      "description": "People with diseases caused by rare mutations have fewer options and poorer prospects than other patients despite rapid recent advancements in the growing field of genetic science. In cystic fibrosis, for example, medications can vastly improve health for 90% of people with the condition, which is the most common fatal genetic disease in the U.S. But the therapies don't work for the 10% of patients with rare mutations. Experts say one big reason for this dynamic is that it's less profitable to develop therapies for smaller numbers of people. With help from charities, however, scientists are working on gene therapies that can help all patients, regardless of mutation.",
      "publishedAt": "2025-04-26T14:59:04Z",
      "title": "Genetic medicine can leave people with rare mutations behind. But there's new hope",
      "url": "https://apnews.com/article/gene-therapy-cystic-fibrosis-genetic-disease-156838bed586a5650f06d7bec4b2edae",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4bcae2/2147483647/strip/true/crop/4032x2268+0+378/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F89%2Fb9%2F3d367fc631d0e280483f690b4726%2F1ecef1c4d9984c249c3b96b2e4724840"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}