{
  "articles": [
    {
      "author": "WILL WEISSERT and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris has secured enough votes from Democratic delegates to become the party’s nominee for president, Democratic National Committee Chair Jaime Harrison said Friday.",
      "publishedAt": "2024-08-02T16:39:29Z",
      "title": "Harris has secured enough Democratic delegate votes to be the party's nominee, committee chair says",
      "url": "https://apnews.com/463d0b8095f2ca3526b3af3a2f44c3ca",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc4d0357b5574c3399c43515588a8b1a/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER, ZEKE MILLER AND MATTHEW LEE",
      "description": "WASHINGTON (AP) — It was December 2022 and the U.S. government's chief hostage negotiator had just delivered Brittney Griner back to America after her 10-month imprisonment in Russia.",
      "publishedAt": "2024-08-02T16:42:38Z",
      "title": "An assassin, a Putin foe's death, secret talks: How a sweeping US-Russia prisoner swap came together",
      "url": "https://apnews.com/efae784bb95d3e496bb53b0fbf0b185b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3d245b2688d461ba415f799540d0395/3000.jpeg"
    },
    {
      "author": "DASHA LITVINOVA",
      "description": "TALLINN, Estonia (AP) — New details emerged Friday on the largest prisoner swap since the Cold War, with the Kremlin acknowledging for the first time that some of the Russians held in the West belonged to its security services.",
      "publishedAt": "2024-08-02T13:20:52Z",
      "title": "Kremlin acknowledges intelligence operatives were among the Russians freed in prisoner swap",
      "url": "https://apnews.com/3c9a8b989eae34fdfe5ffcf62989832e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f8307d4f2e08468f8720bbf63c4e0ef5/1920.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and JOSHUA GOODMAN",
      "description": "CARACAS, Venezuela (AP) — Half a dozen masked assailants ransacked the headquarters of Venezuela’s opposition Friday in an escalation of violence against President Nicolás Maduro’s opponents after several countries called for proof of his claim he had won the disputed presidential election.",
      "publishedAt": "2024-08-02T13:47:51Z",
      "title": "Masked assailants ransack Venezuela opposition's headquarters as post-election tensions mount",
      "url": "https://apnews.com/a625eb01979bc9cf5570d03242f198b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c7d4035c40944d4b4121a859e96177b/1920.jpeg"
    },
    {
      "author": null,
      "description": "DOHA, Qatar (AP) — Mourners gathered in Doha on Friday to hold funeral prayers for slain Hamas leader Ismail Haniyeh as Iran and its regional allies vowed to retaliate against Israel.With the bodies of Haniyeh and his bodyguard in coffins draped with Palestinian flags, men knelt and prayed while senior leaders of Hamas’ Qatar-based political office paid their respects to Haniyeh’s family.",
      "publishedAt": "2024-08-02T12:02:02Z",
      "title": "Mourners pay respects to slain Hamas leader Haniyeh as worries of regional war mount",
      "url": "https://apnews.com/9d293642dc44c75232db09739b71a6c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2fda61b1db1c4b94b1dc83f18c66ec3e/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON and AMELIA THOMSON-DEVEAUX",
      "description": "Most Americans have doubts about the Secret Service's ability to keep presidential candidates safe after last month's attempt on former President Donald Trump’s life, a new poll from the Associated Press-NORC Center for Public Affairs Research finds.",
      "publishedAt": "2024-08-02T04:18:59Z",
      "title": "Few Americans trust the Secret Service after a gunman nearly killed Trump, an AP-NORC poll finds",
      "url": "https://apnews.com/e5ef28f72d61080088a0835a1b9a7d39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32954b9652824e92be3df95815165df8/3000.jpeg"
    },
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Several suspects arrested in violent protests that erupted after the fatal stabbing of three children in northwest England made court appearances Friday as officials braced for more clashes that Prime Minister Keir Starmer condemned and blamed on “far-right hatred.”",
      "publishedAt": "2024-08-02T10:24:00Z",
      "title": "UK police brace for more far-right protests as government warns of tough response",
      "url": "https://apnews.com/5929ca5b0514dee578e29764b8961036",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6828620ebd4346e9bdd5d55484e6d458/3000.jpeg"
    },
    {
      "author": "NAMU SAMPATH of The Springfield Republican, MONICA OBRADOVIC of The St. Louis Post-Dispatch, HILARY BURNS of The Boston Globe, and CHRISTOPHER L. KELLER of The Associated Press",
      "description": "AMHERST, Mass. (AP) — Since her arrest at a protest at the University of Massachusetts, Annie McGrew has been pivoting between two sets of hearings: one for the misdemeanor charges she faces in court, and another for violations of the college's conduct code.",
      "publishedAt": "2024-08-02T04:04:22Z",
      "title": "For college students arrested protesting the war in Gaza, the fallout was only beginning",
      "url": "https://apnews.com/7cb75debddc2e8bd795d16515d07de09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9b7c48b711594cb1b45bd8d83943baa6/3000.jpeg"
    },
    {
      "author": "TIFFANY STANLEY",
      "description": "ORANGE, Va. (AP) — On the wall of the maternity home, painted in large letters, is the motto: “Saving Babies, One Mom at a Time.”For founders Randy and Evelyn James, the home started with one baby — their own.",
      "publishedAt": "2024-08-02T12:00:38Z",
      "title": "After the end of Roe, a new beginning for maternity homes",
      "url": "https://apnews.com/f455da4fd46c195246df43bc6dd16a67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9cf1716f1394c10ac1661b95bcede4f/3000.jpeg"
    },
    {
      "author": "GREG BEACHAM",
      "description": "VILLEPINTE, France (AP) — Algerian boxer Imane Khelif has landed in the middle of a divide about gender in sports after her Italian competitor, Angela Carini, pulled out seconds into their bout at the Paris Olympics.",
      "publishedAt": "2024-08-02T14:01:42Z",
      "title": "Who is Imane Khelif? Algerian boxer facing gender outcry had modest success before Olympics",
      "url": "https://apnews.com/2eb07d442ffb29a61e09911884dcdaa9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b76902ff348a4546b671e220a521b69f/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}