{
  "articles": [
    {
      "author": "NAJIB JOBAIN, JACK JEFFERY and LEE KEATH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — The Israeli army severed northern Gaza from the rest of the besieged territory and pounded it with airstrikes Monday, preparing for expected ground battles with Hamas militants in Gaza's largest city and an even bloodier phase of the month-old war.",
      "publishedAt": "2023-11-06T07:37:38Z",
      "title": "Israeli forces cut off north Gaza to isolate Hamas as advance on urban center looms",
      "url": "https://apnews.com/51286d15dddd77ae0dd7ea76ee52bc71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6538427c017a4d02a0b91b8efe34a9cd/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli troops divided the northern and southern parts of Gaza, as communications across the besieged territory were gradually restored Monday after being cut for a third time since the war started.",
      "publishedAt": "2023-11-06T05:32:24Z",
      "title": "Live updates | Israeli troops divide north and south Gaza as UN fails to reach cease-fire resolution",
      "url": "https://apnews.com/c01bc7cf6db1e07ab4d235225cef7320",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d7fbfff0d664858bee958b9e2c518ac/3000.jpeg"
    },
    {
      "author": "AMY TEIBEL",
      "description": "JERUSALEM (AP) — At a time when world sentiment has begun to sour on Israel's devastating offensive in Gaza, the vast majority of Israelis, across the political spectrum, are convinced of the justice of the war.",
      "publishedAt": "2023-11-06T19:27:39Z",
      "title": "Israelis overwhelmingly are confident in the justice of the Gaza war, even as world sentiment sours",
      "url": "https://apnews.com/0cebcbcf0550ee08c0d757334f69851d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/13ecdf6e07974d3586332023cc46be11/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, MICHAEL R. SISAK, JENNIFER PELTZ and ERIC TUCKER",
      "description": "NEW YORK (AP) — A defiant Donald Trump sparred with a New York judge and slammed the state attorney general suing him Monday, using the witness stand at his civil fraud trial to defend his riches and lash out at a case that imperils his real estate empire.",
      "publishedAt": "2023-11-06T05:30:28Z",
      "title": "Trump lashes out from the witness stand at judge, NY attorney general as he testifies in fraud trial",
      "url": "https://apnews.com/dca74420da0f92ee9bc9caff7a92c3b2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/378e3ae857064dc3a551c3944c9e101f/1920.jpeg"
    },
    {
      "author": "ROBERT YOON",
      "description": "WASHINGTON (AP) — The most-watched races in Tuesday’s off-year general election have all been dominated by the ongoing debate over abortion rights.",
      "publishedAt": "2023-11-06T05:41:37Z",
      "title": "Abortion debate has dominated this election year. Here are Tuesday's races to watch",
      "url": "https://apnews.com/c1ebf7c4af31da60bd96a8158c86fb29",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f3b0f13fe924d8ea5b7e9d11a954f62/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN and MATTHEW BROWN",
      "description": "BRIGHTON, Colo. (AP) — Elijah McClain's mother wiped tears from her eyes as a verdict was read Monday acquitting a second Denver-area police officer in the 2019 death of her son.",
      "publishedAt": "2023-11-06T22:26:12Z",
      "title": "2nd police officer acquitted in death of Elijah McClain, who was put in a neck hold, given ketamine",
      "url": "https://apnews.com/2dc1c1e2597eed1306581517d45c6630",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cae92a2d8fd436bb755dc5b997a9f68/1920.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — A scuba dive boat captain was convicted Monday of criminal negligence in the deaths of 34 people killed in a fire aboard the vessel in 2019, the deadliest maritime disaster in recent U.S.",
      "publishedAt": "2023-11-07T00:46:39Z",
      "title": "Captain found guilty of 'seaman's manslaughter' in boat fire that killed 34 off California coast",
      "url": "https://apnews.com/0cd001c598d7edbf0acdcce890e994fe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de71eb1b042d4212a152eb2e3c689f2a/2930.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Ruth Glenn knows from harrowing personal experience the danger of putting a gun in the hands of a violent spouse or partner, the issue at the heart of a case before the Supreme Court.",
      "publishedAt": "2023-11-06T05:23:48Z",
      "title": "Why one survivor of domestic violence wants the Supreme Court to uphold a gun control law",
      "url": "https://apnews.com/debeb3aeaabc6c81dcdb369963ea2bec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/70d899d415bf443e8c821138c64762e5/1920.jpeg"
    },
    {
      "author": "SALLY HO and GARANCE BURKE",
      "description": "Some are orphans, others seized from their parents. Many are older and have overwhelming needs or disabilities. Most bear the scars of trauma from being hauled between foster homes, torn from siblings or sexually and physically abused.",
      "publishedAt": "2023-11-06T05:17:25Z",
      "title": "Inspired by online dating, AI tool for adoption matchmaking falls short for vulnerable foster kids",
      "url": "https://apnews.com/f803bf3faa02bc90d285e68b1d2bc560",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9b547f18fc34822bb5851dd5b78bcdd/3000.jpeg"
    },
    {
      "author": "LARRY LAGE",
      "description": "ANN ARBOR, Mich. (AP) — A former employee at a Big Ten football program said Monday it was his job to steal signs and he was given details from multiple conference schools before his team played Michigan to compile a spreadsheet of play-calling signals used by the Wolverines last year.",
      "publishedAt": "2023-11-06T21:00:43Z",
      "title": "Ex-college football staffer shared docs with Michigan, showing Big Ten team had Wolverines' signs",
      "url": "https://apnews.com/452b6a83bb0d0a3707f633af72fe92ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12e0540787e341f59e96620df6f59567/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}