{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, ERIC TUCKER, JILL COLVIN and MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Donald Trump became the first former American president to be convicted of felony crimes Thursday as a New York jury found him guilty of all 34 charges in a scheme to illegally influence the 2016 election through a hush money payment to a porn actor who said the two had sex.",
      "publishedAt": "2024-05-30T04:03:01Z",
      "title": "Guilty: Trump becomes first former US president convicted of felony crimes",
      "url": "https://apnews.com/85558c6d08efb434d05b694364470aa0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfe9e0b99f5848a3b688044c876857aa/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JILL COLVIN, MICHELLE L. PRICE and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — Donald Trump’s conviction on 34 felony counts marks the end of the former president’s historic hush money trial, but the fight over the case is far from over.",
      "publishedAt": "2024-05-30T22:35:31Z",
      "title": "Here's what you should know about Donald Trump's conviction in his hush money trial",
      "url": "https://apnews.com/a70941a7cd367f7b2aa3218ea91ad922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bfe9e0b99f5848a3b688044c876857aa/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — Being convicted of a felony — let alone 34 of them – is the kind of blow that would normally tank any politician's ambitions. Donald Trump will instead try to turn what might otherwise be a career-ending judgment into campaign fuel.",
      "publishedAt": "2024-05-31T04:07:16Z",
      "title": "Trump will try to turn his guilty verdict into campaign fuel",
      "url": "https://apnews.com/4629840240cb308c5eae335532ad17ed",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9ac19339ceff44a892d9e64ffa5fb6bd/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, MICHELLE L. PRICE and JILL COLVIN",
      "description": "NEW YORK (AP) — History happened just as everyone was about to leave for the day.",
      "publishedAt": "2024-05-31T00:57:39Z",
      "title": "The verdict: Inside the courtroom as Donald Trump learned he had been convicted",
      "url": "https://apnews.com/a50d853c8d10de2caf179970500b11a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2743aef1d8354d94a242e8f2befb68aa/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Republican lawmakers reacted with immediate fury on Thursday as a New York jury convicted former President Donald Trump on 34 counts of falsifying business records to influence the 2016 election, speaking out with near unanimity in questioning the legitimacy of the trial and how it was conducted.",
      "publishedAt": "2024-05-30T23:54:32Z",
      "title": "Republican lawmakers react with fury to Trump verdict and rally to his defense",
      "url": "https://apnews.com/c8193404866565c55b093086890cbef8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/391f65a842984f1c9628864d8b6cf4b0/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. and Britain struck 13 Houthi targets in several locations in Yemen on Thursday in response to a recent surge in attacks by the Iran-backed militia group on ships in the Red Sea and Gulf of Aden, three U.S.",
      "publishedAt": "2024-05-30T21:33:16Z",
      "title": "US and Britain strike Houthi rebel targets in Yemen after surge in shipping attacks",
      "url": "https://apnews.com/9f13a9739a139abfecb6fdc499280a89",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f9d46cb6d944ba8947006c21f473b6c/2000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI and SHEIKH SAALIQ",
      "description": "SAMASTIPUR, India (AP) — Narendra Modi swept to power a decade ago on promises to transform India’s economy, and it would be hard to argue he hasn’t made strides. As he seeks a third term as prime minister, the country’s economic growth is the envy of the world, its stock markets are booming, and new buildings and highways are popping up everywhere.",
      "publishedAt": "2024-05-31T04:26:03Z",
      "title": "Modi touts India's roaring economy as he seeks reelection, but many feel left behind",
      "url": "https://apnews.com/b243400ef1312bd1c71a0ae3ebb0481e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/748ebec5dc7446e7ae2f57fa0b7c4e5a/3000.jpeg"
    },
    {
      "author": "TERESA DE MIGUEL, MEGAN JANETSKY AND RODRIGO ABD",
      "description": "Aktun Tuyul Cave System, MEXICO (AP) — Rays of sunlight slice through pools of crystal water as clusters of fish cast shadows on the limestone below. Arching over the emerald basin are walls of stalactites dripping down the cavern ceiling, which opens to a dense jungle.",
      "publishedAt": "2024-05-31T04:32:18Z",
      "title": "In Mexico's Yucatan peninsula, a hidden underground world under threat by the Maya Train",
      "url": "https://apnews.com/ce6db57e7043988a0ce4f04ef90a84ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f0179cd02233474db5dfb402d9dfa71b/3000.jpeg"
    },
    {
      "author": "DANICA KIRKA",
      "description": "LONDON (AP) — What did you do in the war, Granny?For British women who came of age during World War II, the answer to that question is often: quite a lot.",
      "publishedAt": "2024-05-31T05:04:25Z",
      "title": "Women were barred from combat during WWII. But they helped ensure the Allies' D-Day success",
      "url": "https://apnews.com/368259471e91c906309abb21b915086f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c28ba72871344608b6348a78e6ad3c5c/3000.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA",
      "description": "Earning her bachelor’s degree from the University of California at Riverside was surreal for Angelina Chavez, the culmination of overcoming her imposter syndrome and embracing the efforts of her mothers, who walked the stage with her during the Latinx ceremony.",
      "publishedAt": "2024-05-31T04:11:14Z",
      "title": "Degree attainment rates are increasing for US Latinos but pay disparities remain",
      "url": "https://apnews.com/c1fbbeee1368831a720cf70e533fccb4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/59f7c0d807774043b08268257f3af851/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}