{
  "articles": [
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — As the Earth sizzled through a summer with four of the hottest days ever measured, Vice President Kamala Harris and former President Donald Trump have starkly different visions on how to address a changing climate while ensuring a reliable energy supply.",
      "publishedAt": "2024-08-31T04:04:27Z",
      "title": "Harris and Trump offer starkly different visions on climate change and energy",
      "url": "https://apnews.com/0989a331574665365330b21108f7f9b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/066c637bf9bf490aad1e54ae39119a26/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — At first glance, there's little that a 78-year-old former president and a 23-year-old internet personality might have in common.Donald Trump admitted in a recent appearance on Adin Ross' show that he only “more or less” understood livestreaming, the publishing of live video on social media.",
      "publishedAt": "2024-08-31T04:01:54Z",
      "title": "Trump courts conservative male influencers to try to reach younger men",
      "url": "https://apnews.com/dc293b71917193920e751d93030fabae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cded91040e0e4808848f26f7de73c5a7/3000.jpeg"
    },
    {
      "author": "ALI SWENSON, MORIAH BALINGIT and AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — In her welcoming remarks at Moms for Liberty’s annual gathering in the nation’s capital on Friday, the group’s co-founder, Tiffany Justice, urged members to “fight like a mother” against the Democratic presidential ticket.",
      "publishedAt": "2024-08-31T20:04:50Z",
      "title": "Moms for Liberty fully embraces Trump and widens role in national politics as election nears",
      "url": "https://apnews.com/7c252c611b5bc73c333a24392b979372",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e371b812d8cc4d63b5f11dfa6dbecbda/3000.jpeg"
    },
    {
      "author": null,
      "description": "JOHNSTOWN, Pa. (AP) — Police said Saturday that a man will face misdemeanor charges after he stormed into the press area at Donald Trump's rally in Johnstown, Pennsylvania, before being surrounded by authorities and eventually subdued with a Taser as the former president spoke at the campaign stop.",
      "publishedAt": "2024-08-30T22:32:46Z",
      "title": "Police say a man will face charges after storming into the press area at a Trump rally",
      "url": "https://apnews.com/68fe78b79ae65556c4efc850e142998c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0bd60d54c5a04b079b67739c73fa9979/3000.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — The blocking of social media platform X in Brazil divided users and politicians over the legitimacy of the ban, and many Brazilians on Saturday had difficulty and doubts over navigating other social media in its absence.",
      "publishedAt": "2024-08-31T21:38:22Z",
      "title": "On the first day without X, many Brazilians say they feel disconnected from the world",
      "url": "https://apnews.com/1e896a1daedeaed6a09cf27205feb08a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/46bd73bfb66c49ed844ca1da0c19b900/1920.jpeg"
    },
    {
      "author": null,
      "description": "BOVINA, Miss. (AP) — Seven people were killed and dozens were injured in Mississippi after a commercial bus overturned on Interstate 20 on Saturday morning, according to the Mississippi Highway Patrol.",
      "publishedAt": "2024-08-31T17:20:15Z",
      "title": "Mississippi bus crash kills 7 people and injures 37",
      "url": "https://apnews.com/eb16d10eed0abcdfd30f053d899a5767",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69aa2e0d4f3f4bb898589c86d7c2b1e9/1920.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "SAN DIEGO (AP) — Arrests for illegal border crossings from Mexico during August are expected to rise slightly from July, officials said, possibly ending a streak of five straight monthly declines but the numbers are hovering near four-year lows.",
      "publishedAt": "2024-08-31T15:21:28Z",
      "title": "Border arrests are expected to rise slightly in August but are hovering near 4-year lows",
      "url": "https://apnews.com/12357799e15b1b1f5399dac19184fcc4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c070465ec37c4760a0debb0e71503a29/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "JERUSALEM (AP) — A campaign to inoculate children in Gaza against polio and prevent the spread of the virus has begun, the Health Ministry said Saturday, as Palestinians in the Hamas-governed enclave and the occupied West Bank reeled from Israel's military offensives.",
      "publishedAt": "2024-08-31T13:26:37Z",
      "title": "Polio vaccine campaign begins in Gaza a day before fighting is expected to pause",
      "url": "https://apnews.com/b3016b2ac2085c103b412a437f7579eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b52b3a9f53944945b393a7d23efef2ed/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL",
      "description": "JERUSALEM (AP) — The U.N. health agency and partners are launching a campaign starting Sunday to vaccinate 640,000 Palestinian children in Gaza against polio, an ambitious effort amid a devastating war that has destroyed the territory's healthcare system.",
      "publishedAt": "2024-08-31T04:05:00Z",
      "title": "9 days, 640,000 children, 1.3M doses. The plan to vaccinate Gaza's young against polio",
      "url": "https://apnews.com/3acaa0dcf9744810c51032f45e609a2f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a27176603c443899973224749ef4eee/1920.jpeg"
    },
    {
      "author": "JOCELYN GECKER",
      "description": "SACRAMENTO, Calif. (AP) — When she was in fifth grade, Scarlett Goddard Strahan started to worry about getting wrinkles.By the time she turned 10, Scarlett and her friends were spending hours on TikTok and YouTube watching influencers tout products for achieving today’s beauty aesthetic: a dewy, “glowy,” flawless complexion.",
      "publishedAt": "2024-08-31T04:08:10Z",
      "title": "Young girls are using anti-aging products they see on social media. The harm is more than skin deep",
      "url": "https://apnews.com/f59bb09114ab93323e3a47197a1ad914",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b40a4722bbc14a988b39744963977e80/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}