{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — The United Nations was forced to stop deliveries of food and other necessities to Gaza on Friday and warned of the growing possibility of widespread starvation after internet and telephone services collapsed in the besieged enclave because of a lack of fuel.",
      "publishedAt": "2023-11-17T08:30:09Z",
      "title": "UN stops delivery of food and supplies to Gaza as communications blackout hinders aid coordination",
      "url": "https://apnews.com/1811384fac6394329dd71e3aaf461eb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f451460169a441ce97eff16ddb8cc921/1920.jpeg"
    },
    {
      "author": "DANICA KIRKA and SAM McNEIL",
      "description": "Abbey Onn lost her aunt and a young cousin when Hamas attackers rampaged through Kibbutz Nir Oz on Oct. 7. Now Onn is worried about what will happen to three other family members taken hostage that day as Israel pounds Gaza City in a bid to end Hamas’ control of the Gaza Strip.",
      "publishedAt": "2023-11-17T05:33:35Z",
      "title": "'Bring them home': As the battle for Gaza rages, hostage families wait with trepidation",
      "url": "https://apnews.com/9d4f1c996aaf5d66925c6a4e82a0076c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81dc30c5c18b473aac5ff689201d8265/2000.jpeg"
    },
    {
      "author": "LEANNE ITALIE",
      "description": "NEW YORK (AP) — Emily Tony Korenberg Hand celebrated her eighth birthday last year romping with friends and family among the jugglers, acrobats and stilt walkers for her circus-themed party at Kibbutz Be'eri, not far from the Gaza Strip.",
      "publishedAt": "2023-11-17T14:04:55Z",
      "title": "He was told his 9-year-old daughter was dead. Now she's believed to be alive and a hostage in Gaza",
      "url": "https://apnews.com/226eb289c8f69158c6fec4fb2ffaaf6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b6820f569bb421db8f80c7f52549f97/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — The chairman of the House Ethics Committee announced Friday he has filed a resolution to force a vote on expelling Rep. George Santos, R-N.Y., from Congress, one day after the committee issued a withering report detailing substantial evidence that Santos converted campaign donations for his own personal use.",
      "publishedAt": "2023-11-17T16:02:49Z",
      "title": "Ethics chairman launches a new bid to expel George Santos after a withering report on his conduct",
      "url": "https://apnews.com/1d9e63b5a4e8b49912fec0c141fc3a84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8bcf8803f6c64e4cbf3499e402f8b852/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT",
      "description": "DES MOINES, Iowa (AP) — The Republicans battling to be the alternative to former President Donald Trump will come together for what an influential Christian organization in Iowa is billing as a friendly conversation on politics and their world views.",
      "publishedAt": "2023-11-17T05:06:39Z",
      "title": "DeSantis, Haley and Ramaswamy will meet in Iowa for a 'family discussion' on politics",
      "url": "https://apnews.com/805c24ebcf92a622a60ee3461616032e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a08b320ef2124422b268e56db084cf47/3000.jpeg"
    },
    {
      "author": "SARAH RANKIN",
      "description": "HENRICO, Va. (AP) — Susanna Gibson lost her Virginia legislative race this month, but she may not be done with politics.",
      "publishedAt": "2023-11-17T15:15:19Z",
      "title": "Defeated Virginia candidate whose explicit videos surfaced says she may not be done with politics",
      "url": "https://apnews.com/b7534f8c3f4d099dfd3d96701a125504",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1251b158d6774f15b0860c6151fdcf65/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — The U.S. flu season is underway, with at least seven states reporting high levels of illnesses and cases rising in other parts of the country, health officials say.The Centers for Disease Control and Prevention posted new flu data on Friday, showing very high activity last week in Louisiana, and high activity in Alabama, Florida, Georgia, Mississippi, New Mexico and South Carolina.",
      "publishedAt": "2023-11-17T17:24:51Z",
      "title": "The flu is soaring in seven US states and rising in others, health officials say",
      "url": "https://apnews.com/8f92ae888f389f6a9997225ac395316c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a38227d59c234ba8a17d3fabafcc13ae/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — British author A.S. Byatt, who wove history, myth and a sharp eye for human foibles into books that included the Booker Prize-winning novel “Possession,” has died at the age of 87. Byatt’s publisher, Chatto &amp; Windus, said Friday that the author, whose full name was Antonia Byatt, died “peacefully at home surrounded by close family\" on Thursday.",
      "publishedAt": "2023-11-17T14:28:28Z",
      "title": "Author A.S. Byatt, who wrote best-seller 'Possession' and had a beetle named after her, dies at 87",
      "url": "https://apnews.com/bb4f901f7131d3aa338738bbcc79f62b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ff8d47a62cf84d72babb3464bb2a978e/2086.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "Advertisers are fleeing social media platform X over concerns about their ads showing up next to pro-Nazi content and hate speech on the site in general, with billionaire owner Elon Musk inflaming tensions with his own tweets endorsing an antisemitic conspiracy theory.",
      "publishedAt": "2023-11-17T14:16:31Z",
      "title": "IBM and EU pull ads from Elon Musk's X as concerns about antisemitism fuel backlash",
      "url": "https://apnews.com/83e68f03e9bf1d261c1a8c55066c4e59",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da765f2aa82742d38021f2b608ac1579/3000.jpeg"
    },
    {
      "author": "ALICIA RANCILIO",
      "description": "Festive TV programming is starting to stack up like toys in Santa’s sleigh.Holiday favorites like “A Charlie Brown Christmas” and “A Christmas Story” will soon return, along with new family friendly films including “Dashing Through the Snow” on Disney+ and Melissa McCarthy's “Genie” on Peacock.",
      "publishedAt": "2023-11-17T15:35:43Z",
      "title": "Spend this holiday TV season with Paddington, Melissa McCarthy, Lori Loughlin and more",
      "url": "https://apnews.com/9b8054d549978adc602f7a8b5b825535",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1bb04557ee4c4c239c25c436ffaf0dd4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}