{
  "articles": [
    {
      "author": "MSTYSLAV CHERNOV and LORI HINNANT",
      "description": "ANDRIIVKA, Ukraine (AP) — The Russian bullet struck the sergeant just above the left ear. The leader of the Ukrainian platoon was down. Headquarters radioed a battlefield promotion to the private who had called him “brother” — a man known as Courier.",
      "publishedAt": "2023-09-21T04:01:26Z",
      "title": "Inside a Ukrainian brigade’s battle ‘through hell’ to reclaim a village on the way to Bakhmut",
      "url": "https://apnews.com/684873be8aad1b1502ff8d67ea48afac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbc04b834bf6473b9cd10be987989fb8/3000.jpeg"
    },
    {
      "author": "ROB GILLIES",
      "description": "TORONTO (AP) — When Prime Minister Justin Trudeau stood up in Parliament and said India may have been involved in the killing of a Canadian citizen, the muted international response offered a lesson in modern geopolitics.",
      "publishedAt": "2023-09-21T04:03:48Z",
      "title": "Canada gets muted allied support after alleging India may have been involved in killing of Canadian",
      "url": "https://apnews.com/8db67791c0d647c6051bb65f9283e45f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7282ecdc1d9641a2958d459b04222864/3000.jpeg"
    },
    {
      "author": "REBECCA SANTANA and ELLIOT SPAGAT",
      "description": "WASHINGTON (AP) — The Biden administration said Wednesday that it was granting temporary legal status to hundreds of thousands of Venezuelans who are already in the country — quickly making them eligible to work — as it grapples with growing numbers of people fleeing the South American country and elsewhere to arrive at the U.S.",
      "publishedAt": "2023-09-21T00:23:37Z",
      "title": "Under pressure over border, Biden administration to protect hundreds of thousands of Venezuelans",
      "url": "https://apnews.com/b914be14aaeef14eb01bd10ee23067f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/033a90e3a26f45c5a240204346b40eca/3000.jpeg"
    },
    {
      "author": "MARK STEVENSON",
      "description": "HUEHUETOCA, Mexico (AP) — Thousands of migrants riding atop railway cars in Mexico this week or waiting in mile-long lines by the tracks to hitch a ride to the U.S. have triggered the closure of one U.S.",
      "publishedAt": "2023-09-21T04:08:04Z",
      "title": "Wave of migrants that halted trains in Mexico started with migrant smuggling industry in Darien Gap",
      "url": "https://apnews.com/7fa1f413f816d036ed06f0ef7c5d05b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e62f0615c6f44e789cd4ce5ab7a293c2/3000.jpeg"
    },
    {
      "author": "TED ANTHONY",
      "description": "UNITED NATIONS (AP) — Work together. Go it alone. The apocalypse is at hand. But the future can be bright. The squabbles never cease, yet here are human beings from all across the world — hashing out conflicts with words and processes, convening under one roof, trying to write the next chapter of a common dream.",
      "publishedAt": "2023-09-20T22:42:30Z",
      "title": "Behind all the speechmaking at the UN lies a basic, unspoken question: Is the world governable?",
      "url": "https://apnews.com/08c1edb481c05dbb0a454ae5a3cbbb3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e6da452a9924acba5e7bcf40e251d27/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "HARDIN, Mont. (AP) — Yolanda Fraser is back near a ragged chain-link fence, blinking through tears as she tidies up flowers and ribbons and a pinwheel twirls in the breeze at a makeshift roadside memorial in a small Montana town.",
      "publishedAt": "2023-09-21T04:05:02Z",
      "title": "A grandmother seeks justice for Native Americans after thousands of unsolved deaths, disappearances",
      "url": "https://apnews.com/a9155ee50f769976c716a729ceb29e65",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c380816546a49ea84b8a04776a8ee61/3000.jpeg"
    },
    {
      "author": "PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — Texas Attorney General Ken Paxton attacked his Republican rivals and displayed an openness to challenging U.S. Sen. John Cornyn in 2026 while speaking out Wednesday for the first time since his acquittal on corruption charges at his impeachment trial.",
      "publishedAt": "2023-09-21T03:45:46Z",
      "title": "Texas AG Ken Paxton attacks rivals, doesn't rule out US Senate run in first remarks since acquittal",
      "url": "https://apnews.com/7e6443015fd5f8fc2be6148edb52fda9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f9f4c97099042d9835aadf775e3548d/2800.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "MAQUOKETA, Iowa (AP) — Donald Trump began a fall press Wednesday to lock in thousands of Republican caucusgoers in early-voting Iowa, where the former president faces sky-high expectations in his campaign for a White House comeback.",
      "publishedAt": "2023-09-20T19:17:00Z",
      "title": "Trump launches his fall push in Iowa to lock in his lead before the first Republican caucuses",
      "url": "https://apnews.com/075dad8a101cf106495974c846b1922c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d2dd4d83d1a4bcbb8bbcd0ddf07ff36/1920.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "BRIGHTON, Colo. (AP) — Two Denver-area police officers who put Elijah McClain in a neck hold ignored his pleas of “I can’t breathe” before the Black man was injected by paramedics with a powerful sedative and died, prosecutors said Wednesday, as a trial began over the 2019 confrontation that became a rallying cry for protests and spurred police reform.",
      "publishedAt": "2023-09-20T06:03:59Z",
      "title": "Officers who put Elijah McClain in neck hold ignored pleas of 'I can't breathe,' prosecutors say",
      "url": "https://apnews.com/9f976b1e4b9ae52bf824ae5b68ba6fb6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ccd3d9ae1e074bfc8f63efff2c8234a5/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "General Motors and Stellantis announced fresh layoffs Wednesday that they blamed on damage from the United Auto Workers strike, and the labor standoff grew more tense just two days before the union was expected to call for new walkouts.",
      "publishedAt": "2023-09-20T18:13:32Z",
      "title": "Jeep maker Stellantis makes a new contract offer as auto workers prepare to expand their strike",
      "url": "https://apnews.com/dce8eb39a1e36f2cc54a5c1e4210e1f3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb209b158cb0473292913b0e59ac19f7/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}