{
  "articles": [
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Hours after a U.S.-brokered ceasefire to end the war between Israel and Hezbollah went into effect, Lebanon woke up to the sound of celebratory gunfire instead of Israeli airstrikes and drones buzzing overhead.",
      "publishedAt": "2024-11-29T05:04:33Z",
      "title": "Battered by war and divisions, Lebanon faces a long list of challenges after ceasefire deal",
      "url": "https://apnews.com/be0df65fa96162ca5ca02da73f172614",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d45e4b6121184d11b1b2cc41f9fdafea/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEIRUT (AP) — Thousands of Syrian insurgents pushed on with their advances on government-held areas in the country’s northwest, reaching the outskirts of Syria’s second largest city Aleppo and wrestling control of several strategic towns and villages along the way, activists and fighters said Friday.",
      "publishedAt": "2024-11-29T10:20:34Z",
      "title": "Syria insurgents push their advance toward 2nd largest city Aleppo",
      "url": "https://apnews.com/9c07da6f83036f34d4b18a479de9d085",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6ad17c313c454d53868637fe1765dce9/3000.jpeg"
    },
    {
      "author": null,
      "description": "MEXICO CITY (AP) — Mexican President Claudia Sheinbaum said Thursday she is confident that a tariff war with the United States can be averted.",
      "publishedAt": "2024-11-28T17:59:18Z",
      "title": "Mexican president says she is confident that a tariff war with the US can be averted",
      "url": "https://apnews.com/aa0bb32d874a785ce7460b36808b53e1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a4dd38b75034d8aba11b8a7b2c79f76/1920.jpeg"
    },
    {
      "author": "MATTHEW DALY",
      "description": "WASHINGTON (AP) — President-elect Donald Trump is set to create a National Energy Council that he says will establish American “energy dominance” around the world as he seeks to boost U.S.",
      "publishedAt": "2024-11-29T05:11:00Z",
      "title": "Donald Trump's call for 'energy dominance' is likely to run into real-world limits",
      "url": "https://apnews.com/24529ef90795fb854e4eb35f75c18247",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/18ee3569f1794bc299cd8d7baad33733/3000.jpeg"
    },
    {
      "author": "ANNE D'INNOCENZIO",
      "description": "NEW YORK (AP) — It's show time.After weeks of pushing early deals, retailers in the United States and some other countries are promising bigger discounts on Black Friday, the sales event that still reigns as the unofficial kickoff of the holiday shopping season even if it's lost some luster.",
      "publishedAt": "2024-11-29T05:19:09Z",
      "title": "Retailers bank on Black Friday to energize bargain-hungry holiday shoppers",
      "url": "https://apnews.com/2678816a0683519071426a991d89fecb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2dd58181565a4a62bdc297ced65d32b7/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "On a bright winter day, workers at a Ukrainian thermal power plant repair its heavily damaged equipment as drops of water from melted snow leak through gaping holes in its battered roof. Several weeks earlier, the facility was targeted by a Russian air attack that left scorch marks, shrapnel scars on the walls, and missile fragments scattered across the production floor.",
      "publishedAt": "2024-11-29T07:09:54Z",
      "title": "Ukrainian energy workers carry out repairs despite Russia's pounding of the country's power grid",
      "url": "https://apnews.com/3490e01e850bd4d1b07d3ae190b6f91c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf8ef62998f648ebbf50c344fabb6f43/3000.jpeg"
    },
    {
      "author": "MEGAN JANETSKY and SONIA PERÉZ D.",
      "description": "GUATEMALA CITY (AP) — Sergio Mena's life dissolved in hours.After years resisting President Daniel Ortega, the rural activist fled Nicaragua in 2018, joining thousands of protesters fleeing a yearslong crackdown on dissent.",
      "publishedAt": "2024-11-29T06:10:50Z",
      "title": "Stripped of citizenship, these Nicaraguans live in limbo scattered across the world",
      "url": "https://apnews.com/b391e05eacd7dc3cf3968f5fb23987f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b0ac24e8fe0f48908358f4f905ca9ed7/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS and PETER MORRISON",
      "description": "DUBLIN (AP) — Ireland is voting Friday in a parliamentary election that will decide the next government — and will show whether Ireland bucks the global trend of incumbents being ousted by disgruntled voters after years of pandemic, international instability and a cost-of-living pressures.",
      "publishedAt": "2024-11-29T07:07:24Z",
      "title": "Ireland votes in a close-run election where incumbents hope to cling on to power",
      "url": "https://apnews.com/987733afb259859d88c84ebb60203b09",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfa549f5d4c4467cb2ad683ab6e0a850/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — After more than five years of frenetic reconstruction work, Notre Dame Cathedral showed its new self to the world Friday, with rebuilt soaring ceilings and creamy good-as-new stonework erasing somber memories of its devastating fire in 2019.",
      "publishedAt": "2024-11-29T08:41:55Z",
      "title": "Notre Dame Cathedral unveils its new interior 5 years after devastating fire",
      "url": "https://apnews.com/0a6c183693b55a55e0dc3a909000cb02",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/260e3fc38ed74f89b9be4aa08d850693/3000.jpeg"
    },
    {
      "author": "TRAVIS LOLLER",
      "description": "ON BOARD THE SANTA TRAIN (AP) — Since 1943, the people of Appalachian Kentucky, Virginia, and Tennessee have looked forward to Santa's arrival. Not in a sleigh on their rooftops, but on a train. The Santa Train marks its 82nd running this year, bringing presents and joy to small towns along a 110-mile portion of the CSX rail line tucked into remote coal-country river valleys.",
      "publishedAt": "2024-11-29T05:15:35Z",
      "title": "Santa's annual train visit delivers hope and magic to one corner of coal country",
      "url": "https://apnews.com/0b757fdebde6f6134d2c5966c06d1dda",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c9f66e554df34802ae5bd63f6c77d856/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}