{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JACK JEFFERY and LEE KEATH",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli troops fought with Hamas militants on the edges of Gaza City on Thursday, as the Palestinian death toll rose above 9,000.",
      "publishedAt": "2023-11-02T07:17:05Z",
      "title": "Pressure rises on Israel to pause fighting and ease siege as battles intensify near Gaza City",
      "url": "https://apnews.com/6a398d4aeba979aef24960efc31eb772",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e334679a5d254e9289abcb648a3ba8c1/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "A growing list of Israeli officials have accepted responsibility for failing to prevent Hamas' brutal attack on Israeli communities during the Oct. 7 incursion that triggered the current Israel-Hamas war.",
      "publishedAt": "2023-11-02T14:34:54Z",
      "title": "Netanyahu has sidestepped accountability for failing to prevent Hamas attack, instead blaming others",
      "url": "https://apnews.com/fc430098bc31dd848af0e8b7cf52ce51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/81c592167ff545629b4bf51668fd5cd8/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK, TARA COPP and LOLITA BALDOR",
      "description": "WASHINGTON (AP) — The U.S. Senate, circumventing holds by Republican Sen. Tommy Tuberville, on Thursday confirmed the nominations of two senior military leaders, including the first female member of the Joint Chiefs of Staff.",
      "publishedAt": "2023-11-02T16:54:32Z",
      "title": "US Senate circumvents Tuberville holds and confirms new Air Force head, first female on Joint Chiefs",
      "url": "https://apnews.com/0c3a5441fb94887fdb0e1b1b65a399f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/353fbf79989c404a9cbd11b55b17e12d/3000.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Gaming giant Bally's paid Donald Trump’s company $60 million to buy the right to operate a public golf course in New York City, the former president's namesake son testified Thursday.",
      "publishedAt": "2023-11-02T16:04:56Z",
      "title": "Trial testimony reveals gambling giant Bally's paid $60 million to take over Trump's NYC golf course",
      "url": "https://apnews.com/c2f546361ce3b5f0bdcf2360320c6060",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f97e8eb7f5e64d5c95c6812f09e7df3b/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and NICHOLAS RICCARDI",
      "description": "ST. PAUL, Minn. (AP) — Minnesota Supreme Court justices appeared skeptical Thursday that states have the authority to block former President Donald Trump from the ballot, with some suggesting that Congress is best positioned to decide whether his role in the 2021 U.S.",
      "publishedAt": "2023-11-02T04:17:06Z",
      "title": "Minnesota justices appear skeptical that states should decide Trump's eligibility for the ballot",
      "url": "https://apnews.com/5cb50c1ee6432efe72fd643c31dec474",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e41944794ff84e9c8484441172290553/3000.jpeg"
    },
    {
      "author": "JONATHAN MATTISE and TRAVIS LOLLER",
      "description": "MEMPHIS, Tenn. (AP) — A former Memphis police officer changed his plea to guilty Thursday in the fatal beating of Tyre Nichols, becoming the first of five officers charged to reverse course, with prosecutors recommending up to 15 years in prison.",
      "publishedAt": "2023-11-02T16:29:23Z",
      "title": "Prosecutor: Former Memphis officer pleads guilty to state and federal charges in Tyre Nichols’ death",
      "url": "https://apnews.com/54495720ccd302067cda9539678aa0eb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c40f50affb049a3b26db51660fb5b56/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ and MICHAEL BALSAMO",
      "description": "NEW YORK (AP) — Federal agents on Thursday raided the home of a top fundraiser and longtime confidante to New York City Mayor Eric Adams, who abruptly ditched a planned White House meeting and flew home from Washington.",
      "publishedAt": "2023-11-02T18:45:33Z",
      "title": "Federal agents search home of fundraiser for New York City Mayor Eric Adams",
      "url": "https://apnews.com/92960ee4ff7c635ac759d3f2942c54c7",
      "urlToImage": ""
    },
    {
      "author": "MIKE STOBBE and MATTHEW PERRONE",
      "description": "NEW YORK (AP) — Fewer high school students are vaping this year, the government reported Thursday.In a survey, 10% of high school students said they had used electronic cigarettes in the previous month, down from 14% last year.",
      "publishedAt": "2023-11-02T17:07:17Z",
      "title": "Vaping by high school students dropped this year, says US report",
      "url": "https://apnews.com/d1f44bd3d8df6960215a14454f5e2e6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5016f495ca594f2f8c04889ed04ffe7b/3000.jpeg"
    },
    {
      "author": "MARIA SHERMAN",
      "description": "LOS ANGELES (AP) — The final Beatles recording is here.Titled “Now and Then,” the almost impossible-to-believe track is four minutes and eight seconds of the first and only original Beatles recording of the 21st century.",
      "publishedAt": "2023-11-02T14:06:37Z",
      "title": "Listen to the last new Beatles' song with John, Paul, George, Ringo and AI tech: 'Now and Then'",
      "url": "https://apnews.com/fbce70071b4624f0d90bd18347f20fc6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3f950a708724e56a0ad320c630572d3/1920.jpeg"
    },
    {
      "author": "STEPHEN WHYNO and PAT GRAHAM",
      "description": "It took the NHL until 1979 to mandate helmets and goalie masks for new players. It wasn't until 2013 that eye-protecting visors became mandatory — grandfathered in for veterans, of course.",
      "publishedAt": "2023-11-02T18:33:43Z",
      "title": "Death of a player from a skate to the neck reignites hockey's stubborn debate over protective gear",
      "url": "https://apnews.com/d1016a502de6b49eefc4c00ee0fac9f9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/40b74e8480134fd7b5e53b9fd71d0210/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}