{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMYA KULLAB, RAVI NESSMAN and MATTHEW LEE",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — A massive blast rocked a Gaza City hospital packed with wounded and other Palestinians seeking shelter Tuesday, killing hundreds of people, the Hamas-run Health Ministry said.",
      "publishedAt": "2023-10-17T04:58:59Z",
      "title": "After blast kills hundreds at Gaza hospital, Hamas and Israel trade blame as rage spreads in region",
      "url": "https://apnews.com/e062825a375d9eb62e95509cab95b80c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/035ca65356264d0ba90d20d12e89fd5a/1920.jpeg"
    },
    {
      "author": "COLLEEN LONG, AAMER MADHANI and CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — President Joe Biden’s efforts to tamp down tensions in the escalating war between Israel and Hamas faced major setbacks even before he departed for the Middle East on Tuesday, as Jordan called off the president's planned summit with Arab leaders after a deadly explosion at a Gaza hospital killed hundreds.",
      "publishedAt": "2023-10-17T20:11:39Z",
      "title": "Biden will stress humanitarian aid, avoiding deeper conflict in Israel but is scrapping Jordan stop",
      "url": "https://apnews.com/7688f27195afe94f89c22c66cf7b5b72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0b26649ec8f5494c87e6be0f597eb45b/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — Hamas and Israel have both been accused of breaking international law during their latest conflict, and the United Nations says it is collecting evidence of war crimes by all sides.",
      "publishedAt": "2023-10-17T16:45:20Z",
      "title": "How international law applies to war, and why Hamas and Israel are both alleged to have broken it",
      "url": "https://apnews.com/cd019114fac21c919000ef80276980d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d14e2576ac9f42128398064caeec5f40/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, FARNOUSH AMIRI and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Signaling more turmoil ahead, Republicans rejected Rep. Jim Jordan for House speaker on a first ballot Tuesday, as a surprising 20 holdouts denied the hard-charging ally of Donald Trump the GOP majority needed to seize the gavel.",
      "publishedAt": "2023-10-17T04:08:54Z",
      "title": "Republicans reject Rep. Jim Jordan for House speaker on a first ballot, signaling more turmoil ahead",
      "url": "https://apnews.com/f2b2bf9dc834742bde93d5fc918d9940",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/96c7c123aa5d4c8db1af6324affd51c3/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JENNIFER PELTZ",
      "description": "NEW YORK (AP) — Donald Trump returned Tuesday to the civil fraud trial that imperils his real estate empire, watching and deploring the case as an employee and an outside appraiser testified that his company essentially put a thumb on the scale when sizing up his properties' value.",
      "publishedAt": "2023-10-17T04:26:15Z",
      "title": "Trump returns to his civil fraud trial, hears an employee and an appraiser testify against him",
      "url": "https://apnews.com/067501b1d742d4dccba2521ac3262fdb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/89b879d899b349b28f513234286a4c3e/1920.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The United States has quietly delivered a small number of long-range ballistic missiles that Ukraine said it urgently needed and that President Joe Biden promised last month, Ukrainian President Volodymyr Zelenskyy confirmed Tuesday, saying they were used on the battlefield against Russia and “executed very accurately.”",
      "publishedAt": "2023-10-17T14:27:44Z",
      "title": "Ukraine uses US-provided long-range ATACMS missiles against Russian forces for the first time",
      "url": "https://apnews.com/5fd95f32449d14da22b82d57d6ccab22",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5c230fd917d411abbe9ee9de437b445/3000.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "RIO DE JANEIRO (AP) — A draft congressional report on Brazil's Jan. 8 riots on Tuesday accused ex-President Jair Bolsonaro of being the insurrection's mastermind and recommended he be criminally charged with attempting to stage a coup.",
      "publishedAt": "2023-10-17T18:36:40Z",
      "title": "Congressional draft report in Brazil recommends charges for Bolsonaro over Jan. 8 insurrection",
      "url": "https://apnews.com/65c267a6d5d40112b067bff25326601b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0c5073cd46434c9b9f187c9cc5daa426/3000.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "Are 3D mammograms better than standard 2D imaging for catching advanced cancers?A clinical trial is recruiting thousands of volunteers — including a large number of Black women who face disparities in breast cancer death rates — to try to find out.",
      "publishedAt": "2023-10-17T13:13:39Z",
      "title": "Breast cancer is deadlier for Black women. A study of mammograms could help close the gap",
      "url": "https://apnews.com/62ed31ae0b53fd7825897654482114b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d2cbd5744344adabd14c1411a3d6a01/3000.jpeg"
    },
    {
      "author": "JESSE BEDAYN and MATTHEW BROWN",
      "description": "DENVER (AP) — The remains of at least 189 people have been removed from a Colorado funeral home, up from an initial estimate of about 115 when the decaying and improperly stored bodies were discovered two weeks ago, officials said Tuesday.",
      "publishedAt": "2023-10-17T22:37:32Z",
      "title": "Remains of at least 189 people removed from Colorado funeral home, up from 115, officials say",
      "url": "https://apnews.com/d83e65897404bef632dbb7ad4a8e4bfe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e28b5345c4664e778efbb5de18987bfc/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — Special prosecutors are seeking to recharge actor Alec Baldwin in the fatal shooting of a cinematographer on the set of a Western movie in 2021, describing Tuesday their preparations to present new information to a grand jury.",
      "publishedAt": "2023-10-17T18:35:38Z",
      "title": "Prosecutors seeking to recharge Alec Baldwin in fatal shooting on set of Western movie 'Rust'",
      "url": "https://apnews.com/f337b3bdc267d30fef67bb7946d738e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a1eedfac788421b8798926f4e86b6c8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}