{
  "articles": [
    {
      "author": "ILLIA NOVIKOV and HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Russia launched 122 missiles and dozens of drones against Ukrainian targets, officials said Friday, killing at least 30 civilians across the country in what an air force official called the biggest aerial barrage of the war.",
      "publishedAt": "2023-12-29T08:42:21Z",
      "title": "Russia launches the biggest aerial barrage of the war and kills 30 civilians, Ukraine says",
      "url": "https://apnews.com/fe3fb596cdea0035573a6a677f17070c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/80b5834dba3a43f9893553e0691e3e7d/1920.jpeg"
    },
    {
      "author": "MONIKA SCISLOWSKA",
      "description": "WARSAW, Poland (AP) — Poland’s defense forces said an unknown object entered the country’s airspace Friday morning from the direction of Ukraine and then vanished off radars, and that all indications pointed to it being a Russian missile.",
      "publishedAt": "2023-12-29T12:09:19Z",
      "title": "Poland says 'everything indicates' a Russian missile briefly entered its airspace and left",
      "url": "https://apnews.com/a1edac1401e5f8be4d72488518287281",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/352b97be936742efaf70e366e096bf80/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and JACK JEFFERY",
      "description": "RAFAH, Gaza Strip (AP) — Tens of thousands of Palestinians streamed into an already crowded town at the southernmost end of Gaza in recent days, fleeing Israel’s bombardment of the center of the strip, as a senior U.N.",
      "publishedAt": "2023-12-29T08:58:55Z",
      "title": "Palestinians stream into a southern Gaza town as Israel expands its offensive in the center",
      "url": "https://apnews.com/d36675194a22db54970f38c1c2ed3937",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c94ee577fdb4a109789cc9205a115f4/1920.jpeg"
    },
    {
      "author": "TARA COPP",
      "description": "WASHINGTON (AP) — A large pool of dark liquid festering on the floor. No fresh air. Computer displays that would overheat and ooze out a fishy-smelling gel that nauseated the crew. Asbestos readings 50 times higher than the Environmental Protection Agency’s safety standards.",
      "publishedAt": "2023-12-29T05:44:26Z",
      "title": "The Air Force said its nuclear missile capsules were safe. But toxic dangers lurked, documents show",
      "url": "https://apnews.com/f17d9f56e01e2750990d294d4b51a25c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e44ed19945ba4ded83c992baaa8fa013/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO and ANDREW DeMILLO",
      "description": "CHICAGO (AP) — The 2024 elections will be dominated by the presidential contest and the battle for control of Congress, but another series of races is shaping up to be just as consequential.Crucial battles over abortion, gerrymandering, voting rights and other issues will take center stage in next year’s elections for state supreme court seats — 80 of them in 33 states.",
      "publishedAt": "2023-12-29T18:13:09Z",
      "title": "Abortion debate creates 'new era' for state supreme court races in 2024, with big spending expected",
      "url": "https://apnews.com/931a453131fac282815ae31b4f0ea271",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8679e7d546d494eb1dcc75640457e44/3000.jpeg"
    },
    {
      "author": "JEFF AMY",
      "description": "ATLANTA (AP) — A spate of false reports of shootings at the homes of public officials in recent days could be setting the stage for stricter penalties against so-called swatting in more states.U.S.",
      "publishedAt": "2023-12-29T16:54:31Z",
      "title": "How recent 'swatting' calls targeting officials may prompt heavier penalties for hoax police calls",
      "url": "https://apnews.com/d568818925c99c8cf17467f737b99e97",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d342b4da86784679a0bf60b704e40efc/3000.jpeg"
    },
    {
      "author": "LARRY NEUMEISTER",
      "description": "NEW YORK (AP) — Michael Cohen, Donald Trump’s onetime personal lawyer and fixer, says he unwittingly passed along to his attorney bogus artificial intelligence-generated legal case citations he got online before they were submitted to a judge.",
      "publishedAt": "2023-12-29T18:42:54Z",
      "title": "Ex-Trump lawyer Michael Cohen says he unwittingly sent AI-generated fake legal cases to his attorney",
      "url": "https://apnews.com/777ace9cc34aa0e56398fd47a1d6b420",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea2bb51f2a064ef0addd25200b9e3c20/3000.jpeg"
    },
    {
      "author": "SAMANTHA HENDRICKSON",
      "description": "COLUMBUS, Ohio (AP) — Republican Gov. Mike DeWine vetoed a measure Friday that would have banned gender-affirming care for minors and transgender athletes’ participation in girls and women’s sports, in a break from members of his party who championed the legislation.",
      "publishedAt": "2023-12-29T15:47:41Z",
      "title": "Ohio’s GOP governor vetoes ban on gender-affirming care, transgender athletes in girls sports",
      "url": "https://apnews.com/c615cafed4fc81d32010d47d8853efaf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b6166768694417a865c4b8be8c77098/3000.jpeg"
    },
    {
      "author": "GARY FIELDS",
      "description": "ALEXANDRIA, La. (AP) — Alfred King was lying in the parking lot of a small apartment building, mortally wounded when police in Alexandria, Louisiana, got to the intersection of 12th and Magnolia streets shortly before 1:30 a.m., Jan.",
      "publishedAt": "2023-12-29T05:25:44Z",
      "title": "Perspective: Children born poor have little margin for mistakes or bad decisions, regardless of race",
      "url": "https://apnews.com/318c9dbd5a01f5d9dd6e57198549dd5f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62f26f90122f4b1c95186fad595dbcd9/1920.jpeg"
    },
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "CHAPEL HILL, N.C. (AP) — Four days of waiting under the flickering fluorescent lights of UNC Hospitals' emergency room left Callum Bradford desperate for an answer to one key question.The transgender teen from Chapel Hill needed mental health care after overdosing on prescription drugs.",
      "publishedAt": "2023-12-29T05:25:04Z",
      "title": "For transgender youth in crisis, hospitals sometimes compound the trauma",
      "url": "https://apnews.com/0b1349f338d3110806fcbb2276e2e42b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ebd0455ccc744a8b81bc49bd02a0b0a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}