{
  "articles": [
    {
      "author": null,
      "description": "BLACK ROCK DESERT, Nev. (AP) — An unusual late-summer storm turned a week-long counterculture fest into a sloppy mess with tens of thousands of partygoers stuck in foot-deep mud and with no working toilets in the northern Nevada desert.",
      "publishedAt": "2023-09-02T20:16:14Z",
      "title": "Burning Man flooding strands tens of thousands at Nevada site; authorities are investigating 1 death",
      "url": "https://apnews.com/d6cd88ee009c6e1f6d2d92739ec1ca18",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eeca78822834573a1795eb3b7c6dcde/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukraine President Volodymyr Zelenskyy said Sunday that defense minister Oleksii Reznikov will be replaced this week with Rustem Umerov, a Crimean Tatar lawmaker.Zelenskyy made the announcement on his official Telegram account, writing that new leadership was needed after Reznikov went through \"more than 550 days of full-scale war.”",
      "publishedAt": "2023-09-03T10:20:51Z",
      "title": "Ukraine President Zelenskyy says defense minister Oleksii Reznikov will be replaced this week",
      "url": "https://apnews.com/a795984a5c42f5a65f64f2e35772a49b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7ce7c633b984d939d73ee1cb9791359/3000.jpeg"
    },
    {
      "author": "ANDREW WILKS and ELISE MORTON",
      "description": "ISTANBUL (AP) — Turkish President Recep Tayyip Erdogan will meet with Vladimir Putin on Monday, hoping to persuade the Russian leader to rejoin the Black Sea grain deal that Moscow broke off from in July.",
      "publishedAt": "2023-09-03T06:05:36Z",
      "title": "What's at stake when Turkey's leader meets Putin in a bid to reestablish the Black Sea grain deal",
      "url": "https://apnews.com/7a6c66f32eb721ec3b3d8dbd1af08d80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c98b24f6c5f04a61a013a2689ecb6d32/2873.jpeg"
    },
    {
      "author": "MEG KINNARD and MICHELLE L. PRICE",
      "description": "ANDERSON, S.C. (AP) — A microphone in hand, Sen. Tim Scott left the podium at a recent barbecue event in South Carolina and made his way through tables draped in red, white and blue as attendees finished plates of pulled pork and baked beans.",
      "publishedAt": "2023-09-04T04:06:23Z",
      "title": "In the pivotal South Carolina primary, Republican candidates search for a path against Donald Trump",
      "url": "https://apnews.com/0f7e001af12f4044a64f38330e429f42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3d8018c15284c2e964a866abf5ff136/2223.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s president says he’ll tell world leaders about the need to faithfully enforce U.N. sanctions on North Korea and block the country’s illicit activities to fund its weapons programs when they converge in Indonesia and India for annual summits this week.",
      "publishedAt": "2023-09-04T00:47:18Z",
      "title": "South Korea's Yoon to call for strong international response to North's nukes at ASEAN, G20 summits",
      "url": "https://apnews.com/a2746181735fb74653d7b04be1ee615e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad53508d4620408aa2b1d741607e3dc4/3000.jpeg"
    },
    {
      "author": "NINIEK KARMINI and EDNA TARIGAN",
      "description": "JAKARTA, Indonesia (AP) — Southeast Asian leaders led by Indonesian host President Joko Widodo are gathering in their final summit this year, besieged by divisive issues with no solutions in sight: Myanmar’s deadly civil strife, new flare-ups in the disputed South China Sea, and the longstanding United States-China rivalry.",
      "publishedAt": "2023-09-04T01:08:34Z",
      "title": "Southeast Asian leaders are besieged by thorny issues as they hold an ASEAN summit without Biden",
      "url": "https://apnews.com/d228b6b34d0cadd011673b3035285048",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/38cb5e67d14b435399a8becdb9ec146d/3000.jpeg"
    },
    {
      "author": "JILL COLVIN and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Their rivals are busy answering voters' questions at town halls across South Carolina, glad-handing with business owners in New Hampshire and grinding to hit every one of Iowa's 99 counties.",
      "publishedAt": "2023-09-03T16:55:28Z",
      "title": "Biden and Trump are keeping relatively light campaign schedules as their rivals rack up the stops",
      "url": "https://apnews.com/5dc5f9e6b10716de8611f8d48de939fa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d4f403c9a1245faa92cf59781b0a5a2/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris will deepen her outreach to Southeast Asia this week at an international summit in Jakarta, Indonesia, where she'll try to erase doubts about U.S.",
      "publishedAt": "2023-09-04T04:03:18Z",
      "title": "Vice President Kamala Harris to face doubts and dysfunction at Southeast Asia summit",
      "url": "https://apnews.com/34ad8477fc9b0afb1f17adf807dda475",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a500e40ce6934b43aa5596f292ca339c/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and SARUUL ENKHBOLD",
      "description": "ULAANBAATAR, Mongolia (AP) — Pope Francis wrapped up the first-ever papal visit to Mongolia on Monday by inaugurating a church-run homeless clinic and shelter, insisting that such initiatives aren’t aimed at winning converts but are simply exercises in Christian charity.",
      "publishedAt": "2023-09-04T02:27:45Z",
      "title": "Francis opens clinic on 1st papal visit to Mongolia. He says it's about charity not conversion",
      "url": "https://apnews.com/f6ea91e6f2b77a3420321fff97e32821",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5c7355818ef243ed8df46dde8dc863df/3000.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME and GERALD IMRAY",
      "description": "JOHANNESBURG (AP) — One of the few things that survived the fire and smoke that caused at least 76 horrific deaths in a rundown apartment block in Johannesburg is a circular plaque hanging on the brown brick exterior.",
      "publishedAt": "2023-09-03T15:01:55Z",
      "title": "A building marked by fire and death shows the decay of South Africa's 'city of gold'",
      "url": "https://apnews.com/e0c0791bf90f25bd40d4fb357c368616",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1c57ce760aa46f49a191c13aa6d74fc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}