{
  "articles": [
    {
      "author": "WAFAA SHURAFA and JOSEPH KRAUSS",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Desperate Palestinians scrambled for escape from northern Gaza on Saturday or huddled by the thousands at a hospital in the target zone in hopes it would be spared, as Israel intensified warnings of an imminent offensive by air, ground and sea following Hamas militants’ deadly rampage in Israel a week ago.",
      "publishedAt": "2023-10-14T04:26:01Z",
      "title": "Gaza's desperate civilians flee or huddle in hopes of safety, as warnings of Israeli offensive mount",
      "url": "https://apnews.com/785e0eb833715354cade4694e8ccbf67",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aefca239bd4047ef87dcb9bc9f3697d0/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — As Israel pounds the Gaza Strip with airstrikes, Laila Abu Samhadaneh, 65, is anxious about water. The besieged Gaza Strip's 2.3 million people don't have access to clean, running water after Israel cut off water and electricity to the enclave as it intensifies its air attacks in response to a bloody Hamas attack last week.",
      "publishedAt": "2023-10-14T21:02:04Z",
      "title": "Lack of water worsens misery in besieged Gaza as Israeli airstrikes continue",
      "url": "https://apnews.com/4cc305b209437eec7235e975cf4c47d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7918d7b90bd145e4bf8f5be85b9a141f/3000.jpeg"
    },
    {
      "author": "NOREEN NASIR",
      "description": "NEW YORK (AP) — For the unforeseeable future, Laila El-Haddad has one mission: to get the voices of her fellow Palestinians, along with their pleas for help, out to the rest of the world.From her home office in Columbia, Maryland, El-Haddad frantically juggled phone calls this week from journalists seeking her expertise on Gaza and Palestinian Americans trying to get the attention of their local elected officials.",
      "publishedAt": "2023-10-14T21:58:03Z",
      "title": "Palestinian Americans watch with dread as family members in Gaza struggle to stay alive",
      "url": "https://apnews.com/6f71414b08b7bd4f6c1c1b7f3e9471af",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c717021106564728a50ba60107e91c45/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE and LOLITA C. BALDOR",
      "description": "RIYADH, Saudi Arabia (AP) — President Joe Biden on Saturday spoke with Palestinian President Mahmoud Abbas and Israeli Prime Minister Benjamin Netanyahu, urging the leaders to allow humanitarian aid to the region and affirmed his support for efforts to protect civilians.",
      "publishedAt": "2023-10-14T11:41:21Z",
      "title": "In first call with Palestinian president Abbas, Biden discusses support for humanitarian aid to Gaza",
      "url": "https://apnews.com/487f746b102a82f4c345a058584e2518",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b4d9587d33414c1ea142a647cd5a112c/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER and ERIC TUCKER",
      "description": "WASHINGTON (AP) — A proposed gag order aimed at reining in Donald Trump's incendiary rhetoric puts the judge overseeing his federal election interference case in a tricky position: She must balance the need to protect the integrity of the legal proceedings against the First Amendment rights of a presidential candidate to defend himself in public.",
      "publishedAt": "2023-10-14T12:25:19Z",
      "title": "A proposed gag order on Trump in his federal election case is putting the judge in a tricky position",
      "url": "https://apnews.com/02d078e492a828ed030e583775462dba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c7109e3363c46e9b4ba774c12f08175/3000.jpeg"
    },
    {
      "author": "BY JEAN-YVES KAMALE",
      "description": "KINSHASA, Congo (AP) — A boat capsized in Congo’s northwest killing at least 27 people, and more than 70 others were missing, a senior government official said Saturday as rescuers searched frantically for survivors.",
      "publishedAt": "2023-10-14T20:30:05Z",
      "title": "At least 27 dead with dozens more missing after boat capsizes in northwest Congo",
      "url": "https://apnews.com/39157ce30094187169b06ab84493ad01",
      "urlToImage": ""
    },
    {
      "author": "MARÍA VERZA and IVÁN VALENCIA",
      "description": "CANCÚN, México (AP) — First came the darkening skies, then the crescent-shaped shadows on the ground, and finally an eruption of cheers by crowds that gathered Saturday along the narrow path of a rare “ring of fire” eclipse of the sun.",
      "publishedAt": "2023-10-14T04:07:07Z",
      "title": "'Ring of fire' eclipse brings cheers and shouts of joy as it moves across the Americas",
      "url": "https://apnews.com/81b8ba2d557c8f42cb90756fc4b342a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5fa07bfadc5a44f99e8b8a71b547b57e/1920.jpeg"
    },
    {
      "author": "ANGELA CHARLTON and JEFFREY SCHAEFFER",
      "description": "PARIS (AP) — The Louvre Museum in Paris and Versailles Palace evacuated visitors and staff Saturday after receiving bomb threats, police said. The French government started deploying 7,000 troops to increase security around the country after a fatal school stabbing by a suspected Islamic extremist.",
      "publishedAt": "2023-10-14T15:26:34Z",
      "title": "Louvre Museum and Versailles Palace evacuated after bomb threats with France on alert",
      "url": "https://apnews.com/859227d963367d7601575e4a8e1d2d4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e392151b4de4c8c86eaff220dbb4bd5/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO",
      "description": "SAN JOAQUIN, Venezuela (AP) — The avocado trees across the road from Jose Hernandez's tin-roofed home help feed several retirees in the rural community of San Joaquin along a highway two hours southwest of Venezuela’s capital.",
      "publishedAt": "2023-10-14T04:40:59Z",
      "title": "Evolving crisis fuels anxiety among Venezuelans who want a better economy but see worsening woes",
      "url": "https://apnews.com/afabb9dee444128c5ec4593a51e78896",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7400a53c2ad41fcade3bd9c7b1a60e4/3000.jpeg"
    },
    {
      "author": "BOB THOMAS",
      "description": "Piper Laurie, the strong-willed, Oscar-nominated actor who performed in acclaimed roles despite at one point abandoning acting altogether in search of a “more meaningful” life, died early Saturday at her home in Los Angeles.",
      "publishedAt": "2023-10-14T22:31:38Z",
      "title": "Piper Laurie, 3-time Oscar nominee with film credits such as 'The Hustler' and 'Carrie,' dies at 91",
      "url": "https://apnews.com/bd5ad2a7524dd50a3c356558728d358f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3dfd85b016a4fbb9b480dd5dec984b0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}