{
  "articles": [
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The Senate on Wednesday opened the impeachment trial of Homeland Security Secretary Alejandro Mayorkas over his handling of the U.S.-Mexico border, swearing in senators as jurors while Democrats said they wanted to end the trial before arguments even begin.",
      "publishedAt": "2024-04-17T04:15:19Z",
      "title": "Senate convenes the Mayorkas impeachment trial as Democrats seek a quick dismissal",
      "url": "https://apnews.com/29aa775c0e866f4160f320583f261a72",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/90e5f2a17f8446298981e9877a0b240e/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and TIA GOLDENBERG",
      "description": "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu said Wednesday his country would be the one to decide whether and how to respond to Iran’s major air assault earlier this week, brushing off calls for restraint from close allies.",
      "publishedAt": "2024-04-17T09:36:42Z",
      "title": "Netanyahu brushes off calls for restraint, saying Israel will decide how to respond to Iran's attack",
      "url": "https://apnews.com/32b1875bcf167b17ed28172f7146eaf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/280ebf81022b473e8654232b8d043ba0/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and LISA MASCARO",
      "description": "WASHINGTON (AP) — House Speaker Mike Johnson, facing a choice between potentially losing his job and advancing aid for Ukraine, forged ahead Wednesday toward a vote later this week on a package of funding that also includes Israel and Taiwan.",
      "publishedAt": "2024-04-17T16:21:49Z",
      "title": "House’s Ukraine, Israel aid package moving ahead as Speaker Johnson fights to keep his job",
      "url": "https://apnews.com/f08102e171dcac2d66d513980d828d49",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8d5f4a72969b426bbce104ef32c359e7/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Three Russian missiles slammed into a downtown area of the northern Ukrainian city of Chernihiv on Wednesday, hitting an eight-floor apartment building and killing at least 17 people, authorities said.",
      "publishedAt": "2024-04-17T08:14:42Z",
      "title": "Russian missiles slam into a Ukraine city and kill 17 people as the war approaches a critical stage",
      "url": "https://apnews.com/2eaf2f93ad447bce3ea2d8f9631c554b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16019d1946d04acdbce4eb04b00b286f/1920.jpeg"
    },
    {
      "author": "TOM KRISHER and MICHELLE CHAPMAN",
      "description": "DETROIT (AP) — Tesla will ask shareholders to reinstate a $56 billion compensation package for CEO Elon Musk that was rejected by a judge in Delaware this year, and to move the electric car maker’s corporate home from Delaware to Texas.",
      "publishedAt": "2024-04-17T11:22:12Z",
      "title": "Tesla wants shareholders to reinstate $56 billion Musk pay package tossed by a Delaware judge",
      "url": "https://apnews.com/ef5e30f6b56f7d936f8c882fc1c96875",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a3f014d8966e4711baf2401ca29e7f70/2961.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL",
      "description": "Three court rulings across the U.S. this week delved into laws restricting the rights of transgender kids, including the first time the U.S. Supreme Court has gotten involved in a ban on gender-affirming care.",
      "publishedAt": "2024-04-17T15:55:13Z",
      "title": "Things to know as courts and legislatures act on transgender kids’ rights",
      "url": "https://apnews.com/4bbba11d7cd60916715ba230fa986c88",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/206335f622024352b0e995d9ad5855fc/3000.jpeg"
    },
    {
      "author": "TERRY TANG and LINLEY SANDERS",
      "description": "Asian Americans, Native Hawaiians and Pacific Islanders in the United States are more likely than the overall adult population to believe in human-caused climate change, according to a new poll.",
      "publishedAt": "2024-04-17T04:03:14Z",
      "title": "Asian Americans and Pacific Islanders in US more likely to believe in climate change: AP-NORC poll",
      "url": "https://apnews.com/226f4001c8fafc1e0ebff2fdd15e4d2e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f3758398139e4622a1976b4dacd83307/3000.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Boeing was the subject of dual Senate hearings Wednesday as Congress examined allegations of major safety failures at the embattled aircraft manufacturer, which has been pushed into crisis mode since a door-plug panel blew off a 737 Max jetliner during an Alaska Airlines flight in January.",
      "publishedAt": "2024-04-17T04:01:39Z",
      "title": "Boeing put under Senate scrutiny during back-to-back hearings on aircraft maker's safety culture",
      "url": "https://apnews.com/f8354ddddc6372e3337cd74b9ea264e3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60d11e990c544e53b6dfa17cb537ab04/3000.jpeg"
    },
    {
      "author": "ANNIE MA and COLLIN BINKLEY",
      "description": "WASHINGTON, D.C. (AP) — The president of Columbia University took a firm stand against antisemitism Wednesday as she parried accusations from Republicans who see the New York campus as a hotbed of bias, but she hedged on whether certain phrases invoked by some supporters of Palestinians rise to harassment.",
      "publishedAt": "2024-04-17T04:09:53Z",
      "title": "Columbia University's president rebuts claims she has allowed school to become a hotbed of hatred",
      "url": "https://apnews.com/3255357b4443c1fb4bae8b8ea5774ee5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ea29f7e712d4cf280dc59be09e03178/3000.jpeg"
    },
    {
      "author": "TIM REYNOLDS",
      "description": "Toronto Raptors two-way player Jontay Porter was banned for life from the NBA on Wednesday after a league probe found he disclosed confidential information to sports bettors and wagered on games, even betting on the Raptors to lose.",
      "publishedAt": "2024-04-17T16:30:44Z",
      "title": "NBA bans Jontay Porter after gambling probe shows he shared information, bet on games",
      "url": "https://apnews.com/265ad5cb703d9483347037762ee90a8f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85bcd88b54d64fdbb0ffe7ff7f4e56bc/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}