{
  "articles": [
    {
      "author": null,
      "description": "U.S. Immigration and Customs Enforcement officials will gain access to personally identifiable information for all of the nation’s 79 million Medicaid enrollees. That's according to an agreement obtained by The Associated Press. ICE officials plan to track immigrants who may not be living legally in the United States. The agreement was signed Monday between officials at the Centers for Medicare and Medicaid Services and the Department of Homeland Security. Direct access will be given to the addresses, Social Security numbers, birth dates as well as the ethnicity and race of all Medicaid enrollees.",
      "publishedAt": "2025-07-17T16:19:47Z",
      "title": "Trump administration hands over nation's Medicaid enrollee data to ICE",
      "url": "https://apnews.com/article/immigration-medicaid-trump-ice-ab9c2267ce596089410387bfcb40eeb7",
      "urlToImage": "https://dims.apnews.com/dims4/default/a9000fb/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2Fc9%2F487a5a83c70b764651f423a1d942%2F17de1c7cd4c74c1f8d4f7b9ddb4122a8"
    },
    {
      "author": null,
      "description": "The House is expected to approve President Donald Trump’s request to claw back about $9 billion for public broadcasting and foreign aid. A final vote to approve the spending cuts package is scheduled for Thursday evening. Republicans are targeting institutions and programs they view as bloated or out of step with their agenda. The White House has described the package as a test case and says if Congress goes along, more requests will come. The House’s approval would mark the first time in decades that a president has successfully submitted such a request to Congress.",
      "publishedAt": "2025-07-17T16:58:02Z",
      "title": "House set to OK Trump's $9 billion cut to public broadcasting and foreign aid",
      "url": "https://apnews.com/article/pbs-npr-budget-cuts-trump-republicans-b0044285659ab708e23eb2dc2f3eabfa",
      "urlToImage": "https://dims.apnews.com/dims4/default/4370289/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2Fe5%2F2ab65bfc786e5ea4a992b70769a3%2F93a946a4feba42c0a10c155f5d5a981e"
    },
    {
      "author": null,
      "description": "Maurene Comey, the daughter of former FBI director James Comey who as a federal prosecutor in Manhattan worked on cases against Sean “Diddy” Combs and Jeffrey Epstein, has told colleagues in a note that “fear is the tool of a tyrant” and that her firing without reason should fuel “a fire of righteous indignation at abuses of power.” In a message obtained by The Associated Press, she wrote that “if a career prosecutor can be fired without reason, fear may seep into the decisions of those who remain.\" She told colleagues that they should not let that happen.",
      "publishedAt": "2025-07-17T16:12:57Z",
      "title": "Fired federal prosecutor Maurene Comey warns against Trump's abuse of power",
      "url": "https://apnews.com/article/trump-comey-epstein-justice-department-sean-combs-6a75266874bb7723ac83a9b548b7d257",
      "urlToImage": "https://dims.apnews.com/dims4/default/4ddd651/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F81%2Fe86d37a9fc6344b55487cca9903f%2F0d681c4b4ca74d38bbddef8af3b5f101"
    },
    {
      "author": null,
      "description": "Syrian government forces have started withdrawing from the southern province of Sweida following days of vicious clashes with militias from the Druze minority. Druze leaders and Syrian government officials announced a renewed ceasefire late Wednesday that was mediated by the U.S., Turkey and Arab countries. Syria’s interim President Ahmad al-Sharaa said in an address early Thursday that some Druze factions and clerics were appointed to maintain internal security in Sweida. Israeli strikes targeting government troops did not immediately stop. The dayslong fighting has threatened to unravel Syria’s postwar political transition and brought in further military intervention by Israel.",
      "publishedAt": "2025-07-17T09:39:31Z",
      "title": "Syrian forces leave Sweida after ceasefire with Druze militias takes effect",
      "url": "https://apnews.com/article/syria-druze-israel-clashes-sweida-ceasefire-sharaa-67fdcbd1be73c4890a4ce81bd954d447",
      "urlToImage": "https://dims.apnews.com/dims4/default/4f76588/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F35%2Fd59227d2c244d023fe0c33049528%2F3066bdd9e3c1449782e4bace267d2399"
    },
    {
      "author": null,
      "description": "Iraqi officials say a fire at a newly opened mall in eastern Wasit province killed more than 60 people, including women and children. Iraq’s Ministry of Interior said in a statement that 61 people died, most from suffocation, in the fire that began Wednesday in the city of Kut. The ministry says 14 charred bodies remain unidentified. The province has declared three day of mourning. The provincial governor says the cause of the fire is still under investigation but that legal cases were begun against the building owner and mall owner. He did not specify what the charges were.",
      "publishedAt": "2025-07-17T06:50:05Z",
      "title": "A fire at a mall in eastern Iraq kills more than 60 people",
      "url": "https://apnews.com/article/iraq-mall-fire-96e368d468ab86568ad605216e9f0589",
      "urlToImage": "https://dims.apnews.com/dims4/default/53fe1e3/2147483647/strip/true/crop/1200x675+0+59/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F06%2Fb2bfda791018bc2c757b67dbb80c%2F8d7d5a33f73e42c7825289e6493c0b9e"
    },
    {
      "author": null,
      "description": "Just 1 in 4 U.S. adults say President Donald Trump’s policies have helped them. That's according to a new AP-NORC poll that finds underwhelming marks for the Republican president on key issues, including the economy, immigration, government spending and health care. Overall, Trump fails to earn majority approval on any of the issues included in the poll. A majority of Americans see Trump as at least somewhat capable of getting things done following the passage of his sprawling budget bill. The mixed reviews come six months into Trump's term as he struggles to follow through on some campaign promises, including lowering costs for working-class Americans, preserving programs like Medicaid and lowering government spending.",
      "publishedAt": "2025-07-17T11:00:36Z",
      "title": "Most say Trump's policies haven't helped them: AP-NORC poll",
      "url": "https://apnews.com/article/poll-trump-approval-policies-economy-health-immigration-45681b8cd07782ba7a143d323efe9dd7",
      "urlToImage": "https://dims.apnews.com/dims4/default/cf092ca/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F19%2Fe4%2Ffabb66cc8562b391a5c8a9e141cb%2F83e44f60642949328ab411c2a3a16506"
    },
    {
      "author": null,
      "description": "Connie Francis, the wholesome pop star of the 1950s and 1960s whose hits include “Pretty Little Baby” and who would later serve as an ironic title for a personal life filled with heartbreak and tragedy, has died at age 87. Her death was announced Thursday by her friend and publicist, Ron Roberts, who didn't immediately provide additional details. Francis was a top performer of the pre-Beatles era, rarely off the charts from 1957-64. Able to appeal to both young people and adults, she had more than a dozen top 20 hits, starting with “Who’s Sorry Now?” and including the No. 1 songs “Don’t Break the Heart That Loves You” and “The Heart Has a Mind of Its Own.”",
      "publishedAt": "2025-07-17T11:58:39Z",
      "title": "Star-crossed singer Connie Francis, whose hits included 'Pretty Little Baby' dead at 87",
      "url": "https://apnews.com/article/connie-francis-died-87-singer-pretty-little-baby-785646a658c66d61f4263eeb5b5d5d42",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Federal health officials will allow Juul to keep selling its electronic cigarettes. The Food and Drug Administration said Thursday that Juul's benefits as a less harmful alternative for adult smokers outweigh the risks of teen use. It's a major win for a company that has struggled for years after being widely blamed for sparking the teen vaping trend. Parents, politicians and antitobacco advocates wanted a ban on the devices that many blame for the recent spike in underage vaping. The FDA decision applies to both tobacco and menthol-flavored versions of the reusable product.",
      "publishedAt": "2025-07-17T16:00:17Z",
      "title": "Juul can continue selling its tobacco and menthol e-cigarettes, FDA says",
      "url": "https://apnews.com/article/juul-vaping-ecigarettes-fda-teens-ban-9561d6a26972c01613c4fd3ebbbd981e",
      "urlToImage": "https://dims.apnews.com/dims4/default/b3b6d73/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Fc0%2Feab88059376e72e74488cc08987a%2Ffbd9431081d349039186b110be89f9a0"
    },
    {
      "author": null,
      "description": "Early trading on Wall Street is muted as markets appeared to calm after President Donald Trump walked back his earlier threats to fire Federal Reserve Chair Jerome Powell. Futures for the S&P 500 were unchanged before the bell Thursday, while futures for the Dow Jones Industrial Average lost 0.2%. Nasdaq futures were up less than 0.1%. PepsiCo rose 2% before the bell Thursday after the beverage and snack giant’s second-quarter sales and profit topped Wall Street projections. The world’s largest chipmaker, TSMC, reported huge increases in sales and profit from a year ago, sending its stock up 3.4%. Netflix reports after the closing bell.",
      "publishedAt": "2025-07-17T07:00:04Z",
      "title": "Wall Street steady again after Trump downplays threat to Fed Chair Jerome Powell's job",
      "url": "https://apnews.com/article/stocks-markets-rates-powell-trump-ee3ff3ef24f5054fb0550605a922df83",
      "urlToImage": "https://dims.apnews.com/dims4/default/aef4b02/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F46%2Fc8%2F2845de844d719974f123dbf2963c%2F497bcd0916f443f1b8b5edca3f79e384"
    },
    {
      "author": null,
      "description": "Women’s marathon world record-holder Ruth Chepngetich has been provisionally suspended for a positive doping test. Track and field’s Athletics Integrity Unit announced the case. Chepngetich tested positive for a banned diuretic and masking agent in March. She opted for a voluntary provisional suspension while the AIU investigation continues. The Kenyan runner set the world record by almost two minutes at the Chicago Marathon last October in 2 hours, 9 minutes, 56 seconds.",
      "publishedAt": "2025-07-17T15:37:20Z",
      "title": "Marathon world record-holder Chepngetich suspended for positive doping test",
      "url": "https://apnews.com/article/doping-chepngetich-chicago-marathon-world-record-d9d96883d7761b177954f6c2c4f80e0f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c94419b/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F57%2F83f3654f1d9ca56c64c600344eec%2Fa8b777d369d04d2fb152a49bb4e6e438"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}