{
  "articles": [
    {
      "author": null,
      "description": "Iranian state television says the head of Iran’s paramilitary Revolutionary Guard is feared dead after an Israeli attack. The report offered few other details about what happened to Gen. Hossein Salami of the Guard. The report on air added that one other top Guard officials, as well as two nuclear scientists were also feared dead. State television also reported the attack set the headquarters of Iran’s paramilitary Revolutionary Guard ablaze. Multiple sites in the capital had been hit in the attack, which Israeli Prime Minister Benjamin Netanyahu said targeted both nuclear and military sites and officials leading Iran’s nuclear program and its ballistic missile arsenal.",
      "publishedAt": "2025-06-13T00:13:47Z",
      "title": "Explosions heard across Iran’s capital as Israel claims it is attacking",
      "url": "https://apnews.com/article/iran-explosions-israel-tehran-00234a06e5128a8aceb406b140297299",
      "urlToImage": "https://dims.apnews.com/dims4/default/49e05ae/2147483647/strip/true/crop/5915x3327+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F40%2Fef6d174d5e49a3d63c42bbec6d25%2Ff6f2cbef8b32466e9c8eaba4049ea7ae"
    },
    {
      "author": null,
      "description": "The United States is shifting military resources in the Middle East in response to Israel’s strikes on Iran and a possible retaliatory attack by Tehran. That's according to two U.S. officials on Friday. The Navy has directed the destroyer USS Thomas Hudner to begin sailing toward the Eastern Mediterranean and has directed a second destroyer to begin moving forward, so it can be available if requested by the White House. President Donald Trump is meeting with his National Security Council principals to discuss the situation. The officials spoke on the condition of anonymity to provide details not yet made public.",
      "publishedAt": "2025-06-13T13:37:35Z",
      "title": "US shifts military resources in Mideast in response to Israel strikes on Iran",
      "url": "https://apnews.com/article/iran-israel-strikes-us-troops-973bc18970689bac42d82342bd29f601",
      "urlToImage": "https://dims.apnews.com/dims4/default/ec79398/2147483647/strip/true/crop/2440x1373+0+127/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2Fe0%2Fb78bdea0a89657f2ab1696976150%2F58d116111b8a4e47928e28592ac71710"
    },
    {
      "author": null,
      "description": "Homeland Security Secretary Kristi Noem is promising to move forward with the Trump administration’s immigration crackdown in Los Angeles despite the waves of unrest. Noem spoke Thursday, hours before a judge directed the president to return control to California over National Guard troops he deployed after protests erupted over the immigration crackdown. But the 9th U.S. Circuit Court of Appeals quickly put the brakes on that and temporarily blocked the judge's order, which was to go into effect on Friday. The judge’s order said the Guard deployment was illegal and both violated the Tenth Amendment and exceeded President Donald Trump’s statutory authority.",
      "publishedAt": "2025-06-13T05:43:24Z",
      "title": "DHS vows Trump's immigration crackdown will continue despite unrest",
      "url": "https://apnews.com/article/immigration-raids-national-guard-lawsuit-los-angeles-f4809c7f39d09e4fdfa01982f44ec995",
      "urlToImage": "https://dims.apnews.com/dims4/default/b782467/2147483647/strip/true/crop/4737x2665+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F23%2F3f%2F680e47f224ad85d4c1bd6b3f95ae%2Fcf6f81a1c61d4d51bf1312fc92fec446"
    },
    {
      "author": null,
      "description": "Authorities have begun investigating one of India’s worst aviation disasters after an Air India plane crashed a day earlier, killing all but one of the total 242 passengers and crew onboard. The Indian government has launched an investigation into the fatal crash of the London-bound Air India plane that came down in a in a residential area in the northwestern city of Ahmedabad, minutes after takeoff on Thursday. Civil Aviation Minister Ram Mohan Naidu in a statement said the Aircraft Accident Investigation Bureau has initiated the probe in line with global protocols set by the International Civil Aviation Organization. A team from the U.S. is expected in India to help with the probe.",
      "publishedAt": "2025-06-13T04:55:54Z",
      "title": "Indian authorities begin probe of Air India plane crash as Modi visits the site",
      "url": "https://apnews.com/article/air-india-plane-crash-ahmedabad-survivor-boeing-787-18a1e45cb65bd716d6529b8922cc94b7",
      "urlToImage": "https://dims.apnews.com/dims4/default/4138789/2147483647/strip/true/crop/7048x3965+0+367/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Fa0%2F7541be4f6eb1138c26a91a1daaf8%2F5ba76ed4bea84d86ac28c1db2ed25980"
    },
    {
      "author": null,
      "description": "President Donald Trump's administration has released to deportation officials the personal data for millions of Medicaid enrollees, including their immigration status. That's according to an internal memo and emails obtained by The Associated Press. Trump officials have been reaching deep into communities across the country to ramp up deportations and fought for the health data on immigrants from the Centers for Medicare and Medicaid Services. The dataset released this week includes the information of people living in California, Illinois, Washington state and Washington, D.C., which all allow immigrants who are in the U.S. illegally to enroll in relatively new Medicaid programs that pay for their expenses using only state taxpayer dollars.",
      "publishedAt": "2025-06-13T14:30:38Z",
      "title": "Trump gives data of immigrant Medicaid enrollees to deportation officials",
      "url": "https://apnews.com/article/medicaid-deportation-immigrants-trump-4e0f979e4290a4d10a067da0acca8e22",
      "urlToImage": "https://dims.apnews.com/dims4/default/b932d1f/2147483647/strip/true/crop/3953x2224+0+206/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Fbf%2F7f2bc6cfab3a627b56a977ec4066%2Fb6461014598c40e48ea066c090f8faae"
    },
    {
      "author": null,
      "description": "A judge in Massachusetts has blocked President Donald Trump’s election executive order, siding with Democratic state attorneys who called it overreach. Trump’s March 25 executive order sought to compel officials to require documentary proof of citizenship for everyone registering to vote for federal elections, accept only mailed ballots received by Election Day and condition federal election grant funding on states adhering to the new ballot deadline. The group of attorneys general said the directive “usurps the States’ constitutional power and seeks to amend election law by fiat.” The White House has defended the order as “standing up for free, fair and honest elections.\" The judge say the Constitution doesn't grant the president any specific powers over elections.",
      "publishedAt": "2025-06-13T12:52:47Z",
      "title": "Judge blocks Trump’s election executive order",
      "url": "https://apnews.com/article/trump-elections-executive-order-4f863aaa8e0c59640ebc727827ffc887",
      "urlToImage": "https://dims.apnews.com/dims4/default/c5ba28b/2147483647/strip/true/crop/2148x1208+0+112/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F15%2Feeb5400317ce6a527b08efa58f08%2F585d08284fca4ab08172800a703d79a1"
    },
    {
      "author": null,
      "description": "Kilmar Abrego Garcia has pleaded not guilty to human smuggling charges in federal court in Tennessee. Abrego Garcia is a citizen of El Salvador who had been living in Maryland before he was wrongfully deported in March. Abrego Garcia's case has become a rallying point for opposition to President Donald Trump’s mass deportation agenda. Abrego Garcia was returned to the U.S. last week but immediately taken into custody on criminal charges. Prosecutors have accused Abrego Garcia of being a dangerous member of the notorious MS-13 gang, but his attorneys have called the charges against him “preposterous.” Abrego Garcia was arraigned Friday.",
      "publishedAt": "2025-06-13T04:11:33Z",
      "title": "Kilmar Abrego Garcia appears in Tennessee court",
      "url": "https://apnews.com/article/abrego-garcia-deportation-error-2bf259d9de88334bbdfb6d565b36e633",
      "urlToImage": "https://dims.apnews.com/dims4/default/acbad8d/2147483647/strip/true/crop/1029x579+0+54/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2Fe9%2Fd4f34a97156268f6fdd695c4e66b%2F00c074ffb2ac4c46ad3912c3e5fdb0f0"
    },
    {
      "author": null,
      "description": "Lawyers in the second murder trial of Karen Read are set to give their closing arguments after weeks of testimony. The highly divisive case has hinged on the prosecution's theory of jaded love turned deadly. That is countered by a defense claim that a cast of tight-knit Boston area law enforcement killed a fellow police officer. Read is accused of fatally striking her boyfriend, Boston police officer John O’Keefe, with her SUV and leaving him to die in the snow outside a house party where other local police and a federal agent were closing out a night of drinking in 2022. Closings are Friday.",
      "publishedAt": "2025-06-13T04:03:33Z",
      "title": "Closing statements to begin in high-profile Karen Read trial about death of Boston police officer",
      "url": "https://apnews.com/article/karen-read-boston-murder-trial-police-closings-e82b1fd3ebb13c32095f30f66224b2a7",
      "urlToImage": "https://dims.apnews.com/dims4/default/629113a/2147483647/strip/true/crop/2000x1125+0+149/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2F35%2F11bbac28ffef33ad9c22f5c738cc%2F2585d5abde6041fcacdbbb70953467c4"
    },
    {
      "author": null,
      "description": "Oil prices are leaping, and stocks are weakening on worries that Israel’s attack on Iranian nuclear and military targets could escalate further and damage the flow of crude around the world, along with the global economy. The S&P 500 fell 0.7% in early trading Friday. The Dow Jones Industrial Average dropped 508 points, and the Nasdaq composite sank 0.8%. The strongest action was in the oil market, where crude prices jumped more than 7% and returned to where they were early this year. Iran is one of the world’s major producers of oil, and escalating fighting could limit its flow.",
      "publishedAt": "2025-06-13T03:17:16Z",
      "title": "Crude oil jumps and stocks sink after Israel's attack on Iran",
      "url": "https://apnews.com/article/israel-iran-attack-oil-stock-market-fe6d0aed826aec5f041ed492f19ea12d",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b2d4e8/2147483647/strip/true/crop/4743x2668+0+247/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2Fb5%2Faaa28f2f9258f00f921ad0508774%2F387e083bcf6446b9a9256cb9e15acb48"
    },
    {
      "author": null,
      "description": "Ye, the rapper formerly known as Kanye West, says he came to the New York sex trafficking trial of Sean “Diddy” Combs to support him. Dressed in white, Ye arrived at Manhattan federal court before noon on Friday while the trial was on a break. He was asked if he was at the courthouse to support Combs and he said “yes,” but he didn't appear to respond when a reporter asked if he might testify when the defense begins presenting its case as early as next week. The 55-year-old Combs has pleaded not guilty to sex trafficking and racketeering conspiracy charges alleging that he used his fame, fortune and violence to commit crimes.",
      "publishedAt": "2025-06-13T15:56:49Z",
      "title": "Rapper Ye, formerly known as Kanye West, shows up to support Sean \"Diddy\" Combs at trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-jane-0c1af5d7d6cc64c098e7465140836bc5",
      "urlToImage": "https://dims.apnews.com/dims4/default/f71574c/2147483647/strip/true/crop/4905x2759+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2Fba%2F52ca565965b1ebb6c5356469f7ba%2Fb2d12cc0b3504c6982ba68beecd68e56"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}