{
  "articles": [
    {
      "author": "JOSHUA GOODMAN and REGINA GARCIA CANO",
      "description": "CARACAS, Venezuela (AP) — Venezuela's opposition and President Nicolas Maduro's government were locked in a high-stakes standoff after each side claimed victory in a presidential vote that millions in the long-suffering nation saw as their best shot to end 25 years of single-party rule.",
      "publishedAt": "2024-07-29T06:40:46Z",
      "title": "Venezuela's Maduro and opposition are locked in standoff as both claim victory in presidential vote",
      "url": "https://apnews.com/acee6c8cd3a8fc88086c2dd71963b759",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/22ce85e7bd524eb4aa7a498fceef2896/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli strikes killed two people and injured three others in southern Lebanon early Monday, Lebanon's state-run news agency said. It came as Israel weighs its response to a rocket attack from Lebanon over the weekend that killed 12 youths in the Israel-controlled Golan Heights.",
      "publishedAt": "2024-07-29T09:02:10Z",
      "title": "Israel-Hamas war latest: Israeli strike kills 2 in southern Lebanon, Lebanese media say",
      "url": "https://apnews.com/1213b56409f36211815020ea0fdfee28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0eb9e7d0b4e348a9b8b29839bd57dbaf/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — President Joe Biden is unveiling a long-awaited proposal for changes at the U.S.",
      "publishedAt": "2024-07-29T09:36:23Z",
      "title": "Biden unveils plan for Supreme Court changes, says US stands at 'breach' as public confidence sinks",
      "url": "https://apnews.com/ffd48f3a2023aeca841bb53c2147ef03",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84c2bdec42e94f9dabaab8d51945d96a/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES and MICHELLE L. PRICE",
      "description": "ST. CLOUD, Minn. (AP) — Barely a week ago, a sense of inevitability hung over the U.S. presidential election.Donald Trump's allies gleefully predicted a landslide victory during a Republican National Convention that felt more like a coronation for a nominee who had just survived an assassination attempt and was promising to unite the country.",
      "publishedAt": "2024-07-29T04:02:23Z",
      "title": "Trump and Harris enter 99-day sprint to decide an election that has suddenly transformed",
      "url": "https://apnews.com/f1a86e343689c9e2d4aa676f7a75428c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c64c3fcfc3549d3a98cc27d034cace1/1634.jpeg"
    },
    {
      "author": "NIC COURY and REBECCA BOONE",
      "description": "FOREST RANCH, Calif. (AP) — Firefighters made progress and were aided by improving weather Sunday in the battle against wildfires covering massive areas and leaving a trail of damage in the western United States, but further evacuations and resources have been necessary as thousands of personnel tackle the flames.",
      "publishedAt": "2024-07-29T06:41:41Z",
      "title": "California firefighters make progress as wildfires push devastation and spread smoke across US West",
      "url": "https://apnews.com/3e888a7e89f7b5b6b9c2172afb4671a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2d764f2fda74ffe9bf008071413995a/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL and QASSIM ABDUL-ZAHRA",
      "description": "SINJAR, Iraq (AP) — When Rihan Ismail returned to her family’s home in the heartland of her Yazidi community, she was sure she was coming back for good.She had yearned for that moment throughout long years of captivity.",
      "publishedAt": "2024-07-29T05:21:18Z",
      "title": "Ten years on, many Yazidis uprooted by Islamic State onslaught struggle to find stable homes",
      "url": "https://apnews.com/ddbc0ba91d98d84e46fbac8fb6626b46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc0e1fc5d8a141a988ac618cf502f102/3000.jpeg"
    },
    {
      "author": "ANDREW MELDRUM",
      "description": "KYIV, Ukraine (AP) — Ukrainians urged their government to do more to get Russia to release prisoners of war, voicing their anger on Sunday at a ceremony commemorating the second anniversary of an explosion that killed more than 50.",
      "publishedAt": "2024-07-28T17:24:06Z",
      "title": "Thousands in Ukraine honor soldiers killed in blast and urge government to get prisoners freed",
      "url": "https://apnews.com/a9343d5b2b94d3d1ba547ab5259af550",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/648379c44fa24c7395894af70952665c/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — Tongue-tie —a condition in infants that can affect breastfeeding — may be overdiagnosed in the U.S. and too often treated with unnecessary surgery, a prominent doctors' group said Monday.",
      "publishedAt": "2024-07-29T04:02:29Z",
      "title": "Infants' tongue-tie may be overdiagnosed and needlessly treated, American Academy of Pediatrics says",
      "url": "https://apnews.com/86a4d37b5ae924dc7848f17b8cdd5e3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a5939b9d790945b7a467584a4fade4ac/3000.jpeg"
    },
    {
      "author": null,
      "description": "PARIS (AP) — The French government says multiple telecommunications lines have been hit by acts of vandalism, affecting fiber lines and fixed and mobile phone lines as cities around France are hosting events for the 2024 Paris Olympics.",
      "publishedAt": "2024-07-29T09:45:06Z",
      "title": "Vandalism hits communication lines in France during Paris Olympics",
      "url": "https://apnews.com/8621154b2fa5c35c4a5f0ff2df78393c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97464001c5394f8e919626aa5540038b/3000.jpeg"
    },
    {
      "author": "JENNA FRYER",
      "description": "PARIS (AP) — On the first sunny day of the Paris Olympics, the stars from the United States shined bright.Simone Biles and LeBron James dazzled, so did the U.S.",
      "publishedAt": "2024-07-28T21:59:30Z",
      "title": "Paris Olympics Day 2: Simone Biles and LeBron James shine as Americans step up at the Games",
      "url": "https://apnews.com/d1426d664f54d03115f8053287e47a7e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c693ee60b694df3951d7cc21d561ce9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}