{
  "articles": [
    {
      "author": null,
      "description": "Ukrainian authorities say a Russian drone and missile attack on Ukraine’s capital killed at least six people including a 6-year-old boy. Kyiv City Military Administration head Tymur Tkachenko said Thursday that at least 52 other people were injured in the attacks, and that the number was likely to rise. A large part of a nine-story residential building collapsed after it was struck, Tkachenko added. Rescue teams were at the scene to rescue people trapped under the rubble. Western leaders have accused Putin of dragging his feet in U.S.-led peace efforts in an attempt to capture more Ukrainian land.",
      "publishedAt": "2025-07-31T06:03:39Z",
      "title": "Russia hits Kyiv with missile and drone attack, killing 6 and injuring 52",
      "url": "https://apnews.com/article/russia-ukraine-war-kyiv-attack-76b7e62e44e79a6475c84ce9aaf0fbf2",
      "urlToImage": "https://dims.apnews.com/dims4/default/02b5b86/2147483647/strip/true/crop/8415x4733+0+438/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F12%2Fad0ffd4460c70539fb9dfef6c393%2F29496f7803b34983848959b98bd3f314"
    },
    {
      "author": null,
      "description": "Ukraine’s Parliament has approved a bill tabled by President Volodymyr Zelenskyy that restores the independence of two of the country’s key anti-corruption watchdogs. The move on Thursday reversed his contentious move last week that curbed their power and brought an outcry. Lawmakers approved Zelenskyy’s new proposal with 331 votes and nine abstentions Thursday. Last week’s measure by Zelenskyy to place the watchdogs under the oversight of the prosecutor general prompted an outcry from Ukrainians, the European Union and international rights groups. It raised fears that the government could meddle in investigations and potentially shield its supporters from scrutiny.",
      "publishedAt": "2025-07-31T10:25:20Z",
      "title": "Ukrainian Parliament approves law ensuring independence of anti-graft watchdogs",
      "url": "https://apnews.com/article/russian-ukraine-war-corruption-law-graft-watchdogs-2abf1e53a71ed0fff726c256c55aefb8",
      "urlToImage": "https://dims.apnews.com/dims4/default/838b0c1/2147483647/strip/true/crop/5120x2880+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F21%2F53cb8ee70557a0016d785712569f%2F8daa2d469c27421badc3c4f83a595904"
    },
    {
      "author": null,
      "description": "At least 48 Palestinians have been killed while waiting for food at a crossing in the Gaza Strip. That's according to a hospital that received the casualties Wednesday. It was the latest violence around aid distribution came as the U.S. Mideast envoy was heading to Israel for talks. Shifa Hospital in Gaza City said the dead and wounded were among crowds massed at the Zikim Crossing, the main entry point for humanitarian aid to northern Gaza. It wasn't immediately clear who opened fire. The Israeli military controls the crossing. Israeli strikes and gunfire had earlier killed at least 46 Palestinians overnight and into Wednesday, most of them among crowds seeking food, health officials said.",
      "publishedAt": "2025-07-30T10:55:47Z",
      "title": "Dozens killed while seeking food in Gaza as US envoy heads to Israel",
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-07-30-2025-9b9b516f22e61bd1dde879733fdd97aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/ce924e0/2147483647/strip/true/crop/2995x1685+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2F8f%2Fcd9260278980e313deb028209ef8%2F3984f7f42ea644049ccc555c6b2aa238"
    },
    {
      "author": null,
      "description": "Canadian Prime Minister Mark Carney says Canada will recognize a Palestinian state in September, the latest development in a push against Israel’s Gaza policies. Carney convened a Cabinet meeting on Wednesday to discuss the situation there. Pressure to formally recognize Palestinian statehood has mounted since French President Emmanuel Macron announced his country will become the first major Western power to recognize a Palestinian state in September. The United Kingdom made a similar announcement on Tuesday. Though mostly symbolic, Canada's recognition comes as part of a global shift against Israel and could increase diplomatic pressure for an end to the conflict. More than 140 countries recognize a Palestinian state, including a dozen in Europe.",
      "publishedAt": "2025-07-30T21:25:44Z",
      "title": "Carney says Canada will recognize a Palestinian state in September",
      "url": "https://apnews.com/article/canada-gaza-israel-palestinian-state-0c7dfc4b9985491bc1cbaac9e5d954a3",
      "urlToImage": "https://dims.apnews.com/dims4/default/4580fcf/2147483647/strip/true/crop/3000x1688+0+173/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2Fdc%2F58dea4e59839844ff4b2ed39c725%2Fe87c203ea33942edadf63bb8dec03e5c"
    },
    {
      "author": null,
      "description": "President Donald Trump may have gotten his way with tariffs on some countries, but his overhaul of American trade policy has not gone unchallenged. In May, a three-judge panel of the U.S. Court of International Trade agreed that Trump exceeded his powers when he declared a national emergency to plaster tariffs on imports from almost every country in the world. On Thursday, the U.S. Court of Appeals for the Federal Circuit in Washington will hear oral arguments in the case, which is likely headed to the Supreme Court. Trump is facing at least seven lawsuits charging that he’s overstepped his authority. The plaintiffs want his biggest, boldest tariffs thrown out.",
      "publishedAt": "2025-07-31T04:01:06Z",
      "title": "Triumphant in trade talks, Trump and his tariffs still face a challenge in federal court",
      "url": "https://apnews.com/article/trump-tariffs-court-lawsuit-trade-4c289f51008f6a3a02939caa73ab5404",
      "urlToImage": "https://dims.apnews.com/dims4/default/8721596/2147483647/strip/true/crop/3199x1799+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2Fa2%2F427bcf32ee1ec7d4c5ef916b872c%2Fad97438b152d4cd2a8265b00911db571"
    },
    {
      "author": null,
      "description": "The United States and Pakistan say they have reached a trade agreement that is expected to allow Washington to help develop Pakistan’s largely untapped oil reserves and lower tariffs for the South Asian country. Pakistani officials did not specify where the exploration would take place, but most of Pakistan’s reserves are believed to be in the insurgency-hit southwestern province of Balochistan, where separatists oppose any foreign investment. Early Thursday, U.S. President Trump wrote on his Truth Social platform: “We have just concluded a deal with the country of Pakistan, whereby Pakistan and the United States will work together on developing their massive oil reserves.\" Pakistan's premier also hailed the agreement.",
      "publishedAt": "2025-07-31T10:14:07Z",
      "title": "Pakistan and US reach a trade agreement to develop oil reserves and reduce tariffs",
      "url": "https://apnews.com/article/pakistan-washington-trade-deal-oil-reserves-development-b891d26a9047cba4c13f098be7e068d1",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": null,
      "description": "Russia's top diplomat has meet with Syria's new foreign minister for talks in Moscow during the first formal visit by a Syrian official since President Bashar Assad was ousted last year despite years of Russian support. On Thursday, Russian Foreign Minister Sergey Lavrov expressed a desire for Syria to overcome its challenges, and Syrian Foreign Minister Asaad al-Shibani emphasized the importance of ties with Russia. Despite having been on opposite sides of the battle lines during the civil war, the new Syrian leadership under interim President Ahmad al-Sharaa is taking a pragmatic approach to relations with Moscow. Russia has reportedly continued to support Syria with oil shipments.",
      "publishedAt": "2025-07-31T10:44:36Z",
      "title": "Russia hosts Syria's new foreign minister for the first time since Assad's ouster",
      "url": "https://apnews.com/article/russia-syria-alshibani-lavrov-foreign-minister-0061374ed46e2e1f91d6d00e729f1338",
      "urlToImage": "https://dims.apnews.com/dims4/default/128717e/2147483647/strip/true/crop/5600x3150+0+161/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F14%2F6e9e40ac60aa7d77a778b9bd3b47%2F9862d2fe6cee46df9e42c36449b9afe2"
    },
    {
      "author": null,
      "description": "Officials say a 28-year-old Arkansas man has been arrested in the killings of a married couple in front of their children at Devil’s Den State Park over the weekend. Arkansas State Police arrested the man from Springdale on Wednesday and charged him with two counts of capital murder. Police did not mention a possible motive. Clinton David Brink and Cristen Amanda Brink were found dead Saturday on a walking trail at Devil’s Den. Authorities have said their young daughters were not hurt and are being cared for by family members.",
      "publishedAt": "2025-07-31T05:27:50Z",
      "title": "Arkansas police arrest suspect in brutal killing of couple at Devil's Den State Park",
      "url": "https://apnews.com/article/arkansas-devils-den-f4939dc9a3097e498fe98b655357e377",
      "urlToImage": "https://dims.apnews.com/dims4/default/c027f27/2147483647/strip/true/crop/7632x4293+0+398/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F2a%2F6a1809761a82c0cdda73404f85e7%2F515a9e42d79347ca9bdbae06470cebe9"
    },
    {
      "author": null,
      "description": "Delta Air Lines says a flight from Salt Lake City to Amsterdam was hit by serious turbulence, injuring passengers and forcing the flight to divert to Minneapolis-St. Paul International Airport. The airline says that the airport fire department and paramedics met the flight Wednesday evening and 25 passengers were taken to hospitals for evaluation and treatment. Serious injuries from in-flight turbulence are rare, but scientists say they may be becoming more common as climate change alters the jet stream. A man was killed when a Singapore Airlines flight hit severe turbulence in May 2024, the first person to die from turbulence on a major airline in several decades.",
      "publishedAt": "2025-07-31T04:57:06Z",
      "title": "Severe turbulence injures passengers aboard Amsterdam-bound Delta flight",
      "url": "https://apnews.com/article/delta-flight-turbulence-injuries-f93bc14c4c6f27d0be137483938fddfe",
      "urlToImage": "https://dims.apnews.com/dims4/default/f16d089/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F71%2Ff1%2Ff11092fc1d8ccf053654b29443f6%2F2d2c6b0cc8354876978f6fdd0c69b8f3"
    },
    {
      "author": null,
      "description": "Slugger Eugenio Suarez is headed to the Seattle Mariners and flame-throwing reliever Jhoan Duran has been traded to the Philadelphia Phillies during a busy Wednesday ahead of Major League Baseball’s trade deadline on Thursday. Suarez hit 36 homers for the D-backs this season while Duran is one of MLB’s elite relievers. In other deals, the New York Yankees acquired veteran outfielder Austin Slater while the New York Mets added relievers Ryan Helsley and Tyler Rogers. There are several prominent players available before the deadline, including Cleveland outfielder Steven Kwan and Pittsburgh right-hander Mitch Keller.",
      "publishedAt": "2025-07-30T22:29:33Z",
      "title": "Suárez to Mariners, Durán to Phillies as MLB trade deadline heats up",
      "url": "https://apnews.com/article/mlb-trade-deadline-slater-hayes-9529de0aa5666156384410400ff25500",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a2842f/2147483647/strip/true/crop/6204x3490+0+323/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F87%2Fbe289d936efa271cfd507d64e224%2F248701414f8d423697c97cb18dcfbffb"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}