{
  "articles": [
    {
      "author": "Jon Gambrell",
      "description": "U.S. airstrikes targeting Yemen’s capital killed 12 people and wounded 30 others, the Houthi rebels said early Monday. The deaths mark the latest in America’s intensified campaign of strikes targeting the rebels. The U.S. military’s Central Command declined to answer questions about the strike or discuss civilian casualties from its campaign. The Houthis described the strike as hitting the Farwa neighborhood market in Sanaa’s Shuub district. That area has been targeted before by the Americans. Strikes overnight into Monday also hit other areas of the country.",
      "publishedAt": "2025-04-21T01:34:01Z",
      "title": "US strikes on Yemen's capital kill 12, Houthis say",
      "url": "https://apnews.com/article/yemen-us-airstrikes-iran-04-21-2025-05d9133558d6cfdf0cbd8fe9e3778647",
      "urlToImage": "https://dims.apnews.com/dims4/default/8739240/2147483647/strip/true/crop/3518x1979+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2F3b%2F7490d54f38f72ef5ffcda4944ea9%2F65800dda01e647d3b1389258fc0916cb"
    },
    {
      "author": "Melanie Lidman",
      "description": "An Israeli probe into the killings of 15 Palestinian medics last month in Gaza by Israeli forces says it has found “professional failures” and a deputy commander will be fired. Israel at first claimed that the medics’ vehicles did not have emergency signals on when troops opened fire but later backtracked. Cellphone video recovered from one of the medics contradicted Israel’s initial account. The military investigation said Sunday that the deputy battalion commander, “due to poor night visibility,” assessed that the ambulances belonged to Hamas militants.",
      "publishedAt": "2025-04-20T13:23:29Z",
      "title": "Israeli probe into killings of Palestinian medics finds 'failures'",
      "url": "https://apnews.com/article/gaza-palestinians-israel-hamas-war-medics-killed-437b6ae1e9cf45b3099134524380f004",
      "urlToImage": "https://dims.apnews.com/dims4/default/9f94562/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0f%2Fea%2F1577b442e4cdc9a5410360d3064a%2F918c3792b58944c28d3b79ef76f98fac"
    },
    {
      "author": null,
      "description": "Ukrainian President Volodymyr Zelenskyy accused Russia of trying to create ‘impression of a ceasefire’, saying Russian forces continued attacks despite President Vladimir Putin’s unilateral declaration of an Easter ceasefire. Zelenskyy reported on Sunday 59 shelling incidents, five assaults, and multiple drone strikes. He reiterated Ukraine’s offer to extend the truce for 30 days but stressed his country would respond based on real battlefield conditions. Meanwhile, Russian-installed officials in occupied Kherson say Ukraine has also violated the truce. Putin offered no details on how the ceasefire would be monitored.",
      "publishedAt": "2025-04-20T06:56:19Z",
      "title": "Russia is trying to create 'impression of a ceasefire,' Zelenskyy says",
      "url": "https://apnews.com/article/russia-ukraine-easter-ceasefire-zelenskyy-putin-attacks-934e5c2a493be32b605ddb84d955b34b",
      "urlToImage": "https://dims.apnews.com/dims4/default/4eeb672/2147483647/strip/true/crop/11648x6552+0+1092/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F84%2Fde%2F02c30476064785dd766f7bae63c7%2F6fe4ea41dbac4216b9bcc8b9744fd905"
    },
    {
      "author": null,
      "description": "Police say a woman and a child in Oklahoma flooding as as parts of the region have been hit by severe storms. Police in Moore say two cars were stranded in flood waters Saturday evening and one was swept away under a bridge. Police say they were able to rescue others but two people were found dead, including a 12-year-old boy. Large swaths of Oklahoma remain under a National Weather Service flood watch through Sunday, along with parts of Texas, Missouri, Arkansas and southern Illinois.",
      "publishedAt": "2025-04-20T12:22:32Z",
      "title": "Police: 2 dead in Oklahoma flooding as region remains under severe weather watch",
      "url": "https://apnews.com/article/oklahoma-flooding-deaths-weather-40b64f26f878c37fb5eccb9ff118c35f",
      "urlToImage": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png"
    },
    {
      "author": "Tara Copp",
      "description": "Defense Secretary Pete Hegseth created another Signal messaging chat that included his wife and brother where he shared similar details of a March military airstrike against Yemen’s Houthi militants that were sent in another chain with top Trump administration leaders. The New York Times on Sunday reported the second chat, and a person familiar with the contents and those who received the messages confirmed it to The Associated Press. That person, who spoke on condition of anonymity to discuss sensitive matters, said the unclassified chat included 13 people. The White House late Sunday dismissed the report as a “non-story,” insisting that no classified information was shared.",
      "publishedAt": "2025-04-20T23:20:11Z",
      "title": "Hegseth had a second Signal chat where he shared details of Yemen strike, New York Times reports",
      "url": "https://apnews.com/article/hegseth-signal-chat-houthis-attack-8dbf9dd6c711796438a5c1c84831c40b",
      "urlToImage": "https://dims.apnews.com/dims4/default/9335f23/2147483647/strip/true/crop/5096x2867+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2Fab%2F008b3a8acd8abb1be8984e5d19a8%2F56e2016498f3408db0fa2a0ea546de1f"
    },
    {
      "author": "Marcos Aleman, Megan Janetsky",
      "description": "El Salvador President Nayib Bukele proposed carrying out a prisoner swap with Venezuela on Sunday, suggesting he would exchange Venezuelan deportees from the United States his government has kept imprisoned for who he called “political prisoners” in Venezuela. In a post on the social media platform X, Bukele listed off a number of family members of high-level opposition figures in Venezuela, journalists and activists detained during the government’s electoral crackdown last year.",
      "publishedAt": "2025-04-20T22:08:14Z",
      "title": "El Salvador president proposes prisoner swap with Maduro for Venezuelan deportees",
      "url": "https://apnews.com/article/el-salvador-bukele-maduro-venezuela-prisoners-6728d1df2445d85bd16c6ab8a85056a8",
      "urlToImage": "https://dims.apnews.com/dims4/default/9873d5b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F31%2F88861a09ae0c62b77bf74643a109%2Fc5ff3e97bfbc4c86bca73ae00fd948f3"
    },
    {
      "author": "Steve Peoples",
      "description": "Chris Van Hollen has emerged, for now, as a leading figure in the resistance to President Donald Trump. The Democratic senator from Maryland is the latest in a small but growing collection of officials who are testing the strength of their political power in a weakened party with no clear leader. Van Hollen’s rise follows his decision to travel to El Salvador last week to meet with Kilmar Abrego Garcia, who was wrongly deported. Van Hollen's trip has created a new sense of momentum for the anti-Trump resistance as the Democratic Party struggles to find its footing in the early days of Trump’s presidency.",
      "publishedAt": "2025-04-20T18:13:50Z",
      "title": "After Abrego Garcia trip, anti-Trump resistance finds a leader in Van Hollen",
      "url": "https://apnews.com/article/van-hollen-democrats-trump-resistance-abrego-garcia-084ab2c9691accd1e79b3c956f68d058",
      "urlToImage": "https://dims.apnews.com/dims4/default/ed2c288/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2F1f%2F06ffdd646018482d903a3d68e076%2Fe1eec58d0b224d30a0f57834004d2148"
    },
    {
      "author": null,
      "description": "Haitian authorities say at least three Haitian soldiers were killed in what appeared to be gang ambush in a town on the outskirts of Haiti’s capital on Sunday. The area of Kenscoff has been under heavy fire in recent days as Haitian law enforcement have warred with the gang coalition known as Viv Ansanm. It’s just the latest explosion of violence as Haitian authorities and foreign forces scramble to reign in gang warfare in the Caribbean nation. Haiti’s government in a post on the social media platform X wrote that the soldiers died “on the front line ... weapons in hand.”",
      "publishedAt": "2025-04-21T01:48:48Z",
      "title": "3 Haitian soldiers warring with gangs are slain outside of Port--au-Prince",
      "url": "https://apnews.com/article/haiti-soldiers-killed-gangs-4726f516109fb3ff150f94d3e121162d",
      "urlToImage": "https://dims.apnews.com/dims4/default/ba02086/2147483647/strip/true/crop/5760x3240+0+300/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F0b%2F8dea969f9cb03e98c7f1187df1c8%2F8c82882ad64f4dbc84aac008195b02e4"
    },
    {
      "author": "Aaron M. Kessler, Michael Biesecker",
      "description": "An Associated Press analysis of an aviation safety database reveals that drones last year accounted for nearly two-thirds of reported near midair collisions involving commercial aircraft taking off and landing at major U.S. airports. Over the last decade, a majority of such incidents involved drones. Safety experts say a collision between an airliner and drone could be catastrophic and are urging authorities to take action to reduce the risks.",
      "publishedAt": "2025-04-21T04:03:36Z",
      "title": "As drones become more popular, they are posing an increasing risk to airliners",
      "url": "https://apnews.com/article/drones-risk-airports-planes-safety-collisions-d8bb7192173d90b46258c91152454cf3",
      "urlToImage": "https://dims.apnews.com/dims4/default/88ef237/2147483647/strip/true/crop/6066x3412+0+316/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd5%2Fb4%2Fac33a8c2e0d45684545f957088a9%2Fbbc79c5d7b0d4d51b2bbfc349bdd1e6e"
    },
    {
      "author": "Pelumi Salako",
      "description": "Several canoes paddle toward Makoko, a vast floating slum built on stilts in the lagoon at one end of Nigeria’s economic hub of Lagos. Riding on the canoes are giant cardboard puppet animals along with their puppeteers dressed in black. “The Herds” theatrical tour is journeying 20,000 kilometers (12,427 miles) from Africa’s Congo Basin to the Arctic Circle with puppet animals. It’s a journey organizers say is meant to bring attention to the climate crisis and “renew our bond with the natural world.” The tour started last week in Kinshasa, the capital of Congo, and will continue across the world with Dakar, the Senegalese capital, as the next stop.",
      "publishedAt": "2025-04-20T20:29:09Z",
      "title": "In Nigeria’s floating slum, ‘The Herds’ tour spotlights climate change where it's felt the most",
      "url": "https://apnews.com/article/herds-nigeria-lagos-climate-change-animals-19a8ed11f5c805fceadbc60c584423fd",
      "urlToImage": "https://dims.apnews.com/dims4/default/75c5ef4/2147483647/strip/true/crop/8258x4645+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2Fd5%2F04799e1c4e17d6a2cbf585523d74%2F4cee6189e22644068526e34a0c6a283f"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}