{
  "articles": [
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and ELENA BECATOROS",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Israel's military on Sunday ordered more areas in and around Gaza's second-largest city of Khan Younis to evacuate, as it shifted its offensive to the southern half of the territory where it says many Hamas leaders are hiding.",
      "publishedAt": "2023-12-03T08:21:49Z",
      "title": "Israel widens evacuation orders as it shifts its offensive to southern Gaza amid heavy bombardments",
      "url": "https://apnews.com/1b93089ec82d10ce89df802d51acc108",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c19670fc3374cea9863a105ffacfb20/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "DUBAI, United Arab Emirates (AP) — Vice President Kamala Harris engaged in a speed round of diplomatic talks with Arab leaders on Saturday where she focused on shaping the outlook for a post-conflict Gaza while calling on Israel to do more to protect Palestinian civilians from the “devastating” bombardment.",
      "publishedAt": "2023-12-02T19:28:19Z",
      "title": "Harris focuses on shaping a post-conflict Gaza during a diplomatic blitz in Dubai with Arab leaders",
      "url": "https://apnews.com/52c47491efc64689c7cbc73f68429bf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ebbc6ecb339a4da2a3f64e77c1962ed6/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT and STEVE PEOPLES",
      "description": "DES MOINES, Iowa (AP) — Three senior members of a super PAC backing Florida Gov. Ron DeSantis left the group on Saturday, the latest sign of instability within the 2024 hopeful's political operation just six weeks before the Iowa Republican caucuses.",
      "publishedAt": "2023-12-03T04:04:56Z",
      "title": "Three officials have left a pro-DeSantis super PAC in the group's latest shake-up, AP sources say",
      "url": "https://apnews.com/6e9f0d3d413b20d74eb6d5e0cbca444e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/050f335dc5584c87a396e10fae199c53/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and MICHELLE L. PRICE",
      "description": "CEDAR RAPIDS, Iowa (AP) — Former President Donald Trump on Saturday attempted to turn the tables on his likely rival in November, President Joe Biden, arguing that the man whose election victory Trump tried to overturn is “the destroyer of American democracy.”",
      "publishedAt": "2023-12-03T00:46:08Z",
      "title": "Trump calls Biden the 'destroyer' of democracy despite his own efforts to overturn 2020 election",
      "url": "https://apnews.com/f2f824f056ae9f81f4e688fe590f41b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8d62c894e364bec98c5dd4cef25e7b3/3000.jpeg"
    },
    {
      "author": null,
      "description": "CARACAS, Venezuela (AP) — Venezuelans will vote Sunday in a referendum to supposedly decide the future of a large swath of neighboring Guyana their government claims ownership of, arguing the territory was stolen when a north-south border was drawn more than a century ago.",
      "publishedAt": "2023-12-03T05:01:26Z",
      "title": "Venezuelans to vote in referendum over large swathe of territory under dispute with Guyana",
      "url": "https://apnews.com/90a4f0f962a83620903987a68a7d39b0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/44b2cd372eb14da98a197c491fa26ef1/3000.jpeg"
    },
    {
      "author": "DANIEL POLITI and PATRICIA LUNA",
      "description": "SANTIAGO, Chile (AP) — In Chile, leftists were tortured, tossed from helicopters and forced to watch relatives be raped. In Argentina, many were “disappeared” by members of the brutal military dictatorship that held detainees in concentration camps.",
      "publishedAt": "2023-12-03T05:03:15Z",
      "title": "Kissinger's unwavering support for brutal regimes still haunts Latin America",
      "url": "https://apnews.com/4780b50a4cc7f865b9771c1ab25a7187",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65185b9e37cd490d8253c2db405f5984/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN",
      "description": "DUBAI, United Arab Emirates (AP) — With Planet Earth running a fever, U.N. climate talks focused Sunday on the contagious effects on human health.Under a brown haze over Dubai, the COP28 summit moved past two days of lofty rhetoric and calls for unity from top leaders to concerns on health issues like the deaths of at least 7 million people globally from air pollution each year and the spread of diseases like cholera and malaria as global warming upends weather systems.",
      "publishedAt": "2023-12-03T08:30:20Z",
      "title": "Earth is running a fever. And UN climate talks are focusing on the contagious effect on human health",
      "url": "https://apnews.com/ab2a64170501124239db9efaf11d3f77",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f35417ff35aa489590f415e527b579e3/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — The Philippine president blamed “foreign terrorists” for a bomb blast that killed four people Sunday, wounded dozens of other Catholic worshippers in the south and sparked a security alarm, including in the capital, Manila, where state forces were put on alert.",
      "publishedAt": "2023-12-03T02:10:59Z",
      "title": "Philippine president blames foreign militants for a bombing that killed 4 Christian worshippers",
      "url": "https://apnews.com/f01092608d55b8a9d077f19149f16d0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b14e244a139497596bbdb6303de58a3/3000.jpeg"
    },
    {
      "author": "ELAINE GANLEY",
      "description": "PARIS (AP) — French police arrested a man who targeted passersby in Paris on Saturday night, killing a German tourist with a knife and injuring two others, France's interior minister said.Police subdued the man, a 25-year-old French citizen who had spent four years in prison for planning a violent offense.",
      "publishedAt": "2023-12-02T22:53:22Z",
      "title": "Police in Paris have arrested a man who targeted passersby, killing 1 and injuring 2, official says",
      "url": "https://apnews.com/1fa2a0122afa982c6795eb8f641142ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bd48d8c4ea046fcbb2dea88fc2927d3/3000.jpeg"
    },
    {
      "author": "CLAIRE SAVAGE",
      "description": "CHICAGO (AP) — Muslim community leaders from several swing states pledged to withdraw support for U.S. President Joe Biden on Saturday at a conference in suburban Detroit, citing his refusal to call for a ceasefire in Gaza.",
      "publishedAt": "2023-12-02T19:46:41Z",
      "title": "Group of swing state Muslims vows to ditch Biden in 2024 over his war stance",
      "url": "https://apnews.com/fb3b93f465ed6fd34a901c269a084a90",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a399c9d3d7f44cc81878da34643ddbf/1704.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}