{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israel's government faced calls for a cease-fire from some of its closest European allies on Sunday after a series of shootings, including the mistaken killing of three Israeli hostages, fueled global concerns about the conduct of the 10-week-old war in Gaza.",
      "publishedAt": "2023-12-17T07:44:45Z",
      "title": "Israel faces new calls for truce after killing of hostages raises alarm about its conduct in Gaza",
      "url": "https://apnews.com/22e6e6ac2098dbf29c89c1a49980907b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ca2348661144405bce8421c095e8f2e/1920.jpeg"
    },
    {
      "author": "NOREEN NASIR and AARON MORRISON",
      "description": "Cydney Wallace, a Black Jewish community activist, never felt compelled to travel to Israel, though “Next year in Jerusalem” was a constant refrain at her Chicago synagogue.The 39-year-old said she had plenty to focus on at home, where she frequently gives talks on addressing anti-Black sentiment in the American Jewish community and dismantling white supremacy in the U.S.",
      "publishedAt": "2023-12-17T05:02:29Z",
      "title": "Black American solidarity with Palestinians is rising and testing longstanding ties to Jewish allies",
      "url": "https://apnews.com/966a5eb8f0fb5b34beced29c4dda7331",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d09d1ca576849aeb3a571a638c60632/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Time slipping, White House and Senate negotiators struggled Sunday to reach a U.S. border security deal that would unlock President Joe Biden’s request for billions of dollars worth of military aid for Ukraine and other national security needs before senators leave town for the holiday recess.",
      "publishedAt": "2023-12-17T20:44:01Z",
      "title": "Senate border security talks grind on as Trump invokes Nazi-era 'blood' rhetoric against immigrants",
      "url": "https://apnews.com/cb8d4e3ad8271323cfd9294b527d6615",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60b47f8c2c2849429a47ffb753d87a22/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and GABE STERN",
      "description": "RENO, Nev. (AP) — Former President Donald Trump called out three of Nevada's fake electors Sunday, saying they're being treated unfairly less than 24 hours before they are scheduled to be arraigned for signing certificates falsely stating Trump won the state in 2020.",
      "publishedAt": "2023-12-18T01:56:11Z",
      "title": "Trump says Nevada fake electors treated 'unfairly' during rally in Reno",
      "url": "https://apnews.com/373626355a3233c8c18e3a833cfc67b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e37604c524b948d59edf65dd84b79773/3000.jpeg"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "ALTOONA, Iowa (AP) — Nikki Haley denounced Republican presidential rival Ron DeSantis in Iowa Sunday for campaigning in the state with Kentucky Rep.",
      "publishedAt": "2023-12-18T03:11:23Z",
      "title": "Haley slams DeSantis for stumping in Iowa with Massie, who's opposed votes condemning antisemitism",
      "url": "https://apnews.com/461ef4c45c62c7b69d604e48d022ef05",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/63da086adaf54d479af290d6b6a1042c/3000.jpeg"
    },
    {
      "author": null,
      "description": "GEORGETOWN, S.C. (AP) — An intense late-year storm barreled up the East Coast on Sunday with heavy rains and strong winds that shattered rainfall records, forced water rescues from flooded streets and washed out holiday celebrations.",
      "publishedAt": "2023-12-17T16:00:05Z",
      "title": "Storm drenches Florida and causes floods in South Carolina as it moves up East Coast",
      "url": "https://apnews.com/d4a101d38d4cf2c9d0e11f4e55b63232",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a24bc06ccef441cebd890b7305721126/3000.jpeg"
    },
    {
      "author": "MARÍA VERZA and PATRICIA LUNA",
      "description": "SANTIAGO, Chile (AP) — Chilean voters rejected on Sunday a proposed conservative constitution to replace the country’s dictatorship-era charter.With 96% of votes counted late Sunday, about 55.8% had voted “no” to the new charter, with about 44.2% in favor.",
      "publishedAt": "2023-12-17T05:05:26Z",
      "title": "Chilean voters reject conservative constitution, after defeating leftist charter last year",
      "url": "https://apnews.com/f7be231ff564856f6a5e1b0c0ac12c57",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b7aabc48ea654f249064e90c93a0ad30/3000.jpeg"
    },
    {
      "author": "DUSAN STOJANOVIC",
      "description": "BELGRADE, Serbia (AP) — Serbia’s governing populists claimed a sweeping victory Sunday in the country's parliamentary election, which was marred by reports of major irregularities both during a tense campaign and on voting day.",
      "publishedAt": "2023-12-17T08:02:59Z",
      "title": "Serbia's populists claim a sweeping victory in the country's parliamentary election",
      "url": "https://apnews.com/da06f811adb3e9093bba6b64af3299d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9af76c337194bdeb9c2f11042422d85/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and MARI YAMAGUCHI",
      "description": "SEOUL, South Korea (AP) — North Korea fired an intercontinental ballistic missile into the sea Monday in a resumption of its high-profile weapons testing activities, its neighbors said, as the North vows strong responses against U.S.",
      "publishedAt": "2023-12-17T23:45:53Z",
      "title": "North Korea fires long-range ballistic missile into sea in resumption of weapons launches",
      "url": "https://apnews.com/bc0391e981b2eedce5dc17734e27ee0c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dee3229eb3814c74827db1b41ecbb3a1/3000.jpeg"
    },
    {
      "author": "DEEPTI HAJELA",
      "description": "NEW YORK (AP) — The scene: A crowded shopping center in the weeks before Christmas. Or a warehouse store. Or maybe a packed airport terminal or a commuter train station or another place where large groups gather.",
      "publishedAt": "2023-12-17T05:05:58Z",
      "title": "As 2023 holidays dawn, face masks have settled in as an occasional feature of the American landscape",
      "url": "https://apnews.com/8337bc3f9c5d99192d7bf58a7c2e7cf3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a144e3937ef34ebea990ff5653bc5141/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}