{
  "articles": [
    {
      "author": null,
      "description": "Israel’s military warned people Thursday to evacuate the area around Iran’s Arak heavy water reactor. The warning came in a social media post on X. It included a satellite image of the plant in a red circle like other warnings that proceeded strikes. The Arak heavy water reactor is 155 miles southwest of Tehran. Heavy water helps cool nuclear reactors, but it produces plutonium as a byproduct that can potentially be used in nuclear weapons. That would provide Iran another path to the bomb beyond enriched uranium, should it choose to pursue the weapon. Iran had agreed under its 2015 nuclear deal with world powers to redesign the facility to relieve proliferation concerns.",
      "publishedAt": "2025-06-19T01:44:51Z",
      "title": "Israel’s military warns people to evacuate the area around Iran reactor",
      "url": "https://apnews.com/article/israel-iran-attacks-nuclear-news-06-19-2025-b508817b78ed8d2f6067c1516215cf94",
      "urlToImage": "https://dims.apnews.com/dims4/default/dfa1d67/2147483647/strip/true/crop/4559x2564+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F48%2F19d6eefc601712d491d66529a1e3%2Ffda40aab354741608927ef55ab17879d"
    },
    {
      "author": null,
      "description": "Forecasters say Erick has been upgraded to an \"extremely dangerous” Category 4 hurricane near Southern Mexico’s Pacific coast. The Miami-based U.S. National Hurricane Center reported early Thursday that Erick is about 70 miles west-southwest of Puerto Angel, Mexico, and about 90 miles southeast of Punta Maldonado, Mexico. The storm has maximum sustained winds of 145 mph and is moving northwest at 9 mph. Forecasters say Erick is expected to cause potentially destructive winds and life-threatening flash floods over a wide area.",
      "publishedAt": "2025-06-19T04:24:32Z",
      "title": "Erick upgraded to an 'extremely dangerous' Category 4 hurricane, US forecasters say",
      "url": "https://apnews.com/article/hurricane-erick-mexico-pacific-storm-winds-rain-f2e27fe7d8d30a48de2aa2b4cf952c0d",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0f0260/2147483647/strip/true/crop/4000x2250+0+375/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F4b%2F0ba069e7fdab28d666d31b8c8912%2Fa387450b36f74cca8790c5b56e8c01a2"
    },
    {
      "author": null,
      "description": "Celebrations are planned around the country to commemorate the Juneteenth holiday marking the day in 1865 when Union soldiers brought the news of freedom to enslaved Black people in Texas. The observances on Thursday come even as the Trump administration has been removing content about African American history from federal websites. Nevertheless, the day remains a federal holiday. The Black Heritage Trail of New Hampshire has been holding events for the last two weeks, though the state itself hasn't made the holiday a permanent paid and legal one. Organizers say they want participants to think about how the story of America would change if told by the descendants of enslaved people.",
      "publishedAt": "2025-06-19T04:04:14Z",
      "title": "Juneteenth celebrations commemorate end to slavery in US",
      "url": "https://apnews.com/article/juneteenth-june-19-events-dei-new-hampshire-3c03fd1e722dcfda2cfa9b30a4a3777c",
      "urlToImage": "https://dims.apnews.com/dims4/default/079697c/2147483647/strip/true/crop/1920x1080+0+100/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9e%2F07%2Fb49d2c6c350e839fee6ef9344538%2F44b44f7ed8924541b216fcf067246e36"
    },
    {
      "author": null,
      "description": "President Donald Trump honored Juneteenth in each of his first four years as president, before it became a federal holiday. He even claimed once to have made Juneteenth “very famous.” But on this year's Juneteenth holiday on Thursday, Trump kept silent about a day important to Black Americans for marking the end of slavery in the country he leads again. The president had been expected to issue a proclamation about Juneteenth but White House press secretary Karoline Leavitt told reporters she wasn't tracking that. She declined to say whether Trump would recognize the occasion another way or on another day.",
      "publishedAt": "2025-06-19T20:44:51Z",
      "title": "Trump is silent about Juneteenth holiday",
      "url": "https://apnews.com/article/trump-juneteenth-slavery-statement-holiday-28afec7cd532295437d53d3ec29f549f",
      "urlToImage": "https://dims.apnews.com/dims4/default/3e287a9/2147483647/strip/true/crop/3861x2172+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Feb%2F35%2F3b0234213b2528d010f80b38eb15%2F6c03cfacfca741d38d688b94b879b969"
    },
    {
      "author": null,
      "description": "An appeals court is allowing President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following protests over immigration raids. Thursday’s decision halts a ruling from a lower court judge who found Trump acted illegally by activating the soldiers over opposition from California Gov. Gavin Newsom. The deployment was the first by a president of a state National Guard without the governor’s permission since 1965 and the court case could have wider implications on the president’s power to deploy soldiers within the United States. Trump argued the troops were necessary to restore order, but Newsom said the move inflamed tensions and usurped local authority.",
      "publishedAt": "2025-06-20T02:40:22Z",
      "title": "Trump allowed to keep control of National Guard troops deployed to LA",
      "url": "https://apnews.com/article/los-angeles-protests-national-guard-lawsuit-ae2433fca9a2834634efefc9a545745b",
      "urlToImage": "https://dims.apnews.com/dims4/default/d1faca0/2147483647/strip/true/crop/4597x2586+0+239/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F26%2F73%2Fb7820525444088c119a18ae0d726%2F733645c3232e4f1cb44bdf75b8e4b98a"
    },
    {
      "author": null,
      "description": "The Los Angeles Dodgers organization says it asked U.S. Immigration and Customs Enforcement agents to leave the Dodger Stadium grounds after they arrived at a parking lot near one of the gates. The team says the agents requested permission to access the stadium's parking lot but they were denied entry and were asked to leave. Local media reported dozens of federal agents with their faces covered arrived in SUVs and cargo vans to a lot near the stadium’s Gate E entrance. A group of protesters carrying signs against ICE started amassing shortly after. By Thursday afternoon, only about four agents remained outside the stadium.",
      "publishedAt": "2025-06-19T20:31:45Z",
      "title": "ICE agents asked to leave Dodger Stadium parking lot, team says",
      "url": "https://apnews.com/article/dodger-stadium-ice-denied-entry-8c71b0a569b7bec167d52e99390e2e82",
      "urlToImage": "https://dims.apnews.com/dims4/default/ccf5057/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2Fc1%2Fd61832566f8883c74dc37b18461d%2F106faf4f686445ff99c711d28a66e6ef"
    },
    {
      "author": null,
      "description": "President Donald Trump on Thursday signed an executive order to keep TikTok running in the U.S. for another 90 days to give his administration more time to broker a deal to bring the social media platform under American ownership. It is the third time Trump has extended the deadline. The first one was through an executive order on Jan. 20, his first day in office, after the platform went dark briefly when a national ban took effect. The second was in April when White House officials believed they were nearing a deal to spin off TikTok into a new company with U.S. ownership that fell apart after China backed out following Trump’s tariff announcement.",
      "publishedAt": "2025-06-19T15:35:39Z",
      "title": "Trump extends TikTok shutdown deadline for third time",
      "url": "https://apnews.com/article/tiktok-ban-trump-delay-executive-order-3211a98113615be44cf92b32dca69a8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/e300389/2147483647/strip/true/crop/5135x2888+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F10%2F34cb8e838005fc1e3062e5eac8de%2F39f54b4fcba042c689b17de8fe262234"
    },
    {
      "author": null,
      "description": "Some segments of the U.S. restaurant industry don’t support President Donald Trump’s proposal to eliminate federal taxes on tips. They say it would help too few people and obscure bigger issues in the way tipped workers are paid. The Independent Restaurant Coalition, which represents nearly 100,000 restaurant and bars, has appealed to Congress to reconsider the proposal, which is part of the president’s spending bill. Even some workers who rely on tips say they oppose making them tax-deductible. For now, making tips tax-free appears to have broad support among lawmakers. The House included it in a tax cuts package approved last month. The Senate Finance Committee passed a modified version on Monday.",
      "publishedAt": "2025-06-19T16:47:00Z",
      "title": "Some US restaurants and servers oppose Republicans' 'no tax on tips' budget proposal",
      "url": "https://apnews.com/article/no-tax-tips-trump-workers-restaurants-182a89e3dc5c1da51fcd3ad1aadc571f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c9aea04/2147483647/strip/true/crop/4929x2773+0+256/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F8e%2F4a87c144ef4f8317d46fdd7060a8%2Fae8e988d57ca44df966ba959e386797e"
    },
    {
      "author": null,
      "description": "A SpaceX rocket being tested in Texas has exploded, sending a dramatic fireball high into the sky. The company says the Starship “experienced a major anomaly” at about 11 p.m. Wednesday while on the test stand at Starbase, SpaceX’s launch site at the southern tip of Texas. The company says in a statement on X that \"all personnel are safe and accounted for.\" SpaceX says there are no hazards to nearby communities. It has asked people not to try to approach the site.",
      "publishedAt": "2025-06-19T06:05:48Z",
      "title": "SpaceX rocket being tested in Texas explodes, but no injuries reported",
      "url": "https://apnews.com/article/spacex-starship-launch-explosion-88b94b223d06b258d3e5a2308b7db2c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d5f210c/2147483647/strip/true/crop/5388x3031+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2Fac%2Fc7d898c6f618f30a7d8770c40290%2F6fe8677645b245b386a61bf067c2adcb"
    },
    {
      "author": null,
      "description": "Obi Toppin scored 20 points, Andrew Nembhard added 17 and the resilient Indiana Pacers sent the NBA Finals to a winner-take-all Game 7 by rolling past the Oklahoma City Thunder 108-91 on Thursday night. Pascal Siakam had 16 points and 13 rebounds for Indiana, while Tyrese Haliburton — playing through a strained calf — scored 14 points for the Pacers, who started slowly and then turned things into a blowout. Shai Gilgeous-Alexander scored 21 points for the Thunder, who pulled their starters after getting down by 30 going into the fourth. Jalen Williams added 16. Game 7, the first one in the NBA Finals since 2016, will be Sunday night in Oklahoma City.",
      "publishedAt": "2025-06-19T14:09:00Z",
      "title": "Pacers beat Thunder 108-91, sending the NBA Finals to a deciding Game 7",
      "url": "https://apnews.com/article/nba-finals-game-6-pacers-thunder-2e0d61895cad2f2f9c6e74da20a83bdb",
      "urlToImage": "https://dims.apnews.com/dims4/default/8add35d/2147483647/strip/true/crop/3665x2062+0+191/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F51%2Ff606e9eaa2adbd6c3eb53403f73c%2F0b48284297dc452f9563137daa1782e5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}