{
  "articles": [
    {
      "author": "HANNA ARHIROVA",
      "description": "ODESA, Ukraine (AP) — Russia struck the Ukrainian Black Sea city of Odesa again on Sunday, local officials said, keeping up a barrage of attacks that has damaged critical port infrastructure in southern Ukraine in the past week.",
      "publishedAt": "2023-07-23T07:20:24Z",
      "title": "The latest Russian strike on Ukraine's Odesa leaves 1 dead, many hurt and a cathedral badly damaged",
      "url": "https://apnews.com/adc78b45e74e0236125b1ec706e5d7da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c2677f8392346b994c23775454313b5/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu was recovering in a hospital on Sunday after an emergency heart procedure while opposition to his government's contentious judicial overhaul plan reached a fever pitch and unrest gripped the country.",
      "publishedAt": "2023-07-23T06:36:35Z",
      "title": "Israel's Netanyahu recovers from a heart procedure while his judicial overhaul plan moves forward",
      "url": "https://apnews.com/364da40bb2f8a8125a27a7c7e5630e36",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a16587afe8c241c5a50a372fca0bc65f/3000.jpeg"
    },
    {
      "author": null,
      "description": "NEW DELHI (AP) — Hundreds of rescuers have recovered 27 dead as they pushed on with a fourth day of searching for scores of people still missing after heavy monsoon rains triggered a massive landslide in a village in western India, an official said Sunday.",
      "publishedAt": "2023-07-23T10:29:08Z",
      "title": "Indian rescuers recover 27 dead but no sign of dozens of missing villagers swamped by a landslide",
      "url": "https://apnews.com/7932d46079a105357469d1cbdfa3844d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4a4a6b9b81d429da7ca4eb2da649391/3000.jpeg"
    },
    {
      "author": "CIARÁN GILES",
      "description": "MADRID (AP) — Voters are going to the polls in Spain Sunday in a general election that could make the country the latest European Union member to swing to the political right.Prime Minister Pedro Sánchez called the early election after his Spanish Socialist Workers Party and its far-left partner, Unidas Podemos, took a severe beating in local and regional elections in May.",
      "publishedAt": "2023-07-23T05:03:56Z",
      "title": "Spanish voters make their choice in an election that could see another EU country swing to the right",
      "url": "https://apnews.com/83cad969eac6cf25ced972357a248e99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4c2ee6c9ac345ad8fc2bcd39c3f1eb0/3000.jpeg"
    },
    {
      "author": "SCOTT BAUER",
      "description": "MADISON, Wis. (AP) — Wisconsin's Supreme Court will flip from majority conservative to liberal control in August and Democrats have high hopes the change will lead to the state's abortion ban being overturned and its maps redrawn to weaken GOP control of the Legislature and congressional districts.",
      "publishedAt": "2023-07-23T04:33:55Z",
      "title": "Democrats eye Wisconsin high court's new liberal majority to win abortion and redistricting rulings",
      "url": "https://apnews.com/89907b3aaf0814a434de477e2a45d9bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a258399de2ee4bf4924977498c69e510/3000.jpeg"
    },
    {
      "author": "DEMETRIS NELLAS",
      "description": "ATHENS, Greece (AP) — Some 19,000 people have been evacuated from the Greek island of Rhodes as wildfires continued burning for a sixth day on three fronts, Greek authorities said on Sunday.",
      "publishedAt": "2023-07-23T09:14:24Z",
      "title": "Greek authorities evacuate some 19,000 people as wildfire blazes on the island of Rhodes",
      "url": "https://apnews.com/df9155c19c7af5b81d9e6b2afa7fafd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f0b1240e7424497bf0f3d50126f836f/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden will establish a national monument honoring Emmett Till, the Black teenager from Chicago who was abducted, tortured and killed in 1955 after he was accused of whistling at a white woman in Mississippi, and his mother, a White House official said Saturday.",
      "publishedAt": "2023-07-23T00:25:36Z",
      "title": "Biden will establish a national monument honoring Emmett Till, the Black teen lynched in Mississippi",
      "url": "https://apnews.com/6d26b248f906a4ce5654cb2f11c9ffa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25ebbc7dd8fd4c8aaab49460057f070e/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — As the Taliban swept back into power in Afghanistan in the summer of 2021, Fahima Sultani and her fellow university students tried for days to get into the Kabul airport, only to be turned away by gun-wielding extremists.",
      "publishedAt": "2023-07-23T04:12:32Z",
      "title": "Scholarships have helped displaced Afghan students find homes on university campuses across the US",
      "url": "https://apnews.com/e3cb49e48533e8c9c4e03ef49a26a6f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e13776dc93ab4b819aa3cd873252ee1b/3000.jpeg"
    },
    {
      "author": "ALI JABAR and JARI TANNER",
      "description": "BAGHDAD (AP) — Tensions flared again in Iraq on Saturday over a series of recent protests in Europe involving the desecration of the Quran, Islam’s holy book, which sparked a debate over the balance between freedom of speech and religious sensitivities.",
      "publishedAt": "2023-07-22T07:51:49Z",
      "title": "Protesters try to storm Baghdad's Green Zone over the burning of Quran and Iraqi flag in Denmark",
      "url": "https://apnews.com/08c2c2b8e9ce61963a3d04b08c6f016d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a55d505a51d943e58a22e22e6536ba60/3000.jpeg"
    },
    {
      "author": "SOPHENG CHEANG and DAVID RISING",
      "description": "PHNOM PENH, Cambodia (AP) — Counting of ballots began Sunday in Cambodia's general election in which longtime Prime Minister Hun Sen's party is all but assured a landslide victory thanks to the effective suppression and intimidation of any real opposition.",
      "publishedAt": "2023-07-22T22:02:43Z",
      "title": "Hun Sen set to win by landslide in Cambodian elections with opposition suppressed and critics purged",
      "url": "https://apnews.com/bc3b5f71d1f1fcaab3d246aed7ba5eeb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/716b23f075f84d46803c88c84317e2a1/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}