{
  "articles": [
    {
      "author": "SAMY MAGDY and BASSEM MROUE",
      "description": "BEIRUT (AP) — Palestinians in northern Gaza described heavy Israeli bombardment Saturday in the hours after airstrikes killed at least 22 people, as Israel warned people there and in southern Lebanon to get out of the way of offensives against the Hamas and Hezbollah militant groups.",
      "publishedAt": "2024-10-12T14:30:25Z",
      "title": "Heavy Israeli bombardment in northern Gaza as UN peacekeepers in Lebanon are hit again",
      "url": "https://apnews.com/681c9c85541c8c96b802a1bad8e45e41",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01974d2be1f54d60b11726f9b9ea9074/1920.jpeg"
    },
    {
      "author": "RUSS BYNUM, BRENDAN FARRINGTON and TY ONEIL",
      "description": "CORTEZ, Fla. (AP) — Floridians recovering from Hurricane Milton, many of whom were journeying home after fleeing hundreds of miles to escape the storm, spent much of Saturday searching for gas as a fuel shortage gripped the state.",
      "publishedAt": "2024-10-12T04:03:58Z",
      "title": "Floridians cleaning up from Hurricane Milton are hampered by a widespread fuel shortage",
      "url": "https://apnews.com/d044c0bb6b4ad1f5e2bd61ab44fb1b8c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f444061498454e7a81421eec6ac1d414/1920.jpeg"
    },
    {
      "author": "STEPHANY MATAT and CHRISTOPHER L. KELLER",
      "description": "WELLINGTON, Fla. (AP) — Tony Brazzale, a diving boat captain who has lived for 10 years in his Wellington home in southeastern Florida, wasn't worried about Hurricane Milton.",
      "publishedAt": "2024-10-12T04:07:14Z",
      "title": "Far from where Hurricane Milton's eye hit, tornadoes wrought unexpected damage",
      "url": "https://apnews.com/64caa6609c2a3c6476468ad89b0dee96",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/97c7c8a711134d33b4ec1c597a0a56e6/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "NELSONVILLE, N.Y. (AP) — Voters in a ring of congressional districts encircling New York City where Republican candidates often do well but Donald Trump struggled in 2020 could decide which party controls the U.S.",
      "publishedAt": "2024-10-12T12:25:48Z",
      "title": "Fight for House raging in districts ringing NYC where Trump struggled but other Republicans thrived",
      "url": "https://apnews.com/67b4dd98abe707d221ff857e0787c2c6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17c3dc4f5c1c4595a4cb841d4057b579/3000.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "WASHINGTON (AP) — Barack Obama had frank words for Black men who may be considering sitting out the election. “Part of it makes me think that, well, you just aren’t feeling the idea of having a woman as president, and you’re coming up with other alternatives and other reasons for that,” he said Thursday to Harris-Walz campaign volunteers and officials at a field office in Pittsburgh.",
      "publishedAt": "2024-10-12T15:07:14Z",
      "title": "Obama’s callout to Black men touches a nerve among Democrats. Is election-year misogyny at play?",
      "url": "https://apnews.com/c468d83d73c52406648c9bd5e7b9a33d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a677f3996894846ae2a74d7aaadf191/3000.jpeg"
    },
    {
      "author": "MICHAEL R. BLOOD and MEG KINNARD",
      "description": "COACHELLA, Calif (AP) — With the presidency on the line in battlegrounds like Wisconsin and Pennsylvania, why would Donald Trump venture into California, one of the most solidly Democratic states, just weeks before Election Day?",
      "publishedAt": "2024-10-12T12:10:13Z",
      "title": "Why is Donald Trump campaigning in California, a state he's almost certain to lose?",
      "url": "https://apnews.com/4557c2f98ffc179178fe5b6ec5bcf8aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e457032ad424616970098d6c8feb369/3000.jpeg"
    },
    {
      "author": "SEAN MURPHY and JUAN A. LOZANO",
      "description": "FORT WORTH, Texas (AP) — Attack ads on every TV break. Campaign money pouring in. And on a sunny Saturday, a crowd stretching out the door for a campaign rally at Tulip's, a popular Fort Worth nightclub — this time for Democratic U.S.",
      "publishedAt": "2024-10-12T04:04:08Z",
      "title": "Ted Cruz and Colin Allred wage another big US Senate fight in Texas",
      "url": "https://apnews.com/ebf06d66ff07a94704fac0acec7d30b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9261a0b3e3964d7f83d99e6b47bb4d45/1920.jpeg"
    },
    {
      "author": "JEFF McMURRAY",
      "description": "CHICAGO (AP) — Dominique Davenport was waiting for a ride home after getting off the MetroLink light rail one night in East St. Louis, Illinois, when he heard an argument followed by gunshots behind him on the station's platform.",
      "publishedAt": "2024-10-12T04:05:54Z",
      "title": "Transit systems are targeting fare evaders to win back riders leery about crime",
      "url": "https://apnews.com/ab439fdcd189086164fba2f1bfb1c18d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9a48df8ef42473ca71d0b73be610ca4/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — A NASA spacecraft is ready to set sail for Jupiter and its moon Europa, one of the best bets for finding life beyond Earth.",
      "publishedAt": "2024-10-12T12:30:00Z",
      "title": "NASA's Europa Clipper spacecraft will scour Jupiter moon for the ingredients for life",
      "url": "https://apnews.com/f2a8f35f807f18eba447b518c289a552",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd8bc7cefda7405da2fdd52df21edc2c/1995.jpeg"
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "When a woman has a mammogram, the most important finding is whether there’s any sign of breast cancer.The second most important finding is whether her breasts are dense.Since early September, a new U.S.",
      "publishedAt": "2024-10-12T13:00:18Z",
      "title": "Dense breasts can make it harder to spot cancer on a mammogram",
      "url": "https://apnews.com/24d2d68c39395be2e75b9dec9dc08787",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c22243161a6448e0b159ef0791bca085/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}