{
  "articles": [
    {
      "author": null,
      "description": "WASHINGTON (AP) — Biden says he backs new election in Venezuela but provides no details as US and allies reject Maduro's claims of victory.",
      "publishedAt": "2024-08-15T17:50:06Z",
      "title": "Biden says he backs new election in Venezuela but provides no details as US and allies reject Maduro's claims of victory",
      "url": "https://apnews.com/3a4f97695672d0d36fc250592c0ea540",
      "urlToImage": ""
    },
    {
      "author": "ABBY SEWELL and TIA GOLDENBERG",
      "description": "DOHA, Qatar (AP) — International mediators held a new round of talks Thursday aimed at halting the Israel-Hamas war and securing the release of scores of hostages, with a potential deal seen as the best hope of heading off an even larger regional conflict.",
      "publishedAt": "2024-08-15T06:28:38Z",
      "title": "Mediators hold new Gaza cease-fire talks and hope to head off a wider war",
      "url": "https://apnews.com/a6a5b35859e1d1d1511729b40a71f837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16d25313ab544b019b21b57ee6b4fade/1920.jpeg"
    },
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Tiers of graves are stacked deep underground in a bloated Gaza cemetery, where Sa’di Baraka spends his days hacking at the earth, making room for more dead.",
      "publishedAt": "2024-08-15T10:43:28Z",
      "title": "As Gaza death toll passes 40,000, corpses are buried in yards, streets, tiered graves",
      "url": "https://apnews.com/988d16b648e06e222f04964dc9440da0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7324a26694034ed099568ad064fc0055/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said Thursday that his country's troops had taken full control of Sudzha, which would be the largest Russian town to fall under Ukraine's purview since the start of its cross-border incursion more than a week ago.",
      "publishedAt": "2024-08-15T09:27:47Z",
      "title": "Zelenskyy says Ukrainian troops have taken full control of the Russian town of Sudzha",
      "url": "https://apnews.com/b7fb57c21a43f0f06bf79a4477eb62e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db2ad4a809564036963b184a8adfea46/1920.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA",
      "description": "SAO PAULO (AP) — President Joe Biden said Thursday that he would support new elections in Venezuela, after the United and its allies rejected Nicolás Maduro claims of victory. Asked by reporters at the White House if he supports another vote, Biden said “I do.”",
      "publishedAt": "2024-08-15T14:41:36Z",
      "title": "Biden says he supports redo of Venezuelan presidential vote, breaking with opposition leader",
      "url": "https://apnews.com/1c3afbf01f4c85e7903c2fc3d7fdbf38",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62a04da579b74661b257dfcab29a9714/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris is zeroing in on high food prices as her campaign previews an economic policy speech that she will give in North Carolina on Friday, promising to push for a federal ban on price gouging on groceries.",
      "publishedAt": "2024-08-15T13:49:57Z",
      "title": "Harris is zeroing in on high food prices as inflation remains a big issue in the presidential race",
      "url": "https://apnews.com/c3bbfd8aa3bfd2be3e98d021f0a182ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15508b5cbdb748e2bb690dac2946ecae/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ and ZEKE MILLER",
      "description": "WASHINGTON (AP) — The Biden administration said Thursday that drug price negotiations will knock hundreds of dollars — in some cases thousands — off the list prices of 10 of Medicare’s most popular and costliest drugs.",
      "publishedAt": "2024-08-15T09:04:28Z",
      "title": "White House says deals struck to cut prices of popular Medicare drugs that cost $50 billion yearly",
      "url": "https://apnews.com/34886d6f362c242be268c05d5efd5411",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1cdc4794d4294c6a80bd17dd1a534b2f/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — Peter Marshall, the actor and singer turned game show host who played straight man to the stars for 16 years on “The Hollywood Squares,” has died. He was 98.He died Thursday of kidney failure at his home in the Encino neighborhood of Los Angeles, publicist Harlan Boll said.",
      "publishedAt": "2024-08-15T17:27:47Z",
      "title": "‘Hollywood Squares’ host and Broadway star Peter Marshall dies at 98",
      "url": "https://apnews.com/eb30a22ed1cf4766bb6d83de0b8bb5d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e56926604bd4479198d60d77d326a614/1800.jpeg"
    },
    {
      "author": "ANDREW DALTON and MICHAEL BALSAMO",
      "description": "LOS ANGELES (AP) — A prosecutor says five people have been charged in connection with Matthew Perry's death from a ketamine overdose last year, including the actor's assistant and two doctors.",
      "publishedAt": "2024-08-15T14:32:32Z",
      "title": "Matthew Perry's assistant among 5 people, including 2 doctors, charged in 'Friends' star's death",
      "url": "https://apnews.com/b3708a3818f1c649f234f83a6cd16e30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e691a8bf894e46a78a75bc404cf7cd2a/1920.jpeg"
    },
    {
      "author": "TIFFANY STANLEY",
      "description": "ATCHISON, Kansas (AP) — Among corporate America’s most persistent shareholder activists are 80 nuns in a monastery outside Kansas City.Nestled amid rolling farmland, the Benedictine sisters of Mount St.",
      "publishedAt": "2024-08-15T12:06:56Z",
      "title": "How a small group of nuns in rural Kansas vex big companies with their investment activism",
      "url": "https://apnews.com/e8d8111e8d2c00ced463db40863ec45b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d96cdc7c3da6451383fb313e9376600b/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}