{
  "articles": [
    {
      "author": "Mark Sherman",
      "description": "The Supreme Court is allowing the Trump administration to strip legal protections from 350,000 Venezuelans, potentially exposing them to deportation. The court’s order Monday, with only one noted dissent, puts on hold a ruling from a federal judge in San Francisco that kept in place Temporary Protected Status for the Venezuelans that would have otherwise expired last month. The status allows people already in the United States to live and work legally because their native countries are deemed unsafe for return due to natural disaster or civil strife.",
      "publishedAt": "2025-05-19T16:42:50Z",
      "title": "Supreme Court allows Trump to strip protections from some Venezuelans",
      "url": "https://apnews.com/article/supreme-court-venezuelans-deportation-trump-5589f17e0ecd5d33bfb220e15720f88d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5b9e9ef/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F53%2Fb4%2F28aba2883a2a7268895fa56644b4%2Fee48c15dd5604f6281a7266388de25da"
    },
    {
      "author": "Alanna Durkin Richer, Eric Tucker, Mike Catalini",
      "description": "New Jersey’s top federal prosecutor says she’s charging Democratic Rep. LaMonica McIver with assault after a skirmish with federal officers who arrested the Newark mayor outside an immigration detention center. Interim U.S. Attorney Alina Habba announced the charge Monday on social media, but court papers providing details were not immediately released or publicly available online. Habba said McIver is charged with assaulting, impeding or interfering with law enforcement. Habba also announced that her office is dismissing a misdemeanor case brought against Newark Mayor Ras Baraka. McIver’s attorney, Paul Fishman, the former U.S. attorney for New Jersey, issued a statement calling the decision to charge McIver “spectacularly inappropriate.”",
      "publishedAt": "2025-05-20T00:30:27Z",
      "title": "Democratic Rep. McIver charged with assault after skirmish at ICE center, New Jersey prosecutor says",
      "url": "https://apnews.com/article/new-jersey-mciver-habba-baraka-ice-facility-272c436f7c8eaf67552ce932750ff3e0",
      "urlToImage": "https://dims.apnews.com/dims4/default/749b3b4/2147483647/strip/true/crop/4000x2250+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2F72%2F21e7c130e4f6a7cca971e72a39ab%2F61566b4c3b4144a3b0f3436fab82e05d"
    },
    {
      "author": null,
      "description": "Israeli Prime Minister Benjamin Netanyahu has acknowledged that his decision to resume aid to Gaza came from pressure from allies. In a video statement posted to social media, Netanyahu said on Monday that Israel’s allies had voiced concern about “images of hunger” and said they told the country that “with that, we will not be able to support you.” Netanyahu said the aid that would be let in would be “minimal,” without specifying precisely when it would resume. Israel on Sunday said it would resume aid deliveries into the war-battered territory after a complete halt on imports since early March.",
      "publishedAt": "2025-05-19T08:27:01Z",
      "title": "Netanyahu acknowledges pressure from allies to resume Gaza aid",
      "url": "https://apnews.com/article/mideast-wars-israel-gaza-hamas-05-19-2025-da619d393510e0dde9650adbd39cbf0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e14c831/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2Fc4%2Fd4e40bf6e70610e4055ca4ccacb4%2F6915a89551fa46caa34c99883d439425"
    },
    {
      "author": "Edith M. Lederer",
      "description": "Greece’s top diplomat says the world is facing the most turbulent time since World War II, pointing to a crossroads in democracy and saying Europe is facing a “political identity crisis.” Foreign Minister Giorgos Gerapetritis told The Associated Press in a wide-ranging interview Monday that the “nightmare” and escalating death toll in Gaza must end and that Greece stands by Ukraine. He also says U.S. tariffs are not “good news.” Gerapetritis, whose country holds the presidency of the U.N. Security Council this month, said inequalities between nations and peoples are challenging “the essence of democracy and the rule of law.”",
      "publishedAt": "2025-05-20T04:15:41Z",
      "title": "Greece's top diplomat calls war in Gaza a 'nightmare'",
      "url": "https://apnews.com/article/greece-europe-ukraine-war-united-nations-trump-875bf985cbc4e2eb54d4b8fe45537301",
      "urlToImage": "https://dims.apnews.com/dims4/default/523acc9/2147483647/strip/true/crop/4410x2481+0+230/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F13%2F21%2F04f9b9386ad3d6b49c0afe2e0dbe%2F0cd8ca9a6b3c4eeb8553fe797c8a9a65"
    },
    {
      "author": "Josh Boak, Zeke Miller, Katie Marie Davies",
      "description": "President Donald Trump says Russia and Ukraine will “immediately” begin ceasefire negotiations. Trump spoke Monday after separate calls with the leaders of both countries meant to spur progress toward ending the three-year war. The conversations did not appear to yield a major breakthrough. It was not clear when or where any talks might take place or who would participate. Trump made the announcement days after the first direct engagement between Russian and Ukrainian delegations since 2022. Those negotiations Friday in Turkey brought about a limited exchange of prisoners but no pause in the fighting.",
      "publishedAt": "2025-05-19T04:01:42Z",
      "title": "Trump says Russia-Ukraine ceasefire talks will begin immediately following call with Putin",
      "url": "https://apnews.com/article/trump-putin-zelenskyy-russia-ukraine-war-ceasefire-3ec4144fecac5d77c8bb33cc4d7018ce",
      "urlToImage": "https://dims.apnews.com/dims4/default/2d5afd3/2147483647/strip/true/crop/3504x1971+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F79%2F53%2F0eb6ecc579768630cba6bfaebac3%2F87974a27e99b493c89d48ab2277f4afd"
    },
    {
      "author": "Lisa Mascaro, Kevin Freking, Leah Askarinam",
      "description": "President Donald Trump is heading to Capitol Hill to seal the deal on his “big, beautiful bill.” Using his power of political persuasion, Trump will try to unify divided House Republicans on the multitrillion-dollar package that is at risk of collapsing ahead of planned votes this week. The president has implored GOP holdouts to “STOP TALKING, AND GET IT DONE.” But negotiations are slogging along. It’s not at all clear the package, with its sweeping tax breaks and cuts to Medicaid, food stamps and green energy programs, has the support needed. With all Democrats opposed, the Republicans can handle only a few defections from their slim House majority.",
      "publishedAt": "2025-05-20T04:08:38Z",
      "title": "Trump heads to Capitol Hill to push 'big, beautiful' bill",
      "url": "https://apnews.com/article/congress-republicans-tax-cuts-trump-johnson-ebc172c76ac51434e9bfa28d867bd9a0",
      "urlToImage": "https://dims.apnews.com/dims4/default/d216e72/2147483647/strip/true/crop/4631x2605+0+240/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fae%2Fe6%2Fbebe00b9b250652d29ff92b4a229%2F88f087a2871c4a05b6e15bc48b6d5e2f"
    },
    {
      "author": "Melanie Lidman",
      "description": "The parents of Edan Alexander, an Israeli-American soldier who was held captive in Gaza for 19 months, are overjoyed he is home and slowly absorbing their son's life in captivity. Hamas portrayed the release of Alexander, the last living American hostage in Gaza, as a gesture to President Donald Trump ahead of his Mideast tour last week, which the militants hoped would revive ceasefire talks. Instead, Israel launched a renewed offensive days later that families of the remaining hostages fear could put their loved ones in grave danger.",
      "publishedAt": "2025-05-20T05:01:51Z",
      "title": "Israeli-American hostage's parents says he is making progress after release",
      "url": "https://apnews.com/article/israel-gaza-hamas-israeli-american-freed-hostage-edan-alexander-1f0cc6dde9e1c3fbaef1ca3dea22652f",
      "urlToImage": "https://dims.apnews.com/dims4/default/b1a6c2c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff5%2F4c%2Fd07b58148cce6700aee13f571c9b%2F50d00dab85954d94bd8ff267b0af4f45"
    },
    {
      "author": "Mogomotsi Magome",
      "description": "Topping the agenda at President Donald Trump's meeting with South Africa's president at the White House this week is the extraordinary new U.S. refugee policy welcoming white Afrikaner farmers who the Trump administration claims are persecuted. The Associated Press visited a lively agricultural fair in South Africa's heartland days ahead of the U.S. meeting. Both white and Black farmers and even conservative white Afrikaner groups debunked the Trump administration’s “genocide” and land seizure claims that led the U.S. to cut all financial aid to South Africa. Farmers agree that violent crime is a problem, but for everyone.",
      "publishedAt": "2025-05-20T01:05:12Z",
      "title": "Trump alleges 'genocide' in South Africa. Afrikaner farmers and others scoff",
      "url": "https://apnews.com/article/south-africa-afrikaners-trump-refugees-ramaphosa-c87264523d555a64c0588d8734bba83a",
      "urlToImage": "https://dims.apnews.com/dims4/default/d892554/2147483647/strip/true/crop/8223x4625+0+401/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2Fed%2Fddad32506c25d511bade9cf7adf9%2F3adb0ef1abe04cda988045fc684240a8"
    },
    {
      "author": "Dylan Lovan, Carolyn Kaster",
      "description": "Officials in Kansas and Texas are evaluating damage from overnight tornadoes just days after storms killed more than two dozen people in communities in Kentucky and Missouri. The National Weather Service says meteorologists predicted days of dangerous weather conditions across the central U.S. with heavy rains, thunderstorms and potential tornadoes. Officials in Reno County, Kansas, say a powerful tornado tore through late Sunday and damaged several homes, trees and utility poles. Officials say damage was extensive, but no injuries or deaths were reported. An official in Palo Pinto County, Texas, says they're evaluating damage there on Monday morning.",
      "publishedAt": "2025-05-19T15:34:58Z",
      "title": "Storms and tornadoes across central US kill dozens and damage homes",
      "url": "https://apnews.com/article/storms-tornadoes-kentucky-missouri-kansas-texas-c523eab4670e39455e9b8700268ed2a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/703e490/2147483647/strip/true/crop/3842x2161+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2F6e%2F96709ae3d62f639bc3d072027193%2F773cc8bde6954c42ad94cbbce76eb308"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "Singer Dawn Richard has resumed her testimony in the sex trafficking and racketeering trial of Sean “Diddy” Combs, saying he threatened her with death if she told anyone that she saw the influential hip-hop promoter beat his longtime girlfriend, the singer Cassie. Prosecutors were using the testimony from Richard on Monday in Manhattan federal court to show that Combs used violence and threats to control others as he leveraged his fame to get what he wanted. He has pleaded not guilty and his lawyers say prosecutors are showing proof of domestic violence, but not the federal crimes with which he's charged.",
      "publishedAt": "2025-05-19T14:18:57Z",
      "title": "Singer Dawn Richard says Sean 'Diddy' Combs threatened her with death after she saw him beat Cassie",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-richard-cassie-8a7c96a0c48d95b9d6ac0adfddaae1a4",
      "urlToImage": "https://dims.apnews.com/dims4/default/764487a/2147483647/strip/true/crop/4080x2295+0+389/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1f%2F40%2Ff12b9eb06cf5cb464101ecc8fa50%2F1b1878373b054b5691309af6d2694a23"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}