{
  "articles": [
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump has signed an order to impose stiff tariffs on imports from Mexico, Canada and China, fulfilling a campaign promise but raising the prospect of trade conflict and increased prices for American consumers. Trump is declaring an economic emergency to put duties of 10% on all imports from China and 25% on imports from Mexico and Canada — America’s largest trading partners — except for a 10% rate on Canadian oil. The White House said Trump’s order also includes a mechanism to escalate the rates if the countries retaliate against the U.S., as they have threatened. Trump says the tariffs are to force the countries to do more to stop the flow of fentanyl into the U.S.",
      "publishedAt": "2025-02-01T14:14:28Z",
      "title": "Trump imposes tariffs on Canada, Mexico and China. Costs could increase",
      "url": "https://apnews.com/article/trump-tariffs-trade-china-mexico-canada-inflation-753a09d56cd318f2eb1d2efe3c43b7d4",
      "urlToImage": "https://dims.apnews.com/dims4/default/0499847/2147483647/strip/true/crop/5693x3202+0+299/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fdc%2F71958bfcb7bbe0e661ff76295985%2Fe7084f207c594f52bd23eb152e93ad59"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "Tariffs are in the news at the moment. But what are they? Tariffs are typically charged as a percentage of the price a buyer pays a foreign seller. In the United States, tariffs are collected by Customs and Border Protection agents at 328 ports of entry across the country. Tariffs can be lower for countries with which the United States has trade agreements. For example, most goods can move among the United States, Mexico and Canada tariff-free because of Trump’s US-Mexico-Canada trade agreement. Mainstream economists are generally skeptical of tariffs.",
      "publishedAt": "2025-01-27T21:14:33Z",
      "title": "What are tariffs and how do they work?",
      "url": "https://apnews.com/article/economy-import-tariff-fce31b5c5c9f058ff09353c6846b1cf9",
      "urlToImage": "https://dims.apnews.com/dims4/default/64acfc1/2147483647/strip/true/crop/3896x2192+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F94%2Fc3%2F52815690e03dea84bf89947478b0%2F6f880352f5454645926c54a604717a52"
    },
    {
      "author": "PAUL WISEMAN",
      "description": "President Donald Trump said this week that tariffs on U.S. neighbors Canada and Mexico will arrive Saturday. The two nations are not only close geographically, but economically as well. The business between the North American nations now exceeds China, totaling $1.8 trillion in 2023. That is far greater than the $643 billion in commerce that the U.S. did with China in that same year. Following are just a few imported goods that could be hit first.",
      "publishedAt": "2025-01-31T12:43:44Z",
      "title": "Trump tariffs on Mexico and Canada could land this weekend. Here are some goods in the crosshairs",
      "url": "https://apnews.com/article/america-canada-mexico-tariffs-trump-trade-4568dababcf524945333bb518232ec4b",
      "urlToImage": "https://dims.apnews.com/dims4/default/a386812/2147483647/strip/true/crop/2250x1266+0+117/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F21%2F20ffe7a55af9fab7724a337e6938%2F6da0acf14de24a4581f40a4d9fe979a2"
    },
    {
      "author": "JOSH BOAK",
      "description": "President Donald Trump has fired the director of the Consumer Financial Protection Bureau, Rohit Chopra, in the latest purge of a Biden administration holdover. Chopra was one of the more important regulators from the previous Democratic administration who was still on the job since Trump took office on Jan. 20. Chopra's tenure saw the removal of medical debt from credit reports and limits on overdrafts penalties. But many in the financial industry saw his actions as regulatory overreach. In a social media post Saturday about his departure, Chopra thanked people across the country who “shared their ideas and experiences” with the government’s consumer financial watchdog agency.",
      "publishedAt": "2025-02-01T15:02:01Z",
      "title": "Trump fires Rohit Chopra, Consumer Financial Protection director",
      "url": "https://apnews.com/article/trump-chopra-consumer-financial-protection-bureau-47b6b39d0eff05ea0c9bca4eacf55b79",
      "urlToImage": "https://dims.apnews.com/dims4/default/adf44fa/2147483647/strip/true/crop/4492x2527+0+233/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2Fcc%2Fca46e581bf177cbdb8d65fca1903%2F123c1c9d2b4c4d5ea8a4cb5e61afa7b3"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "USAID’s website has dropped offline without explanation in the Trump administration's two-week-old funding freeze of U.S. foreign aid and development funding. Congressional Democrats are becoming increasingly vocal against the crackdown on the agency. They also are warning against any move by the Trump administration to end USAID as an independent agency, and absorb it into the larger State Department. Thousands of layoffs are continuing in the global aid community from the administration’s shutdown of billions of the United States’ humanitarian, development and security assistance.",
      "publishedAt": "2025-02-01T23:34:23Z",
      "title": "USAID website goes offline in Trump administration's 2-week-old freeze on foreign aid worldwide",
      "url": "https://apnews.com/article/usaid-website-offline-trump-foreign-funding-freeze-9d2ecdaff5c74a9f6b0d6096fa2228ff",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee1ada6/2147483647/strip/true/crop/6520x3668+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Fa0%2F063794ea10ef3a36f81d8950b3e5%2F88e1689c897d43d0bf72855851521a31"
    },
    {
      "author": "MARC LEVY, MATT ROURKE",
      "description": "At least seven people were killed and 19 were injured when an air ambulance crashed to the ground on a busy Philadelphia street, creating what witnesses described as a massive fireball and a chaotic street scene. The dead from Friday's accident include a child who was receiving treatment at a Philadelphia hospital. All six on board the medical transport jet were from Mexico. None survived, while one person in a car was killed. Hospitals say most of the injured have been released. NTSB chair Jennifer Homendy called it a “high-impact crash” that left the plane “highly fragmented.” Officials say the impact area is blocks-long, and it could take weeks to recover the debris.",
      "publishedAt": "2025-02-01T06:38:23Z",
      "title": "All 6 on medical plane that crashed in Philadelphia were killed",
      "url": "https://apnews.com/article/philadelphia-plane-crash-medical-transport-8617dab53471190832dd73db149489fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/9bb6529/2147483647/strip/true/crop/3744x2106+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2Ff9%2F933e152354b6b3562d90b78d5fcc%2Fe10496d6a0a34ffcbcef7838b979c266"
    },
    {
      "author": "THOMAS BEAUMONT, ADRIANA GOMEZ LICON, NICHOLAS RICCARDI",
      "description": "Just a day before a deadly midair collision at Reagan National Airport outside Washington, D.C., employees at the Federal Aviation Administration were sent an offer to resign with eight months’ pay. The union for air traffic controllers recommended to its members that they not accept Tuesday’s offer. An official for the Office for Personnel Management said Friday that controllers weren’t eligible for the resignation plan or subject to the hiring freeze across much of the rest of federal government. The crash that killed all 67 people on board an American Airlines jet and an Army helicopter has renewed focus on the real-world implications of President Donald Trump’s push to slash the federal bureaucracy.",
      "publishedAt": "2025-01-31T23:47:31Z",
      "title": "Air traffic controllers were initially offered buyouts",
      "url": "https://apnews.com/article/jet-helicopter-crash-air-traffic-controllers-caee8a1e14eb5d156725581d41e6a809",
      "urlToImage": "https://dims.apnews.com/dims4/default/58a2fdb/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F09%2F0a%2Feec8edd138807df7ac15e0b637fe%2F4502eae0447749dabaa92c62c8c567d2"
    },
    {
      "author": "DAVID BAUDER",
      "description": "CBS says it will turn over unedited transcripts of its October interview with Kamala Harris to the Federal Communications Commission. The network said Friday it was compelled to do so by Brendan Carr, President Donald Trump's appointee to lead the FCC. Trump has complained that Harris' interview with his election opponent was deceptively edited to make her look good, filing a $10 billion lawsuit and continuing with the case despite winning the election. The FCC probe is running parallel with the lawsuit, despite published reports that Trump's lawyers are engaged in potential settlement discussions with CBS News' corporate parent, Paramount.",
      "publishedAt": "2025-02-01T00:15:25Z",
      "title": "CBS agrees to hand over '60 Minutes' Harris interview transcripts to FCC",
      "url": "https://apnews.com/article/trump-cbs-60-minutes-harris-interview-ac36372dd700c9d233eee78773473f49",
      "urlToImage": "https://dims.apnews.com/dims4/default/d99bd1b/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2F62%2F1c80ac5523ec49ed082780e5032b%2Fb1047cb3d8744c44985bbcafedf8c78f"
    },
    {
      "author": "CLAUDIA LAUER",
      "description": "Officials say preliminary data from the midair crash between an airliner and an Army helicopter showed conflicting indications about the aircrafts’ altitudes when they collided near a Washington, D.C., airport, killing everyone aboard. National Transportation Safety Board officials say data from the jet’s flight data recorder showed its altitude at 325 feet, plus or minus 25 feet, when the crash happened Wednesday night. However data in the control tower showed the Black Hawk helicopter at 200 feet. The roughly 100-foot discrepancy has yet to be explained.",
      "publishedAt": "2025-02-01T17:30:27Z",
      "title": "Recovery crews return to the Potomac debris after deadly DC air crash",
      "url": "https://apnews.com/article/washington-plane-crash-helicopter-recovery-980dcaf1acb6f80260146edbaaa9e4c1",
      "urlToImage": "https://dims.apnews.com/dims4/default/3281097/2147483647/strip/true/crop/5683x3197+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F9f%2F27a95e69142f511dc403b5064245%2F7d5daaf4b780420cac0fb5ae47d4880f"
    },
    {
      "author": "FATIMA HUSSEIN",
      "description": "The Department of Government Efficiency, run by President Donald Trump’s billionaire adviser and Tesla CEO Elon Musk, has gained access to sensitive Treasury data including Social Security and Medicare customer payment systems. That's according to two people familiar with the situation. DOGE, which is assigned to find ways to reduce federal workers, cut programs and slash federal regulations, would have wide leeway to access important taxpayer data, among other things. Senate Finance Committee member Ron Wyden, an Oregon Democrat, sent a letter to Treasury Secretary Scott Bessent on Friday. He expressed concern that “officials associated with Musk may have intended to access these payment systems to illegally withhold payments to any number of programs.”",
      "publishedAt": "2025-02-02T02:16:27Z",
      "title": "Elon Musk's DOGE commission gains access to sensitive Treasury payment systems: AP sources",
      "url": "https://apnews.com/article/donald-trump-elon-musk-doge-treasury-5e26cc80fcb766981cea56afd57ae759",
      "urlToImage": "https://dims.apnews.com/dims4/default/792a1ee/2147483647/strip/true/crop/4323x2432+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F40%2F4b%2F2a922679318da2b2fe1757712380%2F43fb2bae60ee400097258000820369c5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}