{
  "articles": [
    {
      "author": "CALVIN WOODWARD",
      "description": "Donald Trump has given voters a hefty list of promises, and many of them come due right away. On many major issues, Trump promises to deliver on Day 1. The Republican said during his presidential campaign he'll issue first-day pardons for some of the rioters who attacked the Capitol on Jan. 6, 2021. Trump says he'll launch the largest deportation in U.S. history, declare a national emergency to spur the approval of energy projects and end birthright citizenship. But there's only so much Trump can do without Congress, and some of his Day 1 vows are bound to fall short.",
      "publishedAt": "2025-01-16T19:21:50Z",
      "title": "Trump offered a bountiful batch of campaign promises that come due on Day 1",
      "url": "https://apnews.com/article/trump-day-1-promises-9c842ada3c54e2219445f1598db2c8d6",
      "urlToImage": "https://dims.apnews.com/dims4/default/7316cf3/2147483647/strip/true/crop/4198x2361+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F45%2Fc78ca9c541ebe28d665b6b1d9eec%2F92613388c0f84880be167ad357fb6051"
    },
    {
      "author": "NICHOLAS RICCARDI, ALI SWENSON",
      "description": "The super-rich have long played a role in U.S. politics but have an unusually prominent spot in incoming President Donald Trump's new administration. President Joe Biden's farewell warning about a tech-fueled “oligarchy” is due to that. Biden and his fellow Democrats have also long been supported by billionaires, but not in the same direct way or with the same dynamics of threats and demands for loyalty that come from Trump. The use of the term “oligarchy” harkens to Russian politics.",
      "publishedAt": "2025-01-16T21:45:51Z",
      "title": "As Biden warns of an 'oligarchy,' Trump keeps tech billionaires close",
      "url": "https://apnews.com/article/oligarchy-musk-bezos-zuckerberg-trump-biden-altman-putin-3ade224cccfb287f7fadaeac42b76e3d",
      "urlToImage": "https://dims.apnews.com/dims4/default/42ceb36/2147483647/strip/true/crop/8256x4644+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2F0d%2F072e89420e65a597522299bb32f5%2F1ee306173ed546a1823bb6c202233951"
    },
    {
      "author": "JOSH BOAK",
      "description": "President Joe Biden in his Wednesday farewell speech to the nation warned that American democracy was sliding into an “oligarchy” of tech billionaires. But even before Biden’s speech, the rising wealth gap in the United States — as well as in China — raised concerns about whether the world’s two largest economies were becoming oligarchies.",
      "publishedAt": "2025-01-16T18:11:13Z",
      "title": "What is an oligarchy? Biden warns the US risks centralizing power",
      "url": "https://apnews.com/article/oligarchy-biden-zuckerburg-bezos-musk-altman-a44e281c6dbf2fd6cd174f13cdcdc1c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4d0038/2147483647/strip/true/crop/8230x4629+0+433/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2Fb4%2Fe5025aa090e9b8e300987dd01a19%2Ff85c3c2715b74a7883632fa4376cc654"
    },
    {
      "author": "MARCIA DUNN",
      "description": "SpaceX has caught its Starship rocket back at the pad following liftoff. But the spacecraft launched on top Thursday was destroyed. Elon Musk’s company confirmed the loss just minutes into the flight from the southern tip of Texas. The spacecraft’s engines shut down one by one, and contact soon was lost. SpaceX says it will take time to figure out what went wrong. The trouble arose just a minute after the first-stage booster returned to the launch pad and was captured by giant mechanical arms. It was the seventh test flight for the world’s biggest and most powerful rocket.",
      "publishedAt": "2025-01-16T22:38:14Z",
      "title": "SpaceX loses spacecraft after catching rocket booster at the launch pad in latest Starship test",
      "url": "https://apnews.com/article/spacex-elon-musk-starship-e165e81ed2350ce684c7ed8d9357d7ba",
      "urlToImage": "https://dims.apnews.com/dims4/default/563c6b2/2147483647/strip/true/crop/7154x4024+0+372/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F38%2F814940d05bed06b5abeba4cdda6f%2Fd14548a746a8469c8e70a54faae8db96"
    },
    {
      "author": "STAN CHOE",
      "description": "The yield on the 10-year Treasury has recently soared toward its highest level since 2023, injecting nervousness into the U.S. stock market that's knocked indexes from their records. The bond market's moves might seem strange given that the Federal Reserve has lowered interest rates three times since September. But it’s a reminder that investors care more about the future than the present. And the bond market is currently worried about potentially higher inflation and a U.S. economy that may not need more help from easier interest rates. That’s hurting the stock market.",
      "publishedAt": "2025-01-16T11:00:38Z",
      "title": "Why are interest rates rising when the Fed has been cutting them?",
      "url": "https://apnews.com/article/fed-bonds-interest-rates-37c91aa8d1cc4d2a09506d31e9dba99b",
      "urlToImage": "https://dims.apnews.com/dims4/default/c5bd1e8/2147483647/strip/true/crop/3628x2041+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2Ff4%2F67058bc9aae5e517e58ba287b1dc%2F9105eccfa33646a395a0fb552ff21e36"
    },
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE, JOSH BOAK, MARY CLARE JALONICK",
      "description": "President Joe Biden won’t enforce a ban on the social media app TikTok that is set to take effect a day before he leaves office, a U.S. official says. That leaves TikTok's fate in the hands of President-elect Donald Trump. Congress last year in a law signed by Biden required that TikTok’s China-based parent company ByteDance divest the company by Jan. 19. Trump, who once called to ban the app, has since pledged to keep it available in the U.S., though his transition team has not said how they intend to accomplish that. TikTok CEO Shou Zi Chew is expected to attend Trump’s inauguration.",
      "publishedAt": "2025-01-16T01:48:28Z",
      "title": "Biden won't enforce TikTok ban, official says",
      "url": "https://apnews.com/article/tiktok-ban-trump-executive-order-1e95d9836bf6f8c0c245ed1c3234d968",
      "urlToImage": "https://dims.apnews.com/dims4/default/9b1ef1d/2147483647/strip/true/crop/3060x1721+0+159/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2Fe6%2F4a3490a1bad6484390f759078229%2Fa540f4e40009415f8dfbd77f19197a70"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA, SAMY MAGDY",
      "description": "Israel has delayed a Cabinet vote on the long-awaited ceasefire deal that would pause the fighting in the Gaza Strip and release dozens of hostages. Prime Minister Benjamin Netanyahu says a last-minute dispute with Hamas is holding up Israeli approval. Hamas denied the claims. Netanyahu postponed the Cabinet vote on the agreement that had been scheduled for Thursday until Friday, at the earliest. Netanyahu signaled complications with the deal shortly after U.S. President Joe Biden and key mediator Qatar announced it was complete. Meanwhile, Israeli airstrikes killed at least 72 people in the war-ravaged territory.",
      "publishedAt": "2025-01-16T08:43:40Z",
      "title": "Israel PM Netanyahu says Cabinet won't meet over Gaza ceasefire",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-16-2024-dc0ef64dd52db395c5a54328518e8efd",
      "urlToImage": "https://dims.apnews.com/dims4/default/c1728b8/2147483647/strip/true/crop/3426x1927+0+178/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2Ff7%2Fc60a54009fad2b224c70ed5c6b16%2Fa54bae01200f4a988ef59fd63292f800"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "Palestinians in the Gaza Strip are eager to leave miserable tent camps and return to their homes if a long-awaited ceasefire agreement halts the Israel-Hamas war. But many will find there is nothing left and no way to rebuild. Israel’s bombardment and ground operations have transformed entire neighborhoods in several cities into charred wastelands. Blackened shells of buildings and mounds of rubble stretch away in all directions. Major roads have been plowed up. Critical water and electricity infrastructure is in ruins. Most hospitals no longer function. And it’s unclear when — or even if — much of it will be rebuilt.",
      "publishedAt": "2025-01-16T18:55:29Z",
      "title": "Palestinians in Gaza are eager to return home in a ceasefire but many will find nothing left",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-damage-reconstruction-d120f8a0dc8b728c0d8332046a524a92",
      "urlToImage": "https://dims.apnews.com/dims4/default/7571bb6/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F32%2F05f9cb8f630e54f05f090223470c%2F0ef35a78895445338d5b4a2dd521213a"
    },
    {
      "author": "VICTORIA EASTWOOD, SAMY MAGDY",
      "description": "Egypt’s chief diplomat is calling on Israel and Hamas to implement a Gaza ceasefire plan “without any delay.” The message by Foreign Minister Badr Abdelatty on Thursday raises pressure on Israeli Prime Minister Benjamin Netanyahu to accept the deal. Abdelatty spoke to The Associated Press at a sensitive time. A day after President Joe Biden and other international mediators announced the ceasefire agreement, Netanyahu insisted there still was no deal. Abdelatty declined to comment on Netanyahu’s claims that Hamas has “reneged” on certain pledges in the agreement. He said “we have a deal” and that it was time to move forward.",
      "publishedAt": "2025-01-16T21:16:04Z",
      "title": "AP Exclusive: Egypt's chief diplomat urges Israel and Hamas to enact ceasefire 'without any delay'",
      "url": "https://apnews.com/article/ceasefire-egypt-gaza-hamas-israel-eu-war-3e434d5612f62ee5b188acf74f65f1fb",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7cb79e/2147483647/strip/true/crop/4724x2657+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F14%2Fb2%2Fdbf26d9373db9e1b37b3a9bae45b%2F2ca2db62997542b685c1b09dc637a348"
    },
    {
      "author": "GEOFF MULVIHILL, LINDSAY WHITEHURST",
      "description": "A federal judge in Texas is allowing three other states to pursue a challenge seeking to restrict access to the abortion pill mifepristone nationwide. The states of Idaho, Kansas and Missouri can now move ahead with their efforts in U.S. District Court in Amarillo, Texas, where a nominee of former President Donald Trump is the only judge. The states want the courts to prohibit telehealth prescriptions of the pill and to limit its use to the first seven weeks of pregnancy. It’s a narrower challenge than the case brought by a group of anti-abortion doctors. They were told by the U.S. Supreme Court that they don’t have the legal right to try to have federal approval of the drug undone entirely.",
      "publishedAt": "2025-01-16T23:42:43Z",
      "title": "Texas judge says states can revive challenge to abortion pill access nationwide",
      "url": "https://apnews.com/article/abortion-pill-mifepristone-telehealth-weeks-judge-03706a1e95fc7725684be582a00a6700",
      "urlToImage": "https://dims.apnews.com/dims4/default/d8dde29/2147483647/strip/true/crop/2470x1389+0+129/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2Fec%2F7555ac62a8b2aec1055cca9d3989%2F177a27ef3def4e8ea1dfeb1258d65faf"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}