{
  "articles": [
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — South Korea’s opposition parties Wednesday submitted a motion to impeach President Yoon Suk Yeol over the shocking and short-lived martial law that drew heavily armed troops to encircle parliament before lawmakers climbed walls to reenter the building and unanimously voted to lift his order.",
      "publishedAt": "2024-12-04T01:14:46Z",
      "title": "South Korea’s opposition parties submit a motion to impeach President Yoon over sudden martial law",
      "url": "https://apnews.com/25a2a7c957e77a19f771b6b7c56a2173",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e7f495ed07cd4296b2d692c5d49ca8db/1920.jpeg"
    },
    {
      "author": "FOSTER KLUG",
      "description": "TOKYO (AP) — It may seem that the wild predawn scenes in Seoul, with hundreds of armed troops and frantic lawmakers storming South Korea's parliament building after the president suddenly declared martial law, came out of nowhere.",
      "publishedAt": "2024-12-04T07:26:42Z",
      "title": "Shock martial law edict in South Korea follows chaotic recent history: A look at the crucial context",
      "url": "https://apnews.com/eb59571aa1ff36ca22f8427b39bb7133",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4c015057b02241f8a82d65f510632551/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Jewish settlers mounted a string of attacks on Palestinian towns in the occupied West Bank overnight, burning homes and clashing with Israeli troops.There were no immediate reports of any Palestinian casualties.",
      "publishedAt": "2024-12-04T09:26:43Z",
      "title": "Middle East latest: Jewish settlers attack Palestinian towns and clash with Israeli troops",
      "url": "https://apnews.com/1369e179a32e5272ac99f6818f69cb8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9149d412718a432bbc4e4082dba3f3b5/3000.jpeg"
    },
    {
      "author": "KAREEM CHEHAYEB",
      "description": "BEIRUT (AP) — Over the past dozen years, Syrian militant leader Abu Mohammed al-Golani has worked to remake his public image and the insurgency he commands, renouncing longtime ties to al-Qaida and consolidating power before emerging from the shadows.",
      "publishedAt": "2024-12-04T05:12:21Z",
      "title": "Who is Abu Mohammed al-Golani, the leader of Syria's shock insurgency?",
      "url": "https://apnews.com/0c11961094ca4fb7fe1bccce1c4b3302",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/368d75a4811843c58ecf83fb3562c5eb/2232.jpeg"
    },
    {
      "author": "LISA MASCARO, MARY CLARE JALONICK and TARA COPP",
      "description": "WASHINGTON (AP) — Pete Hegseth, President-elect Donald Trump's pick for Defense Secretary, spent a second day Tuesday on Capitol Hill, meeting privately with Republican senators amid rising questions about his ability to effectively lead the Pentagon.",
      "publishedAt": "2024-12-04T01:08:57Z",
      "title": "Trump's defense pick Pete Hegseth faces deepening scrutiny in Senate",
      "url": "https://apnews.com/c5209938f7ccf7afe6ade7818817ca07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/715ae5f075ea4e878e81f9895a482dbe/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Chad Chronister, Donald Trump's pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second person selected by the president-elect to bow out quickly after being nominated for a position requiring Senate confirmation.",
      "publishedAt": "2024-12-03T22:56:24Z",
      "title": "Chad Chronister, Donald Trump’s pick to run the DEA, withdraws name from consideration",
      "url": "https://apnews.com/032bd91a5ef447e820e2b1f63e50861e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c1ffe008754447c69e8f20222b5dd89f/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "LUANDA, Angola (AP) — Even in the waning days of his presidency and thousands of miles from home, U.S. President Joe Biden is finding ways to celebrate trains.",
      "publishedAt": "2024-12-04T05:08:40Z",
      "title": "'Amtrak Joe' Biden uses his visit to Angola to promote a major African rail project",
      "url": "https://apnews.com/f5dd55e80331f2416136ff34bab60d4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d82374f5cc24d32bb767c961408d855/3000.jpeg"
    },
    {
      "author": "JIM SALTER",
      "description": "BONNE TERRE, Mo. (AP) — Rowan Ford knew Christopher Collings as “Uncle Chris” after he spent several months living with her family.",
      "publishedAt": "2024-12-03T05:03:25Z",
      "title": "Missouri executes a man for sexually assaulting and strangling a 9-year-old girl in 2007",
      "url": "https://apnews.com/f5a027c86c53725556a5a66751abd36d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/755d5f2c9efa4ee88325a03720df774d/2304.jpeg"
    },
    {
      "author": "BARBARA ORTUTAY",
      "description": "It is an ambitious social experiment of our moment in history — one that experts say could accomplish something that parents, schools and other governments have attempted with varying degrees of success: keeping kids off social media until they turn 16.",
      "publishedAt": "2024-12-04T05:07:17Z",
      "title": "Australia is banning social media for people under 16. Could this work elsewhere — or even there?",
      "url": "https://apnews.com/4dda8d92bd4b896ff502482b6736ab24",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d029fc91de34552a65762b520e4be41/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "Miami's playoff hopes took an all-but-final nosedive while Alabama's got a boost Tuesday night in the last rankings before the 12-team College Football Playoff bracket is set next weekend.",
      "publishedAt": "2024-12-03T17:15:01Z",
      "title": "Miami's playoff hopes nosedive as Alabama rises in the latest College Football Playoff rankings",
      "url": "https://apnews.com/290f36c33dc40dd7cc059a054037ccef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79ca7d2c37dc49ec928173ebe650ff4f/2959.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}