{
  "articles": [
    {
      "author": "MATTHEW LEE and ABBY SEWELL",
      "description": "BEIRUT (AP) — Hamas said Tuesday that it gave mediators its reply to the U.S.-backed proposal for a cease-fire in Gaza, seeking some “amendments” on the deal. It appeared the reply was short of an outright acceptance that the United States has been pushing for but kept negotiations alive over an elusive halt to the eight-month war.",
      "publishedAt": "2024-06-11T10:03:52Z",
      "title": "Hamas responds to Gaza cease-fire plan seeking some changes. US says it's 'evaluating' the reply",
      "url": "https://apnews.com/d3733d55c6a66222da1a4a051997094c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3a12c61fac1c424e8f4cc4f02eb032fa/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "MECCA, Saudi Arabia (AP) — Muslim pilgrims have been streaming into Saudi Arabia's holy city of Mecca ahead of the start of the Hajj later this week, as the annual pilgrimage returns to its monumental scale.",
      "publishedAt": "2024-06-12T05:02:29Z",
      "title": "More than 1.5 million foreign Muslims arrive in Mecca for annual Hajj pilgrimage",
      "url": "https://apnews.com/611f452f9a36b6c7d3cb45a8718f7ab5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/42c143edebe64373bcdf7b9d7ac9d76c/3000.jpeg"
    },
    {
      "author": "CLAUDIA LAUER and ALANNA DURKIN RICHER",
      "description": "WILMINGTON, Del. (AP) — Hunter Biden's legal woes are not over after his conviction on three felony firearms charges in a trial that put a spotlight on his drug-fueled past.",
      "publishedAt": "2024-06-11T23:39:47Z",
      "title": "What's next for Hunter Biden after his conviction on federal gun charges",
      "url": "https://apnews.com/7cc9bab53e4df19f46e28f131566008b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1dc9f59a4ad34b70bd59dc1ca5c4a924/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER and REBECCA SANTANA",
      "description": "WASHINGTON (AP) — Eight people from Tajikistan with suspected ties to the Islamic State group have been arrested in the United States in recent days, according to multiple people familiar with the matter.",
      "publishedAt": "2024-06-12T00:42:43Z",
      "title": "AP sources: 8 people with possible Islamic State ties arrested in US on immigration violations",
      "url": "https://apnews.com/7088e6f665f095ad38186cafe69bbddd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf9d72bfaa63406b8d7577d30b66dbf9/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Supreme Court is headed into its final few weeks with nearly half of the cases heard this year still undecided, including ones that could reshape the law on everything from guns to abortion to social media.",
      "publishedAt": "2024-06-12T04:01:12Z",
      "title": "Supreme Court has a lot of work to do and little time to do it with a sizeable case backlog",
      "url": "https://apnews.com/84340c4b11d81ceaf10f5ebf999cb06f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d5d05397d79c4fb2a07645b3971804c5/3000.jpeg"
    },
    {
      "author": "DAVID KLEPPER",
      "description": "WASHINGTON (AP) — When disinformation researcher Wen-Ping Liu looked into China's efforts to influence Taiwan's recent election using fake social media accounts, something unusual stood out about the most successful profiles.",
      "publishedAt": "2024-06-12T04:05:28Z",
      "title": "Faking an honest woman: Why Russia, China and Big Tech all use faux females to get clicks",
      "url": "https://apnews.com/3b78d7af67f6dd63a71f2f4ec96a4c2e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/15fa6c73e57345a4b3c8893a29b34f5c/3000.jpeg"
    },
    {
      "author": "OMAR ALBAM and ABBY SEWELL",
      "description": "IDLIB, Syria (AP) — For more than a decade, a steady flow of Syrians have crossed the border from their war-torn country into Lebanon. But anti-refugee sentiment is rising there, and in the past two months, hundreds of Syrian refugees have gone the other way.",
      "publishedAt": "2024-06-12T05:21:34Z",
      "title": "Some Syrian refugees risk returning to opposition-held areas as hostility in host Lebanon grows",
      "url": "https://apnews.com/4a7f0bc8bb1e3c39f8e7e92589b5733c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd1fac23de684d84a140c6bf5a430cc1/3000.jpeg"
    },
    {
      "author": "DAVE COLLINS",
      "description": "NEWTOWN, Conn. (AP) — Like graduating seniors everywhere, members of Newtown High School’s class of 2024 expect bittersweet feelings at their commencement ceremony — excitement about heading off to college or careers and sadness about leaving their friends and community.",
      "publishedAt": "2024-06-11T17:32:56Z",
      "title": "Sandy Hook shooting survivors to graduate with mixed emotions without 20 of their classmates",
      "url": "https://apnews.com/a0c7ea790ca44a6085d3b181cac9175d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ce278e7bba7408cb0825d4d6aa6693e/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — One person died after being shot on a commuter bus Tuesday afternoon that led officers on a wild chase for miles from Atlanta into an outlying suburb, striking several vehicles as it barreled through rush hour traffic with frightened passengers aboard, authorities said.",
      "publishedAt": "2024-06-11T21:37:42Z",
      "title": "1 fatally shot on Atlanta area transit bus that led officers on wild rush hour chase, police say",
      "url": "https://apnews.com/a05712dba1ef82b953d2ead9e74158df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd7238d486c74e4cae3bfff39b68c282/3000.jpeg"
    },
    {
      "author": "TOM KRISHER",
      "description": "DETROIT (AP) — Just before 2 a.m. on a chilly April night in Seattle, a Chevrolet Silverado pickup stopped at an electric vehicle charging station on the edge of a shopping center parking lot. Two men, one with a light strapped to his head, got out.",
      "publishedAt": "2024-06-12T04:02:35Z",
      "title": "Thefts of charging cables pose yet another obstacle to appeal of electric vehicles",
      "url": "https://apnews.com/5f003686cade63fade2e8d7dd3402f3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24d9403aed574de59b7a701f5a08f381/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}