{
  "articles": [
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Hamas’ top leader traveled to Cairo on Wednesday for talks on the war in Gaza, part of a flurry of diplomacy aimed at securing another cease-fire and hostage swap at a moment when the militant group is putting up stiff resistance to Israel’s offensive.",
      "publishedAt": "2023-12-20T08:47:04Z",
      "title": "Hamas leader visits Cairo, a sign talks on another Gaza truce and hostage swap are gathering pace",
      "url": "https://apnews.com/81b80e4716b53756c8fab96c183089ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fe5713c84684de1a9f84528643d9ceb/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — A divided Colorado Supreme Court on Tuesday declared former President Donald Trump ineligible for the White House under the U.S. Constitution’s insurrection clause and removed him from the state’s presidential primary ballot, setting up a likely showdown in the nation’s highest court to decide whether the front-runner for the GOP nomination can remain in the race.",
      "publishedAt": "2023-12-19T23:16:30Z",
      "title": "Donald Trump banned from Colorado ballot in historic ruling by state's Supreme Court",
      "url": "https://apnews.com/d16dd8f354eeaf450558378c65fd79a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/811169873211483b9336b267bf5b6b3f/1920.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — How far can a state go to keep migrants out of the U.S.? The answer may soon come out of Texas, where a new law signed by Republican Gov.",
      "publishedAt": "2023-12-20T05:06:05Z",
      "title": "What we know about Texas' new law that lets police arrest migrants who enter the US illegally",
      "url": "https://apnews.com/3cb931b43de67e4fe730c1bca42144ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c09cc05994e0466984000b25cb4ce72c/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "After blunting Ukraine’s counteroffensive from the summer, Russia is building up its resources for a new stage of the war over the winter, which could involve trying to extend its gains in the east and deal significant blows to the country's vital infrastructure.",
      "publishedAt": "2023-12-20T05:03:30Z",
      "title": "Putin ratchets up military pressure on Ukraine as he expects Western support for Kyiv to dwindle",
      "url": "https://apnews.com/db92b9da309a97c4fc2585e626a8b5db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d57149b3eafb4da680b8cba25340af12/3000.jpeg"
    },
    {
      "author": "NG HAN GUAN and KEN MORITSUGU",
      "description": "YANGWA, China (AP) — Surrounded by destruction, survivors of an earthquake mourned the dead and endured a frigid cold in temporary shelters Wednesday, unsure how to rebuild their lives in the remote mountains of northwest China.",
      "publishedAt": "2023-12-20T04:57:33Z",
      "title": "China's earthquake survivors endure frigid temperatures and mourn the dead",
      "url": "https://apnews.com/93dba911aeb735fd183380523bc638fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fdc737b22aac428c9839933259c4dafb/1920.jpeg"
    },
    {
      "author": "TAIWO ADEBAYO",
      "description": "OMO FOREST RESERVE, Nigeria (AP) — Men in dusty workwear trudge through a thicket, making their way up a hill where sprawling plantations lay tucked in a Nigerian rainforest whose trees have been hacked away to make room for cocoa bound for places like Europe and the U.S.",
      "publishedAt": "2023-12-20T06:11:14Z",
      "title": "Cocoa grown illegally in a Nigerian rainforest heads to companies that supply major chocolate makers",
      "url": "https://apnews.com/8813c4656635a4ae8b49c6fd7ced6d28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1aa582cac76f485aa3a750ba7a5d915c/3000.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "Tesla has found itself locked in an increasingly bitter dispute with union workers in Sweden and neighboring countries.",
      "publishedAt": "2023-12-20T07:34:22Z",
      "title": "Tesla's Swedish labor dispute pits anti-union Musk against Scandinavian worker ideals",
      "url": "https://apnews.com/5124a0074f6b4c5b7f503b5353afe8b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d0af9d32c8c4e1596486c91fd284ee3/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "KINSHASA, Congo (AP) — Congo headed to the polls Wednesday to vote for president as authorities scrambled to finalize preparations in an election facing steep logistical and security challenges, with voting starting nearly 2 1/2 hours late in the capital.",
      "publishedAt": "2023-12-20T05:04:11Z",
      "title": "Congo votes for president as conflict and smudged ballots lead to fears election won't be credible",
      "url": "https://apnews.com/e23f45d40e2a28a5da85f0185e3e5425",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4b66e2d26b3c46798ea7305cb99d4206/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and ALI SWENSON",
      "description": "WATERLOO, Iowa (AP) — Former President Donald Trump on Tuesday defended his comments about migrants crossing the southern border “poisoning the blood” of America, and he reinforced the message while denying any similarities to fascist writings others had noted.",
      "publishedAt": "2023-12-20T02:03:44Z",
      "title": "Trump defends controversial comments about immigrants poisoning the nation's blood at Iowa rally",
      "url": "https://apnews.com/dff7f632948fa6511fb7d1955a28610c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85950d13fb734af8982238decd77ca28/3000.jpeg"
    },
    {
      "author": "KIMBERLEE KRUESI and GEOFF MULVIHILL",
      "description": "Ever since the nation’s highest court ended abortion rights more than a year ago, vaguely worded bans enacted in some Republican-controlled states have caused bewilderment over how exceptions should be applied.",
      "publishedAt": "2023-12-20T06:16:22Z",
      "title": "Some state abortion bans stir confusion, and it's uncertain if lawmakers will clarify them",
      "url": "https://apnews.com/b2808df90937e96887aa4e1f9c565771",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91b737cb675d469ab5aacebdb4f68daa/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}