{
  "articles": [
    {
      "author": "Steve Karnowski",
      "description": "The Trump administration has formally responded to a lawsuit that seeks to stop an immigration enforcement surge that is roiling Minneapolis and St. Paul. The government says, \"Minnesota wants a veto over federal law enforcement.” Justice Department lawyers are urging a judge to reject the effort. The government says Operation Metro Surge has made the state safer with the arrests of more than 3,000 people who were in the country illegally. But Minnesota Attorney General Keith Ellison says the government is violating free speech and other constitutional rights.",
      "publishedAt": "2026-01-20T16:44:34Z",
      "title": "Trump administration says Minnesota's lawsuit against immigration surge is frivolous",
      "url": "https://apnews.com/article/minnesota-immigration-crackdown-trump-5e2f40582b62687fd9bc70640382f034",
      "urlToImage": "https://dims.apnews.com/dims4/default/7abef89/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F17%2F524faad66d9522382fc201001abe%2Fef9b94b2a8cd4706b7eef164b2591dc1"
    },
    {
      "author": "Konstantin Toropin",
      "description": "U.S. forces have boarded and taken control of a seventh oil tanker connected with Venezuela as the Trump administration continues its efforts to take control of the oil in the South American country. U.S. Southern Command said in a social media post Tuesday that U.S. forces apprehended the Motor Vessel Sagitta “without incident” and that the tanker was “operating in defiance of President Trump’s established quarantine of sanctioned vessels in the Caribbean.”",
      "publishedAt": "2026-01-20T21:48:13Z",
      "title": "US forces in Caribbean seize seventh sanctioned oil tanker linked to Venezuela",
      "url": "https://apnews.com/article/venezuela-oil-tanker-us-military-trump-086d42db3d56f0e952014f97fa30faaf",
      "urlToImage": "https://dims.apnews.com/dims4/default/05e2766/2147483647/strip/true/crop/4792x2696+0+250/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F3a%2F93fce51bb1e125aa1f22b64bcad0%2Ff7a3be038f5c42c78f86108e991f3e52"
    },
    {
      "author": "Melissa Goldin",
      "description": "President Donald Trump marked his first year back in office with a lengthy press briefing, repeating false claims about the 2020 election, foreign policy, the economy, and energy. For example, he said the 2020 election was rigged, despite evidence proving otherwise. Trump also exaggerated his role in resolving international conflicts, claiming to have settled eight wars. His statements on inflation, coal, and the Los Angeles wildfires were also incorrect.",
      "publishedAt": "2026-01-20T23:07:24Z",
      "title": "Trump highlights familiar false claims as he reviews 2025",
      "url": "https://apnews.com/article/fact-check-trump-rigged-election-eight-wars-inflation-220f515728383d5205c3748259b2cc0f",
      "urlToImage": "https://dims.apnews.com/dims4/default/38dabfd/2147483647/strip/true/crop/7583x4265+0+395/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F19%2Fb05ebd8dd079b43c8f897f5f849b%2F27700a71486f423b9053628325583636"
    },
    {
      "author": "Damian J. Troise",
      "description": "Stocks are falling on Wall Street after President Donald Trump threatened to hit eight NATO members with new tariffs as tensions escalate over his attempts to assert American control over Greenland. The S&P 500 sank 1.8% Tuesday, with nearly every sector losing ground. Technology stocks were the biggest weights. The Dow Jones Industrial Average dropped 819 points, or 1.7%. The Nasdaq composite slumped 2%. Trump said Saturday that he would charge a 10% import tax starting in February on goods from selected European nations. European markets also fell and Treasury yields were mixed in the bond market. Gold prices surged.",
      "publishedAt": "2026-01-20T04:22:41Z",
      "title": "Wall Street sinks as Trump threatens 8 European countries with tariffs over Greenland",
      "url": "https://apnews.com/article/stock-markets-trump-greenland-inflation-58a6fed13a1e04afd57f0a22a2c9cfb0",
      "urlToImage": "https://dims.apnews.com/dims4/default/583b07e/2147483647/strip/true/crop/6862x3860+0+358/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2F1d%2F5b5fe7a6d94395984a5350b6841f%2Fe3560e766f824ce19c3afe519de49be2"
    },
    {
      "author": "Jamey Keaten",
      "description": "U.S. Treasury Secretary Scott Bessent says America’s relations with Europe remain strong. Speaking on the sidelines of the World Economic Forum annual meeting in Davos, Switzerland, he urged trading partners to “take a deep breath” and let tensions driven by the Trump administration’s new tariff threats over Greenland “play out.” “I think our relations have never been closer,” he said. On Saturday, Trump announced a 10% import tax starting in February on goods from eight European nations that have rallied around Denmark in the wake of his stepped up calls for the United States to take over the semi-autonomous territory of Greenland. Trump has insisted the U.S. needs the territory for security reasons against possible threats from China and Russia.",
      "publishedAt": "2026-01-20T08:01:23Z",
      "title": "Bessent says US-Europe relations have 'never been closer' despite Greenland crisis",
      "url": "https://apnews.com/article/denmark-greenland-trump-bessent-davos-ab05ebfaae6a413d1f8125cb9726a4c5",
      "urlToImage": "https://dims.apnews.com/dims4/default/13eab06/2147483647/strip/true/crop/8154x4587+0+425/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2Ffc%2F2b037395dea0f8702fd39db6c153%2F1e93d29d8de342b3973e1d93714d9590"
    },
    {
      "author": "Sam Metz",
      "description": "Israeli forces have targeted two United Nations facilities as part of their crackdown on the U.N. agency for Palestinian refugees. On Tuesday, crews bulldozed the United Nations Relief and Works Agency's offices in Sheikh Jarrah and fired tear gas at a vocational school in Qalandia. The agency's West Bank director, Roland Friedrich, said this marks the culmination of two years of measures against UNRWA in east Jerusalem. Israel's Foreign Ministry said the demolition enforced a new law banning UNRWA, claiming the agency has ties with militant groups. The U.N. has denied these claims. Israel has long claimed the agency has an anti-Israel bias, often with little evidence.",
      "publishedAt": "2026-01-20T09:15:54Z",
      "title": "Israeli crews target UNRWA sites in east Jerusalem",
      "url": "https://apnews.com/article/israel-palestinians-gaza-east-jerusalem-unrwa-cc9c5b2cac2332f0207d485f381be53d",
      "urlToImage": "https://dims.apnews.com/dims4/default/8b8fa46/2147483647/strip/true/crop/5548x3121+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F7a%2F7d6e14c062c603733c1714c8f4a3%2Ff85de4f6096e4088b6f5978d65bb2406"
    },
    {
      "author": "Jeff Martin, Haya Panjwani",
      "description": "Forecasters are warning that a new storm could bring ice and power outages across the South this weekend. Temperatures will be slow to warm in many areas, meaning ice that forms on roads and sidewalks might stick around. The exact timing and path remain uncertain, but an arctic air mass from Canada is expected to clash with rain, creating a major winter storm. An atmospheric river could pull moisture across the Gulf Coast, increasing the risk of ice storms in Georgia. Travel disruptions are likely, especially in areas with limited snow removal equipment. Northern states will remain in a deep freeze due to polar air.",
      "publishedAt": "2026-01-20T18:29:01Z",
      "title": "Americans brace for another snow storm as ice threatens southern states",
      "url": "https://apnews.com/article/winter-weather-snow-ice-weekend-storm-ba67d30f05cbe14e9568907f09d2f13f",
      "urlToImage": "https://dims.apnews.com/dims4/default/fbedaf8/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcd%2Fe0%2Ff236898a98c614b2acd92e51c942%2F06aa16de4e914094a9b3548dd2fd0602"
    },
    {
      "author": "Devi Shastri",
      "description": "International health officials will meet in a few months to reevaluate the United States’ measles-free status. Experts fear the vaccine-preventable virus has regained a foothold and that the U.S. may soon follow Canada in losing the achievement of having eliminated it. The evaluation comes a year after the West Texas measles outbreak began. Scientists are investigating whether multiple U.S. outbreaks are linked. But regardless of the U.S. elimination status, doctors and scientists say the country has a measles problem. At the April meeting, international health officials also will review Mexico’s measles-free status. Its measles outbreak is connected to last year’s Texas outbreak.",
      "publishedAt": "2026-01-20T18:05:32Z",
      "title": "International health authorities to assess US measles situation",
      "url": "https://apnews.com/article/us-measles-elimination-mexico-6f0bc8f7ef31d5ef82492e42ccb38e47",
      "urlToImage": "https://dims.apnews.com/dims4/default/1df74a8/2147483647/strip/true/crop/6883x3872+0+359/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F67%2F360591372224893207fbf104d376%2Fa5260ee668454ad5a907aa96270a93cf"
    },
    {
      "author": "Ronald Blum",
      "description": "Carlos Beltrán and Andruw Jones have been elected to baseball's Hall of Fame. Beltrán, in his fourth ballot appearance, received 84.2% of the votes from the Baseball Writers’ Association of America. Jones, in his ninth appearance, was picked on 78.4% of ballots. Beltrán's vote percentage has steadily increased since 2023. He was also briefly hired as the New York Mets' manager in 2019. Jones started with just 7.3% in 2018 but has steadily climbed. They will be inducted in Cooperstown, New York, on July 26, along with second baseman Jeff Kent.",
      "publishedAt": "2026-01-20T23:28:37Z",
      "title": "Carlos Beltrán and Andruw Jones elected to baseball's Hall of Fame",
      "url": "https://apnews.com/article/beltran-jones-hall-of-fame-3f92e2209b80f655bffedfe4d3173e8e",
      "urlToImage": "https://dims.apnews.com/dims4/default/83afcc0/2147483647/strip/true/crop/3978x2238+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2F36%2Fa82360983b290a6de438b446f66d%2Febfc4ab23a3f44e5bf08c44bc70085e5"
    },
    {
      "author": "Morgan Lee, Savannah Peters",
      "description": "A judge has ordered that actor Timothy Busfield be released from jail during a detention hearing on child sex abuse charges. The order Tuesday by state district court Judge David Murphy is linked to accusations that Busfield inappropriately touching a minor while working as a director on the set of the series “The Cleaning Lady.” The judge ordered that the defendant was released on his own recognizance, pending trial. Busfield will be supervised upon release by a pretrial service in Albuquerque, and can leave the state to live at home.",
      "publishedAt": "2026-01-20T16:46:37Z",
      "title": "Melissa Gilbert may speak at sex abuse hearing for husband Timothy Busfield",
      "url": "https://apnews.com/article/timothy-busfield-child-sex-abuse-charges-d35a83ab57dc0e7a37c25a92ffc63a11",
      "urlToImage": "https://dims.apnews.com/dims4/default/45dbbe1/2147483647/strip/true/crop/4657x2620+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2Fc4%2Ffafcf811089a0a4605ed1a973655%2F46720bd9545d43818d96e7ceb9d2018d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}