{
  "articles": [
    {
      "author": "COLLEEN LONG, AMANDA SEITZ and JOSH BOAK",
      "description": "ATLANTA (AP) — Kamala Harris blasted Donald Trump as a threat to women's freedoms and their very lives, warning in a speech in the battleground state of Georgia on Friday that Republicans would continue to choke off access to abortion if he returns to the White House.",
      "publishedAt": "2024-09-20T11:10:53Z",
      "title": "'She should be alive today' — Harris spotlights woman's death to blast abortion bans and Trump",
      "url": "https://apnews.com/5ba5dabf0dc3c98de12389c34b47475d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/647753e9584943f9ae34b50f7dfac251/1920.jpeg"
    },
    {
      "author": "REBECCA SANTANA, ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Communication breakdowns with local law enforcement hampered the Secret Service's performance during a July campaign rally where former President Donald Trump was shot and wounded, according to a document released Friday that lays out a litany of missed opportunities to stop a gunman who opened fire from an unsecured roof.",
      "publishedAt": "2024-09-20T17:01:39Z",
      "title": "Secret Service report details communication failures preceding July assassination attempt on Trump",
      "url": "https://apnews.com/7dca5e30730287f46cceaa35437f0d47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf80507782314475ab7d6461f5d9e29f/3000.jpeg"
    },
    {
      "author": "GARY D. ROBERTSON and MICHELLE L. PRICE",
      "description": "RALEIGH, N.C. (AP) — North Carolina Lt. Gov. Mark Robinson will not appear at former President Donald Trump ’s rally on Saturday in the battleground state following a CNN report about Robinson’s alleged disturbing online posts, an absence that illustrates the liability the gubernatorial candidate poses for Trump and downballot GOP candidates.",
      "publishedAt": "2024-09-20T15:21:35Z",
      "title": "Robinson won't appear at Trump's North Carolina rally after report on online posts, AP sources say",
      "url": "https://apnews.com/c7ee5c23f554f3708619d6b68e208b94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/267f1610c103444c92021a81f67e7e70/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE and JULIA FRANKEL",
      "description": "BEIRUT (AP) — Israel launched a rare airstrike that killed a senior Hezbollah military official in a densely populated southern Beirut neighborhood on Friday.",
      "publishedAt": "2024-09-20T11:44:41Z",
      "title": "Rare Israeli airstrike in Beirut kills Hezbollah commander and more than a dozen others",
      "url": "https://apnews.com/a6a95169a21b45dc86d86182e255fa7e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/634ec8a9d1234890bd1b035b95b8a0fa/1920.jpeg"
    },
    {
      "author": "JAMEY KEATEN and KAREEM CHEHAYEB",
      "description": "GENEVA (AP) — Human rights advocates are calling for an independent investigation into the deadly explosions of pagers and walkie-talkies in Lebanon and Syria, suggesting the blasts may have violated international law if the devices were fashioned as booby traps.",
      "publishedAt": "2024-09-20T19:11:02Z",
      "title": "Did Middle East device attack violate international law? Advocates want an investigation",
      "url": "https://apnews.com/1d0044e23cdb902036884e66e8fea086",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/edd1ab09d2d540e69f12a1dcdba2ca5b/2067.jpeg"
    },
    {
      "author": "BRUCE SCHREINER and DYLAN LOVAN",
      "description": "WHITESBURG, Ky. (AP) — Residents of a tiny Appalachian town struggled Friday to cope with a shooting involving two of its most prominent citizens: a judge who was gunned down in his courthouse chambers and a local sheriff charged with his murder.",
      "publishedAt": "2024-09-20T14:53:58Z",
      "title": "Tiny Kentucky town is rocked as their sheriff is jailed in the killing of a prominent judge",
      "url": "https://apnews.com/d8df59f414023489527e9aef49f4c8cf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ddcff12f77024ab2971cce88ed53da58/1920.jpeg"
    },
    {
      "author": "JEFFREY COLLINS",
      "description": "COLUMBIA, S.C. (AP) — South Carolina put inmate Freddie Owens to death Friday as the state restarted executions after an unintended 13-year pause because prison officials couldn’t get the drugs needed for lethal injections.",
      "publishedAt": "2024-09-20T04:03:08Z",
      "title": "South Carolina inmate dies by lethal injection in state’s first execution in 13 years",
      "url": "https://apnews.com/0e15aef91dfe9ac9667264dce7df0193",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c2916a1894743d2b8c34fc003a48f56/3000.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and CLAIRE GALOFARO",
      "description": "Yooree Kim marched into a police station in Paris and told an officer she wanted to report a crime. Forty years ago, she said, she was kidnapped from the other side of the world, and the French government endorsed it.",
      "publishedAt": "2024-09-20T04:32:58Z",
      "title": "Western nations were desperate for Korean babies. Now many adoptees believe they were stolen",
      "url": "https://apnews.com/67d6bb03fddede7dcca199c2e3cd486e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4039edc375df4db6a2c97298b2ec95b7/3000.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "A paid passenger on an expedition to the Titanic with the company that owned the Titan submersible testified before a U.S. Coast Guard investigatory panel Friday that the mission he took part in was aborted due to an apparent mechanical failure.",
      "publishedAt": "2024-09-20T04:06:15Z",
      "title": "Passenger on a previous Titan sub dive says his mission was aborted due to apparent malfunction",
      "url": "https://apnews.com/ce07039ec4abf4e83ba38bf13a40829f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1cef1aa298654b8f87afc64ea6da8d59/1920.jpeg"
    },
    {
      "author": "DAVID BAUDER",
      "description": "New York magazine says that its highly regarded Washington correspondent, Olivia Nuzzi, is on leave after disclosing that she violated the publication's standards by having a personal relationship with a former reporting subject.",
      "publishedAt": "2024-09-20T16:51:09Z",
      "title": "New York magazine says its star political reporter is on leave after a relationship was disclosed",
      "url": "https://apnews.com/47920315961b22d3535613c57505bea9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66b58b95a8e8414ba26f9737321aaf45/2591.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}