{
  "articles": [
    {
      "author": "ZEKE MILLER, MICHELLE L. PRICE, WILL WEISSERT and JILL COLVIN",
      "description": "WASHINGTON (AP) — Donald Trump was elected the 47th president of the United States on Wednesday, an extraordinary comeback for a former president who refused to accept defeat four years ago, sparked a violent insurrection at the U.S.",
      "publishedAt": "2024-11-05T11:29:35Z",
      "title": "Trump wins the White House in a political comeback rooted in appeals to frustrated voters",
      "url": "https://apnews.com/83c8e246ab97f5b97be45cdc156af4e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2db4220d78ed4c38bb79bcddbe09d037/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "WASHINGTON (AP) — Donald Trump has promised sweeping action in a second administration. The former president and now president-elect often skipped over details but through more than a year of policy pronouncements and written statements outlined a wide-ranging agenda that blends traditional conservative approaches to taxes, regulation and cultural issues with a more populist bent on trade and a shift in America's international role.",
      "publishedAt": "2024-11-06T12:38:40Z",
      "title": "Donald Trump has sweeping plans for a second administration. Here's what he's proposed",
      "url": "https://apnews.com/de3dcf0f173b42602b258042fd7aaafb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/51b383850d674fe09001ec97893077db/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Republicans have taken control of the U.S. Senate and are fighting to keep their majority in the U.S.",
      "publishedAt": "2024-11-05T05:01:59Z",
      "title": "Republicans take Senate majority and eye unified power with Trump",
      "url": "https://apnews.com/94b49277db2a5c21f23236794a36afa6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7e75d0de8ff54385a509eb0710a7313a/1920.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — The U.S. stock market, Elon Musk’s Tesla, banks and bitcoin are all storming higher Wednesday as investors bet on what Donald Trump’s return to the White House will mean for the economy and world.",
      "publishedAt": "2024-11-06T01:40:43Z",
      "title": "Stocks and bitcoin jump after Trump's victory. So do worries about inflation as Dow surges 1,300",
      "url": "https://apnews.com/93421462d761eb1402d813cb381fe6e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2ddca7b3060d403e80cb629f29a37fc0/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Donald Trump will return to the U.S. presidency at a time of unprecedented conflict and uncertainty in the Middle East.",
      "publishedAt": "2024-11-06T15:13:55Z",
      "title": "Trump promises to bring lasting peace to a tumultuous Middle East. But fixing it won't be easy",
      "url": "https://apnews.com/2e37305522d19bdc34e956586cce99bd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1a9d32b0402e40d98d721850a4c87cf2/2732.jpeg"
    },
    {
      "author": "STEVE PEOPLES and BILL BARROW",
      "description": "WASHINGTON (AP) — Donald Trump scored a decisive victory in a deeply divided nation.",
      "publishedAt": "2024-11-06T03:19:37Z",
      "title": "Election takeaways: Trump's decisive victory in a deeply divided nation",
      "url": "https://apnews.com/d0e4677f4cd53b4d2d8d18d674be5bf4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47a44b0843684869a5d00f6aec3f372d/3000.jpeg"
    },
    {
      "author": "JOSH BOAK and LINLEY SANDERS",
      "description": "WASHINGTON (AP) — A disaffected electorate wanted former President Donald Trump to return to the White House, a blatant rejection of Vice President Kamala Harris and her nearly four years with President Joe Biden.",
      "publishedAt": "2024-11-06T11:41:12Z",
      "title": "AP VoteCast: Voter anxiety over the economy and a desire for change return Trump to the White House",
      "url": "https://apnews.com/86225516e8424431ab1d19e57a74f198",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b36e45e31e3845f0b90327bd6e05fc5f/3000.jpeg"
    },
    {
      "author": "GEOFF MULVIHILL and CHRISTINE FERNANDO",
      "description": "WASHINGTON (AP) — Voters in Missouri cleared the way to undo one of the nation's most restrictive abortion bans in one of seven victories for abortion rights advocates, while Florida, Nebraska and South Dakota defeated similar constitutional amendments, leaving bans in place.",
      "publishedAt": "2024-11-05T05:03:56Z",
      "title": "Abortion rights advocates win in 7 states and clear way to overturn Missouri ban but lose in 3",
      "url": "https://apnews.com/49c9073cbb6056b66a8a7d0d099795d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a560bd89bad3478a9047d87b02f79171/3000.jpeg"
    },
    {
      "author": "LORI HINNANT and YEHOR KONOVALOV",
      "description": "KYIV, Ukraine (AP) — Soldiers in a Ukrainian artillery battery on the front lines of the country’s east were only vaguely aware of American election results pointing to Donald Trump’s victory Wednesday — but firm in their hopes for the next president of the United States.",
      "publishedAt": "2024-11-06T12:18:54Z",
      "title": "On Ukraine's front and in Kyiv, hope and pragmatism compete when it comes to Trump's election",
      "url": "https://apnews.com/ff4edf4a804eedae5958d3a674c5c2d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/219ce220c79f4e01a84e1a320883e0dd/3000.jpeg"
    },
    {
      "author": "PAOLO SANTALUCIA and JOSEPH WILSON",
      "description": "PAIPORTA, Spain (AP) — The mangled car in which Jorge Tarazona’s 3-year-old niece and sister-in-law perished in last week's catastrophic flooding in Spain now hangs halfway off the ragged edge of road.",
      "publishedAt": "2024-11-06T13:15:51Z",
      "title": "Baby girl and her mother among those lost in Spain's catastrophic flooding",
      "url": "https://apnews.com/1e568750b3fd10424483c0eb1f24c752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4311fadb603d47ec81edc6adc0bab2b3/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}