{
  "articles": [
    {
      "author": "TIA GOLDENBERG and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — The viability of a U.S.-backed proposal to wind down the 8-month-long war in Gaza has been cast into doubt after Israeli Prime Minister Benjamin Netanyahu said he would only be willing to agree to a “partial” cease-fire deal that would not end the war, comments that sparked an uproar from families of hostages held by Hamas.",
      "publishedAt": "2024-06-24T07:30:44Z",
      "title": "Netanyahu says he won't agree to a deal that ends the war in Gaza, testing the latest truce proposal",
      "url": "https://apnews.com/f5de2ed8288ac3cdb02c4e9e2fbaeda1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/23f5747dd46c44f69e35f0a22a9fc64b/1920.jpeg"
    },
    {
      "author": "SAM MEDNICK and MOHAMMAD JAHJOUH",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — An influx of aid appears to have eased a hunger crisis in northern Gaza for now, but the entire territory remains at “high risk” of famine after Israel's offensive in Rafah caused displacement and the disruption of aid operations in the south, a draft report said Monday.",
      "publishedAt": "2024-06-24T12:31:08Z",
      "title": "Experts say Gaza is at 'high risk' of famine despite increased aid to the north",
      "url": "https://apnews.com/42e404ec4ef3e2836a82a8d2b2315fd1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e2ba890fc0244af6973243e815feca1e/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER and SHARON JOHNSON",
      "description": "The first weekend of summer brought a tragic yet familiar pattern for American cities wracked by gun violence as mass shootings left dozens dead or wounded at a party in Alabama, an entertainment district in Ohio and a grocery in Arkansas.",
      "publishedAt": "2024-06-24T15:29:33Z",
      "title": "Mass shootings across the US mark the first weekend of summer",
      "url": "https://apnews.com/b004331ee7d3da95bce6646547f8d43f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01c4f4ab4e8a4c688c29ea7657f44cc9/2750.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT, JOSH FUNK and JOHN HANNA",
      "description": "A railroad bridge collapsed during flooding in the Midwestern U.S. that has forced water rescues, led to evacuations, caused at least one death and brought additional misery during a vast and stubborn heat wave.",
      "publishedAt": "2024-06-24T05:09:36Z",
      "title": "Midwest flooding collapses a rail bridge, forces evacuations and kills at least 1",
      "url": "https://apnews.com/7f7211b34718fb529d2bf8e4395f1140",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/94c7a59f8ad344f7aebeaa3ffe29e8ff/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — In the coming days, the Supreme Court will confront a perfect storm mostly of its own making: a trio of decisions stemming directly from the Jan.",
      "publishedAt": "2024-06-24T10:12:43Z",
      "title": "Is Trump shielded from criminal charges as an ex-president? A nation awaits word from Supreme Court",
      "url": "https://apnews.com/acebc079bdaa6257bfd70a90a71a2ca0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47e96f562df245e1a1f5271421833359/2028.jpeg"
    },
    {
      "author": "VANESSA G. SANCHEZ and PHILLIP REESE/KFF Health News and DEVNA BOSE/Associated Press",
      "description": "CHARLOTTE, N.C. (AP) — Four months after seeking asylum in the U.S., Fernando Hermida began coughing and feeling tired. He thought it was a cold. Then sores appeared in his groin and he would soak his bed with sweat.",
      "publishedAt": "2024-06-24T10:00:08Z",
      "title": "Young gay Latinos see a rising share of new HIV cases, leading to a call for targeted funding",
      "url": "https://apnews.com/ca5f73b064e5ed491ee0315dd60d69d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/71e321794a9842eb97255f3b5cc9b13a/3000.jpeg"
    },
    {
      "author": "SCHUYLER DIXON",
      "description": "ARLINGTON, Texas (AP) — Rafael McDonnell sometimes gets to address the staff of his beloved Texas Rangers on issues of diversity and inclusion through his role with the Resource Center, one of the leading LGBTQ+ organizations in the Dallas area.",
      "publishedAt": "2024-06-24T15:01:06Z",
      "title": "The Texas Rangers are frustrating LGBTQ+ advocates as the only MLB team without a Pride Night",
      "url": "https://apnews.com/4671a9124b12cf2b67f1bfbf405af99b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/01efd6711f984141b80fee240800b71a/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "WASHINGTON (AP) — Planned Parenthood will spend $40 million ahead of November's elections to bolster President Joe Biden and leading congressional Democrats, betting that voters angry at Republican-led efforts to further restrict access to abortion can be the difference in key races around the country.",
      "publishedAt": "2024-06-24T10:17:31Z",
      "title": "Planned Parenthood says it will spend $40 million on abortion rights ahead of November's election",
      "url": "https://apnews.com/a6b9252fec64d1e051816ea173dab32f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a1824e8e720849cc90dde9267d7f4982/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and NASSER KARIMI",
      "description": "DUBAI, United Arab Emirates (AP) — Cab drivers and bikers tap away furiously on their mobile phones as they wait at red lights in the Iranian capital during an early June heatwave. Some pedestrians in Tehran are doing the same.",
      "publishedAt": "2024-06-24T05:10:56Z",
      "title": "'Hamster' crypto craze has taken Iran. It highlights economic malaise ahead of presidential election",
      "url": "https://apnews.com/934a398a0d2074c04bbf0112d701086f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d75c251f3e7c408e9b5382827deb9dea/3000.jpeg"
    },
    {
      "author": null,
      "description": "MOSCOW (AP) — Russia’s southern region of Dagestan held the first of three days of mourning Monday following an attack by Islamic militants who authorities say killed 20 people, mostly police, and attacked Christian and Jewish houses of worship in assaults in two cities.",
      "publishedAt": "2024-06-24T10:16:22Z",
      "title": "Russian region of Dagestan holds a day of mourning after attacks kill 20 people, officials say",
      "url": "https://apnews.com/84b57fbaa2d087eeb4ef87fa73b65f74",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/200f1380eb4744b4831ba9eeaaf04a6c/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}