{
  "articles": [
    {
      "author": "JOEY CAPPELLETTI and JILL COLVIN",
      "description": "GRAND RAPIDS, Mich. (AP) — Donald Trump is holding his first campaign rally since he survived an attempted assassination, returning to the battleground state of Michigan alongside his new running mate.",
      "publishedAt": "2024-07-20T04:08:34Z",
      "title": "Trump holds first rally after assassination attempt with his new running mate, Vance, by his side",
      "url": "https://apnews.com/dcc7969cd53e281e32beb72a2c6e0fe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a15226618d5e41f6acc9f44efc6b2ecc/1920.jpeg"
    },
    {
      "author": "LISA MASCARO, DARLENE SUPERVILLE and WILL WEISSERT",
      "description": "WASHINGTON (AP) — As Democrats churn over whether President Joe Biden should stay in the 2024 race, the party turmoil is deepening over whether his Vice President Kamala Harris is next in line for the job or if a “mini primary” should be quickly launched to choose a new nominee before the party's August convention.",
      "publishedAt": "2024-07-20T04:00:31Z",
      "title": "Beyond Biden, Democrats are split over who would be next —VP Harris or launch a 'mini primary'",
      "url": "https://apnews.com/2b1c163c863130675b3b5b60718741c8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30d986757ab64bac99d51de0b92e9174/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER",
      "description": "WASHINGTON (AP) — The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event, a law enforcement official said Saturday.",
      "publishedAt": "2024-07-20T21:00:48Z",
      "title": "Gunman in Trump rally attack flew drone over rally site in advance of event, official says",
      "url": "https://apnews.com/733811e02b1e609de6a9bc35f6b8c141",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e8f913147843487290fe4a1f0d8ab10c/3000.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump's campaign released an update on the former president's health Saturday, one week after he survived an attempted assassination at a rally in Butler, Pennsylvania.",
      "publishedAt": "2024-07-20T20:59:05Z",
      "title": "Trump campaign releases letter on his injury, treatment after last week's assassination attempt",
      "url": "https://apnews.com/e95a2888cd5eeb64820d6fa789b03463",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10578c8af04f41249db7de3c0e37093f/3000.jpeg"
    },
    {
      "author": "AHMED AL-HAJ, WAFAA SHURAFA and JACK JEFFERY",
      "description": "SANAA, Yemen (AP) — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.The Israeli strikes appeared to be the first on Yemeni soil since the Israel-Hamas war began in October, and they threatened to open a new front in the region as Israel battles proxies of Iran.",
      "publishedAt": "2024-07-20T10:13:28Z",
      "title": "Israeli military says it has struck Houthi targets in Yemen in response to attacks",
      "url": "https://apnews.com/786ff10ee4c3534024833ebbf586fadc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1148926ddacb45dd9db561b24d02fdd7/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG and JILL LAWLESS",
      "description": "As the world continues to recover from massive business and travel disruptions caused by a faulty software update from cybersecurity firm CrowdStrike, malicious actors are trying to exploit the situation for their own gain.",
      "publishedAt": "2024-07-20T17:22:07Z",
      "title": "Malicious actors trying to exploit global tech outage for their own gain",
      "url": "https://apnews.com/ebcba985600530a4689289eae38619bf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e65fecf4b03426884d2dac34da0c138/3000.jpeg"
    },
    {
      "author": null,
      "description": "ANAHEIM, Calif. (AP) — Thousands of workers at Disney's theme park and resort properties in California voted late Friday to authorize a potential strike, as contract negotiations drag on over wages, sick leave and other benefits.",
      "publishedAt": "2024-07-20T12:26:48Z",
      "title": "Disneyland workers authorize potential strike ahead of ongoing contract negotiations",
      "url": "https://apnews.com/11b477abf4a84d1e0af6c1186810dfa5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1c9758e3b5bd45a3af18e886198cbfd8/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "ASPEN, Colo. (AP) — Ukraine is on its way to being able to “stand on its own feet” militarily, Secretary of State Antony Blinken said Friday, noting that more than 20 other countries have pledged to maintain their own military and financial aid to the country even if the U.S.",
      "publishedAt": "2024-07-20T15:48:57Z",
      "title": "Blinken points to wider pledges to support Ukraine in case US backs away under Trump",
      "url": "https://apnews.com/7a31fd2e6a6828cef942d3c2f79b9b26",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1fd0db25171943c4b2eaabc7874ff2ac/3000.jpeg"
    },
    {
      "author": null,
      "description": "TAIPEI, Taiwan (AP) — Chinese authorities say at least 11 people have died and 30 are missing in the partial collapse of a highway bridge in the northwest of the country following heavy storms and flooding.",
      "publishedAt": "2024-07-20T05:42:25Z",
      "title": "11 dead and dozens missing after a highway bridge in China crumbles in flooding and heavy storms",
      "url": "https://apnews.com/9b8d2c799ae4da8a2655e8e9142c3e3c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce7d5f6ce4d547258a3f1abb0a8a05c3/3000.jpeg"
    },
    {
      "author": "PETER SMITH",
      "description": "They plan to gather one last time on Sunday — the handful of mostly elderly members of First Baptist Church in Mt. Vernon, Illinois.They'll say the Lord's Prayer, recite the Apostle's Creed and hear a biblical passage typically used at funerals, “To everything there is a season ...",
      "publishedAt": "2024-07-20T12:54:50Z",
      "title": "As a scholar, he's charted the decline in religion. Now the church he pastors is closing its doors",
      "url": "https://apnews.com/c6b9e938eb228c8018fb911b02a791f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6f9fbd1896f94d0584669d6da99cf366/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}