{
  "articles": [
    {
      "author": "ASHRAF KHALIL",
      "description": "WASHINGTON (AP) — Police using pepper spray cleared a pro-Palestinian tent encampment at George Washington University and arrested dozens of demonstrators on Wednesday just as city officials were set to appear before hostile lawmakers in Congress to account for their handling of the 2-week-old protest.",
      "publishedAt": "2024-05-08T10:05:43Z",
      "title": "Police clear pro-Palestinian protest camp and arrest 33 at DC campus as mayor's hearing is canceled",
      "url": "https://apnews.com/eac5c1cc396551bee1b110b48a94aefd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4f6ecc6bb594a2c8726e14a1d127ae9/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS, SAMY MAGDY and MELANIE LIDMAN",
      "description": "JERUSALEM (AP) — The Israeli military said Wednesday that it has reopened its Kerem Shalom crossing into Gaza after days of closure, but the U.N. said no humanitarian aid has yet entered and there is no one to receive it on the Palestinian side after workers fled during Israel's military incursion in the area.",
      "publishedAt": "2024-05-08T06:25:24Z",
      "title": "Israel says it reopened a key Gaza crossing after a rocket attack but the UN says no aid has entered",
      "url": "https://apnews.com/495e6dabfdddc5587bd20e71b6ad421d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/db169ceb86374c81b558b3e2d234c72e/1920.jpeg"
    },
    {
      "author": "ZEKE MILLER and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The Biden administration paused a shipment of bombs to Israel last week over concerns that the country was approaching a decision on launching a full-scale assault on the southern Gaza city of Rafah against the wishes of the United States, Defense Secretary Lloyd Austin said Wednesday.",
      "publishedAt": "2024-05-08T15:40:28Z",
      "title": "Pentagon chief confirms US has paused bomb shipment to Israel to signal concerns over Rafah invasion",
      "url": "https://apnews.com/eed365ebef0477ba74bf9848cacae4f4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/af374ff8be6842d0b92e130540da8ec6/3000.jpeg"
    },
    {
      "author": "KATE BRUMBACK",
      "description": "ATLANTA (AP) — A Georgia appeals court on Wednesday agreed to review a lower court ruling allowing Fulton County District Attorney Fani Willis to continue to prosecute the election interference case she brought against former President Donald Trump.",
      "publishedAt": "2024-05-08T13:39:40Z",
      "title": "Georgia appeals court agrees to review ruling allowing Fani Willis to stay on Trump election case",
      "url": "https://apnews.com/31ca3234b244126cbe412dc279fd0562",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea43543769be4887aad72fb2490080ef/3000.jpeg"
    },
    {
      "author": "JILL COLVIN, LISA MASCARO and ANDREW DeMILLO",
      "description": "NEW YORK (AP) — As former President Donald Trump remains stuck in the courtroom listening to salacious details of an extramarital sexual encounter he denies, another spectacle is playing out in the background as his vice presidential tryouts get underway.",
      "publishedAt": "2024-05-08T04:12:12Z",
      "title": "Trump is in no hurry as he leans into the pageantry of vice presidential tryouts",
      "url": "https://apnews.com/21d1dc4da5933fdb8af187004f9f1733",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a72586fa1f074c1f8ea251d564b67770/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and SEUNG MIN KIM",
      "description": "STURTEVANT, Wisc. (AP) — President Joe Biden raced into yet another battleground state Wednesday, continuing to push a contrast with Donald Trump on economic policy as his own reelection campaign readies a new $14 million advertising blitz aimed in part at Black, Latino and Asian American voters.",
      "publishedAt": "2024-05-08T09:52:47Z",
      "title": "Biden visits Wisconsin to laud a new Microsoft facility, meet voters — and troll Trump",
      "url": "https://apnews.com/ec3501d041d7b8b563563b22fcc23db5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/232ea047bdf34d4faeecf68efbcc9047/3000.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI, ED WHITE and SEAN MURPHY",
      "description": "PAVILION TOWNSHIP, Mich. (AP) — Severe storms barreled through the Midwest early Wednesday, a day after two reported tornadoes struck a Michigan city and surrounding area, destroying homes and commercial buildings, including a FedEx facility.",
      "publishedAt": "2024-05-08T04:49:04Z",
      "title": "Severe storms batter the Midwest, including reported tornadoes that shredded a FedEx facility",
      "url": "https://apnews.com/1ac4133f09069997f926e434a28c75ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3c9380773991450e867f48ea5ac576ec/1920.jpeg"
    },
    {
      "author": "EDNA TARIGAN and KRISTEN GELINEAU",
      "description": "MEULABOH, Indonesia (AP) — The boat glided across waters that were dark and still, under a night sky that was cloudless and calm. But on board, the 12-year-old girl quaked with fear.The captain and crew who she says had tortured her and three other women and girls were not finished.",
      "publishedAt": "2024-05-08T03:07:46Z",
      "title": "Rape, terror and death at sea: How a boat carrying Rohingya children, women and men capsized",
      "url": "https://apnews.com/1d2ad5595a5240ea4d2c35e26ddf9394",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d400778a426f4b1384fd7e32217bc580/1920.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — All dogs coming into the U.S. from other countries must be at least 6 months old and microchipped to help prevent the spread of rabies, according to new government rules published Wednesday.",
      "publishedAt": "2024-05-08T15:34:29Z",
      "title": "Dogs entering US must be 6 months old and microchipped to prevent spread of rabies, new rules say",
      "url": "https://apnews.com/572fa077a00afec3b2c13ab412f641ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5817deb770184425946dec2fcb9f0ee0/3000.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "Fans of the “Planet of the Apes” franchise may still be mourning the 2017 death of Caesar, the first smart chimp and the charismatic ape leader.",
      "publishedAt": "2024-05-08T15:21:52Z",
      "title": "Movie Review: 'Kingdom of the Planet of the Apes' finds a new hero and will blow your mind",
      "url": "https://apnews.com/6fbd13196311d67812e5483a349869ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe6ff2ce0f304c879b6e7c17f60c9918/2198.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}