{
  "articles": [
    {
      "author": "JOSH BOAK and JILL COLVIN",
      "description": "PITTSBURGH (AP) — Kamala Harris and Donald Trump are veering sharply in how they gear up for Tuesday's presidential debate, setting up a showdown that reflects not just two separate visions for the country but two politicians who approach big moments very differently.",
      "publishedAt": "2024-09-07T04:14:31Z",
      "title": "Harris and Trump are getting ready for Tuesday's debate in sharply different ways",
      "url": "https://apnews.com/c34170599af4f51925f8dc4753e06e8d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f18756bd8d8c4d8da55df6243a84935e/1930.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN",
      "description": "WASHINGTON (AP) — The first sign of trouble came before the debate even started.“Folks, how are you?” President Joe Biden said as he shuffled onto the stage. His voice was raspy and thin, his movements stiff.",
      "publishedAt": "2024-09-07T04:06:01Z",
      "title": "Biden's disastrous debate performance offers lessons for Harris and warnings for Trump",
      "url": "https://apnews.com/d62e8e7281fff34be8925adc9b4e6dc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/033e1f7b62134e0d802e98c74afa21e0/2841.jpeg"
    },
    {
      "author": "MICHAEL GOLDBERG and SCOTT BAUER",
      "description": "MOSINEE, Wis. (AP) — Former President Donald Trump heads to Wisconsin on Saturday for a rally that's intended to focus heavily on the economy, marking his first trip to the deep red, largely rural part of the key battleground state.",
      "publishedAt": "2024-09-07T04:04:52Z",
      "title": "Trump heads to a deep-red part of swing-state Wisconsin to talk about the economy",
      "url": "https://apnews.com/a6923d6c5758dabb6d959417ea9d7d12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6550ff49ec7b4cd282abe6471eaa60ce/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM",
      "description": "It was just the two of them, the teenager and his father, since an eviction a year earlier ended with the boy’s parents parting ways in a separation that fractured the entire family.That’s what Colin Gray told a Georgia sheriff’s investigator who came to his door in May 2023 asking whether an online threat to commit a school shooting had been posted by his son, Colt.",
      "publishedAt": "2024-09-07T04:06:12Z",
      "title": "Georgia school shooting suspect was troubled by a broken family, taunting at school, his father said",
      "url": "https://apnews.com/92fce6b86f5e2ad23c3337aff1997cab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f74f687e99f4828b968c4f85764501c/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli air raids in the Gaza Strip killed more than a dozen people overnight into Saturday morning, hospital and local authorities said, as health workers were wrapping up the second phase of an urgent polio vaccination campaign designed to prevent a large-scale outbreak in the territory.",
      "publishedAt": "2024-09-07T10:40:01Z",
      "title": "Israeli strikes in Gaza kill more than a dozen as health workers press on with polio vaccines",
      "url": "https://apnews.com/ea11e05b51ad898a0a980246cd8d7ad4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9a67d72dcba46728c69202d1d52a737/3000.jpeg"
    },
    {
      "author": "ZEN SOO and ANIRUDDHA GHOSAL",
      "description": "HANOI, Vietnam (AP) — Vietnamese authorities say Typhoon Yagi has killed at least four and injured 78 others after making landfall Saturday afternoon in the north of the country. The typhoon, described by Vietnamese meteorological officials as “one of the most powerful typhoons in the region over the past decade,” made its way to the Southeast Asian country after it left three people dead and nearly a hundred others injured in the Chinese province of Hainan.",
      "publishedAt": "2024-09-07T04:46:12Z",
      "title": "Vietnamese authorities say Typhoon Yagi has killed at least 4 and injured 78 others",
      "url": "https://apnews.com/555e6187e737da7b13fe3e31cf3797ba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9a678e5354e4e798ac891db1c5e5336/3000.jpeg"
    },
    {
      "author": "CLAIRE RUSH and JENNIFER SINCO KELLEHER",
      "description": "LAHAINA, Hawaii (AP) — Hinano Rodrigues remembers being 4 or 5 years old, carrying a bucket across a highway to the ocean in the Maui community where he still lives.At dawn, he would accompany his grandmother to a reef at low tide, where she plucked black snails, spiny lobsters and spiky sea urchins from the craggy rock.",
      "publishedAt": "2024-09-07T04:20:53Z",
      "title": "Maui's toxic debris could fill 5 football fields 5 stories deep. Where will it end up?",
      "url": "https://apnews.com/a10a5e4893182c6ea238c73fbd02fa3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e096b658ca9840d7a539b2053bcc903c/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "Boeing’s first astronaut mission ended Friday night with an empty capsule landing and two test pilots still in space, left behind until next year because NASA judged their return too risky.",
      "publishedAt": "2024-09-06T13:17:28Z",
      "title": "Two astronauts are left behind in space as Boeing's troubled capsule returns to Earth empty",
      "url": "https://apnews.com/92dca67a1fbecf05f5f0e6e2e79afc3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fdb5bb4f90b47f48abbb1be42fbf3f4/1796.jpeg"
    },
    {
      "author": "PATRICK WHITTLE",
      "description": "BIDDEFORD, Maine (AP) — Orange, blue, calico, two-toned and ... cotton-candy colored?Those are all the hues of lobsters that have showed up in fishers' traps, supermarket seafood tanks and scientists' laboratories over the last year.",
      "publishedAt": "2024-09-07T04:04:52Z",
      "title": "Just how rare is a rare-colored lobster? Scientists say answer could be under the shell",
      "url": "https://apnews.com/ae7e1c98d4eebb9658eea1e3e4cb6e31",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64bcd4c669e64ef6ae57be3a92db3fd0/1920.jpeg"
    },
    {
      "author": "STEVE MEGARGEE and MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — Saquon Barkley has been practicing the art of positive thinking since switching teams for the first time in his career.Yet he probably couldn’t have imagined making such a spectacular debut for the Philadelphia Eagles.",
      "publishedAt": "2024-09-07T04:00:50Z",
      "title": "Barkley scores 3 TDs as Eagles beat Packers 34-29 in Brazil. Packers' Love injured in final minute",
      "url": "https://apnews.com/4699207bdddfc6883150bc82e93fab0a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/acdc4f3616854a548990d554d85db145/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}