{
  "articles": [
    {
      "author": "BASSEM MROUE and MELANIE LIDMAN",
      "description": "BEIRUT (AP) — Lebanon’s Hezbollah group confirmed on Saturday that its leader and one of its founders, Hassan Nasrallah, was killed in an Israeli airstrike in Beirut the previous day.",
      "publishedAt": "2024-09-28T07:17:19Z",
      "title": "Hezbollah confirms its leader Hassan Nasrallah was killed in an Israeli airstrike",
      "url": "https://apnews.com/c4751957433ff944c4eb06027885a973",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2c476003df9c4624bbb1e35ff78bcd0b/1920.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Hezbollah leader Hassan Nasrallah, who transformed the Lebanese militant group into a potent paramilitary and political force in the Middle East, was killed in an Israeli airstrike, the group said.",
      "publishedAt": "2024-09-28T12:58:59Z",
      "title": "Hezbollah leader Hassan Nasrallah transformed the militant group into a potent regional force",
      "url": "https://apnews.com/2da3789a02fd4e2e88511a7f59174d19",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/37902b96de96444bad8e69037b3ea351/1920.jpeg"
    },
    {
      "author": "STEPHEN SMITH, KATE PAYNE and HEATHER HOLLINGSWORTH",
      "description": "PERRY, Fla. (AP) — Hurricane Helene caused at least 52 deaths and billions of dollars of destruction across a wide swath of the southeastern U.S.",
      "publishedAt": "2024-09-28T06:19:14Z",
      "title": "At least 52 dead and millions without power after Helene's deadly march across southeastern US",
      "url": "https://apnews.com/92d5caaafe40644e1db687cf6431395f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f2ea64b82bda4fa79f91d1f70796a9ce/1920.jpeg"
    },
    {
      "author": "LISA MASCARO and KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congress is off for the campaign season, as lawmakers from one of the most chaotic and unproductive legislative sessions in modern times try to persuade voters to keep them on the job.",
      "publishedAt": "2024-09-28T11:41:34Z",
      "title": "After a chaotic Congress, lawmakers head home to ask voters: How about another term?",
      "url": "https://apnews.com/ef7ef9a498e1c7a04971bf28b59c81f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/afe8a9bd3a814fac8c16f8b1d83a7556/3000.jpeg"
    },
    {
      "author": "TODD RICHMOND",
      "description": "MADISON, Wis. (AP) — A day after Vice President Kamala Harris discussed immigration at the U.S.-Mexico border, former President Donald Trump is expected to respond by again linking her to illegal border crossings at an event in a western Wisconsin river town.",
      "publishedAt": "2024-09-28T04:12:51Z",
      "title": "Trump is set to respond to Harris on immigration during his visit to a small Wisconsin town",
      "url": "https://apnews.com/0810efccefc8b094756d0c46f927b7dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/119aeeeeda1f44dc9fff635e0a4a1dce/3000.jpeg"
    },
    {
      "author": "ANTHONY IZAGUIRRE",
      "description": "For months, New York City Mayor Eric Adams — a former cop — refused to criticize the federal authorities investigating his administration. Not anymore.The day news of his indictment on corruption charges broke, Adams defiantly suggested, without providing evidence, that U.S.",
      "publishedAt": "2024-09-28T04:08:25Z",
      "title": "Indicted New York City mayor adopts familiar defense: He was targeted for his politics",
      "url": "https://apnews.com/8a99f5b8e42626eed1f1818fbd9f63ad",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c8a20604f9464b7d8f4f892e007882a6/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "Already the longest-lived of the 45 men to serve as U.S. president, Jimmy Carter is about to reach the century mark. The 39th president, who remains under home hospice care, will turn 100 on Tuesday, Oct.",
      "publishedAt": "2024-09-28T04:13:25Z",
      "title": "Jimmy Carter at 100: A century of changes for a president, the US and the world since 1924",
      "url": "https://apnews.com/34ceff0c3bb527863dae1c6788095c81",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f7eb561f9c304408bc6db681fd30319a/2998.jpeg"
    },
    {
      "author": "MOGOMOTSI MAGOME",
      "description": "JOHANNESBURG (AP) — Seventeen people, including 15 women, were killed in two mass shootings that took place in close proximity to each other in a rural town in South Africa, police said Saturday.A search was underway for the suspects, national police spokesperson Brig.",
      "publishedAt": "2024-09-28T11:51:31Z",
      "title": "17 people have been killed in 2 mass shootings in the same town in South Africa",
      "url": "https://apnews.com/86e1fe1e481781793c76cc82f65049c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66907c4494f64138b993c44931e4fd9c/3000.jpeg"
    },
    {
      "author": "COLLEEN SLEVIN",
      "description": "DENVER (AP) — In the moments before a gunman leaned on a car to steady his aim at her father, killing him as well as nine others during a 2021 mass shooting at a Colorado supermarket, a fellow shopper loading her groceries next to Erika Mahoney's dad made him laugh when she teased him about his automatic door closing button.",
      "publishedAt": "2024-09-28T04:10:38Z",
      "title": "Daughter finds 'earth angel' in woman who made her dad laugh before Colorado supermarket shooting",
      "url": "https://apnews.com/c96e37f6b2c7f60de989eb04f20a4387",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d8cdfa227f2a4e78b293e0c2a38f8266/1920.jpeg"
    },
    {
      "author": "SCOTT SONNER",
      "description": "By all accounts, Milagra the \"miracle\" California condor shouldn’t be alive today. But now at nearly 17 months old, she is one of four of the giant endangered birds who will get to stretch their wings in the wild as part of a release this weekend near the Grand Canyon.",
      "publishedAt": "2024-09-28T04:01:45Z",
      "title": "A rare condor hatched and raised by foster parents in captivity will soon get to live wild",
      "url": "https://apnews.com/53d2e43f9873bab6d9a3b82fc6d2bfb5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b941ec25686b49b7a8451b1fcd2a7541/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}