{
  "articles": [
    {
      "author": "JIM VERTUNO",
      "description": "A series of wildfires swept across the Texas Panhandle early Wednesday, prompting evacuations, cutting off power to thousands, and forcing at least the temporary shutdown of a nuclear weapons facility as strong winds, dry grass and unseasonably warm temperatures fed the blazes.",
      "publishedAt": "2024-02-27T22:18:27Z",
      "title": "Out-of-control wildfires scorch Texas Panhandle, prompt shutdown of nuclear weapons facility",
      "url": "https://apnews.com/2cad37f14581bac74a3691969aaaf956",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bf0fb45e64d14f06984c989034871fa7/2048.jpeg"
    },
    {
      "author": "JOEY CAPPELLETTI",
      "description": "LANSING, Mich. (AP) — Joe Biden and Donald Trump easily won their party’s primaries in Michigan, but Tuesday’s results showed that both candidates have cause for concern in their bid to win the swing state in November.",
      "publishedAt": "2024-02-28T02:31:59Z",
      "title": "Michigan takeaways: Presidential primaries show warning signs for Trump and Biden",
      "url": "https://apnews.com/48b7ab77b7af425c3662e5a8f28e37f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b655cb458c6940a29ec7623b9ec4261c/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The families of hostages held in Gaza and their supporters are launching a four-day march from southern Israel to Jerusalem to demand their loved ones be set free.The march comes as negotiations are underway in Qatar to bring about a deal between Hamas and Israel that would lead to a cease-fire in exchange for the release of hostages.",
      "publishedAt": "2024-02-28T09:12:09Z",
      "title": "The Latest | Families of hostages held in Gaza launch a 4-day march to demand their freedom",
      "url": "https://apnews.com/5fb126981031984395a228598fa9e4a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2928543b1cb04fa589102bae454ab9e1/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG, KEVIN FREKING and DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Congressional leaders emerged from an “intense” Oval Office meeting with President Joe Biden on Tuesday speaking optimistically about the prospects for avoiding a partial government shutdown, but with new uncertainty about aid for Ukraine and Israel as the president and others urgently warned Speaker Mike Johnson of the grave consequences of delay.",
      "publishedAt": "2024-02-27T05:07:26Z",
      "title": "Biden and party leaders implore Speaker Johnson to help Ukraine in 'intense' Oval Office meeting",
      "url": "https://apnews.com/dc6d39b2a652130c6e3021394c1a3ee3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc83ffb163b6419fa2604011884d622d/1920.jpeg"
    },
    {
      "author": "LLAZAR SEMINI",
      "description": "TIRANA, Albania (AP) — Ukraine's president co-hosted a summit with Albania's government on Wednesday that is meant to encourage further support for Kyiv by southeastern European countries, as signs of fatigue grow two years after Russia's full-scale invasion.",
      "publishedAt": "2024-02-28T05:16:50Z",
      "title": "Zelenskyy co-hosts a summit in Albania seeking more war support from southeastern Europe",
      "url": "https://apnews.com/0c275b84f729922ae8ac9f4f6446cfc1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/290491353bdd488da269075fd25067c6/3000.jpeg"
    },
    {
      "author": "FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Hunter Biden is set to appear Wednesday on Capitol Hill for a closed-door deposition with lawmakers, a critical moment for Republicans as their impeachment inquiry into his father and their family's business affairs teeters on the brink of collapse.",
      "publishedAt": "2024-02-28T05:04:06Z",
      "title": "Hunter Biden to appear for closed-door interview with Republicans conducting impeachment inquiry",
      "url": "https://apnews.com/f91915376997b5327eb2e747816690b5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7af20686d6674e538debf2ee3e48c317/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "The funeral of Russian opposition leader Alexei Navalny, who died earlier this month in a remote Arctic penal colony, will take place on Friday in Moscow after several locations declined to host the service, his spokesperson said.",
      "publishedAt": "2024-02-28T09:46:15Z",
      "title": "Funeral of Russian opposition leader Alexei Navalny to be held on Friday, his spokesperson says",
      "url": "https://apnews.com/21502238f9435f49f9887a3af1a6d0f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06d261ca82194b32a8eea04d32e34376/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "DUBAI, United Arab Emirates (AP) — Iran is holding parliamentary elections this Friday, yet the real question may not be who gets elected but how many people actually turn out to vote.",
      "publishedAt": "2024-02-28T05:23:47Z",
      "title": "Many in Iran are frustrated by unrest and poor economy. Parliament elections could see a low turnout",
      "url": "https://apnews.com/2e635097e10140dd5e3ac499ea5d320e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84dd33e96f4a468291a44ec4c97fec72/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korean and U.S. troops will begin their expanded annual military drills next week in response to North Korea’s evolving nuclear threats, the two countries said Wednesday, a move that will likely enrage North Korea because it views its rivals’ joint training as an invasion rehearsal.",
      "publishedAt": "2024-02-28T04:13:35Z",
      "title": "South Korean and US troops will begin major exercises next week in response to North Korean threats",
      "url": "https://apnews.com/d633b0e37134c12bba7b4f79650510aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/39b3bf2fdb8549a4be2e929fdb7c99a8/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "TUCSON, Ariz. (AP) — Inside giant white tents that house about 1,000 migrants near Tucson International Airport, Border Patrol agents demonstrate clockwork efficiency to release detainees within two days of arrest with orders to appear in immigration courts at their final destinations.",
      "publishedAt": "2024-02-28T05:19:45Z",
      "title": "US asylum restriction aimed at limiting claims has little impact given strained border budget",
      "url": "https://apnews.com/58e447ee0033a5ef23593ed5c02da02e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ace0bde3bb0448b3959a191272414e91/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}