{
  "articles": [
    {
      "author": "SARAH EL DEEB and SAMY MAGDY",
      "description": "BEIRUT (AP) — Israel said late Monday it planned to carry out more strikes in Lebanon against a Hezbollah-run financial institution that it targeted the night before and which it says uses customers' deposits to finance attacks against Israel.",
      "publishedAt": "2024-10-21T09:36:27Z",
      "title": "Israel says more strikes are coming against a Hezbollah-run financial institution",
      "url": "https://apnews.com/3fe94c75a6d6d44c89f350d7e94785df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/df1710c2d3364618b712434f5edfe38f/3000.jpeg"
    },
    {
      "author": "AAMER MADHANI and DAVID KLEPPER",
      "description": "WASHINGTON (AP) — President Joe Biden is “deeply concerned” about the unauthorized release of classified documents on Israel's preparation for a potential retaliatory attack on Iran, a White House spokesman said Monday.",
      "publishedAt": "2024-10-21T16:39:24Z",
      "title": "Biden is 'deeply concerned' about the release of secret documents on Israel's possible attack plans",
      "url": "https://apnews.com/5cc9b0f30b7119a039d122599bf0c285",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d0a06d036df4bd69b3bd2004af1acf4/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — The Israeli military has carried out a wave of airstrikes targeting branches of a financial institution affiliated with Lebanon’s Hezbollah, saying the quasi-banking system is being used to fund the militant group's military wing.",
      "publishedAt": "2024-10-21T17:40:11Z",
      "title": "What is the Hezbollah-linked financial institution Israel is targeting in Lebanon?",
      "url": "https://apnews.com/67220b894b55500b0be799a0be4245c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e448cfcbabf64b8ea84bf82155247db5/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE and BILL BARROW",
      "description": "SWANNANOA, N.C. (AP) — Surveying storm damage in North Carolina, former President Donald Trump on Monday blasted federal emergency responders whose work has been stymied by armed harassment and a deluge of misinformation, but he said he was not concerned that the aftermath of Hurricane Helene would affect election results in the battleground state.",
      "publishedAt": "2024-10-21T04:20:25Z",
      "title": "Trump makes more debunked claims about FEMA as he surveys storm damage in North Carolina",
      "url": "https://apnews.com/2dea5d3130416a56f21a5c22ce2e4386",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3fdbe68072dd46279840f840fac9db0c/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ",
      "description": "WASHINGTON (AP) — Millions of people with private health insurance would be able to pick up over-the-counter methods like condoms, the “morning after” pill and birth control pills for free under a new rule the White House proposed on Monday.",
      "publishedAt": "2024-10-21T09:03:09Z",
      "title": "White House says health insurance needs to fully cover condoms, other over-the-counter birth control",
      "url": "https://apnews.com/f9701dc9137867c62f6a22e1501bebe6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc055144e1c14541aec64956152d1113/3000.jpeg"
    },
    {
      "author": "ANDREA RODRIGUEZ and MILEXSY DURAN",
      "description": "HAVANA (AP) — Cuba's capital was largely paralyzed on Monday and the rest of the island braced for the fourth night of a massive blackout that has generated a handful of small protests and a stern government warning that any unrest will be punished.",
      "publishedAt": "2024-10-21T04:49:59Z",
      "title": "Cubans struggle with an extended power outage and a new tropical storm",
      "url": "https://apnews.com/b197e174af2c9f664d4c3aaf0c5a6e75",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/aea1f81d9edd4d71994b100309db1c5e/1920.jpeg"
    },
    {
      "author": "RUSS BYNUM and EMILY WAGSTER PETTUS",
      "description": "SAVANNAH, Ga. (AP) — The metal gangway where dozens of people waited to board a ferry boat made a loud, creaking noise before snapping in the middle amid panicked cries from those sent plunging into the water.",
      "publishedAt": "2024-10-21T04:07:11Z",
      "title": "Eyewitness video captures frantic efforts to save lives after deadly collapse of dock walkway",
      "url": "https://apnews.com/cc67d03b802cc97594d1fb1a591cb408",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd9dc2dfe3524609b57f20f819be5499/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE",
      "description": "BUENOS AIRES, Argentina (AP) — An initial toxicology report for ex-One Direction singer Liam Payne, who died last week after falling from a third-floor hotel balcony in Buenos Aires, showed that he had cocaine in his system after his death, an Argentine official said.",
      "publishedAt": "2024-10-21T22:02:46Z",
      "title": "Initial report shows Liam Payne had cocaine in his system when he died, says Argentine official",
      "url": "https://apnews.com/dae90a8090a46cf4af72d8fe359f38df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/67640a8359fb46a385708106ed63fbad/3000.jpeg"
    },
    {
      "author": "JOHN SEEWER",
      "description": "The family of Jayland Walker, a Black man killed when eight police officers fired 94 bullets at him after he shot at least one round out his car window, will receive a $4.8 million settlement from the city of Akron, the mayor's office said Monday.",
      "publishedAt": "2024-10-21T17:03:26Z",
      "title": "Akron to pay $4.8 million to relatives of a Black man killed by police",
      "url": "https://apnews.com/831521e50a28e3e51e1c2124a762178e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/64404912219b47878d9b3e770c4e4600/3000.jpeg"
    },
    {
      "author": "RONALD BLUM",
      "description": "NEW YORK (AP) — Broadway vs. Hollywood. Subway vs. Freeway. Judge vs. Ohtani.New York neighbors who became cross-country rivals, the Yankees and Dodgers renew their starry struggle in the World Series for the first time in 43 years.",
      "publishedAt": "2024-10-21T03:34:03Z",
      "title": "Yankees and Dodgers meet in World Series for 12th time in matchup of Broadway and Hollywood",
      "url": "https://apnews.com/a0996d2d1906deafe38b2b15dc26ad0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a9f22f4bfcd4549a809037842bc37a1/1176.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}