{
  "articles": [
    {
      "author": null,
      "description": "Israeli airstrikes killed 15 Palestinians in Gaza early on Friday, while a hospital said another 20 people died in shootings while waiting for aid. Meanwhile, the U.N. human rights office says it has recorded 613 killings in Gaza near humanitarian convoys and aid distribution points run by an Israeli-backed American organization since it first began operations in late May. Spokeswoman Ravina Shamdasani said the rights office was not able to attribute responsibility for the killings. But she said “it is clear that the Israeli military has shelled and shot at Palestinians trying to reach the distribution points” operated by the Gaza Humanitarian Foundation.",
      "publishedAt": "2025-07-04T09:30:40Z",
      "title": "UN records 613 killings in Gaza near humanitarian convoys or aid distribution points run by US group",
      "url": "https://apnews.com/article/mideast-wars-gaza-aid-hamas-ceasefire-c263f8ecf5f432f2da2bcbbd0938c623",
      "urlToImage": "https://dims.apnews.com/dims4/default/e273813/2147483647/strip/true/crop/7855x4418+0+409/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Fd0%2F301cf9d4a6d52e5ac6dbb893b817%2Fc72eeba4558d404e97c133c6bdec8145"
    },
    {
      "author": null,
      "description": "Russia launched 550 drones and missiles across Ukraine overnight in the largest aerial assaults since the war began. The capital Kyiv was the primary target. At least 23 people were injured, and multiple residential buildings in the capital were damaged. Ukrainian air defenses shot down 270 targets and another 208 targets were lost from radar and presumed jammed, but dozens still struck or caused damage across the city. Fires and destruction were reported in at least five of Kyiv's 10 districts, and railway infrastructure was also hit. The attack came hours after President Donald Trump held a call with Russian President Vladimir Putin and made his first public comments on the U.S. decision to pause some shipments of weapons to Ukraine.",
      "publishedAt": "2025-07-04T06:33:48Z",
      "title": "Russia hits Ukraine with its largest aerial attack of the war",
      "url": "https://apnews.com/article/ukraine-russia-war-attack-missile-drone-58bc08ddcf1038fb409999c56b11e9fa",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a5c55e/2147483647/strip/true/crop/8056x4532+0+420/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F6e%2Fbf17c5f6f4da18799ea393da9514%2Fae1cabfc6cd8457fb86f8e98f8737c84"
    },
    {
      "author": null,
      "description": "President Donald Trump plans to sign his signature bill of tax and spending cuts at the White House Fourth of July picnic. He's taking a victory lap after muscling his main legislative priority through the Republican-controlled Congress. Fighter jets and a stealth bomber are expected to streak the sky over the event later Friday where Trump will turn the legislation into law. The legislation extends Trump's 2017 multi-trillion dollar tax cuts and cuts Medicaid and food stamps by $1.2 trillion. It provides for a massive increase in immigration enforcement. Congress' nonpartisan scorekeeper projects that nearly 12 million more people will lose health insurance under the law.",
      "publishedAt": "2025-07-04T16:01:01Z",
      "title": "Trump plans to sign his tax and spending cut bill at White House picnic",
      "url": "https://apnews.com/article/trump-sign-tax-cut-bill-july-4-3804df732e461a626fd8c2b43413c3f0",
      "urlToImage": "https://dims.apnews.com/dims4/default/19a7f1a/2147483647/strip/true/crop/7049x3965+0+367/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F27%2Fac04f62ac95813690f4518142efb%2F682180207dc646bd9260fa50832cf22c"
    },
    {
      "author": null,
      "description": "A federal judge in Washington is briefly blocking the deportation of eight immigrants to war-torn South Sudan the day after the Supreme Court permitted it to go forward. District Judge Randolph Moss decided Friday to send the case to a judge in Boston whose rulings led to the initial halt of the Trump administration’s effort to begin deportations to South Sudan. The immigrants and their federal guards have been waiting in Djibouti, Africa, for weeks after a judge ordered the administration not to deport anyone to “third countries” where they did not originate. The Supreme Court overturned that ruling. Thursday night.",
      "publishedAt": "2025-07-04T19:04:21Z",
      "title": "Judge blocks immigrants' deportation to South Sudan after Supreme Court cleared the way",
      "url": "https://apnews.com/article/south-sudan-deportation-supreme-court-5055bb1560545e3bc0c6592868b07867",
      "urlToImage": "https://dims.apnews.com/dims4/default/7745e73/2147483647/strip/true/crop/4249x2390+0+221/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2Fb6%2Fd21764683b4fbb350f71071d98c4%2F1fbb1529662b425fa3a0eb616d36d9e2"
    },
    {
      "author": null,
      "description": "Heavy rains have caused devastating flash floods in Texas Hill Country, leaving at least 13 people dead and many others missing. On Friday, search teams used boats and helicopters to rescue people trapped in fast-moving floodwaters. Authorities reported that around 10 inches of rain fell overnight, causing the Guadalupe River to rise rapidly. Among the missing are 23 girls from a summer camp. Officials say the death toll may rise as rescue operations continue. The area, known as “flash flood alley,” is prone to sudden flooding due to its thin soil. Meanwhile, severe weather in New Jersey has also claimed three lives.",
      "publishedAt": "2025-07-04T15:53:55Z",
      "title": "Texas floods kill at least 13 with more than 20 missing from girls summer camp",
      "url": "https://apnews.com/article/thunderstorms-texas-deaths-camp-mystic-trees-hail-e8a4c85c77f714c9a974e50f3cd1fca1",
      "urlToImage": "https://dims.apnews.com/dims4/default/8453fe6/2147483647/strip/true/crop/3000x1688+0+281/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe8%2F81%2Ffd20fd6a7e2f5ff414b3cb8a29e8%2F3dbd891d72f841a2b2f2b4feef1c45c1"
    },
    {
      "author": null,
      "description": "A volunteer searching the archives of the American Baptist in Massachusetts has found a nearly 180-year-old document shedding light on the church's support for ending slavery. The 5-foot-long scroll is a handwritten declaration signed by 116 New England ministers saying they “disapprove and abhor the system of American slavery.” The document was signed two years after the issue of slavery prompted Baptists in the south to break away and form the Southern Baptist Convention. Church officials consider the scroll one of the most important abolitionist-era Baptist documents. It was discovered in a storage room in Groton, Massachusetts.",
      "publishedAt": "2025-07-03T04:11:09Z",
      "title": "Anti-slavery document signed by 116 Baptist ministers in 1847 found in Massachusetts archive",
      "url": "https://apnews.com/article/baptist-slavery-massachusetts-historic-document-2f281d1c1245e5e387e981a4eb0945b4",
      "urlToImage": "https://dims.apnews.com/dims4/default/3cdc2bd/2147483647/strip/true/crop/3873x2179+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2Fe4%2Fdbc7e6ed81764f810acb31ed9fd1%2F20799f9062ed444bb119d570ea832a54"
    },
    {
      "author": null,
      "description": "President Donald Trump will be in Iowa to kick off a year of patriotic festivities leading up to next year's 250th anniversary of American independence. Organizers see the coming year of festivities, which start Thursday, as a way to help unite a polarized country and bridge partisan divides. But a recent Gallup poll showed the widest partisan split in patriotism in over two decades, with only about a third of Democrats saying they are proud to be American compared with about 9 in 10 Republicans. As a candidate, Trump proposed a “Great American State Fair” in Iowa, but it will take place next year in Washington instead.",
      "publishedAt": "2025-07-03T04:14:55Z",
      "title": "Trump marks celebration of America's 250th anniversary in Iowa",
      "url": "https://apnews.com/article/trump-america-250th-birthday-iowa-e6fb5df832cdba107ae4e9c62f2577e9",
      "urlToImage": "https://dims.apnews.com/dims4/default/58d5f27/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F57%2F64%2F7c2f3c6202990b7d13194425ed3e%2F0a75ac31cfcb4be9b3cee59ae4183412"
    },
    {
      "author": null,
      "description": "Famed competitive eater Joey “Jaws” Chestnut has reclaimed his title at the Nathan’s Famous Fourth of July hot-dog eating contest after skipping last year’s event. The 41-year-old from Westfield, Indiana, secured his 17th Mustard Belt in 20 appearances before cheering fans at Coney Island in Brooklyn, New York. He had missed the 2024 competition over a contract dispute involving a deal he had struck with a competing brand, the plant-based meat company Impossible Foods. Defending champion Miki Sudo won her 11th title in the women’s division. The event, held outside the original Nathan’s Famous restaurant, dates back to 1972 and draws large crowds of fans in foam hot-dog hats.",
      "publishedAt": "2025-07-04T04:01:19Z",
      "title": "Joey 'Jaws' Chestnut reclaims title in Famous hot dog eating contest, wins 17th Mustard Belt",
      "url": "https://apnews.com/article/nathans-hot-dog-contest-joey-chestnut-2bf7e4c6e05da82e74d86421006d55a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/2414b1c/2147483647/strip/true/crop/5029x2829+0+262/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6c%2Fc3%2F546ca5fe72c6a04a3f36f627b994%2F0ccb736cbf4c4cc5a452240cba6dcc28"
    },
    {
      "author": null,
      "description": "People are approaching this Independence Day with mixed feelings. Polls show declining national pride, especially among Democrats, during the Trump era. In southern California, some July Fourth celebrations have been canceled due to immigration raids and safety concerns. Protests against Trump’s policies are planned across the country. Meanwhile, fireworks retailers face challenges from tariffs on Chinese imports, though many are holding off price increases this year. Holiday travel is breaking records, and AAA reports over 72 million Americans expected to hit the road or fly.",
      "publishedAt": "2025-07-03T21:50:11Z",
      "title": "July Fourth celebrations, protests and cancelled events",
      "url": "https://apnews.com/article/july-fourth-4th-holiday-protests-celebrating-cancel-e0a5789143de4e51a0548d0535145aaf",
      "urlToImage": "https://dims.apnews.com/dims4/default/9ab0777/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F7d%2F329e6939113dcb5d31bad30b58cd%2F20624bbd4de944a1973fecd334edb26f"
    },
    {
      "author": null,
      "description": "Famed Mexican boxer Julio César Chávez Jr. has been arrested for entering US illegally and will be deported to Mexico, where he faces organized crime charges, federal officials said Thursday. The arrest in Studio City, California, on Wednesday comes only days after the former middleweight champion fought in a match against Jake Paul in Anaheim, California. The Department of Homeland Security said Immigration and Customs Enforcement officers detained Chávez for overstaying a tourist visa. They said he also has an active arrest warrant in Mexico for involvement in organized crime and trafficking firearms, ammunition, and explosives and is believed to be an affiliate of the Sinaloa Cartel.",
      "publishedAt": "2025-07-03T18:54:25Z",
      "title": "ICE arrested Mexican boxer Julio César Chávez Jr. pending deportation",
      "url": "https://apnews.com/article/mexican-boxer-julio-cesar-chavez-arrested-deportation-e8f600abb9c7e5adfe60de8739fd12df",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b9fb42/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F73%2Fba004cedffa73ea13e7c85f69cd0%2Fad2448e99eca45d2bd604beb01c196e2"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}