{
  "articles": [
    {
      "author": null,
      "description": "Los Angeles police have swiftly enforced a downtown curfew, making arrests moments after it took effect, deploying officers on horseback and using crowd control projectiles to break up a group of hundreds demonstrating against President Donald Trump’s immigration crackdown. Hours later after the curfew went into effect Tuesday night, many of the protesters had dispersed, although small sporadic confrontations continued. Democratic Gov. Gavin Newsom earlier accused Trump of drawing a “military dragnet” across the nation’s second-largest city with his escalating use of the National Guard. He also deployed Marines, though none were seen on the streets Tuesday. Trump ordered the deployment of nearly 5,000 troops, including National Guard and Marines, to LA.",
      "publishedAt": "2025-06-11T05:24:58Z",
      "title": "Los Angeles imposes curfew as protests continue against Trump’s immigration crackdown",
      "url": "https://apnews.com/article/los-angeles-protests-ice-national-guard-f39ba39287f628ce8c8be47c92ea6147",
      "urlToImage": "https://dims.apnews.com/dims4/default/ff18fbb/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa9%2F47%2F62853facaf44d4f78c7589340768%2F0053e7fa458a4fe2a3545c7cb6d8dd34"
    },
    {
      "author": null,
      "description": "U.S. Rep. LaMonica McIver has been indicted on federal charges alleging she “forcibly impeded\" immigration officers during a skirmish outside a New Jersey detention center. McIver has disputed the allegations as baseless. The skirmish happened last month as Newark’s mayor was arrested after trying to join McIver and two fellow Democratic representatives who said they went to conduct congressional oversight at Delaney Hall, where other people were protesting outside. Police bodycam video shows McIver’s elbows pushing into an officer, but it isn’t clear from the video whether that contact was intentional, incidental or a result of jostling in the chaotic scene.",
      "publishedAt": "2025-06-10T23:24:15Z",
      "title": "Rep. McIver indicted on charges from skirmish at New Jersey immigration center",
      "url": "https://apnews.com/article/lamonica-mciver-assault-charge-alina-habba-immigration-7b6a5b0fc8079a9efd0606ab68e3f02d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d05cca/2147483647/strip/true/crop/4000x2250+0+213/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2F40%2Ff1988fec691aceb9237efc1ab853%2F3e6f73bcb44d4a659b50a744180f6562"
    },
    {
      "author": null,
      "description": "The upcoming parade in Washington to celebrate the U.S. Army's 250th anniversary has divided veterans. Critics say it's a thinly veiled celebration of President Donald Trump's 79th birthday when the Republican is making cuts to the Department of Veterans Affairs and banning transgender troops. Others see it as a once-in-a-lifetime celebration of the Army’s achievements and the service of millions of soldiers over centuries. Saturday's parade will feature hundreds of military vehicles and aircraft and thousands of soldiers. The Army expects as many as 200,000 people could attend and says the parade will cost an estimated $25 million to $45 million.",
      "publishedAt": "2025-06-11T11:14:26Z",
      "title": "Veterans are divided over the Army's big parade on Trump's birthday",
      "url": "https://apnews.com/article/military-parade-army-trump-birthday-veterans-0912f4009b4d9fc157b35bb9edf9375a",
      "urlToImage": "https://dims.apnews.com/dims4/default/9854341/2147483647/strip/true/crop/5560x3128+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2Fcc%2F4b80fb2387051033886fb31e78e8%2Fdabca45f40174c3ba509b067450201f0"
    },
    {
      "author": null,
      "description": "Police say investigators found a farewell letter and a non-functional pipe bomb when they searched the home of a man who opened fire at his former school in Austria, killing 10 people and taking his own life. Austria is mourning the victims of what appears to be the deadliest attack in its post-World War II history, and a national minute of silence is planned for Wednesday morning. But questions remain about the motive of the shooter. A senior official said the farewell letter, in which the assailant said goodbye to his parents, hadn't allowed investigators to draw conclusions.",
      "publishedAt": "2025-06-11T06:44:16Z",
      "title": "Austria mourns 10 killed in school shooting as police find farewell letter in shooter's home",
      "url": "https://apnews.com/article/austria-graz-school-shooting-mourning-4de3a8477a3ed8dc387d655c5e33e779",
      "urlToImage": "https://dims.apnews.com/dims4/default/7983523/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2Fea%2F91876d42513194f539b1f830f9c0%2F56682ae85264469ea215426b02aa9899"
    },
    {
      "author": null,
      "description": "Elon Musk stepped back from his explosive feud with U.S. President Donald Trump, writing on X that he regrets some of his posts about his onetime ally and that they went “too far.” Early Wednesday morning, he posted “I regret some of my posts about President @realDonaldTrump last week. They went too far.” Musk earlier deleted a post in which he claimed without evidence that the government was concealing information about the president’s association with infamous pedophile Jeffrey Epstein. On Sunday, Trump told NBC’s Kristen Welker that he has no desire to repair their relationship and warned that Musk could face “serious consequences” if he tries to help Democrats in upcoming elections.",
      "publishedAt": "2025-06-11T08:54:33Z",
      "title": "Musk says he regrets some posts attacking Trump",
      "url": "https://apnews.com/article/trump-musk-regret-x-feud-4bd9ba2eef03a4eef8ae45057e53fd98",
      "urlToImage": "https://dims.apnews.com/dims4/default/beca9f1/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fb2%2F74eb68dceeafcfd879901e7b7fde%2F345e79d84d2c442aa0422ac3f15ad382"
    },
    {
      "author": null,
      "description": "Russian forces have launched a large-scale drone assault across Ukraine. Ukrainian officials said that the attacks overnight Wednesday killed three people and wounded 64 others. The strikes caused widespread destruction in the northeastern city of Kharkiv. Apartment buildings, private homes, playgrounds, industrial sites and public transportation were hit. Moscow’s forces have deployed high numbers of drones and missiles in recent days. They include a record bombardment of almost 500 drones on Monday and a wave of 315 drones and seven missiles overnight on Tuesday.",
      "publishedAt": "2025-06-11T06:07:42Z",
      "title": "Russian attacks kill 3 as drones hit Kharkiv and other parts of Ukraine",
      "url": "https://apnews.com/article/russia-ukraine-war-drone-strike-kharkiv-7b2760f6b46f5037509fefd6264345aa",
      "urlToImage": "https://dims.apnews.com/dims4/default/faf93d6/2147483647/strip/true/crop/2000x1125+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F8c%2Fd8fc89fc3c4d699494350c2bd454%2F74b9c0113496474087c6a33e3deadee0"
    },
    {
      "author": null,
      "description": "President Donald Trump plans to speak at Fort Bragg to celebrate the 250th anniversary of the U.S. Army. The Republican president's trip to the North Carolina base comes as he faces criticism over deploying the National Guard and now U.S. Marines in an attempt to quell immigration protests in Los Angeles. Defense Secretary Pete Hegseth and Army Secretary Dan Driscoll will also be at Tuesday’s event, along with service members, veterans and their families. Trump has promoted the Army’s anniversary as a reason to hold a military parade in Washington, D.C., on Saturday, which is also his 79th birthday.",
      "publishedAt": "2025-06-10T04:02:45Z",
      "title": "Trump visits Fort Bragg as he sends military to Los Angeles protests",
      "url": "https://apnews.com/article/donald-trump-fort-bragg-6df36485dec1df2350d5b7be0882a703",
      "urlToImage": "https://dims.apnews.com/dims4/default/b9812f6/2147483647/strip/true/crop/5576x3137+0+290/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F35%2Fb7%2Fbc975010af41e4511bd3c2d38fd6%2Fbf2e7bdee8b046e7a7f6af05667da6ed"
    },
    {
      "author": null,
      "description": "Defense Secretary Pete Hegseth is expected to field sharp questions from members of Congress about his tumultuous start as Pentagon chief in a series of hearings beginning Tuesday. He's likely to be asked about his sharing of sensitive military details over a Signal chat. Lawmakers have made it clear they are unhappy that Hegseth has not provided details on the administration’s first proposed defense budget, which President Donald Trump has said would total $1 trillion. It will be members’ first chance to ask about a myriad of other controversial spending by the Pentagon and the deployment of troops to quell protests in Los Angeles.",
      "publishedAt": "2025-06-10T04:07:42Z",
      "title": "Hegseth faces Congress for first time since Signal leaks",
      "url": "https://apnews.com/article/pentagon-congress-hegseth-signal-hearings-c53cd37c2eae4327dd74e4c717057469",
      "urlToImage": "https://dims.apnews.com/dims4/default/c17bcef/2147483647/strip/true/crop/4004x2252+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2F08%2Fabddb42d7a5bb289b5a6c59ec028%2F709d6e04dd1d48e0ba9128f7a3bf936b"
    },
    {
      "author": null,
      "description": "More than 10,000 church representatives are gathered in Dallas for the annual meeting of the Southern Baptist Convention. Casting a pall over the gathering is the recent death of one of the most high-profile whistleblowers in the Southern Baptists’ scandal of sexual abuse. Jennifer Lyell, a onetime denominational publishing executive who went public in 2019 with allegations that she had been sexually abused by a seminary professor while a student, died Saturday at 47. Friends reported that the backlash Lyell received after going public took a devastating toll on her. Several abuse survivors and advocates for reform are skipping this year’s gathering, citing lack of progress.",
      "publishedAt": "2025-06-10T20:25:05Z",
      "title": "Whistleblower's death casts pall on Southern Baptist meeting",
      "url": "https://apnews.com/article/southern-baptists-meeting-sexual-abuse-jennifer-lyell-8ebb5246978918f46d243d6ce2d9f4a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/aa75a9b/2147483647/strip/true/crop/4875x2742+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F16%2F3374d750ba3858bd083905daf513%2F66c82199427f43eb996759c3aebb1afc"
    },
    {
      "author": null,
      "description": "Jurors in Harvey Weinstein’s sex crimes retrial are drilling down on one of the three charges against him. It's a rape accusation from a woman who also had a consensual relationship with him. The seven female and five male jurors are poised to start their fifth day of deliberations Wednesday by re-hearing Jessica Mann’s testimony that the Oscar-winning movie producer raped her in a Manhattan hotel room in 2013. Mann's accusation was an apparent focus of Tuesday’s deliberations, and the jury ended the day with more requests to revisit evidence related to her. The 73-year-old Weinstein has pleaded not guilty to raping Mann and to forcing oral sex on two other women.",
      "publishedAt": "2025-06-11T03:59:59Z",
      "title": "Jury in Harvey Weinstein's retrial scrutinizes one accuser's account",
      "url": "https://apnews.com/article/harvey-weinstein-sexual-assault-trial-31d7a64b75148d1e482f3c020ffea527",
      "urlToImage": "https://dims.apnews.com/dims4/default/e07af84/2147483647/strip/true/crop/6720x3780+0+350/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F11%2F844f9c815a761e4d9a99eec04e01%2Fdb3699b29ac54b51a3c0cca98590d8b0"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}