{
  "articles": [
    {
      "author": "Annie Ma, Collin Binkley",
      "description": "Secretary of State Marco Rubio says the U.S. will begin revoking the visas of Chinese students, “including those with connections to the Chinese Communist Party or studying in critical fields.” His announcement on X added to the uncertainty for America’s international students, who have faced intensifying scrutiny from President Donald Trump’s administration. In a cable sent Tuesday to U.S. embassies and consulates, Rubio halted the scheduling of new visa interviews for international students until the department releases guidelines for increased vetting of their activity on social media. Existing appointments may be kept and will proceed under current review guidelines, the cable said, but new guidance is expected in the coming days.",
      "publishedAt": "2025-05-28T18:58:14Z",
      "title": "US to begin revoking visas of some Chinese students",
      "url": "https://apnews.com/article/international-students-visas-trump-guidance-social-media-a1f5180ce83560aff66dd65534906697",
      "urlToImage": "https://dims.apnews.com/dims4/default/8af7d7d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fce%2F99%2F082c0e419ad8c01d6a33099f3029%2F78331a270cb94138b93d9eb4b4f4c61d"
    },
    {
      "author": "Lindsay Whitehurst",
      "description": "A federal trade court is blocking President Donald Trump from imposing sweeping tariffs on imports under an emergency-powers law. The ruling from a three-judge panel came after several lawsuits arguing Trump has exceeded his authority, left U.S. trade policy dependent on his whims and unleashed economic chaos. At least seven lawsuits are challenging the levies, the centerpiece of Trump’s trade policy. Trump has says he has the power to act because the country’s trade deficits amount to a national emergency. The court found the 1977 International Emergency Economic Powers Act does not authorize the use of tariffs.",
      "publishedAt": "2025-05-28T23:16:48Z",
      "title": "Federal court blocks Trump's sweeping tariffs, citing economic chaos",
      "url": "https://apnews.com/article/trump-tariffs-trade-court-0392dbd59f548e49ad4f64254ae3f94a",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1719f6/2147483647/strip/true/crop/3829x2154+0+200/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F83%2F443ca7d88a3514462cb659512235%2F1609dbb91dd24cbc9d508c0368e675c2"
    },
    {
      "author": "Russ Bynum",
      "description": "President Donald Trump has pardoned reality TV stars Todd and Julie Chrisley three years after they were convicted of bank fraud and tax evasion. The celebrity couple are best known for the TV series “Chrisley Knows Best.” Trump pardoned them Wednesday, paving the way for their release from separate prison facilities in Pensacola, Florida, and Lexington, Kentucky. Federal prosecutors said at the couple's 2022 trial that the Chrisleys conspired to defraud Atlanta area banks of $30 million and tried to hide their earnings from tax authorities. Trump’s decision to pardon them is another example of the president’s willingness to pardon high-profile friends, supporters, donors and former staffers.",
      "publishedAt": "2025-05-28T19:56:10Z",
      "title": "Trump pardons Julie and Todd Chrisley, reality TV stars convicted in 2022 of fraud and tax evasion",
      "url": "https://apnews.com/article/julie-chrisley-todd-trump-pardons-federal-prison-9c508547bf5f6d57ae20f38c6821cecd",
      "urlToImage": "https://dims.apnews.com/dims4/default/065df68/2147483647/strip/true/crop/2741x1542+0+143/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F50%2F9c7c8033c1f53fa4ffecbb6a7d3b%2F78c90a17eecc4944a0366d73b9be233c"
    },
    {
      "author": "Jon Gambrell",
      "description": "President Donald Trump says he has told Israeli Prime Minister Benjamin Netanyahu to hold off on an Iran strike to give his administration more time time to push for new nuclear deal with Tehran. Trump told reporters at the White House that he told Netanyahu a strike “would be inappropriate to do right now because we’re very close to a solution.” Trump's comments on Wednesday came as the head of the U.N.'s atomic watchdog group said that “the jury is still out” on negotiations between Iran and the U.S. over Tehran’s rapidly advancing nuclear program. But Rafael Mariano Grossi described the continuing negotiations as a good sign.",
      "publishedAt": "2025-05-28T10:50:15Z",
      "title": "Trump says he warned Netanyahu to hold off on Iran strike to give US more time for nuclear talks",
      "url": "https://apnews.com/article/iran-us-nuclear-talks-0613bd70b6a47ed2f583177e54473a21",
      "urlToImage": "https://dims.apnews.com/dims4/default/d4a3fa7/2147483647/strip/true/crop/8297x4667+0+432/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F36%2F6c%2Feff989ae4299eb40ecd524d5f064%2F3c3348f272d244db9a332110ae89721d"
    },
    {
      "author": null,
      "description": "A U.N. official says 47 Palestinians were wounded, mostly by gunfire, when crowd overran Gaza aid hub. Ajith Sunghay, head of the U.N. Human Rights Office for the Palestinian territories, said it appeared that Israeli army fire had caused most of the injuries. On Tuesday, crowds of Palestinians overwhelmed a new aid distribution hub set up by an Israeli and U.S.-backed foundation. The crowd broke through fences and an Associated Press journalist heard Israeli tank and gun fire, and saw a military helicopter firing flares. The distribution hub outside Gaza’s southernmost city of Rafah was opened the day before by the Gaza Humanitarian Foundation, which has been slated by Israel to take over aid operations.",
      "publishedAt": "2025-05-28T06:59:43Z",
      "title": "UN official says 47 were wounded, mostly by gunfire, when crowd overran aid hub in Gaza",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-hostages-aid-05-28-2025-d4fdbe80de0ac3edd24cf17227c0e3c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/bbee8a1/2147483647/strip/true/crop/7716x4340+0+402/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F98%2F8a%2F6eaa81bf01237452eaaef2ae4a52%2F326322584baa4389ba0d13c38952f823"
    },
    {
      "author": "Samy Magdy, Bassem Mroue",
      "description": "Israeli Prime Minister Benjamin Netanyahu says the man believed to be the head of Hamas’ armed wing, Mohammed Sinwar, has been killed, apparently confirming his death in a recent strike in the Gaza Strip. There was no confirmation from Hamas. Sinwar is the younger brother of Yahya Sinwar, the Hamas leader who helped mastermind the Oct. 7, 2023, attack that started the Israel-Hamas war. He was killed by Israeli forces in October 2024. Israeli strikes have decimated Hamas’ Gaza leadership during the 19-month war. But the militant group has maintained its rule over the parts of Gaza not seized by Israel and still holds dozens of hostages.",
      "publishedAt": "2025-05-28T15:07:14Z",
      "title": "Who is Mohammed Sinwar, the Hamas leader Israel says it killed?",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-mohammed-sinwar-leader-strike-6bd5f3688636c8bb5bda9dad7ab57b7f",
      "urlToImage": "https://dims.apnews.com/dims4/default/faa9647/2147483647/strip/true/crop/6240x3510+0+325/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2F8c%2Fc4ec7a526b16c1e600ea8b218b84%2F05c12a4b1e1144c2a7c33b3b295245f8"
    },
    {
      "author": "Jeff Martin, Safiyah Riddle, Andrew DeMillo",
      "description": "There are plenty of hideouts in the rugged terrain of the Ozark Mountains where searchers are hunting for an ex-lawman known as the “Devil in the Ozarks.” Others are not only off the grid but beneath it, in the hundreds of caves that lead to vast subterranean spaces. A spokesman for the Arkansas Department of Corrections says caves in the area have been a priority for searchers. He said they present one of multiple challenges for authorities searching for Hardin. He escaped Sunday from the North Central Unit — a medium-security prison also known as the Calico Rock prison — by impersonating a corrections officer.",
      "publishedAt": "2025-05-28T20:46:03Z",
      "title": "Caves, other hideouts in mountains are part of hunt for fugitive known as 'Devil in the Ozarks'",
      "url": "https://apnews.com/article/arkansas-prison-escape-police-chief-grant-hardin-441d37501f2ab0de8af27501546dfb13",
      "urlToImage": "https://dims.apnews.com/dims4/default/1a4081e/2147483647/strip/true/crop/2736x1539+0+671/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F94%2Fc4caf5e0c6d0fe7c2e4d6a2687e6%2F9a809d998a6a4748ab10af715f88f542"
    },
    {
      "author": "Michael R. Sisak, Larry Neumeister",
      "description": "A federal judge has immediately rejected a defense request for a mistrial at the sex trafficking trial of music mogul Sean “Diddy” Combs. This was the first such request at Combs’ trial, which is in its third week of testimony in Manhattan. A defense lawyer said Wednesday that prosecutors posed questions to a Los Angeles Fire Department investigator which could imply to the jury that Combs interfered in the probe of another rapper's firebombed luxury car. After a break, the judge instructed the jury to disregard questions related to destroyed fingerprint cards. Combs has pleaded not guilty to leading a racketeering conspiracy that relied on fear and violence to get what he wanted.",
      "publishedAt": "2025-05-28T17:23:58Z",
      "title": "Judge quickly rejects mistrial request at Sean 'Diddy' Combs trial",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-kid-cuddi-9c419869ad6d18e71fdb22841684088a",
      "urlToImage": "https://dims.apnews.com/dims4/default/ae00258/2147483647/strip/true/crop/1879x1057+0+94/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbe%2Fd5%2F7af57f8c87679d031e2680d30d86%2F249bea85eb6f449ba3e66eae1f3f6dbb"
    },
    {
      "author": "Stefanie Dazio",
      "description": "Ukrainian President Zelenskyy will visit Berlin to meet with new German Chancellor Friedrich Merz. The talks on Wednesday come amid an escalation in Russia’s bombing campaign despite U.S.-led attempts at peace talks. Germany has been the second-biggest supplier of military aid to Ukraine after the United States. Zelenskyy’s visit on Wednesday comes two days after Merz said his country and other major allies are no longer imposing any range restrictions on weapons supplied to Ukraine as it fights the Russian invasion. Russian forces launched an attack overnight on Ukraine using five Iskander ballistic missiles, one guided air-launched missile and 88 drones.",
      "publishedAt": "2025-05-28T07:31:44Z",
      "title": "Zelenskyy visits Berlin as he seeks more support for Ukraine in the war against Russia",
      "url": "https://apnews.com/article/russia-ukraine-war-germany-zelenskyy-merz-35c583e769bfd89eed738125802637ad",
      "urlToImage": "https://dims.apnews.com/dims4/default/829835a/2147483647/strip/true/crop/5329x2998+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fa3%2F20e193887e906c968ccb0854af34%2F195290eadef14d819bd2077b3ddb36b5"
    },
    {
      "author": null,
      "description": "British prosecutors say influencer brothers Andrew and Tristan Tate have been charged with rape and other crimes. Andrew Tate, 38, faces charges related to three women that include rape, actual bodily harm, human trafficking and controlling prostitution for gain. Tristan Tate, 36, faces charges related to one woman that include rape, human trafficking and actual bodily harm.",
      "publishedAt": "2025-05-28T16:35:31Z",
      "title": "Tate brothers face rape and trafficking charges in the UK",
      "url": "https://apnews.com/article/tate-brothers-andrew-tristan-rape-uk-britain-085cf07c394f4ead035b86f981060e92",
      "urlToImage": "https://dims.apnews.com/dims4/default/5a746d1/2147483647/strip/true/crop/6259x3521+0+326/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc6%2Fe8%2F62e738d5221be0a7110517fbb4fc%2F18148513c8cb43959b416e44322d38a1"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}