{
  "articles": [
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — The chief prosecutor of the world's top war crimes court sought arrest warrants Monday for leaders of Israel and Hamas, including Israeli Prime Minister Benjamin Netanyahu, over actions taken during their seven-month war.",
      "publishedAt": "2024-05-20T11:16:12Z",
      "title": "War crimes prosecutor seeks arrest of Israeli and Hamas leaders, including Netanyahu",
      "url": "https://apnews.com/070941d21ccd1f2b9611032b88527575",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4dc347ff4172451c8abee9a5e010c60f/1920.jpeg"
    },
    {
      "author": "JOSEPH KRAUSS",
      "description": "JERUSALEM (AP) — The death of Iran's president is unlikely to lead to any immediate changes in Iran's ruling system or to its overarching policies, which are decided by Supreme Leader Ayatollah Ali Khamenei.",
      "publishedAt": "2024-05-20T17:29:30Z",
      "title": "What's next for Iran's government after death of its president in helicopter crash?",
      "url": "https://apnews.com/6d3b970bce0c6d436b25b550d887ceaf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1ceb8d66cf145a08257591756f41a0e/3000.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK, JAKE OFFENHARTZ, JENNIFER PELTZ and COLLEEN LONG",
      "description": "NEW YORK (AP) — A defense witness in Donald Trump's hush money case whom the judge threatened to remove from the trial over his behavior will return to the stand Tuesday as the trial nears its end.",
      "publishedAt": "2024-05-21T04:06:57Z",
      "title": "Defense witness who angered judge in Trump's hush money trial will return to the stand",
      "url": "https://apnews.com/b1beb56a666c398ae5393ede16c326da",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/826f2ce8a19140c7b801f2e5d10cf110/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI and LISA MASCARO",
      "description": "WASHINGTON (AP) — In the hours after the attack on the U.S. Capitol on Jan. 6, 2021, Ohio’s then-Republican senator, Rob Portman, voted to accept President Joe Biden’s win over the defeated former president, Donald Trump, despite Trump’s false allegations that Biden only won because of fraud.",
      "publishedAt": "2024-05-21T04:01:28Z",
      "title": "Election deniers moving closer to GOP mainstream, report shows, as Trump allies fill Congress",
      "url": "https://apnews.com/460cde281d48e62e09e24c7573d6a9ff",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/24eb1a23d5d74e3e829b41a7b9309c30/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "AUSTIN, Texas (AP) — A federal judge has blocked the Biden administration from enforcing a new rule in Texas that would require firearms dealers to run background checks on buyers at gun shows or other places outside brick-and-mortar stores.",
      "publishedAt": "2024-05-20T22:34:31Z",
      "title": "Judge blocks Biden administration from enforcing new gun sales background check rule in Texas",
      "url": "https://apnews.com/853a0d6ac2df15f28ef45560f86ce1db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61be597016e24d3d89e931723011fed6/3000.jpeg"
    },
    {
      "author": null,
      "description": "SYDNEY (AP) — The Australian and New Zealand governments announced Tuesday they were sending planes to evacuate their nationals from violence-wracked New Caledonia.",
      "publishedAt": "2024-05-21T01:16:00Z",
      "title": "Australia and New Zealand sending planes to evacuate nationals from New Caledonia's unrest",
      "url": "https://apnews.com/8fb1ad85f675720ed77c03b718533bd2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b88af04b7ce745a3b09a5001988f37cb/2071.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "ABOARD THE THIRUKKURAL EXPRESS, India (AP) — The 1,800-mile (2,900-kilometer) journey south from New Delhi to Kanyakumari is one of the longest train rides in India, passing through cities, villages, scrub forests and deep ravines.",
      "publishedAt": "2024-05-21T04:23:25Z",
      "title": "Indian voters dissect Modi's politics while traversing the country by train",
      "url": "https://apnews.com/bc24fc9d405eb3bc50af63686fe06adc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e727c41b90749778d59f37aff8e28dd/3000.jpeg"
    },
    {
      "author": "HUIZHONG WU and HAN GUAN NG",
      "description": "JINAN, China (AP) — Shi Mei and her husband earn a decent enough living by growing corn and millet on their small farm in eastern China's Shandong province. In 2021, they diversified by investing in solar energy — signing a contract to mount some 40 panels on their roof to feed energy to the grid.",
      "publishedAt": "2024-05-21T01:10:01Z",
      "title": "Corn, millet and ... rooftop solar? Farm family’s newest crop shows China’s solar ascendancy",
      "url": "https://apnews.com/34ec874e5b0ac1b3e370f928337ae752",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a586171fa3784a4cb52ec21ba2543488/3000.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Those who want to climb one of the most popular trails on Japan's iconic Mount Fuji will have to book a slot and pay a fee as crowds, littering and climbers who try to rush too fast to the summit cause safety and conservation concerns at the picturesque stratovolcano.",
      "publishedAt": "2024-05-20T14:35:17Z",
      "title": "Climbing limits are being set on Mount Fuji to fight crowds and littering",
      "url": "https://apnews.com/6ab73fc69b37d35359f6abf1eaeda90e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b9a412914237438a879101e2410a0f2b/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — OpenAI on Monday said it plans to halt the use of one of its ChatGPT voices that “Her” actor Scarlett Johansson says sounds “eerily similar\" to her own.In a post on the social media platform X, OpenAI said it is “working to pause” Sky — the name of one of five voices that ChatGPT users can chose to speak with.",
      "publishedAt": "2024-05-20T17:44:57Z",
      "title": "Scarlett Johansson says a ChatGPT voice is 'eerily similar' to hers and OpenAI is halting its use",
      "url": "https://apnews.com/532c849ccae3ca9e9325dacfe88e0436",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/da4b632b21f54091abbfa4b758cbbf73/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}