{
  "articles": [
    {
      "author": "SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris, a daughter of immigrants who rose through the California political and law enforcement ranks to become the first female vice president in U.S.",
      "publishedAt": "2024-08-05T16:43:49Z",
      "title": "Kamala Harris is now Democratic presidential nominee, will face off against Donald Trump this fall",
      "url": "https://apnews.com/eb43b6b346cc644b2d195315cb2bfb20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ff0729a750846adbe3c911b8fc109a5/1920.jpeg"
    },
    {
      "author": "JEFF MARTIN and CHRISTOPHER O'MEARA",
      "description": "HORSESHOE BEACH, Fla. (AP) — Tropical Storm Debby moved menacingly into some of America’s most historic Southern cities and was expected to bring prolonged downpours and flooding throughout the day Tuesday after slamming into Florida and prompting the rescue of hundreds from flooded homes.",
      "publishedAt": "2024-08-06T04:08:29Z",
      "title": "Slow-moving Tropical Storm Debby bringing torrential rains, major flood threat to southeastern US",
      "url": "https://apnews.com/211c7968e905576455d10d3706d04193",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/add7a438916a4d6599135040896d93fb/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Israeli fire during military raids in the occupied West Bank killed eight Palestinians, including four teenagers, and wounded another seven, Palestinian officials said Tuesday, as world leaders try to stop tensions in the Middle East from boiling over into a regional war.",
      "publishedAt": "2024-08-06T06:13:43Z",
      "title": "Israel-Hamas war latest: Palestinians killed in West Bank as world leaders try to avoid regional war",
      "url": "https://apnews.com/aa6cf7758a661d86c6da9ec2978f1b6a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee7d435500dd4cf58ee2e02740ae3a2f/3000.jpeg"
    },
    {
      "author": "JULHAS ALAM",
      "description": "DHAKA, Bangladesh (AP) — Bangladesh’s president dissolved parliament Tuesday, clearing the way for new elections to replace the longtime prime minister who resigned and fled the country following weeks of demonstrations against her rule that descended into violent unrest.",
      "publishedAt": "2024-08-06T04:25:51Z",
      "title": "Bangladesh’s president dissolves parliament, clearing the way for elections to replace ousted leader",
      "url": "https://apnews.com/bca66e8251f86deb3fe28c913d0a1444",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/108a08517354402e8f510b4237466b1d/1920.jpeg"
    },
    {
      "author": "ELAINE KURTENBACH",
      "description": "BANGKOK (AP) — Japan’s benchmark Nikkei 225 index soared more than 10% on Tuesday, rebounding after a rollercoaster start to the week that sent markets tumbling in Europe and on Wall Street. European markets were mostly lower, with Germany's DAX down 0.4% at 17,277.27 and the CAC 40 in Paris 0.7% lower, at 7,098.89.",
      "publishedAt": "2024-08-06T02:13:40Z",
      "title": "Japan's Nikkei 225 soars 10% and other world markets are mixed after the week's rollercoaster start",
      "url": "https://apnews.com/79deff7e82224b37c77ee8867c10a953",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5a53679c36b24988ac9d9215bdf29d86/1920.jpeg"
    },
    {
      "author": "KYLE HIGHTOWER",
      "description": "PARIS (AP) — Franz Wagner scored 18 points and Germany overcame a sluggish start to beat Greece 76-63 on Tuesday and advance to the Olympics semifinals for the first time. Dennis Schroder added 13 points and eight assists for the reigning World Cup champions, who will face the winner of France and Canada on Thursday.",
      "publishedAt": "2024-08-06T10:54:22Z",
      "title": "Strong second half lifts Germany over Greece 76-63 for first berth in Olympics semifinals",
      "url": "https://apnews.com/203f8e9646daab5ac0fc8c69b61e0c66",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/daf83d784bd4458eb3139ad2c4f29e72/3000.jpeg"
    },
    {
      "author": "REGINA GARCIA CANO and JOSHUA GOODMAN",
      "description": "CARACAS, Venezuela (AP) — Venezuela’s top prosecutor on Monday announced a criminal investigation against the opposition’s presidential candidate Edmundo González and its leader Maria Corina Machado over their call on the armed forces to abandon their support for President Nicolás Maduro and to stop repressing demonstrators.",
      "publishedAt": "2024-08-05T20:03:54Z",
      "title": "Venezuela's top prosecutor announces criminal probe against opposition leaders González, Machado",
      "url": "https://apnews.com/763defac84e8234ff36e0dc6182efdf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa85a16f6ee74630ac9468b64b61e17e/1920.jpeg"
    },
    {
      "author": "DAVID KOENIG",
      "description": "Investigators will question Boeing officials during a hearing starting Tuesday about the midflight blowout of a panel from a 737 Max, an accident that further tarnished the company's safety reputation and left it facing new legal jeopardy.",
      "publishedAt": "2024-08-06T04:01:32Z",
      "title": "Witnesses will tell a federal safety board about the blowout on a Boeing 737 Max earlier this year",
      "url": "https://apnews.com/22059af5e451a0f1047c955e1dcc9a5e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/749cbd195dfb4b02aeeb0b04f5bd57ec/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — Nancy Pelosi thought briefly she might have died on Jan. 6, 2021.Not quite two years later, the threat of political violence would come for her husband at their home.",
      "publishedAt": "2024-08-06T04:03:41Z",
      "title": "Pelosi warns in her new book that political threats and violence 'must stop'",
      "url": "https://apnews.com/d785099803ea7929c85441f06635ba48",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6dc7700eb9e645c182c88a0c1a8f0418/3000.jpeg"
    },
    {
      "author": "KEMO CHAM",
      "description": "FREETOWN, Sierra Leone (AP) — Abdul Jalloh was the only practicing psychiatrist in Sierra Leone when he took over the country’s sole psychiatric hospital on the outskirts of the capital. Now six years later, the young doctor is leading a transformation of mental health services in the West African nation.",
      "publishedAt": "2024-08-06T05:56:04Z",
      "title": "Sierra Leone not long ago still chained mental health patients. A transformation is underway",
      "url": "https://apnews.com/388663332542966cdf0b2b333e15d2bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/571e9abbe0a94c25a119c162c6f1c1b6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}