{
  "articles": [
    {
      "author": "TARA COPP, MELANIE LIDMAN and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — U.S. Defense Secretary Lloyd Austin was expected to press Israel to wind down major combat operations in Gaza on a visit Monday, in the latest test of whether the U.S.",
      "publishedAt": "2023-12-18T07:59:44Z",
      "title": "In Israel, the US defense secretary is expected to press for a more targeted approach in Gaza",
      "url": "https://apnews.com/c094153a62262f8c8e56ef13f98f528f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0ca2348661144405bce8421c095e8f2e/1920.jpeg"
    },
    {
      "author": "TIA GOLDENBERG",
      "description": "TEL AVIV, Israel (AP) — Israelis were left stunned and speechless when three hostages held by Hamas were killed by Israeli forces in the middle of an active war zone after they waved a white flag and screamed out in Hebrew to show they did not pose a threat.",
      "publishedAt": "2023-12-18T05:03:28Z",
      "title": "In Israel's killing of 3 hostages, some see the same excessive force directed at Palestinians",
      "url": "https://apnews.com/52fa9628e6284cdad6d7f7db6cc30742",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6453bd9b91f8438289c7d3cf9948ea96/3000.jpeg"
    },
    {
      "author": "LISA MASCARO and STEPHEN GROVES",
      "description": "WASHINGTON (AP) — Time slipping, White House and Senate negotiators struggled Sunday to reach a U.S. border security deal that would unlock President Joe Biden’s request for billions of dollars worth of military aid for Ukraine and other national security needs before senators leave town for the holiday recess.",
      "publishedAt": "2023-12-17T20:44:01Z",
      "title": "Senate border security talks grind on as Trump invokes Nazi-era 'blood' rhetoric against immigrants",
      "url": "https://apnews.com/cb8d4e3ad8271323cfd9294b527d6615",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/60b47f8c2c2849429a47ffb753d87a22/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — A gloomy mood hangs over Ukraine's soldiers nearly two years after Russia invaded their country.Despite a disappointing counteroffensive this summer and signs of wavering financial support from allies, Ukrainian soldiers say they remain fiercely determined to win.",
      "publishedAt": "2023-12-18T05:04:05Z",
      "title": "A gloomy mood hangs over Ukraine's soldiers as war with Russia grinds on",
      "url": "https://apnews.com/afb3bc4714b1dca631bd4df6f931bd56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/12cd46fbf7264b60940a11c0bc59b353/3000.jpeg"
    },
    {
      "author": "MICHAEL PHILLIS and CAMILLE FASSETT",
      "description": "ST. LOUIS (AP) — Flooding is driving millions of people to move out of their homes, limiting growth in some prospering communities and accelerating the decline of others, according to a new study that details how climate change and flooding are transforming where Americans live.",
      "publishedAt": "2023-12-18T10:00:24Z",
      "title": "Flooding drives millions to move as climate-driven migration patterns emerge",
      "url": "https://apnews.com/a43c10d60d5c4f0b9fe30e0a7fe024c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4b0eb22680f42deb8b6d2de7e8df6a6/3000.jpeg"
    },
    {
      "author": "JONATHAN J. COOPER and GABE STERN",
      "description": "RENO, Nev. (AP) — Former President Donald Trump called out three of Nevada's fake electors Sunday, saying they're being treated unfairly less than 24 hours before they are scheduled to be arraigned for signing certificates falsely stating Trump won the state in 2020.",
      "publishedAt": "2023-12-18T01:56:11Z",
      "title": "Trump says Nevada fake electors treated 'unfairly' during rally in Reno",
      "url": "https://apnews.com/373626355a3233c8c18e3a833cfc67b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e37604c524b948d59edf65dd84b79773/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — A new study adds to evidence that severe obesity is becoming more common in young U.S. children.There was some hope that children in a government food program might be bucking a trend in obesity rates — earlier research found rates were dropping a little about a decade ago for those kids.",
      "publishedAt": "2023-12-18T05:01:25Z",
      "title": "Study bolsters evidence that severe obesity increasing in young US kids",
      "url": "https://apnews.com/34d16c4851c93fc99e2fc3adae891fe8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3bb814c0c5044fba9d3338f9cd06b4a/3000.jpeg"
    },
    {
      "author": null,
      "description": "GEORGETOWN, S.C. (AP) — An intense late-year storm barreled up the East Coast on Sunday with heavy rains and strong winds that shattered rainfall records, forced water rescues from flooded streets and washed out holiday celebrations.",
      "publishedAt": "2023-12-17T16:00:05Z",
      "title": "Storm drenches Florida and causes floods in South Carolina as it moves up East Coast",
      "url": "https://apnews.com/d4a101d38d4cf2c9d0e11f4e55b63232",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a24bc06ccef441cebd890b7305721126/3000.jpeg"
    },
    {
      "author": "JOVANA GEC",
      "description": "BELGRADE, Serbia (AP) — An early official vote count of Serbia's weekend election on Monday confirmed victory for the ruling populist party in a parliamentary vote in the Balkan country, but political tensions rose over reported irregularities in the capital, Belgrade.",
      "publishedAt": "2023-12-18T10:05:41Z",
      "title": "Near-final results confirm populist victory in Serbia while the opposition claims fraud",
      "url": "https://apnews.com/068394fc25eadfbeb38402b34b10fd71",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9af76c337194bdeb9c2f11042422d85/3000.jpeg"
    },
    {
      "author": "DUSAN STOJANOVIC",
      "description": "BELGRADE, Serbia (AP) — Serbia’s governing populists claimed a sweeping victory Sunday in the country's parliamentary election, which was marred by reports of major irregularities both during a tense campaign and on voting day.",
      "publishedAt": "2023-12-17T08:02:59Z",
      "title": "Serbia's populists claim a sweeping victory in the country's parliamentary election",
      "url": "https://apnews.com/da06f811adb3e9093bba6b64af3299d9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9af76c337194bdeb9c2f11042422d85/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}