{
  "articles": [
    {
      "author": "WAFAA SHURAFA and BASSEM MROUE",
      "description": "RAFAH, Gaza Strip (AP) — Israeli forces stormed the main hospital in southern Gaza on Thursday, hours after Israeli fire killed a patient and wounded six others inside the complex. The Israeli army said it was a limited operation seeking the remains of hostages taken by Hamas.",
      "publishedAt": "2024-02-15T07:37:11Z",
      "title": "Israeli forces storm main hospital in southern Gaza after prolonged standoff and partial evacuation",
      "url": "https://apnews.com/d3a25caf6b60fe560e1a31d4f8f6b45e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b53616a1c65942299f64184f1a1f7cae/3000.jpeg"
    },
    {
      "author": "MOHAMMED ZAATARI and BASSEM MROUE",
      "description": "NABATIYEH, Lebanon (AP) — The civilian death toll from two Israeli airstrikes in Lebanon has risen to 10, Lebanese state media reported Thursday, making the previous day the deadliest in more than four months of cross-border exchanges.",
      "publishedAt": "2024-02-15T07:29:04Z",
      "title": "Israeli airstrikes killed 10 Lebanese civilians in a single day. Hezbollah has vowed to retaliate",
      "url": "https://apnews.com/294288635bb489fdefd8d36978651554",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/266c0d39880d4811b8b650442ece46f7/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH and NICK INGRAM",
      "description": "KANSAS CITY, Mo. (AP) — A historic railway station on the edge of downtown Kansas City became the latest backdrop for a mass shooting as gunfire near the end of the Kansas City Chiefs' Super Bowl celebration sent terrified fans scrambling for cover and left 21 people wounded — including at least eight children — and a mother of two dead.",
      "publishedAt": "2024-02-15T05:31:18Z",
      "title": "Gunfire at Chiefs' Super Bowl celebration kills 1 and wounds nearly two-dozen, including children",
      "url": "https://apnews.com/62e69a17b469b854afd7bcc3f548d1fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fb277fcbe5d7411f9297c9fa28707fb7/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — Donald Trump is expected to be back in a New York court Thursday for a hearing that could decide whether the former president's first criminal trial begins in just 39 days.",
      "publishedAt": "2024-02-15T05:02:37Z",
      "title": "Will Donald Trump go on trial next month in New York criminal case? Judge expected to rule Thursday",
      "url": "https://apnews.com/fbdff18df40920b75873b3a40317f5ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5850a23ea3fc4cfe924df1abb30b6401/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The Senate's border proposal was one of the toughest bipartisan bills to emerge on the issue in decades. Yet it quickly collapsed when Republicans — galvanized by Donald Trump, the likely Republican presidential nominee — rejected the compromise as insufficient.",
      "publishedAt": "2024-02-15T05:10:23Z",
      "title": "Democrats embrace tougher border enforcement, seeing Trump's demolition of deal as a 'gift'",
      "url": "https://apnews.com/57f62a34ce9c4c08d6e00795fcb24764",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/62ddb63e35e749118459c1ad5155d50c/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — The former mother-in-law of the woman who opened fire at a Houston megachurch tried for years to alert authorities and others, including church staff, about her ex-daughter-in-law’s mental health struggles, she said Wednesday.",
      "publishedAt": "2024-02-15T05:42:06Z",
      "title": "Warning signs mounted before Texas shooter entered church with her son, former mother-in-law says",
      "url": "https://apnews.com/04b6f9c340517ae82f3c075afb1df570",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f75eec009824b94a9c84cb80a6ee9b5/3000.jpeg"
    },
    {
      "author": "BERNAT ARMANGUE and TARA COPP",
      "description": "ABOARD THE USS DWIGHT D. EISENHOWER (AP) — Sailors aboard the aircraft carrier USS Dwight D. Eisenhower and its accompanying warships have spent four months straight at sea defending against ballistic missiles and flying attack drones fired by Iranian-backed Houthis, and are now more regularly also defending against a new threat — fast unmanned vessels that are fired at them through the water.",
      "publishedAt": "2024-02-15T05:54:04Z",
      "title": "On the USS Eisenhower, 4 months of combat at sea facing Houthi missiles and a new sea threat",
      "url": "https://apnews.com/ad3a711299759de23627f6daa17f45d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85d58cdcd1e34a14af08fdefcefde2a6/3000.jpeg"
    },
    {
      "author": "VICTORIA MILKO",
      "description": "JAKARTA, Indonesia (AP) — A wealthy ex-general with ties to both Indonesia's popular outgoing president and its dictatorial past looks set to be its next leader.",
      "publishedAt": "2024-02-15T07:00:48Z",
      "title": "Who is Prabowo Subianto, the former general who's Indonesia's next president?",
      "url": "https://apnews.com/dfd2cf2d8f25629d3f2dcb96fa7621a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3f330cdcf824feb9a12006ec8cc5f87/3000.jpeg"
    },
    {
      "author": "NICHOLAS PAPHITIS",
      "description": "ATHENS, Greece (AP) — Greece’s parliament is to vote Thursday to legalize same-sex civil marriage in a first for an Orthodox Christian country and despite opposition from the influential Greek Church.",
      "publishedAt": "2024-02-15T05:06:12Z",
      "title": "Greek parliament to vote on legalizing same-sex marriage in first for an Orthodox Christian country",
      "url": "https://apnews.com/5be190dd6a7628d7a057be683256b8c2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b98ab44300242f69fc4610f3ce83bdd/3000.jpeg"
    },
    {
      "author": "YURI KAGEYAMA",
      "description": "TOKYO (AP) — Japan’s economy is now the world’s fourth-largest after it contracted in the last quarter of 2023 and fell behind Germany. The government reported the economy shrank at an annual rate of 0.4% in October to December, according to Cabinet Office data on real GDP released Thursday, though it grew 1.9% for all of 2023.",
      "publishedAt": "2024-02-15T01:10:56Z",
      "title": "Japan slips into a recession and loses its spot as the world's third-largest economy",
      "url": "https://apnews.com/893d53deba654c4924e4924f0b321cc5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ec72ab0073734ec38ab25014390706b6/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}