{
  "articles": [
    {
      "author": "MICHAEL KUNZELMAN and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — Two former leaders of the far-right Proud Boys extremist group were sentenced to more than a decade each in prison Thursday for spearheading an attack on the U.S.",
      "publishedAt": "2023-08-31T16:43:02Z",
      "title": "Two ex-Proud Boys leaders get some of longest sentences in Jan. 6 Capitol attack",
      "url": "https://apnews.com/5c8bf8a8e5dc6381e7387e31e554cee6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fe453f688b0146d8a1c60d9667c7f27c/2446.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Supreme Court Justice Clarence Thomas acknowledged Thursday that he took three trips last year aboard a private plane owned by Republican megadonor Harlan Crow even as he rejected criticism over his failure to report trips in previous years.",
      "publishedAt": "2023-08-31T14:35:19Z",
      "title": "Justice Clarence Thomas reports he took 3 trips on Republican donor's plane last year",
      "url": "https://apnews.com/08ec6e88a7c29c55c9d3991903ca0db7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e80ecd78a03848fc8490d3242ab91352/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK",
      "description": "NEW YORK (AP) — In newly public testimony, Donald Trump boasts about building a multibillion-dollar brand and saving “millions of lives” as president.",
      "publishedAt": "2023-08-31T23:23:43Z",
      "title": "A look inside Donald Trump's deposition: Defiance, deflection and the 'hottest brand in the world'",
      "url": "https://apnews.com/63f4708b27a52a1e544e3caa6f63fa3b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a941ecb0c564468dac9c1d21695c4b61/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST and CHRISTINA A. CASSIDY",
      "description": "WASHINGTON (AP) — More than a dozen people nationally have been charged with threatening election workers by a Justice Department unit trying to stem the tide of violent and graphic threats against people who count and secure the vote.",
      "publishedAt": "2023-08-31T15:54:19Z",
      "title": "Election workers have gotten death threats and warnings they will be lynched, the US government says",
      "url": "https://apnews.com/f17df44d63156a28eaa0862b0aa08f0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17dc7e6ad6a24d6bb0113d78c6d25115/3000.jpeg"
    },
    {
      "author": "REBECCA BLACKWELL and LAURA BARGFELD",
      "description": "HORSESHOE BEACH, Fla. (AP) — Florida and Georgia residents living along Hurricane Idalia's path of destruction on Thursday picked through piles of rubble where homes once stood, threw tarps over ripped-apart roofs and gingerly navigated streets left underwater or clogged with fallen trees and dangerous electric wires.",
      "publishedAt": "2023-08-31T05:54:09Z",
      "title": "Residents pick through the rubble of lost homes and scattered belongings in Hurricane Idalia's wake",
      "url": "https://apnews.com/6fcf457b3c1da43c208730bb998cdd0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/354eb1cf48a1451b89d781da3a8ed899/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The news lit up the world of weed: U.S. health regulators are suggesting that the federal government loosen restrictions on marijuana.",
      "publishedAt": "2023-08-31T22:48:45Z",
      "title": "US regulators might change how they classify marijuana. Here's what that would mean",
      "url": "https://apnews.com/b0b5fc3d34a83d2c95db1665f8149d42",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8030e816db5c4ae1bca4bd01263c9319/3000.jpeg"
    },
    {
      "author": "JIM VERTUNO",
      "description": "AUSTIN, Texas (AP) — The Texas Supreme Court allowed a new state law banning gender-affirming care for minors to take effect on Friday, setting up Texas to be the most populous state with such restrictions on transgender children.",
      "publishedAt": "2023-08-31T17:08:50Z",
      "title": "Texas high court allows law banning gender-affirming care for transgender minors to take effect",
      "url": "https://apnews.com/302e7a15c0442ce3eee6aacdcdf02b80",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d265531b4194d67917b21ed8756f1d8/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD and SARUUL ENKHBOLD",
      "description": "ULAANBAATAR, Mongolia (AP) — Pope Francis arrived in Mongolia on Friday morning on a visit to encourage one of the world’s smallest and newest Catholic communities. It's the first time a pope has visited the landlocked Asian country and comes at a time when the Vatican’s relations with Mongolia’s two powerful neighbors, Russia and China, are once again strained.",
      "publishedAt": "2023-08-31T16:43:22Z",
      "title": "Pope arrives on first visit to Mongolia as Vatican relations with Russia and China remain strained",
      "url": "https://apnews.com/605975020cf2e4979d1387e8b4616e53",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3453c22834f1462a8fb6e78bfb4161cd/2892.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Biden administration is proposing a rule that would require thousands more firearms dealers to run background checks, in an effort to combat rising gun violence nationwide.",
      "publishedAt": "2023-08-31T17:28:47Z",
      "title": "Biden administration proposes rule that would require more firearms dealers to run background checks",
      "url": "https://apnews.com/d53441dc0242c515b6b1478ab27a5dac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d4a3250cf5e41988b7d6ec9ad5a9d4e/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — A pair of spinoffs of “The Walking Dead” and the next season of “Interview With the Vampire” can resume production despite the ongoing Hollywood strikes after reaching an agreement with the actors' union.",
      "publishedAt": "2023-09-01T00:16:07Z",
      "title": "'Walking Dead' spinoffs, 'Interview With the Vampire' can resume with actors' union approval",
      "url": "https://apnews.com/6bed4fac1135c2e21b8c8359f2d4ce99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/11d6ddaaaa8b402ab05503de1e39fd92/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}