{
  "articles": [
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — The 2024 election will determine whether Donald Trump returns to the White House. It could also decide if he’ll face time behind bars.",
      "publishedAt": "2023-08-02T21:36:11Z",
      "title": "Should Trump go to jail? The 2024 election could become a referendum on that question",
      "url": "https://apnews.com/8677e1b31bbf3a29ee16fbf115c851a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f80bb8fa388c43c2ab144369c092c023/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "Human-caused global warming made July hotter for four out of five people on Earth, with more than 2 billion people feeling climate change-boosted warmth daily, according to a flash study.",
      "publishedAt": "2023-08-02T10:10:48Z",
      "title": "Climate change made July hotter for 4 of 5 humans on Earth, scientists find",
      "url": "https://apnews.com/3d7d0ee31e022aab535adf57b54618ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f4b8bc19d9c34a619021a99052f84b81/3000.jpeg"
    },
    {
      "author": "PETER SMITH and MICHAEL RUBINKAM",
      "description": "PITTSBURGH (AP) — The gunman who stormed a synagogue in the heart of Pittsburgh’s Jewish community and killed 11 worshippers will be sentenced to death for perpetrating the deadliest antisemitic attack in U.S.",
      "publishedAt": "2023-08-02T13:16:17Z",
      "title": "Pittsburgh synagogue gunman will be sentenced to death for the nation’s deadliest antisemitic attack",
      "url": "https://apnews.com/27e3b1a505cacdd674ee9b8a179aa1a8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8553bba786034ea39653cc5d35b97c82/1920.jpeg"
    },
    {
      "author": "NICOLE WINFIELD, HELENA ALVES and BARRY HATTON",
      "description": "LISBON, Portugal (AP) — Pope Francis met with survivors of clergy sexual abuse in Portugal on Wednesday and blasted members of the country’s Catholic hierarchy for their response to the long-ignored scandal, which he said had marred the Catholic Church and helped drive the faithful away.",
      "publishedAt": "2023-08-02T03:35:32Z",
      "title": "Pope Francis blasts 'scandal' of clergy sex abuse in Portugal and meets with survivors",
      "url": "https://apnews.com/4db3ac2405da84abb9beced2b1f8b7c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5023446a0a54e6c8cd6880fce4a6693/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON and CLAIRE RUSH",
      "description": "PORTLAND, Ore. (AP) — A man who posed as an undercover police officer kidnapped a woman in Seattle, drove her hundreds of miles to his home in Oregon and locked her in a cinder block cell until she bloodied her hands breaking the door to escape, the FBI said Wednesday.",
      "publishedAt": "2023-08-02T17:29:35Z",
      "title": "FBI looks for more possible victims after woman escapes from cinder block cell in Oregon",
      "url": "https://apnews.com/b4ad69d3b356156a8d25c723ffcea442",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de1625b7bec44f9a8499a907128ca256/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "NIAMEY, Niger (AP) — Niger's new military ruler lashed out at neighboring countries and the international community in a nationally televised speech Wednesday night, and he called on the population to be ready to defend the nation.",
      "publishedAt": "2023-08-02T07:52:19Z",
      "title": "Niger's military ruler warns against foreign meddling, urges population to defend the country",
      "url": "https://apnews.com/ca8ad99410a2f0e04a6a361595e4c768",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2769ec57574948a3b872d07218bd6f89/2809.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — Russian drones on Wednesday hit a Ukrainian port city along the border with Romania, causing significant damage and a huge fire at facilities that are key to Ukrainian grain exports.",
      "publishedAt": "2023-08-02T06:29:59Z",
      "title": "Russian drone strikes hit a Ukrainian port on Romania's border that is key to grain exports",
      "url": "https://apnews.com/8b20147a55f29a0c0bc465b59274357e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d05f285f10434f8e9bce6c33d49dd5a9/3000.jpeg"
    },
    {
      "author": "MARC LEVY",
      "description": "HARRISBURG, Pa. (AP) — Rhonda Hicks could have kept working into her 60s. She loved teaching and loved her students in Philadelphia’s public schools. As a Black woman, she took pride in being a role model for many children of color.",
      "publishedAt": "2023-08-02T04:06:06Z",
      "title": "Burnout, low pay and politics are driving away teachers. Turnover is soaring for educators of color",
      "url": "https://apnews.com/b0c39ec0d4320e12f2767a342e503f85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5e57956186d34032ab590a39b61678b1/3000.jpeg"
    },
    {
      "author": "DAVID HAMILTON",
      "description": "SAN FRANCISCO (AP) — Get ready to say goodbye to the once ubiquitous incandescent light bulb, pioneered by Thomas Edison more than a century ago. You can thank — or blame — new federal energy efficiency regulations that went into full effect Tuesday.",
      "publishedAt": "2023-08-02T13:12:48Z",
      "title": "Prepare to flick off your incandescent bulbs for good under new US rules that kicked in this week",
      "url": "https://apnews.com/950ca7bd90453a5bde277f3002e67d83",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5faf18bf70246128f412f2b3465eff4/3000.jpeg"
    },
    {
      "author": "NOAH TRISTER",
      "description": "The arms race in the AL West began with Lucas Giolito and quickly escalated.After the Los Angeles Angels acquired Giolito and signaled their intentions to make a bid for the postseason, division rivals Texas and Houston answered with some big moves of their own, acquiring Max Scherzer and Justin Verlander before Tuesday's trade deadline.",
      "publishedAt": "2023-08-02T10:00:25Z",
      "title": "MLB trade deadline analysis: AL West leaders loaded up on starting pitchers",
      "url": "https://apnews.com/9882d31d549491b70ddd83b5994a13b1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53fbf6d11c1945c38218aaa06d12b81d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}