{
  "articles": [
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — A divided Colorado Supreme Court on Tuesday declared former President Donald Trump ineligible for the White House under the U.S. Constitution’s insurrection clause and removed him from the state’s presidential primary ballot, setting up a likely showdown in the nation’s highest court to decide whether the front-runner for the GOP nomination can remain in the race.",
      "publishedAt": "2023-12-19T23:16:30Z",
      "title": "Donald Trump banned from Colorado ballot in historic ruling by state's Supreme Court",
      "url": "https://apnews.com/d16dd8f354eeaf450558378c65fd79a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/811169873211483b9336b267bf5b6b3f/1920.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT and ALI SWENSON",
      "description": "WATERLOO, Iowa (AP) — Former President Donald Trump on Tuesday defended his comments about migrants crossing the southern border “poisoning the blood” of America, and he reinforced the message while denying any similarities to fascist writings others had noted.",
      "publishedAt": "2023-12-20T02:03:44Z",
      "title": "Trump defends controversial comments about immigrants poisoning the nation's blood at Iowa rally",
      "url": "https://apnews.com/dff7f632948fa6511fb7d1955a28610c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/85950d13fb734af8982238decd77ca28/3000.jpeg"
    },
    {
      "author": "NAJIB JOBAIN, SAMY MAGDY and JACK JEFFERY",
      "description": "RAFAH, Gaza Strip (AP) — The Israeli army has raided and detained staff at two of the last functioning hospitals in Gaza’s north, where the defense minister said Tuesday that troops were working to completely clear out Hamas militants.",
      "publishedAt": "2023-12-19T08:35:05Z",
      "title": "Israeli airstrikes kill dozens more Palestinians across the Gaza Strip",
      "url": "https://apnews.com/226fdce935f5797ba8abc9ae4ad857cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4277e2192ea240b79ec5ee8a4b886aa5/1920.jpeg"
    },
    {
      "author": "KEN MORITSUGU",
      "description": "BEIJING (AP) — A strong overnight earthquake rattled a mountainous region of northwestern China, authorities said Tuesday, reducing homes to rubble, leaving residents outside in a below-freezing winter night and killing 131 people in the nation’s deadliest quake in nine years.",
      "publishedAt": "2023-12-18T23:43:15Z",
      "title": "An earthquake in northwestern China kills at least 131 people and is the deadliest in 9 years",
      "url": "https://apnews.com/6255dcb3ce03a570f6aaaf565230afb1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1d64d4d3dadf4128a672e41f9373ea41/3000.jpeg"
    },
    {
      "author": "ELLIOT SPAGAT",
      "description": "LUKEVILLE, Ariz. (AP) — Hundreds of dates are written on concrete-filled steel columns erected along the U.S. border with Mexico to memorialize when the Border Patrol has repaired illicit openings in the would-be barriers.",
      "publishedAt": "2023-12-19T05:04:45Z",
      "title": "Illegal crossings surge in remote areas as Congress, White House weigh major asylum limits",
      "url": "https://apnews.com/beddd2ca0ffd02884ce0d0ad1785f538",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/575cb22fdf254898884de184fa3b31de/3000.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "AUSTIN, Texas (AP) — The White House and Mexico's president on Tuesday came out strongly against a new Texas law that would allow police to arrest migrants who illegally cross into the U.S.",
      "publishedAt": "2023-12-19T19:07:06Z",
      "title": "Groups sue over new Texas law that lets police arrest migrants who enter the US illegally",
      "url": "https://apnews.com/2be91001567623db8ad3171265d5e739",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf9b273a27404a18ab3b0f75016cc6ce/3000.jpeg"
    },
    {
      "author": "ILLIA NOVIKOV",
      "description": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy said Tuesday he's certain the United States will make good on its promise to provide billions of dollars in further aid for Kyiv to continue its fight against Russia, and he bluntly replied “No,” to a question about whether his country might lose the war.",
      "publishedAt": "2023-12-19T17:18:56Z",
      "title": "Zelenskyy says he's confident Ukraine will get more U.S. support for its war with Russia",
      "url": "https://apnews.com/5440b3d3034a34461d93d0740e0c1ae6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c9c13381888483590443a7ecfa8c82c/3000.jpeg"
    },
    {
      "author": "MAYSOON KHAN",
      "description": "ALBANY, N.Y. (AP) — New York state will create a commission tasked with considering reparations to address the persistent, harmful effects of slavery in the state, under a bill signed into law by Gov.",
      "publishedAt": "2023-12-19T16:36:57Z",
      "title": "New York will set up a commission to consider reparations for slavery",
      "url": "https://apnews.com/18578dfe233c1faeccfc5213050b52d3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac1c60c18c6a4b1997a4c06bbe046d6f/3000.jpeg"
    },
    {
      "author": "SYLVIA HUI",
      "description": "LONDON (AP) — Scientists anticipated the eruption of a volcano in southwestern Iceland for weeks, so when it happened on Monday night, it was no surprise.",
      "publishedAt": "2023-12-19T15:11:37Z",
      "title": "Will the eruption of the volcano in Iceland affect flights and how serious is it?",
      "url": "https://apnews.com/83b44aeeefde4d6fee49739d47129d6e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/405f00ed901e4d80a19279f620ceea3b/1920.jpeg"
    },
    {
      "author": "ADAM BEAM",
      "description": "SACRAMENTO, Calif. (AP) — When a toilet is flushed in California, the water can end up in a lot of places: An ice skating rink near Disneyland, ski slopes around Lake Tahoe, farmland in the Central Valley.",
      "publishedAt": "2023-12-19T05:10:31Z",
      "title": "Drought-prone California OKs new rules for turning wastewater directly into drinking water",
      "url": "https://apnews.com/8b476dc83652af43c6aad52070b9d992",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e556c5767c494dd68ce9c73301a2723f/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}