{
  "articles": [
    {
      "author": "JACK JEFFERY and JALAL BWAITEL",
      "description": "NUR SHAMS REFUGEE CAMP, West Bank (AP) — An Israeli army raid in April set off a near three-day gunbattle with Palestinian militants. By the time it was over, homes had been blasted to rubble and many residents had fled.",
      "publishedAt": "2024-06-05T04:00:47Z",
      "title": "In a West Bank refugee camp, Israel's raids fuel the militancy it tries to stamp out",
      "url": "https://apnews.com/7b96eaa77fd237d78b323329f04b6317",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3defec4393db45e08c946cc1970c76d0/3000.jpeg"
    },
    {
      "author": "SAM MEDNICK",
      "description": "JERUSALEM, Israel (AP) — An independent group of experts warned Tuesday that it's possible that famine is underway in northern Gaza but that the war between Israel and Hamas and restrictions on humanitarian access have impeded the data collection to prove it.",
      "publishedAt": "2024-06-04T20:53:11Z",
      "title": "Famine is possibly underway in northern Gaza despite recent aid efforts, a new report warns",
      "url": "https://apnews.com/0056ceecdb4ae3bee5f64c54ab034c7e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b510acf762584ff9a94ca4d602c85cdb/1920.jpeg"
    },
    {
      "author": "JILL COLVIN, STEPHEN GROVES and ADRIANA GOMEZ LICON",
      "description": "WASHINGTON (AP) — President Joe Biden tried to address a major liability for his reelection campaign by taking executive action to significantly restrict asylum at the U.S.-Mexico border.",
      "publishedAt": "2024-06-05T04:18:40Z",
      "title": "Will Biden's new border measures be enough to change voters' minds?",
      "url": "https://apnews.com/a2769fae1fb4e6b7899fd191b5864de3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/912796ce379f49c89d169c1e545c5c57/2815.jpeg"
    },
    {
      "author": "CLAUDIA LAUER, RANDALL CHASE, COLLEEN LONG and MICHAEL KUNZELMAN",
      "description": "WILMINGTON, Del. (AP) — Federal prosecutors in Hunter Biden's gun trial have spent hours showing jurors evidence of his drug problem, seeking to reveal through his own words and writing the depth of his addiction in order to show it was still going on when he bought a firearm and, they say, lied on a form to purchase it.",
      "publishedAt": "2024-06-05T04:13:19Z",
      "title": "Hunter Biden's ex-wife, other family members expected to take the stand in his federal gun trial",
      "url": "https://apnews.com/17e671d16f7b06b04b4e3b538f911d07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78c4c624181141f79eb0d46705d08f24/1920.jpeg"
    },
    {
      "author": "ASHOK SHARMA, SHEIKH SAALIQ and KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — India’s Prime Minister Narendra Modi, who claimed victory for his alliance in an election seen as a referendum on his decade in power, is a popular but polarizing leader who has presided over a fast-growing economy while advancing Hindu nationalism.",
      "publishedAt": "2024-06-04T16:35:11Z",
      "title": "India's popular but polarizing leader Narendra Modi is extending his decade in power. Who is he?",
      "url": "https://apnews.com/c3a4102d70c5c72e98b26874e1733279",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/435427e771b842d38bac7e0e88167583/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI, ISABEL DeBRE and DANICA KIRKA",
      "description": "In a community center in East London, about 20 men gathered for their regular lunch meeting, sipping coffee and tea from mismatched mugs and engaging in an increasingly popular pastime in the world’s democracies: Complaining about their government.",
      "publishedAt": "2024-06-05T04:04:35Z",
      "title": "A year of elections in democracies around the world is revealing deep dissatisfaction among voters",
      "url": "https://apnews.com/719d47908aca0b421ff3b9bef33e350c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/91ec5ce8ca9046a69883b14b37995214/3000.jpeg"
    },
    {
      "author": "RAF CASERT",
      "description": "BRUSSELS (AP) — It seemed like a throwaway line by European Commission President Ursula von der Leyen, yet it encapsulated what is at stake for many in this week's European Union parliamentary elections — What to do with the hard right?",
      "publishedAt": "2024-06-05T04:31:54Z",
      "title": "Hard right is set to surge in this week's European Union elections. Center set to tilt to right, too",
      "url": "https://apnews.com/2d75df1909b7d81511bb496cbb7d5383",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d8f8c74de1f44aabab1a452d6f47ecd/3000.jpeg"
    },
    {
      "author": "CHRIS MEGERIAN and ZEKE MILLER",
      "description": "PARIS (AP) — President Joe Biden will mark the 80th anniversary of the D-Day invasion in France this week as he tries to demonstrate steadfast support for European security at a time when some allies fear Republican Donald Trump threatens to upend American commitments if he wins another term in the White House.",
      "publishedAt": "2024-06-05T04:08:37Z",
      "title": "Biden will mark D-Day anniversary in France as Western alliances face threats at home and abroad",
      "url": "https://apnews.com/896f00db3dcb40e2f165bd7ddecd1347",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ea95a44f90d040bcbe30c1fa28736995/3000.jpeg"
    },
    {
      "author": "JOHN LEICESTER",
      "description": "CARENTAN-LES-MARAIS, France (AP) — Shortly after D-Day in 1944, the American soldiers heading out to more fighting against Adolf Hitler's forces couldn't help but notice the hungry French boy by the side of the road, hoping for handouts.",
      "publishedAt": "2024-06-05T04:11:08Z",
      "title": "In France, D-Day evokes both the joys of liberation and the pain of Normandy's 20,000 civilian dead",
      "url": "https://apnews.com/72c0afc51a8a76222e510771a2474563",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c08a70a015ba4d5582fc1ce2afc16e7d/2789.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "The rate Earth is warming hit an all-time high in 2023 with 92% of last year's surprising record-shattering heat caused by humans, top scientists calculated.",
      "publishedAt": "2024-06-04T23:18:38Z",
      "title": "New study finds Earth warming at record rate, but no evidence of climate change accelerating",
      "url": "https://apnews.com/434881547b4585a32fa906cf5495d3f0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7091d9f5a90942b69f3e9d85f2799c34/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}