{
  "articles": [
    {
      "author": "MARK SHERMAN",
      "description": "TikTok says it will have to “go dark” this weekend unless the outgoing Biden administration assures the company it won’t enforce a shutdown of the popular app after the Supreme Court unanimously upheld the federal law banning the app unless it’s sold by its China-based parent company. The court ruled Friday the risk to national security posed by TikTok's ties to China overcomes concerns about limiting speech by the app or its 170 million users in the U.S. The court’s decision means new users won’t be able to download the app and updates won’t be available, but it won’t disappear from users’ phones.",
      "publishedAt": "2025-01-17T15:03:47Z",
      "title": "AI startup Perplexity has proposed a merger with TikTok US, source says",
      "url": "https://apnews.com/article/supreme-court-tiktok-china-security-speech-166f7c794ee587d3385190f893e52777",
      "urlToImage": "https://dims.apnews.com/dims4/default/94a4a39/2147483647/strip/true/crop/4557x2563+0+237/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4c%2Fad%2Fd6d6f88d4609ffd206ec47505172%2Fbd1992778abf4beca8ebd6eff31b5841"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "TikTok arrived in the U.S. almost 6 1/2 years ago. The possibility the U.S. would outlaw the video-sharing app has kept influencers and users in anxious limbo for more than four of the years since then. Now, the moment its fans dreaded is here, but uncertainty over TikTok’s future lingers. On Friday, the Supreme Court upheld a federal law that bans the social media platform starting Sunday unless its China-based parent company sells to an approved buyer. An official says the Biden administration plans to leave the law’s implementation to President-elect Donald Trump, who takes office Monday. During its short life, TikTok has been both a global cultural phenomenon and the subject of political wrangling.",
      "publishedAt": "2025-01-18T05:07:43Z",
      "title": "Inside the rise and fall of TikTok in the US",
      "url": "https://apnews.com/article/tiktok-ban-trump-supreme-court-36c3c3b42f743a35c69e1c74341f1f30",
      "urlToImage": "https://dims.apnews.com/dims4/default/65cbccb/2147483647/strip/true/crop/5905x3322+0+308/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F76%2F6b0fa4c5c6d6cee232d67f732460%2Ff752640c351f4ec39e64f9c0a75a8f30"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "President-elect Donald Trump says he “most likely” will give TikTok 90 more days to work out a deal that would allow the popular video-sharing platform to avoid a U.S. ban. Trump said in an NBC News interview on Saturday that he hasn't decided what to do but was considering granting TikTok a reprieve after he is sworn into office on Monday. A law that prohibits mobile app stores and internet hosting services from distributing TikTok to U.S. users takes effect on Sunday. The law gave TikTok’s China-based parent company nine months to sell the platform’s U.S. operation, but allows the sitting president to grant an extension if a sale is in progress.",
      "publishedAt": "2025-01-18T18:02:10Z",
      "title": "Trump says he'll 'most likely' give TikTok a 90-day extension",
      "url": "https://apnews.com/article/tiktok-us-ban-trump-extension-a3936a93f174d176d3633a67554d771b",
      "urlToImage": "https://dims.apnews.com/dims4/default/e7b38cc/2147483647/strip/true/crop/3680x2070+0+192/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F56%2F5d4dee05b652ffe1f35e93e4a7e2%2Fe1b2ac5ff0e94534ab1f7f122fb424d5"
    },
    {
      "author": "SAMY MAGDY, SAM MEDNICK",
      "description": "Mediator Qatar says the ceasefire between Hamas and Israel will go into effect Sunday at 8:30 a.m. local time. But Israeli Prime Minister Benjamin Netanyahu is warning that a ceasefire won't go forward unless Israel receives the names of hostages to be released, as had been agreed. Families of hostages held in Gaza are bracing Saturday for news of loved ones, while Palestinians prepare to receive freed detainees and humanitarian groups hurry to set up a surge in aid. The pending ceasefire has set off a flurry of activity and a fresh wave of emotions as relatives wonder if hostages will be returned alive or dead.",
      "publishedAt": "2025-01-18T07:54:14Z",
      "title": "Ceasefire between Israel and Hamas will go into effect Sunday morning, officials say",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-01-18-2025-a30917cd2a7740ce2a3ceeb33179391a",
      "urlToImage": "https://dims.apnews.com/dims4/default/56b8c86/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F9c%2F718d88fc6191db4a12f9e4437d2d%2F0a9a774f6fa74d269d0a7195f9dfd04b"
    },
    {
      "author": "TODD RICHMOND, ELLIOT SPAGAT",
      "description": "A U.S. official says immigration officers will target more than 300 people with histories of egregious, violent crimes next week after President-elect Donald Trump takes office. The operation will be concentrated largely in the Chicago area. Arrests are expected throughout the week, subject to possible weather delays. The official spoke to The Associated Press on condition of anonymity because the operation has not been made public. Immigrants and groups advocating for them have been preparing since Trump won the presidency in November. Trump has often criticized Chicago for its protections for people in the country illegally.",
      "publishedAt": "2025-01-18T19:27:26Z",
      "title": "Chicago prepares for deportation arrests targeting hundreds next week after Trump takes office",
      "url": "https://apnews.com/article/chicago-ice-raids-trump-immigrant-community-b3b276656067b5302bed7dfcaf950f57",
      "urlToImage": "https://dims.apnews.com/dims4/default/3db980b/2147483647/strip/true/crop/5477x3081+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2F6b%2F98a00cdb3833bc5e4654a38eddff%2F4c72fc00ec8b4da296ad325c12906d3f"
    },
    {
      "author": "KIM TONG-HYUNG",
      "description": "South Korea’s impeached president, Yoon Suk Yeol, has been formally arrested, days after being apprehended at his presidential compound in Seoul, as he faces possible imprisonment over his ill-fated declaration of martial law last month. Yoon’s arrest early Sunday could mark the beginning of an extended period in custody for him, lasting months or more. The Seoul Western District Court granted law enforcement’s request for an arrest warrant on Yoon following an hourslong deliberation, saying he was a threat to destroy evidence. Yoon and his lawyers on Saturday appeared before the court’s judge during a hearing and argued for his release.",
      "publishedAt": "2025-01-18T02:26:45Z",
      "title": "South Korea court orders formal arrest of impeached President Yoon Suk Yeol",
      "url": "https://apnews.com/article/south-korea-yoon-martial-law-arrest-rebellion-court-hearing-da68666edc4ac5ad11049362da1a84d7",
      "urlToImage": "https://dims.apnews.com/dims4/default/054c1c5/2147483647/strip/true/crop/3675x2067+0+192/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fda%2F05%2F62a5fb4a1c47102f00bcd12920a6%2F465440208bc843fe823b39e1e41851b8"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "Donald Trump is returning to Washington to kick off days of pageantry to herald his second inauguration as president. Trump will leave his Florida home on Saturday and fly to the nation's capital. He will attend an evening reception and fireworks show at Trump National Golf Club in Sterling, Virginia. On Sunday, Trump is scheduled to participate in a wreath-laying ceremony at Arlington National Cemetery before heading to a rally at Capital One Arena in Washington. On Monday, he will be sworn in inside the Capitol because of the cold weather.",
      "publishedAt": "2025-01-18T05:04:58Z",
      "title": "Donald Trump arrives in Washington for inaugural celebrations",
      "url": "https://apnews.com/article/trump-inauguration-return-to-washington-1389014f70bd04793a8dbc83048bba07",
      "urlToImage": "https://dims.apnews.com/dims4/default/9bcb107/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F5a%2F2c45b71fe70e31051804a82f195a%2F93ade4d718044edeb629aaf9472904f3"
    },
    {
      "author": "DARLENE SUPERVILLE, ADRIANA GOMEZ LICON",
      "description": "As Trump prepares to return to the White House, his family circle looks a little different than it did eight years ago. His youngest son, Barron, was in fifth grade when Trump's first administration began. He's now a college freshman. One of Trump's granddaughters is an aspiring social media influencer. Trump has tapped the fathers of his two sons-in-law for administration jobs. The president-elect has five children from his marriages to Ivana Trump, Marla Maples and current wife Melania Trump. He has 10 grandkids, and an 11th is on the way.",
      "publishedAt": "2025-01-18T12:27:06Z",
      "title": "Inside Trump's family circle as he returns to the White House",
      "url": "https://apnews.com/article/trump-family-then-now-white-house-add4a5054a88bd084392fbf92354977e",
      "urlToImage": "https://dims.apnews.com/dims4/default/4786d4f/2147483647/strip/true/crop/4687x2636+0+244/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F2f%2F1dfa0db87566a56e6833f0efe9e7%2F7ba0b64056a140d9bb0587f9cbfdb49b"
    },
    {
      "author": "THOMAS BEAUMONT",
      "description": "Ronald and Nancy Reagan were disappointed, but felt they had no choice. That's what White House Press Secretary Larry Speakes told reporters on Jan. 18, 1985, after the Republican president and first lady decided to hold his second inauguration indoors because there was an unusually cold weather forecast. President-elect Donald Trump’s decision to be sworn in under the Capitol Rotunda on Monday, when below-freezing temperatures are again expected, recalls the last time cold weather prompted a similar decision.",
      "publishedAt": "2025-01-18T17:57:57Z",
      "title": "Inside the 1985 inauguration, the last to take place indoors",
      "url": "https://apnews.com/article/ronald-reagan-1985-inauguration-trump-cold-weather-bd01fac5d72796efa15e6177e3a60a39",
      "urlToImage": "https://dims.apnews.com/dims4/default/d7d4ee1/2147483647/strip/true/crop/3000x1688+0+164/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F00%2Fd9%2F3e875fbea981b5100cadb91f0584%2Ff2c6a78f889d487abcf47074d434f16c"
    },
    {
      "author": "JACK DURA, JULIE WALKER",
      "description": "Another blast of winter weather is expected in parts of the U.S. in the coming days, including bone-chilling wind in the Northern Plains and unusual snow and ice in the Gulf Coast area. Accumulating snowfall is expected in the Mid-Atlantic and Northeast on Sunday. Below-average cold including bone-chilling subzero wind chills are forecasted for the Rockies and Northern Plains in days ahead. And the Gulf Coast and Southeast could see unusual wintry weather of snow, sleet and freezing rain starting Monday in Texas. That weather could cause travel disruptions for areas not used to dealing with snow. And on Monday, President-elect Donald Trump will be sworn into office from inside the U.S. Capitol Rotunda because of cold conditions.",
      "publishedAt": "2025-01-18T18:10:31Z",
      "title": "Extreme cold forecast for much of US in coming days, including unusual snow in the Gulf Coast area",
      "url": "https://apnews.com/article/weather-great-plains-midwest-new-england-7432a56c9380ef24e1717fdd6d7177a2",
      "urlToImage": "https://dims.apnews.com/dims4/default/1b453a5/2147483647/strip/true/crop/3568x2007+0+43/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2F46%2F7d2d0b9b28ee8f3b7b0d3b57804e%2F4261278bbf3a45a6b31fb25cce1952c5"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}