{
  "articles": [
    {
      "author": "MATTHEW LEE",
      "description": "WASHINGTON (AP) — The Biden administration believes it has won assurances from Israel that it will not hit Iranian nuclear or oil sites as it looks to strike back following Iran's missile barrage earlier this month, two U.S.",
      "publishedAt": "2024-10-15T16:04:08Z",
      "title": "Israel assures US it won't strike Iranian nuclear or oil sites, US officials say",
      "url": "https://apnews.com/f5dd702de7d990dd1d00f665e1484dee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9d0a06d036df4bd69b3bd2004af1acf4/3000.jpeg"
    },
    {
      "author": "WILL WEISSERT",
      "description": "DETROIT (AP) — Kamala Harris and Donald Trump both pushed Tuesday to energize key constituencies that their allies worry might be slipping away, with the vice president looking to reach Black men and the former president focusing on women.",
      "publishedAt": "2024-10-15T15:13:51Z",
      "title": "Harris zeroes in on Black men, Trump focuses on women as both seek to fire up key voting blocs",
      "url": "https://apnews.com/2eab5daa1095b7ecb38fe92857acdb86",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bde6918ebbfe491fbf3d069db7803014/3000.jpeg"
    },
    {
      "author": "ZEKE MILLER",
      "description": "WASHINGTON (AP) — Democratic vice presidential nominee Minnesota Gov. Tim Walz on Tuesday will unveil his ticket's plans to improve the lives of rural voters, as Vice President Kamala Harris looks to cut into former President Donald Trump's support.",
      "publishedAt": "2024-10-15T10:23:22Z",
      "title": "Walz to unveil Harris' plan for rural voters as campaign looks to cut into Trump's edge",
      "url": "https://apnews.com/291214562d083593f29f8972429a9bec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2b31e8d5138346229ae776446a1d092d/3000.jpeg"
    },
    {
      "author": "GARY D. ROBERTSON",
      "description": "RALEIGH, N.C. (AP) — North Carolina Lt. Gov. Mark Robinson, a Republican, sued CNN on Tuesday over its recent report that he made explicit racial and sexual posts on a pornography website’s message board, calling the reporting reckless and defamatory.",
      "publishedAt": "2024-10-15T14:02:00Z",
      "title": "North Carolina governor candidate Mark Robinson sues CNN over report about posts on porn site",
      "url": "https://apnews.com/e195d3d8a03ce7d0b3496ab7cecefbe7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/78f124d3725348cb9b46f91bf584685f/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — A diplomatic row that has strained bilateral relations between India and Canada for over a year has boiled over as the countries expelled each other’s top diplomats over the killing of a Sikh activist in Canada and allegations of other crimes.",
      "publishedAt": "2024-10-15T12:02:11Z",
      "title": "Canada-India ties could take a long time to recover",
      "url": "https://apnews.com/42080eab5c86b861f44ed7bb3f33b4e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0333ab1164f3458091fabf5d08843c51/3000.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "U.S. Agriculture Department officials have launched an internal investigation into how the agency handled reports of serious problems at a Boar's Head deli meat plant tied to a deadly listeria outbreak, a lawmaker said Tuesday.",
      "publishedAt": "2024-10-15T15:19:16Z",
      "title": "USDA launches an internal investigation into the deadly Boar's Head outbreak",
      "url": "https://apnews.com/bdcecaa25363c87d08ba01cf71aefb0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e2ad11f6f4041099fb9ea07974d1df7/3000.jpeg"
    },
    {
      "author": "FERNANDA FIGUEROA and MELISSA PEREZ WINDER",
      "description": "CHICAGO (AP) — For Luis Martinez, competing in lowriding bike and car competitions is about more than glory and bragging rights. The lowrider clubs in the Chicago area have become like one big family and a source of mutual support.",
      "publishedAt": "2024-10-15T13:28:18Z",
      "title": "Lowriding is more than just cars. It's about family and culture for Mexican Americans",
      "url": "https://apnews.com/762d6d557c73f5c8b251257201797cf7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d030ac33ab44438a931eb97bee238e74/1920.jpeg"
    },
    {
      "author": "KELVIN CHAN",
      "description": "The artificial intelligence boom has benefited chatbot makers, computer scientists and Nvidia investors.",
      "publishedAt": "2024-10-15T12:59:04Z",
      "title": "How the tiny Caribbean island of Anguilla has turned the AI boom into a digital gold mine",
      "url": "https://apnews.com/29d4ca2bb740d0425ffb8355811a6976",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ffcda7ce0ba4d7391ef59c8bdcb4221/3000.jpeg"
    },
    {
      "author": "NICK PERRY, MICHAEL CASEY and PATRICK WHITTLE",
      "description": "MEREDITH, N.H. (AP) — New England leaf-watching season is in full swing, as people from as far as Florida and Berlin flock to the region for scenic drives, train rides and bus tours to soak in the splendid hues of red, orange and bronze.",
      "publishedAt": "2024-10-15T04:07:13Z",
      "title": "Leaf-peepers are flocking to see New England's brilliant fall colors",
      "url": "https://apnews.com/93e9e67391855cebff5ac2a9c846588d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06d2f19b183146c4af4688fe1bc054fc/1920.jpeg"
    },
    {
      "author": "DENNIS WASZAK Jr.",
      "description": "Aaron Rodgers and Davante Adams are finally reunited after a year of speculation — and now they'll try to save the New York Jets ' sinking season.",
      "publishedAt": "2024-10-15T14:35:49Z",
      "title": "Jets acquire wide receiver Davante Adams from Raiders, AP sources say",
      "url": "https://apnews.com/e487be5dbfa82159cae2c5bc55f657c4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/48aa866cc91d447b92f351f784636216/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}