{
  "articles": [
    {
      "author": "TIA GOLDENBERG and BASSEM MROUE",
      "description": "TEL AVIV, Israel (AP) — A rocket strike Saturday at a soccer field killed at least 11 children and teens, Israeli authorities said, in the deadliest strike on an Israeli target along the country's northern border since the fighting between Israel and the Lebanese militant group Hezbollah began.",
      "publishedAt": "2024-07-27T16:28:11Z",
      "title": "Strike on Israeli Golan Heights kills 11 and threatens to spark a wider war. Hezbollah denies a role",
      "url": "https://apnews.com/141600af654f48f733b33f9f0a26dbfe",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/860e19b3312c442480cbbcab80f7deb2/1920.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAM METZ",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes hit a school used by displaced Palestinians in central Gaza on Saturday, killing at least 30 people including several children, as the country’s negotiators prepared to meet international mediators about a proposed cease-fire.",
      "publishedAt": "2024-07-27T07:11:58Z",
      "title": "An Israeli airstrike hits a school sheltering people in Gaza, killing at least 30 including children",
      "url": "https://apnews.com/c95e8effebd9d4e4ba7e69bfbae61e04",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4fc37b1ca64246d49382c97217486fe9/1920.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "ST. CLOUD, Minn. (AP) — Donald Trump is taking his campaign back to Minnesota, a state that has favored Democrats but that the former president thinks could be within his reach this year.",
      "publishedAt": "2024-07-27T04:04:41Z",
      "title": "Trump is returning to Minnesota with Midwesterner Vance to try to swing Democrat-leaning state",
      "url": "https://apnews.com/22aee6ecb821032328c1e3d210b27733",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/be20ecee8bb34fb5ad21e7e72ab3b5d9/3000.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — All of a sudden it's Kamala Harris ' economy — a major opportunity as well as a possible risk for the likely Democratic presidential nominee.",
      "publishedAt": "2024-07-27T12:24:35Z",
      "title": "Harris freshens up her message on the economy as Trump and Republicans go after her on inflation",
      "url": "https://apnews.com/f52edb07e4bd4adf01b484744fc7d387",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/32b9aea2065548298b141b5d1a0135e7/3000.jpeg"
    },
    {
      "author": "THOMAS ADAMSON",
      "description": "PARIS (AP) — In an unprecedented display of inclusivity, drag queens took center stage at the Paris Olympics opening ceremony, showcasing the vibrant and influential role of the French LGBTQ+ community — while also attracting criticism over a tableau reminiscent of “The Last Supper.”",
      "publishedAt": "2024-07-27T16:20:12Z",
      "title": "Drag queens shine at Olympics opening, but 'Last Supper' tableau draws criticism",
      "url": "https://apnews.com/c635aa276be1147e4643231bdbe5478e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1e287fd0e84549d89c1ea891508484b7/3000.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — “ Brats for Harris.” “ We need a Kamalanomenon. ” “ Gen Z feels the Kamalove.”",
      "publishedAt": "2024-07-27T04:10:27Z",
      "title": "'Gen Z feels the Kamalove': Youth-led progressive groups hope Harris will energize young voters",
      "url": "https://apnews.com/161caa432cf440a029e998409940b4a2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5f0f764dcd7047458d748b1fad32477a/3000.jpeg"
    },
    {
      "author": "NIC COURY and OLGA R. RODRIGUEZ",
      "description": "FOREST RANCH, Calif. (AP) — Thousands of firefighters battling a wildfire in Northern California received some help from the weather Saturday hours after it exploded in size, scorching an area greater than the size of Los Angeles.",
      "publishedAt": "2024-07-27T04:17:00Z",
      "title": "Firefighters get some help from cooler temperatures after California's largest wildfire explodes",
      "url": "https://apnews.com/4ff0e51837119a32cc805efc46967c94",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f707a9f557884e989adb9f26179c7737/1920.jpeg"
    },
    {
      "author": null,
      "description": "HAVANA (AP) — Three Russian warships arrived in Cuban waters on Saturday, Moscow's second such maritime voyage in as many months in a reflection of deepening ties between Russia and Cuba. The naval group, consisting of a training ship, patrol frigate and refueling tanker, are expected to remain docked in Cuba's port of Havana until July 30.",
      "publishedAt": "2024-07-27T18:51:42Z",
      "title": "In a show of growing ties, Russian warships make a new visit to Cuban waters",
      "url": "https://apnews.com/fcddda9e9406a81b686d648d007b8757",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/73ba83d68ace44d0a91e5bc7925d0ec2/3000.jpeg"
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "SAN FRANCISCO (AP) — “Move fast and break things,” a high-tech mantra popularized 20 years ago by Facebook founder Mark Zuckerberg, was supposed to be a rallying cry for game-changing innovation. It now seems more like an elegy for a society perched on a digital foundation too fragile to withstand a defective software program that was supposed to help protect computers — not crash them.",
      "publishedAt": "2024-07-27T11:46:29Z",
      "title": "Technology's grip on modern life is pushing us down a dimly lit path of digital land mines",
      "url": "https://apnews.com/f314f7919e5ac2d0d40682f13df00778",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/228f6ddad42b4bde981dcae5ec8b2424/3000.jpeg"
    },
    {
      "author": "HEATHER HOLLINGSWORTH",
      "description": "Decades of snuffing out fires at the first sign of smoke combined with climate change have laid the groundwork for a massive wildfire in northern California and scores of smaller ones across the western U.S.",
      "publishedAt": "2024-07-27T23:19:25Z",
      "title": "Fires in the West are becoming ever bigger, consuming. Why and what can be done?",
      "url": "https://apnews.com/359e9bfba415dea51ec92d772068a269",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57ba0831003e4ab19acfd85bfe93745d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}