{
  "articles": [
    {
      "author": null,
      "description": "A key House committee is looking into the investigation of the late Jeffrey Epstein for sex trafficking crimes. It is working to subpoena President Donald Trump’s Department of Justice for files in the case as well as hold a deposition of Epstein’s former girlfriend, Ghislaine Maxwell. The Republican-controlled House Oversight Committee’s actions show the mounting pressure for disclosure in a case that Trump has urged his supporters to move past. But they were also just the start of what can be a drawn out process.",
      "publishedAt": "2025-07-26T15:46:28Z",
      "title": "House committee demands Epstein files. Here's what could happen next",
      "url": "https://apnews.com/article/epstein-investigation-congress-subpoena-trump-ghislaine-maxwell-c575f6565945cfd0505c8a8146b16465",
      "urlToImage": "https://dims.apnews.com/dims4/default/ebc68f8/2147483647/strip/true/crop/5760x3240+0+254/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F97%2Fc3%2Fac572bba1b723cf5b0231b8b8c92%2Fcee76ba389b04d57af70ff4f1d61d306"
    },
    {
      "author": null,
      "description": "President Donald Trump has played golf at his course on Scotland’s coast while protesters around the country took to the streets to decry his visit and accuse United Kingdom leaders of pandering to the American. Trump and his son Eric played on Saturday near Turnberry, a historic course that the Trump family’s company took over in 2008. Meanwhile, hundreds of protesters gathered in front of the U.S. Consulate about 100 miles away in Edinburgh, Scotland’s capital. Protests are planned in other cities. While in Scotland, Trump is set to talk trade with British Prime Minister Keir Starmer and Ursula von der Leyen, the European Commission president.",
      "publishedAt": "2025-07-26T12:39:27Z",
      "title": "Trump plays golf in Scotland as protesters take to the streets",
      "url": "https://apnews.com/article/trump-scotland-protests-golf-starmer-tariffs-1c9b7265e56c6ec01821e1c33eb9de14",
      "urlToImage": "https://dims.apnews.com/dims4/default/7779e66/2147483647/strip/true/crop/3277x1843+0+170/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F61%2Fa8%2Fa18acaa10e6d921a0e14035f42a5%2Fa843da8be6e545aebfbc4d3e1283d9d5"
    },
    {
      "author": null,
      "description": "Authorities say multiple people have been stabbed at a Walmart in Traverse City, and a suspect is in custody. The Michigan State Police says the local sheriff’s office is investigating the incident and details are limited. The agency asks that people avoid the area while the investigation is ongoing. A Walmart corporate spokesperson says the company is working with police and is deferring questions to them for the time being.",
      "publishedAt": "2025-07-26T22:20:48Z",
      "title": "Multiple people have been stabbed at a Walmart in Michigan and a suspect is in custody",
      "url": "https://apnews.com/article/walmart-stabbing-michigan-traverse-city-7d31d22005921a90e54c813a563c2457",
      "urlToImage": "https://dims.apnews.com/dims4/default/43ab09c/2147483647/strip/true/crop/4683x2634+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F39%2F010d09f93d90754a914b725aa0b6%2F154279e5740b4762a581557340b29f34"
    },
    {
      "author": null,
      "description": "President Donald Trump is bragging that Japan has given him, as part of a new trade framework, $550 billion to invest in the United States. It’s an astonishing figure, but still subject to negotiation and perhaps not the sure thing he’s portraying. He says 90% of any profits from the money invested would go to the U.S. even if Japan had put up the funds. He calls it “a signing bonus.” A key Japanese trade negotiator isn't discussing the terms. It's unclear the degree to which the $550 billion could represent new investment or flow into existing investment plans.",
      "publishedAt": "2025-07-26T15:38:46Z",
      "title": "Trump says Japan will invest $550 billion in US at his direction",
      "url": "https://apnews.com/article/trump-japan-trade-tariffs-550-billion-investment-fund-79c27b3db1c22c513bcf487c00a5a627",
      "urlToImage": "https://dims.apnews.com/dims4/default/6f3ce00/2147483647/strip/true/crop/8000x4500+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2Fc0%2Fb3ad7f985677a27d09105525fd5e%2Fe1862e4496394dbaa2ce190fd77e2eac"
    },
    {
      "author": null,
      "description": "Thailand and Cambodia are accusing each other of new attacks as border clashes reach into a third day. As of Saturday, at least 33 people are dead and over 168,000 have been displaced. Artillery and small arms fire have been reported near several border villages. Both countries have recalled their ambassadors, and Thailand has closed its border crossings with Cambodia. President Donald Trump said Saturday that he talked to both countries' leaders and suggested they would not cement trade deals with the U.S. if the hostilities continue. The U.N. Security Council has called on the ASEAN regional bloc to mediate peace. Human Rights Watch has urged both governments to protect civilians.",
      "publishedAt": "2025-07-26T09:18:21Z",
      "title": "Thailand and Cambodia trade accusations as deadly border clashes enter a third day",
      "url": "https://apnews.com/article/thailand-cambodia-armed-clash-border-eda96eb133a4561fa192029466da8dcf",
      "urlToImage": "https://dims.apnews.com/dims4/default/ef59b1c/2147483647/strip/true/crop/2455x1381+0+128/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F24%2F16%2F7b1d51691db13d2d21990805f07b%2F238c516e2a284844a6b7fefc361cf572"
    },
    {
      "author": null,
      "description": "Gaza health officials and the ambulance service say at least 25 people were killed by Israeli airstrikes and gunshots overnight as ceasefire talks appear to have stalled and Palestinians in Gaza are facing famine. The majority of people were killed by gunfire waiting for aid trucks close to the Zikim crossing with Israel, officials said Saturday. The strikes come as ceasefire talks between Israel and Hamas have hit a standstill after the U.S and Israel recalled their negotiating teams this week throwing the future of the negotiations into further uncertainty. The United Nations and experts say that Palestinians in Gaza are at risk of famine, with reports of increasing numbers of people dying from causes related to malnutrition.",
      "publishedAt": "2025-07-26T09:37:43Z",
      "title": "At least 25 people killed by Israeli gunshots and strikes in Gaza, some while seeking aid",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-07-26-2025-8eca83b00e50f1e6d78a0cce877b3b90",
      "urlToImage": "https://dims.apnews.com/dims4/default/eda1a1e/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2Fd7%2Fbe3f44997ba007c899e86a8e0775%2F9738ac005d6d4deca84257ca17453ec4"
    },
    {
      "author": null,
      "description": "The latest child to starve to death in Gaza weighed less than when she was born. The body of 5-month-old Zainab Abu Halib arrived at a hospital in southern Gaza on Friday and her family buried her on Saturday. The head of the hospital's pediatric department told The Associated Press that the child had needed a special type of formula that helps with babies allergic to cow’s milk. The baby vomited and had diarrhea and ended up with sepsis, unable to swallow. Doctors and aid workers in Gaza blame the growing hunger on Israel’s restrictions on the entry of aid.",
      "publishedAt": "2025-07-26T15:52:20Z",
      "title": "Baby starves to death in Gaza weighing less than when she was born",
      "url": "https://apnews.com/article/gaza-israel-starvation-children-malnutrition-baby-baf865b861c9a2fd9c75068936062146",
      "urlToImage": "https://dims.apnews.com/dims4/default/8aad907/2147483647/strip/true/crop/5457x3070+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F91%2Fa9%2F1c3737f633dbd6f08efb96e369dc%2Ffd6b0d7fd4274f53856da719772e63d4"
    },
    {
      "author": null,
      "description": "Redistricting usually happens after the once-a-decade population count by the U.S. Census Bureau or in response to a court ruling. Now, Texas Republicans want to break that tradition. And other states could follow suit. President Trump has asked the Texas Legislature to create districts, in time for next year’s midterm elections, that will send five more Republicans to Washington and make it harder for Democrats to regain the majority and blunt his agenda. There's no national impediment to a state trying to redraw districts in the middle of a decade and to do it for political reasons, such as increasing representation by the party in power.",
      "publishedAt": "2025-07-26T13:11:54Z",
      "title": "How redistricting in Texas could reshape US House elections",
      "url": "https://apnews.com/article/texas-trump-redistricting-census-california-republicans-constitutional-1c6287fc23214548be734bbbf7056117",
      "urlToImage": "https://dims.apnews.com/dims4/default/7372f52/2147483647/strip/true/crop/5092x2864+0+265/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2Fa5%2F5674028e69adef872b9db9a9cae9%2F140f2c47650c4e63bdb02317a41d3ab4"
    },
    {
      "author": null,
      "description": "The National Weather Service has issued heat advisories for the southeastern United States. The advisories cover areas from central Florida to Virginia through the weekend. Temperatures are expected to reach the upper 90s, with heat indexes between 105 and 110. Extreme heat warnings are in effect for eastern North Carolina and parts of South Carolina. Forecasters warn of dangerously hot conditions, with temperatures approaching 100 degrees in parts of the Carolinas. Over 30 million people could be affected. The Midwest is also experiencing extreme heat, with watches in place for Nebraska, Iowa, and Minnesota. Storms in Iowa have triggered flash flood warnings.",
      "publishedAt": "2025-07-26T17:00:30Z",
      "title": "Heat advisories issued as temperatures soar in US Southeast",
      "url": "https://apnews.com/article/heat-wave-advisories-warnings-southeast-midwest-e6e240217a54bc0e65c51d11ac5c783d",
      "urlToImage": "https://dims.apnews.com/dims4/default/858c74d/2147483647/strip/true/crop/8260x4646+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F08%2F4e9a6e8c832144c06f8dc4c5f31b%2F2ac19b8c179c4385a5d05c50b042161c"
    },
    {
      "author": null,
      "description": "Statehouses across the U.S. are addressing long-standing bathroom disparities for female lawmakers. In Kentucky, there is limited restroom access for women in the Statehouse, who risk missing debates or votes if they have to stand in line to answer the call of nature. A $300 million renovation, expected to be finished by at least 2028, will add more bathrooms for women. Similar efforts are underway in Georgia, reflecting a shift toward inclusivity. Historically, many statehouses were built without considering female legislators. Advocates say these changes symbolize a shift toward respect and equality, ensuring public spaces meet the needs of all lawmakers and the public.",
      "publishedAt": "2025-07-26T04:02:17Z",
      "title": "Female state lawmakers face bathroom stall shortage",
      "url": "https://apnews.com/article/bathrooms-women-statehouse-capitol-26ecb9b2d7ea6d66883b902f89da1fcd",
      "urlToImage": "https://dims.apnews.com/dims4/default/d151fe3/2147483647/strip/true/crop/5341x3004+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F6e%2Fab62f0d571b1cc4285fe8ea52197%2F48e34fcee3524475a641cfc5085191ed"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}