{
  "articles": [
    {
      "author": "KATE BRUMBACK and ALANNA DURKIN RICHER",
      "description": "ATLANTA (AP) — The judge overseeing the Georgia 2020 election interference case on Wednesday dismissed some of the charges against former President Donald Trump and others, but the rest of the sweeping racketeering indictment remains intact.",
      "publishedAt": "2024-03-13T14:14:19Z",
      "title": "Judge dismisses some charges against Trump in the Georgia 2020 election interference case",
      "url": "https://apnews.com/46e0b68c25719c404130f7e6eab69dcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d31fa43856441d7a0c055586548c210/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING, HALELUYA HADERO and MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — The House on Wednesday passed a bill that would lead to a nationwide ban of the popular video app TikTok if its China-based owner doesn't sell, as lawmakers acted on concerns that the company's current ownership structure is a national security threat.",
      "publishedAt": "2024-03-13T04:05:02Z",
      "title": "House passes a bill that could lead to a TikTok ban if Chinese owner refuses to sell",
      "url": "https://apnews.com/8fa7258fae1a4902d344c9d978d58a37",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68e37da41ad94958be2b0b7c902cc09d/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "President Vladimir Putin said Wednesday that Russia is ready to use nuclear weapons if its sovereignty or independence is threatened, issuing another blunt warning to the West just days before an election in which he’s all but certain to secure another six-year term.",
      "publishedAt": "2024-03-13T06:40:03Z",
      "title": "Putin warns again that Russia is ready to use nuclear weapons if its sovereignty is threatened",
      "url": "https://apnews.com/82ced2419d93ae733161b56fbd9b477d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/207e8c59c851418d81100b5eb4892a8e/1920.jpeg"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "TEL AVIV, Israel (AP) — When Shawn Landis, an evangelical Christian from Pennsylvania, heard about the Oct. 7 Hamas attack on southern Israel, he knew he would come to Israel to volunteer as soon as it was safe.",
      "publishedAt": "2024-03-13T05:03:01Z",
      "title": "Evangelical Christians are fierce Israel supporters. Now they are visiting as war-time volunteers",
      "url": "https://apnews.com/462329e04459191fd6ae061e722cae30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/731c05574a74491481a77b70194c4e91/3000.jpeg"
    },
    {
      "author": "MEG KINNARD",
      "description": "COLUMBIA, S.C. (AP) — President Joe Biden and former President Donald Trump have officially secured the requisite numbers of delegates to be considered their parties' presumptive nominees.It was a foreseeable outcome.",
      "publishedAt": "2024-03-13T13:14:41Z",
      "title": "Biden and Trump are now their parties' presumptive nominees. What does that mean?",
      "url": "https://apnews.com/6b2a3beb31896894ded9e96aa30cfcec",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fca0ef908d794493997d200caaed048a/3000.jpeg"
    },
    {
      "author": "COLLEEN LONG and ZEKE MILLER",
      "description": "WASHINGTON (AP) — Special counsel Robert Hur was thanking the president for his time. He understood, Hur said, that there were a lot of things going on that demanded Joe Biden’s attention.“We may be interrupted by one,” Biden said, explaining that he’d just gotten off the phone with Israeli Prime Minister Benjamin Netanyahu.",
      "publishedAt": "2024-03-13T04:02:15Z",
      "title": "Hur transcript reveals Biden presidency's profound and mundane moments",
      "url": "https://apnews.com/346b3538309207f23b3fd147b5ebeb34",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/240630cf76d54051977c7f8969e2dc25/3000.jpeg"
    },
    {
      "author": "MIKE STOBBE",
      "description": "NEW YORK (AP) — For years, scientists have known people who use neti pots can become infected with a brain-eating amoeba if they use the wrong kind of water. On Wednesday, researchers linked a second kind of deadly amoeba to nasal rinsing.",
      "publishedAt": "2024-03-13T16:25:42Z",
      "title": "Another dangerous amoeba has been linked to neti pots and nasal rinsing. Here's what to know",
      "url": "https://apnews.com/aed6e6f9129d85146d396d71b8778812",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef2f7d566cc54720a1b8b4bdf7da9628/2333.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "NEW YORK (AP) — The biopic “Bob Marley: One Love” has been a box office hit in the United States and several other countries.",
      "publishedAt": "2024-03-13T15:26:43Z",
      "title": "In ‘Bob Marley: One Love’ film: what's his faith? And why is marijuana deemed holy to the Rastafari?",
      "url": "https://apnews.com/2a46a81116b42906e8b282cde31ee900",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0ebf07b2f644d848d6af9bf5f49c979/3000.jpeg"
    },
    {
      "author": "DENISE LAVOIE and LEA SKENE",
      "description": "RICHMOND, Va. (AP) — Employees of the Richmond Wildlife Center in Virginia are doing their best to act like mother foxes as they feed and care for an orphaned kit that found her way into their care.",
      "publishedAt": "2024-03-12T23:48:38Z",
      "title": "Staff at a Virginia wildlife center pretend to be red foxes as they care for an orphaned kit",
      "url": "https://apnews.com/3619d06c1c92e37bb9356108e74629b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4421aa849ac54bf98eda672200355800/1920.jpeg"
    },
    {
      "author": "JAY COHEN",
      "description": "GLENDALE, Ariz. (AP) — There is a bridge that runs from Tommy John and Dr. Frank Jobe in 1974, all the way to Shohei Ohtani, Justin Verlander and Bryce Harper. A thread that connects an increasing number of baseball's biggest stars.",
      "publishedAt": "2024-03-13T10:00:43Z",
      "title": "50 years later, Tommy John surgery remains a game-changer",
      "url": "https://apnews.com/5a272eb356532411c8c03ddfe4fa97f8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/53f82e3888534f799205d0d7d1ed2eec/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}