{
  "articles": [
    {
      "author": "WAFAA SHURAFA, JOSEF FEDERMAN and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Hamas’ top leader traveled to Cairo on Wednesday for talks on the war in Gaza, part of a flurry of diplomacy aimed at securing another cease-fire and swap of hostages for Palestinian prisoners at a moment when Israel's offensive shows no signs of slowing.",
      "publishedAt": "2023-12-20T08:47:04Z",
      "title": "Hamas leader visits Cairo as talks over another Gaza cease-fire gather pace",
      "url": "https://apnews.com/81b80e4716b53756c8fab96c183089ef",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbb5339b25254898ac269912edd16e8c/3000.jpeg"
    },
    {
      "author": "NICHOLAS RICCARDI",
      "description": "DENVER (AP) — Former President Donald Trump's bid to win back the White House is now threatened by two sentences added to the U.S. Constitution 155 years ago.The Colorado Supreme Court on Tuesday barred Trump from the state's ballot under Section 3 of the 14th Amendment, which prohibits anyone who swore an oath to support the Constitution and then “engaged in insurrection” against it from holding office.",
      "publishedAt": "2023-12-20T17:34:38Z",
      "title": "The Constitution's insurrection clause threatens Trump's campaign. Here is how that is playing out",
      "url": "https://apnews.com/79373b5043976588b599fc00ede049e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/811169873211483b9336b267bf5b6b3f/1920.jpeg"
    },
    {
      "author": "JENNIFER PELTZ and DAVID A. LIEB",
      "description": "When the coronavirus pandemic took hold in an unprepared U.S., many states like Ohio scrambled for masks and other protective gear. Supplies were so limited in 2020 that the state bought millions of medical gowns from a marketing and printing company and spent about $20 million to try to get personal protective equipment made in-state.",
      "publishedAt": "2023-12-20T05:11:10Z",
      "title": "States are trashing troves of masks and pandemic gear as huge, costly stockpiles linger and expire",
      "url": "https://apnews.com/50bf7739fc9d69f4b991a14daadecaba",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f7406dda4584e7183f574d953bded0f/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN and HALELUYA HADERO",
      "description": "Hidden inside the foundation of popular artificial intelligence image-generators are thousands of images of child sexual abuse, according to a new report that urges companies to take action to address a harmful flaw in the technology they built.",
      "publishedAt": "2023-12-20T12:01:47Z",
      "title": "Study shows AI image-generators being trained on explicit photos of children",
      "url": "https://apnews.com/3081a81fa79e2a39b67c11201cfd085f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2498cd654384e82b58d50644d8660d0/3000.jpeg"
    },
    {
      "author": "DEVI SHASTRI",
      "description": "When Idaho had a rare measles outbreak a few months ago, health officials scrambled to keep it from spreading.",
      "publishedAt": "2023-12-20T15:50:28Z",
      "title": "Health officials push to get schoolchildren vaccinated as more US parents opt out",
      "url": "https://apnews.com/e7015d8fd38ec80802eeae350755a402",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1ee8b912371f469f9616dc961e94896f/3000.jpeg"
    },
    {
      "author": "DAVID CRARY",
      "description": "Repeatedly in recent years, the U.S. Conference of Catholic Bishops has stipulated that “the threat of abortion remains our preeminent priority.” In the face of recent election setbacks for abortion opponents, leading bishops and their lay allies are reassessing how to move forward with that stance.",
      "publishedAt": "2023-12-20T13:03:54Z",
      "title": "US Catholic leadership foresees challenges after repeated election defeats for abortion opponents",
      "url": "https://apnews.com/25da70c3dc0912df649744e2482414fc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a20e5f1f92f49c4a097d42a0c83f771/3000.jpeg"
    },
    {
      "author": "MICHAEL CASEY",
      "description": "CAMBRIDGE, Mass. (AP) — A few years back, Sage Brook Carbone was attending a powwow at the Mashantucket Western Pequot reservation in Connecticut when she noticed signs in the Pequot language.Carbone, a citizen of the Northern Narragansett Indian Tribe of Rhode Island, thought back to Cambridge, Massachusetts, where she has lived for much of her life.",
      "publishedAt": "2023-12-20T06:04:19Z",
      "title": "Native American translations are being added to more US road signs to promote language and awareness",
      "url": "https://apnews.com/93ea9edb4da876da61fa5635c0139388",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ffb70734c6d74ddb9cd85099ced19881/3000.jpeg"
    },
    {
      "author": "JOSHUA GOODMAN and ERIC TUCKER",
      "description": "MIAMI (AP) — The United States freed a close ally of Venezuelan President Nicolás Maduro in exchange for the release of 10 Americans imprisoned in the South American country and the extradition of a fugitive defense contractor known as “Fat Leonard” who is at the center of a massive Pentagon bribery scandal, officials said Wednesday.",
      "publishedAt": "2023-12-20T14:04:10Z",
      "title": "US, Venezuela swap prisoners: Maduro ally for 10 Americans, plus fugitive contractor 'Fat Leonard'",
      "url": "https://apnews.com/d7148a34dd009d5bab3d5f50c28ed93e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbd361ff822e4a618d4be03a289941ab/3000.jpeg"
    },
    {
      "author": "KEN MILLER",
      "description": "OKLAHOMA CITY (AP) — An Oklahoma judge has exonerated a man who spent nearly 50 years in prison for murder, the longest serving inmate to be declared innocent of a crime. Glynn Simmons, 71, who was released in July after prosecutors agreed that key evidence in his case was not turned over to his defense lawyers, was ruled innocent Tuesday.",
      "publishedAt": "2023-12-20T17:29:35Z",
      "title": "Oklahoma judge rules a man who wrongfully spent nearly 50 years in prison for murder is innocent",
      "url": "https://apnews.com/1d06d2a65792f55ab1f1e2f4acace8ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d6f692336b9d4ea6aebf6c5f64f3fcf3/3000.jpeg"
    },
    {
      "author": "MORGAN LEE",
      "description": "SANTA FE, N.M. (AP) — Like Christmas trees, Santa and reindeer, the poinsettia has long been a ubiquitous symbol of the holiday season in the U.S. and across Europe.But now, nearly 200 years after the plant with the bright crimson leaves was introduced in the U.S., attention is once again turning to the poinsettia's origins and the checkered history of its namesake, a slaveowner and lawmaker who played a part in the forced removal of Native Americans from their land.",
      "publishedAt": "2023-12-20T14:05:12Z",
      "title": "The checkered history of the poinsettia's namesake and the flower's origins get new attention",
      "url": "https://apnews.com/a5f4abea985e0f44523b2963ff435b56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f9799b03de2f4ff693dd45e0b757cc90/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}