{
  "articles": [
    {
      "author": "LINLEY SANDERS",
      "description": "Americans see the federal government as rife with corruption, inefficiency and red tape — but they’re less sure about whether Elon Musk is the right person to fix it. An Associated Press-NORC Center for Public Affairs Research poll shows only about 3 in 10 U.S. adults strongly or somewhat approve of President Donald Trump’s Department of Government Efficiency, which Musk leads. The poll shows Americans aren’t broadly worried about a government filled with “deep state” actors poised to undermine Trump’s Republican agenda. They're also ambivalent about some of the changes Trump has mentioned, including eliminating large numbers of federal jobs and moving federal agencies outside Washington.",
      "publishedAt": "2025-01-24T12:06:59Z",
      "title": "What Americans think about Trump and Musk's plans for the government",
      "url": "https://apnews.com/article/doge-musk-trump-corruption-government-efficiency-16243280f446ea85ef50ff106c7e2841",
      "urlToImage": "https://dims.apnews.com/dims4/default/5d03412/2147483647/strip/true/crop/7693x4327+0+400/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe6%2F0c%2F03c444621811b0c8318a0c409d5d%2Fb024f038517a49e580c9127a26701216"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "President Donald Trump is heading to hurricane-battered western North Carolina and wildfire-ravaged Los Angeles on Friday, using the first trip of his second administration to tour areas where politics has clouded the response to deadly disasters.",
      "publishedAt": "2025-01-24T07:38:00Z",
      "title": "Live updates: Trump heads to disaster zones in North Carolina and California on the first trip of second term",
      "url": "https://apnews.com/live/president-trump-day-5-updates#00000194-9871-dae8-abb7-9df7cdfd0000",
      "urlToImage": "https://dims.apnews.com/dims4/default/4740afe/2147483647/strip/true/crop/3776x2124+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F57%2Fc91a39b94a98bbb39f0059663662%2Fap25024537992424.jpg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "President Donald Trump is poised to sign the first bill of his new administration. It's named after a slain Georgia nursing student whose name became a rallying cry during his White House campaign. If signed into law, the Laken Riley Act would require the detention of unauthorized immigrants accused of theft and violent crimes. The bill won bipartisan support in both the House and Senate. Under the new law, federal officials would be required to detain any migrant arrested or charged with crimes like shoplifting, assaulting a police officer or crimes that injure or kill someone.",
      "publishedAt": "2025-01-24T05:02:19Z",
      "title": "What is the Laken Riley Act? And who voted for it?",
      "url": "https://apnews.com/article/what-is-laken-riley-act-trump-immigration-2667d626139ddf5a16d1533516eab18f",
      "urlToImage": "https://dims.apnews.com/dims4/default/e1bd3de/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F90%2F431ce701d7ba3532497224d1cb23%2Ff144a6fef3d7470a9fe1b25b46e48b41"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "President Donald Trump is pardoning anti-abortion activists who were convicted in the October 2020 invasion and blockade of a Washington clinic. Lauren Handy was sentenced to nearly five years in prison for leading the blockade by directing activists to link themselves together with locks and chains to block the clinic’s doors. Trump pardoned Handy and her nine co-defendants. The news of the pardons comes ahead of Friday’s annual anti-abortion protest March for Life in Washington, D.C., where the president is expected to address the crowd in a video.",
      "publishedAt": "2025-01-23T21:36:18Z",
      "title": "Trump pardons anti-abortion activists who blockaded clinic entrances",
      "url": "https://apnews.com/article/abortion-trump-executive-order-pardon-817774b21d32a4edf6d39ee43cbc18f4",
      "urlToImage": "https://dims.apnews.com/dims4/default/1458926/2147483647/strip/true/crop/5181x2914+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2Fe6%2F82a2ffcda6facc643fa1bd84af93%2F11880361b22e4ab7a23059504d59b25e"
    },
    {
      "author": "BILL BARROW",
      "description": "President Donald Trump began his second administration with a blitz of policy actions to reorient U.S. government priorities. He has covered issues from trade, immigration and U.S. foreign aid to demographic diversity, civil rights and the hiring of federal workers. Some have an immediate policy impact. Others are more symbolic. Some already are being challenged by federal lawsuits. In total, the Republican president’s sweeping actions reflect many of his campaign promises and determination to concentrate executive branch power in the West Wing, while moving the country sharply rightward.",
      "publishedAt": "2025-01-22T18:05:42Z",
      "title": "Everything Trump did in the first executive orders of his presidency",
      "url": "https://apnews.com/article/what-has-trump-done-trump-executive-orders-f061fbe7f08c08d81509a6af20ef8fc0",
      "urlToImage": "https://dims.apnews.com/dims4/default/e93f226/2147483647/strip/true/crop/4479x2519+0+236/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8a%2F70%2F5f7e23f4ef8e66616922e00aa2c7%2F1891260582d84f2598be01c9cd832936"
    },
    {
      "author": "MICHAEL KUNZELMAN, ALANNA DURKIN RICHER",
      "description": "A federal judge has barred Oath Keepers founder Stewart Rhodes from entering Washington, D.C., without the court’s approval after President Donald Trump commuted the far-right extremist group leader’s 18-year prison sentence for orchestrating an attack on the U.S. Capitol four years ago. U.S. District Judge Amit Mehta's order on Friday comes two days after Rhodes visited the Capitol, where he met with at least one lawmaker, chatted with others and defended his actions during a mob’s attack on Jan. 6, 2021. Rhodes was released from a Maryland prison a day earlier.",
      "publishedAt": "2025-01-24T15:45:18Z",
      "title": "Judge bars Oath Keepers founder Rhodes from entering Washington without court's permission",
      "url": "https://apnews.com/article/capitol-riot-rhodes-oath-keepers-3494fd3a8a707a79ac187694572eb58f",
      "urlToImage": "https://dims.apnews.com/dims4/default/a76aed2/2147483647/strip/true/crop/2884x1622+0+152/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fda%2Ff11f193e8c6c2f624c5c663ab181%2F7a43e76a81bc41c695d0328ffe2e5340"
    },
    {
      "author": "MEGAN JANETSKY, EDGAR H. CLEMENTE",
      "description": "Migrants in Mexico who were hoping to come to the U.S. are adjusting to a new and uncertain reality after President Donald Trump began cracking down on border security. Many remain determined to reach the U.S. through more dangerous means, riding freight trains, hiring smugglers and dodging authorities. Some lined up in Mexico’s refugee offices to seek asylum in that country. Others are contemplating finding a way back home. Trump has declared a national emergency at the U.S.-Mexico border and is sending U.S. troops, saying he wants to halt illegal entry and border crime.",
      "publishedAt": "2025-01-24T05:05:02Z",
      "title": "Asylum-seekers pushed to new extremes in Mexico after Trump's border crackdown begins",
      "url": "https://apnews.com/article/immigration-mexico-trump-22702c081ec8e8fec5f53e130b00b9ae",
      "urlToImage": "https://dims.apnews.com/dims4/default/644d1e6/2147483647/strip/true/crop/5452x3067+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F87%2F8eb78793ae7438303a46aa5c37e5%2F27ccc2d8f32e4b41870eba5f09f9aa47"
    },
    {
      "author": "TIFFANY STANLEY",
      "description": "The Right Rev. Mariann Budde, Episcopal bishop of the Diocese of Washington, made headlines this week after she angered President Donald Trump with her sermon during an inaugural prayer service. It was not the first time the cleric has publicly disagreed with Trump, but it became a striking moment in what is usually a staid and scripted event. Budde made a direct appeal to Trump in her sermon, asking him to have mercy on members of the LGBTQ+ community and migrants who are in the country illegally. Trump later claimed Budde is a “Radical Left hard line Trump hater” on his Truth Social site.",
      "publishedAt": "2025-01-24T14:47:30Z",
      "title": "Who is Mariann Budde, the Episcopal bishop who upset Trump during an inaugural prayer service?",
      "url": "https://apnews.com/article/trump-inaugural-prayer-service-episcopal-bishop-mariann-budde-60d409d1ba9b69ad1065065b9218c558",
      "urlToImage": "https://dims.apnews.com/dims4/default/214596a/2147483647/strip/true/crop/4937x2777+0+257/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2Fbb%2Fa99cc68baeba113bd13fd0683993%2F0a90a9dc909c4644befa84b60080671e"
    },
    {
      "author": "WILL WEISSERT, CHRIS MEGERIAN",
      "description": "President Donald Trump is heading to hurricane-battered western North Carolina and wildfire-ravaged Los Angeles. It's the first trip of his second term. Trump has frequently blended politics and disasters, and Friday will likely be no different. He has sharply criticized President Joe Biden's administration for its handling of Hurricane Helene in North Carolina, and he's suggested withholding money from California unless it changes water policies. Trump will follow those stops with a Saturday victory rally in Las Vegas, where he plans to start detailing how he can begin keeping a campaign promise to exclude tips from federal taxes.",
      "publishedAt": "2025-01-24T05:05:04Z",
      "title": "Trump to visit disaster zones in North Carolina and California on first trip of second term",
      "url": "https://apnews.com/article/trump-first-trip-california-north-carolina-nevada-b906880254ce7bf249c3dcefa45bf846",
      "urlToImage": "https://dims.apnews.com/dims4/default/a2e286f/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F39%2F1e68945b0535510cdd007e62811b%2Ff0988800cf5c4ac3ba66c8d5add1f771"
    },
    {
      "author": "AMY TAXIN",
      "description": "President Donald Trump is criticizing California water policy as he prepares to tour wildfire damage in Los Angeles. Since the fires broke out Jan. 7, Trump has accused the state of sending too much water to the Pacific Ocean instead of south toward Los Angeles. But the federally managed Central Valley Project doesn't carry water to the nation's second most-populous city and mostly supplies farms. The Metropolitan Water District of Southern California says it has ample storage to meet the region's water needs.",
      "publishedAt": "2025-01-24T05:09:50Z",
      "title": "Trump targets California water policy as he prepares to tour LA fire damage",
      "url": "https://apnews.com/article/california-water-trump-delta-smelt-farmers-943082304d6ec61511fb1a0b95ca771a",
      "urlToImage": "https://dims.apnews.com/dims4/default/993529d/2147483647/strip/true/crop/4320x2430+0+225/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe4%2F16%2F939a07676ab129d81e00604d18e5%2Fc6e37c5c7a184ddcabff7f7105e0229a"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}