{
  "articles": [
    {
      "author": "MELANIE LINDMAN, WAFAA SHURAFA, and SAMY MAGDY",
      "description": "JERUSALEM (AP) — Tens of thousands of Israelis thronged central Jerusalem on Sunday in the largest anti-government protest since the country went to war in October.",
      "publishedAt": "2024-03-31T11:31:42Z",
      "title": "Israelis stage largest protest since war began to increase pressure on Netanyahu",
      "url": "https://apnews.com/2dfbc154409ae6160b4e594b1b346e13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c7014449d9984edeb168b248b1e0d4eb/1920.jpeg"
    },
    {
      "author": "ABBY SEWELL and QASSIM ABDUL-ZAHRA",
      "description": "BAGHDAD (AP) — A pro basketball team in Iraq is owned by a paramilitary group, and some of its forces recently attacked U.S.",
      "publishedAt": "2024-04-01T04:04:09Z",
      "title": "Americans star on an Iraqi basketball team. Its owners include forces that attacked US troops",
      "url": "https://apnews.com/f60be49545f919ab9145613e010f0e6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c2bd6324b912462eabca539299e60b76/3000.jpeg"
    },
    {
      "author": "MIKE PESOLI and JEFFREY COLLINS",
      "description": "BALTIMORE (AP) — As divers assisted crews with the complicated and meticulous operation of removing the steel and concrete from the fallen Francis Scott Key Bridge in Baltimore, some near the site took time on Easter Sunday to reflect on the six workers presumed to have plunged to their deaths.",
      "publishedAt": "2024-03-31T17:00:51Z",
      "title": "Crews at Baltimore bridge collapse continue meticulous work of removing twisted steel and concrete",
      "url": "https://apnews.com/e656b7f2efcc7770de9c2d922faa7b20",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/69677de0298041dba5d99b0044de9347/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT and JILL COLVIN",
      "description": "WASHINGTON (AP) — The video shared by former President Donald Trump features horror movie music and footage of migrants purportedly entering the U.S.",
      "publishedAt": "2024-04-01T04:04:30Z",
      "title": "Trump’s immigration rhetoric makes inroads with some Democrats. That could be a concern for Biden",
      "url": "https://apnews.com/327c08045edcc200f850d893de6a79d6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa48b52b5d93495db28859fed3e86f27/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUITO, Ecuador (AP) — Gunmen attacked a group of people in Ecuador ’s coastal city of Guayaquil killing nine and injuring 10 others, police said Sunday, the latest in a string of violent incidents in the South American country.",
      "publishedAt": "2024-03-31T17:42:15Z",
      "title": "Gunmen in Ecuador kill 9, injure 10 others in attack in coastal city of Guayaquil as violence surges",
      "url": "https://apnews.com/82895468cbeafd6246a59840a35741cd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/959dadd55e154201b1f4c7ced91749b5/3000.jpeg"
    },
    {
      "author": "NICOLE WINFIELD",
      "description": "ROME (AP) — Pope Francis rallied from a winter-long bout of respiratory problems to lead some 60,000 people in Easter celebrations Sunday, making a strong appeal for a cease-fire in Gaza and a prisoner swap between Russia and Ukraine.",
      "publishedAt": "2024-03-31T08:40:45Z",
      "title": "Pope overcomes health concerns to preside over Easter Mass and appeal for peace in Gaza and Ukraine",
      "url": "https://apnews.com/a89541850baa416f69060ae8e699abac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c97517b4c7d9495d8706419e2f7ecfce/3000.jpeg"
    },
    {
      "author": "ELLEN KNICKMEYER",
      "description": "WASHINGTON (AP) — Through his office window at what was then one of Africa's few modern clinics dealing with HIV and AIDS, the man who now oversees the United States' threatened global AIDS effort used to hear the sound of taxis pulling up throughout the day.",
      "publishedAt": "2024-04-01T04:30:19Z",
      "title": "The pioneer of America's embattled global HIV program recalls the hope after years of despair",
      "url": "https://apnews.com/43b09c9ad24530d24161a95b2fb80eaa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e51f6c76b9c4f758124e76e037ab242/3000.jpeg"
    },
    {
      "author": "WYATTE GRANTHAM-PHILIPS",
      "description": "NEW YORK (AP) — The theft of sensitive information belonging to millions of AT&amp;T's current and former customers has been recently discovered online, the telecommunications giant said this weekend.",
      "publishedAt": "2024-03-31T21:32:53Z",
      "title": "AT&T says a data breach leaked millions of customers' information online. Were you affected?",
      "url": "https://apnews.com/f0dda2b1d266a6068ffc607afd94b779",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/650120b63e2e4165a29d078cdc4871a2/3000.jpeg"
    },
    {
      "author": "SUZAN FRASER and CINAR KIPER",
      "description": "ANKARA, Turkey (AP) — Turkey's main opposition party retained its control over key cities and made huge gains elsewhere in Sunday's local elections, in a major upset to President Recep Tayyip Erdogan, who had set his sights on retaking control of those urban areas.",
      "publishedAt": "2024-03-31T04:06:09Z",
      "title": "In setback to Turkey's Erdogan, opposition makes huge gains in local election",
      "url": "https://apnews.com/8adc4df56cdbce24f78900e1d142ff21",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4773d807a04c4d4b9808fc71ad5635aa/3000.jpeg"
    },
    {
      "author": "STEPHEN HAWKINS",
      "description": "DALLAS (AP) — Bruising big man DJ Burns Jr. plays with plenty of joy, skipping on and off the floor and interacting with North Carolina State fans that he often works into a frenzy with slick moves and a soft-touch shot.",
      "publishedAt": "2024-03-31T23:46:09Z",
      "title": "N.C. State and its 2 DJs headed to 1st Final Four since 1983 after 76-64 win over Duke",
      "url": "https://apnews.com/a478e615394bc5c005641ce08aafe571",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/68475dbeb6344767b0a4af8eadee02d5/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}