{
  "articles": [
    {
      "author": "CALVIN WOODWARD",
      "description": "WASHINGTON (AP) — Sunday was to be a day of relative rest for Donald Trump, a rare breather this deep into a presidential campaign. Aside from sounding off on social media, golf was on the agenda.Then the Secret Service spotted the muzzle of a rifle sticking out of a fence in bushes at Trump's West Palm Beach golf club, and everything changed.",
      "publishedAt": "2024-09-16T05:42:30Z",
      "title": "Trump was on the links taking a breather from the campaign. Then the Secret Service saw a rifle",
      "url": "https://apnews.com/f0ace849dda2b99cb281aed5b9a7ea95",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/260a3c78787048efb68affc19398c242/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, COLLEEN LONG, ERIC TUCKER, ZEKE MILLER and STEPHANY MATAT",
      "description": "WEST PALM BEACH, Fla. (AP) — Donald Trump was the target of what the FBI said “appears to be an attempted assassination” at his golf club in West Palm Beach, Florida, on Sunday, just nine weeks after the Republican presidential nominee survived another attempt on his life.",
      "publishedAt": "2024-09-15T18:44:03Z",
      "title": "Trump was the subject of an apparent assassination attempt at his Florida golf club, the FBI says",
      "url": "https://apnews.com/f62f8378d3a8ce7b2e99d6a8fb40aba9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e6a7c0586bd941f0951ddf8f5641b8f3/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Gunshots were reported in Donald Trump's vicinity Sunday afternoon. The former president is safe.",
      "publishedAt": "2024-09-15T19:31:45Z",
      "title": "The Latest: Man held after apparent Trump assassination attempt was filmed by AP in Kyiv in 2022",
      "url": "https://apnews.com/b67bf3760319363a75c6b95222846aa7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0937c64cb85840f9ac676ebce5dc4c98/1920.jpeg"
    },
    {
      "author": "JILL COLVIN",
      "description": "NEW YORK (AP) — An apparent attempt to assassinate former President Donald Trump as he played golf in Florida has rocked a presidential campaign already marred by violence and raised questions about how such a thing could have happened for the second time in as many months.",
      "publishedAt": "2024-09-16T02:58:50Z",
      "title": "Apparent attempt on Trump's life raises questions about how it could have happened again",
      "url": "https://apnews.com/b989e21dae38e7220ccfaccb02abd151",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd90768fa5534cfa8701f99a37f0198c/3000.jpeg"
    },
    {
      "author": "ADRIANA GOMEZ LICON",
      "description": "FORT LAUDERDALE, Fla. (AP) — Former President Donald Trump is safe following what the FBI says \"appears to be an attempted assassination” while playing golf two months after another attempt on his life at a rally in Pennsylvania.",
      "publishedAt": "2024-09-16T00:22:10Z",
      "title": "5 things to know about the apparent assassination attempt on Trump at one of his golf courses",
      "url": "https://apnews.com/564c56e167c3cdc6c50f6a2e91db9a6c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0937c64cb85840f9ac676ebce5dc4c98/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "Palestinian officials say Israeli airstrikes On Monday killed 16 people in the Gaza Strip, including five women and four children.A strike flattened a home in the built-up Nuseirat refugee camp in central Gaza, killing at least 10 people there, including four women and two children.",
      "publishedAt": "2024-09-16T05:31:45Z",
      "title": "Israel-Hamas war latest: Israeli airstrikes kill 16 in Gaza, including 4 children, Palestinians say",
      "url": "https://apnews.com/a794f441dbfddebe87fd9b95c28008fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9a19205e999a40a0b834ff96803ae2c6/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ, GISELA SALOMON and DEVI SHASTRI",
      "description": "McALLEN, Texas (AP) — For three days, the staff of an Orlando medical clinic encouraged a woman with abdominal pain who called the triage line to go to the hospital. She resisted, scared of a 2023 Florida law that required hospitals to ask whether a patient was in the U.S.",
      "publishedAt": "2024-09-16T04:01:19Z",
      "title": "Florida hospitals ask immigrants about their legal status. Texas will try it next",
      "url": "https://apnews.com/21faed1d4d1b984ea3557d09f22dab9d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cdb507dff17348558070ff710bb8da98/2063.jpeg"
    },
    {
      "author": "ALLEN G. BREED and TIM SULLIVAN",
      "description": "BLUFFTON, South Carolina (AP) — On the first day of his American National Government class, Prof. Kevin Dopf asks how many of his students are United States citizens. Every hand shoots up.“So, how did all you people become citizens?” he asks.",
      "publishedAt": "2024-09-16T04:11:20Z",
      "title": "Is 'Judge Judy' on the Supreme Court? Lack of civics knowledge leads to colleges filling the gap",
      "url": "https://apnews.com/704d8abe56c0fc9b2c9a35187dacdc99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bc25aa4348c143c8907da55e500d1773/1920.jpeg"
    },
    {
      "author": "MARK KENNEDY",
      "description": "The last Emmys — in January, the 75th edition — went reunion crazy on such a big birthday, with cast reunions of such classic series as “Cheers,” “The Sopranos,” “It’s Always Sunny in Philadelphia” and “All in the Family.” The latest Emmys said: “Hold my applause.”",
      "publishedAt": "2024-09-16T01:47:34Z",
      "title": "Emmy Moments: Hosts gently mock 'The Bear,' while TV moms, 'Happy Days' and 'West Wing' celebrated",
      "url": "https://apnews.com/7dba313a6fde0d1b53ec8de2a645f0fd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/310e0d532afc4b1b8315c936791d4cc9/3000.jpeg"
    },
    {
      "author": "BRIAN P. D. HANNON",
      "description": "Tito Jackson, one of the brothers who made up the beloved pop group the Jackson 5, has died at age 70.Tito was the third of nine Jackson children, which include global superstars Michael and sister Janet, part of a music-making family whose songs are still beloved today.",
      "publishedAt": "2024-09-16T05:56:49Z",
      "title": "Tito Jackson’s family says the Jackson 5 member has died at 70",
      "url": "https://apnews.com/03d6bfb14b84b27d99f9c26411d83a8a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03a6e50d9e6f42dda62158d34c005136/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}