{
  "articles": [
    {
      "author": null,
      "description": "The Senate is slogging through an overnight session as Republican leaders search for ways to secure support for President Donald Trump’s big bill of tax breaks and spending cuts. For almost 18 hours the Senate has been in what's called vote-a-rama, fending off proposed amendments mostly from Democrats trying to defeat the package. Senate Majority Leader John Thune of South Dakota is working to strike a last-minute agreement between Republicans worried the bill’s reductions to Medicaid will leave millions without care and his conservative flank seeking steeper cuts to hold down deficits ballooning with the tax cuts. Trump urged them on in a midnight social media post.",
      "publishedAt": "2025-07-01T06:50:57Z",
      "title": "Senate Republicans seek support for Trump’s big bill in overnight session",
      "url": "https://apnews.com/article/congress-tax-cuts-trump-big-bill-bf3f94471b13db3e5d50f0cd1f8fe793",
      "urlToImage": "https://dims.apnews.com/dims4/default/aec4038/2147483647/strip/true/crop/4721x2656+0+246/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F53%2Fa7888428f4914c2efaa988a84b6d%2F9cd159c826b24f5f8d70765ee4132785"
    },
    {
      "author": null,
      "description": "At some 887 pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations. Now it’s up to the Republican-controlled Congress to decide whether President Donald Trump’s signature domestic policy package will become law. The Senate passed the bill Tuesday with Vice President JD Vance casting the tie-breaking vote. Now, it's the House's turn to consider. The bill would make permanent many of the tax breaks passed in Trump's first term while also adding new ones, such as no tax on tips or overtime.",
      "publishedAt": "2025-07-01T20:05:35Z",
      "title": "What's in the latest version of Trump's big bill",
      "url": "https://apnews.com/article/inside-trump-republican-spending-bill-provisions-details-06eb10bad4fd2a7ea2ac236e6535e61d",
      "urlToImage": "https://dims.apnews.com/dims4/default/640fa02/2147483647/strip/true/crop/5876x3305+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2F4f%2F9b40c7c90634883fa7b2cbb22d9f%2F4848db0607744a889293d7af549eb407"
    },
    {
      "author": null,
      "description": "Over 150 international charities and humanitarian groups are calling for disbanding a controversial Israeli- and U.S.-backed system to distribute aid in Gaza. That's because of chaos and deadly violence against Palestinians seeking food at sites run by the Gaza Humanitarian Foundation. At least 10 Palestinians were killed Tuesday while seeking aid in southern and central Gaza. Meanwhile, Israeli Prime Minister Benjamin Netanyahu says he plans to meet with U.S. President Donald Trump next week in Washington. Trump has signaled that he is ready for Israel and Hamas to wind down the war in Gaza.",
      "publishedAt": "2025-07-01T09:59:14Z",
      "title": "Humanitarian groups seek end to Israeli-backed aid system in Gaza",
      "url": "https://apnews.com/article/mideast-wars-gaza-netanyahu-trump-d0cf0cc79fa687d76807dfe40ddf7b21",
      "urlToImage": "https://dims.apnews.com/dims4/default/482295b/2147483647/strip/true/crop/3753x2111+0+195/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6d%2F8b%2F6f076914a522c6f0125f0be3533e%2Fdd2dbf9aac8b4695bdd60b1322d6db03"
    },
    {
      "author": null,
      "description": "The U.S. is halting some shipments of air defense missiles and other munitions to Ukraine amid concerns that its own stockpiles of such supplies have declined too much, officials said Tuesday. The munitions were previously promised to Ukraine for use during its ongoing war with Russia under the Biden administration. But the pause reflects a new set of priorities under President Donald Trump. The Pentagon review determined that stocks were too low on some items previously pledged, so pending shipments of some items won’t be sent, according to a U.S. official, who spoke on condition of anonymity to provide information that has not yet been made public.",
      "publishedAt": "2025-07-01T22:56:16Z",
      "title": "US won't send some weapons pledged to Ukraine",
      "url": "https://apnews.com/article/ukraine-us-weapons-shipments-halt-review-48229eb7c814419631a16067a38d6a1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/0b439e4/2147483647/strip/true/crop/3023x1700+0+157/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F9a%2F63f482c7a7f1a3c735213dc0ae3a%2F303a8cd5980d4486b9e07c86c4509200"
    },
    {
      "author": null,
      "description": "President Donald Trump says migrants would need to know “how to run away from an alligator” to flee the new detention center he’s visiting in a remote area of the Florida Everglades. Trump is heading there on Tuesday for a firsthand look at a facility the White House suggests will be especially secure given its dangerous natural surroundings. The detention center has been assembled on an isolated airstrip. It has drawn protests over the potential impact on a delicate ecosystem and for a potentially cruel message the Republican president is trying to send to immigrants. A key selling point for the White House is the site’s remoteness.",
      "publishedAt": "2025-07-01T04:02:41Z",
      "title": "Trump will visit immigration detention site in the Florida Everglades",
      "url": "https://apnews.com/article/trump-everglades-immigrant-detention-facility-visit-5dc5568ec15534947c29c9149b773d1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/5dd2f0c/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F9a%2Fca00cc65c22b50557ebc40a006d6%2Ff53e6a8a1368429ba86b76a1565624de"
    },
    {
      "author": null,
      "description": "The jury deliberating at Sean “Diddy” Combs’ sex trafficking trial has asked to review critical testimony from one of the prosecution’s most important witnesses: the hip-hop mogul’s former longtime girlfriend Cassie. Jurors requested the testimony on Tuesday about 75 minutes into their second day of weighing charges that Combs used his fame, wealth and violence to force two girlfriends into drug-fueled sex marathons with male sex workers known as “freak-offs” or “hotel nights.” Among the requests: the panel of eight men and four women asked for Cassie’s account of Combs beating, kicking and dragging her at a Los Angeles hotel in 2016 — an assault captured on now-infamous security camera footage.",
      "publishedAt": "2025-07-01T04:05:34Z",
      "title": "Jury at Sean 'Diddy' Combs' sex trafficking trial asks for review of Cassie's testimony",
      "url": "https://apnews.com/article/sean-combs-diddy-trial-jury-deliberations-25c62300cae33ca9f18aee28788449b5",
      "urlToImage": "https://dims.apnews.com/dims4/default/d03410e/2147483647/strip/true/crop/4905x2759+0+255/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F51%2F80%2F09a6b0c1f96f0fd7919de74d9b2f%2Feac8d5a12d124ca885a751f871fa203c"
    },
    {
      "author": null,
      "description": "The University of Pennsylvania has agreed to ban transgender women from its women’s sports teams to resolve a federal civil rights case that found the school violated the rights of female athletes. The U.S. Education Department announced the voluntary agreement on Tuesday. The case focused on Lia Thomas, the transgender swimmer who last competed for the Ivy League school in Philadelphia in 2022 and was the first openly transgender athlete to win a Division I title that year. Under the agreement, Penn agreed to restore all individual Division I swimming records and titles to female athletes who lost to Thomas.",
      "publishedAt": "2025-07-01T20:23:16Z",
      "title": "UPenn bans transgender athletes from women's sports",
      "url": "https://apnews.com/article/upenn-lia-thomas-swimmer-transgender-athletes-trump-71720ecbeb8493ddbed539dd61995076",
      "urlToImage": "https://dims.apnews.com/dims4/default/5317409/2147483647/strip/true/crop/3000x1688+0+24/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2Fa7%2Fa132817e84bb3dabcbf45611d6a1%2Ff262813285e647a8bf218419115b36bf"
    },
    {
      "author": null,
      "description": "Bryan Kohberger has agreed to plead guilty to murdering four University of Idaho students as part of a deal with prosecutors to avoid the death penalty. Shanon Gray, an attorney for the family of victim Kaylee Goncalves, has confirmed that families of the victims received the news in a letter from prosecutors Monday. A change of plea hearing is set for Wednesday. Kohberger, 30, is accused in the stabbing deaths of Goncalves, Ethan Chapin, Xana Kernodle and Madison Mogen at a rental home near campus in Moscow, Idaho, in November 2022. Kohberger was arrested in Pennsylvania weeks after the killings. He had been a criminal justice graduate student at Washington State University.",
      "publishedAt": "2025-07-01T05:07:36Z",
      "title": "Bryan Kohberger to plead guilty to murder in Idaho college stabbings",
      "url": "https://apnews.com/article/kohberger-idaho-students-killed-plea-deal-9226e0768186084d1748d72fa1ed587e",
      "urlToImage": "https://dims.apnews.com/dims4/default/c7efc15/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff8%2F64%2Fc6b1d75e4190ea061f27d5b355f8%2F0ac5d9f239a84c93b4fab2197cef16f2"
    },
    {
      "author": null,
      "description": "Civil and voting rights activists gathered in Jackson, Mississippi, to honor what would have been the 100th birthday of civil rights leader Medgar Evers. Evers was assassinated by a white supremacist in 1963. The 2025 Democracy in Action Convening, a four-day conference, celebrated Evers last week. Former Georgia state Rep. Stacey Abrams headlined the four-day conference. Abrams, also a voting rights activist, railed against recent actions by President Donald Trump’s administration and denounced recent acts of political violence.",
      "publishedAt": "2025-07-02T05:02:43Z",
      "title": "Activists honor assassinated civil rights leader Medgar Evers' birthday",
      "url": "https://apnews.com/article/medgar-evers-birthday-political-violence-civil-rights-227475c9b286a94eba98ae24295b8d6e",
      "urlToImage": "https://dims.apnews.com/dims4/default/8a81470/2147483647/strip/true/crop/3000x1688+0+306/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2F0a%2F9976bef1e38dd8bfcff12496beee%2F348a4936f91e4725a5820c4bc98a2da1"
    },
    {
      "author": null,
      "description": "Jimmy Swaggart, the televangelist whose multimillion-dollar ministry was crippled by his encounters with prostitutes, has died. He was 90. His death was announced Tuesday. The Louisiana native was best known for being a captivating Pentecostal preacher with a massive following before being caught on camera with a prostitute in New Orleans in 1988, one of several TV preachers brought down in the 1980s and ’90s by sex scandals. He continued preaching for decades, but with a reduced audience. In a tearful 1988 sermon, he wept and apologized, telling parishioners across the nation, “I have sinned against you.”",
      "publishedAt": "2025-07-01T15:24:44Z",
      "title": "Televangelist Jimmy Swaggart dies at 90",
      "url": "https://apnews.com/article/jimmy-swaggart-dies-obituary-ae4b9f551dc141cc820437ab7c194766",
      "urlToImage": "https://dims.apnews.com/dims4/default/2c3c602/2147483647/strip/true/crop/2998x1686+0+148/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F8d%2Fa4623702bc8b1dc7379da893ae95%2F4e60d7338d7241368d7224663ece667d"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}