{
  "articles": [
    {
      "author": "JULIA FRANKEL and WAFAA SHURAFA",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Tiers of graves are stacked deep underground in a bloated Gaza cemetery, where Sa’di Baraka spends his days hacking at the earth, making room for more dead.",
      "publishedAt": "2024-08-15T10:43:28Z",
      "title": "As Gaza death toll passes 40,000, corpses are buried in yards, streets, tiered graves",
      "url": "https://apnews.com/988d16b648e06e222f04964dc9440da0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7324a26694034ed099568ad064fc0055/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "More than 40,000 Palestinians have been killed in the Israel-Hamas war in Gaza, which is now in its 11th month, the territory’s Health Ministry said Thursday. This photo gallery highlights images of Palestinians as they mourn their loved ones, as captured by Associated Press photographer Fatima Shbair throughout the war in Gaza.",
      "publishedAt": "2024-08-15T10:32:58Z",
      "title": "AP Photos: Gaza In Mourning",
      "url": "https://apnews.com/8e79e824c75698414537b52af374c414",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7d3ac681bec449dd957ed9109bd8ab2f/3000.jpeg"
    },
    {
      "author": "ABBY SEWELL and TIA GOLDENBERG",
      "description": "DOHA, Qatar (AP) — International mediators were set to hold a new round of talks Thursday aimed at halting the Israel-Hamas war and securing the release of scores of hostages, with a potential deal seen as the best hope of heading off an even larger regional conflict.",
      "publishedAt": "2024-08-15T06:28:38Z",
      "title": "Mediators are set to hold new Gaza cease-fire talks, hoping to head off an even wider war",
      "url": "https://apnews.com/a6a5b35859e1d1d1511729b40a71f837",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9c293078e8684ea19cd54c5b3e66ee3a/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — Ukraine's stunning incursion into Russia’s Kursk border region was a bold gamble for the country's military commanders, who committed their limited resources to a risky assault on a nuclear-armed enemy with no assurance of success.",
      "publishedAt": "2024-08-15T04:28:16Z",
      "title": "Ukraine gambled on an incursion deep into Russian territory. The bold move changed the battlefield",
      "url": "https://apnews.com/e862afd58c65d6d2d5b7b3747423ca4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dbcbe15c55874093ab3d9b8eade2e736/3000.jpeg"
    },
    {
      "author": null,
      "description": "BEDMINSTER, N.J. (AP) — Former President Donald Trump invited reporters to his New Jersey golf club Thursday for his second news conference in as many weeks as he adjusts to a newly energized Democratic ticket ahead of next week's Democratic National Convention.",
      "publishedAt": "2024-08-15T04:08:40Z",
      "title": "Trump scheduled to hold news conference at his New Jersey golf resort",
      "url": "https://apnews.com/9af8036585d6727b6bb07008c0690cdf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac9925cac8804757b8d85b391f440138/3000.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — As the Democratic National Convention approaches, a poll from The Associated Press-NORC Center for Public Affairs Research finds that Democrats have slightly higher trust in Vice President Kamala Harris' ability to address the issue of climate change than President Joe Biden.",
      "publishedAt": "2024-08-15T04:01:47Z",
      "title": "Democrats trust Harris slightly more than Biden on climate change, an AP-NORC poll finds",
      "url": "https://apnews.com/affebfcfe34d3f5e38c37bf597f10953",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eba26ab93ad741bf9336a0bd25899555/3000.jpeg"
    },
    {
      "author": "AMANDA SEITZ and ZEKE MILLER",
      "description": "WASHINGTON (AP) — The Biden administration is taking a victory lap after federal officials inked deals with drug companies to lower the price for 10 of Medicare’s most popular and costliest drugs, but shared few immediate details about the new price older Americans will pay when they fill those prescriptions.",
      "publishedAt": "2024-08-15T09:04:28Z",
      "title": "White House says deals struck to cut prices of popular Medicare drugs that cost $50 billion yearly",
      "url": "https://apnews.com/34886d6f362c242be268c05d5efd5411",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1cdc4794d4294c6a80bd17dd1a534b2f/3000.jpeg"
    },
    {
      "author": "DÁNICA COTO",
      "description": "TOA BAJA, Puerto Rico (AP) — Hurricane Ernesto dropped torrential rain on Puerto Rico and knocked out power for nearly half of all customers in the U.S.",
      "publishedAt": "2024-08-14T10:42:25Z",
      "title": "Hurricane Ernesto drops torrential rain on Puerto Rico as it strengthens heading toward Bermuda",
      "url": "https://apnews.com/cb633e600fad24430d3d540f8a522974",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f201728f2835470e8ed64de0d82d0055/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and PHILIP MARCELO",
      "description": "NEW YORK (AP) — Columbia University President Minouche Shafik resigned Wednesday after a brief, tumultuous tenure that saw the head of the prestigious New York university face heavy scrutiny for her handling of protests and campus divisions over the Israel-Hamas war.",
      "publishedAt": "2024-08-15T00:18:43Z",
      "title": "Columbia's president resigns after months of turmoil punctuated by clashes over Israel-Hamas war",
      "url": "https://apnews.com/2497a023eecdd267f3f9189e9f010fce",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ab29cefbdb041ad99435bf1d4ecfadd/3000.jpeg"
    },
    {
      "author": "JOCELYN GECKER, BIANCA VÁZQUEZ TONESS and SHARON LURYE",
      "description": "MEDFORD, Mass. (AP) — Flerentin “Flex” Jean-Baptiste missed so much school he had to repeat his freshman year at Medford High outside Boston. At school, “you do the same thing every day,” said Jean-Baptiste, who was absent 30 days his first year.",
      "publishedAt": "2024-08-15T04:05:31Z",
      "title": "Millions of kids are still skipping school. Could the answer be recess — and a little cash?",
      "url": "https://apnews.com/270f6d07041760e90bf84d9f4108aa4d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/289bc050ef8b4480b3e74ecad409e904/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}