{
  "articles": [
    {
      "author": "STEVE PEOPLES, COLLEEN LONG and NICHOLAS RICCARDI",
      "description": "WASHINGTON (AP) — As the presidential race moves into its final weeks, Democrat Kamala Harris and Republican Donald Trump embarked on an interview blitz that offered new details about their policy priorities and their political strategies.",
      "publishedAt": "2024-10-16T19:22:16Z",
      "title": "Harris and Trump offer new details about policies and strategy in dueling interviews",
      "url": "https://apnews.com/13718f1c4f17586c33dab88d928152ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6514c8581c0e42b590eac68ddf303d07/3000.jpeg"
    },
    {
      "author": "MOHAMMAD ZAATARI, KAREEM CHEHAYEB, and SALLY ABOU ALJOUD",
      "description": "QANA, Lebanon (AP) — Israeli airstrikes pounded areas across Lebanon, killing at least 27 people over the past 24 hours, officials said Wednesday, including more than a dozen in a southern town where Israeli bombardments in previous conflicts are seared into local memory.",
      "publishedAt": "2024-10-16T06:10:50Z",
      "title": "Israeli strikes kill 27 in Lebanon, including in a town with a dark history of civilian deaths",
      "url": "https://apnews.com/f18b2e0f5e05eb11a3c2ee29c16ed867",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee4182eb775347f485ea43c401c91d6b/1920.jpeg"
    },
    {
      "author": "WILL WEISSERT, ADRIANA GOMEZ LICON and THOMAS BEAUMONT",
      "description": "WASHINGTON CROSSING, Pa. (AP) — Surrounded by more than 100 former Republican office holders and officials, Democrat Kamala Harris urged GOP voters on Wednesday to put “country first” and abandon Donald Trump.",
      "publishedAt": "2024-10-16T13:07:09Z",
      "title": "Harris calls on Republican voters to put 'country first' as Trump woos Latino voters",
      "url": "https://apnews.com/8975f37859dc16de3a7e8a99c5d07760",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03164ae72c8247b798a97e3883606315/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO",
      "description": "HOUSTON (AP) — A Texas state board on Wednesday declined to stop what could be the first execution in the U.S. in a case tied to the diagnosis of shaken baby syndrome, rejecting clemency pleas from a man whose claims of innocence have drawn wide support, including from Republican lawmakers and a detective who say the conviction was based on faulty science.",
      "publishedAt": "2024-10-16T05:04:18Z",
      "title": "A Texas board rejects clemency plea from a man facing execution in shaken baby syndrome case",
      "url": "https://apnews.com/da54c842eb5f55d24cd30b542060e2ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ce58ce647a64aff8c11df99bc36f79c/3000.jpeg"
    },
    {
      "author": "SAMYA KULLAB and HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — President Volodymyr Zelenskyy told lawmakers Wednesday that Ukraine’s Western partners are increasing pressure to negotiate with Russia, but he hinted such talks would be unfavorable to Kyiv as he unveiled what he called his “victory plan” for the war.",
      "publishedAt": "2024-10-16T04:03:35Z",
      "title": "Zelenskyy outlines his 'victory plan' to Ukraine's lawmakers, including a call to join NATO",
      "url": "https://apnews.com/f3525550f6986f590777193a7385c0c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2a79e2e83f454393aec9261d5e53d6d3/3000.jpeg"
    },
    {
      "author": null,
      "description": "MENDENHALL, Miss. (AP) — At least three people died and four were critically injured after a Mississippi bridge, in the process of being demolished, collapsed Wednesday afternoon while work was being conducted at the site, authorities said.",
      "publishedAt": "2024-10-16T22:29:22Z",
      "title": "3 dead and 4 injured in Mississippi bridge collapse, sheriff says",
      "url": "https://apnews.com/8cd9304e5087888d3f07229def714f90",
      "urlToImage": ""
    },
    {
      "author": "CARLA K. JOHNSON",
      "description": "People with HIV can safely receive donated kidneys from deceased donors with the virus, according to a large study that comes as the U.S. government moves to expand the practice. That could shorten the wait for organs for all, regardless of HIV status.",
      "publishedAt": "2024-10-16T21:04:25Z",
      "title": "Kidney transplants are safe between people with HIV, new US study shows",
      "url": "https://apnews.com/ebfeb22cf6df39bac3d11613102fdecb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6a42d2774bf04ba2979954b233e410c7/3000.jpeg"
    },
    {
      "author": "GIADA ZAMPANO and PAOLO SANTALUCIA",
      "description": "ROME (AP) — Italy on Wednesday criminalized citizens who go abroad to have children through surrogacy, a measure slammed by opponents as “medieval\" and discriminatory to same-sex couples.The measure extending a surrogacy ban in place since 2004 was promoted by Premier Giorgia Meloni's far-right Brothers of Italy party and its conservative coalition partner, the League, asserting that it protects women’s dignity.",
      "publishedAt": "2024-10-16T19:08:22Z",
      "title": "Italy expands its ban on surrogacy to overseas as critics say it targets same-sex couples",
      "url": "https://apnews.com/3f1181480a71a01166b38540e7c25103",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bb2a401779d448bd8ca7292c94da652d/3000.jpeg"
    },
    {
      "author": "ISABEL DEBRE and KAITLYN HUAMANI",
      "description": "BUENOS AIRES, Argentina (AP) — Former One Direction singer Liam Payne, 31, was found dead after falling from a hotel balcony in Buenos Aires on Wednesday, local officials said.",
      "publishedAt": "2024-10-16T21:58:04Z",
      "title": "Liam Payne, former One Direction member, dies at 31 in Argentina hotel fall",
      "url": "https://apnews.com/6b7893a56e0d8701096775f611399dd8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6adacc9fd8ff4f3fb9fca953c901d54d/3000.jpeg"
    },
    {
      "author": "EDDIE PELLS",
      "description": "The time-honored tradition of high school athletes proudly sitting behind a table and signing a national letter of intent is a thing of the past. In its place starting in a matter of weeks, athletes will ink their name to something different — a financial aid package that will likely be tied to a revenue-sharing contract.",
      "publishedAt": "2024-10-16T19:48:25Z",
      "title": "Signings of the times: Banished letters of intent, shrunk transfer window equals more college chaos",
      "url": "https://apnews.com/2b08287a918a90b4be0d444f46ebf881",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a18205f4c2a44509870f0df576d7afc4/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}