{
  "articles": [
    {
      "author": "Rebecca Santana",
      "description": "The secretary of Homeland Security is requiring that all officers on the ground in Minneapolis wear body cameras. Secretary Kristi Noem made the announcement Monday on the social media platform X. The news of the body cameras comes as Minneapolis has been the site of intense scrutiny over the conduct of immigration enforcement agents. There have been increased calls by critics of Homeland Security to require all of the department’s officers who are responsible for immigration enforcement to wear body cameras.",
      "publishedAt": "2026-02-02T21:52:27Z",
      "title": "Every Homeland Security officer in Minneapolis is now being issued a body-worn camera, Noem says",
      "url": "https://apnews.com/article/immigration-enforcement-minneapolis-secretary-noem-homeland-security-37af4947057e64efee5e43a8f2e018bb",
      "urlToImage": "https://dims.apnews.com/dims4/default/e5a7f64/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2F63%2F4e9efaabb95ad3bbc8aa2787c932%2F6ce1f6ff63714c388365c1fd578ec465"
    },
    {
      "author": "Mike Catalini",
      "description": "The father of a 5-year-old boy detained by immigration officers in Texas denies abandoning his son. Adrian Conejo Arias is originally from Ecuador. He tells ABC News he loves his son, Liam, and disputes claims from the Department of Homeland Security that he left his child in a vehicle. Assistant Homeland Security Secretary Tricia McLaughlin said Arias fled on foot, leaving his son behind. Arias claims he was unjustly arrested and is in the U.S. legally with a pending asylum hearing. A federal judge ordered their release over the weekend, and they returned to Minnesota.",
      "publishedAt": "2026-02-02T17:54:15Z",
      "title": "Father of 5-year-old detained in Minnesota disputes government account",
      "url": "https://apnews.com/article/immigration-minnesota-trump-ice-liam-5cd3379ce44db7a38ad0b2c5e910da54",
      "urlToImage": "https://dims.apnews.com/dims4/default/f4bb2e3/2147483647/strip/true/crop/1200x800+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F27%2Fc2%2F534149dc4e843b6fffa8b51dc69a%2Ffc295c0e1e2a4db5b2ff5c1d5110baa0"
    },
    {
      "author": "Lisa Mascaro",
      "description": "House Speaker Mike Johnson faces tough days ahead trying to pass a federal funding package and prevent a prolonged partial government shutdown. Democrats are demanding changes to rein in the Trump administration’s immigration enforcement operations after the deaths in Minneapolis. But Republicans are making their own demands in support of President Donald Trump's crackdown on illegal immigration. A partial shutdown started over the weekend when funding lapsed for several agencies. Trump struck a deal with senators, who approved new funding, but only temporarily for Homeland Security until Feb. 13. That would give Congress time to consider new restrictions on Immigration and Customs Enforcement. Johnson now needs Trump to help push that deal through the House.",
      "publishedAt": "2026-02-02T05:01:58Z",
      "title": "Speaker Johnson faces tough choices as partial government shutdown drags on",
      "url": "https://apnews.com/article/government-shutdown-house-johnson-trump-ice-democrats-bb4cfeaab5f3a17e2fde5c23bb27677f",
      "urlToImage": "https://dims.apnews.com/dims4/default/c9d3aaf/2147483647/strip/true/crop/7416x4941+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2Fa9%2F9e9fd5c19883ae4dd12092ce30c2%2F3c49ad578b8a4e4191e0a102c15d13e2"
    },
    {
      "author": "Josh Boak, Aamer Madhani",
      "description": "President Donald Trump said Monday that he plans to lower tariffs on goods from India to 18%, from 25%, after Indian Prime Minister Narendra Modi agreed to stop buying Russian oil. The move comes after months after Trump pressing India to cut its reliance on cheap Russian crude. India has taken advantage of slacked Russian oil prices as much of the world has sought to isolate Moscow for its February 2022 invasion of Ukraine.",
      "publishedAt": "2026-02-02T17:27:03Z",
      "title": "Trump says he plans to lower tariffs on India to 18% after India agreed to stop buying Russian oil",
      "url": "https://apnews.com/article/trump-india-tariffs-russia-oil-7ca672c7d00d543782d61116e482172c",
      "urlToImage": "https://dims.apnews.com/dims4/default/ee4f9af/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4b%2Fa7%2Ffd2d603a3a383faec1524c3a4af3%2F395757170b9d4b81be90d052b27e86dc"
    },
    {
      "author": null,
      "description": "An Arizona sheriff says “We do in fact have a crime scene” as authorities search for the 84-year-old mother of “Today” show host Savannah Guthrie, who was reported missing over the weekend. Speaking during a Monday morning news conference, Pima County Sheriff Chris Nanos said there are signs at the home indicating Nancy Guthrie did not leave on her own. Nanos said at a news conference Sunday night that Nancy Guthrie was last seen around 9:30 p.m. Saturday at her home in the Tucson area. Her family reported her missing midday Sunday. Nanos says Nancy Guthrie has physical ailments, but no cognitive issues. He says the homicide team is also involved, which isn't standard for such cases.",
      "publishedAt": "2026-02-02T13:41:44Z",
      "title": "Arizona sheriff confirms crime scene in search for Savannah Guthrie's missing mother",
      "url": "https://apnews.com/article/savannah-guthrie-mother-missing-arizona-tucson-6c7b78d17d7b647c64f71f64ecaecf8b",
      "urlToImage": "https://dims.apnews.com/dims4/default/039ef24/2147483647/strip/true/crop/3485x2322+8+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F33%2F89%2F33973dc649dbe34e480442b6c920%2F2dfae915dd9c47bab6b313653ef01709"
    },
    {
      "author": "Luis Andres Henao",
      "description": "Faith leaders and hundreds of supporters have gathered at a church in Springfield, Ohio, to support Haitian migrants fearing the end of their Temporary Protected Status in the U.S. The event Monday at St. John Missionary Baptist Church called for an extension of TPS, which is set to expire Tuesday. Last year, the Department of Homeland Security announced plans to end TPS for about 500,000 Haitians, citing improved conditions in the Caribbean island country. The Springfield Haitian community remains anxious, fearing deportation and anti-immigrant sentiment. Many are staying home, stockpiling supplies and signing caregiver affidavits that might keep their children out of foster care if they themselves get detained or deported.",
      "publishedAt": "2026-02-02T19:13:13Z",
      "title": "Haitians in the US pray and hope for an extension of their protected status",
      "url": "https://apnews.com/article/haiti-springfield-immigration-ruling-202aef9c838bec43d19d6f1d67766b77",
      "urlToImage": "https://dims.apnews.com/dims4/default/b0fdcfe/2147483647/strip/true/crop/7008x4670+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F2b%2F6c1413e7b3102b2cd62ec62c443a%2F81e38f05e23245419f6affee9d2996b2"
    },
    {
      "author": "Bernard Condon, Matt O'Brien",
      "description": "Elon Musk is joining his space exploration and artificial intelligence ventures into a single company before a massive planned initial public offering for the business later this year. His rocket venture, SpaceX, announced on Monday that it had bought xAI in an effort to help the world’s richest man dominate the rocket and artificial intelligence businesses. The deal will combine several of his offerings, including his AI chatbot Grok, his satellite communications company Starlink, and his social media company X.",
      "publishedAt": "2026-02-02T22:47:04Z",
      "title": "Elon Musk joins his rocket and AI businesses into a single company",
      "url": "https://apnews.com/article/spacex-xai-musk-space-2079f03fa888652b7fe836afe8b670a1",
      "urlToImage": "https://dims.apnews.com/dims4/default/bb0ccde/2147483647/strip/true/crop/2182x1454+0+3/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F72%2F68%2Fe18af1992d043f541e7e6b4556ca%2F154a9a56332943d69579f721cc09713a"
    },
    {
      "author": "Samy Magdy, Josef Federman",
      "description": "Egyptian and Israeli security officials say Gaza’s Rafah border crossing with Egypt has reopened for limited traffic, a key step as the ceasefire moves ahead. The Egyptian official said 50 Palestinians would cross in each direction in the first day of the crossing’s operation. The official, involved in talks related the implementation of ceasefire deal, spoke to the AP anonymously to discuss confidential information. State-run Egyptian media and an Israeli security official also confirmed the opening. The current ceasefire has halted more than two years of war between Israel and Hamas that began with the Hamas-led attack on southern Israel on Oct. 7, 2023.",
      "publishedAt": "2026-02-02T07:36:14Z",
      "title": "Gaza’s Rafah border crossing with Egypt reopens for limited traffic",
      "url": "https://apnews.com/article/rafah-gaza-israel-palestinians-egypt-crossing-b78d6a15790148a697634cd303c3b5a9",
      "urlToImage": "https://dims.apnews.com/dims4/default/fbe0e13/2147483647/strip/true/crop/5192x3460+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F43%2F52%2F47f28a20f5942727fd10d3fdec3b%2F2d3c2f9aa7a240299889cbcd556261f2"
    },
    {
      "author": "Laura Ungar",
      "description": "A new study suggests that babies are able to distinguish between the different objects they see around them at 2 months old, which earlier than scientists previously thought. The findings may help doctors and researchers better understand cognitive development in infancy. The study looked at data from 130 2-month-olds who underwent functional brain imaging while awake. The babies viewed images from 12 categories commonly seen in the first year of life, such as trees and animals. Results were published in Nature Neuroscience on Monday,",
      "publishedAt": "2026-02-02T16:03:11Z",
      "title": "Babies can distinguish different objects at 2 months, study suggests",
      "url": "https://apnews.com/article/infant-cognition-fmri-413157c62297ccd034aa046cc9793af1",
      "urlToImage": "https://dims.apnews.com/dims4/default/1f68394/2147483647/strip/true/crop/2448x1631+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fab%2F2f%2F7711b91adcdec31849f3653557ec%2F4312f1a31e9343f4b2826a5828557f9b"
    },
    {
      "author": "Jennifer Peltz",
      "description": "The Westminster Kennel Club Dog Show spotlights bond between people and dogs. But reaching the United States’ premier canine event also can be about another kind of love. Just ask professional dog handlers Bill and Taffe McFadden. He's a two-time Westminster-winning handler. She handled the second-place winner in 2019. He says it would be very hard to hard to do the job without someone just as vested in it. The McFaddens were back Monday for the 150th annual Westminster show. The multi-round, breed-by-breed competition is underway. Best in show gets awarded Tuesday night.",
      "publishedAt": "2026-02-02T21:50:04Z",
      "title": "Westminster show couples bond over dogs, and each other",
      "url": "https://apnews.com/article/westminster-dog-show-150th-couples-12bb9efd3292859879d7ebae4bc1ffaf",
      "urlToImage": "https://dims.apnews.com/dims4/default/f0c6bf4/2147483647/strip/true/crop/4000x2665+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F16%2Fa7%2F752433d81a87ae13d47a1076bb73%2F815cda561dce4422b187acd09aa31960"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}