{
  "articles": [
    {
      "author": "JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Three weeks ago, the Israeli military unveiled a detailed 3D model of Gaza’s Shifa Hospital – showing a series of underground installations that it said was part of an elaborate Hamas command and control center under the territory’s largest health-care center.",
      "publishedAt": "2023-11-20T20:02:17Z",
      "title": "Israel reveals signs of Hamas activity at Shifa, but a promised command center remains elusive",
      "url": "https://apnews.com/a017ba154c816c8d565393917dadd9ee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6c52c1958133461a8626cc6f313d09b7/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY and JACK JEFFERY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli forces pressed their offensive against Hamas in northern Gaza on Monday, battling militants around a hospital where thousands of patients and displaced people have been sheltering for weeks, and where despite the fighting health officials managed to evacuate some of the wounded.",
      "publishedAt": "2023-11-20T07:44:40Z",
      "title": "Israel battles Hamas near another Gaza hospital sheltering thousands",
      "url": "https://apnews.com/b566adebfdf002569457ecc949c8c4b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0bbb56372d014b07b7f5f2abfa9a3662/1920.jpeg"
    },
    {
      "author": "CHRISTINA A. CASSIDY and AYANNA ALEXANDER",
      "description": "WASHINGTON (AP) — A divided federal appeals court on Monday ruled that private individuals and groups such as the NAACP do not have the ability to sue under a key section of the federal Voting Rights Act, a decision that contradicts decades of precedent and could further erode protections under the landmark 1965 law.",
      "publishedAt": "2023-11-20T21:45:23Z",
      "title": "Federal appeals court deals a blow to Voting Rights Act, ruling that private plaintiffs can't sue",
      "url": "https://apnews.com/00b9c4bb2174aa8077db296c3edf7c79",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b69a8781b9224bc9b6c02e9c1e93b325/3000.jpeg"
    },
    {
      "author": "AUDREY McAVOY and BEATRICE DUPUY",
      "description": "HONOLULU (AP) — A U.S. Navy plane overshot a runway and went into a bay in Hawaii, and when emergency workers got to the scene, military officials told them that all nine people aboard made it safely to shore with no injuries, spokesperson Shayne Enright of the Honolulu Emergency Medical Services Department said Monday.",
      "publishedAt": "2023-11-21T01:01:46Z",
      "title": "All 9 aboard US Navy plane that overshot runway escape injury, Hawaii official says",
      "url": "https://apnews.com/f24da12b2db265a90c475227a511ebe3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/47abaca1b9284b94ad5867d9bb142399/3000.jpeg"
    },
    {
      "author": "COURTNEY BONNELL and MATT O'BRIEN",
      "description": "The company that created ChatGPT was thrown into turmoil Monday after Microsoft hired its ousted CEO and many employees threatened to follow him in a conflict that centered in part on how to build artificial intelligence that's smarter than humans.",
      "publishedAt": "2023-11-20T09:27:54Z",
      "title": "Company that created ChatGPT is thrown into turmoil after Microsoft hires its ousted CEO",
      "url": "https://apnews.com/a110b173c3eff4a374992017f05cd45a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0e7e5ab51dbe4ef380dce65cf732e02e/3000.jpeg"
    },
    {
      "author": "UZMI ATHAR, Press Trust of India",
      "description": "NEW DELHI (AP) — Manju Devi suffered in pain for two months last year as she worked on a farm near Delhi, unable to break away from duties that sometimes had her standing for hours in the waist-deep water of a rice paddy, lifting heavy loads in intense heat and spraying pesticides and insecticides.",
      "publishedAt": "2023-11-21T02:02:19Z",
      "title": "Climate change hits women's health harder. Activists want leaders to address it at COP28",
      "url": "https://apnews.com/925aee87531d11837e920b5d47dd5d6d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04b3a766041748c2aae084acad96b63f/2750.jpeg"
    },
    {
      "author": "DAVID BILLER and DANIEL POLITI",
      "description": "BUENOS AIRES, Argentina (AP) — His legions of fans call him “the madman” and “the wig” due to his ferocity and unruly mop of hair. He refers to himself as “the lion.” He thinks sex education is a Marxist plot to destroy the family, views his cloned mastiffs as his “children with four paws” and has suggested people should be allowed to sell their own vital organs.",
      "publishedAt": "2023-11-20T06:45:06Z",
      "title": "The lion, the wig and the warrior. Who is Javier Milei, Argentina's president-elect?",
      "url": "https://apnews.com/82488d49cca5aee10d4b911bde530922",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/61d2a141ab0b4b2d85ca7383e40755a8/3000.jpeg"
    },
    {
      "author": "BILL BARROW",
      "description": "PLAINS, Ga. (AP) — Linda Campbell decorated the Lions Club Christmas tree in her small hometown just as she would any other Thanksgiving week, but this was no ordinary Monday in late November.All around Plains, neighbors mourned the death of their matriarch, former U.S.",
      "publishedAt": "2023-11-20T20:44:02Z",
      "title": "Rosalynn Carter's tiny hometown mourns a global figure who made many contributions at home",
      "url": "https://apnews.com/1dc4151328c1844335e393492bcfa721",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/66a7f94f906947b48ca4c6b6c26c40cb/1920.jpeg"
    },
    {
      "author": "ERIC TUCKER, ALANNA DURKIN RICHER and LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — A federal appeals court appeared inclined Monday to reimpose at least some restrictions on Donald Trump’s speech in his landmark election subversion case. But the judges wrestled with how to craft a gag order that doesn’t infringe on the former president’s free speech rights or prevent him from defending himself on the campaign trail.",
      "publishedAt": "2023-11-20T05:10:37Z",
      "title": "Court seems inclined to keep restricting Trump's trial speech. But gag order could be narrowed",
      "url": "https://apnews.com/f6e37b4193a408a990dd3837609acc8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ad47745df62420fbc196f517ea97438/3000.jpeg"
    },
    {
      "author": "ANDREW DALTON",
      "description": "LOS ANGELES (AP) — A Los Angeles judge ruled Monday that there is enough evidence for A$AP Rocky to stand trial on charges that he fired a gun at a former friend and collaborator on the streets near a Hollywood hotel in 2021.",
      "publishedAt": "2023-11-20T05:12:15Z",
      "title": "A$AP Rocky must stand trial on charges he fired gun at former friend, judge rules",
      "url": "https://apnews.com/e1aee44ace1a01124d1054f6fd0bdf39",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c599a5ef373c4f30a4ad1825da3b74ea/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}