{
  "articles": [
    {
      "author": "BRIAN MELLEY and JILL LAWLESS",
      "description": "LONDON (AP) — Liz Truss, Britain’s shortest-serving prime minister, lost her seat in Parliament in another blow to the defeated Conservative Party.The former prime minister whose premiership lasted just 49 days, lost her Norfolk South West seat to Labour by just several hundred votes.",
      "publishedAt": "2024-07-05T04:26:08Z",
      "title": "Former PM Truss loses her parliamentary seat as Labour sweeps to power in historic UK vote",
      "url": "https://apnews.com/e94f379ea893ec17711fd82cec03b603",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6583719f49f7497797f1d27ab6a2b15b/1920.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "British Prime Minister Rishi Sunak says the British people have “delivered a sobering verdict\" as he conceded that the left-of-center Labour Party has won the general election and can form a government to replace the Conservatives for the first time in 14 years.",
      "publishedAt": "2024-07-04T06:07:33Z",
      "title": "The Latest | UK leader Sunak concedes that Labour has won the election",
      "url": "https://apnews.com/bcb7d9ae72243a069eedfb872010a201",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d47fb6e2028f485aae368c95ea662a92/3000.jpeg"
    },
    {
      "author": "JILL LAWLESS",
      "description": "LONDON (AP) — For someone often derided as dull, Keir Starmer has delivered a sensational election result.",
      "publishedAt": "2024-07-05T05:23:16Z",
      "title": "He's derided as dull, but Keir Starmer becomes UK prime minister with a sensational victory",
      "url": "https://apnews.com/e98d16e0810273f6041b61747e084aae",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/49d6074d4015448e9c705959f6d1b8ad/3000.jpeg"
    },
    {
      "author": "JON GAMBRELL and NASSER KARIMI",
      "description": "DUBAI, United Arab Emirates (AP) — Iranians began voting Friday in a runoff election to replace the late President Ebrahim Raisi, killed in a helicopter crash last month, as public apathy has become pervasive in the Islamic Republic after years of economic woes, mass protests and tensions in the Middle East.",
      "publishedAt": "2024-07-05T04:30:46Z",
      "title": "Iran holds runoff presidential vote pitting hard-line former negotiator against reformist lawmaker",
      "url": "https://apnews.com/89bdb24e9074afaa9aa9b7556bf80983",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e9dbf0ce71b4859a41a8b67eb936ede/3000.jpeg"
    },
    {
      "author": "GABRIELA SÁ PESSOA and MAURICIO SAVARESE",
      "description": "SAO PAULO (AP) — The indictment of former Brazilian President Jair Bolsonaro for money laundering and criminal association in connection with undeclared diamonds from Saudi Arabia marked the far-right leader’s second formal accusation with more potentially in store.",
      "publishedAt": "2024-07-05T04:10:14Z",
      "title": "Brazil's Bolsonaro indicted for alleged money laundering for undeclared diamonds from Saudi Arabia",
      "url": "https://apnews.com/feaf8be28c7c60cef518c688449cb6e0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/453cdd332210416f8ffd44085cd760f2/2000.jpeg"
    },
    {
      "author": "COLLEEN LONG, ZEKE MILLER and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — President Joe Biden on Thursday opened a critical stretch in his effort to salvage his imperiled reelection campaign, facing a growing sense that he may have just days to make a persuasive case that he is fit for office before Democratic support for him completely evaporates.",
      "publishedAt": "2024-07-04T16:46:23Z",
      "title": "Biden heads into a make-or-break stretch for his imperiled presidential campaign",
      "url": "https://apnews.com/8866379e91fdb1425bbd2eb5344655c5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84595af96f2b45409d665f6235be80c8/1920.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Former President Donald Trump said during his debate with President Joe Biden last week that the Jan.",
      "publishedAt": "2024-07-05T04:08:31Z",
      "title": "FACT FOCUS: Trump's misleading claims about the Jan. 6, 2021, attack on the Capitol",
      "url": "https://apnews.com/0b3406e02c86bd057e15c9d8c16ccd51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2f59952696e74f33a52010cf190d1705/3000.jpeg"
    },
    {
      "author": "DAVID SHARP",
      "description": "Millions of people in the U.S. celebrated and suffered under heat warnings Thursday as they flocked to beaches and traveled in droves to toast their nation’s birth with July Fourth parades, cookouts and the always anticipated fiery splashes of color in the evening sky.",
      "publishedAt": "2024-07-04T04:07:05Z",
      "title": "Fireworks light up the skies across the US as Americans endure searing heat to celebrate July Fourth",
      "url": "https://apnews.com/602108ca0e195ca52479d37cc1c04b9c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/613c4000cd5044fa945ef871a7a1fcb9/1920.jpeg"
    },
    {
      "author": "MARTÍN SILVA and JOHN MYERS JR.",
      "description": "TULUM, Mexico (AP) — Hurricane Beryl strengthened back into a Category 3 storm and headed for what could be a direct hit on Mexico's Caribbean coast resort of Tulum early Friday, where authorities urged tourists to leave white sand beaches.",
      "publishedAt": "2024-07-05T04:17:27Z",
      "title": "Hurricane Beryl takes aim at the Mexican resort of Tulum as a Category 3 storm",
      "url": "https://apnews.com/4b84e981f62bd53340a385fac42579f5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fbace3055d8428b98830ee24d3ea2b4/1920.jpeg"
    },
    {
      "author": "FARAI MUTSAKA",
      "description": "HARARE, Zimbabwe (AP) — After her son, the family’s shining light and only breadwinner, was arrested last year, Tambudzai Tembo went into meltdown. In Zimbabwe, where clinical mental health services are scarce, her chances of getting professional help were next to zero.",
      "publishedAt": "2024-07-05T05:41:14Z",
      "title": "A bench and a grandmother's ear: Zimbabwe’s novel mental health therapy spreads overseas",
      "url": "https://apnews.com/0a3611a7b800aa3628bd3abe53a131cb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1576e16827f74ec2a13520d389bcd0f2/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}