{
  "articles": [
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — Iran and the United States will exchange prisoners on Monday after nearly $6 billion in once-frozen Iranian assets reached Qatar, a key element of the planned swap, officials said.",
      "publishedAt": "2023-09-18T07:40:35Z",
      "title": "Iran-US prisoner swap appears in motion as nearly $6B in once-frozen Iranian assets reaches Qatar",
      "url": "https://apnews.com/4e1fa477f8e6af45fb764acd259c2f1a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4a54306edb704d97be2f5a9d74607721/3000.jpeg"
    },
    {
      "author": "EDITH M. LEDERER",
      "description": "UNITED NATIONS (AP) — The commitments were far-reaching and ambitious. Among them: End extreme poverty and hunger. Ensure every child on Earth gets a quality secondary education. Achieve gender equality.",
      "publishedAt": "2023-09-18T05:05:22Z",
      "title": "As leaders convene, the UN pushes toward its crucial global goals. But progress is lagging",
      "url": "https://apnews.com/f738131544da7da506bce97db74b4149",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ef5adb5929094830bd82ba800a2e7a36/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "NEW YORK (AP) — Yelling that the future and their lives depend on ending fossil fuels, tens of thousands of protesters on Sunday kicked off a week where leaders will try once again to curb climate change primarily caused by coal, oil and natural gas.",
      "publishedAt": "2023-09-17T18:43:17Z",
      "title": "Tens of thousands march to kick off climate summit, demanding end to warming-causing fossil fuels",
      "url": "https://apnews.com/200f35470e1d6f34f238e9c3c3f7f137",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dd4a61bf820249b5a3106a8c20e8401e/3000.jpeg"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "NEW YORK (AP) — Former President Donald Trump repeatedly declined in an interview aired Sunday to answer questions about whether he watched the Capitol riot unfold on television, saying he would “tell people later at an appropriate time.”",
      "publishedAt": "2023-09-17T14:22:25Z",
      "title": "Trump refuses to say in a TV interview how he watched the Jan. 6 attack unfold at the US Capitol",
      "url": "https://apnews.com/59460113ce82ce6f6140d47856261a56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/728b67fccc794c769e76b256b44a2f7f/2811.jpeg"
    },
    {
      "author": null,
      "description": "MORGANTOWN, Pa (AP) — Nine juveniles who escaped from a detention center in Pennsylvania and were at large for less than a day have been captured, state police said Monday.All will be charged with escape and some may face other charges.",
      "publishedAt": "2023-09-18T07:31:45Z",
      "title": "9 juveniles who escaped from a detention center in Pennsylvania are in custody, police say",
      "url": "https://apnews.com/c2ae63bd91037b14cb88a71b55db742e",
      "urlToImage": ""
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — The warnings were clear but went unheeded.Experts had long said that floods posed a significant danger to two dams meant to protect nearly 90,000 people in the northeast of Libya.",
      "publishedAt": "2023-09-18T04:35:29Z",
      "title": "Libya was mired in chaos and corruption. For years, warnings the Derna dams may burst went unheeded",
      "url": "https://apnews.com/45f76d2ac76be634865539a27b518ada",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9491fa188e594df3b20855249b1ecf9a/3000.jpeg"
    },
    {
      "author": "RIAZAT BUTT",
      "description": "ISLAMABAD (AP) — Two years after the Taliban banned girls from school beyond sixth grade, Afghanistan is the only country in the world with restrictions on female education. Now, the rights of Afghan women and children are on the agenda of the United Nations General Assembly Monday in New York.",
      "publishedAt": "2023-09-18T05:37:32Z",
      "title": "2 years ago, the Taliban banned girls from school. It’s a worsening crisis for all Afghans",
      "url": "https://apnews.com/7046b3dbb76ca76d40343db6ba547556",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b31f5013bad4042acea2b6491b5ab2b/3000.jpeg"
    },
    {
      "author": "KAREL JANICEK",
      "description": "MICHALOVCE, Slovakia (AP) — A populist former prime minister whose party is favored to win Slovakia’s early parliamentary election plans to reverse the country’s military and political support for neighboring Ukraine, in a direct challenge to the European Union and NATO, if he returns to power.",
      "publishedAt": "2023-09-18T05:12:25Z",
      "title": "As Slovakia's trust in democracy fades, its election frontrunner campaigns against aid to Ukraine",
      "url": "https://apnews.com/e9e04e59361d927918ff9e8e6e830694",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b8b726bdfc14e6ab840e878f03ad62d/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY",
      "description": "The same week his state outlawed racial discrimination based on hairstyles, a Black high school student in Texas was suspended because school officials said his locs violated the district's dress code.",
      "publishedAt": "2023-09-18T05:12:11Z",
      "title": "A Black student was suspended for his hairstyle. The school says it wasn't discrimination",
      "url": "https://apnews.com/034a59b9f2652881470dc606b39e5243",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0efbc1cf05cd4793a3f987ea503d88db/3000.jpeg"
    },
    {
      "author": "JOHN O'CONNOR and MELISSA PEREZ WINDER",
      "description": "SPRINGFIELD, Ill. (AP) — For centuries, Europeans carving up the prairie to suit their own idea of settlement dug up the graves of Native Americans as they conquered lands and pushed tribes to the West.",
      "publishedAt": "2023-09-18T04:12:06Z",
      "title": "Centuries after Native American remains were dug up, a new law returns them for reburial in Illinois",
      "url": "https://apnews.com/20a5518e52da998dd8d691bccc93f75f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7fd09bb920a24993bca681ac6fb0b02f/1620.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}