{
  "articles": [
    {
      "author": null,
      "description": "SYDNEY (AP) — A man stabbed five people to death at a busy Sydney shopping center Saturday before he was fatally shot, police said. Multiple people, including a small child, were also injured in the attack.",
      "publishedAt": "2024-04-13T07:18:01Z",
      "title": "A man stabbed to death 5 people in a Sydney shopping center and was fatally shot by police",
      "url": "https://apnews.com/52318d684ebbab17dcac33a833ba0d51",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/945b650b971e4e10995b25bef08e4b9b/1920.jpeg"
    },
    {
      "author": "JON GAMBRELL",
      "description": "DUBAI, United Arab Emirates (AP) — A video seen by The Associated Press shows commandos raiding a ship near the Strait of Hormuz by helicopter Saturday, an attack a Mideast defense official attributed to Iran amid wider tensions between Tehran and the West.",
      "publishedAt": "2024-04-13T08:20:12Z",
      "title": "Video shows raid on ship near Strait of Hormuz that a Mideast official says was carried out by Iran",
      "url": "https://apnews.com/33fcffde2d867380e98c89403776a8ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ae9cdcb51bc428aba45e58d13f6c2c2/430.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and ERIC TUCKER",
      "description": "NEW YORK (AP) — It was the kind of tawdry tale Donald Trump might’ve relished before politics: a porn actress claiming they’d had sex.But on the eve of the 2016 presidential election, Trump feared the story — which he says is false — would cost him votes.",
      "publishedAt": "2024-04-13T04:01:09Z",
      "title": "How a hush money scandal tied to a porn star led to Trump’s first criminal trial",
      "url": "https://apnews.com/e40532d3bce7768e296fdaf9591ef05b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6bbac647cf8e4be5b65e28196d65ba53/2000.jpeg"
    },
    {
      "author": "BEN FINLEY",
      "description": "The Ford Bronco initially was conceived and designed for rugged outdoorsy types, a two-door means of escape to nature from the bustling cities of mid-century America. But it had already been tamed and polished for suburbanites, with cruise control and air conditioning, by 1994 when O.J.",
      "publishedAt": "2024-04-13T04:46:29Z",
      "title": "How O.J. Simpson burned the Ford Bronco into America's collective memory",
      "url": "https://apnews.com/71bfec2bf12112bceb004e6dcfd321df",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6d979d839a7745938127f338a76d78a0/1920.jpeg"
    },
    {
      "author": "STEFANIE DAZIO",
      "description": "LOS ANGELES (AP) — Los Angeles Dodgers star Shohei Ohtani's former longtime interpreter agreed Friday to undergo court-ordered gambling addiction treatment after federal prosecutors accused him of stealing $16 million from the Japanese baseball player to pay off debts.",
      "publishedAt": "2024-04-12T21:16:41Z",
      "title": "Shohei Ohtani's ex-interpreter, Ippei Mizuhara, must get gambling addiction treatment, judge says",
      "url": "https://apnews.com/a3ca696cbb43567457027564159f1d87",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d9d7eeb0ab4941508dadc1335d5bc105/1920.jpeg"
    },
    {
      "author": "ACACIA CORONADO",
      "description": "AUSTIN, Texas (AP) — A ban on diversity, equity and inclusion initiatives in higher education has led to more than 100 job cuts across university campuses in Texas, a hit echoed or anticipated in numerous other states where lawmakers are rolling out similar policies during an important election year.",
      "publishedAt": "2024-04-13T04:04:42Z",
      "title": "Texas' diversity, equity and inclusion ban has led to more than 100 job cuts at state universities",
      "url": "https://apnews.com/939b334d85108e498c0f85d2ad44ebc2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd05ce4277104371ba5f755c670428be/3000.jpeg"
    },
    {
      "author": "COREY WILLIAMS",
      "description": "A University of Michigan proposal aimed at deterring disruptions on its Ann Arbor campus after anti-Israel protesters interrupted an honors convocation is sparking backlash from free speech advocates.",
      "publishedAt": "2024-04-13T04:07:09Z",
      "title": "Some fear University of Michigan proposed policy on protests could quell free speech efforts",
      "url": "https://apnews.com/e22ddd0c7a8a8343bd8158f412195d9b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d55830435ee94b23987820b94945ad2a/3000.jpeg"
    },
    {
      "author": "DIDI TANG and DAKE KANG",
      "description": "WASHINGTON (AP) — Stephen Garrett, a 27-year-old graduate student, always thought he would study in China, but first the country's restrictive COVID-19 policies made it nearly impossible and now he has other concerns.",
      "publishedAt": "2024-04-13T04:02:30Z",
      "title": "Far fewer young Americans now want to study in China, something both countries are trying to fix",
      "url": "https://apnews.com/f5f6e53cd5d3bc686590f2f961165281",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d59e0b78ffc54e0cb07e2d07d3a72287/3000.jpeg"
    },
    {
      "author": "JACK JEFFREY and JULIA FRANKEL",
      "description": "JERUSALEM (AP) — Dozens of Israeli settlers stormed into a Palestinian village in the Israeli-occupied West Bank on Friday, shooting and setting houses and cars on fire.",
      "publishedAt": "2024-04-12T18:15:31Z",
      "title": "A Palestinian is killed as Israeli settlers rampage in his village and troops fire on stone-throwers",
      "url": "https://apnews.com/f85997a95d5579159ffe83d2c0cb988e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c584984f363a446eb2b49d5cb9c0482e/3000.jpeg"
    },
    {
      "author": null,
      "description": "QUETTA, Pakistan (AP) — Pakistani police are searching for gunmen who killed eight people after abducting them from a bus on a highway in the country’s southwest, a police official said Saturday. Earlier, the same attackers killed two people and wounded six in another car they forced to stop.",
      "publishedAt": "2024-04-13T00:08:22Z",
      "title": "Pakistani police search for gunmen who abducted bus passengers and killed 10 in the southwest",
      "url": "https://apnews.com/ac1b42e5613abb8ae390ad0ec3af6e84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b45bbe4f97594fb292f5b4bedc90b1a0/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}