{
  "articles": [
    {
      "author": "WAFAA SHURAFA, NAJIB JOBAIN and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Battles raged across Gaza on Sunday as Israel indicated it was prepared to fight for months or longer to defeat the territory's Hamas rulers, and a key mediator said willingness to discuss a cease-fire was fading.",
      "publishedAt": "2023-12-10T07:28:03Z",
      "title": "Battles rage across Gaza as Israel indicates it's willing to fight for months or more to beat Hamas",
      "url": "https://apnews.com/4414014e31015af32e99a5767b18927c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/696d9d884836475a95a5c27bd860d6e5/3000.jpeg"
    },
    {
      "author": "KRISTIN M. HALL, PATRICK WHITTLE and GARY D. ROBERTSON",
      "description": "NASHVILLE, Tenn. (AP) — Residents of central Tennessee communities slammed by deadly tornadoes this weekend described tragic and terrifying scenes in which one mobile home landed on top of another, roofs were ripped from houses and an entire church collapsed during a string of powerful storms that killed six people.",
      "publishedAt": "2023-12-10T14:14:43Z",
      "title": "Tennessee residents clean up after severe weekend storms killed 6 people and damaged neighborhoods",
      "url": "https://apnews.com/ecc0436ec7480d18dd4972bd07c22e6f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/753b729da62c406f96b255ad1e8b6689/1920.jpeg"
    },
    {
      "author": "MICHAEL R. SISAK and JILL COLVIN",
      "description": "NEW YORK (AP) — Donald Trump said Sunday he has decided against testifying for a second time at his New York civil fraud trial, posting on social media a day before his scheduled appearance that he “very successfully &amp; conclusively” testified last month and saw no need to do so again.",
      "publishedAt": "2023-12-10T20:40:33Z",
      "title": "Trump says he won't testify again at his New York fraud trial. He says he has nothing more to say",
      "url": "https://apnews.com/5710001a228dc333a88e61b18abcfd44",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6340655470054c9d8c6ecad191762d79/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — President Joe Biden and Ukraine's leader, Volodymyr Zelenskyy, will meet at the White House on Tuesday as the U.S. administration steps up the pressure on Congress to provide billions more in aid to Kyiv in its war with Russia.",
      "publishedAt": "2023-12-10T15:59:20Z",
      "title": "Zelenskyy will meet Biden at the White House amid a stepped-up push for Congress to approve more aid",
      "url": "https://apnews.com/32f5f0005a97300ebf2ff2752f8ba83a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e0d21052096b4250a901c3fd93d6e753/3000.jpeg"
    },
    {
      "author": "DAVID BILLER and DÉBORA REY",
      "description": "BUENOS AIRES, Argentina (AP) — It wasn't the most uplifting of inaugural addresses. Rather, Argentina's newly empowered President Javier Milei presented figures to lay bare the scope of the nation's economic “emergency,” and sought to prepare the public for a shock adjustment with drastic public spending cuts.",
      "publishedAt": "2023-12-10T05:05:17Z",
      "title": "In inaugural speech, Argentina's Javier Milei prepares nation for painful shock adjustment",
      "url": "https://apnews.com/46b73d6a705e1c4652303022a37dbbb0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4a185219dad4ca0b46ff5c8b3f51964/1920.jpeg"
    },
    {
      "author": "MARI YAMAGUCHI",
      "description": "TOKYO (AP) — Divers on Sunday recovered the remains of the seventh of the eight crew members from a U.S. military Osprey aircraft that crashed off southern Japan during a training mission.",
      "publishedAt": "2023-12-10T14:53:26Z",
      "title": "Divers recover the seventh of 8 crew members killed in crash of a US military Osprey off Japan",
      "url": "https://apnews.com/eb9303beffde27281ba85c21789f2a01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/914163ce71564a4fa2ad9c38af89b4a3/3000.jpeg"
    },
    {
      "author": "REZA SAIFULLAH and EDNA TARIGAN",
      "description": "ACEH BESAR, Indonesia (AP) — Two boats carrying more than 300 Rohingya Muslims, including emaciated women and children, arrived at Indonesia’s northernmost province of Aceh on Sunday morning after being adrift for weeks.",
      "publishedAt": "2023-12-10T08:23:34Z",
      "title": "Over 300 Rohingya Muslims fleeing Myanmar arrive in Indonesia's Aceh region after weeks at sea",
      "url": "https://apnews.com/83696fd8e1c10bd8b95594c9a8725380",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6404b5bbd99e418daa6fcc944e560c67/3000.jpeg"
    },
    {
      "author": "ANITA SNOW",
      "description": "LUKEVILLE, Ariz. (AP) — Gerston Miranda and his wife were among thousands of migrants recently arriving at this remote area on Arizona's southern border with Mexico, squeezing into the United States through a gap in the wall and walking overnight about 14 miles (23 kilometers) with two school-aged daughters to surrender to Border Patrol agents.",
      "publishedAt": "2023-12-10T05:20:47Z",
      "title": "Smugglers are bringing migrants to a remote Arizona border crossing, overwhelming US agents",
      "url": "https://apnews.com/ae04e8c861a95e98dbfc8d49244cf092",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/dfd5727b07e044459011a5e288042560/3000.jpeg"
    },
    {
      "author": null,
      "description": "PHILADELPHIA (AP) — Students, lawmakers and religious leaders joined forces Sunday at a temple in Philadelphia to strongly denounce antisemitism on college campuses and in their communities.The gathering at Congregation Rodeph Shalom came one day after University of Pennsylvania President Liz Magill resigned amid criticism over her testimony at a congressional hearing.",
      "publishedAt": "2023-12-10T21:45:40Z",
      "title": "Students and lawmakers gather at Philadelphia temple to denounce antisemitism",
      "url": "https://apnews.com/fdc1c8175b936327a57f115c22c64b7f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/050bdf2a0124457a8337eb125e84fce0/3000.jpeg"
    },
    {
      "author": "DAVID BRANDT",
      "description": "PHOENIX (AP) — Shohei Ohtani's jaw-dropping $700 million, 10-year deal with the Los Angeles Dodgers has some similarities to other contracts for the world's biggest sports stars, including soccer icons Lionel Messi and Cristiano Ronaldo, along with NFL quarterback Patrick Mahomes.",
      "publishedAt": "2023-12-10T15:05:01Z",
      "title": "The Dodgers gave Shohei Ohtani $700 million to hit and pitch — but also because he can sell",
      "url": "https://apnews.com/31c707febd0613567805ed54ddde9c9e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/524395bd380c4af7ab5d2338f928b4f9/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}