{
  "articles": [
    {
      "author": "MICHAEL R. SISAK, JENNIFER PELTZ, MICHELLE L. PRICE and ALANNA DURKIN RICHER",
      "description": "NEW YORK (AP) — With prosecutors’ hush money case against Donald Trump barreling toward its end, defense lawyers pressed former attorney Michael Cohen on his criminal history and past lies Thursday as they worked to convince jurors not to believe the star witness' pivotal testimony.",
      "publishedAt": "2024-05-16T04:01:37Z",
      "title": "Michael Cohen pressed on his crimes and lies as defense attacks key Trump hush money trial witness",
      "url": "https://apnews.com/ec08be1219703deb3cd10604844deacb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f98f09f70a204b189062cfc8a2efa45d/3000.jpeg"
    },
    {
      "author": "ALANNA DURKIN RICHER, COLLEEN LONG and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — The White House has blocked the release of audio from President Joe Biden’s interview with a special counsel about his handling of classified documents, arguing Thursday that Republicans in Congress only wanted the recordings “to chop them up” and use them for political purposes.",
      "publishedAt": "2024-05-16T12:31:20Z",
      "title": "White House blocks release of Biden’s special counsel interview audio, says GOP is being political",
      "url": "https://apnews.com/edf67af3810ab877c7c195956b49b3a6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/16455ede5f0e4b66a5b1c9d3720c237b/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — The U.S. military finished installing a floating pier off the Gaza Strip on Thursday, with officials poised to begin ferrying badly needed humanitarian aid into the enclave besieged over seven months of intense fighting in the Israel-Hamas war.",
      "publishedAt": "2024-05-16T06:03:20Z",
      "title": "US military says Gaza pier project is complete and aid will soon flow as Israel-Hamas war rages",
      "url": "https://apnews.com/9414c4148285917f1c858b9590117a84",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d3f3551d7f84487f89642670d377dd8e/3000.jpeg"
    },
    {
      "author": "STEPHEN GROVES",
      "description": "WASHINGTON (AP) — The House was set Thursday to deliver a rebuke to President Joe Biden for pausing a shipment of bombs to Israel, voting on legislation that would seek to force the weapons transfer as Republicans worked to highlight Democratic divisions over the Israel-Hamas war.",
      "publishedAt": "2024-05-16T15:58:09Z",
      "title": "House to vote on requiring delivery of bombs to Israel in GOP-led rebuke of Biden policies",
      "url": "https://apnews.com/735c8d40c3ea9985c65f1b53cbf68fc3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2cbbfa77351f4591858c293e919955b9/3000.jpeg"
    },
    {
      "author": "BELA SZANDELSZKY, PETR DAVID JOSEK and PHILIPP JENNE",
      "description": "BANSKA BYSTRICA, Slovakia (AP) — Slovak authorities charged a man Thursday with attempting to assassinate Prime Minister Robert Fico, saying he acted alone in a politically motivated attack.",
      "publishedAt": "2024-05-16T07:05:22Z",
      "title": "Slovak authorities charge 'lone wolf' with assassination attempt on the prime minister",
      "url": "https://apnews.com/23faba11c0f371ef0f69a34861337ae0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/10ee483690c74c00a52f6be1b533c8f0/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court on Thursday rejected a conservative-led attack that could have undermined the Consumer Financial Protection Bureau.",
      "publishedAt": "2024-05-16T14:11:43Z",
      "title": "Supreme Court sides with the Consumer Financial Protection Bureau, spurning a conservative attack",
      "url": "https://apnews.com/9f30de9bbfa5b25a47804b101fb998e8",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/984cf3b04bf748b2bcb2346b7fb65e4e/3000.jpeg"
    },
    {
      "author": "LINDSAY WHITEHURST",
      "description": "WASHINGTON (AP) — The Justice Department on Thursday formally moved to reclassify marijuana as a less dangerous drug in a historic shift in generations of U.S.",
      "publishedAt": "2024-05-16T17:01:00Z",
      "title": "Justice Department formally moves to reclassify marijuana as a less dangerous drug in historic shift",
      "url": "https://apnews.com/15b43441670757b0c2bfa36731e47d07",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2a02862f043435bbb5eb344ce548368/3000.jpeg"
    },
    {
      "author": "MARGIE MASON and ROBIN McDOWELL",
      "description": "PHOENIX (AP) — Blas Sanchez was nearing the end of a 20-year stretch in an Arizona prison when he was leased out to work at Hickman’s Family Farms, which sells eggs that have ended up in the supply chains of huge companies like McDonald’s, Target and Albertsons.",
      "publishedAt": "2024-05-16T10:06:09Z",
      "title": "US prisoners are being assigned dangerous jobs. But what happens if they are hurt or killed?",
      "url": "https://apnews.com/0ff52ff1735d7e9f858248177a2a60c3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8ac66f41f6974c04acfc9061fb2e2ca8/1920.jpeg"
    },
    {
      "author": "RAF CASERT",
      "description": "BRUSSELS (AP) — In an increasingly vitriolic political climate, the last thing needed in the runup to the June European Union elections was an assassination attempt on one of the bloc’s most controversial figures.",
      "publishedAt": "2024-05-16T15:54:43Z",
      "title": "Shaken by the Fico assassination attempt, the EU wonders if June elections can be free of violence",
      "url": "https://apnews.com/196a08da895556870623d6d16a7bac0b",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/65f334d72e4243a29d38bf7acc4f6f56/3000.jpeg"
    },
    {
      "author": "LUIS ANDRES HENAO",
      "description": "HAVANA (AP) — The 1959 Castro-led revolution installed an atheist, Communist government that sought to replace the Catholic Church as the guiding force in the lives of Cubans.But 65 years later, religion seems omnipresent in Cuba, in dazzling diversity.",
      "publishedAt": "2024-05-16T12:16:17Z",
      "title": "Afro-Cuban drums, Muslim prayers, Buddhist mantras: Religious diversity blooms in once-atheist Cuba",
      "url": "https://apnews.com/1a471b0c0100140d2f74c0ce1f6e03ac",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ce97c3f850c14646bc58bc826c899c41/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}