{
  "articles": [
    {
      "author": "ISABEL DeBRE, EDITH M. LEDERER and WAFAA SHURAFA",
      "description": "JERUSALEM (AP) — Palestinians fled in a mass exodus Friday from northern Gaza after Israel’s military told some 1 million people to evacuate to the southern part of the besieged territory ahead of an expected ground invasion in retaliation for the surprise attack by the ruling Hamas militant group.",
      "publishedAt": "2023-10-13T04:00:40Z",
      "title": "Palestinians flee northern Gaza after Israel orders 1 million to evacuate as ground attack looms",
      "url": "https://apnews.com/c8b4fc20e4fd2ef381d5edb7e9e8308c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f96d9a6143a6430e8d430079dd4e5c8d/1920.jpeg"
    },
    {
      "author": "ISABEL DEBRE and FATIMA SHBAIR",
      "description": "GAZA CITY, Gaza Strip (AP) — Watching the pulverized alleys of Jabaliya refugee camp in northern Gaza empty of people, Naji Jamal was frozen with indecision.Should he heed the Israeli army's demand that all Palestinians evacuate and make the risky trip to Gaza's south, where his only certainty was homelessness?",
      "publishedAt": "2023-10-13T21:14:26Z",
      "title": "Palestinians in Gaza face impossible choice: Stay home under airstrikes, or flee under airstrikes?",
      "url": "https://apnews.com/96aad8b973a181ca5c5fd4f5948f409c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f752a6ed64634bee8c38d1b0fc983dbf/3000.jpeg"
    },
    {
      "author": "Associated Press",
      "description": "In the days since Hamas militants stormed into Israel early Oct. 7, a flood of videos and photos purporting to show the conflict have filled social media, making it difficult for onlookers from around the world to sort fact from fiction.",
      "publishedAt": "2023-10-10T19:13:08Z",
      "title": "FACT FOCUS: Misinformation about the Israel-Hamas war is flooding social media. Here are the facts",
      "url": "https://apnews.com/e58f9ab8696309305c3ea2bfb269258e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cba0c02ebcd14fb2af16d15de5d765b9/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, KEVIN FREKING and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — Republicans chose firebrand Rep. Jim Jordan as their new nominee for House speaker during internal voting Friday, putting the gavel within reach of the staunch ally of GOP presidential front-runner Donald Trump.",
      "publishedAt": "2023-10-13T16:03:53Z",
      "title": "Republicans pick Jim Jordan as nominee for House speaker, putting job within the Trump ally's reach",
      "url": "https://apnews.com/ced017e71de967a7e327cba7e502926a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7ede1e8ca750454b821d3d5c1c78d544/1920.jpeg"
    },
    {
      "author": "AAMER MADHANI",
      "description": "WASHINGTON (AP) — The White House said on Friday that North Korea has delivered more than 1,000 containers of military equipment and munitions to Russia for its ongoing war in Ukraine.",
      "publishedAt": "2023-10-13T16:59:54Z",
      "title": "US says North Korea delivered 1,000 containers of equipment and munitions to Russia for Ukraine war",
      "url": "https://apnews.com/7091eaba254b680888a9b1ec8a68135f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dd98902e07b4664b52aef5b7a0b29a2/3000.jpeg"
    },
    {
      "author": "HILLEL ITALIE",
      "description": "NEW YORK (AP) — Nobel laureate Louise Glück, a poet of unblinking candor and perception who wove classical allusions, philosophical reveries, bittersweet memories and humorous asides into indelible portraits of a fallen and heartrending world, has died at 80.",
      "publishedAt": "2023-10-13T19:27:03Z",
      "title": "Louise Glück, Nobel-winning poet of terse and candid lyricism, dies at 80",
      "url": "https://apnews.com/38648b2dc19644e11f42319145692943",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e96557d6e9164567bfb565cb9947034d/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON, CLAUDIA LAUER, REBECCA BOONE and AUDREY McAVOY",
      "description": "LAHAINA, Hawaii (AP) — Trapped in their cars, in homes or on the beach as flames, black smoke and embers swirled around them, people in the historic Maui town of Lahaina called 911, the one number that might send help or tell them what to do, where to go.",
      "publishedAt": "2023-10-13T20:24:35Z",
      "title": "AP Exclusive: 911 calls from deadly Lahaina wildfire reveal terror and panic in the rush to escape",
      "url": "https://apnews.com/ab4aadbe17c604619ce35b454546dd56",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/30fee277b64941caa1b02ebd403dcba6/1920.jpeg"
    },
    {
      "author": "JOHN LEICESTER, JEFFREY SCHAEFFER and SAM PETREQUIN",
      "description": "ARRAS, France (AP) — A man of Chechen origin who was under surveillance by French security services over suspected Islamic radicalization stabbed a teacher to death at his former high school and wounded three other people Friday in northern France, authorities said.",
      "publishedAt": "2023-10-13T10:33:11Z",
      "title": "French authorities link a school stabbing that killed a teacher to Islamic extremism",
      "url": "https://apnews.com/878f42a5df4a873ca7bd80a173cc9097",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/34b6d6768b784fa3869190bb13b241b4/1920.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — The Supreme Court avoided a catastrophic accident last year when a piece of marble at least 2 feet long crashed to the ground in an interior courtyard used by the justices and their aides, according to several court employees.",
      "publishedAt": "2023-10-13T04:13:40Z",
      "title": "The Supreme Court avoided disaster when a chunk of marble fell in a courtyard used by the justices",
      "url": "https://apnews.com/bb79d2faa7e31f2510b70af467e01a63",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dc63325d52b4d66b7a5f5acca1d611a/3000.jpeg"
    },
    {
      "author": "CHEYANNE MUMPHREY and ANNIE MA",
      "description": "For more than a month, Darryl George, a Black high school student in Texas, spent each school day sitting by himself in punishment over his hairstyle.",
      "publishedAt": "2023-10-13T17:26:04Z",
      "title": "Black student disciplined over hairstyle hopes to 'start being a kid again'",
      "url": "https://apnews.com/ba027664c1c236196eb196b837640df9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/33543da7f84f443796b0fa5fc77debb0/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}