{
  "articles": [
    {
      "author": "ZEKE MILLER, COLLEEN LONG, STEVE KARNOWSKI, WILL WEISSERT and SEUNG MIN KIM",
      "description": "WASHINGTON (AP) — Vice President Kamala Harris picked Minnesota Gov. Tim Walz to be her running mate on Tuesday, turning to an affable longtime politician who Democrats hope can keep newfound party unity alive in a campaign barreling toward Election Day.",
      "publishedAt": "2024-08-06T04:02:16Z",
      "title": "Harris and Minnesota Gov. Tim Walz will debut as the 2024 Democratic ticket at a Philadelphia rally",
      "url": "https://apnews.com/02c7ebce765deef0161708b29fe0069e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ee28cb375431419dba7d23bb66afb95b/1920.jpeg"
    },
    {
      "author": "LINLEY SANDERS",
      "description": "WASHINGTON (AP) — Minnesota Gov. Tim Walz, Vice President Kamala Harris’ running mate pick, will need to introduce himself to the vast majority of Americans.",
      "publishedAt": "2024-08-06T15:35:36Z",
      "title": "What polling shows about Minnesota Gov. Tim Walz, Harris' new running mate",
      "url": "https://apnews.com/b4cc465ca1cabd8f256b99717bc17fdc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cd0eef4603a472cbeff9d8bfebca65b/3000.jpeg"
    },
    {
      "author": "RUSS BYNUM and JEFFREY COLLINS",
      "description": "SAVANNAH, Ga. (AP) — Tropical Storm Debby brought prolonged downpours and flooding to the southeastern United States on Tuesday and was expected to hover over the Atlantic Ocean for the next few days, then boomerang back onto the mainland, leading to potentially record-setting rainfall.",
      "publishedAt": "2024-08-06T04:08:29Z",
      "title": "Slow-moving Tropical Storm Debby bringing torrential rains and flooding to southeastern US",
      "url": "https://apnews.com/211c7968e905576455d10d3706d04193",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a46e5ccae60744608dc39517e801198c/1920.jpeg"
    },
    {
      "author": "JULHAS ALAM and SHEIKH SAALIQ",
      "description": "DHAKA, Bangladesh (AP) — Bangladesh’s president dissolved Parliament Tuesday, clearing the way for new elections to replace the longtime prime minister who resigned and fled the country following weeks of demonstrations against her rule that descended into violence.",
      "publishedAt": "2024-08-06T04:25:51Z",
      "title": "Bangladesh’s president dissolves Parliament, clearing the way for elections to replace ousted leader",
      "url": "https://apnews.com/bca66e8251f86deb3fe28c913d0a1444",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6672df9b500b47ee82edfb955fc50e41/3000.jpeg"
    },
    {
      "author": "KRUTIKA PATHI",
      "description": "NEW DELHI (AP) — In a video that lit up social media feeds in Bangladesh, jubilant protesters climbed atop a statue of Sheikh Mujib Rahman, the country’s first leader after independence, and beat it with iron rods and axes as people below hooted and cheered.",
      "publishedAt": "2024-08-06T14:20:26Z",
      "title": "How a student-run uprising led to the ouster of Bangladesh’s longest-serving prime minister",
      "url": "https://apnews.com/fc19afbef9d1c50aaef08648bf37437f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3ade0c24398840ba98c81f85ae16d06f/3000.jpeg"
    },
    {
      "author": "BY JENNIFER PELTZ",
      "description": "NEW YORK (AP) — The judge in Donald Trump's hush money trial is pushing back a date for a key ruling on presidential immunity until two days before Trump's scheduled sentencing.The immunity decision had been due Sept.",
      "publishedAt": "2024-08-06T14:55:51Z",
      "title": "Judge in Trump's hush money case delays date for ruling on presidential immunity",
      "url": "https://apnews.com/8db10bfa2631bbafdb32a35241a79e4f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36474db466ce442b8b572bfc130ed9a6/3000.jpeg"
    },
    {
      "author": "ADITHI RAMAKRISHNAN",
      "description": "WASHINGTON (AP) — Twenty years ago on an Indonesian island, scientists discovered fossils of an early human species that stood at about 3 1/2 feet (1.07 meters) tall — earning them the nickname “hobbits.”",
      "publishedAt": "2024-08-06T15:02:38Z",
      "title": "Fossils suggest even smaller ‘hobbits’ roamed an Indonesian island 700,000 years ago",
      "url": "https://apnews.com/c618a0c0c08e33418c5a00a6ce4f9fee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a43e3e17279e4290add0843f99a96995/3000.jpeg"
    },
    {
      "author": "The Associated Press",
      "description": "WICHITA FALLS, Tex. (AP) — Elon Musk's social media platform X has sued a group of advertisers, alleging that a “massive advertiser boycott” deprived the company of billions of dollars in revenue and violated antitrust laws.",
      "publishedAt": "2024-08-06T16:36:24Z",
      "title": "Elon Musk's X sues advertisers over alleged 'massive advertiser boycott' after Twitter takeover",
      "url": "https://apnews.com/673d1ae88e9fb0ca5b170d238739453e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/8be998bcb6704897a20e7e3622015244/2531.jpeg"
    },
    {
      "author": "STAN CHOE",
      "description": "NEW YORK (AP) — U.S. stocks are bouncing back, and calm is returning to Wall Street after Japan’s market soared earlier Tuesday to claw back much of the losses from its worst day since 1987.",
      "publishedAt": "2024-08-06T02:13:40Z",
      "title": "Wall Street rallies to bounce back from its worst day in nearly 2 years, as Japanese stocks soar",
      "url": "https://apnews.com/79deff7e82224b37c77ee8867c10a953",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b5cdf686aa124fca9accb75135933f5c/3000.jpeg"
    },
    {
      "author": "JOCELYN NOVECK",
      "description": "PARIS (AP) — Like most self-respecting Parisians, Mathilde Joannard and Franck Tallieu had been training for the Olympic sport of Olympics-bashing.",
      "publishedAt": "2024-08-06T16:24:25Z",
      "title": "Parisians once scoffed at hosting the Olympics. Now, here come the conga lines",
      "url": "https://apnews.com/adb99e38b99a54b8aa9d07c71f75dc47",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/710fd8ab1a664541b3bab300df81cf99/2280.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}