{
  "articles": [
    {
      "author": "DAN MERICA",
      "description": "ASTON, Pa. (AP) — Vice President Kamala Harris said Wednesday that she believes that Donald Trump \"is a fascist” after his longest-serving chief of staff said the former president praised Adolf Hitler while in office and put personal loyalty above the Constitution.",
      "publishedAt": "2024-10-23T13:46:53Z",
      "title": "Harris says Trump 'is a fascist' after John Kelly says he wanted generals like Hitler's",
      "url": "https://apnews.com/87d672e1ec1a6645808050fc60f6b8bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1dd6f41ba37640ebb67977244dcb48bb/1920.jpeg"
    },
    {
      "author": "BILL BARROW and JILL COLVIN",
      "description": "DULUTH, Ga. (AP) — Donald Trump pushed supporters at a rollicking rally Wednesday in Georgia to vote for him — with an early ballot or in-person on Election Day — in a state that will be crucial in the presidential election.",
      "publishedAt": "2024-10-23T11:30:06Z",
      "title": "Donald Trump tells supporters to 'just vote' at lively Georgia rally organized by Charlie Kirk",
      "url": "https://apnews.com/2b3580134a6b19dff18771c3fdb0f11a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/6b31adc9b0cf4887ac3945d8175d7457/3000.jpeg"
    },
    {
      "author": "BASSEM MROUE",
      "description": "BEIRUT (AP) — Inside what was once one of Beirut’s oldest and best-known cinemas, dozens of Lebanese, Palestinians and Syrians displaced by the Israel-Hezbollah war spend their time following the news on their phones, cooking, chatting and walking around to pass the time.",
      "publishedAt": "2024-10-24T04:17:01Z",
      "title": "Massive displacement from Israel-Hezbollah war transforms Beirut’s famed commercial street",
      "url": "https://apnews.com/582c617d6d3b8639c8c8ddec4a6916b7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4ce45511877f4b938965742aaea4001f/3000.jpeg"
    },
    {
      "author": "SYLVIE CORBET",
      "description": "PARIS (AP) — France on Thursday hosts an international conference for Lebanon to rally military and humanitarian aid for the country where war between Hezbollah militants and Israel has displaced a million people, killed over 2,500 and deepened an economic crisis.",
      "publishedAt": "2024-10-24T04:15:58Z",
      "title": "Paris conference aims to rally military and humanitarian support for Lebanon",
      "url": "https://apnews.com/30a97f88d2ec8dc138385d18a31dbb69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/54d6647a77f74acfbd74af22dca6fb00/3000.jpeg"
    },
    {
      "author": "JIM GOMEZ",
      "description": "MANILA, Philippines (AP) — Widespread flooding and landslides set off by a tropical storm in the northeastern Philippines on Thursday left at least 24 people dead, swept away cars and prompted authorities to scramble for motorboats to rescue trapped villagers, some on roofs.",
      "publishedAt": "2024-10-24T02:45:24Z",
      "title": "Tropical storm battering Philippines leaves at least 24 people dead in flooding and landslides",
      "url": "https://apnews.com/85a28c058b1f4685033ab02d34782acf",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/99a70e91e8ec46a3ab3beaf36987205c/1920.jpeg"
    },
    {
      "author": "JOSH BOAK",
      "description": "WASHINGTON (AP) — If the presidential election hinged on abortion or climate change, Kamala Harris might be feeling pretty comfortable about her chances on Nov.",
      "publishedAt": "2024-10-24T04:15:50Z",
      "title": "Voters trust Harris on a number of issues. But is that what they'll vote on?",
      "url": "https://apnews.com/e5c5e76e7d235cc6032e70aeeb5cd560",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/04034905485b419db5f9ec21acd64ae6/2396.jpeg"
    },
    {
      "author": "AMANDA SEITZ and DARLENE SUPERVILLE",
      "description": "WINSTON-SALEM, N.C. (AP) — The TikTok videos haunt 26-year-old Christy Kishbaugh.One seared into her memory shows a young mom talking about how several Idaho emergency rooms rejected her because of the state's abortion ban, leaving her to bleed for weeks after a miscarriage.",
      "publishedAt": "2024-10-24T04:03:38Z",
      "title": "Abortion bans are top of mind for young women in North Carolina as they consider Harris or Trump",
      "url": "https://apnews.com/f14edf1e33c367a430784f7848834514",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cc0e253ff9ed46fb935e21a8cfd47deb/1920.jpeg"
    },
    {
      "author": "JONEL ALECCIA",
      "description": "A food poisoning outbreak tied to McDonald’s Quarter Pounders was caused by a common type of E.",
      "publishedAt": "2024-10-23T19:11:44Z",
      "title": "What to know about E. coli and the McDonald's outbreak",
      "url": "https://apnews.com/080847096a6b7062b4fb17037393fc99",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/7c9711b0b655423c83a5176b71fe7c83/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM and KIM TONG-HYUNG",
      "description": "SEOUL, South Korea (AP) — Trash carried by a North Korean balloon fell on the presidential compound in central Seoul on Thursday, officials said, the second such case in recent months that raise concerns about the vulnerability of key South Korean sites during potential North Korean aggression.",
      "publishedAt": "2024-10-24T00:29:19Z",
      "title": "Trash carried by a North Korean balloon again falls on the presidential compound in Seoul",
      "url": "https://apnews.com/3ab04d8a582e1760d01c2783c2d50b30",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/774f6b0cb4944d34ab3414ffe1f5cdce/2468.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM, LOLITA C. BALDOR and AAMER MADHANI",
      "description": "WASHINGTON (AP) — The U.S. said Wednesday that 3,000 North Korean troops have been deployed to Russia and are training at several locations, calling the move very serious and warning that those forces will be “fair game” if they go into combat in Ukraine.",
      "publishedAt": "2024-10-23T09:00:48Z",
      "title": "US confirms North Korea has sent 3,000 troops to Russia for training and possible Ukraine combat",
      "url": "https://apnews.com/b664f8c1164e9ef859b7a618ffa92140",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/57db2e2afc4b45fb98b02542225341c8/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}