{
  "articles": [
    {
      "author": "MARTHA MENDOZA, BRIAN SLODYSKO and JULIET LINDERMAN",
      "description": "SANTA CRUZ, Calif. (AP) — A woman told police that she was sexually assaulted in 2017 by Pete Hegseth after he took her phone, blocked the door to a California hotel room and refused to let her leave, according to a detailed investigative report made public late Wednesday.",
      "publishedAt": "2024-11-21T07:10:44Z",
      "title": "Police report reveals assault allegations against Hegseth",
      "url": "https://apnews.com/e6ebec0a1a5c7fb51cb5e2198f5e12a5",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/de7fbe0252ca4fc4b42e335a1eac7af9/3000.jpeg"
    },
    {
      "author": "LISA MASCARO, STEPHEN GROVES and FARNOUSH AMIRI",
      "description": "WASHINGTON (AP) — House Ethics Committee Republicans voted Wednesday against releasing the panel’s long-running investigation into President-elect Donald Trump’s nominee for attorney general, former Rep.",
      "publishedAt": "2024-11-20T16:58:00Z",
      "title": "Republicans on House Ethics reject for now releasing report on Matt Gaetz",
      "url": "https://apnews.com/5f9c684bb695df143beffbf8f956b09c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d4d057e1da04436b9b1de261ad908edc/1920.jpeg"
    },
    {
      "author": "BRIAN SLODYSKO, JOSHUA GOODMAN and ALAN SUDERMAN",
      "description": "WASHINGTON (AP) — As incoming White House chief of staff, one of Susie Wiles ’ vexing challenges will be policing the buffet line of powerful interests who want something from Donald Trump.",
      "publishedAt": "2024-11-21T05:02:51Z",
      "title": "Trump's incoming chief of staff is a former lobbyist. She'll face a raft of special interests",
      "url": "https://apnews.com/8e820df743aea61bb966f779541c9820",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5107dcfe135e4dd7b7c8dadee5463a3a/3000.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukraine says Russia launched an intercontinental ballistic missile overnight targeting Dnipro city in the central-east of the country, which, if confirmed, would be the first time Moscow has used such a missile in the war.",
      "publishedAt": "2024-11-21T09:12:40Z",
      "title": "Ukraine says Russia launched an intercontinental missile in an attack for the first time in the war",
      "url": "https://apnews.com/38b0faf6eed2cef98bdbc9be18f58244",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/252048eb21ce4d888d7b3b4dfdf9f559/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG and KAREEM CHEHAYEB",
      "description": "JERUSALEM (AP) — Israeli officials demanded Wednesday the freedom to strike Lebanon's Hezbollah as part of any cease-fire deal, raising a potential complication as a top U.S.",
      "publishedAt": "2024-11-20T15:09:55Z",
      "title": "Israeli officials demand the right to strike Hezbollah under any cease-fire deal for Lebanon",
      "url": "https://apnews.com/1b39fe8499097c2f2579fce50d083263",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/03c9055296b4433b8a2537a5c6fb9a10/3000.jpeg"
    },
    {
      "author": null,
      "description": "PESHAWAR, Pakistan (AP) — Gunmen opened fire on passenger vehicles carrying Shiite Muslims in restive northwest Pakistan on Thursday, killing at least eight people and wounding others, police said.",
      "publishedAt": "2024-11-21T10:26:35Z",
      "title": "Police say gunmen open fire on vehicles in Pakistan's restive northwest, killing at least 8 Shiites",
      "url": "https://apnews.com/42c8fb3cf1f720de49efebd306d76fa1",
      "urlToImage": ""
    },
    {
      "author": "MICHAEL LIEDTKE",
      "description": "U.S. regulators want a federal judge to break up Google to prevent the company from continuing to squash competition through its dominant search engine after a court found it had maintained an abusive monopoly over the past decade.",
      "publishedAt": "2024-11-21T04:01:31Z",
      "title": "US regulators seek to break up Google, forcing Chrome sale as part of monopoly punishment",
      "url": "https://apnews.com/84e07fec51c5c59751d846118cb900a7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26ddd32ffc40438ca117f857e5efea19/3000.jpeg"
    },
    {
      "author": "ASHOK SHARMA",
      "description": "NEW DELHI (AP) — One of Asia’s richest men, controversial Indian tycoon Gautam Adani, is again in the spotlight. His companies’ stocks plunged up to 20% on Thursday after he was indicted by U.S. prosecutors on charges he duped investors in a massive solar energy project in India by concealing that it was being facilitated by an alleged bribery scheme.",
      "publishedAt": "2024-11-21T08:08:50Z",
      "title": "Shares in India's Adani Group plunge 20% after US bribery, fraud indictments",
      "url": "https://apnews.com/cd1ee53edee0df1bf00de01b044366b4",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/216d9149714c4d5e853c77b187cc9a01/3000.jpeg"
    },
    {
      "author": "NOAH BERGER and HALLIE GOLDEN",
      "description": "SANTA ROSA, Calif. (AP) — A major storm pummeled Northern California with rain and snow on Wednesday night and threatened to cause flash flooding and rockslides in the latest wave of damaging weather to wash over the West Coast.",
      "publishedAt": "2024-11-21T06:12:06Z",
      "title": "Rain and snow pummel Northern California in latest wave of damaging weather to strike West Coast",
      "url": "https://apnews.com/8d3f42726c42c64355a47e3f25de27d0",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0a40ef87f23a42dd9cd50cca2dec5149/1920.jpeg"
    },
    {
      "author": "MARCO DI MARCO and DAVID KEYTON",
      "description": "GRINDAVIK, Iceland (AP) — A volcano on the Reykjanes Peninsula in southwestern Iceland has erupted for the seventh time since December.The eruption started with little warning at 11:14 p.m. Wednesday and created a fissure around 3 kilometers (1.8 miles) long.",
      "publishedAt": "2024-11-21T05:04:18Z",
      "title": "Volcano on Iceland's Reykjanes Peninsula erupts for the 7th time in a year",
      "url": "https://apnews.com/08c7742f017556b03818f35cb50a6e1c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/79f11acc68d1463eb9fa01fc859a03d0/1920.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}