{
  "articles": [
    {
      "author": "CHRIS MEGERIAN",
      "description": "JAKARTA, Indonesia (AP) — Vice President Kamala Harris said Wednesday that those responsible for the effort to overturn the results of the 2020 presidential election and the ensuing violence at the U.S Capitol must be held accountable — even if that means Donald Trump.",
      "publishedAt": "2023-09-06T07:48:19Z",
      "title": "The AP Interview: Harris says Trump can't be spared accountability for Jan. 6",
      "url": "https://apnews.com/7ecabc8d9f0117edad8e83a0c37c9134",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3d8b21262db042b181b1f1e234970567/1920.jpeg"
    },
    {
      "author": "SAMYA KULLAB",
      "description": "KYIV, Ukraine (AP) — U.S. Secretary of State Anthony Blinken arrived in Ukraine’s capital Wednesday for an unannounced visit hours after Russia launched a missile attack on the city, in a trip intended to show confidence in Kyiv’s forces amid a grinding counteroffensive.",
      "publishedAt": "2023-09-06T08:23:49Z",
      "title": "Blinken visits Kyiv in show of support for Ukraine's counteroffensive",
      "url": "https://apnews.com/92b9ff2b9328f40516a4e47864d446e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9f45c59b2bbc481784548a16d3ae3013/3000.jpeg"
    },
    {
      "author": "MICHAEL KUNZELMAN, LINDSAY WHITEHURST and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — Former Proud Boys leader Enrique Tarrio was sentenced Tuesday to 22 years in prison for orchestrating a failed plot to keep Donald Trump in power after the Republican lost the 2020 election, capping the case with the stiffest punishment that has been handed down yet for the U.S.",
      "publishedAt": "2023-09-05T10:42:07Z",
      "title": "Proud Boys’ Enrique Tarrio gets record 22 years in prison for Jan. 6 seditious conspiracy",
      "url": "https://apnews.com/da60222b3e1e54902db2bbbb219dc3fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/292a4c6762004eedb95680e056ba0ef0/1920.jpeg"
    },
    {
      "author": "KIM TONG-HYUNG and HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — Reports that Kim Jong Un may travel to Russia soon have drawn attention to the traditional method of travel for North Korean leaders: luxury, armored trains that have long been a part of the dynasty's lore and are symbols of its deep isolation.",
      "publishedAt": "2023-09-06T05:50:33Z",
      "title": "Kim Jong Un's possible trip to Russia could be like his 2019 journey. 20 hours on his armored train",
      "url": "https://apnews.com/dc492f89e8ec39f0ecf5833b1d647d1d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2daa6e508af1426e8b39c455d6726114/3000.jpeg"
    },
    {
      "author": "SHEIKH SAALIQ",
      "description": "NEW DELHI (AP) — Major roads in New Delhi are teeming with giant posters and billboards announcing India’s presidency of this week’s summit of the Group of 20 nations. And one leader’s picture — smiling benignly from every traffic circle — stands out from the rest: Prime Minister Narendra Modi.",
      "publishedAt": "2023-09-06T04:13:16Z",
      "title": "India's prime minister uses the G20 summit to advertise his global reach and court voters at home",
      "url": "https://apnews.com/c690d9fcc27708950af72581ff56bf46",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/9dac8b3bbe36440fa4ba771a02d28621/1920.jpeg"
    },
    {
      "author": "JENNIFER McDERMOTT, JENNIFER SINCO KELLEHER and AUDREY McAVOY",
      "description": "HONOLULU (AP) — After a visit to a warehouse where Hawaiian Electric Company is housing power poles and electrical equipment that may be key to the investigation of last month's devastating fires on Maui, lawyers for Lahaina residents and business owners told a court Tuesday that cable TV and telephone companies share responsibility for the disaster because they allegedly overloaded and destabilized some of the poles.",
      "publishedAt": "2023-09-06T04:09:33Z",
      "title": "Lawyers claim cable TV and phone companies are also responsible in Maui fires",
      "url": "https://apnews.com/34380b2a5921df5b949f9a5f255d1330",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26536923f9d04591be3e359fabaa6c51/3000.jpeg"
    },
    {
      "author": "JAMEY KEATEN and SETH BORENSTEIN",
      "description": "GENEVA (AP) — Earth has sweltered through its hottest Northern Hemisphere summer ever measured, with a record warm August capping a season of brutal and deadly temperatures, according to the World Meteorological Organization.",
      "publishedAt": "2023-09-06T08:02:39Z",
      "title": "This summer was a global record breaker for the highest heat ever measured, meteorologists say",
      "url": "https://apnews.com/b7c7936070952da781af01288607b1f1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0dba696c1b19400f8c2d03ccc4e46cbb/3000.jpeg"
    },
    {
      "author": "JAKE BLEIBERG and PAUL J. WEBER",
      "description": "AUSTIN, Texas (AP) — The impeachment trial of Texas Attorney General Ken Paxton is underway with live television coverage, a former aide who reported him to the FBI on the witness stand and his wife watching from her desk in the state Senate but prohibited from participating.",
      "publishedAt": "2023-09-06T04:46:57Z",
      "title": "Texas AG Ken Paxton's impeachment trial begins with a former ally who reported him to the FBI",
      "url": "https://apnews.com/519956746ed2d3e4a121e70190fd4b3a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/291ee0cc403a4988ae29cd7adeab0bb7/1920.jpeg"
    },
    {
      "author": "DAVID A. LIEB",
      "description": "Democrats got a potential boost for the 2024 congressional elections as courts in Alabama and Florida ruled recently that Republican-led legislatures had unfairly diluted the voting power of Black residents.",
      "publishedAt": "2023-09-06T04:10:44Z",
      "title": "Legal fights over voting districts could play role in control of Congress for 2024",
      "url": "https://apnews.com/75e2764f2cc7c8a2e7e0a0e2848d90e9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e92c0e4c66dc4f02aec9ed1797c325f1/3000.jpeg"
    },
    {
      "author": "JAMES MARTINEZ",
      "description": "NEW YORK (AP) — Tennis has a fuzzy yellow problem most players don’t think about when they open can after can of fresh balls, or when umpires at U.S. Open matches make their frequent requests for “new balls please.”",
      "publishedAt": "2023-09-06T10:01:05Z",
      "title": "Tennis ball wasteland? Game grapples with a fuzzy yellow recycling problem",
      "url": "https://apnews.com/573d1c356560defaaa8a1f997e12e8a1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/86608d4f755a491486864982958faa3a/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}