{
  "articles": [
    {
      "author": "Emilie Megnien, Jeffrey Collins, Jamie Stengle",
      "description": "Texas and Oklahoma are bracing for ice and heavy snow in what forecasters predict will be some of the initial major effects of a huge winter storm. The forecasted days-long event threatens catastrophic damage, extensive power outages and bitterly cold weather in the eastern two-thirds of the U.S. Forecasters warn the storm could rival a hurricane in damage to power lines and trees, especially in areas with heavy ice. The storm is expected to start Friday in New Mexico, Texas and Oklahoma, moving east through the South and then up the coast into New England. Bitterly cold air could follow, with wind chills dropping to minus 50 degrees Fahrenheit in parts of Minnesota and North Dakota.",
      "publishedAt": "2026-01-23T06:00:58Z",
      "title": "Texas and Oklahoma brace for heavy snow and crippling ice",
      "url": "https://apnews.com/article/winter-storm-snow-ice-texas-oklahoma-e970ee13ffaaf870f51dfa1540607604",
      "urlToImage": "https://dims.apnews.com/dims4/default/9377c6e/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffb%2Ffe%2F6b74ea68fa1708678ddad76eea04%2Fbbb9bf56d05f49bdad16889bdef33cbf"
    },
    {
      "author": "Giovanna Dell'Orto",
      "description": "A vast network of labor unions, progressive organizations and clergy has been asking Minnesotans to stay away from work, school and stores Friday to protest against immigration enforcement in the state. The Twin Cities of Minneapolis and St. Paul have seen daily protests since Renee Good was fatally shot by a U.S. Immigration and Customs Enforcement officer during an operation on Jan. 7. Federal law enforcement officers have surged in the area for weeks and have repeatedly squared off with community members and activists who track their movements online and in the streets. But Friday’s mobilization was planned as the largest action to date, including a march in downtown Minneapolis despite dangerously cold temperatures.",
      "publishedAt": "2026-01-23T06:03:30Z",
      "title": "Minnesota plans anti-immigration enforcement protest",
      "url": "https://apnews.com/article/minnesota-ice-immigration-protest-unions-faith-leaders-edc6c4884f8cc26be9ad34a28d82a7a5",
      "urlToImage": "https://dims.apnews.com/dims4/default/ac27d9a/2147483647/strip/true/crop/4000x2665+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1d%2F8b%2Fd1f15a005436db8125f6ff36b6d4%2Fc14ba30bb64f40cbb245b426ab2e7818"
    },
    {
      "author": "Jon Gambrell",
      "description": "Activists report that Iran's crackdown on nationwide protests has killed at least 5,002 people. Many more are feared dead, but information is scarce in part because Iran has imposed the most comprehensive internet blackout in its history. The U.S.-based Human Rights Activists News Agency provided the latest death toll Friday and noted more than 26,800 people have been detained. Iran's government says 3,117 have died, but it has a history of giving lower tolls for political reasons. The Associated Press has been unable to verify these numbers due to the two-week internet shutdown. Meanwhile, the U.S. has moved an aircraft carrier group closer to the Middle East, and President Donald Trump is warning of potential action against Iran.",
      "publishedAt": "2026-01-23T01:56:39Z",
      "title": "Iran's protest crackdown has killed more than 5,000, activists say",
      "url": "https://apnews.com/article/iran-protests-crackdown-death-toll-acb1968a973f19be217ea28b4a7adb0b",
      "urlToImage": "https://dims.apnews.com/dims4/default/969d896/2147483647/strip/true/crop/7859x5237+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2F0e%2F89ce70c59833609365cc4701e539%2Fb4a0c36b59c94051a4e404dbde9a4514"
    },
    {
      "author": "Eric Tucker, Alanna Durkin Richer, Mike Balsamo",
      "description": "Authorities say they have arrested Ryan Wedding, a former Olympic snowboarder facing charges related to drug trafficking and the killing of a federal witnesses. Wedding was arrested Friday, according to two people familiar with the matter who were not authorized to discuss details of the investigation and who spoke to The Associated Press on condition of anonymity. The former Olympian who competed for Canada was on the FBI’s 10 Most Wanted list. Wedding was charged in 2024 with running a drug ring that used semitrucks to move cocaine between Colombia, Mexico, Southern California and Canada.",
      "publishedAt": "2026-01-23T15:07:13Z",
      "title": "Former Olympic snowboarder Ryan Wedding has been arrested",
      "url": "https://apnews.com/article/ryan-wedding-olympic-snowboarder-drug-ring-1ba939875022738f89e0822cb32f0176",
      "urlToImage": "https://dims.apnews.com/dims4/default/52a4bee/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F16%2F525ffa236915d2d5ac3ab4cb4dab%2F8fd83be7db914db1a3b90f4a79c52efd"
    },
    {
      "author": "Geoff Mulvihill",
      "description": "A federal judge says the Trump administration must keep the money flowing for now for programs aimed at helping low-income families with children in five states. The ruling extends by two weeks an earlier one in which a judge ordered the money to continue to flow to California, Colorado, Illinois, Minnesota and New York. Judge Vernon Broderick says he'll decide later whether to order the money be kept moving as the challenge to the action is decided. The U.S. Department of Health and Human Services said on Jan. 6 that it was withholding money because it had “reason to believe” there was fraud in those states, although it didn’t present details or evidence.",
      "publishedAt": "2026-01-23T06:06:44Z",
      "title": "Trump can't withhold funds from 5 Democratic states yet, judge says",
      "url": "https://apnews.com/article/child-care-democratic-states-trump-programs-c844f4822ebbf7031f7e91cb251d5072",
      "urlToImage": "https://dims.apnews.com/dims4/default/213e93d/2147483647/strip/true/crop/3414x2275+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F47%2F8e%2F33850daa2a584f55d76b5d2fb311%2F9dc2481ae44e4c0bbcf10744167174a2"
    },
    {
      "author": null,
      "description": "A member of Haiti’s transitional presidential council has announced that a majority of the panel has voted to fire the country’s embattled Prime Minister Alix Didier Fils-Aimé as the country’s political chaos deepens. Edgard Leblanc Fils made the announcement at a news conference alongside fellow council member Leslie Voltaire, defying U.S. government calls to maintain stability in the country’s leadership. Leblanc said the council would replace Fils-Aimé within 30 days.",
      "publishedAt": "2026-01-23T19:02:00Z",
      "title": "Haiti's transitional council votes to oust Prime Minister Alix Didier Fils-Aimé",
      "url": "https://apnews.com/article/haiti-transitional-council-ousts-prime-minister-filsaime-5ed3d85bdf798b13171ce894ebeca66a",
      "urlToImage": "https://dims.apnews.com/dims4/default/6e5c33f/2147483647/strip/true/crop/2032x1354+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F68%2Faf617c2615296671b1ab27244042%2Fb1d0380a1fbe464a84a0ea2dea9bad7d"
    },
    {
      "author": "Meg Kinnard",
      "description": "Vice President JD Vance is encouraging anti-abortion activists to celebrate progress in limiting abortion. Vance highlights the Trump administration's achievements, including expanding a ban on U.S. foreign aid for groups that support abortion services. Vance spoke Friday at the annual March for Life in Washington, emphasizing the importance of increasing birth rates in the U.S. The Republican vice president also praises the Supreme Court's 2022 decision overturning Roe v. Wade and President Donald Trump's leadership in appointing conservative jurists. The March for Life has become more celebratory since that Supreme Court ruling.",
      "publishedAt": "2026-01-23T19:25:29Z",
      "title": "Vance lauds Trump's record against abortion at March for Life",
      "url": "https://apnews.com/article/march-for-life-vance-abortion-beb7c04a39a54861836f64ae3ba90b56",
      "urlToImage": "https://dims.apnews.com/dims4/default/046fdf7/2147483647/strip/true/crop/7860x5237+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2F12%2F96f42d32b5dbaa14f834e540eb92%2F2be529ca81d94bcf802bd7188598a668"
    },
    {
      "author": "Julie Carr Smyth, Patrick Aftoora Orsagos",
      "description": "An Illinois doctor has pleaded not guilty to murder charges in the December shooting deaths of his ex-wife and her dentist husband in their Columbus home. Thirty-nine-year-old Michael David McKee of Chicago appeared remotely from jail for his arraignment in Franklin County on Friday. He faces aggravated murder and aggravated burglary charges in connection with the Dec. 30 killings of 39-year-old Monique Tepe and 37-year-old Dr. Spencer Tepe. After the release of a videotape sparked dozens of tips from the community, investigators pursued McKee to Rockford, Illinois, where he was arrested Jan. 10. He was returned Tuesday to Ohio.",
      "publishedAt": "2026-01-23T05:05:28Z",
      "title": "Chicago doctor pleads not guilty in Ohio to shooting deaths of ex-wife, husband",
      "url": "https://apnews.com/article/columbus-ohio-couple-murders-dentist-exhusband-charged-7af663eea9f47533079d320ef5a4bc17",
      "urlToImage": "https://dims.apnews.com/dims4/default/83c8788/2147483647/strip/true/crop/2908x1938+274+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc7%2F5d%2Ff081ebee2667d735ed52b05f3a80%2Fd82acfa19a3941d68dd216fcf5b9b642"
    },
    {
      "author": "Seth Borenstein, Tammy Webber",
      "description": "That snowflake icon on your smartphone app might be quick and handy — it just might not be as accurate as a human when the weather gets rough. Experts say that’s especially important during winter storms like the one forecasted to smack the eastern U.S. with a mix of heavy snow, treacherous ice and subzero temperatures. The popular Weather Channel app, for example, uses artificial intelligence to analyze everything from computer models to citizen weather reports. But humans always have the last word. Most experts say the best place to get the most accurate forecast is still probably local television meteorologists.",
      "publishedAt": "2026-01-23T16:28:06Z",
      "title": "Why weather apps may not be the best bet during winter storms",
      "url": "https://apnews.com/article/winter-storm-apps-forecast-accuracy-snow-weather-9768afec5fc53b4faba19f3cfd06a86c",
      "urlToImage": "https://dims.apnews.com/dims4/default/67516bd/2147483647/strip/true/crop/5487x3656+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F3d%2F38b08a7664b9da4f0625ca3f97d3%2F1fd47bce8b184feb99c585c5b01bf0ff"
    },
    {
      "author": "Elaine Kurtenbach",
      "description": "European shares are mixed after markets advanced in Asia. U.S. futures turned lower early Friday. The Bank of Japan kept its key interest rate unchanged, as expected. Oil prices and the prices of gold and silver rose. On Thursday, the S&P 500 climbed 0.5%, extending its rally after President Donald Trump called off tariffs on European countries that he said opposed his calls for U.S. control of Greenland. The Dow Jones Industrial Average rose 0.6%, and the Nasdaq composite gained 0.9%. Details are still sparse about a deal on Greenland that Trump said he reached with the head of NATO, leaving investors wary of what's to come.",
      "publishedAt": "2026-01-23T05:15:33Z",
      "title": "World shares are mixed and US futures slip as investors remain wary",
      "url": "https://apnews.com/article/stocks-markets-japan-trump-6e894c8ecd7de9e05ad245beed41bd3e",
      "urlToImage": "https://dims.apnews.com/dims4/default/6e83e22/2147483647/strip/true/crop/4309x2871+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fab%2F3bfb6c22c5fa860e2e10e102784f%2F8dd17d0cd3344bf59e901fe93b7355a8"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}