{
  "articles": [
    {
      "author": "FELIPE DANA",
      "description": "KYIV, Ukraine (AP) — A Ukrainian drone strike Saturday caused a massive explosion at an ammunition depot in Russia-annexed Crimea, forcing the evacuation of nearby homes in the latest attack since Moscow canceled a landmark grain deal amid Kyiv's grinding efforts to retake its occupied territories.",
      "publishedAt": "2023-07-22T09:57:14Z",
      "title": "Drone hits Crimean ammunition depot as strikes kill, wound civilians and journalists in Ukraine",
      "url": "https://apnews.com/7954cc6c8f2ce4e3fc94c05bba19d96c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3bce64cbc7564a72ad5dfbc83854c2ad/3000.jpeg"
    },
    {
      "author": "ALI JABAR and JARI TANNER",
      "description": "BAGHDAD (AP) — Tensions flared again in Iraq on Saturday over a series of recent protests in Europe involving the desecration of the Quran, Islam’s holy book, which sparked a debate over the balance between freedom of speech and religious sensitivities.",
      "publishedAt": "2023-07-22T07:51:49Z",
      "title": "Protesters try to storm Baghdad's Green Zone over the burning of Quran and Iraqi flag in Denmark",
      "url": "https://apnews.com/08c2c2b8e9ce61963a3d04b08c6f016d",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a55d505a51d943e58a22e22e6536ba60/3000.jpeg"
    },
    {
      "author": "JULIA FRANKEL and JOSEF FEDERMAN",
      "description": "JERUSALEM (AP) — Prime Minister Benjamin Netanyahu was rushed to the hospital early Sunday for an emergency implantation of a heart pacemaker, plunging Israel into deeper turmoil after widespread protests over his contentious judicial overhaul plan.",
      "publishedAt": "2023-07-22T16:56:55Z",
      "title": "Israel's Netanyahu goes to hospital for pacemaker. He says he will push ahead with judicial overhaul",
      "url": "https://apnews.com/266df426ff3f0cc78de0d0593250ea28",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a16587afe8c241c5a50a372fca0bc65f/3000.jpeg"
    },
    {
      "author": "JAKE OFFENHARTZ",
      "description": "NEW YORK (AP) — In the winter of 2010, shortly after police discovered the remains of his roommate and three other women buried on a remote stretch of Long Island shoreline, Dave Schaller provided detectives with a description of the person he believed to be the killer.",
      "publishedAt": "2023-07-22T00:59:10Z",
      "title": "He came face to face with an alleged serial killer. 12 years later, his tip helped crack the case",
      "url": "https://apnews.com/750c938a4e6737b233304db6e3b1f677",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a0c8526675b74f1d881bdc67f25b2040/3000.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — President Joe Biden will establish a national monument honoring Emmett Till, the Black teenager from Chicago who was abducted, tortured and killed in 1955 after he was accused of whistling at a white woman in Mississippi, and his mother, a White House official said Saturday.",
      "publishedAt": "2023-07-23T00:25:36Z",
      "title": "Biden will establish a national monument honoring Emmett Till, the Black teen lynched in Mississippi",
      "url": "https://apnews.com/6d26b248f906a4ce5654cb2f11c9ffa2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/25ebbc7dd8fd4c8aaab49460057f070e/3000.jpeg"
    },
    {
      "author": "JAMIE STENGLE",
      "description": "DALLAS (AP) — As the Taliban swept back into power in Afghanistan in the summer of 2021, Fahima Sultani and her fellow university students tried for days to get into the Kabul airport, only to be turned away by gun-wielding extremists.",
      "publishedAt": "2023-07-23T04:12:32Z",
      "title": "Scholarships have helped displaced Afghan students find homes on university campuses across the US",
      "url": "https://apnews.com/e3cb49e48533e8c9c4e03ef49a26a6f7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e13776dc93ab4b819aa3cd873252ee1b/3000.jpeg"
    },
    {
      "author": "STEVE PEOPLES",
      "description": "HUDSON, N.H. (AP) — They acknowledge Donald Trump's dominance, but weary Republicans across New Hampshire — even inside the governor's office — are fighting to stop the former president from winning the first-in-the-nation primary.",
      "publishedAt": "2023-07-22T04:11:20Z",
      "title": "Nervous Republicans turn to New Hampshire in hopes of stopping Trump",
      "url": "https://apnews.com/cee250b2171b68c2da79b1bbb8454deb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/a721c43925fe4fe2ab31a55ebc99acb3/3000.jpeg"
    },
    {
      "author": "SETH BORENSTEIN",
      "description": "The summer of 2023 is behaving like a broken record about broken records.Nearly every major climate-tracking organization proclaimed June the hottest June ever. Then July 4 became the globe's hottest day, albeit unofficially, according to the University of Maine’s Climate Reanalyzer.",
      "publishedAt": "2023-07-22T08:47:09Z",
      "title": "Sick of hearing about record heat? Scientists say those numbers paint the story of a warming world",
      "url": "https://apnews.com/7bcb569321504065cbf2356a34ba8902",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/986e98c022064517b091d4198bf20ba4/3000.jpeg"
    },
    {
      "author": null,
      "description": "WASHINGTON CROSSING, Pa. (AP) — The family of a 2-year-old girl swept away along with another child by a flash flood that engulfed their vehicle on a Pennsylvania road is expressing gratitude at the discovery of a body believed to be hers.",
      "publishedAt": "2023-07-22T16:26:27Z",
      "title": "Family expresses gratitude after body believed to be missing girl found; search for boy continues",
      "url": "https://apnews.com/712cb269f23ab6facaddb8cc39369026",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2130a0125fb349a5b9dc812621a575ba/3000.jpeg"
    },
    {
      "author": "MATTHEW BROWN",
      "description": "BILLINGS, Mont. (AP) — A health clinic in a Montana town plagued by deadly asbestos contamination must pay the government almost $6 million in penalties and damages after it submitted hundreds of false asbestos claims, a judge ruled.",
      "publishedAt": "2023-07-22T23:24:24Z",
      "title": "Judge orders Montana health clinic to pay nearly $6 million over false asbestos claims",
      "url": "https://apnews.com/15dce72a91072e3131cf23494d3dd4f6",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/17ce41377e6e4e789a937e4a9925a3c8/2243.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}