{
  "articles": [
    {
      "author": "MEG KINNARD and WILL WEISSERT",
      "description": "WASHINGTON (AP) — Nikki Haley has won the Republican primary in the District of Columbia, notching her first victory of the 2024 campaign.Her victory Sunday at least temporarily halts Donald Trump’s sweep of the GOP voting contests, although the former president is likely to pick up several hundred more delegates in this week’s Super Tuesday races.",
      "publishedAt": "2024-03-04T01:46:09Z",
      "title": "Nikki Haley wins the District of Columbia’s Republican primary and gets her first 2024 victory",
      "url": "https://apnews.com/7b5eec7a5398379b0f1c9ed9f50b6ce3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/887c5edddbbe4071b4f11cc34f2ccb8b/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Congressional leaders on Sunday came out with a package of six bills setting full-year spending levels for some federal agencies, a step forward in a long overdue funding process beset by sharp political divisions between the two parties as well as infighting among House Republicans.",
      "publishedAt": "2024-03-03T22:55:25Z",
      "title": "Congressional leaders come out with 6 spending bills in a drive to avoid a partial shutdown",
      "url": "https://apnews.com/e813a4321d7f61b3ad173d06f651ca13",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/416fe11498ab4030b349f540ce2c3c5b/3000.jpeg"
    },
    {
      "author": "TIA GOLDENBERG, WAFAA SHURAFA and SAMY MAGDY",
      "description": "TEL AVIV, Israel (AP) — Prime Minister Benjamin Netanyahu rebuked a top Cabinet minister arriving in Washington on Sunday for talks with U.S. officials, according to an Israeli official, signaling widening cracks within the country’s leadership nearly five months into its war with Hamas.",
      "publishedAt": "2024-03-03T11:50:29Z",
      "title": "Rival of Netanyahu visits US, signaling wider cracks in Israel’s wartime leadership",
      "url": "https://apnews.com/3193becf71b8e5a533d38be7973795e7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/1be8797d056f4aefb1509db40a8f9ef5/3000.jpeg"
    },
    {
      "author": "VALERIE GONZALEZ",
      "description": "McALLEN, Texas (AP) — Planes dropped fire retardant over the Texas Panhandle on Sunday and a small community was ordered to evacuate as firefighters kept up efforts to stamp out the largest wildfire in state history while contending with new blazes.",
      "publishedAt": "2024-03-03T21:45:14Z",
      "title": "Firefighters keep up battle to stamp out largest wildfire in Texas history",
      "url": "https://apnews.com/f17c261779831c22bb1487f3f5b0bd69",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/3e9803b808fe49e09250bebc7bdd840b/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — A Supreme Court decision could come as soon as Monday in the case about whether former President Donald Trump can be kicked off the ballot over his efforts to undo his defeat in the 2020 election.",
      "publishedAt": "2024-03-03T18:16:35Z",
      "title": "A Supreme Court decision could come Monday in a case about barring Trump from the 2024 ballot",
      "url": "https://apnews.com/d784759ab9376d4c3a6e3ae72465f448",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4913e5ff250b4ade971c32f599ef785a/3000.jpeg"
    },
    {
      "author": "HYUNG-JIN KIM",
      "description": "SEOUL, South Korea (AP) — South Korea’s government began steps Monday to suspend the medical licenses of thousands of striking junior doctors, days after they missed a government-set deadline to end their joint walkouts, which have severely impacted hospital operations.",
      "publishedAt": "2024-03-04T04:42:03Z",
      "title": "South Korea takes steps to suspend licenses of striking doctors after they refuse to end walkouts",
      "url": "https://apnews.com/ca9f3e96de730b4f29d6e55f940b305f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50d78891a3f64559916157f1d3a603ca/1920.jpeg"
    },
    {
      "author": "KIM CHANDLER",
      "description": "SELMA, Ala. (AP) — Vice President Kamala Harris told thousands gathered for the 59th anniversary of the Bloody Sunday attacks on civil rights marchers in Selma, Alabama, that fundamental freedoms, including the right to vote, are under attack in America even today.",
      "publishedAt": "2024-03-03T05:01:51Z",
      "title": "Kamala Harris leads Bloody Sunday memorial as marchers' voices ring out for voting rights",
      "url": "https://apnews.com/dd03b6cc8e68e42ac89e1c9d641c12b9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5960a37df784b18b4faaf6b8d25bbda/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "CAPE CANAVERAL, Fla. (AP) — Four astronauts headed to the International Space Station on Sunday where they will oversee the arrivals of two new rocketships during their half-year stint.SpaceX’s Falcon rocket blasted off from Kennedy Space Center, carrying NASA’s Matthew Dominick, Michael Barratt and Jeanette Epps and Russia’s Alexander Grebenkin.",
      "publishedAt": "2024-03-04T03:55:18Z",
      "title": "4 new astronauts head to the International Space Station for a 6-month stay",
      "url": "https://apnews.com/f8d61b5b432f2b6bb7a3084e47c84d7a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/912305d525bb48e9b16cb7dd28952162/3000.jpeg"
    },
    {
      "author": "EVENS SANON and PIERRE-RICHARD LUXAMA",
      "description": "PORT-AU-PRINCE, Haiti (AP) — Haiti's government declared a state of emergency and nighttime curfew late Sunday in a bid to regain control of the streets after an explosion of violence over the weekend saw armed gang members storm the country's two biggest prisons.",
      "publishedAt": "2024-03-03T15:39:55Z",
      "title": "Haiti declares a curfew as it tries to restore order after weekend jailbreak, explosion of violence",
      "url": "https://apnews.com/2788f145b0d26efc2aa199e923724e0f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f437685d4baf4661b3dd5fcfafa8adba/1920.jpeg"
    },
    {
      "author": "ERIC OLSON",
      "description": "Caitlin Clark stood alone at the free-throw line on Sunday and made the foul shots that put her atop the all-time NCAA Division I scoring chart.The flash and pizzazz of her game have made her the biggest name in all of college basketball.",
      "publishedAt": "2024-03-03T13:10:20Z",
      "title": "Iowa's Caitlin Clark breaks Pete Maravich's NCAA Division I scoring record",
      "url": "https://apnews.com/8d2a9bc33a9fdc59177a5ca4fe7221a9",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/50cf42cebc1440989fe32d2f85adcf2d/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}