{
  "articles": [
    {
      "author": "HANNAH SCHOENBAUM",
      "description": "SALT LAKE CITY (AP) — A common line of questions has emerged from visitors to Utah's Arches National Park in the week since an iconic rock arch at Lake Powell known as the “Toilet Bowl” collapsed.",
      "publishedAt": "2024-08-16T04:03:14Z",
      "title": "The collapse of an iconic arch in Utah has some wondering if other famous arches are also at risk",
      "url": "https://apnews.com/7e4b3c9966b488ca5b3d9ca00b8db702",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/06a65f4f67c94c0f8515aa9df1ef7aad/3000.jpeg"
    },
    {
      "author": "ROBERT YOON",
      "description": "WASHINGTON (AP) — Once more, with feeling!It’s been nearly two weeks since Vice President Kamala Harris officially won the Democratic presidential nomination in an online vote, the first time a nominee was named prior to a party's convention.",
      "publishedAt": "2024-08-18T17:29:54Z",
      "title": "Convention delegates will nominate Harris, again. This time, the pizzazz will be back",
      "url": "https://apnews.com/ae2fc83930d90d43863588264c465cee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/84e23ef25fee4bc8bfa44710aa11814a/3000.jpeg"
    },
    {
      "author": "MATTHEW LEE",
      "description": "TEL AVIV, Israel (AP) — U.S. Secretary of State Antony Blinken will use his ninth diplomatic mission to the Middle East since the start of the Israel-Hamas war to press for the quick conclusion of an elusive ceasefire agreement.",
      "publishedAt": "2024-08-18T16:26:16Z",
      "title": "Blinken, on ninth Mideast trip since Gaza war began, seeks ceasefire momentum as talks to resume",
      "url": "https://apnews.com/a022fea284a40272e65f3ba7752eb9fb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/b123bca03adc4a24af1423d13f877f24/3000.jpeg"
    },
    {
      "author": "WAFAA SHURAFA and SAMY MAGDY",
      "description": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes across Gaza killed 29 people overnight and into Sunday, including young quintuplets, local health officials said, as U.S. Secretary of State Antony Blinken arrived in the region to try to seal a cease-fire deal after months of negotiations.",
      "publishedAt": "2024-08-18T06:33:39Z",
      "title": "Quintuplets among Gaza's dead as Blinken visits the region to seek a cease-fire deal",
      "url": "https://apnews.com/4059985bff76d459360f17e8319633c7",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/21784e692f1c47d798b9980efe7e7a1f/1920.jpeg"
    },
    {
      "author": null,
      "description": "KYIV, Ukraine (AP) — Ukraine has destroyed a key bridge in Russia's Kursk region and struck a second one nearby, disrupting supply lines as it pressed a stunning cross-border incursion that began Aug.",
      "publishedAt": "2024-08-18T11:12:29Z",
      "title": "Ukrainian forces strike 2 key bridges in Russia's Kursk area in a possible sign they intend to stay",
      "url": "https://apnews.com/43d6579c82c24ffc5cfabd99d07c66db",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf9c3337d8554a8395e7e61cfc437794/1920.jpeg"
    },
    {
      "author": "DARLENE SUPERVILLE",
      "description": "WASHINGTON (AP) — Democratic presidential nominee Kamala Harris and running mate Tim Walz embarked on a bus tour in southwestern Pennsylvania on Sunday, hoping to ride a wave of enthusiasm for her candidacy to their party's nominating convention in Chicago this week.",
      "publishedAt": "2024-08-18T11:22:53Z",
      "title": "Harris and Walz embark on a bus tour in Pennsylvania before the Democratic convention in Chicago",
      "url": "https://apnews.com/2fa74e23e4cd21218f61f6c6595a577c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4da9819019384a50a405c18f7a988924/3000.jpeg"
    },
    {
      "author": "RON TODT",
      "description": "Tropical Storm Ernesto churned away from Bermuda on Sunday and headed further out in the northeastern Atlantic, but it still sent powerful swells toward the U.S.",
      "publishedAt": "2024-08-18T15:52:14Z",
      "title": "Tropical Storm Ernesto sends powerful swells, rip currents to US East Coast",
      "url": "https://apnews.com/a9260c6c35d380854c22635ac12ec8bb",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0422e159f6a84ad3a20c97030b8460b8/3000.jpeg"
    },
    {
      "author": "SAMY MAGDY",
      "description": "CAIRO (AP) — Sudan has been stricken by a cholera outbreak that has killed nearly two dozen people and sickened hundreds more in recent weeks, health authorities said Sunday. The African nation has been roiled by a 16-month conflict and devastating floods.",
      "publishedAt": "2024-08-18T16:58:36Z",
      "title": "Cholera outbreak in Sudan has killed at least 22 people, health minister says",
      "url": "https://apnews.com/046f27a435816dd0838eade09dbec4ab",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/bd71e20f0c7645c0bb75ff6d64a4df3f/2500.jpeg"
    },
    {
      "author": "MATT BROWN",
      "description": "ATLANTA (AP) — Every Monday evening, the Andrew and Walter Young Family YMCA basement becomes a sanctuary for men who, local leaders say, have too often been denied one.The Black Man Lab, which for nearly a decade has sought weekly to create a “safe, sacred and healing space” for Black men in metropolitan Atlanta, regularly gathers more than 100 men to pray, meditate and talk through challenges and triumphs they are facing and learn from peers and elders.",
      "publishedAt": "2024-08-18T14:35:06Z",
      "title": "Black men emerge as key constituency in 2024 race, bringing dynamic views to the top of politics",
      "url": "https://apnews.com/b719055efc229dccc8d84466d9ed6e90",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f6c8576b374f4193988dc392e09e68c2/3000.jpeg"
    },
    {
      "author": "STEPHANY MATAT",
      "description": "HOLEY LAND WILDLIFE MANAGEMENT AREA, Fla. (AP) — It's after midnight when the windshield fogs up on Thomas Aycock's F-250 pickup truck. He flashes a low smile as he slowly maneuvers through the sawgrass, down dirt roads deep in the Florida Everglades.",
      "publishedAt": "2024-08-18T04:29:23Z",
      "title": "A hunter’s graveyard shift: grabbing pythons in the Everglades",
      "url": "https://apnews.com/6838af6afed7eedf875a06482c362156",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/295bade288b1476c9050be64f229e736/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}