{
  "articles": [
    {
      "author": "WAFAA SHURAFA, SAMY MAGDY, TIA GOLDENBERG",
      "description": "The deadline for the start of a ceasefire in the Gaza Strip has passed. Israeli Prime Minister Benjamin Netanyahu said Sunday that Hamas had not lived up to its commitment to provide the names of the three hostages it was set to release later on Sunday in exchange for scores of Palestinian prisoners. Rear Adm. Daniel Hagari, the top Israeli military spokesman, said the army “continues to attack” and would until Hamas complies with the agreement. Hamas blamed the delay in handing over the names on “technical field reasons.” An Israeli official said mediators have provided assurances that the list will be delivered and the deal is still expected to go forward, though the timing remains in question.",
      "publishedAt": "2025-01-19T05:44:46Z",
      "title": "Gaza ceasefire delayed until Hamas provides names of first hostages, Israel says",
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-19-2025-437f7f1bf49c9d2936718cf78bdf272c",
      "urlToImage": "https://dims.apnews.com/dims4/default/7e7a25d/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff7%2F9c%2Fccafde69596b4a8791084575fd05%2Ff65c384dd88b4224a130e71d6f4cb61c"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "The Israeli military says it “continues to attack” inside the Gaza Strip as a dispute with Hamas delayed the start of a planned ceasefire. Rear Adm. Daniel Hagari, the military’s chief spokesman, said the truce would not begin until Hamas hands over the names of three hostages to be released later on Sunday, echoing an earlier statement from Prime Minister Benjamin Netanyahu. The truce had been set to go into effect at 8:30 a.m. local time. Hamas blamed the delay in handing over the names on “technical field reasons.” It said in a statement that it is committed to the ceasefire deal announced last week. The ceasefire was set to pause the fighting after 15 months of war.",
      "publishedAt": "2025-01-19T06:54:42Z",
      "title": "Middle East latest: Gaza ceasefire is delayed over dispute between Hamas and Israel",
      "url": "https://apnews.com/article/israel-hamas-war-syria-lebanon-news-01-19-2025-20ce56a41464067b9b2df4c9dca38e1d",
      "urlToImage": "https://dims.apnews.com/dims4/default/2dc6e4b/2147483647/strip/true/crop/5429x3054+0+283/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe2%2Fc1%2F8219e2516604b1fc58cd9a9519a0%2F56b58d3240ee400287373798b8663382"
    },
    {
      "author": "MELANIE LIDMAN",
      "description": "The ceasefire between Israel and Hamas is set to begin on Sunday, pausing the devastating 15-month war between Israel and the militant Hamas group in the Gaza Strip. The deal is the most significant breakthrough in the war, but its implementation is complex and fragile. It requires cooperation between Palestinian militant groups, the International Red Cross, the Israeli military, mediators from multiple countries and an Israeli government whose coalition is starting to fray as hard-line ministers express their disapproval.",
      "publishedAt": "2025-01-18T22:16:15Z",
      "title": "What to know about the ceasefire between Israel and Hamas",
      "url": "https://apnews.com/article/israel-gaza-hamas-war-ceasefire-hostages-qatar-prisoners-c707fef6191db7223a6d313a12c46d41",
      "urlToImage": "https://dims.apnews.com/dims4/default/c27ed15/2147483647/strip/true/crop/2084x1172+0+108/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F03%2Fb6%2Ff0beb1a59ade6d9bb13c6c62815b%2F32f9d31bfa444cbca0354cc24f4c5ccf"
    },
    {
      "author": null,
      "description": "Satellite images provide one way to get a sense of the devastating impact of the war on the Gaza Strip.",
      "publishedAt": "2025-01-16T18:13:00Z",
      "title": "Satellite photos show Gaza Strip before and after devastation caused by Israel-Hamas war",
      "url": "https://apnews.com/video/israel-hamas-war-gaza-strip-israel-war-and-unrest-israel-government-1cb57c51fde84517ab281d38128c0b0a",
      "urlToImage": "https://dims.apnews.com/dims4/default/379a0b4/2147483647/strip/true/crop/1280x720+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F31%2F962274f84aa08303f97b14a618ed%2Ftrumphushmoneylive1.png"
    },
    {
      "author": "DARLENE SUPERVILLE, ADRIANA GOMEZ LICON",
      "description": "As Trump prepares to return to the White House, his family circle looks a little different than it did eight years ago. His youngest son, Barron, was in fifth grade when Trump's first administration began. He's now a college freshman. One of Trump's granddaughters is an aspiring social media influencer. Trump has tapped the fathers of his two sons-in-law for administration jobs. The president-elect has five children from his marriages to Ivana Trump, Marla Maples and current wife Melania Trump. He has 10 grandkids, and an 11th is on the way.",
      "publishedAt": "2025-01-18T12:27:06Z",
      "title": "Inside Trump's family circle as he returns to the White House",
      "url": "https://apnews.com/article/trump-family-then-now-white-house-add4a5054a88bd084392fbf92354977e",
      "urlToImage": "https://dims.apnews.com/dims4/default/1d343bd/2147483647/strip/true/crop/4215x2371+0+220/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Faf%2Fc1%2Fd7d81ae8764eac368c14337059ee%2Fcbb03f448af74653acad44cc43f687cc"
    },
    {
      "author": "HEATHER HOLLINGSWORTH, MARK THIESSEN",
      "description": "Many families in California are full of grief and questions about what more they could have done to save their loved ones from the deadly wildfires. Experts say these survivors are victims themselves. The fires that swept through the Los Angeles area this month were fast-moving and fierce and there just wasn't more they could do. But that doesn’t ease the pain or the questions for the families of the more than two dozen killed, some unable to escape, others unaware of what was coming, having survived other blazes unscathed. Despite reassurances, they can't help but second-guess if they could have done more.",
      "publishedAt": "2025-01-19T06:04:17Z",
      "title": "Families of wildfire victims mired in grief, questioning what more could have been done",
      "url": "https://apnews.com/article/los-angeles-california-wildfires-3a20ed3149cfeebd91dd462fb64ebb51",
      "urlToImage": "https://dims.apnews.com/dims4/default/9a83e6b/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F45%2F8d%2F2bfd3f70d6a722d9393ef24f3d35%2F931d1a10a50341fdb765d190e541b64e"
    },
    {
      "author": "THE ASSOCIATED PRESS",
      "description": "A senior Taliban figure says the group's leader should scrap education bans on Afghan women and girls. The government has barred females from education after sixth grade, including university. In remarks made Saturday, Sher Abbas Stanikzai, political deputy at the Foreign Ministry, said there was no excuse for denying education to women and girls, “just as there was no justification for it in the past and there shouldn’t be one at all.” The U.N. has said that official recognition of the Taliban government is almost impossible while bans on education and employment remain.",
      "publishedAt": "2025-01-19T07:18:07Z",
      "title": "Taliban deputy tells leader there is no excuse for education bans on Afghan women and girls",
      "url": "https://apnews.com/article/afghanistan-taliban-girls-education-ban-9842e738a55454d21b6eeb05ba819d2f",
      "urlToImage": "https://dims.apnews.com/dims4/default/244c64d/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2Fcb%2Fda6211826b85015087b32302b035%2F02c9fa42dd4a491fb8df13b88ad6670b"
    },
    {
      "author": "HALELUYA HADERO",
      "description": "Millions of TikTok users in the United States are no longer able to watch videos on the social media platform as a federal ban on the immensely popular app takes effect. The company’s app was removed Saturday evening from prominent app stores, including the ones operated by Apple and Google, while its website told users that the short-form video platform was no longer available. The blackout began just hours before the law took effect.",
      "publishedAt": "2025-01-19T04:00:45Z",
      "title": "TikTok ban takes effect in the US",
      "url": "https://apnews.com/article/tiktok-ban-trump-biden-china-bdc79b7ce741a81761f67ea56d410103",
      "urlToImage": "https://dims.apnews.com/dims4/default/3a10aa3/2147483647/strip/true/crop/7237x4071+0+366/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2F3c%2F3cd26eaf3cf0e1ee427e16bb6063%2Ff9683bfdcdd24f338c9fab4ef5a83d6b"
    },
    {
      "author": "MICHELLE L. PRICE",
      "description": "Donald Trump is headed back to Washington to kick off days of pageantry heralding his second inauguration as president. Trump departed from his adopted home state of Florida on Saturday afternoon with his wife Melania and son Barron an fly to the nation's capital. He will attend an evening reception and fireworks show at Trump National Golf Club in Sterling, Virginia. On Sunday, Trump is scheduled to participate in a wreath-laying ceremony at Arlington National Cemetery before heading to a rally at Capital One Arena in Washington. On Monday, he will be sworn in inside the Capitol because of the cold weather.",
      "publishedAt": "2025-01-18T05:04:58Z",
      "title": "Donald Trump heads to Washington for inaugural celebrations",
      "url": "https://apnews.com/article/trump-inauguration-return-to-washington-1389014f70bd04793a8dbc83048bba07",
      "urlToImage": "https://dims.apnews.com/dims4/default/9bcb107/2147483647/strip/true/crop/5555x3125+0+289/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F92%2F5a%2F2c45b71fe70e31051804a82f195a%2F93ade4d718044edeb629aaf9472904f3"
    },
    {
      "author": "MATT BROWN",
      "description": "Events honoring Martin Luther King Jr.’s legacy and advocating for his vision of a just, nonviolent society will occur the same day as Donald Trump's second presidential inauguration. The coincidence has been met with mixed feelings by civil rights leaders who broadly reviled Trump’s rhetoric and stances on race and civil rights during his third presidential campaign. But many leaders, including King’s own family, see the juxtaposition as an opportunity to reflect and refocus the work of advancing civil rights in a new political era.",
      "publishedAt": "2025-01-19T06:00:20Z",
      "title": "Civil rights leaders and King family mark MLK Day as a special call to action as Trump takes office",
      "url": "https://apnews.com/article/trump-inauguration-martin-luther-king-mlk-day-e1825a6ddefba06c71d1157bef893261",
      "urlToImage": "https://dims.apnews.com/dims4/default/8191b4a/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F44%2F81%2F644df495f2793f00787180cc0a69%2F23927aef0a324fe29e14ed2fdd4e6a4b"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}