{
  "articles": [
    {
      "author": "NAJIB JOBAIN, BASSEM MROUE and SAMY MAGDY",
      "description": "KHAN YOUNIS, Gaza Strip (AP) — Hundreds of patients, medical staff and people displaced by Israel's war against Hamas left Gaza’s largest hospital Saturday, with one evacuee describing a panicked and chaotic scene as Israeli forces searched and face-scanned men among those leaving and took some away.",
      "publishedAt": "2023-11-18T08:15:49Z",
      "title": "Patients and staff leave Gaza's biggest hospital, and dozens are killed at a crowded refugee camp",
      "url": "https://apnews.com/5ffcdeeca3eb3dbcd8af8d207a8e4a4a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/5d9d333e4940494882e6c5df744dc94e/3000.jpeg"
    },
    {
      "author": "LOLITA C. BALDOR",
      "description": "WASHINGTON (AP) — Iranian-backed militants in Iraq and Syria have long battled with U.S. and coalition forces, launching sporadic attacks against bases in the region where troops are deployed to fight Islamic State group insurgents.",
      "publishedAt": "2023-11-18T05:13:42Z",
      "title": "How the US strikes a delicate balance in responding to attacks on its forces by Iran-backed militias",
      "url": "https://apnews.com/c6b8a0b82698d113ac32619ab1adfc01",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f83def7c4bd44782b09cd363a629debc/3000.jpeg"
    },
    {
      "author": "LISA MASCARO",
      "description": "WASHINGTON (AP) — By most accounts, Speaker Mike Johnson inherited a House Republican majority in disarray after the sudden ouster of his predecessor last month.",
      "publishedAt": "2023-11-18T13:27:09Z",
      "title": "Tempers flare and bills languish as Speaker Johnson confronts the same problems that vexed McCarthy",
      "url": "https://apnews.com/afb4c4602375383a7dc1c649eeb4e5aa",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/36da4d3d2cd040f8a8d763ab7a185f64/3000.jpeg"
    },
    {
      "author": "HANNAH FINGERHUT, JILL COLVIN and THOMAS BEAUMONT",
      "description": "FORT DODGE, Iowa (AP) — Former President Donald Trump celebrated a win in a closely watched election case during a return visit to Iowa Saturday, where he blasted his political foes and encouraged his supporters to not move past their grievances with President Joe Biden.",
      "publishedAt": "2023-11-18T05:10:07Z",
      "title": "Trump celebrates win in Colorado election case during return visit to Iowa",
      "url": "https://apnews.com/1c5d38574010a66d094df41d7c34b6e2",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/2e42d192a48d44e097946c534ab8d9af/3000.jpeg"
    },
    {
      "author": "GENE JOHNSON and ED KOMENDA",
      "description": "SEATTLE (AP) — The suspicious letters sent to vote centers and government buildings in six states this month were undeniably scary, some containing traces of fentanyl or white powder, accompanied by not-so-veiled threats and dubious political symbols.",
      "publishedAt": "2023-11-18T05:24:29Z",
      "title": "Officials stock up on overdose antidote naloxone after fentanyl-laced letters disrupt vote counting",
      "url": "https://apnews.com/163d2073f22995f479ffb87559811fee",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4b4957fb8c14c308943008c4102d45c/3000.jpeg"
    },
    {
      "author": "ALI SWENSON and MICHAEL KUNZELMAN",
      "description": "The man who bludgeoned former House Speaker Nancy Pelosi's husband with a hammer last year consumed a steady diet of right-wing conspiracy theories before an attack that took place with the midterm elections less than two weeks away.",
      "publishedAt": "2023-11-18T15:08:16Z",
      "title": "Fears of political violence are growing as the 2024 campaign heats up and conspiracy theories evolve",
      "url": "https://apnews.com/390ad310fa34b0edb925d88540a7ddcd",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/f345436417b945eb8d94edf1b39f4122/3000.jpeg"
    },
    {
      "author": "HANNA ARHIROVA",
      "description": "KYIV, Ukraine (AP) — When Tymofii Postoiuk and his friends set up an online fundraising effort for Ukraine, donations poured in from around the globe, helping to purchase essential equipment for Ukrainian armed forces.",
      "publishedAt": "2023-11-18T05:46:14Z",
      "title": "The world's attention is on Gaza, and Ukrainians worry war fatigue will hurt their cause",
      "url": "https://apnews.com/94b6351b05178078dddc027f188526b3",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/ac8c38691cb74e959105e59f6dbd364a/3000.jpeg"
    },
    {
      "author": "MARCIA DUNN",
      "description": "SpaceX launched its mega rocket Starship but lost both the booster and the spacecraft in a pair of explosions minutes into Saturday’s test flight. The rocketship reached space following liftoff from South Texas before communication suddenly was lost.",
      "publishedAt": "2023-11-18T11:45:29Z",
      "title": "SpaceX launched its giant new rocket but explosions end the second test flight",
      "url": "https://apnews.com/37c0893ddf605270b16a33ae64d69a85",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e09d186813ef43ea8b9ee108c5cd9dad/3000.jpeg"
    },
    {
      "author": "DIANE JEANTET",
      "description": "RIO DE JANEIRO (AP) — Taylor Swift postponed an Eras Tour concert in Rio de Janeiro Saturday after a 23-year-old fan died during her Friday night show, according to a message posted on the singer's Instagram.",
      "publishedAt": "2023-11-18T13:32:10Z",
      "title": "Taylor Swift postpones Rio de Janeiro show, citing record heat a day after fan dies during concert",
      "url": "https://apnews.com/b69ad355301a7ae6edebd3255c94a167",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/d7809969ac10471a8bc15b4c4300ede5/3000.jpeg"
    },
    {
      "author": "MATT O'BRIEN",
      "description": "Country singers, romance novelists, video game artists and voice actors are appealing to the U.S. government for relief — as soon as possible — from the threat that artificial intelligence poses to their livelihoods.",
      "publishedAt": "2023-11-18T14:00:27Z",
      "title": "'Please regulate AI:' Artists push for U.S. copyright reforms but tech industry says not so fast",
      "url": "https://apnews.com/b456fa19dd90bea87533f97f043a31bc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/08cce904d97046079e409198d8142a54/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}