{
  "articles": [
    {
      "author": "MICHELLE L. PRICE, HANNAH FINGERHUT and WILL WEISSERT",
      "description": "DES MOINES, Iowa (AP) — Donald Trump and his top rivals for the GOP presidential nomination took the stage one by one Friday night to address an influential gathering of Iowa Republicans, with none of the top-tier hopefuls mentioning that new federal charges had been filed against the former president just a day earlier.",
      "publishedAt": "2023-07-28T04:08:32Z",
      "title": "Trump and his top 2024 primary rivals mostly ignore the case against him during key Iowa GOP event",
      "url": "https://apnews.com/5ac4475b203c6d833729b15c31482273",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4713bbb280a342928eea0f2972abc585/3000.jpeg"
    },
    {
      "author": "JUAN A. LOZANO and BEN FINLEY",
      "description": "HOUSTON (AP) — Just moments before rap superstar Travis Scott took the stage at the deadly 2021 Astroworld festival, a contract worker had been so worried about what might happen after seeing people getting crushed that he texted an event organizer saying, “Someone’s going to end up dead,” according to a police report released Friday.",
      "publishedAt": "2023-07-28T20:39:33Z",
      "title": "Worker warned organizer 'Someone’s going to end up dead' before crowd surge at '21 Travis Scott show",
      "url": "https://apnews.com/4df425940590b0472b33dc6173857d8e",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/e295c022cb6f49cea3c957ab13e11a98/3000.jpeg"
    },
    {
      "author": "MARY CLARE JALONICK",
      "description": "WASHINGTON (AP) — Senate Republican Leader Mitch McConnell has repeatedly said he is “fine” since he froze up midsentence during a press conference on Wednesday.",
      "publishedAt": "2023-07-28T17:30:19Z",
      "title": "Sen. McConnell plans to serve his full term as Republican leader despite questions about his health",
      "url": "https://apnews.com/07bdd2f78545b92bb8d2dd32395ff956",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/88bc55ae88fe4538a7cfb5fb6387dcfb/3000.jpeg"
    },
    {
      "author": "ERIC TUCKER and ALANNA DURKIN RICHER",
      "description": "WASHINGTON (AP) — It’s a stunning new allegation in an already serious case: Former President Donald Trump sought to delete Mar-a-Lago surveillance footage to obstruct the Justice Department’s investigation into his handling of classified documents.",
      "publishedAt": "2023-07-29T04:19:14Z",
      "title": "Fresh charges tie Trump even more closely to coverup effort. That could deepen his legal woes",
      "url": "https://apnews.com/eb6f5c62094690fcb2f652673fb9df58",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/0fe015d827b64a39b8cf4302f4fea650/3000.jpeg"
    },
    {
      "author": "MARK SHERMAN",
      "description": "WASHINGTON (AP) — Justice Samuel Alito says Congress lacks the power to impose a code of ethics on the Supreme Court, making him the first member of the court to take a public stand against proposals in Congress to toughen ethics rules for justices in response to increased scrutiny of their activities beyond the bench.",
      "publishedAt": "2023-07-28T20:54:57Z",
      "title": "Justice Alito says Congress lacks the power to impose an ethics code on the Supreme Court",
      "url": "https://apnews.com/d98b0edf1340ff3ed66b345c5ddcf0dc",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fa941221f7aa4541bbbaf0726e64595c/3000.jpeg"
    },
    {
      "author": "SUDHIN THANAWALA",
      "description": "ATLANTA (AP) — Authorities in Alabama said Friday they filed criminal charges against a woman who confessed to fabricating a story that she was kidnapped after stopping to check on a toddler she saw walking on the side of an interstate highway.",
      "publishedAt": "2023-07-28T18:10:42Z",
      "title": "Alabama authorities charge Carlee Russell for fabricating story about kidnapping, finding toddler",
      "url": "https://apnews.com/49a21032a9a514da6a77eca29838a6d1",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/337b732a8cd349498ad4ddf4148acebe/1920.jpeg"
    },
    {
      "author": "CHRISTINE FERNANDO",
      "description": "CHICAGO (AP) — Leading up to the 2020 election, Facebook ads targeting Latino and Asian American voters described Joe Biden as a communist. A local station claimed a Black Lives Matter co-founder practiced witchcraft.",
      "publishedAt": "2023-07-29T04:08:44Z",
      "title": "Election disinformation campaigns targeted voters of color in 2020. Experts expect 2024 to be worse",
      "url": "https://apnews.com/712a5c5a9b72c1668b8c9b1eb6e0038a",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/fd33edf4c4d54c9c97f372314eb91dc9/3000.jpeg"
    },
    {
      "author": "NOMAAN MERCHANT and TARA COPP",
      "description": "WASHINGTON (AP) — A top Pentagon official has attacked this week's widely watched congressional hearing on UFOs, calling the claims “insulting” to employees who are investigating sightings and accusing a key witness of not cooperating with the official U.S.",
      "publishedAt": "2023-07-29T01:06:15Z",
      "title": "The UFO congressional hearing was 'insulting' to US employees, a top Pentagon official says",
      "url": "https://apnews.com/631ad4d174ee9559580935ec11afcf3f",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/4e31abd0b0a740f4b19cb17935cbb5ae/3000.jpeg"
    },
    {
      "author": "KEVIN FREKING",
      "description": "WASHINGTON (AP) — Lawmakers broke for their August recess this week with work on funding the government largely incomplete, fueling worries about whether Congress will be able to avoid a partial government shutdown this fall.",
      "publishedAt": "2023-07-29T04:10:52Z",
      "title": "Members of Congress break for August with no clear path to avoiding a shutdown this fall",
      "url": "https://apnews.com/aea04e44447fcb8a818a01a54854ac12",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/eeff30be93614c75b7984987af845cab/3000.jpeg"
    },
    {
      "author": "JANIE HAR and HAVEN DALEY",
      "description": "SAN FRANCISCO (AP) — The city of San Francisco has opened a complaint and launched an investigation into a giant “X” sign that was installed Friday on top of the downtown building formerly known as Twitter headquarters as owner Elon Musk continues his rebrand of the social media platform.",
      "publishedAt": "2023-07-29T00:12:08Z",
      "title": "'X' logo installed atop Twitter building, spurring San Francisco to investigate permit violation",
      "url": "https://apnews.com/4e0ae2a3b1b838b744bb2dc494f5b23c",
      "urlToImage": "https://storage.googleapis.com/afs-prod/media/26fd4adfcfd845bfabab55219e0dd856/3000.jpeg"
    }
  ],
  "sortBy": "top",
  "source": "associated-press",
  "status": "ok"
}